{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-100-sets-board-meeting-date-to-consider-fundraising-shares-hit-10-upper-price-band-11725960729659.html","title":"Small-cap stock below  ₹100 sets board meeting date to consider fundraising. Shares hit 10% upper circuit","description":"Small-cap stock: Mercury Ev-Tech's share price surged 10% to  ₹76.34, ending a two-day decline after announcing fundraising plans. The board will meet on September 13 to discuss raising funds through convertible equity warrants or preferential shares. The stock has risen over 70% in the past year.","content":"Small-cap stock: Mercury Ev-Tech share price jumped 10 per cent to hit its upper price band in intraday trade on Tuesday, September 10, after the company announced its fundraising plans. The stock opened at  ₹69.50 against its precious close of  ₹69.40 and jumped 10 per cent to its upper price band of  ₹76.34.The company said its board of directors will meet on September 13 to consider fundraising via convertible equity warrants and/or by preferential share allotment.\"We would like to inform you that the meeting of the board of directors of the company will be held on Friday, September 13, to consider the raising of funds by way of the issue of convertible equity warrants and/or equity shares on preferential basis subject to approvals of the members and other statutory/regulatory approvals,\" said Mercury Ev-Tech in the BSE filing.The trading window will be closed from Tuesday, September 10, until 48 hours after the board meeting on Friday, September 13.The small-cap stock has seen a significant rise of 90 per cent over the last one year. It hit its 52-week high of  ₹143.80 on December 13 last year and its 52-week low of  ₹40.98 on September 11 last year.Meanwhile, the Indian stock market benchmarks, the Sensex and the Nifty 50, rose about half per cent each in intraday trade on Tuesday. Investors' focus is now on the US inflation data on Wednesday to gauge the size of the Fed rate cut this month.The market has discounted a 25 bps rate cut this time. Experts believe that a rate cut in sync with market expectations may not give a fresh boost to the market. However, if the Fed decides to go for a 50 bps cut, it may trigger a fresh up move in the market.Read all market-related news here","cleaned_content":"small cap stock mercury ev tech share price jumped \u003cONE_TEN_PERCENT\u003e to hit its upper price band in intraday trade on tuesday september \u003cONE_TEN\u003e after the company announced its fundraising plans the stock opened at \u003cSIX_TEN\u003e against its precious close of \u003cSIX_TEN\u003e and jumped \u003cONE_TEN_PERCENT\u003e to its upper price band of \u003cSEVEN_TEN\u003e the company said its board of directors will meet on september \u003cONE_TEN\u003e to consider fundraising via convertible equity warrants and or by preferential share allotment we would like to inform you that the meeting of the board of directors of the company will be held on friday september \u003cONE_TEN\u003e to consider the raising of funds by way of the issue of convertible equity warrants and or equity shares on preferential basis subject to approvals of the members and other statutory regulatory approvals said mercury ev tech in the bse filing the trading window will be closed from tuesday september \u003cONE_TEN\u003e until \u003cFOUR_TEN\u003e hours after the board meeting on friday september \u003cONE_TEN\u003e the small cap stock has seen a significant rise of \u003cNINE_TEN_PERCENT\u003e over the last one year it hit its \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e on december \u003cONE_TEN\u003e last year and its \u003cFIVE_TEN\u003e week low of \u003cFOUR_TEN\u003e on september \u003cONE_TEN\u003e last year meanwhile the indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e rose about half per cent each in intraday trade on tuesday investors focus is now on the us inflation data on wednesday to gauge the size of the fed rate cut this month the market has discounted a \u003cTWO_TEN\u003e bps rate cut this time experts believe that a rate cut in sync with market expectations may not give a fresh boost to the market however if the fed decides to go for a \u003cFIVE_TEN\u003e bps cut it may trigger a fresh up move in the market read all market related news here","timestamp":"2024-09-10T15:15:00+05:30","market_timestamp":"2024-09-10T15:15:00+05:30","off_market_hours":false}