{"url":"https://www.livemint.com/market/stock-market-news/pradhin-share-price-rs-50-smallcap-stock-hits-upper-circuit-for-second-straight-session-details-here-11725946553170.html","title":"Pradhin share price:  ₹50 smallcap stock hits upper circuit for second straight session. Details here","description":"Pradhin share is a penny stock and is up over 7% in one month. The microcap stock has given more than 21% returns year-to-date (YTD).","content":"Pradhin share price was locked in at 5% upper circuit of  ₹50.77 apiece on the BSE Tuesday after the company announced the import of aromatic chemicals from Thailand, in its largest ever order. Pradhin stock price hit upper circuit for the second straight session.The company said it will import Aromatic Chemicals from Python Chemical Company Ltd, Thailand. The order value is  ₹400 crore and is the largest order in the company’s history.The order represents a significant step forward in Pradhin’s strategic growth and expansion into new markets. The imported chemicals will be sold to major perfume factories located in Kannauj, the company said.“The Company anticipates that this transaction will open new avenues for growth. Based on the demand and profitability of this chemical in the Indian market, Pradhin Ltd. plans to explore the possibility of importing other complex chemicals in the future. This strategic move aligns with our ongoing efforts to diversify our product offerings and capitalize on emerging opportunities in the Indian chemical industry,” Pradhin Ltd said in a BSE filing.The company believes this venture will not only strengthen its foothold in the aromatic chemical sector but also pave the way for future collaborations with global suppliers, thereby boosting its business prospects and shareholder value.Pradhin share is a penny stock and is up over 7% in one month. The microcap stock has given more than 21% returns year-to-date (YTD).At 11:10 am, Pradhin shares were still locked at 5% upper circuit at  ₹50.78 apiece on the BSE. The company has a market capitalisation of  ₹18.53 crore.","cleaned_content":"pradhin share price was locked in at \u003cFIVE_PERCENT\u003e upper circuit of \u003cFIVE_TEN\u003e apiece on the bse tuesday after the company announced the import of aromatic chemicals from thailand in its largest ever order pradhin stock price hit upper circuit for the second straight session the company said it will import aromatic chemicals from python chemical company ltd thailand the order value is \u003cFOUR_HUNDRED\u003e crore and is the largest order in the company s history the order represents a significant step forward in pradhin s strategic growth and expansion into new markets the imported chemicals will be sold to major perfume factories located in kannauj the company said the company anticipates that this transaction will open new avenues for growth based on the demand and profitability of this chemical in the indian market pradhin ltd plans to explore the possibility of importing other complex chemicals in the future this strategic move aligns with our ongoing efforts to diversify our product offerings and capitalize on emerging opportunities in the indian chemical industry pradhin ltd said in a bse filing the company believes this venture will not only strengthen its foothold in the aromatic chemical sector but also pave the way for future collaborations with global suppliers thereby boosting its business prospects and shareholder value pradhin share is a penny stock and is up over \u003cSEVEN_PERCENT\u003e in one month the microcap stock has given more than \u003cTWO_TEN_PERCENT\u003e returns year to date ytd at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am pradhin shares were still locked at \u003cFIVE_PERCENT\u003e upper circuit at \u003cFIVE_TEN\u003e apiece on the bse the company has a market capitalisation of \u003cONE_TEN\u003e crore","timestamp":"2024-09-10T11:12:00+05:30","market_timestamp":"2024-09-10T11:12:00+05:30","off_market_hours":false}