{"url":"https://www.livemint.com/market/stock-market-news/premier-energies-stock-plunges-on-profit-booking-surges-181-from-ipo-price-heres-why-11725963351151.html","title":"Premier Energies stock plunges on profit-booking, surges 181% from IPO price; here’s why","description":"The stock started the day on a positive note, however, turned red during the intraday day session. Since listing, the Premier Energies shares have surged as much as 181 per cent over the IPO price of  ₹450.","content":"Premier Energies share price saw a 12 per cent decline on Tuesday's trading session to record-high to  ₹1,267.95 per share, after the stock continued to rally for eight session straight.The stock started the day on a positive note, however, turned red during the intraday day session. Since listing, the Premier Energies shares have surged as much as 181 per cent over the IPO price of  ₹450.Such spectacular profits, however, were quickly followed by a wave of profit booking at the counter, which caused it to plunge more than 6 per cent into the sea of losses. Premier Energies' stock price was  ₹1,140.50 on the NSE at 1:25 PM.Notwithstanding this, the company's prognosis is still positive. Also, the business just secured a  ₹215 crore order. With a complete 5-year guarantee, the Uttar Pradesh Department of Agriculture granted the contract for the supply, installation, and commissioning of 8,085 solar water pumping systems throughout the state's districts. By March 2025, the order is expected to be finished.A draft set of guidelines for an authorized list of solar cell models and manufacturers (ALMM) was also announced by the Ministry of New and Renewable Energy (MNRE) over the weekend, raising expectations that the company will profit from it starting in April 2026.The company produces integrated solar cells and panels, offering a product range that includes cells, solar modules, monofacial and bifacial modules, as well as EPC (Engineering, Procurement, and Construction) and O\u0026M (Operations and Maintenance) solutions.Premier Energies' promising growth prospects have attracted significant attention from institutional investors. High-profile names like Blackrock, Nomura, Abu Dhabi Investment Authority, DSP India, Morgan Stanley, HDFC Mutual Fund, ICICI Mutual Fund, and PNB Paribas all participated in the company's IPO anchor book, further fueling its post-listing rally.This remarkable listing result was in line with the pre-listing excitement, which was generated by the company's solid financial position, enthusiastic investor base, and advantageous market circumstances.","cleaned_content":"premier energies share price saw a \u003cONE_TEN_PERCENT\u003e decline on tuesdays trading session to record high to \u003cONE_THOUSAND\u003e per share after the stock continued to rally for eight session straight the stock started the day on a positive note however turned red during the intraday day session since listing the premier energies shares have surged as much as \u003cONE_HUNDRED_PERCENT\u003e over the ipo price of \u003cFOUR_HUNDRED\u003e such spectacular profits however were quickly followed by a wave of profit booking at the counter which caused it to plunge more than \u003cSIX_PERCENT\u003e into the sea of losses premier energies stock price was \u003cONE_THOUSAND\u003e on the nse at \u003cONE_\u003e \u003cTWO_TEN\u003e pm notwithstanding this the companys prognosis is still positive also the business just secured a \u003cTWO_HUNDRED\u003e crore order with a complete \u003cFIVE_\u003e year guarantee the uttar pradesh department of agriculture granted the contract for the supply installation and commissioning of \u003cEIGHT_THOUSAND\u003e solar water pumping systems throughout the states districts by march \u003cTWO_THOUSAND\u003e the order is expected to be finished a draft set of guidelines for an authorized list of solar cell models and manufacturers almm was also announced by the ministry of new and renewable energy mnre over the weekend raising expectations that the company will profit from it starting in april \u003cTWO_THOUSAND\u003e the company produces integrated solar cells and panels offering a product range that includes cells solar modules monofacial and bifacial modules as well as epc engineering procurement and construction and o m operations and maintenance solutions premier energies promising growth prospects have attracted significant attention from institutional investors high profile names like blackrock nomura abu dhabi investment authority dsp india morgan stanley hdfc mutual fund icici mutual fund and pnb paribas all participated in the companys ipo anchor book further fueling its post listing rally this remarkable listing result was in line with the pre listing excitement which was generated by the companys solid financial position enthusiastic investor base and advantageous market circumstances","timestamp":"2024-09-10T16:27:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}