{"url":"https://www.livemint.com/market/stock-market-news/axis-mutual-fund-launches-nifty-500-value-50-etf-for-long-term-wealth-creation-11725956562396.html","title":"Axis Mutual Fund to launch Nifty 500 Value 50 ETF for long-term wealth creation","description":"Axis Mutual Fund is set to launch a new exchange-traded fund (ETF) that aims to replicate the performance of the Nifty500 Value 50 Index.","content":"The ETF will offer investors the opportunity for long-term wealth creation by following a passive investment approach. It seeks to achieve returns that correspond to the Nifty500 Value 50 TRI, albeit with some tracking errors. As noted in the Scheme Information Document (SID), the ETF’s objective is “to provide returns before expenses that correspond to Nifty500 Value 50 TRI, subject to tracking errors.”As volatility continues to affect global and domestic markets, Axis Mutual Fund's introduction of the Nifty500 Value 50 ETF is critical when investors seek stable, value-driven investment options. According to the SID, the Nifty500 Value 50 Index tracks companies that have been selected based on their “Earnings to Price ratio (E/P), Book Value to Price ratio (B/P), Sales to Price ratio (S/P), and Dividend Yield,” the company said in the statement.With the increasing interest in value stocks, this ETF offers a timely opportunity for investors who aim to balance risk while targeting long-term returns. The document stated that the scheme seeks to provide returns before expenses that closely correspond to the Nifty500 Value 50 TRI Index, subject to tracking errors​.The Axis Nifty500 Value 50 ETF will be listed on the National Stock Exchange (NSE) and the Bombay Stock Exchange (BSE), giving investors easy access to buy and sell units on trading days at market prices. The SID explains, “The units of the scheme may be bought or sold on all trading days at prevailing price on such Stock Exchange(s),” as quoted in the document.Additionally, for larger institutional investors, the ETF “offers units for subscription/redemption directly with the AMC in Creation Unit Size... at Intraday NAV based prices”. This setup, combined with zero entry or exit loads, allows retail and large-scale investors to participate at low costs while maintaining liquidity.","cleaned_content":"the etf will offer investors the opportunity for long term wealth creation by following a passive investment approach it seeks to achieve returns that correspond to the nifty500 value \u003cFIVE_TEN\u003e tri albeit with some tracking errors as noted in the scheme information document sid the etf s objective is to provide returns before expenses that correspond to nifty500 value \u003cFIVE_TEN\u003e tri subject to tracking errors as volatility continues to affect global and domestic markets axis mutual funds introduction of the nifty500 value \u003cFIVE_TEN\u003e etf is critical when investors seek stable value driven investment options according to the sid the nifty500 value \u003cFIVE_TEN\u003e index tracks companies that have been selected based on their earnings to price ratio e p book value to price ratio b p sales to price ratio s p and dividend yield the company said in the statement with the increasing interest in value stocks this etf offers a timely opportunity for investors who aim to balance risk while targeting long term returns the document stated that the scheme seeks to provide returns before expenses that closely correspond to the nifty500 value \u003cFIVE_TEN\u003e tri index subject to tracking errors the axis nifty500 value \u003cFIVE_TEN\u003e etf will be listed on the national stock exchange nse and the bombay stock exchange bse giving investors easy access to buy and sell units on trading days at market prices the sid explains the units of the scheme may be bought or sold on all trading days at prevailing price on such stock exchange s as quoted in the document additionally for larger institutional investors the etf offers units for subscription redemption directly with the amc in creation unit size at intraday nav based prices this setup combined with zero entry or exit loads allows retail and large scale investors to participate at low costs while maintaining liquidity","timestamp":"2024-09-10T14:46:00+05:30","market_timestamp":"2024-09-10T14:46:00+05:30","off_market_hours":false}