{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-gmr-airports-adani-green-dixon-tech-suzlon-energy-and-more-11725906393244.html","title":"Stocks to Watch: GMR Airports, Adani Green, Dixon Tech, Suzlon Energy, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"DHFL: The Delhi High Court granted bail to Dheeraj Wadhwan, former director of Dewan Housing Finance Limited (DHFL), on health grounds in connection with a multi-crore bank fraud case. Justice Sudhir Kumar Jain approved the bail after reviewing Wadhwan's health condition, labeling him a \"sick person.\" The decision comes after the trial court had previously denied his bail plea.GMR Airports: GMR Airports Infrastructure Ltd announced plans to increase its stake in Delhi International Airport Ltd to 74 percent by acquiring an additional 10 percent from Fraport AG for $126 million. The deal, subject to approvals from the Airports Authority of India and shareholders, is expected to close within 180 days.Adani Green Energy: Adani Green Energy Ltd (AGEL) fully redeemed its USD 750 million Holdco Notes ahead of the September 2024 maturity date. These bonds, issued in 2021 at a 4.375 percent interest rate, were instrumental in funding AGEL's expansion, with its energy capacity growing from 3.5 GW to 11.2 GW over three years, representing a 48 percent CAGR.Dixon Technologies: HP India is collaborating with Dixon Technologies’ subsidiary, Padget Electronics, to manufacture notebooks, desktops, and all-in-one PCs in Chennai under the PLI 2.0 scheme. This new facility aims to produce up to 2 million units annually and generate 1,500 jobs.Adani Power: The Adani Group has alerted Bangladesh’s interim government about $500 million in overdue payments related to a power project, potentially escalating tensions amid Bangladesh’s financial challenges. The country’s power liabilities now total $3.7 billion, with a significant portion owed to Adani Power.Suzlon Energy: Suzlon has secured a 1,166 MW wind project in Gujarat with NTPC Green Energy Limited, involving the installation of 370 wind turbines. This deal contributes to NTPC’s goal of adding 60 GW of renewable energy by 2032, bringing Suzlon’s order book to nearly 5 GW.Bank of Baroda: The bank raised  ₹5,000 crore through a 10-year infrastructure bond issue, which was oversubscribed nearly three times. Priced at 7.26 percent, the issuance exhausts the bank’s approved limit for infrastructure bonds, though room remains for future raises via tier I or tier II bonds.Infosys: SEBI lifted restrictions on 16 entities, including former Infosys employees, involved in an insider trading case. The prohibition on six entities, imposed by interim and confirmatory orders, was vacated, concluding the matter.","cleaned_content":"dhfl the delhi high court granted bail to dheeraj wadhwan former director of dewan housing finance limited dhfl on health grounds in connection with a multi crore bank fraud case justice sudhir kumar jain approved the bail after reviewing wadhwans health condition labeling him a sick person the decision comes after the trial court had previously denied his bail plea gmr airports gmr airports infrastructure ltd announced plans to increase its stake in delhi international airport ltd to \u003cSEVEN_TEN_PERCENT\u003e by acquiring an additional \u003cONE_TEN_PERCENT\u003e from fraport ag for \u003cONE_HUNDRED\u003e million the deal subject to approvals from the airports authority of india and shareholders is expected to close within \u003cONE_HUNDRED\u003e days adani green energy adani green energy ltd agel fully redeemed its usd \u003cSEVEN_HUNDRED\u003e million holdco notes ahead of the september \u003cTWO_THOUSAND\u003e maturity date these bonds issued in \u003cTWO_THOUSAND\u003e at a \u003cFOUR_PERCENT\u003e interest rate were instrumental in funding agels expansion with its energy capacity growing from \u003cTHREE_\u003e gw to \u003cONE_TEN\u003e gw over three years representing a \u003cFOUR_TEN_PERCENT\u003e cagr dixon technologies hp india is collaborating with dixon technologies subsidiary padget electronics to manufacture notebooks desktops and all in one pcs in chennai under the pli \u003cTWO_\u003e scheme this new facility aims to produce up to \u003cTWO_\u003e million units annually and generate \u003cONE_THOUSAND\u003e jobs adani power the adani group has alerted bangladesh s interim government about \u003cFIVE_HUNDRED\u003e million in overdue payments related to a power project potentially escalating tensions amid bangladesh s financial challenges the country s power liabilities now total \u003cTHREE_\u003e billion with a significant portion owed to adani power suzlon energy suzlon has secured a \u003cONE_THOUSAND\u003e mw wind project in gujarat with ntpc green energy limited involving the installation of \u003cTHREE_HUNDRED\u003e wind turbines this deal contributes to ntpc s goal of adding \u003cSIX_TEN\u003e gw of renewable energy by \u003cTWO_THOUSAND\u003e bringing suzlon s order book to nearly \u003cFIVE_\u003e gw bank of baroda the bank raised \u003cFIVE_THOUSAND\u003e crore through a \u003cONE_TEN\u003e year infrastructure bond issue which was oversubscribed nearly three times priced at \u003cSEVEN_PERCENT\u003e the issuance exhausts the bank s approved limit for infrastructure bonds though room remains for future raises via tier i or tier ii bonds infosys sebi lifted restrictions on \u003cONE_TEN\u003e entities including former infosys employees involved in an insider trading case the prohibition on six entities imposed by interim and confirmatory orders was vacated concluding the matter","timestamp":"2024-09-10T08:24:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}