{"url":"https://www.livemint.com/market/stock-market-news/action-construction-equipment-midcap-defence-stock-snaps-four-day-losing-streak-on-govt-order-win-stock-up-76-in-1-yr-11725973175519.html","title":"Midcap defence stock snaps four-day losing streak on govt order win, stock up 76% in one year; Buy or sell?","description":"Action Construction Equipment Share Price Today: Shares of the midcap defence stock snapped its four-day losing streak on Tuesday after receiving orders from the defence ministry","content":"Action Construction Equipment Share Price Today: Shares of Action Construction Equipment Ltd snapped their four-day losing streak on Tuesday, September 10, after receiving new work orders from the Ministry of Defence. The midcap construction machinery manufacturing company's stock price has risen nearly 76 per cent in the last one year on growth prospects from orders.“We wish to inform that in our endeavour to expand business in the Defence Sector, Action Construction Equipment Limited has been awarded with a prestigious order from the Ministry of Defence for the supply of 99 forklifts. This order demonstrates our efforts under the “Make in India” and “AatmaNirbhar Bharat” initiatives of the Government of India,” Action Construction Equipment said in a regulatory filing to the stock exchanges.Also Read: HAL, BEL, Mazagon, Cochin Shipyards other Multibagger Defence stocks see up to 24% correction in a month . Buy or Sell?In a press statement, India’s largest crane company and leading construction equipment and manufacturing company said it secured an order of 99 special forklifts with a three-tonne lifting capacity from the Ministry of Defence. As per the recent agreement, the pipeline will deliver 285 specialized forklifts and six rough terrain cranes with a 30-ton lifting capacity.“This order from the Ministry of Defence is a strong endorsement of the reliability and performance of our equipment. It underscores our commitment to contributing to India’s strategic objectives under the ‘Make in India’ and ‘AatmaNirbhar Bharat’ initiatives,'' said Dharmendra Singhal, Head of Institutional Sales at Action Construction Equipment.Also Read: Defence ministry approves 10 capital acquisitions including Dornier-228 aircraft, FRCV worth  ₹1.45 lakh crore“We received work orders valuing  ₹66 crore approximately in just a month, which shows strong potential for our business in this area,” he added. The company added in its statement that the forklifts and rough terrain cranes will be deployed to enhance the defence ministry's operational capabilities, offering robust and durable solutions for various critical applications.In the last three months, shares of the midcap stock have declined over 13 per cent. However, in the last one year, the company has delivered over 76 per cent returns to investors, against Nifty 50's returns of 26.34 per cent.In the last three years, Action Construction Equipment has delivered massive multibagger returns of 432.93 per cent, far outperforming Nifty 50 and Sensex that gave 44.17 per cent and 40.5 per cent returns respectively.On Tuesday, shares of Action Construction Equipment opened at  ₹1,258.65 and gained around two per cent to hit an intra day high of  ₹1,278.15 apiece on the BSE. Shares settled 2.28 per cent higher at  ₹1,263.75 apiece on the BSE.Also Read: Stock market today: Nifty 50 closes above 25,000, Sensex nears 82,000; IT stocks drive rallyFrontline indices Sensex and Nifty 50 closed with decent gains led by select heavyweights across segments, such as Bharti Airtel, Infosys, TCS, Axis Bank and NTPC. Sensex closed with a gain of 362 points, or 0.44 per cent, at 81,921.29. The Nifty 50 closed 105 points, or 0.42 per cent, higher at 25,041.10, with 34 stocks in the green.Action Construction Equipment Ltd. has an average target of  ₹1,546.50. The consensus estimate of domestic brokerages represents an upside of 22.42 per cent from the last price of  ₹1,263.30. Brokerage ICICIDirect has a ‘buy’ rating on the midcap stock and estimates a potential upside of 24,67 per cent at a target price of  ₹1,575.Also Read: IT services cos to report operating profit margin at 22% in FY25, revenue growth muted; Coforge, LTIMindree rise 4-5%Action Construction Equipments Ltd. was incorporated in 1995 and is involved in the manufacturing of hydraulic mobile cranes, mobile tower cranes, truck-mounted cranes, material handling equipment like forklifts, road construction equipment like backhoe loaders, compactors, motor graders, and agriculture equipment like tractors and harvesters.The company offers a wide range of forklifts designed to meet the varying needs of diverse industries. Its forklifts can handle capacities from 1.5 to 16 tons for light to heavy-duty tasks. The company strives to provide purpose-built forklifts for each unique application, backed by a commitment to quality and customer satisfaction.","cleaned_content":"action construction equipment share price today shares of action construction equipment ltd snapped their four day losing streak on tuesday september \u003cONE_TEN\u003e after receiving new work orders from the ministry of defence the midcap construction machinery manufacturing companys stock price has risen nearly \u003cSEVEN_TEN_PERCENT\u003e in the last one year on growth prospects from orders we wish to inform that in our endeavour to expand business in the defence sector action construction equipment limited has been awarded with a prestigious order from the ministry of defence for the supply of \u003cNINE_TEN\u003e forklifts this order demonstrates our efforts under the make in india and aatmanirbhar bharat initiatives of the government of india action construction equipment said in a regulatory filing to the stock exchanges also read hal bel mazagon cochin shipyards other multibagger defence stocks see up to \u003cTWO_TEN_PERCENT\u003e correction in a month buy or sell in a press statement india s largest crane company and leading construction equipment and manufacturing company said it secured an order of \u003cNINE_TEN\u003e special forklifts with a three tonne lifting capacity from the ministry of defence as per the recent agreement the pipeline will deliver \u003cTWO_HUNDRED\u003e specialized forklifts and six rough terrain cranes with a \u003cTHREE_TEN\u003e ton lifting capacity this order from the ministry of defence is a strong endorsement of the reliability and performance of our equipment it underscores our commitment to contributing to india s strategic objectives under the make in india and aatmanirbhar bharat initiatives said dharmendra singhal head of institutional sales at action construction equipment also read defence ministry approves \u003cONE_TEN\u003e capital acquisitions including dornier \u003cTWO_HUNDRED\u003e aircraft frcv worth \u003cONE_\u003e lakh crore we received work orders valuing \u003cSIX_TEN\u003e crore approximately in just a month which shows strong potential for our business in this area he added the company added in its statement that the forklifts and rough terrain cranes will be deployed to enhance the defence ministrys operational capabilities offering robust and durable solutions for various critical applications in the last three months shares of the midcap stock have declined over \u003cONE_TEN_PERCENT\u003e however in the last one year the company has delivered over \u003cSEVEN_TEN_PERCENT\u003e returns to investors against nifty \u003cFIVE_TEN\u003e s returns of \u003cTWO_TEN_PERCENT\u003e in the last three years action construction equipment has delivered massive multibagger returns of \u003cFOUR_HUNDRED_PERCENT\u003e far outperforming nifty \u003cFIVE_TEN\u003e and sensex that gave \u003cFOUR_TEN_PERCENT\u003e and \u003cFOUR_TEN_PERCENT\u003e returns respectively on tuesday shares of action construction equipment opened at \u003cONE_THOUSAND\u003e and gained around two per cent to hit an intra day high of \u003cONE_THOUSAND\u003e apiece on the bse shares settled \u003cTWO_PERCENT\u003e higher at \u003cONE_THOUSAND\u003e apiece on the bse also read stock market today nifty \u003cFIVE_TEN\u003e closes above \u003cTWO_TEN_THOUSAND\u003e sensex nears \u003cEIGHT_TEN_THOUSAND\u003e it stocks drive rallyfrontline indices sensex and nifty \u003cFIVE_TEN\u003e closed with decent gains led by select heavyweights across segments such as bharti airtel infosys tcs axis bank and ntpc sensex closed with a gain of \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e closed \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e with \u003cTHREE_TEN\u003e stocks in the green action construction equipment ltd has an average target of \u003cONE_THOUSAND\u003e the consensus estimate of domestic brokerages represents an upside of \u003cTWO_TEN_PERCENT\u003e from the last price of \u003cONE_THOUSAND\u003e brokerage icicidirect has a buy rating on the midcap stock and estimates a potential upside of \u003cTWO_THOUSAND_PERCENT\u003e at a target price of \u003cONE_THOUSAND\u003e also read it services cos to report operating profit margin at \u003cTWO_TEN_PERCENT\u003e in fy25 revenue growth muted coforge ltimindree rise \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e action construction equipments ltd was incorporated in \u003cONE_THOUSAND\u003e and is involved in the manufacturing of hydraulic mobile cranes mobile tower cranes truck mounted cranes material handling equipment like forklifts road construction equipment like backhoe loaders compactors motor graders and agriculture equipment like tractors and harvesters the company offers a wide range of forklifts designed to meet the varying needs of diverse industries its forklifts can handle capacities from \u003cONE_\u003e to \u003cONE_TEN\u003e tons for light to heavy duty tasks the company strives to provide purpose built forklifts for each unique application backed by a commitment to quality and customer satisfaction","timestamp":"2024-09-10T18:32:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}