{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-2-hits-upper-circuit-after-promoters-stake-raise-move-check-details-11725949047086.html","title":"Penny stock below  ₹2 hits upper and lower circuits after promoters’ stake raise news; check details","description":"Penny stock GACM Technologies experienced significant volatility during intraday trading on Tuesday, September 10, hitting both its upper and lower circuits of 5 per cent.","content":"Penny stock GACM Technologies experienced significant volatility during intraday trading on Tuesday, September 10, hitting both its upper and lower circuits of 5 per cent. The stock opened at  ₹1.44, down from its previous close of  ₹1.50, and surged 4.7 per cent to reach its upper price band of  ₹1.57. However, it also plummeted 4.7 per cent during the session, touching its lower circuit of  ₹1.43. Around 12:30 pm, the stock traded 2.67 per cent up at  ₹1.54.The stock rose on Tuesday, a day after the company announced in an exchange filing that the promoters and promoter groups intend to increase their stake in the company up to 13 per cent within the year.\"We are pleased to inform you that the promoters and promoter groups of the company intend to increase their stake in the company up to 13 per cent within the year. This strategic move reflects the promoters’ and promoter group’s strong confidence in the company’s growth prospects and commitment to enhancing shareholder value,\" GACM Technologies said in an exchange filing during market hours on Monday, September 9.\"The increased stake will further align the promoters’ interests with those of our valued investors, reinforcing our commitment to driving sustainable growth. The company remains focused on executing its strategic initiatives and delivering robust financial performance. This development is a testament to the promoters’ belief in the long-term vision and success of the company,\" it said.The stock, however, suffered a loss of 4.5 per cent on Monday, extending the losing run into the third consecutive session. The stock has jumped over 76 per cent in the last one year. It hit its 52-week high of  ₹2.52 on January 17 this year and its 52-week low of  ₹0.84 on September 11 last year.Meanwhile, the Indian stock market benchmarks- the Sensex and the Nifty 50, traded with healthy gains on Tuesday, rising over half a per cent each.Read all market-related news here","cleaned_content":"penny stock gacm technologies experienced significant volatility during intraday trading on tuesday september \u003cONE_TEN\u003e hitting both its upper and lower circuits of \u003cFIVE_PERCENT\u003e the stock opened at \u003cONE_\u003e down from its previous close of \u003cONE_\u003e and surged \u003cFOUR_PERCENT\u003e to reach its upper price band of \u003cONE_\u003e however it also plummeted \u003cFOUR_PERCENT\u003e during the session touching its lower circuit of \u003cONE_\u003e around \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e pm the stock traded \u003cTWO_PERCENT\u003e up at \u003cONE_\u003e the stock rose on tuesday a day after the company announced in an exchange filing that the promoters and promoter groups intend to increase their stake in the company up to \u003cONE_TEN_PERCENT\u003e within the year we are pleased to inform you that the promoters and promoter groups of the company intend to increase their stake in the company up to \u003cONE_TEN_PERCENT\u003e within the year this strategic move reflects the promoters and promoter group s strong confidence in the company s growth prospects and commitment to enhancing shareholder value gacm technologies said in an exchange filing during market hours on monday september \u003cNINE_\u003e the increased stake will further align the promoters interests with those of our valued investors reinforcing our commitment to driving sustainable growth the company remains focused on executing its strategic initiatives and delivering robust financial performance this development is a testament to the promoters belief in the long term vision and success of the company it said the stock however suffered a loss of \u003cFOUR_PERCENT\u003e on monday extending the losing run into the third consecutive session the stock has jumped over \u003cSEVEN_TEN_PERCENT\u003e in the last one year it hit its \u003cFIVE_TEN\u003e week high of \u003cTWO_\u003e on january \u003cONE_TEN\u003e this year and its \u003cFIVE_TEN\u003e week low of \u003cZERO_\u003e on september \u003cONE_TEN\u003e last year meanwhile the indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e traded with healthy gains on tuesday rising over half a per cent each read all market related news here","timestamp":"2024-09-10T12:50:00+05:30","market_timestamp":"2024-09-10T12:50:00+05:30","off_market_hours":false}