{"url":"https://www.livemint.com/market/stock-market-news/ireda-shares-rise-6-after-four-day-plunge-whats-driving-the-rally-11725967389864.html","title":"IREDA shares rise 6% after four-day plunge; What’s driving the rally?","description":"Over the past 12 months, the multibagger stock has surged by 291 percent, significantly outperforming Nifty, which rose by 28 percent during the same period.","content":"Shares of the Indian Renewable Energy Development Agency Ltd. (IREDA) jumped more than 6 percent on September 10, following the company's signing of a Memorandum of Understanding (MoU) with SJVN Ltd., GMR Energy Ltd., and their affiliates to collaborate on the development and execution of the 900 MW Upper Karnali hydroelectric project in Nepal.The company stated that this partnership seeks to strengthen regional energy security by developing renewable energy infrastructure.\"This collaboration not only accelerates the development of Nepal's hydropower sector but also strengthens regional energy cooperation, supporting our shared goal of sustainable growth,\" said Pradip Kumar Das, Chairman \u0026 Managing Director of IREDA.Whereas, SJVN stock also rallied over 6.29 per cent on Tuesday to close at  ₹134.15 per share. The company's market capitalization was  ₹52,325 crore, with 11.17 lakh shares traded, resulting in a turnover of  ₹14.63 crore on the BSE.“This is to inform that SJVN Limited (“Company”), GMR Upper Karnali Hydro Power Limited (“GMR”) and IREDA have signed a MoU for development of Upper Karnali Hydro Electric Project (900 MW) through JV Company in Nepal. The Company and GMR will hold 34% shareholding each and IREDA will have 5% shareholding in the proposed JV. The balance Equity will be held by NEA (Nepal Electricity Authority). The project shall be developed on BOOT basis with 25 years concessional period after commissioning. The approximate project cost shall be  ₹9,100 crore. The project is proposed to be funded through 70:30 Debt Equity ratio,” said SJVN in an exchange filing.IREDA is involved in promoting, developing, and providing financial assistance for projects focused on new and renewable energy sources, as well as energy efficiency and conservation. The company operates a 50 MW solar project located in Kasaragod, Kerala.Over the past 12 months, the multibagger stock has surged by 291 percent, significantly outperforming Nifty, which rose by 28 percent during the same period. Meanwhile, SJVN shares also saw a gain of over 3 percent, trading at approximately  ₹130.15 on the NSE.","cleaned_content":"shares of the indian renewable energy development agency ltd ireda jumped more than \u003cSIX_PERCENT\u003e on september \u003cONE_TEN\u003e following the companys signing of a memorandum of understanding mou with sjvn ltd gmr energy ltd and their affiliates to collaborate on the development and execution of the \u003cNINE_HUNDRED\u003e mw upper karnali hydroelectric project in nepal the company stated that this partnership seeks to strengthen regional energy security by developing renewable energy infrastructure this collaboration not only accelerates the development of nepals hydropower sector but also strengthens regional energy cooperation supporting our shared goal of sustainable growth said pradip kumar das chairman managing director of ireda whereas sjvn stock also rallied over \u003cSIX_PERCENT\u003e on tuesday to close at \u003cONE_HUNDRED\u003e per share the companys market capitalization was \u003cFIVE_TEN_THOUSAND\u003e crore with \u003cONE_TEN\u003e lakh shares traded resulting in a turnover of \u003cONE_TEN\u003e crore on the bse this is to inform that sjvn limited company gmr upper karnali hydro power limited gmr and ireda have signed a mou for development of upper karnali hydro electric project \u003cNINE_HUNDRED\u003e mw through jv company in nepal the company and gmr will hold \u003cTHREE_TEN_PERCENT\u003e shareholding each and ireda will have \u003cFIVE_PERCENT\u003e shareholding in the proposed jv the balance equity will be held by nea nepal electricity authority the project shall be developed on boot basis with \u003cTWO_TEN\u003e years concessional period after commissioning the approximate project cost shall be \u003cNINE_THOUSAND\u003e crore the project is proposed to be funded through \u003cSEVEN_TEN\u003e \u003cTHREE_TEN\u003e debt equity ratio said sjvn in an exchange filing ireda is involved in promoting developing and providing financial assistance for projects focused on new and renewable energy sources as well as energy efficiency and conservation the company operates a \u003cFIVE_TEN\u003e mw solar project located in kasaragod kerala over the past \u003cONE_TEN\u003e months the multibagger stock has surged by \u003cTWO_HUNDRED_PERCENT\u003e significantly outperforming nifty which rose by \u003cTWO_TEN_PERCENT\u003e during the same period meanwhile sjvn shares also saw a gain of over \u003cTHREE_PERCENT\u003e trading at approximately \u003cONE_HUNDRED\u003e on the nse","timestamp":"2024-09-10T17:24:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}