{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11725888840212.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today – IEX, Hindustan Unilever and JK Cement.","content":"Indian stock market: The Indian stock market benchmarks, the Sensex and the Nifty 50, posted solid gains on Monday. The Sensex closed at 81,560, marking an increase of 376 points or 0.46 percent, while the Nifty 50 ended the day at 24,936.40, up 84 points or 0.34 percent.“Nifty Index opened flattish and even though it broke its previous day’s low, it took support at 24750 zones. It recovered right from the start of the day and It formed a bullish candle on daily frame with support based buying. Now it has to cross and hold above 25000 zones for a bounce towards 25150 then 25250 zones whereas supports are placed at 24750 then 24650 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.India VIX was down by 6.44% from 15.22 to 14.24 levels. Volatility cooled off and paved way for buying at lower levels.On option front, Maximum Call OI is at 25000 then 25200 strike while Maximum Put OI is at 24000 then 24500 strike. Call writing is seen at 25400 then 24800 strike while Put writing is seen at 24900 then 24800 strike. Option data suggests a broader trading range in between 24500 to 25400 zones while an immediate range between 24800 to 25300 levels, Taparia said.On the Bank Nifty outlook, Taparia further added, “Bank Nifty Index opened on a flattish note and drifted lower towards 50370 zones in the initial hour of the session. However quick recovery was seen from lower levels and it gradually extended the momentum towards 51200 zones in the latter part of the day. It formed a Bullish Piercing pattern on daily scale as strong recovery was seen from lower zones and ended with gains of around 540 points near 51100 levels. Now it has to continue to hold above 50850 zones for a bounce towards 51500 then 51750 zones while on the downside support is seen at 50850 then 50500 levels.”Chandan Taparia has recommended three stocks to buy today, September 10. According to him, these stocks –IEX, Hindustan Unilever and JK Cement– are technically placed to see a decent upmove.IEX stock price has given trend line breakout on daily chart and holding well above the same. The MACD Indicator has given bullish crossover which could confirm the upward momentum, Taparia said.HUL stock has given Cup \u0026 Handle breakout on daily chart. Buying is visible across FMCG space which may support the ongoing up move. Momentum indicator RSI has turned up which suggests bullish momentum.JK Cement share price has given range breakout on daily chart; retested the same and inching higher. It has formed a strong bullish candle on daily scale. ADX Line has turned up and the Positive DI is well above the negative DI which suggests the up move has strength, he added.","cleaned_content":"indian stock market the indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e posted solid gains on monday the sensex closed at \u003cEIGHT_TEN_THOUSAND\u003e marking an increase of \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e while the nifty \u003cFIVE_TEN\u003e ended the day at \u003cTWO_TEN_THOUSAND\u003e up \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e nifty index opened flattish and even though it broke its previous day s low it took support at \u003cTWO_TEN_THOUSAND\u003e zones it recovered right from the start of the day and it formed a bullish candle on daily frame with support based buying now it has to cross and hold above \u003cTWO_TEN_THOUSAND\u003e zones for a bounce towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas supports are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl india vix was down by \u003cSIX_PERCENT\u003e from \u003cONE_TEN\u003e to \u003cONE_TEN\u003e levels volatility cooled off and paved way for buying at lower levels on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels taparia said on the bank nifty outlook taparia further added bank nifty index opened on a flattish note and drifted lower towards \u003cFIVE_TEN_THOUSAND\u003e zones in the initial hour of the session however quick recovery was seen from lower levels and it gradually extended the momentum towards \u003cFIVE_TEN_THOUSAND\u003e zones in the latter part of the day it formed a bullish piercing pattern on daily scale as strong recovery was seen from lower zones and ended with gains of around \u003cFIVE_HUNDRED\u003e points near \u003cFIVE_TEN_THOUSAND\u003e levels now it has to continue to hold above \u003cFIVE_TEN_THOUSAND\u003e zones for a bounce towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones while on the downside support is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels chandan taparia has recommended three stocks to buy today september \u003cONE_TEN\u003e according to him these stocks iex hindustan unilever and jk cement are technically placed to see a decent upmove iex stock price has given trend line breakout on daily chart and holding well above the same the macd indicator has given bullish crossover which could confirm the upward momentum taparia said hul stock has given cup handle breakout on daily chart buying is visible across fmcg space which may support the ongoing up move momentum indicator rsi has turned up which suggests bullish momentum jk cement share price has given range breakout on daily chart retested the same and inching higher it has formed a strong bullish candle on daily scale adx line has turned up and the positive di is well above the negative di which suggests the up move has strength he added","timestamp":"2024-09-10T06:20:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}