{"url":"https://www.livemint.com/market/stock-market-news/emerging-picks-anand-rathi-chooses-these-two-stocks-to-buy-in-september-11725893301004.html","title":"Stocks to buy: Anand Rathi chooses these two shares as emerging picks for September","description":"Brokerage firm Anand Rathi has picked two stocks -Cochin Shipyard and Clean Science \u0026 Tech - as emerging picks for the month of September.","content":"Stocks to buy: On Monday, September 9, Indian stock market benchmarks the Sensex and the Nifty 50 finished with strong gains. The Sensex closed at 81,560, rising by 376 points, or 0.46%, while the Nifty 50 increased by 84 points, or 0.34%, ending at 24,936.40.“The domestic benchmark indices opened on a negative note, in line with global cues. The Nifty started the day flat to negative and witnessed selling pressure in the first half. However, the index absorbed the weakness and rebounded in the second half, leading to a positive close at 24,936. The volatility index, INDIA VIX, cooled off by 6.43%, settling at 14.24, signaling a drop in market volatility. Technically, the index found support near the 34-DEMA, which is placed around the 24,720 level, and witnessed a pullback, leading to the formation of a green candle on the daily scale. However, the index is still positioned below the trend line resistance, which is around the 25,100 level. In the short term, any bounce near 25,100 should be seen as an opportunity to book profits.Bank Nifty opened on a negative note on Monday but, after initial volatility, the index recovered and settled the day on a positive note at 51,118. Technically, on the daily scale, the index formed a piercing line candle, indicating strength. If the index manages to hold today's low of around 50,370, a pullback rally towards 51,500-51,800 could be possible in the short term,\" said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd.Brokerage firm Anand Rathi has picked two stocks -Cochin Shipyard and Clean Science \u0026 Tech - as Emerging picks for the month of September.COCHINSHIP has been on a corrective mode since almost 3000 mark and recently went towards 1800 level. The stock was in red for eight consecutive weeks and now finally we are witnessing a reversal. There is a reversal candlestick pattern too on the daily chart which indicates possibility of pullback. Thus, we advise traders to go long in the stock in the range of 1950 – 1930 with a stop loss of 1790.Few weeks back, CLEAN confirmed a breakout above 1500 from bullish Cup and Handle pattern on weekly scale. After some upside, the stock has retested the breakout zone and has reversed from there. The support coincides with the placement of Ichimoku Cloud on weekly scale. Thus, we advise traders to go long in the stock in the near 1500 with a stop loss of 1370.","cleaned_content":"stocks to buy on monday september \u003cNINE_\u003e indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e finished with strong gains the sensex closed at \u003cEIGHT_TEN_THOUSAND\u003e rising by \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e while the nifty \u003cFIVE_TEN\u003e increased by \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e ending at \u003cTWO_TEN_THOUSAND\u003e the domestic benchmark indices opened on a negative note in line with global cues the nifty started the day flat to negative and witnessed selling pressure in the first half however the index absorbed the weakness and rebounded in the second half leading to a positive close at \u003cTWO_TEN_THOUSAND\u003e the volatility index india vix cooled off by \u003cSIX_PERCENT\u003e settling at \u003cONE_TEN\u003e signaling a drop in market volatility technically the index found support near the \u003cTHREE_TEN\u003e dema which is placed around the \u003cTWO_TEN_THOUSAND\u003e level and witnessed a pullback leading to the formation of a green candle on the daily scale however the index is still positioned below the trend line resistance which is around the \u003cTWO_TEN_THOUSAND\u003e level in the short term any bounce near \u003cTWO_TEN_THOUSAND\u003e should be seen as an opportunity to book profits bank nifty opened on a negative note on monday but after initial volatility the index recovered and settled the day on a positive note at \u003cFIVE_TEN_THOUSAND\u003e technically on the daily scale the index formed a piercing line candle indicating strength if the index manages to hold todays low of around \u003cFIVE_TEN_THOUSAND\u003e a pullback rally towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e could be possible in the short term said hrishikesh yedve avp technical and derivatives research at asit c mehta investment interrmediates ltd brokerage firm anand rathi has picked two stocks cochin shipyard and clean science tech as emerging picks for the month of september cochinship has been on a corrective mode since almost \u003cTHREE_THOUSAND\u003e mark and recently went towards \u003cONE_THOUSAND\u003e level the stock was in red for eight consecutive weeks and now finally we are witnessing a reversal there is a reversal candlestick pattern too on the daily chart which indicates possibility of pullback thus we advise traders to go long in the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e with a stop loss of \u003cONE_THOUSAND\u003e few weeks back clean confirmed a breakout above \u003cONE_THOUSAND\u003e from bullish cup and handle pattern on weekly scale after some upside the stock has retested the breakout zone and has reversed from there the support coincides with the placement of ichimoku cloud on weekly scale thus we advise traders to go long in the stock in the near \u003cONE_THOUSAND\u003e with a stop loss of \u003cONE_THOUSAND\u003e","timestamp":"2024-09-09T20:49:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}