{"url":"https://www.livemint.com/market/stock-market-news/hindustan-unilever-shares-hit-lifetime-high-jumps-3-whats-behind-the-rally-11725879344248.html","title":"Hindustan Unilever shares hit-lifetime high, jump 3%; What’s behind the rally?","description":"HUL share price finally closed 2.85 per cent higher at  ₹2,920 on September 9.","content":"FMCG major Hindustan Unilever (HUL) stock hits lifetime-high on Monday's trading session as the market responded positively to the Kwality Wall's maker's decision to assess future strategies for its ice cream division.On March 19, Unilever, HUL's parent company, revealed plans to separate its global ice cream business across various regions.HUL share price finally closed 2.85 per cent higher at  ₹2,920 on September 9. The stock has gained nearly 22.78 per cent in the last six months and around 15.13 per cent in one year on the National Stock Exchange (NSE).\"After due consideration, HUL's Board has decided to constitute a committee of Independent Directors of the Company (“Independent Committee”) to evaluate in detail the prospects of the Company’s Ice Cream business and to make recommendations to the Board,\" FMCG major said in an exchange filing.At the meeting, HUL's board approved the exploration of potential structures and alternatives for the initiative. Following the \"Independent Committee's\" recommendation, the matter will be presented for final review by the Audit Committee and the Board at their upcoming meetings, which will be scheduled in due course.HUL's positive momentum also propelled the Nifty FMCG index to a new all-time high, making it a standout in an otherwise subdued market. Other top performers on the FMCG index included United Breweries, Dabur India, United Spirits, and Marico.Brokerage firm Anand Rathi has assigned ‘buy’ rating with a target price of  ₹3,130 per share. “The company aims to maintain current EBITDA margins by expanding gross margins through better pricing, net productivity steps and continued investments in brands and capabilities,” the firm said in a note.Meanwhile, analysts at Motilal Oswal Financial Services project an acceleration in volume growth for FY25, fueled by internal initiatives and stronger demand trends. They anticipate revenue growth to reach high single digits in the second half of FY25, supported by both volume and price increases. With earnings on an upward trend, the brokerage firm maintains its outlook for a valuation re-rating.","cleaned_content":"fmcg major hindustan unilever hul stock hits lifetime high on mondays trading session as the market responded positively to the kwality walls makers decision to assess future strategies for its ice cream division on march \u003cONE_TEN\u003e unilever huls parent company revealed plans to separate its global ice cream business across various regions hul share price finally closed \u003cTWO_PERCENT\u003e higher at \u003cTWO_THOUSAND\u003e on september \u003cNINE_\u003e the stock has gained nearly \u003cTWO_TEN_PERCENT\u003e in the last six months and around \u003cONE_TEN_PERCENT\u003e in one year on the national stock exchange nse after due consideration huls board has decided to constitute a committee of independent directors of the company independent committee to evaluate in detail the prospects of the company s ice cream business and to make recommendations to the board fmcg major said in an exchange filing at the meeting huls board approved the exploration of potential structures and alternatives for the initiative following the independent committees recommendation the matter will be presented for final review by the audit committee and the board at their upcoming meetings which will be scheduled in due course huls positive momentum also propelled the nifty fmcg index to a new all time high making it a standout in an otherwise subdued market other top performers on the fmcg index included united breweries dabur india united spirits and marico brokerage firm anand rathi has assigned buy rating with a target price of \u003cTHREE_THOUSAND\u003e per share the company aims to maintain current ebitda margins by expanding gross margins through better pricing net productivity steps and continued investments in brands and capabilities the firm said in a note meanwhile analysts at motilal oswal financial services project an acceleration in volume growth for fy25 fueled by internal initiatives and stronger demand trends they anticipate revenue growth to reach high single digits in the second half of fy25 supported by both volume and price increases with earnings on an upward trend the brokerage firm maintains its outlook for a valuation re rating","timestamp":"2024-09-09T17:07:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}