{"url":"https://www.livemint.com/market/stock-market-news/bectors-food-shares-price-company-raises-4-000-crore-through-qip-aditya-birla-sun-life-axis-mutual-fund-singapore-11725941097774.html","title":"Mrs Bectors Food shares price surges over 4%, Company raises  ₹4,000 crore through QIP","description":"Mrs Bectors Food Specialities Limited has successfully raised a significant amount of capital through a Qualified Institutional Placement (QIP). The company issued new equity shares to a group of investors, including the Government of Singapore, mutual funds, and insurance companies.","content":"Mrs Bectors Food QIP Success: Mrs Bectors Food Specialities Limited has successfully raised  ₹400 crore through a Qualified Institutions Placement (QIP), according to an exchange filing on September 10. The company issued 25,80,645 new equity shares at  ₹1,550 per share, which includes a premium of  ₹1,540 per share. This capital-raising move has increased the company's paid-up equity share capital from  ₹58.81 crore to  ₹61.40 crore.Mrs. Bectors Food share price was trading in green, up 4.28 per cent, at  ₹1,778.55, on September 10, at 11:19 am. The company enjoys a market capitalisation of  ₹10,460.98 crore. Mrs Bectors Food's stock price is around 3.8 per cent away from its 52-week high of  ₹1,848.90 which it hit on September 6, 2024.The Fund Raise Committee of the company approved the allotment on Tuesday, September 10, 2024. The issue price represents a 1.77 percent discount to the floor price of  ₹1,577.85 per share, as determined by SEBI regulations.Among the major investors, the Government of Singapore emerged as the largest participant, acquiring 18.49 percent of the newly issued shares. Other significant investors included Manulife Global Fund - India Equity Fund (5.54 percent), The Prudential Assurance Company Limited (8.39 percent), and Arisaig Asia Fund Limited (9.12 percent).Several mutual funds also participated in the QIP, with SBI Multicap Fund and DSP funds each securing 6.25% of the issue. Aditya Birla Sun Life Trustee Private Limited, Canara Robeco Mutual Fund, Axis Mutual Fund, and Invesco India funds also made notable investments, each acquiring between 5.75% to 6.25% of the total shares issued.The company's disclosure to the stock exchanges stated, \"Pursuant to the allotment of Equity Shares under the QIP, the paid-up equity share capital of the Company stands increased from  ₹ 588.17 million consisting of 5,88,17,474 Equity Shares of face value of  ₹ 10/- each to  ₹ 613.98 million consisting of 6,13,98,119 Equity Shares of face value of  ₹ 10/- each.\"This capital raised is expected to strengthen Mrs Bectors Food Specialities Limited's financial position and support its growth initiatives. The company's shares are listed on both the BSE and the National Stock Exchange.The QIP, which opened on September 5, 2024, and closed on September 9, 2024, was conducted under Chapter VI of the SEBI (Issue of Capital and Disclosure Requirements) Regulations, 2018, and Sections 42 and 62 of the Companies Act, 2013.","cleaned_content":"mrs bectors food qip success mrs bectors food specialities limited has successfully raised \u003cFOUR_HUNDRED\u003e crore through a qualified institutions placement qip according to an exchange filing on september \u003cONE_TEN\u003e the company issued \u003cTWO_MILLION\u003e new equity shares at \u003cONE_THOUSAND\u003e per share which includes a premium of \u003cONE_THOUSAND\u003e per share this capital raising move has increased the companys paid up equity share capital from \u003cFIVE_TEN\u003e crore to \u003cSIX_TEN\u003e crore mrs bectors food share price was trading in green up \u003cFOUR_PERCENT\u003e at \u003cONE_THOUSAND\u003e on september \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am the company enjoys a market capitalisation of \u003cONE_TEN_THOUSAND\u003e crore mrs bectors foods stock price is around \u003cTHREE_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cONE_THOUSAND\u003e which it hit on september \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e the fund raise committee of the company approved the allotment on tuesday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the issue price represents a \u003cONE_PERCENT\u003e discount to the floor price of \u003cONE_THOUSAND\u003e per share as determined by sebi regulations among the major investors the government of singapore emerged as the largest participant acquiring \u003cONE_TEN_PERCENT\u003e of the newly issued shares other significant investors included manulife global fund india equity fund \u003cFIVE_PERCENT\u003e the prudential assurance company limited \u003cEIGHT_PERCENT\u003e and arisaig asia fund limited \u003cNINE_PERCENT\u003e several mutual funds also participated in the qip with sbi multicap fund and dsp funds each securing \u003cSIX_PERCENT\u003e of the issue aditya birla sun life trustee private limited canara robeco mutual fund axis mutual fund and invesco india funds also made notable investments each acquiring between \u003cFIVE_PERCENT\u003e to \u003cSIX_PERCENT\u003e of the total shares issued the companys disclosure to the stock exchanges stated pursuant to the allotment of equity shares under the qip the paid up equity share capital of the company stands increased from \u003cFIVE_HUNDRED\u003e million consisting of \u003cFIVE_TEN_MILLION\u003e equity shares of face value of \u003cONE_TEN\u003e each to \u003cSIX_HUNDRED\u003e million consisting of \u003cSIX_TEN_MILLION\u003e equity shares of face value of \u003cONE_TEN\u003e each this capital raised is expected to strengthen mrs bectors food specialities limiteds financial position and support its growth initiatives the companys shares are listed on both the bse and the national stock exchange the qip which opened on september \u003cFIVE_\u003e \u003cTWO_THOUSAND\u003e and closed on september \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e was conducted under chapter vi of the sebi issue of capital and disclosure requirements regulations \u003cTWO_THOUSAND\u003e and sections \u003cFOUR_TEN\u003e and \u003cSIX_TEN\u003e of the companies act \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-10T11:25:00+05:30","market_timestamp":"2024-09-10T11:25:00+05:30","off_market_hours":false}