{"url":"https://www.livemint.com/market/stock-market-news/reliance-sets-september-20-as-last-date-for-paying-call-money-on-partly-paid-report-11725984253622.html","title":"Reliance sets September 20 as last date for paying call money on partly paid: Report","description":"Reliance Industries, on Tuesday, announced that it has set September 20 as the last date for paying call money on partly paid shares, according to a report by CNBC-TV18.","content":"Reliance Industries, on Tuesday, announced that it has set September 20 as the last date for paying call money on partly paid shares, according to a report by CNBC-TV18.It was further reported that the failure to pay call money on partly paid shares by September 20 will result in forfeiture and the shares will be ineligible for bonus.On September 5, the Reliance Industries board approved the bonus issue in the ratio of 1:1. This was announced during the conglomerate's 47th annual general meeting (AGM) in August.Additionally, the board approved an increase in authorised share capital from  ₹15,000 crore to  ₹50,000 crore. In a stock exchange filing on September 5, the Board of Directors approved the following decisions.The Board gave nod for the forfeiture of partly paid-up equity shares of the company on which call money (First Call or Second and Final Call or both) remains unpaid.It is suggested to the shareholders for their approval through a postal ballot an issue of bonus shares in the ratio of 1:1 to the eligible equity shareholders of the oil to telecom conglomerate on the record date, through capitalization of securities premium received in cash and/or general reserve and/or retained earnings and increase the authorised share capital of the company from Rs. 15,000 crore to Rs. 50,000 crore.The current bonus issue is the first since 2017 and the sixth bonus issue for Reliance. Before issuing bonus shares in 2017, Reliance had issued 1:1 bonus shares in 2009.The conglomerate pre-bonus paid-up capital stood at  ₹6,766.23 crore, consisting of 676.62 crore equity shares of  ₹10 each, including partly paid-up shares as of September 5.It is expected that after the bonus issue, the company's paid-up capital will double to  ₹13,532.46 crore, comprising 1,353.24 crore equity shares. Reliance estimates that  ₹6,766.23 crore will be needed for the bonus issue. The final amount will depend on the paid-up capital on the record date.","cleaned_content":"reliance industries on tuesday announced that it has set september \u003cTWO_TEN\u003e as the last date for paying call money on partly paid shares according to a report by cnbc tv18 it was further reported that the failure to pay call money on partly paid shares by september \u003cTWO_TEN\u003e will result in forfeiture and the shares will be ineligible for bonus on september \u003cFIVE_\u003e the reliance industries board approved the bonus issue in the ratio of \u003cONE_\u003e \u003cONE_\u003e this was announced during the conglomerates \u003cFOUR_TEN\u003e th annual general meeting agm in august additionally the board approved an increase in authorised share capital from \u003cONE_TEN_THOUSAND\u003e crore to \u003cFIVE_TEN_THOUSAND\u003e crore in a stock exchange filing on september \u003cFIVE_\u003e the board of directors approved the following decisions the board gave nod for the forfeiture of partly paid up equity shares of the company on which call money first call or second and final call or both remains unpaid it is suggested to the shareholders for their approval through a postal ballot an issue of bonus shares in the ratio of \u003cONE_\u003e \u003cONE_\u003e to the eligible equity shareholders of the oil to telecom conglomerate on the record date through capitalization of securities premium received in cash and or general reserve and or retained earnings and increase the authorised share capital of the company from rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cFIVE_TEN_THOUSAND\u003e crore the current bonus issue is the first since \u003cTWO_THOUSAND\u003e and the sixth bonus issue for reliance before issuing bonus shares in \u003cTWO_THOUSAND\u003e reliance had issued \u003cONE_\u003e \u003cONE_\u003e bonus shares in \u003cTWO_THOUSAND\u003e the conglomerate pre bonus paid up capital stood at \u003cSIX_THOUSAND\u003e crore consisting of \u003cSIX_HUNDRED\u003e crore equity shares of \u003cONE_TEN\u003e each including partly paid up shares as of september \u003cFIVE_\u003e it is expected that after the bonus issue the companys paid up capital will double to \u003cONE_TEN_THOUSAND\u003e crore comprising \u003cONE_THOUSAND\u003e crore equity shares reliance estimates that \u003cSIX_THOUSAND\u003e crore will be needed for the bonus issue the final amount will depend on the paid up capital on the record date","timestamp":"2024-09-10T21:38:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}