{"url":"https://www.livemint.com/market/stock-market-news/dividend-stock-vedanta-share-price-in-focus-as-stock-trades-ex-dividend-today-11725935699333.html","title":"Dividend Stock: Vedanta share price declines as stock trades ex-dividend today.","description":"Stock Market Today: Vedanta share price remain in focus as it turns ex dividend today. The Vedanta share price opened lower at  ₹439.80 on the NSE. The record date for the purpose of payment of dividend of  ₹20 per share of face value of  ₹1 stands on Tuesday, 10 September, 2024.","content":"Stock Market Today: Vedanta share price remains in focus turning Ex dividend today.Vedanta share price opened at  ₹439.80 and was trading close to the same levels on the NSE on Tuesday, lower than previous close of  ₹460.25.Vedanta on 2 September had announced third interim dividend of  ₹20 per share of face valueVedanta Ltd Board of Directors, at their meeting held on Monday, September 02, 2024, considered and approved the Third Interim Dividend of  ₹ 20/- per equity share on face value of  ₹ 1/- per equity share for the Financial Year 2024-25 amounting to c.  ₹ 7,821 Crores, as per Vdedant's release.The record date for the purpose of payment of dividend was Tuesday, 10 September, 2024.Vedanta had earlier in July 2024 also had announced an Interim Dividend of  ₹ 4/- per equity share on face value of  ₹ 1/- per equity share for the Financial Year 2024-25 amounting to  ₹1,564 Crore. This was the second interim dividend announcement by the company in FY25 after having approved first interim dividend of  ₹11 per share. The record date for the first interim dividend stood on Saturday, May 25, 2024, while for the second interim dividend stood at Saturday 03 August 2024Thus total dividend of  ₹35 a share has been declared by Vedanta since May during the ongoing financial year.Vedanta Ltd remains in focus as on planned demerger of aluminium, oil and gas, power, steel and ferrous materials, and base metals businesses into independent companies. The existing zinc and new incubated businesses are likely to remain under Vedanta Ltd, according to a PTI report.Recently Vedanta had received credit rating upgrades from AA- to AA by rating agency ICRA Ltd. The rating upgrade reflects improvement in credit metrics, financial flexibility and calibrated approach towards capital deployment said the rating agency. As per ICRA Vedanta has has  ₹22,000 crore+ ($2.61 billion) war chest arising from cash reserves, dividend and stake sale from its subsidiary.","cleaned_content":"stock market today vedanta share price remains in focus turning ex dividend today vedanta share price opened at \u003cFOUR_HUNDRED\u003e and was trading close to the same levels on the nse on tuesday lower than previous close of \u003cFOUR_HUNDRED\u003e vedanta on \u003cTWO_\u003e september had announced third interim dividend of \u003cTWO_TEN\u003e per share of face valuevedanta ltd board of directors at their meeting held on monday september \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e considered and approved the third interim dividend of \u003cTWO_TEN\u003e per equity share on face value of \u003cONE_\u003e per equity share for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e amounting to c \u003cSEVEN_THOUSAND\u003e crores as per vdedants release the record date for the purpose of payment of dividend was tuesday \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e vedanta had earlier in july \u003cTWO_THOUSAND\u003e also had announced an interim dividend of \u003cFOUR_\u003e per equity share on face value of \u003cONE_\u003e per equity share for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e amounting to \u003cONE_THOUSAND\u003e crore this was the second interim dividend announcement by the company in fy25 after having approved first interim dividend of \u003cONE_TEN\u003e per share the record date for the first interim dividend stood on saturday may \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e while for the second interim dividend stood at saturday \u003cTHREE_\u003e august \u003cTWO_THOUSAND\u003e thus total dividend of \u003cTHREE_TEN\u003e a share has been declared by vedanta since may during the ongoing financial year vedanta ltd remains in focus as on planned demerger of aluminium oil and gas power steel and ferrous materials and base metals businesses into independent companies the existing zinc and new incubated businesses are likely to remain under vedanta ltd according to a pti report recently vedanta had received credit rating upgrades from aa to aa by rating agency icra ltd the rating upgrade reflects improvement in credit metrics financial flexibility and calibrated approach towards capital deployment said the rating agency as per icra vedanta has has \u003cTWO_TEN_THOUSAND\u003e crore \u003cTWO_\u003e billion war chest arising from cash reserves dividend and stake sale from its subsidiary","timestamp":"2024-09-10T09:02:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}