{"url":"https://www.livemint.com/market/stock-market-news/14-jump-in-2-days-what-s-behind-the-sudden-spike-in-this-aditya-birla-group-stock-11726035895181.html","title":"Aditya Birla Group Stock: Century Textiles surges 14% in 2 days; what’s behind the sudden spike?","description":"Century Textiles' shares surged 8.2 percent to  ₹2,689 after acquiring land in Worli for  ₹1,100 crore. This acquisition is projected to generate  ₹14,000 crore in booking value, contributing to the company's real estate expansion.","content":"Shares of Century Textiles \u0026 Industries, the real estate arm of the Aditya Birla Group, surged 8.2 percent in intraday trading today, reaching an all-time high of  ₹2,689 per share. This follows a 5.6 percent rise in the previous session, bringing the total two-day gain to 14 percent.The rally was driven by the company’s acquisition of ownership rights for approximately 10 acres of leasehold land in Worli, Mumbai, from Mr Nusli Wadia for  ₹1,100 crore. This transaction merges the existing leasehold interest into full ownership and will be developed through Birla Estates Pvt Ltd, its wholly-owned subsidiary.Worli, a prime location in Mumbai, is currently experiencing a bullish trend in luxury real estate. The newly acquired land is expected to add an estimated booking value of  ₹14,000 crore, contributing to a total of 30 acres of contiguous land in the area with an overall booking value potential of around  ₹28,000 crore.This includes the Birla Niyaara project, Birla Estates' flagship development. According to the company's regulatory filing, Birla Niyaara is among the fastest-selling ultra-luxury projects in the Mumbai Metropolitan Region (MMR), with cumulative sales exceeding  ₹5,700 crore since its launch.In late August, Birla Estates entered into a co-development agreement with the LGCPL group for a 131-acre land parcel in Sector 150 Noida. This project complements recent announcements, including new developments on Mathura Road in Delhi and two projects in Gurugram, located in Sector 31 and Sector 71.Since entering into real estate in 2016 under the Birla Estates brand, Century Textiles has concentrated on residential and commercial real estate development in key Indian markets, including MMR, Bengaluru, NCR, and Pune. The company has also recently opened its first international office in Dubai to serve potential clients in the Gulf region.Earlier in June, Birla Estates established a joint venture with Barmalt India Pvt Ltd to develop a luxury residential project in Sector 31, Gurugram. This project spans 13.27 acres, with a development potential of approximately 2.4 million square feet and an estimated revenue potential of around  ₹5,000 crore.During FY24, the company achieved significant milestones, selling nearly 1.7 million sq ft, amounting to  ₹3,985 crore across all launched projects.The company's shares have delivered exceptional returns this year, doubling investors' wealth in under nine months, with eight of those months finishing in positive territory.During this period, the stock surged from  ₹1,231 to its current trading price of  ₹2,642 per share, representing a remarkable 116 percent gain. From its 2020 low of  ₹218, the stock has skyrocketed by an impressive 1,111 percent to date.","cleaned_content":"shares of century textiles industries the real estate arm of the aditya birla group surged \u003cEIGHT_PERCENT\u003e in intraday trading today reaching an all time high of \u003cTWO_THOUSAND\u003e per share this follows a \u003cFIVE_PERCENT\u003e rise in the previous session bringing the total two day gain to \u003cONE_TEN_PERCENT\u003e the rally was driven by the company s acquisition of ownership rights for approximately \u003cONE_TEN\u003e acres of leasehold land in worli mumbai from mr nusli wadia for \u003cONE_THOUSAND\u003e crore this transaction merges the existing leasehold interest into full ownership and will be developed through birla estates pvt ltd its wholly owned subsidiary worli a prime location in mumbai is currently experiencing a bullish trend in luxury real estate the newly acquired land is expected to add an estimated booking value of \u003cONE_TEN_THOUSAND\u003e crore contributing to a total of \u003cTHREE_TEN\u003e acres of contiguous land in the area with an overall booking value potential of around \u003cTWO_TEN_THOUSAND\u003e crore this includes the birla niyaara project birla estates flagship development according to the companys regulatory filing birla niyaara is among the fastest selling ultra luxury projects in the mumbai metropolitan region mmr with cumulative sales exceeding \u003cFIVE_THOUSAND\u003e crore since its launch in late august birla estates entered into a co development agreement with the lgcpl group for a \u003cONE_HUNDRED\u003e acre land parcel in sector \u003cONE_HUNDRED\u003e noida this project complements recent announcements including new developments on mathura road in delhi and two projects in gurugram located in sector \u003cTHREE_TEN\u003e and sector \u003cSEVEN_TEN\u003e since entering into real estate in \u003cTWO_THOUSAND\u003e under the birla estates brand century textiles has concentrated on residential and commercial real estate development in key indian markets including mmr bengaluru ncr and pune the company has also recently opened its first international office in dubai to serve potential clients in the gulf region earlier in june birla estates established a joint venture with barmalt india pvt ltd to develop a luxury residential project in sector \u003cTHREE_TEN\u003e gurugram this project spans \u003cONE_TEN\u003e acres with a development potential of approximately \u003cTWO_\u003e million square feet and an estimated revenue potential of around \u003cFIVE_THOUSAND\u003e crore during fy24 the company achieved significant milestones selling nearly \u003cONE_\u003e million sq ft amounting to \u003cTHREE_THOUSAND\u003e crore across all launched projects the companys shares have delivered exceptional returns this year doubling investors wealth in under nine months with eight of those months finishing in positive territory during this period the stock surged from \u003cONE_THOUSAND\u003e to its current trading price of \u003cTWO_THOUSAND\u003e per share representing a remarkable \u003cONE_HUNDRED_PERCENT\u003e gain from its \u003cTWO_THOUSAND\u003e low of \u003cTWO_HUNDRED\u003e the stock has skyrocketed by an impressive \u003cONE_THOUSAND_PERCENT\u003e to date","timestamp":"2024-09-11T12:24:00+05:30","market_timestamp":"2024-09-11T12:24:00+05:30","off_market_hours":false}