{"url":"https://www.livemint.com/market/stock-market-news/investors-should-diversify-in-large-caps-and-flexicaps-to-limit-correction-impact-aamar-deo-singh-of-angel-one-11726564114505.html","title":"Investors should diversify in large caps and flexicaps to limit correction impact: Aamar Deo Singh of Angel One","description":"Aamar Deo Singh advises investors to be cautious with expensive valuations and focus on large and flexicap stocks. He recommends diversifying portfolios and booking profits during corrections, emphasizing the importance of quality investments for long-term growth.","content":"Aamar Deo Singh, Sr. Vice President of Research, Angel One, believes that the valuations are relatively expensive across sectors, and investors definitely need to be more prudent and cautious in stock picking and not get carried away by market euphoria. In an interview, Singh advised investors that in the current market environment, they should look at diversifying in large caps and flexicaps to minimize the impact of any major correction. Further, investors with a 5 to 10-year investment horizon should ideally look at adding to their portfolios on significant corrections but stick to quality \u0026 leadership names in their respective categories, he said.The benchmark indices, Nifty, Sensex \u0026 Bank Nifty, have been hitting record highs, with bulls in strong control and bears taking a back seat. Despite global geo-political tensions, US recessionary fears, and rate cut hopes, Indian markets have outperformed most of the major markets globally on the back of strong inflows, both from domestic investors and, of late, from the FPIs. Valuations are relatively expensive in certain pockets across sectors, and investors definitely need to be more prudent and cautious in stock picking and not get carried away by market euphoria. Further, the pressure mounts on the corporate to continue its growth trajectory and meet investor expectations in the coming quarters.Globally, investors are wary of a recession hitting the US economy sometime in 2025, which is the major cause of concern as the USA’s GDP is almost 26% of the world's GDP, so any economic turbulence in the USA is bound to impact our markets as well. Further, investors wait with bated breath ahead of the US FED’s FOMC meeting this week, wherein markets have factored a 25 basis points cut at the minimum, the 1st after almost 4 years. A certain section of the investors are even hopeful of a 50 basis point cut, but the key point is how markets will react to all this, as the statements by the US Fed are equally important. Lastly, US presidential elections will be around the corner in November, and global markets are bracing for increased volatility in the coming weeks and months.Until such time, the liquidity flows into the markets do not abate; any correction will likely be short-lived. Further, any sustained sell-off in the US \u0026 global markets could be another trigger for a major sell-off in Indian markets. However, it would be wise for investors to book part-profits (between 40 per cent to 60 per cent) and wait for a correction to re-enter, as many of the smallcap and midcap stocks are trading at lofty valuations. We are currently in a very strong secular bull market, and it is always better to go with the flow rather than go against the trend. However, as the trend displays an increase in volatility, it is always safer to tighten one’s safety belt just as the passengers fasten their seat belts when the plane hits turbulence.It is always best for investors to have a diversified portfolio, including a mix of equity, debt, and gold. Such a composition helps in effective diversification, risk mitigation, and optimization of returns over the long term. Furthermore, in the current market scenario, it would be more appropriate to diversify into low-correlated asset classes to cushion any major market volatility. At the same time, investors should also bear in mind that all asset classes are closely related, and any major impact on any asset class is bound to have an impact on other asset classes as well.In the current market environment, investors should consider diversifying in large caps and flexicaps to minimize the impact of any major correction. Further, investors having a 5–10-year investment horizon should ideally look at adding onto their portfolios on significant corrections but stick to quality \u0026 leadership names in their respective categories. Further, those investors sitting on handsome profits, could do well to book part profits and wait for any decent correction for fresh entry. At current levels, the risk-reward ratio does not appear to be as favourable as it was a few months back. But markets are the way they are; there are no two ways about it. We are in a historic bull market that is still not showing any signs of slowing down, and it is always better to be with the stronger camp, which, in this case, is undeniably the bull camp. But throwing caution to the wind is also never a good idea, so tread with caution as well.Indian markets definitely stand a better chance to outperform global markets in 2024, though the current valuations are no longer cheaper. But the billions of dollars worth of monthly inflows are aiding the bull rally. Further, with the Indian economy expected to grow at 7 per cent plus per annum, many investment opportunities will emerge in the coming quarters and years. Unless we witness a major collapse in global markets, any correction in Indian markets is most likely to be short-lived, given the domestic investors' strong buying capacity and interest.FPI flows have hit the 50k crore mark as of September 13, 2024, for the current year, clearly indicating the shifting back towards interest in India. At the current rate, the Rs.1 lakh crore does not appear to be an impossible number. Still, it would be primarily driven by major factors, such as global investor reaction to the US rate cut, inflationary trends in India, recessionary fears in the US, and valuation concerns in the Indian markets. Also, identifying sizeable investment opportunities in the current market scenario is no less challenging for investment firms, and this cannot be ignored.Investors should always look at the markets from a long-term perspective as they need to realize the fact that investing is like a marathon, not a 100-meter dash. Its not about timing the market, rather, it is all about giving time to the market. But at the same time, when markets trade at record levels, it is never easy for most investors to stay calm and composed as the fear of a correction or profit erosion always lingers in their minds. But here, investors need to remember that just as Rome was not built in a day, similarly, wealth creation does not happen overnight. It takes time, patience and, most of all, discipline to stay invested and systematically sustain that investment strategy over a sustained period of time. The law of averages generally works out well over the long term as well, and the magic of compounding further aids the wealth creation process.","cleaned_content":"aamar deo singh sr vice president of research angel one believes that the valuations are relatively expensive across sectors and investors definitely need to be more prudent and cautious in stock picking and not get carried away by market euphoria in an interview singh advised investors that in the current market environment they should look at diversifying in large caps and flexicaps to minimize the impact of any major correction further investors with a \u003cFIVE_\u003e to \u003cONE_TEN\u003e year investment horizon should ideally look at adding to their portfolios on significant corrections but stick to quality leadership names in their respective categories he said the benchmark indices nifty sensex bank nifty have been hitting record highs with bulls in strong control and bears taking a back seat despite global geo political tensions us recessionary fears and rate cut hopes indian markets have outperformed most of the major markets globally on the back of strong inflows both from domestic investors and of late from the fpis valuations are relatively expensive in certain pockets across sectors and investors definitely need to be more prudent and cautious in stock picking and not get carried away by market euphoria further the pressure mounts on the corporate to continue its growth trajectory and meet investor expectations in the coming quarters globally investors are wary of a recession hitting the us economy sometime in \u003cTWO_THOUSAND\u003e which is the major cause of concern as the usa s gdp is almost \u003cTWO_TEN_PERCENT\u003e of the worlds gdp so any economic turbulence in the usa is bound to impact our markets as well further investors wait with bated breath ahead of the us fed s fomc meeting this week wherein markets have factored a \u003cTWO_TEN\u003e basis points cut at the minimum the \u003cONE_\u003e st after almost \u003cFOUR_\u003e years a certain section of the investors are even hopeful of a \u003cFIVE_TEN\u003e basis point cut but the key point is how markets will react to all this as the statements by the us fed are equally important lastly us presidential elections will be around the corner in november and global markets are bracing for increased volatility in the coming weeks and months until such time the liquidity flows into the markets do not abate any correction will likely be short lived further any sustained sell off in the us global markets could be another trigger for a major sell off in indian markets however it would be wise for investors to book part profits between \u003cFOUR_TEN_PERCENT\u003e to \u003cSIX_TEN_PERCENT\u003e and wait for a correction to re enter as many of the smallcap and midcap stocks are trading at lofty valuations we are currently in a very strong secular bull market and it is always better to go with the flow rather than go against the trend however as the trend displays an increase in volatility it is always safer to tighten one s safety belt just as the passengers fasten their seat belts when the plane hits turbulence it is always best for investors to have a diversified portfolio including a mix of equity debt and gold such a composition helps in effective diversification risk mitigation and optimization of returns over the long term furthermore in the current market scenario it would be more appropriate to diversify into low correlated asset classes to cushion any major market volatility at the same time investors should also bear in mind that all asset classes are closely related and any major impact on any asset class is bound to have an impact on other asset classes as well in the current market environment investors should consider diversifying in large caps and flexicaps to minimize the impact of any major correction further investors having a \u003cFIVE_\u003e \u003cONE_TEN\u003e year investment horizon should ideally look at adding onto their portfolios on significant corrections but stick to quality leadership names in their respective categories further those investors sitting on handsome profits could do well to book part profits and wait for any decent correction for fresh entry at current levels the risk reward ratio does not appear to be as favourable as it was a few months back but markets are the way they are there are no two ways about it we are in a historic bull market that is still not showing any signs of slowing down and it is always better to be with the stronger camp which in this case is undeniably the bull camp but throwing caution to the wind is also never a good idea so tread with caution as well indian markets definitely stand a better chance to outperform global markets in \u003cTWO_THOUSAND\u003e though the current valuations are no longer cheaper but the billions of dollars worth of monthly inflows are aiding the bull rally further with the indian economy expected to grow at \u003cSEVEN_PERCENT\u003e plus per annum many investment opportunities will emerge in the coming quarters and years unless we witness a major collapse in global markets any correction in indian markets is most likely to be short lived given the domestic investors strong buying capacity and interest fpi flows have hit the \u003cFIVE_TEN\u003e k crore mark as of september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e for the current year clearly indicating the shifting back towards interest in india at the current rate the rs 1 lakh crore does not appear to be an impossible number still it would be primarily driven by major factors such as global investor reaction to the us rate cut inflationary trends in india recessionary fears in the us and valuation concerns in the indian markets also identifying sizeable investment opportunities in the current market scenario is no less challenging for investment firms and this cannot be ignored investors should always look at the markets from a long term perspective as they need to realize the fact that investing is like a marathon not a \u003cONE_HUNDRED\u003e meter dash its not about timing the market rather it is all about giving time to the market but at the same time when markets trade at record levels it is never easy for most investors to stay calm and composed as the fear of a correction or profit erosion always lingers in their minds but here investors need to remember that just as rome was not built in a day similarly wealth creation does not happen overnight it takes time patience and most of all discipline to stay invested and systematically sustain that investment strategy over a sustained period of time the law of averages generally works out well over the long term as well and the magic of compounding further aids the wealth creation process","timestamp":"2024-09-17T15:18:00+05:30","market_timestamp":"2024-09-17T15:18:00+05:30","off_market_hours":false}