{"url":"https://www.livemint.com/market/stock-market-news/vst-industries-radhakishan-damani-offloads-1-lakh-shares-in-this-midcap-stock-11726807364086.html","title":"Radhakishan Damani offloads 1 lakh shares in this midcap stock; check details","description":"Radhakishan Damani sold 1 lakh shares of VST Industries for  ₹4.4 crore. Reliance Mutual Fund and Thrift Savings Plan bought the shares. VST Industries shares have increased 36 per cent over the past year, closing at  ₹440 on Thursday.","content":"Radhakishan Damani portfolio stock: Ace investor Radhakishan Damani sold as many as 1 lakh shares of VST Industries via a block deal on NSE on September 19 at a price of  ₹439.05 per share, aggregating about  ₹4.4 crore.On the other hand, Reliance Mutual Fund and Thrift Savings Plan (a retirement savings and investment plan for Federal employees and members of the uniformed services in the US) were the buyers of VST Industries, NSE data revealed. While Reliance Mutual Fund bought 85,000 shares at  ₹439.96 per share for  ₹3.74 crore, Thrift Savings Plan bought 83,970 shares at a rate of  ₹440.74 per share for  ₹3.7 crore.The midcap stock closed 0.5 per cent up at  ₹440 on NSE on Thursday.On Friday, September 20, VST Industries share price opened at  ₹441 and moved in a narrow range, touching day's high and low of  ₹442.90 and  ₹435.40, respectively, till 10:15 am.The June quarter shareholding pattern data of VST Industries reveals that Damani held 5,35,185 shares, equivalent to a 3.47 per cent stake, in the company.Shares of VST Industries have gained about 36 per cent over the last year. The stock hit its 52-week high of  ₹486.15 on September 6 this year and a 52-week low of  ₹287.18 on October 26 last year.Radhakishan Damani is the founder of the retail chain Avenue Supermarts (DMart) and one of the most eminent investors in India. According to Trendlyne, an equity research platform, Damani publicly holds 13 stocks and has a net worth of over  ₹2,42,145.6 crore.According to Trendlyne, Damani's top holdings include Avenue Supermarts, VST Industries, Advani Hotels \u0026 Resorts (India), Bhagiradha Chemicals \u0026 Industries, Aptech, Sundaram Finance, Mangalam Organics and Sundaram Finance Holdings, as per Q1FY25 shareholding data.Read all market-related news here","cleaned_content":"radhakishan damani portfolio stock ace investor radhakishan damani sold as many as \u003cONE_\u003e lakh shares of vst industries via a block deal on nse on september \u003cONE_TEN\u003e at a price of \u003cFOUR_HUNDRED\u003e per share aggregating about \u003cFOUR_\u003e crore on the other hand reliance mutual fund and thrift savings plan a retirement savings and investment plan for federal employees and members of the uniformed services in the us were the buyers of vst industries nse data revealed while reliance mutual fund bought \u003cEIGHT_TEN_THOUSAND\u003e shares at \u003cFOUR_HUNDRED\u003e per share for \u003cTHREE_\u003e crore thrift savings plan bought \u003cEIGHT_TEN_THOUSAND\u003e shares at a rate of \u003cFOUR_HUNDRED\u003e per share for \u003cTHREE_\u003e crore the midcap stock closed \u003cZERO_PERCENT\u003e up at \u003cFOUR_HUNDRED\u003e on nse on thursday on friday september \u003cTWO_TEN\u003e vst industries share price opened at \u003cFOUR_HUNDRED\u003e and moved in a narrow range touching days high and low of \u003cFOUR_HUNDRED\u003e and \u003cFOUR_HUNDRED\u003e respectively till \u003cONE_TEN\u003e \u003cONE_TEN\u003e am the june quarter shareholding pattern data of vst industries reveals that damani held \u003cFIVE_HUNDRED_THOUSAND\u003e shares equivalent to a \u003cTHREE_PERCENT\u003e stake in the company shares of vst industries have gained about \u003cTHREE_TEN_PERCENT\u003e over the last year the stock hit its \u003cFIVE_TEN\u003e week high of \u003cFOUR_HUNDRED\u003e on september \u003cSIX_\u003e this year and a \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e on october \u003cTWO_TEN\u003e last year radhakishan damani is the founder of the retail chain avenue supermarts dmart and one of the most eminent investors in india according to trendlyne an equity research platform damani publicly holds \u003cONE_TEN\u003e stocks and has a net worth of over \u003cTWO_HUNDRED_THOUSAND\u003e crore according to trendlyne damanis top holdings include avenue supermarts vst industries advani hotels resorts india bhagiradha chemicals industries aptech sundaram finance mangalam organics and sundaram finance holdings as per q1fy25 shareholding data read all market related news here","timestamp":"2024-09-20T10:42:00+05:30","market_timestamp":"2024-09-20T10:42:00+05:30","off_market_hours":false}