{"url":"https://www.livemint.com/market/stock-market-news/osel-devices-ipo-day-1-check-for-subscription-status-gmp-key-dates-all-you-need-to-know-11726486825373.html","title":"Osel Devices IPO: Day 4: Check for Subscription status, GMP, key dates, all you need to know","description":"Osel Devices IPO: The issue opened for subscription on September 16 and will close on September 19. Here are the subscription status, GMP, key dates, and everything you need to know.","content":"Osel Devices IPO: The issue opened for subscription on September 16, 2024, and closes on September 19. Here are the subscription status, GMP, key dates, and everything you need to know.By 03:20 pm on the 4th day of subscription on Thursday, Osel Devices IPO was subscribed 160.15 times. The public issue subscribed 188.51 times in the retail category, 50.46 times in QIB, and 240.08 times in the NII category.The Subscriptions for the Osel Devices IPO began on September 16, 2024, and conclude on September 19, 2024. On Friday, September 20, 2024, the allotment for the Osel Devices IPO is anticipated to be completed. The proposed listing date of Osel Devices IPO is set for Tuesday, September 24, 2024 on NSE SME.Osel Devices IPO is a book built issue worth  ₹70.66 crores comprising the issue of fresh 44.16 lakh shares.The IPO price band for Osel Devices is  ₹155 to  ₹160 per share. An application must have a minimum lot size of 800 shares. Retail investors are required to invest a minimum of  ₹128,000. HNI requires a minimum investment of two lots (1,600 shares), or  ₹256,000.The following objectives are that the company has proposed to active from the Net Proceeds from the Issue:Prepayment or repayment of certain loans availed by the Company;Funding of working capital requirements of the Company; andGeneral Corporate Purposes.The Osel Devices IPO GMP, or grey market premium, is +110 as per Investorgain.com. This indicates that Osel Devices shares were being sold on the Grey market for  ₹110 more than their market value.Osel Devices' estimated listing price was  ₹270 per share, which represents a 68.75% premium over the  ₹160 IPO price, given the upper end of the IPO pricing range and the current premium in the secondary market.","cleaned_content":"osel devices ipo the issue opened for subscription on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and closes on september \u003cONE_TEN\u003e here are the subscription status gmp key dates and everything you need to know by \u003cTHREE_\u003e \u003cTWO_TEN\u003e pm on the \u003cFOUR_\u003e th day of subscription on thursday osel devices ipo was subscribed \u003cONE_HUNDRED\u003e times the public issue subscribed \u003cONE_HUNDRED\u003e times in the retail category \u003cFIVE_TEN\u003e times in qib and \u003cTWO_HUNDRED\u003e times in the nii category the subscriptions for the osel devices ipo began on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and conclude on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the allotment for the osel devices ipo is anticipated to be completed the proposed listing date of osel devices ipo is set for tuesday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e on nse sme osel devices ipo is a book built issue worth \u003cSEVEN_TEN\u003e crores comprising the issue of fresh \u003cFOUR_TEN\u003e lakh shares the ipo price band for osel devices is \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e per share an application must have a minimum lot size of \u003cEIGHT_HUNDRED\u003e shares retail investors are required to invest a minimum of \u003cONE_HUNDRED_THOUSAND\u003e hni requires a minimum investment of two lots \u003cONE_THOUSAND\u003e shares or \u003cTWO_HUNDRED_THOUSAND\u003e the following objectives are that the company has proposed to active from the net proceeds from the issue prepayment or repayment of certain loans availed by the company funding of working capital requirements of the company andgeneral corporate purposes the osel devices ipo gmp or grey market premium is \u003cONE_HUNDRED\u003e as per investorgain com this indicates that osel devices shares were being sold on the grey market for \u003cONE_HUNDRED\u003e more than their market value osel devices estimated listing price was \u003cTWO_HUNDRED\u003e per share which represents a \u003cSIX_TEN_PERCENT\u003e premium over the \u003cONE_HUNDRED\u003e ipo price given the upper end of the ipo pricing range and the current premium in the secondary market","timestamp":"2024-09-19T15:28:00+05:30","market_timestamp":"2024-09-19T15:28:00+05:30","off_market_hours":false}