{"url":"https://www.livemint.com/market/stock-market-news/fo-strategy-buy-axis-bank-oberoi-realty-and-sell-bpcl-recommends-rupak-de-as-indian-stock-market-hits-record-high-11726463560860.html","title":"F\u0026O Strategy: Buy Axis Bank, Oberoi Realty, and Sell BPCL, recommends Rupak De as Indian stock market hits record high","description":"F\u0026O Strategy: Technical views on F\u0026O market by Rupak De, Senior Technical Analyst, LKP Securities. De suggests buying Axis Bank, Oberoi Realty, and selling Bharat Petroleum Corporation Ltd (BPCL).","content":"Stock market today: On Monday, the domestic benchmark indices, Sensex and Nifty 50, reached all-time highs driven by the strength in the metals sector due to a declining dollar. Meanwhile, Bajaj Housing Finance made a strong debut on the stock market, with its listing price more than doubling from its initial public offering (IPO) last week.The Nifty 50 index commenced the day at 25,406.65 points, marking a 0.2% increase of 50.15 points, while the Sensex began with a 0.11% surge, gaining 94.39 points to reach 82,985.33. Both the indices were about 0.3% each at all-time highs, at 10:08 IST. Small- and mid-cap stocks experienced a 0.4% increase in value.A technical analyst stated that the overall trend for the Nifty 50 remains positive as foreign institutional investors (FII) have been on the long side in index futures segment along with buying on cash segment. Their Long Short ratio is at 67.4% indicating positive bias. The supports for Nifty 50 are placed around 25,400 and 25,300 while resistances are seen around 25,500 and 25,700.Technical views by Rupak De, Senior Technical Analyst, LKP Securities on F\u0026O marketFor Bank Nifty the last expiry date was Wednesday, September 11. Bank Nifty has been holding above a critical moving average, indicating a bullish trend. The outlook remains positive as the index continues to sustain its breakout from a declining wedge pattern on the daily timeframe. The daily RSI is in a bullish crossover. In the short term, the index may move toward the 52,500–53,000 range, with support placed at 51,700–51,500 on the lower end.Open Interest Analysis: PUT writers added substantial positions at the 51,900 and 51,700 strikes on Friday; whiles CALL writers added substantial positions at the 52,000 and 51,900 strikes. Maximum CALL open interest is seen at 52,000 and maximum PUT open interest was seen at the 51,000 and 51,500 strike, indicating a big range for the near term. Both PUT and CALL writers remained equally active in the weekly expiry.For Nifty 50 the last expiry date was Thursday, September 12. The Nifty 50 has crossed the previous swing high on the daily chart, signaling growing bullish momentum. However, it encountered resistance at the rising trendline on the daily chart. In lower timeframes, the RSI has entered a bearish crossover, suggesting an early sign of potential bearish momentum reversal. In the short term, the trend may stay sideways. Support is noted at 25,150–25,200, with resistance at 25,460-25,500.Open Interest Analysis: PUT writers added significant positions at 25,200 strikes shows the initial support level; while significant CALL writing was visible at 25,500 indicating strong resistance for the short term at 25,500. Maximum PUT open interest was seen at the 25,000 strike followed by 25,200, whereas maximum CALL open interest was seen at 25,400, followed by 25,500, indicating a broader range for the market. CALL writers are seen to outnumbering the PUT writers.The stock has formed a symmetrical triangle pattern on the daily chart, continuing its upward trend after establishing support. The RSI is showing a bullish crossover and is on the rise. In the short term, the stock could move towards  ₹1,920, with support positioned at  ₹1,759 on the downside.The stock has developed an ascending triangle pattern on the daily chart, remaining above a key moving average. The RSI is in a bullish crossover and trending upward. In the short term, the stock could move toward  ₹1,275, with support at  ₹1,179 on the lower side.The stock resumed below the important 21 EMA which confirms the presence of further downside pressure forex. Bearish RSI crossover can be observed on the daily time frame and bearish trend is being recorded too. Besides, the stock has been below a slopping upward wedge pattern in the daily time frame. In the immediate term, this selling pressure is likely to push the price to  ₹325, while resistance is expected at  ₹347 upper side.","cleaned_content":"stock market today on monday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e reached all time highs driven by the strength in the metals sector due to a declining dollar meanwhile bajaj housing finance made a strong debut on the stock market with its listing price more than doubling from its initial public offering ipo last week the nifty \u003cFIVE_TEN\u003e index commenced the day at \u003cTWO_TEN_THOUSAND\u003e points marking a \u003cZERO_PERCENT\u003e increase of \u003cFIVE_TEN\u003e points while the sensex began with a \u003cZERO_PERCENT\u003e surge gaining \u003cNINE_TEN\u003e points to reach \u003cEIGHT_TEN_THOUSAND\u003e both the indices were about \u003cZERO_PERCENT\u003e each at all time highs at \u003cONE_TEN\u003e \u003cEIGHT_\u003e ist small and mid cap stocks experienced a \u003cZERO_PERCENT\u003e increase in value a technical analyst stated that the overall trend for the nifty \u003cFIVE_TEN\u003e remains positive as foreign institutional investors fii have been on the long side in index futures segment along with buying on cash segment their long short ratio is at \u003cSIX_TEN_PERCENT\u003e indicating positive bias the supports for nifty \u003cFIVE_TEN\u003e are placed around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e while resistances are seen around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e technical views by rupak de senior technical analyst lkp securities on f o marketfor bank nifty the last expiry date was wednesday september \u003cONE_TEN\u003e bank nifty has been holding above a critical moving average indicating a bullish trend the outlook remains positive as the index continues to sustain its breakout from a declining wedge pattern on the daily timeframe the daily rsi is in a bullish crossover in the short term the index may move toward the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e range with support placed at \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e on the lower end open interest analysis put writers added substantial positions at the \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e strikes on friday whiles call writers added substantial positions at the \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e strikes maximum call open interest is seen at \u003cFIVE_TEN_THOUSAND\u003e and maximum put open interest was seen at the \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e strike indicating a big range for the near term both put and call writers remained equally active in the weekly expiry for nifty \u003cFIVE_TEN\u003e the last expiry date was thursday september \u003cONE_TEN\u003e the nifty \u003cFIVE_TEN\u003e has crossed the previous swing high on the daily chart signaling growing bullish momentum however it encountered resistance at the rising trendline on the daily chart in lower timeframes the rsi has entered a bearish crossover suggesting an early sign of potential bearish momentum reversal in the short term the trend may stay sideways support is noted at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e with resistance at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e open interest analysis put writers added significant positions at \u003cTWO_TEN_THOUSAND\u003e strikes shows the initial support level while significant call writing was visible at \u003cTWO_TEN_THOUSAND\u003e indicating strong resistance for the short term at \u003cTWO_TEN_THOUSAND\u003e maximum put open interest was seen at the \u003cTWO_TEN_THOUSAND\u003e strike followed by \u003cTWO_TEN_THOUSAND\u003e whereas maximum call open interest was seen at \u003cTWO_TEN_THOUSAND\u003e followed by \u003cTWO_TEN_THOUSAND\u003e indicating a broader range for the market call writers are seen to outnumbering the put writers the stock has formed a symmetrical triangle pattern on the daily chart continuing its upward trend after establishing support the rsi is showing a bullish crossover and is on the rise in the short term the stock could move towards \u003cONE_THOUSAND\u003e with support positioned at \u003cONE_THOUSAND\u003e on the downside the stock has developed an ascending triangle pattern on the daily chart remaining above a key moving average the rsi is in a bullish crossover and trending upward in the short term the stock could move toward \u003cONE_THOUSAND\u003e with support at \u003cONE_THOUSAND\u003e on the lower side the stock resumed below the important \u003cTWO_TEN\u003e ema which confirms the presence of further downside pressure forex bearish rsi crossover can be observed on the daily time frame and bearish trend is being recorded too besides the stock has been below a slopping upward wedge pattern in the daily time frame in the immediate term this selling pressure is likely to push the price to \u003cTHREE_HUNDRED\u003e while resistance is expected at \u003cTHREE_HUNDRED\u003e upper side","timestamp":"2024-09-16T11:33:00+05:30","market_timestamp":"2024-09-16T11:33:00+05:30","off_market_hours":false}