{"url":"https://www.livemint.com/market/stock-market-news/sebi-permits-mutual-funds-to-buy-sell-credit-default-swaps-here-are-the-details-11726846497638.html","title":"SEBI permits mutual funds to buy, sell credit default swaps. Here are the details","description":"Mutual funds are allowed to buy and sell credit default swaps to increase liquidity in the corporate bond market.","content":"Capital market regulator Securities and Exchange Board of India (SEBI), on Friday, allowed mutual funds to buy and sell credit default swaps (CDS) to improve liquidity in the corporate bond market.“It has been decided to allow greater flexibility to mutual funds to both buy and sell CDS with adequate risk management,” SEBI said in a circular. “Such flexibility to participate in CDS shall serve as an additional investment product for mutual funds and also aid in increasing liquidity in the corporate bond market,” the market watchdog noted.Earlier, only mutual funds with a fixed maturity plan (FMP) in their portfolios with a tenure of more than one year were eligible to carry out CDS transactions.“Under the existing regulatory framework, mutual funds in India are permitted to participate in CDS transactions only as users, i.e, to buy credit protection only to hedge the credit risk on corporate bonds held by them,” the regulator stated in the circular.A mutual fund company's CDS exposure should not exceed the value of the security it protects. SEBI also stated that fund schemes can only buy CDS against securities with an investment grade rating or higher.The credit risk rating of the synthetic debt security, i.e., the CDS, should be the same as the security it protects, according to the regulator. On the selling side, mutual funds can sell CDS as part of synthetic debt investments backed by cash, government securities, or treasury bills. Overnight and liquid mutual fund schemes cannot sell CDS.A mutual fund scheme's exposure to the CDS should be less than 10 per cent of the asset under management (AUM) and within the derivative exposure limit, SEBI said.A credit default swap is a financial instrument that allows an investor to offload their credit risks to another investor. In real life, this means that these CDS are like insurance contracts that protect the investor in case the bond borrower defaults on their payment of dues.CDS is maintained through premium payments similar to insurance contracts for the bond market. A lender may be worried about a borrower not repaying the debt and, hence, buying a credit default swap to offload the risk to some other investor paying in case of a default.In the case of mutual funds, the credit default swap acts as a risk management tool to diversify risk in debt security holdings. SEBI aims to let mutual funds use these instruments to hedge their credit risk in the corporate bond market.","cleaned_content":"capital market regulator securities and exchange board of india sebi on friday allowed mutual funds to buy and sell credit default swaps cds to improve liquidity in the corporate bond market it has been decided to allow greater flexibility to mutual funds to both buy and sell cds with adequate risk management sebi said in a circular such flexibility to participate in cds shall serve as an additional investment product for mutual funds and also aid in increasing liquidity in the corporate bond market the market watchdog noted earlier only mutual funds with a fixed maturity plan fmp in their portfolios with a tenure of more than one year were eligible to carry out cds transactions under the existing regulatory framework mutual funds in india are permitted to participate in cds transactions only as users i e to buy credit protection only to hedge the credit risk on corporate bonds held by them the regulator stated in the circular a mutual fund companys cds exposure should not exceed the value of the security it protects sebi also stated that fund schemes can only buy cds against securities with an investment grade rating or higher the credit risk rating of the synthetic debt security i e the cds should be the same as the security it protects according to the regulator on the selling side mutual funds can sell cds as part of synthetic debt investments backed by cash government securities or treasury bills overnight and liquid mutual fund schemes cannot sell cds a mutual fund schemes exposure to the cds should be less than \u003cONE_TEN_PERCENT\u003e of the asset under management aum and within the derivative exposure limit sebi said a credit default swap is a financial instrument that allows an investor to offload their credit risks to another investor in real life this means that these cds are like insurance contracts that protect the investor in case the bond borrower defaults on their payment of dues cds is maintained through premium payments similar to insurance contracts for the bond market a lender may be worried about a borrower not repaying the debt and hence buying a credit default swap to offload the risk to some other investor paying in case of a default in the case of mutual funds the credit default swap acts as a risk management tool to diversify risk in debt security holdings sebi aims to let mutual funds use these instruments to hedge their credit risk in the corporate bond market","timestamp":"2024-09-20T22:46:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}