{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-dr-reddys-vodafone-idea-spicejet-axis-bank-hdfc-bank-and-more-11725989016328.html","title":"Stocks to Watch: Dr Reddy’s, Vodafone Idea, SpiceJet, Axis Bank, HDFC Bank and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Dr. Reddy’s Laboratories: In a stock exchange filing on Tuesday, September 10, Dr. Reddy’s Laboratories addressed allegations surrounding its engagement with Dhaval Buch, the husband of the Sebi chief, denying any conflict of interest. The company clarified that it had engaged Agora Advisory Private Limited, where Mr. Buch provided leadership coaching services from October 2020 to April 2021, for which he was paid  ₹6,58,000. This response follows claims from Congress that Sebi chief Madhabi Puri Buch had financial ties to listed companies, including Dr. Reddy’s, Mahindra \u0026 Mahindra, and Pidilite, via Agora Advisory. However, Congress did not provide any evidence to support these allegations.Vodafone Idea: Kumar Mangalam Birla, chairman of the Aditya Birla Group, has increased his stake in Vodafone Idea (Vi), signaling confidence in the telecom company, which is seeking  ₹25,000 crore in debt alongside an equity raise of  ₹24,000 crore. On September 6, Birla acquired 1.86 crore shares of Vi, while his investment firm, Pilani Investment and Industries Corporation, purchased an additional 30 lakh shares.Indian Bank: Indian Bank is planning to raise  ₹5,000 crore through infrastructure bonds. This comes as banks continue to mobilize capital aggressively to meet the high demand for credit, which has outpaced deposit growth. Infrastructure bonds allow banks to fund long-term infrastructure projects and are exempt from maintaining the Cash Reserve Ratio (CRR) and Statutory Liquidity Ratio (SLR), making them a preferred option for raising funds.SpiceJet: Budget airline SpiceJet revealed details of its settlement agreement with Carlyle Aviation on September 10, outlining a combination of debt write-off and conversion of arrears into equity and debentures. Carlyle Group's aviation investment arm will write off $40.17 million of lease arrears owed by SpiceJet. Additionally, Carlyle Aviation will convert $20 million of lease arrears into compulsorily convertible debentures (CCDs) of SpiceXpress, SpiceJet's cargo division. The settlement also includes the conversion of $30 million of arrears into equity at  ₹100 per share, significantly increasing Carlyle’s stake in the airline. With these measures, SpiceJet has successfully reduced its debt burden.Axis Bank, HDFC Bank: The Reserve Bank of India (RBI) imposed penalties totaling  ₹2.91 crore on Axis Bank and HDFC Bank for deficiencies in regulatory and statutory compliance. Axis Bank was fined  ₹1.91 crore for contraventions related to the Banking Regulation Act and non-compliance with directions on 'Interest Rate on Deposits', 'Know Your Customer (KYC)', and 'Credit Flow to Agriculture-Collateral Free Agricultural Loans'. HDFC Bank received a  ₹1 crore penalty for non-compliance with directions concerning 'interest rate on deposits', 'recovery agents', and 'customer service'. These penalties followed a supervisory evaluation conducted by RBI as of March 31, 2023, for Axis Bank, and a review of HDFC Bank’s operations.Tata Motors: Tata Motors announced significant price cuts on its electric vehicle (EV) portfolio on September 10, as part of its 'festival of cars' campaign, which will run until October 31. The price of the Tata Tiago EV has been reduced by  ₹40,000, while the Tata Punch EV and Nexon EV have seen cuts of up to  ₹1.2 lakh and  ₹3 lakh, respectively. After the price reductions, the Tata Tiago EV will start at  ₹7.99 lakh, Tata Punch EV at  ₹9.99 lakh, and Nexon EV at  ₹12.49 lakh. Tata Motors believes this move will help mainstream electric vehicles in India and encourage faster adoption of EVs.Maruti Suzuki India: As the company prepares to launch its first electric vehicle (EV) in January 2025, it plans to tackle major consumer concerns such as range anxiety, the availability of charging infrastructure, and resale value. The company’s focus is on addressing these key issues to ensure a smoother adoption of EVs in the Indian market.L\u0026T: L\u0026T Semiconductor Technologies, a subsidiary of L\u0026T, has entered into a strategic alliance with IBM to advance processor design for edge devices and hybrid cloud systems. This collaboration is set to bolster India's semiconductor technology landscape and drive innovation in computing applications.Reliance Industries: Reliance Retail Ventures, the retail arm of Reliance Industries, has formed a 50/50 joint venture with Delta Galil Industries. This partnership seeks to expand its apparel offerings in India, with a focus on introducing innovative intimate and activewear products to the Indian market.Mahindra \u0026 Mahindra: The company has issued a strong denial of allegations made by the Congress party concerning preferential treatment related to market regulator Sebi and its leadership. Mahindra \u0026 Mahindra emphasized its commitment to maintaining high corporate governance standards.Coal India: The company plans to invest approximately  ₹67,000 crore in developing coal-fired power plants near its mining operations. With 4.7 gigawatts of generation capacity expected to be built over the next six to seven years, this move highlights the continued reliance on coal to meet India’s energy needs.","cleaned_content":"dr reddy s laboratories in a stock exchange filing on tuesday september \u003cONE_TEN\u003e dr reddy s laboratories addressed allegations surrounding its engagement with dhaval buch the husband of the sebi chief denying any conflict of interest the company clarified that it had engaged agora advisory private limited where mr buch provided leadership coaching services from october \u003cTWO_THOUSAND\u003e to april \u003cTWO_THOUSAND\u003e for which he was paid \u003cSIX_HUNDRED_THOUSAND\u003e this response follows claims from congress that sebi chief madhabi puri buch had financial ties to listed companies including dr reddy s mahindra mahindra and pidilite via agora advisory however congress did not provide any evidence to support these allegations vodafone idea kumar mangalam birla chairman of the aditya birla group has increased his stake in vodafone idea vi signaling confidence in the telecom company which is seeking \u003cTWO_TEN_THOUSAND\u003e crore in debt alongside an equity raise of \u003cTWO_TEN_THOUSAND\u003e crore on september \u003cSIX_\u003e birla acquired \u003cONE_\u003e crore shares of vi while his investment firm pilani investment and industries corporation purchased an additional \u003cTHREE_TEN\u003e lakh shares indian bank indian bank is planning to raise \u003cFIVE_THOUSAND\u003e crore through infrastructure bonds this comes as banks continue to mobilize capital aggressively to meet the high demand for credit which has outpaced deposit growth infrastructure bonds allow banks to fund long term infrastructure projects and are exempt from maintaining the cash reserve ratio crr and statutory liquidity ratio slr making them a preferred option for raising funds spicejet budget airline spicejet revealed details of its settlement agreement with carlyle aviation on september \u003cONE_TEN\u003e outlining a combination of debt write off and conversion of arrears into equity and debentures carlyle groups aviation investment arm will write off \u003cFOUR_TEN\u003e million of lease arrears owed by spicejet additionally carlyle aviation will convert \u003cTWO_TEN\u003e million of lease arrears into compulsorily convertible debentures ccds of spicexpress spicejets cargo division the settlement also includes the conversion of \u003cTHREE_TEN\u003e million of arrears into equity at \u003cONE_HUNDRED\u003e per share significantly increasing carlyle s stake in the airline with these measures spicejet has successfully reduced its debt burden axis bank hdfc bank the reserve bank of india rbi imposed penalties totaling \u003cTWO_\u003e crore on axis bank and hdfc bank for deficiencies in regulatory and statutory compliance axis bank was fined \u003cONE_\u003e crore for contraventions related to the banking regulation act and non compliance with directions on interest rate on deposits know your customer kyc and credit flow to agriculture collateral free agricultural loans hdfc bank received a \u003cONE_\u003e crore penalty for non compliance with directions concerning interest rate on deposits recovery agents and customer service these penalties followed a supervisory evaluation conducted by rbi as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e for axis bank and a review of hdfc bank s operations tata motors tata motors announced significant price cuts on its electric vehicle ev portfolio on september \u003cONE_TEN\u003e as part of its festival of cars campaign which will run until october \u003cTHREE_TEN\u003e the price of the tata tiago ev has been reduced by \u003cFOUR_TEN_THOUSAND\u003e while the tata punch ev and nexon ev have seen cuts of up to \u003cONE_\u003e lakh and \u003cTHREE_\u003e lakh respectively after the price reductions the tata tiago ev will start at \u003cSEVEN_\u003e lakh tata punch ev at \u003cNINE_\u003e lakh and nexon ev at \u003cONE_TEN\u003e lakh tata motors believes this move will help mainstream electric vehicles in india and encourage faster adoption of evs maruti suzuki india as the company prepares to launch its first electric vehicle ev in january \u003cTWO_THOUSAND\u003e it plans to tackle major consumer concerns such as range anxiety the availability of charging infrastructure and resale value the company s focus is on addressing these key issues to ensure a smoother adoption of evs in the indian market l t l t semiconductor technologies a subsidiary of l t has entered into a strategic alliance with ibm to advance processor design for edge devices and hybrid cloud systems this collaboration is set to bolster indias semiconductor technology landscape and drive innovation in computing applications reliance industries reliance retail ventures the retail arm of reliance industries has formed a \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e joint venture with delta galil industries this partnership seeks to expand its apparel offerings in india with a focus on introducing innovative intimate and activewear products to the indian market mahindra mahindra the company has issued a strong denial of allegations made by the congress party concerning preferential treatment related to market regulator sebi and its leadership mahindra mahindra emphasized its commitment to maintaining high corporate governance standards coal india the company plans to invest approximately \u003cSIX_TEN_THOUSAND\u003e crore in developing coal fired power plants near its mining operations with \u003cFOUR_\u003e gigawatts of generation capacity expected to be built over the next six to seven years this move highlights the continued reliance on coal to meet india s energy needs","timestamp":"2024-09-11T08:27:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}