{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-under-rs-100-mercury-ev-tech7-declares-rights-issue-at-25-premium-details-here-11726304609497.html","title":"Smallcap stock under  ₹100: Mercury EV-Tech declares rights issue at 25% premium; Details here","description":"Mercury EV-Tech Ltd.'s board of directors approved a preferential shares and warrants rights issue in its meeting held on Friday, September 13.","content":"Small Cap stock Mercury EV-Tech Ltd.'s board of directors approved a preferential shares and warrants rights issue in its meeting held on Friday, September 13, according to the company's Bombay Stock Exchange (BSE) filing on Friday.Mercury EV-Tech shares closed 4.94 per cent higher at  ₹96.92 after Friday's trading session, compared to  ₹92.36 at the previous market close. The company announced the rights issue after the market operating hours.The company aims to raise nearly  ₹480 crore from its rights issue of warrants and preferential shares, according to the company filing.The electric vehicle (EV) maker's board approved the preferential share issue of up to 1,57,41,000 or nearly 1.57 crore equity shares at a price of  ₹75 per share, with a face value of Re 1 per share. The issue is at a premium of  ₹74, valuing the total size of the issue at not more than  ₹118,05,75,000 or  ₹118.05 crore.“To issue upto 1,57,41,000 equity shares, of the company, at a price of  ₹75/- per equity share each having face value of Re.1/- each at a premium of Rs. 74/- aggregating to not more than  ₹118,05,75,000/- to the proposed allottees,” said Mercury EV-Tech in the exchange filing.The company's board also approved a warrant issue of up to 4,83,00,000 or 4.83 crore convertible warrants at a price of  ₹75 per warrant, each convertible into one fully paid-up equity share with a face value of Re 1 per share. At a premium of  ₹74 per share, the total size of the issue adds up to  ₹362,25,00,000 or 362.25 crore.“To issue upto 4,83,00,000 convertible warrants, of the company, at a price of Rs. 75/- per warrant each convertible into, or exchangeable for, 1 (one) fully paid-up equity share of the company having face value of Re.1/- each at a premium of Rs. 74/- per share aggregating to not more than 362,25,00,000/- to the proposed allottees,” said the company.After the warrants are issued, an amount equivalent to 25 per cent of the total issue size will be called upfront from the proposed allottees, as per the filing.Mercury EV-Tech has also announced a board meeting to be held on October 12, 2024, to discuss and ask for approval in the matter from the shareholders of the company.","cleaned_content":"small cap stock mercury ev tech ltd s board of directors approved a preferential shares and warrants rights issue in its meeting held on friday september \u003cONE_TEN\u003e according to the companys bombay stock exchange bse filing on friday mercury ev tech shares closed \u003cFOUR_PERCENT\u003e higher at \u003cNINE_TEN\u003e after fridays trading session compared to \u003cNINE_TEN\u003e at the previous market close the company announced the rights issue after the market operating hours the company aims to raise nearly \u003cFOUR_HUNDRED\u003e crore from its rights issue of warrants and preferential shares according to the company filing the electric vehicle ev makers board approved the preferential share issue of up to \u003cONE_TEN_MILLION\u003e or nearly \u003cONE_\u003e crore equity shares at a price of \u003cSEVEN_TEN\u003e per share with a face value of re \u003cONE_\u003e per share the issue is at a premium of \u003cSEVEN_TEN\u003e valuing the total size of the issue at not more than \u003cONE_BILLION\u003e or \u003cONE_HUNDRED\u003e crore to issue upto \u003cONE_TEN_MILLION\u003e equity shares of the company at a price of \u003cSEVEN_TEN\u003e per equity share each having face value of re 1 each at a premium of rs \u003cSEVEN_TEN\u003e aggregating to not more than \u003cONE_BILLION\u003e to the proposed allottees said mercury ev tech in the exchange filing the companys board also approved a warrant issue of up to \u003cFOUR_TEN_MILLION\u003e or \u003cFOUR_\u003e crore convertible warrants at a price of \u003cSEVEN_TEN\u003e per warrant each convertible into one fully paid up equity share with a face value of re \u003cONE_\u003e per share at a premium of \u003cSEVEN_TEN\u003e per share the total size of the issue adds up to \u003cTHREE_BILLION\u003e or \u003cTHREE_HUNDRED\u003e crore to issue upto \u003cFOUR_TEN_MILLION\u003e convertible warrants of the company at a price of rs \u003cSEVEN_TEN\u003e per warrant each convertible into or exchangeable for \u003cONE_\u003e one fully paid up equity share of the company having face value of re 1 each at a premium of rs \u003cSEVEN_TEN\u003e per share aggregating to not more than \u003cTHREE_BILLION\u003e to the proposed allottees said the company after the warrants are issued an amount equivalent to \u003cTWO_TEN_PERCENT\u003e of the total issue size will be called upfront from the proposed allottees as per the filing mercury ev tech has also announced a board meeting to be held on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to discuss and ask for approval in the matter from the shareholders of the company","timestamp":"2024-09-14T15:33:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}