{"url":"https://www.livemint.com/market/stock-market-news/kross-ipo-allotment-expected-today-here-s-how-to-check-your-status-11726128275167.html","title":"Kross IPO allotment: Share allocation out. Here’s how to check status online","description":"Kross IPO GMP: According to market observers, shares of the company are available at a premium of  ₹50 in the grey market today","content":"The allotment for Kross Limited IPO is expected to be finalized today. Investors can check their allotment status through the registrar, Kfin Technologies Limited, or the BSE website. The IPO, which was opened for subscription from September 9 to September 11, saw a healthy response from investors, being oversubscribed by 17.66 times. Specifically, the non-institutional investor (NII) segment was oversubscribed 23.40 times, while the retail portion was oversubscribed 11.26 times. The IPO price was set between  ₹228 and  ₹240 per share.Given the high level of retail oversubscription, shares will be allocated to retail individual investors (RIIs) on a proportional basis. Those who do not receive an allotment can expect the refund process to start on September 13, 2024.Shares allotted will be credited to investors' demat accounts on the same day as the refunds. The mainboard IPO is expected to be listed on the BSE and NSE platforms, with a tentative date of September 16, 2024.The company plans to use the net proceeds from the IPO for several purposes, including funding capital expenditure for purchasing machinery and equipment, repaying or prepaying certain outstanding borrowings, funding working capital requirements, and covering general corporate purposes.Step 1: Visit the IPO registrar website at this link -https://kosmic.kfintech.com/ipostatus/Step 2: Choose ‘Kross Limited’ from the ‘Select IPO’ dropdown menu.Step 3: Select among Application No., Demat Account, or PANStep 4: Enter the details using the selected option.Step 5: Enter the Captcha code and click on Submit.Your Kross Limited IPO allotment status will be displayed on the screen.Step 1: Visit the allotment page on BSE's official website:https://www.bseindia.com/investors/appli_check.aspxStep 2: Under ‘Issue Type’, select 'Equity.’Step 3: Choose the IPO from the ‘Issue Name’ drop-down option.Step 4: Enter the PAN or application number.Step 5: Click ‘I am not a robot’ to confirm your identity, then hit the ‘Submit’ button.Kross is a diversified player focused on manufacturing and supplying trailer axles, suspension assemblies, and a wide range of forged and precision-machined high-performance safety-critical parts for medium and heavy commercial vehicles (M\u0026HCV) and farm equipment segments.In its DRHP report, the company said that it is widely recognized as one of the prominent manufacturers of trailer axles and suspension assemblies in India. In 2019, the company commenced manufacturing and selling trailer axles and suspension assemblies and has witnessed robust growth over the past three years, between Fiscal 2020 and Fiscal 2023.With a wide range of high-performance and safety-critical components for the M\u0026HCV and farm equipment segments, the company specializes in manufacturing safety-critical components for the M\u0026HCV segment.It has established long-term relationships with several large domestic and global OEMs, including Ashok Leyland Limited, a leading Indian automobile OEM, and a major Indian farm equipment OEM, with whom it has been associated for over 18 years. Additionally, it has been associated with Tata International DLT Private Limited since 2019.Today's grey market premium (GMP) for the Kross IPO is  ₹45 per share, suggesting that the shares are likely to list  ₹45 above their issue price. With this GMP and an issue price of  ₹240 per share, the estimated listing price is around  ₹285, reflecting an 18.75 per cent premium over the issue price.The grey market premium is the difference between an IPO’s issue price and its expected listing price in the unofficial market. It reflects investor sentiment and demand before the stock officially begins trading.It is important to note that GMP is only a preliminary indicator of the listing price and should not be used as the sole basis for investment decisions.","cleaned_content":"the allotment for kross limited ipo is expected to be finalized today investors can check their allotment status through the registrar kfin technologies limited or the bse website the ipo which was opened for subscription from september \u003cNINE_\u003e to september \u003cONE_TEN\u003e saw a healthy response from investors being oversubscribed by \u003cONE_TEN\u003e times specifically the non institutional investor nii segment was oversubscribed \u003cTWO_TEN\u003e times while the retail portion was oversubscribed \u003cONE_TEN\u003e times the ipo price was set between \u003cTWO_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e per share given the high level of retail oversubscription shares will be allocated to retail individual investors riis on a proportional basis those who do not receive an allotment can expect the refund process to start on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e shares allotted will be credited to investors demat accounts on the same day as the refunds the mainboard ipo is expected to be listed on the bse and nse platforms with a tentative date of september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company plans to use the net proceeds from the ipo for several purposes including funding capital expenditure for purchasing machinery and equipment repaying or prepaying certain outstanding borrowings funding working capital requirements and covering general corporate purposes step \u003cONE_\u003e visit the ipo registrar website at this link https kosmic kfintech com ipostatus step \u003cTWO_\u003e choose kross limited from the select ipo dropdown menu step \u003cTHREE_\u003e select among application no demat account or panstep \u003cFOUR_\u003e enter the details using the selected option step \u003cFIVE_\u003e enter the captcha code and click on submit your kross limited ipo allotment status will be displayed on the screen step \u003cONE_\u003e visit the allotment page on bses official website https www bseindia com investors appli check aspxstep \u003cTWO_\u003e under issue type select equity step \u003cTHREE_\u003e choose the ipo from the issue name drop down option step \u003cFOUR_\u003e enter the pan or application number step \u003cFIVE_\u003e click i am not a robot to confirm your identity then hit the submit button kross is a diversified player focused on manufacturing and supplying trailer axles suspension assemblies and a wide range of forged and precision machined high performance safety critical parts for medium and heavy commercial vehicles m hcv and farm equipment segments in its drhp report the company said that it is widely recognized as one of the prominent manufacturers of trailer axles and suspension assemblies in india in \u003cTWO_THOUSAND\u003e the company commenced manufacturing and selling trailer axles and suspension assemblies and has witnessed robust growth over the past three years between fiscal \u003cTWO_THOUSAND\u003e and fiscal \u003cTWO_THOUSAND\u003e with a wide range of high performance and safety critical components for the m hcv and farm equipment segments the company specializes in manufacturing safety critical components for the m hcv segment it has established long term relationships with several large domestic and global oems including ashok leyland limited a leading indian automobile oem and a major indian farm equipment oem with whom it has been associated for over \u003cONE_TEN\u003e years additionally it has been associated with tata international dlt private limited since \u003cTWO_THOUSAND\u003e todays grey market premium gmp for the kross ipo is \u003cFOUR_TEN\u003e per share suggesting that the shares are likely to list \u003cFOUR_TEN\u003e above their issue price with this gmp and an issue price of \u003cTWO_HUNDRED\u003e per share the estimated listing price is around \u003cTWO_HUNDRED\u003e reflecting an \u003cONE_TEN_PERCENT\u003e premium over the issue price the grey market premium is the difference between an ipo s issue price and its expected listing price in the unofficial market it reflects investor sentiment and demand before the stock officially begins trading it is important to note that gmp is only a preliminary indicator of the listing price and should not be used as the sole basis for investment decisions","timestamp":"2024-09-13T07:29:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}