{"url":"https://www.livemint.com/market/stock-market-news/tmcs-mahua-moitra-files-lokpal-complaint-against-sebis-madhabi-buch-alleging-impropriety-quid-pro-quo-arrangement-11726211985207.html","title":"TMC’s Mahua Moitra files LokPal complaint against SEBI’s Madhabi Buch alleging impropriety, quid pro quo arrangement","description":"Trinamool Congress (TMC) MP Mahua Moitra has filed a complaint in the LokPal against SEBI (Securities and Exchange Board of India) Chief Madhabi Puri Buch.","content":"Trinamool Congress (TMC) Member of Parliament Mahua Moitra has lodged a formal complaint with the Lokpal against Madhabi Puri Buch, the current chairperson of the Securities and Exchange Board of India (SEBI). The complaint, filed on September 11, accuses Buch of improper conduct and engaging in quid pro quo arrangements that allegedly threaten India's national interests.Moitra took to social media platform X to announce her action, stating, \"My LokPal complaint against Ms. Puri-Buch been filed electronically \u0026 in physical form. LokPal must within 30 days refer it to CBI/ED for a preliminary investigation and then a full FIR enquiry. Every single entity involved needs to be summoned \u0026 every link investigated [sic].\"In her complaint, Moitra labels Buch as a “serial offender” and alleges impropriety during her tenure as a public servant. The complaint references Buch's appointment as a whole-time member of SEBI from April 2017 to October 2021 and her subsequent elevation to chairperson in March 2022.The TMC MP's complaint cites allegations made by Hindenburg Research, a US-based firm, on August 10, 2024. These allegations question SEBI's handling of investigations into the Adani Group's offshore shareholders and suggest potential conflicts of interest.This complaint follows recent criticisms from other political figures. On September 10, Congress chief Mallikarjun Kharge accused Prime Minister Narendra Modi of compromising SEBI's integrity to protect his allies. Earlier, on September 2, Congress spokesperson Pawan Khera raised questions about Buch's financial dealings, claiming she received substantial income from ICICI Bank between 2017 and 2024.The controversy intensified last month when Hindenburg Research alleged that Buch and her husband had stakes in offshore entities linked to the Adani Group. In response, the couple issued a joint statement strongly denying these allegations, calling them “baseless” and “devoid of any truth.” They expressed that they have disclosed all their financial documents to relevant authorities.","cleaned_content":"trinamool congress tmc member of parliament mahua moitra has lodged a formal complaint with the lokpal against madhabi puri buch the current chairperson of the securities and exchange board of india sebi the complaint filed on september \u003cONE_TEN\u003e accuses buch of improper conduct and engaging in quid pro quo arrangements that allegedly threaten indias national interests moitra took to social media platform x to announce her action stating my lokpal complaint against ms puri buch been filed electronically in physical form lokpal must within \u003cTHREE_TEN\u003e days refer it to cbi ed for a preliminary investigation and then a full fir enquiry every single entity involved needs to be summoned every link investigated sic in her complaint moitra labels buch as a serial offender and alleges impropriety during her tenure as a public servant the complaint references buchs appointment as a whole time member of sebi from april \u003cTWO_THOUSAND\u003e to october \u003cTWO_THOUSAND\u003e and her subsequent elevation to chairperson in march \u003cTWO_THOUSAND\u003e the tmc mps complaint cites allegations made by hindenburg research a us based firm on august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e these allegations question sebis handling of investigations into the adani groups offshore shareholders and suggest potential conflicts of interest this complaint follows recent criticisms from other political figures on september \u003cONE_TEN\u003e congress chief mallikarjun kharge accused prime minister narendra modi of compromising sebis integrity to protect his allies earlier on september \u003cTWO_\u003e congress spokesperson pawan khera raised questions about buchs financial dealings claiming she received substantial income from icici bank between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the controversy intensified last month when hindenburg research alleged that buch and her husband had stakes in offshore entities linked to the adani group in response the couple issued a joint statement strongly denying these allegations calling them baseless and devoid of any truth they expressed that they have disclosed all their financial documents to relevant authorities","timestamp":"2024-09-13T12:55:00+05:30","market_timestamp":"2024-09-13T12:55:00+05:30","off_market_hours":false}