{"url":"https://www.livemint.com/market/stock-market-news/ntpc-power-grid-jsw-energy-others-share-prices-power-demand-dips-in-august-but-outlook-remains-firm-11726042809833.html","title":"NTPC, Power Grid, JSW Energy, others share prices: Power demand dips in August, but outlook remains firm","description":"Stock Markets Today: The power demand in August 2024 saw some decline, nevertheless is attributed to better monsoon and floods. Demand outlook remains firm and analysts positive on prospects of NTPC, Power Grid, JSW Steel, others share price. NLC Ltd remains pick of Elara Securities. Check more","content":"Stock Markets Today: Power Grid Corporation of India , NTPC share prices that have risen 60-70% in last one year, however are down up to 6% in September. The Hydropower producers NHPC and SJVN and Bharat Heavy Electricals Ltd (BHEL share price) also have seen some correction during September.While the markets have remained volatile, power demand too saw some dip in August' 2024, thanks to the large base of last year and floods in some parts of the country.Power demand in August-24 declines 5.2% YoY and 3.9% Month on Month which as per analysts is attributed to high base of August 2023. While rainfall had remained scantly in August 2023, it was abnormally high August-24 rainfall ( up 82.7% YoY) that impacted August 2024 demand, said analysts. Nuvama Institutional Equities said that we believe the demand decline is weather-related and not structural. Lower demand led per unit prices on the Indian Energy Exchange (IEX) fell while volumes rose YoYThe power demand growth however on annualised basis over three yeas remains healthy. At 144, 152 and 131 billion units respectively during August 2024/, 2023 and 2022 , the demand has grown at compounded annual growth rate (CAGR) of 5.2% over August’22–August’24The demand outlook remains firm. The household demand continues to rise. The load shedding is reduced and health of various Discoms also remains favorable for power demand say analysts. The project demand is also improving and elections led disruption is behind. furthest analysts also highlight that pick up in rural economy led by better monsoon will also lift power demand. Overall Analysts at Rupesh Sankhe at Elara Securities expect a good 7-8% power demand growth during the financial year.Demand outlook should remain positive for Power Grid, NTPC, JSW Energy, Indian Energy Exchange, BHEL and share prices of others. Some however may be trading at higher valuationsMeanwhile Sankhe remains positive on NLC Ltd share price with a BUY and an SoTP based target price of  ₹373, implying more than 35% upside for NLC share prices from the current market price. Through FY24-27 Sankhe says estimate a revenue CAGR of 15%, an Ebitda CAGR of 20% and a net profit CAGR of 20% for NLC.","cleaned_content":"stock markets today power grid corporation of india ntpc share prices that have risen \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e in last one year however are down up to \u003cSIX_PERCENT\u003e in september the hydropower producers nhpc and sjvn and bharat heavy electricals ltd bhel share price also have seen some correction during september while the markets have remained volatile power demand too saw some dip in august \u003cTWO_THOUSAND\u003e thanks to the large base of last year and floods in some parts of the country power demand in august \u003cTWO_TEN\u003e declines \u003cFIVE_PERCENT\u003e yoy and \u003cTHREE_PERCENT\u003e month on month which as per analysts is attributed to high base of august \u003cTWO_THOUSAND\u003e while rainfall had remained scantly in august \u003cTWO_THOUSAND\u003e it was abnormally high august \u003cTWO_TEN\u003e rainfall up \u003cEIGHT_TEN_PERCENT\u003e yoy that impacted august \u003cTWO_THOUSAND\u003e demand said analysts nuvama institutional equities said that we believe the demand decline is weather related and not structural lower demand led per unit prices on the indian energy exchange iex fell while volumes rose yoythe power demand growth however on annualised basis over three yeas remains healthy at \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e billion units respectively during august \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the demand has grown at compounded annual growth rate cagr of \u003cFIVE_PERCENT\u003e over august \u003cTWO_TEN\u003e august \u003cTWO_TEN\u003e the demand outlook remains firm the household demand continues to rise the load shedding is reduced and health of various discoms also remains favorable for power demand say analysts the project demand is also improving and elections led disruption is behind furthest analysts also highlight that pick up in rural economy led by better monsoon will also lift power demand overall analysts at rupesh sankhe at elara securities expect a good \u003cSEVEN_\u003e \u003cEIGHT_PERCENT\u003e power demand growth during the financial year demand outlook should remain positive for power grid ntpc jsw energy indian energy exchange bhel and share prices of others some however may be trading at higher valuationsmeanwhile sankhe remains positive on nlc ltd share price with a buy and an sotp based target price of \u003cTHREE_HUNDRED\u003e implying more than \u003cTHREE_TEN_PERCENT\u003e upside for nlc share prices from the current market price through fy24 \u003cTWO_TEN\u003e sankhe says estimate a revenue cagr of \u003cONE_TEN_PERCENT\u003e an ebitda cagr of \u003cTWO_TEN_PERCENT\u003e and a net profit cagr of \u003cTWO_TEN_PERCENT\u003e for nlc","timestamp":"2024-09-11T16:29:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}