{"url":"https://www.livemint.com/market/stock-market-news/fpis-turn-bullish-on-financial-stocks-in-september-total-inflows-hit-rs-33-300-crore-so-far-on-us-fed-rate-cut-optimism-11726820088228.html","title":"FPIs turn bullish on financial stocks in September; total inflows hit  ₹33,300 crore so far on US Fed rate cut optimism","description":"FPIs have injected nearly  ₹33,300 crore into domestic equities in September so far. This marks the second-highest monthly inflow of 2024, following  ₹35,100 crore in March, with one trading week still remaining in the month.","content":"Indian stock market witnessed substantial overseas inflows in September, driven by optimism surrounding potential interest rate cuts by the US Federal Reserve, which materialized on September 18 with a larger-than-expected 50 basis point (bps) reduction. The resilience of the Indian market, despite global uncertainties, coupled with its strong momentum, has further attracted significant interest from Foreign Portfolio Investors (FPIs).FPIs have injected nearly  ₹33,300 crore into domestic equities in September so far. This marks the second-highest monthly inflow of 2024, following  ₹35,100 crore in March, with one trading week still remaining in the month, according to data from the National Securities Depository Limited (NSDL).After two consecutive months of substantial sell-offs in financial services stocks, FPIs have reversed their stance, turning net buyers in this sector during the first half of September. From September 1 to 15, FPIs invested  ₹12,253 crore in financial services, contrasting with their outflows of  ₹12,008 crore in August and  ₹7,648 crore in July.The healthcare sector continued to attract significant overseas investment, with FPI inflows amounting to  ₹3,652 crore in the first half of September, following inflows of  ₹5,831 crore in August and  ₹5,054 crore in July, NSDL data showed.The real estate sector saw inflows of  ₹2,903 crore, while the consumer durables sector attracted  ₹2,226 crore between September 1 and 15. During this period, FPIs also infused  ₹1,778 crore into the capital goods sector and  ₹1,672 crore into the oil, gas, and consumable fuels sector.The telecommunications and fast-moving consumer goods (FMCG) sectors remained popular with FPIs, receiving inflows of  ₹1,699 crore and  ₹1,372 crore, respectively, in the first half of September. This was followed by inflows of  ₹1,167 crore into the power sector, as per NSDL data.Analysts believe FPI flows into India could accelerate if the US Fed easing cycle triggers a risk-on rally in the US.“FPIs have largely missed the bus so far, but we believe that they are now willing to look through elevated valuations and increase their India exposure. FPI net inflows in India for CY24 YTD stand at  ₹423 billion (0.2% of the Nifty Mcap) compared with the  ₹1.7 trillion (1.2% of the Nifty Mcap) in CY23, indicating that there is room for acceleration going forward,” said Seshadri Sen, Head Of Research And Strategist at Emkay Global Financial Services.FPIs continued to reduce their holdings in the automobile and auto components, metals and mining, and construction materials sectors during the September 1 to 15 period. The auto sector saw outflows of  ₹1,983 crore, following withdrawals of  ₹2,379 crore in August.The metals and mining sector experienced FPI outflows of  ₹1,857 crore, following substantial withdrawals of  ₹3,773 crore last month. The construction materials sector also recorded FPI selling, with outflows of  ₹393 crore during the first half of September.","cleaned_content":"indian stock market witnessed substantial overseas inflows in september driven by optimism surrounding potential interest rate cuts by the us federal reserve which materialized on september \u003cONE_TEN\u003e with a larger than expected \u003cFIVE_TEN\u003e basis point bps reduction the resilience of the indian market despite global uncertainties coupled with its strong momentum has further attracted significant interest from foreign portfolio investors fpis fpis have injected nearly \u003cTHREE_TEN_THOUSAND\u003e crore into domestic equities in september so far this marks the second highest monthly inflow of \u003cTWO_THOUSAND\u003e following \u003cTHREE_TEN_THOUSAND\u003e crore in march with one trading week still remaining in the month according to data from the national securities depository limited nsdl after two consecutive months of substantial sell offs in financial services stocks fpis have reversed their stance turning net buyers in this sector during the first half of september from september \u003cONE_\u003e to \u003cONE_TEN\u003e fpis invested \u003cONE_TEN_THOUSAND\u003e crore in financial services contrasting with their outflows of \u003cONE_TEN_THOUSAND\u003e crore in august and \u003cSEVEN_THOUSAND\u003e crore in july the healthcare sector continued to attract significant overseas investment with fpi inflows amounting to \u003cTHREE_THOUSAND\u003e crore in the first half of september following inflows of \u003cFIVE_THOUSAND\u003e crore in august and \u003cFIVE_THOUSAND\u003e crore in july nsdl data showed the real estate sector saw inflows of \u003cTWO_THOUSAND\u003e crore while the consumer durables sector attracted \u003cTWO_THOUSAND\u003e crore between september \u003cONE_\u003e and \u003cONE_TEN\u003e during this period fpis also infused \u003cONE_THOUSAND\u003e crore into the capital goods sector and \u003cONE_THOUSAND\u003e crore into the oil gas and consumable fuels sector the telecommunications and fast moving consumer goods fmcg sectors remained popular with fpis receiving inflows of \u003cONE_THOUSAND\u003e crore and \u003cONE_THOUSAND\u003e crore respectively in the first half of september this was followed by inflows of \u003cONE_THOUSAND\u003e crore into the power sector as per nsdl data analysts believe fpi flows into india could accelerate if the us fed easing cycle triggers a risk on rally in the us fpis have largely missed the bus so far but we believe that they are now willing to look through elevated valuations and increase their india exposure fpi net inflows in india for cy24 ytd stand at \u003cFOUR_HUNDRED\u003e billion \u003cZERO_PERCENT\u003e of the nifty mcap compared with the \u003cONE_\u003e trillion \u003cONE_PERCENT\u003e of the nifty mcap in cy23 indicating that there is room for acceleration going forward said seshadri sen head of research and strategist at emkay global financial services fpis continued to reduce their holdings in the automobile and auto components metals and mining and construction materials sectors during the september \u003cONE_\u003e to \u003cONE_TEN\u003e period the auto sector saw outflows of \u003cONE_THOUSAND\u003e crore following withdrawals of \u003cTWO_THOUSAND\u003e crore in august the metals and mining sector experienced fpi outflows of \u003cONE_THOUSAND\u003e crore following substantial withdrawals of \u003cTHREE_THOUSAND\u003e crore last month the construction materials sector also recorded fpi selling with outflows of \u003cTHREE_HUNDRED\u003e crore during the first half of september","timestamp":"2024-09-20T14:02:00+05:30","market_timestamp":"2024-09-20T14:02:00+05:30","off_market_hours":false}