{"url":"https://www.livemint.com/market/stock-market-news/tata-motors-share-price-breaks-three-day-losing-streak-as-emkay-global-upgrades-stock-to-buy-sees-22-upside-11726723101763.html","title":"Tata Motors share price breaks three-day losing streak as Emkay Global upgrades stock to ‘Buy’, sees 22% upside","description":"Tata Motors share price has fallen over 11% in one month, while the auto stock has jumped more than 23% year-to-date (YTD). Tata Motors shares have rallied over 50% in one year.","content":"Tata Motors share price snapped a three-day losing streak to trade higher on Thursday after ratings upgrade by Emkay Global. Tata Motors shares gained as much as to  ₹apiece on the BSE.Emkay Global Financial Services upgraded its rating on Tata Motors stock to ‘Buy’ from ‘Add’ with a target price of  ₹1,175 per share, implying an upside potential of 22% from Wednesday’s closing price.Tata Motors stock price has corrected around 18% from its peak, amid outlook downgrade at peer BMW and slowdown in domestic Commercial Vehicles (CV) and Passenger Vehicles (PV).Emkay Global highlights that for Jaguar Land Rover (JLD), China is a relatively smaller market, while the company’s profitability and debt outlook are largely intact. In the Indian market, Tata Motors’ CV business outlook is improving, with margins likely to see strong increase led by healthy fleet operator profitability and sustained pricing discipline.“While the overall growth expectations are modest, we expect profitability to sustain, driven by mix and cost actions with the deleveraging journey also on track (net-debt free in FY25E),” said Chirag Jain, Senior Research Analyst at Emkay Global Financial Services Ltd.Moreover, the company’s new launches, lower inventory would help outperformance versus a weak PV industry, the analyst said, adding that Tata Motors; balance sheet is healthier now, with valuations least demanding among OEMs.“Underlying metrics for the domestic PV industry continue to worsen amid slowing retails, rising inventory, and increasing discounts; our channel checks point to further weakness in outlook beyond the upcoming festive period. While Tata Motors would also be impacted by the overall sluggishness, we believe new launches including Curvv and relatively lower inventories would help it post better-than-industry performance,” Jain said.The brokerage firm builds in 6% volume CAGR over FY24-27 for Tata Motors. It trims FY26 and FY27 EPS estimates by 2.5%.Tata Motors share price has fallen over 11% in one month, while the auto stock has jumped more than 23% year-to-date (YTD). Tata Motors shares have rallied over 50% in one year.At 10:50 am, Tata Motors shares were trading 0.22% higher at  ₹964.55 apiece on the BSE, commanding a market capitalisation of around  ₹3.55 lakh crore.","cleaned_content":"tata motors share price snapped a three day losing streak to trade higher on thursday after ratings upgrade by emkay global tata motors shares gained as much as to apiece on the bse emkay global financial services upgraded its rating on tata motors stock to buy from add with a target price of \u003cONE_THOUSAND\u003e per share implying an upside potential of \u003cTWO_TEN_PERCENT\u003e from wednesday s closing price tata motors stock price has corrected around \u003cONE_TEN_PERCENT\u003e from its peak amid outlook downgrade at peer bmw and slowdown in domestic commercial vehicles cv and passenger vehicles pv emkay global highlights that for jaguar land rover jld china is a relatively smaller market while the company s profitability and debt outlook are largely intact in the indian market tata motors cv business outlook is improving with margins likely to see strong increase led by healthy fleet operator profitability and sustained pricing discipline while the overall growth expectations are modest we expect profitability to sustain driven by mix and cost actions with the deleveraging journey also on track net debt free in fy25e said chirag jain senior research analyst at emkay global financial services ltd moreover the company s new launches lower inventory would help outperformance versus a weak pv industry the analyst said adding that tata motors balance sheet is healthier now with valuations least demanding among oems underlying metrics for the domestic pv industry continue to worsen amid slowing retails rising inventory and increasing discounts our channel checks point to further weakness in outlook beyond the upcoming festive period while tata motors would also be impacted by the overall sluggishness we believe new launches including curvv and relatively lower inventories would help it post better than industry performance jain said the brokerage firm builds in \u003cSIX_PERCENT\u003e volume cagr over fy24 \u003cTWO_TEN\u003e for tata motors it trims fy26 and fy27 eps estimates by \u003cTWO_PERCENT\u003e tata motors share price has fallen over \u003cONE_TEN_PERCENT\u003e in one month while the auto stock has jumped more than \u003cTWO_TEN_PERCENT\u003e year to date ytd tata motors shares have rallied over \u003cFIVE_TEN_PERCENT\u003e in one year at \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e am tata motors shares were trading \u003cZERO_PERCENT\u003e higher at \u003cNINE_HUNDRED\u003e apiece on the bse commanding a market capitalisation of around \u003cTHREE_\u003e lakh crore","timestamp":"2024-09-19T10:55:00+05:30","market_timestamp":"2024-09-19T10:55:00+05:30","off_market_hours":false}