{"url":"https://www.livemint.com/market/stock-market-news/oil-logs-first-weekly-gain-in-a-month-snapping-bearish-sell-off-from-33-month-low-brent-up-2-to-72bbl-11726325918146.html","title":"Oil logs first weekly gain in a month, snaps bearish sell-off from 33-month low; Brent up 2% to $72/bbl","description":"Brent crude futures settled at $71.61 a barrel, down 36 cents or 0.5 per cent. US West Texas Intermediate crude (WTI) settled at $68.65 a barrel, down 32 cents, or 0.5 per cent","content":"Global crude oil prices logged their first weekly gain after almost one month in the previous session after Hurricane Francine caused production halts in the US Gulf of Mexico. Oil snapped the bearish sell-off tone buoyed by weather-related hurricane warnings after benchmark Brent crude futures crashed to a 33-month low over demand and oversupply concerns earlier this week.Brent settled lower on Friday, September 13, after US Gulf of Mexico crude production resumed following Hurricane Francine and a weekly rise in US rig count. Brent crude futures settled at $71.61 a barrel, down 36 cents or 0.5 per cent. US West Texas Intermediate crude (WTI) settled at $68.65 a barrel, down 32 cents, or 0.5 per cent. Back home, crude oil futures settled 0.46 per cent lower at  ₹5,782 per barrel on the multi-commodity exchange (MCX).Also Read: Crude View: D-Street experts peg Brent at $75-80 in near-term, Morgan Stanley cuts forecast by $5 on soft demand-As US Gulf Coast production and refining activity resumes, investors have opted to offload oil contracts until the weekend. For the week, oil futures finished higher following sharp storm-related increases early in the week, breaking a streak of declines. Brent logged an increase of about 0.8 per cent since the close of last Friday's session, while WTI registered a roughly 1.4 per cent gain.-Brent crude rose above $72 a barrel, advancing for a third session. Much of crude’s recovery rally has been driven by covering of extreme bearish positioning after prices dipped below $70 earlier in the week. Hurricane Francine weakened from its previous hurricane force and spurred a sizable production shut-in in the Gulf of Mexico.-In broader markets, equities rallied as the US dollar declined, boosting commodities, including crude, while Libyan oil flows continued to slump. The crude oil price remains 16 per cent lower this quarter due to concerns about a dimming demand outlook. The global consumption growth in the first half was the lowest since the pandemic as China’s economy cooled.Also Read: Oil crashes to 33-month low after OPEC+ slashes demand forecasts, Brent sinks below $70 for first time since Dec 2021-Official data showed that, as of Thursday, the storm had nearly shut in 42 per cent of the region's oil production, accounting for about 15 per cent of US output. The cuts are expected to prove brief and, within the broader context, are unlikely to spur much movement in the crude balances given the importance of shale production, which accounts for the major portion of US output.-Crude prices also took a hit from the US rig count from energy services group Baker Hughes, opening a new tab, which reported the biggest weekly rise in oil and natural gas rigs in a year. The oil and gas rig count rose by eight in the week to September 13 to 590, returning to mid-June levels. The increase was the biggest since the week of September 15, 2023. Crude oil rigs rose by five to 488 this week, while gas rigs rose by three to 97.-The Organization of the Petroleum Exporting Countries (OPEC) and the International Energy Agency (IEA) lowered their demand growth forecasts, citing economic struggles in China, the world's largest oil importer. Oil stockpiles also rose across the board last week as crude imports grew and exports dipped, while fuel demand weakened, said the Energy Information Administration (EIA).-Investors look forward to next week's two-day US Federal Reserve policy meeting. The US Fed is widely expected to cut interest rates on Wednesday. Lower interest rates or borrowing costs can boost economic growth and the overall oil demand. Traders are betting on a 25- or 50-basis point interest rate cut in September.Also Read: US Fed policy decision in focus: Did Powell-led FOMC wait too long to cut interest rates? Here’s what experts sayAccording to the Bureau of Safety and Environmental Enforcement, energy producers have shut in 730,000 barrels per day—approximately 42 per cent of the Gulf of Mexico's oil output and nearly 992 million cubic feet of natural gas from Gulf waters.The IEA has lowered its demand growth forecasts for 2024 and 2025. The IEA projects global demand to increase by 900,000 bpd this year and around 950,000 bpd next year, a sharp decline from the 2.1 million bpd growth in 2023.According to Kaynat Chainwala, AVP-Commodity Research, Kotak Securities, IEA's projections are largely due to China's rapid slowdown in demand growth consumption. ‘’Despite this, oil prices have continued to climb, supported by increased risk appetite amid growing expectations of US Federal Reserve rate cuts,'' said Chainwala.Also Read: OPEC+ to pause planned October oil output hike of 180,000 bpd for two months after Brent crashes to 14-month lowAccording to Pranav Mer, Vice President, EBG - Commodity \u0026 Currency Research, JM Financial Services Ltd, \"Crude oil prices have seen a strong recovery in the past couple of sessions, supported short-covering ahead of futures expiry next week, with additional support from temporary supply outages at the Gulf of Mexico due to storm Francine.''However, Mer added that the upside looks limited amid weak global oil demand. On the chart...crude oil prices hold resistance at 5,910/ 6,000, while support holds at 5,690/ 5,520 on the downside, as per the analyst.‘’Crude prices also rose following the ECB's decision to cut interest rates during its monetary policy meeting, which increased expectations of similar cuts by the US Fed. The global equity markets rebounded after the ECB’s move, while the US dollar index and 10-year bond yields dropped, providing additional support to global energy prices. We expect crude oil prices to remain volatile. Support levels are $68.10-67.60, with resistance at $69.20-69.80. In INR terms, oil has support at  ₹5,750-5,690 and resistance at  ₹5,880-5,940,'' said Rahul Kalantri, VP Commodities, Mehta Equities Ltd.","cleaned_content":"global crude oil prices logged their first weekly gain after almost one month in the previous session after hurricane francine caused production halts in the us gulf of mexico oil snapped the bearish sell off tone buoyed by weather related hurricane warnings after benchmark brent crude futures crashed to a \u003cTHREE_TEN\u003e month low over demand and oversupply concerns earlier this week brent settled lower on friday september \u003cONE_TEN\u003e after us gulf of mexico crude production resumed following hurricane francine and a weekly rise in us rig count brent crude futures settled at \u003cSEVEN_TEN\u003e a barrel down \u003cTHREE_TEN\u003e cents or \u003cZERO_PERCENT\u003e us west texas intermediate crude wti settled at \u003cSIX_TEN\u003e a barrel down \u003cTHREE_TEN\u003e cents or \u003cZERO_PERCENT\u003e back home crude oil futures settled \u003cZERO_PERCENT\u003e lower at \u003cFIVE_THOUSAND\u003e per barrel on the multi commodity exchange mcx also read crude view d street experts peg brent at \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e in near term morgan stanley cuts forecast by \u003cFIVE_\u003e on soft demand as us gulf coast production and refining activity resumes investors have opted to offload oil contracts until the weekend for the week oil futures finished higher following sharp storm related increases early in the week breaking a streak of declines brent logged an increase of about \u003cZERO_PERCENT\u003e since the close of last fridays session while wti registered a roughly \u003cONE_PERCENT\u003e gain brent crude rose above \u003cSEVEN_TEN\u003e a barrel advancing for a third session much of crude s recovery rally has been driven by covering of extreme bearish positioning after prices dipped below \u003cSEVEN_TEN\u003e earlier in the week hurricane francine weakened from its previous hurricane force and spurred a sizable production shut in in the gulf of mexico in broader markets equities rallied as the us dollar declined boosting commodities including crude while libyan oil flows continued to slump the crude oil price remains \u003cONE_TEN_PERCENT\u003e lower this quarter due to concerns about a dimming demand outlook the global consumption growth in the first half was the lowest since the pandemic as china s economy cooled also read oil crashes to \u003cTHREE_TEN\u003e month low after opec slashes demand forecasts brent sinks below \u003cSEVEN_TEN\u003e for first time since dec \u003cTWO_THOUSAND\u003e official data showed that as of thursday the storm had nearly shut in \u003cFOUR_TEN_PERCENT\u003e of the regions oil production accounting for about \u003cONE_TEN_PERCENT\u003e of us output the cuts are expected to prove brief and within the broader context are unlikely to spur much movement in the crude balances given the importance of shale production which accounts for the major portion of us output crude prices also took a hit from the us rig count from energy services group baker hughes opening a new tab which reported the biggest weekly rise in oil and natural gas rigs in a year the oil and gas rig count rose by eight in the week to september \u003cONE_TEN\u003e to \u003cFIVE_HUNDRED\u003e returning to mid june levels the increase was the biggest since the week of september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e crude oil rigs rose by five to \u003cFOUR_HUNDRED\u003e this week while gas rigs rose by three to \u003cNINE_TEN\u003e the organization of the petroleum exporting countries opec and the international energy agency iea lowered their demand growth forecasts citing economic struggles in china the worlds largest oil importer oil stockpiles also rose across the board last week as crude imports grew and exports dipped while fuel demand weakened said the energy information administration eia investors look forward to next weeks two day us federal reserve policy meeting the us fed is widely expected to cut interest rates on wednesday lower interest rates or borrowing costs can boost economic growth and the overall oil demand traders are betting on a \u003cTWO_TEN\u003e or \u003cFIVE_TEN\u003e basis point interest rate cut in september also read us fed policy decision in focus did powell led fomc wait too long to cut interest rates here s what experts sayaccording to the bureau of safety and environmental enforcement energy producers have shut in \u003cSEVEN_HUNDRED_THOUSAND\u003e barrels per day approximately \u003cFOUR_TEN_PERCENT\u003e of the gulf of mexicos oil output and nearly \u003cNINE_HUNDRED\u003e million cubic feet of natural gas from gulf waters the iea has lowered its demand growth forecasts for \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the iea projects global demand to increase by \u003cNINE_HUNDRED_THOUSAND\u003e bpd this year and around \u003cNINE_HUNDRED_THOUSAND\u003e bpd next year a sharp decline from the \u003cTWO_\u003e million bpd growth in \u003cTWO_THOUSAND\u003e according to kaynat chainwala avp commodity research kotak securities ieas projections are largely due to chinas rapid slowdown in demand growth consumption despite this oil prices have continued to climb supported by increased risk appetite amid growing expectations of us federal reserve rate cuts said chainwala also read opec to pause planned october oil output hike of \u003cONE_HUNDRED_THOUSAND\u003e bpd for two months after brent crashes to \u003cONE_TEN\u003e month lowaccording to pranav mer vice president ebg commodity currency research jm financial services ltd crude oil prices have seen a strong recovery in the past couple of sessions supported short covering ahead of futures expiry next week with additional support from temporary supply outages at the gulf of mexico due to storm francine however mer added that the upside looks limited amid weak global oil demand on the chart crude oil prices hold resistance at \u003cFIVE_THOUSAND\u003e \u003cSIX_THOUSAND\u003e while support holds at \u003cFIVE_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e on the downside as per the analyst crude prices also rose following the ecbs decision to cut interest rates during its monetary policy meeting which increased expectations of similar cuts by the us fed the global equity markets rebounded after the ecb s move while the us dollar index and \u003cONE_TEN\u003e year bond yields dropped providing additional support to global energy prices we expect crude oil prices to remain volatile support levels are \u003cSIX_TEN\u003e \u003cSIX_TEN\u003e with resistance at \u003cSIX_TEN\u003e \u003cSIX_TEN\u003e in inr terms oil has support at \u003cFIVE_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e and resistance at \u003cFIVE_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e said rahul kalantri vp commodities mehta equities ltd","timestamp":"2024-09-14T20:36:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}