{"url":"https://www.livemint.com/market/stock-market-news/zerodha-ceo-nithin-kamath-announces-ato-for-kite-mobile-11726559138515.html","title":"Zerodha CEO Nithin Kamath announces ATO for Kite mobile","description":"Nithin Kamath said Zerodha's Alert Trigger Orders (ATO) feature will soon be available on its Kite mobile platform, allowing users to set real-time alerts that trigger automatic trades based on specific market conditions, enhancing trading efficiency.","content":"Zerodha founder and CEO Nithin Kamath announced on Tuesday, September 17, that 'Alert Trigger Orders (ATO)' will soon be available on trading and investment platform Kite mobile. Zerodha has already launched ATO on the Kite website.ATO allows users to set alerts on various parameters and notifies users when those conditions are met. ATO is unlike simple alerts, which traders might miss and may not be able to execute a trade at that time. ATOs allow users to link a basket of orders to alerts, and whenever an alert is triggered, the basket of orders is placed on the exchange automatically.For example, if one wants to buy a stock when Sensex drops by 10 per cent or more, he/she can set an alert using ATO and automatically place a buy order for the stock. When the Sensex falls by 10 per cent, an alert will be triggered, and a buy order for the stock will be automatically placed.\"ATO orders allow you to execute trades based on 'if this then that' conditions. For example, buy Reliance if Nifty 50 crosses 25,000 or execute a Nifty short straddle (sell a call and put option of the same strike) if Nifty 50 falls to 24,975,\" Kamath explained the feature on the social media platform X (formerly Twitter).According to the Zerodha website, “In ATO, market orders are placed with market price protection. Market price protection in an ATO refers to an order that executes immediately at the best available price while reducing the risk of price variation.”The Zerodha website has given the following easy-to-follow steps to set up an ATO:Step 1: Click on the 'More' icon of an instrument.Step 2: Click on 'Create alert'. (The default alert name will be the instrument's name. You can change it and use a different name.)Step 3: Click on 'Alert Triggers Order (ATO)'.Step 4: Select the data point, instrument, mathematical operator, and price.Step 5: Search for the instrument to be added to the basket and click on B (Buy), S (Sell) or +.Step 6: In the order window, enter the parameters, such as price and order type, and click on Add to basket. The website allows up to 20 instruments to be added to the basket to be linked to an alert.Step 7: Modify the quantity or the price. To select the market price, click on the options icon, then on the pencil icon, and select Market.Step 8: Click on 'Create'.Read all market-related news here","cleaned_content":"zerodha founder and ceo nithin kamath announced on tuesday september \u003cONE_TEN\u003e that alert trigger orders ato will soon be available on trading and investment platform kite mobile zerodha has already launched ato on the kite website ato allows users to set alerts on various parameters and notifies users when those conditions are met ato is unlike simple alerts which traders might miss and may not be able to execute a trade at that time atos allow users to link a basket of orders to alerts and whenever an alert is triggered the basket of orders is placed on the exchange automatically for example if one wants to buy a stock when sensex drops by \u003cONE_TEN_PERCENT\u003e or more he she can set an alert using ato and automatically place a buy order for the stock when the sensex falls by \u003cONE_TEN_PERCENT\u003e an alert will be triggered and a buy order for the stock will be automatically placed ato orders allow you to execute trades based on if this then that conditions for example buy reliance if nifty \u003cFIVE_TEN\u003e crosses \u003cTWO_TEN_THOUSAND\u003e or execute a nifty short straddle sell a call and put option of the same strike if nifty \u003cFIVE_TEN\u003e falls to \u003cTWO_TEN_THOUSAND\u003e kamath explained the feature on the social media platform x formerly twitter according to the zerodha website in ato market orders are placed with market price protection market price protection in an ato refers to an order that executes immediately at the best available price while reducing the risk of price variation the zerodha website has given the following easy to follow steps to set up an ato step \u003cONE_\u003e click on the more icon of an instrument step \u003cTWO_\u003e click on create alert the default alert name will be the instruments name you can change it and use a different name step \u003cTHREE_\u003e click on alert triggers order ato step \u003cFOUR_\u003e select the data point instrument mathematical operator and price step \u003cFIVE_\u003e search for the instrument to be added to the basket and click on b buy s sell or step \u003cSIX_\u003e in the order window enter the parameters such as price and order type and click on add to basket the website allows up to \u003cTWO_TEN\u003e instruments to be added to the basket to be linked to an alert step \u003cSEVEN_\u003e modify the quantity or the price to select the market price click on the options icon then on the pencil icon and select market step \u003cEIGHT_\u003e click on create read all market related news here","timestamp":"2024-09-17T13:38:00+05:30","market_timestamp":"2024-09-17T13:38:00+05:30","off_market_hours":false}