{"url":"https://www.livemint.com/market/stock-market-news/bonus-shares-2024-multibagger-small-cap-stock-monarch-networth-capital-share-price-to-trade-ex-bonus-in-1-1-ratio-today-11726195415292.html","title":"Bonus shares 2024: Multibagger small cap stock Monarch Networth Capital share price trades ex-bonus in 1:1 ratio today","description":"Bonus shares 2024: Multibagger Monarch Networth Capital share price remains in focus on Friday as the shares trade ex-bonus in 1:1 ratio today (12 September, 2024).","content":"Bonus shares 2024: Multibagger Monarch Networth Capital shares remain in focus on Friday as the shares trade ex-bonus in 1:1 ratio today (12 September, 2024).The Monarch Networth Capital in its filing to the exchanges on 2 September 2024 had announced Record Date for Issue of Bonus Equity shares pursuant to Regulation 42 of Securities \u0026 Exchange Board of India.Friday, September 13, 2024, had been fixed as a record date for the Bonus Issue of equity shares in the ratio of 1:1 (i.e. one Bonus Share for each existing of Equity Share held in Monarch Networth CapitalAs per the release the Monarch Networth Capital had received the shareholders’ approval for the said issue at the Extraordinary General Meeting held on Thursday, August 22, 2024.Monarch Networth Capital share price has risen 16.6% since the date of announcement. Notably the Monarch Networth Capital share price has been rising regularly since July 2024 and is up almost 76% since 12 July 2024.Monarch Networth Capital in July had recommended a final dividend of  ₹1 per equity share of  ₹10 each of the Company. The record date for determining the entitlement of Members to the final dividend for the financial year ended March 31, 2024 had been fixed on Friday, August 2, 2024.In July 2024, strategic financing was also announced by Monarch Networth Capital Ltd., an integrated financial services company listed on both stock markets.One of the Multibagger stocks that the Indian stock market has produced recently is Monarch Networth Capital share price. Monarch Networth Capital share price has risen 110% year to date and 184% over last one year Multibagger returns to the investors .Also over the past 5 years, the Multibagger stock on the NSE has increased phenomenally by roughly 432%, from about  ₹172 to  ₹ 919 per share.","cleaned_content":"bonus shares \u003cTWO_THOUSAND\u003e multibagger monarch networth capital shares remain in focus on friday as the shares trade ex bonus in \u003cONE_\u003e \u003cONE_\u003e ratio today \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e the monarch networth capital in its filing to the exchanges on \u003cTWO_\u003e september \u003cTWO_THOUSAND\u003e had announced record date for issue of bonus equity shares pursuant to regulation \u003cFOUR_TEN\u003e of securities exchange board of india friday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e had been fixed as a record date for the bonus issue of equity shares in the ratio of \u003cONE_\u003e \u003cONE_\u003e i e one bonus share for each existing of equity share held in monarch networth capitalas per the release the monarch networth capital had received the shareholders approval for the said issue at the extraordinary general meeting held on thursday august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e monarch networth capital share price has risen \u003cONE_TEN_PERCENT\u003e since the date of announcement notably the monarch networth capital share price has been rising regularly since july \u003cTWO_THOUSAND\u003e and is up almost \u003cSEVEN_TEN_PERCENT\u003e since \u003cONE_TEN\u003e july \u003cTWO_THOUSAND\u003e monarch networth capital in july had recommended a final dividend of \u003cONE_\u003e per equity share of \u003cONE_TEN\u003e each of the company the record date for determining the entitlement of members to the final dividend for the financial year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e had been fixed on friday august \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e in july \u003cTWO_THOUSAND\u003e strategic financing was also announced by monarch networth capital ltd an integrated financial services company listed on both stock markets one of the multibagger stocks that the indian stock market has produced recently is monarch networth capital share price monarch networth capital share price has risen \u003cONE_HUNDRED_PERCENT\u003e year to date and \u003cONE_HUNDRED_PERCENT\u003e over last one year multibagger returns to the investors also over the past \u003cFIVE_\u003e years the multibagger stock on the nse has increased phenomenally by roughly \u003cFOUR_HUNDRED_PERCENT\u003e from about \u003cONE_HUNDRED\u003e to \u003cNINE_HUNDRED\u003e per share","timestamp":"2024-09-13T09:09:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}