{"url":"https://www.livemint.com/market/stock-market-news/varun-beverages-stock-jumps-4-on-stock-split-record-date-should-you-buy-or-sell-11726053281451.html","title":"Varun Beverages stock jumps 4% on stock split record date; Should you buy or sell?","description":"In June 2023, Varun Beverages had previously executed a share split, lowering the face value from  ₹10 to  ₹5. This upcoming split will further decrease the face value of each share.","content":"Shares of Varun Beverages surged 4 percent to  ₹1,588 per share on September 11, in anticipation of its 2:5 stock split record date. As a result, the stock will begin trading on an ex-split basis starting tomorrow, September 12.The board of directors has established September 12 as the 'record date,' the deadline for determining which shareholders qualify for the company's stock split. In this split, each existing share with a nominal value of  ₹5 will be split into shares with a nominal value of  ₹2.In June 2023, Varun Beverages had previously executed a share split, lowering the face value from  ₹10 to  ₹5. This upcoming split will further decrease the face value of each share.Typically, a company carries out a stock split to lower the price per share, making it more accessible to smaller investors. Despite this, the overall value of the company and the total value of an investor's holdings remain unchanged. By increasing the number of shares at a reduced price, a stock split can also enhance trading volume and liquidity.In the recently ended June quarter, Varun Beverages achieved a 26 percent year-on-year (YoY) growth, reaching  ₹1,262 crore, fueled by volume increases and better margins. The company's revenue climbed 28.3 percent YoY to  ₹7,333 crore. On the operating front, EBITDA surged 31.8 percent YoY to  ₹1,991 crore, while margins improved by 74 basis points YoY to 27.7 percent.Brokerage firm Emkay Global has maintained ‘add’ rating with a target price of  ₹1,650. “We build-in this opportunity, giving a ~4% nudge to the TP multiple to 58x. Maintain ADD with revised TP to Rs1,650/sh,” the firm said in a note.Elara Securities analysts have maintained an 'accumulate' rating and increased the target price to  ₹1,780 per share from  ₹1,590, based on a 55x (unchanged) FY26E P/E ratio as we adjust to September 2026E. The primary downside risk is weaker-than-expected volume growth.","cleaned_content":"shares of varun beverages surged \u003cFOUR_PERCENT\u003e to \u003cONE_THOUSAND\u003e per share on september \u003cONE_TEN\u003e in anticipation of its \u003cTWO_\u003e \u003cFIVE_\u003e stock split record date as a result the stock will begin trading on an ex split basis starting tomorrow september \u003cONE_TEN\u003e the board of directors has established september \u003cONE_TEN\u003e as the record date the deadline for determining which shareholders qualify for the companys stock split in this split each existing share with a nominal value of \u003cFIVE_\u003e will be split into shares with a nominal value of \u003cTWO_\u003e in june \u003cTWO_THOUSAND\u003e varun beverages had previously executed a share split lowering the face value from \u003cONE_TEN\u003e to \u003cFIVE_\u003e this upcoming split will further decrease the face value of each share typically a company carries out a stock split to lower the price per share making it more accessible to smaller investors despite this the overall value of the company and the total value of an investors holdings remain unchanged by increasing the number of shares at a reduced price a stock split can also enhance trading volume and liquidity in the recently ended june quarter varun beverages achieved a \u003cTWO_TEN_PERCENT\u003e year on year yoy growth reaching \u003cONE_THOUSAND\u003e crore fueled by volume increases and better margins the companys revenue climbed \u003cTWO_TEN_PERCENT\u003e yoy to \u003cSEVEN_THOUSAND\u003e crore on the operating front ebitda surged \u003cTHREE_TEN_PERCENT\u003e yoy to \u003cONE_THOUSAND\u003e crore while margins improved by \u003cSEVEN_TEN\u003e basis points yoy to \u003cTWO_TEN_PERCENT\u003e brokerage firm emkay global has maintained add rating with a target price of \u003cONE_THOUSAND\u003e we build in this opportunity giving a \u003cFOUR_PERCENT\u003e nudge to the tp multiple to \u003cFIVE_TEN\u003e x maintain add with revised tp to rs1 650 sh the firm said in a note elara securities analysts have maintained an accumulate rating and increased the target price to \u003cONE_THOUSAND\u003e per share from \u003cONE_THOUSAND\u003e based on a \u003cFIVE_TEN\u003e x unchanged fy26e p e ratio as we adjust to september \u003cTWO_THOUSAND\u003e e the primary downside risk is weaker than expected volume growth","timestamp":"2024-09-11T17:06:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}