{"url":"https://www.livemint.com/market/stock-market-news/helios-capital-samir-arora-on-difficulty-of-sitting-on-cash-warren-buffett-berskhire-hathaway-markets-investments-value-11726907663926.html","title":"Helios Capital’s Samir Arora explains the ‘difficulty of sitting on cash…’","description":"Ace investor Samir Arora highlighted the opportunity cost of holding cash during a market upswing, suggesting significant losses from inaction in recent years.","content":"He added that the second problem with sitting on part cash is — “What do you pray for every morning”.“Second problem with sitting on part cash: What do you pray every morning? That markets go down because you have some cash or that the markets go up because you have major investments in the market? Can get very confusing for both you and God,” he quipped.Arora added a note at the end, disclosing that Helios Capital's global fund is invested in Berkshire A and B shares.Buffett's Berkshire Hathaway, sold nearly half its stake in tech giant Apple, offloading nearly 50 per cent of the shares, leading to a rise in his cash holdings to almost $280 billion, as per reports in August 2024.Selling off a big chunk of Apple shares was a significant move for Buffett, who used to call Apple the pillar of Berkshire's business. Along with Apple, the company also sold BYD and Bank of America shares in the same quarter, as per an AP report.","cleaned_content":"he added that the second problem with sitting on part cash is what do you pray for every morning second problem with sitting on part cash what do you pray every morning that markets go down because you have some cash or that the markets go up because you have major investments in the market can get very confusing for both you and god he quipped arora added a note at the end disclosing that helios capitals global fund is invested in berkshire a and b shares buffetts berkshire hathaway sold nearly half its stake in tech giant apple offloading nearly \u003cFIVE_TEN_PERCENT\u003e of the shares leading to a rise in his cash holdings to almost \u003cTWO_HUNDRED\u003e billion as per reports in august \u003cTWO_THOUSAND\u003e selling off a big chunk of apple shares was a significant move for buffett who used to call apple the pillar of berkshires business along with apple the company also sold byd and bank of america shares in the same quarter as per an ap report","timestamp":"2024-09-21T15:01:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}