{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-krishival-foods-close-to-record-high-jumps-over-4-intraday-after-acquisition-update-11726551535665.html","title":"Small-cap stock Krishival Foods close to record high, jumps over 4% intraday after acquisition update","description":"Krishival Foods' shares surged over 4% on September 17 after acquiring a 52.94% stake in Melt ‘N’ Mellow Foods. The stock opened at  ₹312 and rose to  ₹315, marking potential continued gains. The acquisition diversifies Krishival's offerings into ice cream and bakery products.","content":"Small-cap stock Krishival Foods jumped over 4 per cent in intraday trade on NSE on Tuesday, September 17, a day after the company announced it acquired a 52.94 per cent stake in Melt ‘N’ Mellow Foods Private Limited. Krishival Foods share price opened at  ₹312 against its previous close of  ₹302.45 and rose 4.2 per cent to the level of  ₹315. If the stock ends in the green, it will be its third consecutive session of gains.\"This is to inform you that Krishival Foods Limited, in its meeting held on Monday, September 16, 2024, has considered and approved to make a strategic investment in Melt ‘N’ Mellow Foods Private Limited by subscribing 52.94 per cent of the total paid-up share capital in the form of equity shares of Melt ‘N’ Mellow Foods Private Limited,\" said Krishival Foods.Melt ‘N’ Mellow Foods manufactures and sells ice cream, milk, and bakery products under the brands Melt ‘N’ Mellow and ‘Hamma’.Krishival Foods will acquire 52.94 per cent of the total paid-up share capital of Melt ‘N’ Mellow by September 30 for  ₹9 crore, and make it its subsidiary.Krishival Foods said this acquisition will diversify the business from nuts, and dry fruits to ice cream, milk products, and bakeryproducts. Sales and distribution channels can be leveraged for scaling of all segments as both the firms deal in food segments.The small-cap stock has given a tepid return of about 19 per cent over the last year, according to investing.in. It hit its 52-week high of  ₹317.45 on September 13 this year and a 52-week low of  ₹213 on July 25 last year.Read all market-related news here","cleaned_content":"small cap stock krishival foods jumped over \u003cFOUR_PERCENT\u003e in intraday trade on nse on tuesday september \u003cONE_TEN\u003e a day after the company announced it acquired a \u003cFIVE_TEN_PERCENT\u003e stake in melt n mellow foods private limited krishival foods share price opened at \u003cTHREE_HUNDRED\u003e against its previous close of \u003cTHREE_HUNDRED\u003e and rose \u003cFOUR_PERCENT\u003e to the level of \u003cTHREE_HUNDRED\u003e if the stock ends in the green it will be its third consecutive session of gains this is to inform you that krishival foods limited in its meeting held on monday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e has considered and approved to make a strategic investment in melt n mellow foods private limited by subscribing \u003cFIVE_TEN_PERCENT\u003e of the total paid up share capital in the form of equity shares of melt n mellow foods private limited said krishival foods melt n mellow foods manufactures and sells ice cream milk and bakery products under the brands melt n mellow and hamma krishival foods will acquire \u003cFIVE_TEN_PERCENT\u003e of the total paid up share capital of melt n mellow by september \u003cTHREE_TEN\u003e for \u003cNINE_\u003e crore and make it its subsidiary krishival foods said this acquisition will diversify the business from nuts and dry fruits to ice cream milk products and bakeryproducts sales and distribution channels can be leveraged for scaling of all segments as both the firms deal in food segments the small cap stock has given a tepid return of about \u003cONE_TEN_PERCENT\u003e over the last year according to investing in it hit its \u003cFIVE_TEN\u003e week high of \u003cTHREE_HUNDRED\u003e on september \u003cONE_TEN\u003e this year and a \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e on july \u003cTWO_TEN\u003e last year read all market related news here","timestamp":"2024-09-17T11:36:00+05:30","market_timestamp":"2024-09-17T11:36:00+05:30","off_market_hours":false}