{"url":"https://www.livemint.com/market/stock-market-news/nifty-metal-rallies-over-2-jsw-steel-touches-new-peak-3-factors-fueling-the-surge-11726818213268.html","title":"Nifty Metal rallies over 2% as 5 stocks including JSW Steel surge up to 5%. Here’s why","description":"The Nifty Metal index surged 2.16% in today's session, reaching 9,451 points. Five stocks of the index are currently trading with gains between 3% and 5%, with JSW Steel and Jindal Stainless leading the gainers. The stocks also touched a fresh  ₹988 apiece, coming close to the  ₹1,000 level.","content":"In today’s trading session, metal stocks stood out. All 13 out of 15 constituents of the Nifty Metal index are currently trading in positive territory. This surge propelled the index to gain 2.16 percent, reaching 9,451 points.This sharp rally in metal stocks follows a three-day decline and is attributed to an optimistic outlook from global brokerage firms, which lifted the target prices for some of the metal stocks.Additionally, reports indicate that China is contemplating the removal of some of its remaining restrictions on home purchases, following previous measures that failed to rejuvenate the struggling housing market. This development has sparked renewed investor interest in metal stocks.Furthermore, the recent aggressive rate cuts by the US Federal Reserve have contributed to rising metal prices, creating a favourable environment for metal companies.Amid this backdrop, five stocks, including JSW Steel and Jindal Stainless, are currently trading with gains of 5 percent and 3 percent respectively, with JSW Steel reaching a fresh all-time high of  ₹988 apiece, coming close to the  ₹1,000 level.Macquarie provided an upbeat forecast for metal stocks, highlighting strong domestic fundamentals and decreasing input costs as key factors driving the sector's growth. The firm raised its target price for JSW Steel to  ₹1,077 while maintaining its 'outperform' rating on the stock.The brokerage also lifted the target price for Jindal Steel \u0026 Power to  ₹1,170 and revised its target prices for Hindalco, Tata Steel, and Coal India to  ₹760,  ₹171, and  ₹541, respectively, while keeping an 'overweight' rating on all three stocks.Macquarie has indicated that steel companies are well-positioned to capitalise on domestic price premiums over import parity, alongside stable leverage and declining input costs. It also highlighted potential upside risks for commodity prices over the next 6–12 months.Similarly, Morgan Stanley increased its target price for JSW Steel and Jindal Steel \u0026 Power to  ₹895 and 970 per share, respectively, while maintaining an 'Equal Weight' rating.For Tata Steel, Morgan Stanley continues to hold an 'underweight' position, with a target price of  ₹135. The brokerage also reduced the target price for SAIL to  ₹105 while maintaining its 'underweight' rating.Morgan Stanley offered a more reserved outlook on the steel sector. Despite solid domestic demand, the firm cautioned about the strong supply in the market.The brokerage noted that, although the demand environment remains robust, steel stocks have underperformed the broader market this year and are expected to continue this trend due to a lack of positive triggers for margins and unattractive valuations.","cleaned_content":"in today s trading session metal stocks stood out all \u003cONE_TEN\u003e out of \u003cONE_TEN\u003e constituents of the nifty metal index are currently trading in positive territory this surge propelled the index to gain \u003cTWO_PERCENT\u003e reaching \u003cNINE_THOUSAND\u003e points this sharp rally in metal stocks follows a three day decline and is attributed to an optimistic outlook from global brokerage firms which lifted the target prices for some of the metal stocks additionally reports indicate that china is contemplating the removal of some of its remaining restrictions on home purchases following previous measures that failed to rejuvenate the struggling housing market this development has sparked renewed investor interest in metal stocks furthermore the recent aggressive rate cuts by the us federal reserve have contributed to rising metal prices creating a favourable environment for metal companies amid this backdrop five stocks including jsw steel and jindal stainless are currently trading with gains of \u003cFIVE_PERCENT\u003e and \u003cTHREE_PERCENT\u003e respectively with jsw steel reaching a fresh all time high of \u003cNINE_HUNDRED\u003e apiece coming close to the \u003cONE_THOUSAND\u003e level macquarie provided an upbeat forecast for metal stocks highlighting strong domestic fundamentals and decreasing input costs as key factors driving the sectors growth the firm raised its target price for jsw steel to \u003cONE_THOUSAND\u003e while maintaining its outperform rating on the stock the brokerage also lifted the target price for jindal steel power to \u003cONE_THOUSAND\u003e and revised its target prices for hindalco tata steel and coal india to \u003cSEVEN_HUNDRED\u003e \u003cONE_HUNDRED\u003e and \u003cFIVE_HUNDRED\u003e respectively while keeping an overweight rating on all three stocks macquarie has indicated that steel companies are well positioned to capitalise on domestic price premiums over import parity alongside stable leverage and declining input costs it also highlighted potential upside risks for commodity prices over the next \u003cSIX_\u003e \u003cONE_TEN\u003e months similarly morgan stanley increased its target price for jsw steel and jindal steel power to \u003cEIGHT_HUNDRED\u003e and \u003cNINE_HUNDRED\u003e per share respectively while maintaining an equal weight rating for tata steel morgan stanley continues to hold an underweight position with a target price of \u003cONE_HUNDRED\u003e the brokerage also reduced the target price for sail to \u003cONE_HUNDRED\u003e while maintaining its underweight rating morgan stanley offered a more reserved outlook on the steel sector despite solid domestic demand the firm cautioned about the strong supply in the market the brokerage noted that although the demand environment remains robust steel stocks have underperformed the broader market this year and are expected to continue this trend due to a lack of positive triggers for margins and unattractive valuations","timestamp":"2024-09-20T14:07:00+05:30","market_timestamp":"2024-09-20T14:07:00+05:30","off_market_hours":false}