{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-us-stocks-surge-stops-as-investors-pause-after-big-us-fed-rate-cut-nike-gains-659-11726842480287.html","title":"Wall Street today: US stocks surge stops as investors pause after big US Fed rate cut, Nike gains 6.59%","description":"The US stock markets opened lower on Friday, September 20, as investors held back after a jump in the previous session, which was fueled by the United States Federal Reserves (FED) big 50 basis point rate cut on Wednesday.","content":"The US stock markets opened lower on Friday, September 20, as investors held back after a jump in the previous session, which was fueled by the United States Federal Reserve's (FED) big 50 basis point rate cut on Wednesday.At 9:30 am (EDT), the stock markets opened for the United States at a low. The Dow Jones Industrial Average dropped 0.16 per cent at the opening bell to 41,959.43 points, compared to 42,025.19 points after Thursday's market close.Companies like Nike Inc., Walmart Inc., Verizon Communications Inc., Cisco Systems Inc., American Express Co., International Business Machines Corp., Travellers Cos. Inc., Apple Inc., Procter \u0026 Gamble Co., McDonald's Corp., Amgen Inc., Coca-Cola Co., JPMorgan Chase \u0026 Co., Merck \u0026 Co. Inc., were amongst the top gainers on the Dow Jones Industrial Average during Friday's trading session.Dow Inc., Intel Corp., Salesforce Inc., and Caterpillar Inc. were amongst the top laggards during the Friday market hours, according to data collected from Marketwatch.com.The S\u0026P 500 index fell 0.07 per cent at Friday's market open to 5709.64​ points, compared to 5,713.64 points at the previous market close.Companies like Constellation Energy Corp., Vistra Corp., Nike Inc., CrowdStrike Holdings Inc., Exelon Corp., Public Service Enterprise Group Inc., NRG Energy Inc., Super Micro Computer Inc., Eli Lilly \u0026 Co., Newmount Corp., were amongst the top gainers during the market session on the S\u0026P 500 index.Whereas, FedEx Corp., On Semiconductor Corp., Old Dominion Frieght Line Inc., Viatris Inc., and Moderna Inc. were amongst the top laggards for Friday's trading session, as per Marketwatch data.The Nasdaq Composite dropped 0.08 per cent to 17,999.345 points on the opening bell, compared to its 18,013.98 point level at Thursday's market close.Expion360 Inc., Nova Vision Acquisition Corp., Banzai International Inc., Leafy Holdings Inc., Verb Technology Co. Inc., Agriforce Growing Systems Ltd., Alliance Entertainment Holding Corp., Bone Biologics Corp., Immuneering Corp., and Nano Nuclear Energy Inc., were the top gainers on Friday in the Nasdaq Composite index.Smart for Life Inc., Garden Stage Ltd., Corbus Pharmaceuticals Holdings, Linkage Global Inc., Skye Bioscience Inc., were amongst the top losers during Friday's trading hours.","cleaned_content":"the us stock markets opened lower on friday september \u003cTWO_TEN\u003e as investors held back after a jump in the previous session which was fueled by the united states federal reserves fed big \u003cFIVE_TEN\u003e basis point rate cut on wednesday at \u003cNINE_\u003e \u003cTHREE_TEN\u003e am edt the stock markets opened for the united states at a low the dow jones industrial average dropped \u003cZERO_PERCENT\u003e at the opening bell to \u003cFOUR_TEN_THOUSAND\u003e points compared to \u003cFOUR_TEN_THOUSAND\u003e points after thursdays market close companies like nike inc walmart inc verizon communications inc cisco systems inc american express co international business machines corp travellers cos inc apple inc procter gamble co mcdonalds corp amgen inc coca cola co jpmorgan chase co merck co inc were amongst the top gainers on the dow jones industrial average during fridays trading session dow inc intel corp salesforce inc and caterpillar inc were amongst the top laggards during the friday market hours according to data collected from marketwatch com the s p \u003cFIVE_HUNDRED\u003e index fell \u003cZERO_PERCENT\u003e at fridays market open to \u003cFIVE_THOUSAND\u003e points compared to \u003cFIVE_THOUSAND\u003e points at the previous market close companies like constellation energy corp vistra corp nike inc crowdstrike holdings inc exelon corp public service enterprise group inc nrg energy inc super micro computer inc eli lilly co newmount corp were amongst the top gainers during the market session on the s p \u003cFIVE_HUNDRED\u003e index whereas fedex corp on semiconductor corp old dominion frieght line inc viatris inc and moderna inc were amongst the top laggards for fridays trading session as per marketwatch data the nasdaq composite dropped \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e points on the opening bell compared to its \u003cONE_TEN_THOUSAND\u003e point level at thursdays market close expion360 inc nova vision acquisition corp banzai international inc leafy holdings inc verb technology co inc agriforce growing systems ltd alliance entertainment holding corp bone biologics corp immuneering corp and nano nuclear energy inc were the top gainers on friday in the nasdaq composite index smart for life inc garden stage ltd corbus pharmaceuticals holdings linkage global inc skye bioscience inc were amongst the top losers during fridays trading hours","timestamp":"2024-09-20T21:01:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}