{"url":"https://www.livemint.com/market/stock-market-news/nazara-technologies-share-price-retreats-from-52-week-high-amid-profit-booking-11726726397090.html","title":"Nazara Technologies share price retreats from 52-week high amid profit booking","description":"Nazara Technologies shares reached a 52-week high but dropped over 6% due to profit booking. The company plans to raise  ₹900 crores through a preferential equity issue to strengthen its financial position and pursue growth opportunities.","content":"Nazara Technologies share price today touched a 52-week high, but it eventually dropped over 6% due to profit booking, failing to sustain the gains. The gaming company stock today was in focus after its announcement on Wednesday that the board has given the green light to raise  ₹900 crores through preferential equity issue. Additionally, the company revealed that it has upped its ownership in Absolute Sports (Sportskeeda) to 91%.The company announced in an exchange filing that, subject to shareholder and regulatory clearances, the board has approved a preferential issue of shares to raise  ₹900 crores. This cash infusion will strengthen the company's capacity to take advantage of fresh growth opportunities, finance corporate development, and drive significant acquisitions.In order to further strengthen Nazara's financial foundation for long-term expansion, the preferential equity issue worth  ₹900 crores will be placed with prestigious investors like SBI Mutual Fund, Junomoneta Finsol (an associate of Plutus Wealth), Think Investments, Discovery Investments, Mithun and Siddharth Sacheti, Cohesion Investments, Chartered Finance and Leasing, Ratnabali Investments, and Aamara Capital.“As of 1QFY25 Nazara had a cash balance of  ₹1,458.3 crore. However, following a slew of acquisitions, including Paper Boat Apps, Fusebox Games, and PokerBaazi, totalling to  ₹1,270.2 crore (includes only the cash outgo figure \u0026 not equity issuance, if any) Nazara's cash reserves depleted to  ₹188.1 crore. With this new fund infusion of  ₹900 crore, it has more gun powder to further its inorganic aspirations. Retain HOLD on the stockm,” said Jinesh Joshi, Research Analyst PL Capital - Prabhudas Lilladher.In addition, Nazara paid  ₹145.5 crores for a 19.35% share in Absolute Sports Pvt Ltd, the firm that owns Sportskeeda; 50% of the payment was paid in cash, while the remaining portion was paid in stock. Nazara has now acquired a 91% ownership part in Absolute Sports, therefore consolidating its dominant position in the sports media industry.Nazara Technologies share price opened at an intraday high of  ₹1,124.15 apiece on the BSE, the stock touched an intraday low of  ₹995.85 per share. In the last six months, Nazara Technologies share price has gained about 50%, as per trendlyne data.“There are signs of profit booking at higher levels as the stock had already rallied in last couple of months. The broader markets are witnessing selling pressure and hence, we could see a pullback move in the near term. The supports for the stock are placed around  ₹1,000 and then at  ₹900,” said Ruchit Jain, Lead Research Analyst at 5paisa.","cleaned_content":"nazara technologies share price today touched a \u003cFIVE_TEN\u003e week high but it eventually dropped over \u003cSIX_PERCENT\u003e due to profit booking failing to sustain the gains the gaming company stock today was in focus after its announcement on wednesday that the board has given the green light to raise \u003cNINE_HUNDRED\u003e crores through preferential equity issue additionally the company revealed that it has upped its ownership in absolute sports sportskeeda to \u003cNINE_TEN_PERCENT\u003e the company announced in an exchange filing that subject to shareholder and regulatory clearances the board has approved a preferential issue of shares to raise \u003cNINE_HUNDRED\u003e crores this cash infusion will strengthen the companys capacity to take advantage of fresh growth opportunities finance corporate development and drive significant acquisitions in order to further strengthen nazaras financial foundation for long term expansion the preferential equity issue worth \u003cNINE_HUNDRED\u003e crores will be placed with prestigious investors like sbi mutual fund junomoneta finsol an associate of plutus wealth think investments discovery investments mithun and siddharth sacheti cohesion investments chartered finance and leasing ratnabali investments and aamara capital as of \u003cONE_\u003e qfy25 nazara had a cash balance of \u003cONE_THOUSAND\u003e crore however following a slew of acquisitions including paper boat apps fusebox games and pokerbaazi totalling to \u003cONE_THOUSAND\u003e crore includes only the cash outgo figure not equity issuance if any nazaras cash reserves depleted to \u003cONE_HUNDRED\u003e crore with this new fund infusion of \u003cNINE_HUNDRED\u003e crore it has more gun powder to further its inorganic aspirations retain hold on the stockm said jinesh joshi research analyst pl capital prabhudas lilladher in addition nazara paid \u003cONE_HUNDRED\u003e crores for a \u003cONE_TEN_PERCENT\u003e share in absolute sports pvt ltd the firm that owns sportskeeda \u003cFIVE_TEN_PERCENT\u003e of the payment was paid in cash while the remaining portion was paid in stock nazara has now acquired a \u003cNINE_TEN_PERCENT\u003e ownership part in absolute sports therefore consolidating its dominant position in the sports media industry nazara technologies share price opened at an intraday high of \u003cONE_THOUSAND\u003e apiece on the bse the stock touched an intraday low of \u003cNINE_HUNDRED\u003e per share in the last six months nazara technologies share price has gained about \u003cFIVE_TEN_PERCENT\u003e as per trendlyne data there are signs of profit booking at higher levels as the stock had already rallied in last couple of months the broader markets are witnessing selling pressure and hence we could see a pullback move in the near term the supports for the stock are placed around \u003cONE_THOUSAND\u003e and then at \u003cNINE_HUNDRED\u003e said ruchit jain lead research analyst at \u003cFIVE_\u003e paisa","timestamp":"2024-09-19T12:16:00+05:30","market_timestamp":"2024-09-19T12:16:00+05:30","off_market_hours":false}