{"url":"https://www.livemint.com/market/stock-market-news/fpis-pump-rs-27-856-crore-in-indian-equities-debt-inflows-at-rs-7-525-crore-in-sept-whats-behind-renewed-interest-11726310247786.html","title":"FPIs pump  ₹27,856 crore in Indian equities, Sept debt inflow at  ₹7,525 crore; What fuels the renewed interest?","description":"FPIs invested  ₹27,856 crore worth of Indian equities, and the net investment stood at  ₹53,007 crore as of September 13, taking into account debt, hybrid, debt-VRR, and equities","content":"Foreign portfolio investors (FPIs) made a remarkable comeback to Indian markets in September, snapping their previous moderation, driven by domestic and global factors. FPIs were consistent buyers in June and July after election-related jitters faded and stability returned to Indian markets. However, FPIs halted their buying streak with the onset of the new fiscal year 2024-25 (FY25).FPIs invested  ₹27,856 crore worth of Indian equities, and the net investment stood at  ₹53,007 crore as of September 13, taking into account debt, hybrid, debt-VRR, and equities, according to the National Securities Depository Ltd (NSDL) data. This month, the total investment in debt markets moderated to  ₹7,525 crore.Also Read: US Fed policy decision in focus: Did Powell-led FOMC wait too long to cut interest rates? Here’s what experts say“A significant trend in the market for the week ended 13th September is that FIIs were buyers of equity in the cash market on all days of the week. This makes FIIs buyers for  ₹27,862 crores for September through 13th,” said Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.D-Street analysts said it is significant to note that unlike in previous weeks when FIIs were buyers through the primary market, this week they were buyers through the exchanges, having bought equity for  ₹22,707 crore.According to Dr. V K Vijayakumar, there are two reasons why FIIs have changed their strategy from selling to buying. Firstly, there is a consensus now that the Fed will start cutting rates from this month onwards, pushing the US yields down.This will facilitate fund flows from the US to emerging markets. Secondly, the Indian market is extremely resilient and has strong momentum, and missing out on the Indian market would be a bad strategy for foreign investors. High valuations in India, however, continue to be a concern.\"Also Read: FPI inflows moderate to  ₹7,320 crore in August, debt market investment steady: 5 key factors behind sell-offFPIs started September on a stellar note as domestic equity benchmarks Sensex and Nifty 50 closed August on a historic note, buoyed by a strong global market trend as expectations for a US rate cut gained traction.“The month of September came with a full swing from the FPI fraternity, which made a substantial infusion in the Indian equity market, recording the second-highest single-day purchase of 2024. This shift in the investment wave is largely attributable to the Indian equity market reaching new all-time highs,'' said Manoj Purohit, Partner and leader, FS Tax, Tax and Regulatory Services, BDO India.‘’The robust inflows are due to factors such as global confidence in India's economic outlook and the government’s commitment to drive a long-term growth story. FPIs are encashing at the right time to tab the Indian market amidst positive market sentiments, political stability, contributing to the rally,'' added Purohit.Also Read: SEBI’s nudge to ensure FPIs receive funds on settlement day starting October 2024Analysts say the selling trend is likely to continue since India is the most expensive market in the world now, and “it is rational for FPIs” to sell here and move the money to cheaper markets. \"This picture doesn’t change even if the market turns more bullish on fears regarding US recession receding,'' said Dr. V K Vijayakumar.Experts added that while September is likely to see continued interest from FPIs, the flows would be shaped by a combination of domestic political stability, economic indicators, global interest rate movements, market valuations, sectoral preferences, and the attractiveness of the debt market.Also Read: US Fed Chair Jackson Hole 2024 Highlights: Powell says ‘time has come’ for Fed to slash interest rates‘’The incursion not only mirrors the growing attractiveness of Indian equities but also emphasizes the confidence foreign participants have shown in India's financial markets historically during geopolitical crises and other macro factors,'' said Purohit of BDO India.‘’Also, thanks to the market regulator’s timely actions on easing business norms, rolling out consultation papers on industry issues, and being agile to accept and inculcate global best practices to make India a competitive and one of the most preferred destinations for embedding funds to get better returns as compared to other developing economies,'' added Purohit.","cleaned_content":"foreign portfolio investors fpis made a remarkable comeback to indian markets in september snapping their previous moderation driven by domestic and global factors fpis were consistent buyers in june and july after election related jitters faded and stability returned to indian markets however fpis halted their buying streak with the onset of the new fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fy25 fpis invested \u003cTWO_TEN_THOUSAND\u003e crore worth of indian equities and the net investment stood at \u003cFIVE_TEN_THOUSAND\u003e crore as of september \u003cONE_TEN\u003e taking into account debt hybrid debt vrr and equities according to the national securities depository ltd nsdl data this month the total investment in debt markets moderated to \u003cSEVEN_THOUSAND\u003e crore also read us fed policy decision in focus did powell led fomc wait too long to cut interest rates here s what experts say a significant trend in the market for the week ended \u003cONE_TEN\u003e th september is that fiis were buyers of equity in the cash market on all days of the week this makes fiis buyers for \u003cTWO_TEN_THOUSAND\u003e crores for september through \u003cONE_TEN\u003e th said dr v k vijayakumar chief investment strategist geojit financial services d street analysts said it is significant to note that unlike in previous weeks when fiis were buyers through the primary market this week they were buyers through the exchanges having bought equity for \u003cTWO_TEN_THOUSAND\u003e crore according to dr v k vijayakumar there are two reasons why fiis have changed their strategy from selling to buying firstly there is a consensus now that the fed will start cutting rates from this month onwards pushing the us yields down this will facilitate fund flows from the us to emerging markets secondly the indian market is extremely resilient and has strong momentum and missing out on the indian market would be a bad strategy for foreign investors high valuations in india however continue to be a concern also read fpi inflows moderate to \u003cSEVEN_THOUSAND\u003e crore in august debt market investment steady \u003cFIVE_\u003e key factors behind sell offfpis started september on a stellar note as domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e closed august on a historic note buoyed by a strong global market trend as expectations for a us rate cut gained traction the month of september came with a full swing from the fpi fraternity which made a substantial infusion in the indian equity market recording the second highest single day purchase of \u003cTWO_THOUSAND\u003e this shift in the investment wave is largely attributable to the indian equity market reaching new all time highs said manoj purohit partner and leader fs tax tax and regulatory services bdo india the robust inflows are due to factors such as global confidence in indias economic outlook and the government s commitment to drive a long term growth story fpis are encashing at the right time to tab the indian market amidst positive market sentiments political stability contributing to the rally added purohit also read sebi s nudge to ensure fpis receive funds on settlement day starting october \u003cTWO_THOUSAND\u003e analysts say the selling trend is likely to continue since india is the most expensive market in the world now and it is rational for fpis to sell here and move the money to cheaper markets this picture doesn t change even if the market turns more bullish on fears regarding us recession receding said dr v k vijayakumar experts added that while september is likely to see continued interest from fpis the flows would be shaped by a combination of domestic political stability economic indicators global interest rate movements market valuations sectoral preferences and the attractiveness of the debt market also read us fed chair jackson hole \u003cTWO_THOUSAND\u003e highlights powell says time has come for fed to slash interest rates the incursion not only mirrors the growing attractiveness of indian equities but also emphasizes the confidence foreign participants have shown in indias financial markets historically during geopolitical crises and other macro factors said purohit of bdo india also thanks to the market regulator s timely actions on easing business norms rolling out consultation papers on industry issues and being agile to accept and inculcate global best practices to make india a competitive and one of the most preferred destinations for embedding funds to get better returns as compared to other developing economies added purohit","timestamp":"2024-09-14T16:17:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}