{"url":"https://www.livemint.com/market/stock-market-news/it-stocks-plunge-as-investors-lock-in-gains-before-us-fed-rate-decision-nifty-it-drops-37-11726646836223.html","title":"IT stocks plunge as investors lock in gains before US Fed rate decision, Nifty IT drops 3.7%","description":"Indian IT stocks faced a sharp sell-off, with the Nifty IT index falling 3.7%, hitting a two-week low. This decline is attributed to profit booking after a strong rally, compounded by negative sentiment from Accenture's delayed promotions.","content":"Indian IT stocks experienced a sharp sell-off in Wednesday's trade, leading the Nifty IT index to plunge by 3.7% to 41,820 points, falling below the 42,000 mark for the first time since September 9.This decline has pushed the index to a two-week low. All 10 constituents are currently trading with significant losses, with MphasiS emerging as the biggest loser, dropping 5.6%. L\u0026T Technology Services, Persistent Systems, Tata Consultancy Services, HCL Technologies, and Tech Mahindra followed closely, each trading with losses ranging between 3% and 4%.Other major IT stocks, including Wipro, Infosys, Coforge, and LTIMindtree, are facing declines between 1.8% and 3.1%. Today's drop has also led the Nifty IT index to lose 2.02% in the current month so far.The sharp decline in IT stocks observed in today’s session is largely attributed to profit booking by investors, following a strong rally in recent months. Since June, IT stocks have been on a bullish run, with the Nifty IT index gaining significant momentum and closing in positive territory for three consecutive months.Between June and August, the Nifty IT index surged by an impressive 32%, prompting investors to lock in gains as part of a profit-taking strategy.This profit booking took place ahead of the anticipated rate-reduction cycle by the US Federal Reserve, expected to begin on Wednesday, September 18. With inflation easing significantly in the US and the labor market showing signs of cooling, investors are positioning themselves for the upcoming policy shift.\"Markets had already priced in a 25-basis point rate cut, with expectations that the Fed might opt for a 50 basis point reduction. Analysts believed that a 50-basis point cut could trigger a sharp rally in stocks.The sharp drop in IT shares is weighing on the overall market, dragging the frontline indices lower in today's intraday trading. Infosys, TCS, HCL Tech, and Tech Mahindra are among the major IT players pulling the Nifty 50 index down.However, strong support from financial stocks is helping offset a steeper decline, limiting the extent of the market’s overall losses.","cleaned_content":"indian it stocks experienced a sharp sell off in wednesdays trade leading the nifty it index to plunge by \u003cTHREE_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e points falling below the \u003cFOUR_TEN_THOUSAND\u003e mark for the first time since september \u003cNINE_\u003e this decline has pushed the index to a two week low all \u003cONE_TEN\u003e constituents are currently trading with significant losses with mphasis emerging as the biggest loser dropping \u003cFIVE_PERCENT\u003e l t technology services persistent systems tata consultancy services hcl technologies and tech mahindra followed closely each trading with losses ranging between \u003cTHREE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e other major it stocks including wipro infosys coforge and ltimindtree are facing declines between \u003cONE_PERCENT\u003e and \u003cTHREE_PERCENT\u003e todays drop has also led the nifty it index to lose \u003cTWO_PERCENT\u003e in the current month so far the sharp decline in it stocks observed in today s session is largely attributed to profit booking by investors following a strong rally in recent months since june it stocks have been on a bullish run with the nifty it index gaining significant momentum and closing in positive territory for three consecutive months between june and august the nifty it index surged by an impressive \u003cTHREE_TEN_PERCENT\u003e prompting investors to lock in gains as part of a profit taking strategy this profit booking took place ahead of the anticipated rate reduction cycle by the us federal reserve expected to begin on wednesday september \u003cONE_TEN\u003e with inflation easing significantly in the us and the labor market showing signs of cooling investors are positioning themselves for the upcoming policy shift markets had already priced in a \u003cTWO_TEN\u003e basis point rate cut with expectations that the fed might opt for a \u003cFIVE_TEN\u003e basis point reduction analysts believed that a \u003cFIVE_TEN\u003e basis point cut could trigger a sharp rally in stocks the sharp drop in it shares is weighing on the overall market dragging the frontline indices lower in todays intraday trading infosys tcs hcl tech and tech mahindra are among the major it players pulling the nifty \u003cFIVE_TEN\u003e index down however strong support from financial stocks is helping offset a steeper decline limiting the extent of the market s overall losses","timestamp":"2024-09-18T14:13:00+05:30","market_timestamp":"2024-09-18T14:13:00+05:30","off_market_hours":false}