{"url":"https://www.livemint.com/market/stock-market-news/irctc-share-price-climbs-3-as-lic-raises-stake-in-railway-psu-more-steam-left-11726208280199.html","title":"IRCTC share price climbs 3% as LIC raises stake in railway PSU. Should you buy?","description":"IRCTC share price opened at  ₹936 against its previous close of  ₹931.40 and rose 2.7 per cent to the level of  ₹956.80.","content":"IRCTC share price: Shares of Indian Railway Catering and Tourism Corporation (IRCTC) rose almost 3 per cent in morning trade on BSE on Friday, September 13, as the company disclosed in an exchange filing that the Life Insurance Corporation of India (LIC) raised its stake in the company.IRCTC share price opened at  ₹936 against its previous close of  ₹931.40 and rose 2.7 per cent to the level of  ₹956.80. It, however, pared gains and traded 0.90 per cent up at  ₹939.65 apiece around 12:15 pm.Meanwhile, LIC share price climbed over a per cent during the session and traded 0.65 per cent up at  ₹1,038.15 on the BSE at that time.In an exchange filing on Friday, September 13, IRCTC informed that LIC had increased its stake in the company by 2.02 per cent from December 16, 2022, to September 11, 2024.This came a day after LIC announced via an exchange filing that it had raised its stake in IRCTC.LIC, in its exchange filing on Thursday, September 12, said, \"This is to inform that the Life Insurance Corporation of India has increased its shareholding in equity shares of Indian Railway Catering and Tourism Corporation from 5,82,22,948 to 7,43,79,924, i.e., 7.278 per cent to 9.298 per cent of the paid-up capital of the said company.\"\"Holding increased from 7.278 per cent to 9.298 per cent, a net increase of 2.020 per cent in holding during the period from December 16, 2022, to September 11, 2024, at an average cost of  ₹657.614,\" LIC said.According to the shareholding pattern data of IRCTC, LIC held 7,18,15,695 shares, equivalent to an 8.98 per cent stake in IRCTC as of June 30, 2024.LIC's stake raise in the company is a positive development and indicates its long-term growth potential. Experts appear positive about the IRCTC stock for the long term.Avinash Gorakshkar, the head of research at Profitmart Securities, believes one can consider going long on the stock with an investment horizon of over two years.\"From a fundamental perspective, it is a positive development for IRCTC. This shows that LIC is positive on the stock for the longer term. LIC usually takes a position in a company if it is positive on it for the next two to three years. They do not take a short-term call,\" said Gorakshkar.\"Earnings visibility is strong, and growth prospects are good. IRCTC is a platform-based company that mainly earns money from ticketing, which is like a monopoly. Railways is making a conscious effort to improve efficiency. I think this business will never stop, and it is part and parcel of the Indian economy. IRCTC qualifies as a good long-term investment,\" Gorakshkar said.At the current market price, IRCTC share price has gained 37 per cent this year so far. It hit a 52-week low of  ₹636.10 on October 26 last year and a 52-week high of  ₹1,148.30 on May 22 this year, followed by sharp profit booking.On a monthly scale, the stock remained in the red from May to August this year. However, in September so far, it has gained about a per cent.Jigar S. Patel, Senior Manager of Equity Research at Anand Rathi Share and Stock Brokers, observed that IRCTC stock price has recently been consolidating around its 200-day exponential moving average (DEMA), often seen as a critical support level. This consolidation suggests that the stock is forming a solid base, indicating a potential shift in trend.\"During the current trading session, the stock attempted to break out of its consolidation range but could not sustain itself above the breakout level, signalling some resistance. From a technical indicator perspective, the daily Relative Strength Index (RSI) has bounced back from the 40 level, coinciding with a bearish trendline break,\" said Patel.\"This reversal in the RSI suggests that bullish momentum may be building in the coming sessions. However, to confirm this upward move, it is recommended to enter the stock only after a decisive close above  ₹953, targeting  ₹1,050, with a stop-loss set at  ₹895 on a daily closing basis to manage risk,\" Patel said.Read all market-related news here","cleaned_content":"irctc share price shares of indian railway catering and tourism corporation irctc rose almost \u003cTHREE_PERCENT\u003e in morning trade on bse on friday september \u003cONE_TEN\u003e as the company disclosed in an exchange filing that the life insurance corporation of india lic raised its stake in the company irctc share price opened at \u003cNINE_HUNDRED\u003e against its previous close of \u003cNINE_HUNDRED\u003e and rose \u003cTWO_PERCENT\u003e to the level of \u003cNINE_HUNDRED\u003e it however pared gains and traded \u003cZERO_PERCENT\u003e up at \u003cNINE_HUNDRED\u003e apiece around \u003cONE_TEN\u003e \u003cONE_TEN\u003e pm meanwhile lic share price climbed over a per cent during the session and traded \u003cZERO_PERCENT\u003e up at \u003cONE_THOUSAND\u003e on the bse at that time in an exchange filing on friday september \u003cONE_TEN\u003e irctc informed that lic had increased its stake in the company by \u003cTWO_PERCENT\u003e from december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e this came a day after lic announced via an exchange filing that it had raised its stake in irctc lic in its exchange filing on thursday september \u003cONE_TEN\u003e said this is to inform that the life insurance corporation of india has increased its shareholding in equity shares of indian railway catering and tourism corporation from \u003cFIVE_TEN_MILLION\u003e to \u003cSEVEN_TEN_MILLION\u003e i e \u003cSEVEN_PERCENT\u003e to \u003cNINE_PERCENT\u003e of the paid up capital of the said company holding increased from \u003cSEVEN_PERCENT\u003e to \u003cNINE_PERCENT\u003e a net increase of \u003cTWO_PERCENT\u003e in holding during the period from december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at an average cost of \u003cSIX_HUNDRED\u003e lic said according to the shareholding pattern data of irctc lic held \u003cSEVEN_TEN_MILLION\u003e shares equivalent to an \u003cEIGHT_PERCENT\u003e stake in irctc as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e lics stake raise in the company is a positive development and indicates its long term growth potential experts appear positive about the irctc stock for the long term avinash gorakshkar the head of research at profitmart securities believes one can consider going long on the stock with an investment horizon of over two years from a fundamental perspective it is a positive development for irctc this shows that lic is positive on the stock for the longer term lic usually takes a position in a company if it is positive on it for the next two to three years they do not take a short term call said gorakshkar earnings visibility is strong and growth prospects are good irctc is a platform based company that mainly earns money from ticketing which is like a monopoly railways is making a conscious effort to improve efficiency i think this business will never stop and it is part and parcel of the indian economy irctc qualifies as a good long term investment gorakshkar said at the current market price irctc share price has gained \u003cTHREE_TEN_PERCENT\u003e this year so far it hit a \u003cFIVE_TEN\u003e week low of \u003cSIX_HUNDRED\u003e on october \u003cTWO_TEN\u003e last year and a \u003cFIVE_TEN\u003e week high of \u003cONE_THOUSAND\u003e on may \u003cTWO_TEN\u003e this year followed by sharp profit booking on a monthly scale the stock remained in the red from may to august this year however in september so far it has gained about a per cent jigar s patel senior manager of equity research at anand rathi share and stock brokers observed that irctc stock price has recently been consolidating around its \u003cTWO_HUNDRED\u003e day exponential moving average dema often seen as a critical support level this consolidation suggests that the stock is forming a solid base indicating a potential shift in trend during the current trading session the stock attempted to break out of its consolidation range but could not sustain itself above the breakout level signalling some resistance from a technical indicator perspective the daily relative strength index rsi has bounced back from the \u003cFOUR_TEN\u003e level coinciding with a bearish trendline break said patel this reversal in the rsi suggests that bullish momentum may be building in the coming sessions however to confirm this upward move it is recommended to enter the stock only after a decisive close above \u003cNINE_HUNDRED\u003e targeting \u003cONE_THOUSAND\u003e with a stop loss set at \u003cEIGHT_HUNDRED\u003e on a daily closing basis to manage risk patel said read all market related news here","timestamp":"2024-09-13T15:16:00+05:30","market_timestamp":"2024-09-13T15:16:00+05:30","off_market_hours":false}