{"url":"https://www.livemint.com/market/stock-market-news/pelatro-ipo-booked-0-43-times-on-day-1-retail-portion-subscribed-0-79-times-11726486583846.html","title":"Pelatro IPO booked 21.53 times on Day 4, NII portion subscribed 55.21 times","description":"The IPO received bids for 40 lakh shares against 18.76 lakh shares on offer, resulting in subscription rate of 21.53 times, with the retail portion booked at 11.79 times, non-institutional buyers at 55.21 times, and qualified institutional buyers (QIB) at 15.22 times.","content":"The initial public offering (IPO) of Pelatro was 21.53 times subscribed as of 04:45 p.m. on the final day of bidding. The Retail Investors' portion booked at 11.79 times and the Non-Institutional Buyers' category at 55.21 times, while the QIB quota was booked at 15.22 times, as per the exchange date. The IPO received bids for 40 lakh shares out of the 18.76 lakh shares on offer.The company aims to raise  ₹55.98 crore through this IPO, which consists entirely of a fresh issue of 27.99 lakh shares. The price band is set between  ₹190 and  ₹200 per equity share, with a face value of  ₹10 per share. The minimum investment for retail investors is  ₹1,20,000 for a lot size of 600 shares.The share allotment is expected to be finalized on Friday, September 29, 2024, with shares anticipated to be listed on the NSE SME platform on Tuesday, September 24, 2024.The company plans to use the IPO proceeds for capital expenditure, purchasing and installing IT equipment, investing in a subsidiary, funding working capital needs, and other general corporate purposes.The company is a global technology firm that has developed a customer engagement platform called mViva, which enables customer-centric interactions between enterprises and their end users. mViva processes large amounts of data across nearly a billion consumers in 30 countries, helping businesses understand customer behavior and enhance engagement, according to the company's DRHP report.The platform offers a comprehensive range of services, including data collection, analysis, audience selection, and execution of marketing strategies based on behavioral insights. It is user-friendly, designed for marketers without technical expertise, and supports the creation of both short-term and long-term customer journeys.As of May 31, 2024, mViva has been implemented or is in progress across 38 telecom networks in 30 countries, including regions like Asia, Africa, the Middle East, and Europe, the DRHP report showed.","cleaned_content":"the initial public offering ipo of pelatro was \u003cTWO_TEN\u003e times subscribed as of \u003cFOUR_\u003e \u003cFOUR_TEN\u003e p m on the final day of bidding the retail investors portion booked at \u003cONE_TEN\u003e times and the non institutional buyers category at \u003cFIVE_TEN\u003e times while the qib quota was booked at \u003cONE_TEN\u003e times as per the exchange date the ipo received bids for \u003cFOUR_TEN\u003e lakh shares out of the \u003cONE_TEN\u003e lakh shares on offer the company aims to raise \u003cFIVE_TEN\u003e crore through this ipo which consists entirely of a fresh issue of \u003cTWO_TEN\u003e lakh shares the price band is set between \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e per equity share with a face value of \u003cONE_TEN\u003e per share the minimum investment for retail investors is \u003cONE_HUNDRED_THOUSAND\u003e for a lot size of \u003cSIX_HUNDRED\u003e shares the share allotment is expected to be finalized on friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e with shares anticipated to be listed on the nse sme platform on tuesday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company plans to use the ipo proceeds for capital expenditure purchasing and installing it equipment investing in a subsidiary funding working capital needs and other general corporate purposes the company is a global technology firm that has developed a customer engagement platform called mviva which enables customer centric interactions between enterprises and their end users mviva processes large amounts of data across nearly a billion consumers in \u003cTHREE_TEN\u003e countries helping businesses understand customer behavior and enhance engagement according to the companys drhp report the platform offers a comprehensive range of services including data collection analysis audience selection and execution of marketing strategies based on behavioral insights it is user friendly designed for marketers without technical expertise and supports the creation of both short term and long term customer journeys as of may \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e mviva has been implemented or is in progress across \u003cTHREE_TEN\u003e telecom networks in \u003cTHREE_TEN\u003e countries including regions like asia africa the middle east and europe the drhp report showed","timestamp":"2024-09-19T17:00:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}