{"url":"https://www.livemint.com/market/stock-market-news/lic-mutual-fund-buys-a-stake-in-multibagger-realty-stock-suraj-estate-developers-details-here-11726725286909.html","title":"LIC Mutual Fund buys a stake in this multibagger realty stock. Details here","description":"Multibagger stock: LIC Mutual Fund acquired nearly 3 lakh shares of this small-cap stock on September 17 at  ₹758.89 each. The stock has surged over 200 per cent from its 52-week low of  ₹255.80 in six months.","content":"Multibagger stock: Shares of realty player Suraj Estate Developers fell nearly 2 per cent in intraday trade on NSE on Thursday, September 19, looking set to snap their three-day winning run even as the company said LIC Mutual Fund – Flexi Cap Fund, had picked its nearly 3 lakh shares on 17 September. As per bulk deal data available on NSE, LIC Mutual Fund—Flexi Cap Fund picked 2,83,616 shares in Suraj Estate Developers on 17 September, at an average price of  ₹758.89.Suraj Estate Developers share price opened at  ₹784 against its previous close of  ₹782.10 and fell 1.5 per cent to the level of  ₹770.The small-cap stock has been on a roll over the last six months. It hit its 52-week low of  ₹255.80 on March 27 and its 52-week high of  ₹847 on August 20 this year.At the current market price of  ₹770.05, it has surged over 200 per cent from its 52-week low level in about six months.On a monthly scale, the stock is down after three months. It has dropped 4 per cent in September so far. In June, July and August this year, the stock surged 30 per cent, 39 per cent and 15 per cent, respectively.Recently, the company announced that it secured shareholder approval to raise  ₹500 crore via preferential issuing shares and warrants.According to the company, after the issuance of equity shares and convertible share warrants, the promoter and promoter group holding will be diluted from 74.95 per cent, as of 30 June 2024, to 64.82 per cent.\"The proposed issue will bring on board large HNIs and family offices. The company proposes to utilise the net proceeds for land acquisition, working capital requirements, general corporate purposes and issue-related expenses,\" said the company.“We are delighted with the overwhelming support from our shareholders for this significant capital raise. The proceeds will enable us to accelerate our growth plans and strengthen our market position. We are confident that this will create long-term value for our shareholders,” said Rahul Rajan Jesu Thomas, whole-time director at Suraj Estate Developers.Meanwhile, the company has fixed September 20 as the record date for the purpose of dividend payment. The company will hold its annual general meeting on September 26.The real estate company specialises in redevelopment and has a significant presence in the South Central Mumbai (SCM) market. The company is focused primarily on value luxury and the luxury and commercial segments. However, it is now venturing into residential real estate development in the Bandra sub-market.\"Suraj Estate Developers has 13 ongoing projects with a developable area of 20.34 lakh square feet and a saleable RERA carpet area of 6.1 lakh square feet and 18 upcoming Projects with an estimated carpet area of ~9.01 lakh square feet,\" said the company.Read all market-related news here","cleaned_content":"multibagger stock shares of realty player suraj estate developers fell nearly \u003cTWO_PERCENT\u003e in intraday trade on nse on thursday september \u003cONE_TEN\u003e looking set to snap their three day winning run even as the company said lic mutual fund flexi cap fund had picked its nearly \u003cTHREE_\u003e lakh shares on \u003cONE_TEN\u003e september as per bulk deal data available on nse lic mutual fund flexi cap fund picked \u003cTWO_HUNDRED_THOUSAND\u003e shares in suraj estate developers on \u003cONE_TEN\u003e september at an average price of \u003cSEVEN_HUNDRED\u003e suraj estate developers share price opened at \u003cSEVEN_HUNDRED\u003e against its previous close of \u003cSEVEN_HUNDRED\u003e and fell \u003cONE_PERCENT\u003e to the level of \u003cSEVEN_HUNDRED\u003e the small cap stock has been on a roll over the last six months it hit its \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e on march \u003cTWO_TEN\u003e and its \u003cFIVE_TEN\u003e week high of \u003cEIGHT_HUNDRED\u003e on august \u003cTWO_TEN\u003e this year at the current market price of \u003cSEVEN_HUNDRED\u003e it has surged over \u003cTWO_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low level in about six months on a monthly scale the stock is down after three months it has dropped \u003cFOUR_PERCENT\u003e in september so far in june july and august this year the stock surged \u003cTHREE_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively recently the company announced that it secured shareholder approval to raise \u003cFIVE_HUNDRED\u003e crore via preferential issuing shares and warrants according to the company after the issuance of equity shares and convertible share warrants the promoter and promoter group holding will be diluted from \u003cSEVEN_TEN_PERCENT\u003e as of \u003cTHREE_TEN\u003e june \u003cTWO_THOUSAND\u003e to \u003cSIX_TEN_PERCENT\u003e the proposed issue will bring on board large hnis and family offices the company proposes to utilise the net proceeds for land acquisition working capital requirements general corporate purposes and issue related expenses said the company we are delighted with the overwhelming support from our shareholders for this significant capital raise the proceeds will enable us to accelerate our growth plans and strengthen our market position we are confident that this will create long term value for our shareholders said rahul rajan jesu thomas whole time director at suraj estate developers meanwhile the company has fixed september \u003cTWO_TEN\u003e as the record date for the purpose of dividend payment the company will hold its annual general meeting on september \u003cTWO_TEN\u003e the real estate company specialises in redevelopment and has a significant presence in the south central mumbai scm market the company is focused primarily on value luxury and the luxury and commercial segments however it is now venturing into residential real estate development in the bandra sub market suraj estate developers has \u003cONE_TEN\u003e ongoing projects with a developable area of \u003cTWO_TEN\u003e lakh square feet and a saleable rera carpet area of \u003cSIX_\u003e lakh square feet and \u003cONE_TEN\u003e upcoming projects with an estimated carpet area of \u003cNINE_\u003e lakh square feet said the company read all market related news here","timestamp":"2024-09-19T12:06:00+05:30","market_timestamp":"2024-09-19T12:06:00+05:30","off_market_hours":false}