{"url":"https://www.livemint.com/market/stock-market-news/multibagger-ipo-sme-stock-quicktouch-tech-allots-3-2-lakh-warrants-11726212339412.html","title":"Multibagger IPO: SME stock Quicktouch Tech allots 3.2 lakh warrants","description":"Quicktouch Technologies approved the conversion of 320,000 warrants into equity shares, drawing investor interest. Despite recent corrections, the stock has risen over 162 per cent since its IPO in May 2023, reflecting strong demand and recovery potential in the competitive IT services sector.","content":"SME stock Quicktouch Technologies, an IT services company, garnered attention on Friday after the board approved the conversion of 3.2 lakh warrants into equity shares. The move has sparked renewed interest in the stock, which has delivered multi-bagger returns since last year's listing despite some recent corrections.On Thursday, September 12, 2024, the company's board of directors announced that they had approved the allotment of 3,20,000 equity shares following the conversion of 3,20,000 warrants. The conversion was completed at an issue price of  ₹196.17 per share, including a premium of  ₹186.17, under the non-promoter/public category on a preferential basis. The total amount received for this conversion was  ₹4.70 crore, with  ₹147.128 per warrant being paid, representing 75 per cent of the issue price.During Friday’s trade, shares of Quicktouch Technologies were up by 1 per cent, trading at  ₹160.20. Nearly 40 lakh shares were traded during the session, reflecting strong investor interest following the warrant conversion news. The stock continues to be in focus as investors evaluate the potential impact of the increased equity base and the company's future growth prospects.Quicktouch Technologies, listed in May 2023 on NSE's SME platform, has made multi-bagger gains since its  ₹61 IPO price, climbing over 162 per cent to trade around  ₹160. The company's IPO, which raised  ₹9.33 crore, was open for subscription in April 2023 and saw strong demand. Despite its stellar post-IPO performance, the stock has faced some headwinds, declining over 19 per cent in the last year and 2024 year-to-date.However, the SME stock has shown signs of recovery in recent months. In September, it gained over 4 per cent, continuing its positive trend for the fourth consecutive month. The stock rose 5 per cent in August, 21 per cent in July, and 2 per cent in June, following a sharp 38 per cent decline in May. Earlier in the year, the stock saw corrections in February and March, but January witnessed a 10 per cent gain.Quicktouch Technologies confirmed the allotment of equity shares on the conversion of warrants to non-promoters and public investors in a regulatory filing. These warrants, issued under SEBI's ICDR Regulations 2018, had an initial payment of  ₹49.042 per warrant, representing 25 per cent of the issue price. The remaining 75 per cent, or  ₹147.128 per warrant, was paid upon conversion, allowing holders to receive equal equity shares.As a result of this conversion, the company's issued and paid-up capital increased to  ₹6.64 crore, consisting of 66,43,796 equity shares of Re 10 each. The new shares will rank pari-passu with the company's existing equity shares.Quicktouch Technologies has delivered impressive returns since its IPO but has also faced periods of volatility. The recent conversion of warrants into equity shares marks a significant development for the company, further strengthening its capital structure. As the stock continues its recovery, investors remain keen on the company's future trajectory in the highly competitive IT services sector.","cleaned_content":"sme stock quicktouch technologies an it services company garnered attention on friday after the board approved the conversion of \u003cTHREE_\u003e lakh warrants into equity shares the move has sparked renewed interest in the stock which has delivered multi bagger returns since last years listing despite some recent corrections on thursday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the companys board of directors announced that they had approved the allotment of \u003cTHREE_HUNDRED_THOUSAND\u003e equity shares following the conversion of \u003cTHREE_HUNDRED_THOUSAND\u003e warrants the conversion was completed at an issue price of \u003cONE_HUNDRED\u003e per share including a premium of \u003cONE_HUNDRED\u003e under the non promoter public category on a preferential basis the total amount received for this conversion was \u003cFOUR_\u003e crore with \u003cONE_HUNDRED\u003e per warrant being paid representing \u003cSEVEN_TEN_PERCENT\u003e of the issue price during friday s trade shares of quicktouch technologies were up by \u003cONE_PERCENT\u003e trading at \u003cONE_HUNDRED\u003e nearly \u003cFOUR_TEN\u003e lakh shares were traded during the session reflecting strong investor interest following the warrant conversion news the stock continues to be in focus as investors evaluate the potential impact of the increased equity base and the companys future growth prospects quicktouch technologies listed in may \u003cTWO_THOUSAND\u003e on nses sme platform has made multi bagger gains since its \u003cSIX_TEN\u003e ipo price climbing over \u003cONE_HUNDRED_PERCENT\u003e to trade around \u003cONE_HUNDRED\u003e the companys ipo which raised \u003cNINE_\u003e crore was open for subscription in april \u003cTWO_THOUSAND\u003e and saw strong demand despite its stellar post ipo performance the stock has faced some headwinds declining over \u003cONE_TEN_PERCENT\u003e in the last year and \u003cTWO_THOUSAND\u003e year to date however the sme stock has shown signs of recovery in recent months in september it gained over \u003cFOUR_PERCENT\u003e continuing its positive trend for the fourth consecutive month the stock rose \u003cFIVE_PERCENT\u003e in august \u003cTWO_TEN_PERCENT\u003e in july and \u003cTWO_PERCENT\u003e in june following a sharp \u003cTHREE_TEN_PERCENT\u003e decline in may earlier in the year the stock saw corrections in february and march but january witnessed a \u003cONE_TEN_PERCENT\u003e gain quicktouch technologies confirmed the allotment of equity shares on the conversion of warrants to non promoters and public investors in a regulatory filing these warrants issued under sebis icdr regulations \u003cTWO_THOUSAND\u003e had an initial payment of \u003cFOUR_TEN\u003e per warrant representing \u003cTWO_TEN_PERCENT\u003e of the issue price the remaining \u003cSEVEN_TEN_PERCENT\u003e or \u003cONE_HUNDRED\u003e per warrant was paid upon conversion allowing holders to receive equal equity shares as a result of this conversion the companys issued and paid up capital increased to \u003cSIX_\u003e crore consisting of \u003cSIX_MILLION\u003e equity shares of re \u003cONE_TEN\u003e each the new shares will rank pari passu with the companys existing equity shares quicktouch technologies has delivered impressive returns since its ipo but has also faced periods of volatility the recent conversion of warrants into equity shares marks a significant development for the company further strengthening its capital structure as the stock continues its recovery investors remain keen on the companys future trajectory in the highly competitive it services sector","timestamp":"2024-09-13T13:32:00+05:30","market_timestamp":"2024-09-13T13:32:00+05:30","off_market_hours":false}