{"url":"https://www.livemint.com/market/stock-market-news/kalyan-jewellers-stock-jumps-over-7-hits-new-record-high-for-3rd-day-in-a-row-what-s-driving-the-surge-11726197344061.html","title":"Kalyan Jewellers stock jumps over 7%, hits new record high for 3rd day in a row: What’s driving the surge?","description":"HSBC Securities has lifted its target price on Kalyan Jewellers' target price to  ₹810, maintaining a 'buy' rating. Despite an 800 percent rise in two years, the brokerage sees further growth potential due to Kalyan’s evolving business model and market positioning.","content":"Shares of Kalyan Jewellers India, one of the country's largest jewellery firms, continued its winning streak for a third consecutive session on Friday, reaching an all-time high of  ₹739.80 per share with a 7.3 per cent gain. This brought the total three-day cumulative rise to 15.5 per cent.The recent surge in the stock followed a target price upgrade by global brokerage HSBC Securities. The brokerage raised its target on the stock to  ₹810 per share, up from the previous target of  ₹610, while maintaining a 'buy' rating. This revised target suggests a potential upside of 23.5 per cent from the stock's most recent closing price.Despite an 800 per cent rally over the past two years, HSBC believes the stock is still in the early stages of its value-creation journey. The firm also notes that despite the significant increase in value, Kalyan Jewellers is trading at an estimated FY26 P/E ratio of approximately 56x, which represents a 10 per cent discount compared to the market leader, Titan.HSBS said, “Kalyan’s stock price has risen 8x in the past two years as the business model successfully transformed through the capital-light franchise model (leading to a three-year revenue CAGR of 30 per cent and a PAT CAGR of 58 per cent), unlocking the structurally high growth.”HSBC Securities noted that Kalyan Jewellers is at a comparable stage to Titan in FY17. As of the end of FY24, Kalyan Jewellers operates 204 stores and has achieved a revenue CAGR of 30 per cent over the past three years, with an FY26 PE ratio of 56x. This mirrored Titan’s position in FY17 when it had 209 stores (including Tanishq and Zoya) and a 12-month forward PE ratio of 56x.The brokerage highlighted that Titan's P/E consistently expanded as it grew structurally and expanded its store network rather than contracting. If Kalyan can execute effectively in capability building, market execution, and network expansion, it could emerge as another long-term compounding opportunity. Despite the stock’s significant rise, the brokerage views it as a risk worth taking.Exponential Growth Potential: With 217 stores, less than half of Titan's, Kalyan Jewellers has significant room for expansion. The brokerage sees potential for the store count to quadruple within this decade, driving industry-leading revenue growth and positioning Kalyan as a compelling long-term compounding opportunity.Established National Brand: Kalyan has evolved into a well-recognized national brand, similar to Titan, which sets it apart from regional competitors. This brand strength supports its right to pursue capital-light expansion across India, enhancing its competitive edge.Resilient \"Aspirational Yet Value\" Positioning: Kalyan’s positioning as an \"aspirational yet value-driven\" brand makes it less vulnerable to disruptive competition. To an extent, Kalyan is somewhat of a disruptor itself that is reshaping the value proposition in the organised jewellery segment, said the brokerage.Scaling Opportunities with Candere: After successfully expanding the Kalyan format through the franchise model, the brokerage said there is an opportunity to scale up Candere (studded jewellery), similar to how Titan scaled Caratlane. A successful scale-up could catalyze further stock performance.The brokerage lists the following two key factors that could drive margin expansion:Owned Stores: Kalyan can capture greater value and trigger gradual long-term margin growth by opening more owned stores in lucrative markets instead of relying on franchise partners.Improved Trade Terms: With a stronger track record, Kalyan could benefit from better trade terms, such as reduced gold loan interest rates, further boosting margins.Attractive Valuation: At an FY26 P/E of 56x, the brokerage believes the stock still appears attractively valued compared to other high-growth consumer companies like Dmart and Titan. This valuation is appealing, given the company’s structural growth prospects.Growing Investor Confidence: A rising investor base has contributed to lowering Kalyan’s hurdle rate, as its return on equity (ROE) has consistently improved, and growth appears sustainable. This strong investor sentiment further supports Kalyan’s long-term outlook, it underscored.","cleaned_content":"shares of kalyan jewellers india one of the countrys largest jewellery firms continued its winning streak for a third consecutive session on friday reaching an all time high of \u003cSEVEN_HUNDRED\u003e per share with a \u003cSEVEN_PERCENT\u003e gain this brought the total three day cumulative rise to \u003cONE_TEN_PERCENT\u003e the recent surge in the stock followed a target price upgrade by global brokerage hsbc securities the brokerage raised its target on the stock to \u003cEIGHT_HUNDRED\u003e per share up from the previous target of \u003cSIX_HUNDRED\u003e while maintaining a buy rating this revised target suggests a potential upside of \u003cTWO_TEN_PERCENT\u003e from the stocks most recent closing price despite an \u003cEIGHT_HUNDRED_PERCENT\u003e rally over the past two years hsbc believes the stock is still in the early stages of its value creation journey the firm also notes that despite the significant increase in value kalyan jewellers is trading at an estimated fy26 p e ratio of approximately \u003cFIVE_TEN\u003e x which represents a \u003cONE_TEN_PERCENT\u003e discount compared to the market leader titan hsbs said kalyan s stock price has risen \u003cEIGHT_\u003e x in the past two years as the business model successfully transformed through the capital light franchise model leading to a three year revenue cagr of \u003cTHREE_TEN_PERCENT\u003e and a pat cagr of \u003cFIVE_TEN_PERCENT\u003e unlocking the structurally high growth hsbc securities noted that kalyan jewellers is at a comparable stage to titan in fy17 as of the end of fy24 kalyan jewellers operates \u003cTWO_HUNDRED\u003e stores and has achieved a revenue cagr of \u003cTHREE_TEN_PERCENT\u003e over the past three years with an fy26 pe ratio of \u003cFIVE_TEN\u003e x this mirrored titan s position in fy17 when it had \u003cTWO_HUNDRED\u003e stores including tanishq and zoya and a \u003cONE_TEN\u003e month forward pe ratio of \u003cFIVE_TEN\u003e x the brokerage highlighted that titans p e consistently expanded as it grew structurally and expanded its store network rather than contracting if kalyan can execute effectively in capability building market execution and network expansion it could emerge as another long term compounding opportunity despite the stock s significant rise the brokerage views it as a risk worth taking exponential growth potential with \u003cTWO_HUNDRED\u003e stores less than half of titans kalyan jewellers has significant room for expansion the brokerage sees potential for the store count to quadruple within this decade driving industry leading revenue growth and positioning kalyan as a compelling long term compounding opportunity established national brand kalyan has evolved into a well recognized national brand similar to titan which sets it apart from regional competitors this brand strength supports its right to pursue capital light expansion across india enhancing its competitive edge resilient aspirational yet value positioning kalyan s positioning as an aspirational yet value driven brand makes it less vulnerable to disruptive competition to an extent kalyan is somewhat of a disruptor itself that is reshaping the value proposition in the organised jewellery segment said the brokerage scaling opportunities with candere after successfully expanding the kalyan format through the franchise model the brokerage said there is an opportunity to scale up candere studded jewellery similar to how titan scaled caratlane a successful scale up could catalyze further stock performance the brokerage lists the following two key factors that could drive margin expansion owned stores kalyan can capture greater value and trigger gradual long term margin growth by opening more owned stores in lucrative markets instead of relying on franchise partners improved trade terms with a stronger track record kalyan could benefit from better trade terms such as reduced gold loan interest rates further boosting margins attractive valuation at an fy26 p e of \u003cFIVE_TEN\u003e x the brokerage believes the stock still appears attractively valued compared to other high growth consumer companies like dmart and titan this valuation is appealing given the company s structural growth prospects growing investor confidence a rising investor base has contributed to lowering kalyan s hurdle rate as its return on equity roe has consistently improved and growth appears sustainable this strong investor sentiment further supports kalyan s long term outlook it underscored","timestamp":"2024-09-13T10:54:00+05:30","market_timestamp":"2024-09-13T10:54:00+05:30","off_market_hours":false}