{"url":"https://www.livemint.com/market/stock-market-news/us-fed-rate-cut-experts-give-stocks-to-buy-tag-to-these-two-it-shares-should-you-buy-11726296059694.html","title":"US Fed rate cut: Experts give ’stocks to buy’ tag to these two IT shares. Should you buy?","description":"US Fed rate cut: Experts have recommended two stocks to buy on Monday — OFSS, LTIMindtree","content":"Stocks to buy: Ahead of the US Fed meeting scheduled next week, market experts are expecting an aggressive interest rate cut announcement, which may spurt strong buying in rate-sensitive stocks like IT, banking, real estate, auto, etc. As most IT stocks are available at a discounted price, experts are betting high on the IT stocks, but in the mid-cap segment. They said the market has already discounted a 25 bps US Fed rate cut, and the expectations are high that a 50 bps interest rate cut will be announced on Wednesday. Unveiling the investment strategy before the US Fed meeting, they advised two IT stocks to buy on Monday: Oracle Financial Services Software (OFSS) and LTIMindtree.On why one should look at IT stocks ahead of the US Fed meeting, Prashanth Tapse, Senior Vice President of Research at Mehta Equities, said, \"After a comfortable US economic data released last week, the market is expecting an aggressive US Fed rate cut cycle in the remaining months of current years. IT stocks may outperform other segments if a 50 bps rate cut is announced in the upcoming US Fed meeting next week. Bulls are expected to pounce on the IT stocks, available at discounted prices. However, other rate-sensitive segments like banking, auto and real estate stocks will also be in focus.\"Prashanth Tapse of Mehta Equities said that mid-cap stocks are expected to outperform small-cap and large-cap IT stocks and advised stock market investors to take long positions.Regarding IT shares to buy before the US Fed meeting, Prashanth Tapse said, “One can look at buying these two mid-cap IT shares: OFSS and LTIMindtree.”Speaking on the outlook for LTIMindtree shares, Sumeet Bagadia, Executive Director at Choice Broking, said, “LTIM Ltd is currently trading at  ₹6416.2 and has shown a strong rally from lower levels, forming a higher high and higher low pattern. The immediate support for LTIM is at  ₹6231. closely aligned with the 10-day Exponential Moving Average (EMA), signifies historical buying interest and provides a foundation for the stock's price stability. This level serves as a potential stop for downward movements. A good buying opportunity is near  ₹6333 for those looking to go long on the stock. If the price breaks the  ₹6444 mark, stock can move towards  ₹6666 levels and higher. For a cautious approach, buying on dips is suggested at  ₹6333, with a stop-loss (SL) at  ₹6231. The targets for this trade are  ₹6666.”On the suggestion to investors regarding OFSS shares, Bagadia said, “OFSS share is currently trading at  ₹12261.9 levels. OFSS weekly chart analysis offers a favourable view for the coming days, indicating a sustainable upside bounce this week. The stock price moved in a larger consolidation pattern in the last few months. And is attempting to break above  ₹11000 to  ₹11450.”\"Investors, especially those who entered at lower levels, could consider a prudent approach trailing stop-loss orders near  ₹11,180, which is also close to its 20-Day EMA levels, can safeguard profits and manage risks effectively. One can purchase the stock at CMP for fresh investments, which can also be added to dips near  ₹11,777. Implementing a strict stop-loss at  ₹11,180 offers a risk management mechanism, ensuring protection against adverse market movements,\" Bagadia concluded.","cleaned_content":"stocks to buy ahead of the us fed meeting scheduled next week market experts are expecting an aggressive interest rate cut announcement which may spurt strong buying in rate sensitive stocks like it banking real estate auto etc as most it stocks are available at a discounted price experts are betting high on the it stocks but in the mid cap segment they said the market has already discounted a \u003cTWO_TEN\u003e bps us fed rate cut and the expectations are high that a \u003cFIVE_TEN\u003e bps interest rate cut will be announced on wednesday unveiling the investment strategy before the us fed meeting they advised two it stocks to buy on monday oracle financial services software ofss and ltimindtree on why one should look at it stocks ahead of the us fed meeting prashanth tapse senior vice president of research at mehta equities said after a comfortable us economic data released last week the market is expecting an aggressive us fed rate cut cycle in the remaining months of current years it stocks may outperform other segments if a \u003cFIVE_TEN\u003e bps rate cut is announced in the upcoming us fed meeting next week bulls are expected to pounce on the it stocks available at discounted prices however other rate sensitive segments like banking auto and real estate stocks will also be in focus prashanth tapse of mehta equities said that mid cap stocks are expected to outperform small cap and large cap it stocks and advised stock market investors to take long positions regarding it shares to buy before the us fed meeting prashanth tapse said one can look at buying these two mid cap it shares ofss and ltimindtree speaking on the outlook for ltimindtree shares sumeet bagadia executive director at choice broking said ltim ltd is currently trading at \u003cSIX_THOUSAND\u003e and has shown a strong rally from lower levels forming a higher high and higher low pattern the immediate support for ltim is at \u003cSIX_THOUSAND\u003e closely aligned with the \u003cONE_TEN\u003e day exponential moving average ema signifies historical buying interest and provides a foundation for the stocks price stability this level serves as a potential stop for downward movements a good buying opportunity is near \u003cSIX_THOUSAND\u003e for those looking to go long on the stock if the price breaks the \u003cSIX_THOUSAND\u003e mark stock can move towards \u003cSIX_THOUSAND\u003e levels and higher for a cautious approach buying on dips is suggested at \u003cSIX_THOUSAND\u003e with a stop loss sl at \u003cSIX_THOUSAND\u003e the targets for this trade are \u003cSIX_THOUSAND\u003e on the suggestion to investors regarding ofss shares bagadia said ofss share is currently trading at \u003cONE_TEN_THOUSAND\u003e levels ofss weekly chart analysis offers a favourable view for the coming days indicating a sustainable upside bounce this week the stock price moved in a larger consolidation pattern in the last few months and is attempting to break above \u003cONE_TEN_THOUSAND\u003e to \u003cONE_TEN_THOUSAND\u003e investors especially those who entered at lower levels could consider a prudent approach trailing stop loss orders near \u003cONE_TEN_THOUSAND\u003e which is also close to its \u003cTWO_TEN\u003e day ema levels can safeguard profits and manage risks effectively one can purchase the stock at cmp for fresh investments which can also be added to dips near \u003cONE_TEN_THOUSAND\u003e implementing a strict stop loss at \u003cONE_TEN_THOUSAND\u003e offers a risk management mechanism ensuring protection against adverse market movements bagadia concluded","timestamp":"2024-09-14T12:32:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}