{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-us-fed-rate-cut-five-stocks-to-buy-or-sell-on-monday-sept-16-11726393210094.html","title":"Stock market today: Trade setup for Nifty 50 to US Fed rate cut, five stocks to buy or sell on Monday — Sept 16","description":"Stock Market Today: Benchmark indices on Friday though ended a tad lower , nevertheless Nifty-50 ended with weekly gains of 2% indicating positive short term momentum. Here's Trade setup for Nifty 50 to global cues amidst US Fed rate cut expectations \u0026 5 stocks to buy or sell on Monday — Sept 16","content":"Stock market today: Friday's trading was dull, and the Indian stock market ended a little lower as it took a break after a strong rally on Thursday. The Nifty 50 index ended 32.40 points lower at 25,356.50 marking losses of 0.13% on Friday while the S\u0026P BSE Sensex after shedding 77.17 point also ended 0.9% lower at 82,890.94Bank Nifty, however, defied the trend followed by benchmark indices, ending the day with 0.32% gains on Friday.Banks and Telecom remained top performers during the week, while PSUs and autos were the top underperformers. The Nifty-50 Index ended the week with around 2% gains over the previous week's close and outperformed most of the Asian Peers and Emerging markets. The broader trend of the markets, thereby, can be assumed to still be positive, though volatility persists.Nagaraj Shetti, senior technical research analyst at HDFC Securities, said the Nifty's short-term trend continues to be positive. A sustainable move above 25,400 could pull the Nifty 50 index towards the next upside of around 25,800 in the near term, said Shetti. As per him, Immediate support for Nifty today is placed at 25,200.For the Bank Nifty too Bank Nifty that has managed to maintain its strength, ultimately closing on a positive note at 51,938 on Friday, despite volatility the analyst expect positve momentum continues. Hrishikesh Yedve, AVP of Technical and Derivatives Research at Asit C Mehta, said that the index has witnessed a breakout of a cup and handle pattern on the daily chart, indicating strength. According to this pattern, the index could test 52,800–53,000 in the short term as per Yedve and 53,800 in the medium term. The 21-DEMA support is currently placed near 51,220. Therefore, Yedve recommends “buy on dips” strategy for Bank Nifty as long as it stays above 51,220.Overall Siddhartha Khemka, Head of Research — Wealth Management at Motilal Oswal, expects the market to consolidate in a broader range and investors to remain cautious as major banks worldwide will announce their policy statements this week. With a 25bps rate cut by the ECB and China expected to cut rates on $5tn mortgages in an upcoming US Fed meeting, hopes of the US Fed rate cut are higher. This has been further strengthened by recently released inflation and disappointing employment data in the US. Thus, interest-sensitive sectors are likely to be the focus next week.Stock picks for the day include two recommendations by stock market expert Sumeet Bagadia, Executive Director at Choice Broking, and three picks by Ganesh Dongre, Senior Manager of technical Research at Anand Rathi. They have recommended buying five shares: Gujarat Fluorochemicals Ltd, Century Textiles and Industries Ltd, Mishra Dhatu Nigam Ltd, Sakthi Sugar, and Ami Organics Ltd.1] Gujarat Fluorochemicals: Sumit Bagadia, Executive Director at Choice Broking recomend Buying Gujarat Fluorochemicals in cash market. The current share prices stands at  ₹4389.6 while Bagadia recomend buying keeping a stop Loss at  ₹4222 for a target price of  ₹4646On the daily chart, the stock has formed a strong bullish momentum candle, signifying a resurgence of strength in its price action, as per Bagadia. A robust support level is situated at 4222 levels. This confluence of support factors enhances the stock's stability and resilience. Gujarat Fluorochemicals is trading above all the important moving averages, underscoring its overall bullish posture and trend.2] Century Textiles and Industries: Bagadia recommends buying Century Textiles with a stop Loss at  ₹2790 and a target of  ₹3155. Century Textiles is trading at a current market Price of  ₹2896.10.The daily chart analysis offers a favorable view for the following week, indicating a steady higher advance, said Bagadia. Notably, the stock has produced a notable higher high and higher low pattern in weekly frame and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.3] Mishra Dhatu Nigam Ltd- Ganesh Dongre, Senior Manager - Technical Research at Anand Rathi Research recommends buying Mishra Dhatu Nigam Ltd share price that is currently trading at close to  ₹398. Dongre recommends keeping a stop loss at  ₹390 and buying for target price of  ₹425.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 425. At present, the stock is maintaining a crucial support level at Rs.390 Given the current market price of Rs.398, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 425.4] Sakthi Sugar: Dongre recommends buying Sakthi Sugar at  ₹38 keeping a stop loss at  ₹35 for a target price of  ₹42. On the daily chart of this stock, support at  ₹35 level has been observed, signaling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 35 is recommended. The target price for this strategy is Rs. 42 in the upcoming weeks as per Dongre, suggesting a potential gain as the stock continues its upward trajectory.5] Ami Organics: Dongre recommends buying Ami Organics at  ₹1510, keeping stop loss at  ₹1480 for a target of  ₹1560. On the short-term chart, this stock has formed a bullish engulfing pattern , which is inherently bullish in nature. Currently priced at Rs. 1510, this formation signals a potential upward trend. To effectively manage risk, a stop loss at Rs. 1480 is recommended. .The target price for this strategy is Rs. 1560 in the upcoming weeks. as per Dongre. This suggests a potential gain as the stock continues its upward trajectory, backed by the bullish technical signals.","cleaned_content":"stock market today fridays trading was dull and the indian stock market ended a little lower as it took a break after a strong rally on thursday the nifty \u003cFIVE_TEN\u003e index ended \u003cTHREE_TEN\u003e points lower at \u003cTWO_TEN_THOUSAND\u003e marking losses of \u003cZERO_PERCENT\u003e on friday while the s p bse sensex after shedding \u003cSEVEN_TEN\u003e point also ended \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e bank nifty however defied the trend followed by benchmark indices ending the day with \u003cZERO_PERCENT\u003e gains on friday banks and telecom remained top performers during the week while psus and autos were the top underperformers the nifty \u003cFIVE_TEN\u003e index ended the week with around \u003cTWO_PERCENT\u003e gains over the previous weeks close and outperformed most of the asian peers and emerging markets the broader trend of the markets thereby can be assumed to still be positive though volatility persists nagaraj shetti senior technical research analyst at hdfc securities said the niftys short term trend continues to be positive a sustainable move above \u003cTWO_TEN_THOUSAND\u003e could pull the nifty \u003cFIVE_TEN\u003e index towards the next upside of around \u003cTWO_TEN_THOUSAND\u003e in the near term said shetti as per him immediate support for nifty today is placed at \u003cTWO_TEN_THOUSAND\u003e for the bank nifty too bank nifty that has managed to maintain its strength ultimately closing on a positive note at \u003cFIVE_TEN_THOUSAND\u003e on friday despite volatility the analyst expect positve momentum continues hrishikesh yedve avp of technical and derivatives research at asit c mehta said that the index has witnessed a breakout of a cup and handle pattern on the daily chart indicating strength according to this pattern the index could test \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e in the short term as per yedve and \u003cFIVE_TEN_THOUSAND\u003e in the medium term the \u003cTWO_TEN\u003e dema support is currently placed near \u003cFIVE_TEN_THOUSAND\u003e therefore yedve recommends buy on dips strategy for bank nifty as long as it stays above \u003cFIVE_TEN_THOUSAND\u003e overall siddhartha khemka head of research wealth management at motilal oswal expects the market to consolidate in a broader range and investors to remain cautious as major banks worldwide will announce their policy statements this week with a \u003cTWO_TEN\u003e bps rate cut by the ecb and china expected to cut rates on \u003cFIVE_\u003e tn mortgages in an upcoming us fed meeting hopes of the us fed rate cut are higher this has been further strengthened by recently released inflation and disappointing employment data in the us thus interest sensitive sectors are likely to be the focus next week stock picks for the day include two recommendations by stock market expert sumeet bagadia executive director at choice broking and three picks by ganesh dongre senior manager of technical research at anand rathi they have recommended buying five shares gujarat fluorochemicals ltd century textiles and industries ltd mishra dhatu nigam ltd sakthi sugar and ami organics ltd 1 gujarat fluorochemicals sumit bagadia executive director at choice broking recomend buying gujarat fluorochemicals in cash market the current share prices stands at \u003cFOUR_THOUSAND\u003e while bagadia recomend buying keeping a stop loss at \u003cFOUR_THOUSAND\u003e for a target price of \u003cFOUR_THOUSAND\u003e on the daily chart the stock has formed a strong bullish momentum candle signifying a resurgence of strength in its price action as per bagadia a robust support level is situated at \u003cFOUR_THOUSAND\u003e levels this confluence of support factors enhances the stocks stability and resilience gujarat fluorochemicals is trading above all the important moving averages underscoring its overall bullish posture and trend 2 century textiles and industries bagadia recommends buying century textiles with a stop loss at \u003cTWO_THOUSAND\u003e and a target of \u003cTHREE_THOUSAND\u003e century textiles is trading at a current market price of \u003cTWO_THOUSAND\u003e the daily chart analysis offers a favorable view for the following week indicating a steady higher advance said bagadia notably the stock has produced a notable higher high and higher low pattern in weekly frame and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 3 mishra dhatu nigam ltd ganesh dongre senior manager technical research at anand rathi research recommends buying mishra dhatu nigam ltd share price that is currently trading at close to \u003cTHREE_HUNDRED\u003e dongre recommends keeping a stop loss at \u003cTHREE_HUNDRED\u003e and buying for target price of \u003cFOUR_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cFOUR_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 390 given the current market price of rs 398 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cFOUR_HUNDRED\u003e sakthi sugar dongre recommends buying sakthi sugar at \u003cTHREE_TEN\u003e keeping a stop loss at \u003cTHREE_TEN\u003e for a target price of \u003cFOUR_TEN\u003e on the daily chart of this stock support at \u003cTHREE_TEN\u003e level has been observed signaling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cTHREE_TEN\u003e is recommended the target price for this strategy is rs \u003cFOUR_TEN\u003e in the upcoming weeks as per dongre suggesting a potential gain as the stock continues its upward trajectory 5 ami organics dongre recommends buying ami organics at \u003cONE_THOUSAND\u003e keeping stop loss at \u003cONE_THOUSAND\u003e for a target of \u003cONE_THOUSAND\u003e on the short term chart this stock has formed a bullish engulfing pattern which is inherently bullish in nature currently priced at rs \u003cONE_THOUSAND\u003e this formation signals a potential upward trend to effectively manage risk a stop loss at rs \u003cONE_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cONE_THOUSAND\u003e in the upcoming weeks as per dongre this suggests a potential gain as the stock continues its upward trajectory backed by the bullish technical signals","timestamp":"2024-09-16T06:57:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}