{"url":"https://www.livemint.com/market/stock-market-news/stock-check-info-edge-share-price-hits-record-high-for-the-fifth-day-in-row-centrum-sees-more-peaks-ahead-11726553961971.html","title":"Stock Check: Info Edge share price hits record high for the fifth day in row. Centrum sees more peaks ahead","description":"Stock Check: Info Edge share price reached a record high for the fifth session, with Centrum raising the target price to  ₹8,579. The brokerage maintains an 'Add' recommendation, expecting growth in IT hiring and breakeven for 99acres and Jeevansathi by FY25.","content":"Stock Check: Info Edge India share price has touched a new record high for the fifth consecutive session today. In a recent report, Centrum, a brokerage house, has established a new target price of  ₹8,579, marking a 10% increase from its previous target price of  ₹7,797.The brokerage firm has kept its 'Add' recommendation on the company, indicating that it anticipates broad-based business development in each of the four major areas. Given that utilisation levels have dramatically increased across all IT organisations, recruiting linked to IT should grow. Over the next year or two, 99acres and Jeevansathi are both anticipated to break even, which will support operating margin. The new approach for Jeevansathi is generating results as traffic and billings continue to climb as it hopes to breakeven in FY25, according to Centrum.“We expect Revenue/EBITDA/PAT to grow at 16.8%/17.3%/17.2% over FY24-FY26E. We have revised our FY25E/FY26E EPS by +0.3%/+1.0%. We maintain ADD Rating on the stock with revised target price of  ₹8,579/share (vs  ₹7797 earlier),” said the brokerage house.The brokerage pointed out that there has been a gradual recovery in IT hiring, which will contribute to improved performance. It was highlighted that 99acres has managed to reduce its operating losses by focusing on minimising operational expenses. The brokerage also stated that the company plans to continue investing in 99acres in order to accelerate its growth. Despite high competitive pressure in the business, the goal is to sustain market share. The Indian real estate sector has seen a resurgence in the last few years following a long period of sluggish growth.The Freemium strategy for Jeevansathi is proving successful, with increasing traffic and billings, and reduced advertising expenses. The goal is to achieve breakeven in FY25.Shiksha has sustained profitability and strong growth, particularly in the domestic segment, as it continues to capture more traffic. The brokerage also emphasized that there are currently no intentions for the company to divest from its investments in Zomato/Policy Bazaar.On Tuesday's session, Info Edge share price opened at intraday low of  ₹7,826.45 apiece on BSE, the stock touched an intraday high of  ₹7,955 apiece.“We are seeing a continuous higher top higher bottom structure for this counter, and yesterday it broke above its previous swing high. Expect the uptrend to continue and possibly prices headed towards  ₹8,200 in the near term. Any dip could be considered a buying opportunity with  ₹7,800 as support,” said Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One.","cleaned_content":"stock check info edge india share price has touched a new record high for the fifth consecutive session today in a recent report centrum a brokerage house has established a new target price of \u003cEIGHT_THOUSAND\u003e marking a \u003cONE_TEN_PERCENT\u003e increase from its previous target price of \u003cSEVEN_THOUSAND\u003e the brokerage firm has kept its add recommendation on the company indicating that it anticipates broad based business development in each of the four major areas given that utilisation levels have dramatically increased across all it organisations recruiting linked to it should grow over the next year or two \u003cNINE_TEN\u003e acres and jeevansathi are both anticipated to break even which will support operating margin the new approach for jeevansathi is generating results as traffic and billings continue to climb as it hopes to breakeven in fy25 according to centrum we expect revenue ebitda pat to grow at \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e over fy24 fy26e we have revised our fy25e fy26e eps by \u003cZERO_PERCENT\u003e \u003cONE_PERCENT\u003e we maintain add rating on the stock with revised target price of \u003cEIGHT_THOUSAND\u003e share vs \u003cSEVEN_THOUSAND\u003e earlier said the brokerage house the brokerage pointed out that there has been a gradual recovery in it hiring which will contribute to improved performance it was highlighted that \u003cNINE_TEN\u003e acres has managed to reduce its operating losses by focusing on minimising operational expenses the brokerage also stated that the company plans to continue investing in \u003cNINE_TEN\u003e acres in order to accelerate its growth despite high competitive pressure in the business the goal is to sustain market share the indian real estate sector has seen a resurgence in the last few years following a long period of sluggish growth the freemium strategy for jeevansathi is proving successful with increasing traffic and billings and reduced advertising expenses the goal is to achieve breakeven in fy25 shiksha has sustained profitability and strong growth particularly in the domestic segment as it continues to capture more traffic the brokerage also emphasized that there are currently no intentions for the company to divest from its investments in zomato policy bazaar on tuesdays session info edge share price opened at intraday low of \u003cSEVEN_THOUSAND\u003e apiece on bse the stock touched an intraday high of \u003cSEVEN_THOUSAND\u003e apiece we are seeing a continuous higher top higher bottom structure for this counter and yesterday it broke above its previous swing high expect the uptrend to continue and possibly prices headed towards \u003cEIGHT_THOUSAND\u003e in the near term any dip could be considered a buying opportunity with \u003cSEVEN_THOUSAND\u003e as support said rajesh bhosale equity technical and derivative analyst at angel one","timestamp":"2024-09-17T13:24:00+05:30","market_timestamp":"2024-09-17T13:24:00+05:30","off_market_hours":false}