{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-reliance-infra-jk-tyre-vedanta-adani-wilmar-poly-medicure-and-more-11726504742009.html","title":"Stocks to Watch: Reliance Infra, JK Tyre, Vedanta, Adani Wilmar, Poly Medicure, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Reliance Infrastructure: The board of Reliance Infrastructure is scheduled to meet on September 19 to consider raising funds through a preferential issue of shares. This follows a previous fundraising in July 2021, when the company raised  ₹550 crore via a preferential issue. At the time, the promoters infused  ₹400 crore, while international investor Varde Capital Partners subscribed to shares worth  ₹150 crore.Vedanta: Vedanta Aluminium is currently addressing a breach at its process water storage pond at the Lanjigarh alumina refinery in Odisha. The breach occurred on September 15, 2024, due to severe weather conditions, which resulted in elevated water levels and pressure in the dam's catchment area. The incident has affected agricultural lands in the surrounding region.JK Tyre \u0026 Industries: JK Tyre has announced that its board of directors has approved a merger with its subsidiary, Cavendish Industries Ltd. Under the scheme of amalgamation, shareholders of Cavendish Industries will receive 92 fully paid-up equity shares of JK Tyre for every 100 equity shares they hold in Cavendish Industries.Sandur Manganese and Iron Ores: Sandur Manganese’s board of directors has approved a proposal to raise up to  ₹1,000 crore through the issuance of equity shares via Qualified Institutions Placement (QIP). The funds will be raised in one or more tranches, with the shares having a face value of  ₹10 each.Indo Count Industries: Indo Count Global Inc., the US-based subsidiary of Indo Count Industries, has acquired an 81% stake in Fluvitex USA, Inc. for $19.63 million. The company also holds an option to purchase the remaining 19% stake for $4.6 million within the next five years.India Shelter Finance Corporation: Foreign companies Nexus Ventures III and Nexus Opportunity Fund II have sold a combined stake of nearly 6% in India Shelter Finance. Nexus Ventures III sold a 4.6% stake at an average price of  ₹753.27 per share, while Nexus Opportunity Fund II sold a 1.35% stake at  ₹752.35 per share. Meanwhile, ICICI Prudential Life Insurance, SBI Life Insurance, and Goldman Sachs India Equity Portfolio collectively acquired a 2% stake in the company, and Patronus Research LLP purchased a 0.57% stake.Adani Wilmar and Adani Enterprises: Adani Enterprises and Wilmar International are preparing to divest a 13% stake in their joint venture, Adani Wilmar, to comply with Indian shareholding regulations. The sale, valued at approximately $736 million, will reduce their combined stake from around 88% to 75% by February.Strides Pharma: Strides Pharma Global Pte. Ltd., a subsidiary of Strides Pharma, has received approval from the US FDA for its generic version of Fluoxetine tablets (60 mg). The tablets will be manufactured at the company’s Puducherry facility.Reliance Power: Reliance Power has won a major contract from the Solar Energy Corporation of India (SECI) to build a 500 MW/1000 MWh battery energy storage system (BESS). The contract, part of a larger 1000 MW/2000 MWh tender, will play a key role in enhancing India's energy storage infrastructure and facilitating renewable energy integration.Poly Medicure: Poly Medicure is pursuing acquisitions and new capital projects after raising  ₹1,000 crore via a qualified institutional placement. Of the funds raised,  ₹250 crore is earmarked for technology acquisitions, and another  ₹250 crore for general corporate purposes. The company plans to initiate new capex investments by the end of FY 2025-26.","cleaned_content":"reliance infrastructure the board of reliance infrastructure is scheduled to meet on september \u003cONE_TEN\u003e to consider raising funds through a preferential issue of shares this follows a previous fundraising in july \u003cTWO_THOUSAND\u003e when the company raised \u003cFIVE_HUNDRED\u003e crore via a preferential issue at the time the promoters infused \u003cFOUR_HUNDRED\u003e crore while international investor varde capital partners subscribed to shares worth \u003cONE_HUNDRED\u003e crore vedanta vedanta aluminium is currently addressing a breach at its process water storage pond at the lanjigarh alumina refinery in odisha the breach occurred on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e due to severe weather conditions which resulted in elevated water levels and pressure in the dams catchment area the incident has affected agricultural lands in the surrounding region jk tyre industries jk tyre has announced that its board of directors has approved a merger with its subsidiary cavendish industries ltd under the scheme of amalgamation shareholders of cavendish industries will receive \u003cNINE_TEN\u003e fully paid up equity shares of jk tyre for every \u003cONE_HUNDRED\u003e equity shares they hold in cavendish industries sandur manganese and iron ores sandur manganese s board of directors has approved a proposal to raise up to \u003cONE_THOUSAND\u003e crore through the issuance of equity shares via qualified institutions placement qip the funds will be raised in one or more tranches with the shares having a face value of \u003cONE_TEN\u003e each indo count industries indo count global inc the us based subsidiary of indo count industries has acquired an \u003cEIGHT_TEN_PERCENT\u003e stake in fluvitex usa inc for \u003cONE_TEN\u003e million the company also holds an option to purchase the remaining \u003cONE_TEN_PERCENT\u003e stake for \u003cFOUR_\u003e million within the next five years india shelter finance corporation foreign companies nexus ventures iii and nexus opportunity fund ii have sold a combined stake of nearly \u003cSIX_PERCENT\u003e in india shelter finance nexus ventures iii sold a \u003cFOUR_PERCENT\u003e stake at an average price of \u003cSEVEN_HUNDRED\u003e per share while nexus opportunity fund ii sold a \u003cONE_PERCENT\u003e stake at \u003cSEVEN_HUNDRED\u003e per share meanwhile icici prudential life insurance sbi life insurance and goldman sachs india equity portfolio collectively acquired a \u003cTWO_PERCENT\u003e stake in the company and patronus research llp purchased a \u003cZERO_PERCENT\u003e stake adani wilmar and adani enterprises adani enterprises and wilmar international are preparing to divest a \u003cONE_TEN_PERCENT\u003e stake in their joint venture adani wilmar to comply with indian shareholding regulations the sale valued at approximately \u003cSEVEN_HUNDRED\u003e million will reduce their combined stake from around \u003cEIGHT_TEN_PERCENT\u003e to \u003cSEVEN_TEN_PERCENT\u003e by february strides pharma strides pharma global pte ltd a subsidiary of strides pharma has received approval from the us fda for its generic version of fluoxetine tablets \u003cSIX_TEN\u003e mg the tablets will be manufactured at the company s puducherry facility reliance power reliance power has won a major contract from the solar energy corporation of india seci to build a \u003cFIVE_HUNDRED\u003e mw \u003cONE_THOUSAND\u003e mwh battery energy storage system bess the contract part of a larger \u003cONE_THOUSAND\u003e mw \u003cTWO_THOUSAND\u003e mwh tender will play a key role in enhancing indias energy storage infrastructure and facilitating renewable energy integration poly medicure poly medicure is pursuing acquisitions and new capital projects after raising \u003cONE_THOUSAND\u003e crore via a qualified institutional placement of the funds raised \u003cTWO_HUNDRED\u003e crore is earmarked for technology acquisitions and another \u003cTWO_HUNDRED\u003e crore for general corporate purposes the company plans to initiate new capex investments by the end of fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e","timestamp":"2024-09-17T08:22:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}