{"url":"https://www.livemint.com/market/stock-market-news/jefferies-sees-over-26-upside-in-axis-bank-reiterates-buy-call-key-reasons-why-11726036055794.html","title":"Jefferies sees over 26% upside in Axis Bank, reiterates ’buy’ call — key reasons why","description":"Jefferies maintains a ‘buy’ rating on Axis Bank with a target price of  ₹1,500, indicating over 26 percent upside. The bank's conservative provisioning policy on unsecured loans and effective cost management are expected to stabilise credit costs and strengthen its deposit franchise.","content":"Global brokerage Jefferies, in a recent report, reiterated its ‘buy’ call on private-sector lender Axis Bank, setting a target price of  ₹1,500 per share, implying an upside potential of over 26 percent.Jefferies, following a recent meeting with Axis Bank's CEO and top management, said they are reassured that the surge in credit costs during the first quarter could normalise, thanks to the bank’s conservative provisioning policy on unsecured loans. While deposit growth has been slower, Axis Bank has managed funding costs effectively, helping maintain its net interest margins (NIMs).The brokerage highlighted initiatives like premiumisation and the bank's focus on corporate salary clients as key strategies to gradually strengthen the bank's deposit franchise. Given that Axis Bank's valuations are currently trading at a discount compared to its peers, Jefferies ranks it as one of its top picks with a ‘buy’ rating.Jefferies pointed out that while the SME book carries risks, Axis Bank's initiatives to mitigate these risks appear promising. Improvements in the deposit franchise and continued cost control should help both growth and profitability. Jefferies also noted that asset quality concerns have largely been reflected in the current valuations. A macroeconomic recovery could lead to a stock re-rating.Base Case: In its base case, Jefferies projects a loan compound annual growth rate (CAGR) of 15 percent from FY24 to FY27, with average NIMs around 3.9 percent during the same period. For FY25, it expects gross non-performing assets (GNPA) at 1.4 percent and net non-performing assets (NNPA) at 0.3 percent. The sum-of-the-parts (SOTP) valuation values the core bank at 1.9x the September 2026 estimated adjusted price-to-book value (PB), translating to a target price of  ₹1,500.Bull case: In the bull case, the brokerage forecasts a loan CAGR of 17 percent from FY24 to FY27, with average NIMs around 4 percent during the same period. For FY25, it projects GNPA at 1.3 percent and NNPA at 0.2 percent. The SOTP valuation estimates the core bank to be valued at 2.1x the September 2026 estimated adjusted PB value, leading to a target price of  ₹1,600. This target implies an upside potential of almost 35 percent.Bear Case: In the bear case, it expects a loan CAGR of 13 percent between FY24 and FY27, with average NIMs of around 3.8 percent during this period. It expects GNPA to reach 1.5 percent and NNPA at 0.4 percent in FY25. Under this scenario, the SOTP valuation estimates the core bank to be valued at 1.4x the September 2026 adjusted PB value, resulting in a target price of  ₹1,050.Axis Bank stock has climbed nearly 19 percent over the past year and about 8 percent year-to-date in 2024, outpacing the benchmark Nifty Bank index's 12 percent gain in the last year and nearly 6 percent year-to-date in 2024.After reading a record high of  ₹1,339.55 in July, the stock remains approximately 11 percent below that peak but is up nearly 25 percent from its 52-week low of  ₹951.55, recorded in October of the previous year.Credit costs: Jefferies noted that while there has been an abnormal surge in credit costs, these are expected to stabilise, with lower recoveries and upfront provisioning on unsecured loans contributing to this rise.Following the increase in net slippages and credit costs in the first quarter, trends are anticipated to normalise starting from the second quarter. Management remains optimistic about recovering corporate slippages from the first quarter throughout FY25.The retail unsecured loan segment is experiencing some rise in slippages, and the bank's conservative provisioning approach—providing 100 percent for loans that default within 90 days—will lead to upfront credit costs.Despite this, the stress is manageable, being relatively higher in credit cards and digital loans compared to personal loans. Credit costs for FY25-26 are estimated to be around 60-70 basis points of average loans, with a 10 basis point increase in credit costs potentially impacting earnings by 3 percent.Deposit mobilisation: Axis Bank has shown slower growth compared to peers, with a 13 percent increase in 1QFY25, compared to 15 percent for ICICI Bank, 16 percent for Kotak Mahindra Bank, and 17 percent for HDFC Bank (excluding mergers).However, the bank has effectively controlled deposit costs and maintained NIMs around 4 percent, surpassing the guidance of 3.8 percent on a through-cycle basis. Axis Bank has opportunities to deepen relationships in the corporate salary segment, although this typically takes time. Efforts in premiumisation, corporate salary relationships, and Bharat Banking are expected to gradually improve the bank's franchise. Due to tighter control on the cost of funds and margins, moderate loan growth of 14 percent to 15 percent is anticipated for FY25-26.Earnings are expected to improve from the third quarter onwards. While 2Q earnings may remain soft due to higher credit costs, the integration costs from the merger will moderate, and credit costs should trend towards 60 basis points of average loans with stable NIMs. With valuations at 12x 12-month forward PE and 1.7x forward PB, Jefferies sees a favourable risk-reward profile.Axis Bank remains a top pick in the sector with a ‘buy’ rating and a target price of  ₹1,500, reflecting a valuation of 1.9x the September 2026 adjusted price-to-book value.","cleaned_content":"global brokerage jefferies in a recent report reiterated its buy call on private sector lender axis bank setting a target price of \u003cONE_THOUSAND\u003e per share implying an upside potential of over \u003cTWO_TEN_PERCENT\u003e jefferies following a recent meeting with axis banks ceo and top management said they are reassured that the surge in credit costs during the first quarter could normalise thanks to the bank s conservative provisioning policy on unsecured loans while deposit growth has been slower axis bank has managed funding costs effectively helping maintain its net interest margins nims the brokerage highlighted initiatives like premiumisation and the banks focus on corporate salary clients as key strategies to gradually strengthen the banks deposit franchise given that axis banks valuations are currently trading at a discount compared to its peers jefferies ranks it as one of its top picks with a buy rating jefferies pointed out that while the sme book carries risks axis banks initiatives to mitigate these risks appear promising improvements in the deposit franchise and continued cost control should help both growth and profitability jefferies also noted that asset quality concerns have largely been reflected in the current valuations a macroeconomic recovery could lead to a stock re rating base case in its base case jefferies projects a loan compound annual growth rate cagr of \u003cONE_TEN_PERCENT\u003e from fy24 to fy27 with average nims around \u003cTHREE_PERCENT\u003e during the same period for fy25 it expects gross non performing assets gnpa at \u003cONE_PERCENT\u003e and net non performing assets nnpa at \u003cZERO_PERCENT\u003e the sum of the parts sotp valuation values the core bank at \u003cONE_\u003e x the september \u003cTWO_THOUSAND\u003e estimated adjusted price to book value pb translating to a target price of \u003cONE_THOUSAND\u003e bull case in the bull case the brokerage forecasts a loan cagr of \u003cONE_TEN_PERCENT\u003e from fy24 to fy27 with average nims around \u003cFOUR_PERCENT\u003e during the same period for fy25 it projects gnpa at \u003cONE_PERCENT\u003e and nnpa at \u003cZERO_PERCENT\u003e the sotp valuation estimates the core bank to be valued at \u003cTWO_\u003e x the september \u003cTWO_THOUSAND\u003e estimated adjusted pb value leading to a target price of \u003cONE_THOUSAND\u003e this target implies an upside potential of almost \u003cTHREE_TEN_PERCENT\u003e bear case in the bear case it expects a loan cagr of \u003cONE_TEN_PERCENT\u003e between fy24 and fy27 with average nims of around \u003cTHREE_PERCENT\u003e during this period it expects gnpa to reach \u003cONE_PERCENT\u003e and nnpa at \u003cZERO_PERCENT\u003e in fy25 under this scenario the sotp valuation estimates the core bank to be valued at \u003cONE_\u003e x the september \u003cTWO_THOUSAND\u003e adjusted pb value resulting in a target price of \u003cONE_THOUSAND\u003e axis bank stock has climbed nearly \u003cONE_TEN_PERCENT\u003e over the past year and about \u003cEIGHT_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e outpacing the benchmark nifty bank indexs \u003cONE_TEN_PERCENT\u003e gain in the last year and nearly \u003cSIX_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e after reading a record high of \u003cONE_THOUSAND\u003e in july the stock remains approximately \u003cONE_TEN_PERCENT\u003e below that peak but is up nearly \u003cTWO_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cNINE_HUNDRED\u003e recorded in october of the previous year credit costs jefferies noted that while there has been an abnormal surge in credit costs these are expected to stabilise with lower recoveries and upfront provisioning on unsecured loans contributing to this rise following the increase in net slippages and credit costs in the first quarter trends are anticipated to normalise starting from the second quarter management remains optimistic about recovering corporate slippages from the first quarter throughout fy25 the retail unsecured loan segment is experiencing some rise in slippages and the banks conservative provisioning approach providing \u003cONE_HUNDRED_PERCENT\u003e for loans that default within \u003cNINE_TEN\u003e days will lead to upfront credit costs despite this the stress is manageable being relatively higher in credit cards and digital loans compared to personal loans credit costs for fy25 \u003cTWO_TEN\u003e are estimated to be around \u003cSIX_TEN\u003e \u003cSEVEN_TEN\u003e basis points of average loans with a \u003cONE_TEN\u003e basis point increase in credit costs potentially impacting earnings by \u003cTHREE_PERCENT\u003e deposit mobilisation axis bank has shown slower growth compared to peers with a \u003cONE_TEN_PERCENT\u003e increase in \u003cONE_\u003e qfy25 compared to \u003cONE_TEN_PERCENT\u003e for icici bank \u003cONE_TEN_PERCENT\u003e for kotak mahindra bank and \u003cONE_TEN_PERCENT\u003e for hdfc bank excluding mergers however the bank has effectively controlled deposit costs and maintained nims around \u003cFOUR_PERCENT\u003e surpassing the guidance of \u003cTHREE_PERCENT\u003e on a through cycle basis axis bank has opportunities to deepen relationships in the corporate salary segment although this typically takes time efforts in premiumisation corporate salary relationships and bharat banking are expected to gradually improve the banks franchise due to tighter control on the cost of funds and margins moderate loan growth of \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e is anticipated for fy25 \u003cTWO_TEN\u003e earnings are expected to improve from the third quarter onwards while \u003cTWO_\u003e q earnings may remain soft due to higher credit costs the integration costs from the merger will moderate and credit costs should trend towards \u003cSIX_TEN\u003e basis points of average loans with stable nims with valuations at \u003cONE_TEN\u003e x \u003cONE_TEN\u003e month forward pe and \u003cONE_\u003e x forward pb jefferies sees a favourable risk reward profile axis bank remains a top pick in the sector with a buy rating and a target price of \u003cONE_THOUSAND\u003e reflecting a valuation of \u003cONE_\u003e x the september \u003cTWO_THOUSAND\u003e adjusted price to book value","timestamp":"2024-09-11T12:50:00+05:30","market_timestamp":"2024-09-11T12:50:00+05:30","off_market_hours":false}