{"url":"https://www.livemint.com/market/stock-market-news/jm-financial-explains-how-us-fed-s-50-bps-rate-cut-will-impact-the-it-sector-11726733031662.html","title":"JM Financial explains how US Fed’s 50 bps rate cut will impact the IT sector","description":"The US Federal Reserve's 50 basis points rate cut is expected to have a gradual impact on the IT sector, with companies like Tech Mahindra positioned to benefit from reduced interest burdens. JM Financial cautions against immediate spending boosts due to ongoing economic uncertainties.","content":"The US Federal Reserve's recent 50 basis points rate cut has sparked discussions about its impact across various sectors. Domestic brokerage house JM Financial has analysed the potential effects on the IT sector. JM Financials' report indicates that while the rate cut may benefit IT services, its impact will be complex and tempered by economic uncertainties.JM Financial analysed S\u0026P 500 companies (excluding financials) and observed three trends: a gradual increase in interest costs, marginal de-leveraging across sectors, and a decline in operating expenses as a percentage of revenue. These trends indicate that companies have optimised debt and operations to manage higher interest costs. However, the rate cut's effect on corporate spending will likely be gradual, and expectations of an immediate spending boost might be premature. JM Financial's top picks in the sector include Infosys, Tech Mahindra, Wipro in large-caps and Persistent Systems, and KPIT in mid-caps.The US Federal Reserve has initiated a new monetary easing cycle with a 50 basis points (bps) cut to the federal funds rate, marking the first reduction since March 2020. This follows a 14-month policy pause, bringing the current federal funds rate between 4.75 percent and 5.00 percent.JM Financial identified three key effects of the rate cut on the IT services sector: increased stock multiples due to a lower cost of equity, potential revival in discretionary demand as the economy recovers, and reduced interest burdens on corporations, allowing for higher operational expenditures (opex).Of these, the increased stock multiples have already materialised to some extent, while the discretionary demand revival remains uncertain, dependent on the nature of the economic recovery. However, the most tangible impact is expected to come from reduced interest burdens, which could benefit the Communication, Media, and Entertainment (CME) and manufacturing verticals.Companies like Tech Mahindra, with significant exposure to these sectors, are better positioned to capitalise on this shift. Meanwhile, the revival of spending by US banks would provide a larger boost to firms like Infosys, TCS, and Wipro.As mentioned above, JM Financial also identified three key trends that the IT sector is likely to focus on1) The trajectory of interest cost increases for corporates across sectors has been slower than the Fed rate hikes,2) Many sectors have marginally deleveraged over the past four years, and3) Operational expenditures, as a percentage of revenue, have generally decreased.These trends suggest that corporations have optimised debt and operations to cushion the impact of higher interest costs.It further pointed out that this optimisation has been particularly evident in the manufacturing and CME sectors, benefiting companies like Tech Mahindra. However, longer-tenured debt may have limited the transmission of lower rates, meaning the impact of rate cuts on spending could be gradual. JM Financial cautioned against expecting an immediate boost in corporate spending as the optimisation cycle is still playing out.The analysis also noted that while the cut in operational expenses (opex) is visible, it is not entirely explained by the interest burden. Instead, the reduction in opex seems more related to the unwinding of excess IT spending after the COVID-19 spike. The revival of IT spending, JM believes, will be driven by the normalisation of corporate expenditures rather than lower interest rates alone. The optimisation cycle in corporate spending, particularly in IT, is likely to attenuate over time, providing incremental benefits to the sector, added the brokerage.As per the brokerage, historically, the start of a Fed rate cut cycle has coincided with a slowdown in IT services exports. This trend is driven by two factors: a preceding strong demand upcycle and the onset of a recession after peak interest rates. However, the current cycle differs from previous ones, as the US economy is not facing an immediate recession, and IT spending has already normalised to some extent. As such, the slowdown may be less pronounced this time, and incremental improvements in the sector are expected.One of the more technical impacts of the rate cut is the lower cost of equity, which typically results in higher price-to-earnings (PER) multiples for stocks. JM Financial noted that multiple expansions due to the rate cut may already be priced in. The report compared NIFTY IT’s earnings yield with the US 10-year bond yield, finding that for the first time since 2007, the bond yield has risen above the earnings yield for the IT index. This suggests that the market has already anticipated a reduction in bond yields, limiting the immediate impact of the rate cut on IT services P/E multiples.In conclusion, JM Financial sees the Fed rate cut as having a gradual and measured impact on the IT services sector. While lower equity costs have already resulted in higher stock multiples, the revival of discretionary demand remains uncertain and contingent on broader economic conditions. Reduced interest burdens are likely to benefit sectors like CME and manufacturing, positioning companies like Tech Mahindra favourably. A more significant boost may come from a revival of US bank spending, which would benefit large-cap IT firms.","cleaned_content":"the us federal reserves recent \u003cFIVE_TEN\u003e basis points rate cut has sparked discussions about its impact across various sectors domestic brokerage house jm financial has analysed the potential effects on the it sector jm financials report indicates that while the rate cut may benefit it services its impact will be complex and tempered by economic uncertainties jm financial analysed s p \u003cFIVE_HUNDRED\u003e companies excluding financials and observed three trends a gradual increase in interest costs marginal de leveraging across sectors and a decline in operating expenses as a percentage of revenue these trends indicate that companies have optimised debt and operations to manage higher interest costs however the rate cuts effect on corporate spending will likely be gradual and expectations of an immediate spending boost might be premature jm financials top picks in the sector include infosys tech mahindra wipro in large caps and persistent systems and kpit in mid caps the us federal reserve has initiated a new monetary easing cycle with a \u003cFIVE_TEN\u003e basis points bps cut to the federal funds rate marking the first reduction since march \u003cTWO_THOUSAND\u003e this follows a \u003cONE_TEN\u003e month policy pause bringing the current federal funds rate between \u003cFOUR_PERCENT\u003e and \u003cFIVE_PERCENT\u003e jm financial identified three key effects of the rate cut on the it services sector increased stock multiples due to a lower cost of equity potential revival in discretionary demand as the economy recovers and reduced interest burdens on corporations allowing for higher operational expenditures opex of these the increased stock multiples have already materialised to some extent while the discretionary demand revival remains uncertain dependent on the nature of the economic recovery however the most tangible impact is expected to come from reduced interest burdens which could benefit the communication media and entertainment cme and manufacturing verticals companies like tech mahindra with significant exposure to these sectors are better positioned to capitalise on this shift meanwhile the revival of spending by us banks would provide a larger boost to firms like infosys tcs and wipro as mentioned above jm financial also identified three key trends that the it sector is likely to focus on1 the trajectory of interest cost increases for corporates across sectors has been slower than the fed rate hikes 2 many sectors have marginally deleveraged over the past four years and3 operational expenditures as a percentage of revenue have generally decreased these trends suggest that corporations have optimised debt and operations to cushion the impact of higher interest costs it further pointed out that this optimisation has been particularly evident in the manufacturing and cme sectors benefiting companies like tech mahindra however longer tenured debt may have limited the transmission of lower rates meaning the impact of rate cuts on spending could be gradual jm financial cautioned against expecting an immediate boost in corporate spending as the optimisation cycle is still playing out the analysis also noted that while the cut in operational expenses opex is visible it is not entirely explained by the interest burden instead the reduction in opex seems more related to the unwinding of excess it spending after the covid \u003cONE_TEN\u003e spike the revival of it spending jm believes will be driven by the normalisation of corporate expenditures rather than lower interest rates alone the optimisation cycle in corporate spending particularly in it is likely to attenuate over time providing incremental benefits to the sector added the brokerage as per the brokerage historically the start of a fed rate cut cycle has coincided with a slowdown in it services exports this trend is driven by two factors a preceding strong demand upcycle and the onset of a recession after peak interest rates however the current cycle differs from previous ones as the us economy is not facing an immediate recession and it spending has already normalised to some extent as such the slowdown may be less pronounced this time and incremental improvements in the sector are expected one of the more technical impacts of the rate cut is the lower cost of equity which typically results in higher price to earnings per multiples for stocks jm financial noted that multiple expansions due to the rate cut may already be priced in the report compared nifty it s earnings yield with the us \u003cONE_TEN\u003e year bond yield finding that for the first time since \u003cTWO_THOUSAND\u003e the bond yield has risen above the earnings yield for the it index this suggests that the market has already anticipated a reduction in bond yields limiting the immediate impact of the rate cut on it services p e multiples in conclusion jm financial sees the fed rate cut as having a gradual and measured impact on the it services sector while lower equity costs have already resulted in higher stock multiples the revival of discretionary demand remains uncertain and contingent on broader economic conditions reduced interest burdens are likely to benefit sectors like cme and manufacturing positioning companies like tech mahindra favourably a more significant boost may come from a revival of us bank spending which would benefit large cap it firms","timestamp":"2024-09-19T14:28:00+05:30","market_timestamp":"2024-09-19T14:28:00+05:30","off_market_hours":false}