{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-us-stocks-trade-higher-as-investors-re-evaluate-big-fed-rate-cut-potential-intel-corp-gains-183-11726236898232.html","title":"Wall Street today: US stocks trade higher as investors re-evaluate big Fed rate cut potential, Intel Corp. gains 1.83%","description":"The US stock markets opened higher on Friday, September 13, as investors re-evaluated the possibility of a bigger rate cut from the United States Federal Reserve (FED).","content":"The US stock markets opened higher on Friday, September 13, as investors re-evaluated the possibility of a bigger rate cut from the United States Federal Reserve (FED), as per the news agency Reuters.At 9:30 am (EDT) the stock markets opened for the United States at a high. The Dow Jones Industrial Average rose 0.14 per cent at the opening bell to 41,153.7 points, compared to 41,096.77 points after Thursday's market close.Companies like Intel Corp., American Express Co., Home Depot Inc., Walt Disney Co., Chevron Corp, International Business Machines Corp., Caterpillar Inc., Nike Inc. Cl B, were amongst the top gainers on the Dow Jones Industrial Average during Friday's trading session.JPMorgan Chase \u0026 Co. and Boeing Co., were amongst the top laggards during the Friday market hours, according to data collected from Marketwatch.com.The S\u0026P 500 index rose 0.14 per cent at Friday's market open to 5,603.34 points, compared to 5,595.76 points in the previous market close.Companies like Etsy Inc., Warner Bros. Discovery Inc. Series A, Caesars Entertainment Inc., Align Technology Inc., Super Micro Computer Inc., Uber Technologies Inc., Micron Technology Inc., GE Vernova Inc., Vistra Corp, and Wynn Resorts Ltd were amongst the top gainers during the market session on the S\u0026P 500 index.Whereas Adobe Inc., Garmin Ltd., Moderna Inc., Biogen Inc., GE Healthcare Technologies Inc., Axon Enterprise Inc., were amongst the top laggards for Friday's trading session, as per Marketwatch data.The Nasdaq Composite rose 0.03 per cent to 17,575.258 points on the opening bell, compared to its 17,569.68 point level in Thursday's market close.Nova Vision Acquisition Corp., Tenon Medical Inc., Singular Genomic Systems Inc., AgapeATP Corp., 22nd Century Group Inc., Immuneering Corp., Vision Marine Technologies Inc., Murano Global Investments Plc., Children's Place Inc., were the top gainers on Friday in the Nasdaq Composite index.Universe Pharmaceuticals Inc., Garden Stage Ltd., Healthcare Triangle Inc., BAIYU Holdings Inc., Prelude Therapeutics Inc., and CN Energy Group Inc. were amongst the top losers during Friday's trading hours.","cleaned_content":"the us stock markets opened higher on friday september \u003cONE_TEN\u003e as investors re evaluated the possibility of a bigger rate cut from the united states federal reserve fed as per the news agency reuters at \u003cNINE_\u003e \u003cTHREE_TEN\u003e am edt the stock markets opened for the united states at a high the dow jones industrial average rose \u003cZERO_PERCENT\u003e at the opening bell to \u003cFOUR_TEN_THOUSAND\u003e points compared to \u003cFOUR_TEN_THOUSAND\u003e points after thursdays market close companies like intel corp american express co home depot inc walt disney co chevron corp international business machines corp caterpillar inc nike inc cl b were amongst the top gainers on the dow jones industrial average during fridays trading session jpmorgan chase co and boeing co were amongst the top laggards during the friday market hours according to data collected from marketwatch com the s p \u003cFIVE_HUNDRED\u003e index rose \u003cZERO_PERCENT\u003e at fridays market open to \u003cFIVE_THOUSAND\u003e points compared to \u003cFIVE_THOUSAND\u003e points in the previous market close companies like etsy inc warner bros discovery inc series a caesars entertainment inc align technology inc super micro computer inc uber technologies inc micron technology inc ge vernova inc vistra corp and wynn resorts ltd were amongst the top gainers during the market session on the s p \u003cFIVE_HUNDRED\u003e index whereas adobe inc garmin ltd moderna inc biogen inc ge healthcare technologies inc axon enterprise inc were amongst the top laggards for fridays trading session as per marketwatch data the nasdaq composite rose \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e points on the opening bell compared to its \u003cONE_TEN_THOUSAND\u003e point level in thursdays market close nova vision acquisition corp tenon medical inc singular genomic systems inc agapeatp corp \u003cTWO_TEN\u003e nd century group inc immuneering corp vision marine technologies inc murano global investments plc childrens place inc were the top gainers on friday in the nasdaq composite index universe pharmaceuticals inc garden stage ltd healthcare triangle inc baiyu holdings inc prelude therapeutics inc and cn energy group inc were amongst the top losers during fridays trading hours","timestamp":"2024-09-13T20:47:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}