{"url":"https://www.livemint.com/market/stock-market-news/ongc-share-price-drops-over-2-after-sharp-fall-in-crude-oil-prices-analysts-expect-more-21-downside-for-the-psu-stock-11726028584314.html","title":"ONGC share price drops over 2% after sharp fall in crude oil prices; analysts expect more 21% downside for the PSU stock","description":"ONGC share price has been on a bearish trend recently as the stock has fallen over 7% in one week and more than 12% in one month. However, ONGC shares have gained 41% year-to-date (YTD) and have given more than 58% return in the past 12 months.","content":"ONGC share price declined over 2% in early trade on Wednesday after a sharp fall in crude oil prices which is expected to negatively affect the company’s earnings. Oil and Natural Gas Corporation Ltd (ONGC) share price fell as much as 2.68% to  ₹287.70 apiece on the BSE.Crude oil prices tumbled to the lowest level in three years after OPEC cut its forecast for global oil demand growth in 2024 and also trimmed its expectation for next year, Reuters reported. The Organization of the Petroleum Exporting Countries (OPEC) said world oil demand will rise by 2.03 million barrels per day (bpd) in 2024, down from growth of 2.11 million bpd expected last month.Brent crude oil prices slid by more than 3% on Tuesday and slipped below $70 a barrel level for the first time since December 2021.Analysts believe ONGC’s earnings are poised for a free fall as the $75 per barrel crude threshold has breached while the $67.5 per barrel precipice for gas is within sight.Nuvama Institutional Equities is of the view that ONGC is poised for a ‘double-barrelled free fall’ as the company is set to meet its volume growth guidance given that all past targets have been missed and crude oil prices have plunged below the critical $75 threshold.ONGC as well as investors remain optimistic of its standalone ~12% and 27% oil and gas production growth guidance by FY27E, mainly from KG-98/2 block. In sharp contrast, the company has missed guidance every year for at least the past six years, which Nuvama believes calls for extreme caution.“ONGC has not only reported a production decline of ~3.2% CAGR over the past five years, but a 3.3% CAGR fall in 1P reserves as well, suggesting a further production fall ahead. Given our cautious view on production guidance, we factor in growth of 1% / 5% oil / gas standalone production growth over FY24–26,” Nuvama said.ONGC has also substantially lowered KG-98/2 peak oil and gas production guidance by 42% and 33% to 45 kbpd and 10 mmscmd since FY18. Moreover, production locks in a high drilling cost while the production guidance has been reduced meaningfully, risking the viability of the project.Nuvama Equities’ analysis suggests an earnings impact of 24% for FY26E if crude price falls by $10 per barrel below the threshold of $75 level. Moreover, APM gas prices are pegged at a 10% slope to Brent, with a current ceiling of $6.5 per mmbtu, which is scheduled to be raised to $6.75 per mmbtu from FY26.“With crude oil prices plunging below $70/bbl, the crude oil threshold of $67.5/bbl remains within sight and could shortly force a cut in APM gas prices as well,” Nuvama said.With unlimited downside sub-$75 per barrel for oil and $67.5 per barrel for gas, the brokerage firm believes ONGC’s earnings are severely vulnerable to cuts. In contrast, only 18% of Street has a bearish view, indicating excessive exuberance.Nuvama cuts earnings per share (EPS) estimates by 5% and 6% for FY25 and FY26 and reiterates ‘Reduce’ rating for ONGC shares with a target price of  ₹232 apiece, implying a downside potential of over 21% from Tuesday’s closing price.ONGC share price is currently trading around  ₹289, having recently experienced a pullback from higher levels.“ONGC stock is now approaching a support zone, which could offer a favorable buying opportunity if signs of a reversal emerge. Key resistance levels are identified between  ₹300 and  ₹310, and a breakout beyond this range could lead to higher levels. The Relative Strength Index (RSI) is around 30, indicating it is nearing the oversold region. This suggests that selling pressure may be easing and a potential reversal could be on the horizon,” said Hardik Matalia, Derivative Analyst, Choice Broking.Furthermore, the stock is trading below its short-term (20-day) and medium-term (50-day) Exponential Moving Averages (EMAs), which supports a cautious outlook. A fresh bullish trend could develop once the stock crosses these levels, Matalia added.“To manage risk, it is advisable to set a stop-loss at  ₹265 to guard against any unexpected downside. Considering the current technical setup and market conditions, ONGC presents a favorable buying opportunity if a reversal is observed, with a target of  ₹340, provided that risk management strategies are diligently followed,” he said.ONGC share price has been on a bearish trend recently as the stock has fallen over 7% in one week and more than 12% in one month. However, ONGC shares have gained 41% year-to-date (YTD) and have given more than 58% return in the past 12 months.At 10:00 am, ONGC shares were trading 2.16% lower at  ₹289.25 apiece on the BSE.","cleaned_content":"ongc share price declined over \u003cTWO_PERCENT\u003e in early trade on wednesday after a sharp fall in crude oil prices which is expected to negatively affect the company s earnings oil and natural gas corporation ltd ongc share price fell as much as \u003cTWO_PERCENT\u003e to \u003cTWO_HUNDRED\u003e apiece on the bse crude oil prices tumbled to the lowest level in three years after opec cut its forecast for global oil demand growth in \u003cTWO_THOUSAND\u003e and also trimmed its expectation for next year reuters reported the organization of the petroleum exporting countries opec said world oil demand will rise by \u003cTWO_\u003e million barrels per day bpd in \u003cTWO_THOUSAND\u003e down from growth of \u003cTWO_\u003e million bpd expected last month brent crude oil prices slid by more than \u003cTHREE_PERCENT\u003e on tuesday and slipped below \u003cSEVEN_TEN\u003e a barrel level for the first time since december \u003cTWO_THOUSAND\u003e analysts believe ongc s earnings are poised for a free fall as the \u003cSEVEN_TEN\u003e per barrel crude threshold has breached while the \u003cSIX_TEN\u003e per barrel precipice for gas is within sight nuvama institutional equities is of the view that ongc is poised for a double barrelled free fall as the company is set to meet its volume growth guidance given that all past targets have been missed and crude oil prices have plunged below the critical \u003cSEVEN_TEN\u003e threshold ongc as well as investors remain optimistic of its standalone \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e oil and gas production growth guidance by fy27e mainly from kg \u003cNINE_TEN\u003e \u003cTWO_\u003e block in sharp contrast the company has missed guidance every year for at least the past six years which nuvama believes calls for extreme caution ongc has not only reported a production decline of \u003cTHREE_PERCENT\u003e cagr over the past five years but a \u003cTHREE_PERCENT\u003e cagr fall in \u003cONE_\u003e p reserves as well suggesting a further production fall ahead given our cautious view on production guidance we factor in growth of \u003cONE_PERCENT\u003e \u003cFIVE_PERCENT\u003e oil gas standalone production growth over fy24 \u003cTWO_TEN\u003e nuvama said ongc has also substantially lowered kg \u003cNINE_TEN\u003e \u003cTWO_\u003e peak oil and gas production guidance by \u003cFOUR_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e to \u003cFOUR_TEN\u003e kbpd and \u003cONE_TEN\u003e mmscmd since fy18 moreover production locks in a high drilling cost while the production guidance has been reduced meaningfully risking the viability of the project nuvama equities analysis suggests an earnings impact of \u003cTWO_TEN_PERCENT\u003e for fy26e if crude price falls by \u003cONE_TEN\u003e per barrel below the threshold of \u003cSEVEN_TEN\u003e level moreover apm gas prices are pegged at a \u003cONE_TEN_PERCENT\u003e slope to brent with a current ceiling of \u003cSIX_\u003e per mmbtu which is scheduled to be raised to \u003cSIX_\u003e per mmbtu from fy26 with crude oil prices plunging below \u003cSEVEN_TEN\u003e bbl the crude oil threshold of \u003cSIX_TEN\u003e bbl remains within sight and could shortly force a cut in apm gas prices as well nuvama said with unlimited downside sub \u003cSEVEN_TEN\u003e per barrel for oil and \u003cSIX_TEN\u003e per barrel for gas the brokerage firm believes ongc s earnings are severely vulnerable to cuts in contrast only \u003cONE_TEN_PERCENT\u003e of street has a bearish view indicating excessive exuberance nuvama cuts earnings per share eps estimates by \u003cFIVE_PERCENT\u003e and \u003cSIX_PERCENT\u003e for fy25 and fy26 and reiterates reduce rating for ongc shares with a target price of \u003cTWO_HUNDRED\u003e apiece implying a downside potential of over \u003cTWO_TEN_PERCENT\u003e from tuesday s closing price ongc share price is currently trading around \u003cTWO_HUNDRED\u003e having recently experienced a pullback from higher levels ongc stock is now approaching a support zone which could offer a favorable buying opportunity if signs of a reversal emerge key resistance levels are identified between \u003cTHREE_HUNDRED\u003e and \u003cTHREE_HUNDRED\u003e and a breakout beyond this range could lead to higher levels the relative strength index rsi is around \u003cTHREE_TEN\u003e indicating it is nearing the oversold region this suggests that selling pressure may be easing and a potential reversal could be on the horizon said hardik matalia derivative analyst choice broking furthermore the stock is trading below its short term \u003cTWO_TEN\u003e day and medium term \u003cFIVE_TEN\u003e day exponential moving averages emas which supports a cautious outlook a fresh bullish trend could develop once the stock crosses these levels matalia added to manage risk it is advisable to set a stop loss at \u003cTWO_HUNDRED\u003e to guard against any unexpected downside considering the current technical setup and market conditions ongc presents a favorable buying opportunity if a reversal is observed with a target of \u003cTHREE_HUNDRED\u003e provided that risk management strategies are diligently followed he said ongc share price has been on a bearish trend recently as the stock has fallen over \u003cSEVEN_PERCENT\u003e in one week and more than \u003cONE_TEN_PERCENT\u003e in one month however ongc shares have gained \u003cFOUR_TEN_PERCENT\u003e year to date ytd and have given more than \u003cFIVE_TEN_PERCENT\u003e return in the past \u003cONE_TEN\u003e months at \u003cONE_TEN\u003e \u003cZERO_\u003e am ongc shares were trading \u003cTWO_PERCENT\u003e lower at \u003cTWO_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-11T10:02:00+05:30","market_timestamp":"2024-09-11T10:02:00+05:30","off_market_hours":false}