{"url":"https://www.livemint.com/market/stock-market-news/week-ahead-us-fed-policy-boj-verdict-fii-inflow-global-cues-among-key-market-triggers-as-nifty-eyes-25550-11726332152391.html","title":"Week Ahead: US Fed policy, BoJ verdict, FII inflow, global cues among key market triggers as Nifty eyes 25,550","description":"Stock market triggers: This week, domestic macro data and global cues will dictate market trends. D-Street experts say the Nifty 50 will eye the 25,550 mark as its next upside.","content":"The Indian stock market resumed its upward momentum and logged the best week since the end of June, largely supported by positive global cues ahead of a likely interest rate cut by the US Federal Reserve. In the third week of September, investors will closely monitor key market triggers such as new listings, domestic and global macroeconomic data, US Fed interest rate decisions, foreign fund inflows, crude oil prices, and other global cues.After a brief one-week pause, domestic equity benchmarks Nifty 50 and Sensex surged again last week and reached fresh all-time highs. The Nifty 50 surged to a record 25,433.35 before closing the week at 25,356.50, a two per cent increase from the previous week's close. Similarly, the Sensex touched an all-time high of 83,116.19 before ending the week at 82,890.94, marking a 2.10 per cent gain.Also Read: New-Age Tech Stocks | Paytm, Zomato outperform Nifty 50 this week, CarTrade biggest gainer; Nykaa reduced to ‘sell’While the tone remained subdued for most of the week, a sharp rally on Thursday shifted momentum back in favour of the bulls. All sectors contributed to the rally, with FMCG, IT, and banking leading the gains. The broader indices also performed well, with the midcap index reaching a new record high.The India VIX, or the India volatility index --which measures the market's expectation of volatility in the Nifty 50 index fell by (-17.53 per cent) and closed the week at a 12.55 level. The frontline indices rose about two per cent each for the week, their best gains since June-end.Gains for the week were driven by a three per cent rise in consumer stocks in hopes of demand revival and volume growth due to a stable monsoon. IT companies that earn a chunk of their revenue from the US gained 2.8 per cent, ahead of a near-certain US Fed rate cut next week.Also Read: US Fed policy decision in focus: Did Powell-led FOMC wait too long to cut interest rates? Here’s what experts sayIndia's consumer price index (CPI)-based or retail inflation in August rose to 3.65 per cent, though vegetables and pulses witnessed a double-digit price rise. However, remained below the Reserve Bank of India (RBI)'s median target of four per cent for the second month. August retail inflation is the second lowest in the last five years.\"We expect the market to consolidate in a broader range and investors to remain cautious as major banks worldwide will announce their policy statements,'' said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd.'The hope of an interest rate cut by the US Fed has been further strengthened by recently released inflation and disappointing employment data in the US. Interest-sensitive sectors will likely be in focus this week,'' added Khemka.Also Read: US inflation hits 43-month low at 2.5% YoY in August: Wall Street lifts 25 bps Fed rate cut bets; Here’s whyPrimary markets will strongly gyrate this week as several new initial public offerings (IPO) and important listings are slated across the mainboard and small and medium enterprises (SME) segments. The week will be critical from the domestic and technical point of view as investors will track global markets and macroeconomic data.Overall, D-Street experts say the current market trend is expected to continue, and the Nifty 50 index will likely target 25,550 as the immediate goal. Sustained momentum from banking stocks will push the index to 26,000. Experts advise traders to ‘buy on dips’ and be stock-selective.Domestically, participants will closely monitor wholesale price index (WPI)- based inflation data and foreign fund flows, especially after recent improvements. The outlook for the market will be guided by major domestic economic data such as India's bank loan growth, WPI inflation (YoY) (Aug), India's trade balance (Aug), and India's FX reserves (USD).Also Read: US Fed set to announce first rate cut in four years next month: How will it impact India’s RBI policy? Experts weigh inOne of the year's most anticipated events is set to unfold this week with the US Federal Open Market Committee (FOMC) meeting, scheduled to deliver its interest rate decision on September 18. Global and domestic markets have fully priced in a rate cut, with analysts certain that this will begin an interest rate cut cycle in the US.Market analysts said initially, market sentiment predicted that the central bank would keep interest rates unchanged. Nonetheless, several traders have now priced in a rate cut by September due to a pessimistic mood and a series of sharp stock declines.‘’The market sentiments predict a rate cut of 25 BPS. Variables and moderate inflation may influence the next rate decision, so futures markets now indicate an 80 per cent possibility that rates will be in the 4.25–4.50 per cent range by year's end or lower. Naturally, everything will rely on how inflation develops and the economy is doing,'' said Palka Arora Chopra, Director of Master Capital Services Ltd.Also Read: Northern Arc Capital IPO opens on Monday: GMP, price band, other details in 10 pointsIn the mainboard segment, two new issues will open for subscription—Arkade Developers IPO and Northern Arc Capital IPO. Among the ongoing ones, Western Carriers IPO will close for subscription this week. In the SME segment, five news issues will open for bidding, and three ongoing SME IPos will close for bidding.Shares of Bajaj Housing Finance, Tolins Tyres, Kross Ltd, and P N Gadgil Jewellers will be listed on the BSE and NSE stock exchanges. Additionally, shares of nine SMEs will be listed on either the BSE or NSE SME. On Monday, Bajaj Housing Finance's listing will keep the market buzzing after investors bid for 64 times the shares in the hottest IPO so far in 2024.On the domestic front, robust foreign inflows contributed to the market's strength. Foreign institutional investors (FIIs) were net buyers, injecting  ₹15,199.60 crore into the cash segment. Domestic institutional investors (DIIs) also maintained their buying streak, adding  ₹2,444.19 crore to their portfolios.Also Read: FPIs pump  ₹27,856 crore in Indian equities, Sept debt inflow at  ₹7,525 crore; What fuels the renewed interest?Foreign portfolio investors (FPIs) invested  ₹27,856 crore worth of Indian equities, and the net investment stood at  ₹53,007 crore as of September 13, taking into account debt, hybrid, debt-VRR, and equities. This month, the total investment in debt markets moderated to  ₹7,525 crore.‘’Despite volatility, DIIs and FIIs flows remained positive as a strong monsoon, and an expectation of an uptick in demand during festive season drove investor sentiment,'' said Vinod Nair, Head of Research, Geojit Financial Services.The US benchmark index, the Dow Jones Industrial Average (DJIA), and broader indices made a strong recovery in the past week, nearing record highs and signalling positive sentiment ahead of the US Fed's decision. The US markets also reached record highs, while declining crude oil prices and a weakening dollar index further supported Indian markets.Also Read: US Federal Reserve ‘must go big with 50 bps interest rate cut in September’ or risk recession: Experts‘’With a 25 bps rate cut already priced in, a significant market reaction is unlikely. The Fed’s guidance on inflation, growth, and future rate cuts will be key in shaping broader market sentiment, particularly regarding global liquidity and risk appetite. A 50 bps cut could spark a positive reaction, especially in emerging markets like India. However, this effect may be short-lived as it could also raise concerns about the underlying strength of the US economy,'' said Ajit Mishra – SVP, Research, Religare Broking Ltd.Santosh Meena, Head of Research, Swastika Investmart Ltd agreed. He said, ‘’The general consensus is for a 25 bps rate cut, though some market participants are speculating a more aggressive 50 bps cut. Such a move would be a significant positive trigger for global markets, particularly for emerging markets like India, as it would likely result in a weaker dollar and lower US yields, spurring foreign inflows into Indian equities.''Also Read: RBI vs US Fed: Which central bank will cut interest rates first? Here’s a 5-point analysis‘’From a bearish perspective, however, an aggressive rate cut could signal deeper issues within the US economy. With markets already at all-time highs in anticipation of the rate cut, there is a risk of a pullback if concerns about economic health take hold,'' added Meena.Japan's inflation data is due Friday, followed by the Bank of Japan's (BoJ) monetary policy announcement. Any indication of further monetary tightening in Japan could raise concerns about a potential unwinding of the Yen carry trade, as interest rates in Japan and the US are moving in opposite directions. This could introduce fresh volatility to the global markets.Also Read: Oil logs first weekly gain in a month, snaps bearish sell-off from 33-month low; Brent up 2% to $72/bblThe outlook for the market will be guided by major global economic data such as US core retail sales (MoM) (Aug), US industrial production (MoM) (Aug), US FOMC economic projections, US FOMC press conference, US initial jobless claims, China PBoC loan prime rate (Sep). Other crucial factors influencing market sentiment include foreign fund inflows, the geopolitical landscape, and crude oil prices.Global crude oil prices logged their first weekly gain after almost one month in the previous session after Hurricane Francine caused production halts in the US Gulf of Mexico. Oil snapped the bearish sell-off tone buoyed by weather-related hurricane warnings after benchmark Brent crude futures crashed to a 33-month low over demand and oversupply concerns earlier this week.Brent settled lower on Friday, September 13, after US Gulf of Mexico crude production resumed following Hurricane Francine and a weekly rise in US rig count. Brent crude futures settled at $71.61 a barrel, down 36 cents or 0.5 per cent.US West Texas Intermediate crude (WTI) settled at $68.65 a barrel, down 32 cents, or 0.5 per cent. Back home, crude oil futures settled 0.46 per cent lower at  ₹5,782 per barrel on the multi-commodity exchange (MCX).Also Read: Crude View: D-Street experts peg Brent at $75-80 in near-term, Morgan Stanley cuts forecast by $5 on soft demandThe crude oil price remains 16 per cent lower this quarter due to concerns about a dimming demand outlook. For the week, oil futures finished higher following sharp storm-related increases early in the week, breaking a streak of declines. Brent logged an increase of about 0.8 per cent since the close of last Friday's session, while WTI registered a roughly 1.4 per cent gain.Brent crude rose above $72 a barrel, advancing for a third session. Much of crude’s recovery rally has been driven by covering of extreme bearish positioning after prices dipped below $70 earlier in the week.Stocks of several companies will trade ex-dividend, ex-bonus, and ex-split in the coming week. Mazagon Dock Shipbuilders, Hindustan Copper Ltd, Dixon Technologies (India) Ltd, Mastek Ltd, Mrs Bectors Food Specialities Ltd, and Steel Authority of India Ltd (SAIL), among several others, will trade ex-dividend this week. Check full list hereAjit Mishra of Religare Broking Ltd said, ‘’The prevailing market trend is expected to continue, and we are targeting 25,550 in the Nifty as the immediate goal. The recent participation from private banking majors is encouraging, and their sustained momentum could help the index reach the next milestone of 26,000.''‘’We recommend maintaining a buy-on-dips strategy, with strong support in the 24,750-25,000 range. Along with banking and financials, we advise focusing on IT, real estate, and metals for long trades while being selective in other sectors. Given the selective participation, as the broader indices gain traction, focusing on fundamentally strong stocks in the midcap and smallcap segments is important,'' added Mishra.Also Read: FPI inflows moderate to  ₹7,320 crore in August, debt market investment steady: 5 key factors behind sell-offOn the technical charts, Nifty is currently trading at its all-time high, with 25,500 acting as an immediate resistance level. A breakout above this level could trigger a rally toward the 26,000 mark. ‘’On the downside, 25,000 has now become a crucial support level. Unless Nifty breaks below 25,000, the bullish momentum is expected to continue, and any move below this level may lead to profit booking,'' said Santosh Meena of Swaktika Investmart.According to Meena, the key index to watch closely is Bank Nifty, at a critical resistance level of 52,000. A decisive move above this could spark a meaningful short-covering rally toward its previous all-time high of 53,357, with 52,500 being an intermediate hurdle.Also Read: SEBI’s nudge to ensure FPIs receive funds on settlement day starting October 2024‘’On the downside, 51,200 serves as immediate support, while the 100-day moving average (DMA) around 50,500 provides a more critical support level. A breach below this could shift the market sentiment,'' he said.Palka Arora Chopra of Master Capital Services Ltd added, '\"A sustained move above 52,200 could drive the index towards 52,500. On the downside, support is established at 51,600. If this level is breached, it may decline to 51,200. The prevailing positive sentiment supports a \"buy on dips\" strategy.\"","cleaned_content":"the indian stock market resumed its upward momentum and logged the best week since the end of june largely supported by positive global cues ahead of a likely interest rate cut by the us federal reserve in the third week of september investors will closely monitor key market triggers such as new listings domestic and global macroeconomic data us fed interest rate decisions foreign fund inflows crude oil prices and other global cues after a brief one week pause domestic equity benchmarks nifty \u003cFIVE_TEN\u003e and sensex surged again last week and reached fresh all time highs the nifty \u003cFIVE_TEN\u003e surged to a record \u003cTWO_TEN_THOUSAND\u003e before closing the week at \u003cTWO_TEN_THOUSAND\u003e a two per cent increase from the previous weeks close similarly the sensex touched an all time high of \u003cEIGHT_TEN_THOUSAND\u003e before ending the week at \u003cEIGHT_TEN_THOUSAND\u003e marking a \u003cTWO_PERCENT\u003e gain also read new age tech stocks paytm zomato outperform nifty \u003cFIVE_TEN\u003e this week cartrade biggest gainer nykaa reduced to sell while the tone remained subdued for most of the week a sharp rally on thursday shifted momentum back in favour of the bulls all sectors contributed to the rally with fmcg it and banking leading the gains the broader indices also performed well with the midcap index reaching a new record high the india vix or the india volatility index which measures the markets expectation of volatility in the nifty \u003cFIVE_TEN\u003e index fell by \u003cONE_TEN_PERCENT\u003e and closed the week at a \u003cONE_TEN\u003e level the frontline indices rose about two per cent each for the week their best gains since june end gains for the week were driven by a three per cent rise in consumer stocks in hopes of demand revival and volume growth due to a stable monsoon it companies that earn a chunk of their revenue from the us gained \u003cTWO_PERCENT\u003e ahead of a near certain us fed rate cut next week also read us fed policy decision in focus did powell led fomc wait too long to cut interest rates here s what experts sayindias consumer price index cpi based or retail inflation in august rose to \u003cTHREE_PERCENT\u003e though vegetables and pulses witnessed a double digit price rise however remained below the reserve bank of india rbi s median target of four per cent for the second month august retail inflation is the second lowest in the last five years we expect the market to consolidate in a broader range and investors to remain cautious as major banks worldwide will announce their policy statements said siddhartha khemka head research wealth management motilal oswal financial services ltd the hope of an interest rate cut by the us fed has been further strengthened by recently released inflation and disappointing employment data in the us interest sensitive sectors will likely be in focus this week added khemka also read us inflation hits \u003cFOUR_TEN\u003e month low at \u003cTWO_PERCENT\u003e yoy in august wall street lifts \u003cTWO_TEN\u003e bps fed rate cut bets here s whyprimary markets will strongly gyrate this week as several new initial public offerings ipo and important listings are slated across the mainboard and small and medium enterprises sme segments the week will be critical from the domestic and technical point of view as investors will track global markets and macroeconomic data overall d street experts say the current market trend is expected to continue and the nifty \u003cFIVE_TEN\u003e index will likely target \u003cTWO_TEN_THOUSAND\u003e as the immediate goal sustained momentum from banking stocks will push the index to \u003cTWO_TEN_THOUSAND\u003e experts advise traders to buy on dips and be stock selective domestically participants will closely monitor wholesale price index wpi based inflation data and foreign fund flows especially after recent improvements the outlook for the market will be guided by major domestic economic data such as indias bank loan growth wpi inflation yoy aug indias trade balance aug and indias fx reserves usd also read us fed set to announce first rate cut in four years next month how will it impact india s rbi policy experts weigh inone of the years most anticipated events is set to unfold this week with the us federal open market committee fomc meeting scheduled to deliver its interest rate decision on september \u003cONE_TEN\u003e global and domestic markets have fully priced in a rate cut with analysts certain that this will begin an interest rate cut cycle in the us market analysts said initially market sentiment predicted that the central bank would keep interest rates unchanged nonetheless several traders have now priced in a rate cut by september due to a pessimistic mood and a series of sharp stock declines the market sentiments predict a rate cut of \u003cTWO_TEN\u003e bps variables and moderate inflation may influence the next rate decision so futures markets now indicate an \u003cEIGHT_TEN_PERCENT\u003e possibility that rates will be in the \u003cFOUR_\u003e \u003cFOUR_PERCENT\u003e range by years end or lower naturally everything will rely on how inflation develops and the economy is doing said palka arora chopra director of master capital services ltd also read northern arc capital ipo opens on monday gmp price band other details in \u003cONE_TEN\u003e pointsin the mainboard segment two new issues will open for subscription arkade developers ipo and northern arc capital ipo among the ongoing ones western carriers ipo will close for subscription this week in the sme segment five news issues will open for bidding and three ongoing sme ipos will close for bidding shares of bajaj housing finance tolins tyres kross ltd and p n gadgil jewellers will be listed on the bse and nse stock exchanges additionally shares of nine smes will be listed on either the bse or nse sme on monday bajaj housing finances listing will keep the market buzzing after investors bid for \u003cSIX_TEN\u003e times the shares in the hottest ipo so far in \u003cTWO_THOUSAND\u003e on the domestic front robust foreign inflows contributed to the markets strength foreign institutional investors fiis were net buyers injecting \u003cONE_TEN_THOUSAND\u003e crore into the cash segment domestic institutional investors diis also maintained their buying streak adding \u003cTWO_THOUSAND\u003e crore to their portfolios also read fpis pump \u003cTWO_TEN_THOUSAND\u003e crore in indian equities sept debt inflow at \u003cSEVEN_THOUSAND\u003e crore what fuels the renewed interest foreign portfolio investors fpis invested \u003cTWO_TEN_THOUSAND\u003e crore worth of indian equities and the net investment stood at \u003cFIVE_TEN_THOUSAND\u003e crore as of september \u003cONE_TEN\u003e taking into account debt hybrid debt vrr and equities this month the total investment in debt markets moderated to \u003cSEVEN_THOUSAND\u003e crore despite volatility diis and fiis flows remained positive as a strong monsoon and an expectation of an uptick in demand during festive season drove investor sentiment said vinod nair head of research geojit financial services the us benchmark index the dow jones industrial average djia and broader indices made a strong recovery in the past week nearing record highs and signalling positive sentiment ahead of the us feds decision the us markets also reached record highs while declining crude oil prices and a weakening dollar index further supported indian markets also read us federal reserve must go big with \u003cFIVE_TEN\u003e bps interest rate cut in september or risk recession experts with a \u003cTWO_TEN\u003e bps rate cut already priced in a significant market reaction is unlikely the fed s guidance on inflation growth and future rate cuts will be key in shaping broader market sentiment particularly regarding global liquidity and risk appetite a \u003cFIVE_TEN\u003e bps cut could spark a positive reaction especially in emerging markets like india however this effect may be short lived as it could also raise concerns about the underlying strength of the us economy said ajit mishra svp research religare broking ltd santosh meena head of research swastika investmart ltd agreed he said the general consensus is for a \u003cTWO_TEN\u003e bps rate cut though some market participants are speculating a more aggressive \u003cFIVE_TEN\u003e bps cut such a move would be a significant positive trigger for global markets particularly for emerging markets like india as it would likely result in a weaker dollar and lower us yields spurring foreign inflows into indian equities also read rbi vs us fed which central bank will cut interest rates first here s a \u003cFIVE_\u003e point analysis from a bearish perspective however an aggressive rate cut could signal deeper issues within the us economy with markets already at all time highs in anticipation of the rate cut there is a risk of a pullback if concerns about economic health take hold added meena japans inflation data is due friday followed by the bank of japans boj monetary policy announcement any indication of further monetary tightening in japan could raise concerns about a potential unwinding of the yen carry trade as interest rates in japan and the us are moving in opposite directions this could introduce fresh volatility to the global markets also read oil logs first weekly gain in a month snaps bearish sell off from \u003cTHREE_TEN\u003e month low brent up \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e bblthe outlook for the market will be guided by major global economic data such as us core retail sales mom aug us industrial production mom aug us fomc economic projections us fomc press conference us initial jobless claims china pboc loan prime rate sep other crucial factors influencing market sentiment include foreign fund inflows the geopolitical landscape and crude oil prices global crude oil prices logged their first weekly gain after almost one month in the previous session after hurricane francine caused production halts in the us gulf of mexico oil snapped the bearish sell off tone buoyed by weather related hurricane warnings after benchmark brent crude futures crashed to a \u003cTHREE_TEN\u003e month low over demand and oversupply concerns earlier this week brent settled lower on friday september \u003cONE_TEN\u003e after us gulf of mexico crude production resumed following hurricane francine and a weekly rise in us rig count brent crude futures settled at \u003cSEVEN_TEN\u003e a barrel down \u003cTHREE_TEN\u003e cents or \u003cZERO_PERCENT\u003e us west texas intermediate crude wti settled at \u003cSIX_TEN\u003e a barrel down \u003cTHREE_TEN\u003e cents or \u003cZERO_PERCENT\u003e back home crude oil futures settled \u003cZERO_PERCENT\u003e lower at \u003cFIVE_THOUSAND\u003e per barrel on the multi commodity exchange mcx also read crude view d street experts peg brent at \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e in near term morgan stanley cuts forecast by \u003cFIVE_\u003e on soft demandthe crude oil price remains \u003cONE_TEN_PERCENT\u003e lower this quarter due to concerns about a dimming demand outlook for the week oil futures finished higher following sharp storm related increases early in the week breaking a streak of declines brent logged an increase of about \u003cZERO_PERCENT\u003e since the close of last fridays session while wti registered a roughly \u003cONE_PERCENT\u003e gain brent crude rose above \u003cSEVEN_TEN\u003e a barrel advancing for a third session much of crude s recovery rally has been driven by covering of extreme bearish positioning after prices dipped below \u003cSEVEN_TEN\u003e earlier in the week stocks of several companies will trade ex dividend ex bonus and ex split in the coming week mazagon dock shipbuilders hindustan copper ltd dixon technologies india ltd mastek ltd mrs bectors food specialities ltd and steel authority of india ltd sail among several others will trade ex dividend this week check full list hereajit mishra of religare broking ltd said the prevailing market trend is expected to continue and we are targeting \u003cTWO_TEN_THOUSAND\u003e in the nifty as the immediate goal the recent participation from private banking majors is encouraging and their sustained momentum could help the index reach the next milestone of \u003cTWO_TEN_THOUSAND\u003e we recommend maintaining a buy on dips strategy with strong support in the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range along with banking and financials we advise focusing on it real estate and metals for long trades while being selective in other sectors given the selective participation as the broader indices gain traction focusing on fundamentally strong stocks in the midcap and smallcap segments is important added mishra also read fpi inflows moderate to \u003cSEVEN_THOUSAND\u003e crore in august debt market investment steady \u003cFIVE_\u003e key factors behind sell offon the technical charts nifty is currently trading at its all time high with \u003cTWO_TEN_THOUSAND\u003e acting as an immediate resistance level a breakout above this level could trigger a rally toward the \u003cTWO_TEN_THOUSAND\u003e mark on the downside \u003cTWO_TEN_THOUSAND\u003e has now become a crucial support level unless nifty breaks below \u003cTWO_TEN_THOUSAND\u003e the bullish momentum is expected to continue and any move below this level may lead to profit booking said santosh meena of swaktika investmart according to meena the key index to watch closely is bank nifty at a critical resistance level of \u003cFIVE_TEN_THOUSAND\u003e a decisive move above this could spark a meaningful short covering rally toward its previous all time high of \u003cFIVE_TEN_THOUSAND\u003e with \u003cFIVE_TEN_THOUSAND\u003e being an intermediate hurdle also read sebi s nudge to ensure fpis receive funds on settlement day starting october \u003cTWO_THOUSAND\u003e on the downside \u003cFIVE_TEN_THOUSAND\u003e serves as immediate support while the \u003cONE_HUNDRED\u003e day moving average dma around \u003cFIVE_TEN_THOUSAND\u003e provides a more critical support level a breach below this could shift the market sentiment he said palka arora chopra of master capital services ltd added a sustained move above \u003cFIVE_TEN_THOUSAND\u003e could drive the index towards \u003cFIVE_TEN_THOUSAND\u003e on the downside support is established at \u003cFIVE_TEN_THOUSAND\u003e if this level is breached it may decline to \u003cFIVE_TEN_THOUSAND\u003e the prevailing positive sentiment supports a buy on dips strategy","timestamp":"2024-09-16T07:34:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}