{"url":"https://www.livemint.com/market/stock-market-news/cantor-predicts-130-surge-in-adani-energy-solutions-touts-it-as-a-potential-multibagger-11726828494100.html","title":"Cantor predicts 130% surge in Adani Energy Solutions, touts it as a potential multibagger","description":"Despite recent volatility, Adani Energy Solutions shows promise, with Cantor initiating an 'overweight' recommendation and a target price of  ₹2,251. The firm anticipates robust growth driven by its diverse operations in India's energy sector.","content":"Adani Energy Solutions, part of Adani Group, has had a volatile 2024, with the stock down over 6 percent YTD. In the last one year, it gained just 14.5 percent. Despite this lacklustre performance, brokerage firm Cantor sees potential multibagger returns for the stock.It has initiated a call on the Adani Group stock with an 'overweight' recommendation and a target price of  ₹2,251, implying a massive potential upside of 130 percent from its current market price of  ₹979.Adani Energy Solutions (AESL) boasts a diversified portfolio, including transmission assets, distribution assets, and a smart metering business. With an enterprise value of approximately $18.5 billion, AESL presents an attractive opportunity in India’s rapidly expanding energy markets, said the brokerage.Cantor forecasts total revenue for AESL to grow at a compound annual growth rate (CAGR) of 20 percent from FY24 to FY27E, with adjusted EBITDA expected to grow at a CAGR of 28.8 percent. In contrast, peers are projected to grow revenue in the low single digits and EBITDA in the mid-single digits. While AESL may appear more expensive on a multiple basis, it is anticipated to grow significantly faster than its competitors.The stock rose as much as 3.6 percent to its intra-day high of  ₹1,019.60. It is now over 24 percent away from its peak of  ₹1,347.90, hit last month. Meanwhile, it has rallied over 48 percent from its 52-week low of  ₹686.90, recorded in October last year.The brokerage noted that AESL's diversified business structure is expected to drive strong growth. The transmission segment is set to benefit from the completion of nine recently awarded projects within the next 18-24 months, with further contract wins anticipated. The distribution business is projected to grow at near double-digit rates, and the smart metering division is poised to begin generating substantial revenue from its backlog of 22.8 million smart meters.AESL is the largest private-sector power transmission and distribution business in India. The company’s ability to supply power to major areas such as Mumbai and the Mundra SEZ positions it well for growth. Additionally, smart meters represent a significant locked-in demand, with a government target of deploying 250 million smart meters by 2030.Using a relative valuation approach, Cantor compared AESL to peers in developed markets, noting that while these peers are forecasted to grow revenue at a CAGR of 3.1 percent and EBITDA at 10.8 percent, AESL's growth potential warrants a premium. Currently trading at a 60 percent discount on a growth-adjusted basis, AESL deserves a higher valuation multiple given its superior growth prospects.Despite its strengths, AESL faces potential risks, including political changes that may affect private sector development and competition for new contracts. Specific challenges include the inability to secure additional smart meter contracts and foreign exchange risks related to USD-denominated debt.","cleaned_content":"adani energy solutions part of adani group has had a volatile \u003cTWO_THOUSAND\u003e with the stock down over \u003cSIX_PERCENT\u003e ytd in the last one year it gained just \u003cONE_TEN_PERCENT\u003e despite this lacklustre performance brokerage firm cantor sees potential multibagger returns for the stock it has initiated a call on the adani group stock with an overweight recommendation and a target price of \u003cTWO_THOUSAND\u003e implying a massive potential upside of \u003cONE_HUNDRED_PERCENT\u003e from its current market price of \u003cNINE_HUNDRED\u003e adani energy solutions aesl boasts a diversified portfolio including transmission assets distribution assets and a smart metering business with an enterprise value of approximately \u003cONE_TEN\u003e billion aesl presents an attractive opportunity in india s rapidly expanding energy markets said the brokerage cantor forecasts total revenue for aesl to grow at a compound annual growth rate cagr of \u003cTWO_TEN_PERCENT\u003e from fy24 to fy27e with adjusted ebitda expected to grow at a cagr of \u003cTWO_TEN_PERCENT\u003e in contrast peers are projected to grow revenue in the low single digits and ebitda in the mid single digits while aesl may appear more expensive on a multiple basis it is anticipated to grow significantly faster than its competitors the stock rose as much as \u003cTHREE_PERCENT\u003e to its intra day high of \u003cONE_THOUSAND\u003e it is now over \u003cTWO_TEN_PERCENT\u003e away from its peak of \u003cONE_THOUSAND\u003e hit last month meanwhile it has rallied over \u003cFOUR_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSIX_HUNDRED\u003e recorded in october last year the brokerage noted that aesls diversified business structure is expected to drive strong growth the transmission segment is set to benefit from the completion of nine recently awarded projects within the next \u003cONE_TEN\u003e \u003cTWO_TEN\u003e months with further contract wins anticipated the distribution business is projected to grow at near double digit rates and the smart metering division is poised to begin generating substantial revenue from its backlog of \u003cTWO_TEN\u003e million smart meters aesl is the largest private sector power transmission and distribution business in india the company s ability to supply power to major areas such as mumbai and the mundra sez positions it well for growth additionally smart meters represent a significant locked in demand with a government target of deploying \u003cTWO_HUNDRED\u003e million smart meters by \u003cTWO_THOUSAND\u003e using a relative valuation approach cantor compared aesl to peers in developed markets noting that while these peers are forecasted to grow revenue at a cagr of \u003cTHREE_PERCENT\u003e and ebitda at \u003cONE_TEN_PERCENT\u003e aesls growth potential warrants a premium currently trading at a \u003cSIX_TEN_PERCENT\u003e discount on a growth adjusted basis aesl deserves a higher valuation multiple given its superior growth prospects despite its strengths aesl faces potential risks including political changes that may affect private sector development and competition for new contracts specific challenges include the inability to secure additional smart meter contracts and foreign exchange risks related to usd denominated debt","timestamp":"2024-09-20T16:41:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}