{"url":"https://www.livemint.com/market/stock-market-news/india-surpasses-china-as-the-largest-msci-emerging-market-amid-stock-market-rally-11726634176203.html","title":"India surpasses China as the largest MSCI Emerging Market amid stock market rally","description":"India has emerged as the largest emerging market in MSCI EM Investable Market Index (IMI). China’s weight in the index has halved since its peak in early 2021.","content":"India has surpassed China to become the largest market in the MSCI Emerging Markets Index. As of the end of August, India now leads all emerging markets, according to MSCI IMI.India has emerged as the largest emerging market in MSCI EM Investable Market Index (IMI), which includes large, mid and small-cap counters from 24 Emerging Markets economies, a report said. China’s weight in the index has halved since its peak in early 2021, according to a note by Morgan Stanley on September 17.India is now the sixth largest stock market globally, just behind France, and Morgan Stanley predicts India will continue to gain market share due to its strong performance, new listings, and improved liquidity.Morgan Stanley remains ‘Overweight’ on India and ‘Underweight’ on China in its pan-Asia EM asset allocation.India's nominal GDP growth is currently in the low teens, over three times faster than China’s, driving a significant divergence in company earnings and operational growth between the two markets, Morgan Stanley's equity strategists noted.","cleaned_content":"india has surpassed china to become the largest market in the msci emerging markets index as of the end of august india now leads all emerging markets according to msci imi india has emerged as the largest emerging market in msci em investable market index imi which includes large mid and small cap counters from \u003cTWO_TEN\u003e emerging markets economies a report said china s weight in the index has halved since its peak in early \u003cTWO_THOUSAND\u003e according to a note by morgan stanley on september \u003cONE_TEN\u003e india is now the sixth largest stock market globally just behind france and morgan stanley predicts india will continue to gain market share due to its strong performance new listings and improved liquidity morgan stanley remains overweight on india and underweight on china in its pan asia em asset allocation indias nominal gdp growth is currently in the low teens over three times faster than china s driving a significant divergence in company earnings and operational growth between the two markets morgan stanleys equity strategists noted","timestamp":"2024-09-18T10:07:00+05:30","market_timestamp":"2024-09-18T10:07:00+05:30","off_market_hours":false}