{"url":"https://www.livemint.com/market/stock-market-news/lic-housing-pnb-housing-shares-dip-up-to-6-3-as-bajaj-housing-finance-makes-stellar-debut-11726470531753.html","title":"LIC Housing, PNB Housing shares dip up to 6.3% as Bajaj Housing Finance makes stellar debut","description":"Bajaj Housing Finance, a key player in India's housing sector, debuted on the NSE at  ₹150 apiece, a 114.29 per cent premium over its IPO price. It garnered record subscriptions over  ₹3 lakh crore, reflecting strong investor demand and positioning within the expanding housing finance market.","content":"After witnessing Bajaj Housing Finance's phenomenal debut on the Indian stock exchanges, investors lucky enough to be allotted the shares were left exhilarated, eagerly crunching the numbers to calculate their remarkable profit margins.The stock's impressive performance saw investments doubling within minutes of its listing. The shares debuted on the NSE at  ₹150 each, representing a staggering 114.29 per cent premium to their IPO price of  ₹70 each.This stellar listing of Bajaj Housing Finance shares comes from strong demand for its initial public offering (IPO), which received a record amount of subscriptions exceeding  ₹3 lakh crore bids, compared to the IPO size of  ₹6,560 crore. The IPO price band is between  ₹66 and  ₹70 per share. It was the largest IPO of the year so far, and with its current gains, the shares now rank as the second-best performer among main board IPOs.Post-listing, the shares continued to climb, reaching  ₹165, a 10 per cent increase from their initial listing price. With Bajaj Housing Finance's strong performance, peer stocks such as LIC Housing Finance, PNB Housing Finance, and Can Fin Homes have experienced declines, with losses of up to 6.3 per cent.Analysts explain that the peer companies have weak fundamentals compared to the Bajaj Housing Finance. Before listing the Bajaj Housing shares, analysts expressed optimism about the company despite its higher valuations relative to peers. They highlighted BHFL's strong and diversified assets under management, excellent asset quality with non-performing assets (NPAs) below 1 per cent, and a superior technology platform enabling it to remain relevant in a stiff competitive environment.According to SBI Securities, Bajaj Housing Finance Limited is the second-largest housing finance company in India with an asset under management (AUM) of  ₹97,071 crore. It boasts the lowest gross and net non-performing asset (GNPA and NNPA) ratios among major housing finance companies, at 0.28 per cent and 0.11 per cent, respectively.SBI Securities also highlighted BHFL's impressive AUM growth of 30.9 per cent and profit growth of 56.2 per cent from FY22 to FY24. The company's strong association with the Bajaj brand is noted as a significant factor, and a projected industry growth rate of 13 per cent to 15 per cent over the next three years positions BHFL to benefit from the expanding housing finance sector.Bajaj Housing Finance is part of the esteemed Bajaj Group, a leading Indian conglomerate with a diverse portfolio. The group includes prominent listed entities such as Bajaj Finance, a top non-banking financial company, and Bajaj Auto, a key player in the automotive sector.Established in 2008 and a registered non-deposit-taking housing finance company with the National Housing Bank (NHB) since 2015, Bajaj Housing Finance began offering mortgage loans in FY18. It is wholly owned by Bajaj Finance, which is 51.34 per cent owned by Bajaj Finserv. Both are classified as promoters of Bajaj Housing Finance.","cleaned_content":"after witnessing bajaj housing finances phenomenal debut on the indian stock exchanges investors lucky enough to be allotted the shares were left exhilarated eagerly crunching the numbers to calculate their remarkable profit margins the stocks impressive performance saw investments doubling within minutes of its listing the shares debuted on the nse at \u003cONE_HUNDRED\u003e each representing a staggering \u003cONE_HUNDRED_PERCENT\u003e premium to their ipo price of \u003cSEVEN_TEN\u003e each this stellar listing of bajaj housing finance shares comes from strong demand for its initial public offering ipo which received a record amount of subscriptions exceeding \u003cTHREE_\u003e lakh crore bids compared to the ipo size of \u003cSIX_THOUSAND\u003e crore the ipo price band is between \u003cSIX_TEN\u003e and \u003cSEVEN_TEN\u003e per share it was the largest ipo of the year so far and with its current gains the shares now rank as the second best performer among main board ipos post listing the shares continued to climb reaching \u003cONE_HUNDRED\u003e a \u003cONE_TEN_PERCENT\u003e increase from their initial listing price with bajaj housing finances strong performance peer stocks such as lic housing finance pnb housing finance and can fin homes have experienced declines with losses of up to \u003cSIX_PERCENT\u003e analysts explain that the peer companies have weak fundamentals compared to the bajaj housing finance before listing the bajaj housing shares analysts expressed optimism about the company despite its higher valuations relative to peers they highlighted bhfls strong and diversified assets under management excellent asset quality with non performing assets npas below \u003cONE_PERCENT\u003e and a superior technology platform enabling it to remain relevant in a stiff competitive environment according to sbi securities bajaj housing finance limited is the second largest housing finance company in india with an asset under management aum of \u003cNINE_TEN_THOUSAND\u003e crore it boasts the lowest gross and net non performing asset gnpa and nnpa ratios among major housing finance companies at \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively sbi securities also highlighted bhfls impressive aum growth of \u003cTHREE_TEN_PERCENT\u003e and profit growth of \u003cFIVE_TEN_PERCENT\u003e from fy22 to fy24 the companys strong association with the bajaj brand is noted as a significant factor and a projected industry growth rate of \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e over the next three years positions bhfl to benefit from the expanding housing finance sector bajaj housing finance is part of the esteemed bajaj group a leading indian conglomerate with a diverse portfolio the group includes prominent listed entities such as bajaj finance a top non banking financial company and bajaj auto a key player in the automotive sector established in \u003cTWO_THOUSAND\u003e and a registered non deposit taking housing finance company with the national housing bank nhb since \u003cTWO_THOUSAND\u003e bajaj housing finance began offering mortgage loans in fy18 it is wholly owned by bajaj finance which is \u003cFIVE_TEN_PERCENT\u003e owned by bajaj finserv both are classified as promoters of bajaj housing finance","timestamp":"2024-09-16T13:09:00+05:30","market_timestamp":"2024-09-16T13:09:00+05:30","off_market_hours":false}