{"url":"https://www.livemint.com/market/stock-market-news/equities-and-rate-cuts-past-failures-to-boost-markets-prompt-nuvamas-caution-as-fed-enters-new-phase-11726203543420.html","title":"US Fed rate cut: Nuvama cautions investors – past cuts did not lead to immediate equity boosts","description":"Nuvama warns of market caution as the US Fed considers rate cuts, highlighting historical complexities where past cuts did not lead to immediate equity boosts. The firm advises reducing exposure to expensive cyclicals and focusing on resilient sectors like defensives and private banks.","content":"In a recent note, brokerage house Nuvama emphasised that markets are entering a new phase as the US Federal Reserve (Fed) prepares for potential rate cuts. While theory suggests that lower rates boost equity valuations, historical evidence paints a more complex picture. Past rate cuts, in 2001, 2007–08, and 2019, saw varied market responses, and Nuvama believes similar caution is warranted this time around as well.According to Nuvama, past cycles of Fed rate cuts have rarely led to an immediate re-rating of equities. In 2001, the Nifty fell by 35 percent after the rate cuts, despite expectations of a boost. The situation in 2007 saw an initial surge in the Nifty, only to crash by 60 percent the following year, while in 2019, rate cuts did not result in a significant market re-rating, and the Nifty remained largely flat, noted the brokerage.These outcomes are because rate cuts generally follow periods of earnings slowdowns. Even though they reduce the cost of capital, earnings downgrades and weak growth expectations can neutralise these advantages. Nuvama asserted that only deep rate cuts, coupled with low valuations, have historically been effective in supporting equity markets.Nuvama identified three key factors that influence market reactions during Fed rate cuts: the state of the US labour market, domestic demand, and market valuations.Today, many US labour indicators suggest recession risks, while domestic demand is weak and valuations are elevated. In contrast, in 2007, booming domestic demand helped markets rally before the global financial crisis led to a massive sell-off in 2008.Nuvama observed that the US bond market was showing signs of a potential recession, with the yield curve disinvesting after two years. In 2019, the Fed's pre-emptive rate cuts helped avoid a recession, but moderating commodity prices, such as steel and oil, now suggested global demand challenges.The report questioned whether domestic growth could counterbalance this global backdrop. In 2007, a strong domestic economy fueled a rally in Indian equities, but current demand indicators, like nominal GDP growth, were in single digits, similar to 2001 and 2019. Nuvama doubts the same domestic strength would prevail, especially with slowing earnings and weaker demand across emerging markets.Valuations were also stretched, similar to 2007, with most sectors, except banks, trading at more than two standard deviations above their 10-year averages. While recent market performance had been strong, particularly in midcaps, Nuvama noted that the fundamentals of Indian companies—marked by solid free cash flows and non-leveraged balance sheets—could soften the impact of any cyclical downturn.Nuvama drew parallels between today’s cyclicals—industrials, PSUs, autos, and metals—and IT stocks in 2001, which suffered the most after an initial surge. Similarly, cyclicals were hit hard in 2008. Given their significant outperformance over the past 18 months, cyclicals are now seen as vulnerable to a correction.The brokerage recommended reducing exposure to these sectors, as their valuations have become more than two standard deviations expensive. The risks are exacerbated by weak domestic demand and global recessionary trends, particularly in the US.In contrast to cyclicals, Nuvama advised positioning portfolios with a strong bias towards defensives such as cash cows, insurance, telecoms, pharma, and consumer sectors. These sectors have shown resilience during previous market downturns and are well-positioned to outperform in a volatile environment. The report also emphasised the importance of private banks, which have underperformed in recent times but are expected to catch up due to improving earnings and attractive valuations.Nuvama noted that defensive sectors have already begun outperforming cyclicals, particularly post-elections, and believes this trend will continue. The firm's model portfolio has benefited from an overweight position in defensives, delivering a 5 percent alpha over the past three months and the past year.Despite potential near-term pressure from rate cuts, Nuvama is bullish on private banks, which are seen as the only cyclical sector worth holding. Although private banks have underperformed, their valuations are now at a significant discount, and their earnings outlook is improving. The sector has historically fared well during periods of credit growth slowdown and rate cuts.Nuvama also reiterated that delayed rate cuts have often hurt expensive pockets of the market, such as Nasdaq and Indian IT in 2001 and cyclicals in 2008. Today, cyclicals and midcaps are similarly exposed, making defensive sectors and private banks the safer bet in this phase of the cycle.In summary, Nuvama advised caution as markets transition into a new phase driven by Fed rate cuts. The report emphasised the need for a defensive portfolio, with reduced exposure to expensive cyclicals and a focus on sectors that have proven resilient in past downturns. While rate cuts may provide some relief, the brokerage believes valuations are too stretched to expect a significant market re-rating, and defensive positioning remains the best strategy for the current environment.","cleaned_content":"in a recent note brokerage house nuvama emphasised that markets are entering a new phase as the us federal reserve fed prepares for potential rate cuts while theory suggests that lower rates boost equity valuations historical evidence paints a more complex picture past rate cuts in \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e \u003cEIGHT_\u003e and \u003cTWO_THOUSAND\u003e saw varied market responses and nuvama believes similar caution is warranted this time around as well according to nuvama past cycles of fed rate cuts have rarely led to an immediate re rating of equities in \u003cTWO_THOUSAND\u003e the nifty fell by \u003cTHREE_TEN_PERCENT\u003e after the rate cuts despite expectations of a boost the situation in \u003cTWO_THOUSAND\u003e saw an initial surge in the nifty only to crash by \u003cSIX_TEN_PERCENT\u003e the following year while in \u003cTWO_THOUSAND\u003e rate cuts did not result in a significant market re rating and the nifty remained largely flat noted the brokerage these outcomes are because rate cuts generally follow periods of earnings slowdowns even though they reduce the cost of capital earnings downgrades and weak growth expectations can neutralise these advantages nuvama asserted that only deep rate cuts coupled with low valuations have historically been effective in supporting equity markets nuvama identified three key factors that influence market reactions during fed rate cuts the state of the us labour market domestic demand and market valuations today many us labour indicators suggest recession risks while domestic demand is weak and valuations are elevated in contrast in \u003cTWO_THOUSAND\u003e booming domestic demand helped markets rally before the global financial crisis led to a massive sell off in \u003cTWO_THOUSAND\u003e nuvama observed that the us bond market was showing signs of a potential recession with the yield curve disinvesting after two years in \u003cTWO_THOUSAND\u003e the feds pre emptive rate cuts helped avoid a recession but moderating commodity prices such as steel and oil now suggested global demand challenges the report questioned whether domestic growth could counterbalance this global backdrop in \u003cTWO_THOUSAND\u003e a strong domestic economy fueled a rally in indian equities but current demand indicators like nominal gdp growth were in single digits similar to \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e nuvama doubts the same domestic strength would prevail especially with slowing earnings and weaker demand across emerging markets valuations were also stretched similar to \u003cTWO_THOUSAND\u003e with most sectors except banks trading at more than two standard deviations above their \u003cONE_TEN\u003e year averages while recent market performance had been strong particularly in midcaps nuvama noted that the fundamentals of indian companies marked by solid free cash flows and non leveraged balance sheets could soften the impact of any cyclical downturn nuvama drew parallels between today s cyclicals industrials psus autos and metals and it stocks in \u003cTWO_THOUSAND\u003e which suffered the most after an initial surge similarly cyclicals were hit hard in \u003cTWO_THOUSAND\u003e given their significant outperformance over the past \u003cONE_TEN\u003e months cyclicals are now seen as vulnerable to a correction the brokerage recommended reducing exposure to these sectors as their valuations have become more than two standard deviations expensive the risks are exacerbated by weak domestic demand and global recessionary trends particularly in the us in contrast to cyclicals nuvama advised positioning portfolios with a strong bias towards defensives such as cash cows insurance telecoms pharma and consumer sectors these sectors have shown resilience during previous market downturns and are well positioned to outperform in a volatile environment the report also emphasised the importance of private banks which have underperformed in recent times but are expected to catch up due to improving earnings and attractive valuations nuvama noted that defensive sectors have already begun outperforming cyclicals particularly post elections and believes this trend will continue the firms model portfolio has benefited from an overweight position in defensives delivering a \u003cFIVE_PERCENT\u003e alpha over the past three months and the past year despite potential near term pressure from rate cuts nuvama is bullish on private banks which are seen as the only cyclical sector worth holding although private banks have underperformed their valuations are now at a significant discount and their earnings outlook is improving the sector has historically fared well during periods of credit growth slowdown and rate cuts nuvama also reiterated that delayed rate cuts have often hurt expensive pockets of the market such as nasdaq and indian it in \u003cTWO_THOUSAND\u003e and cyclicals in \u003cTWO_THOUSAND\u003e today cyclicals and midcaps are similarly exposed making defensive sectors and private banks the safer bet in this phase of the cycle in summary nuvama advised caution as markets transition into a new phase driven by fed rate cuts the report emphasised the need for a defensive portfolio with reduced exposure to expensive cyclicals and a focus on sectors that have proven resilient in past downturns while rate cuts may provide some relief the brokerage believes valuations are too stretched to expect a significant market re rating and defensive positioning remains the best strategy for the current environment","timestamp":"2024-09-13T11:22:00+05:30","market_timestamp":"2024-09-13T11:22:00+05:30","off_market_hours":false}