{"url":"https://www.livemint.com/market/stock-market-news/suzlon-energy-shares-hit-52-week-high-continues-to-gain-for-third-consecutive-session-heres-why-11726139815807.html","title":"Suzlon Energy shares hit 52-week high, continues to gain for third consecutive session; here’s why","description":"The stock experienced significant trading activity, with approximately 13.94 crore shares exchanged on the NSE. The total traded value amounted to  ₹1,173.4 crore.","content":"Suzlon Energy's shares surged to a 5 per cent upper circuit for the third straight session, hitting a new 52-week high of  ₹86 in Wednesday's BSE trading. This boost was fueled by favorable investor sentiment after Morgan Stanley assigned an overweight rating to the renewable energy firm.The stock experienced significant trading activity, with approximately 13.94 crore shares exchanged on the NSE. The total traded value amounted to  ₹1,173.4 crore.Suzlon has recently won a major contract of 1,166 MW from NTPC Green Energy, the renewable energy division of state-owned NTPC. This substantial public sector order signifies Suzlon's comeback to significant contracts following a period of ineligibility due to its negative net worth. Morgan Stanley anticipates that this order will improve Suzlon's earnings outlook for FY26-FY27.As per the contract, Suzlon will install 370 S144 wind turbines (WTGs), each with a rated capacity of 3.15 MW, to produce electricity for 3 million households. This project, which is the largest wind energy order in India, will be carried out at three locations in Gujarat.The agreement outlines that Suzlon will supply the wind turbines, oversee their erection and commissioning, and provide ongoing operations and maintenance services once the project is operational.Suzlon shares recently garnered attention as the company agreed to sell and lease back its prime real estate, One Earth Property in Pune, for the next 5 years at  ₹440 crore. Following this development, domestic brokerage ICICI Securities increased its target price for the stock from  ₹70 to  ₹80.The market capitalization of the green energy company increased to  ₹1.14 lakh crore on the BSE. Suzlon Energy's stock has surged 266 per cent over the past year and 827 per cent over the last two years.The stock, a notable performer, recorded a high turnover of  ₹110 crore today, with 12.935 million shares traded on the BSE. On September 13, 2023, Suzlon Energy shares hit their 52-week low of  ₹21.71. With a beta of 0.9, Suzlon Energy shares show low volatility over the past year.","cleaned_content":"suzlon energys shares surged to a \u003cFIVE_PERCENT\u003e upper circuit for the third straight session hitting a new \u003cFIVE_TEN\u003e week high of \u003cEIGHT_TEN\u003e in wednesdays bse trading this boost was fueled by favorable investor sentiment after morgan stanley assigned an overweight rating to the renewable energy firm the stock experienced significant trading activity with approximately \u003cONE_TEN\u003e crore shares exchanged on the nse the total traded value amounted to \u003cONE_THOUSAND\u003e crore suzlon has recently won a major contract of \u003cONE_THOUSAND\u003e mw from ntpc green energy the renewable energy division of state owned ntpc this substantial public sector order signifies suzlons comeback to significant contracts following a period of ineligibility due to its negative net worth morgan stanley anticipates that this order will improve suzlons earnings outlook for fy26 fy27 as per the contract suzlon will install \u003cTHREE_HUNDRED\u003e s144 wind turbines wtgs each with a rated capacity of \u003cTHREE_\u003e mw to produce electricity for \u003cTHREE_\u003e million households this project which is the largest wind energy order in india will be carried out at three locations in gujarat the agreement outlines that suzlon will supply the wind turbines oversee their erection and commissioning and provide ongoing operations and maintenance services once the project is operational suzlon shares recently garnered attention as the company agreed to sell and lease back its prime real estate one earth property in pune for the next \u003cFIVE_\u003e years at \u003cFOUR_HUNDRED\u003e crore following this development domestic brokerage icici securities increased its target price for the stock from \u003cSEVEN_TEN\u003e to \u003cEIGHT_TEN\u003e the market capitalization of the green energy company increased to \u003cONE_\u003e lakh crore on the bse suzlon energys stock has surged \u003cTWO_HUNDRED_PERCENT\u003e over the past year and \u003cEIGHT_HUNDRED_PERCENT\u003e over the last two years the stock a notable performer recorded a high turnover of \u003cONE_HUNDRED\u003e crore today with \u003cONE_TEN\u003e million shares traded on the bse on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e suzlon energy shares hit their \u003cFIVE_TEN\u003e week low of \u003cTWO_TEN\u003e with a beta of \u003cZERO_\u003e suzlon energy shares show low volatility over the past year","timestamp":"2024-09-12T18:00:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}