{"url":"https://www.livemint.com/market/stock-market-news/european-stocks-gain-as-index-notches-best-week-in-a-month-11726252029093.html","title":"European Stocks Gain as Index Notches Best Week in a Month","description":"European stocks rose on Friday, with the regional benchmark marking its best week in a month. Danish stocks hit an all-time high, helped by this year’s rally in Novo Nordisk A/S.","content":"European stocks rose on Friday, with the regional benchmark marking its best week in a month. Danish stocks hit an all-time high, helped by this year’s rally in Novo Nordisk A/S.The Stoxx 600 Index rose 0.8% at the close in London, rounding out a 1.9% advance for the week to recoup some of last week’s losses. The retail and automotive sectors led gains, with nearly all groups in the green.While there were few catalysts on Friday, investors said the focus remains on the trajectory for US interest rates as the Federal Reserve prepares to meet next week. Barclays Plc strategists including Emmanuel Cau wrote that he expects European cyclical stocks to find a floor as markets no longer expect outsized interest-rate cuts and the economic data is “not falling off a cliff.”The OMX Copenhagen 25 Index gained 1.5% to 2,039.66 points, surpassing the prior record high set in 2021. The index has rallied 12% so far this year, partly as the popularity of weight-loss drugs made Novo one of the most well-owned stocks across global funds.Read: Danish Stocks Hit First Record High Since 2021 as Novo, DSV GainInvestors were also taking stock of comments from European Central Bank President Christine Lagarde after policymakers delivered the second quarter-point reduction in the deposit rate since June.The ECB is open to considering an interest-rate cut in October if the economy suffers a major setback — though the next comprehensive set of information will only be available at the following meeting, she told reporters in Budapest, where she attended a meeting of euro-area finance chiefs.Read: Lagarde Signals ECB Open to October Cut But December More Likely“With the ECB not in panic mode but observing slower growth and persistent core inflation, markets are beginning to see how recession risks are probably marginally retreating,” said Florian Ielpo, head of macro research at Lombard Odier Investment Managers.Among individual stocks, AstraZeneca Plc shares slumped 5.7% this week in their biggest drop since February, after a disappointing update for an experimental lung cancer medicine prompted two analyst downgrades. The stock slumped for a fourth-straight session on Friday, marking its longest streak of daily declines since May.Worldline shares plunged 14% to a record low. The French digital payment group cut its guidance for a second time in two months and said Chief Executive Officer Gilles Grapinet would step down by the end of the month.Campari shares dropped 5.6% after the chief executive officer said at a conference that the spirits company was seeing persisting softness in the sector in the US.For more on equity markets:You want more news on this market? Click here for a curated First Word channel of actionable news from Bloomberg and select sources. It can be customized to your preferences by clicking into Actions on the toolbar or hitting the HELP key for assistance. To subscribe to a daily list of European analyst rating changes, click here.With assistance from Bre Bradham.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"european stocks rose on friday with the regional benchmark marking its best week in a month danish stocks hit an all time high helped by this year s rally in novo nordisk a s the stoxx \u003cSIX_HUNDRED\u003e index rose \u003cZERO_PERCENT\u003e at the close in london rounding out a \u003cONE_PERCENT\u003e advance for the week to recoup some of last week s losses the retail and automotive sectors led gains with nearly all groups in the green while there were few catalysts on friday investors said the focus remains on the trajectory for us interest rates as the federal reserve prepares to meet next week barclays plc strategists including emmanuel cau wrote that he expects european cyclical stocks to find a floor as markets no longer expect outsized interest rate cuts and the economic data is not falling off a cliff the omx copenhagen \u003cTWO_TEN\u003e index gained \u003cONE_PERCENT\u003e to \u003cTWO_THOUSAND\u003e points surpassing the prior record high set in \u003cTWO_THOUSAND\u003e the index has rallied \u003cONE_TEN_PERCENT\u003e so far this year partly as the popularity of weight loss drugs made novo one of the most well owned stocks across global funds read danish stocks hit first record high since \u003cTWO_THOUSAND\u003e as novo dsv gaininvestors were also taking stock of comments from european central bank president christine lagarde after policymakers delivered the second quarter point reduction in the deposit rate since june the ecb is open to considering an interest rate cut in october if the economy suffers a major setback though the next comprehensive set of information will only be available at the following meeting she told reporters in budapest where she attended a meeting of euro area finance chiefs read lagarde signals ecb open to october cut but december more likely with the ecb not in panic mode but observing slower growth and persistent core inflation markets are beginning to see how recession risks are probably marginally retreating said florian ielpo head of macro research at lombard odier investment managers among individual stocks astrazeneca plc shares slumped \u003cFIVE_PERCENT\u003e this week in their biggest drop since february after a disappointing update for an experimental lung cancer medicine prompted two analyst downgrades the stock slumped for a fourth straight session on friday marking its longest streak of daily declines since may worldline shares plunged \u003cONE_TEN_PERCENT\u003e to a record low the french digital payment group cut its guidance for a second time in two months and said chief executive officer gilles grapinet would step down by the end of the month campari shares dropped \u003cFIVE_PERCENT\u003e after the chief executive officer said at a conference that the spirits company was seeing persisting softness in the sector in the us for more on equity markets you want more news on this market click here for a curated first word channel of actionable news from bloomberg and select sources it can be customized to your preferences by clicking into actions on the toolbar or hitting the help key for assistance to subscribe to a daily list of european analyst rating changes click here with assistance from bre bradham this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-13T23:57:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}