{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-axis-bank-to-zydus-life-smc-global-securities-lists-four-stocks-to-bet-on-this-week-check-tp-upside-11726578683418.html","title":"Stocks to buy: Axis Bank to Zydus Life—SMC Global Securities lists four stocks to bet on this week; Check TP, upside","description":"Stocks to buy: Domestic brokerage SMC Global Securities has recommended four stocks to buy this week based upon the fundamental and technical analysis in the current market scenario","content":"Stock market today: Domestic equity benchmarks Sensex and Nifty 50 experienced another day of consolidation on Tuesday, September 17, as traders remained cautious ahead of the US Federal Reserve's upcoming monetary policy meeting. On Wednesday, Jerome Powell-led US Fed is expected to implement its first interest rate cut since 2020.The Nifty 50 ended the session with a 0.14 per cent gain at 25,418 points, nearing an all-time high of 25,445 points during the session, with just 27 points away. The S\u0026P BSE Sensex ended with a 0.11 per cent gain at 83,079 points, also hitting a new peak. In the broader market, the BSE smallcap gauge declined 0.13 per cent, and midcap index edged lower by 0.08 per cent.Also Read: Expert View: US Fed to cut rates by 25 bps; may trigger temporary rally in Indian market: Amit Goel of Pace 360In the current market scenario, domestic brokerage firm SMC Global Securities has released its top four stock picks for this week. The brokerage has selected the following stocks based on technical and fundamental parameters. According to the brokerage, the stocks have robust fundamentals and are well-placed to yield good returns for investors in the next one year.Let's take a look at the top four technical and fundamental stocks for this week by brokerage SMC Global Securities:As of June 2024, the capital adequacy ratio (Basel III) stood at 16.65 per cent. Tier I was at 14.52 per cent and Tier II at 2.13 per cent. The private bank's return on average assets (ROA) and return on equity (ROE) stood at 1.65 per cent and 16.26 per cent, respectively in the quarter ended 30 June 2024.Also Read: HCL Tech to declare Q2 results on October 14, consider third interim dividend for FY25: Record date fixedAccording to SMC Global, the bank is well-capitalized and has adequate liquidity buffers for future growth. Improving asset quality and a strong position in payments and digital Banking indicate future growth visibility. It became a resilient all-weather franchise, delivering higher growth across focused granular business segments.According to the bank's management, the bank stays focused on three core areas of the GPS strategy's execution becoming a resilient, all-weather franchise, creating multiplicative forces to build competitive advantage and building for the future. The stock is expected to see a price target of Rs. 1,367 in 8 to 10 months on current P/BV of 2.39x and FY25 BVPS of Rs. 572.02.The company's management expects its EBITDA margin to improve by 100 to 150 basis points from its FY24 margin. R\u0026D expenditures are projected to be around eight per cent of sales for the full year. During the quarter, the company launched 10 new products in the India formulation business and seven new products in the US.Also Read: Week Ahead: US Fed policy, BoJ verdict, FII inflow, global cues among key market triggers as Nifty eyes 25,550According to the management, sustained growth momentum across businesses and enhanced profitability drove strong Q1 performance. The execution success of differentiated pipeline in the US and the outperformance of India's Geography business were particularly noteworthy.The company is on course to achieve growth aspirations for FY25 and is committed to investing in sustainable growth initiatives and innovative solutions for the future. The stock is expected to see a price target of Rs. 1,355 in 8 to 10 months on a current P/BVx of 5.68x and FY25 BVPS of Rs. 238.63.The stock's 200-day Exponential Moving Average (DEMA) on the daily chart is currently at 1,440. The stock has been trading under pressure since the beginning of the year when it marked its 52-week low of 1,329.20 in August. However, a sharp recovery has been witnessed in the prices, as, once again, momentum was seen picking up above the 200-day exponential moving average on daily charts last week.Also Read: India records highest mainboard listed cos at over 5,450 in first half of 2024, captures 25% of global IPO volumeTechnically, the stock has given a breakout above the falling trend line of long-term bearish channels with signs of potential reversal. A fresh breakout on short-term charts has also been observed above the Inverted Head \u0026 Shoulder pattern. Therefore, one can buy the stock in the range of 1,450-1,460 for the upside target of 1,540-1,550 levels with SL below 1,400 levels.The stock's 200-day Exponential Moving Average (DEMA) on the daily chart is currently at  ₹765. The stock has been consolidating in a broader range of 700-820 on broader charts while the trend remains intact with a bullish move as the stock can be seen holding well above its 200-day exponential moving average on daily charts.Also Read: US Fed policy decision in focus: Did Powell-led FOMC wait too long to cut interest rates? Here’s what experts sayLast week, charts above the key resistance level of 820 showed a fresh breakout after a phase of prolonged consolidation lasting more than six months. A substantial increase in trading volume supports the momentum, suggesting the potential for further price gains. Therefore, one can buy the stock in the range of 835-840 for the upside target of 990-1,000 levels with SL below 740 levels.","cleaned_content":"stock market today domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e experienced another day of consolidation on tuesday september \u003cONE_TEN\u003e as traders remained cautious ahead of the us federal reserves upcoming monetary policy meeting on wednesday jerome powell led us fed is expected to implement its first interest rate cut since \u003cTWO_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e ended the session with a \u003cZERO_PERCENT\u003e gain at \u003cTWO_TEN_THOUSAND\u003e points nearing an all time high of \u003cTWO_TEN_THOUSAND\u003e points during the session with just \u003cTWO_TEN\u003e points away the s p bse sensex ended with a \u003cZERO_PERCENT\u003e gain at \u003cEIGHT_TEN_THOUSAND\u003e points also hitting a new peak in the broader market the bse smallcap gauge declined \u003cZERO_PERCENT\u003e and midcap index edged lower by \u003cZERO_PERCENT\u003e also read expert view us fed to cut rates by \u003cTWO_TEN\u003e bps may trigger temporary rally in indian market amit goel of pace \u003cTHREE_HUNDRED\u003e in the current market scenario domestic brokerage firm smc global securities has released its top four stock picks for this week the brokerage has selected the following stocks based on technical and fundamental parameters according to the brokerage the stocks have robust fundamentals and are well placed to yield good returns for investors in the next one year lets take a look at the top four technical and fundamental stocks for this week by brokerage smc global securities as of june \u003cTWO_THOUSAND\u003e the capital adequacy ratio basel iii stood at \u003cONE_TEN_PERCENT\u003e tier i was at \u003cONE_TEN_PERCENT\u003e and tier ii at \u003cTWO_PERCENT\u003e the private banks return on average assets roa and return on equity roe stood at \u003cONE_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively in the quarter ended \u003cTHREE_TEN\u003e june \u003cTWO_THOUSAND\u003e also read hcl tech to declare q2 results on october \u003cONE_TEN\u003e consider third interim dividend for fy25 record date fixedaccording to smc global the bank is well capitalized and has adequate liquidity buffers for future growth improving asset quality and a strong position in payments and digital banking indicate future growth visibility it became a resilient all weather franchise delivering higher growth across focused granular business segments according to the banks management the bank stays focused on three core areas of the gps strategys execution becoming a resilient all weather franchise creating multiplicative forces to build competitive advantage and building for the future the stock is expected to see a price target of rs \u003cONE_THOUSAND\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on current p bv of \u003cTWO_\u003e x and fy25 bvps of rs \u003cFIVE_HUNDRED\u003e the companys management expects its ebitda margin to improve by \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e basis points from its fy24 margin r d expenditures are projected to be around eight per cent of sales for the full year during the quarter the company launched \u003cONE_TEN\u003e new products in the india formulation business and seven new products in the us also read week ahead us fed policy boj verdict fii inflow global cues among key market triggers as nifty eyes \u003cTWO_TEN_THOUSAND\u003e according to the management sustained growth momentum across businesses and enhanced profitability drove strong q1 performance the execution success of differentiated pipeline in the us and the outperformance of indias geography business were particularly noteworthy the company is on course to achieve growth aspirations for fy25 and is committed to investing in sustainable growth initiatives and innovative solutions for the future the stock is expected to see a price target of rs \u003cONE_THOUSAND\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on a current p bvx of \u003cFIVE_\u003e x and fy25 bvps of rs \u003cTWO_HUNDRED\u003e the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cONE_THOUSAND\u003e the stock has been trading under pressure since the beginning of the year when it marked its \u003cFIVE_TEN\u003e week low of \u003cONE_THOUSAND\u003e in august however a sharp recovery has been witnessed in the prices as once again momentum was seen picking up above the \u003cTWO_HUNDRED\u003e day exponential moving average on daily charts last week also read india records highest mainboard listed cos at over \u003cFIVE_THOUSAND\u003e in first half of \u003cTWO_THOUSAND\u003e captures \u003cTWO_TEN_PERCENT\u003e of global ipo volumetechnically the stock has given a breakout above the falling trend line of long term bearish channels with signs of potential reversal a fresh breakout on short term charts has also been observed above the inverted head shoulder pattern therefore one can buy the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for the upside target of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels with sl below \u003cONE_THOUSAND\u003e levels the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cSEVEN_HUNDRED\u003e the stock has been consolidating in a broader range of \u003cSEVEN_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e on broader charts while the trend remains intact with a bullish move as the stock can be seen holding well above its \u003cTWO_HUNDRED\u003e day exponential moving average on daily charts also read us fed policy decision in focus did powell led fomc wait too long to cut interest rates here s what experts saylast week charts above the key resistance level of \u003cEIGHT_HUNDRED\u003e showed a fresh breakout after a phase of prolonged consolidation lasting more than six months a substantial increase in trading volume supports the momentum suggesting the potential for further price gains therefore one can buy the stock in the range of \u003cEIGHT_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e for the upside target of \u003cNINE_HUNDRED\u003e \u003cONE_THOUSAND\u003e levels with sl below \u003cSEVEN_HUNDRED\u003e levels","timestamp":"2024-09-17T18:43:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}