{"url":"https://www.livemint.com/market/stock-market-news/newage-tech-stocks-paytm-zomato-outperform-nifty-50-this-week-cartrade-biggest-gainer-nykaa-reduced-to-sell-11726328654909.html","title":"New-Age Tech Stocks | Paytm, Zomato outperform Nifty 50 this week, CarTrade biggest gainer; Nykaa reduced to ‘sell’","description":"New-Age Tech Stocks | CarTrade Tech emerged as the biggest weekly gainer among new-age stocks, rising over 11 per cent in the last five days, followed by Brainbees Solutions (First Cry) and C.E. Info Systems.","content":"New-age tech stocks such as Zomato, Nykaa, Mamaearth, FirstCry, Paytm, and CarTrade Tech, among others, saw roller coaster rides in their respective stock prices this week. Some stocks snapped their winning streaks, while others outperformed the frontline benchmarks. New-age internet stocks have lately generated a buzzing interest among D-Street investors due to their attractive valuations and consumer-centric business mandate approach.Deepinder Goyal-led food delivery giant Zomato is the biggest new-age gen stock by market value with a market capitalisation (mcap) of  ₹2,41,090.10 crore. Zomato is followed by India's largest online insurance and lending platform, PB Fintech, which operates ‘Policybazaar’ and commands a cap of  ₹82,729.23 crore. The map values are dated as of the last market session,i.e., September 13.Also Read: Breakout stock: Zomato share price sees range breakout; analysts expect up to 18% upsideIn the second week of September, analysts said Paytm, Zomato, Unicommerce eSolutions, and Brainbees Solutions (First Cry) had outperformed the frontline benchmark NSE Nifty 50. On the other hand, FSN E-Commerce Ventures Ltd, which owns the beauty and personal care brand Nykaa Nykaa, Ola Electric Ltd and Delhivery have underperformed in the last five days.‘’Zomato’s strategy strongly focuses on profitability and scaling across multiple verticals. The food delivery segment remains the core of its business, where Zomato has achieved steady growth, reaching 13 per cent GMV growth in USD terms by the end of FY24. The margin improvements are notable, with its EBITDA margin projected to expand from 0.3 per cent in FY24 to 15.1 per cent by FY27, reflecting operational efficiencies and higher average order values,'' said Sonam Srivastava- Founder at Wright Research.Also Read: Zomato share price at a fresh record high, up nearly 193% from its 1-year low; is it still buy-worthy? Experts weigh inCarTrade Tech was the biggest weekly gainer, leading the new-age tech pack with a stellar rise of 11.78 per cent, followed by Brainbees Solutions, which rose 8.79 per cent and C.E. Info System, which gained 4.56 per cent.On the downside, Nykaa emerged as the biggest loser among the top 13 new-age tech stocks this week, shedding as much as 5.51 per cent from its stock price. Nykaa was followed by Honasa Consumer Ltd, which owns Mamaearth, logging a weekly decline of 5.05 per cent and Ola Electric, which gave up 2.70 per cent of its share price.Notably, CarTrade Tech commands the smallest market cap at  ₹4,686.26 crore when compared to the top 10 new-age stocks, including Nykaa, Zomato, Paytm, Honasa Consumer, PB Fintech, and others, yet the online automotive firm dominated D-Street as the biggest weekly gainer in the group this week.Also Read: Unicommerce eSolutions share price jumps 9% after bumper listing. Should you buy, sell or hold?In FY24, new-age tech stocks gave up to 258 per cent returns, with Zomato topping the charts after a 38 per cent market correction in FY23. ‘’New Age stocks have seen a lot of positive action following the success of Zomato, which has now become profitable and focused on adding value to its stakeholders,'' said Avinash Goraksakar, Director, Research at ProfitMart Securities Pvt Ltd.Commenting on CarTrade Tech's fundamental growth, Avinash Goraksakar said, \"As the automotive industry evolves, Cartrade Tech caters to evolving consumer preferences. The convenience of digital vehicle shopping and supplementary services position the company at the forefront of India’s automotive industry.\"Operating online automotive marketplaces, including CarWale, CarTrade, and BikeWale, Cartrade Tech facilitates digital vehicle research, comparison, and purchase. Additionally, C.E. Info System emerged as the third-highest weekly gainer. Operating the renowned MapMyIndia brand, CE Info Systems provides digital mapping, navigation, and location-based services.Also Read: Honasa Consumer: Mamaearth stock climbed over 45% since its IPO last November; what lies ahead?‘’In our digital age, precise mapping services are vital for businesses and consumers. With applications spanning logistics to urban planning, its advanced technologies and comprehensive mapping database establish it as an industry leader,'' said Goraksakar of ProfitMart Securities.Nykaa: Shrikant Chouhan, Head of Equity Research at Kotak Securities, has downgraded Nykaa stock to ‘sell’ despite its sharp 34 per cent price run-up in the past three months. The stock's target price is pegged at  ₹190 at a current market price of  ₹206.‘’Nykaa has a diverse portfolio of beauty, personal care, and fashion products, including its own brand products. We believe the fulfilment cost may increase in the near term, as the company attempts to cover many cities in the same-day/next-day delivery folds,'' said Chouhan.Also Read: Ambit sees 11.5% downside in Ola Electric Mobility as stock falls 28% from peak, reiterates ‘sell’ call—key reasons whyConsequently, the market analyst trimmed EBITDA estimates for the BPC and eB2B segments, resulting in a 7-11 per cent EPS cut for FY2025-27 and a new FV of Rs190.Delhivery: Delhivery provides a full range of Logistics services, including delivery of express parcels and heavy goods, PTL freight, TL freight, warehousing, supply chain solutions, cross-border Express, freight services, and supply chain software. The stock's target price is pegged at  ₹560 at a current market price of  ₹414.‘’The growing interplay of Delhivery’s businesses is helping it leverage its integrated and interoperable network, increasing its cost lead over new-age/traditional monoline business peers. It is rightfully skipping opportunities that limit the use of such network moats. This should likely set the stage for positive surprises on margin uptick. We increase our margin estimates by 60-100 bps; FV increases to  ₹560 from  ₹545,'' said Kotak's Shrikant Chouhan.Also Read: Honasa Consumer share price plunges over 6% on block deal buzzNew-age tech companies focus on innovative and high-growth areas. They often leverage modern technologies like artificial intelligence, machine learning, the Internet of Things (IoT), and blockchain to create unique products and services. The companies are characterized by sudden growth, high market valuations, and significant potential for disrupting traditional industries.India's top new-age tech firms operate in digital mapping, fintech, online marketplaces, food delivery services, logistics, gaming, and cloud computing. These firms include Awfis, Ola Electric, Digit Insurance, Mamaearth, Zomato, Nykaa, Paytm, FirctCry, Zaggle, RateGain, MapMyIndia, and Delhivery. In the last week, shares of Awfis and Nykaa surged the most among all new-age internet stocks.","cleaned_content":"new age tech stocks such as zomato nykaa mamaearth firstcry paytm and cartrade tech among others saw roller coaster rides in their respective stock prices this week some stocks snapped their winning streaks while others outperformed the frontline benchmarks new age internet stocks have lately generated a buzzing interest among d street investors due to their attractive valuations and consumer centric business mandate approach deepinder goyal led food delivery giant zomato is the biggest new age gen stock by market value with a market capitalisation mcap of \u003cTWO_HUNDRED_THOUSAND\u003e crore zomato is followed by indias largest online insurance and lending platform pb fintech which operates policybazaar and commands a cap of \u003cEIGHT_TEN_THOUSAND\u003e crore the map values are dated as of the last market session i e september \u003cONE_TEN\u003e also read breakout stock zomato share price sees range breakout analysts expect up to \u003cONE_TEN_PERCENT\u003e upsidein the second week of september analysts said paytm zomato unicommerce esolutions and brainbees solutions first cry had outperformed the frontline benchmark nse nifty \u003cFIVE_TEN\u003e on the other hand fsn e commerce ventures ltd which owns the beauty and personal care brand nykaa nykaa ola electric ltd and delhivery have underperformed in the last five days zomato s strategy strongly focuses on profitability and scaling across multiple verticals the food delivery segment remains the core of its business where zomato has achieved steady growth reaching \u003cONE_TEN_PERCENT\u003e gmv growth in usd terms by the end of fy24 the margin improvements are notable with its ebitda margin projected to expand from \u003cZERO_PERCENT\u003e in fy24 to \u003cONE_TEN_PERCENT\u003e by fy27 reflecting operational efficiencies and higher average order values said sonam srivastava founder at wright research also read zomato share price at a fresh record high up nearly \u003cONE_HUNDRED_PERCENT\u003e from its \u003cONE_\u003e year low is it still buy worthy experts weigh incartrade tech was the biggest weekly gainer leading the new age tech pack with a stellar rise of \u003cONE_TEN_PERCENT\u003e followed by brainbees solutions which rose \u003cEIGHT_PERCENT\u003e and c e info system which gained \u003cFOUR_PERCENT\u003e on the downside nykaa emerged as the biggest loser among the top \u003cONE_TEN\u003e new age tech stocks this week shedding as much as \u003cFIVE_PERCENT\u003e from its stock price nykaa was followed by honasa consumer ltd which owns mamaearth logging a weekly decline of \u003cFIVE_PERCENT\u003e and ola electric which gave up \u003cTWO_PERCENT\u003e of its share price notably cartrade tech commands the smallest market cap at \u003cFOUR_THOUSAND\u003e crore when compared to the top \u003cONE_TEN\u003e new age stocks including nykaa zomato paytm honasa consumer pb fintech and others yet the online automotive firm dominated d street as the biggest weekly gainer in the group this week also read unicommerce esolutions share price jumps \u003cNINE_PERCENT\u003e after bumper listing should you buy sell or hold in fy24 new age tech stocks gave up to \u003cTWO_HUNDRED_PERCENT\u003e returns with zomato topping the charts after a \u003cTHREE_TEN_PERCENT\u003e market correction in fy23 new age stocks have seen a lot of positive action following the success of zomato which has now become profitable and focused on adding value to its stakeholders said avinash goraksakar director research at profitmart securities pvt ltd commenting on cartrade techs fundamental growth avinash goraksakar said as the automotive industry evolves cartrade tech caters to evolving consumer preferences the convenience of digital vehicle shopping and supplementary services position the company at the forefront of india s automotive industry operating online automotive marketplaces including carwale cartrade and bikewale cartrade tech facilitates digital vehicle research comparison and purchase additionally c e info system emerged as the third highest weekly gainer operating the renowned mapmyindia brand ce info systems provides digital mapping navigation and location based services also read honasa consumer mamaearth stock climbed over \u003cFOUR_TEN_PERCENT\u003e since its ipo last november what lies ahead in our digital age precise mapping services are vital for businesses and consumers with applications spanning logistics to urban planning its advanced technologies and comprehensive mapping database establish it as an industry leader said goraksakar of profitmart securities nykaa shrikant chouhan head of equity research at kotak securities has downgraded nykaa stock to sell despite its sharp \u003cTHREE_TEN_PERCENT\u003e price run up in the past three months the stocks target price is pegged at \u003cONE_HUNDRED\u003e at a current market price of \u003cTWO_HUNDRED\u003e nykaa has a diverse portfolio of beauty personal care and fashion products including its own brand products we believe the fulfilment cost may increase in the near term as the company attempts to cover many cities in the same day next day delivery folds said chouhan also read ambit sees \u003cONE_TEN_PERCENT\u003e downside in ola electric mobility as stock falls \u003cTWO_TEN_PERCENT\u003e from peak reiterates sell call key reasons whyconsequently the market analyst trimmed ebitda estimates for the bpc and eb2b segments resulting in a \u003cSEVEN_\u003e \u003cONE_TEN_PERCENT\u003e eps cut for fy2025 \u003cTWO_TEN\u003e and a new fv of rs190 delhivery delhivery provides a full range of logistics services including delivery of express parcels and heavy goods ptl freight tl freight warehousing supply chain solutions cross border express freight services and supply chain software the stocks target price is pegged at \u003cFIVE_HUNDRED\u003e at a current market price of \u003cFOUR_HUNDRED\u003e the growing interplay of delhivery s businesses is helping it leverage its integrated and interoperable network increasing its cost lead over new age traditional monoline business peers it is rightfully skipping opportunities that limit the use of such network moats this should likely set the stage for positive surprises on margin uptick we increase our margin estimates by \u003cSIX_TEN\u003e \u003cONE_HUNDRED\u003e bps fv increases to \u003cFIVE_HUNDRED\u003e from \u003cFIVE_HUNDRED\u003e said kotaks shrikant chouhan also read honasa consumer share price plunges over \u003cSIX_PERCENT\u003e on block deal buzznew age tech companies focus on innovative and high growth areas they often leverage modern technologies like artificial intelligence machine learning the internet of things iot and blockchain to create unique products and services the companies are characterized by sudden growth high market valuations and significant potential for disrupting traditional industries indias top new age tech firms operate in digital mapping fintech online marketplaces food delivery services logistics gaming and cloud computing these firms include awfis ola electric digit insurance mamaearth zomato nykaa paytm firctcry zaggle rategain mapmyindia and delhivery in the last week shares of awfis and nykaa surged the most among all new age internet stocks","timestamp":"2024-09-14T21:43:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}