{"url":"https://www.livemint.com/market/stock-market-news/midcap-it-stock-surges-persistent-systems-share-price-hits-52-week-high-heres-why-11726039248100.html","title":"Mid-cap IT stock surge: Persistent Systems share price hits 52-week high. Here’s why","description":"Mid-cap IT stock surges: Persistent Systems' share price surged to a 52-week high on September 11 following the announcement of its acquisition of SoHo Dragon Inc. The $4.7 million ( ₹39 crore) deal is expected to boost the company's revenue and strengthen its position in the BFSI sector.","content":"Mid-cap IT stock surges: Persistent Systems share price was trading in the green, up over 1.70 per cent on BSE, soon after the company announced the acquisition of select assets from SoHo Dragon Inc. in a deal valued at $4.7 million, or approximately  ₹39 crore, on September 11. This acquisition included specific employees, contractors, and a key customer contract, with the assets expected to generate  ₹77 crore in annual revenue. The agreement was finalized on September 10, 2024, and is subject to standard closing conditions, with completion anticipated within 4-8 weeks.Persistent Systems share price was trading in the green, up 0.74 per cent, at  ₹5,313.00, on September 11, at 2:21 pm. The company enjoys a market capitalisation of  ₹82,885.44 crore. The stock hit a 52-week high earlier in the day.The payment structure included an upfront payment of  ₹25.6 crore, a maximum earnout of  ₹12.4 crore over three years contingent on performance, and  ₹1 crore allocated for retaining key personnel. The acquisition further bolsters Persistent’s strategic positioning in the BFSI sector, a key industry for both companies.Meanwhile, a recent analysis by a domestic financial firm, Prabhudas Lilladher, shed light on the current state of India's IT sector. The report indicated that major IT companies are grappling with a challenging market environment, with these difficulties now extending to mid-sized IT firms. This has led to noticeable fluctuations in their operational results, as reported by Mint.Poonawalla Fincorp Limited has announced the grant of 300,000 stock options under its Employee Stock Option Plan-2024 - Scheme-II (ESOP-2024 - Scheme-II). The Nomination and Remuneration Committee of the Board approved this grant on September 10, 2024, with an exercise price set at  ₹382.63 per option.The options are part of Tranche 13 and will vest according to the schedule outlined in the ESOP-2024 - Scheme-II. As amended, this grant adheres to the SEBI (Share Based Employee Benefits \u0026 Sweat Equity) Regulations, 2021.The company has communicated this development to the National Stock Exchange of India Limited and BSE Limited, requesting that they note the grant.","cleaned_content":"mid cap it stock surges persistent systems share price was trading in the green up over \u003cONE_PERCENT\u003e on bse soon after the company announced the acquisition of select assets from soho dragon inc in a deal valued at \u003cFOUR_\u003e million or approximately \u003cTHREE_TEN\u003e crore on september \u003cONE_TEN\u003e this acquisition included specific employees contractors and a key customer contract with the assets expected to generate \u003cSEVEN_TEN\u003e crore in annual revenue the agreement was finalized on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and is subject to standard closing conditions with completion anticipated within \u003cFOUR_\u003e \u003cEIGHT_\u003e weeks persistent systems share price was trading in the green up \u003cZERO_PERCENT\u003e at \u003cFIVE_THOUSAND\u003e on september \u003cONE_TEN\u003e at \u003cTWO_\u003e \u003cTWO_TEN\u003e pm the company enjoys a market capitalisation of \u003cEIGHT_TEN_THOUSAND\u003e crore the stock hit a \u003cFIVE_TEN\u003e week high earlier in the day the payment structure included an upfront payment of \u003cTWO_TEN\u003e crore a maximum earnout of \u003cONE_TEN\u003e crore over three years contingent on performance and \u003cONE_\u003e crore allocated for retaining key personnel the acquisition further bolsters persistent s strategic positioning in the bfsi sector a key industry for both companies meanwhile a recent analysis by a domestic financial firm prabhudas lilladher shed light on the current state of indias it sector the report indicated that major it companies are grappling with a challenging market environment with these difficulties now extending to mid sized it firms this has led to noticeable fluctuations in their operational results as reported by mint poonawalla fincorp limited has announced the grant of \u003cTHREE_HUNDRED_THOUSAND\u003e stock options under its employee stock option plan \u003cTWO_THOUSAND\u003e scheme ii esop \u003cTWO_THOUSAND\u003e scheme ii the nomination and remuneration committee of the board approved this grant on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with an exercise price set at \u003cTHREE_HUNDRED\u003e per option the options are part of tranche \u003cONE_TEN\u003e and will vest according to the schedule outlined in the esop \u003cTWO_THOUSAND\u003e scheme ii as amended this grant adheres to the sebi share based employee benefits sweat equity regulations \u003cTWO_THOUSAND\u003e the company has communicated this development to the national stock exchange of india limited and bse limited requesting that they note the grant","timestamp":"2024-09-11T13:43:00+05:30","market_timestamp":"2024-09-11T13:43:00+05:30","off_market_hours":false}