{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-adani-group-irctc-yes-bank-honasa-consumer-hal-and-more-11726166111307.html","title":"Stocks to watch: Adani Group, IRCTC, Yes Bank, Honasa Consumer, HAL, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"IRCTC: Life Insurance Corporation of India (LIC) has raised its shareholding in Indian Railway Catering and Tourism Corporation (IRCTC) to approximately 9.3 percent, as revealed in a regulatory filing on Thursday. LIC's stake in the railway sector 'miniratna' PSU increased by 2.02 percent between December 16, 2022, and September 11, 2024, through open market purchases. The insurer now holds 7,43,79,924 shares, up from 5,82,22,948 shares, marking a rise from 7.28 percent to 9.30 percent of IRCTC's paid-up capital.Hindalco: Birla Estates, the real estate arm of Aditya Birla Group's Century Textiles, through its subsidiary Ekamaya Property, has completed the acquisition of a 24.5-acre land parcel in Kalwa, Thane, for  ₹537.42 crore. The land was sold by Hindalco Industries, another firm under the Aditya Birla Group. Hindalco had announced the land sale in July after receiving board approval last year.Yes Bank: The proposed sale of a majority stake in Yes Bank has faced delays, as the Reserve Bank of India (RBI) is hesitant to grant majority control to a foreign financial institution. Sumitomo Mitsui Banking Corporation (SMBC) of Japan has been in direct negotiations with the RBI, but the regulator is unwilling to relinquish control. While SMBC is keen on acquiring a 51 percent stake, the talks have stalled, pushing back the expected completion of the sale, which was earlier slated for the fourth quarter of the financial year.Adani Group: U.S.-based short seller Hindenburg Research has claimed that Swiss authorities have frozen over $310 million in funds across multiple Swiss bank accounts linked to an ongoing money laundering and securities investigation involving the Adani Group. The investigation reportedly dates back to 2021. Hindenburg made the allegations public via a post on social media platform X on September 12.Indus Towers \u0026 Data Infrastructure Trust: Data Infrastructure Trust (DIT), backed by Brookfield Asset Management and other investors, has acquired American Tower Corporation's India operations, making it the largest mobile tower company in the country, surpassing Indus Towers. The acquisition, valued at approximately $2.2 billion, includes around 76,000 telecom sites. With this, DIT's total portfolio now stands at 257,000 telecom sites under its new brand, Altius.Hindustan Aeronautics (HAL): Hindustan Aeronautics Ltd (HAL) is set to be upgraded from Navratna to Maharatna status by the end of 2024, granting it greater operational and financial autonomy. The upgrade will allow HAL to invest up to  ₹5,000 crore in projects without requiring government approval. The company has experienced significant growth, reporting a record profit of  ₹4,000 crore in Q4 FY24.HDFC Bank: In a bid to optimize its credit-to-deposit ratio, HDFC Bank is in talks with global banks to offload up to  ₹8,400 crore in loans. This move is part of its broader strategy to align its credit portfolio more closely with its deposit levels.SpiceJet: SpiceJet has approached the Supreme Court to challenge a Delhi High Court order grounding three of its leased engines. The airline is requesting additional time to settle outstanding dues and is planning to raise funds to address its ongoing financial difficulties.Honasa Consumer: Peak XV Partners, Sofina Ventures, and Stellaris Venture Partners have divested a combined 7.94 percent stake in Honasa Consumer, the parent company of Mamaearth, for  ₹1,276 crore. The shares were sold at  ₹495 each, with several new investors purchasing portions of the stake.Engineers India: Engineers India Ltd, a state-run engineering consultancy and EPC company, has secured  ₹4,681 crore worth of new business so far in FY24, bringing its order book to  ₹11,350 crore as of August 31. According to Chairman and Managing Director Vartika Shukla, this growth is mainly driven by increased orders from the upstream and infrastructure segments.Tata Power: Tata Power's subsidiary, Tata Power Renewable Energy, has signed a Memorandum of Understanding (MoU) with Tata Motors to establish 200 fast-charging stations for electric commercial vehicles across all major metro cities.","cleaned_content":"irctc life insurance corporation of india lic has raised its shareholding in indian railway catering and tourism corporation irctc to approximately \u003cNINE_PERCENT\u003e as revealed in a regulatory filing on thursday lics stake in the railway sector miniratna psu increased by \u003cTWO_PERCENT\u003e between december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e through open market purchases the insurer now holds \u003cSEVEN_TEN_MILLION\u003e shares up from \u003cFIVE_TEN_MILLION\u003e shares marking a rise from \u003cSEVEN_PERCENT\u003e to \u003cNINE_PERCENT\u003e of irctcs paid up capital hindalco birla estates the real estate arm of aditya birla groups century textiles through its subsidiary ekamaya property has completed the acquisition of a \u003cTWO_TEN\u003e acre land parcel in kalwa thane for \u003cFIVE_HUNDRED\u003e crore the land was sold by hindalco industries another firm under the aditya birla group hindalco had announced the land sale in july after receiving board approval last year yes bank the proposed sale of a majority stake in yes bank has faced delays as the reserve bank of india rbi is hesitant to grant majority control to a foreign financial institution sumitomo mitsui banking corporation smbc of japan has been in direct negotiations with the rbi but the regulator is unwilling to relinquish control while smbc is keen on acquiring a \u003cFIVE_TEN_PERCENT\u003e stake the talks have stalled pushing back the expected completion of the sale which was earlier slated for the fourth quarter of the financial year adani group u s based short seller hindenburg research has claimed that swiss authorities have frozen over \u003cTHREE_HUNDRED\u003e million in funds across multiple swiss bank accounts linked to an ongoing money laundering and securities investigation involving the adani group the investigation reportedly dates back to \u003cTWO_THOUSAND\u003e hindenburg made the allegations public via a post on social media platform x on september \u003cONE_TEN\u003e indus towers data infrastructure trust data infrastructure trust dit backed by brookfield asset management and other investors has acquired american tower corporations india operations making it the largest mobile tower company in the country surpassing indus towers the acquisition valued at approximately \u003cTWO_\u003e billion includes around \u003cSEVEN_TEN_THOUSAND\u003e telecom sites with this dits total portfolio now stands at \u003cTWO_HUNDRED_THOUSAND\u003e telecom sites under its new brand altius hindustan aeronautics hal hindustan aeronautics ltd hal is set to be upgraded from navratna to maharatna status by the end of \u003cTWO_THOUSAND\u003e granting it greater operational and financial autonomy the upgrade will allow hal to invest up to \u003cFIVE_THOUSAND\u003e crore in projects without requiring government approval the company has experienced significant growth reporting a record profit of \u003cFOUR_THOUSAND\u003e crore in q4 fy24 hdfc bank in a bid to optimize its credit to deposit ratio hdfc bank is in talks with global banks to offload up to \u003cEIGHT_THOUSAND\u003e crore in loans this move is part of its broader strategy to align its credit portfolio more closely with its deposit levels spicejet spicejet has approached the supreme court to challenge a delhi high court order grounding three of its leased engines the airline is requesting additional time to settle outstanding dues and is planning to raise funds to address its ongoing financial difficulties honasa consumer peak xv partners sofina ventures and stellaris venture partners have divested a combined \u003cSEVEN_PERCENT\u003e stake in honasa consumer the parent company of mamaearth for \u003cONE_THOUSAND\u003e crore the shares were sold at \u003cFOUR_HUNDRED\u003e each with several new investors purchasing portions of the stake engineers india engineers india ltd a state run engineering consultancy and epc company has secured \u003cFOUR_THOUSAND\u003e crore worth of new business so far in fy24 bringing its order book to \u003cONE_TEN_THOUSAND\u003e crore as of august \u003cTHREE_TEN\u003e according to chairman and managing director vartika shukla this growth is mainly driven by increased orders from the upstream and infrastructure segments tata power tata powers subsidiary tata power renewable energy has signed a memorandum of understanding mou with tata motors to establish \u003cTWO_HUNDRED\u003e fast charging stations for electric commercial vehicles across all major metro cities","timestamp":"2024-09-13T08:23:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}