{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-itc-hul-jump-18-27-in-the-last-three-months-what-drives-these-fmcg-stocks-explained-11726292358442.html","title":"Stocks to buy: ITC, HUL jump 18-27% in the last three months; what drives these FMCG stocks? — explained","description":"Stocks to buy: FMCG stocks like ITC, HUL, and United Spirits have surged due to improved rural demand and premium product interest. The Nifty FMCG index outperformed the Nifty 50 in the last three months. Experts predict continued growth driven by festival spending and favourable monsoon conditions.","content":"Stocks to buy: The recent gains in FMCG stocks, including ITC, Hindustan Unilever (HUL), and United Spirits, have caught investors' attention. The sector's prospects look bright due to a better-than-expected monsoon, signs of revival in rural consumption, and growing consumer interest in premium products.Over the last three months, the Nifty FMCG index has outperformed the equity benchmark Nifty 50; while the FMCG pack has gained about 14 per cent, the Nifty 50 has climbed only 8 per cent.Some of the FMCG stocks, such as Balrampur Chini Mills, Colgate-Palmolive (India), United Spirits, ITC, HUL and Radico Khaitan have jumped 18-27 per cent over the last three months. Shares of Dabur, Tata Consumer, Marico and Britannia Industries have gained 8-14 per cent during this period.Experts believe that with the onset of the festival season, consumer spending across all income levels is expected to rise, benefiting FMCG companies' sales.Analysts note that a surge in rural demand, fueled by government efforts, coupled with impressive volume growth, has propelled FMCG stocks. Additionally, with the Indian stock market reaching record highs, investor sentiment has turned cautious, driving attention toward more stable, defensive sectors like FMCG.\"Strong improvement in rural demand boosted on the back of government initiatives coupled with solid growth from their e-commerce channels, have added to the improved performance of the FMCG companies,\" Aamar Deo Singh, senior vice president of research at Angel One, observed.\"As markets hit record highs, savvy investors tend to shift towards defensive, and FMCG falls in that category, which has also helped in the strong stock performance of many FMCG companies,\" said Singh.Sanjeev Mohta, the vice chairman and CEO at B\u0026K Securities, has similar views on the factors that have boosted FMCG stocks.\"Rural growth is inching up, giving better visibility of volume growth in the future. Most FMCG companies have indicated high double-digit volume growth for the rest of the year. Given that inflation is returning to some extent, we expect double-digit topline growth going forward for the sector,\" said Mohta.\"Historically, this sector used to trade at a premium to other capex-heavy sectors. However, if we compare on a relative basis, FMCG is not looking that expensive at this juncture versus the market and other sectors as compared to the historical levels. Thus, some rotation was due since investors were underweight staples for two to three years given the lack of volume,\" Mohta said.Consumers' growing interest in premium products has been a significant factor behind the growth of FMCG firms.\"Premiumisation trend continues aiding further growth to the highly penetrated staples sub-segments. Gross and EBITDA margins would be better year-on-year (YoY) as inflation remains moderate on the raw material side and companies start taking calibrated pricing actions,\" said Mohta.Akriti Mehrotra, a research analyst at StoxBox, underscored that the recent positive management commentaries from FMCG majors and government policies aimed at boosting rural consumption support the sentiment in FMCG companies.Mehrotra also added that the above-average monsoon has raised hopes of higher disposable income in the hands of the rural population. Additionally, changing consumer habits, such as greater brand awareness and higher internet usage, drive growth. The rise of online shopping, higher disposable incomes and rapid urbanisation further contribute to the sector's success.T Manish, a research analyst at SAMCO Securities, sees above-normal monsoon as a key factor that has brightened the prospects of FMCG companies.\"A favourable monsoon season in India has increased rural incomes, boosting rural consumption, which constitutes approximately 40 per cent of revenues of FMCG companies. In urban markets, these companies focus on premiumisation and innovative business models such as influencer-led, content-driven customer engagement and the rise of e-commerce or quick commerce platforms, enhancing growth potential,\" said Manish.\"Global market volatility has also led investors to adopt a more cautious risk-off strategy, prompting a shift towards defensive sectors like FMCG to safeguard their portfolios,\" Manish said.Singh of Angel One says investors can always keep a couple of leading FMCG stocks in their long-term portfolio, such as Dabur, HUL, Colgate, and ITC, as this sector has a more steady and solid growth path in years to come.Mohta of B\u0026K Securities recommends Dabur, Tata Consumer, Colgate and Varun Beverages from the sector.HUL, United Spirits, ITC and Jubilant FoodWorks are top picks of SAMCO Securities' analyst.Mehrotra of StoxBox is positive about HUL, ITC and Varun Beverages.\"HUL’s efficient distribution, smart production, and use of digital technology make it a strong investment choice for ongoing growth and market leadership. Varun Beverages has outperformed competitors by acquiring The Beverage Company, expanding its manufacturing, and focusing on rural distribution. The recent strategic moves include producing snacks like Cheetos and securing a deal with Premier Nutrition for Simba Muncheiz in Zimbabwe and Zambia. These efforts position Varun Beverages for long-term growth and profitability,\" said Mehrotra.For ITC, Mehrotra said the company’s expansion into chocolates, dairy, and other FMCG products, along with improvements in agriculture and paperboards, supports its investment appeal.\"Despite near-term challenges from extreme weather, a recovery is expected later in the year, boosted by favourable economic conditions, government infrastructure focus, and a potential demerger of its hotel business. These factors suggest a robust long-term growth outlook, with projected increases in cigarette volumes and EBIT for FY2025E,\" said Mehrotra.Read all market-related news hereThe views and recommendations above are those of individual analysts, experts, and brokerage firms, not Mint. We advise investors to consult certified experts before making any investment decisions.","cleaned_content":"stocks to buy the recent gains in fmcg stocks including itc hindustan unilever hul and united spirits have caught investors attention the sectors prospects look bright due to a better than expected monsoon signs of revival in rural consumption and growing consumer interest in premium products over the last three months the nifty fmcg index has outperformed the equity benchmark nifty \u003cFIVE_TEN\u003e while the fmcg pack has gained about \u003cONE_TEN_PERCENT\u003e the nifty \u003cFIVE_TEN\u003e has climbed only \u003cEIGHT_PERCENT\u003e some of the fmcg stocks such as balrampur chini mills colgate palmolive india united spirits itc hul and radico khaitan have jumped \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e over the last three months shares of dabur tata consumer marico and britannia industries have gained \u003cEIGHT_\u003e \u003cONE_TEN_PERCENT\u003e during this period experts believe that with the onset of the festival season consumer spending across all income levels is expected to rise benefiting fmcg companies sales analysts note that a surge in rural demand fueled by government efforts coupled with impressive volume growth has propelled fmcg stocks additionally with the indian stock market reaching record highs investor sentiment has turned cautious driving attention toward more stable defensive sectors like fmcg strong improvement in rural demand boosted on the back of government initiatives coupled with solid growth from their e commerce channels have added to the improved performance of the fmcg companies aamar deo singh senior vice president of research at angel one observed as markets hit record highs savvy investors tend to shift towards defensive and fmcg falls in that category which has also helped in the strong stock performance of many fmcg companies said singh sanjeev mohta the vice chairman and ceo at b k securities has similar views on the factors that have boosted fmcg stocks rural growth is inching up giving better visibility of volume growth in the future most fmcg companies have indicated high double digit volume growth for the rest of the year given that inflation is returning to some extent we expect double digit topline growth going forward for the sector said mohta historically this sector used to trade at a premium to other capex heavy sectors however if we compare on a relative basis fmcg is not looking that expensive at this juncture versus the market and other sectors as compared to the historical levels thus some rotation was due since investors were underweight staples for two to three years given the lack of volume mohta said consumers growing interest in premium products has been a significant factor behind the growth of fmcg firms premiumisation trend continues aiding further growth to the highly penetrated staples sub segments gross and ebitda margins would be better year on year yoy as inflation remains moderate on the raw material side and companies start taking calibrated pricing actions said mohta akriti mehrotra a research analyst at stoxbox underscored that the recent positive management commentaries from fmcg majors and government policies aimed at boosting rural consumption support the sentiment in fmcg companies mehrotra also added that the above average monsoon has raised hopes of higher disposable income in the hands of the rural population additionally changing consumer habits such as greater brand awareness and higher internet usage drive growth the rise of online shopping higher disposable incomes and rapid urbanisation further contribute to the sectors success t manish a research analyst at samco securities sees above normal monsoon as a key factor that has brightened the prospects of fmcg companies a favourable monsoon season in india has increased rural incomes boosting rural consumption which constitutes approximately \u003cFOUR_TEN_PERCENT\u003e of revenues of fmcg companies in urban markets these companies focus on premiumisation and innovative business models such as influencer led content driven customer engagement and the rise of e commerce or quick commerce platforms enhancing growth potential said manish global market volatility has also led investors to adopt a more cautious risk off strategy prompting a shift towards defensive sectors like fmcg to safeguard their portfolios manish said singh of angel one says investors can always keep a couple of leading fmcg stocks in their long term portfolio such as dabur hul colgate and itc as this sector has a more steady and solid growth path in years to come mohta of b k securities recommends dabur tata consumer colgate and varun beverages from the sector hul united spirits itc and jubilant foodworks are top picks of samco securities analyst mehrotra of stoxbox is positive about hul itc and varun beverages hul s efficient distribution smart production and use of digital technology make it a strong investment choice for ongoing growth and market leadership varun beverages has outperformed competitors by acquiring the beverage company expanding its manufacturing and focusing on rural distribution the recent strategic moves include producing snacks like cheetos and securing a deal with premier nutrition for simba muncheiz in zimbabwe and zambia these efforts position varun beverages for long term growth and profitability said mehrotra for itc mehrotra said the company s expansion into chocolates dairy and other fmcg products along with improvements in agriculture and paperboards supports its investment appeal despite near term challenges from extreme weather a recovery is expected later in the year boosted by favourable economic conditions government infrastructure focus and a potential demerger of its hotel business these factors suggest a robust long term growth outlook with projected increases in cigarette volumes and ebit for fy2025e said mehrotra read all market related news herethe views and recommendations above are those of individual analysts experts and brokerage firms not mint we advise investors to consult certified experts before making any investment decisions","timestamp":"2024-09-14T11:50:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}