{"url":"https://www.livemint.com/market/stock-market-news/stocks-in-focus-these-three-shares-are-among-top-bets-by-motilal-oswal-for-this-week-11726583651671.html","title":"Stocks in focus: These three shares are among top bets by Motilal Oswal for this week","description":"Brokerage firm Motilal Oswal has recommended three stocks - JK Cement, Havells India and Hindustan Unilever - to buy this week with decent upside move.","content":"Indian stock market: The Indian market saw another day of consolidation on Tuesday, with traders staying cautious ahead of the Federal Reserve's upcoming policy meeting. On Wednesday, the Fed is anticipated to announce its first rate cut since 2020.The Nifty 50 closed the session with a 0.14% rise at 25,418 points, just 27 points shy of its all-time high of 25,445 points, which it approached during the day. Meanwhile, the S\u0026P BSE Sensex recorded a 0.11% gain, closing at 83,079 points, setting a new peak.“The domestic benchmark indices opened on a positive note, in line with global cues. Nifty started the day on a flat to positive note and traded within a narrow range throughout the day. As a result, the index settled the day with a marginal positive note at 25,419.\"Technically, the index on a daily scale formed a doji candle near its all-time high, signaling some short-term hesitation. However, the fact that Nifty remained above 25,335 (the breakout level of the rounding bottom pattern) suggests underlying strength. The 21-DEMA support is currently placed near 25,060, which will act as the next major support for the index. As long as Nifty stays above 25,060, a \"buy on dips\" strategy is advisable, with the potential for the index to test 25,600 in the short term.Bank Nifty started the day on a positive note but was unable to sustain higher levels, leading to consolidation within a narrow range. As a result, the index settled the day with a marginal positive note at 52,189. Technically, the index sustained above the cup-and-handle breakout level of 51,750, indicating potential strength. Therefore, the 51,700–51,750 zone will act as immediate support for Bank Nifty in the short term. If the index holds the 51,700 support, it could test levels of 52,800–53,000 in the short term,\" said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd.Brokerage firm Motilal Oswal has recommended three stocks - JK Cement, Havells India and Hindustan Unilever - to buy this week with decent upside move.JK cement is trading at life time high territory and gave Cup and Handle breakout on weekly scale which is a bullish price pattern and forming higher lows from past four weeks. On daily scale the stock retested the previous zone and formed a strong bullish candle with good surge in volumes. Momentum indicator Relative Strength Index is also moving northward on weekly scale which indicates overall strength in the stock. Good buying is visible across Cement stocks which may support the ongoing up move. Thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below 4550 levels on closing basis for a new life time high target towards 5150 zones.The stock is trading at life time high territory and gave a consolidation breakout on weekly scale after fourteen weeks with strong bullish candle. On daily scale the structure of higher lows is intact from past few sessions and gave highest weekly close. The stock is holding well above its 20DEMA and RSI is giving Bullish crossover which indicates the momentum to pick up in coming sessions. Thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below 1920 levels on closing basis for a new life time high target towards 2120 zones.Hind Unilever gave massive range breakout on monthly scale after thirty six months and formed a strong bullish candle. On daily scale as well the stock is moving higher and base of the stock is shifting higher. Good buying is visible across FMCG space and stock likely to outperform in coming sessions. It is trading above its short term moving averages and looking at the overall set up the stock is likely to hit new highs in coming sessions. Thus we are recommending to buy the stock with keeping stop loss below 2840 levels on closing basis for a new life time high target towards 3120 zones.","cleaned_content":"indian stock market the indian market saw another day of consolidation on tuesday with traders staying cautious ahead of the federal reserves upcoming policy meeting on wednesday the fed is anticipated to announce its first rate cut since \u003cTWO_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e closed the session with a \u003cZERO_PERCENT\u003e rise at \u003cTWO_TEN_THOUSAND\u003e points just \u003cTWO_TEN\u003e points shy of its all time high of \u003cTWO_TEN_THOUSAND\u003e points which it approached during the day meanwhile the s p bse sensex recorded a \u003cZERO_PERCENT\u003e gain closing at \u003cEIGHT_TEN_THOUSAND\u003e points setting a new peak the domestic benchmark indices opened on a positive note in line with global cues nifty started the day on a flat to positive note and traded within a narrow range throughout the day as a result the index settled the day with a marginal positive note at \u003cTWO_TEN_THOUSAND\u003e technically the index on a daily scale formed a doji candle near its all time high signaling some short term hesitation however the fact that nifty remained above \u003cTWO_TEN_THOUSAND\u003e the breakout level of the rounding bottom pattern suggests underlying strength the \u003cTWO_TEN\u003e dema support is currently placed near \u003cTWO_TEN_THOUSAND\u003e which will act as the next major support for the index as long as nifty stays above \u003cTWO_TEN_THOUSAND\u003e a buy on dips strategy is advisable with the potential for the index to test \u003cTWO_TEN_THOUSAND\u003e in the short term bank nifty started the day on a positive note but was unable to sustain higher levels leading to consolidation within a narrow range as a result the index settled the day with a marginal positive note at \u003cFIVE_TEN_THOUSAND\u003e technically the index sustained above the cup and handle breakout level of \u003cFIVE_TEN_THOUSAND\u003e indicating potential strength therefore the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e zone will act as immediate support for bank nifty in the short term if the index holds the \u003cFIVE_TEN_THOUSAND\u003e support it could test levels of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e in the short term said hrishikesh yedve avp technical and derivatives research at asit c mehta investment interrmediates ltd brokerage firm motilal oswal has recommended three stocks jk cement havells india and hindustan unilever to buy this week with decent upside move jk cement is trading at life time high territory and gave cup and handle breakout on weekly scale which is a bullish price pattern and forming higher lows from past four weeks on daily scale the stock retested the previous zone and formed a strong bullish candle with good surge in volumes momentum indicator relative strength index is also moving northward on weekly scale which indicates overall strength in the stock good buying is visible across cement stocks which may support the ongoing up move thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below \u003cFOUR_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cFIVE_THOUSAND\u003e zones the stock is trading at life time high territory and gave a consolidation breakout on weekly scale after fourteen weeks with strong bullish candle on daily scale the structure of higher lows is intact from past few sessions and gave highest weekly close the stock is holding well above its \u003cTWO_TEN\u003e dema and rsi is giving bullish crossover which indicates the momentum to pick up in coming sessions thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below \u003cONE_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cTWO_THOUSAND\u003e zones hind unilever gave massive range breakout on monthly scale after thirty six months and formed a strong bullish candle on daily scale as well the stock is moving higher and base of the stock is shifting higher good buying is visible across fmcg space and stock likely to outperform in coming sessions it is trading above its short term moving averages and looking at the overall set up the stock is likely to hit new highs in coming sessions thus we are recommending to buy the stock with keeping stop loss below \u003cTWO_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cTHREE_THOUSAND\u003e zones","timestamp":"2024-09-17T20:53:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}