{"url":"https://www.livemint.com/market/stock-market-news/inox-green-share-price-cracks-7-should-you-buy-or-wait-heres-what-experts-say-11726561709323.html","title":"Inox Green share price cracks 7%. Should you buy, sell or wait? Here’s what experts say","description":"Inox Green share price has surged by about 212 per cent over the last year. The stock hit its 52-week low of  ₹60.43 on October 26 last year and has been rising since. It hit its 52-week high of  ₹224.65 on September 13 this year.","content":"Inox Green share price: Shares of Inox Green Energy Services cracked over 7 per cent in intraday trade on BSE on Tuesday, September 17, looking set to extend the losing run into the second consecutive session. The stock opened at  ₹213.25 against its previous close of  ₹214.50 and dropped 7.4 per cent to the intraday low of  ₹198.60. At 1:45 pm, the stock traded 5.52 per cent down at  ₹202.65. Equity benchmark Sensex was 0.17 per cent down at 83,130 at that time.Experts pointed out that the stock is mainly falling due to profit booking as it has surged by about 212 per cent over the last year. The stock hit its 52-week low of  ₹60.43 on October 26 last year and has been rising since. It hit its 52-week high of  ₹224.65 on September 13 this year.In the previous session, the stock declined 3 per cent. Still, on the monthly scale, the stock has been in the green since June this year.According to Jigar S. Patel, Senior Manager of Equity Research at Anand Rathi Share and Stock Brokers, at the current stage, the stock is encountering resistance near a trendline. This trendline represents a crucial level where upward price movement is facing difficulty, reflecting the stock's inability to break through this barrier.Patel further observed that recently, the stock exhibited a bearish divergence, where the price continues to rise while momentum indicators show weakening, signalling potential selling pressure. This divergence has led to a pullback in the most recent trading session, with the price now pausing around the 21-day exponential moving average (DEMA), a short-term support level.\"Further downside pressure may push the price toward the 50 DEMA, which serves as the next key support zone. At this level, the selling pressure is expected to ease, and the stock could potentially resume its upward trend. Traders are advised to monitor the 50 DEMA, as it could offer a more stable entry point for long positions once the stock stabilises,\" said Patel.On the other hand, Mandar Bhojane, an equity research analyst at Choice Broking, observed that the stock is currently exhibiting a strong bullish setup.\"After a phase of consolidation marked by horizontal resistance, the stock has broken out decisively, reaching a recent high of  ₹224. This breakout signals significant buying interest, likely driven by broader momentum within the renewable energy sector. The stock’s recent pullback to  ₹203.40 presents an attractive entry point for buyers, with key support around  ₹187.75, suggesting the uptrend remains intact,\" said Bhojane.Bhojane pointed out that from a technical standpoint, the stock is well-supported by its moving averages. The 50-day moving average is trending upward, indicating medium-term bullish momentum, while the 100-day and 200-day moving averages are also rising, reinforcing the long-term strength of the trend. The RSI, currently at 53.75, has room to rise, remaining in neutral territory, which may attract further buying interest as momentum builds.\"Considering the stock’s overall structure, traders looking to capitalize on this bullish setup could aim for a target of  ₹240, representing a potential retest of the recent highs and a push into new territory. A stop loss can be positioned below the support at  ₹187.75, as a breach of this level would signal potential weakness in the uptrend. Maintaining sound risk management will maximise upside potential while mitigating downside risks,\" said Bhojane.Read all market-related news here","cleaned_content":"inox green share price shares of inox green energy services cracked over \u003cSEVEN_PERCENT\u003e in intraday trade on bse on tuesday september \u003cONE_TEN\u003e looking set to extend the losing run into the second consecutive session the stock opened at \u003cTWO_HUNDRED\u003e against its previous close of \u003cTWO_HUNDRED\u003e and dropped \u003cSEVEN_PERCENT\u003e to the intraday low of \u003cONE_HUNDRED\u003e at \u003cONE_\u003e \u003cFOUR_TEN\u003e pm the stock traded \u003cFIVE_PERCENT\u003e down at \u003cTWO_HUNDRED\u003e equity benchmark sensex was \u003cZERO_PERCENT\u003e down at \u003cEIGHT_TEN_THOUSAND\u003e at that time experts pointed out that the stock is mainly falling due to profit booking as it has surged by about \u003cTWO_HUNDRED_PERCENT\u003e over the last year the stock hit its \u003cFIVE_TEN\u003e week low of \u003cSIX_TEN\u003e on october \u003cTWO_TEN\u003e last year and has been rising since it hit its \u003cFIVE_TEN\u003e week high of \u003cTWO_HUNDRED\u003e on september \u003cONE_TEN\u003e this year in the previous session the stock declined \u003cTHREE_PERCENT\u003e still on the monthly scale the stock has been in the green since june this year according to jigar s patel senior manager of equity research at anand rathi share and stock brokers at the current stage the stock is encountering resistance near a trendline this trendline represents a crucial level where upward price movement is facing difficulty reflecting the stocks inability to break through this barrier patel further observed that recently the stock exhibited a bearish divergence where the price continues to rise while momentum indicators show weakening signalling potential selling pressure this divergence has led to a pullback in the most recent trading session with the price now pausing around the \u003cTWO_TEN\u003e day exponential moving average dema a short term support level further downside pressure may push the price toward the \u003cFIVE_TEN\u003e dema which serves as the next key support zone at this level the selling pressure is expected to ease and the stock could potentially resume its upward trend traders are advised to monitor the \u003cFIVE_TEN\u003e dema as it could offer a more stable entry point for long positions once the stock stabilises said patel on the other hand mandar bhojane an equity research analyst at choice broking observed that the stock is currently exhibiting a strong bullish setup after a phase of consolidation marked by horizontal resistance the stock has broken out decisively reaching a recent high of \u003cTWO_HUNDRED\u003e this breakout signals significant buying interest likely driven by broader momentum within the renewable energy sector the stock s recent pullback to \u003cTWO_HUNDRED\u003e presents an attractive entry point for buyers with key support around \u003cONE_HUNDRED\u003e suggesting the uptrend remains intact said bhojane bhojane pointed out that from a technical standpoint the stock is well supported by its moving averages the \u003cFIVE_TEN\u003e day moving average is trending upward indicating medium term bullish momentum while the \u003cONE_HUNDRED\u003e day and \u003cTWO_HUNDRED\u003e day moving averages are also rising reinforcing the long term strength of the trend the rsi currently at \u003cFIVE_TEN\u003e has room to rise remaining in neutral territory which may attract further buying interest as momentum builds considering the stock s overall structure traders looking to capitalize on this bullish setup could aim for a target of \u003cTWO_HUNDRED\u003e representing a potential retest of the recent highs and a push into new territory a stop loss can be positioned below the support at \u003cONE_HUNDRED\u003e as a breach of this level would signal potential weakness in the uptrend maintaining sound risk management will maximise upside potential while mitigating downside risks said bhojane read all market related news here","timestamp":"2024-09-17T14:11:00+05:30","market_timestamp":"2024-09-17T14:11:00+05:30","off_market_hours":false}