{"url":"https://www.livemint.com/market/stock-market-news/bajaj-housing-finance-share-price-falls-16-in-2-days-remains-indias-most-valued-housing-finance-firm-11726722714508.html","title":"Bajaj Housing Finance share price falls 16% in two days, remains India’s most-valued HFC","description":"Bajaj Housing Finance share price: Bajaj Housing Finance's stock has experienced a sharp decline in recent days, falling over 16% from its 52-week high.","content":"Bajaj Housing Finance share price: Bajaj Housing Finance's stock extended its decline for a second consecutive session on September 19 (Thursday), dropping around 10 per cent as investors booked profits after it hit 52-week high. The company's shares plummeted by 9.80 per cent, reaching  ₹156.67 per share on the Bombay Stock Exchange (BSE) on September 19, at 11:50 am. Furthermore, the last trade price (LTP) is down by 16 per cent from its 52-week high of  ₹188.50 that it hit on September 18, 2024.This followed a 4.3 per cent decline in the previous trading session, bringing the total drop over two days to more than 14 per cent. This downturn came after the stock initially saw healthy gains following its market debut.With a market capitalization of  ₹1.30 lakh crore, Bajaj Housing Finance has emerged as the most valuable housing finance company in India. In second place is Housing \u0026 Urban Development Corporation, with a valuation of  ₹49,196.69 crore, followed by LIC Housing Finance at  ₹37,074.25 crore. Other major players include PNB Housing Finance ( ₹28,267.18 crore), Aadhar Housing Finance ( ₹19,849.63 crore), Aptus Value Housing Finance ( ₹16,877.81 crore), AAVAS Financiers ( ₹14,415.64 crore), Can Fin Homes ( ₹11,929.28 crore), Sammaan Capital ( ₹11,700.57 crore), and Home First Finance Company India ( ₹10,375.88 crore).Bajaj Housing Finance had an impressive stock market debut, with shares surging nearly 136 per cent above the issue price of  ₹70. The stock was listed at  ₹150 on both the BSE and NSE, marking a 114.2 per cent rise from the issue price.The company's initial public offering (IPO) comprised a fresh issue of shares worth  ₹3,560 crore, along with an offer-for-sale (OFS) of shares valued at  ₹3,000 crore by its parent company, Bajaj Finance. Bajaj Housing Finance, a non-deposit-taking housing finance company, has been registered with the National Housing Bank since September 2015.The newly listed shares had previously surged to a high of  ₹188.45, pushing the company's market capitalization to over  ₹1.5 lakh crore on September 18. Bajaj Housing Finance made a strong stock market debut on September 16, listing at  ₹150 per share, a premium of 114% over its issue price of  ₹70.","cleaned_content":"bajaj housing finance share price bajaj housing finances stock extended its decline for a second consecutive session on september \u003cONE_TEN\u003e thursday dropping around \u003cONE_TEN_PERCENT\u003e as investors booked profits after it hit \u003cFIVE_TEN\u003e week high the companys shares plummeted by \u003cNINE_PERCENT\u003e reaching \u003cONE_HUNDRED\u003e per share on the bombay stock exchange bse on september \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e am furthermore the last trade price ltp is down by \u003cONE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e that it hit on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e this followed a \u003cFOUR_PERCENT\u003e decline in the previous trading session bringing the total drop over two days to more than \u003cONE_TEN_PERCENT\u003e this downturn came after the stock initially saw healthy gains following its market debut with a market capitalization of \u003cONE_\u003e lakh crore bajaj housing finance has emerged as the most valuable housing finance company in india in second place is housing urban development corporation with a valuation of \u003cFOUR_TEN_THOUSAND\u003e crore followed by lic housing finance at \u003cTHREE_TEN_THOUSAND\u003e crore other major players include pnb housing finance \u003cTWO_TEN_THOUSAND\u003e crore aadhar housing finance \u003cONE_TEN_THOUSAND\u003e crore aptus value housing finance \u003cONE_TEN_THOUSAND\u003e crore aavas financiers \u003cONE_TEN_THOUSAND\u003e crore can fin homes \u003cONE_TEN_THOUSAND\u003e crore sammaan capital \u003cONE_TEN_THOUSAND\u003e crore and home first finance company india \u003cONE_TEN_THOUSAND\u003e crore bajaj housing finance had an impressive stock market debut with shares surging nearly \u003cONE_HUNDRED_PERCENT\u003e above the issue price of \u003cSEVEN_TEN\u003e the stock was listed at \u003cONE_HUNDRED\u003e on both the bse and nse marking a \u003cONE_HUNDRED_PERCENT\u003e rise from the issue price the companys initial public offering ipo comprised a fresh issue of shares worth \u003cTHREE_THOUSAND\u003e crore along with an offer for sale ofs of shares valued at \u003cTHREE_THOUSAND\u003e crore by its parent company bajaj finance bajaj housing finance a non deposit taking housing finance company has been registered with the national housing bank since september \u003cTWO_THOUSAND\u003e the newly listed shares had previously surged to a high of \u003cONE_HUNDRED\u003e pushing the companys market capitalization to over \u003cONE_\u003e lakh crore on september \u003cONE_TEN\u003e bajaj housing finance made a strong stock market debut on september \u003cONE_TEN\u003e listing at \u003cONE_HUNDRED\u003e per share a premium of \u003cONE_HUNDRED_PERCENT\u003e over its issue price of \u003cSEVEN_TEN\u003e","timestamp":"2024-09-19T12:10:00+05:30","market_timestamp":"2024-09-19T12:10:00+05:30","off_market_hours":false}