{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-17-11726542155012.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 17","description":"Nifty 50, Sensex today: The trends on Gift Nifty indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,470 level, a premium of nearly 30 points from the Nifty futures’ previous close.","content":"The Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open on a cautious note Tuesday amid mixed global cues.The trends on Gift Nifty indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,470 level, a premium of nearly 30 points from the Nifty futures’ previous close.On Monday, the domestic equity market ended with modest gains after hitting fresh record highs.The Sensex rose 97.84 points to close at 82,988.78, while the Nifty 50 settled 27.25 points, or 0.11%, higher at 25,383.75.Nifty 50 formed a small negative candle on the daily chart which is a back-to-back similar pattern in the last two sessions.“Technically such range movements post sharp up moves could eventually result in an uptrend continuation pattern. The underlying uptrend of the market remains intact. Nifty could eventually break above the range movement at 25,450 and move towards the next hurdle at 25,800 in the near term,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 continued its consolidation movement for the second consecutive session on September 16 and closed the day with minor gains of 27 points after hitting a new all time high at 25,445 levels.“The technical chart shows no change in formation compared to the previous day. The trend continues to be strong, though with limited upward potential in the short term. Key support levels are still intact between 25,150 - 25,200, while resistance is positioned around 25,460 - 25,500,” said Rupak De, Senior Technical Analyst, LKP Securities.According to him, a decisive breakout from the current range might initiate a directional move.Praveen Dwarakanath, Vice President of Hedged.in believes Nifty 50 after a strong rally owing to FII’s buying last Thursday has consolidated at 25,300 - 25,400 levels.“The momentum indicators are showing signs of bullishness. On the weekly chart, the RSI line has crossed over the RSI average line, indicating this bullishness. Option writer’s data for the present week's expiry and September end expiry shows increased put writing, indicating bullishness and further corroborating the above statement,” Dwarakanath said.Aditya Agarwal, Head of Derivatives and Technical at Sanctum Wealth noted that Nifty 50 continued to consolidate for the second day in a row in a narrow band.“On the higher side, aggressive call writing has been seen at the 25,500 strike option and that will act as an immediate and strong resistance zone for index and move towards those levels will be used by traders to book profits in trading long positions. However, overall short term structure for index remains bullish and dip towards 25,280 / 24,160 can be used as buying opportunity,” Agarwal said.Bank Nifty index ended 215 points higher at 52,153 on Monday, forming a bullish candlestick pattern on the daily charts.“Bank Nifty has started to walk on the upper Bollinger band which is a sign of bullishness. On the daily chart, all momentum indicators show signs of a rally above the 52,000 level, as the resistance at 52,000 has been taken out. The next immediate levels to watch for in Bank Nifty on the upside are 52,700 and 53,500 levels. The option writer's data for the present week's expiry shows short covering in ITM calls and selling in ATM puts indicating bullishness to continue,” said Praveen DwarakanathAccording to Aditya Agarwal, the short term structure remains strong and Bank Nifty is expected to test 52,480 / 52,800. On the lower side, the index will find support around 51,920 / 51,800 levels and any dip towards those levels can be used to add fresh longs.","cleaned_content":"the indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a cautious note tuesday amid mixed global cues the trends on gift nifty indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cTHREE_TEN\u003e points from the nifty futures previous close on monday the domestic equity market ended with modest gains after hitting fresh record highs the sensex rose \u003cNINE_TEN\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTWO_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart which is a back to back similar pattern in the last two sessions technically such range movements post sharp up moves could eventually result in an uptrend continuation pattern the underlying uptrend of the market remains intact nifty could eventually break above the range movement at \u003cTWO_TEN_THOUSAND\u003e and move towards the next hurdle at \u003cTWO_TEN_THOUSAND\u003e in the near term said nagaraj shetti senior technical research analyst at hdfc securities here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e continued its consolidation movement for the second consecutive session on september \u003cONE_TEN\u003e and closed the day with minor gains of \u003cTWO_TEN\u003e points after hitting a new all time high at \u003cTWO_TEN_THOUSAND\u003e levels the technical chart shows no change in formation compared to the previous day the trend continues to be strong though with limited upward potential in the short term key support levels are still intact between \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e while resistance is positioned around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst lkp securities according to him a decisive breakout from the current range might initiate a directional move praveen dwarakanath vice president of hedged in believes nifty \u003cFIVE_TEN\u003e after a strong rally owing to fii s buying last thursday has consolidated at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels the momentum indicators are showing signs of bullishness on the weekly chart the rsi line has crossed over the rsi average line indicating this bullishness option writer s data for the present weeks expiry and september end expiry shows increased put writing indicating bullishness and further corroborating the above statement dwarakanath said aditya agarwal head of derivatives and technical at sanctum wealth noted that nifty \u003cFIVE_TEN\u003e continued to consolidate for the second day in a row in a narrow band on the higher side aggressive call writing has been seen at the \u003cTWO_TEN_THOUSAND\u003e strike option and that will act as an immediate and strong resistance zone for index and move towards those levels will be used by traders to book profits in trading long positions however overall short term structure for index remains bullish and dip towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e can be used as buying opportunity agarwal said bank nifty index ended \u003cTWO_HUNDRED\u003e points higher at \u003cFIVE_TEN_THOUSAND\u003e on monday forming a bullish candlestick pattern on the daily charts bank nifty has started to walk on the upper bollinger band which is a sign of bullishness on the daily chart all momentum indicators show signs of a rally above the \u003cFIVE_TEN_THOUSAND\u003e level as the resistance at \u003cFIVE_TEN_THOUSAND\u003e has been taken out the next immediate levels to watch for in bank nifty on the upside are \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e levels the option writers data for the present weeks expiry shows short covering in itm calls and selling in atm puts indicating bullishness to continue said praveen dwarakanathaccording to aditya agarwal the short term structure remains strong and bank nifty is expected to test \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e on the lower side the index will find support around \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels and any dip towards those levels can be used to add fresh longs","timestamp":"2024-09-17T08:39:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}