{"url":"https://www.livemint.com/market/stock-market-news/jindal-steel-power-stock-breaks-downtrend-jumps-11-in-sep-after-3-month-slump-more-gains-ahead-11726557648190.html","title":"Jindal Steel \u0026 Power stock breaks downtrend, jumps 11% in Sep after 3-month slump. More gains ahead?","description":"Jindal Steel \u0026 Power shares rose 11% to 1,051.95 in September, ending a three-month slump. Analysts predict continued growth, with potential to hit a new record high. Despite recent corrections, the stock has surged 1,000% since April 2020.","content":"For the sixth consecutive trading session on Tuesday, shares of Jindal Steel \u0026 Power, a leading integrated steel producer in India, were in positive territory, rising 2.77% to  ₹1,073.70 per share, boosting the stock by nearly 11% in September alone, marking an end to a three-month slump.Technical analysts are optimistic, predicting that the stock’s upward momentum will continue and could potentially reach a new record high. Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One, said, \"The past couple of weeks have been remarkable for this metal stock, with gains of over 8%, signaling the resumption of an uptrend after a few months of consolidation.\"In the near term, prices appear to be approaching their all-time high of around 1100 and may continue to rise. Any pullbacks should be viewed as buying opportunities, with 1,000 now acting as immediate support,\" he added.Likewise, Ruchit Jain, Lead Research Analyst at 5Paisa, said the near trend for the stock looks positive and has shown signs of relative outperformance within the metal stocks. However, it is advisable to keep a buy-on-dip approach. The immediate support is placed in the range of  ₹975-965.Despite the recent correction, the stock has still risen by 1000% since April 2020. Notably, it has delivered exceptional returns each quarter since CY19.Meanwhile, on Monday, Jindal Steel and Jindal Renewables (JRPL) announced a Memorandum of Understanding (MOU) to implement India’s biggest investment in green hydrogen by any Indian steelmaker till date. This collaboration underscores a major commitment by both companies towards decarbonisation and green energy leadership in India’s steel industry.The MOU outlines JSPL’s plan to integrate green hydrogen into its Direct Reduced Iron (DRI) units in Angul, Odisha. This initiative represents a significant leap towards low-emission steel production.In the first phase, Jindal Renewables will develop a green hydrogen generation capacity of up to 4,500 tons per year, set to commence by December 2025. In addition, the project will also entail the supply of 36,000 tons of oxygen per year that will be used in the Angul steelworks.JRPL will also be supplying 3 GW of renewable energy to JSPL’s facilities. reducing the steelmaker’s dependence on coal-fired energy by 50% in the next 2-3 years. This integration of green energy is expected to drastically lower the company’s carbon footprint.JSPL will provide essential infrastructure and support, while JRPL will handle the development and operation of the green hydrogen and renewable energy facilities. This collaboration underscores a major commitment to decarbonisation and green energy leadership in India’s steel industry.With innovative engineering, the MOU aims not only to significantly slash the cost of green hydrogen production but also to ensure a sustainable long-term business model by locking in offtake for the next 25 years.The company is nearing completion of its capital expenditure program, which aims to double steel-making capacity at Angul from 6 MTPA to 12.3 MTPA and increase total capacity from 9.6 MTPA to 15.9 MTPA. The  ₹31,000 crore investment includes funds for steel expansion, ACCP2, mining projects, and new facilities.It plans to keep its balance sheet healthy by maintaining a net debt to EBITDA ratio below 1.5x, with most new equipment and operations expected to be commissioned between Q4 FY25 and Q3 FY26.","cleaned_content":"for the sixth consecutive trading session on tuesday shares of jindal steel power a leading integrated steel producer in india were in positive territory rising \u003cTWO_PERCENT\u003e to \u003cONE_THOUSAND\u003e per share boosting the stock by nearly \u003cONE_TEN_PERCENT\u003e in september alone marking an end to a three month slump technical analysts are optimistic predicting that the stock s upward momentum will continue and could potentially reach a new record high rajesh bhosale equity technical and derivative analyst at angel one said the past couple of weeks have been remarkable for this metal stock with gains of over \u003cEIGHT_PERCENT\u003e signaling the resumption of an uptrend after a few months of consolidation in the near term prices appear to be approaching their all time high of around \u003cONE_THOUSAND\u003e and may continue to rise any pullbacks should be viewed as buying opportunities with \u003cONE_THOUSAND\u003e now acting as immediate support he added likewise ruchit jain lead research analyst at \u003cFIVE_\u003e paisa said the near trend for the stock looks positive and has shown signs of relative outperformance within the metal stocks however it is advisable to keep a buy on dip approach the immediate support is placed in the range of \u003cNINE_HUNDRED\u003e \u003cNINE_HUNDRED\u003e despite the recent correction the stock has still risen by \u003cONE_THOUSAND_PERCENT\u003e since april \u003cTWO_THOUSAND\u003e notably it has delivered exceptional returns each quarter since cy19 meanwhile on monday jindal steel and jindal renewables jrpl announced a memorandum of understanding mou to implement india s biggest investment in green hydrogen by any indian steelmaker till date this collaboration underscores a major commitment by both companies towards decarbonisation and green energy leadership in india s steel industry the mou outlines jspl s plan to integrate green hydrogen into its direct reduced iron dri units in angul odisha this initiative represents a significant leap towards low emission steel production in the first phase jindal renewables will develop a green hydrogen generation capacity of up to \u003cFOUR_THOUSAND\u003e tons per year set to commence by december \u003cTWO_THOUSAND\u003e in addition the project will also entail the supply of \u003cTHREE_TEN_THOUSAND\u003e tons of oxygen per year that will be used in the angul steelworks jrpl will also be supplying \u003cTHREE_\u003e gw of renewable energy to jspl s facilities reducing the steelmaker s dependence on coal fired energy by \u003cFIVE_TEN_PERCENT\u003e in the next \u003cTWO_\u003e \u003cTHREE_\u003e years this integration of green energy is expected to drastically lower the company s carbon footprint jspl will provide essential infrastructure and support while jrpl will handle the development and operation of the green hydrogen and renewable energy facilities this collaboration underscores a major commitment to decarbonisation and green energy leadership in india s steel industry with innovative engineering the mou aims not only to significantly slash the cost of green hydrogen production but also to ensure a sustainable long term business model by locking in offtake for the next \u003cTWO_TEN\u003e years the company is nearing completion of its capital expenditure program which aims to double steel making capacity at angul from \u003cSIX_\u003e mtpa to \u003cONE_TEN\u003e mtpa and increase total capacity from \u003cNINE_\u003e mtpa to \u003cONE_TEN\u003e mtpa the \u003cTHREE_TEN_THOUSAND\u003e crore investment includes funds for steel expansion accp2 mining projects and new facilities it plans to keep its balance sheet healthy by maintaining a net debt to ebitda ratio below \u003cONE_\u003e x with most new equipment and operations expected to be commissioned between q4 fy25 and q3 fy26","timestamp":"2024-09-17T13:37:00+05:30","market_timestamp":"2024-09-17T13:37:00+05:30","off_market_hours":false}