{"url":"https://www.livemint.com/market/stock-market-news/over-250-stocks-hit-one-year-highs-on-bse-investors-earn-over-6-lakh-crore-in-a-day-11726826517554.html","title":"Over 250 stocks hit one-year highs on BSE; investors earn  ₹6 lakh crore in a day","description":"Over 250 stocks, including ICICI Bank and Bharti Airtel, reached new 52-week highs on the BSE, with the Sensex and Nifty 50 achieving record gains. Investors gained  ₹6 lakh crore as market capitalisation hit record  ₹472 lakh crore.","content":"Stock market today: More than 250 stocks, including ICICI Bank, Bharti Airtel, Hindustan Unilever (HUL), Bajaj Finserv and JSW Steel, hit their fresh 52-week highs in intraday trade on BSE on Friday, September 20, even as equity benchmarks, the Sensex and the Nifty 50, clocked robust gains to scale their fresh peaks.Zomato, Bajaj Holdings, Britannia Industries, Marico, Eicher Motors, Havells, Indian Hotels, Max Healthcare Institute, Persistent Systems, PI Industries, Trent and United Spirits were also among the 265 stocks that jumped to their one-year highs on BSE on Friday.Investors earned about  ₹6 lakh crore in a day as the overall market capitalisation (mcap) of the firms listed on the BSE rose to a record  ₹472 lakh crore from  ₹466 lakh crore in the previous session.The Sensex hit its fresh all-time high of 84,694.46 before ending at 84,544.31, up 1360 points, or 1.63 per cent. The Nifty 50 jumped to its record high of 25,849.25 during the session but ended at 25,790.95, up 375 points, or 1.48 per cent.Indian stock market witnessed across-the-board buying as the BSE Midcap and BSE Smallcap indices ended with solid gains of 1.16 per cent and 1.37 per cent, respectively.Only four stocks- SBI, IndusInd Bank, TCS and Bajaj Finance- ended in the red in the 30-share pack Sensex.Shares of Mahindra and Mahindra, JSW Steel, ICICI Bank, Larsen and Toubro and Bharti Airtel ended as the top gainers in the Sensex index.\"The Indian market has joined the rally following the 50bps Fed rate cut and super accommodative monetary policy. It is expected to bring positivity to the economy and foreign inflows in the short to medium term as the global economy continues to be robust. Traction is on rate-sensitive sectors like auto and finance. Conventional sectors like FMCG are also performing well in anticipation of good results led by the dual benefit of demand and reduction in input cost,\" said Vinod Nair, the head of research at Geojit Financial Services.Read all market-related news here","cleaned_content":"stock market today more than \u003cTWO_HUNDRED\u003e stocks including icici bank bharti airtel hindustan unilever hul bajaj finserv and jsw steel hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on bse on friday september \u003cTWO_TEN\u003e even as equity benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e clocked robust gains to scale their fresh peaks zomato bajaj holdings britannia industries marico eicher motors havells indian hotels max healthcare institute persistent systems pi industries trent and united spirits were also among the \u003cTWO_HUNDRED\u003e stocks that jumped to their one year highs on bse on friday investors earned about \u003cSIX_\u003e lakh crore in a day as the overall market capitalisation mcap of the firms listed on the bse rose to a record \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session the sensex hit its fresh all time high of \u003cEIGHT_TEN_THOUSAND\u003e before ending at \u003cEIGHT_TEN_THOUSAND\u003e up \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e the nifty \u003cFIVE_TEN\u003e jumped to its record high of \u003cTWO_TEN_THOUSAND\u003e during the session but ended at \u003cTWO_TEN_THOUSAND\u003e up \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e indian stock market witnessed across the board buying as the bse midcap and bse smallcap indices ended with solid gains of \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively only four stocks sbi indusind bank tcs and bajaj finance ended in the red in the \u003cTHREE_TEN\u003e share pack sensex shares of mahindra and mahindra jsw steel icici bank larsen and toubro and bharti airtel ended as the top gainers in the sensex index the indian market has joined the rally following the \u003cFIVE_TEN\u003e bps fed rate cut and super accommodative monetary policy it is expected to bring positivity to the economy and foreign inflows in the short to medium term as the global economy continues to be robust traction is on rate sensitive sectors like auto and finance conventional sectors like fmcg are also performing well in anticipation of good results led by the dual benefit of demand and reduction in input cost said vinod nair the head of research at geojit financial services read all market related news here","timestamp":"2024-09-20T16:12:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}