{"url":"https://www.livemint.com/market/stock-market-news/multibagger-hg-infra-stock-spikes-5-on-rs-716-crore-order-from-central-railway-11726200798206.html","title":"Multibagger HG Infra stock spikes 5% on  ₹716 crore order from Central Railway","description":"In April, the stock surged 30%, leading to an 83% year-to-date return. HG Infra Engineering's shares rose 5% after securing a  ₹716 crore order. The company aims for 16% CAGR growth and anticipates significant non-road project orders by FY25.","content":"HG Infra Engineering, a company specializing in the construction, development, design, and management of various infrastructure projects, saw its shares jump 5 per cent to  ₹1,574 apiece in today's early trade after the company secured an order from Central Railway on Thursday, valued at  ₹716 crore.According to the company's filing, the LoA is for the construction of a new broad gauge (BG) line between Dhule (Borvihir) and Nardana, covering approximately 49.45 km, under the Engineering \u0026 Procurement Contract (EPC) mode.This marks the second major order for the company this week, following a  ₹781 crore contract from the Ministry of Road Transport and Highways (MoRTH) on Monday to upgrade a six-lane road in Gujarat.In August, the company also secured a work order worth  ₹883 crore from MoRTH for the upgradation of an existing six-lane road, including the construction of an elevated corridor between Narol Junction and Sarkhej Junction on NH-47 in Gujarat under the Hybrid Annuity Mode.At the end of the June quarter, the company's total order book stood at  ₹15,642 crore, equivalent to three times the FY24 revenue. A significant portion, 91 per cent, of these projects is attributed to the Government of India, with the remaining 9 per cent coming from the private sector.This distribution provides revenue visibility for the next 2-3 years. The company is anticipated to achieve revenue growth of 16 per cent CAGR from FY24 to FY26E.It is expanding its portfolio by exploring opportunities beyond road and railway projects. In March 2024, it secured its first solar project worth  ₹1,307 crore in Rajasthan from JDVVNL. This project is a joint venture with the company holding a 65 per cent stake.This bold move represents a pivotal moment in the company’s journey, broadening its business outlook while aligning with global trends toward sustainable infrastructure and renewable energy solutions.The company is also looking to secure orders in the water segment to diversify its business profile further. Domestic brokerage firm Axis Securities' latest note said this strategic diversification drive augurs well for the company.It expects an order inflow of  ₹10,000–12,000 crore in FY25. The company also anticipates  ₹8,000 crore from highway projects,  ₹2,000 crore from railway projects, and  ₹1,000 crore from solar and water projects to be added in FY25. The management expects 35-40 per cent of its order book to come from non-road projects in the next 2-3 years.For the June-ending quarter, the company reported a robust set of numbers. It reported revenue of  ₹1,506 crore, up 18 per cent YoY. The company posted EBITDA of  ₹243 crore, up 19 per cent YoY, and APAT of  ₹140 crore, up 18 per cent YoY, which exceeded street expectations. It registered EBITDA margins of 16.2 per cent in Q1 FY25 compared to 16.1 per cent in Q1 FY24.The company's shares have gained 147 per cent in less than two years and an astounding 727 per cent in just five years.In April, the stock posted its largest monthly gain in three years, surging 30 percent. This upward momentum continued over the next two months, with gains of 27 percent in May and 17 percent in July. Year to date, the stock has delivered an 83 percent return to its shareholders.","cleaned_content":"hg infra engineering a company specializing in the construction development design and management of various infrastructure projects saw its shares jump \u003cFIVE_PERCENT\u003e to \u003cONE_THOUSAND\u003e apiece in todays early trade after the company secured an order from central railway on thursday valued at \u003cSEVEN_HUNDRED\u003e crore according to the companys filing the loa is for the construction of a new broad gauge bg line between dhule borvihir and nardana covering approximately \u003cFOUR_TEN\u003e km under the engineering procurement contract epc mode this marks the second major order for the company this week following a \u003cSEVEN_HUNDRED\u003e crore contract from the ministry of road transport and highways morth on monday to upgrade a six lane road in gujarat in august the company also secured a work order worth \u003cEIGHT_HUNDRED\u003e crore from morth for the upgradation of an existing six lane road including the construction of an elevated corridor between narol junction and sarkhej junction on nh \u003cFOUR_TEN\u003e in gujarat under the hybrid annuity mode at the end of the june quarter the companys total order book stood at \u003cONE_TEN_THOUSAND\u003e crore equivalent to three times the fy24 revenue a significant portion \u003cNINE_TEN_PERCENT\u003e of these projects is attributed to the government of india with the remaining \u003cNINE_PERCENT\u003e coming from the private sector this distribution provides revenue visibility for the next \u003cTWO_\u003e \u003cTHREE_\u003e years the company is anticipated to achieve revenue growth of \u003cONE_TEN_PERCENT\u003e cagr from fy24 to fy26e it is expanding its portfolio by exploring opportunities beyond road and railway projects in march \u003cTWO_THOUSAND\u003e it secured its first solar project worth \u003cONE_THOUSAND\u003e crore in rajasthan from jdvvnl this project is a joint venture with the company holding a \u003cSIX_TEN_PERCENT\u003e stake this bold move represents a pivotal moment in the company s journey broadening its business outlook while aligning with global trends toward sustainable infrastructure and renewable energy solutions the company is also looking to secure orders in the water segment to diversify its business profile further domestic brokerage firm axis securities latest note said this strategic diversification drive augurs well for the company it expects an order inflow of \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e crore in fy25 the company also anticipates \u003cEIGHT_THOUSAND\u003e crore from highway projects \u003cTWO_THOUSAND\u003e crore from railway projects and \u003cONE_THOUSAND\u003e crore from solar and water projects to be added in fy25 the management expects \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e of its order book to come from non road projects in the next \u003cTWO_\u003e \u003cTHREE_\u003e years for the june ending quarter the company reported a robust set of numbers it reported revenue of \u003cONE_THOUSAND\u003e crore up \u003cONE_TEN_PERCENT\u003e yoy the company posted ebitda of \u003cTWO_HUNDRED\u003e crore up \u003cONE_TEN_PERCENT\u003e yoy and apat of \u003cONE_HUNDRED\u003e crore up \u003cONE_TEN_PERCENT\u003e yoy which exceeded street expectations it registered ebitda margins of \u003cONE_TEN_PERCENT\u003e in q1 fy25 compared to \u003cONE_TEN_PERCENT\u003e in q1 fy24 the companys shares have gained \u003cONE_HUNDRED_PERCENT\u003e in less than two years and an astounding \u003cSEVEN_HUNDRED_PERCENT\u003e in just five years in april the stock posted its largest monthly gain in three years surging \u003cTHREE_TEN_PERCENT\u003e this upward momentum continued over the next two months with gains of \u003cTWO_TEN_PERCENT\u003e in may and \u003cONE_TEN_PERCENT\u003e in july year to date the stock has delivered an \u003cEIGHT_TEN_PERCENT\u003e return to its shareholders","timestamp":"2024-09-13T09:54:00+05:30","market_timestamp":"2024-09-13T09:54:00+05:30","off_market_hours":false}