{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-for-long-term-persistent-systems-hdfc-life-among-5-stocks-sneha-poddar-of-motilal-oswal-recommends-11726745431854.html","title":"Stocks to buy for long term: Sneha Poddar of Motilal Oswal recommends THESE 5 shares; do you own any?","description":"The Indian stock market has gained significantly this year, with the Sensex up 15% and Nifty 50 up 17%. Experts recommend quality stocks for long-term gains amid optimism and caution. Top picks include Persistent Systems and HDFC Life.","content":"Stocks to buy for the long term: The Indian stock market has seen impressive gains this year despite headwinds such as elevated rates, geopolitical tensions, and concerns over a global economic slowdown. As of September 19, the Sensex has gained 15 per cent this year, while the Nifty 50 has gained 17 per cent.Both indices are at record highs, and the outlook remains bright due to the strong inflow of retail money and the prospects of robust economic growth. Moreover, the start of rate reduction in the US is also expected to trigger fresh foreign capital inflow, which will further boost the market.Amid the market’s wave of optimism, experts urge caution against getting swept up in the euphoria. Instead, they recommend anchoring a portfolio in quality stocks with strong fundamentals, paving the way for long-term gains.Sneha Poddar, the VP-Research, Wealth Management at Motilal Oswal Financial Services, recommends the following five stocks to buy for the long term. Take a look:Kaynes Technology is a prominent end-to-end and IoT-enabled integrated electronics manufacturer with strong order book growth and a higher share of Box Build (nearly 42 per cent in FY24) and PCBA (nearly 55 per cent).Kaynes Technology secured three major long-term orders in aerospace and outer space, industrial and EVs, and medical sectors, ensuring growth for FY25.It also received a significant two-year industrial order to be executed in FY26/FY27. Moreover, a leading medical equipment provider qualified Kaynes Technology to supply in the US and EU, which is expected to bring substantial revenue for the company.Poddar estimates an 18 per cent USD revenue CAGR for the company over FY24-27, which, combined with margin expansion, could result in a nearly 21 per cent+ EPS CAGR.\"This positions Persistent Systems in a league of its own as a diversified product engineering and IT services player, justifying a premium valuation multiple. That said, owing to its superior earnings growth trajectory, on a PEG basis, we believe the valuation still has room for upside,\" said Poddar.HDFC Life remains focused on maintaining a balanced product mix, emphasising product innovation and superior customer service.Growth in lower-tier cities will focus on expanding HDFC Bank’s branch network and deepening HDFC LIFE’s branch network.Persistency improved across cohorts, which will keep the renewal premium growth healthy.The company aims to double its APE/VNB over the next four years. Surrender charges will likely bring in new commission constructs, so distributor adaptability will be critical,\" said Poddar.“We now estimate HDFC Life to deliver a nearly 18 per cent VNB CAGR over FY24-26 and steady margin in the 25-26 per cent range,” Poddar said.Cholamandalam Investment is equipped to deliver strong AUM growth with benign credit costs (versus peers), leading to a strong RoE of nearly 21-22 per cent across economic cycles.“The management expects vehicle finance (VF) yields to improve, with marginal yields around nearly 40bp higher than book yields. This will be reflected in book yields over the next three to four quarters,” Poddar said.\"Borrowings from PSBs are typically based on the MCLR, which could see a minor increase going ahead. However, the management anticipates the overall CoB stabilising,\" said Poddar.KEI Industries has consistently delivered strong performance, led by a robust demand environment and a diversified customer base with a significant presence across domestic and international markets.Its increasing focus on the retail segment and capacity expansion would continue to drive strong growth for the company.\"Considering the strong demand outlook and improved margins in the cables and wires segment, we estimate a CAGR of 24 per cent and 22 per cent in EBITDA and EPS, respectively, over FY24-27E,\" said Poddar.Read all market-related news here","cleaned_content":"stocks to buy for the long term the indian stock market has seen impressive gains this year despite headwinds such as elevated rates geopolitical tensions and concerns over a global economic slowdown as of september \u003cONE_TEN\u003e the sensex has gained \u003cONE_TEN_PERCENT\u003e this year while the nifty \u003cFIVE_TEN\u003e has gained \u003cONE_TEN_PERCENT\u003e both indices are at record highs and the outlook remains bright due to the strong inflow of retail money and the prospects of robust economic growth moreover the start of rate reduction in the us is also expected to trigger fresh foreign capital inflow which will further boost the market amid the market s wave of optimism experts urge caution against getting swept up in the euphoria instead they recommend anchoring a portfolio in quality stocks with strong fundamentals paving the way for long term gains sneha poddar the vp research wealth management at motilal oswal financial services recommends the following five stocks to buy for the long term take a look kaynes technology is a prominent end to end and iot enabled integrated electronics manufacturer with strong order book growth and a higher share of box build nearly \u003cFOUR_TEN_PERCENT\u003e in fy24 and pcba nearly \u003cFIVE_TEN_PERCENT\u003e kaynes technology secured three major long term orders in aerospace and outer space industrial and evs and medical sectors ensuring growth for fy25 it also received a significant two year industrial order to be executed in fy26 fy27 moreover a leading medical equipment provider qualified kaynes technology to supply in the us and eu which is expected to bring substantial revenue for the company poddar estimates an \u003cONE_TEN_PERCENT\u003e usd revenue cagr for the company over fy24 \u003cTWO_TEN\u003e which combined with margin expansion could result in a nearly \u003cTWO_TEN_PERCENT\u003e eps cagr this positions persistent systems in a league of its own as a diversified product engineering and it services player justifying a premium valuation multiple that said owing to its superior earnings growth trajectory on a peg basis we believe the valuation still has room for upside said poddar hdfc life remains focused on maintaining a balanced product mix emphasising product innovation and superior customer service growth in lower tier cities will focus on expanding hdfc bank s branch network and deepening hdfc life s branch network persistency improved across cohorts which will keep the renewal premium growth healthy the company aims to double its ape vnb over the next four years surrender charges will likely bring in new commission constructs so distributor adaptability will be critical said poddar we now estimate hdfc life to deliver a nearly \u003cONE_TEN_PERCENT\u003e vnb cagr over fy24 \u003cTWO_TEN\u003e and steady margin in the \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e range poddar said cholamandalam investment is equipped to deliver strong aum growth with benign credit costs versus peers leading to a strong roe of nearly \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e across economic cycles the management expects vehicle finance vf yields to improve with marginal yields around nearly \u003cFOUR_TEN\u003e bp higher than book yields this will be reflected in book yields over the next three to four quarters poddar said borrowings from psbs are typically based on the mclr which could see a minor increase going ahead however the management anticipates the overall cob stabilising said poddar kei industries has consistently delivered strong performance led by a robust demand environment and a diversified customer base with a significant presence across domestic and international markets its increasing focus on the retail segment and capacity expansion would continue to drive strong growth for the company considering the strong demand outlook and improved margins in the cables and wires segment we estimate a cagr of \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e in ebitda and eps respectively over fy24 \u003cTWO_TEN\u003e e said poddar read all market related news here","timestamp":"2024-09-19T17:33:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}