{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-under-rs-50-julien-agro-infratech-sets-board-meeting-date-to-consider-stock-split-details-here-11726129627836.html","title":"Small-cap stock under  ₹50: Julien Agro Infratech sets board meeting date to consider stock split. Details here","description":"Small-cap stock under  ₹50: Julien Agro Infratech said its board of directors will consider a stock split on October 8.","content":"Julien Agro Infratech share price declined over 4% on Thursday after the company said its board of directors will consider a stock split. Julien Agro Infratech shares declined as much as 5.4% to  ₹28.90 apiece on the BSE.“This is to inform you that the Meeting of the Board of Directors is scheduled to be held on Tuesday, October 08, 2024 at the Registered Office of the Company for consideration of sub-division of Equity Shares,” Julien Agro Infratech said in a BSE filing.Julien Agro Infratech shares is a small-cap stock under  ₹50 apiece. The company commands a market capitalisation of  ₹57.88 crore and is engaged in the civil construction business.For the year ended March 31, 2024, Julien Agro Infratech reported revenue of  ₹21.34 crore. The company hopes to expand into real estate development on a large scale.Julien Agro Infratech shares have gained over 11% in one month, while the stock is up more than 24% year-to-date (YTD).At 2:10 pm, Julien Agro Infratech shares were trading 4.09% lower at  ₹29.30 apiece on the BSE.","cleaned_content":"julien agro infratech share price declined over \u003cFOUR_PERCENT\u003e on thursday after the company said its board of directors will consider a stock split julien agro infratech shares declined as much as \u003cFIVE_PERCENT\u003e to \u003cTWO_TEN\u003e apiece on the bse this is to inform you that the meeting of the board of directors is scheduled to be held on tuesday october \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e at the registered office of the company for consideration of sub division of equity shares julien agro infratech said in a bse filing julien agro infratech shares is a small cap stock under \u003cFIVE_TEN\u003e apiece the company commands a market capitalisation of \u003cFIVE_TEN\u003e crore and is engaged in the civil construction business for the year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e julien agro infratech reported revenue of \u003cTWO_TEN\u003e crore the company hopes to expand into real estate development on a large scale julien agro infratech shares have gained over \u003cONE_TEN_PERCENT\u003e in one month while the stock is up more than \u003cTWO_TEN_PERCENT\u003e year to date ytd at \u003cTWO_\u003e \u003cONE_TEN\u003e pm julien agro infratech shares were trading \u003cFOUR_PERCENT\u003e lower at \u003cTWO_TEN\u003e apiece on the bse","timestamp":"2024-09-12T14:02:00+05:30","market_timestamp":"2024-09-12T14:02:00+05:30","off_market_hours":false}