{"url":"https://www.livemint.com/market/stock-market-news/smallcap-defence-stock-apollo-micro-systems-jumps-almost-5-after-receiving-order-from-drdo-11726469623578.html","title":"Small-cap defence stock Apollo Micro Systems jumps almost 5% after receiving order from DRDO","description":"Apollo Micro Systems shares rose nearly 5% after announcing orders worth  ₹4.70 crore and that it has been declared the lowest bidder for a  ₹72.26-crore project. The stock is up over 110% from its 52-week low but remains 30% below its peak.","content":"Shares of Apollo Micro Systems rose almost 5 per cent in intra-day deals today, September 16 after the company informed that it has received orders worth  ₹4.70 crore from Economic Explosives Ltd and ARDE- Defence Research and Development Organisation (DRDO) .It also informed that the company has been declared as the Lowest Bidder (L1) for GNC Kit by Munitions India Ltd, with a project worth  ₹72.26 crore.The small-cap stock rose as much as 4.8 per cent post the announcement to  ₹112.25. It is now over 30 per cent away from its peak of  ₹161.75, hit in November last year. Meanwhile, it has soared over 110 per cent from its 52-week low of  ₹53.50, recorded in September last year. This is the third straight session of gains for the stock, up 10 per cent in this period.The defence stock has rallied over 95 per cent in the last one year but has lost over a percent in 2024 YTD. It has gained 7.5 per cent in September so far after an over 12 per cent fall in August.Apollo Micro Systems Limited, established in 1985 and based in Hyderabad, India, specializes in designing, developing, and assembling electronic and electro-mechanical solutions. The company offers a wide range of products, including missile hardware simulators, avionics modules, signal processing systems, launcher controllers, and satellite data simulators. It also provides solutions for public address systems, vehicle tracking, command control systems, and RFID fleet management. Additionally, Apollo Micro Systems delivers electronic manufacturing, hardware design, IT, software, and platform integration services. The company caters to industries such as defence, aerospace, and telecommunications.Apollo Micro Systems delivered impressive growth in its consolidated financial results for the quarter ending June 2024. The company reported a significant increase in net sales, reaching  ₹91.20 crore, marking a robust 58.09 per cent growth from  ₹57.69 crore in the same quarter of the previous year. This surge in sales underscores the company's strong market presence and expanding demand for its advanced electronic and electro-mechanical solutions.The quarterly net profit witnessed an exceptional rise, skyrocketing by 408.74 per cent to  ₹8.43 crore in June 2024 from  ₹1.66 crore in June 2023. This substantial profit growth highlights Apollo Micro Systems' improved operational efficiency and cost management.Additionally, the company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) saw a notable jump, reaching  ₹22.95 crore, a 76.95 per cent increase from  ₹12.97 crore in June 2023. These strong quarterly numbers reflect the company’s resilience and strategic focus on innovation and market expansion.","cleaned_content":"shares of apollo micro systems rose almost \u003cFIVE_PERCENT\u003e in intra day deals today september \u003cONE_TEN\u003e after the company informed that it has received orders worth \u003cFOUR_\u003e crore from economic explosives ltd and arde defence research and development organisation drdo it also informed that the company has been declared as the lowest bidder l1 for gnc kit by munitions india ltd with a project worth \u003cSEVEN_TEN\u003e crore the small cap stock rose as much as \u003cFOUR_PERCENT\u003e post the announcement to \u003cONE_HUNDRED\u003e it is now over \u003cTHREE_TEN_PERCENT\u003e away from its peak of \u003cONE_HUNDRED\u003e hit in november last year meanwhile it has soared over \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cFIVE_TEN\u003e recorded in september last year this is the third straight session of gains for the stock up \u003cONE_TEN_PERCENT\u003e in this period the defence stock has rallied over \u003cNINE_TEN_PERCENT\u003e in the last one year but has lost over a percent in \u003cTWO_THOUSAND\u003e ytd it has gained \u003cSEVEN_PERCENT\u003e in september so far after an over \u003cONE_TEN_PERCENT\u003e fall in august apollo micro systems limited established in \u003cONE_THOUSAND\u003e and based in hyderabad india specializes in designing developing and assembling electronic and electro mechanical solutions the company offers a wide range of products including missile hardware simulators avionics modules signal processing systems launcher controllers and satellite data simulators it also provides solutions for public address systems vehicle tracking command control systems and rfid fleet management additionally apollo micro systems delivers electronic manufacturing hardware design it software and platform integration services the company caters to industries such as defence aerospace and telecommunications apollo micro systems delivered impressive growth in its consolidated financial results for the quarter ending june \u003cTWO_THOUSAND\u003e the company reported a significant increase in net sales reaching \u003cNINE_TEN\u003e crore marking a robust \u003cFIVE_TEN_PERCENT\u003e growth from \u003cFIVE_TEN\u003e crore in the same quarter of the previous year this surge in sales underscores the companys strong market presence and expanding demand for its advanced electronic and electro mechanical solutions the quarterly net profit witnessed an exceptional rise skyrocketing by \u003cFOUR_HUNDRED_PERCENT\u003e to \u003cEIGHT_\u003e crore in june \u003cTWO_THOUSAND\u003e from \u003cONE_\u003e crore in june \u003cTWO_THOUSAND\u003e this substantial profit growth highlights apollo micro systems improved operational efficiency and cost management additionally the companys ebitda earnings before interest taxes depreciation and amortization saw a notable jump reaching \u003cTWO_TEN\u003e crore a \u003cSEVEN_TEN_PERCENT\u003e increase from \u003cONE_TEN\u003e crore in june \u003cTWO_THOUSAND\u003e these strong quarterly numbers reflect the company s resilience and strategic focus on innovation and market expansion","timestamp":"2024-09-16T12:45:00+05:30","market_timestamp":"2024-09-16T12:45:00+05:30","off_market_hours":false}