{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-18-11726623429522.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 18","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a flat start for the Indian benchmark index. The Gift Nifty was trading around 25,455 level, a premium of nearly 5 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open on a flat note Wednesday tracking a mixed trend in global markets.The trends on Gift Nifty also indicate a flat start for the Indian benchmark index. The Gift Nifty was trading around 25,455 level, a premium of nearly 5 points from the Nifty futures’ previous close.On Tuesday, the domestic equity indices ended marginally higher ahead of the US Fed policy meeting.The Sensex rose 90.88 points to close at 83,079.66, while the Nifty 50 settled 34.80 points, or 0.14%, higher at 25,418.55.Nifty 50 formed a small candle on the daily chart with identical open and close.“After the decisive upside breakout of 12th September, the current range bound action of the last few sessions could be an indication of a breather pattern and such actions more often results in an uptrend continuation,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to him, a sustainable upmove above 25,450 - 25,500 could open the next upside target of 25,800 in the near term.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 continued its narrow range movement for the last three sessions and closed on September 18 with minor gains above the 25,400 level.“Nifty 50 continues to consolidate near its all-time high, where a trendline resistance is observed. A breakout from the recent range-bound pattern could provide a clear direction for the Nifty. Immediate support is at 25,350, and a fall below this level might lead to the unwinding of put option writing positions, potentially triggering a correction toward 25,000,” said Rupak De, Senior Technical Analyst, LKP Securities.On the upside, he added, resistance is seen at 25,500, and a strong upward move may be expected if Nifty 50 breaks above this level.VLA Ambala, Co-Founder of Stock Market Today noted that the domestic market is trading at an all-time high, and the price deviation from its 20-week EMA (Exponential Moving Average) is decreasing.“The Nifty index is currently 5% away from its 20-week EMA and is likely to continue its upside movement as long as it stays above the 24,250 mark. The current RSI reading of 64 on the daily, 72 on the weekly, and 82 on the monthly timeframes indicates an overbought zone. However, I believe there is still room for gains. According to the prevailing conditions, Nifty may test its immediate support levels at 25,250 and 25,100 this week,” Ambala said.Amid these developments, she suggests viewing hedging strategies with a neutral view for the next 20 days to avoid market fluctuations. Based on these situations, according to her, the Nifty 50 index could expect support levels around 25,380 and 25,300 and notice resistance between 25,480 and 25,550 in the next session.Bank Nifty index ended marginally higher by 36 points at 52,189 on Tuesday, forming a bearish candlestick pattern on the daily charts.“Bank Nifty index advanced steadily and is now holding above the previous resistance of 51,100. The index remains above the 61.8% Fibonacci retracement level. The 20 DMA has crossed above the 50 DMA, forming a bullish crossover, suggesting that the positive momentum will likely persist. The daily RSI is comfortably above the 60 mark, with support placed around 50,800,” said Om Mehra, Technical analyst, SAMCO Securities.He believes any short-term correction towards 52,000, while maintaining these levels, would present a buying opportunity for the next session.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a flat note wednesday tracking a mixed trend in global markets the trends on gift nifty also indicate a flat start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cFIVE_\u003e points from the nifty futures previous close on tuesday the domestic equity indices ended marginally higher ahead of the us fed policy meeting the sensex rose \u003cNINE_TEN\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small candle on the daily chart with identical open and close after the decisive upside breakout of \u003cONE_TEN\u003e th september the current range bound action of the last few sessions could be an indication of a breather pattern and such actions more often results in an uptrend continuation said nagaraj shetti senior technical research analyst at hdfc securities according to him a sustainable upmove above \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e could open the next upside target of \u003cTWO_TEN_THOUSAND\u003e in the near term here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e continued its narrow range movement for the last three sessions and closed on september \u003cONE_TEN\u003e with minor gains above the \u003cTWO_TEN_THOUSAND\u003e level nifty \u003cFIVE_TEN\u003e continues to consolidate near its all time high where a trendline resistance is observed a breakout from the recent range bound pattern could provide a clear direction for the nifty immediate support is at \u003cTWO_TEN_THOUSAND\u003e and a fall below this level might lead to the unwinding of put option writing positions potentially triggering a correction toward \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst lkp securities on the upside he added resistance is seen at \u003cTWO_TEN_THOUSAND\u003e and a strong upward move may be expected if nifty \u003cFIVE_TEN\u003e breaks above this level vla ambala co founder of stock market today noted that the domestic market is trading at an all time high and the price deviation from its \u003cTWO_TEN\u003e week ema exponential moving average is decreasing the nifty index is currently \u003cFIVE_PERCENT\u003e away from its \u003cTWO_TEN\u003e week ema and is likely to continue its upside movement as long as it stays above the \u003cTWO_TEN_THOUSAND\u003e mark the current rsi reading of \u003cSIX_TEN\u003e on the daily \u003cSEVEN_TEN\u003e on the weekly and \u003cEIGHT_TEN\u003e on the monthly timeframes indicates an overbought zone however i believe there is still room for gains according to the prevailing conditions nifty may test its immediate support levels at \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e this week ambala said amid these developments she suggests viewing hedging strategies with a neutral view for the next \u003cTWO_TEN\u003e days to avoid market fluctuations based on these situations according to her the nifty \u003cFIVE_TEN\u003e index could expect support levels around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and notice resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in the next session bank nifty index ended marginally higher by \u003cTHREE_TEN\u003e points at \u003cFIVE_TEN_THOUSAND\u003e on tuesday forming a bearish candlestick pattern on the daily charts bank nifty index advanced steadily and is now holding above the previous resistance of \u003cFIVE_TEN_THOUSAND\u003e the index remains above the \u003cSIX_TEN_PERCENT\u003e fibonacci retracement level the \u003cTWO_TEN\u003e dma has crossed above the \u003cFIVE_TEN\u003e dma forming a bullish crossover suggesting that the positive momentum will likely persist the daily rsi is comfortably above the \u003cSIX_TEN\u003e mark with support placed around \u003cFIVE_TEN_THOUSAND\u003e said om mehra technical analyst samco securities he believes any short term correction towards \u003cFIVE_TEN_THOUSAND\u003e while maintaining these levels would present a buying opportunity for the next session","timestamp":"2024-09-18T07:18:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}