{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-end-flat-ahead-of-us-fed-meet-outcome-2w-stocks-shine-11726561834135.html","title":"Stock market today: Nifty 50, Sensex end flat ahead of US Fed meet outcome, 2W stocks shine","description":"The Nifty 50 ended the session with a 0.14 per cent gain at 25,418 points, nearing an all-time high of 25,445 points during the session, with just 27 points away. The S\u0026P BSE Sensex ended with a 0.13 per cent gain at 83,098 points, also hitting a new peak.","content":"Stock market today: The Indian market experienced another day of consolidation on Tuesday, as traders remained cautious ahead of the Federal Reserve's upcoming policy meeting. On Wednesday, the Fed is expected to implement its first rate cut since 2020.The Nifty 50 ended the session with a 0.14 per cent gain at 25,418 points, nearing an all-time high of 25,445 points during the session, with just 27 points away. The S\u0026P BSE Sensex ended with a 0.11 per cent gain at 83,079 points, also hitting a new peak.Among the 50 Nifty constituents, 21 stocks ended in the positive, with Hero MotoCorp leading at 3.1 per cent. Other notable gainers included Bajaj Auto, Bharti Airtel, NTPC, Mahindra \u0026 Mahindra, Britannia Industries, Kotak Mahindra Bank, and Larsen \u0026 Toubro, all rising between 0.8 per cent and 3.1 per cent.12 stocks, including HCL Technologies, Tech Mahindra, ICICI Bank, and Cipla, reached new 52-week highs.Fed policymakers will begin their two-day meeting on Tuesday, with market sentiment divided on whether they will opt for a quarter-point interest rate cut or take the less common route of a half-point reduction. This decision comes after the emergency rate cut in March 2020 at the onset of the Covid pandemic.According to analysts, August's retail sales data, which is set to be released on Tuesday, could still influence the Fed's decision before it is finalized.Markets are currently pricing in a 59 per cent chance that the Fed will deliver a larger 50 basis point rate cut on Wednesday, up from 25 per cent a month ago, while odds for a modest 25 basis point reduction stand at 41 per cent, according to CME’s FedWatch Tool.These expectations persist despite last week’s higher-than-expected August inflation data, though recent job market figures indicate signs of a slowdown in labour conditions.Shares of city gas distribution companies Mahanagar Gas (MGL) and Indraprastha Gas (IGL) saw gains of up to 6 per cent on Tuesday. This uptick followed a rating upgrade by global brokerage UBS, which changed its recommendation for IGL from 'sell' to 'buy' and increased its target price from  ₹400 to  ₹700. This new target reflects an upside potential of 32.32 per cent from IGL’s previous closing price.Similarly, UBS has raised its target price for Mahanagar Gas from  ₹1,600 to  ₹2,400 per share, indicating a potential upside of 32 per cent from the stock's latest closing price. UBS maintained its 'buy' recommendation for MGL.Auto stocks, particularly those in the two-wheeler segment, ended today’s session with notable gains. Hero MotoCorp rose 3.1 per cent to  ₹5,951 per share, reaching a new 52-week high of  ₹5,984. Similarly, Bajaj Auto achieved a fresh 52-week high of  ₹11,972, closing the day with a 2 per cent gain at  ₹11,925 per share.The newly listed OLA Electric has resumed its upward trend, gaining 10 per cent to  ₹118.3 per share, recovering from a four-day slump. This rebound followed after global brokerage firms BofA Securities and Goldman Sachs initiated coverage on the stock, assigning a ‘buy’ rating.BofA Securities set a price target of  ₹145, reflecting a 35 per cent premium. Goldman Sachs established a higher target of  ₹160, indicating a 49 per cent premium based on Monday's closing price.Both firms view OLA Electric favourably due to its expanding portfolio, access to funding, strong brand, and distribution reach, positioning it well in India's growing electric two-wheeler market.After a remarkable 135 per cent gain on its debut, with shares closing at  ₹165 each, Bajaj Housing Finance continued its strong performance on Tuesday, hitting the 10 per cent upper circuit limit, reaching  ₹181.50 per share.Today's rally came after the Global brokerage Phillip Capital initiated coverage on the stock with a 'buy' rating and set a target price of  ₹210 per share. It highlighted BHFL’s strategic focus on the ‘desirable’  ₹50 lakh ticket size, which accounts for approximately 65 per cent of home loan originations in India.The construction finance segment is expected to remain stable, constituting 8-10 per cent of the company's total book. Over the next three years, Bajaj Housing Finance is projected to have a balance sheet exceeding  ₹2 lakh crore. In the near term, credit costs are anticipated to remain favourable, it said.","cleaned_content":"stock market today the indian market experienced another day of consolidation on tuesday as traders remained cautious ahead of the federal reserves upcoming policy meeting on wednesday the fed is expected to implement its first rate cut since \u003cTWO_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e ended the session with a \u003cZERO_PERCENT\u003e gain at \u003cTWO_TEN_THOUSAND\u003e points nearing an all time high of \u003cTWO_TEN_THOUSAND\u003e points during the session with just \u003cTWO_TEN\u003e points away the s p bse sensex ended with a \u003cZERO_PERCENT\u003e gain at \u003cEIGHT_TEN_THOUSAND\u003e points also hitting a new peak among the \u003cFIVE_TEN\u003e nifty constituents \u003cTWO_TEN\u003e stocks ended in the positive with hero motocorp leading at \u003cTHREE_PERCENT\u003e other notable gainers included bajaj auto bharti airtel ntpc mahindra mahindra britannia industries kotak mahindra bank and larsen toubro all rising between \u003cZERO_PERCENT\u003e and \u003cTHREE_PERCENT\u003e 12 stocks including hcl technologies tech mahindra icici bank and cipla reached new \u003cFIVE_TEN\u003e week highs fed policymakers will begin their two day meeting on tuesday with market sentiment divided on whether they will opt for a quarter point interest rate cut or take the less common route of a half point reduction this decision comes after the emergency rate cut in march \u003cTWO_THOUSAND\u003e at the onset of the covid pandemic according to analysts augusts retail sales data which is set to be released on tuesday could still influence the feds decision before it is finalized markets are currently pricing in a \u003cFIVE_TEN_PERCENT\u003e chance that the fed will deliver a larger \u003cFIVE_TEN\u003e basis point rate cut on wednesday up from \u003cTWO_TEN_PERCENT\u003e a month ago while odds for a modest \u003cTWO_TEN\u003e basis point reduction stand at \u003cFOUR_TEN_PERCENT\u003e according to cme s fedwatch tool these expectations persist despite last week s higher than expected august inflation data though recent job market figures indicate signs of a slowdown in labour conditions shares of city gas distribution companies mahanagar gas mgl and indraprastha gas igl saw gains of up to \u003cSIX_PERCENT\u003e on tuesday this uptick followed a rating upgrade by global brokerage ubs which changed its recommendation for igl from sell to buy and increased its target price from \u003cFOUR_HUNDRED\u003e to \u003cSEVEN_HUNDRED\u003e this new target reflects an upside potential of \u003cTHREE_TEN_PERCENT\u003e from igl s previous closing price similarly ubs has raised its target price for mahanagar gas from \u003cONE_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e per share indicating a potential upside of \u003cTHREE_TEN_PERCENT\u003e from the stocks latest closing price ubs maintained its buy recommendation for mgl auto stocks particularly those in the two wheeler segment ended today s session with notable gains hero motocorp rose \u003cTHREE_PERCENT\u003e to \u003cFIVE_THOUSAND\u003e per share reaching a new \u003cFIVE_TEN\u003e week high of \u003cFIVE_THOUSAND\u003e similarly bajaj auto achieved a fresh \u003cFIVE_TEN\u003e week high of \u003cONE_TEN_THOUSAND\u003e closing the day with a \u003cTWO_PERCENT\u003e gain at \u003cONE_TEN_THOUSAND\u003e per share the newly listed ola electric has resumed its upward trend gaining \u003cONE_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e per share recovering from a four day slump this rebound followed after global brokerage firms bofa securities and goldman sachs initiated coverage on the stock assigning a buy rating bofa securities set a price target of \u003cONE_HUNDRED\u003e reflecting a \u003cTHREE_TEN_PERCENT\u003e premium goldman sachs established a higher target of \u003cONE_HUNDRED\u003e indicating a \u003cFOUR_TEN_PERCENT\u003e premium based on mondays closing price both firms view ola electric favourably due to its expanding portfolio access to funding strong brand and distribution reach positioning it well in indias growing electric two wheeler market after a remarkable \u003cONE_HUNDRED_PERCENT\u003e gain on its debut with shares closing at \u003cONE_HUNDRED\u003e each bajaj housing finance continued its strong performance on tuesday hitting the \u003cONE_TEN_PERCENT\u003e upper circuit limit reaching \u003cONE_HUNDRED\u003e per share todays rally came after the global brokerage phillip capital initiated coverage on the stock with a buy rating and set a target price of \u003cTWO_HUNDRED\u003e per share it highlighted bhfl s strategic focus on the desirable \u003cFIVE_TEN\u003e lakh ticket size which accounts for approximately \u003cSIX_TEN_PERCENT\u003e of home loan originations in india the construction finance segment is expected to remain stable constituting \u003cEIGHT_\u003e \u003cONE_TEN_PERCENT\u003e of the companys total book over the next three years bajaj housing finance is projected to have a balance sheet exceeding \u003cTWO_\u003e lakh crore in the near term credit costs are anticipated to remain favourable it said","timestamp":"2024-09-17T15:46:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}