{"url":"https://www.livemint.com/market/stock-market-news/asian-paints-sets-board-meeting-date-to-consider-dividend-sets-record-date-11726221155106.html","title":"Asian Paints sets board meeting date to consider dividend, sets record date","description":"Asian Paints announced a board meeting on October 23, 2024, to review financial results and consider an interim dividend. The record date for the dividend payment is set for October 31, 2024.","content":"Asian Paints was in focus on Friday, September 12, following the company's announcement of a board meeting scheduled for October 23, 2024, to consider a dividend. The company also set a record date in connection with the dividend decision.In an exchange filing, it said that The Company's Board of Directors will hold a meeting on Wednesday, October 23, 2024, to review and approve the audited standalone financial results for the quarter and half-year ending September 30, 2024, as well as the unaudited consolidated financial results for the same period. Additionally, the Board will consider the declaration of an interim dividend, if any, for the financial year ending March 31, 2025.It is further informed that the record date for payment of interim dividend, if declared, will be Thursday, October 31, 2024.Asian Paints announced that, in accordance with its \"Code of Conduct to Regulate, Monitor, and Report Trading by Designated Persons,\" the company's trading window will remain closed from Friday, September 20, 2024, to Friday, October 25, 2024, both days inclusive. This closure is in anticipation of the declaration of the audited standalone and unaudited consolidated financial results for the quarter and half-year ending on September 30, 2024. Additionally, the company plans to hold an investor conference on Wednesday, October 23, 2024, at 5:30 p.m. IST, during which management will provide insights into the company's performance for the same period. Details of the conference will be made available on the company's website.Asian Paints' stock faced pressure in intra-day trading on Friday, September 13, dropping around 2 percent to hit a low of  ₹3,321.10. Despite this dip, the stock remains only 3 percent below its all-time high of  ₹3,422, achieved in December 2023. On a brighter note, it has rebounded by over 24 percent from its 52-week low of  ₹2,671, recorded in May 2024.Over the past year, the stock has seen modest gains, rising just over 3 percent. However, in 2024 year-to-date (YTD), it has slipped more than 2 percent, despite registering gains for seven consecutive months from March to September, during which it climbed nearly 18 percent. The downward trend earlier this year was marked by a significant 13 percent drop in January, followed by a 4.6 percent decline in February. Despite these fluctuations, the stock's resilience in the second half of the year has kept it within striking distance of its record high.","cleaned_content":"asian paints was in focus on friday september \u003cONE_TEN\u003e following the companys announcement of a board meeting scheduled for october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to consider a dividend the company also set a record date in connection with the dividend decision in an exchange filing it said that the companys board of directors will hold a meeting on wednesday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to review and approve the audited standalone financial results for the quarter and half year ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as well as the unaudited consolidated financial results for the same period additionally the board will consider the declaration of an interim dividend if any for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e it is further informed that the record date for payment of interim dividend if declared will be thursday october \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e asian paints announced that in accordance with its code of conduct to regulate monitor and report trading by designated persons the companys trading window will remain closed from friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to friday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e both days inclusive this closure is in anticipation of the declaration of the audited standalone and unaudited consolidated financial results for the quarter and half year ending on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e additionally the company plans to hold an investor conference on wednesday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cFIVE_\u003e \u003cTHREE_TEN\u003e p m ist during which management will provide insights into the companys performance for the same period details of the conference will be made available on the companys website asian paints stock faced pressure in intra day trading on friday september \u003cONE_TEN\u003e dropping around \u003cTWO_PERCENT\u003e to hit a low of \u003cTHREE_THOUSAND\u003e despite this dip the stock remains only \u003cTHREE_PERCENT\u003e below its all time high of \u003cTHREE_THOUSAND\u003e achieved in december \u003cTWO_THOUSAND\u003e on a brighter note it has rebounded by over \u003cTWO_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_THOUSAND\u003e recorded in may \u003cTWO_THOUSAND\u003e over the past year the stock has seen modest gains rising just over \u003cTHREE_PERCENT\u003e however in \u003cTWO_THOUSAND\u003e year to date ytd it has slipped more than \u003cTWO_PERCENT\u003e despite registering gains for seven consecutive months from march to september during which it climbed nearly \u003cONE_TEN_PERCENT\u003e the downward trend earlier this year was marked by a significant \u003cONE_TEN_PERCENT\u003e drop in january followed by a \u003cFOUR_PERCENT\u003e decline in february despite these fluctuations the stocks resilience in the second half of the year has kept it within striking distance of its record high","timestamp":"2024-09-13T15:25:00+05:30","market_timestamp":"2024-09-13T15:25:00+05:30","off_market_hours":false}