{"url":"https://www.livemint.com/market/stock-market-news/itd-cementation-shares-surge-over-15-amid-reports-that-adani-group-leading-bid-for-46-64-promoter-stake-11726805546851.html","title":"ITD Cementation shares surge over 15% amid reports that Adani Group leading bid for 46.64% promoter stake","description":"ITD Cementation India's shares surged over 15% amid reports that the Adani Group is poised to acquire a 46.64% stake, potentially valued at  ₹5,888.57 crore. The stock has increased by 189% from its 52-week low, showcasing strong financial growth and robust year-to-date performance.","content":"Shares of ITD Cementation India soared by over 15 percent in intra-day trading on Friday, September 20, following reports that the Adani Group has emerged as the leading contender to acquire the promoter's 46.64 percent stake in the company. Based on current market valuations, this potential deal, inclusive of a fully subscribed open offer, could be valued at  ₹5,888.57 crore.The buzz around the deal stems from an earlier announcement on July 4, 2024, when Italian-Thai Development Public Company Limited (ITD), the majority stakeholder in ITD Cementation, revealed its plans to explore divestment opportunities. However, the process remains in its preliminary stages, with no final decision taken yet.ITD Cementation's stock jumped as much as 15.4 percent, reaching an intra-day high of  ₹543.90. With this surge, the stock is now just 8 percent shy of its July 2024 peak of  ₹589.65. The stock has exhibited impressive growth, having surged around 189 percent from its 52-week low of  ₹87.10 in October 2023.The stock has delivered robust returns over the past year, rallying over 114 percent. In 2024 alone, ITD Cementation has climbed more than 90 percent year-to-date (YTD), showing positive gains in 7 out of 9 months so far. While the stock has dipped 4 percent in September, this follows an 8 percent gain in August.ITD Cementation posted strong financial results for the quarter ending June 2024, with net profit soaring 108.5 percent year-on-year (YoY) to  ₹1,001 million, up from  ₹480 million in the same period last year. Net sales also rose by 30.0 percent to  ₹23,815 million, compared to  ₹18,326 million in April-June 2023.For the fiscal year ending March 2024, the company reported a 119.8 percent increase in net profit, reaching  ₹2,742 million, compared to  ₹1,247 million in FY23. Revenue also grew by 51.6 percent to  ₹77,179 million during FY24, reflecting the company’s strong performance.ITD Cementation India Limited, with nearly nine decades of presence in India, is a leading player in the engineering and construction space. The company specializes in heavy civil and infrastructure projects, undertaking a range of assignments including maritime structures, mass rapid transit systems, airports, hydro-electric power, highways, bridges, industrial buildings, and specialist engineering projects.","cleaned_content":"shares of itd cementation india soared by over \u003cONE_TEN_PERCENT\u003e in intra day trading on friday september \u003cTWO_TEN\u003e following reports that the adani group has emerged as the leading contender to acquire the promoters \u003cFOUR_TEN_PERCENT\u003e stake in the company based on current market valuations this potential deal inclusive of a fully subscribed open offer could be valued at \u003cFIVE_THOUSAND\u003e crore the buzz around the deal stems from an earlier announcement on july \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e when italian thai development public company limited itd the majority stakeholder in itd cementation revealed its plans to explore divestment opportunities however the process remains in its preliminary stages with no final decision taken yet itd cementations stock jumped as much as \u003cONE_TEN_PERCENT\u003e reaching an intra day high of \u003cFIVE_HUNDRED\u003e with this surge the stock is now just \u003cEIGHT_PERCENT\u003e shy of its july \u003cTWO_THOUSAND\u003e peak of \u003cFIVE_HUNDRED\u003e the stock has exhibited impressive growth having surged around \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cEIGHT_TEN\u003e in october \u003cTWO_THOUSAND\u003e the stock has delivered robust returns over the past year rallying over \u003cONE_HUNDRED_PERCENT\u003e in \u003cTWO_THOUSAND\u003e alone itd cementation has climbed more than \u003cNINE_TEN_PERCENT\u003e year to date ytd showing positive gains in \u003cSEVEN_\u003e out of \u003cNINE_\u003e months so far while the stock has dipped \u003cFOUR_PERCENT\u003e in september this follows an \u003cEIGHT_PERCENT\u003e gain in august itd cementation posted strong financial results for the quarter ending june \u003cTWO_THOUSAND\u003e with net profit soaring \u003cONE_HUNDRED_PERCENT\u003e year on year yoy to \u003cONE_THOUSAND\u003e million up from \u003cFOUR_HUNDRED\u003e million in the same period last year net sales also rose by \u003cTHREE_TEN_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e million compared to \u003cONE_TEN_THOUSAND\u003e million in april june \u003cTWO_THOUSAND\u003e for the fiscal year ending march \u003cTWO_THOUSAND\u003e the company reported a \u003cONE_HUNDRED_PERCENT\u003e increase in net profit reaching \u003cTWO_THOUSAND\u003e million compared to \u003cONE_THOUSAND\u003e million in fy23 revenue also grew by \u003cFIVE_TEN_PERCENT\u003e to \u003cSEVEN_TEN_THOUSAND\u003e million during fy24 reflecting the company s strong performance itd cementation india limited with nearly nine decades of presence in india is a leading player in the engineering and construction space the company specializes in heavy civil and infrastructure projects undertaking a range of assignments including maritime structures mass rapid transit systems airports hydro electric power highways bridges industrial buildings and specialist engineering projects","timestamp":"2024-09-20T09:52:00+05:30","market_timestamp":"2024-09-20T09:52:00+05:30","off_market_hours":false}