{"url":"https://www.livemint.com/market/stock-market-news/stocks-at-record-high-icici-bank-hcl-tech-tech-mahindra-nearly-400-stocks-hit-1-year-highs-in-stock-market-today-11726481019604.html","title":"Stocks at record high: ICICI Bank, HCL Tech, Tech Mahindra...nearly 400 stocks hit 1-year highs in stock market today","description":"Stocks at record high: As many as 387 stocks, including ICICI Bank, HCL Tech, Tech Mahindra, JSW Steel, Sun Pharma and Bajaj Finserv, hit their fresh 52-week highs in intraday trade on BSE on Monday.","content":"Stocks at record high: As many as 387 stocks, including ICICI Bank, HCL Tech, Tech Mahindra, JSW Steel, Sun Pharma and Bajaj Finserv, hit their fresh 52-week highs in intraday trade on BSE on Monday, September 16.Shares of LTIMindtree, Marico, Naukri, Persistent Systems, Shriram Finance, United Spirits, Coforge, Dixon Technologies (India), Gujarat Fluorochemicals, Mahindra and Mahindra Financial Services, Mphasis and Syngene International also hit their fresh 52-week highs on BSE during the session.Indian stock market benchmark, the Sensex and the Nifty 50, hit their fresh record highs of 83,184.34 and 25,445.70, respectively, amid mixed global cues as focus shifts to the US Fed policy outcome due on Wednesday.Sensex ended 98 points, or 0.12 per cent, higher at 82,988.78, while the Nifty 50 settled at 25,383.75, up 27 points, or 0.11 per cent. The BSE Midcap index closed flat, while the Smallcap index rose 0.28 per cent.NTPC, JSW Steel, Larsen and Toubro and Axis Bank closed as the top gainers in the Sensex index. On the flip side, shares of Bajaj Finance, Hindustan Unilever, Bajaj Finserv and Adani Ports ended as the top losers in the index.The focus of the market now is on the US Fed, which is expected to cut rates by 25 bps on Wednesday, September 18. However, some experts expect a larger rate cut of 50 bps due to signs of economic slowdown in the US.\"The domestic market traded in a narrow range with a positive bias as the participants are keenly awaiting the Fed's decision this week. The weakness in the US job market and benign inflation are pointing at a slew of rate cuts on the table. The inflow of foreign money and an expectation of stability in domestic growth may keep sentiment optimistic,\" said Vinod Nair, Head of Research, Geojit Financial Services.Rate cuts are positive triggers for the Indian market as they increase foreign capital inflow, reduce corporate borrowing costs, boost corporate profitability, and increase consumers' spending power.However, this time, when a rate cut is almost certain, the focus is on the trajectory of the interest rate cut cycle.\"The market’s reaction will depend on the motivations behind the Fed’s decision. The positive market effect could be muted if the rate cut responds to concerns about a slowing economy or rising unemployment. Conversely, if the Fed cuts rates due to low inflation and a stable growth outlook, markets may rally in response to the more favourable borrowing environment. All eyes are on the Fed as it navigates this complex economic landscape,\" Swapnil Aggarwal, the director of VSRK Capital, pointed out.Read all market-related news here","cleaned_content":"stocks at record high as many as \u003cTHREE_HUNDRED\u003e stocks including icici bank hcl tech tech mahindra jsw steel sun pharma and bajaj finserv hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on bse on monday september \u003cONE_TEN\u003e shares of ltimindtree marico naukri persistent systems shriram finance united spirits coforge dixon technologies india gujarat fluorochemicals mahindra and mahindra financial services mphasis and syngene international also hit their fresh \u003cFIVE_TEN\u003e week highs on bse during the session indian stock market benchmark the sensex and the nifty \u003cFIVE_TEN\u003e hit their fresh record highs of \u003cEIGHT_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e respectively amid mixed global cues as focus shifts to the us fed policy outcome due on wednesday sensex ended \u003cNINE_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e up \u003cTWO_TEN\u003e points or \u003cZERO_PERCENT\u003e the bse midcap index closed flat while the smallcap index rose \u003cZERO_PERCENT\u003e ntpc jsw steel larsen and toubro and axis bank closed as the top gainers in the sensex index on the flip side shares of bajaj finance hindustan unilever bajaj finserv and adani ports ended as the top losers in the index the focus of the market now is on the us fed which is expected to cut rates by \u003cTWO_TEN\u003e bps on wednesday september \u003cONE_TEN\u003e however some experts expect a larger rate cut of \u003cFIVE_TEN\u003e bps due to signs of economic slowdown in the us the domestic market traded in a narrow range with a positive bias as the participants are keenly awaiting the feds decision this week the weakness in the us job market and benign inflation are pointing at a slew of rate cuts on the table the inflow of foreign money and an expectation of stability in domestic growth may keep sentiment optimistic said vinod nair head of research geojit financial services rate cuts are positive triggers for the indian market as they increase foreign capital inflow reduce corporate borrowing costs boost corporate profitability and increase consumers spending power however this time when a rate cut is almost certain the focus is on the trajectory of the interest rate cut cycle the market s reaction will depend on the motivations behind the fed s decision the positive market effect could be muted if the rate cut responds to concerns about a slowing economy or rising unemployment conversely if the fed cuts rates due to low inflation and a stable growth outlook markets may rally in response to the more favourable borrowing environment all eyes are on the fed as it navigates this complex economic landscape swapnil aggarwal the director of vsrk capital pointed out read all market related news here","timestamp":"2024-09-16T16:07:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}