{"url":"https://www.livemint.com/market/stock-market-news/stocks-in-focus-ruchit-jain-of-5paisa-recommends-buying-ntpc-and-greaves-cotton-today-11726544088883.html","title":"Stocks in focus: Ruchit Jain of 5paisa recommends buying NTPC, and Greaves Cotton today","description":"Stocks in focus: Ruchit Jain of 5paisa has recommended two stocks today - NTPC Ltd and Greaves Cotton Ltd.","content":"Stock Market News: On Tuesday, the Nifty 50 and Sensex, the domestic benchmark indices, commenced trading near a record high, but investors are adopting a cautious approach as they await the Fed rate cut announcements.The Nifty 50 index saw an opening at 25,416.90 points, marking a 0.13% increase of 33 points, while the Sensex opened at 83,084.63, registering a gain of 95 points.Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, claims that yesterday's flat global equity markets indicate that investors are holding back in front of tomorrow's Fed rate decision. The incoming data and changing outlook will determine the Fed's rate action, thus the words of Fed Chairman Powell will be quite important. Lower interest rates are good for the markets, and larger rate cuts are even better.In spite of the market consolidating, individual stocks showed specific movement. The Nifty 50 is currently positioned near the upper boundary of a 'Rising Wedge' pattern, making it a critical juncture. However, there are no signs of weakness, as the market breadth remains positive. Traders are advised to align with the primary trend's direction. Immediate support for the Nifty 50 is around 25,220, followed by 25,100, with resistance levels at approximately 25,500 and 25,700. With the upcoming global event of FED's policy decision, it is anticipated that the index will continue to trade within this range.On stocks in focus on Tuesday, Ruchit Jain recommends NTPC Ltd, and Greaves Cotton Ltd.In last few weeks, the stock witnessed a corrective phase where prices corrected from  ₹426 to a low of  ₹385. At the recent low, the 89 DEMA has acted as a support and prices have rebounded from the support. The price volume action and the RSI set up hints at a continuation of the uptrend.Hence, short term traders are advised to buy the stock in the range of  ₹410-405 for potential targets of  ₹434 and  ₹448. The stoploss on long positions should be placed below  ₹385.The stock has given a breakout from a consolidation with rising volumes which is a bullish sign. The RSI oscillator too has a positive setup and hence, we expect the stock to rally higher in the near term. Traders can buy the stock around current market price of  ₹188 for potential targets of  ₹198 and  ₹205. The stop loss on long positions should be placed below  ₹177.","cleaned_content":"stock market news on tuesday the nifty \u003cFIVE_TEN\u003e and sensex the domestic benchmark indices commenced trading near a record high but investors are adopting a cautious approach as they await the fed rate cut announcements the nifty \u003cFIVE_TEN\u003e index saw an opening at \u003cTWO_TEN_THOUSAND\u003e points marking a \u003cZERO_PERCENT\u003e increase of \u003cTHREE_TEN\u003e points while the sensex opened at \u003cEIGHT_TEN_THOUSAND\u003e registering a gain of \u003cNINE_TEN\u003e points dr v k vijayakumar chief investment strategist at geojit financial services claims that yesterdays flat global equity markets indicate that investors are holding back in front of tomorrows fed rate decision the incoming data and changing outlook will determine the feds rate action thus the words of fed chairman powell will be quite important lower interest rates are good for the markets and larger rate cuts are even better in spite of the market consolidating individual stocks showed specific movement the nifty \u003cFIVE_TEN\u003e is currently positioned near the upper boundary of a rising wedge pattern making it a critical juncture however there are no signs of weakness as the market breadth remains positive traders are advised to align with the primary trends direction immediate support for the nifty \u003cFIVE_TEN\u003e is around \u003cTWO_TEN_THOUSAND\u003e followed by \u003cTWO_TEN_THOUSAND\u003e with resistance levels at approximately \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with the upcoming global event of feds policy decision it is anticipated that the index will continue to trade within this range on stocks in focus on tuesday ruchit jain recommends ntpc ltd and greaves cotton ltd in last few weeks the stock witnessed a corrective phase where prices corrected from \u003cFOUR_HUNDRED\u003e to a low of \u003cTHREE_HUNDRED\u003e at the recent low the \u003cEIGHT_TEN\u003e dema has acted as a support and prices have rebounded from the support the price volume action and the rsi set up hints at a continuation of the uptrend hence short term traders are advised to buy the stock in the range of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e for potential targets of \u003cFOUR_HUNDRED\u003e and \u003cFOUR_HUNDRED\u003e the stoploss on long positions should be placed below \u003cTHREE_HUNDRED\u003e the stock has given a breakout from a consolidation with rising volumes which is a bullish sign the rsi oscillator too has a positive setup and hence we expect the stock to rally higher in the near term traders can buy the stock around current market price of \u003cONE_HUNDRED\u003e for potential targets of \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e the stop loss on long positions should be placed below \u003cONE_HUNDRED\u003e","timestamp":"2024-09-17T10:03:00+05:30","market_timestamp":"2024-09-17T10:03:00+05:30","off_market_hours":false}