{"url":"https://www.livemint.com/market/stock-market-news/how-google-allegedly-monopolized-the-ad-technology-market-11726859565491.html","title":"How Google Allegedly Monopolized the Ad Technology Market","description":"Google has monopolized the technology used to buy and sell online display ads by restricting or eliminating the choices of its customers — both website publishers and advertisers — the US Justice Department alleged at a federal antitrust trial.","content":"Google has monopolized the technology used to buy and sell online display ads by restricting or eliminating the choices of its customers — both website publishers and advertisers — the US Justice Department alleged at a federal antitrust trial.Antitrust enforcers have sought to illustrate how the Alphabet Inc. unit’s complex ad ecosystem works and the ways in which the company allegedly manipulated the features of its products and the rules of its auctions to its own benefit. Over the last two weeks at the Virginia trial, they accused Google of abusing its market power in three areas: sell-side tools used by websites, called ad servers; advertising exchanges; and buy-side tools used by advertisers known as ad networks.Website publishers use an ad server to manage space available for sale. The ad server acts as the brain for the website, keeping track of the minimum bids a publisher is willing to accept, what has been sold and for how much. The Justice Department estimates that Google’s ad server controls 87% of the US market and 91% of the market globally.Ad exchanges control the auctions that match website publishers with advertisers. Google operates the largest exchange, known as AdX, later rebranded as Google Ad Manager. The Justice Department estimates that Google’s ad exchange controls 47% of the US market and 56% globally. Other popular ad exchanges include Pubmatic Inc., Index Exchange, and Magnite Inc.Sophisticated advertisers use software known as a demand-side platform to manage their ads and help determine which ad exchanges to bid on and for how much. Google operates a demand-side platform that can bid on an ad exchange.Advertisers also use ad networks, which take over most of the decision-making process like where to place ads and what to bid, and are most often used by smaller companies. The Justice Department alleges that Google’s network, Google Ads, controls 88% of the US market and 87% globally.Antitrust enforcers alleged that Google gave special access and privileges to its own ad products to encourage both advertisers and websites to spend only through its services.Google has argued that the Justice Department’s case misunderstands the dynamics, pace of innovation and competitive landscape within the online advertising market. Advertisers have multiple choices for where to buy ads, the company said, including Amazon.com Inc., Meta Platforms Inc.’s Facebook and Instagram, as well as Amazon.com Inc. and ByteDance Ltd.’s TikTok.The company also said that many of the Justice Department’s contentions mischaracterize how the technology operates. Changes to the ad tech platform were intended to improve the product, Google said. The limitations on rivals’ access were in place to reduce spam and ad fraud or help advertisers have better control over where ads appeared, the company said.Tying ProductsAs one advertising executive wrote in a 2017 email to her boss: “The value in Google’s ad tech stack is less in each individual product but in the connections across all of them.”Advertisers using the Google Ads network are only permitted to place bids through Google’s own exchange, AdX, with a few limited exceptions. That gives AdX a significant volume of ads. In 2020, for example, Google Ads sent in bids for 18 million ads sold through AdX, but only about 3 million to 4 million to third-party exchanges. The tight connection between the products requires any websites that want Google Ads advertising to use AdX.Similarly, certain functions of Google’s ad exchange, such as real-time bidding, are only available to publishers that use its ad server, DFP, according to the Justice Department.“Customers are essentially forced to use DFP to get access to AdX,” said Rosa Abrantes-Metz, the Justice Department’s economic expert. Likewise “AdX is the only channel to reach Google Ads in full.”Popular websites testified that they felt compelled to use Google’s ad server product because of its exclusive access to Google Ads.“I felt like they were holding us hostage,” said Stephanie Layser, formerly a top executive at News Corp. in charge of the media company’s use of advertising technology. Google’s ad server technology, developed decades ago, was “slow and clunky,” she said, but News Corp. estimated it might lose as much as $9 million a year if it moved to a different server because it would lose access to Google Ads.Companies that work with advertisers said they had to use Google’s ad exchange, even though it charges higher fees than others, to ensure they had enough access to website inventory.Google has argued that it has no obligation under the law to make its products work with those offered by rivals. The requirement that Google Ads bid almost exclusively through AdX helps the company better manage spam and ad fraud, company employees testified.In 2015, Google launched a program called AdWords Bidding that allowed more exchanges to bid on Google’s inventory. But it was limited to ad retargeting campaigns, by which marketers reach out to users who have visited their website in the past.Opening up the platform to allow more exchanges to bid on Google’s inventory required a huge lift from the company’s internal engineering teams to work through others’ problems with quality, testified Nirmal Jayaram, a Google engineer who worked on the company’s advertising tools for marketers.First LookBefore 2015, online display ads were sold using a “waterfall” method. A website’s ad server would ask each advertising exchange for bids sequentially. If the first exchange had an advertiser willing to pay a website’s minimum bid, the process ended. Subsequent exchanges only got to bid if the first one didn’t want a particular ad impression, even if they would have been willing to pay more.The majority of websites used Google’s ad server, which would automatically call on Google’s ad exchange to bid first, according to the Justice Department. That advantage allowed Google to win most often. Even websites that used a different ad server tended to seek out Google’s exchange first because of its exclusive access to advertisers using Google Ads.Facebook’s Brian Boland, who helmed the social network’s ad tech tools for a decade, likened this to Google getting to pick the best apples out of a crate before any other exchange.Google was aware of its advantage. “It’s strategic for us to have the AdServer being the decision maker to ensure” Google’s advertiser product “has first look access,” Eisar Lipkovitz, who headed the company’s display ad business from 2014 to 2019, wrote in an email exchange with other Google colleagues.Gabriel Weintraub, an expert who testified for the Justice Department, estimated that Google’s first look decreased the share of bids that rival exchanges saw by about 25%.Google said the DOJ’s descriptions of how the ad server worked mischaracterize the technology and that it was technically possible for websites to move another exchange in front of Google’s AdX in the waterfall. Few publishers used this technique, the company said, because they wanted to seek bids from the advertisers who had already chosen to work with Google.AdMeld AcquisitionIn 2010, Google became worried about competitors known as yield management systems, which helped websites analyze historical ad performance and determine what order to seek bids from the different ad exchanges. In an internal presentation, Google employees said that the rival tools prevented Google’s advertising exchange from seeing all of the available publisher inventory.At the time, some publishers were more comfortable with these tools because they still hadn’t wrapped their heads around some of the new features Google was offering, including real-time bidding, according to Neal Mohan, a leader in Google’s display advertising business who later became chief executive officer at YouTube. Mohan likened yield managers to DVDs in a world with modern-day video streaming, framing the tools as outdated tech.But because publishers still used them, Google was interested in acquiring a company that made them. According to documents shown in court, in 2008, Mohan suggested “picking up the one with the most traction and parking it somewhere.”Google eventually decided to buy a leading yield manager, AdMeld, for more than $400 million in 2011. The search giant incorporated some of AdMeld’s technology into its own ad exchange, and then shut down the service in 2013.Last LookDOJ expert Abrantes-Metz said Google’s purchase of AdMeld was a classic “killer acquisition” — buying a potential rival and deprecating the features that threatened its own product.By 2015, websites had become frustrated with Google and started using an alternate technology, known as header bidding, which moved the bidding process outside of the ad server. With header bidding, a publisher would add code to the website so that an auction would take place within the browser as a page was loading. This allowed websites to simultaneously seek bids from all exchanges and pick the one that would pay the most.After the auction had ended, the website would send the information to the ad server. Because Google’s ad server is tied into its exchange, though, the company had an opportunity to decide whether it wanted to preempt the winner and take the ad for itself. Lawyers for the Justice Department argued that this allowed Google to win ads without having to directly compete against other exchanges. The informational advantage also allowed Google to adjust its own bids downward since it had more data on the highest bids coming from other exchanges, the DOJ said.Abrantes-Metz, the Justice Department expert, likened it to having other exchanges take part in a sealed bid auction, but letting Google open the envelope at the end.Google acknowledged this advantage in its internal documents. Google’s tools “have visibility in to remnant price before they submit bids ,” one presentation said. But the company’s lawyers also argued that rival ad exchanges could have built integrations with its ad server that they chose not to do because it was costly.“Both publishers and exchanges have very strongly complained about the fairness of” last look, another Google employee wrote in a 2016 email.Weintraub estimated that Google’s last look advantage increased the amount of ad spend on its platform by $473 million a year.Google argues that websites could avoid giving its exchange a last look, but that most publishers opted to allow it to bid because of the greater demand in Google Ads. The company also said that when Google’s exchange gained a “last look,” that led to higher revenue for publishers.Revenue ShareGoogle’s advertising exchange, AdX, charges a 20% fee on winning bids. But in 2014, Google introduced a mechanism, called Dynamic Revenue Share, that would allow AdX to vary the fee if that would help an advertiser to win. The system would keep track of when it had given an advertiser a discounted fee on a particular bid and make up the difference in a later auction.The search giant was only able to implement DRS because of its last look advantage, Weintraub said, since Google knew what price it needed to beat in order to win. He estimated that it increased ad spending on Google’s exchange by about $162 million a year.“Because they could see all the bids, they could adjust the rev share at the end,” Brian O’Kelley, the former CEO of AppNexus, a rival ad exchange that was later purchased by AT\u0026T and then Microsoft Corp. “Because they were at the end of the process, because they owned the ad server, they could win that impression.”Google argues that the mechanism helped publishers because they made more money from their ad inventory. In one 2019 experiment the company conducted internally, it found that the DRS led to an increase of as much as 4% in publisher revenue.Pricing RulesAfter the introduction of header bidding, Google discovered that websites would often give AdX a higher minimum price to compensate for its last look advantage.In 2019, Google introduced Unified Pricing Rules, which eliminated the ability of websites to give Google’s exchange a higher minimum price than other exchanges.Website publishers were very unhappy with the change. At an April 2019 meeting with top publishers where Google announced the new rules, several websites expressed concern that Google was eliminating a key tool they used to control how exchanges bid on ads.The new rules “stopped our ability to set floors as we would like,” Michael Wheatland, an executive with the UK’s Daily Mail newspaper, testified. After the rules were adopted, the newspaper saw three times as much of its ad inventory sold through AdX, he said.The new rules hurt publishers by limiting their ability to distinguish between different exchanges, DOJ expert Weintraub said. He estimated the rules pushed as much as $221 million in advertising spend each year to AdX.Google disputes Weintraub’s assessment of the impact of the rules, attributing them to a separate change in bidding order.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"google has monopolized the technology used to buy and sell online display ads by restricting or eliminating the choices of its customers both website publishers and advertisers the us justice department alleged at a federal antitrust trial antitrust enforcers have sought to illustrate how the alphabet inc unit s complex ad ecosystem works and the ways in which the company allegedly manipulated the features of its products and the rules of its auctions to its own benefit over the last two weeks at the virginia trial they accused google of abusing its market power in three areas sell side tools used by websites called ad servers advertising exchanges and buy side tools used by advertisers known as ad networks website publishers use an ad server to manage space available for sale the ad server acts as the brain for the website keeping track of the minimum bids a publisher is willing to accept what has been sold and for how much the justice department estimates that google s ad server controls \u003cEIGHT_TEN_PERCENT\u003e of the us market and \u003cNINE_TEN_PERCENT\u003e of the market globally ad exchanges control the auctions that match website publishers with advertisers google operates the largest exchange known as adx later rebranded as google ad manager the justice department estimates that google s ad exchange controls \u003cFOUR_TEN_PERCENT\u003e of the us market and \u003cFIVE_TEN_PERCENT\u003e globally other popular ad exchanges include pubmatic inc index exchange and magnite inc sophisticated advertisers use software known as a demand side platform to manage their ads and help determine which ad exchanges to bid on and for how much google operates a demand side platform that can bid on an ad exchange advertisers also use ad networks which take over most of the decision making process like where to place ads and what to bid and are most often used by smaller companies the justice department alleges that google s network google ads controls \u003cEIGHT_TEN_PERCENT\u003e of the us market and \u003cEIGHT_TEN_PERCENT\u003e globally antitrust enforcers alleged that google gave special access and privileges to its own ad products to encourage both advertisers and websites to spend only through its services google has argued that the justice department s case misunderstands the dynamics pace of innovation and competitive landscape within the online advertising market advertisers have multiple choices for where to buy ads the company said including amazon com inc meta platforms inc s facebook and instagram as well as amazon com inc and bytedance ltd s tiktok the company also said that many of the justice department s contentions mischaracterize how the technology operates changes to the ad tech platform were intended to improve the product google said the limitations on rivals access were in place to reduce spam and ad fraud or help advertisers have better control over where ads appeared the company said tying productsas one advertising executive wrote in a \u003cTWO_THOUSAND\u003e email to her boss the value in google s ad tech stack is less in each individual product but in the connections across all of them advertisers using the google ads network are only permitted to place bids through google s own exchange adx with a few limited exceptions that gives adx a significant volume of ads in \u003cTWO_THOUSAND\u003e for example google ads sent in bids for \u003cONE_TEN\u003e million ads sold through adx but only about \u003cTHREE_\u003e million to \u003cFOUR_\u003e million to third party exchanges the tight connection between the products requires any websites that want google ads advertising to use adx similarly certain functions of google s ad exchange such as real time bidding are only available to publishers that use its ad server dfp according to the justice department customers are essentially forced to use dfp to get access to adx said rosa abrantes metz the justice department s economic expert likewise adx is the only channel to reach google ads in full popular websites testified that they felt compelled to use google s ad server product because of its exclusive access to google ads i felt like they were holding us hostage said stephanie layser formerly a top executive at news corp in charge of the media company s use of advertising technology google s ad server technology developed decades ago was slow and clunky she said but news corp estimated it might lose as much as \u003cNINE_\u003e million a year if it moved to a different server because it would lose access to google ads companies that work with advertisers said they had to use google s ad exchange even though it charges higher fees than others to ensure they had enough access to website inventory google has argued that it has no obligation under the law to make its products work with those offered by rivals the requirement that google ads bid almost exclusively through adx helps the company better manage spam and ad fraud company employees testified in \u003cTWO_THOUSAND\u003e google launched a program called adwords bidding that allowed more exchanges to bid on google s inventory but it was limited to ad retargeting campaigns by which marketers reach out to users who have visited their website in the past opening up the platform to allow more exchanges to bid on google s inventory required a huge lift from the company s internal engineering teams to work through others problems with quality testified nirmal jayaram a google engineer who worked on the company s advertising tools for marketers first lookbefore \u003cTWO_THOUSAND\u003e online display ads were sold using a waterfall method a website s ad server would ask each advertising exchange for bids sequentially if the first exchange had an advertiser willing to pay a website s minimum bid the process ended subsequent exchanges only got to bid if the first one didn t want a particular ad impression even if they would have been willing to pay more the majority of websites used google s ad server which would automatically call on google s ad exchange to bid first according to the justice department that advantage allowed google to win most often even websites that used a different ad server tended to seek out google s exchange first because of its exclusive access to advertisers using google ads facebook s brian boland who helmed the social network s ad tech tools for a decade likened this to google getting to pick the best apples out of a crate before any other exchange google was aware of its advantage it s strategic for us to have the adserver being the decision maker to ensure google s advertiser product has first look access eisar lipkovitz who headed the company s display ad business from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e wrote in an email exchange with other google colleagues gabriel weintraub an expert who testified for the justice department estimated that google s first look decreased the share of bids that rival exchanges saw by about \u003cTWO_TEN_PERCENT\u003e google said the doj s descriptions of how the ad server worked mischaracterize the technology and that it was technically possible for websites to move another exchange in front of google s adx in the waterfall few publishers used this technique the company said because they wanted to seek bids from the advertisers who had already chosen to work with google admeld acquisitionin \u003cTWO_THOUSAND\u003e google became worried about competitors known as yield management systems which helped websites analyze historical ad performance and determine what order to seek bids from the different ad exchanges in an internal presentation google employees said that the rival tools prevented google s advertising exchange from seeing all of the available publisher inventory at the time some publishers were more comfortable with these tools because they still hadn t wrapped their heads around some of the new features google was offering including real time bidding according to neal mohan a leader in google s display advertising business who later became chief executive officer at youtube mohan likened yield managers to dvds in a world with modern day video streaming framing the tools as outdated tech but because publishers still used them google was interested in acquiring a company that made them according to documents shown in court in \u003cTWO_THOUSAND\u003e mohan suggested picking up the one with the most traction and parking it somewhere google eventually decided to buy a leading yield manager admeld for more than \u003cFOUR_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e the search giant incorporated some of admeld s technology into its own ad exchange and then shut down the service in \u003cTWO_THOUSAND\u003e last lookdoj expert abrantes metz said google s purchase of admeld was a classic killer acquisition buying a potential rival and deprecating the features that threatened its own product by \u003cTWO_THOUSAND\u003e websites had become frustrated with google and started using an alternate technology known as header bidding which moved the bidding process outside of the ad server with header bidding a publisher would add code to the website so that an auction would take place within the browser as a page was loading this allowed websites to simultaneously seek bids from all exchanges and pick the one that would pay the most after the auction had ended the website would send the information to the ad server because google s ad server is tied into its exchange though the company had an opportunity to decide whether it wanted to preempt the winner and take the ad for itself lawyers for the justice department argued that this allowed google to win ads without having to directly compete against other exchanges the informational advantage also allowed google to adjust its own bids downward since it had more data on the highest bids coming from other exchanges the doj said abrantes metz the justice department expert likened it to having other exchanges take part in a sealed bid auction but letting google open the envelope at the end google acknowledged this advantage in its internal documents google s tools have visibility in to remnant price before they submit bids one presentation said but the company s lawyers also argued that rival ad exchanges could have built integrations with its ad server that they chose not to do because it was costly both publishers and exchanges have very strongly complained about the fairness of last look another google employee wrote in a \u003cTWO_THOUSAND\u003e email weintraub estimated that google s last look advantage increased the amount of ad spend on its platform by \u003cFOUR_HUNDRED\u003e million a year google argues that websites could avoid giving its exchange a last look but that most publishers opted to allow it to bid because of the greater demand in google ads the company also said that when google s exchange gained a last look that led to higher revenue for publishers revenue sharegoogle s advertising exchange adx charges a \u003cTWO_TEN_PERCENT\u003e fee on winning bids but in \u003cTWO_THOUSAND\u003e google introduced a mechanism called dynamic revenue share that would allow adx to vary the fee if that would help an advertiser to win the system would keep track of when it had given an advertiser a discounted fee on a particular bid and make up the difference in a later auction the search giant was only able to implement drs because of its last look advantage weintraub said since google knew what price it needed to beat in order to win he estimated that it increased ad spending on google s exchange by about \u003cONE_HUNDRED\u003e million a year because they could see all the bids they could adjust the rev share at the end brian o kelley the former ceo of appnexus a rival ad exchange that was later purchased by at t and then microsoft corp because they were at the end of the process because they owned the ad server they could win that impression google argues that the mechanism helped publishers because they made more money from their ad inventory in one \u003cTWO_THOUSAND\u003e experiment the company conducted internally it found that the drs led to an increase of as much as \u003cFOUR_PERCENT\u003e in publisher revenue pricing rulesafter the introduction of header bidding google discovered that websites would often give adx a higher minimum price to compensate for its last look advantage in \u003cTWO_THOUSAND\u003e google introduced unified pricing rules which eliminated the ability of websites to give google s exchange a higher minimum price than other exchanges website publishers were very unhappy with the change at an april \u003cTWO_THOUSAND\u003e meeting with top publishers where google announced the new rules several websites expressed concern that google was eliminating a key tool they used to control how exchanges bid on ads the new rules stopped our ability to set floors as we would like michael wheatland an executive with the uk s daily mail newspaper testified after the rules were adopted the newspaper saw three times as much of its ad inventory sold through adx he said the new rules hurt publishers by limiting their ability to distinguish between different exchanges doj expert weintraub said he estimated the rules pushed as much as \u003cTWO_HUNDRED\u003e million in advertising spend each year to adx google disputes weintraub s assessment of the impact of the rules attributing them to a separate change in bidding order this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-21T00:42:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}