{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-us-fed-rate-cut-buzz-five-stocks-to-buy-or-sell-on-tuesday-sept-17-11726491614756.html","title":"Stock market today: Trade setup for Nifty 50 to US Fed rate cut buzz, five stocks to buy or sell on Tuesday — Sept 17","description":"Stock market today: Nifty traded in a narrow range with a positive bias on Monday ahead of the US Fed rate cut decision. Amidst caution the underlying uptrend of the market remains intact say analysts","content":"Stock Market Today: The benchmark indices Nifty-50 index and the S\u0026P BSE Sensex traded in a narrow range throughout the day on Monday, though with a positive bias as Sensex also scaled all-time highs of 83,184.34 on Monday. The Sensex ended the day at 82,988.78, up 97.84 points or 0.12%. Nifty-50 Index at 25,383.75 also ended with 0.11% gains up 27.25 points. Investors are awaiting the US Federal Reserve's decision on interest rates during the week as the US job market weakness and softening inflation are adding to expectations of rate cuts being on the cards.The Nifty Bank index maintained its positive momentum, adding to gains last week. The index, with gains of 0.41%, ended at 52,153.15. Among others, the Nifty Media, Metals, and Reality were key gainers supporting the benchmark indices, while the Nifty FMCG, Financial Services, and IT remained under pressure. The Nifty Midcap 100 and small-cap 100 remained in the positive zone, ending with 0.38% and 0.16% gains, respectively.Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities, said the market's underlying uptrend remains intact. Shetti said the Nifty could eventually break above the range movement at 25450 and move towards the next hurdle at 25800 in the near term. According to him, immediate support is at 25150 levels.The Nifty Bank index opened with a 261-point gap-up at 51,271 and remained subdued in the first half of the session. However, strong buying momentum in the last hour pushed the index to its previous week’s high, closing at 51,772. This resulted in a decisive breakout above its key resistance zone of 51,500-51,700. The index is now trading above its 10-20 DEMA, providing strong support at lower levels, said Dhupesh Dhameja, Derivatives Analyst, SAMCO Securities.This week, global central banks will be in the headlines as the rate cut cycle is likely to begin. The European Central Bank lowered its policy rate by 25 basis points to 3.50% last week, following up on a similar cut in June, said Siddhartha Khemka, Head—Research, Wealth Management, Motilal Oswal.The US Fed will announce its interest rate decision on Wednesday, where it is widely expected to lower the rates by at least 25 bps. Some of the other large central banks in the UK, Japan, and China are also scheduled to meet during the week, as added Khemka. The beginning of rate cut cycle is likely to be beneficial for emerging markets and could keep the overall trend positive for the domestic market, said Khemkastock market experts as Sumeet Bagadia, Executive Director at Choice Broking has recommended two stock picks for Tuesday, while another  three picks are by Ganesh Dongre, Senior Manager of technical Research at Anand Rathi.The five shares recommended by them include Fortis Healthcare Ltd, Blue Star Ltd, Intellect Design Arena Ltd. Reliance Industries Ltd, Coromandel International Ltd.The daily chart analysis of Fortis reveals a promising outlook for the upcoming week, signaling a sustained upward movement, as per Bagadia. Notably, the stock has formed a significant higher high and higher low pattern, and the recent upward swing has successfully breached the neckline, establishing a new week high for the stock. This breakout suggests the potential for a substantial follow-through upward movement in the stock price.Overall chart pattern, the analysis suggests a favorable long trading opportunity for investors.2. Blue Star Ltd is the second pick of Bagadia who recommends buying Blue Star in the cash market at  ₹1934.9, with a stop loss at  ₹1868 and target price of  ₹2040The stock is currently trading at  ₹1934.9. After a period of small falls and sideways consolidation, the stock has lately broken the neckline levels of  ₹1850 and is rising quickly on the upside with substantial volume. There are expectations of further upward movement, potentially reaching  ₹2040 levels. On the downside, substantial support is evident near  ₹1868.3. Intellect Design Arena Ltd -Dongre recommends buying Intellect at  ₹995 with a stop loss at  ₹975 for a target price of Rs1025.A notable bullish reversal pattern has emerged in the stock's recent short-term trend analysis. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 1025, said Dongre. At present, the stock is maintaining a crucial support level at Rs.975  and given the current market price of Rs.995, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 1025, said Dongre4.Reliance Industries . Dongre recommend buying  Reliance Industries at  ₹2940 keeping a stop Loss at  ₹2870 for a target price of  ₹3040On the daily chart of this stock, support at  ₹2870 level has been observed, signaling a potential upward trend. as per Dongre. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 2870 is recommended. The target price for this strategy is Rs. 3040 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory, as per Dongre4. Coromandel International Ltd- Dongre recommends buying Coromandel at  ₹1706 with a stop loss at  ₹1680 for a target price of  ₹1750.On the short-term chart, this stock is forming a rounding bottom pattern, which is inherently bullish. Currently priced at Rs. 1706, this formation signals a potential upward trend. To effectively manage risk, a stop loss at Rs. 1680 is recommended. .The target price for this strategy is Rs. 1750 in the upcoming weeks. This suggests a potential gain as the stock continues its upward trajectory, backed by the bullish technical signals, said Dongre","cleaned_content":"stock market today the benchmark indices nifty \u003cFIVE_TEN\u003e index and the s p bse sensex traded in a narrow range throughout the day on monday though with a positive bias as sensex also scaled all time highs of \u003cEIGHT_TEN_THOUSAND\u003e on monday the sensex ended the day at \u003cEIGHT_TEN_THOUSAND\u003e up \u003cNINE_TEN\u003e points or \u003cZERO_PERCENT\u003e nifty \u003cFIVE_TEN\u003e index at \u003cTWO_TEN_THOUSAND\u003e also ended with \u003cZERO_PERCENT\u003e gains up \u003cTWO_TEN\u003e points investors are awaiting the us federal reserves decision on interest rates during the week as the us job market weakness and softening inflation are adding to expectations of rate cuts being on the cards the nifty bank index maintained its positive momentum adding to gains last week the index with gains of \u003cZERO_PERCENT\u003e ended at \u003cFIVE_TEN_THOUSAND\u003e among others the nifty media metals and reality were key gainers supporting the benchmark indices while the nifty fmcg financial services and it remained under pressure the nifty midcap \u003cONE_HUNDRED\u003e and small cap \u003cONE_HUNDRED\u003e remained in the positive zone ending with \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e gains respectively nagaraj shetti senior technical research analyst at hdfc securities said the markets underlying uptrend remains intact shetti said the nifty could eventually break above the range movement at \u003cTWO_TEN_THOUSAND\u003e and move towards the next hurdle at \u003cTWO_TEN_THOUSAND\u003e in the near term according to him immediate support is at \u003cTWO_TEN_THOUSAND\u003e levels the nifty bank index opened with a \u003cTWO_HUNDRED\u003e point gap up at \u003cFIVE_TEN_THOUSAND\u003e and remained subdued in the first half of the session however strong buying momentum in the last hour pushed the index to its previous week s high closing at \u003cFIVE_TEN_THOUSAND\u003e this resulted in a decisive breakout above its key resistance zone of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e the index is now trading above its \u003cONE_TEN\u003e \u003cTWO_TEN\u003e dema providing strong support at lower levels said dhupesh dhameja derivatives analyst samco securities this week global central banks will be in the headlines as the rate cut cycle is likely to begin the european central bank lowered its policy rate by \u003cTWO_TEN\u003e basis points to \u003cTHREE_PERCENT\u003e last week following up on a similar cut in june said siddhartha khemka head research wealth management motilal oswal the us fed will announce its interest rate decision on wednesday where it is widely expected to lower the rates by at least \u003cTWO_TEN\u003e bps some of the other large central banks in the uk japan and china are also scheduled to meet during the week as added khemka the beginning of rate cut cycle is likely to be beneficial for emerging markets and could keep the overall trend positive for the domestic market said khemkastock market experts as sumeet bagadia executive director at choice broking has recommended two stock picks for tuesday while another three picks are by ganesh dongre senior manager of technical research at anand rathi the five shares recommended by them include fortis healthcare ltd blue star ltd intellect design arena ltd reliance industries ltd coromandel international ltd the daily chart analysis of fortis reveals a promising outlook for the upcoming week signaling a sustained upward movement as per bagadia notably the stock has formed a significant higher high and higher low pattern and the recent upward swing has successfully breached the neckline establishing a new week high for the stock this breakout suggests the potential for a substantial follow through upward movement in the stock price overall chart pattern the analysis suggests a favorable long trading opportunity for investors 2 blue star ltd is the second pick of bagadia who recommends buying blue star in the cash market at \u003cONE_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e and target price of \u003cTWO_THOUSAND\u003e the stock is currently trading at \u003cONE_THOUSAND\u003e after a period of small falls and sideways consolidation the stock has lately broken the neckline levels of \u003cONE_THOUSAND\u003e and is rising quickly on the upside with substantial volume there are expectations of further upward movement potentially reaching \u003cTWO_THOUSAND\u003e levels on the downside substantial support is evident near \u003cONE_THOUSAND\u003e intellect design arena ltd dongre recommends buying intellect at \u003cNINE_HUNDRED\u003e with a stop loss at \u003cNINE_HUNDRED\u003e for a target price of rs1025 a notable bullish reversal pattern has emerged in the stocks recent short term trend analysis this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cONE_THOUSAND\u003e said dongre at present the stock is maintaining a crucial support level at rs 975 and given the current market price of rs 995 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cONE_THOUSAND\u003e said dongre4 reliance industries dongre recommend buying reliance industries at \u003cTWO_THOUSAND\u003e keeping a stop loss at \u003cTWO_THOUSAND\u003e for a target price of \u003cTHREE_THOUSAND\u003e on the daily chart of this stock support at \u003cTWO_THOUSAND\u003e level has been observed signaling a potential upward trend as per dongre complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cTWO_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cTHREE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory as per dongre4 coromandel international ltd dongre recommends buying coromandel at \u003cONE_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e for a target price of \u003cONE_THOUSAND\u003e on the short term chart this stock is forming a rounding bottom pattern which is inherently bullish currently priced at rs \u003cONE_THOUSAND\u003e this formation signals a potential upward trend to effectively manage risk a stop loss at rs \u003cONE_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cONE_THOUSAND\u003e in the upcoming weeks this suggests a potential gain as the stock continues its upward trajectory backed by the bullish technical signals said dongre","timestamp":"2024-09-17T06:31:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}