{"url":"https://www.livemint.com/market/stock-market-news/top-stock-recommendations-osho-krishan-of-angel-one-suggests-buying-cg-power-and-cyient-today-11726112060773.html","title":"Top Stock Recommendations: Osho Krishan of Angel One suggests buying CG Power, and Cyient today","description":"Top Stock Recommendations: Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives of Angel One, recommends buying - CG Power and Industrial Solutions Ltd, and Cyient Ltd.","content":"Stock Market News: Thursday saw the Nifty 50 and Sensex, the domestic benchmark indices, making upward strides, driven by the performance of metals and IT stocks. This was fueled by growing expectations of increased foreign inflows into the domestic equities, following US inflation data reinforcing the likelihood of a 25-basis-point Federal Reserve rate cut.As of 10:00 IST, the Nifty 50 index recorded a 0.28% increase to reach 24,988.25 points, while the Sensex advanced by 0.25% to 81,725.07.Dr. V K Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, pointed out that the most recent US inflation figures are somewhat favourable for the markets. With August's CPI inflation at 0.2%, the 12-month inflation rate has decreased from 2.9% to 2.5%. This development sets the stage for a potential interest rate reduction by the Fed in September.In addition, the fact that FIIs have started buying in the cash market over the past three days indicates that the market is likely to remain strong. The massive  ₹3.23 lakh crore application money from 89 lakh investors for the Bajaj Housing Finance IPO shows the enormous amount of liquidity currently flowing into Indian stocks. The positive market sentiment is expected to persist.Nifty 50 Outlook by Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives, Angel OneAfter experiencing a significant drop in prices last Friday, there was a recovery in the following two sessions. However, the attempt to surpass a key resistance level has been challenging, leading to a continuation of the downward momentum. Over the past month, a consistent pattern has surfaced where upward movements have been gradual, while downturns have been abrupt and forceful. Hence, we strongly recommend refraining from making aggressive bets during these intermediate bounces.Based on the current market conditions, it is recommended to exercise caution and avoid aggressive long positions unless there is a clear bullish reversal. Recent price movements have resulted in prices falling below the 20 EMA, thereby weakening their position. This suggests a potential retest of Monday’s low around the 24,750 level. If the current support level is broken, it is anticipated that further weakness could drive prices towards the 24,500 mark. Conversely, on the upside, the 25,100 - 25,150 level continues to act as a formidable resistance zone.As we approach the weekly expiry day, it's crucial to closely watch the key levels of 25,000 - 25,100 on the upside and 24,800 - 24,750 on the downside. Furthermore, we should remain vigilant about major global data points as they have the potential to significantly impact the markets and may provide valuable insights into upcoming trends.On stocks to buy on Thursday, Osho Krishan recommended two stocks - CG Power and Industrial Solutions Ltd, and Cyient Ltd.CG Power and Industrial Solutions has undergone a significant correction from its recent peak of 765 and has approached the 100-day exponential moving average (DEMA) on the daily chart. This has led to a cooling down of the technical indicators, placing them towards the oversold territory. The recent price action from the strong support level of the 100 DEMA suggests an early indication of a potential reversal in the stock's direction, presenting an opportunity for accumulation with an attractive risk-reward profile. Additionally, the 14-period Relative Strength Index (RSI) has also demonstrated a positive crossover, further supporting a bullish outlook for the same timeframe.\"Hence, we recommend to BUY CG Power and Industrial Solutions around  ₹680, keeping a stop loss of  ₹645 for a potential target price of  ₹745,\" said Osho.Cyient has witnessed a consolidation breakout in the last trading session, with substantial trading volumes supporting this move. The stock has been consistently trading above its Exponential Moving Average (EMA) and 200 SMA on the daily chart for an extended period. The latest upward movement has injected even more strength into the existing bullish momentum of the stock. Additionally, the technical indicators strongly corroborate this outlook and point towards a potential further upward movement in the near future.\"Hence, we recommend to BUY Cyient around  ₹2,050, keeping a stop loss of  ₹1,945 for a potential target price of  ₹2,260,\" advised Krishan.","cleaned_content":"stock market news thursday saw the nifty \u003cFIVE_TEN\u003e and sensex the domestic benchmark indices making upward strides driven by the performance of metals and it stocks this was fueled by growing expectations of increased foreign inflows into the domestic equities following us inflation data reinforcing the likelihood of a \u003cTWO_TEN\u003e basis point federal reserve rate cut as of \u003cONE_TEN\u003e \u003cZERO_\u003e ist the nifty \u003cFIVE_TEN\u003e index recorded a \u003cZERO_PERCENT\u003e increase to reach \u003cTWO_TEN_THOUSAND\u003e points while the sensex advanced by \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e dr v k vijayakumar the chief investment strategist at geojit financial services pointed out that the most recent us inflation figures are somewhat favourable for the markets with augusts cpi inflation at \u003cZERO_PERCENT\u003e the \u003cONE_TEN\u003e month inflation rate has decreased from \u003cTWO_PERCENT\u003e to \u003cTWO_PERCENT\u003e this development sets the stage for a potential interest rate reduction by the fed in september in addition the fact that fiis have started buying in the cash market over the past three days indicates that the market is likely to remain strong the massive \u003cTHREE_\u003e lakh crore application money from \u003cEIGHT_TEN\u003e lakh investors for the bajaj housing finance ipo shows the enormous amount of liquidity currently flowing into indian stocks the positive market sentiment is expected to persist nifty \u003cFIVE_TEN\u003e outlook by osho krishan sr analyst technical derivatives angel oneafter experiencing a significant drop in prices last friday there was a recovery in the following two sessions however the attempt to surpass a key resistance level has been challenging leading to a continuation of the downward momentum over the past month a consistent pattern has surfaced where upward movements have been gradual while downturns have been abrupt and forceful hence we strongly recommend refraining from making aggressive bets during these intermediate bounces based on the current market conditions it is recommended to exercise caution and avoid aggressive long positions unless there is a clear bullish reversal recent price movements have resulted in prices falling below the \u003cTWO_TEN\u003e ema thereby weakening their position this suggests a potential retest of monday s low around the \u003cTWO_TEN_THOUSAND\u003e level if the current support level is broken it is anticipated that further weakness could drive prices towards the \u003cTWO_TEN_THOUSAND\u003e mark conversely on the upside the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e level continues to act as a formidable resistance zone as we approach the weekly expiry day its crucial to closely watch the key levels of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the upside and \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the downside furthermore we should remain vigilant about major global data points as they have the potential to significantly impact the markets and may provide valuable insights into upcoming trends on stocks to buy on thursday osho krishan recommended two stocks cg power and industrial solutions ltd and cyient ltd cg power and industrial solutions has undergone a significant correction from its recent peak of \u003cSEVEN_HUNDRED\u003e and has approached the \u003cONE_HUNDRED\u003e day exponential moving average dema on the daily chart this has led to a cooling down of the technical indicators placing them towards the oversold territory the recent price action from the strong support level of the \u003cONE_HUNDRED\u003e dema suggests an early indication of a potential reversal in the stocks direction presenting an opportunity for accumulation with an attractive risk reward profile additionally the \u003cONE_TEN\u003e period relative strength index rsi has also demonstrated a positive crossover further supporting a bullish outlook for the same timeframe hence we recommend to buy cg power and industrial solutions around \u003cSIX_HUNDRED\u003e keeping a stop loss of \u003cSIX_HUNDRED\u003e for a potential target price of \u003cSEVEN_HUNDRED\u003e said osho cyient has witnessed a consolidation breakout in the last trading session with substantial trading volumes supporting this move the stock has been consistently trading above its exponential moving average ema and \u003cTWO_HUNDRED\u003e sma on the daily chart for an extended period the latest upward movement has injected even more strength into the existing bullish momentum of the stock additionally the technical indicators strongly corroborate this outlook and point towards a potential further upward movement in the near future hence we recommend to buy cyient around \u003cTWO_THOUSAND\u003e keeping a stop loss of \u003cONE_THOUSAND\u003e for a potential target price of \u003cTWO_THOUSAND\u003e advised krishan","timestamp":"2024-09-12T10:00:00+05:30","market_timestamp":"2024-09-12T10:00:00+05:30","off_market_hours":false}