{"url":"https://www.livemint.com/market/stock-market-news/multibagger-smallcap-stock-hazoor-multi-projects-hits-record-high-on-potential-merger-with-square-port-shipyard-11726032194033.html","title":"Multibagger smallcap stock Hazoor Multi Projects hits record high on potential merger with Square Port Shipyard","description":"Hazoor Multi Projects shares have rallied 78% year-to-date (YTD) and has given multibagger returns of more than 322% in one year. In the past three years, the smallcap stock has risen by a staggering 3,264%.","content":"Hazoor Multi Projects share price jumped more than 4% to hit a record high on Wednesday after the company announced a potential merger with Square Port Shipyard Pvt Ltd. The multibagger smallcap stock, Hazoor Multi Projects shares rallied as much as 4.86% to a new life-time high of  ₹623.00 apiece on the BSE.The meeting of the Board of Directors of Hazoor Multi Projects is scheduled to be held on Monday, September 16. The board will evaluate the proposal regarding in-principal approval of a potential merger of Square Port Shipyard Private Limited into the company with a view to combine the strengths and synergies of both businesses so as to benefit all stakeholders, Hazoor Multi Projects said in a stock exchange filing.The company will constitute a “Specific Transaction Committee” to manage and oversee all necessary steps related to the proposed merger. This committee will act on behalf of the Company to facilitate, monitor and ensure effective implementation of the merger decision in a timely manner, the BSE filing added.Recently, Hazoor Multi Projects secured multiple work orders. On September 2, the company announced that it has been awarded a work order from B.G. Shirke Const. Tech. Pvt. Ltd. for Excavation of various sites. The value of the awarded project is  ₹30 crore, plus applicable taxes.It also received a work order from Welspun Enterprises for Stacking and Dewatering works and the value of the project was  ₹40 crore.Hazoor Multi Projects share price has given decent returns to investors. The stock has gained over 21% in one week and more than 51% in one month.Hazoor Multi Projects shares have rallied 78% year-to-date (YTD) and has given multibagger returns of more than 322% in one year. In the past three years, the smallcap stock has risen by a staggering 3,264%.At 11:00 am Hazoor Multi Projects shares were trading 3.10% higher at  ₹612.50 apiece on the BSE. The company was commanding a market capitalisation of  ₹1,142.90 crore.","cleaned_content":"hazoor multi projects share price jumped more than \u003cFOUR_PERCENT\u003e to hit a record high on wednesday after the company announced a potential merger with square port shipyard pvt ltd the multibagger smallcap stock hazoor multi projects shares rallied as much as \u003cFOUR_PERCENT\u003e to a new life time high of \u003cSIX_HUNDRED\u003e apiece on the bse the meeting of the board of directors of hazoor multi projects is scheduled to be held on monday september \u003cONE_TEN\u003e the board will evaluate the proposal regarding in principal approval of a potential merger of square port shipyard private limited into the company with a view to combine the strengths and synergies of both businesses so as to benefit all stakeholders hazoor multi projects said in a stock exchange filing the company will constitute a specific transaction committee to manage and oversee all necessary steps related to the proposed merger this committee will act on behalf of the company to facilitate monitor and ensure effective implementation of the merger decision in a timely manner the bse filing added recently hazoor multi projects secured multiple work orders on september \u003cTWO_\u003e the company announced that it has been awarded a work order from b g shirke const tech pvt ltd for excavation of various sites the value of the awarded project is \u003cTHREE_TEN\u003e crore plus applicable taxes it also received a work order from welspun enterprises for stacking and dewatering works and the value of the project was \u003cFOUR_TEN\u003e crore hazoor multi projects share price has given decent returns to investors the stock has gained over \u003cTWO_TEN_PERCENT\u003e in one week and more than \u003cFIVE_TEN_PERCENT\u003e in one month hazoor multi projects shares have rallied \u003cSEVEN_TEN_PERCENT\u003e year to date ytd and has given multibagger returns of more than \u003cTHREE_HUNDRED_PERCENT\u003e in one year in the past three years the smallcap stock has risen by a staggering \u003cTHREE_THOUSAND_PERCENT\u003e at \u003cONE_TEN\u003e \u003cZERO_\u003e am hazoor multi projects shares were trading \u003cTHREE_PERCENT\u003e higher at \u003cSIX_HUNDRED\u003e apiece on the bse the company was commanding a market capitalisation of \u003cONE_THOUSAND\u003e crore","timestamp":"2024-09-11T11:03:00+05:30","market_timestamp":"2024-09-11T11:03:00+05:30","off_market_hours":false}