{"url":"https://www.livemint.com/market/stock-market-news/samvardhana-motherson-share-price-traded-volatile-sets-qip-floor-price-at-a-2-5-discount-to-previous-day-closing-price-11726558472443.html","title":"Samvardhana Motherson share price traded volatile: Sets QIP floor price at a 2.5% discount to previous day closing price","description":"Stock Market Today: Samvardhana Motherson share price fell up to 2-3% in intraday trades on Tuesday. Though the share prices also marked a recovery, however has been witnessing a volatile session. Company has set QIP floor price at around 2.5% discount to previous days close","content":"Stock Market Today: Samvardhana Motherson International Ltd share price fell 2-3% in the intraday trades on Tuesday. The Samvardhana Motherson International share price opened at  ₹196.00 on the BSE, higher than the previous close of  ₹193.75. However the Samvardhana Motherson International share price dipped to  ₹189.65 marking 2-3% decline over the previous closing price. The Samvardhana Motherson International share prices however traded volatile and recovered to intraday highs of  ₹196.90.Samvardhana Motherson International Limited in its release post market hours on Monday informed the exchange regarding Qualified Institutional Placement.The Samvardhana Motherson International in its release said that in accordance with the approval accorded by the Board of Directors of the Company, at its meeting held on August 2, 2024 and also by the shareholders of the Company, pursuant to the special resolution passed at the 37th Annual General Meeting held on August 29, 2024, the Finance Committee has, at its meeting held on 16 September, 2024 has also authorized the opening of the Issue today (i.e. September 16, 2024)Accordingly the floor price for the Issue (Qualified Institutional Placemen), had vbeen aprooved at  ₹ 188.85 per Equity Share, based on the pricing formula as prescribed under the SEBI ICDR RegulationsThe Equity Issue price will be determined by the Company in consultation with the book running lead managers appointed for the Issue, as per the Release.The Samvadhan Motherson share price has however risen more than 90% in last one year and more than doubled from  ₹82.80 levels two years back thereby giving Multibagger returns to the investorsWith its headquarters in Noida, Samvardhana Motherson International Ltd. is an international Indian manufacturer of automobile components. It produces plastic parts, wire harnesses, and rearview mirrors for passenger cars. The business was founded in 1986 as a joint venture with the Japanese Sumitomo Group.","cleaned_content":"stock market today samvardhana motherson international ltd share price fell \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e in the intraday trades on tuesday the samvardhana motherson international share price opened at \u003cONE_HUNDRED\u003e on the bse higher than the previous close of \u003cONE_HUNDRED\u003e however the samvardhana motherson international share price dipped to \u003cONE_HUNDRED\u003e marking \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e decline over the previous closing price the samvardhana motherson international share prices however traded volatile and recovered to intraday highs of \u003cONE_HUNDRED\u003e samvardhana motherson international limited in its release post market hours on monday informed the exchange regarding qualified institutional placement the samvardhana motherson international in its release said that in accordance with the approval accorded by the board of directors of the company at its meeting held on august \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e and also by the shareholders of the company pursuant to the special resolution passed at the \u003cTHREE_TEN\u003e th annual general meeting held on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the finance committee has at its meeting held on \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e has also authorized the opening of the issue today i e september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e accordingly the floor price for the issue qualified institutional placemen had vbeen aprooved at \u003cONE_HUNDRED\u003e per equity share based on the pricing formula as prescribed under the sebi icdr regulationsthe equity issue price will be determined by the company in consultation with the book running lead managers appointed for the issue as per the release the samvadhan motherson share price has however risen more than \u003cNINE_TEN_PERCENT\u003e in last one year and more than doubled from \u003cEIGHT_TEN\u003e levels two years back thereby giving multibagger returns to the investorswith its headquarters in noida samvardhana motherson international ltd is an international indian manufacturer of automobile components it produces plastic parts wire harnesses and rearview mirrors for passenger cars the business was founded in \u003cONE_THOUSAND\u003e as a joint venture with the japanese sumitomo group","timestamp":"2024-09-17T14:10:00+05:30","market_timestamp":"2024-09-17T14:10:00+05:30","off_market_hours":false}