{"url":"https://www.livemint.com/market/stock-market-news/zen-tech-after-a-2600-surge-in-5-years-nuvama-projects-70-more-upside-for-this-small-cap-defense-stock-11726456623801.html","title":"Zen Tech: After a 2,600% surge in 5 years, Nuvama projects 70% more upside for this small-cap defence stock","description":"Zen Technologies is a dominant player in India's defence sector, featuring high gross margins and a solid order book. Analysts predict significant growth for the stock, driven by government initiatives and its advanced technologies.","content":"Zen Technologies, a leader in defence simulation and anti-drone technology, has been gaining significant attention in India’s defence sector, driven by government initiatives and an increasing focus on advanced technology. This has led to a sharp rise in its share value with a 700% return to shareholders and a remarkable 2600% increase over the last five years.This upward momentum is likely to continue, according to domestic brokerage firm Nuvama Institutional Equities. It has initiated coverage on Zen Technologies with a strong 'buy' rating, citing the company’s robust growth prospects and solid order book.The brokerage has set a 12-month target price of  ₹2,200, which suggests a 32 per cent upside from the stock's previous closing price of  ₹1,667 apiece. The brokerage has further set a target of  ₹2,818 (70 per cent upside) in the bull case scenario. Nuvama argues that Zen Technologies' premium valuation is justified due to its high-growth potential.Nuvama emphasized that Zen Technologies is one of the few suppliers of essential defence simulators, which enhance the readiness and capabilities of the armed forces. The company's competitive edge lies in its in-house intellectual property, with over 75 patents, and its cutting-edge anti-drone systems, positioning it for sustained growth.India's Ministry of Defence introduced the “Framework for Simulators in Armed Forces” in 2021, aiming to enhance training through simulation-based methods. This framework emphasizes the cost-effectiveness, safety, and precision of using simulators, which offer near-realistic training experiences for combatants.The shift to simulation-based training is a strategic move that addresses budget constraints while ensuring high-quality training for soldiers, preserving on-field equipment and reducing expenses.Zen Technologies is one of the only few manufacturers of defence simulation in India having in-house IP/tech and enjoys 80–90 per cent market share for its land-based simulation product offerings, said Nuvama.In addition to its leadership in defence simulation, Zen Technologies entered the anti-drone systems market in 2021, a sector that is witnessing rapid growth. According to the brokerage estimates, the global anti-drone market is set to expand at a CAGR of 28 per cent, and India, contributing 8-10 per cent of this market, is poised for similar growth.The Indian market is expected to grow from USD 255 million in FY24 to USD 881 million by FY29, driven by rising security concerns and technological advancements.Zen's anti-drone solutions, which include both hard and soft kill systems, are crucial for national security, especially for protecting sensitive areas like borders, military installations, and strategic locations such as airports and nuclear plants. The high demand for anti-drone systems with a range of up to 5 km is expected to drive growth further.\"High double-digit growth in fresh orders (36%-plus CAGR over FY24–27E) fuelled by increasing need for defence simulation and anti-drone systems, which enhances capabilities and readiness of the armed forces,\" Nuvama highlighted in its report.It received its first order of ADS from the Indian Air Force (IAF), valued at  ₹1.55 billion. In July 23, Zen received its first export order of  ₹3.4 billion. In September 23, Indian Army ordered 20 units of C-UAS worth  ₹2.27 billion (Zen was the single vendor for this order)Nuvama Institutional Equities has placed its confidence in Zen Technologies, citing the company's remarkable order book and long-term growth potential. It said Zen currently sits on a backlog worth  ₹14 billion—four times its FY24 sales—with a pipeline of  ₹40 billion over the next two to three years.This massive order book reflects the growing demand for its simulators and anti-drone solutions, both domestically and in export markets.What sets Zen apart is its investment in research and development (R\u0026D). With over 75 patents and more than 150 pending, the company demonstrates its commitment to innovation. Its foray into emerging segments, like anti-drone systems, has expanded its total addressable market, and its focus on in-house design ensures it maintains a competitive edge, it underscored.Nuvama projects that Zen Technologies will achieve over 54 per cent CAGR in earnings per share (EPS) over FY24-27, driven by increasing simulation penetration, government-focused initiatives like the Agniveer scheme, and Zen’s expansion into new markets.The company boasts some of the highest gross margins in the defence sector, between 65-75 per cent, and an impressive return on equity (RoE) and return on capital employed (RoCE) of over 22 per cent. This, combined with its focus on in-house R\u0026D and the burgeoning defence market, makes Zen Technologies a strong player in India’s defence ecosystem.\"ZTL is an IP-focused defence proxy play owing to its advanced in-house design and development capabilities, which justify its valuation premium in our view,\" said Nuvama.","cleaned_content":"zen technologies a leader in defence simulation and anti drone technology has been gaining significant attention in india s defence sector driven by government initiatives and an increasing focus on advanced technology this has led to a sharp rise in its share value with a \u003cSEVEN_HUNDRED_PERCENT\u003e return to shareholders and a remarkable \u003cTWO_THOUSAND_PERCENT\u003e increase over the last five years this upward momentum is likely to continue according to domestic brokerage firm nuvama institutional equities it has initiated coverage on zen technologies with a strong buy rating citing the company s robust growth prospects and solid order book the brokerage has set a \u003cONE_TEN\u003e month target price of \u003cTWO_THOUSAND\u003e which suggests a \u003cTHREE_TEN_PERCENT\u003e upside from the stocks previous closing price of \u003cONE_THOUSAND\u003e apiece the brokerage has further set a target of \u003cTWO_THOUSAND\u003e \u003cSEVEN_TEN_PERCENT\u003e upside in the bull case scenario nuvama argues that zen technologies premium valuation is justified due to its high growth potential nuvama emphasized that zen technologies is one of the few suppliers of essential defence simulators which enhance the readiness and capabilities of the armed forces the companys competitive edge lies in its in house intellectual property with over \u003cSEVEN_TEN\u003e patents and its cutting edge anti drone systems positioning it for sustained growth indias ministry of defence introduced the framework for simulators in armed forces in \u003cTWO_THOUSAND\u003e aiming to enhance training through simulation based methods this framework emphasizes the cost effectiveness safety and precision of using simulators which offer near realistic training experiences for combatants the shift to simulation based training is a strategic move that addresses budget constraints while ensuring high quality training for soldiers preserving on field equipment and reducing expenses zen technologies is one of the only few manufacturers of defence simulation in india having in house ip tech and enjoys \u003cEIGHT_TEN\u003e \u003cNINE_TEN_PERCENT\u003e market share for its land based simulation product offerings said nuvama in addition to its leadership in defence simulation zen technologies entered the anti drone systems market in \u003cTWO_THOUSAND\u003e a sector that is witnessing rapid growth according to the brokerage estimates the global anti drone market is set to expand at a cagr of \u003cTWO_TEN_PERCENT\u003e and india contributing \u003cEIGHT_\u003e \u003cONE_TEN_PERCENT\u003e of this market is poised for similar growth the indian market is expected to grow from usd \u003cTWO_HUNDRED\u003e million in fy24 to usd \u003cEIGHT_HUNDRED\u003e million by fy29 driven by rising security concerns and technological advancements zens anti drone solutions which include both hard and soft kill systems are crucial for national security especially for protecting sensitive areas like borders military installations and strategic locations such as airports and nuclear plants the high demand for anti drone systems with a range of up to \u003cFIVE_\u003e km is expected to drive growth further high double digit growth in fresh orders \u003cTHREE_TEN_PERCENT\u003e plus cagr over fy24 \u003cTWO_TEN\u003e e fuelled by increasing need for defence simulation and anti drone systems which enhances capabilities and readiness of the armed forces nuvama highlighted in its report it received its first order of ads from the indian air force iaf valued at \u003cONE_\u003e billion in july \u003cTWO_TEN\u003e zen received its first export order of \u003cTHREE_\u003e billion in september \u003cTWO_TEN\u003e indian army ordered \u003cTWO_TEN\u003e units of c uas worth \u003cTWO_\u003e billion zen was the single vendor for this order nuvama institutional equities has placed its confidence in zen technologies citing the companys remarkable order book and long term growth potential it said zen currently sits on a backlog worth \u003cONE_TEN\u003e billion four times its fy24 sales with a pipeline of \u003cFOUR_TEN\u003e billion over the next two to three years this massive order book reflects the growing demand for its simulators and anti drone solutions both domestically and in export markets what sets zen apart is its investment in research and development r d with over \u003cSEVEN_TEN\u003e patents and more than \u003cONE_HUNDRED\u003e pending the company demonstrates its commitment to innovation its foray into emerging segments like anti drone systems has expanded its total addressable market and its focus on in house design ensures it maintains a competitive edge it underscored nuvama projects that zen technologies will achieve over \u003cFIVE_TEN_PERCENT\u003e cagr in earnings per share eps over fy24 \u003cTWO_TEN\u003e driven by increasing simulation penetration government focused initiatives like the agniveer scheme and zen s expansion into new markets the company boasts some of the highest gross margins in the defence sector between \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e and an impressive return on equity roe and return on capital employed roce of over \u003cTWO_TEN_PERCENT\u003e this combined with its focus on in house r d and the burgeoning defence market makes zen technologies a strong player in india s defence ecosystem ztl is an ip focused defence proxy play owing to its advanced in house design and development capabilities which justify its valuation premium in our view said nuvama","timestamp":"2024-09-16T11:47:00+05:30","market_timestamp":"2024-09-16T11:47:00+05:30","off_market_hours":false}