{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-dabur-godrej-consumer-products-emami-among-incred-equities-top-fmcg-stock-picks-11726812514259.html","title":"Stocks to buy: Dabur, Godrej Consumer Products, Emami among InCred Equities’ top FMCG stock picks","description":"Stocks to buy: Considering the optimism on a continued gradual recovery momentum in rural markets and sluggish momentum expected in urban markets, the InCred Equities firm recommends three FMCG stocks to buy.","content":"The FMCG sector is expected to post mid-to-high single-digit value growth, led by improvement in volume growth, amid recovery in rural markets, analysts at InCred Equities said.While urban market growth is expected to remain sluggish, rural markets are likely to grow 300 - 400 bps higher in value terms, aiding the industry growth, the brokerage firm said in a report.It noted that there have been more fluctuations in the trends of seasonal categories in the last few years. Seasonal categories like beverages, ice-creams, etc, which were expected to capitalize on a prolonged summer season (with higher temperatures) missed the mark (even in previous years).Meanwhile, winter care products fared relatively better than the summer season contextual products in the recent past.“Currently, non-seasonal items like soaps, hair oils, shampoos, skincare products, household care products, etc. are posting relatively steady growth. Categories like packaged food \u0026 beverages are performing better in rural markets vs. urban markets due to increased availability now vs. not being present in the previous years, leading to new customer growth for FMCG players,” InCred Equities said.Considering the optimism on a continued gradual recovery momentum in rural markets and sluggish momentum expected in urban markets, the brokerage firm recommends three FMCG stocks to buy. It continues to prefer FMCG stocks like Dabur India, Godrej Consumer Products, Emami and Jyothy Labs.Here are the top picks in the FMCG sector by InCred Equities:Dabur India is expected to continue clocking gains from the recovery in rural demand and post incremental growth. The thrust on market share gains in the oral care segment and seasonality tailwinds in the upcoming winter season, we feel, should drive growth in the healthcare range, InCred Equities said.The brokerage firm has an ‘Add’ rating for Dabur shares with a target price of  ₹725 apiece.InCred Equities believes Godrej Consumer Products is well-placed to deliver continued growth, while recent innovations, especially in household insecticides, can drive strong market share gains led by efficacy.It has an ‘Add’ rating with Godrej Consumer Products share price target of  ₹1,665 per share.Given its large rural contribution, Emami remains a preferred pick to capitalize on improving rural market growth and relevant portfolio at the mass-end, said the brokerage. It has an ‘Add’ call on Emami shares with a target of  ₹925 per share.","cleaned_content":"the fmcg sector is expected to post mid to high single digit value growth led by improvement in volume growth amid recovery in rural markets analysts at incred equities said while urban market growth is expected to remain sluggish rural markets are likely to grow \u003cTHREE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e bps higher in value terms aiding the industry growth the brokerage firm said in a report it noted that there have been more fluctuations in the trends of seasonal categories in the last few years seasonal categories like beverages ice creams etc which were expected to capitalize on a prolonged summer season with higher temperatures missed the mark even in previous years meanwhile winter care products fared relatively better than the summer season contextual products in the recent past currently non seasonal items like soaps hair oils shampoos skincare products household care products etc are posting relatively steady growth categories like packaged food beverages are performing better in rural markets vs urban markets due to increased availability now vs not being present in the previous years leading to new customer growth for fmcg players incred equities said considering the optimism on a continued gradual recovery momentum in rural markets and sluggish momentum expected in urban markets the brokerage firm recommends three fmcg stocks to buy it continues to prefer fmcg stocks like dabur india godrej consumer products emami and jyothy labs here are the top picks in the fmcg sector by incred equities dabur india is expected to continue clocking gains from the recovery in rural demand and post incremental growth the thrust on market share gains in the oral care segment and seasonality tailwinds in the upcoming winter season we feel should drive growth in the healthcare range incred equities said the brokerage firm has an add rating for dabur shares with a target price of \u003cSEVEN_HUNDRED\u003e apiece incred equities believes godrej consumer products is well placed to deliver continued growth while recent innovations especially in household insecticides can drive strong market share gains led by efficacy it has an add rating with godrej consumer products share price target of \u003cONE_THOUSAND\u003e per share given its large rural contribution emami remains a preferred pick to capitalize on improving rural market growth and relevant portfolio at the mass end said the brokerage it has an add call on emami shares with a target of \u003cNINE_HUNDRED\u003e per share","timestamp":"2024-09-20T11:50:00+05:30","market_timestamp":"2024-09-20T11:50:00+05:30","off_market_hours":false}