{"url":"https://www.livemint.com/market/stock-market-news/bank-nifty-trading-strategy-today-how-to-trade-bank-nifty-options-on-september-12-rahul-ghose-suggests-this-strategy-11726107985086.html","title":"Bank Nifty Trading Strategy Today: How to trade Bank Nifty options on September 12? Rahul Ghose suggests this strategy","description":"Bank Nifty is not able to sustain above 51,400 levels, showing weakness in the index. With the view on the downside, Rahul Ghose recommends a low-risk Bank Nifty options strategy. Check here:","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open higher on Thursday led by positive global cues. The trends on Gift Nifty also suggest a positive opening for the domestic equity market.Bank Nifty index declined 262.30 points, or 0.51%, to close at 51,010 on Wednesday. The index failed to breach its 50-DMA (Day Moving Average) and saw selling pressure from those levels.According to Rahul Ghose, CEO of Hedged.in, Bank Nifty is not able to sustain above 51,400 levels, showing weakness in the index. Wednesday’s high of 51,410 is acting as an immediate resistance for the index.With the view on the downside, Ghose recommends a low-risk Bank Nifty options strategy from hedged.in which makes money if the Bank Nifty falls below 50,826 by the end of next week expiry.Even if the Bank Nifty does move up or sideways, the max risk in the trade is  ₹1,100 only, Ghose said.Here is Bank Nifty options trading strategy for today by Rahul Ghose:\u003e Buy 1 lot of the 18th Sep expiry 50900 PE at CMP 294\u003e Buy 1 lot of the 18th Sep expiry 50500 PE at CMP 165\u003e Sell 2 lots of the 18th Sep expiry 50600 PE at CMP 193The capital required in the trade is  ₹37,600. This trade can be entered if Bank Nifty is trading between the levels of 50,800 and 51,100. The maximum loss in the trade is  ₹1,100 and the target in the trade should be 2% to 3% on the capital depending upon the time and individual risk appetite, Ghose said.The trade is protected with a limited risk of  ₹1,100 per set, Ghose added.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on thursday led by positive global cues the trends on gift nifty also suggest a positive opening for the domestic equity market bank nifty index declined \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on wednesday the index failed to breach its \u003cFIVE_TEN\u003e dma day moving average and saw selling pressure from those levels according to rahul ghose ceo of hedged in bank nifty is not able to sustain above \u003cFIVE_TEN_THOUSAND\u003e levels showing weakness in the index wednesday s high of \u003cFIVE_TEN_THOUSAND\u003e is acting as an immediate resistance for the index with the view on the downside ghose recommends a low risk bank nifty options strategy from hedged in which makes money if the bank nifty falls below \u003cFIVE_TEN_THOUSAND\u003e by the end of next week expiry even if the bank nifty does move up or sideways the max risk in the trade is \u003cONE_THOUSAND\u003e only ghose said here is bank nifty options trading strategy for today by rahul ghose buy \u003cONE_\u003e lot of the \u003cONE_TEN\u003e th sep expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cTWO_HUNDRED\u003e buy \u003cONE_\u003e lot of the \u003cONE_TEN\u003e th sep expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cONE_HUNDRED\u003e sell \u003cTWO_\u003e lots of the \u003cONE_TEN\u003e th sep expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cONE_HUNDRED\u003e the capital required in the trade is \u003cTHREE_TEN_THOUSAND\u003e this trade can be entered if bank nifty is trading between the levels of \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e the maximum loss in the trade is \u003cONE_THOUSAND\u003e and the target in the trade should be \u003cTWO_PERCENT\u003e to \u003cTHREE_PERCENT\u003e on the capital depending upon the time and individual risk appetite ghose said the trade is protected with a limited risk of \u003cONE_THOUSAND\u003e per set ghose added","timestamp":"2024-09-12T08:12:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}