{"url":"https://www.livemint.com/market/stock-market-news/inr-vs-usd-why-indian-rupee-is-falling-despite-dropping-us-dollar-rates-11726216764711.html","title":"INR vs USD: Why is Indian rupee falling despite dropping US dollar rates?","description":"INR vs USD: The US dollar index slipped to multi-month lows of around 101 level from a three-month high of 106 as investors ratcheted up bets for an aggressive US Fed rate cut","content":"INR vs USD: The Indian rupee has remained range-bound despite a weakening US dollar and favourable global factors, including declining crude oil prices and strong foreign institutional inflows (FII) into the Indian stock market.The US dollar index slipped to multi-month lows of around 101 level from a three-month high of 106.00, nearly 5%, as investors ratcheted up bets for a super-sized interest rate cut by the US Federal Reserve next week.While most Asian currencies have strengthened against the dollar, the rupee has traded within a broader range, failing to capitalize on the dollar's decline and other positive market conditions.Analysts attribute this lack of appreciation to the Reserve Bank of India's (RBI) active intervention in the foreign exchange market through substantial dollar purchases.“The US dollar index has fallen from a level of 106 to around 101 in the past three months. Simultaneously, Asian currencies have appreciated against the greenback. The likely interest rate cuts by the US Fed, a sharp drop in crude oil prices and consistent foreign institutional inflows into Indian stock markets are supportive factors for the rupee. However, the local currency has not appreciated; rather, it remains weak against the US dollar,” said Amit Pabari, MD, CR Forex Advisors.The reason behind the rupee remaining in a range, Pabari explained, is the heavy intervention by the RBI.“RBI has been absorbing most dollar inflows into the economy. This consistent dollar buying by the central bank has not allowed the rupee to appreciate,” Pabari said.Meanwhile, the local unit has also not depreciated beyond the level of 84 a dollar.One of the key reasons why RBI is preventing INR from falling beyond 84/USD is India’s high trade deficit with China, along with appreciating the Chinese yuan against the dollar.“Indian rupee is weakening against China’s currency. This adds to India’s trade deficit with China. Hence, RBI likely keeps intervening to prevent rupee’s more,” Pabari said.Jigar Trivedi, Senior Research Analyst - Currencies \u0026 Commodities at Reliance Securities, noted that the range-bound movement continues in the rupee even after the weak dollar and crude oil prices.“The dollar inflows into the system is also not a catalyst for the rupee to strengthen. The Indian equity market is experiencing a healthy dollar inflow. Moreover, India’s weightage has improved in the MSCI emerging markets index. Nonetheless, the RBI is maintaining a firm grip on the domestic currency,” said Trivedi.According to Trivedi, the rupee is likely to remain range-bound. He sees 84 as stiff resistance and 83.80 as a floor.“Only beyond this range can we derive a clear view,” Trivedi said.In the near term, the rupee is expected to trade within a narrow band of 83.80 to 84.05, while the medium-term outlook slightly broadens the range to 83.70 to 84.05, according to Pabari.","cleaned_content":"inr vs usd the indian rupee has remained range bound despite a weakening us dollar and favourable global factors including declining crude oil prices and strong foreign institutional inflows fii into the indian stock market the us dollar index slipped to multi month lows of around \u003cONE_HUNDRED\u003e level from a three month high of \u003cONE_HUNDRED\u003e nearly \u003cFIVE_PERCENT\u003e as investors ratcheted up bets for a super sized interest rate cut by the us federal reserve next week while most asian currencies have strengthened against the dollar the rupee has traded within a broader range failing to capitalize on the dollars decline and other positive market conditions analysts attribute this lack of appreciation to the reserve bank of indias rbi active intervention in the foreign exchange market through substantial dollar purchases the us dollar index has fallen from a level of \u003cONE_HUNDRED\u003e to around \u003cONE_HUNDRED\u003e in the past three months simultaneously asian currencies have appreciated against the greenback the likely interest rate cuts by the us fed a sharp drop in crude oil prices and consistent foreign institutional inflows into indian stock markets are supportive factors for the rupee however the local currency has not appreciated rather it remains weak against the us dollar said amit pabari md cr forex advisors the reason behind the rupee remaining in a range pabari explained is the heavy intervention by the rbi rbi has been absorbing most dollar inflows into the economy this consistent dollar buying by the central bank has not allowed the rupee to appreciate pabari said meanwhile the local unit has also not depreciated beyond the level of \u003cEIGHT_TEN\u003e a dollar one of the key reasons why rbi is preventing inr from falling beyond \u003cEIGHT_TEN\u003e usd is india s high trade deficit with china along with appreciating the chinese yuan against the dollar indian rupee is weakening against china s currency this adds to india s trade deficit with china hence rbi likely keeps intervening to prevent rupee s more pabari said jigar trivedi senior research analyst currencies commodities at reliance securities noted that the range bound movement continues in the rupee even after the weak dollar and crude oil prices the dollar inflows into the system is also not a catalyst for the rupee to strengthen the indian equity market is experiencing a healthy dollar inflow moreover india s weightage has improved in the msci emerging markets index nonetheless the rbi is maintaining a firm grip on the domestic currency said trivedi according to trivedi the rupee is likely to remain range bound he sees \u003cEIGHT_TEN\u003e as stiff resistance and \u003cEIGHT_TEN\u003e as a floor only beyond this range can we derive a clear view trivedi said in the near term the rupee is expected to trade within a narrow band of \u003cEIGHT_TEN\u003e to \u003cEIGHT_TEN\u003e while the medium term outlook slightly broadens the range to \u003cEIGHT_TEN\u003e to \u003cEIGHT_TEN\u003e according to pabari","timestamp":"2024-09-14T09:47:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}