{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-bharat-electronics-tata-steel-vedanta-bpcl-nbcc-and-more-11726073547328.html","title":"Stocks to Watch: Bharat Electronics, Tata Steel, Vedanta, BPCL, NBCC, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Bharat Electronics Ltd (BEL): On Wednesday, Bharat Electronics Ltd (BEL), a public sector defense manufacturer, announced that it had secured orders worth  ₹1,155 crore through two separate deals. The first order, valued at  ₹850 crore, was placed by Cochin Shipyard Limited (CSL) for the supply of indigenous multi-function X-Band radars. Additionally, BEL received  ₹305 crore in orders for a variety of naval systems, including navigational complex systems for ships, thermal imagers, communication equipment, fire control and gun control systems, along with spares and services, as per its stock exchange filing.Tata Steel: Tata Steel Ltd has signed a £500 million grant agreement with the UK government as part of its £1.25 billion green steel project in Port Talbot, Wales. This funding will facilitate the installation of an electric arc furnace, aiming to reduce the UK's industrial carbon emissions by 8% and cut Port Talbot’s emissions by 90%. Tata Steel CEO T.V. Narendran said the project, with the government's support, could position Port Talbot as a leading European hub for green steelmaking, contributing significantly to circular economy practices through the use of scrap materials.Adani Ports and Special Economic Zone (APSEZ): APSEZ, through its subsidiary DPA Container and Clean Cargo Terminal Limited (DPACCCTL), has signed a concession agreement to develop Berth No. 13 at Deendayal Port, Kandla, Gujarat. The berth, intended for handling multipurpose clean cargo and containers, is expected to be operational by FY27.Bharat Petroleum Corporation (BPCL): BPCL, through its subsidiary Urja Bharat Pte Limited (UBPL), has secured a production concession in Abu Dhabi. The awarded area spans 6,162 square kilometers and includes both conventional oil and gas resources.Auto Stocks: Auto manufacturers will be in focus after the Union Cabinet approved two major schemes—PM Electric Drive Revolution in Innovative Vehicle Enhancement (PM E-DRIVE) and PM-eBus Sewa-Payment Security Mechanism (PSM). With a total outlay of  ₹14,335 crore, these schemes aim to promote the use of electric vehicles (EVs), including buses, ambulances, and trucks.Vedanta: Vedanta has raised $900 million through a US dollar bond issue, aimed at prepaying existing debt. The bond, issued at a coupon rate of 10.875 percent, was significantly oversubscribed.Nazara Technologies: Nazara Technologies has acquired a 15.86 percent stake in blockchain-based e-sports startup Stan for $2.2 million. Stan focuses on mobile-first fan engagement and digital collectibles.Route Mobile: Promoter Proximus Opal is set to offload up to 38 lakh shares, representing 6.03 percent equity, through an offer for sale (OFS) on September 12 and 13. The floor price for the OFS has been set at  ₹1,635 per share. The offer will be available to non-retail investors on September 12, followed by retail investors on September 13.HPCL: The board of Hindustan Petroleum Corporation Ltd (HPCL) has approved the Visakh-Raipur Pipeline Project, which includes constructing a pipeline from Visakh to Raipur along with related facilities such as a depot at Kantabanji. The project is estimated to cost  ₹2,212 crore.NBCC: NBCC has entered into a partnership with MTNL to develop a 13.88-acre land parcel in New Delhi. The project has a valuation of  ₹1,600 crore.Arvind Fashions: Goldman Sachs has acquired over 13 lakh shares of Arvind Fashions through a block deal, amounting to a total investment of  ₹75 crore.","cleaned_content":"bharat electronics ltd bel on wednesday bharat electronics ltd bel a public sector defense manufacturer announced that it had secured orders worth \u003cONE_THOUSAND\u003e crore through two separate deals the first order valued at \u003cEIGHT_HUNDRED\u003e crore was placed by cochin shipyard limited csl for the supply of indigenous multi function x band radars additionally bel received \u003cTHREE_HUNDRED\u003e crore in orders for a variety of naval systems including navigational complex systems for ships thermal imagers communication equipment fire control and gun control systems along with spares and services as per its stock exchange filing tata steel tata steel ltd has signed a \u003cFIVE_HUNDRED\u003e million grant agreement with the uk government as part of its \u003cONE_\u003e billion green steel project in port talbot wales this funding will facilitate the installation of an electric arc furnace aiming to reduce the uks industrial carbon emissions by \u003cEIGHT_PERCENT\u003e and cut port talbot s emissions by \u003cNINE_TEN_PERCENT\u003e tata steel ceo t v narendran said the project with the governments support could position port talbot as a leading european hub for green steelmaking contributing significantly to circular economy practices through the use of scrap materials adani ports and special economic zone apsez apsez through its subsidiary dpa container and clean cargo terminal limited dpaccctl has signed a concession agreement to develop berth no \u003cONE_TEN\u003e at deendayal port kandla gujarat the berth intended for handling multipurpose clean cargo and containers is expected to be operational by fy27 bharat petroleum corporation bpcl bpcl through its subsidiary urja bharat pte limited ubpl has secured a production concession in abu dhabi the awarded area spans \u003cSIX_THOUSAND\u003e square kilometers and includes both conventional oil and gas resources auto stocks auto manufacturers will be in focus after the union cabinet approved two major schemes pm electric drive revolution in innovative vehicle enhancement pm e drive and pm ebus sewa payment security mechanism psm with a total outlay of \u003cONE_TEN_THOUSAND\u003e crore these schemes aim to promote the use of electric vehicles evs including buses ambulances and trucks vedanta vedanta has raised \u003cNINE_HUNDRED\u003e million through a us dollar bond issue aimed at prepaying existing debt the bond issued at a coupon rate of \u003cONE_TEN_PERCENT\u003e was significantly oversubscribed nazara technologies nazara technologies has acquired a \u003cONE_TEN_PERCENT\u003e stake in blockchain based e sports startup stan for \u003cTWO_\u003e million stan focuses on mobile first fan engagement and digital collectibles route mobile promoter proximus opal is set to offload up to \u003cTHREE_TEN\u003e lakh shares representing \u003cSIX_PERCENT\u003e equity through an offer for sale ofs on september \u003cONE_TEN\u003e and \u003cONE_TEN\u003e the floor price for the ofs has been set at \u003cONE_THOUSAND\u003e per share the offer will be available to non retail investors on september \u003cONE_TEN\u003e followed by retail investors on september \u003cONE_TEN\u003e hpcl the board of hindustan petroleum corporation ltd hpcl has approved the visakh raipur pipeline project which includes constructing a pipeline from visakh to raipur along with related facilities such as a depot at kantabanji the project is estimated to cost \u003cTWO_THOUSAND\u003e crore nbcc nbcc has entered into a partnership with mtnl to develop a \u003cONE_TEN\u003e acre land parcel in new delhi the project has a valuation of \u003cONE_THOUSAND\u003e crore arvind fashions goldman sachs has acquired over \u003cONE_TEN\u003e lakh shares of arvind fashions through a block deal amounting to a total investment of \u003cSEVEN_TEN\u003e crore","timestamp":"2024-09-12T08:28:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}