{"url":"https://www.livemint.com/market/stock-market-news/ahluwalia-contracts-gets-an-upgrade-from-axis-securities-3-reasons-why-the-brokerage-is-bullish-on-the-stock-11726570032970.html","title":"Ahluwalia Contracts gets an upgrade from Axis Securities; 3 reasons why the brokerage is bullish on the stock","description":"Ahluwalia Contracts India has a robust order book of  ₹16,846 crore, ensuring strong revenue growth for the next 3-4 years. Axis Securities upgraded the stock rating to 'buy' due to positive government infrastructure focus and anticipated high double-digit growth in FY25 and FY26.","content":"Ahluwalia Contracts India possesses a strong and diverse order book, providing a solid revenue outlook for the next 3-4 years. Additionally, the company is benefitting from positive government emphasis on infrastructure development and the resurgence of private investment, which bodes well for its future, according to Axis Securities in its latest report after meeting with the company's management.The brokerage also stated that high double-digit revenue growth is anticipated in FY25 and FY26 according to management's guidance. Given the strength of the bidding pipeline in the majority of the categories, the business anticipates a high order intake.The brokerage has maintained its previous target price of  ₹1,340 but has revised its rating for Ahluwalia Contracts India stock from 'hold' to 'buy'.“We changed our rating from HOLD to BUY based on a robust business outlook and the recent correction in the stock price,” said Axis Securities in its report.The brokerage provides recommendations based on the robustness of the order book, new order intake, and the financial position. Let's examine each of these criteria more closely.The business has an order book of  ₹16,846 crore as of right now, the brokerage claims. Public and private entries are split evenly in the order book. With this background, revenue visibility over the next three to four years is provided by the existing order book. Forecast revenue increase in FY25 and FY26 is expected to be in the high double digits.The business has received  ₹6,600 crore in orders so far in FY25. By FY25, the company hopes to get further orders worth between  ₹3,500 and  ₹4,000 crore. The pipeline for bids is still robust and is being driven by private projects. By putting in bids for projects like metros, airport buildings, and urban infrastructure, the corporation has expanded its portfolio. The brokerage stated that because most of these orders are item-based, it anticipates more traction in private orders with greater margins and better project execution.“We therefore pencil in faster project execution moving ahead as 50% of the current executable order book is from the private side,” the brokerage said.As per the brokerage firm, the firm demonstrates a solid financial standing, as evidenced by its lack of net debt, strong cash reserves (approximately 9% of market capitalisation), and impressive return on investment ratios.“We expect its Revenue/EBITDA/APAT to grow at a CAGR of 21%/26%/33% respectively over FY24-26E. The stock is currently trading at 19x FY26E EPS. We value Ahluwalia Contracts at 22xFY26E EPS to arrive at a target price of  ₹1,340/share, implying an upside of 13% from the CMP,” said Axis Securities in its report.","cleaned_content":"ahluwalia contracts india possesses a strong and diverse order book providing a solid revenue outlook for the next \u003cTHREE_\u003e \u003cFOUR_\u003e years additionally the company is benefitting from positive government emphasis on infrastructure development and the resurgence of private investment which bodes well for its future according to axis securities in its latest report after meeting with the companys management the brokerage also stated that high double digit revenue growth is anticipated in fy25 and fy26 according to managements guidance given the strength of the bidding pipeline in the majority of the categories the business anticipates a high order intake the brokerage has maintained its previous target price of \u003cONE_THOUSAND\u003e but has revised its rating for ahluwalia contracts india stock from hold to buy we changed our rating from hold to buy based on a robust business outlook and the recent correction in the stock price said axis securities in its report the brokerage provides recommendations based on the robustness of the order book new order intake and the financial position lets examine each of these criteria more closely the business has an order book of \u003cONE_TEN_THOUSAND\u003e crore as of right now the brokerage claims public and private entries are split evenly in the order book with this background revenue visibility over the next three to four years is provided by the existing order book forecast revenue increase in fy25 and fy26 is expected to be in the high double digits the business has received \u003cSIX_THOUSAND\u003e crore in orders so far in fy25 by fy25 the company hopes to get further orders worth between \u003cTHREE_THOUSAND\u003e and \u003cFOUR_THOUSAND\u003e crore the pipeline for bids is still robust and is being driven by private projects by putting in bids for projects like metros airport buildings and urban infrastructure the corporation has expanded its portfolio the brokerage stated that because most of these orders are item based it anticipates more traction in private orders with greater margins and better project execution we therefore pencil in faster project execution moving ahead as \u003cFIVE_TEN_PERCENT\u003e of the current executable order book is from the private side the brokerage said as per the brokerage firm the firm demonstrates a solid financial standing as evidenced by its lack of net debt strong cash reserves approximately \u003cNINE_PERCENT\u003e of market capitalisation and impressive return on investment ratios we expect its revenue ebitda apat to grow at a cagr of \u003cTWO_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e respectively over fy24 \u003cTWO_TEN\u003e e the stock is currently trading at \u003cONE_TEN\u003e x fy26e eps we value ahluwalia contracts at \u003cTWO_TEN\u003e xfy26e eps to arrive at a target price of \u003cONE_THOUSAND\u003e share implying an upside of \u003cONE_TEN_PERCENT\u003e from the cmp said axis securities in its report","timestamp":"2024-09-17T16:55:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}