{"url":"https://www.livemint.com/market/stock-market-news/trafiksol-its-technologies-market-debut-postponed-due-to-undisclosed-queries-bse-informs-on-x-11726545043012.html","title":"Trafiksol ITS Technologies market debut postponed due to undisclosed queries, BSE informs on X","description":"TrafikSol IPO, valued at  ₹45 crore, saw overwhelming demand, with subscriptions reaching 345.65 times. The listing set for September 17, 2024, has been postponed due to undisclosed queries.","content":"Trafiksol ITS Technologies IPO listing: Shares of Trafiksol ITS Technologies, which were supposed to make their D-Street debut on the bourses today, September 17, 2024 on BSE SME has been posponed.“The listing of equity shares of Trafiksol ITS Technologies Limited for September 17, 2024 has been postponed till certain queries that have been raised are resolved by the issuer. Market participants are requested to please make note,” BSE said in a post on X (formerly Twitter).However, the reason for this delay has not been disclosed by the exchange.The initial public offering (IPO) of TrafikSol ITS Technologies, valued at approximately  ₹45 crore, was open for subscription from September 10 to September 12, 2024, with a price range of  ₹66-70 per share.During the three-day bidding period, the IPO saw overwhelming demand, receiving a total subscription of 345.65 times. Investors placed bids for 147.45 crore equity shares against the 42.66 lakh shares available. The retail category was subscribed 317.66 times, while the Non-Institutional Investor (NII) quota reached 699.40 times. The Qualified Institutional Buyer (QIB) portion also saw strong interest, with 129.22 times subscriptions.The SME IPO consisted of a fresh issue of 64.1 lakh shares. The company plans to use the proceeds for software purchases, partial or full repayment of certain borrowings, working capital requirements, and general corporate purposes.Retail investors were required to apply for a minimum of 2,000 shares, with an investment of  ₹140,000. High Net-Worth Individuals (HNIs) needed to apply for at least two lots (4,000 shares), totaling  ₹280,000.Ekadrisht Capital Private Limited acted as the book-running lead manager, Maashitla Securities Private Limited was the registrar, and Ss Corporate Securities was the market maker for the IPO.TrafikSol ITS Technologies Limited, founded in 2018, specializes in intelligent transportation systems (ITS) and automation solutions. The company offers a range of services, including software development, consulting, and delivery. TrafikSol provides both ready-made and custom software solutions for various platforms, such as operating systems, business applications, and computer games, with a focus on analyzing user needs to create tailored solutions and provide ongoing support.As an EPC (Engineering, Procurement, and Construction) firm, TrafikSol handles projects related to Advanced Traffic Management Systems (ATMS), Toll Management Systems (TMS), and Tunnel Management Systems.Financially, TrafikSol has demonstrated strong performance, with an 80% revenue growth and a 153% increase in profit after tax (PAT) for the financial year ending March 31, 2024, compared to the previous year.","cleaned_content":"trafiksol its technologies ipo listing shares of trafiksol its technologies which were supposed to make their d street debut on the bourses today september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on bse sme has been posponed the listing of equity shares of trafiksol its technologies limited for september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e has been postponed till certain queries that have been raised are resolved by the issuer market participants are requested to please make note bse said in a post on x formerly twitter however the reason for this delay has not been disclosed by the exchange the initial public offering ipo of trafiksol its technologies valued at approximately \u003cFOUR_TEN\u003e crore was open for subscription from september \u003cONE_TEN\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with a price range of \u003cSIX_TEN\u003e \u003cSEVEN_TEN\u003e per share during the three day bidding period the ipo saw overwhelming demand receiving a total subscription of \u003cTHREE_HUNDRED\u003e times investors placed bids for \u003cONE_HUNDRED\u003e crore equity shares against the \u003cFOUR_TEN\u003e lakh shares available the retail category was subscribed \u003cTHREE_HUNDRED\u003e times while the non institutional investor nii quota reached \u003cSIX_HUNDRED\u003e times the qualified institutional buyer qib portion also saw strong interest with \u003cONE_HUNDRED\u003e times subscriptions the sme ipo consisted of a fresh issue of \u003cSIX_TEN\u003e lakh shares the company plans to use the proceeds for software purchases partial or full repayment of certain borrowings working capital requirements and general corporate purposes retail investors were required to apply for a minimum of \u003cTWO_THOUSAND\u003e shares with an investment of \u003cONE_HUNDRED_THOUSAND\u003e high net worth individuals hnis needed to apply for at least two lots \u003cFOUR_THOUSAND\u003e shares totaling \u003cTWO_HUNDRED_THOUSAND\u003e ekadrisht capital private limited acted as the book running lead manager maashitla securities private limited was the registrar and ss corporate securities was the market maker for the ipo trafiksol its technologies limited founded in \u003cTWO_THOUSAND\u003e specializes in intelligent transportation systems its and automation solutions the company offers a range of services including software development consulting and delivery trafiksol provides both ready made and custom software solutions for various platforms such as operating systems business applications and computer games with a focus on analyzing user needs to create tailored solutions and provide ongoing support as an epc engineering procurement and construction firm trafiksol handles projects related to advanced traffic management systems atms toll management systems tms and tunnel management systems financially trafiksol has demonstrated strong performance with an \u003cEIGHT_TEN_PERCENT\u003e revenue growth and a \u003cONE_HUNDRED_PERCENT\u003e increase in profit after tax pat for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to the previous year","timestamp":"2024-09-17T09:34:00+05:30","market_timestamp":"2024-09-17T09:34:00+05:30","off_market_hours":false}