{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-us-fed-rate-cut-impact-five-stocks-to-buy-or-sell-on-friday-sept-20-11726742118524.html","title":"Stock market today: Trade setup for Nifty 50 to US Fed rate cut impact, five stocks to buy or sell on Friday — Sept 20","description":"Stock Market today: Nifty-50 index and the Sensex though hit record highs on Thursday, however, ended lower with gains of 0.15% and 0.29%","content":"Stock Market Today: Enthused by the 50 bps rate cut announced by the US Federal Reserve, the benchmark Nifty-50 index and the S\u0026P BSE Sensex, though hitting record highs, ended lower with gains of 0.15% and 0.29%, respectively, at 25,415.80 and 83,184.80.The US rate cut increased hopes of policy easing in India, driving the Nifty Bank Index to 53037.60, up 0.54%. Auto, realty, FMCG, and consumer durables were also gainers, but others, such as IT, Metals, and Oil and gas, ended lower on Thursday. The higher-than-expected rate cuts also sparked concerns over a global slowdown, and hence, the Nifty Midcap 100 and Small Cap 100 index saw asharper decline of 0.67% to 1.27%.Nagaraj Shetti, senior technical research analyst at HDFC Securities, said the new highs in the afternoon triggered sharp intraday weakness.A small negative candle formed on the daily chart  is indicating high volatility in the market, added ShettiThe short-term trend of Nifty remains positive, with range-bound action. Any dips down to support of 25200-25100 are expected to be buying opportunities. A decisive move above 25500 levels could pull Nifty towards higher targets.Bank Nifty concluded the day on a positive note at 53,038 levels. Technically, the index has formed a shooting star candlestick pattern on a daily scale, indicating a decrease in buying interest, said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Intermediates Ltd.Until the index crosses 53,350 levels, a \"Sell on rise\" strategy should be adopted in Bank Nifty for the short-term traders, said Yedve.While the US Fed policy is out, investors will watch for the other three central banks' outcomes, namely BOJ, BOE, and China, said Siddhartha Khemka at Motilal Oswal Financial Services, who expects the market to stay in a range with positive bias.The immediate market response, as per Pradeep Gupta, Co-founder and vice-chairman of Anand Rathi Group, will depend on whether investors view the rate cut as a sign of economic stabilization or a signal that the Fed is struggling to keep inflation under control.From a global perspective, this rate cut could provide short-term benefits to India, including a stronger rupee and potential capital inflowsSumeet Bagadia, Executive Director at Choice Broking has recommended two stock picks for Tuesday, while another three picks are by Ganesh Dongre, Senior Manager of technical Research at Anand Rathi.The picks by these two experts include Bikaji Foods International Ltd, Campus Activewear Ltd, ICICI Bankd Ltd, Rashtriya Chemicals and Fertilizers Ltd (RCF) and State Bank of India (SBI)1.Bikaji Foods International Ltd- Sumeet Bagadia recommends buying Bikaji Foods International Ltd at  ₹932.65 with stop loss at  ₹888 for a target price of  ₹985Bikaji feed has recently exhibited a robust breakout from the critical resistance zone of 833-880 on the daily chart, consolidating the move with higher highs and higher lows. This breakout is supported by a notable increase in trading volume, indicating strong bullish sentiment2. Campus Activewear Ltd- Bagadia recommend buying Campus Activewear Ltd at  ₹350.35 keeping stop loss at  ₹338 for a target price of  ₹370Campus daily chart analysis offers a favorable view for the following week, indicating a steady higher advance. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.3.  ICICI Bank Ltd-  Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi recommend buying ICICI Bank Ltd at  ₹1292 keeping a stoploss. at  ₹1260 for a target of  ₹1325The stock found a substantial support level at Rs.1260, marking a crucial juncture in its recent trading. Presently, at Rs. 1292, the stock has demonstrated a definitive price-action reversal, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at Rs.1260. The anticipated target for this trade is Rs.1325, representing the next significant resistance level. This strategy positions traders favorably to capitalize on the stock's anticipated rally in the weeks ahead, said Dongre4. Rashtriya Chemicals and Fertilizers Ltd (RCF)- Dongre recommend buying Rashtriya Chemicals and Fertilizers Ltd (RCF) at  ₹187 keeping a Stop loss at 180 for target of  ₹195.A notable bullish reversal pattern has emerged in the stock's recent short-term trend analysis. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 195. At present, the stock is maintaining a crucial support level at Rs.180. Given the current market price of Rs.187, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 1955. State Bank of India (SBI)- Dongre recommends buying State Bank of India (SBI) at  ₹792 with stop loss at  ₹770 for atarget price of  ₹810On the daily chart of this stock, a breakout at the Rs.792 price level has been observed, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 770 is recommended. The target price for this strategy is Rs. 810 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"stock market today enthused by the \u003cFIVE_TEN\u003e bps rate cut announced by the us federal reserve the benchmark nifty \u003cFIVE_TEN\u003e index and the s p bse sensex though hitting record highs ended lower with gains of \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively at \u003cTWO_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e the us rate cut increased hopes of policy easing in india driving the nifty bank index to \u003cFIVE_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e auto realty fmcg and consumer durables were also gainers but others such as it metals and oil and gas ended lower on thursday the higher than expected rate cuts also sparked concerns over a global slowdown and hence the nifty midcap \u003cONE_HUNDRED\u003e and small cap \u003cONE_HUNDRED\u003e index saw asharper decline of \u003cZERO_PERCENT\u003e to \u003cONE_PERCENT\u003e nagaraj shetti senior technical research analyst at hdfc securities said the new highs in the afternoon triggered sharp intraday weakness a small negative candle formed on the daily chart is indicating high volatility in the market added shettithe short term trend of nifty remains positive with range bound action any dips down to support of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e are expected to be buying opportunities a decisive move above \u003cTWO_TEN_THOUSAND\u003e levels could pull nifty towards higher targets bank nifty concluded the day on a positive note at \u003cFIVE_TEN_THOUSAND\u003e levels technically the index has formed a shooting star candlestick pattern on a daily scale indicating a decrease in buying interest said hrishikesh yedve avp technical and derivatives research at asit c mehta investment intermediates ltd until the index crosses \u003cFIVE_TEN_THOUSAND\u003e levels a sell on rise strategy should be adopted in bank nifty for the short term traders said yedve while the us fed policy is out investors will watch for the other three central banks outcomes namely boj boe and china said siddhartha khemka at motilal oswal financial services who expects the market to stay in a range with positive bias the immediate market response as per pradeep gupta co founder and vice chairman of anand rathi group will depend on whether investors view the rate cut as a sign of economic stabilization or a signal that the fed is struggling to keep inflation under control from a global perspective this rate cut could provide short term benefits to india including a stronger rupee and potential capital inflowssumeet bagadia executive director at choice broking has recommended two stock picks for tuesday while another three picks are by ganesh dongre senior manager of technical research at anand rathi the picks by these two experts include bikaji foods international ltd campus activewear ltd icici bankd ltd rashtriya chemicals and fertilizers ltd rcf and state bank of india sbi \u003cONE_\u003e bikaji foods international ltd sumeet bagadia recommends buying bikaji foods international ltd at \u003cNINE_HUNDRED\u003e with stop loss at \u003cEIGHT_HUNDRED\u003e for a target price of \u003cNINE_HUNDRED\u003e bikaji feed has recently exhibited a robust breakout from the critical resistance zone of \u003cEIGHT_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e on the daily chart consolidating the move with higher highs and higher lows this breakout is supported by a notable increase in trading volume indicating strong bullish sentiment2 campus activewear ltd bagadia recommend buying campus activewear ltd at \u003cTHREE_HUNDRED\u003e keeping stop loss at \u003cTHREE_HUNDRED\u003e for a target price of \u003cTHREE_HUNDRED\u003e campus daily chart analysis offers a favorable view for the following week indicating a steady higher advance notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 3 icici bank ltd ganesh dongre senior manager of technical research at anand rathi recommend buying icici bank ltd at \u003cONE_THOUSAND\u003e keeping a stoploss at \u003cONE_THOUSAND\u003e for a target of \u003cONE_THOUSAND\u003e the stock found a substantial support level at rs 1260 marking a crucial juncture in its recent trading presently at rs \u003cONE_THOUSAND\u003e the stock has demonstrated a definitive price action reversal suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at rs 1260 the anticipated target for this trade is rs 1325 representing the next significant resistance level this strategy positions traders favorably to capitalize on the stocks anticipated rally in the weeks ahead said dongre4 rashtriya chemicals and fertilizers ltd rcf dongre recommend buying rashtriya chemicals and fertilizers ltd rcf at \u003cONE_HUNDRED\u003e keeping a stop loss at \u003cONE_HUNDRED\u003e for target of \u003cONE_HUNDRED\u003e a notable bullish reversal pattern has emerged in the stocks recent short term trend analysis this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cONE_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 180 given the current market price of rs 187 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cONE_THOUSAND\u003e state bank of india sbi dongre recommends buying state bank of india sbi at \u003cSEVEN_HUNDRED\u003e with stop loss at \u003cSEVEN_HUNDRED\u003e for atarget price of \u003cEIGHT_HUNDRED\u003e on the daily chart of this stock a breakout at the rs 792 price level has been observed signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cSEVEN_HUNDRED\u003e is recommended the target price for this strategy is rs \u003cEIGHT_HUNDRED\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-09-20T09:00:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}