{"url":"https://www.livemint.com/market/stock-market-news/indian-markets-to-sustain-high-valuations-says-mosl-growth-stocks-to-command-premiums-as-value-sectors-struggle-11726481607154.html","title":"Indian markets to sustain high valuations, says MOSL; growth stocks to command premiums as value sectors struggle","description":"Motilal Oswal reports that despite elevated market valuations, growth outlook remains positive, supporting momentum. Concentrated earnings growth may lead high-growth companies to command premiums, while value sectors might struggle.","content":"In a recent report, Motilal Oswal (MOSL) highlighted the market's strong performance over the past period, noting that valuations are currently higher than long-term averages in most sectors. Despite these elevated valuations, MOSL believes they will likely sustain due to a higher growth outlook.According to MOSL, a mere 1 per cent increase in earnings growth over a decade can boost valuations by 5 per cent. The brokerage emphasised that as long as growth remains positive, the market will maintain its momentum.While India Inc. continues to maintain a largely positive outlook, even though recent earnings seasons have shown a drop in profit growth rates, MOSL observed that the IT and banking sectors, which together represent nearly 50 per cent of the index weight, are expected to deliver earnings growth lower than the index average. Earnings growth, widespread across sectors in the past, is now becoming more concentrated, meaning the companies that achieve growth will stand out. The brokerage believes that without significant growth, sustaining the momentum that value stocks, which has performed well for over four years, may be nearing its end.As earnings growth becomes restricted to a smaller portion of the market, the brokerage noted that companies with high, sustainable growth will begin to command a premium over others. Its portfolios are positioned with companies focused on sustainable growth, reflecting its belief that the market follows earnings growth. MOSL further pointed out that the latest results delivered a 2 per cent miss compared to expectations of a 2 per cent decline in profit after tax (PAT), with downgrades outpacing upgrades.The brokerage further emphasised that the period of high-profit growth is likely behind us. Moving forward, companies delivering higher growth will likely command a premium over others. This shift may also signal the end of the market’s value phase, particularly for sectors with lower growth potential.The recent weakening of the Chinese market, which had shown strength from February to mid-May, has also played a role in market dynamics. The earlier strength in China had drawn foreign portfolio investment (FPI) liquidity away from other markets, including India. As the Chinese market declined by 10-15 per cent from its peak in May, India began seeing consistent FPI inflows again.These strong domestic flows have helped maintain market stability and, combined with FPI buying, have contributed to positive momentum. Over the past three months, the Indian market has performed relatively well. Additionally, it added that FPI flows into debt markets have picked up, further supporting the market.MOSL also discussed the potential impact of the upcoming U.S. elections, noting that a regime change could influence the market in several ways. A Republican candidate is expected to prioritize increasing U.S. oil production, which could exert downward pressure on global oil prices. Lower oil prices would benefit Indian manufacturing margins, given that India is the largest oil-importing country. The Republican candidate has also expressed support for a negotiated end to the Russia-Ukraine war, which, if it occurs, could further reduce oil prices by eliminating the war’s risk premium.However, MOSL expects ongoing geopolitical risks, such as China's threat to India’s borders and tensions surrounding Taiwan. The firm expects global defence spending to remain high for years despite the possibility of a resolution to the Russia-Ukraine conflict. Furthermore, MOSL also touched on the issue of semiconductors, noting that while strong anti-China sentiment is benefiting Indian manufacturing, the Republican candidate is known as a dealmaker. This could potentially lead to a softening of the anti-China stance in semiconductors, which could benefit stocks from the current geopolitical tensions. However, MOSL believes any cooperation would likely be limited to specific sectors, and the overall trend of disengagement from China would continue.MOSL’s analysis suggests that while sectoral leadership may change and valuation corrections may occur, the Indian market remains well-positioned for continued growth. Companies delivering higher earnings growth will likely command a premium, while value sectors may face challenges maintaining momentum. The firm sees the overall outlook as positive, with investors benefiting from domestic and foreign inflows.","cleaned_content":"in a recent report motilal oswal mosl highlighted the markets strong performance over the past period noting that valuations are currently higher than long term averages in most sectors despite these elevated valuations mosl believes they will likely sustain due to a higher growth outlook according to mosl a mere \u003cONE_PERCENT\u003e increase in earnings growth over a decade can boost valuations by \u003cFIVE_PERCENT\u003e the brokerage emphasised that as long as growth remains positive the market will maintain its momentum while india inc continues to maintain a largely positive outlook even though recent earnings seasons have shown a drop in profit growth rates mosl observed that the it and banking sectors which together represent nearly \u003cFIVE_TEN_PERCENT\u003e of the index weight are expected to deliver earnings growth lower than the index average earnings growth widespread across sectors in the past is now becoming more concentrated meaning the companies that achieve growth will stand out the brokerage believes that without significant growth sustaining the momentum that value stocks which has performed well for over four years may be nearing its end as earnings growth becomes restricted to a smaller portion of the market the brokerage noted that companies with high sustainable growth will begin to command a premium over others its portfolios are positioned with companies focused on sustainable growth reflecting its belief that the market follows earnings growth mosl further pointed out that the latest results delivered a \u003cTWO_PERCENT\u003e miss compared to expectations of a \u003cTWO_PERCENT\u003e decline in profit after tax pat with downgrades outpacing upgrades the brokerage further emphasised that the period of high profit growth is likely behind us moving forward companies delivering higher growth will likely command a premium over others this shift may also signal the end of the market s value phase particularly for sectors with lower growth potential the recent weakening of the chinese market which had shown strength from february to mid may has also played a role in market dynamics the earlier strength in china had drawn foreign portfolio investment fpi liquidity away from other markets including india as the chinese market declined by \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e from its peak in may india began seeing consistent fpi inflows again these strong domestic flows have helped maintain market stability and combined with fpi buying have contributed to positive momentum over the past three months the indian market has performed relatively well additionally it added that fpi flows into debt markets have picked up further supporting the market mosl also discussed the potential impact of the upcoming u s elections noting that a regime change could influence the market in several ways a republican candidate is expected to prioritize increasing u s oil production which could exert downward pressure on global oil prices lower oil prices would benefit indian manufacturing margins given that india is the largest oil importing country the republican candidate has also expressed support for a negotiated end to the russia ukraine war which if it occurs could further reduce oil prices by eliminating the war s risk premium however mosl expects ongoing geopolitical risks such as chinas threat to india s borders and tensions surrounding taiwan the firm expects global defence spending to remain high for years despite the possibility of a resolution to the russia ukraine conflict furthermore mosl also touched on the issue of semiconductors noting that while strong anti china sentiment is benefiting indian manufacturing the republican candidate is known as a dealmaker this could potentially lead to a softening of the anti china stance in semiconductors which could benefit stocks from the current geopolitical tensions however mosl believes any cooperation would likely be limited to specific sectors and the overall trend of disengagement from china would continue mosl s analysis suggests that while sectoral leadership may change and valuation corrections may occur the indian market remains well positioned for continued growth companies delivering higher earnings growth will likely command a premium while value sectors may face challenges maintaining momentum the firm sees the overall outlook as positive with investors benefiting from domestic and foreign inflows","timestamp":"2024-09-16T16:53:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}