{"url":"https://www.livemint.com/market/stock-market-news/axis-bank-on-sebi-order-against-subsidiary-only-for-new-merchant-assignments-other-biz-ops-unaffected-11726825446874.html","title":"Axis Bank on SEBI order against subsidiary: ‘Only for new merchant assignments, other biz ops unaffected’","description":"Axis Bank clarified that the SEBI order against its subsidiary, Axis Capital, would not affect the private lender's regular business operations.","content":"Axis Bank clarified on Friday, September 20, that the temporary restrictions placed on its wholly-owned subsidiary Axis Capital Ltd (ACL) by capital markets regulator Securities and Exchange Board of India (SEBI) would not impact the private lender's regular business operations. SEBI restrained ACL from taking up new assignments as a debt merchant banker till further orders.Axis Capital Ltd said it is exploring legal remedies against market regulator SEBI's order. In a statement, the company clarified that SEBI had not imposed any other restrictions on Axis Capital Ltd, and it will continue to operate all other business activities in the ordinary course across equity capital markets, infrastructure investment trusts (InvITs), real estate investment trusts (REITs), M\u0026A, private equity, and institutional equities.Also Read: SEBI bars Axis Capital from acting as debt merchant banker till further ordersOn Thursday, the market regulator, in an interim ruling, prohibited Axis Capital from taking up any new assignments as a merchant banker, arranger, or underwriter for any issue or offer for sale of securities in the debt segment. This restriction will remain in place until further orders.The SEBI's interim order came amid allegations that ACL extended itself beyond the permissible activities of a merchant banker while dealing with the issue of Sojo Infotel's listed non-convertible debentures (NCDs).Also Read: JM Financial sets record target price for Axis Bank, projects 17% upsideSEBI noted that ACL provided a guarantee/indemnity towards the redemption of NCDs in the guise of underwriting, which it was not permitted to do under the existing regulatory framework. Such activity posed a risk to the financial system as it could disrupt the market's orderly functioning.“It was thus noted that in the instant case, ACL went beyond the mandate of issue management, as the activity undertaken by ACL was in contravention of the definition of underwriting and role of merchant banker as defined in MB Regulations, 1992,\" SEBI noted in its order.SEBI initiated action against ACL after a research analyst's report titled ‘Is Axis Capital an Investment Bank or a Hedge Fund?’ was published. The regulator was examining the transaction undertaken by ACL regarding listed NCDs of Sojo Infotel Pvt. Ltd, a high-technology consultancy service provider.Also Read: SEBI's proposed changes can spruce up investment advisory regulationsAxis Capital clarified that it has not taken on any new assignments in the debt segment for over a year. Additionally, the revenue generated from its debt business in FY 2023-24 accounted for only five per cent of the company's total income.\"Based on the merits of the case and prevailing laws, Axis Capital is currently evaluating all available legal remedies regarding Sebi's interim order,\" the company said in a statement. The firm further emphasised its commitment to compliance, risk management, and client interests.\"ACL believes in ensuring the highest standard of compliance with the extant regulations and is committed to adhering with all legal and regulatory requirements at all points in time. ACL has a robust business pipeline and will continue to deliver best-in-class execution for our clients,\" it added.","cleaned_content":"axis bank clarified on friday september \u003cTWO_TEN\u003e that the temporary restrictions placed on its wholly owned subsidiary axis capital ltd acl by capital markets regulator securities and exchange board of india sebi would not impact the private lenders regular business operations sebi restrained acl from taking up new assignments as a debt merchant banker till further orders axis capital ltd said it is exploring legal remedies against market regulator sebis order in a statement the company clarified that sebi had not imposed any other restrictions on axis capital ltd and it will continue to operate all other business activities in the ordinary course across equity capital markets infrastructure investment trusts invits real estate investment trusts reits m a private equity and institutional equities also read sebi bars axis capital from acting as debt merchant banker till further orderson thursday the market regulator in an interim ruling prohibited axis capital from taking up any new assignments as a merchant banker arranger or underwriter for any issue or offer for sale of securities in the debt segment this restriction will remain in place until further orders the sebis interim order came amid allegations that acl extended itself beyond the permissible activities of a merchant banker while dealing with the issue of sojo infotels listed non convertible debentures ncds also read jm financial sets record target price for axis bank projects \u003cONE_TEN_PERCENT\u003e upsidesebi noted that acl provided a guarantee indemnity towards the redemption of ncds in the guise of underwriting which it was not permitted to do under the existing regulatory framework such activity posed a risk to the financial system as it could disrupt the markets orderly functioning it was thus noted that in the instant case acl went beyond the mandate of issue management as the activity undertaken by acl was in contravention of the definition of underwriting and role of merchant banker as defined in mb regulations \u003cONE_THOUSAND\u003e sebi noted in its order sebi initiated action against acl after a research analysts report titled is axis capital an investment bank or a hedge fund was published the regulator was examining the transaction undertaken by acl regarding listed ncds of sojo infotel pvt ltd a high technology consultancy service provider also read sebis proposed changes can spruce up investment advisory regulationsaxis capital clarified that it has not taken on any new assignments in the debt segment for over a year additionally the revenue generated from its debt business in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e accounted for only five per cent of the companys total income based on the merits of the case and prevailing laws axis capital is currently evaluating all available legal remedies regarding sebis interim order the company said in a statement the firm further emphasised its commitment to compliance risk management and client interests acl believes in ensuring the highest standard of compliance with the extant regulations and is committed to adhering with all legal and regulatory requirements at all points in time acl has a robust business pipeline and will continue to deliver best in class execution for our clients it added","timestamp":"2024-09-20T15:18:00+05:30","market_timestamp":"2024-09-20T15:18:00+05:30","off_market_hours":false}