{"url":"https://www.livemint.com/market/stock-market-news/facts-will-be-taken-on-board-nirmala-sithraman-on-hindenburgs-salvo-against-sebi-chief-madhabi-puri-buch-11726496062804.html","title":"‘Facts will be taken on board’: Nirmala Sitharaman on Hindenburg’s salvo against Sebi chief Madhabi Puri Buch","description":"‘I think a few of the allegations are being answered by the Buchs. Putting out facts to contradict allegations by Congress, I think the facts are to be taken on board,’ FM Sitharaman said.","content":"Finance Minister Nirmala Sitharaman on Monday addressed the ongoing controversy involving Securities and Exchange Board of India (SEBI) Chairperson Madhabi Puri Buch over alleged conflict of interest for the first time. Sitharaman said that Buch and her husband, Dhaval Buch, were responding to several allegations against them with factual clarifications.“I think a few of the allegations are being answered by the Buchs. Putting out facts to contradict allegations by Congress, I think the facts are to be taken on board,\" FM Sitharaman said in an interview with News18.Madhabi Buch and her husband, Dhaval Buch, addressed concerns raised by the opposition Congress regarding payments received from her former employer, ICICI Bank, while she served as a whole-time member of SEBI. This marks their second statement following allegations from US-based short seller Hindenburg Research, which claimed that Buch lacked the motivation to address allegations against the Adani group due to potential conflicts of interest.In their statement, the Buchs clarified that Madhabi Buch never handled any files related to Agora Advisory and Agora Partners—firms in which she holds a 99 per cent stake and continues to earn revenue even after joining SEBI in 2017.During a press conference at the All India Congress Committee (AICC) headquarters, Congress spokesperson Pawan Khera alleged that between 2017 and 2023, Buch traded in listed securities worth  ₹36.9 crore while serving as a whole-time member and later as chairperson of SEBI.This is in violation of Section 6 of the SEBI’s Code on Conflict of Interest for the Members of Board (2008), he said.He also provided a year-wise breakdown of the total trading in securities, which amounted to over  ₹36.9 crore.“We have information that between 2017 and 2021, Madhabi Buch held foreign assets. We hereby ask: When was the first time she declared the foreign assets and to which agency of the government? Is it true that Ms. Madhabi P. Buch was actively involved in Agora Partners PTE (Singapore) as she was a signatory to the bank account?\" Khera said.","cleaned_content":"finance minister nirmala sitharaman on monday addressed the ongoing controversy involving securities and exchange board of india sebi chairperson madhabi puri buch over alleged conflict of interest for the first time sitharaman said that buch and her husband dhaval buch were responding to several allegations against them with factual clarifications i think a few of the allegations are being answered by the buchs putting out facts to contradict allegations by congress i think the facts are to be taken on board fm sitharaman said in an interview with news18 madhabi buch and her husband dhaval buch addressed concerns raised by the opposition congress regarding payments received from her former employer icici bank while she served as a whole time member of sebi this marks their second statement following allegations from us based short seller hindenburg research which claimed that buch lacked the motivation to address allegations against the adani group due to potential conflicts of interest in their statement the buchs clarified that madhabi buch never handled any files related to agora advisory and agora partners firms in which she holds a \u003cNINE_TEN_PERCENT\u003e stake and continues to earn revenue even after joining sebi in \u003cTWO_THOUSAND\u003e during a press conference at the all india congress committee aicc headquarters congress spokesperson pawan khera alleged that between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e buch traded in listed securities worth \u003cTHREE_TEN\u003e crore while serving as a whole time member and later as chairperson of sebi this is in violation of section \u003cSIX_\u003e of the sebi s code on conflict of interest for the members of board \u003cTWO_THOUSAND\u003e he said he also provided a year wise breakdown of the total trading in securities which amounted to over \u003cTHREE_TEN\u003e crore we have information that between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e madhabi buch held foreign assets we hereby ask when was the first time she declared the foreign assets and to which agency of the government is it true that ms madhabi p buch was actively involved in agora partners pte singapore as she was a signatory to the bank account khera said","timestamp":"2024-09-16T19:50:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}