{"url":"https://www.livemint.com/market/stock-market-news/rs-50-smallcap-stock-kamdhenu-ventures-hits-new-high-after-mauritius-based-fiis-acquire-stake-11726206658376.html","title":"₹50 smallcap stock: Kamdhenu Ventures hits new high after Mauritius-based FIIs acquire stake","description":"Kamdhenu Ventures' shares rose after FIIs acquired stakes at  ₹51 each, reaching a record high of  ₹51.59. The stock surged over 90 percent from its 52-week low and gained 52 percent in the past year, driven by strong demand and expansion plans.","content":"Shares of Kamdhenu Ventures were in focus after Mauritius-based FIIs Al Maha Investment Fund and Unico Global Opportunities Fund Limited acquired stakes in the company at an average price of  ₹51 per share.The stock rose a little over 1 percent to hit its record high of  ₹51.59 in intra-day trading on September 13. It has now surged over 90 percent from its 52-week low of 27.12, recorded in October last year. The stock jumped 52 percent in the last one year and over 50 percent in 2024 YTD.The smallcap stock gained over 18 percent in September so far, extending gains for the fourth straight month. It rose 7.3 percent in August, 1 percent in July, and 21 percent in June.Prior to these gains, the stock fell 13.5 percent in May after a 14.2 percent rise in April. It also saw corrections in February and March, dropping 15.2 percent and 12.4 percent, respectively. Meanwhile, in January, it was up 31.2 percent.Kamdhenu Paints, a subsidiary of Kamdhenu Ventures, recently announced plans to expand its premium product line with the introduction of a new Wood Coatings range adhering to international quality standards. The launch, scheduled for October 2024, aims to solidify Kamdhenu Paints' position as a leader in premium coatings solutions.To meet growing demand, Kamdhenu Paints increased its production capacity from 36,000 kilolitres per year to 49,000 kilolitres. The company is also aggressively expanding its network of tinting machines to improve accessibility for customers.Established in 2008, Kamdhenu Paints is known for its innovation in the decorative paint industry. Its R\u0026D team developed the Dual Emulsions Series, a cost-effective solution embraced by dealers and contractors. The company is also expanding its operations, with a new office in Gurugram, Haryana, to support its growth initiatives.Kamdhenu Paints offers a wide range of products, including emulsions, wood finishes, and designer paints, aiming to be a one-stop shop for customers' construction needs. With 40+ SKUs, 34 sales depots, and a dealer network of 4,300+, Kamdhenu's products are available nationwide.Committed to sustainability, Kamdhenu Paints has introduced water-based, eco-friendly paints with low VOCs. Backed by modern automation and state-of-the-art manufacturing facilities, the company strives to deliver top-quality products while minimising its environmental impact.As the company continues to grow, its robust fundamentals and steady growth trends suggest a further upside potential for shareholders.","cleaned_content":"shares of kamdhenu ventures were in focus after mauritius based fiis al maha investment fund and unico global opportunities fund limited acquired stakes in the company at an average price of \u003cFIVE_TEN\u003e per share the stock rose a little over \u003cONE_PERCENT\u003e to hit its record high of \u003cFIVE_TEN\u003e in intra day trading on september \u003cONE_TEN\u003e it has now surged over \u003cNINE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_TEN\u003e recorded in october last year the stock jumped \u003cFIVE_TEN_PERCENT\u003e in the last one year and over \u003cFIVE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd the smallcap stock gained over \u003cONE_TEN_PERCENT\u003e in september so far extending gains for the fourth straight month it rose \u003cSEVEN_PERCENT\u003e in august \u003cONE_PERCENT\u003e in july and \u003cTWO_TEN_PERCENT\u003e in june prior to these gains the stock fell \u003cONE_TEN_PERCENT\u003e in may after a \u003cONE_TEN_PERCENT\u003e rise in april it also saw corrections in february and march dropping \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively meanwhile in january it was up \u003cTHREE_TEN_PERCENT\u003e kamdhenu paints a subsidiary of kamdhenu ventures recently announced plans to expand its premium product line with the introduction of a new wood coatings range adhering to international quality standards the launch scheduled for october \u003cTWO_THOUSAND\u003e aims to solidify kamdhenu paints position as a leader in premium coatings solutions to meet growing demand kamdhenu paints increased its production capacity from \u003cTHREE_TEN_THOUSAND\u003e kilolitres per year to \u003cFOUR_TEN_THOUSAND\u003e kilolitres the company is also aggressively expanding its network of tinting machines to improve accessibility for customers established in \u003cTWO_THOUSAND\u003e kamdhenu paints is known for its innovation in the decorative paint industry its r d team developed the dual emulsions series a cost effective solution embraced by dealers and contractors the company is also expanding its operations with a new office in gurugram haryana to support its growth initiatives kamdhenu paints offers a wide range of products including emulsions wood finishes and designer paints aiming to be a one stop shop for customers construction needs with \u003cFOUR_TEN\u003e skus \u003cTHREE_TEN\u003e sales depots and a dealer network of \u003cFOUR_THOUSAND\u003e kamdhenus products are available nationwide committed to sustainability kamdhenu paints has introduced water based eco friendly paints with low vocs backed by modern automation and state of the art manufacturing facilities the company strives to deliver top quality products while minimising its environmental impact as the company continues to grow its robust fundamentals and steady growth trends suggest a further upside potential for shareholders","timestamp":"2024-09-13T12:04:00+05:30","market_timestamp":"2024-09-13T12:04:00+05:30","off_market_hours":false}