{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-rajesh-palviya-of-axis-securities-suggests-these-three-stocks-to-buy-hold-and-accumulate-today-11726804123874.html","title":"Shares to buy or sell: Rajesh Palviya of Axis Securities suggests these three stocks to buy, hold and accumulate today","description":"Shares to buy or sell: Rajesh Palviya has recommended to buy, hold, and accumulate Oberoi Realty Ltd, Kotak Mahindra Bank Ltd, and Max Healthcare Institute Ltd.","content":"Stock Market News: On Friday's session, the Indian benchmark indices, Sensex and Nifty 50, started the day with gains, driven by the performance of the metals sector. This was influenced by a significant cut in interest rates by the US Federal Reserve and the expectation of a smooth slowdown for the largest global economy, which increased investor willingness to take risks in international markets.As of 9:57 IST, the Sensex was up 0.64% at 83,717.73 level, while the Nifty 50 index also increased by 0.64% to 25,577.55 level.Chief investment strategist Dr. V K Vijayakumar of Geojit Financial Services emphasised some key facts, stating that the Dow and S\u0026P 500's recent record highs demonstrate the strength of the current global bull market, which is being driven by the US mother market. Good labor market data from the US suggests that the labor economy is not failing, but rather just slowing down. This indicates that the US is prepared for a gentle landing in the event of lowering interest rates since inflation is under control. This is good for the global stocks markets.The benchmark index has reached an all-time high at 25,611, indicating bullish sentiments. The index is in a strong uptrend, forming a series of higher highs and higher lows, confirming a positive bias. It is also well above its 20, 50, and 100-day SMA, which are trending up along with prices. The important support zone is around 25,300, while the rally is expected to extend towards 25,600-25,800 on the upside. Both the daily and weekly relative strength index (RSI) indicators are in positive territory, indicating sustained strength.The stock has recently broken out decisively from its consolidation range of 1830-1660 on a closing basis. This breakout was accompanied by high volume, indicating increased participation. Additionally, the stock has regained the 20, 50, and 100 day SMA and rebounded strongly, reaffirming bullish sentiments. Both the daily and weekly RSI indicators are in positive terrain, indicating sustained strength.Investors should buy, hold and accumulate this stock with an expected upside of 1,955-2,130 with downside support zone of 1,780-1,740 levels.The stock has decisively broken out of the \"multiple resistance\" zone at the 1,860 levels on a closing basis. It has also confirmed a breakout from the \"rounding formation\" at the 1,860 levels, indicating bullish sentiments. The daily \"Bollinger Bands\" buy signal shows increased momentum. Additionally, the daily, weekly, and monthly strength indicator RSI is in positive terrain, justifying rising strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of 1,955-2,060 with downside support zone of 1,840-1,820 levels.The stock reached an all-time high at 999 levels and closed around the same, indicating bullish sentiments. The current close confirms a daily \"rounding bottom\" formation breakout at 980 levels on a closing basis. Additionally, the daily \"Bollinger Band\" buy signal shows increased momentum. The daily, weekly, and monthly strength indicator RSI is in positive terrain, justifying rising strength across all time frames. The stock is well positioned above its 20, 50, 100, and 200-day SMA, and these averages are also trending upwards along with the price rise, reaffirming the bullish trend.Investors should buy, hold and accumulate this stock with an expected upside of 1,055-1,135 with downside support zone of 960-930 levels.","cleaned_content":"stock market news on fridays session the indian benchmark indices sensex and nifty \u003cFIVE_TEN\u003e started the day with gains driven by the performance of the metals sector this was influenced by a significant cut in interest rates by the us federal reserve and the expectation of a smooth slowdown for the largest global economy which increased investor willingness to take risks in international markets as of \u003cNINE_\u003e \u003cFIVE_TEN\u003e ist the sensex was up \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e level while the nifty \u003cFIVE_TEN\u003e index also increased by \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e level chief investment strategist dr v k vijayakumar of geojit financial services emphasised some key facts stating that the dow and s p \u003cFIVE_HUNDRED\u003e s recent record highs demonstrate the strength of the current global bull market which is being driven by the us mother market good labor market data from the us suggests that the labor economy is not failing but rather just slowing down this indicates that the us is prepared for a gentle landing in the event of lowering interest rates since inflation is under control this is good for the global stocks markets the benchmark index has reached an all time high at \u003cTWO_TEN_THOUSAND\u003e indicating bullish sentiments the index is in a strong uptrend forming a series of higher highs and higher lows confirming a positive bias it is also well above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e and \u003cONE_HUNDRED\u003e day sma which are trending up along with prices the important support zone is around \u003cTWO_TEN_THOUSAND\u003e while the rally is expected to extend towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the upside both the daily and weekly relative strength index rsi indicators are in positive territory indicating sustained strength the stock has recently broken out decisively from its consolidation range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e on a closing basis this breakout was accompanied by high volume indicating increased participation additionally the stock has regained the \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e and \u003cONE_HUNDRED\u003e day sma and rebounded strongly reaffirming bullish sentiments both the daily and weekly rsi indicators are in positive terrain indicating sustained strength investors should buy hold and accumulate this stock with an expected upside of \u003cONE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e with downside support zone of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels the stock has decisively broken out of the multiple resistance zone at the \u003cONE_THOUSAND\u003e levels on a closing basis it has also confirmed a breakout from the rounding formation at the \u003cONE_THOUSAND\u003e levels indicating bullish sentiments the daily bollinger bands buy signal shows increased momentum additionally the daily weekly and monthly strength indicator rsi is in positive terrain justifying rising strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cONE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e with downside support zone of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels the stock reached an all time high at \u003cNINE_HUNDRED\u003e levels and closed around the same indicating bullish sentiments the current close confirms a daily rounding bottom formation breakout at \u003cNINE_HUNDRED\u003e levels on a closing basis additionally the daily bollinger band buy signal shows increased momentum the daily weekly and monthly strength indicator rsi is in positive terrain justifying rising strength across all time frames the stock is well positioned above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma and these averages are also trending upwards along with the price rise reaffirming the bullish trend investors should buy hold and accumulate this stock with an expected upside of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e with downside support zone of \u003cNINE_HUNDRED\u003e \u003cNINE_HUNDRED\u003e levels","timestamp":"2024-09-20T10:00:00+05:30","market_timestamp":"2024-09-20T10:00:00+05:30","off_market_hours":false}