{"url":"https://www.livemint.com/market/stock-market-news/pvr-inox-stock-rises-3-after-anand-rathi-raises-target-price-sees-25-upside-11726485243881.html","title":"PVR Inox stock rises 3% after Anand Rathi raises target price, sees 25% upside","description":"The brokerage anticipates a sequential improvement in the second quarter of fiscal 2025 following a lackluster first quarter, driven by enhanced advertising revenue, which has been trailing behind pre-COVID levels.","content":"Shares of PVR Inox Ltd. gained nearly 3 per cent after brokerage firm Anand Rathi released a note on the company, reaffirming a 'buy' rating with a target price of  ₹2,065 per share. This target suggests a potential upside of 25 per cent from the stock's previous closing price of  ₹1,655.“We introduce FY27e and retain our Buy with a raised TP of Rs2,065 (13x FY27e pre-Ind-AS EBITDA),” the brokerage firm said in a note.The brokerage anticipates a sequential improvement in the second quarter of fiscal 2025 following a lackluster first quarter, driven by enhanced advertising revenue, which has been trailing behind pre-COVID levels.Several major films, including Kalki 2898 AD, Stree 2, Deadpool \u0026 Wolverine, and Raayan, are expected to drive strong revenue in Q2, according to the report. The third quarter is projected to be the company's most successful, featuring franchise films such as Pushpa 2, Singham Returns, Sitaare Zameen Par, and Bhool Bhulaiyaa 3 at the forefront.“After a muted Q1, PVR Inox is set for sequential improvement from Q2FY25. Plus, advertising income, which has been lagging pre-Covid levels should get a boost. Ahead, Q3FY25 is expected to be a good quarter for PVR-Inox, backed by many franchise movies. PVR’s Q3 performance may surpass its best quarter, Q2 FY24, (release of Gadar- 2, OMG-2 and Oppenheimer),” the firm added.PVR Inox aims to add 110-120 gross screens in fiscal 2025, targeting net additions of approximately 50-60 screens while continuing its efforts to reduce debt and implement an asset-light model.During the trading day, PVR Inox shares rose by as much as 2.96 per cent, reaching  ₹1,704.15 on the NSE. As of 1:46 p.m., the stock was trading 2.51 per cent higher at  ₹1,696.65, compared to a 0.23 per cent increase in the benchmark Nifty 50 index.Over the past year, the stock has declined by 1 per cent but has gained 2.05 per cent year-to-date. The total trading volume for the day was 2.2 times its 30-day average, with a relative strength index of 75.97.","cleaned_content":"shares of pvr inox ltd gained nearly \u003cTHREE_PERCENT\u003e after brokerage firm anand rathi released a note on the company reaffirming a buy rating with a target price of \u003cTWO_THOUSAND\u003e per share this target suggests a potential upside of \u003cTWO_TEN_PERCENT\u003e from the stocks previous closing price of \u003cONE_THOUSAND\u003e we introduce fy27e and retain our buy with a raised tp of rs2 065 \u003cONE_TEN\u003e x fy27e pre ind as ebitda the brokerage firm said in a note the brokerage anticipates a sequential improvement in the second quarter of fiscal \u003cTWO_THOUSAND\u003e following a lackluster first quarter driven by enhanced advertising revenue which has been trailing behind pre covid levels several major films including kalki \u003cTWO_THOUSAND\u003e ad stree \u003cTWO_\u003e deadpool wolverine and raayan are expected to drive strong revenue in q2 according to the report the third quarter is projected to be the companys most successful featuring franchise films such as pushpa \u003cTWO_\u003e singham returns sitaare zameen par and bhool bhulaiyaa \u003cTHREE_\u003e at the forefront after a muted q1 pvr inox is set for sequential improvement from q2fy25 plus advertising income which has been lagging pre covid levels should get a boost ahead q3fy25 is expected to be a good quarter for pvr inox backed by many franchise movies pvr s q3 performance may surpass its best quarter q2 fy24 release of gadar \u003cTWO_\u003e omg \u003cTWO_\u003e and oppenheimer the firm added pvr inox aims to add \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e gross screens in fiscal \u003cTWO_THOUSAND\u003e targeting net additions of approximately \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e screens while continuing its efforts to reduce debt and implement an asset light model during the trading day pvr inox shares rose by as much as \u003cTWO_PERCENT\u003e reaching \u003cONE_THOUSAND\u003e on the nse as of \u003cONE_\u003e \u003cFOUR_TEN\u003e p m the stock was trading \u003cTWO_PERCENT\u003e higher at \u003cONE_THOUSAND\u003e compared to a \u003cZERO_PERCENT\u003e increase in the benchmark nifty \u003cFIVE_TEN\u003e index over the past year the stock has declined by \u003cONE_PERCENT\u003e but has gained \u003cTWO_PERCENT\u003e year to date the total trading volume for the day was \u003cTWO_\u003e times its \u003cTHREE_TEN\u003e day average with a relative strength index of \u003cSEVEN_TEN\u003e","timestamp":"2024-09-16T17:25:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}