{"url":"https://www.livemint.com/market/stock-market-news/dabur-shares-tumble-8-to-hit-3-month-low-on-weak-q2-business-update-analysts-cut-target-price-11727930584075.html","title":"Dabur shares tumble 8% to 3-month low on weak Q2 business update; analysts cut target price","description":"Dabur's shares dropped 8% to a three-month low after the company projected a weak September quarter. Analysts revised their target price downwards, citing the impact of heavy rains on sales, particularly in the beverages segment.","content":"Dabur shares fell 8% in early morning trade on Thursday, October 3, to their three-month low of  ₹571 apiece after the consumer goods maker projected a decline in revenue for the September quarter. This forecast led analysts to reduce their target prices on the stock, contributing to its worst intraday performance since March 2022.The company on Tuesday said it expects a revenue fall in the mid-single digit percentage range for the September-ending quarter as heavy rain and floods across parts of the country impacted \"out-of-home\" consumption and consumer offtake during Q2FY25.\"Due to this, we saw some impact on our business, especially in the beverage category,\" the company said in its regulatory filing.The food and beverage segment accounted for 14% of Dabur's overall revenue, according to its annual report for the year ended March 2024.Southwest monsoon rains in India hit a four-year high this season, experiencing about 108% of the long period average at 934.8 mm, data made available by the state-run weather bureau, India Meteorological Department, showed. A rainfall of 868.6 mm is the long-period average in India.However, the company expects its international business to register double-digit constant currency growth in the top line. Badshah Masala Business continued to perform well, growing in double digits during the quarter, it added.The company is confident that the growth will revive from Q3.Domestic brokerage Emkay Global Financial Services downgraded the rating on the stock to 'add' from 'buy' and trimmed its target price to  ₹650 apiece from  ₹750 per share earlier.\"Amid sustained hiccups and required corrective measures, we take back the execution premium from the stock. Dabur has relatively underperformed (vs. peers), and we expect this to continue in the near term. We remain hopeful of business recovery on the back of rural rebound and better winter sales,\" said the brokerage.Global brokerage firm Citi reduced its target price for Dabur shares to  ₹570 following the company’s business update and maintained a 'sell' rating on the stock. Meanwhile, Macquarie lowered its price target to  ₹560, assigning a 'neutral' rating.Investec predicts that the September quarter will be Dabur India's weakest in four years. The brokerage has a 'hold' rating on the stock, with a target price of  ₹638 per share.Nuvama Institutional Equities stated, \"Although down-stocking and pipeline corrections in the FMCG sector are not uncommon, the level of impact on Dabur is unexpected.\" While the brokerage continues to recommend a ‘buy’ rating, it mentioned that Dabur India's stock may face pressure in the short term.","cleaned_content":"dabur shares fell \u003cEIGHT_PERCENT\u003e in early morning trade on thursday october \u003cTHREE_\u003e to their three month low of \u003cFIVE_HUNDRED\u003e apiece after the consumer goods maker projected a decline in revenue for the september quarter this forecast led analysts to reduce their target prices on the stock contributing to its worst intraday performance since march \u003cTWO_THOUSAND\u003e the company on tuesday said it expects a revenue fall in the mid single digit percentage range for the september ending quarter as heavy rain and floods across parts of the country impacted out of home consumption and consumer offtake during q2fy25 due to this we saw some impact on our business especially in the beverage category the company said in its regulatory filing the food and beverage segment accounted for \u003cONE_TEN_PERCENT\u003e of daburs overall revenue according to its annual report for the year ended march \u003cTWO_THOUSAND\u003e southwest monsoon rains in india hit a four year high this season experiencing about \u003cONE_HUNDRED_PERCENT\u003e of the long period average at \u003cNINE_HUNDRED\u003e mm data made available by the state run weather bureau india meteorological department showed a rainfall of \u003cEIGHT_HUNDRED\u003e mm is the long period average in india however the company expects its international business to register double digit constant currency growth in the top line badshah masala business continued to perform well growing in double digits during the quarter it added the company is confident that the growth will revive from q3 domestic brokerage emkay global financial services downgraded the rating on the stock to add from buy and trimmed its target price to \u003cSIX_HUNDRED\u003e apiece from \u003cSEVEN_HUNDRED\u003e per share earlier amid sustained hiccups and required corrective measures we take back the execution premium from the stock dabur has relatively underperformed vs peers and we expect this to continue in the near term we remain hopeful of business recovery on the back of rural rebound and better winter sales said the brokerage global brokerage firm citi reduced its target price for dabur shares to \u003cFIVE_HUNDRED\u003e following the company s business update and maintained a sell rating on the stock meanwhile macquarie lowered its price target to \u003cFIVE_HUNDRED\u003e assigning a neutral rating investec predicts that the september quarter will be dabur indias weakest in four years the brokerage has a hold rating on the stock with a target price of \u003cSIX_HUNDRED\u003e per share nuvama institutional equities stated although down stocking and pipeline corrections in the fmcg sector are not uncommon the level of impact on dabur is unexpected while the brokerage continues to recommend a buy rating it mentioned that dabur indias stock may face pressure in the short term","timestamp":"2024-10-03T11:44:00+05:30","market_timestamp":"2024-10-03T11:44:00+05:30","off_market_hours":false}