{"url":"https://www.livemint.com/market/stock-market-news/sudarshan-pharma-shares-multibagger-small-cap-stock-jumps-5-on-stock-split-announcement-after-400-rally-ytd-11727242264338.html","title":"Sudarshan Pharma shares: Multibagger small-cap stock jumps 5% on stock split announcement after 400% rally YTD","description":"Sudarshan Pharma stock price has gained by over 26% in one week and by a staggering 150% in one month. The smallcap stock has rallied more than 410% in three months and over 425% year-to-date (YTD).","content":"Sudarshan Pharma Industries share price jumped 5% on Wednesday after the company announced a stock split proposal. The multibagger small-cap stock, Sudarshan Pharma shares spiked as much as 5% to hit a record high of  ₹424.35 apiece on the BSE.The meeting of the Board of Directors of the company is scheduled to be held on Monday, September 30, 2024. The board will consider the proposal for sub-division or split of Equity Shares of the company presently having a face value of  ₹10 each in such manner as the board may determine, Sudarshan Pharma Industries said in a stock exchange filing.Last week, the specialty chemicals company announced the incorporation of Sudarshan Maven as its subsidiary. Sudarshan Pharma Industries has subscribed to 7,000 equity shares of  ₹10 each aggregating to 70.00% of the subscribed capital of Sudarshan Maven.The main object of Sudarshan Maven is to manufacture, formulate, process, develop, refine, import, export, all kinds of pharmaceuticals, APl \u0026 intermediates.For the financial year ended March 2024, Sudarshan Pharma Industries reported a net profit of  ₹11.36 crore upon a revenue of  ₹465.56 crore.Sudarshan Pharma shares have seen a decent upward trend led by strong buying. The stock has given multibagger returns to investors in just one month.Sudarshan Pharma stock price has gained over 26% in one week and by a staggering 150% in one month. The smallcap stock has rallied more than 410% in three months and over 425% year-to-date (YTD).At 11:10 am, Sudarshan Pharma shares were trading 3.74% higher at  ₹419.25 apiece on the BSE, commanding a market capitalisation of nearly  ₹1,009 crore.","cleaned_content":"sudarshan pharma industries share price jumped \u003cFIVE_PERCENT\u003e on wednesday after the company announced a stock split proposal the multibagger small cap stock sudarshan pharma shares spiked as much as \u003cFIVE_PERCENT\u003e to hit a record high of \u003cFOUR_HUNDRED\u003e apiece on the bse the meeting of the board of directors of the company is scheduled to be held on monday september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the board will consider the proposal for sub division or split of equity shares of the company presently having a face value of \u003cONE_TEN\u003e each in such manner as the board may determine sudarshan pharma industries said in a stock exchange filing last week the specialty chemicals company announced the incorporation of sudarshan maven as its subsidiary sudarshan pharma industries has subscribed to \u003cSEVEN_THOUSAND\u003e equity shares of \u003cONE_TEN\u003e each aggregating to \u003cSEVEN_TEN_PERCENT\u003e of the subscribed capital of sudarshan maven the main object of sudarshan maven is to manufacture formulate process develop refine import export all kinds of pharmaceuticals apl intermediates for the financial year ended march \u003cTWO_THOUSAND\u003e sudarshan pharma industries reported a net profit of \u003cONE_TEN\u003e crore upon a revenue of \u003cFOUR_HUNDRED\u003e crore sudarshan pharma shares have seen a decent upward trend led by strong buying the stock has given multibagger returns to investors in just one month sudarshan pharma stock price has gained over \u003cTWO_TEN_PERCENT\u003e in one week and by a staggering \u003cONE_HUNDRED_PERCENT\u003e in one month the smallcap stock has rallied more than \u003cFOUR_HUNDRED_PERCENT\u003e in three months and over \u003cFOUR_HUNDRED_PERCENT\u003e year to date ytd at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am sudarshan pharma shares were trading \u003cTHREE_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece on the bse commanding a market capitalisation of nearly \u003cONE_THOUSAND\u003e crore","timestamp":"2024-09-25T11:12:00+05:30","market_timestamp":"2024-09-25T11:12:00+05:30","off_market_hours":false}