{"url":"https://www.livemint.com/market/stock-market-news/pnc-infra-ashoka-buildcon-irb-infrastructure-others-in-focus-as-order-inflows-are-catching-pace-11727234843784.html","title":"PNC Infra, Ashoka Buildcon, IRB Infra \u0026 other road construction stocks in focus as order inflows gather pace","description":"Stock Market Today: Shares of Ashoka Buildcon, PNC Infratech, IRB Infrastructure and others are in focus as order inflows for road construction showed signs of improvement after remaining subdued during the first quarter.","content":"Stock Market Today: Ashoka Buildcon, Dilip Buildcon, KNR Constructions, GPT Infraprojects, H.G. Infra Engineering, PNC Infratech and IRB Infrastructure Developers share prices are gaining traction as order inflows that were subdued in the first quarter of FY25 due to general elections are showing signs of improvement.Ashoka Buildcon, Dilip Buildcon, KNR Constructions, GPT Infraprojects, and H.G. Infra Engineering share prices among others have risen up to 8% in the last one month. IRB Infrastructure Developers share prices, however, are exceptions as they have corrected during the same period. That said, IRB Infra has already gained significantly in last one year with the stock almost doubling in price. After such stellar gains, some profit-taking is expected.Analysts say order inflow improvement has been visible in the last few months.Vinay Kumar G, Vice President \u0026 Sector Head - Corporate Ratings, ICRA Limited, said that the awarding activity gained traction sequentially, with 589 km awarded in August 2024 (up 27% month-on-month over July 2024).However, overall awarding activity remains lower by 7% as compared to August 2023.Also during the first five months of FY2025, the road awards stood at 1152 km, 34% lower than the 1756 km awarded in 5M FY2024.ICRA estimates road awards by the Ministry of Road Transport and Highways (MoRTH) at 8,500-9,000 km in FY2025, similar to last year’s awarding of 8,581 km. With improved clarity regarding order-awarding activity from the MoRTH in August 2024, project awarding is expected to gain momentum from September 2024 onwards. However, the overall project award will remain substantially lower than that of FY2021-FY2023 levels, added the rating agency.Analysts at Nuvama said road awarding was subdued in Q1FY25 due to general elections, however, it has picked up since then with NHAI and MoRTH combined awarding 468 km projects in July 2024. Construction at the combined level stood at 600 km during the month.The competition, however, remains high and there are some concerns about the margins of these firms. Given the backdrop, Nuvama analysts say that road developers must work on segmental diversification since their ability to win adequate road orders at desired margins is now under question. Nuvama analysts prefer road companies with robust balance sheets such as PNC Infratech","cleaned_content":"stock market today ashoka buildcon dilip buildcon knr constructions gpt infraprojects h g infra engineering pnc infratech and irb infrastructure developers share prices are gaining traction as order inflows that were subdued in the first quarter of fy25 due to general elections are showing signs of improvement ashoka buildcon dilip buildcon knr constructions gpt infraprojects and h g infra engineering share prices among others have risen up to \u003cEIGHT_PERCENT\u003e in the last one month irb infrastructure developers share prices however are exceptions as they have corrected during the same period that said irb infra has already gained significantly in last one year with the stock almost doubling in price after such stellar gains some profit taking is expected analysts say order inflow improvement has been visible in the last few months vinay kumar g vice president sector head corporate ratings icra limited said that the awarding activity gained traction sequentially with \u003cFIVE_HUNDRED\u003e km awarded in august \u003cTWO_THOUSAND\u003e up \u003cTWO_TEN_PERCENT\u003e month on month over july \u003cTWO_THOUSAND\u003e however overall awarding activity remains lower by \u003cSEVEN_PERCENT\u003e as compared to august \u003cTWO_THOUSAND\u003e also during the first five months of fy2025 the road awards stood at \u003cONE_THOUSAND\u003e km \u003cTHREE_TEN_PERCENT\u003e lower than the \u003cONE_THOUSAND\u003e km awarded in \u003cFIVE_\u003e m fy2024 icra estimates road awards by the ministry of road transport and highways morth at \u003cEIGHT_THOUSAND\u003e \u003cNINE_THOUSAND\u003e km in fy2025 similar to last year s awarding of \u003cEIGHT_THOUSAND\u003e km with improved clarity regarding order awarding activity from the morth in august \u003cTWO_THOUSAND\u003e project awarding is expected to gain momentum from september \u003cTWO_THOUSAND\u003e onwards however the overall project award will remain substantially lower than that of fy2021 fy2023 levels added the rating agency analysts at nuvama said road awarding was subdued in q1fy25 due to general elections however it has picked up since then with nhai and morth combined awarding \u003cFOUR_HUNDRED\u003e km projects in july \u003cTWO_THOUSAND\u003e construction at the combined level stood at \u003cSIX_HUNDRED\u003e km during the month the competition however remains high and there are some concerns about the margins of these firms given the backdrop nuvama analysts say that road developers must work on segmental diversification since their ability to win adequate road orders at desired margins is now under question nuvama analysts prefer road companies with robust balance sheets such as pnc infratech","timestamp":"2024-09-27T13:17:00+05:30","market_timestamp":"2024-09-27T13:17:00+05:30","off_market_hours":false}