{"url":"https://www.livemint.com/market/stock-market-news/easy-trip-planners-share-price-declines-8-on-block-deal-news-promoter-to-sell-8-5-stake-11727240053881.html","title":"Easy Trip Planners share price declines 8% on block deal news: Promoter to sell 8.5% stake","description":"Stock Market Today: Easy Trip Planners share price declined more than 8% on Wednesday morning on news of a block deal. News reports suggest Promoter is likely to sell 8.5% stake.","content":"Stock Market Today: Easy Trip Planners share price declined more than 8% on Wednesday morning on news of a block deal. News reports suggest Promoter is likely to sell 8.5% stakeEasy Trip Planners Ltd.'s share price opened at  ₹39.19 on the BSE on Wednesday, 4.5% lower than Tuesday closing price of  ₹41.03 on the BSE, The share price thereafter slipped down to intraday lows of  ₹37.40 more than 8% lower than previous days close.The news reports suggest that Promoter Nishant Pitti is likely to sell 8.5% stake in Ease My Trip Planners Ltd. The sale's indicative price is set at  ₹41.5 per share, said CNBC TV18 attributing the news to sources. Pitti owned 28.13% of Easy Trip Planners as of the end of the first quarter.As per moneycontrol.com On September 25, sources indicate that Nishant Pitti, the promoter of EasyMyTrip (Easy Trip Planners Ltd.), is anticipated to sell 15 crore shares, or 8.5 percent of the total share capital, in a block deal. For a transaction value of around  ₹580 crore, the floor price per share is anticipated to be  ₹38. It is anticipated that several institutional investors will be the buyer, said moneycontrol.com news report.Meanwhile, Ease My Trip Planners has been in the news on the back of its plans to grow the YoloBus program. Over the next four years, Delhi-based online travel agency EaseMyTrip is said to be planning to grow its fleet of electric buses to 2,000 .Also with the board of Easy Trip Planners authorizing two acquisitions totaling  ₹90 crore, the company is expanding into the medical tourism market. As per its release a few days back the company's board had approved proposed investment of 30% of the aggregate post money paid-up equity share capital of Rollins International Private Limited, for a value of  ₹60 Crore. It also approved Proposed investment of 49% of the aggregate post money paid-up share capital of Pflege Home Healthcare Center LLC ( ₹30 Crore)","cleaned_content":"stock market today easy trip planners share price declined more than \u003cEIGHT_PERCENT\u003e on wednesday morning on news of a block deal news reports suggest promoter is likely to sell \u003cEIGHT_PERCENT\u003e stakeeasy trip planners ltd s share price opened at \u003cTHREE_TEN\u003e on the bse on wednesday \u003cFOUR_PERCENT\u003e lower than tuesday closing price of \u003cFOUR_TEN\u003e on the bse the share price thereafter slipped down to intraday lows of \u003cTHREE_TEN\u003e more than \u003cEIGHT_PERCENT\u003e lower than previous days close the news reports suggest that promoter nishant pitti is likely to sell \u003cEIGHT_PERCENT\u003e stake in ease my trip planners ltd the sales indicative price is set at \u003cFOUR_TEN\u003e per share said cnbc tv18 attributing the news to sources pitti owned \u003cTWO_TEN_PERCENT\u003e of easy trip planners as of the end of the first quarter as per moneycontrol com on september \u003cTWO_TEN\u003e sources indicate that nishant pitti the promoter of easymytrip easy trip planners ltd is anticipated to sell \u003cONE_TEN\u003e crore shares or \u003cEIGHT_PERCENT\u003e of the total share capital in a block deal for a transaction value of around \u003cFIVE_HUNDRED\u003e crore the floor price per share is anticipated to be \u003cTHREE_TEN\u003e it is anticipated that several institutional investors will be the buyer said moneycontrol com news report meanwhile ease my trip planners has been in the news on the back of its plans to grow the yolobus program over the next four years delhi based online travel agency easemytrip is said to be planning to grow its fleet of electric buses to \u003cTWO_THOUSAND\u003e also with the board of easy trip planners authorizing two acquisitions totaling \u003cNINE_TEN\u003e crore the company is expanding into the medical tourism market as per its release a few days back the companys board had approved proposed investment of \u003cTHREE_TEN_PERCENT\u003e of the aggregate post money paid up equity share capital of rollins international private limited for a value of \u003cSIX_TEN\u003e crore it also approved proposed investment of \u003cFOUR_TEN_PERCENT\u003e of the aggregate post money paid up share capital of pflege home healthcare center llc \u003cTHREE_TEN\u003e crore","timestamp":"2024-09-25T10:33:00+05:30","market_timestamp":"2024-09-25T10:33:00+05:30","off_market_hours":false}