{"url":"https://www.livemint.com/market/stock-market-news/hsbc-upgrades-iifl-finance-to-hold-from-reduce-post-rbi-move-raises-target-price-to-rs-540-8-upside-ahead-11727256100382.html","title":"HSBC upgrades IIFL Finance to ‘hold’ from ‘reduce’ post-RBI move, raises target price to  ₹540, sees 8% upside","description":"HSBC upgraded IIFL Finance to ‘hold’ after RBI lifted restrictions on its gold loan business, raising the target price to  ₹540. Despite a 65%-70% stock rally since March 2024, HSBC notes challenges in raising fresh debt funds could affect near-term returns.","content":"Following the recent lifting of RBI restrictions on its gold loan business, global brokerage house HSBC upgraded IIFL Finance stock to ‘hold’ from ‘reduce.’ HSBC also raised the stock's target price to  ₹540 from  ₹350 earlier, implying an 8 percent upside potential.HSBC also upgraded its FY25-27 EPS estimates by 6 percent to 16 percent, reflecting the RBI's move. However, the brokerage noted that the stock has already rallied 65 percent to 70 percent from its March 2024 lows.“We upgrade the stock to a Hold rating (from Reduce). We think a Hold rating is appropriate, given: i) the stock is up 65-70% from its March 2024 lows, factoring in much of the upside, and ii) it trades at a 5-13% discount to LTF / MMFS, which are its closest peers. Challenges to raising large quantum of fresh debt funds at competitive costs still remain. Over time, as these challenges fade, there can be a further potential re-rating. However, at the moment, we remain cautious on near-term returns. Hence, we upgrade to Hold rating,” said the brokerage.The NBFC stock has seen mixed performance over the past year, losing 8 percent during this period and over 14 percent year-to-date in 2014. Despite posting negative returns in four out of the nine months of this year, the stock recently gained momentum, advancing around 10 percent in September, following a 3.2 percent rise in August.However, earlier in the year, volatility impacted the IIFL Finance stock. It fell 14.6 percent in July after surging 30.15 percent in June. The stock also dipped 2 percent in May but saw a 23 percent rise in April. March witnessed a significant 42.3 percent plunge, with declines of 8.3 percent in February, and a 4.5 percent gain in January.Having hit a record high of  ₹683.78 in October last year, the stock is currently trading at  ₹500.90, down 27 percent from its peak. However, it has surged approximately 65 percent from its 52-week low of  ₹304.17 in March 2024.RBI Lifts Ban on IIFL Finance’s Gold Loan Business: HSBC reported that the Reserve Bank of India (RBI) had lifted its ban on IIFL Finance's gold loan business, a restriction imposed in March 2024. This recent decision by the RBI provided a significant boost to the company, allowing it to regain lost business. HSBC noted that this change had a material impact on its earnings outlook for IIFL, leading to improved growth projections for the company's gold loan segment. Higher assets under management (AUM) growth in this high-yielding segment, along with increased productivity from its existing gold loan infrastructure and better funding access at the parent level, contributed to the revised outlook.A Significant Boost to Earnings Outlook: HSBC upgraded IIFL’s earnings estimates for FY25-27 by 6 percent-16 percent as a result of this development, citing better funding availability and stronger infrastructure utilisation. Despite the positive outlook, HSBC also highlighted that IIFL’s stock had already risen by 65 percent-70 percent from its lows, leading to a valuation that was no longer at a significant discount to its peers.Quick Resumption of Gold Loan Operations Expected: HSBC highlighted that IIFL was able to maintain its staff and branch network during the period of suspension, ensuring that operations could be resumed quickly. Additionally, IIFL’s ability to raise funds during challenging times, including  ₹1,300 crore through a rights issue and  ₹500 crore via non-convertible debentures (NCDs) from Fairfax, showcased its resilience.Upgraded Growth and Earnings Estimates for FY25-27: HSBC revised its estimates for IIFL’s AUM growth, projecting a 14% compound annual growth rate (CAGR) over FY24-27, compared to the previous estimate of 7%. This increase is driven by the resumption of the gold loan business and momentum in other business segments. HSBC also expects the cost-to-asset ratio to improve, while blended credit costs should decrease as gold loans make up a larger portion of the portfolio.According to HSBC, upside risks include easier-than-expected funding, which could lead to stronger gold loan disbursements, increased co-lending and assignment transactions, and better asset quality in the gold loan portfolio. However, downside risks involve challenges in raising funds, operational delays in resuming gold loan services, and potential asset quality issues in personal and digital loan businesses.","cleaned_content":"following the recent lifting of rbi restrictions on its gold loan business global brokerage house hsbc upgraded iifl finance stock to hold from reduce hsbc also raised the stocks target price to \u003cFIVE_HUNDRED\u003e from \u003cTHREE_HUNDRED\u003e earlier implying an \u003cEIGHT_PERCENT\u003e upside potential hsbc also upgraded its fy25 \u003cTWO_TEN\u003e eps estimates by \u003cSIX_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e reflecting the rbis move however the brokerage noted that the stock has already rallied \u003cSIX_TEN_PERCENT\u003e to \u003cSEVEN_TEN_PERCENT\u003e from its march \u003cTWO_THOUSAND\u003e lows we upgrade the stock to a hold rating from reduce we think a hold rating is appropriate given i the stock is up \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e from its march \u003cTWO_THOUSAND\u003e lows factoring in much of the upside and ii it trades at a \u003cFIVE_\u003e \u003cONE_TEN_PERCENT\u003e discount to ltf mmfs which are its closest peers challenges to raising large quantum of fresh debt funds at competitive costs still remain over time as these challenges fade there can be a further potential re rating however at the moment we remain cautious on near term returns hence we upgrade to hold rating said the brokerage the nbfc stock has seen mixed performance over the past year losing \u003cEIGHT_PERCENT\u003e during this period and over \u003cONE_TEN_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e despite posting negative returns in four out of the nine months of this year the stock recently gained momentum advancing around \u003cONE_TEN_PERCENT\u003e in september following a \u003cTHREE_PERCENT\u003e rise in august however earlier in the year volatility impacted the iifl finance stock it fell \u003cONE_TEN_PERCENT\u003e in july after surging \u003cTHREE_TEN_PERCENT\u003e in june the stock also dipped \u003cTWO_PERCENT\u003e in may but saw a \u003cTWO_TEN_PERCENT\u003e rise in april march witnessed a significant \u003cFOUR_TEN_PERCENT\u003e plunge with declines of \u003cEIGHT_PERCENT\u003e in february and a \u003cFOUR_PERCENT\u003e gain in january having hit a record high of \u003cSIX_HUNDRED\u003e in october last year the stock is currently trading at \u003cFIVE_HUNDRED\u003e down \u003cTWO_TEN_PERCENT\u003e from its peak however it has surged approximately \u003cSIX_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTHREE_HUNDRED\u003e in march \u003cTWO_THOUSAND\u003e rbi lifts ban on iifl finance s gold loan business hsbc reported that the reserve bank of india rbi had lifted its ban on iifl finances gold loan business a restriction imposed in march \u003cTWO_THOUSAND\u003e this recent decision by the rbi provided a significant boost to the company allowing it to regain lost business hsbc noted that this change had a material impact on its earnings outlook for iifl leading to improved growth projections for the companys gold loan segment higher assets under management aum growth in this high yielding segment along with increased productivity from its existing gold loan infrastructure and better funding access at the parent level contributed to the revised outlook a significant boost to earnings outlook hsbc upgraded iifl s earnings estimates for fy25 \u003cTWO_TEN\u003e by \u003cSIX_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e as a result of this development citing better funding availability and stronger infrastructure utilisation despite the positive outlook hsbc also highlighted that iifl s stock had already risen by \u003cSIX_TEN_PERCENT\u003e \u003cSEVEN_TEN_PERCENT\u003e from its lows leading to a valuation that was no longer at a significant discount to its peers quick resumption of gold loan operations expected hsbc highlighted that iifl was able to maintain its staff and branch network during the period of suspension ensuring that operations could be resumed quickly additionally iifl s ability to raise funds during challenging times including \u003cONE_THOUSAND\u003e crore through a rights issue and \u003cFIVE_HUNDRED\u003e crore via non convertible debentures ncds from fairfax showcased its resilience upgraded growth and earnings estimates for fy25 \u003cTWO_TEN\u003e hsbc revised its estimates for iifl s aum growth projecting a \u003cONE_TEN_PERCENT\u003e compound annual growth rate cagr over fy24 \u003cTWO_TEN\u003e compared to the previous estimate of \u003cSEVEN_PERCENT\u003e this increase is driven by the resumption of the gold loan business and momentum in other business segments hsbc also expects the cost to asset ratio to improve while blended credit costs should decrease as gold loans make up a larger portion of the portfolio according to hsbc upside risks include easier than expected funding which could lead to stronger gold loan disbursements increased co lending and assignment transactions and better asset quality in the gold loan portfolio however downside risks involve challenges in raising funds operational delays in resuming gold loan services and potential asset quality issues in personal and digital loan businesses","timestamp":"2024-09-25T15:35:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}