{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-quicktouch-technologies-surges-over-9-after-promoters-raise-stake-check-details-11727238409372.html","title":"Small-cap stock Quicktouch Technologies surges over 9% after promoters raise stake; check details","description":"Quicktouch Technologies shares rose over 9% after the company allotted nearly 32 lakh shares to promoters and the public. The board also approved green energy initiatives and a project with Srikaya Foundation to support startups.","content":"Small-cap stock: Quicktouch Technologies share price surged over 9 per cent in morning trade on NSE on Wednesday, September 25, a day after the company announced its board of directors had allotted nearly 32 lakh shares to promoters and the public category. Quicktouch Tech shares opened at  ₹153 against its previous close of  ₹146 and soon jumped 9.2 per cent to the level of  ₹159.50. Around 10:10 am, the stock traded 6.16 per cent higher at  ₹155 apiece.After market hours on Tuesday, September 24, the company said, “The board had made allotment of 31,72,200 equity shares of the face value of  ₹10 each to the persons belonging to promoter and promoter group and public category, for cash, at an issue price of  ₹144 per share, for an aggregate amount of  ₹45,67,96,800 on a preferential basis.”Among the promoters, BIR Foods \u0026 Restaurants Private Limited and Genius Townships Private Limited were allotted 10,00,000 and 4,72,200 shares, respectively.After the share allotment, the paid-up equity capital of the company rose to  ₹9,81,59,960, comprising 98,15,996 shares of face value of  ₹10.The current market capitalisation of the stock is  ₹96.57 crore.The stock hit its 52-week high of  ₹274 on October 26 last year and its 52-week low of  ₹105 on June 6 this year. Till September 24 close, the stock was down 26 per cent year-to-date.Apart from share allotment, the company's board approved several other projects and initiatives on Tuesday.The board also approved a strategic initiative to implement green/ renewable energy solutions across various educational institutions, including the installation of solar panels. This marks Quicktouch’s foray into the renewable energy sector.\"The company will pursue a green/renewable energy project through a joint venture with a renowned partner or by establishing a wholly owned subsidiary. The initiative aligns with the company’s long-term vision of promoting sustainability and reducing carbon footprints while providing cost-effective energy solutions to educational institutions. This development reflects Quicktouch's commitment to environmental stewardship and growth in the clean energy market,\" it said.Moreover, the company's board approved a collaborative project with Srikaya Foundation to establish an incubation centre, with an initial funding of  ₹10 crore for the setup and promotion of the centre, which will provide infrastructure, business mentorship, technology support, and financial assistance to early-stage startups and entrepreneurs.The company's board has approved the launching of a new product, Digital Yodha, a channel partner application designed to enhance business development through various channel partners.\"This innovative application will enable channel partners to onboard themselves to sell and promote Quicktouch's diverse range of products across different geographical markets. By streamlining the onboarding process and providing tools for effective promotion, Digital Yodha aims to strengthen Quicktouch's market presence and expand its reach through strategic partnerships,\" said the company.Read all market-related news here","cleaned_content":"small cap stock quicktouch technologies share price surged over \u003cNINE_PERCENT\u003e in morning trade on nse on wednesday september \u003cTWO_TEN\u003e a day after the company announced its board of directors had allotted nearly \u003cTHREE_TEN\u003e lakh shares to promoters and the public category quicktouch tech shares opened at \u003cONE_HUNDRED\u003e against its previous close of \u003cONE_HUNDRED\u003e and soon jumped \u003cNINE_PERCENT\u003e to the level of \u003cONE_HUNDRED\u003e around \u003cONE_TEN\u003e \u003cONE_TEN\u003e am the stock traded \u003cSIX_PERCENT\u003e higher at \u003cONE_HUNDRED\u003e apiece after market hours on tuesday september \u003cTWO_TEN\u003e the company said the board had made allotment of \u003cTHREE_MILLION\u003e equity shares of the face value of \u003cONE_TEN\u003e each to the persons belonging to promoter and promoter group and public category for cash at an issue price of \u003cONE_HUNDRED\u003e per share for an aggregate amount of \u003cFOUR_HUNDRED_MILLION\u003e on a preferential basis among the promoters bir foods restaurants private limited and genius townships private limited were allotted \u003cONE_MILLION\u003e and \u003cFOUR_HUNDRED_THOUSAND\u003e shares respectively after the share allotment the paid up equity capital of the company rose to \u003cNINE_TEN_MILLION\u003e comprising \u003cNINE_MILLION\u003e shares of face value of \u003cONE_TEN\u003e the current market capitalisation of the stock is \u003cNINE_TEN\u003e crore the stock hit its \u003cFIVE_TEN\u003e week high of \u003cTWO_HUNDRED\u003e on october \u003cTWO_TEN\u003e last year and its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e on june \u003cSIX_\u003e this year till september \u003cTWO_TEN\u003e close the stock was down \u003cTWO_TEN_PERCENT\u003e year to date apart from share allotment the companys board approved several other projects and initiatives on tuesday the board also approved a strategic initiative to implement green renewable energy solutions across various educational institutions including the installation of solar panels this marks quicktouch s foray into the renewable energy sector the company will pursue a green renewable energy project through a joint venture with a renowned partner or by establishing a wholly owned subsidiary the initiative aligns with the company s long term vision of promoting sustainability and reducing carbon footprints while providing cost effective energy solutions to educational institutions this development reflects quicktouchs commitment to environmental stewardship and growth in the clean energy market it said moreover the companys board approved a collaborative project with srikaya foundation to establish an incubation centre with an initial funding of \u003cONE_TEN\u003e crore for the setup and promotion of the centre which will provide infrastructure business mentorship technology support and financial assistance to early stage startups and entrepreneurs the companys board has approved the launching of a new product digital yodha a channel partner application designed to enhance business development through various channel partners this innovative application will enable channel partners to onboard themselves to sell and promote quicktouchs diverse range of products across different geographical markets by streamlining the onboarding process and providing tools for effective promotion digital yodha aims to strengthen quicktouchs market presence and expand its reach through strategic partnerships said the company read all market related news here","timestamp":"2024-09-25T10:30:00+05:30","market_timestamp":"2024-09-25T10:30:00+05:30","off_market_hours":false}