{"url":"https://www.livemint.com/market/stock-market-news/jtl-industries-share-price-jumps-7-after-announcement-of-stock-split-move-11727164118741.html","title":"JTL Industries share price jumps 7% after announcement of stock split move","description":"JTL Industries share price: The company board will consider several important matters, including the proposed stock split, in the board meeting scheduled on October 3, 2024","content":"Stock split 2024: JTL Industries' share price jumped by 7 per cent following the company's announcement of a potential stock split. The announcement came through an exchange filing to the stock exchanges on September 24, 2024.The company informed the Bombay Stock Exchange (BSE), National Stock Exchange (NSE), and Metropolitan Stock Exchange of India (MSEI) that its Board of Directors is scheduled to meet on Thursday, October 3, 2024. This meeting will consider several important matters, including the proposed stock split.JTL Industries share price was trading in the green, up 6.37 per cent, at  ₹233.90, on September 24, at 1:27 pm, on BSE. The company enjoys a market capitalisation of  ₹4,353.29 crore. JTL Industries stock price hit 52-week high on February 28, 2024 at  ₹278.00, as per NSE.According to the company's statement, the board will discuss “The sub-division/split of Equity Shares of the Company having a face value of Rs. 2/- each shall be in such manner as the Board may decide.”In addition to the stock split, the board meeting agenda will include:1] A proposal to issue bonus shares to equity shareholders.2] An increase in the company's Authorized Share Capital.3] Consequent alterations to the company's Memorandum of Association.4] Any other items permitted by the Chairman.The steel tubes and pipes manufacturer saw its revenue climb to  ₹515.37 crore in the April-June quarter, marking an improvement from  ₹504.80 crore recorded in the corresponding period of the last fiscal year.Despite a slight uptick in expenses, which rose to  ₹478.83 crore from  ₹471.66 crore year-over-year, the company managed to boost its profitability. While the exact profit figure for the current quarter was not provided in your message, it's clear that it surpassed the  ₹25.36 crore profit reported in the first quarter of the 2023-24 fiscal year.In compliance with regulatory requirements, the company has also closed its trading window for insiders. The statement noted, \"The Trading Window for dealing in securities of the Company is being closed with immediate effect. It shall remain closed till 48 hours after the declaration of Un-audited Financial Results for the Quarter and Six Months ended 30th September 2024, for all Promoters/Promoter Group, Directors, KMPs, Designated Person(s), Connected Person(s)/Insiders and their immediate relatives as covered under the Code.\"","cleaned_content":"stock split \u003cTWO_THOUSAND\u003e jtl industries share price jumped by \u003cSEVEN_PERCENT\u003e following the companys announcement of a potential stock split the announcement came through an exchange filing to the stock exchanges on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company informed the bombay stock exchange bse national stock exchange nse and metropolitan stock exchange of india msei that its board of directors is scheduled to meet on thursday october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e this meeting will consider several important matters including the proposed stock split jtl industries share price was trading in the green up \u003cSIX_PERCENT\u003e at \u003cTWO_HUNDRED\u003e on september \u003cTWO_TEN\u003e at \u003cONE_\u003e \u003cTWO_TEN\u003e pm on bse the company enjoys a market capitalisation of \u003cFOUR_THOUSAND\u003e crore jtl industries stock price hit \u003cFIVE_TEN\u003e week high on february \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cTWO_HUNDRED\u003e as per nse according to the companys statement the board will discuss the sub division split of equity shares of the company having a face value of rs \u003cTWO_\u003e each shall be in such manner as the board may decide in addition to the stock split the board meeting agenda will include \u003cONE_\u003e a proposal to issue bonus shares to equity shareholders 2 an increase in the companys authorized share capital 3 consequent alterations to the companys memorandum of association 4 any other items permitted by the chairman the steel tubes and pipes manufacturer saw its revenue climb to \u003cFIVE_HUNDRED\u003e crore in the april june quarter marking an improvement from \u003cFIVE_HUNDRED\u003e crore recorded in the corresponding period of the last fiscal year despite a slight uptick in expenses which rose to \u003cFOUR_HUNDRED\u003e crore from \u003cFOUR_HUNDRED\u003e crore year over year the company managed to boost its profitability while the exact profit figure for the current quarter was not provided in your message its clear that it surpassed the \u003cTWO_TEN\u003e crore profit reported in the first quarter of the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal year in compliance with regulatory requirements the company has also closed its trading window for insiders the statement noted the trading window for dealing in securities of the company is being closed with immediate effect it shall remain closed till \u003cFOUR_TEN\u003e hours after the declaration of un audited financial results for the quarter and six months ended \u003cTHREE_TEN\u003e th september \u003cTWO_THOUSAND\u003e for all promoters promoter group directors kmps designated person s connected person s insiders and their immediate relatives as covered under the code","timestamp":"2024-09-24T13:19:00+05:30","market_timestamp":"2024-09-24T13:19:00+05:30","off_market_hours":false}