{"url":"https://www.livemint.com/market/stock-market-news/delta-corp-shares-gain-10-after-board-approves-demerger-of-hospitality-and-real-estate-business-11727236129283.html","title":"Delta Corp shares gain 10% after board approves demerger of hospitality and real estate business","description":"Delta Corp, a diversified company in gaming and hospitality, saw a 10 per cent share price increase following its announcement of a demerger. The hospitality and real estate segment will be managed by a subsidiary, pending regulatory approvals, allowing Delta to focus on its core gaming business.","content":"Shares of Delta Corp, an online gaming firm, surged by 10 per cent in early morning trading today, reaching  ₹142.20 per share after the company announced the demerger of its hospitality and real estate businesses. The Board of Directors approved the demerger during a meeting held on September 24, 2024, through a Composite Scheme of Arrangement.Delta Penland Private Limited (DPPL), a wholly owned subsidiary of Delta Corp, will manage the hospitality and real estate business. DPPL is currently in the process of converting from a private limited company to a public company, pending the necessary approvals.The Hospitality and Real Estate segment of Delta Corp includes several key assets: Deltin Suites, a 106-room all-suite hotel with a casino in Goa; The Deltin, a 176-room five-star deluxe property and the largest integrated resort spanning 10 acres in Daman; Marvel Resorts, a proposed hotel with approximately 440 rooms under advanced construction in Goa; and land in Dhargalim, Goa, earmarked for developing an integrated resort with a water park over 88 acres, as per the company's regulatory filing.The company also holds investments in various hospitality and real estate ventures. This demerger is expected to allow Delta Corp. to concentrate on its core gaming business, enhancing operational efficiency and accountability.The scheme is subject to approval from the company's shareholders, stock exchanges, SEBI, NCLT, and other necessary regulatory bodies, which is expected to take between 10 to 12 months.Once the scheme becomes effective, all shareholders of the company will be the ultimate beneficial owners of the resulting company in the same proportion as they hold shares in the current company.The shares of the resulting company will be listed on the stock exchanges following the scheme. According to the company, this scheme will not impact employees, customers, or business partners.The company shares have been on a downward trend since July 2023 and have so far lost 31.5 per cent of their value. Delta Corp is the only listed company engaged in the gaming (live, electronic, and online) and hospitality space in India.Incorporated in 1990 as a textiles and real estate consultancy company, Delta Corp. has evolved into diversified segments like casino gaming, online gaming, hospitality, and real estate. Delta Corp., along with its subsidiaries, owns and operates the 'Deltin' brand of luxury casinos in the states of Goa and Sikkim.","cleaned_content":"shares of delta corp an online gaming firm surged by \u003cONE_TEN_PERCENT\u003e in early morning trading today reaching \u003cONE_HUNDRED\u003e per share after the company announced the demerger of its hospitality and real estate businesses the board of directors approved the demerger during a meeting held on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e through a composite scheme of arrangement delta penland private limited dppl a wholly owned subsidiary of delta corp will manage the hospitality and real estate business dppl is currently in the process of converting from a private limited company to a public company pending the necessary approvals the hospitality and real estate segment of delta corp includes several key assets deltin suites a \u003cONE_HUNDRED\u003e room all suite hotel with a casino in goa the deltin a \u003cONE_HUNDRED\u003e room five star deluxe property and the largest integrated resort spanning \u003cONE_TEN\u003e acres in daman marvel resorts a proposed hotel with approximately \u003cFOUR_HUNDRED\u003e rooms under advanced construction in goa and land in dhargalim goa earmarked for developing an integrated resort with a water park over \u003cEIGHT_TEN\u003e acres as per the companys regulatory filing the company also holds investments in various hospitality and real estate ventures this demerger is expected to allow delta corp to concentrate on its core gaming business enhancing operational efficiency and accountability the scheme is subject to approval from the companys shareholders stock exchanges sebi nclt and other necessary regulatory bodies which is expected to take between \u003cONE_TEN\u003e to \u003cONE_TEN\u003e months once the scheme becomes effective all shareholders of the company will be the ultimate beneficial owners of the resulting company in the same proportion as they hold shares in the current company the shares of the resulting company will be listed on the stock exchanges following the scheme according to the company this scheme will not impact employees customers or business partners the company shares have been on a downward trend since july \u003cTWO_THOUSAND\u003e and have so far lost \u003cTHREE_TEN_PERCENT\u003e of their value delta corp is the only listed company engaged in the gaming live electronic and online and hospitality space in india incorporated in \u003cONE_THOUSAND\u003e as a textiles and real estate consultancy company delta corp has evolved into diversified segments like casino gaming online gaming hospitality and real estate delta corp along with its subsidiaries owns and operates the deltin brand of luxury casinos in the states of goa and sikkim","timestamp":"2024-09-25T09:49:00+05:30","market_timestamp":"2024-09-25T09:49:00+05:30","off_market_hours":false}