{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-vijaya-diagnostic-to-kohinoor-foods-sumeet-bagadia-recommends-five-shares-to-buy-today-11727749028287.html","title":"Breakout stocks to buy or sell: Vijaya Diagnostic to Kohinoor Foods — Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Kohinoor Foods, Asian Hotels (East), Saregama India, VLS Finance, and Vijaya Diagnostic Centre","content":"Breakout stocks to buy or sell: Following weak global market sentiments on rising tensions in the Middle East and fear of funds moving to China, the Indian stock market ended lower for the second straight session on Monday. The Nifty 50 index crashed 368 points and closed at the 25,810 mark; the BSE Sensex nosedived 1,272 points and finished at 84,299, whereas the Nifty Bank index tanked 856 points and ended at 52,978. Cash market volumes on the NSE fell 32% compared to the previous session. The Small-cap index ended marginally in the green even as the advance-decline ratio fell to 0.67:1.Sumeet Bagadia, Executive Director at Choice Broking, believes the Indian stock market mood has turned cautious as the Nifty 50 index ended below the psychological 26,000 mark on Monday. The Choice Broking expert said that the 50-stock index failed to breach the 26,250 to 26,300 hurdle, and the frontline index has now a vital support placed at 26,650. If this base is breached, the Nifty 50 index may go down towards the 26,450 to 26,400 zone. He advised investors to maintain a stock-specific approach and look at the stocks looking strong on the technical chart. He also advised investors to look at breakout stocks for intraday trading.Speaking on the outlook of the Indian stock market today, Sumeet Bagadia said, 'After facing hurdle at around 26,250 to 26,300 range, the 50-stock index finally slipped below 26,000 mark and even breached the crucial support placed in 26,850 to 26,900 range. Now, the 50-stock index has immediate support placed at the 26,650 mark. So, the Indian stock market is expected to trade cautiously today as investors would like to see whether or not the 50-stock index sustains above 26,650 support. On breaching below this support, the 50-stock index may soon touch the 26,450 to 26,400 zone.\"Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: Kohinoor Foods, Asian Hotels (East), Saregama India, VLS Finance, and Vijaya Diagnostic Centre.1] Kohinoor Foods: Buy at  ₹51, target  ₹64.50, stop loss  ₹49.50;2] Asian Hotels (East): Buy at  ₹160, target  ₹169, stop loss  ₹154;3] Saregama India: Buy at  ₹625, target  ₹666, stop loss  ₹605;4] VLS Finance: Buy at  ₹427, target  ₹455, stop loss  ₹412; and5] Vijaya Diagnostic Centre: Buy at  ₹960, target  ₹1020, stop loss  ₹925.","cleaned_content":"breakout stocks to buy or sell following weak global market sentiments on rising tensions in the middle east and fear of funds moving to china the indian stock market ended lower for the second straight session on monday the nifty \u003cFIVE_TEN\u003e index crashed \u003cTHREE_HUNDRED\u003e points and closed at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex nosedived \u003cONE_THOUSAND\u003e points and finished at \u003cEIGHT_TEN_THOUSAND\u003e whereas the nifty bank index tanked \u003cEIGHT_HUNDRED\u003e points and ended at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse fell \u003cTHREE_TEN_PERCENT\u003e compared to the previous session the small cap index ended marginally in the green even as the advance decline ratio fell to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes the indian stock market mood has turned cautious as the nifty \u003cFIVE_TEN\u003e index ended below the psychological \u003cTWO_TEN_THOUSAND\u003e mark on monday the choice broking expert said that the \u003cFIVE_TEN\u003e stock index failed to breach the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e hurdle and the frontline index has now a vital support placed at \u003cTWO_TEN_THOUSAND\u003e if this base is breached the nifty \u003cFIVE_TEN\u003e index may go down towards the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zone he advised investors to maintain a stock specific approach and look at the stocks looking strong on the technical chart he also advised investors to look at breakout stocks for intraday trading speaking on the outlook of the indian stock market today sumeet bagadia said after facing hurdle at around \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range the \u003cFIVE_TEN\u003e stock index finally slipped below \u003cTWO_TEN_THOUSAND\u003e mark and even breached the crucial support placed in \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range now the \u003cFIVE_TEN\u003e stock index has immediate support placed at the \u003cTWO_TEN_THOUSAND\u003e mark so the indian stock market is expected to trade cautiously today as investors would like to see whether or not the \u003cFIVE_TEN\u003e stock index sustains above \u003cTWO_TEN_THOUSAND\u003e support on breaching below this support the \u003cFIVE_TEN\u003e stock index may soon touch the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zone regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares kohinoor foods asian hotels east saregama india vls finance and vijaya diagnostic centre 1 kohinoor foods buy at \u003cFIVE_TEN\u003e target \u003cSIX_TEN\u003e stop loss \u003cFOUR_TEN\u003e \u003cTWO_\u003e asian hotels east buy at \u003cONE_HUNDRED\u003e target \u003cONE_HUNDRED\u003e stop loss \u003cONE_HUNDRED\u003e \u003cTHREE_\u003e saregama india buy at \u003cSIX_HUNDRED\u003e target \u003cSIX_HUNDRED\u003e stop loss \u003cSIX_HUNDRED\u003e \u003cFOUR_\u003e vls finance buy at \u003cFOUR_HUNDRED\u003e target \u003cFOUR_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e and5 vijaya diagnostic centre buy at \u003cNINE_HUNDRED\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cNINE_HUNDRED\u003e","timestamp":"2024-10-01T08:14:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}