{"url":"https://www.livemint.com/market/stock-market-news/unilex-colours-and-chemicals-shares-make-muted-debut-lists-at-rs-89-on-nse-sme-up-2-3-from-ipo-price-11727928530574.html","title":"Unilex Colours and Chemicals shares make muted debut, list 2.3% higher over IPO price at  ₹89 on NSE SME","description":"Shares of Unilex Colours and Chemicals made a muted debut on the bourses on Thursday, listing at  ₹89 on NSE SME, a premium of just 2.3 per cent over IPO price of  ₹87.","content":"Unilex Colours and Chemicals IPO listing: Shares of Unilex Colours and Chemicals made a muted debut on the bourses on Thursday, 3 October as they listed at  ₹89 on NSE SME, a premium of just 2.3 per cent over the IPO price of  ₹87.The SME IPO, valued at  ₹31.32 crore, was open for subscription from September 25 to September 27. The IPO was priced in the range of  ₹82-87 per share.Following the three-day bidding process, Unilex Colours IPO closed with a strong demand, with the issue garnering 35.03 times subscription. The IPO received bids for 8.36 crore shares against 23.87 lakh shares on offer. The retail investor segment saw a subscription of 35.11 times, while the non-institutional investors (NII) category was booked a massive 60.74 times. Meanwhile, the qualified institutional buyers (QIBs) quota was subscribed 15.58 times.The Unilex Colours IPO was entirely a fresh issue of 36 lakh shares. There was no offer-for-sale component in the IPO. The minimum application size for retail investors was set at 1,600 shares, requiring an investment of  ₹1.39 lakh. The IPO allotment date was September 30.The company plans to utilise the proceeds from the issue to address several objectives, including meeting its working capital requirements, repaying a portion of certain borrowings, and supporting general corporate purposes.Hem Securities Limited acted as the book-running lead manager of the Unilex Colours and Chemicals IPO, while Link Intime India Private was the registrar for the issue. The market maker for Unilex Colours and Chemicals IPO was Hem Finlease.Unilex Colours and Chemicals Limited, established in March 2001, specialises in manufacturing pigments, trading chemicals, and producing food colours. The company markets its products under the \"Unilex\" brand, serving both domestic and international markets. It offers a variety of pigment solutions across industries and provides packaging options like multi-layer paper bags, corrugated boxes, HDPE and HDPE-coated bags, multi-layer liners, HM covers, wooden pallets, and jumbo bags.Financially, the company saw a 3% increase in revenue and a 24% rise in profit after tax (PAT) between the fiscal years ending March 31, 2024, and March 31, 2023.","cleaned_content":"unilex colours and chemicals ipo listing shares of unilex colours and chemicals made a muted debut on the bourses on thursday \u003cTHREE_\u003e october as they listed at \u003cEIGHT_TEN\u003e on nse sme a premium of just \u003cTWO_PERCENT\u003e over the ipo price of \u003cEIGHT_TEN\u003e the sme ipo valued at \u003cTHREE_TEN\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTWO_TEN\u003e the ipo was priced in the range of \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN\u003e per share following the three day bidding process unilex colours ipo closed with a strong demand with the issue garnering \u003cTHREE_TEN\u003e times subscription the ipo received bids for \u003cEIGHT_\u003e crore shares against \u003cTWO_TEN\u003e lakh shares on offer the retail investor segment saw a subscription of \u003cTHREE_TEN\u003e times while the non institutional investors nii category was booked a massive \u003cSIX_TEN\u003e times meanwhile the qualified institutional buyers qibs quota was subscribed \u003cONE_TEN\u003e times the unilex colours ipo was entirely a fresh issue of \u003cTHREE_TEN\u003e lakh shares there was no offer for sale component in the ipo the minimum application size for retail investors was set at \u003cONE_THOUSAND\u003e shares requiring an investment of \u003cONE_\u003e lakh the ipo allotment date was september \u003cTHREE_TEN\u003e the company plans to utilise the proceeds from the issue to address several objectives including meeting its working capital requirements repaying a portion of certain borrowings and supporting general corporate purposes hem securities limited acted as the book running lead manager of the unilex colours and chemicals ipo while link intime india private was the registrar for the issue the market maker for unilex colours and chemicals ipo was hem finlease unilex colours and chemicals limited established in march \u003cTWO_THOUSAND\u003e specialises in manufacturing pigments trading chemicals and producing food colours the company markets its products under the unilex brand serving both domestic and international markets it offers a variety of pigment solutions across industries and provides packaging options like multi layer paper bags corrugated boxes hdpe and hdpe coated bags multi layer liners hm covers wooden pallets and jumbo bags financially the company saw a \u003cTHREE_PERCENT\u003e increase in revenue and a \u003cTWO_TEN_PERCENT\u003e rise in profit after tax pat between the fiscal years ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-03T10:02:00+05:30","market_timestamp":"2024-10-03T10:02:00+05:30","off_market_hours":false}