{"url":"https://www.livemint.com/market/stock-market-news/abhiram-eleswarapu-of-bnp-paribas-has-this-suggestion-for-investors-in-falling-indian-stock-market-11727674425706.html","title":"Abhiram Eleswarapu of BNP Paribas has this suggestion for investors in falling Indian stock market","description":"Expert View- Abhiram Eleswarapu, Head of Equities, BNP Paribas said that Indian stock market valuations are considerably above their own historical average and versus Asian peers. He thinks that some degree of caution via a more defensive positioning is warranted in the near term.","content":"Expert View- Indian stock market valuations are considerably above their own historical average, and versus Asian peers, said Abhiram Eleswarapu, Head of Equities, BNP Paribas talking to Mint. There is a high level of optimism as reflected in the strong domestic flows into equities and the interest in IPOs. Therefore Abhiram thinks some degree of caution via a more defensive positioning is warranted in the near term. Edited ExcerptsThat the Fed would cut rates was widely expected, though the quantum of 50bp was somewhat of a surprise. Rarely has monetary policy been tightened in response to inflation without translating into a fully-fledged recession. However, we think that it may be different this time with GDP growth likely to remain at or slightly below trend, characterizing a soft landing. While the US labour market may have slowed, unlike with previous recessions, layoffs remain low. Furthermore, positive real wage growth, healthy services PMIs, resilient credit spreads and recovering lending surveys suggest that a US recession will be avoided.A tight US election has usually been preceded by a pullback, but rate cuts during soft landings have seen the markets moving higher. From that perspective, global cues are mixed. Meanwhile, the stimulus in China has been well-received by investors.India’s structural drivers are very much intact, including the twin deficits being in control, the banking system being in good shape and corporate leverage being low. Furthermore, equities have consistently provided higher after tax returns compared to other asset classes.Over the past year, institutional investors – both foreign and domestic - have reduced their exposure to financials, while allocating more to new-age companies, power, capital goods and telecoms. Local investors have also tilted towards defensive sectors such as consumer staples, IT and healthcare since the elections. This has resulted in financials underperforming the broader markets and their valuations looking more attractive. With China’s stimulus, commodities are another area that could see an increased interest. In the case of consumer staples, we expect earnings to disappoint and the stocks to consolidate.We think that synchronised rate cuts globally could result in increased interest in emerging markets as an asset class. Higher allocations for emerging markets are positive for both India and China. Chinese equities have significantly underperformed Indian equities and a change in sentiment could result in larger allocations there. That said, investors will also likely wait for improved Chinese data to take a more structural view of the market, especially given similar rallies in the past couple of years fizzled out within a few weeks","cleaned_content":"expert view indian stock market valuations are considerably above their own historical average and versus asian peers said abhiram eleswarapu head of equities bnp paribas talking to mint there is a high level of optimism as reflected in the strong domestic flows into equities and the interest in ipos therefore abhiram thinks some degree of caution via a more defensive positioning is warranted in the near term edited excerptsthat the fed would cut rates was widely expected though the quantum of \u003cFIVE_TEN\u003e bp was somewhat of a surprise rarely has monetary policy been tightened in response to inflation without translating into a fully fledged recession however we think that it may be different this time with gdp growth likely to remain at or slightly below trend characterizing a soft landing while the us labour market may have slowed unlike with previous recessions layoffs remain low furthermore positive real wage growth healthy services pmis resilient credit spreads and recovering lending surveys suggest that a us recession will be avoided a tight us election has usually been preceded by a pullback but rate cuts during soft landings have seen the markets moving higher from that perspective global cues are mixed meanwhile the stimulus in china has been well received by investors india s structural drivers are very much intact including the twin deficits being in control the banking system being in good shape and corporate leverage being low furthermore equities have consistently provided higher after tax returns compared to other asset classes over the past year institutional investors both foreign and domestic have reduced their exposure to financials while allocating more to new age companies power capital goods and telecoms local investors have also tilted towards defensive sectors such as consumer staples it and healthcare since the elections this has resulted in financials underperforming the broader markets and their valuations looking more attractive with china s stimulus commodities are another area that could see an increased interest in the case of consumer staples we expect earnings to disappoint and the stocks to consolidate we think that synchronised rate cuts globally could result in increased interest in emerging markets as an asset class higher allocations for emerging markets are positive for both india and china chinese equities have significantly underperformed indian equities and a change in sentiment could result in larger allocations there that said investors will also likely wait for improved chinese data to take a more structural view of the market especially given similar rallies in the past couple of years fizzled out within a few weeks","timestamp":"2024-09-30T13:31:00+05:30","market_timestamp":"2024-09-30T13:31:00+05:30","off_market_hours":false}