{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-today-rajesh-palviya-of-axis-securities-recommends-these-three-stocks-to-buy-on-friday-sept-27-11727414462071.html","title":"Shares to buy today: Rajesh Palviya of Axis Securities recommends these three stocks to buy on Friday — Sept 27","description":"Shares to buy today: Rajesh Palviya recommends three stocks to buy on Friday — Elecon Engineering, Apollo Tyres, and GAIL India","content":"Shares to buy today: Indian stock market indices Sensex and Nifty 50 have been hitting record highs, led by positive momentum in global equities that gathered pace after the US Federal Reserve's outsized interest rate cut last week. On Thursday, cash market volumes on the NSE were 15% higher than the previous day. The broad market indices ended negatively even as the advance-decline ratio remained almost flat at 0.70:1.Rajesh Palviya, SVP—Technical and Derivatives Research at Axis Securities, believes that bullish sentiment on Dalal Street is intact. The Axis Securities expert said that the nifty 50 index is heading towards 26,700 as the 50-stock index has formed a series of higher tops and bottoms.Speaking on the outlook of the Indian stock market today, Rajesh Malviya said, \"The benchmark index has reached an all-time high at 26250, showing bullish sentiments. The index continues to trend higher, forming a series of higher tops and bottoms, indicating a strong uptrend. The index has sustained above its 20-day SMA (25405), indicating a positive bias. The crucial support zone is around 26000-25800 levels, while on the upside, the index is likely to extend towards 26500-26700 levels.\"Regarding stocks to buy today, Rajesh Malviya recommended buying these three shares: Elecon Engineering, Apollo Tyres, and GAIL India.1] Elecon Engineering: On the daily chart, the stock has experienced a \"rounding bottom\" breakout at  ₹690 on a closing basis. This breakout is accompanied by significant volumes, signifying increased participation. The stock is well positioned above its 20, 50, 100, and 200-day SMA, and these averages are also rising along with the price, confirming the bullish trend. The daily \"Bollinger Bands\" buy signal indicates increased momentum. Additionally, the daily, weekly, and monthly RSI strength indicators are in favourable terrain, justifying rising strength across all time frames.Investors should buy, hold, and accumulate this stock, which has an expected upside of  ₹755 and  ₹800 and a downside support zone of  ₹666 to  ₹650.2] Apollo Tyres: On the daily and weekly timeframes, the stock has confirmed a \"multiple resistance\" breakout at the  ₹560 level on a closing basis. This breakout is accompanied by huge volumes, signifying increased participation. The daily and weekly Bollinger Bands indicate a buy signal, showing increased momentum. The daily, weekly, and monthly strength indicator RSI is in favourable terrain, justifying rising strength across all timeframes. Recently, the stock has recaptured its 20, 50, and 100-day SMA and rebounded sharply, confirming the bullish trend.Investors should buy, hold, and accumulate this stock, which has an expected upside of  ₹625 to  ₹700 and a downside support zone of  ₹545 to  ₹528.3] GAIL India: The stock has experienced a sharp rebound and significant trading volumes in the last five sessions, indicating a rapid recovery. This buying activity was observed from the multiple support zone around  ₹210, which continues to be a crucial support area. The daily strength indicator RSI is in favourable terrain, suggesting increasing strength.Investors should buy, hold, and accumulate this stock, which has an expected upside of  ₹240 to  ₹255 and a downside support zone of  ₹225 to  ₹220.","cleaned_content":"shares to buy today indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e have been hitting record highs led by positive momentum in global equities that gathered pace after the us federal reserves outsized interest rate cut last week on thursday cash market volumes on the nse were \u003cONE_TEN_PERCENT\u003e higher than the previous day the broad market indices ended negatively even as the advance decline ratio remained almost flat at \u003cZERO_\u003e \u003cONE_\u003e rajesh palviya svp technical and derivatives research at axis securities believes that bullish sentiment on dalal street is intact the axis securities expert said that the nifty \u003cFIVE_TEN\u003e index is heading towards \u003cTWO_TEN_THOUSAND\u003e as the \u003cFIVE_TEN\u003e stock index has formed a series of higher tops and bottoms speaking on the outlook of the indian stock market today rajesh malviya said the benchmark index has reached an all time high at \u003cTWO_TEN_THOUSAND\u003e showing bullish sentiments the index continues to trend higher forming a series of higher tops and bottoms indicating a strong uptrend the index has sustained above its \u003cTWO_TEN\u003e day sma \u003cTWO_TEN_THOUSAND\u003e indicating a positive bias the crucial support zone is around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels while on the upside the index is likely to extend towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels regarding stocks to buy today rajesh malviya recommended buying these three shares elecon engineering apollo tyres and gail india 1 elecon engineering on the daily chart the stock has experienced a rounding bottom breakout at \u003cSIX_HUNDRED\u003e on a closing basis this breakout is accompanied by significant volumes signifying increased participation the stock is well positioned above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma and these averages are also rising along with the price confirming the bullish trend the daily bollinger bands buy signal indicates increased momentum additionally the daily weekly and monthly rsi strength indicators are in favourable terrain justifying rising strength across all time frames investors should buy hold and accumulate this stock which has an expected upside of \u003cSEVEN_HUNDRED\u003e and \u003cEIGHT_HUNDRED\u003e and a downside support zone of \u003cSIX_HUNDRED\u003e to \u003cSIX_HUNDRED\u003e apollo tyres on the daily and weekly timeframes the stock has confirmed a multiple resistance breakout at the \u003cFIVE_HUNDRED\u003e level on a closing basis this breakout is accompanied by huge volumes signifying increased participation the daily and weekly bollinger bands indicate a buy signal showing increased momentum the daily weekly and monthly strength indicator rsi is in favourable terrain justifying rising strength across all timeframes recently the stock has recaptured its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e and \u003cONE_HUNDRED\u003e day sma and rebounded sharply confirming the bullish trend investors should buy hold and accumulate this stock which has an expected upside of \u003cSIX_HUNDRED\u003e to \u003cSEVEN_HUNDRED\u003e and a downside support zone of \u003cFIVE_HUNDRED\u003e to \u003cFIVE_HUNDRED\u003e gail india the stock has experienced a sharp rebound and significant trading volumes in the last five sessions indicating a rapid recovery this buying activity was observed from the multiple support zone around \u003cTWO_HUNDRED\u003e which continues to be a crucial support area the daily strength indicator rsi is in favourable terrain suggesting increasing strength investors should buy hold and accumulate this stock which has an expected upside of \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e and a downside support zone of \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e","timestamp":"2024-09-27T11:10:00+05:30","market_timestamp":"2024-09-27T11:10:00+05:30","off_market_hours":false}