{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-one-point-one-solutions-shares-rally-over-6-on-these-business-updates-11727074676396.html","title":"Small-cap stock One Point One Solutions shares rally over 6% on these business updates","description":"One Point One Solutions share price has rallied over 17% in three months and more than 42% year-to-date (YTD). The smallcap stock has given 112% return in one year and multibagger return of 1,640% in three years.","content":"One Point One Solutions share price surged over 6% after the company secured two contracts from foreign based companies. One Point One Solutions shares rallied as much as 6.58% to a high of  ₹74.28 apiece on NSE. After touching this intraday high, the stock came under the profit-booking pressure and retraced from the intraday high.One Point One Solutions on September 23 announced a significant contract win with a prominent publicly listed Swedish company.The client, with a vast international footprint including Sweden, India and the United States, has entrusted One Point One Solutions with three major development projects - Customer Specification Application (CSA), Payroll Management Platform and User Experience App for Industrial Flow Heater.“This contract marks a pivotal moment in our expansion strategy. The U.S. market is ripe with opportunities, and our recent engagements have demonstrated strong interest from many prospects. With this partnership, we are poised to leverage our expertise in technology and customer service to drive significant value for our clients,” said Akshay Chhabra, Chairman \u0026 Managing Director of One Point One Solutions Ltd.The business process management solutions company, One Point One Solutions Ltd also announced a significant contract with a prominent telehealth company headquartered in Atlanta, USA, strengthening its presence in the healthcare vertical.Under this contract, One Point One Solutions will partner with the telehealth company to provide contact centre solutions and data verification services. This collaboration will enable One Point One Solutions to further strengthen its portfolio under the healthcare vertical, positioning the company for success in upcoming industry summits like the Mass Tort event in Las Vegas, it said in a regulatory filing.One Point One Solutions share price has rallied over 17% in three months and more than 42% year-to-date (YTD). The smallcap stock has given 112% return in one year and multibagger return of 1,640% in three years.At 12:40 pm, One Point One Solutions shares were trading 3.24% higher at  ₹71.95 apiece on the NSE.","cleaned_content":"one point one solutions share price surged over \u003cSIX_PERCENT\u003e after the company secured two contracts from foreign based companies one point one solutions shares rallied as much as \u003cSIX_PERCENT\u003e to a high of \u003cSEVEN_TEN\u003e apiece on nse after touching this intraday high the stock came under the profit booking pressure and retraced from the intraday high one point one solutions on september \u003cTWO_TEN\u003e announced a significant contract win with a prominent publicly listed swedish company the client with a vast international footprint including sweden india and the united states has entrusted one point one solutions with three major development projects customer specification application csa payroll management platform and user experience app for industrial flow heater this contract marks a pivotal moment in our expansion strategy the u s market is ripe with opportunities and our recent engagements have demonstrated strong interest from many prospects with this partnership we are poised to leverage our expertise in technology and customer service to drive significant value for our clients said akshay chhabra chairman managing director of one point one solutions ltd the business process management solutions company one point one solutions ltd also announced a significant contract with a prominent telehealth company headquartered in atlanta usa strengthening its presence in the healthcare vertical under this contract one point one solutions will partner with the telehealth company to provide contact centre solutions and data verification services this collaboration will enable one point one solutions to further strengthen its portfolio under the healthcare vertical positioning the company for success in upcoming industry summits like the mass tort event in las vegas it said in a regulatory filing one point one solutions share price has rallied over \u003cONE_TEN_PERCENT\u003e in three months and more than \u003cFOUR_TEN_PERCENT\u003e year to date ytd the smallcap stock has given \u003cONE_HUNDRED_PERCENT\u003e return in one year and multibagger return of \u003cONE_THOUSAND_PERCENT\u003e in three years at \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e pm one point one solutions shares were trading \u003cTHREE_PERCENT\u003e higher at \u003cSEVEN_TEN\u003e apiece on the nse","timestamp":"2024-09-23T12:41:00+05:30","market_timestamp":"2024-09-23T12:41:00+05:30","off_market_hours":false}