{"url":"https://www.livemint.com/market/stock-market-news/september-rally-nifty-50-sensex-gain-over-2-3-amid-robust-fpi-inflows-metal-stocks-sizzle-11727696347628.html","title":"September Rally: Nifty 50, Sensex gain over 2.3% amid robust FPI inflows; metal stocks sizzle","description":"The Nifty 50 wrapped up September with a gain of 2.3%, while the Sensex also surged 2.35%. Metal stocks emerged as the top performers in September, with the Nifty Metal index surging 8.43%, marking its second-largest monthly gain of the year.","content":"In September, Indian markets enjoyed a series of record highs, but on the final trading day of the month, investors opted for profit booking, leading to a sharp correction. Both the Nifty 50 and the Sensex fell by over 1.4% today, marking their steepest intraday decline in two months.Despite this downturn, both indices ended the month on a positive note, with metals and realty stocks leading the rally. Investor sentiment was buoyed by an aggressive interest rate cut by the US Federal Reserve and long-awaited stimulus measures from China.These global developments boosted market confidence, leading to significant foreign portfolio investor (FPI) inflows that complemented the already strong domestic inflows. Moreover, softer commodity prices, especially oil, robust domestic liquidity, and favourable monsoon conditions supported the market's rise to record-high levels.The increase in metal prices, alongside a good monsoon season, resulted in a significant surge in metal and FMCG stocks. The financial sector also saw a notable rotation, indicating shifting investor preferences, while the IT sector gained traction amid a resurgence in deal signings, signalling a recovery in business activity and technology investments.Auto stocks, too, resumed their upward trend this month in hopes of an uptick in sales during the ongoing festive season.The Nifty 50 wrapped up September with a gain of 2.3%, while the Sensex surged 2.35%. Year-to-date, the Nifty 50 has rocketed from 21,727 points to its current value of 25,810 points, marking an impressive gain of 18.77%. Notably, the index has not recorded a single monthly fall exceeding 0.50%.So far this year, the index has posted gains in seven out of the nine months, with June recording the highest monthly gain of 6.57%, driven by optimism around policy continuity. July followed with a solid 4% increase.Impressively, the Nifty 50 has set new record highs more than 50 times over the past nine months. Its latest milestone occurred during Friday’s trading session, when it surpassed the 26,250 mark, reaching an all-time high of 26,277 points.Similarly, the Sensex also achieved a significant milestone in September, crossing the 85,000 mark and touching 85,978 points, putting it just shy of the 86,000 level.Metal stocks emerged as the top performers in September, with the Nifty Metal index surging 8.43%, marking its second-largest monthly gain of the year. During the month, the index also crossed the 10,000 level for the first time in three months, reaching a new record high of 10,263 points.Two key factors have contributed to this strong recovery in metal stocks after three months of continuous decline. First, the US Federal Reserve's aggressive rate cut sparked optimism among investors.Lower interest rates are expected to boost construction activity, which in turn would drive higher demand for metals. This has also raised expectations that global central banks, including the Reserve Bank of India, could follow suit with monetary easing measures.Secondly, China's bold stimulus measures to revive its slowing economy, which has been struggling with deflationary pressures, played a significant role. These measures include interest rate cuts, a reduction in the Reserve Requirement Ratio (RRR), support for the property and capital markets, and fiscal stimulus.Together, these actions have significantly lifted metal prices in recent sessions, with several metals hitting multi-month highs, further fueling the rally in metal stocks.The US rate cut has triggered a sharp influx of FPI flows into Indian equities, highlighting growing confidence in India's stock markets, with many seeking to capitalise on strong economic growth and favourable market conditions.The smooth transition of power and formation of the new government post-elections had already created a favourable environment, and the rate cut has now accelerated FPI investments.FPIs have purchased stocks worth  ₹57,359 crore so far in September. These purchases are almost equivalent to the total investments made in the past three months combined. In June, July, and August, FPIs bought stocks worth  ₹26,565 crore,  ₹32,365 crore, and  ₹7,320 crore, respectively, according to data from the National Securities Depository Limited (NSDL).In six of the nine months through September, FPIs were net buyers, NSDL data showed.\"Total investment by FIIs so far in 2024 now stands at  ₹1,00,245 crore. This has contributed to the stability in INR this year. The September 18th rate cut and the dovish commentary by the Fed can be seen as a major pivot in interest rates. This can facilitate sustained flows to emerging markets like India,\" said Dr V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.Manoj Purohit, Partner and Leader - FS Tax, Tax and Regulatory Services, BDO India, said, \"Last week’s Fed rate cuts have increased the liquidity in the Indian markets since the Indian rupee got aided by currency fluctuations. This interest rate differential is expected to attract more FPI inflows into India.”He further added that SEBI has enhanced its efforts to attract investors by establishing a dedicated FPI Outreach Cell, aimed at direct engagement with foreign investors. The Cell will provide guidance to prospective FPIs during the pre-application stage, including assistance with documentation and compliance processes.The Cell will also offer support during the onboarding phase, addressing any operational challenges that may arise during the registration process or thereafter. With all eyes now on the upcoming SEBI Board Meeting on September 30, Purohit emphasised that it may bring forth discussions on fees and other announcements reflecting the government’s intention to make India a transparent, flexible, and easy-to-trade platform for offshore investors.","cleaned_content":"in september indian markets enjoyed a series of record highs but on the final trading day of the month investors opted for profit booking leading to a sharp correction both the nifty \u003cFIVE_TEN\u003e and the sensex fell by over \u003cONE_PERCENT\u003e today marking their steepest intraday decline in two months despite this downturn both indices ended the month on a positive note with metals and realty stocks leading the rally investor sentiment was buoyed by an aggressive interest rate cut by the us federal reserve and long awaited stimulus measures from china these global developments boosted market confidence leading to significant foreign portfolio investor fpi inflows that complemented the already strong domestic inflows moreover softer commodity prices especially oil robust domestic liquidity and favourable monsoon conditions supported the markets rise to record high levels the increase in metal prices alongside a good monsoon season resulted in a significant surge in metal and fmcg stocks the financial sector also saw a notable rotation indicating shifting investor preferences while the it sector gained traction amid a resurgence in deal signings signalling a recovery in business activity and technology investments auto stocks too resumed their upward trend this month in hopes of an uptick in sales during the ongoing festive season the nifty \u003cFIVE_TEN\u003e wrapped up september with a gain of \u003cTWO_PERCENT\u003e while the sensex surged \u003cTWO_PERCENT\u003e year to date the nifty \u003cFIVE_TEN\u003e has rocketed from \u003cTWO_TEN_THOUSAND\u003e points to its current value of \u003cTWO_TEN_THOUSAND\u003e points marking an impressive gain of \u003cONE_TEN_PERCENT\u003e notably the index has not recorded a single monthly fall exceeding \u003cZERO_PERCENT\u003e so far this year the index has posted gains in seven out of the nine months with june recording the highest monthly gain of \u003cSIX_PERCENT\u003e driven by optimism around policy continuity july followed with a solid \u003cFOUR_PERCENT\u003e increase impressively the nifty \u003cFIVE_TEN\u003e has set new record highs more than \u003cFIVE_TEN\u003e times over the past nine months its latest milestone occurred during friday s trading session when it surpassed the \u003cTWO_TEN_THOUSAND\u003e mark reaching an all time high of \u003cTWO_TEN_THOUSAND\u003e points similarly the sensex also achieved a significant milestone in september crossing the \u003cEIGHT_TEN_THOUSAND\u003e mark and touching \u003cEIGHT_TEN_THOUSAND\u003e points putting it just shy of the \u003cEIGHT_TEN_THOUSAND\u003e level metal stocks emerged as the top performers in september with the nifty metal index surging \u003cEIGHT_PERCENT\u003e marking its second largest monthly gain of the year during the month the index also crossed the \u003cONE_TEN_THOUSAND\u003e level for the first time in three months reaching a new record high of \u003cONE_TEN_THOUSAND\u003e points two key factors have contributed to this strong recovery in metal stocks after three months of continuous decline first the us federal reserves aggressive rate cut sparked optimism among investors lower interest rates are expected to boost construction activity which in turn would drive higher demand for metals this has also raised expectations that global central banks including the reserve bank of india could follow suit with monetary easing measures secondly chinas bold stimulus measures to revive its slowing economy which has been struggling with deflationary pressures played a significant role these measures include interest rate cuts a reduction in the reserve requirement ratio rrr support for the property and capital markets and fiscal stimulus together these actions have significantly lifted metal prices in recent sessions with several metals hitting multi month highs further fueling the rally in metal stocks the us rate cut has triggered a sharp influx of fpi flows into indian equities highlighting growing confidence in indias stock markets with many seeking to capitalise on strong economic growth and favourable market conditions the smooth transition of power and formation of the new government post elections had already created a favourable environment and the rate cut has now accelerated fpi investments fpis have purchased stocks worth \u003cFIVE_TEN_THOUSAND\u003e crore so far in september these purchases are almost equivalent to the total investments made in the past three months combined in june july and august fpis bought stocks worth \u003cTWO_TEN_THOUSAND\u003e crore \u003cTHREE_TEN_THOUSAND\u003e crore and \u003cSEVEN_THOUSAND\u003e crore respectively according to data from the national securities depository limited nsdl in six of the nine months through september fpis were net buyers nsdl data showed total investment by fiis so far in \u003cTWO_THOUSAND\u003e now stands at \u003cONE_HUNDRED_THOUSAND\u003e crore this has contributed to the stability in inr this year the september \u003cONE_TEN\u003e th rate cut and the dovish commentary by the fed can be seen as a major pivot in interest rates this can facilitate sustained flows to emerging markets like india said dr v k vijayakumar chief investment strategist geojit financial services manoj purohit partner and leader fs tax tax and regulatory services bdo india said last week s fed rate cuts have increased the liquidity in the indian markets since the indian rupee got aided by currency fluctuations this interest rate differential is expected to attract more fpi inflows into india he further added that sebi has enhanced its efforts to attract investors by establishing a dedicated fpi outreach cell aimed at direct engagement with foreign investors the cell will provide guidance to prospective fpis during the pre application stage including assistance with documentation and compliance processes the cell will also offer support during the onboarding phase addressing any operational challenges that may arise during the registration process or thereafter with all eyes now on the upcoming sebi board meeting on september \u003cTHREE_TEN\u003e purohit emphasised that it may bring forth discussions on fees and other announcements reflecting the government s intention to make india a transparent flexible and easy to trade platform for offshore investors","timestamp":"2024-09-30T18:05:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}