{"url":"https://www.livemint.com/market/stock-market-news/stock-in-focus-zee-media-shares-will-be-in-focus-despite-55-rally-last-week-details-here-11727511728891.html","title":"Stock in focus: Zee Media shares will be in focus despite 55% rally last week. Details here","description":"Zee Media shares have been on an uptrend for the last five straight sessions","content":"Stock in focus: Zee Media shares have been on an uptrend for the last one week. In the previous five straight sessions, Zee Media's share price has ascended from around  ₹13 to  ₹20.75 apiece on the NSE, recording a nearly 55% rally. However, the Zee Media stock is expected to remain in focus when the Indian stock market reopens on Monday. The reason for being under the radar of Indian stock market followers is the fundraising buzz. Even though the stock hit a 10% upper circuit on Friday after the board meeting outcome was announced ahead of the closing bell, it is still being determined whether the market has discounted this fundraising buzz or there is still some steam left in Zee Media shares.According to the exchange filing, Zee Media has proposed the issuance of up to 13,33,33,333 (Thirteen Crores Thirty-Three Lakhs Thirty-Three Thousand Three Hundred and Thirty-Three) warrants, fully convertible or exchangeable into one fully paid-up equity share each. These warrants are priced at  ₹15 apiece, not exceeding  ₹200 crore.The firm stated that an initial payment of 25% of the issue price would be required at the time of warrant subscription and allotment, with the remaining 75% to be paid upon exercising the conversion option within the specified 18-month period. The issue is subject to approval from the Company's members and other regulatory authorities as needed.In an exchange filing just ahead of the Closing Bell on Friday, Zee Media said, “We wish to inform you that the Board of Directors of the Company, at its meeting held today, i.e. Friday, September 27, 2024, have inter-alia considered and approved the issue of up to 13,33,33,333 (Thirteen Crores Thirty-Three Lakhs Thirty-Three Thousand Three Hundred and Thirty-Three Only) Warrants, fully convertible or exchangeable for, one fully paid-up equity share of the Company ('Warrants') at an issue price of Rs. 15/- (Rupees Fifteen Only) per Warrant, aggregating to an amount not exceeding Rs. 2,00,00,00,000/- (Rupees Two Hundred Crores Only), with the right to Warrant Holder(s) to apply for and be allotted 1 (One) fully paid Equity Share of the face value of Re. 1/- each of the Company for Rs. 15/- per Equity Share (including premium of Rs. 14/- per Equity Share) for each Warrant, with the amount paid against each Warrant be adjusted against the issue price for the resultant Equity Share, within 18 (Eighteen) months from the date of allotment of the Warrants to entities forming part of Non-promoter / Non-Promoter Group of the Company, on preferential issue basis, by Chapter V of the Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2018 ('SEBI ICDR Regulations'), Companies Act, 2013, as amended and other applicable laws and regulations and subject to the approval of Members and such other approval as may be required including approval from regulatory/statutory / government authorities. Further, an amount equivalent to 25% of the Issue Price shall be payable at the time of subscription and allotment of Warrants. The remaining 75% of the Issue Price shall be payable on the exercise of options against each such Warrant within 18 (Eighteen) months, in one or more tranches, from the date of allotment of the Warrants.”In six months, Zee Media shares have almost doubled shareholders' money as they surged from around  ₹10.40 to  ₹20.75 apiece, recording a nearly 99% rally. This practically multibagger stock has delivered around 50% returns to its shareholders in the last month.","cleaned_content":"stock in focus zee media shares have been on an uptrend for the last one week in the previous five straight sessions zee medias share price has ascended from around \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e apiece on the nse recording a nearly \u003cFIVE_TEN_PERCENT\u003e rally however the zee media stock is expected to remain in focus when the indian stock market reopens on monday the reason for being under the radar of indian stock market followers is the fundraising buzz even though the stock hit a \u003cONE_TEN_PERCENT\u003e upper circuit on friday after the board meeting outcome was announced ahead of the closing bell it is still being determined whether the market has discounted this fundraising buzz or there is still some steam left in zee media shares according to the exchange filing zee media has proposed the issuance of up to \u003cONE_HUNDRED_MILLION\u003e thirteen crores thirty three lakhs thirty three thousand three hundred and thirty three warrants fully convertible or exchangeable into one fully paid up equity share each these warrants are priced at \u003cONE_TEN\u003e apiece not exceeding \u003cTWO_HUNDRED\u003e crore the firm stated that an initial payment of \u003cTWO_TEN_PERCENT\u003e of the issue price would be required at the time of warrant subscription and allotment with the remaining \u003cSEVEN_TEN_PERCENT\u003e to be paid upon exercising the conversion option within the specified \u003cONE_TEN\u003e month period the issue is subject to approval from the companys members and other regulatory authorities as needed in an exchange filing just ahead of the closing bell on friday zee media said we wish to inform you that the board of directors of the company at its meeting held today i e friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e have inter alia considered and approved the issue of up to \u003cONE_HUNDRED_MILLION\u003e thirteen crores thirty three lakhs thirty three thousand three hundred and thirty three only warrants fully convertible or exchangeable for one fully paid up equity share of the company warrants at an issue price of rs \u003cONE_TEN\u003e rupees fifteen only per warrant aggregating to an amount not exceeding rs \u003cTWO_BILLION\u003e rupees two hundred crores only with the right to warrant holder s to apply for and be allotted \u003cONE_\u003e one fully paid equity share of the face value of re \u003cONE_\u003e each of the company for rs \u003cONE_TEN\u003e per equity share including premium of rs \u003cONE_TEN\u003e per equity share for each warrant with the amount paid against each warrant be adjusted against the issue price for the resultant equity share within \u003cONE_TEN\u003e eighteen months from the date of allotment of the warrants to entities forming part of non promoter non promoter group of the company on preferential issue basis by chapter v of the securities and exchange board of india issue of capital and disclosure requirements regulations \u003cTWO_THOUSAND\u003e sebi icdr regulations companies act \u003cTWO_THOUSAND\u003e as amended and other applicable laws and regulations and subject to the approval of members and such other approval as may be required including approval from regulatory statutory government authorities further an amount equivalent to \u003cTWO_TEN_PERCENT\u003e of the issue price shall be payable at the time of subscription and allotment of warrants the remaining \u003cSEVEN_TEN_PERCENT\u003e of the issue price shall be payable on the exercise of options against each such warrant within \u003cONE_TEN\u003e eighteen months in one or more tranches from the date of allotment of the warrants in six months zee media shares have almost doubled shareholders money as they surged from around \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e apiece recording a nearly \u003cNINE_TEN_PERCENT\u003e rally this practically multibagger stock has delivered around \u003cFIVE_TEN_PERCENT\u003e returns to its shareholders in the last month","timestamp":"2024-09-28T14:03:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}