{"url":"https://www.livemint.com/market/stock-market-news/sensex-nifty-crash-over-2-each-what-should-investors-do-now-11727946116986.html","title":"Sensex, Nifty crash over 2% each. What should investors do now?","description":"The Indian stock market plummeted over 2% on geopolitical tensions in the Middle East and weak global cues. Both Sensex and Nifty 50 fell sharply, marking four consecutive sessions of losses. Experts suggest caution amidst rising crude prices and foreign investor outflows.","content":"The Indian stock market crashed on Thursday, 3 October, with benchmark indices Sensex and Nifty 50 witnessing sharp declines of over 2 per cent each, driven by escalating geopolitical tensions in the Middle East and weak global cues. The broader markets followed suit, with Nifty Midcap and Nifty Smallcap indices tumbling more than 2 per cent each.With today's decline, both the benchmark indices have fallen around 4 per cent from their record high levels hit on September 27.On Thursday, the BSE Sensex fell 1,832.27 points, or 2.2 per cent, reaching a low of 82,434.02, while the Nifty 50 dropped 565 points, or 2.2 per cent, to touch 25,231.90. This marked the fourth consecutive session of losses for the indices, resulting in a 3.5 per cent decline in Nifty since September 27. The index has fallen by 2 per cent in October alone, after four months of continuous gains since June.All sectoral indices faced steep losses, with Nifty Auto, Financial Services, Realty, Private Bank, and Oil and Gas being the worst-hit, plunging 2.5 to 4.3 per cent. The Nifty Bank also dipped more than 2 per cent, while FMCG, IT, and PSU Bank indices registered losses exceeding 1.5 per cent.The key driver behind this market crash was the escalating tensions in the Middle East, following Iran’s missile barrage on Israel. In retaliation for the killing of Hezbollah’s Hassan Nasrallah, Iran launched 200 missiles, raising the spectre of a full-fledged war. Israel vowed to make Iran pay for the attack, leading to ground incursions into Lebanon targeting Hezbollah militia. In the latest development, the Guardian reported that at least six people have been killed and seven injured in an Israeli attack on a health centre in central Beirut.Adding to the pressure were mixed global cues from Asian markets, where MSCI’s index of Asia-Pacific shares fell by 1 per cent, led by Hong Kong’s Hang Seng index, which declined by 1.6 per cent. The Securities and Exchange Board of India's (SEBI) new rules for derivatives trading, including a significant hike in minimum trading amounts, further dampened sentiment on Dalal Street.Meanwhile, foreign portfolio investors (FPIs) continued their selling, with outflows of over  ₹6,000 crore worth of Indian equities in just one session, further contributing to the market’s downturn. Rising crude oil prices, now around $75 per barrel, added to investor concerns, as higher oil prices are expected to strain India's fiscal balance.Amid the escalating Iran-Israel conflict and heightened volatility in global markets, experts recommend a cautious approach for investors.Trivesh D, COO of Tradejini, stated that the Iran-Israel conflict is significantly impacting global markets, with the energy sector seeing the sharpest gains. He also noted that the rise in Brent crude oil prices could pressurise India’s fiscal deficit. He advised investors to be cautious, as the markets are showing increased volatility.\"Things have taken a sharp turn as Iran and Israel are now at war. Surprisingly, the US and European markets have remained flat, but the impact is starting to show elsewhere, especially in the energy sector. Brent crude oil has risen to $75 a barrel from $70, boosting oil stocks in India. However, the broader Indian market is flashing red.Rising oil prices could add pressure to India's fiscal deficit, forcing the government to reallocate funds from key infrastructure or public welfare projects to cover the higher costs. If the conflict escalates, gold prices might continue to rise. The India VIX, a measure of market volatility, jumped 11.4%, reflecting growing uncertainty. As the situation unfolds, markets could remain volatile and it’s still unclear how global dynamics will change in the coming days,\" said the expert.VK Vijayakumar, Chief Investment Strategist, Geojit Financial Services observed the situation in the Middle East could cause further disruptions if crude oil installations in Iran are attacked. Vijayakumar suggested a partial portfolio switch to defensive sectors like pharma and FMCG, given the rising uncertainties. He also noted that foreign institutional investors (FIIs) are shifting their focus to cheaper Chinese stocks relative to the high valuations in India, further pressuring Indian equities.Santosh Meena, Head of Research at Swastika Investmart, pointed to geopolitical tensions and rising crude oil prices as the primary triggers for the market correction. He advised traders to adopt a \"sell on rise\" strategy, warning of potential resistance at the 26,000 mark for Nifty. For long-term investors, however, he saw the current downturn as a buying opportunity, particularly in large-cap stocks where valuations have become more attractive.\"The Indian stock market has recently seen a sharp correction from its all-time highs, driven by multiple factors. Firstly, geopolitical tensions have led to a surge in crude oil prices, which is typically negative for Indian equities. Secondly, there has been a notable outflow of FII money from India to China over the past few days, exerting pressure on large-cap stocks. Lastly, profit booking ahead of state elections and concerns over elevated valuations have added to the downward pressure,\" noted Meena.Meena stated that while the Nifty is currently trading around its 20-day moving average (DMA) of 25,500, there is a possibility of a rebound from these levels. However, selling pressure at higher levels remains a risk. The recent high of 26,277 is likely to act as a near-term resistance, and traders are advised to adopt a \"sell on rise\" strategy until the Nifty fails to sustain above the 26,000 mark. On the downside, key support levels to watch are 25,100 and 24,800.\"For long-term investors, this correction offers a good buying opportunity in large-cap stocks, where valuations have become more attractive. We are observing sectoral rotation, with commodity-related stocks expected to perform well in the near term,\" Meena added.","cleaned_content":"the indian stock market crashed on thursday \u003cTHREE_\u003e october with benchmark indices sensex and nifty \u003cFIVE_TEN\u003e witnessing sharp declines of over \u003cTWO_PERCENT\u003e each driven by escalating geopolitical tensions in the middle east and weak global cues the broader markets followed suit with nifty midcap and nifty smallcap indices tumbling more than \u003cTWO_PERCENT\u003e each with todays decline both the benchmark indices have fallen around \u003cFOUR_PERCENT\u003e from their record high levels hit on september \u003cTWO_TEN\u003e on thursday the bse sensex fell \u003cONE_THOUSAND\u003e points or \u003cTWO_PERCENT\u003e reaching a low of \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e dropped \u003cFIVE_HUNDRED\u003e points or \u003cTWO_PERCENT\u003e to touch \u003cTWO_TEN_THOUSAND\u003e this marked the fourth consecutive session of losses for the indices resulting in a \u003cTHREE_PERCENT\u003e decline in nifty since september \u003cTWO_TEN\u003e the index has fallen by \u003cTWO_PERCENT\u003e in october alone after four months of continuous gains since june all sectoral indices faced steep losses with nifty auto financial services realty private bank and oil and gas being the worst hit plunging \u003cTWO_\u003e to \u003cFOUR_PERCENT\u003e the nifty bank also dipped more than \u003cTWO_PERCENT\u003e while fmcg it and psu bank indices registered losses exceeding \u003cONE_PERCENT\u003e the key driver behind this market crash was the escalating tensions in the middle east following iran s missile barrage on israel in retaliation for the killing of hezbollah s hassan nasrallah iran launched \u003cTWO_HUNDRED\u003e missiles raising the spectre of a full fledged war israel vowed to make iran pay for the attack leading to ground incursions into lebanon targeting hezbollah militia in the latest development the guardian reported that at least six people have been killed and seven injured in an israeli attack on a health centre in central beirut adding to the pressure were mixed global cues from asian markets where msci s index of asia pacific shares fell by \u003cONE_PERCENT\u003e led by hong kong s hang seng index which declined by \u003cONE_PERCENT\u003e the securities and exchange board of indias sebi new rules for derivatives trading including a significant hike in minimum trading amounts further dampened sentiment on dalal street meanwhile foreign portfolio investors fpis continued their selling with outflows of over \u003cSIX_THOUSAND\u003e crore worth of indian equities in just one session further contributing to the market s downturn rising crude oil prices now around \u003cSEVEN_TEN\u003e per barrel added to investor concerns as higher oil prices are expected to strain indias fiscal balance amid the escalating iran israel conflict and heightened volatility in global markets experts recommend a cautious approach for investors trivesh d coo of tradejini stated that the iran israel conflict is significantly impacting global markets with the energy sector seeing the sharpest gains he also noted that the rise in brent crude oil prices could pressurise india s fiscal deficit he advised investors to be cautious as the markets are showing increased volatility things have taken a sharp turn as iran and israel are now at war surprisingly the us and european markets have remained flat but the impact is starting to show elsewhere especially in the energy sector brent crude oil has risen to \u003cSEVEN_TEN\u003e a barrel from \u003cSEVEN_TEN\u003e boosting oil stocks in india however the broader indian market is flashing red rising oil prices could add pressure to indias fiscal deficit forcing the government to reallocate funds from key infrastructure or public welfare projects to cover the higher costs if the conflict escalates gold prices might continue to rise the india vix a measure of market volatility jumped \u003cONE_TEN_PERCENT\u003e reflecting growing uncertainty as the situation unfolds markets could remain volatile and it s still unclear how global dynamics will change in the coming days said the expert vk vijayakumar chief investment strategist geojit financial services observed the situation in the middle east could cause further disruptions if crude oil installations in iran are attacked vijayakumar suggested a partial portfolio switch to defensive sectors like pharma and fmcg given the rising uncertainties he also noted that foreign institutional investors fiis are shifting their focus to cheaper chinese stocks relative to the high valuations in india further pressuring indian equities santosh meena head of research at swastika investmart pointed to geopolitical tensions and rising crude oil prices as the primary triggers for the market correction he advised traders to adopt a sell on rise strategy warning of potential resistance at the \u003cTWO_TEN_THOUSAND\u003e mark for nifty for long term investors however he saw the current downturn as a buying opportunity particularly in large cap stocks where valuations have become more attractive the indian stock market has recently seen a sharp correction from its all time highs driven by multiple factors firstly geopolitical tensions have led to a surge in crude oil prices which is typically negative for indian equities secondly there has been a notable outflow of fii money from india to china over the past few days exerting pressure on large cap stocks lastly profit booking ahead of state elections and concerns over elevated valuations have added to the downward pressure noted meena meena stated that while the nifty is currently trading around its \u003cTWO_TEN\u003e day moving average dma of \u003cTWO_TEN_THOUSAND\u003e there is a possibility of a rebound from these levels however selling pressure at higher levels remains a risk the recent high of \u003cTWO_TEN_THOUSAND\u003e is likely to act as a near term resistance and traders are advised to adopt a sell on rise strategy until the nifty fails to sustain above the \u003cTWO_TEN_THOUSAND\u003e mark on the downside key support levels to watch are \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e for long term investors this correction offers a good buying opportunity in large cap stocks where valuations have become more attractive we are observing sectoral rotation with commodity related stocks expected to perform well in the near term meena added","timestamp":"2024-10-03T15:14:00+05:30","market_timestamp":"2024-10-03T15:14:00+05:30","off_market_hours":false}