{"url":"https://www.livemint.com/market/stock-market-news/revving-up-nifty-auto-zooms-49-in-9-months-motherson-bajaj-auto-and-m-m-drive-gains-with-up-to-110-rally-11727521838947.html","title":"Revving Up: Nifty Auto zooms 49% in 9 months; Motherson, Bajaj Auto and M\u0026M drive gains with up to 110% rally","description":"The Indian auto sector is witnessing a rebound after a subdued August, bolstered by two-wheeler sales and hopes of an RBI rate cut. The Nifty Auto index has risen 5% in September, with Bajaj Auto and Mahindra \u0026 Mahindra clocking strong returns.","content":"Indian auto stocks have made a strong comeback in recent sessions, following a period of significant underperformance throughout August and early September. The recent rally has been largely driven by two-wheeler stocks, buoyed by expectations of improvement in sales during the ongoing festive season and good rainfall across India.Amid the recent recovery, the Nifty Auto index has gained nearly 5% in September, pushing its year-to-date (YTD) gain to 49%. All constituents of the index have delivered positive returns, with Samvardhana Motherson leading the pack with a 110% surge.Bajaj Auto follows with an 86% gain, while Mahindra \u0026 Mahindra (M\u0026M) has posted an impressive 84% return, in the same period. Other notable performers include Bosch, TVS Motor, Hero MotoCorp, Ashok Leyland, and Maruti Suzuki, which have seen gains ranging between 30% and 45% so far this year.The Nifty Auto index has posted gains in eight out of the last nine months, with February marking the highest monthly increase of 6.16%.The outperformance by the 2-wheeler pack comes on the back of a pickup in sales along with the improvement in the export volumes and a shift in focus towards the electric vehicle (EV) market. 2W manufacturers are focusing heavily on the EV market, launching new models at competitive prices and expanding their reach to multiple locations.Further, the rally has also been driven by hopes of an RBI rate cut in the upcoming monetary policy meeting, along with the government's focus on boosting the rural economy.Post-Covid, the demand recovery in the two-wheeler segment has been slower than in the passenger vehicle industry. The two-wheeler industry started recovering in FY23 and the trend continues. In Q1 FY25, the two-wheeler industry's volume growth was strong, and industry experts expect it to remain healthy in FY25E.Analysts anticipate that factors such as a favourable monsoon, improved consumer sentiment, and increased government spending will drive demand in FY25, bringing sales back to FY19 levels.In the longer term, domestic two-wheeler demand is expected to grow steadily, fueled by rising demand for personal transportation, increased economic activity, higher income levels, and continued urbanisation. These factors are likely to play a significant role in supporting the industry's sustained growth, according to experts.Among passenger vehicle (PV) stocks, except for M\u0026M, both Maruti Suzuki and Tata Motors have underperformed the Nifty Auto index this year so far.The industry is grappling with challenges such as sluggish sales growth, which has led to an inventory buildup. After experiencing strong double-digit growth in FY22, FY23, and FY24, driven by post-Covid demand recovery, PV sales have slowed considerably in FY25.For the first time in two years, PV sales tumbled in July—a trend that continued into August. However, recent new model launches, coupled with discounts offered by automakers on their top variants have sparked optimism for a potential sales revival in the coming months.M\u0026M's outperformance during this sluggish period can be attributed to robust demand for utility vehicles. The company has effectively enhanced its market share in this segment through the strategic launch of multiple models and the continuous expansion of its product portfolio.In its recent note, Goldman Sachs raised its target price on M\u0026M to  ₹3,900, citing an uptick in the company margins amid growing preference for SUVs. It said M\u0026M’s relative discount to the overall market leader, Maruti Suzuki, makes it an attractive option.The company recently introduced a five-door version of the Thar SUV, driving volumes. Management has reaffirmed its guidance for mid-to-high-teen volume growth in FY25 for its utility vehicle segment. Despite sluggish demand, new launches should help M\u0026M outperform the market.In August, the company reported total PV sales of 43,000 units, reflecting a 16% year-over-year (YoY) growth and a 4% increase month-over-month, driven by strong demand for its recently launched products.Conversely, UBS recently lowered its target price on Tata Motors to a street-low of  ₹825, citing concerns over Jaguar Land Rover's (JLR) order backlog falling below pre-pandemic levels, which impacts two-thirds of its revenue. UBS also warned that rising discounts, slowing growth, and the absence of new internal combustion engine or hybrid launches could weaken JLR’s financials for FY26.Meanwhile, the company's August sales declined 3% YoY and 1% MoM. To stimulate demand, the Tata group company introduced discounts of up to  ₹2 lakh.","cleaned_content":"indian auto stocks have made a strong comeback in recent sessions following a period of significant underperformance throughout august and early september the recent rally has been largely driven by two wheeler stocks buoyed by expectations of improvement in sales during the ongoing festive season and good rainfall across india amid the recent recovery the nifty auto index has gained nearly \u003cFIVE_PERCENT\u003e in september pushing its year to date ytd gain to \u003cFOUR_TEN_PERCENT\u003e all constituents of the index have delivered positive returns with samvardhana motherson leading the pack with a \u003cONE_HUNDRED_PERCENT\u003e surge bajaj auto follows with an \u003cEIGHT_TEN_PERCENT\u003e gain while mahindra mahindra m m has posted an impressive \u003cEIGHT_TEN_PERCENT\u003e return in the same period other notable performers include bosch tvs motor hero motocorp ashok leyland and maruti suzuki which have seen gains ranging between \u003cTHREE_TEN_PERCENT\u003e and \u003cFOUR_TEN_PERCENT\u003e so far this year the nifty auto index has posted gains in eight out of the last nine months with february marking the highest monthly increase of \u003cSIX_PERCENT\u003e the outperformance by the \u003cTWO_\u003e wheeler pack comes on the back of a pickup in sales along with the improvement in the export volumes and a shift in focus towards the electric vehicle ev market \u003cTWO_\u003e w manufacturers are focusing heavily on the ev market launching new models at competitive prices and expanding their reach to multiple locations further the rally has also been driven by hopes of an rbi rate cut in the upcoming monetary policy meeting along with the governments focus on boosting the rural economy post covid the demand recovery in the two wheeler segment has been slower than in the passenger vehicle industry the two wheeler industry started recovering in fy23 and the trend continues in q1 fy25 the two wheeler industrys volume growth was strong and industry experts expect it to remain healthy in fy25e analysts anticipate that factors such as a favourable monsoon improved consumer sentiment and increased government spending will drive demand in fy25 bringing sales back to fy19 levels in the longer term domestic two wheeler demand is expected to grow steadily fueled by rising demand for personal transportation increased economic activity higher income levels and continued urbanisation these factors are likely to play a significant role in supporting the industrys sustained growth according to experts among passenger vehicle pv stocks except for m m both maruti suzuki and tata motors have underperformed the nifty auto index this year so far the industry is grappling with challenges such as sluggish sales growth which has led to an inventory buildup after experiencing strong double digit growth in fy22 fy23 and fy24 driven by post covid demand recovery pv sales have slowed considerably in fy25 for the first time in two years pv sales tumbled in july a trend that continued into august however recent new model launches coupled with discounts offered by automakers on their top variants have sparked optimism for a potential sales revival in the coming months m ms outperformance during this sluggish period can be attributed to robust demand for utility vehicles the company has effectively enhanced its market share in this segment through the strategic launch of multiple models and the continuous expansion of its product portfolio in its recent note goldman sachs raised its target price on m m to \u003cTHREE_THOUSAND\u003e citing an uptick in the company margins amid growing preference for suvs it said m m s relative discount to the overall market leader maruti suzuki makes it an attractive option the company recently introduced a five door version of the thar suv driving volumes management has reaffirmed its guidance for mid to high teen volume growth in fy25 for its utility vehicle segment despite sluggish demand new launches should help m m outperform the market in august the company reported total pv sales of \u003cFOUR_TEN_THOUSAND\u003e units reflecting a \u003cONE_TEN_PERCENT\u003e year over year yoy growth and a \u003cFOUR_PERCENT\u003e increase month over month driven by strong demand for its recently launched products conversely ubs recently lowered its target price on tata motors to a street low of \u003cEIGHT_HUNDRED\u003e citing concerns over jaguar land rovers jlr order backlog falling below pre pandemic levels which impacts two thirds of its revenue ubs also warned that rising discounts slowing growth and the absence of new internal combustion engine or hybrid launches could weaken jlr s financials for fy26 meanwhile the companys august sales declined \u003cTHREE_PERCENT\u003e yoy and \u003cONE_PERCENT\u003e mom to stimulate demand the tata group company introduced discounts of up to \u003cTWO_\u003e lakh","timestamp":"2024-09-30T11:51:00+05:30","market_timestamp":"2024-09-30T11:51:00+05:30","off_market_hours":false}