{"url":"https://www.livemint.com/market/stock-market-news/vodafone-idea-share-price-jumps-7-on-3-6-billion-deal-with-nokia-ericsson-samsung-11727063257121.html","title":"Vodafone Idea share price jumps 8% on mega $3.6-billion deal with Nokia, Ericsson and Samsung","description":"Vodafone Idea announced the conclusion of a $3.6 billion deal with Nokia, Ericsson and Samsung, for supply of network equipment over a period of three years.","content":"Vodafone Idea share price jumped over 8% in early trade on Monday after the company announced the conclusion of a $3.6 billion deal with Nokia, Ericsson and Samsung, for supply of network equipment over a period of three years. Vodafone Idea shares rose as much as 8.96% to  ₹11.42 apiece on the BSE.The deal marks the first step towards the rollout of the company’s transformative three-year capex plan of ~USD 6.6 billion (Rs. 550 billion). The capex programme is directed towards expanding the 4G population coverage from 1.03 billion to 1.2 billion, launching 5G in key markets and capacity expansion in line with data growth, Vodafone Idea said in a stock exchange filing on September 22.The company has continued with its existing long-term partners Nokia and Ericsson and also onboarded Samsung as a new partner, it added.Post the recent equity raise of  ₹240 billion and additional spectrum acquisition of  ₹35 billion in June 2024 auction, Vodafone Idea has also executed some quick win Capex, while simultaneously working on concluding these long-term contracts. These quick wins were mainly by way of deployment of more spectrum on existing sites and also the roll out of some new sites.This is resulting in a ~15% boost in capacity and an increase in population coverage by 16 million by end September, 2024.“The Capex is currently being funded out of the equity raise. For the long-term Capex, the Company is in advanced stage of discussions with its existing and new lenders to tie up  ₹250 billion of funded and  ₹100 billion of non-fund-based facilities,” Vodafone Idea said in the BSE filing.Last week, Vodafone Idea share price came under heavy selling pressure after the Supreme Court of India rejected a plea by telecom companies on re-computation of adjusted gross revenues (AGR) dues.In its Q4FY24 earnings call, the Vodafone Idea’s management highlighted that they were seeking  ₹60 billion correction in the base AGR amount and  ₹350 billion (out of ~ ₹700 billion dues) on current value on the basis of including interest, penalties and interest on penalties. However, SC’s outright rejection is a setback, especially for Vodafone Idea’s revival hopes.“The unfavourable Supreme Court verdict comes as a big setback to Vodafone Idea. However, the sharp 20% correction in the stock price on Thursday, more or less captures the value of the incremental liability, over and above what the Street was expecting. Hereafter, the focus shall shift to Vodafone Idea’s progress on key operational parameters – pace of subscriber loss, tariff hike impact and capex velocity,” brokerage firm Nuvama Institutional Equities said.The brokerage house maintained a ‘Hold’ rating and 12 month price target  ₹11.5 apiece.Vodafone Idea shares plunged nearly 15% in one week and more than 28% in one month. The telecom stock is down over 33% in three months and nearly 29% year-to-date (YTD).At 9:30 am, Vodafone Idea shares were trading 8.11% higher at  ₹11.33 apiece on the BSE.","cleaned_content":"vodafone idea share price jumped over \u003cEIGHT_PERCENT\u003e in early trade on monday after the company announced the conclusion of a \u003cTHREE_\u003e billion deal with nokia ericsson and samsung for supply of network equipment over a period of three years vodafone idea shares rose as much as \u003cEIGHT_PERCENT\u003e to \u003cONE_TEN\u003e apiece on the bse the deal marks the first step towards the rollout of the company s transformative three year capex plan of usd \u003cSIX_\u003e billion rs \u003cFIVE_HUNDRED\u003e billion the capex programme is directed towards expanding the \u003cFOUR_\u003e g population coverage from \u003cONE_\u003e billion to \u003cONE_\u003e billion launching \u003cFIVE_\u003e g in key markets and capacity expansion in line with data growth vodafone idea said in a stock exchange filing on september \u003cTWO_TEN\u003e the company has continued with its existing long term partners nokia and ericsson and also onboarded samsung as a new partner it added post the recent equity raise of \u003cTWO_HUNDRED\u003e billion and additional spectrum acquisition of \u003cTHREE_TEN\u003e billion in june \u003cTWO_THOUSAND\u003e auction vodafone idea has also executed some quick win capex while simultaneously working on concluding these long term contracts these quick wins were mainly by way of deployment of more spectrum on existing sites and also the roll out of some new sites this is resulting in a \u003cONE_TEN_PERCENT\u003e boost in capacity and an increase in population coverage by \u003cONE_TEN\u003e million by end september \u003cTWO_THOUSAND\u003e the capex is currently being funded out of the equity raise for the long term capex the company is in advanced stage of discussions with its existing and new lenders to tie up \u003cTWO_HUNDRED\u003e billion of funded and \u003cONE_HUNDRED\u003e billion of non fund based facilities vodafone idea said in the bse filing last week vodafone idea share price came under heavy selling pressure after the supreme court of india rejected a plea by telecom companies on re computation of adjusted gross revenues agr dues in its q4fy24 earnings call the vodafone idea s management highlighted that they were seeking \u003cSIX_TEN\u003e billion correction in the base agr amount and \u003cTHREE_HUNDRED\u003e billion out of \u003cSEVEN_HUNDRED\u003e billion dues on current value on the basis of including interest penalties and interest on penalties however sc s outright rejection is a setback especially for vodafone idea s revival hopes the unfavourable supreme court verdict comes as a big setback to vodafone idea however the sharp \u003cTWO_TEN_PERCENT\u003e correction in the stock price on thursday more or less captures the value of the incremental liability over and above what the street was expecting hereafter the focus shall shift to vodafone idea s progress on key operational parameters pace of subscriber loss tariff hike impact and capex velocity brokerage firm nuvama institutional equities said the brokerage house maintained a hold rating and \u003cONE_TEN\u003e month price target \u003cONE_TEN\u003e apiece vodafone idea shares plunged nearly \u003cONE_TEN_PERCENT\u003e in one week and more than \u003cTWO_TEN_PERCENT\u003e in one month the telecom stock is down over \u003cTHREE_TEN_PERCENT\u003e in three months and nearly \u003cTWO_TEN_PERCENT\u003e year to date ytd at \u003cNINE_\u003e \u003cTHREE_TEN\u003e am vodafone idea shares were trading \u003cEIGHT_PERCENT\u003e higher at \u003cONE_TEN\u003e apiece on the bse","timestamp":"2024-09-23T09:20:00+05:30","market_timestamp":"2024-09-23T09:20:00+05:30","off_market_hours":false}