{"url":"https://www.livemint.com/market/stock-market-news/dividend-stocks-accelya-solutions-ads-diagnostics-among-others-to-trade-ex-dividend-next-week-full-list-11727531263482.html","title":"Dividend Stocks: Accelya Solutions, ADS Diagnostics, among others to trade ex-dividend next week; Full list","description":"Dividend Stocks: Several companies, including ADS Diagnostics Ltd, Accelya Solutions India Ltd, and KPI Green Energy Ltd among others, are trading ex-dividend in the coming week.","content":"Dividend Stocks: Shares of several major companies, including ADS Diagnostics Ltd, Accelya Solutions India Ltd, and KPI Green Energy Ltd, among others, will trade ex-dividend from Monday, September 30, according to data collected from the Bombay Stock Exchange (BSE) website.As per the BSE data, some companies have announced other corporate actions, such as bonus issues and stock splits.The ex-dividend date is when the equity share price adjusts itself to reflect the next dividend payout. It is the day the stock becomes ex-dividend, which means it does not carry the value of its next dividend payment from that day forward. Dividends are payable to all the shareholders whose names appear on the company's list by the end of the record date.ADS Diagnostics Ltd: The company declared a final dividend of  ₹1.2Accelya Solutions India Ltd: The company declared a final dividend of  ₹40KPI Green Energy Ltd: The company declared a final dividend of  ₹0.2Classic Electricals Ltd. declared a bonus issue of shares at a ratio of 5:1. Shares will trade ex-bonus on October 4.Shikhar Leasing \u0026 Trading Ltd. declared a bonus issue of shares at a ratio of 3:1. Shares will trade ex-bonus on October 4.A bonus issue is a corporate action that allows existing shareholders to subscribe for additional shares. Instead of increasing the dividend payout, companies offer to distribute additional shares to the shareholders. For example, the company may give out one bonus share for every ten shares held.Integrated Industries Ltd. will undergo a stock split from  ₹10 to  ₹1. Shares will trade ex-split on October 1.Godawari Power \u0026 Ispat Ltd. will undergo a stock split from  ₹5 to  ₹1. Shares will trade ex-split on October 4.Real Eco-Energy Ltd. will undergo a stock split from  ₹10 to  ₹2. Shares will trade ex-split on October 4.A stock split is a corporate action that occurs when a company issues additional shares to shareholders to boost liquidity. The total number of shares issued is increased by a specified ratio based on previously held shares. However, if the number of shares outstanding increases by a specific multiple, the total value (in rupees) of all shares outstanding remains the same because a split does not change the company's value.The most common split ratios are 2-for-1 or 3-for-1 ( denoted as 2:1 or 3:1). For every share held before the split, each stockholder will have two or three shares, respectively, after the split.Diligent Industries Ltd: EGM on October 1.","cleaned_content":"dividend stocks shares of several major companies including ads diagnostics ltd accelya solutions india ltd and kpi green energy ltd among others will trade ex dividend from monday september \u003cTHREE_TEN\u003e according to data collected from the bombay stock exchange bse website as per the bse data some companies have announced other corporate actions such as bonus issues and stock splits the ex dividend date is when the equity share price adjusts itself to reflect the next dividend payout it is the day the stock becomes ex dividend which means it does not carry the value of its next dividend payment from that day forward dividends are payable to all the shareholders whose names appear on the companys list by the end of the record date ads diagnostics ltd the company declared a final dividend of \u003cONE_\u003e accelya solutions india ltd the company declared a final dividend of \u003cFOUR_TEN\u003e kpi green energy ltd the company declared a final dividend of \u003cZERO_\u003e classic electricals ltd declared a bonus issue of shares at a ratio of \u003cFIVE_\u003e \u003cONE_\u003e shares will trade ex bonus on october \u003cFOUR_\u003e shikhar leasing trading ltd declared a bonus issue of shares at a ratio of \u003cTHREE_\u003e \u003cONE_\u003e shares will trade ex bonus on october \u003cFOUR_\u003e a bonus issue is a corporate action that allows existing shareholders to subscribe for additional shares instead of increasing the dividend payout companies offer to distribute additional shares to the shareholders for example the company may give out one bonus share for every ten shares held integrated industries ltd will undergo a stock split from \u003cONE_TEN\u003e to \u003cONE_\u003e shares will trade ex split on october \u003cONE_\u003e godawari power ispat ltd will undergo a stock split from \u003cFIVE_\u003e to \u003cONE_\u003e shares will trade ex split on october \u003cFOUR_\u003e real eco energy ltd will undergo a stock split from \u003cONE_TEN\u003e to \u003cTWO_\u003e shares will trade ex split on october \u003cFOUR_\u003e a stock split is a corporate action that occurs when a company issues additional shares to shareholders to boost liquidity the total number of shares issued is increased by a specified ratio based on previously held shares however if the number of shares outstanding increases by a specific multiple the total value in rupees of all shares outstanding remains the same because a split does not change the companys value the most common split ratios are \u003cTWO_\u003e for \u003cONE_\u003e or \u003cTHREE_\u003e for \u003cONE_\u003e denoted as \u003cTWO_\u003e \u003cONE_\u003e or \u003cTHREE_\u003e \u003cONE_\u003e for every share held before the split each stockholder will have two or three shares respectively after the split diligent industries ltd egm on october \u003cONE_\u003e","timestamp":"2024-09-28T21:02:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}