{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-3-11727803039087.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 3","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy today — Meghmani Organics, HCL Tech, and DLF.","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, closed flat on Tuesday amid mixed global cues and certain economic indicators. While some stocks witnessed slight gains, overall sentiment remained cautious. The Nifty 50 index closed 0.05 per cent lower at 25,796.90 points on Tuesday, compared to 25,810.85 points at the previous market close.The BSE Sensex closed 0.04 per cent at 84,266.29 points after Tuesday's trading session, compared to 84,299.78 points at the previous market close. The stock markets remained closed on Wednesday, October 2, due to a market holiday for Gandhi Jayanti.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty 50 witnessed consolidation near the 25,800 zone after two trading sessions of a losing streak the market can expect a pullback in coming sessions. Parekh estimates the Nifty 50 Spot index to find support at 25,650 points and face resistance at 26,000 points. The Bank Nifty index will likely move in a range of 52,600 to 53,400 today.For today, Parekh recommended three buy-or-sell stocks: Meghmani Organics Ltd, HCL Technologies Ltd, and DLF Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty witnessed consolidation near the 25,800 zone after the 2 sessions of losing streak with a Doji candle formation on the daily chart and can expect for a pullback in the coming sessions.”“As mentioned earlier, the 25,650 zone would be the crucial support while a decisive breach above 26,000 level shall once again bring conviction for further upward movement in the coming days,” said the stock market expert.“Bank Nifty has slipped from the peak zone of 54,467 levels and has the crucial base near the 50EMA level of 52,000 with near-term support positioned at 52,600 levels, which if sustained, can continue with the uptrend after a positive trend reversal. A decisive breach above 53,400 zone shall improve the bias once again anticipating for further rise in the coming sessions,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 25,650 points, while the resistance lies at 26,000 points. The Bank Nifty index would have a daily range of 52,600 to 53,400.1. Meghmani Organics Ltd. (MOL): Buy at  ₹104; Target at  ₹110; Stop Loss at  ₹100.2. HCL Technologies Ltd. (HCLTECH): Buy at  ₹1,812; Target at  ₹1,880; Stop Loss at  ₹1,780.3. DLF Ltd. (DLF): Buy at  ₹914; Target at  ₹950; Stop Loss at  ₹890.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e closed flat on tuesday amid mixed global cues and certain economic indicators while some stocks witnessed slight gains overall sentiment remained cautious the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points on tuesday compared to \u003cTWO_TEN_THOUSAND\u003e points at the previous market close the bse sensex closed \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e points after tuesdays trading session compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close the stock markets remained closed on wednesday october \u003cTWO_\u003e due to a market holiday for gandhi jayanti vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty \u003cFIVE_TEN\u003e witnessed consolidation near the \u003cTWO_TEN_THOUSAND\u003e zone after two trading sessions of a losing streak the market can expect a pullback in coming sessions parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks meghmani organics ltd hcl technologies ltd and dlf ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty witnessed consolidation near the \u003cTWO_TEN_THOUSAND\u003e zone after the \u003cTWO_\u003e sessions of losing streak with a doji candle formation on the daily chart and can expect for a pullback in the coming sessions as mentioned earlier the \u003cTWO_TEN_THOUSAND\u003e zone would be the crucial support while a decisive breach above \u003cTWO_TEN_THOUSAND\u003e level shall once again bring conviction for further upward movement in the coming days said the stock market expert bank nifty has slipped from the peak zone of \u003cFIVE_TEN_THOUSAND\u003e levels and has the crucial base near the \u003cFIVE_TEN\u003e ema level of \u003cFIVE_TEN_THOUSAND\u003e with near term support positioned at \u003cFIVE_TEN_THOUSAND\u003e levels which if sustained can continue with the uptrend after a positive trend reversal a decisive breach above \u003cFIVE_TEN_THOUSAND\u003e zone shall improve the bias once again anticipating for further rise in the coming sessions said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e meghmani organics ltd mol buy at \u003cONE_HUNDRED\u003e target at \u003cONE_HUNDRED\u003e stop loss at \u003cONE_HUNDRED\u003e hcl technologies ltd hcltech buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e dlf ltd dlf buy at \u003cNINE_HUNDRED\u003e target at \u003cNINE_HUNDRED\u003e stop loss at \u003cEIGHT_HUNDRED\u003e","timestamp":"2024-10-03T06:15:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}