{"url":"https://www.livemint.com/market/stock-market-news/anil-ambani-owned-reliance-power-share-price-hits-upper-circuit-for-fourth-straight-session-more-steam-left-11727063488695.html","title":"Anil Ambani-owned Reliance Power share price hits upper circuit for fourth straight session. More steam left?","description":"Reliance Power share price today opened upside and touched an intraday high of  ₹38.15 apiece on the NSE","content":"Stock market today: Anil Ambani-owned Reliance Power share price has been on an uptrend since the Anil Dhirubhai Ambani Group (ADAG) company declared a board meeting date to consider and approve the fundraising proposal. The company board fixed the meeting date as 23rd September 2024, i.e. today. So, ahead of the board meeting, Reliance Power share price today opened upside and touched an intraday high of  ₹38.15 apiece on the NSE. While climbing to this intraday high, Reliance Power shares also touched a 5 per cent upper circuit.While hitting the upper circuit during the Opening Bell on Monday, Reliance Power shares touched the upper circuit for the fourth straight session. The stock touched the upper circuit on Wednesday, Thursday, and Friday last week.Expecting more upside in this Anil Ambani-owned stock, Sumeet Bagadia, Executive Director at Choice Broking, said, “Reliance Power shares may become highly bullish once they breach above  ₹40 apiece on a decisive basis. So, Reliance Power shareholders are advised to hold the scrip while maintaining stop loss at  ₹35 apiece for the short-term target of  ₹45 and  ₹50.”“Fresh investors can also buy Reliance Power shares for the short-term target of  ₹45 and  ₹50, maintaining strict stop loss at  ₹35,” said Bagadia.The ADAG company had informed the Indian stock market exchanges about the fundraising move, saying, “We wish to inform you that a meeting of the Board of Directors of the Company will be held on Monday, September 23, 2024, inter alia, to consider and approve raising of long term resources from domestic and/or global markets, inter alia, by the issue of equity shares/equity-linked securities/ warrants convertible into equity shares, by way of a preferential issue and/or qualified institutional placement and/or rights issue and/or foreign currency convertible bonds or any other method including determination of issue price, if any and seeking members’ and other approval(s), as the Board may deem appropriate.”","cleaned_content":"stock market today anil ambani owned reliance power share price has been on an uptrend since the anil dhirubhai ambani group adag company declared a board meeting date to consider and approve the fundraising proposal the company board fixed the meeting date as \u003cTWO_TEN\u003e rd september \u003cTWO_THOUSAND\u003e i e today so ahead of the board meeting reliance power share price today opened upside and touched an intraday high of \u003cTHREE_TEN\u003e apiece on the nse while climbing to this intraday high reliance power shares also touched a \u003cFIVE_PERCENT\u003e upper circuit while hitting the upper circuit during the opening bell on monday reliance power shares touched the upper circuit for the fourth straight session the stock touched the upper circuit on wednesday thursday and friday last week expecting more upside in this anil ambani owned stock sumeet bagadia executive director at choice broking said reliance power shares may become highly bullish once they breach above \u003cFOUR_TEN\u003e apiece on a decisive basis so reliance power shareholders are advised to hold the scrip while maintaining stop loss at \u003cTHREE_TEN\u003e apiece for the short term target of \u003cFOUR_TEN\u003e and \u003cFIVE_TEN\u003e fresh investors can also buy reliance power shares for the short term target of \u003cFOUR_TEN\u003e and \u003cFIVE_TEN\u003e maintaining strict stop loss at \u003cTHREE_TEN\u003e said bagadia the adag company had informed the indian stock market exchanges about the fundraising move saying we wish to inform you that a meeting of the board of directors of the company will be held on monday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e inter alia to consider and approve raising of long term resources from domestic and or global markets inter alia by the issue of equity shares equity linked securities warrants convertible into equity shares by way of a preferential issue and or qualified institutional placement and or rights issue and or foreign currency convertible bonds or any other method including determination of issue price if any and seeking members and other approval s as the board may deem appropriate","timestamp":"2024-09-23T10:02:00+05:30","market_timestamp":"2024-09-23T10:02:00+05:30","off_market_hours":false}