{"url":"https://www.livemint.com/market/stock-market-news/hyundai-motor-india-ipo-here-are-10-key-things-to-know-from-drhp-11727751799240.html","title":"Hyundai Motor India IPO: Here are 10 Key things to know from DRHP","description":"Hyundai Motor India IPO: The much awaited IPO of Hyundai Motors and its listing are looked at eagerly by investors. The IPO is already commanding a significant GMP. and here are 10 Key things to know from DRHP","content":"Hyundai Motor India Limited IPO: Hyundai Motor India Ltd remains in focus on the proposed initial public offering (IPO). Here are key things to know from the DRHP (draft red herring prospectus).The book-built issue of Hyundai Motor India IPO is entirely an offer for sale of 142,194,700 shares (14.22 crore shares) of face value of  ₹10 each.The dates for Hyundai Motor IPO are yet to be announced. The shares are proposed to be listed on BSE and NSE.The price band for the IPO is yet to be announced.The book-running lead managers of Hyundai Motor IPO are Kotak Mahindra Capital Company Limited, Citigroup Global Markets India Private Limited, HSBC Securities \u0026 Capital Markets Pvt Ltd, J.P. Morgan India Private Limited, and Morgan Stanley India Company Pvt Ltd. The registrar of the issue is Kfin Technologies Limited.Increases in the prices of parts and materials required for its operations could adversely affect its business and results of operations. Hyundai Motors depends on a limited number of suppliers for parts and materials. Any interruption in the availability of parts and materials could adversely impact its operations.The promoter-selling shareholder will receive all offer proceeds after deducting offer-related costs and applicable taxes, which the promoter-selling shareholder will be responsible for paying. The company will not receive any of the offer's proceeds.Hyundai Motor's revenues from operations stood at  ₹32,488.34 crore for the 9 months ending 31, December 2023. The net profit for Hyundai Motor stood at  ₹4,382.87 crore, with a profit margins of 13.5%.Peers for Hyundai Motor in the listed space as per the DHRP are Maruti Suzuki India, Tata Motors and Mahindra \u0026 Mahindra.Part of the Hyundai Motor Group, the third-largest car original equipment manufacturer (\"OEM\") in the world based on passenger vehicle sales, Hyundai Motor India Limited was founded in May 1996.The company uses technology to build and market dependable, feature-rich, and creative four-wheeler passenger vehicles. The company also makes items such as transmissions and engines.GMP or grey market premium for Hyundai Motor stood at  ₹411 as per data from investorgain.com. This indicates that the market is expecting Hyundai Motor share price to list at a premium, even though the IPO price is yet to be announced.","cleaned_content":"hyundai motor india limited ipo hyundai motor india ltd remains in focus on the proposed initial public offering ipo here are key things to know from the drhp draft red herring prospectus the book built issue of hyundai motor india ipo is entirely an offer for sale of \u003cONE_HUNDRED_MILLION\u003e shares \u003cONE_TEN\u003e crore shares of face value of \u003cONE_TEN\u003e each the dates for hyundai motor ipo are yet to be announced the shares are proposed to be listed on bse and nse the price band for the ipo is yet to be announced the book running lead managers of hyundai motor ipo are kotak mahindra capital company limited citigroup global markets india private limited hsbc securities capital markets pvt ltd j p morgan india private limited and morgan stanley india company pvt ltd the registrar of the issue is kfin technologies limited increases in the prices of parts and materials required for its operations could adversely affect its business and results of operations hyundai motors depends on a limited number of suppliers for parts and materials any interruption in the availability of parts and materials could adversely impact its operations the promoter selling shareholder will receive all offer proceeds after deducting offer related costs and applicable taxes which the promoter selling shareholder will be responsible for paying the company will not receive any of the offers proceeds hyundai motors revenues from operations stood at \u003cTHREE_TEN_THOUSAND\u003e crore for the \u003cNINE_\u003e months ending \u003cTHREE_TEN\u003e december \u003cTWO_THOUSAND\u003e the net profit for hyundai motor stood at \u003cFOUR_THOUSAND\u003e crore with a profit margins of \u003cONE_TEN_PERCENT\u003e peers for hyundai motor in the listed space as per the dhrp are maruti suzuki india tata motors and mahindra mahindra part of the hyundai motor group the third largest car original equipment manufacturer oem in the world based on passenger vehicle sales hyundai motor india limited was founded in may \u003cONE_THOUSAND\u003e the company uses technology to build and market dependable feature rich and creative four wheeler passenger vehicles the company also makes items such as transmissions and engines gmp or grey market premium for hyundai motor stood at \u003cFOUR_HUNDRED\u003e as per data from investorgain com this indicates that the market is expecting hyundai motor share price to list at a premium even though the ipo price is yet to be announced","timestamp":"2024-10-01T13:51:00+05:30","market_timestamp":"2024-10-01T13:51:00+05:30","off_market_hours":false}