{"url":"https://www.livemint.com/market/stock-market-news/7500-rally-in-one-year-multibagger-stock-eraaya-lifespaces-hits-5-upper-circuit-11727684494733.html","title":"7500% rally in one year! Multibagger stock Eraaya Lifespaces hits 5% upper circuit","description":"Multibagger stocks 2024: Following Eraaya Lifespaces' acquisition of Ebix, Inc., the company is undergoing significant restructuring, including leadership changes and strategic appointments.","content":"Multibagger stocks: Eraaya Lifespaces share price was once again locked in the 5 per cent upper circuit on Monday, September 30 after the company announced major strategic restructuring following its acquisition of Ebix, Inc., a global software provider.Eraaya Lifespaces stock has seen a meteoric rise, rallying 7,500% in just one year. This multibagger stock has consistently hit the upper circuit, attracting widespread attention from investors.In a media release today, Eraaya confirmed that it had begun a comprehensive overhaul to integrate operations and foster long-term growth. Part of this restructuring involves the appointment of a new leadership team and the formation of an advisory board consisting of seasoned industry veterans. The company emphasised its commitment to operational efficiency and effective governance.Eraaya Lifespaces share price was trading in the green, up 5 per cent at  ₹2635.65, on September 30, at 2:04 pm, on the BSE. The company enjoys a market capitalisation of  ₹4,845.47 crore.Eraaya Lifespaces stock price has given returns of around 7,500 per cent on a one-year basis; it was trading at around  ₹33 levels a year ago.As part of leadership changes and strategic appointments, Eraaya has brought in new expertise, appointing Dr. Thomas Mathew, a former IAS officer, and Himanshu Mody, the CFO of Suzlon Energy, as non-executive independent directors. The company also announced the creation of an advisory board with prominent figures like ex-IPS officer Karnal Singh and ex-SEBI chairman G. N. Bajpai.In addition, Karan Bagga, an ex-banker with over 25 years of experience, has been designated as the officiating CEO of Ebix, Inc. These appointments are expected to boost the company's leadership and guide it toward sustainable growth.Bagga said Eraaya Lifespaces has outlined ambitious plans for growth and diversification.Eraaya Lifespaces has outlined ambitious plans for growth and diversification. The company stated, \"Eraaya has set its sights on exploring new business fields, driven by a vision to expand its horizons and unlock fresh opportunities via mergers and acquisitions of a varied bunch of businesses.\"The company has also initiated an investigation into reported financial irregularities involving Robin Raina, suspending him from key functional positions pending the investigation's outcome.","cleaned_content":"multibagger stocks eraaya lifespaces share price was once again locked in the \u003cFIVE_PERCENT\u003e upper circuit on monday september \u003cTHREE_TEN\u003e after the company announced major strategic restructuring following its acquisition of ebix inc a global software provider eraaya lifespaces stock has seen a meteoric rise rallying \u003cSEVEN_THOUSAND_PERCENT\u003e in just one year this multibagger stock has consistently hit the upper circuit attracting widespread attention from investors in a media release today eraaya confirmed that it had begun a comprehensive overhaul to integrate operations and foster long term growth part of this restructuring involves the appointment of a new leadership team and the formation of an advisory board consisting of seasoned industry veterans the company emphasised its commitment to operational efficiency and effective governance eraaya lifespaces share price was trading in the green up \u003cFIVE_PERCENT\u003e at \u003cTWO_THOUSAND\u003e on september \u003cTHREE_TEN\u003e at \u003cTWO_\u003e \u003cFOUR_\u003e pm on the bse the company enjoys a market capitalisation of \u003cFOUR_THOUSAND\u003e crore eraaya lifespaces stock price has given returns of around \u003cSEVEN_THOUSAND_PERCENT\u003e on a one year basis it was trading at around \u003cTHREE_TEN\u003e levels a year ago as part of leadership changes and strategic appointments eraaya has brought in new expertise appointing dr thomas mathew a former ias officer and himanshu mody the cfo of suzlon energy as non executive independent directors the company also announced the creation of an advisory board with prominent figures like ex ips officer karnal singh and ex sebi chairman g n bajpai in addition karan bagga an ex banker with over \u003cTWO_TEN\u003e years of experience has been designated as the officiating ceo of ebix inc these appointments are expected to boost the companys leadership and guide it toward sustainable growth bagga said eraaya lifespaces has outlined ambitious plans for growth and diversification eraaya lifespaces has outlined ambitious plans for growth and diversification the company stated eraaya has set its sights on exploring new business fields driven by a vision to expand its horizons and unlock fresh opportunities via mergers and acquisitions of a varied bunch of businesses the company has also initiated an investigation into reported financial irregularities involving robin raina suspending him from key functional positions pending the investigations outcome","timestamp":"2024-09-30T15:31:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}