{"url":"https://www.livemint.com/market/stock-market-news/sensex-likely-to-be-around-90-000-91-000-by-december-2024-says-atul-parakh-ceo-bigul-11727680991583.html","title":"Sensex likely to be around 90,000-91,000 by December 2024, says Atul Parakh, CEO, Bigul","description":"Atul Parakh, CEO of Bigul, forecasts Sensex to reach 90,000-91,000 by December 2024, supported by GDP growth and corporate profitability. He advises investors to focus on large-cap stocks and avoid specialised sectors amidst potential market volatility.","content":"Atul Parakh, CEO of Bigul, predicts that the Sensex will reach 90,000-91,000 level by December 2024, driven by robust GDP prospects, increased profitability among corporate players, and anticipated foreign investment inflows.He advised short and medium-term investors to book some profits while sticking to large-cap companies with sound financials. He also suggested avoiding specialised sector investments and instead focusing on broad market exposure. Edited Excerpts:It is possible to project Sensex at 90,000-91,000 as December 2024 arrives. It is based on strong prospects for GDP growth, an increase in corporate profitability, and expected inflows from foreign investments. However, crucial elements to consider are the results of impending state legislative elections, global economic circumstances, and geopolitical tensions, notably in West Asia. The US Federal Reserve's monetary policy decisions will impact market sentiment. While the recent rally to 85,000 demonstrates substantial momentum, it is crucial to note that markets can be volatile. Investors should stay watchful and alter their expectations depending on evolving economic data, regulatory changes, and quarterly business performance.The Sensex will encounter various hurdles in the coming months. Global economic instability, particularly concerns about a probable recession in industrialised economies, may influence market mood. An increase in crude oil prices may turn out to be a bad bargain for India's fiscal health and corporate earnings growth. Asia-related geopolitical concerns are still in place and continue to cause volatility in markets around the world.Domestically, the approach towards state legislative assembly elections in states like Haryana and Maharashtra has only raised political uncertainty. Persistent inflation may lead to tighter monetary policy, reducing GDP prospects. The technology sector, a major component of the index, may experience headwinds if the global economy slows. Furthermore, any unexpected changes in foreign institutional investor flows may trigger market swings.These reasons, together with present high values, indicate that the Sensex may struggle to continue its recent positive momentum in the short term.Given the present high valuations of the markets, investors should be careful. The short and medium-term investors should keep on booking profits and stick to large-cap companies that have strong financials and proven business plans, as the chances of them handling market fluctuation better are more pronounced. Use a low-cost passive investment by tracking large-cap indexes. A passive investment, although not the best, will offer inexpensive ways of taking market benefits while minimising risks emanating from active management.Diversification will be required; a percentage of the portfolio should be allocated to AAA-rated government bonds as stable insurance. Use market-neutral tactics using derivatives to reduce directional exposure while still partaking in possible gains. Avoid specialised sector investments and instead focus on broad market exposure. Regular portfolio rebalancing is required to maintain the correct asset allocation. Maintain some financial reserves to take advantage of any market corrections. Remember that in overpriced markets, capital preservation and consistent returns should take precedence over seeking high-risk, high-reward options.The mid and small-cap segments currently present a mixed picture. While valuations are undoubtedly stretched compared to historical averages, these sectors have demonstrated strong performance, particularly since the Covid-19 period. The key to their continued success lies in their ability to deliver on expected earnings growth. It's crucial to approach this space selectively, focusing on individual companies rather than broad index valuations. Many mid and small-cap companies have strong businesses with tremendous growth potential, which might justify their present values if profits are as expected. However, investors should exercise caution and use a stock-specific strategy, since the category has huge disparities in fundamentals and development prospects. A contrarian approach over a 3-5-year timeframe may be smart, weighing the potential for more upside against the dangers associated with stretched values.Looking ahead, three sectors are likely to gain focus. First, the consumer discretionary/durables FMCG sector, which includes durable goods and retail, may witness higher activity. Rising disposable incomes and holiday spending are expected to increase demand for appliances, gadgets, and leisure items. Second, the banking sector appears poised for growth, with credit demand expected to rise and asset quality concerns easing. Large private sector banks and select PSU banks may outperform. Third, the auto sector shows promise, driven by strong festive demand, particularly in the two-wheeler and passenger vehicle segments. New model launches and improving supply chains should boost sales. Furthermore, the real estate industry may come into focus as affordability improves and interest rates stabilise. Investors should monitor these sectors closely, as they may offer opportunities amid the ongoing market rotation. Specialty chemicals and financial industries should also be on the radar.Numerous PSUs have provided exceptional gains in the last ten years. PSUs are not a thing of the past; instead, they are set for ongoing expansion as long as the Modi government sticks to its present policies. Given the sector's strong fundamentals and impressive historical track record, investors could potentially discover opportunities for significant returns as it adjusts to continuing economic changes.Investors should carefully research individual offerings and take into account overall market trends before making investment decisions, despite the tempting opportunities provided by the current high valuations and strong IPO pipeline. Investors should apply for IPOs with a clear intention of listing gains. There are very select strong fundamental companies or disinvestment IPOs such as Bajaj Housing Finance, HBD Financial Services, NTPC Green Energy, ONGC's ONGC Green Energy, Reliance Industries' Reliance Jio and Reliance Retail, Tata Motors' Tata Passenger Electric Mobility, Hero MotoCorp's Ather Energy, Manappuram Finance's Asirvad Micro Finance and Muthoot Finance's Belstar Microfinance. These companies are reportedly queued up for their stock market debut and are good stories to stay invested in.An investor with a moderate risk appetite can ensure steady long-term growth by ensuring diversification of investments into stocks, bonds, and alternative assets that aren't too closely correlated with one another. Bullion looks good; silver is a must-have. You'll need to strike the right balance, considering your own risk tolerance, time horizon, and financial objectives.Monitoring geopolitical events, US elections, market valuations, central bank policies, and corporate earnings are crucial as they may significantly influence market trends in the short term. Investors must carefully manoeuvre through these factors.New investors should prioritise understanding their strengths and knowledge areas when making investment decisions. This strategic approach not only minimises risk but also enhances the potential for long-term success in the market while maintaining the balance between risk-return objectives. New investors with small funds should choose the mutual fund route to start with. The investors may also opt for structured stock baskets or portfolios by the selected SEBI Registered Investment Advisors (RIAs) and Stock Broker Advisories.","cleaned_content":"atul parakh ceo of bigul predicts that the sensex will reach \u003cNINE_TEN_THOUSAND\u003e \u003cNINE_TEN_THOUSAND\u003e level by december \u003cTWO_THOUSAND\u003e driven by robust gdp prospects increased profitability among corporate players and anticipated foreign investment inflows he advised short and medium term investors to book some profits while sticking to large cap companies with sound financials he also suggested avoiding specialised sector investments and instead focusing on broad market exposure edited excerpts it is possible to project sensex at \u003cNINE_TEN_THOUSAND\u003e \u003cNINE_TEN_THOUSAND\u003e as december \u003cTWO_THOUSAND\u003e arrives it is based on strong prospects for gdp growth an increase in corporate profitability and expected inflows from foreign investments however crucial elements to consider are the results of impending state legislative elections global economic circumstances and geopolitical tensions notably in west asia the us federal reserves monetary policy decisions will impact market sentiment while the recent rally to \u003cEIGHT_TEN_THOUSAND\u003e demonstrates substantial momentum it is crucial to note that markets can be volatile investors should stay watchful and alter their expectations depending on evolving economic data regulatory changes and quarterly business performance the sensex will encounter various hurdles in the coming months global economic instability particularly concerns about a probable recession in industrialised economies may influence market mood an increase in crude oil prices may turn out to be a bad bargain for indias fiscal health and corporate earnings growth asia related geopolitical concerns are still in place and continue to cause volatility in markets around the world domestically the approach towards state legislative assembly elections in states like haryana and maharashtra has only raised political uncertainty persistent inflation may lead to tighter monetary policy reducing gdp prospects the technology sector a major component of the index may experience headwinds if the global economy slows furthermore any unexpected changes in foreign institutional investor flows may trigger market swings these reasons together with present high values indicate that the sensex may struggle to continue its recent positive momentum in the short term given the present high valuations of the markets investors should be careful the short and medium term investors should keep on booking profits and stick to large cap companies that have strong financials and proven business plans as the chances of them handling market fluctuation better are more pronounced use a low cost passive investment by tracking large cap indexes a passive investment although not the best will offer inexpensive ways of taking market benefits while minimising risks emanating from active management diversification will be required a percentage of the portfolio should be allocated to aaa rated government bonds as stable insurance use market neutral tactics using derivatives to reduce directional exposure while still partaking in possible gains avoid specialised sector investments and instead focus on broad market exposure regular portfolio rebalancing is required to maintain the correct asset allocation maintain some financial reserves to take advantage of any market corrections remember that in overpriced markets capital preservation and consistent returns should take precedence over seeking high risk high reward options the mid and small cap segments currently present a mixed picture while valuations are undoubtedly stretched compared to historical averages these sectors have demonstrated strong performance particularly since the covid \u003cONE_TEN\u003e period the key to their continued success lies in their ability to deliver on expected earnings growth its crucial to approach this space selectively focusing on individual companies rather than broad index valuations many mid and small cap companies have strong businesses with tremendous growth potential which might justify their present values if profits are as expected however investors should exercise caution and use a stock specific strategy since the category has huge disparities in fundamentals and development prospects a contrarian approach over a \u003cTHREE_\u003e \u003cFIVE_\u003e year timeframe may be smart weighing the potential for more upside against the dangers associated with stretched values looking ahead three sectors are likely to gain focus first the consumer discretionary durables fmcg sector which includes durable goods and retail may witness higher activity rising disposable incomes and holiday spending are expected to increase demand for appliances gadgets and leisure items second the banking sector appears poised for growth with credit demand expected to rise and asset quality concerns easing large private sector banks and select psu banks may outperform third the auto sector shows promise driven by strong festive demand particularly in the two wheeler and passenger vehicle segments new model launches and improving supply chains should boost sales furthermore the real estate industry may come into focus as affordability improves and interest rates stabilise investors should monitor these sectors closely as they may offer opportunities amid the ongoing market rotation specialty chemicals and financial industries should also be on the radar numerous psus have provided exceptional gains in the last ten years psus are not a thing of the past instead they are set for ongoing expansion as long as the modi government sticks to its present policies given the sectors strong fundamentals and impressive historical track record investors could potentially discover opportunities for significant returns as it adjusts to continuing economic changes investors should carefully research individual offerings and take into account overall market trends before making investment decisions despite the tempting opportunities provided by the current high valuations and strong ipo pipeline investors should apply for ipos with a clear intention of listing gains there are very select strong fundamental companies or disinvestment ipos such as bajaj housing finance hbd financial services ntpc green energy ongcs ongc green energy reliance industries reliance jio and reliance retail tata motors tata passenger electric mobility hero motocorps ather energy manappuram finances asirvad micro finance and muthoot finances belstar microfinance these companies are reportedly queued up for their stock market debut and are good stories to stay invested in an investor with a moderate risk appetite can ensure steady long term growth by ensuring diversification of investments into stocks bonds and alternative assets that arent too closely correlated with one another bullion looks good silver is a must have youll need to strike the right balance considering your own risk tolerance time horizon and financial objectives monitoring geopolitical events us elections market valuations central bank policies and corporate earnings are crucial as they may significantly influence market trends in the short term investors must carefully manoeuvre through these factors new investors should prioritise understanding their strengths and knowledge areas when making investment decisions this strategic approach not only minimises risk but also enhances the potential for long term success in the market while maintaining the balance between risk return objectives new investors with small funds should choose the mutual fund route to start with the investors may also opt for structured stock baskets or portfolios by the selected sebi registered investment advisors rias and stock broker advisories","timestamp":"2024-09-30T13:55:00+05:30","market_timestamp":"2024-09-30T13:55:00+05:30","off_market_hours":false}