{"url":"https://www.livemint.com/market/stock-market-news/shining-brighter-nifty-metal-extends-rally-for-seventh-straight-session-on-rise-in-metal-prices-china-stimulus-11727676568964.html","title":"Shining brighter: Nifty Metal extends rally for seventh straight session on rise in metal prices, China stimulus","description":"Nifty Metal index gained nearly 2% on Monday, its seventh day of growth, driven by rising global metal prices and China's central bank actions. In contrast, Nifty 50 and Sensex fell over 1%, but analysts foresee continued upward momentum in metal stocks.","content":"On Monday, the Nifty Metal index increased by almost 2%, marking its seventh consecutive session of gains, driven by a sharp uptick in global metal prices, particularly following China's intended stimulus aimed at strengthening its economy. Metal stocks were skyrocketing in an otherwise volatile and sluggish market on Monday.At 12:30 pm, Nifty 50 index and Sensex were down over 1% each to 25,894.70 and 84,602.46 points, respectively. On the other hand, the Nifty Metal index opened at 10,124.10 level and touched a record high of 10,263.65 level in Monday's session.“Metal index has been in a strong buzz since last week and outperformed, eventually making a new high today. It is up for the 7th straight session, and going ahead, we expect this performance to continue, considering that the space is already up more than 8% for the month. Buying on dip would be preferred, with 10,000 as now a support and 10,800 as resistance,” said Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One.Furthermore, as part of broad measures to arrest the economic slowdown and bolster the troubled Chinese real estate market, China's central bank announced on Sunday that it will order banks to cut mortgage rates for current house loans by October 31. This news further sparked a rise in Indian metal stocks.China's commercial banks have been urged to lower interest rates on current mortgages by at least 30 basis points (bps) below the Loan Prime Rate (LPR), in batches, by the People's Bank of China (PBOC). According to news reports, current mortgage rates are expected to decrease by an average of around 50 basis points.The surge in Indian metal stocks can also be attributed to the US Fed rate cut. Expectations are increasing that the Reserve Bank of India (RBI) will reduce interest rates this year, in line with the global trend.SBI Research predicts that the RBI might implement a rate cut by February 2025, potentially influenced by the recent 50 basis point rate decrease by the US Federal Reserve.India's consumer price index (CPI) inflation rate fell to 3.65% year over year in August 2024, marking a decrease to its lowest level in over five years, as indicated in the report.The leading gainers from the metal pack were up 2-4%, namely NMDC, MOIL, Hindalco, and JSW Steel. According to news reports, three of China's biggest cities—Shanghai, Guangzhou, and Shenzhen—saw a roughly 11% increase in iron ore prices when limits on house purchases were relaxed. This action fits in with Beijing's previous measures to assist the faltering real estate market and is anticipated to improve the demand forecast for iron ore used to make steel worldwide.Rajesh Bhosale of Angel One highlighted that Tata Steel has outperformed in the recent run, gaining more than 10%. The move came after forming a base on the 200SMA and is now poised to test new highs beyond 180. Traders should maintain a positive bias and use dips as buying opportunities.Bhosale also stated that JSW Steel, during the recent correction in the metal basket, didn't correct much and witnessed a time-wise consolidation. With the resumption of strength in this space, the stock has shown strong positive traction and is trading in uncharted territory. Expect continuation of upmove possibly towards 1,060 and beyond 1,000 to act as support.","cleaned_content":"on monday the nifty metal index increased by almost \u003cTWO_PERCENT\u003e marking its seventh consecutive session of gains driven by a sharp uptick in global metal prices particularly following chinas intended stimulus aimed at strengthening its economy metal stocks were skyrocketing in an otherwise volatile and sluggish market on monday at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e pm nifty \u003cFIVE_TEN\u003e index and sensex were down over \u003cONE_PERCENT\u003e each to \u003cTWO_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e points respectively on the other hand the nifty metal index opened at \u003cONE_TEN_THOUSAND\u003e level and touched a record high of \u003cONE_TEN_THOUSAND\u003e level in mondays session metal index has been in a strong buzz since last week and outperformed eventually making a new high today it is up for the \u003cSEVEN_\u003e th straight session and going ahead we expect this performance to continue considering that the space is already up more than \u003cEIGHT_PERCENT\u003e for the month buying on dip would be preferred with \u003cONE_TEN_THOUSAND\u003e as now a support and \u003cONE_TEN_THOUSAND\u003e as resistance said rajesh bhosale equity technical and derivative analyst at angel one furthermore as part of broad measures to arrest the economic slowdown and bolster the troubled chinese real estate market chinas central bank announced on sunday that it will order banks to cut mortgage rates for current house loans by october \u003cTHREE_TEN\u003e this news further sparked a rise in indian metal stocks chinas commercial banks have been urged to lower interest rates on current mortgages by at least \u003cTHREE_TEN\u003e basis points bps below the loan prime rate lpr in batches by the peoples bank of china pboc according to news reports current mortgage rates are expected to decrease by an average of around \u003cFIVE_TEN\u003e basis points the surge in indian metal stocks can also be attributed to the us fed rate cut expectations are increasing that the reserve bank of india rbi will reduce interest rates this year in line with the global trend sbi research predicts that the rbi might implement a rate cut by february \u003cTWO_THOUSAND\u003e potentially influenced by the recent \u003cFIVE_TEN\u003e basis point rate decrease by the us federal reserve indias consumer price index cpi inflation rate fell to \u003cTHREE_PERCENT\u003e year over year in august \u003cTWO_THOUSAND\u003e marking a decrease to its lowest level in over five years as indicated in the report the leading gainers from the metal pack were up \u003cTWO_\u003e \u003cFOUR_PERCENT\u003e namely nmdc moil hindalco and jsw steel according to news reports three of chinas biggest cities shanghai guangzhou and shenzhen saw a roughly \u003cONE_TEN_PERCENT\u003e increase in iron ore prices when limits on house purchases were relaxed this action fits in with beijings previous measures to assist the faltering real estate market and is anticipated to improve the demand forecast for iron ore used to make steel worldwide rajesh bhosale of angel one highlighted that tata steel has outperformed in the recent run gaining more than \u003cONE_TEN_PERCENT\u003e the move came after forming a base on the \u003cTWO_HUNDRED\u003e sma and is now poised to test new highs beyond \u003cONE_HUNDRED\u003e traders should maintain a positive bias and use dips as buying opportunities bhosale also stated that jsw steel during the recent correction in the metal basket didnt correct much and witnessed a time wise consolidation with the resumption of strength in this space the stock has shown strong positive traction and is trading in uncharted territory expect continuation of upmove possibly towards \u003cONE_THOUSAND\u003e and beyond \u003cONE_THOUSAND\u003e to act as support","timestamp":"2024-09-30T12:43:00+05:30","market_timestamp":"2024-09-30T12:43:00+05:30","off_market_hours":false}