{"url":"https://www.livemint.com/market/stock-market-news/stock-check-icici-securities-initiates-coverage-on-adani-energy-solutions-with-a-buy-tag-heres-why-11727692990212.html","title":"Stock Check: ICICI Securities initiates coverage on Adani Energy Solutions with a buy tag: here’s why","description":"Stock Check: Adani Energy Solutions receives a 'Buy' rating from ICICI Securities, with a target price of  ₹1,318, suggesting a 31% upside. The firm is a key player in smart meters and transmission, anticipating substantial EBITDA growth by FY27E.","content":"ICICI Securities, a brokerage house, has initiated coverage on Adani Energy Solutions and given it a 'Buy' rating. They have set a target price of  ₹1,318, indicating a potential upside of around 31% from Monday's closing price of  ₹1,009.65 on the BSE.According to the brokerage's analysis, Adani Energy Solutions is the second-largest bidder for smart meters and the nation's second-largest transmission company, with a market share of over 40% in bids according to CEA. Take note that there are strong tailwinds in both categories. The brokerage estimate EBITDA is therefore expected to increase from  ₹58 billion in FY24 to  ₹132 billion in FY27E. A) about  ₹30 billion from new transmission bids; B) + ₹~40 billion from smart meters; and C) + ₹~5 billion from distribution regions are the main causes of the significant rise. The brokerage house thinks that the stock's 12xEV/EBITDA valuation, considering the robust rise in operating profits, is reasonable.“We recommend BUY on the stock while valuing the businesses on SoTP-basis with target price of  ₹1,318 per share,” ICICI Securities said in its report.The brokerage said in its report that the company began by creating assets for cost-plus transmission. At a cost of  ₹110 billion and with regulated equity of  ₹33 billion, it has established four transmission assets on a regulated basis. With the purchase of Mumbai DISCOM, it entered the distribution industry.Regarding its increased involvement in unregulated operations, Adani Energy holds a 20% market share in unregulated transmission assets. With wins of  ₹170 billion during FY16 and H1FY25, it has become the biggest private participant in transmission assets.The brokerage points out significant risks such as receiving fewer projects than anticipated, facing intense competition, dealing with counterparty risk, handling implementation risk, and managing refinancing and FX risks related to dollar-bond issuance.","cleaned_content":"icici securities a brokerage house has initiated coverage on adani energy solutions and given it a buy rating they have set a target price of \u003cONE_THOUSAND\u003e indicating a potential upside of around \u003cTHREE_TEN_PERCENT\u003e from mondays closing price of \u003cONE_THOUSAND\u003e on the bse according to the brokerages analysis adani energy solutions is the second largest bidder for smart meters and the nations second largest transmission company with a market share of over \u003cFOUR_TEN_PERCENT\u003e in bids according to cea take note that there are strong tailwinds in both categories the brokerage estimate ebitda is therefore expected to increase from \u003cFIVE_TEN\u003e billion in fy24 to \u003cONE_HUNDRED\u003e billion in fy27e a about \u003cTHREE_TEN\u003e billion from new transmission bids b \u003cFOUR_TEN\u003e billion from smart meters and c \u003cFIVE_\u003e billion from distribution regions are the main causes of the significant rise the brokerage house thinks that the stocks \u003cONE_TEN\u003e xev ebitda valuation considering the robust rise in operating profits is reasonable we recommend buy on the stock while valuing the businesses on sotp basis with target price of \u003cONE_THOUSAND\u003e per share icici securities said in its report the brokerage said in its report that the company began by creating assets for cost plus transmission at a cost of \u003cONE_HUNDRED\u003e billion and with regulated equity of \u003cTHREE_TEN\u003e billion it has established four transmission assets on a regulated basis with the purchase of mumbai discom it entered the distribution industry regarding its increased involvement in unregulated operations adani energy holds a \u003cTWO_TEN_PERCENT\u003e market share in unregulated transmission assets with wins of \u003cONE_HUNDRED\u003e billion during fy16 and h1fy25 it has become the biggest private participant in transmission assets the brokerage points out significant risks such as receiving fewer projects than anticipated facing intense competition dealing with counterparty risk handling implementation risk and managing refinancing and fx risks related to dollar bond issuance","timestamp":"2024-09-30T16:40:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}