{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-l-t-finance-to-nalco-smc-global-securities-lists-four-stocks-to-bet-on-this-week-check-tp-upside-11727788933073.html","title":"Stocks to buy: HPCL to L\u0026T Finance—SMC Global Securities lists four stocks to bet on this week; Check TP, upside","description":"Stocks to buy: Domestic brokerage SMC Global Securities has recommended four stocks to buy this week based upon the fundamental and technical analysis in the current market scenario","content":"Domestic equity benchmarks Sensex and Nifty 50 edged lower on Tuesday, October 1, extending their losing run to the third day amid profit-taking in oil and gas and select FMCG shares. The BSE Sensex dipped 33.49 points or 0.04 per cent to settle at 84,266.29. During the day, it hit a high of 84,648.40 and a low of 84,098.94.The NSE Nifty closed marginally lower by 13.95 points or 0.05 per cent to 25,796.90. In contrast, the mid-and small-cap indices outperformed their large-cap counterparts, with the Nifty Midcap 100 index rising 0.34 per cent and the Nifty Smallcap index posting a gain of 0.79 per cent.Sensex has shed nearly 1,570 points or nearly two per cent, and Nifty 50 declined 419 points, or 1.6 per cent, since Friday after China announced stimulus measures to prop up its economy. Muted trends in global markets and heavy foreign fund outflows weighed on investor sentiment.Also Read: SEBI approves new asset class for HNIs, passive fund framework; rights issue timeline slashed: 5 key highlightsThe Nifty gained 2.3 per cent in September, rising for a fourth straight month and scaling all-time highs. The outsized US interest rate cut boosted hopes of foreign inflows into India. However, a lack of major domestic triggers has led some investors to sell the rally in the past two days.In the current market scenario, domestic brokerage firm SMC Global Securities has released its top four stock picks for this week. The brokerage has selected the following stocks based on technical and fundamental parameters. According to the brokerage, the stocks have robust fundamentals and are well-placed to yield good returns for investors in the next one year.Let's take a look at the top four technical and fundamental stocks for this week by brokerage SMC Global Securities:1.L\u0026T Finance: Current Market Price (CMP):  ₹188.05; Target Price:  ₹237, Upside: 26 per centL\u0026T Finance aims to achieve a compound annual growth rate (CAGR) of 25 per cent over the next few years, focusing on consolidating its retail lending business. The retail housing disbursement stood at  ₹2,245 crore, up 73 per cent year-on-year (YoY). The book size reached closer to  ₹20,000 crore milestone rising 42 per cent YoY.Also Read: Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 1The company is focused on boosting customer acquisition by developing a strong sales funnel and expanding its product offerings. It is enhancing credit underwriting through its proprietary digital credit engine, 'Project Cyclops,' and building a forward-looking digital infrastructure to drive innovation.The company is increasing brand visibility through greater market presence and strengthening its capabilities by recruiting and upskilling tech talent, contributing to its strong performance. The brokerage expects the stock will see a price target of Rs. 237 in 8 to 10 months on a target P/BV of 2.05x and FY26 (E) BVPS of Rs. 115.64.2.Zensar Technologies: CMP:  ₹679.90; Target Price:  ₹834, Upside: 23 per centThe company reported net cash of $280.90 million at the end of the June quarter, a 7.30 per cent YoY growth. Despite a challenging environment, the company won deals worth $154 million in services, including advanced engineering, data engineering, and platform services.The company has a healthy order book, and according to management, it continues to stay focused on execution, innovation, and cost optimization to maintain Zensar's financial performance over the last few quarters.Also Read: Hyundai Motor India, Swiggy, Vishal Mega Mart, among two others receive SEBI approval to float IPOsAccording to SMC Global, the focus on client centricity, execution excellence, and a good pipeline represent sustained business growth. The brokerage expects the stock to see a price target of Rs.834 in 8 to 10 months, based on a one-year average P/BV of 4.18x and FY26 BVPS of Rs.199.49.3.Hindustan Petroleum Corp Ltd (HPCL)The stock's 200-day Exponential Moving Average (DEMA)on the daily chart is 339. The stock marked its 52-week high of 457.15 in September and has since traded lower, forming a lower-high pattern on daily charts. Recently, the stock managed to take support around 390 levels and bounced back once again to surpass the 420 mark after forming a double bottom pattern.Technically, the stock has maintained its bullish move as prices rise in higher high and higher low patterns. The positive divergences in secondary oscillators and rising prices suggest a net upswing in the stock. Therefore, one can buy the stock in the range of 430-435 for the upside target of 495-500 levels with SL below 390 levels.Also Read: India’s current account deficit widens to 1.1% of GDP to $9.7 billion in Q1FY25 from surplus in previous quarter: RBI4.National Aluminium Company Ltd (NALCO)The stock's 200-day Exponential Moving Average (DEMA) on the daily chart is currently at  ₹165. The stock has been maintaining its Bull Run and has been rising in a mounting channel with the formation of higher high and higher low patterns on daily charts. Last week, the stock also marked its 52-week high of 212.40.Technically, the stock has given a fresh breakout above the symmetrical triangle pattern, with prices seen holding well above its 200-day exponential moving average on daily charts. The rise in average volumes, along with price action, suggests further upside in the stock after a breakout. Therefore, one can buy the stock on dips in the range of 195-200 for the upside target of 225- 230 levels with SL below 175 levels.","cleaned_content":"domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e edged lower on tuesday october \u003cONE_\u003e extending their losing run to the third day amid profit taking in oil and gas and select fmcg shares the bse sensex dipped \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e during the day it hit a high of \u003cEIGHT_TEN_THOUSAND\u003e and a low of \u003cEIGHT_TEN_THOUSAND\u003e the nse nifty closed marginally lower by \u003cONE_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e in contrast the mid and small cap indices outperformed their large cap counterparts with the nifty midcap \u003cONE_HUNDRED\u003e index rising \u003cZERO_PERCENT\u003e and the nifty smallcap index posting a gain of \u003cZERO_PERCENT\u003e sensex has shed nearly \u003cONE_THOUSAND\u003e points or nearly two per cent and nifty \u003cFIVE_TEN\u003e declined \u003cFOUR_HUNDRED\u003e points or \u003cONE_PERCENT\u003e since friday after china announced stimulus measures to prop up its economy muted trends in global markets and heavy foreign fund outflows weighed on investor sentiment also read sebi approves new asset class for hnis passive fund framework rights issue timeline slashed \u003cFIVE_\u003e key highlightsthe nifty gained \u003cTWO_PERCENT\u003e in september rising for a fourth straight month and scaling all time highs the outsized us interest rate cut boosted hopes of foreign inflows into india however a lack of major domestic triggers has led some investors to sell the rally in the past two days in the current market scenario domestic brokerage firm smc global securities has released its top four stock picks for this week the brokerage has selected the following stocks based on technical and fundamental parameters according to the brokerage the stocks have robust fundamentals and are well placed to yield good returns for investors in the next one year lets take a look at the top four technical and fundamental stocks for this week by brokerage smc global securities \u003cONE_\u003e l t finance current market price cmp \u003cONE_HUNDRED\u003e target price \u003cTWO_HUNDRED\u003e upside \u003cTWO_TEN_PERCENT\u003e l t finance aims to achieve a compound annual growth rate cagr of \u003cTWO_TEN_PERCENT\u003e over the next few years focusing on consolidating its retail lending business the retail housing disbursement stood at \u003cTWO_THOUSAND\u003e crore up \u003cSEVEN_TEN_PERCENT\u003e year on year yoy the book size reached closer to \u003cTWO_TEN_THOUSAND\u003e crore milestone rising \u003cFOUR_TEN_PERCENT\u003e yoy also read buy or sell vaishali parekh recommends three stocks to buy today october \u003cONE_\u003e the company is focused on boosting customer acquisition by developing a strong sales funnel and expanding its product offerings it is enhancing credit underwriting through its proprietary digital credit engine project cyclops and building a forward looking digital infrastructure to drive innovation the company is increasing brand visibility through greater market presence and strengthening its capabilities by recruiting and upskilling tech talent contributing to its strong performance the brokerage expects the stock will see a price target of rs \u003cTWO_HUNDRED\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on a target p bv of \u003cTWO_\u003e x and fy26 e bvps of rs \u003cONE_HUNDRED\u003e 2 zensar technologies cmp \u003cSIX_HUNDRED\u003e target price \u003cEIGHT_HUNDRED\u003e upside \u003cTWO_TEN_PERCENT\u003e the company reported net cash of \u003cTWO_HUNDRED\u003e million at the end of the june quarter a \u003cSEVEN_PERCENT\u003e yoy growth despite a challenging environment the company won deals worth \u003cONE_HUNDRED\u003e million in services including advanced engineering data engineering and platform services the company has a healthy order book and according to management it continues to stay focused on execution innovation and cost optimization to maintain zensars financial performance over the last few quarters also read hyundai motor india swiggy vishal mega mart among two others receive sebi approval to float iposaccording to smc global the focus on client centricity execution excellence and a good pipeline represent sustained business growth the brokerage expects the stock to see a price target of rs 834 in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months based on a one year average p bv of \u003cFOUR_\u003e x and fy26 bvps of rs 199 49 3 hindustan petroleum corp ltd hpcl the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is \u003cTHREE_HUNDRED\u003e the stock marked its \u003cFIVE_TEN\u003e week high of \u003cFOUR_HUNDRED\u003e in september and has since traded lower forming a lower high pattern on daily charts recently the stock managed to take support around \u003cTHREE_HUNDRED\u003e levels and bounced back once again to surpass the \u003cFOUR_HUNDRED\u003e mark after forming a double bottom pattern technically the stock has maintained its bullish move as prices rise in higher high and higher low patterns the positive divergences in secondary oscillators and rising prices suggest a net upswing in the stock therefore one can buy the stock in the range of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e for the upside target of \u003cFOUR_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e levels with sl below \u003cTHREE_HUNDRED\u003e levels also read india s current account deficit widens to \u003cONE_PERCENT\u003e of gdp to \u003cNINE_\u003e billion in q1fy25 from surplus in previous quarter rbi4 national aluminium company ltd nalco the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cONE_HUNDRED\u003e the stock has been maintaining its bull run and has been rising in a mounting channel with the formation of higher high and higher low patterns on daily charts last week the stock also marked its \u003cFIVE_TEN\u003e week high of \u003cTWO_HUNDRED\u003e technically the stock has given a fresh breakout above the symmetrical triangle pattern with prices seen holding well above its \u003cTWO_HUNDRED\u003e day exponential moving average on daily charts the rise in average volumes along with price action suggests further upside in the stock after a breakout therefore one can buy the stock on dips in the range of \u003cONE_HUNDRED\u003e \u003cTWO_HUNDRED\u003e for the upside target of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels with sl below \u003cONE_HUNDRED\u003e levels","timestamp":"2024-10-01T18:52:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}