{"url":"https://www.livemint.com/market/stock-market-news/bumper-listing-krn-heat-exchanger-shares-list-at-rs-480-on-nse-a-118-18-premium-to-ipo-price-11727927452024.html","title":"Bumper Listing! KRN Heat Exchanger shares list at  ₹480 on NSE, an over 118% premium to IPO price","description":"Shares of KRN Heat Exchanger and Refrigeration made a bumper debut on the bourses on Thursday, 3 October, listing at  ₹480 on NSE, a premium of 118.18 per cent over the IPO price of  ₹220. Meanwhile, on BSE, it listed at  ₹470, up 113.64 per cent.","content":"KRN Heat Exchanger and Refrigeration IPO listing: Shares of KRN Heat Exchanger and Refrigeration made a bumper debut on the bourses on Thursday, 3 October, as they listed at  ₹480 on NSE, a premium of 118.18 per cent over the IPO price of  ₹220. Meanwhile, on BSE, the stock listed at  ₹470, up 113.64 per cent over the issue price.The initial public offering (IPO), valued at  ₹341.95 crore, was open for subscription from September 25 to September 27. The IPO was priced in the range of  ₹209-220 per share.Following the three-day bidding process, KRN Heat Exchanger IPO closed with an overwhelming demand as the issue was subscribed 213.41 times. The IPO received bids for 234.59 crore shares against 1.09 crore shares on offer. The retail investor segment saw a subscription of 96.74 times, while the non-institutional investors (NII) category was booked a massive 430.54 times. Meanwhile, the qualified institutional buyers (QIBs) quota was subscribed 253.04 times.The KRN Heat Exchanger IPO was entirely a fresh issue of 1.55 crore shares. There was no offer-for-sale component in the IPO. The minimum application size for retail investors was set at 65 shares, requiring an investment of  ₹14,300. Investors could bid for a minimum of 65 shares and in multiples thereof. The IPO allotment date was September 30.“KRN Heat Exchanger and Refrigeration Ltd was able to garner stellar demand from the market, as the issue was subscribed over 213x. The issue is all set to get listed on the bourses today with an expected listing gain of over 100%,” said Sagar Shetty, Research Analyst, StoxBox.KRN Heat Exchanger IPO reserved 20% of the issue for QIBs, 15% for NIIs, and 35% for retail investors.The company proposes to utilise the net proceeds from the fresh issue for two primary purposes: investing in KRN HVAC Products Pvt Ltd, a wholly-owned subsidiary, to establish a new manufacturing facility in Neemrana, Alwar, Rajasthan, and for general corporate purposes.Holani Consultants Private Limited is the book-running lead manager of the KRN Heat Exchanger IPO, while Bigshare Services Pvt Ltd is the registrar to the issue.KRN Heat Exchanger and Refrigeration Ltd specialises in manufacturing fin and tube-type heat exchangers, including copper and aluminium fins, copper tubes, water coils, condenser coils, and evaporator coils. The company produces heat exchanger tubes in a variety of shapes and sizes, ranging from 5 mm to 15.88 mm in diameter. These products cater to the domestic, commercial, and industrial HVAC\u0026R (Heating, Ventilation, Air Conditioning, and Refrigeration) sectors.KRN serves notable clients like Daikin Airconditioning India, Schneider Electric, Kirloskar Chillers, Blue Star, Climaventa Climate Technologies, and Frigel Intelligent Cooling Systems. Additionally, it exports to countries such as the UAE, USA, Italy, Saudi Arabia, Norway, Czech Republic, Germany, and the UK.In FY24, the company reported a revenue of  ₹308.3 crore, with an EBITDA of  ₹58.5 crore and a PAT of  ₹39.1 crore, reflecting EBITDA and PAT margins of 18.9 per cent and 12.6 per cent, respectively. The company also delivered strong financial metrics, achieving a return on equity (ROE) of 29.7 per cent and a return on capital employed (ROCE) of 24.2 per cent, alongside maintaining a debt-to-equity ratio of 1x.","cleaned_content":"krn heat exchanger and refrigeration ipo listing shares of krn heat exchanger and refrigeration made a bumper debut on the bourses on thursday \u003cTHREE_\u003e october as they listed at \u003cFOUR_HUNDRED\u003e on nse a premium of \u003cONE_HUNDRED_PERCENT\u003e over the ipo price of \u003cTWO_HUNDRED\u003e meanwhile on bse the stock listed at \u003cFOUR_HUNDRED\u003e up \u003cONE_HUNDRED_PERCENT\u003e over the issue price the initial public offering ipo valued at \u003cTHREE_HUNDRED\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTWO_TEN\u003e the ipo was priced in the range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e per share following the three day bidding process krn heat exchanger ipo closed with an overwhelming demand as the issue was subscribed \u003cTWO_HUNDRED\u003e times the ipo received bids for \u003cTWO_HUNDRED\u003e crore shares against \u003cONE_\u003e crore shares on offer the retail investor segment saw a subscription of \u003cNINE_TEN\u003e times while the non institutional investors nii category was booked a massive \u003cFOUR_HUNDRED\u003e times meanwhile the qualified institutional buyers qibs quota was subscribed \u003cTWO_HUNDRED\u003e times the krn heat exchanger ipo was entirely a fresh issue of \u003cONE_\u003e crore shares there was no offer for sale component in the ipo the minimum application size for retail investors was set at \u003cSIX_TEN\u003e shares requiring an investment of \u003cONE_TEN_THOUSAND\u003e investors could bid for a minimum of \u003cSIX_TEN\u003e shares and in multiples thereof the ipo allotment date was september \u003cTHREE_TEN\u003e krn heat exchanger and refrigeration ltd was able to garner stellar demand from the market as the issue was subscribed over \u003cTWO_HUNDRED\u003e x the issue is all set to get listed on the bourses today with an expected listing gain of over \u003cONE_HUNDRED_PERCENT\u003e said sagar shetty research analyst stoxbox krn heat exchanger ipo reserved \u003cTWO_TEN_PERCENT\u003e of the issue for qibs \u003cONE_TEN_PERCENT\u003e for niis and \u003cTHREE_TEN_PERCENT\u003e for retail investors the company proposes to utilise the net proceeds from the fresh issue for two primary purposes investing in krn hvac products pvt ltd a wholly owned subsidiary to establish a new manufacturing facility in neemrana alwar rajasthan and for general corporate purposes holani consultants private limited is the book running lead manager of the krn heat exchanger ipo while bigshare services pvt ltd is the registrar to the issue krn heat exchanger and refrigeration ltd specialises in manufacturing fin and tube type heat exchangers including copper and aluminium fins copper tubes water coils condenser coils and evaporator coils the company produces heat exchanger tubes in a variety of shapes and sizes ranging from \u003cFIVE_\u003e mm to \u003cONE_TEN\u003e mm in diameter these products cater to the domestic commercial and industrial hvac r heating ventilation air conditioning and refrigeration sectors krn serves notable clients like daikin airconditioning india schneider electric kirloskar chillers blue star climaventa climate technologies and frigel intelligent cooling systems additionally it exports to countries such as the uae usa italy saudi arabia norway czech republic germany and the uk in fy24 the company reported a revenue of \u003cTHREE_HUNDRED\u003e crore with an ebitda of \u003cFIVE_TEN\u003e crore and a pat of \u003cTHREE_TEN\u003e crore reflecting ebitda and pat margins of \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively the company also delivered strong financial metrics achieving a return on equity roe of \u003cTWO_TEN_PERCENT\u003e and a return on capital employed roce of \u003cTWO_TEN_PERCENT\u003e alongside maintaining a debt to equity ratio of \u003cONE_\u003e x","timestamp":"2024-10-03T09:59:00+05:30","market_timestamp":"2024-10-03T09:59:00+05:30","off_market_hours":false}