{"url":"https://www.livemint.com/market/stock-market-news/laxmi-organic-shares-mid-cap-stock-sees-technical-breakout-jumps-over-6-anand-rathi-expects-20-more-upside-11727167679522.html","title":"Laxmi Organic shares: Mid-cap stock sees technical breakout, jumps over 6%; Anand Rathi expects 20% more upside","description":"Laxmi Organic Industries share price has gained over 7% in one month and more than 15% in three months. However, the mid-cap stock has remained rangedbound in one year as has gained just 5% during the period.","content":"Laxmi Organic Industries share price jumped over 6% on Tuesday, extending its rally for the third consecutive session amid heavy volumes. Laxmi Organic shares rallied as much as 6.26% to a high of  ₹308.55 apiece on the BSE.Around 43 lakh equity shares of Laxmi Organic Industries traded hands on stock exchanges today as against its one week average volume of 18 lakh shares.Laxmi Organic share price has gained over 7% in one month and more than 15% in three months. However, the mid-cap stock has remained rangedbound in one year as has gained just 5% during the period.Brokerage firm Anand Rathi noted that Laxmi Organic shares broke above a bearish trendline and it expects the stock to see a decent upmove.“Over the past year, Laxmi Organic Industries stock has established a robust support level within the range of  ₹235 - 245, undergoing multiple tests that have demonstrated its resilience in the face of downward pressure. Recently, there has been a significant development as Laxmi Organic Industries shares broke above a bearish trendline that had constrained its movement for the past 3 - 4 years, and notably, it has sustained this breakout. This suggests a fundamental shift in market sentiment towards Laxmi Organic Industries stock,” Anand Rathi said in a report.Furthermore, on the indicator front, the weekly Relative Strength Index (RSI) has surpassed its own multi-year bearish trendline, signaling bullish momentum in the short to medium term.Considering these technical indicators, Anand Rathi has advised traders and investors to initiate long positions in Laxmi Organic Industries shares within the range of  ₹290 - 305 and for a timeframe of 3 months. It has set a target price of  ₹355 per share on the stock, implying an upside potential of around 20%.To manage risk, analysts at the brokerage firm recommend placing a stop-loss order near  ₹267 on a daily closing basis.Laxmi Organic Industries share price hit a 52-week high of  ₹325.50 apiece on September 11, 2024, while the stock hit a 52-week low of  ₹220.00 apiece on June 04, 2024, on BSE.At 2:30 pm, Laxmi Organic shares were trading 3.69% higher at  ₹301.05 apiece, commanding a market capitalization of nearly  ₹8,326 crore on the BSE.","cleaned_content":"laxmi organic industries share price jumped over \u003cSIX_PERCENT\u003e on tuesday extending its rally for the third consecutive session amid heavy volumes laxmi organic shares rallied as much as \u003cSIX_PERCENT\u003e to a high of \u003cTHREE_HUNDRED\u003e apiece on the bse around \u003cFOUR_TEN\u003e lakh equity shares of laxmi organic industries traded hands on stock exchanges today as against its one week average volume of \u003cONE_TEN\u003e lakh shares laxmi organic share price has gained over \u003cSEVEN_PERCENT\u003e in one month and more than \u003cONE_TEN_PERCENT\u003e in three months however the mid cap stock has remained rangedbound in one year as has gained just \u003cFIVE_PERCENT\u003e during the period brokerage firm anand rathi noted that laxmi organic shares broke above a bearish trendline and it expects the stock to see a decent upmove over the past year laxmi organic industries stock has established a robust support level within the range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e undergoing multiple tests that have demonstrated its resilience in the face of downward pressure recently there has been a significant development as laxmi organic industries shares broke above a bearish trendline that had constrained its movement for the past \u003cTHREE_\u003e \u003cFOUR_\u003e years and notably it has sustained this breakout this suggests a fundamental shift in market sentiment towards laxmi organic industries stock anand rathi said in a report furthermore on the indicator front the weekly relative strength index rsi has surpassed its own multi year bearish trendline signaling bullish momentum in the short to medium term considering these technical indicators anand rathi has advised traders and investors to initiate long positions in laxmi organic industries shares within the range of \u003cTWO_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e and for a timeframe of \u003cTHREE_\u003e months it has set a target price of \u003cTHREE_HUNDRED\u003e per share on the stock implying an upside potential of around \u003cTWO_TEN_PERCENT\u003e to manage risk analysts at the brokerage firm recommend placing a stop loss order near \u003cTWO_HUNDRED\u003e on a daily closing basis laxmi organic industries share price hit a \u003cFIVE_TEN\u003e week high of \u003cTHREE_HUNDRED\u003e apiece on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e while the stock hit a \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e apiece on june \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e on bse at \u003cTWO_\u003e \u003cTHREE_TEN\u003e pm laxmi organic shares were trading \u003cTHREE_PERCENT\u003e higher at \u003cTHREE_HUNDRED\u003e apiece commanding a market capitalization of nearly \u003cEIGHT_THOUSAND\u003e crore on the bse","timestamp":"2024-09-24T14:32:00+05:30","market_timestamp":"2024-09-24T14:32:00+05:30","off_market_hours":false}