{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-nasdaq-drops-0-24-amid-middle-eastern-crisis-oil-price-spike-tesla-sinks-4-11727880727022.html","title":"Wall Street today: Nasdaq drops 0.24% amid Middle Eastern crisis, oil price spike; Tesla sinks 4%","description":"Wall Street today: The US stock market opened lower on Wednesday, October 2, amid rising geopolitical tensions in the Middle East between Israel and Iran. Along with markets opening low, oil prices spiked nearly 1 per cent on Wednesday.","content":"The US stock market opened lower on Wednesday, October 2, amid rising geopolitical tensions in the Middle East between Israel and Iran. Along with markets opening low, oil prices spiked nearly 1 per cent on Wednesday.At 9:30 am (EDT), the stock markets opened lower for the United States. The Dow Jones Industrial Average fell 0.08 per cent at the opening bell to 42,125.14 points, compared to 42,156.97 points at Tuesday's market close.Companies like Salesforce Inc., UnitedHealth Group Inc., Intel Corp., Cisco Systems Inc., Goldman Sachs Group Inc., Caterpillar Inc., American Express Co., Amazon.com Inc., Chevron Corp., Walt Disney Co., Dow Inc., Travelers Cos. Inc., JPMorgan Chase \u0026 Co., and McDonald's Corp. were amongst the top gainers on the Dow Jones Industrial Average during Wednesday's trading session.Home Depot Inc., Apple Inc., Visa Inc., Johnson \u0026 Johnson, International Business Machines Corp., Verizon Communications Inc., Honeywell International Inc., 3M Co., Amgen Inc., Boeing Co., Microsoft Corp., Procter \u0026 Gamble Co., Walmart Inc., Coca-Cola Co., Merck \u0026 Co. Inc., and Nike Inc. were amongst the top laggards during the Wednesday's market hours, according to data collected from Marketwatch.com.The S\u0026P 500 index dropped 0.19 per cent to open at 5,698.14 points on Wednesday, compared to 5,708.75 points at the previous market close.Companies like Caesars Entertainment Inc., KLA Corp., Lam Research Corp., Vistra Corp., Applied Materials Inc., Monolithic Power Systems Inc., Qorvo Inc., Teradyne Inc., Invesco Ltd., and Bristol Myers Squibb Co., were amongst the top gainers during the market session on the S\u0026P 500 index.Whereas Humana Inc., Conagra Brands Inc., Nike Inc., Tesla Inc., Crown Castle Inc., CarMax Inc., McCormick \u0026 Co. Inc., Delta Air Lines Inc., Amentum Holdings Inc., were amongst the top laggards for Wednesday's trading session, as per Marketwatch data.The Nasdaq Composite fell 0.24 per cent to 17,867.124 points at Wednesday's market open, compared to 17,910.36 points at the previous market close.Nova Vision Acquisition Corp., Wheeler Real Estate Investment Trust Inc., Kaixin Holdings, TOP Financial Group Ltd., Agora Inc., iCoreConnect Inc., MMTec Inc., Magic Empire Global Ltd., Garden Stage Ltd., UP Fintech Holdings Ltd. were the top gainers on Wednesday in the Nasdaq Composite index.American Rebel Holdings Inc., Eagle Pharmaceuticals Inc., Baird Medical Investment Holdings Ltd., Windtree Therapeutics Inc., Baiyu Holdings Inc., New Horizon Aircrafts Ltd., Aditxt Inc., Shattuck Labs Inc., Jowell Global Ltd., and Klotho Neurosciences Inc., were amongst the top losers during Wednesday's trading hours.","cleaned_content":"the us stock market opened lower on wednesday october \u003cTWO_\u003e amid rising geopolitical tensions in the middle east between israel and iran along with markets opening low oil prices spiked nearly \u003cONE_PERCENT\u003e on wednesday at \u003cNINE_\u003e \u003cTHREE_TEN\u003e am edt the stock markets opened lower for the united states the dow jones industrial average fell \u003cZERO_PERCENT\u003e at the opening bell to \u003cFOUR_TEN_THOUSAND\u003e points compared to \u003cFOUR_TEN_THOUSAND\u003e points at tuesdays market close companies like salesforce inc unitedhealth group inc intel corp cisco systems inc goldman sachs group inc caterpillar inc american express co amazon com inc chevron corp walt disney co dow inc travelers cos inc jpmorgan chase co and mcdonalds corp were amongst the top gainers on the dow jones industrial average during wednesdays trading session home depot inc apple inc visa inc johnson johnson international business machines corp verizon communications inc honeywell international inc \u003cTHREE_\u003e m co amgen inc boeing co microsoft corp procter gamble co walmart inc coca cola co merck co inc and nike inc were amongst the top laggards during the wednesdays market hours according to data collected from marketwatch com the s p \u003cFIVE_HUNDRED\u003e index dropped \u003cZERO_PERCENT\u003e to open at \u003cFIVE_THOUSAND\u003e points on wednesday compared to \u003cFIVE_THOUSAND\u003e points at the previous market close companies like caesars entertainment inc kla corp lam research corp vistra corp applied materials inc monolithic power systems inc qorvo inc teradyne inc invesco ltd and bristol myers squibb co were amongst the top gainers during the market session on the s p \u003cFIVE_HUNDRED\u003e index whereas humana inc conagra brands inc nike inc tesla inc crown castle inc carmax inc mccormick co inc delta air lines inc amentum holdings inc were amongst the top laggards for wednesdays trading session as per marketwatch data the nasdaq composite fell \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e points at wednesdays market open compared to \u003cONE_TEN_THOUSAND\u003e points at the previous market close nova vision acquisition corp wheeler real estate investment trust inc kaixin holdings top financial group ltd agora inc icoreconnect inc mmtec inc magic empire global ltd garden stage ltd up fintech holdings ltd were the top gainers on wednesday in the nasdaq composite index american rebel holdings inc eagle pharmaceuticals inc baird medical investment holdings ltd windtree therapeutics inc baiyu holdings inc new horizon aircrafts ltd aditxt inc shattuck labs inc jowell global ltd and klotho neurosciences inc were amongst the top losers during wednesdays trading hours","timestamp":"2024-10-02T21:58:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}