{"url":"https://www.livemint.com/market/stock-market-news/stock-to-buy-or-sell-ntpc-share-price-dips-after-technical-breakout-opportunity-for-bottom-fishing-11727339534415.html","title":"Stock to buy or sell: NTPC share price dips after technical breakout. Opportunity for bottom fishing?","description":"Stock to buy or sell: NTPC share price gave fresh breakout at  ₹417 apiece during Wednesday deals","content":"Stock to buy or sell: Shares of the National Thermal Power Corporation (NTPC) gave a technical breakout during Wednesday deals when they finally breached above  ₹417 apiece. The NTPC share price ended at around  ₹436 per share on Wednesday. However, the PSU stock slipped during Thursday deals and is currently quoting around  ₹430 per share. So, those interested in buying NTPC shares may think of adding the PSU stock to their portfolio.According to stock market experts, NTPC deals in the power sector, where demand is expected to remain on the rise. The state-owned company has been working on its Capex expansion and holds the key if India needs to transform into the third-largest economy in the world. They advised NTPC shareholders to accumulate more, and those who want to add NTPC shares to their portfolio should consider this fall in NTPC share price an opportunity for bottom fishing.Calling NTPC shares as one of the portfolio stocks to buy, Sagar Shetty, Research Analyst at StoxBox, said, “The power demand in India poised to grow consistently on the back of our transition towards becoming the third largest economy in the world in future. We believe that NTPC, the largest power generator in India with 76 GW of installed capacity, is best placed to ride the incremental demand for power in India. Additionally, plans to reach a capacity of 130 GW by 2032 with a significant focus on renewable energy, which has better unit economics and faster commissioning, bodes well for future business growth.”\"The inherent risk-averse business due to regulated tariff model, consistent improvement in operating and financial metrics, improved availability of coal and better visibility of receivables from discoms would be catalysts driving the company's future performance. Also, we expect the monetization of the renewable energy business, through NTPC Green Energy IPO, to further improve shareholders return going ahead,\" the StoxBox expert added.Expecting a solid rebound in NTPC share price, Shiju Vasu Koothupalakkal, Senior Manager of Technical Research at Prabhudas Lilladher, said, “NTPC share price has indicated a strong pullback from the significant 50EMA zone of  ₹395 and has given a decisive breakout above the descending channel pattern on the daily chart at  ₹417 zone with strong bias witnessed. A positive candle formation from the consolidation zone has further improved the bias. With the RSI on the rise with positive indications and rising volume participation, the stock looks attractive, and further rise is anticipated in the coming days. We suggest buying NTPC shares today for an upside potential target of  ₹446 and  ₹480, respectively, keeping the stop loss at  ₹415.”","cleaned_content":"stock to buy or sell shares of the national thermal power corporation ntpc gave a technical breakout during wednesday deals when they finally breached above \u003cFOUR_HUNDRED\u003e apiece the ntpc share price ended at around \u003cFOUR_HUNDRED\u003e per share on wednesday however the psu stock slipped during thursday deals and is currently quoting around \u003cFOUR_HUNDRED\u003e per share so those interested in buying ntpc shares may think of adding the psu stock to their portfolio according to stock market experts ntpc deals in the power sector where demand is expected to remain on the rise the state owned company has been working on its capex expansion and holds the key if india needs to transform into the third largest economy in the world they advised ntpc shareholders to accumulate more and those who want to add ntpc shares to their portfolio should consider this fall in ntpc share price an opportunity for bottom fishing calling ntpc shares as one of the portfolio stocks to buy sagar shetty research analyst at stoxbox said the power demand in india poised to grow consistently on the back of our transition towards becoming the third largest economy in the world in future we believe that ntpc the largest power generator in india with \u003cSEVEN_TEN\u003e gw of installed capacity is best placed to ride the incremental demand for power in india additionally plans to reach a capacity of \u003cONE_HUNDRED\u003e gw by \u003cTWO_THOUSAND\u003e with a significant focus on renewable energy which has better unit economics and faster commissioning bodes well for future business growth the inherent risk averse business due to regulated tariff model consistent improvement in operating and financial metrics improved availability of coal and better visibility of receivables from discoms would be catalysts driving the companys future performance also we expect the monetization of the renewable energy business through ntpc green energy ipo to further improve shareholders return going ahead the stoxbox expert added expecting a solid rebound in ntpc share price shiju vasu koothupalakkal senior manager of technical research at prabhudas lilladher said ntpc share price has indicated a strong pullback from the significant \u003cFIVE_TEN\u003e ema zone of \u003cTHREE_HUNDRED\u003e and has given a decisive breakout above the descending channel pattern on the daily chart at \u003cFOUR_HUNDRED\u003e zone with strong bias witnessed a positive candle formation from the consolidation zone has further improved the bias with the rsi on the rise with positive indications and rising volume participation the stock looks attractive and further rise is anticipated in the coming days we suggest buying ntpc shares today for an upside potential target of \u003cFOUR_HUNDRED\u003e and \u003cFOUR_HUNDRED\u003e respectively keeping the stop loss at \u003cFOUR_HUNDRED\u003e","timestamp":"2024-09-26T14:17:00+05:30","market_timestamp":"2024-09-26T14:17:00+05:30","off_market_hours":false}