{"url":"https://www.livemint.com/market/stock-market-news/smallcap-it-stock-jumps-14-after-pm-modi-launching-companys-ifsc-single-window-system-11727246082132.html","title":"Small-cap IT stock jumps 14% after PM Modi launches company’s IFSC single window system","description":"Small-cap IT stock: Dev Information Technology Limited saw a 14% surge in early trading on Wednesday, September 25 after the launch of its Single Window IT System (SWIT) by Prime Minister Narendra Modi.","content":"Small-cap IT stock: Dev Information Technology share price surged 14% in early trading on September 25. Wednesday, following the launch of the company's Single Window IT System (SWIT) by Prime Minister Narendra Modi. The system, designed to streamline operations for businesses in India's International Financial Services Centres (IFSCs), was unveiled on September 16 in Ahmedabad.Dev IT share price was trading in the green, up 12.22 per cent,  ₹143.6, on September 25, at 12:56 pm, on NSE. Dev IT enjoys a market capitalisation of  ₹322.97 crore, as per NSE.The SWIT platform, developed by Dev IT under the guidance of the International Financial Services Centres Authority (IFSCA), aims to simplify bureaucratic procedures and enhance transparency for entities setting up operations in these specialized financial zones. This innovation is expected to boost India's attractiveness as a global financial hub by reducing the time and effort required for businesses to establish a presence in IFSCs.Pranav Pandya, Founder \u0026 Chairman of Dev Information Technology Limited, expressed his enthusiasm about the project, stating, “We are delighted to be a part of India's digital transformation journey with the launch of the SWIT. Developed under the guidance of the International Financial Services Centres Authority, this project showcases our ability to create scalable, innovative solutions that simplify complex business processes, enhancing operational efficiency for businesses looking to establish themselves in India's International Financial Services Centres.”The successful development of SWIT demonstrates Dev IT's capabilities in delivering cutting-edge digital solutions and positions the company for potential growth in various sectors, including healthcare, e-governance, and retail.Dev IT, founded in 1997 and headquartered in Ahmedabad, has evolved from a small-scale business automation software provider into a global IT services company. The firm offers a range of services, including cloud services, digital transformation, enterprise applications, and managed IT services.In the fiscal year 2024, Dev IT reported revenue of  ₹165.12 crore, EBITDA of  ₹15.31 crore, and PAT of  ₹9.48 crore. The company's recent success with the SWIT platform could potentially open doors for more high-impact projects and further cement its position in the IT services landscape.","cleaned_content":"small cap it stock dev information technology share price surged \u003cONE_TEN_PERCENT\u003e in early trading on september \u003cTWO_TEN\u003e wednesday following the launch of the companys single window it system swit by prime minister narendra modi the system designed to streamline operations for businesses in indias international financial services centres ifscs was unveiled on september \u003cONE_TEN\u003e in ahmedabad dev it share price was trading in the green up \u003cONE_TEN_PERCENT\u003e \u003cONE_HUNDRED\u003e on september \u003cTWO_TEN\u003e at \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e pm on nse dev it enjoys a market capitalisation of \u003cTHREE_HUNDRED\u003e crore as per nse the swit platform developed by dev it under the guidance of the international financial services centres authority ifsca aims to simplify bureaucratic procedures and enhance transparency for entities setting up operations in these specialized financial zones this innovation is expected to boost indias attractiveness as a global financial hub by reducing the time and effort required for businesses to establish a presence in ifscs pranav pandya founder chairman of dev information technology limited expressed his enthusiasm about the project stating we are delighted to be a part of indias digital transformation journey with the launch of the swit developed under the guidance of the international financial services centres authority this project showcases our ability to create scalable innovative solutions that simplify complex business processes enhancing operational efficiency for businesses looking to establish themselves in indias international financial services centres the successful development of swit demonstrates dev its capabilities in delivering cutting edge digital solutions and positions the company for potential growth in various sectors including healthcare e governance and retail dev it founded in \u003cONE_THOUSAND\u003e and headquartered in ahmedabad has evolved from a small scale business automation software provider into a global it services company the firm offers a range of services including cloud services digital transformation enterprise applications and managed it services in the fiscal year \u003cTWO_THOUSAND\u003e dev it reported revenue of \u003cONE_HUNDRED\u003e crore ebitda of \u003cONE_TEN\u003e crore and pat of \u003cNINE_\u003e crore the companys recent success with the swit platform could potentially open doors for more high impact projects and further cement its position in the it services landscape","timestamp":"2024-09-25T12:07:00+05:30","market_timestamp":"2024-09-25T12:07:00+05:30","off_market_hours":false}