{"url":"https://www.livemint.com/market/stock-market-news/smallcap-nbfc-stock-ugro-capital-surges-5-ahead-of-crucial-board-meeting-2-brokerages-predict-up-to-37-upside-11727076386152.html","title":"Smallcap NBFC stock UGRO Capital surges 5% ahead of crucial board meeting; 2 brokerages predict Up to 37% upside","description":"UGRO Capital's stock rose by over 5% as it prepared for a pivotal board meeting on September 24 to discuss fundraising. Brokerages predict up to 37% potential upside, reflecting strong investor confidence in the company's growth prospects in the MSME lending market.","content":"Smallcap NBFC stock UGRO Capital was in focus on Monday, climbing over 5 per cent in intra-day trading as the company prepared for a crucial board meeting on September 24 to discuss potential fundraising. The market sentiment was further boosted by optimistic brokerage coverage, with two major firms, Choice Broking and InCred Capital, forecasting a potential upside of up to 37 per cent for the stock.Choice Broking issued an outperform rating on UGRO Capital, setting a target price of  ₹345, indicating a 35 per cent upside. Meanwhile, InCred Capital provided an 'add' recommendation with a target price of  ₹350, representing an almost 37 per cent potential gain. These bullish forecasts contributed to the stock’s upward movement.The smallcap stock surged as much as 5.4 per cent to an intra-day high of  ₹270, narrowing the gap to just over 14 per cent from its peak of  ₹314.85, recorded in May 2024. UGRO Capital has risen nearly 27 per cent since hitting a 52-week low of  ₹213.15 in March this year, showcasing strong investor confidence in the stock’s prospects.Originally scheduled for September 23, UGRO Capital’s board meeting was postponed to September 24 due to unforeseen circumstances. The board is set to consider raising funds via Non-Convertible Debentures (NCDs) through private placement and public issues, though the specific amount is yet to be disclosed.In an exchange filing, Ugro Capital said, “In furtherance to our previous intimations submitted on September 17, 2024 and September 18, 2024 regarding the meeting of Investment and Borrowing Committee of the Board of Directors (“Committee”) scheduled to be held on Monday, September 23, 2024, to consider and approve raising of funds by way of issuance of Non-Convertible Debentures through private placement basis and through public issue, we hereby notify that the meeting has been postponed to Tuesday, September 24, 2024 for the same purpose due to inevitable reasons.\"Choice Broking highlighted UGRO Capital’s strong positioning in the MSME lending market, citing the company’s tech-driven approach and efficient asset quality management through advanced systems and data analytics. The firm emphasized the potential for UGRO Capital to tap into the underserved MSME sector, aided by its scalable business model and strategic focus on co-lending and co-origination. With an expected compound annual growth rate (CAGR) of 41 per cent in AUM and 42 per cent in EPS from FY24-26, Choice projected UGRO’s RoA and RoE to reach 4.2 per cent and 15.8 per cent, respectively, by FY26E.Choice Broking also noted that UGRO’s increasing off-book AUM should enhance its other income and net interest margins (NIMs), while branch expansions into new states are expected to fuel further growth. The brokerage firm anticipated a robust 55 per cent CAGR in net interest income (NII) and 83 per cent CAGR in profit after tax (PAT) over FY24-FY26E.InCred Capital echoed a similar positive outlook, noting the NBFC's impressive growth trajectory, particularly in the MSME sector. UGRO’s AUM had expanded nearly seven times since FY21, reaching  ₹92 billion by June 2024, with its operations spread across 164 branches in 11 states.InCred underscored UGRO’s asset-light business model, with around 50 per cent off-balance sheet growth driven by co-lending and co-origination partnerships. The brokerage expected AUM growth of 34.2 per cent CAGR between FY24 and FY27F, which would drive improvements in margins and return ratios. RoA and RoE were projected to rise to 4 per cent and 14 per cent, respectively, by FY27F after adjusting for an equity infusion of  ₹12.7 billion.Despite potential risks related to slower growth and asset quality, InCred believed UGRO’s strong collection and underwriting mechanisms would mitigate these concerns. The firm forecasted a PAT CAGR of 59.8 per cent over FY24-27F, driven by robust AUM growth and steady margins.UGRO Capital's stock has garnered attention from investors and analysts, driven by its strong growth prospects in the MSME lending space and its tech-driven, asset-light business model. With a significant fundraising plan on the horizon and positive coverage from leading brokerage firms, UGRO Capital appears well-positioned to continue its upward trajectory. However, investors are advised to remain cautious, considering the inherent risks associated with asset quality and growth execution in the competitive NBFC sector.","cleaned_content":"smallcap nbfc stock ugro capital was in focus on monday climbing over \u003cFIVE_PERCENT\u003e in intra day trading as the company prepared for a crucial board meeting on september \u003cTWO_TEN\u003e to discuss potential fundraising the market sentiment was further boosted by optimistic brokerage coverage with two major firms choice broking and incred capital forecasting a potential upside of up to \u003cTHREE_TEN_PERCENT\u003e for the stock choice broking issued an outperform rating on ugro capital setting a target price of \u003cTHREE_HUNDRED\u003e indicating a \u003cTHREE_TEN_PERCENT\u003e upside meanwhile incred capital provided an add recommendation with a target price of \u003cTHREE_HUNDRED\u003e representing an almost \u003cTHREE_TEN_PERCENT\u003e potential gain these bullish forecasts contributed to the stock s upward movement the smallcap stock surged as much as \u003cFIVE_PERCENT\u003e to an intra day high of \u003cTWO_HUNDRED\u003e narrowing the gap to just over \u003cONE_TEN_PERCENT\u003e from its peak of \u003cTHREE_HUNDRED\u003e recorded in may \u003cTWO_THOUSAND\u003e ugro capital has risen nearly \u003cTWO_TEN_PERCENT\u003e since hitting a \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e in march this year showcasing strong investor confidence in the stock s prospects originally scheduled for september \u003cTWO_TEN\u003e ugro capital s board meeting was postponed to september \u003cTWO_TEN\u003e due to unforeseen circumstances the board is set to consider raising funds via non convertible debentures ncds through private placement and public issues though the specific amount is yet to be disclosed in an exchange filing ugro capital said in furtherance to our previous intimations submitted on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e regarding the meeting of investment and borrowing committee of the board of directors committee scheduled to be held on monday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to consider and approve raising of funds by way of issuance of non convertible debentures through private placement basis and through public issue we hereby notify that the meeting has been postponed to tuesday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e for the same purpose due to inevitable reasons choice broking highlighted ugro capital s strong positioning in the msme lending market citing the company s tech driven approach and efficient asset quality management through advanced systems and data analytics the firm emphasized the potential for ugro capital to tap into the underserved msme sector aided by its scalable business model and strategic focus on co lending and co origination with an expected compound annual growth rate cagr of \u003cFOUR_TEN_PERCENT\u003e in aum and \u003cFOUR_TEN_PERCENT\u003e in eps from fy24 \u003cTWO_TEN\u003e choice projected ugro s roa and roe to reach \u003cFOUR_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively by fy26e choice broking also noted that ugro s increasing off book aum should enhance its other income and net interest margins nims while branch expansions into new states are expected to fuel further growth the brokerage firm anticipated a robust \u003cFIVE_TEN_PERCENT\u003e cagr in net interest income nii and \u003cEIGHT_TEN_PERCENT\u003e cagr in profit after tax pat over fy24 fy26e incred capital echoed a similar positive outlook noting the nbfcs impressive growth trajectory particularly in the msme sector ugro s aum had expanded nearly seven times since fy21 reaching \u003cNINE_TEN\u003e billion by june \u003cTWO_THOUSAND\u003e with its operations spread across \u003cONE_HUNDRED\u003e branches in \u003cONE_TEN\u003e states incred underscored ugro s asset light business model with around \u003cFIVE_TEN_PERCENT\u003e off balance sheet growth driven by co lending and co origination partnerships the brokerage expected aum growth of \u003cTHREE_TEN_PERCENT\u003e cagr between fy24 and fy27f which would drive improvements in margins and return ratios roa and roe were projected to rise to \u003cFOUR_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively by fy27f after adjusting for an equity infusion of \u003cONE_TEN\u003e billion despite potential risks related to slower growth and asset quality incred believed ugro s strong collection and underwriting mechanisms would mitigate these concerns the firm forecasted a pat cagr of \u003cFIVE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e f driven by robust aum growth and steady margins ugro capitals stock has garnered attention from investors and analysts driven by its strong growth prospects in the msme lending space and its tech driven asset light business model with a significant fundraising plan on the horizon and positive coverage from leading brokerage firms ugro capital appears well positioned to continue its upward trajectory however investors are advised to remain cautious considering the inherent risks associated with asset quality and growth execution in the competitive nbfc sector","timestamp":"2024-09-23T13:25:00+05:30","market_timestamp":"2024-09-23T13:25:00+05:30","off_market_hours":false}