{"url":"https://www.livemint.com/market/stock-market-news/stock-market-holiday-nse-bse-shut-on-account-of-gandhi-jayanti-11727830887802.html","title":"Stock market holiday: NSE, BSE shut today on account of Gandhi Jayanti","description":"Stock market holiday: The Indian stock markets will be closed on Wednesday, October 2, 2024, to commemorate Gandhi Jayanti, a national holiday honouring the birth of Mahatma Gandhi.","content":"Stock market holiday: The National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) will be closed on Wednesday, October 2, 2024. The closure marks Gandhi Jayanti, a national holiday in India.Gandhi Jayanti honours the birth of Mohandas Karamchand Gandhi. He was key to India's independence movement and is known worldwide for his non-violence principles.All trading will stop for the day. This includes equity, derivatives, and securities lending.The Multi Commodity Exchange (MCX) will also remain closed for both sessions on October 2.Markets will re-open on Thursday, October 3.On Tuesday, the BSE Sensex and the NSE Nifty50 closed slightly lower after a volatile trading day.Indian stock markets typically operate from 9:15 am to 3:30 pm on weekdays. A pre-open session runs from 9:00 am to 9:15 am. Markets remain closed on weekends.NSE and BSE will close for:Diwali: November 1 (Friday)Guru Nanak Jayanti: November 15 (Friday)Christmas: December 25 (Wednesday)MCX Holiday Schedule:Gandhi Jayanti: October 2 (Wednesday) - Closed all dayDiwali: November 1 (Friday) - Closed morning sessionGuru Nanak Jayanti: November 15 (Friday) - Closed morning sessionChristmas: December 25 (Wednesday) - Closed all dayChinese stock markets are on an extended break and remain closed from October 1 to October 7. This week-long break marks China National Day.Hong Kong's market was also shut on October 1.A special Muhurat trading session will take place on November 1 in the Indian stock markets. This marks Diwali and the start of Samvat 2081, the new Hindu calendar year.This brief session allows investors to make trades which are considered lucky for the coming year.","cleaned_content":"stock market holiday the national stock exchange nse and bombay stock exchange bse will be closed on wednesday october \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e the closure marks gandhi jayanti a national holiday in india gandhi jayanti honours the birth of mohandas karamchand gandhi he was key to indias independence movement and is known worldwide for his non violence principles all trading will stop for the day this includes equity derivatives and securities lending the multi commodity exchange mcx will also remain closed for both sessions on october \u003cTWO_\u003e markets will re open on thursday october \u003cTHREE_\u003e on tuesday the bse sensex and the nse nifty50 closed slightly lower after a volatile trading day indian stock markets typically operate from \u003cNINE_\u003e \u003cONE_TEN\u003e am to \u003cTHREE_\u003e \u003cTHREE_TEN\u003e pm on weekdays a pre open session runs from \u003cNINE_\u003e \u003cZERO_\u003e am to \u003cNINE_\u003e \u003cONE_TEN\u003e am markets remain closed on weekends nse and bse will close for diwali november \u003cONE_\u003e friday guru nanak jayanti november \u003cONE_TEN\u003e friday christmas december \u003cTWO_TEN\u003e wednesday mcx holiday schedule gandhi jayanti october \u003cTWO_\u003e wednesday closed all daydiwali november \u003cONE_\u003e friday closed morning sessionguru nanak jayanti november \u003cONE_TEN\u003e friday closed morning sessionchristmas december \u003cTWO_TEN\u003e wednesday closed all daychinese stock markets are on an extended break and remain closed from october \u003cONE_\u003e to october \u003cSEVEN_\u003e this week long break marks china national day hong kongs market was also shut on october \u003cONE_\u003e a special muhurat trading session will take place on november \u003cONE_\u003e in the indian stock markets this marks diwali and the start of samvat \u003cTWO_THOUSAND\u003e the new hindu calendar year this brief session allows investors to make trades which are considered lucky for the coming year","timestamp":"2024-10-02T06:36:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}