{"url":"https://www.livemint.com/market/stock-market-news/krn-heat-exchange-share-price-rises-further-after-stellar-listing-with-113-118-premium-buy-sell-or-hold-the-stock-11727928064297.html","title":"KRN Heat Exchange share price rises 7% after listing at 118% premium. Buy, sell or hold the stock?","description":"KRN Heat Exchanger and Refrigeration share price after listing with a stellar 113-118% premium, rose another 7%. Experts recommend booking some profits following the sharp gains amid valuation concerns.","content":"KRN Heat Exchanger and Refrigeration share price extended gains after listing with multibagger gains in Thursday's (3 October) trade.The stock listed with a stellar 113% premium on the BSE at  ₹470 and a 118% premium on the NSE at  ₹480. It scaled highs of  ₹513.50 on the NSE and  ₹513.40 on the BSE, marking gains of around 7%.Analysts were positive about the prospects of the company ahead of the IPO. Moreover, the strong subscriptions received by KRN Heat Exchanger and Refrigeration IPO signalled strong investor interest while GMP or grey market premium indicated strong listing gains.Analysts at Anand Rathi had given a “subscribe for long term” rating to the IPO. Given the company's established history, its intention to grow globally, and the growing demand in the HVAC industry, KRN's revenue and profit margin may eventually benefit, the brokerage had said.However, in the near term, the valuations were capturing near-term prospects, the brokerage had added. Anand Rathi said that at the upper price band, the company’s implied market cap is around  ₹1310 crore, with FY24 price-to-earnings ratio of 33.5 times, which, it said, appears to be fully priced.On the valuation front, post-listing, the stock may be richly valued and short-term investors could book some profits, said Narendra Solanki, Head Fundamental Research - Investment Services, Anand Rathi Shares and Stock Brokers.Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd said that despite the market selloff, KRN Heat Exchanger's listing was in line with our expectations on the back of bumper subscriptions from all sets of investors.Tapse advised investors to book profits as he believes post listing, the valuations can over stretch on a higher side, discounting all the medium term business growth visibility. For non-allottees, it would be better to wait and watch for the price to settle, he added.Shivani Nyati, Head of Wealth, Swastika Investmart Ltd had similar recommendations and said that even though the IPO's valuation seems reasonable, it is difficult to draw direct comparisons because no peers have been listed. Nonetheless, investors may book a portion of the profit and keep the remaining amount because of KRN Heat Exchangers' excellent fundamentals and market demand, Nyati said.Some of the key strengths of the company highlighted by KRChoksey Research included:The business is well-known both domestically and abroad. In FY24, KRN Heat Exchanger exported its products to 14 countries and marketed them in several Indian states. North America and Europe have become important global markets for the company amid a growing demand for its products.Following the three-day bidding process, the IPO for KRN Heat Exchanger was subscribed 213.41 times. The retail category received 96.74 times bids, the QIB category 253.04 times and the NII category 430.54 times.,","cleaned_content":"krn heat exchanger and refrigeration share price extended gains after listing with multibagger gains in thursdays \u003cTHREE_\u003e october trade the stock listed with a stellar \u003cONE_HUNDRED_PERCENT\u003e premium on the bse at \u003cFOUR_HUNDRED\u003e and a \u003cONE_HUNDRED_PERCENT\u003e premium on the nse at \u003cFOUR_HUNDRED\u003e it scaled highs of \u003cFIVE_HUNDRED\u003e on the nse and \u003cFIVE_HUNDRED\u003e on the bse marking gains of around \u003cSEVEN_PERCENT\u003e analysts were positive about the prospects of the company ahead of the ipo moreover the strong subscriptions received by krn heat exchanger and refrigeration ipo signalled strong investor interest while gmp or grey market premium indicated strong listing gains analysts at anand rathi had given a subscribe for long term rating to the ipo given the companys established history its intention to grow globally and the growing demand in the hvac industry krns revenue and profit margin may eventually benefit the brokerage had said however in the near term the valuations were capturing near term prospects the brokerage had added anand rathi said that at the upper price band the company s implied market cap is around \u003cONE_THOUSAND\u003e crore with fy24 price to earnings ratio of \u003cTHREE_TEN\u003e times which it said appears to be fully priced on the valuation front post listing the stock may be richly valued and short term investors could book some profits said narendra solanki head fundamental research investment services anand rathi shares and stock brokers prashanth tapse senior vp research mehta equities ltd said that despite the market selloff krn heat exchangers listing was in line with our expectations on the back of bumper subscriptions from all sets of investors tapse advised investors to book profits as he believes post listing the valuations can over stretch on a higher side discounting all the medium term business growth visibility for non allottees it would be better to wait and watch for the price to settle he added shivani nyati head of wealth swastika investmart ltd had similar recommendations and said that even though the ipos valuation seems reasonable it is difficult to draw direct comparisons because no peers have been listed nonetheless investors may book a portion of the profit and keep the remaining amount because of krn heat exchangers excellent fundamentals and market demand nyati said some of the key strengths of the company highlighted by krchoksey research included the business is well known both domestically and abroad in fy24 krn heat exchanger exported its products to \u003cONE_TEN\u003e countries and marketed them in several indian states north america and europe have become important global markets for the company amid a growing demand for its products following the three day bidding process the ipo for krn heat exchanger was subscribed \u003cTWO_HUNDRED\u003e times the retail category received \u003cNINE_TEN\u003e times bids the qib category \u003cTWO_HUNDRED\u003e times and the nii category \u003cFOUR_HUNDRED\u003e times","timestamp":"2024-10-03T12:00:00+05:30","market_timestamp":"2024-10-03T12:00:00+05:30","off_market_hours":false}