{"url":"https://www.livemint.com/market/stock-market-news/several-psus-trade-at-extremely-high-market-caps-relative-to-their-profits-net-worth-or-assets-kotak-report-11727954578421.html","title":"Several PSUs trade at extremely high market caps relative to their profits, net worth or assets: Kotak report","description":"The market is overlooking the significant embedded risks in the current high valuations, even though investors are concerned about potential factors that could disrupt the ongoing rally, it stated.","content":"The Indian equity markets have experienced a recent pullback following a record-breaking rally. In a recent note, analysts at Kotak Institutional Equities highlighted that investors seem to be overlooking concerns about high valuations. They believe that the pursuit of returns has outweighed the fear of risks, whether apparent or hidden.The brokerage noted that institutional investors have concentrated on identifying potential risk factors but have strangely overlooked the possibility that the greatest risk may lie in the significant disparity between current stock prices and their fair values across the market.\"Greed of returns has overwhelmed fear of risks (visible or invisible). The fact that the investors have made high returns will mean little in the event of an eventual alignment of stock prices with fair values,\" the brokerage firm said in the report.The market is overlooking the significant embedded risks in the current high valuations, even though investors are concerned about potential factors that could disrupt the ongoing rally, it stated.Kotak noted that the significant inflows into domestic equity mutual funds from retail investors, as well as the investments from mutual funds into the markets, indicate a strong sense of greed prevailing in the market.\"As we have argued before, high conviction at all price points among retail investors with limited investment experience due to high returns over the past 3-4 years has led to the high levels of confidence (greed) among investors of all kinds,\" the report added.Kotak stated that it can only hope for a sufficient time interval between now and a correction, which could help narrow the gap between current stock prices and their fair values by rolling forward earnings.\"The impact for investors will depend on the ownership of the shares at various points in time in the upcycle (and eventual downcycle)—two extreme cases will help appreciate this better. If the share price of a company was to go from  ₹100 to  ₹500 and correct to  ₹200 eventually, the outcome is still a great one for an investor if he or she was to hold the stock through the ride but will be very painful for the investor who would have bought it at  ₹500 ( ₹300 loss) and very joyous for the investor who would have sold it at  ₹500 ( ₹400 gain),\" it said.","cleaned_content":"the indian equity markets have experienced a recent pullback following a record breaking rally in a recent note analysts at kotak institutional equities highlighted that investors seem to be overlooking concerns about high valuations they believe that the pursuit of returns has outweighed the fear of risks whether apparent or hidden the brokerage noted that institutional investors have concentrated on identifying potential risk factors but have strangely overlooked the possibility that the greatest risk may lie in the significant disparity between current stock prices and their fair values across the market greed of returns has overwhelmed fear of risks visible or invisible the fact that the investors have made high returns will mean little in the event of an eventual alignment of stock prices with fair values the brokerage firm said in the report the market is overlooking the significant embedded risks in the current high valuations even though investors are concerned about potential factors that could disrupt the ongoing rally it stated kotak noted that the significant inflows into domestic equity mutual funds from retail investors as well as the investments from mutual funds into the markets indicate a strong sense of greed prevailing in the market as we have argued before high conviction at all price points among retail investors with limited investment experience due to high returns over the past \u003cTHREE_\u003e \u003cFOUR_\u003e years has led to the high levels of confidence greed among investors of all kinds the report added kotak stated that it can only hope for a sufficient time interval between now and a correction which could help narrow the gap between current stock prices and their fair values by rolling forward earnings the impact for investors will depend on the ownership of the shares at various points in time in the upcycle and eventual downcycle two extreme cases will help appreciate this better if the share price of a company was to go from \u003cONE_HUNDRED\u003e to \u003cFIVE_HUNDRED\u003e and correct to \u003cTWO_HUNDRED\u003e eventually the outcome is still a great one for an investor if he or she was to hold the stock through the ride but will be very painful for the investor who would have bought it at \u003cFIVE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e loss and very joyous for the investor who would have sold it at \u003cFIVE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e gain it said","timestamp":"2024-10-03T17:54:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}