{"url":"https://www.livemint.com/market/stock-market-news/zomato-share-price-extends-decline-for-the-fifth-straight-session-opportunity-to-buy-11727677404073.html","title":"Zomato share price extends decline for the fifth straight session. Opportunity to buy?","description":"Zomato shares have gained over 9% in one month and more than 37% in three months. The stock price has given multibagger returns of over 122% year-to-date (YTD) and over 170% in one year.","content":"Zomato share price declined over 2% on Monday, extending losses for the fifth straight session. Zomato shares fell as much as 2.19% to a low of  ₹272.15 apiece on the BSE. In the past five sessions, Zomato shares have plunged more than 8%.Zomato shares hit a 52-week high of  ₹298.20 apiece on September 24, and has been on a slide since then.Online food delivery giant Zomato had announced that its co-founder and chief people officer (CPO) Akriti Chopra resigned to pursue other interests.“We would like to inform that Ms. Akriti Chopra, CoFounder \u0026 Chief People Officer designated as Senior Management Personnel (“SMP”), has tendered her resignation w.e.f. September 27, 2024,” said Zomato in a stock exchange filing on September 27.Chopra has been with the company for 13 years and has played a major role in setting up and scaling the food delivery giant's legal and finance teams with her previous role as the Chief Financial Officer (CFO) for the company.Zomato stock price has been on a steady uptrend and analysts believe this uptrend to continue. Zomato shares have gained over 9% in one month and more than 37% in three months. The stock price has given multibagger returns of over 122% year-to-date (YTD) and over 170% in one year.“Zomato shares remain in overall uptrend and this upward momentum has not been distracted. As long as Zomato stock remains above the  ₹255 - 258 levels, the uptrend would remain intact,” said Milan Vaishnav, founder of ChartWizard FZE and Gemstone Equity Research.According to Vaishnav, the immediate upside target for Zomato shares is  ₹290 - 295 levels, which may act as a resistance.“We do not recommend entering fresh positions in Zomato shares until this high is broken. Existing investors should raise their stop loss to  ₹255 level,” Vaishnav said.At 12:05 PM, Zomato shares were trading 1.60% lower at  ₹273.80 apiece on the BSE with a market capitalisation of over  ₹2.41 lakh crore.","cleaned_content":"zomato share price declined over \u003cTWO_PERCENT\u003e on monday extending losses for the fifth straight session zomato shares fell as much as \u003cTWO_PERCENT\u003e to a low of \u003cTWO_HUNDRED\u003e apiece on the bse in the past five sessions zomato shares have plunged more than \u003cEIGHT_PERCENT\u003e zomato shares hit a \u003cFIVE_TEN\u003e week high of \u003cTWO_HUNDRED\u003e apiece on september \u003cTWO_TEN\u003e and has been on a slide since then online food delivery giant zomato had announced that its co founder and chief people officer cpo akriti chopra resigned to pursue other interests we would like to inform that ms akriti chopra cofounder chief people officer designated as senior management personnel smp has tendered her resignation w e f september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e said zomato in a stock exchange filing on september \u003cTWO_TEN\u003e chopra has been with the company for \u003cONE_TEN\u003e years and has played a major role in setting up and scaling the food delivery giants legal and finance teams with her previous role as the chief financial officer cfo for the company zomato stock price has been on a steady uptrend and analysts believe this uptrend to continue zomato shares have gained over \u003cNINE_PERCENT\u003e in one month and more than \u003cTHREE_TEN_PERCENT\u003e in three months the stock price has given multibagger returns of over \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and over \u003cONE_HUNDRED_PERCENT\u003e in one year zomato shares remain in overall uptrend and this upward momentum has not been distracted as long as zomato stock remains above the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels the uptrend would remain intact said milan vaishnav founder of chartwizard fze and gemstone equity research according to vaishnav the immediate upside target for zomato shares is \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels which may act as a resistance we do not recommend entering fresh positions in zomato shares until this high is broken existing investors should raise their stop loss to \u003cTWO_HUNDRED\u003e level vaishnav said at \u003cONE_TEN\u003e \u003cFIVE_\u003e pm zomato shares were trading \u003cONE_PERCENT\u003e lower at \u003cTWO_HUNDRED\u003e apiece on the bse with a market capitalisation of over \u003cTWO_\u003e lakh crore","timestamp":"2024-09-30T12:09:00+05:30","market_timestamp":"2024-09-30T12:09:00+05:30","off_market_hours":false}