{"url":"https://www.livemint.com/market/stock-market-news/bpcl-shares-rise-7-to-hit-52-week-high-amid-surge-in-volumes-should-you-buy-11727431878478.html","title":"BPCL shares rise 7% to hit 52-week high amid surge in volumes; Should you buy?","description":"BPCL stock finally closed 6.23 per cent higher at  ₹366.60 per share on Friday. The stock has risen 62 percent this year, outperforming the benchmark Nifty, which has increased by 18 percent.","content":"Shares of Bharat Petroleum Corporation (BPCL) jumped approximately 7 percent, reaching a new all-time high of  ₹370.50 on the NSE, fueled by strong trading activity.By midday, a total of three crore shares had been traded on both the BSE and NSE combined, significantly surpassing the one-month average trading volume of one crore shares.During the day, about 3 crore shares were traded across both exchanges, with the company's total market capitalization reaching  ₹1.6 lakh crore.BPCL stock finally closed 6.23 per cent higher at  ₹366.60 per share on Friday. The stock has risen 62 percent this year, outperforming the benchmark Nifty, which has increased by 18 percent.Over the past year, BPCL stock has surged by 110 per cent, more than doubling investors' capital. In contrast, the Nifty index has risen by 30 per cent during the same period.Earlier this month, BPCL announced that its subsidiary, in partnership with Indian Oil Corporation (IOC), has received a production concession from The Supreme Council for Financial and Economic Affairs (SCFEA) in Abu Dhabi.The company announced that the production concession agreement comes after Urja Bharat Pte Limited (UBPL) was awarded the exploration and production concession in March 2019 and successfully completed the exploration phase. UBPL is a 50:50 Special Purpose Vehicle (SPV) formed by BPCL and IOC.For the quarter ending June 2024, BPCL reported a 73 percent decrease in net profit, totaling  ₹2,841.55 crore. This significant drop was attributed to lower refinery margins and a reduction in fuel prices, which affected marketing margins. Revenue from operations for the company in Q1FY25 experienced a slight year-on-year decline of 0.1 percent, reaching  ₹1.28 lakh crore.In the current calendar year alone, the stock has risen by 62.7 per cent. BSE analytics reveal that the stock has gained 23.5 per cent over the last 6 months and 20.7 per cent over the past 3 months.","cleaned_content":"shares of bharat petroleum corporation bpcl jumped approximately \u003cSEVEN_PERCENT\u003e reaching a new all time high of \u003cTHREE_HUNDRED\u003e on the nse fueled by strong trading activity by midday a total of three crore shares had been traded on both the bse and nse combined significantly surpassing the one month average trading volume of one crore shares during the day about \u003cTHREE_\u003e crore shares were traded across both exchanges with the companys total market capitalization reaching \u003cONE_\u003e lakh crore bpcl stock finally closed \u003cSIX_PERCENT\u003e higher at \u003cTHREE_HUNDRED\u003e per share on friday the stock has risen \u003cSIX_TEN_PERCENT\u003e this year outperforming the benchmark nifty which has increased by \u003cONE_TEN_PERCENT\u003e over the past year bpcl stock has surged by \u003cONE_HUNDRED_PERCENT\u003e more than doubling investors capital in contrast the nifty index has risen by \u003cTHREE_TEN_PERCENT\u003e during the same period earlier this month bpcl announced that its subsidiary in partnership with indian oil corporation ioc has received a production concession from the supreme council for financial and economic affairs scfea in abu dhabi the company announced that the production concession agreement comes after urja bharat pte limited ubpl was awarded the exploration and production concession in march \u003cTWO_THOUSAND\u003e and successfully completed the exploration phase ubpl is a \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e special purpose vehicle spv formed by bpcl and ioc for the quarter ending june \u003cTWO_THOUSAND\u003e bpcl reported a \u003cSEVEN_TEN_PERCENT\u003e decrease in net profit totaling \u003cTWO_THOUSAND\u003e crore this significant drop was attributed to lower refinery margins and a reduction in fuel prices which affected marketing margins revenue from operations for the company in q1fy25 experienced a slight year on year decline of \u003cZERO_PERCENT\u003e reaching \u003cONE_\u003e lakh crore in the current calendar year alone the stock has risen by \u003cSIX_TEN_PERCENT\u003e bse analytics reveal that the stock has gained \u003cTWO_TEN_PERCENT\u003e over the last \u003cSIX_\u003e months and \u003cTWO_TEN_PERCENT\u003e over the past \u003cTHREE_\u003e months","timestamp":"2024-09-27T16:04:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}