{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-idfc-first-bank-pnb-dr-reddys-rec-ril-welspun-enterprises-biocon-and-more-11727634146463.html","title":"Stocks to Watch: IDFC First Bank, PNB, Dr Reddy’s, REC, RIL, Welspun Enterprises, Biocon, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"IDFC First Bank: The board approved the amalgamation of IDFC Financial Holding Company with IDFC, effective September 30. Additionally, IDFC will merge with IDFC First Bank on October 1. V Vaidyanathan has been appointed as MD \u0026 CEO of the bank for a three-year term, effective December 19, 2024.Punjab National Bank: The state-run bank raised  ₹5,000 crore via Qualified Institutions Placement (QIP). It allotted 48.19 crore shares to institutional buyers at  ₹103.75 per share, with key investors including Citigroup Global Markets, BOFA Securities, and Goldman Sachs.Dr Reddy's Laboratories: Dr Reddy's invested $620 million in its Swiss subsidiary, Dr Reddy’s Laboratories SA, through preference shares. The subsidiary issued 6.2 million non-convertible preference shares with a face value of $100 each.Welspun Enterprises: The company secured a  ₹1,989.9 crore project from Brihanmumbai Municipal Corporation (BMC) for the design and construction of an 8.48 km treated water conveyance tunnel. The project is scheduled to be completed within 93 months.Apollo Hospitals Enterprise: Apollo Healthco approved the allotment of  ₹2,475 crore worth of preference shares to Rasmeli, an Advent affiliate, for a 16.9% stake. Post-allotment, Apollo Hospitals' stake in Apollo Healthco will reduce from 94.91% to 78.879%.Asian Energy Services: The company secured an  ₹82 crore contract from Oil India for 2D seismic data acquisition in the Rajasthan Basin. The project will be completed in 18 months, and Asian Energy's total order book now stands at  ₹1,000 crore.Piramal Pharma: The US FDA issued an Establishment Inspection Report for Piramal’s Ahmedabad manufacturing facility. The FDA found no issues, with a \"No Action Indicated\" designation.Jubilant Pharmova: The US FDA classified the inspection of Jubilant HollisterStier General Partnership's Canadian facility as \"Official Action Indicated\" (OAI). This audit relates to a subsidiary of Jubilant Pharma.Tata Motors: Tata Motors Group held a groundbreaking ceremony for a new manufacturing plant in Tamil Nadu, with plans to invest  ₹9,000 crore. The facility aims for an annual production capacity of 2.5 lakh vehicles, with operations ramping up over 5-7 years.Reliance Industries (RIL) \u0026 Network18 Media: RIL received government approval to transfer non-news TV channel licenses to Star India as part of its merger with Disney’s Indian media assets. The  ₹70,350 crore merger is expected to close by late 2024 or early 2025.Biocon: The US FDA issued four observations following an inspection of Biocon’s Bengaluru API facility. The company is addressing the findings and does not foresee a business impact.REC: The company raised $500 million through green dollar bonds to fund renewable energy projects. The bonds mature on September 27, 2029.Sterling and Wilson Renewable Energy: Shapoorji Pallonji and Khurshed Yazdi Daruvala sold a 7.14% stake in Sterling and Wilson Renewable Energy for  ₹1,040 crore.Zydus Lifesciences: Zydus Lifesciences received US FDA approval to manufacture generic Enzalutamide capsules for prostate cancer treatment. The US market for the drug is worth approximately $869.4 million.","cleaned_content":"idfc first bank the board approved the amalgamation of idfc financial holding company with idfc effective september \u003cTHREE_TEN\u003e additionally idfc will merge with idfc first bank on october \u003cONE_\u003e v vaidyanathan has been appointed as md ceo of the bank for a three year term effective december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e punjab national bank the state run bank raised \u003cFIVE_THOUSAND\u003e crore via qualified institutions placement qip it allotted \u003cFOUR_TEN\u003e crore shares to institutional buyers at \u003cONE_HUNDRED\u003e per share with key investors including citigroup global markets bofa securities and goldman sachs dr reddys laboratories dr reddys invested \u003cSIX_HUNDRED\u003e million in its swiss subsidiary dr reddy s laboratories sa through preference shares the subsidiary issued \u003cSIX_\u003e million non convertible preference shares with a face value of \u003cONE_HUNDRED\u003e each welspun enterprises the company secured a \u003cONE_THOUSAND\u003e crore project from brihanmumbai municipal corporation bmc for the design and construction of an \u003cEIGHT_\u003e km treated water conveyance tunnel the project is scheduled to be completed within \u003cNINE_TEN\u003e months apollo hospitals enterprise apollo healthco approved the allotment of \u003cTWO_THOUSAND\u003e crore worth of preference shares to rasmeli an advent affiliate for a \u003cONE_TEN_PERCENT\u003e stake post allotment apollo hospitals stake in apollo healthco will reduce from \u003cNINE_TEN_PERCENT\u003e to \u003cSEVEN_TEN_PERCENT\u003e asian energy services the company secured an \u003cEIGHT_TEN\u003e crore contract from oil india for \u003cTWO_\u003e d seismic data acquisition in the rajasthan basin the project will be completed in \u003cONE_TEN\u003e months and asian energys total order book now stands at \u003cONE_THOUSAND\u003e crore piramal pharma the us fda issued an establishment inspection report for piramal s ahmedabad manufacturing facility the fda found no issues with a no action indicated designation jubilant pharmova the us fda classified the inspection of jubilant hollisterstier general partnerships canadian facility as official action indicated oai this audit relates to a subsidiary of jubilant pharma tata motors tata motors group held a groundbreaking ceremony for a new manufacturing plant in tamil nadu with plans to invest \u003cNINE_THOUSAND\u003e crore the facility aims for an annual production capacity of \u003cTWO_\u003e lakh vehicles with operations ramping up over \u003cFIVE_\u003e \u003cSEVEN_\u003e years reliance industries ril network18 media ril received government approval to transfer non news tv channel licenses to star india as part of its merger with disney s indian media assets the \u003cSEVEN_TEN_THOUSAND\u003e crore merger is expected to close by late \u003cTWO_THOUSAND\u003e or early \u003cTWO_THOUSAND\u003e biocon the us fda issued four observations following an inspection of biocon s bengaluru api facility the company is addressing the findings and does not foresee a business impact rec the company raised \u003cFIVE_HUNDRED\u003e million through green dollar bonds to fund renewable energy projects the bonds mature on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e sterling and wilson renewable energy shapoorji pallonji and khurshed yazdi daruvala sold a \u003cSEVEN_PERCENT\u003e stake in sterling and wilson renewable energy for \u003cONE_THOUSAND\u003e crore zydus lifesciences zydus lifesciences received us fda approval to manufacture generic enzalutamide capsules for prostate cancer treatment the us market for the drug is worth approximately \u003cEIGHT_HUNDRED\u003e million","timestamp":"2024-09-30T08:30:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}