{"url":"https://www.livemint.com/market/stock-market-news/northern-arc-capital-ipo-rising-gmp-signals-stellar-debut-expectations-ahead-of-listing-date-11727060895055.html","title":"Northern Arc Capital IPO: Rising GMP signals stellar debut expectations ahead of listing date.","description":"Northern Arc Capital IPO: The public offer that was open for subscription between  16-20 September 2024, will list on 24 September. The Grey Market premium for Northern ARC IPO have been rising indicating rising investor expectations towards listing gains. check details","content":"Northern Arc Capital IPO: The Northern Arc Capital initial public offering (IPO) subscription was open from September 16, 2024, to September 19, 2024. On Friday, September 20, 2024, the allotment for the Northern Arc Capital IPO was finalized. Tuesday, September 24, 2024 is the tentative listing date for the Northern Arc Capital IPO on the BSE and NSE. The investors have strong expectations , specially after the blockbuster opening seen for Bajaj Housing Finance shares after the strong subscription receive. The grey market premium or the GMP for Northern Arc Capital is also rising indicating that expectations are building for a stronger listing of Northern Arc Capital Share priceThe Northern Arc Capital IPO GMP on 23 September stood at +144 as per investorgain.com. This indicates Northern Arc Capital share price were trading at a premium of  ₹144 in the grey market. Notably the Grey Market premium for Northern Arc Capital IPO is rising . The Grey Market premium for the Northern Arc Capital IPO on 21 September 2024 stood at +128.Taking into account the upper limit of the IPO, the price range and the existing premium in the secondary market, the Northern Arc Capital shares are being anticipated to be listed at  ₹407, which represents a 54.75% increase over the  ₹263 IPO price.Grey market activity over the last many sessions suggests that a strong listing is expected and that the IPO GMP is rising. Experts at investorgain.com claim that there are two possible GMPs:  ₹0 for the lowest and  ₹202 for the most.A \"grey market premium\" denotes the willingness of investors to part with more money than the issue price.Established in 2009, Northern Arc Capital Limited provides retail loans to underprivileged Indian households and enterprises.The business strategy of Northern Arc Capital is diverse, encompassing a range of services, industries, goods, regions, and borrower types.","cleaned_content":"northern arc capital ipo the northern arc capital initial public offering ipo subscription was open from september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the allotment for the northern arc capital ipo was finalized tuesday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e is the tentative listing date for the northern arc capital ipo on the bse and nse the investors have strong expectations specially after the blockbuster opening seen for bajaj housing finance shares after the strong subscription receive the grey market premium or the gmp for northern arc capital is also rising indicating that expectations are building for a stronger listing of northern arc capital share pricethe northern arc capital ipo gmp on \u003cTWO_TEN\u003e september stood at \u003cONE_HUNDRED\u003e as per investorgain com this indicates northern arc capital share price were trading at a premium of \u003cONE_HUNDRED\u003e in the grey market notably the grey market premium for northern arc capital ipo is rising the grey market premium for the northern arc capital ipo on \u003cTWO_TEN\u003e september \u003cTWO_THOUSAND\u003e stood at \u003cONE_HUNDRED\u003e taking into account the upper limit of the ipo the price range and the existing premium in the secondary market the northern arc capital shares are being anticipated to be listed at \u003cFOUR_HUNDRED\u003e which represents a \u003cFIVE_TEN_PERCENT\u003e increase over the \u003cTWO_HUNDRED\u003e ipo price grey market activity over the last many sessions suggests that a strong listing is expected and that the ipo gmp is rising experts at investorgain com claim that there are two possible gmps \u003cZERO_\u003e for the lowest and \u003cTWO_HUNDRED\u003e for the most a grey market premium denotes the willingness of investors to part with more money than the issue price established in \u003cTWO_THOUSAND\u003e northern arc capital limited provides retail loans to underprivileged indian households and enterprises the business strategy of northern arc capital is diverse encompassing a range of services industries goods regions and borrower types","timestamp":"2024-09-23T13:23:00+05:30","market_timestamp":"2024-09-23T13:23:00+05:30","off_market_hours":false}