{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-reliance-power-spicejet-vodafone-idea-nhpc-pnb-and-more-11727110315405.html","title":"Stocks to Watch: Reliance Power, SpiceJet, Vodafone Idea, NHPC, PNB, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Reliance Power: The company is set to raise  ₹1,525 crore through a preferential equity issue to strengthen its renewable energy portfolio and improve its balance sheet. Its parent company, Reliance Infrastructure, is also expected to significantly increase its stake through this move.Vodafone Idea: The telecom operator is in discussions with the government regarding its Adjusted Gross Revenue (AGR) dues, which the Department of Telecommunications has estimated much higher than Vodafone Idea's own calculations. During an analysts' call, the company's CEO reassured that their long-term revival plan remains intact, despite challenges related to the AGR liabilities. Vodafone Idea’s debt burden remains considerable, though the company is hopeful of completing its ongoing debt funding process within the next two months.SpiceJet: The National Company Law Tribunal (NCLT) has issued a notice to SpiceJet over an operational debt claim of  ₹1.18 crore, with the airline required to respond by November 14. Additionally, SpiceJet has raised  ₹3,000 crore via a Qualified Institutional Placement (QIP) from global investors and mutual funds. The airline is also expected to receive an additional  ₹736 crore from an earlier funding round.NHPC: The state-owned hydro power company declared a total dividend of  ₹1,286.33 crore for FY 2023-24. This includes a final dividend of  ₹338.51 crore, recently paid to the central government, and an interim dividend of  ₹947.82 crore distributed earlier in the fiscal year.Punjab National Bank (PNB): PNB has launched a Qualified Institutional Placement (QIP) to raise up to  ₹7,500 crore. The bank's capital raising committee set the floor price at  ₹109.16 per share. The QIP will offer 24.09 crore equity shares, with the option to increase the offer size to 48.19 crore shares, potentially bringing the total amount raised to  ₹5,000 crore.Linde India: The Supreme Court rejected Linde India's appeal against a Securities and Exchange Board of India (SEBI) valuation related to its transactions with related parties. Linde India had expressed concerns regarding the public disclosure of sensitive price-related information.Samvardhana Motherson International: The auto components manufacturer successfully raised  ₹6,438 crore through a securities issue, attracting significant interest from institutional investors. The funds will be primarily allocated for debt repayment and general corporate purposes.AstraZeneca Pharma: AstraZeneca has received regulatory approval from the Central Drugs Standard Control Organisation to import and distribute Durvalumab (Imfinzi), a prescription drug used for treating certain cancers in adults. This marks an important step in expanding the availability of cancer treatment options in India.Power Grid Corporation of India: Power Grid has been declared the successful bidder for a new transmission project under the tariff-based competitive bidding process. The company announced this in an exchange filing, further solidifying its leadership in the power transmission sector.","cleaned_content":"reliance power the company is set to raise \u003cONE_THOUSAND\u003e crore through a preferential equity issue to strengthen its renewable energy portfolio and improve its balance sheet its parent company reliance infrastructure is also expected to significantly increase its stake through this move vodafone idea the telecom operator is in discussions with the government regarding its adjusted gross revenue agr dues which the department of telecommunications has estimated much higher than vodafone ideas own calculations during an analysts call the companys ceo reassured that their long term revival plan remains intact despite challenges related to the agr liabilities vodafone idea s debt burden remains considerable though the company is hopeful of completing its ongoing debt funding process within the next two months spicejet the national company law tribunal nclt has issued a notice to spicejet over an operational debt claim of \u003cONE_\u003e crore with the airline required to respond by november \u003cONE_TEN\u003e additionally spicejet has raised \u003cTHREE_THOUSAND\u003e crore via a qualified institutional placement qip from global investors and mutual funds the airline is also expected to receive an additional \u003cSEVEN_HUNDRED\u003e crore from an earlier funding round nhpc the state owned hydro power company declared a total dividend of \u003cONE_THOUSAND\u003e crore for fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e this includes a final dividend of \u003cTHREE_HUNDRED\u003e crore recently paid to the central government and an interim dividend of \u003cNINE_HUNDRED\u003e crore distributed earlier in the fiscal year punjab national bank pnb pnb has launched a qualified institutional placement qip to raise up to \u003cSEVEN_THOUSAND\u003e crore the banks capital raising committee set the floor price at \u003cONE_HUNDRED\u003e per share the qip will offer \u003cTWO_TEN\u003e crore equity shares with the option to increase the offer size to \u003cFOUR_TEN\u003e crore shares potentially bringing the total amount raised to \u003cFIVE_THOUSAND\u003e crore linde india the supreme court rejected linde indias appeal against a securities and exchange board of india sebi valuation related to its transactions with related parties linde india had expressed concerns regarding the public disclosure of sensitive price related information samvardhana motherson international the auto components manufacturer successfully raised \u003cSIX_THOUSAND\u003e crore through a securities issue attracting significant interest from institutional investors the funds will be primarily allocated for debt repayment and general corporate purposes astrazeneca pharma astrazeneca has received regulatory approval from the central drugs standard control organisation to import and distribute durvalumab imfinzi a prescription drug used for treating certain cancers in adults this marks an important step in expanding the availability of cancer treatment options in india power grid corporation of india power grid has been declared the successful bidder for a new transmission project under the tariff based competitive bidding process the company announced this in an exchange filing further solidifying its leadership in the power transmission sector","timestamp":"2024-09-24T08:27:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}