{"url":"https://www.livemint.com/market/stock-market-news/reliance-industries-owned-small-cap-stock-jumps-19-despite-receiving-tax-notice-hits-11-week-high-11727080630246.html","title":"Reliance Industries-owned small-cap stock jumps 19% despite receiving tax notice, hits 11-week high","description":"Despite a recent 19 per cent surge, Reliance Industrial Infrastructure's shares are still 57 per cent off their peak. After experiencing a steady uptrend between 2020 and 2023, the stock has seen a noticeable pause in its bull run this year, gaining just 2 per cent so far.","content":"Shares of Reliance Industrial Infrastructure climbed up 19 per cent in today's trade to hit an 11-week high of  ₹1,387 apiece. This jump in shares came even after the company received a tax notice. In an exchange filing on Friday, the company said that it had received an order dated September 19, 2024, from the office of the state tax officer in Jamnagar, Gujarat, imposing a penalty of  ₹1,59,810 under Section 74 of the Central Goods and Services Tax Act, 2017, and the Gujarat Goods and Services Tax Act, 2017.\"The order has been passed alleging incorrect availment of input tax credit by the company. The company intends to file an appeal against the order. The financial impact of the order is to the extent of the penalty levied. There is no impact on operations or other activities of the company due to the order,\" the company said in its regulatory filing.Meanwhile, today's rally was the biggest intraday jump for the stock in 2024. The Reliance group company is mainly engaged in the business of setting up and operating industrial infrastructure.Its main activities are providing services of transportation of petroleum products and raw water through its pipelines, construction machinery on hire, and other infrastructure support services.The company has its operations mainly in the Mumbai and the Rasayani regions of Maharashtra, Surat, and the Jamnagar belts of Gujarat.After experiencing a steady uptrend between 2020 and 2023, the stock has seen a noticeable pause in its bull run this year, gaining just 2 per cent so far. Despite this slowdown, it reached a high of  ₹1,604, marking its highest level since 2008.Between 2009 and 2023, the stock delivered multibagger returns only once, in CY21, with a 112 per cent gain. Although the stock has maintained an upward trajectory over the past few years, it remains significantly below its all-time high of  ₹3,202, achieved in 2007.Currently, the stock trades 57 per cent below that peak, reflecting both the recovery and the distance still to cover from its historic highs.","cleaned_content":"shares of reliance industrial infrastructure climbed up \u003cONE_TEN_PERCENT\u003e in todays trade to hit an \u003cONE_TEN\u003e week high of \u003cONE_THOUSAND\u003e apiece this jump in shares came even after the company received a tax notice in an exchange filing on friday the company said that it had received an order dated september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e from the office of the state tax officer in jamnagar gujarat imposing a penalty of \u003cONE_HUNDRED_THOUSAND\u003e under section \u003cSEVEN_TEN\u003e of the central goods and services tax act \u003cTWO_THOUSAND\u003e and the gujarat goods and services tax act \u003cTWO_THOUSAND\u003e the order has been passed alleging incorrect availment of input tax credit by the company the company intends to file an appeal against the order the financial impact of the order is to the extent of the penalty levied there is no impact on operations or other activities of the company due to the order the company said in its regulatory filing meanwhile todays rally was the biggest intraday jump for the stock in \u003cTWO_THOUSAND\u003e the reliance group company is mainly engaged in the business of setting up and operating industrial infrastructure its main activities are providing services of transportation of petroleum products and raw water through its pipelines construction machinery on hire and other infrastructure support services the company has its operations mainly in the mumbai and the rasayani regions of maharashtra surat and the jamnagar belts of gujarat after experiencing a steady uptrend between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the stock has seen a noticeable pause in its bull run this year gaining just \u003cTWO_PERCENT\u003e so far despite this slowdown it reached a high of \u003cONE_THOUSAND\u003e marking its highest level since \u003cTWO_THOUSAND\u003e between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the stock delivered multibagger returns only once in cy21 with a \u003cONE_HUNDRED_PERCENT\u003e gain although the stock has maintained an upward trajectory over the past few years it remains significantly below its all time high of \u003cTHREE_THOUSAND\u003e achieved in \u003cTWO_THOUSAND\u003e currently the stock trades \u003cFIVE_TEN_PERCENT\u003e below that peak reflecting both the recovery and the distance still to cover from its historic highs","timestamp":"2024-09-23T14:27:00+05:30","market_timestamp":"2024-09-23T14:27:00+05:30","off_market_hours":false}