{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11727401333526.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today, September 27. According to him, these stocks are technically well placed to see a decent upmove. Check out the list.","content":"Indian stock market indices, Sensex and Nifty 50, have been hitting record highs led by positive momentum in the global equities that gathered pace after the US Federal Reserve’s outsized interest rate cut last week.On Thursday, the Sensex hit a fresh record high of 85,930.43 before closing 666.25 points, or 0.78%, higher at 85,836.12. The Nifty 50 touched a fresh peak of 26,250.90 but closed at 26,216.05, up 211.90 points, or 0.81%.“Nifty 50 index formed a bullish candle on the daily frame after a range breakout of the last three sessions with higher highs formation of the last six sessions. Now Nifty 50 has to hold above 26,150 zones for an up move towards 26,350 then 26,500 zones, whereas supports are placed at 26,100 then 26,000 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Taparia noted that maximum Call open interest (OI) is at 27,500 then 27,000 strike while Maximum Put OI is at 26,000 then 25,000 strike. Call writing is seen at 27,000 then 26,200 strike while Put writing is seen at 26,000 then 25,000 strike.“Option data suggests a broader trading range in between 25,800 to 26,600 zones while an immediate range between 26,000 to 26,400 levels,” said Taparia.Bank Nifty index also hit a new lifetime high of 54,467 mark on Thursday. It formed a Bullish candle on the daily scale and ended with gains of around 270 points near 54,400 zones.“Bank Nifty gave a fresh range breakout on daily scale after consolidation of the last three sessions and the base of the Index is shifting higher. Now, it has to hold above 54,000 zones for an up move towards 54,750 then 55,000 zones while on the downside support shifts higher to 54,000 then 53,750 levels,” Taparia said.Based on his technical analysis, Chandan Taparia has recommended three stocks to buy today, September 27. According to him, these stocks are technically well placed to see a decent upmove. The three stocks to buy are Persistent Systems, ITC and UltraTech Cement.Here are top three stock recommendations for today by Chandan Taparia:Persistent Systems share price is trading near its all-time high price and is in a strong uptrend making higher highs-higher lows on the daily chart. The ROC indicator has turned up which confirms the bullish momentum, Taparia said.A range breakout is visible on the daily chart of ITC stock with the recent candle being a large bodied bullish candle. The MACD Indicator is on the verge of giving a bullish crossover which could support the upward momentum.UltraTech Cement share price has broken out of a consolidation zone on the daily scale with higher-than-average buying volumes which could support the up move. The ADX line is rising and the positive DI is well above the negative DI which suggests the bullish trend has strength, Taparia said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e have been hitting record highs led by positive momentum in the global equities that gathered pace after the us federal reserve s outsized interest rate cut last week on thursday the sensex hit a fresh record high of \u003cEIGHT_TEN_THOUSAND\u003e before closing \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e touched a fresh peak of \u003cTWO_TEN_THOUSAND\u003e but closed at \u003cTWO_TEN_THOUSAND\u003e up \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e nifty \u003cFIVE_TEN\u003e index formed a bullish candle on the daily frame after a range breakout of the last three sessions with higher highs formation of the last six sessions now nifty \u003cFIVE_TEN\u003e has to hold above \u003cTWO_TEN_THOUSAND\u003e zones for an up move towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas supports are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front taparia noted that maximum call open interest oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels said taparia bank nifty index also hit a new lifetime high of \u003cFIVE_TEN_THOUSAND\u003e mark on thursday it formed a bullish candle on the daily scale and ended with gains of around \u003cTWO_HUNDRED\u003e points near \u003cFIVE_TEN_THOUSAND\u003e zones bank nifty gave a fresh range breakout on daily scale after consolidation of the last three sessions and the base of the index is shifting higher now it has to hold above \u003cFIVE_TEN_THOUSAND\u003e zones for an up move towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones while on the downside support shifts higher to \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels taparia said based on his technical analysis chandan taparia has recommended three stocks to buy today september \u003cTWO_TEN\u003e according to him these stocks are technically well placed to see a decent upmove the three stocks to buy are persistent systems itc and ultratech cement here are top three stock recommendations for today by chandan taparia persistent systems share price is trading near its all time high price and is in a strong uptrend making higher highs higher lows on the daily chart the roc indicator has turned up which confirms the bullish momentum taparia said a range breakout is visible on the daily chart of itc stock with the recent candle being a large bodied bullish candle the macd indicator is on the verge of giving a bullish crossover which could support the upward momentum ultratech cement share price has broken out of a consolidation zone on the daily scale with higher than average buying volumes which could support the up move the adx line is rising and the positive di is well above the negative di which suggests the bullish trend has strength taparia said","timestamp":"2024-09-27T07:49:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}