{"url":"https://www.livemint.com/companies/stocks-in-focus-lic-trims-stake-in-mahanagar-gas-limited-details-here-11727666175080.html","title":"Stocks in focus: LIC trims stake in Mahanagar Gas Limited by over 2%. Details here","description":"India's largest insurer, LIC, has reduced its stake in Mahanagar Gas Ltd. The company sold over 2 million shares, decreasing its ownership from 9.03% to 6.939%.","content":"India's largest insurer, Life Insurance Corporation of India (LIC), announced a reduction in its shareholding in Mahanagar Gas Ltd. This information was disclosed in a formal communication to the stock exchanges on Friday, September 27.According to the disclosure, LIC decreased its equity stake in Mahanagar Gas from 89,19,236 shares to 68,54,264 shares. This reduction translates to a decrease from 9.030 per cent to 6.939 per cent of the paid-up capital of Mahanagar Gas Ltd.The disclosure was made in compliance with Regulation 30 of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015.Anshul Kumar Singh, Company Secretary \u0026 Compliance Officer for LIC, stated, “Pursuant to Regulation 30 of the Listing Regulations, this is to inform that the Life Insurance Corporation of India ('the Corporation') has decreased its shareholding in equity shares of Mahanagar Gas Ltd. ('Company') from 89,19,236 to 68,54,264 i.e., 9.030 per cent to 6.939 per cent of the paid-up capital of the said Company.”This move by LIC, one of India's largest institutional investors, could potentially impact the market dynamics of Mahanagar Gas Ltd.Mahanagar Gas share price has climbed over 85 per cent on a year-to-date (YTD) basis. In a month, Mahanagar Gas stock price has risen over 7 per cent.Mahanagar Gas share price was trading in the red on Monday, September 30, down 1.42 per cent at  ₹1919.75 apiece as per BSE.","cleaned_content":"indias largest insurer life insurance corporation of india lic announced a reduction in its shareholding in mahanagar gas ltd this information was disclosed in a formal communication to the stock exchanges on friday september \u003cTWO_TEN\u003e according to the disclosure lic decreased its equity stake in mahanagar gas from \u003cEIGHT_MILLION\u003e shares to \u003cSIX_MILLION\u003e shares this reduction translates to a decrease from \u003cNINE_PERCENT\u003e to \u003cSIX_PERCENT\u003e of the paid up capital of mahanagar gas ltd the disclosure was made in compliance with regulation \u003cTHREE_TEN\u003e of the securities and exchange board of india listing obligations and disclosure requirements regulations \u003cTWO_THOUSAND\u003e anshul kumar singh company secretary compliance officer for lic stated pursuant to regulation \u003cTHREE_TEN\u003e of the listing regulations this is to inform that the life insurance corporation of india the corporation has decreased its shareholding in equity shares of mahanagar gas ltd company from \u003cEIGHT_MILLION\u003e to \u003cSIX_MILLION\u003e i e \u003cNINE_PERCENT\u003e to \u003cSIX_PERCENT\u003e of the paid up capital of the said company this move by lic one of indias largest institutional investors could potentially impact the market dynamics of mahanagar gas ltd mahanagar gas share price has climbed over \u003cEIGHT_TEN_PERCENT\u003e on a year to date ytd basis in a month mahanagar gas stock price has risen over \u003cSEVEN_PERCENT\u003e mahanagar gas share price was trading in the red on monday september \u003cTHREE_TEN\u003e down \u003cONE_PERCENT\u003e at \u003cONE_THOUSAND\u003e apiece as per bse","timestamp":"2024-09-30T09:03:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}