{"url":"https://www.livemint.com/market/stock-market-news/h1fy25-review-mid-and-small-caps-underperform-nifty-in-sept-even-as-they-shine-in-h1fy25-where-are-they-headed-next-11727939794142.html","title":"H1FY25 Review: Mid and small-caps underperform Nifty in Sept even as they shine in H1FY25; where are they headed next?","description":"Although broader markets trailed benchmark indices in September, midcap and smallcap stocks excelled in H1FY25. Experts highlight the need for a selective investment approach amid high valuations, advising caution and profit booking while seeking strong businesses with growth prospects.","content":"Despite a strong performance, the broader markets failed to beat the benchmark indices in September. While the Nifty Midcap index and the Nifty Smallcap index rose 1.76 per cent and 1.32 per cent, respectively, their performance lagged behind the 2.28 per cent rise in the Nifty benchmark index.The underperformance in mid-caps and small-caps followed a correction caused by rising geopolitical tensions between Iran and Israel. Meanwhile, large-caps received a boost from the US Federal Reserve’s significant 50 basis points (bps) rate cut in September, resulting in their outperformance.However, in the first half of the financial year 2024-25 (H1 FY25), the broader markets showed strong overall performance compared to the Nifty benchmark. The Nifty Midcap index surged 25.6 per cent, while the Nifty Smallcap index jumped 28.5 per cent, far outpacing the Nifty's 15.6 per cent rise during the same period.Similarly, on a calendar year-to-date (YTD) basis, mid-caps and small-caps continued to outperform. The midcap index surged 31 per cent, and the smallcap index soared 32 per cent, while the Nifty advanced by 18.7 per cent.However, one must note that investing in mid-caps and small-caps comes with a higher risk compared to large-cap stocks. Although midcaps offer higher returns, only investors with a high-risk appetite should invest heavily in this category, while those with a conservative approach might prefer large-caps.Despite stretched valuations in the midcap and smallcap segments, experts see strong growth potential in specific companies within these sectors. With the broader market showing mixed signals, investors are urged to adopt a stock-specific approach while weighing the risks and rewards of these high-growth categories. Analysts highlight the need for caution as volatility may rise, but opportunities remain for those with a long-term outlook.Here's what they said:Commenting on the trend ahead, Atul Parakh, CEO of Bigul, noted that the mid and small-cap segments currently present a mixed picture. He highlighted that while valuations in these sectors are stretched compared to historical averages, many companies have strong businesses with tremendous growth potential, justifying their current valuations.He emphasised the importance of a stock-specific strategy, urging investors to approach selectively, focusing on individual companies rather than broad index valuations. A contrarian approach over a three-to-five-year timeframe could be wise, weighing the potential for further upside against the risks posed by high valuations.Aamar Deo Singh, Senior Vice President of Research at Angel One, advised caution, noting that liquidity flows into the markets are unlikely to abate soon. He suggested that any correction would likely be short-lived, but warned that a major sell-off in the US and global markets could trigger a correction in Indian markets. Singh recommended that investors should consider booking profits as many small-cap and mid-cap stocks are trading at lofty valuations. He noted that the current secular bull market is strong, but volatility may increase, making it prudent for investors to tighten their risk management strategies.Krishnan VR, Chief of the Quantitative Research team at Marcellus, pointed out that the Nifty 500 Index, which includes small and mid-caps, had a cross-cycle adjusted price-to-earnings (PE) ratio of 45.5x as of July end. This placed the index in the 99.5th percentile of its monthly values since 2007, indicating that valuations were at historic highs. Krishnan emphasised the importance of evaluating individual companies within the small and mid-cap space, as the sector has a wide dispersion in earnings growth and fundamentals. He added that if these companies can meet earnings growth expectations, there is no reason to expect significant valuation derating.While the broader markets underperformed the benchmark indices in September, midcap and smallcap stocks have delivered strong returns on a year-to-date basis, driven by positive sentiment and liquidity flows. However, with stretched valuations and rising geopolitical tensions, investors should approach this space selectively, focusing on strong businesses with growth potential. Experts suggest caution in the near term, encouraging profit booking and selective re-entry into these high-risk, high-reward segments.","cleaned_content":"despite a strong performance the broader markets failed to beat the benchmark indices in september while the nifty midcap index and the nifty smallcap index rose \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively their performance lagged behind the \u003cTWO_PERCENT\u003e rise in the nifty benchmark index the underperformance in mid caps and small caps followed a correction caused by rising geopolitical tensions between iran and israel meanwhile large caps received a boost from the us federal reserve s significant \u003cFIVE_TEN\u003e basis points bps rate cut in september resulting in their outperformance however in the first half of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e h1 fy25 the broader markets showed strong overall performance compared to the nifty benchmark the nifty midcap index surged \u003cTWO_TEN_PERCENT\u003e while the nifty smallcap index jumped \u003cTWO_TEN_PERCENT\u003e far outpacing the niftys \u003cONE_TEN_PERCENT\u003e rise during the same period similarly on a calendar year to date ytd basis mid caps and small caps continued to outperform the midcap index surged \u003cTHREE_TEN_PERCENT\u003e and the smallcap index soared \u003cTHREE_TEN_PERCENT\u003e while the nifty advanced by \u003cONE_TEN_PERCENT\u003e however one must note that investing in mid caps and small caps comes with a higher risk compared to large cap stocks although midcaps offer higher returns only investors with a high risk appetite should invest heavily in this category while those with a conservative approach might prefer large caps despite stretched valuations in the midcap and smallcap segments experts see strong growth potential in specific companies within these sectors with the broader market showing mixed signals investors are urged to adopt a stock specific approach while weighing the risks and rewards of these high growth categories analysts highlight the need for caution as volatility may rise but opportunities remain for those with a long term outlook heres what they said commenting on the trend ahead atul parakh ceo of bigul noted that the mid and small cap segments currently present a mixed picture he highlighted that while valuations in these sectors are stretched compared to historical averages many companies have strong businesses with tremendous growth potential justifying their current valuations he emphasised the importance of a stock specific strategy urging investors to approach selectively focusing on individual companies rather than broad index valuations a contrarian approach over a three to five year timeframe could be wise weighing the potential for further upside against the risks posed by high valuations aamar deo singh senior vice president of research at angel one advised caution noting that liquidity flows into the markets are unlikely to abate soon he suggested that any correction would likely be short lived but warned that a major sell off in the us and global markets could trigger a correction in indian markets singh recommended that investors should consider booking profits as many small cap and mid cap stocks are trading at lofty valuations he noted that the current secular bull market is strong but volatility may increase making it prudent for investors to tighten their risk management strategies krishnan vr chief of the quantitative research team at marcellus pointed out that the nifty \u003cFIVE_HUNDRED\u003e index which includes small and mid caps had a cross cycle adjusted price to earnings pe ratio of \u003cFOUR_TEN\u003e x as of july end this placed the index in the \u003cNINE_TEN\u003e th percentile of its monthly values since \u003cTWO_THOUSAND\u003e indicating that valuations were at historic highs krishnan emphasised the importance of evaluating individual companies within the small and mid cap space as the sector has a wide dispersion in earnings growth and fundamentals he added that if these companies can meet earnings growth expectations there is no reason to expect significant valuation derating while the broader markets underperformed the benchmark indices in september midcap and smallcap stocks have delivered strong returns on a year to date basis driven by positive sentiment and liquidity flows however with stretched valuations and rising geopolitical tensions investors should approach this space selectively focusing on strong businesses with growth potential experts suggest caution in the near term encouraging profit booking and selective re entry into these high risk high reward segments","timestamp":"2024-10-03T14:31:00+05:30","market_timestamp":"2024-10-03T14:31:00+05:30","off_market_hours":false}