{"url":"https://www.livemint.com/market/stock-market-news/flat-market-debut-phoenix-overseas-lists-at-rs-64-on-nse-sme-same-as-ipo-price-11727410291695.html","title":"Phoenix Overseas shares list at  ₹64 on NSE SME, same as IPO price","description":"Phoenix Overseas shares made a lacklustre debut on the bourses on Friday, September 27. The stock got listed at  ₹64 on NSE SME, the same as its IPO price.","content":"Phoenix Overseas IPO listing: Shares of Phoenix Overseas made a flat debut on the bourses on Friday, September 27 as they listed at  ₹64 on NSE SME, the same as its IPO price.The SME IPO, valued at  ₹36.03 crore, was open for subscription from September 20 to September 24. The IPO was priced in the range of  ₹61-64 per share.Following the three-day bidding process, the IPO closed with an overwhelming demand, with the issue subscribed 119.22 times. The IPO received bids for 64.78 crore shares against 54.34 lakh shares on offer. The retail investor segment saw a massive subscription of 148.43 times, while the Non Institutional Investors (NII) category was booked 109.71 times. Meanwhile, the Qualified Institutional Buyers (QIBs) quota was subscribed 65.74 times.The Phoenix Overseas IPO was a combination of fresh issue of 45.8 lakh shares aggregating to  ₹29.31 crore and offer for sale of 10.5 lakh shares aggregating to  ₹6.72 crore. The minimum application size for retail investors was set at 2000 shares, requiring an investment of  ₹1.28 lakh.The company intends to use the net proceeds from the offer for several key purposes, including funding its working capital requirements, pursuing inorganic growth initiatives to expand its business, and addressing general corporate purposes. These objectives aim to enhance operational efficiency, support strategic acquisitions, and ensure the company's overall financial stability and growth.Khandwala Securities Limited was the book-running lead manager of the Phoenix Overseas IPO, while Cameo Corporate Services Limited was the registrar for the issue. The market maker for Phoenix Overseas IPO was Nikunj Stock Brokers.Incorporated in December 2002, Phoenix Overseas Limited is a B2B trading company specialising in the trading and marketing of animal feeds, agricultural produce, and commodities such as corn, oil cakes, dry red chillies, coriander, cumin seeds, food grains, tea, pulses, soya bean meal, and rice bran de-oiled cake. Alongside its core trading operations, the company also manufactures a variety of bags and fashion accessories for men and women, made from jute, cotton, canvas, and leather. These products include purses, wallets, and shopping bags, catering primarily to clients in European markets like France, Italy, and Germany, as well as in the UAE and Australia. Phoenix Overseas Limited operates a manufacturing facility located in Sodhpur, Kolkata.Phoenix Overseas Limited reported a 22 per cent increase in revenue and a 46 per cent rise in profit after tax (PAT) between the financial year ending March 31, 2024, and March 31, 2023.","cleaned_content":"phoenix overseas ipo listing shares of phoenix overseas made a flat debut on the bourses on friday september \u003cTWO_TEN\u003e as they listed at \u003cSIX_TEN\u003e on nse sme the same as its ipo price the sme ipo valued at \u003cTHREE_TEN\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTWO_TEN\u003e the ipo was priced in the range of \u003cSIX_TEN\u003e \u003cSIX_TEN\u003e per share following the three day bidding process the ipo closed with an overwhelming demand with the issue subscribed \u003cONE_HUNDRED\u003e times the ipo received bids for \u003cSIX_TEN\u003e crore shares against \u003cFIVE_TEN\u003e lakh shares on offer the retail investor segment saw a massive subscription of \u003cONE_HUNDRED\u003e times while the non institutional investors nii category was booked \u003cONE_HUNDRED\u003e times meanwhile the qualified institutional buyers qibs quota was subscribed \u003cSIX_TEN\u003e times the phoenix overseas ipo was a combination of fresh issue of \u003cFOUR_TEN\u003e lakh shares aggregating to \u003cTWO_TEN\u003e crore and offer for sale of \u003cONE_TEN\u003e lakh shares aggregating to \u003cSIX_\u003e crore the minimum application size for retail investors was set at \u003cTWO_THOUSAND\u003e shares requiring an investment of \u003cONE_\u003e lakh the company intends to use the net proceeds from the offer for several key purposes including funding its working capital requirements pursuing inorganic growth initiatives to expand its business and addressing general corporate purposes these objectives aim to enhance operational efficiency support strategic acquisitions and ensure the companys overall financial stability and growth khandwala securities limited was the book running lead manager of the phoenix overseas ipo while cameo corporate services limited was the registrar for the issue the market maker for phoenix overseas ipo was nikunj stock brokers incorporated in december \u003cTWO_THOUSAND\u003e phoenix overseas limited is a b2b trading company specialising in the trading and marketing of animal feeds agricultural produce and commodities such as corn oil cakes dry red chillies coriander cumin seeds food grains tea pulses soya bean meal and rice bran de oiled cake alongside its core trading operations the company also manufactures a variety of bags and fashion accessories for men and women made from jute cotton canvas and leather these products include purses wallets and shopping bags catering primarily to clients in european markets like france italy and germany as well as in the uae and australia phoenix overseas limited operates a manufacturing facility located in sodhpur kolkata phoenix overseas limited reported a \u003cTWO_TEN_PERCENT\u003e increase in revenue and a \u003cFOUR_TEN_PERCENT\u003e rise in profit after tax pat between the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-27T09:59:00+05:30","market_timestamp":"2024-09-27T09:59:00+05:30","off_market_hours":false}