{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-24-11727142306259.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 24","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,990 level, a premium of nearly 75 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open higher on Tuesday led by positive global market cues.The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,990 level, a premium of nearly 75 points from the Nifty futures’ previous close.On Monday, the domestic market indices hit record highs and closed half a percent higher each.The Sensex rose 384.30 points to close at 84,928.61, while the Nifty 50 settled 148.10 points, or 0.57% higher at 25,939.05.Nifty 50 formed a reasonable bull candle on the daily chart with a gap up opening.“Technically, this pattern indicates follow-through upmove in the market post sharp upside breakout of the hurdles recently. Though Nifty 50 placed at the new highs, still there is no indication of any reversal pattern or signs of any tiredness observed at the highs. The bullish pattern like higher highs and higher lows is intact on the daily chart and Nifty is on the way to form a new higher high of the sequence, which is yet to be confirmed,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.He believes the short-term trend of Nifty 50 continues to be positive and the index is now heading towards the upside target of 26,250 (1.618% Fibonacci Extension) in the near term.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 continued its upside journey on September 23 and closed the day higher by 148 points after registering a new all-time high at 25,956.“The sentiment remains positive, suggesting a potential rise towards 26,200 in the near term. On the downside, the Nifty 50 may find support around the 21-EMA (Exponential Moving Average) on the hourly time frame, currently positioned at 25,700. The RSI has given a falling trendline breakout on the daily timeframe. The positive sentiment is likely to persist as long as the index stays above this critical moving average,” said Rupak De, Senior Technical Analyst, LKP Securities.VLA Ambala, Co-Founder of Stock Market Today noted that Nifty’s RSI readings were 74 on the daily, 75 on the weekly, and 83 on the monthly timeframe, and the index formed a Marabozu candlestick pattern.“While the broader trend remains bullish, a cautious and hedged investment approach is advisable. Based on these situations, the Nifty index could expect support levels around 25,870 and 25,680 and notice resistance between 26,050 and 26,130 in the next session,” Ambala said.Bank Nifty index hit a new lifetime high of 54,197.95 on Monday and ended with decent gains of 312.60 points at 54,105.80.“Bank Nifty formed a small-bodied bullish candle on daily scale and the structure of higher lows is intact from the last eight sessions. Now, it has to hold above 53,750 zones for an up move towards 54,500 then 55,000 zones while on the downside support shifts higher to 53,750 then 53,500 levels,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on tuesday led by positive global market cues the trends on gift nifty also indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cSEVEN_TEN\u003e points from the nifty futures previous close on monday the domestic market indices hit record highs and closed half a percent higher each the sensex rose \u003cTHREE_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a reasonable bull candle on the daily chart with a gap up opening technically this pattern indicates follow through upmove in the market post sharp upside breakout of the hurdles recently though nifty \u003cFIVE_TEN\u003e placed at the new highs still there is no indication of any reversal pattern or signs of any tiredness observed at the highs the bullish pattern like higher highs and higher lows is intact on the daily chart and nifty is on the way to form a new higher high of the sequence which is yet to be confirmed said nagaraj shetti senior technical research analyst at hdfc securities he believes the short term trend of nifty \u003cFIVE_TEN\u003e continues to be positive and the index is now heading towards the upside target of \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension in the near term here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e continued its upside journey on september \u003cTWO_TEN\u003e and closed the day higher by \u003cONE_HUNDRED\u003e points after registering a new all time high at \u003cTWO_TEN_THOUSAND\u003e the sentiment remains positive suggesting a potential rise towards \u003cTWO_TEN_THOUSAND\u003e in the near term on the downside the nifty \u003cFIVE_TEN\u003e may find support around the \u003cTWO_TEN\u003e ema exponential moving average on the hourly time frame currently positioned at \u003cTWO_TEN_THOUSAND\u003e the rsi has given a falling trendline breakout on the daily timeframe the positive sentiment is likely to persist as long as the index stays above this critical moving average said rupak de senior technical analyst lkp securities vla ambala co founder of stock market today noted that nifty s rsi readings were \u003cSEVEN_TEN\u003e on the daily \u003cSEVEN_TEN\u003e on the weekly and \u003cEIGHT_TEN\u003e on the monthly timeframe and the index formed a marabozu candlestick pattern while the broader trend remains bullish a cautious and hedged investment approach is advisable based on these situations the nifty index could expect support levels around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and notice resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in the next session ambala said bank nifty index hit a new lifetime high of \u003cFIVE_TEN_THOUSAND\u003e on monday and ended with decent gains of \u003cTHREE_HUNDRED\u003e points at \u003cFIVE_TEN_THOUSAND\u003e bank nifty formed a small bodied bullish candle on daily scale and the structure of higher lows is intact from the last eight sessions now it has to hold above \u003cFIVE_TEN_THOUSAND\u003e zones for an up move towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones while on the downside support shifts higher to \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels said chandan taparia head equity derivatives and technicals wealth management mofsl","timestamp":"2024-09-24T07:27:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}