{"url":"https://www.livemint.com/market/stock-market-news/sensex-nifty-50-hit-record-highs-time-to-tweak-strategy-for-mutual-funds-heres-what-top-experts-say-11727333946710.html","title":"Sensex, Nifty 50 hit record highs: Time to tweak strategy for mutual funds? Here’s what top experts say","description":"The Indian stock market reached new highs, with the Nifty 50 and Sensex surging amid retail investor optimism and economic growth. However, concerns over high valuations and global economic uncertainties persist, prompting a review of investment strategies.","content":"The Indian stock market continued its record-breaking run on Thursday, September 26, with benchmark indices Sensex and Nifty 50 hitting new all-time highs of 85,930.43 and 26,250.90, respectively, during the trading session. Nifty 50, the basket of stocks of India's top 50 largest and most liquid companies, has been in the green since September 19, a day after the US Fed cut rates by 50 bps and signalled more rate cuts were coming through 2026.However, the rise of the Indian stock market is not a recent phenomenon. Over the last year, the Nifty 50 has jumped over 32 per cent, with stocks such as Bajaj Auto, Hero MotoCorp, Bharti Airtel, Mahindra and Mahindra and BPCL rallying 90-150 per cent.The surge of retail investors, the resilience of India's economic growth, and rising optimism about the potential start of a rate-cutting cycle have driven the market on an upward trajectory.But concerns persist. The biggest concern is stretched valuations amid India Inc.'s unimpressive quarterly earnings. According to Bloomberg data, the current price-to-earnings (PE) ratio of Nifty 50 is 25.6, which is significantly above its one-year forward PE of 21.4. Another key valuation metric is the price-to-book (PB) ratio, which, at 4.2, is also above its one-year forward PB of 3.35.Sticky inflation, geopolitical tensions, and signs of global economic weakness in the eurozone, China, and even the US can derail the momentum. Moreover, the US presidential election remains a major factor impacting stock markets globally.Investing in equities is never straightforward, whether in a bull or bear market. Predicting the market's exact course is challenging; no one can foresee how it will respond to potential triggers. For those struggling to navigate market volatility, mutual funds offer a viable alternative. Though mutual fund investments also carry market risks, they remain an attractive option for most retail investors due to the expertise of professional fund managers.With the Indian stock market at record highs, this could be the ideal time to review your portfolio and make strategic adjustments to maximise gains while minimising potential losses.Some investors may want to book profits at the current juncture amid concerns over premium valuation. While one's investment strategy should be in sync with one's risk appetite and financial goals, long-term investors should ideally remain invested as the long-term growth story of the Indian economy and the market remains bright, according to experts.S\u0026P Global India expects the Indian economy to become the world’s third-largest by 2030–31. The Asian Development Bank (ADB) expects India to remain one of the fastest major economies in the world, growing at 7 per cent in FY25 and 7.2 per cent in FY26.Strong economic growth is expected to attract more foreign capital amid favourable government policies. This will augur well for the market.\"Global liquidity and domestic inflows help support equity market valuations. Given that India is expected to grow faster than other large economies and will add new members to the working class population significantly for the next few decades, there is good reason to remain invested. Mutual fund investors should keep calm and remain invested,\" said Sandeep Bagla, the CEO of TRUST Mutual Fund.Systematic investment plans (SIPs) are the best way for retail investors to steadily invest in mutual funds.Bagla says one should continue investing through periodic SIPs and extend the investment horizon to tide over intermittent volatility.\"Small-cap funds appear reasonable in terms of relative valuations given the expectations of earning growth. One should allocate more to small-sized small-cap funds, as they can take meaningful exposure to high-growth genuinely small companies,\" says Bagla.\"Lesser exposure could be allocated to large cap funds, as earning growth and valuations are moderate. Midcaps come after that. A significant portion of the portfolio should be allocated to debt or fixed income through the mutual funds or fixed-deposit route to provide predictability and stability to the overall portfolio value,\" Bagla says.S Naren, ED and CIO at ICICI Prudential AMC says, \"Given the market's current state—where valuations are elevated driven by overly optimistic domestic sentiment, a cautious approach through asset allocation is recommended. This strategy involves diversifying investments across equities, debt, commodities, and cash. By spreading investments, investors can mitigate risks associated with overvalued markets and capitalise on opportunities during market corrections.\"Rahul Singh, CIO-Equities at Tata Asset Management, suggests investors consider three broad buckets in the present context of favourable macroeconomic conditions.1. A 40 per cent allocation to the hybrid category comprises BAF (balanced advantage fund), multi-asset and equity savings, etc.2. ⁠Another 30-40 per cent in the diversified equity category but tilted towards the large cap and relative value funds (like Tata Equity P/E Fund).3. Singh says another 20-30 per cent in thematic and small caps. Within sectors, pharma/healthcare and banking could potentially offer alpha due to earnings momentum or reasonable valuations.However, Singh added that investors need to manage risks arising from valuation and geopolitics.Read all market-related news here","cleaned_content":"the indian stock market continued its record breaking run on thursday september \u003cTWO_TEN\u003e with benchmark indices sensex and nifty \u003cFIVE_TEN\u003e hitting new all time highs of \u003cEIGHT_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e respectively during the trading session nifty \u003cFIVE_TEN\u003e the basket of stocks of indias top \u003cFIVE_TEN\u003e largest and most liquid companies has been in the green since september \u003cONE_TEN\u003e a day after the us fed cut rates by \u003cFIVE_TEN\u003e bps and signalled more rate cuts were coming through \u003cTWO_THOUSAND\u003e however the rise of the indian stock market is not a recent phenomenon over the last year the nifty \u003cFIVE_TEN\u003e has jumped over \u003cTHREE_TEN_PERCENT\u003e with stocks such as bajaj auto hero motocorp bharti airtel mahindra and mahindra and bpcl rallying \u003cNINE_TEN\u003e \u003cONE_HUNDRED_PERCENT\u003e the surge of retail investors the resilience of indias economic growth and rising optimism about the potential start of a rate cutting cycle have driven the market on an upward trajectory but concerns persist the biggest concern is stretched valuations amid india inc s unimpressive quarterly earnings according to bloomberg data the current price to earnings pe ratio of nifty \u003cFIVE_TEN\u003e is \u003cTWO_TEN\u003e which is significantly above its one year forward pe of \u003cTWO_TEN\u003e another key valuation metric is the price to book pb ratio which at \u003cFOUR_\u003e is also above its one year forward pb of \u003cTHREE_\u003e sticky inflation geopolitical tensions and signs of global economic weakness in the eurozone china and even the us can derail the momentum moreover the us presidential election remains a major factor impacting stock markets globally investing in equities is never straightforward whether in a bull or bear market predicting the markets exact course is challenging no one can foresee how it will respond to potential triggers for those struggling to navigate market volatility mutual funds offer a viable alternative though mutual fund investments also carry market risks they remain an attractive option for most retail investors due to the expertise of professional fund managers with the indian stock market at record highs this could be the ideal time to review your portfolio and make strategic adjustments to maximise gains while minimising potential losses some investors may want to book profits at the current juncture amid concerns over premium valuation while ones investment strategy should be in sync with ones risk appetite and financial goals long term investors should ideally remain invested as the long term growth story of the indian economy and the market remains bright according to experts s p global india expects the indian economy to become the world s third largest by \u003cTWO_THOUSAND\u003e \u003cTHREE_TEN\u003e the asian development bank adb expects india to remain one of the fastest major economies in the world growing at \u003cSEVEN_PERCENT\u003e in fy25 and \u003cSEVEN_PERCENT\u003e in fy26 strong economic growth is expected to attract more foreign capital amid favourable government policies this will augur well for the market global liquidity and domestic inflows help support equity market valuations given that india is expected to grow faster than other large economies and will add new members to the working class population significantly for the next few decades there is good reason to remain invested mutual fund investors should keep calm and remain invested said sandeep bagla the ceo of trust mutual fund systematic investment plans sips are the best way for retail investors to steadily invest in mutual funds bagla says one should continue investing through periodic sips and extend the investment horizon to tide over intermittent volatility small cap funds appear reasonable in terms of relative valuations given the expectations of earning growth one should allocate more to small sized small cap funds as they can take meaningful exposure to high growth genuinely small companies says bagla lesser exposure could be allocated to large cap funds as earning growth and valuations are moderate midcaps come after that a significant portion of the portfolio should be allocated to debt or fixed income through the mutual funds or fixed deposit route to provide predictability and stability to the overall portfolio value bagla says s naren ed and cio at icici prudential amc says given the markets current state where valuations are elevated driven by overly optimistic domestic sentiment a cautious approach through asset allocation is recommended this strategy involves diversifying investments across equities debt commodities and cash by spreading investments investors can mitigate risks associated with overvalued markets and capitalise on opportunities during market corrections rahul singh cio equities at tata asset management suggests investors consider three broad buckets in the present context of favourable macroeconomic conditions 1 a \u003cFOUR_TEN_PERCENT\u003e allocation to the hybrid category comprises baf balanced advantage fund multi asset and equity savings etc 2 another \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e in the diversified equity category but tilted towards the large cap and relative value funds like tata equity p e fund 3 singh says another \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e in thematic and small caps within sectors pharma healthcare and banking could potentially offer alpha due to earnings momentum or reasonable valuations however singh added that investors need to manage risks arising from valuation and geopolitics read all market related news here","timestamp":"2024-09-26T16:49:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}