{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11727748143117.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today, October 1. According to him, these stocks are technically well placed to see a decent upmove. Check out the list.","content":"Stocks to buy: Indian stock market benchmark indices, Sensex and Nifty 50, are expected to see a flat opening on Tuesday amid mixed global cues. Markets witnessed a sharp slump in the previous session as investors opted for profit booking at higher levels amid weak global market cues.The Sensex cracked 1,272.07 points, or 1.49%, to close at 84,299.78, while the Nifty 50 ended 368.10 points, or 1.41%, lower at 25,810.85.“Nifty 50 index formed a bearish candle on the daily frame and broke its higher highs formation of the last seven sessions. Now till Nifty 50 holds below 25,850 zones, some weakness could be seen towards 25,650 then 25,500 zones whereas hurdles are placed at 25,950 then 26,150 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Maximum Call Open Interest (OI) is at 26,000 then 27,000 strike while Maximum Put OI is at 25,000 then 26,000 strike. Call writing is seen at 26,000 then 26,200 strike while Put writing is seen at 25,800 then 25,600 strike.According to Taparia, option data suggests a broader trading range in between 25,400 to 26,300 zones while an immediate range between 25,600 to 26,100 levels.Bank Nifty index tanked 856.20 points, or 1.59%, to close at 52,978.10 on Monday.“Bank Nifty index formed a bearish candle on the daily scale as banking heavyweights remained under pressure and ended with losses of around 860 points. Index has seen a decent correction of 1,500 points in the last two sessions and ended near its 20 DEMA,” Taparia said.According to him, now till Bank Nifty holds below 53,333 zones some weakness could be seen towards 52,750 then 52,500 levels while on the upside hurdle is seen at 53,357 then 53,500 zones,Based on his technical analysis, Chandan Taparia has recommended three stocks to buy today, October 1. According to him, these stocks are technically well placed to see a decent upmove. The three stocks to buy are NTPC, Federal Bank and JSW Steel.Here are top three stock recommendations for today by Chandan Taparia:NTPC stock price has broken out of a consolidation zone and is headed up with high - than - average buying volumes. The RSI indicator has turned up which confirms the bullish momentum, Taparia said.Federal Bank share price has broken out of a rounding bottom on the daily chart and a new bullish trend has begun. The MACD indicator has given a bullish crossover and is headed up which confirms the up move.JSW Steel stock is in a strong uptrend and is headed up with the recent candle being a large bodied bullish candle. Buying was visible across the metal space which may support the up move. The ADX line is headed up which confirms the strength, Taparia said.","cleaned_content":"stocks to buy indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are expected to see a flat opening on tuesday amid mixed global cues markets witnessed a sharp slump in the previous session as investors opted for profit booking at higher levels amid weak global market cues the sensex cracked \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e ended \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e index formed a bearish candle on the daily frame and broke its higher highs formation of the last seven sessions now till nifty \u003cFIVE_TEN\u003e holds below \u003cTWO_TEN_THOUSAND\u003e zones some weakness could be seen towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas hurdles are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front maximum call open interest oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike according to taparia option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels bank nifty index tanked \u003cEIGHT_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on monday bank nifty index formed a bearish candle on the daily scale as banking heavyweights remained under pressure and ended with losses of around \u003cEIGHT_HUNDRED\u003e points index has seen a decent correction of \u003cONE_THOUSAND\u003e points in the last two sessions and ended near its \u003cTWO_TEN\u003e dema taparia said according to him now till bank nifty holds below \u003cFIVE_TEN_THOUSAND\u003e zones some weakness could be seen towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels while on the upside hurdle is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones based on his technical analysis chandan taparia has recommended three stocks to buy today october \u003cONE_\u003e according to him these stocks are technically well placed to see a decent upmove the three stocks to buy are ntpc federal bank and jsw steel here are top three stock recommendations for today by chandan taparia ntpc stock price has broken out of a consolidation zone and is headed up with high than average buying volumes the rsi indicator has turned up which confirms the bullish momentum taparia said federal bank share price has broken out of a rounding bottom on the daily chart and a new bullish trend has begun the macd indicator has given a bullish crossover and is headed up which confirms the up move jsw steel stock is in a strong uptrend and is headed up with the recent candle being a large bodied bullish candle buying was visible across the metal space which may support the up move the adx line is headed up which confirms the strength taparia said","timestamp":"2024-10-01T07:43:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}