{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-september-24-11727107661960.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — 24 September","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy today — AU Small Finance Bank, JSW Energy, and BPCL","content":"Buy or sell stocks today: India's benchmark stock market indices, Sensex and Nifty 50, extended their winning streak for a third straight session, hitting record highs on Monday, 23 September 23. Gains were driven by strong performances in the financial services sector, with additional support realty and auto stocks.The Nifty 50 closed 0.57% higher at 25,939.05 points, up from 25,790.95 in the previous session. The BSE Sensex closed 0.45% higher at 84,928.61 points, compared to 84,544.31 points at Friday's market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, noted that the Nifty 50 has notched up robust gains moving towards the 26,000 mark in its last two sessions. She expects the index to maintain its upward trend, with an initial target of 26,400. Parekh estimates the Nifty 50 Spot index to find support at 25,800 points and face resistance at 26,100 points. The Bank Nifty index will likely move in a range of 53,800 to 54,600 today.For today, Parekh recommended three buy-or-sell stocks: AU Small Finance Bank Ltd, JSW Energy Ltd, and Bharat Petroleum Corporation Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty index in the last 2 sessions has indicated a strong robust gain moving towards the 26,000 landmark and thereafter, with strength indicated has the initial target of 26,400 levels with indicators showing upside potential.”“The 25,600 level would be the immediate strong support for the index which needs to be sustained to carry on with the positive move further ahead,” said the stock market expert.“Bank Nifty has breached above the 54,000-zone indicating a strong uptrend with bias and sentiment much improved anticipating for further rise with next target of 55,100 achievable in the coming days. The levels near 53,300 zone shall be the immediate support for the index which needs to be sustained,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 25,800 points, while the resistance lies at 26,100 points. The Bank Nifty index would have a daily range of 53,800 to 54,600.1. AU Small Finance Bank Ltd. (AUBANK): Buy at  ₹735; Target at  ₹766; Stop Loss at  ₹720.2. JSW Energy Ltd. (JSWENERGY): Buy at  ₹792; Target at  ₹830; Stop Loss at  ₹775.3. Bharat Petroleum Corporation Ltd. (BPCL): Buy at  ₹338; Target at  ₹354; Stop Loss at  ₹331.","cleaned_content":"buy or sell stocks today indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e extended their winning streak for a third straight session hitting record highs on monday \u003cTWO_TEN\u003e september \u003cTWO_TEN\u003e gains were driven by strong performances in the financial services sector with additional support realty and auto stocks the nifty \u003cFIVE_TEN\u003e closed \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e points up from \u003cTWO_TEN_THOUSAND\u003e in the previous session the bse sensex closed \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e points compared to \u003cEIGHT_TEN_THOUSAND\u003e points at fridays market close vaishali parekh vice president of technical research at prabhudas lilladher noted that the nifty \u003cFIVE_TEN\u003e has notched up robust gains moving towards the \u003cTWO_TEN_THOUSAND\u003e mark in its last two sessions she expects the index to maintain its upward trend with an initial target of \u003cTWO_TEN_THOUSAND\u003e parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks au small finance bank ltd jsw energy ltd and bharat petroleum corporation ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty index in the last \u003cTWO_\u003e sessions has indicated a strong robust gain moving towards the \u003cTWO_TEN_THOUSAND\u003e landmark and thereafter with strength indicated has the initial target of \u003cTWO_TEN_THOUSAND\u003e levels with indicators showing upside potential the \u003cTWO_TEN_THOUSAND\u003e level would be the immediate strong support for the index which needs to be sustained to carry on with the positive move further ahead said the stock market expert bank nifty has breached above the \u003cFIVE_TEN_THOUSAND\u003e zone indicating a strong uptrend with bias and sentiment much improved anticipating for further rise with next target of \u003cFIVE_TEN_THOUSAND\u003e achievable in the coming days the levels near \u003cFIVE_TEN_THOUSAND\u003e zone shall be the immediate support for the index which needs to be sustained said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e au small finance bank ltd aubank buy at \u003cSEVEN_HUNDRED\u003e target at \u003cSEVEN_HUNDRED\u003e stop loss at \u003cSEVEN_HUNDRED\u003e jsw energy ltd jswenergy buy at \u003cSEVEN_HUNDRED\u003e target at \u003cEIGHT_HUNDRED\u003e stop loss at \u003cSEVEN_HUNDRED\u003e bharat petroleum corporation ltd bpcl buy at \u003cTHREE_HUNDRED\u003e target at \u003cTHREE_HUNDRED\u003e stop loss at \u003cTHREE_HUNDRED\u003e","timestamp":"2024-09-24T07:37:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}