{"url":"https://www.livemint.com/market/stock-market-news/nmdc-share-price-surges-nearly-5-5-on-sharp-jump-in-iron-ore-prices-11727670139304.html","title":"NMDC share price surges nearly 5.5% on sharp jump in iron ore prices","description":"NMDC shares rose 5.5% to  ₹247.50 amid increasing iron ore prices, driven by optimism over China's economic recovery. Chinese stimulus measures have contributed to this surge, with iron ore prices rising 8.4% to $110.65 per ton.","content":"Shares of NMDC, India’s largest iron ore producer, rallied nearly 5.5% in early morning trade on Monday, September 30, to  ₹247.50 per share. The stock surged following a sharp uptick in iron ore prices, fueled by growing optimism regarding China's economic recovery.In response to significant economic pressures, China is rolling out a series of stimulus measures aimed at revitalising its economy, which has been struggling due to a prolonged slowdown. Central to these efforts is the enhancement of the ailing real estate sector, which has been in decline for several years, adversely impacting overall economic activity and investor confidence.Major cities such as Shanghai, Guangzhou, and Shenzhen have begun to ease regulations as part of Beijing's latest initiatives to support the beleaguered property market.Additionally, the rally in iron ore prices was bolstered by a decrease in total iron ore inventories at Chinese ports, which fell to 146.6 million tons in the last week. Furthermore, iron ore shipments from major suppliers, including Australia and Brazil, experienced a week-on-week decline of 4% during the period ending in September, according to various media reports.As a result of these developments, iron ore prices surged 8.4% to $110.65 per ton as in today's early morning trade. This follows an 11% rally the previous week. In addition to iron ore, base metal prices also saw gains, with copper rising 1% to $10,083.50 per ton on the London Metal Exchange (LME) and zinc climbing 0.7%.Base metal prices also rose last week after the People's Bank of China reduced banks' reserve requirement ratios by 50 basis points—the second such cut this year—expected to free up approximately 1 trillion yuan in capital. The central bank also lowered its one-year medium-term lending facility rate and key short-term interest rates to encourage borrowing and enhance market liquidity.Domestic iron ore production experienced a notable increase, reaching 116 million metric tons (MMT) during the April-August period of FY 2024-25, compared to 108 MMT in the same period last year. This represents a healthy growth of 7.4%, according to the Ministry of Mines.Iron ore is a vital component of India’s mineral production, accounting for roughly 70% of the total mineral output by value under the Mineral Conservation and Development Rules (MCDR). With this performance, India maintains its status as the fourth-largest iron ore producer globally.Among the key players in this sector is NMDC, recognised as one of the world's low-cost iron ore producers. The company also operates India’s only mechanised diamond mine, located in Panna, Madhya Pradesh. To further enhance its operations, NMDC recently unveiled a capital expenditure plan of  ₹22 billion for FY25, which aims to establish a slurry pipeline and new processing plants. This initiative is part of the company's strategy to increase its production capacity to 100 MMT by 2030.A recent note from domestic brokerage firm LKP Securities emphasised NMDC's favourable position to capitalize on the rising demand for steel in India. The firm anticipates that NMDC will benefit from a resurgence in capital expenditure, reminiscent of the boom experienced between 2003 and 2007. Additionally, the brokerage highlighted the company's proactive measures to expand its mining capacity in response to future demand.Furthermore, LKP Securities pointed out NMDC's significant advantage in having access to high-quality iron ore reserves that are expected to last for the next four decades, reinforcing its strong market position.","cleaned_content":"shares of nmdc india s largest iron ore producer rallied nearly \u003cFIVE_PERCENT\u003e in early morning trade on monday september \u003cTHREE_TEN\u003e to \u003cTWO_HUNDRED\u003e per share the stock surged following a sharp uptick in iron ore prices fueled by growing optimism regarding chinas economic recovery in response to significant economic pressures china is rolling out a series of stimulus measures aimed at revitalising its economy which has been struggling due to a prolonged slowdown central to these efforts is the enhancement of the ailing real estate sector which has been in decline for several years adversely impacting overall economic activity and investor confidence major cities such as shanghai guangzhou and shenzhen have begun to ease regulations as part of beijings latest initiatives to support the beleaguered property market additionally the rally in iron ore prices was bolstered by a decrease in total iron ore inventories at chinese ports which fell to \u003cONE_HUNDRED\u003e million tons in the last week furthermore iron ore shipments from major suppliers including australia and brazil experienced a week on week decline of \u003cFOUR_PERCENT\u003e during the period ending in september according to various media reports as a result of these developments iron ore prices surged \u003cEIGHT_PERCENT\u003e to \u003cONE_HUNDRED\u003e per ton as in todays early morning trade this follows an \u003cONE_TEN_PERCENT\u003e rally the previous week in addition to iron ore base metal prices also saw gains with copper rising \u003cONE_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e per ton on the london metal exchange lme and zinc climbing \u003cZERO_PERCENT\u003e base metal prices also rose last week after the peoples bank of china reduced banks reserve requirement ratios by \u003cFIVE_TEN\u003e basis points the second such cut this year expected to free up approximately \u003cONE_\u003e trillion yuan in capital the central bank also lowered its one year medium term lending facility rate and key short term interest rates to encourage borrowing and enhance market liquidity domestic iron ore production experienced a notable increase reaching \u003cONE_HUNDRED\u003e million metric tons mmt during the april august period of fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e compared to \u003cONE_HUNDRED\u003e mmt in the same period last year this represents a healthy growth of \u003cSEVEN_PERCENT\u003e according to the ministry of mines iron ore is a vital component of india s mineral production accounting for roughly \u003cSEVEN_TEN_PERCENT\u003e of the total mineral output by value under the mineral conservation and development rules mcdr with this performance india maintains its status as the fourth largest iron ore producer globally among the key players in this sector is nmdc recognised as one of the worlds low cost iron ore producers the company also operates india s only mechanised diamond mine located in panna madhya pradesh to further enhance its operations nmdc recently unveiled a capital expenditure plan of \u003cTWO_TEN\u003e billion for fy25 which aims to establish a slurry pipeline and new processing plants this initiative is part of the companys strategy to increase its production capacity to \u003cONE_HUNDRED\u003e mmt by \u003cTWO_THOUSAND\u003e a recent note from domestic brokerage firm lkp securities emphasised nmdcs favourable position to capitalize on the rising demand for steel in india the firm anticipates that nmdc will benefit from a resurgence in capital expenditure reminiscent of the boom experienced between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e additionally the brokerage highlighted the companys proactive measures to expand its mining capacity in response to future demand furthermore lkp securities pointed out nmdcs significant advantage in having access to high quality iron ore reserves that are expected to last for the next four decades reinforcing its strong market position","timestamp":"2024-09-30T10:50:00+05:30","market_timestamp":"2024-09-30T10:50:00+05:30","off_market_hours":false}