{"url":"https://www.livemint.com/market/stock-market-news/nse-to-hold-mock-trading-session-on-saturday-details-here-11727453607789.html","title":"Stock market today: NSE to hold mock trading session today. Details here","description":"NSE mock trading session: This marks the third special live trading session organized by the NSE this year","content":"Stock market today: The National Stock Exchange (NSE) will hold mock trading sessions on Saturday at its Disaster Recovery site. Additionally, live trading sessions are scheduled to take place from September 30 to October 3, also from the disaster recovery location, as stated in a circular issued on Friday. The mock session has been scheduled from 12:00 noon to 01:00 PM on Saturday.\"Members are requested to note that the Exchange Contingency Tests shall be carried out between 12:00 PM to 01:00 PM for mock trading on Saturday, September 28, 2024. Members are requested to plan their activities accordingly,\" the NSE said in a statement (Click here to see the full release) on Friday.This marks the third special live trading session organized by the NSE this year. The initial session took place on March 2, running smoothly and concluding at a record closing level. The second session occurred on May 18, which saw a lackluster trading performance in the indices.The special session will evaluate how well the exchanges are prepared for unforeseen events that may occur during a regular trading session. In the event of an emergency, such as a security breach, market operations can be temporarily moved to a disaster recovery site to maintain the continuity of normal operations.The T+0 settlement cycle marks a significant change in trading practices, enabling transactions to be finalized on the same day they are executed. This allows for the immediate transfer of shares to the buyer's account and the corresponding credit of funds to the seller's account within the same trading day. Introduced in March 2024, this system operates alongside the traditional T+1 settlement model, which processes transactions on the next day.Additionally, NSE announced plans to hold mock trading sessions for both the capital market and futures and options segments from its disaster recovery site on Saturday, September 28. This initiative is part of the exchange's regular testing and preparedness measures to ensure trading can continue smoothly from alternative locations in case of disruptions to primary operations.The live trading sessions from the Disaster Recovery (DR) site are set for two consecutive days, from September 30 to October 1, adhering to regular market hours. According to the NSE's circular, a Contingency Test will take place during the mock trading session on Saturday, September 28, between 12:00 PM and 1:00 PM. The exchange has urged its members to adjust their schedules accordingly to ensure participation in this testing process.","cleaned_content":"stock market today the national stock exchange nse will hold mock trading sessions on saturday at its disaster recovery site additionally live trading sessions are scheduled to take place from september \u003cTHREE_TEN\u003e to october \u003cTHREE_\u003e also from the disaster recovery location as stated in a circular issued on friday the mock session has been scheduled from \u003cONE_TEN\u003e \u003cZERO_\u003e noon to \u003cONE_\u003e \u003cZERO_\u003e pm on saturday members are requested to note that the exchange contingency tests shall be carried out between \u003cONE_TEN\u003e \u003cZERO_\u003e pm to \u003cONE_\u003e \u003cZERO_\u003e pm for mock trading on saturday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e members are requested to plan their activities accordingly the nse said in a statement click here to see the full release on friday this marks the third special live trading session organized by the nse this year the initial session took place on march \u003cTWO_\u003e running smoothly and concluding at a record closing level the second session occurred on may \u003cONE_TEN\u003e which saw a lackluster trading performance in the indices the special session will evaluate how well the exchanges are prepared for unforeseen events that may occur during a regular trading session in the event of an emergency such as a security breach market operations can be temporarily moved to a disaster recovery site to maintain the continuity of normal operations the t \u003cZERO_\u003e settlement cycle marks a significant change in trading practices enabling transactions to be finalized on the same day they are executed this allows for the immediate transfer of shares to the buyers account and the corresponding credit of funds to the sellers account within the same trading day introduced in march \u003cTWO_THOUSAND\u003e this system operates alongside the traditional t \u003cONE_\u003e settlement model which processes transactions on the next day additionally nse announced plans to hold mock trading sessions for both the capital market and futures and options segments from its disaster recovery site on saturday september \u003cTWO_TEN\u003e this initiative is part of the exchanges regular testing and preparedness measures to ensure trading can continue smoothly from alternative locations in case of disruptions to primary operations the live trading sessions from the disaster recovery dr site are set for two consecutive days from september \u003cTHREE_TEN\u003e to october \u003cONE_\u003e adhering to regular market hours according to the nses circular a contingency test will take place during the mock trading session on saturday september \u003cTWO_TEN\u003e between \u003cONE_TEN\u003e \u003cZERO_\u003e pm and \u003cONE_\u003e \u003cZERO_\u003e pm the exchange has urged its members to adjust their schedules accordingly to ensure participation in this testing process","timestamp":"2024-09-28T07:25:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}