{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-m-m-to-jyothy-labs-smc-global-securities-lists-four-stocks-to-bet-on-this-week-check-tp-upside-11727184388867.html","title":"Stocks to buy: M\u0026M to Jyothy Labs—SMC Global Securities lists four stocks to bet on this week; Check TP, upside","description":"Stocks to buy: Domestic brokerage SMC Global Securities has recommended four stocks to buy this week based upon the fundamental and technical analysis in the current market scenario","content":"Domestic equity benchmarks Sensex and Nifty 50 settled almost flat in highly volatile trade on Tuesday, September 24, after the 30-share BSE index breached the 85,000 mark for the first time and the NSE Nifty 50 topped the 26,000 level in intra-day trade. Traders said investors struggled to find directions following a record rally even as FMCG and banking shares dragged indices.After oscillating between highs and lows, Sensex dipped 14.57 points or 0.02 per cent to settle at 84,914.04. During the day, it jumped 234.62 points or 0.27 per cent to scale a fresh all-time intra-day peak of 85,163.23. Nifty eked out a gain of 1.35 points or 0.01 per cent to 25,940.40. During the day, it climbed 72.5 points or 0.27 per cent to hit a new record intra-day high of 26,011.55.Also Read: Bull Market Marches On: Sensex tops 85,000 milestone, Nifty 50 reaches 26,000 for the first timeIn the current market scenario, domestic brokerage firm SMC Global Securities has released its top four stock picks for this week. The brokerage has selected the following stocks based on technical and fundamental parameters. According to the brokerage, the stocks have robust fundamentals and are well-placed to yield good returns for investors in the next one year.Let's take a look at the top four technical and fundamental stocks for this week by brokerage SMC Global Securities:Regarding the Reserve Bank of India (RBI) embargo on the credit card business and digital acquisition, the bank has made progress on all the points in the RBI order. The bank had indicated that the RBI order would impact its 811 customer acquisition and credit card business. According to SMC Global, the bank expects to rebound stronger once the embargo is lifted.Also Read: Nifty 50 rises over 19% in 2024, set to surpass full-year 2023 gains amid strong FPI inflowsThe bank's asset quality was impacted due to seasonality and operational limitations during the election period. The bank remains focused on growing its share of unsecured retail loan books to the mid-teens. Stable asset quality and growing business auger well for the banks. The brokerage expects the stock will see a price target of Rs. 2237 in 8 to 10 months on a one-year average P/BV of 3.84x and FY25 (E) BVPS of Rs. 582.44.The company is focused on deepening its consumer connections to reach out effectively to the country's last mile. In addition to direct distribution expansion and manufacturing capacity augmentation, it continues to boost our A\u0026P spending to enhance brand visibility.The company has focused on strengthening its balance sheet by maintaining stable working capital with better growth visibility in the near term. It has a strong grip on its product categories, which has been possible mainly due to a distribution network.Also Read: FPIs turn aggressive buyers on US Fed verdict, pump  ₹33,691 crore in Indian equities; Sept to log highest inflows YTDThe company’s cost-saving initiatives, innovation, strong brands, an integrated distribution network, and new launches will drive its volume growth on the path to progress. The brokerage expects the stock will see a price target of Rs.613 in 8 to 10 months on current P/BV of 10.95x and FY25 BVPS of Rs.55.98.The stock's 200-day exponential moving average (DEMA) on the daily chart is currently at 3,509. The stock market reached its 52-week high of 4,409.55 in June, and since then, it has been trading lower, forming a lower-high pattern on daily charts. Recently, the stock managed to take support around 3,600 levels and bounced back once again, surpassing the 4,000 mark.Technically, the stock has broken out above the inverted head and shoulder pattern on short-term charts, while on broader charts, fresh bullish momentum is seen above the falling trend line of the declining channel. Therefore, one can buy the stock in a range of 4,000-4,080 for the upside target of 4,500-4,550 levels with SL below 3,700.Also Read: Week Ahead: FII inflows, F\u0026O expiry, global cues among key market triggers as Nifty 50 approaches 26K4.Mahindra \u0026 Mahindra (M\u0026M)The stock's 200-day exponential moving average (DEMA) on the daily chart is currently at  ₹2,348. The stock has been consolidating in a broader range of 2,600-2,900 levels on broader charts with the formation of a lower high pattern. Broader trends remained intact, with a bullish move as the stock can be seen holding well above its 200-day exponential moving average on daily and weekly charts.Last week, a fresh breakout was observed on charts above the key resistance level of 2,900 after a phase of prolonged consolidation of nearly three months. The momentum is supported by a substantial increase in trading volume, suggesting the potential for further price gains from hereon. Therefore, one can buy the stock in the range of 2,900-2,950 for the upside target of 3,200-3,250 levels with SL below 2,700.","cleaned_content":"domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e settled almost flat in highly volatile trade on tuesday september \u003cTWO_TEN\u003e after the \u003cTHREE_TEN\u003e share bse index breached the \u003cEIGHT_TEN_THOUSAND\u003e mark for the first time and the nse nifty \u003cFIVE_TEN\u003e topped the \u003cTWO_TEN_THOUSAND\u003e level in intra day trade traders said investors struggled to find directions following a record rally even as fmcg and banking shares dragged indices after oscillating between highs and lows sensex dipped \u003cONE_TEN\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e during the day it jumped \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to scale a fresh all time intra day peak of \u003cEIGHT_TEN_THOUSAND\u003e nifty eked out a gain of \u003cONE_\u003e points or \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e during the day it climbed \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e to hit a new record intra day high of \u003cTWO_TEN_THOUSAND\u003e also read bull market marches on sensex tops \u003cEIGHT_TEN_THOUSAND\u003e milestone nifty \u003cFIVE_TEN\u003e reaches \u003cTWO_TEN_THOUSAND\u003e for the first timein the current market scenario domestic brokerage firm smc global securities has released its top four stock picks for this week the brokerage has selected the following stocks based on technical and fundamental parameters according to the brokerage the stocks have robust fundamentals and are well placed to yield good returns for investors in the next one year lets take a look at the top four technical and fundamental stocks for this week by brokerage smc global securities regarding the reserve bank of india rbi embargo on the credit card business and digital acquisition the bank has made progress on all the points in the rbi order the bank had indicated that the rbi order would impact its \u003cEIGHT_HUNDRED\u003e customer acquisition and credit card business according to smc global the bank expects to rebound stronger once the embargo is lifted also read nifty \u003cFIVE_TEN\u003e rises over \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e set to surpass full year \u003cTWO_THOUSAND\u003e gains amid strong fpi inflowsthe banks asset quality was impacted due to seasonality and operational limitations during the election period the bank remains focused on growing its share of unsecured retail loan books to the mid teens stable asset quality and growing business auger well for the banks the brokerage expects the stock will see a price target of rs \u003cTWO_THOUSAND\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on a one year average p bv of \u003cTHREE_\u003e x and fy25 e bvps of rs \u003cFIVE_HUNDRED\u003e the company is focused on deepening its consumer connections to reach out effectively to the countrys last mile in addition to direct distribution expansion and manufacturing capacity augmentation it continues to boost our a p spending to enhance brand visibility the company has focused on strengthening its balance sheet by maintaining stable working capital with better growth visibility in the near term it has a strong grip on its product categories which has been possible mainly due to a distribution network also read fpis turn aggressive buyers on us fed verdict pump \u003cTHREE_TEN_THOUSAND\u003e crore in indian equities sept to log highest inflows ytdthe company s cost saving initiatives innovation strong brands an integrated distribution network and new launches will drive its volume growth on the path to progress the brokerage expects the stock will see a price target of rs 613 in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on current p bv of \u003cONE_TEN\u003e x and fy25 bvps of rs 55 98 the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cTHREE_THOUSAND\u003e the stock market reached its \u003cFIVE_TEN\u003e week high of \u003cFOUR_THOUSAND\u003e in june and since then it has been trading lower forming a lower high pattern on daily charts recently the stock managed to take support around \u003cTHREE_THOUSAND\u003e levels and bounced back once again surpassing the \u003cFOUR_THOUSAND\u003e mark technically the stock has broken out above the inverted head and shoulder pattern on short term charts while on broader charts fresh bullish momentum is seen above the falling trend line of the declining channel therefore one can buy the stock in a range of \u003cFOUR_THOUSAND\u003e \u003cFOUR_THOUSAND\u003e for the upside target of \u003cFOUR_THOUSAND\u003e \u003cFOUR_THOUSAND\u003e levels with sl below \u003cTHREE_THOUSAND\u003e also read week ahead fii inflows f o expiry global cues among key market triggers as nifty \u003cFIVE_TEN\u003e approaches \u003cTWO_TEN\u003e k4 mahindra mahindra m m the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cTWO_THOUSAND\u003e the stock has been consolidating in a broader range of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e levels on broader charts with the formation of a lower high pattern broader trends remained intact with a bullish move as the stock can be seen holding well above its \u003cTWO_HUNDRED\u003e day exponential moving average on daily and weekly charts last week a fresh breakout was observed on charts above the key resistance level of \u003cTWO_THOUSAND\u003e after a phase of prolonged consolidation of nearly three months the momentum is supported by a substantial increase in trading volume suggesting the potential for further price gains from hereon therefore one can buy the stock in the range of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e for the upside target of \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e levels with sl below \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-24T18:57:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}