{"url":"https://www.livemint.com/market/stock-market-news/reliance-power-share-price-rises-5-to-hit-upper-circuit-has-given-multibagger-returns-to-investors-rising-110-in-year-11727149991140.html","title":"Reliance Power share price rises 5% to hit upper circuit: Has given Multibagger returns to investors rising 110% in year","description":"Stock Market today: Reliance Power share price gained 5% in morning trades to hit upper circuit. Having risen 110% in a year has given Multibagger returns to investors. Approves preferential allotment of shares worth  ₹1525 crore","content":"Stock Market today: Reliance Power share price gained 5% in morning trades to hit upper circuit. Having risen 110% in a year has given Multibagger returns to investors. Approves preferential allotment of shares worth  ₹1525 crore.Reliance Power share price opened at  ₹40.06, higher than previous close of  ₹38.16. The Reliance Power share price thereafter continued to remain locked in the upper band limit on the BSE on Tuesday.Reliance Power share price has risen regularly in last five trading sessions and has risen more than 20%. The Reliance Power share price has risen 67% year to date during 2024 and has risen 111% in last one year having given Multibagger returns to the investors. Notably the Reliance Power share price has risen multifold from 52 week lows of  ₹15.53 in October last year to  ₹40.06 nowThe Reliance Power share price has gained on regular news flow and developments that are improving its outlook.On Monday post market hours, Reliance Power announced that its Board has approves Preferential Issue of Equity shares of  ₹1525 crorePreferential Issue as per Reliance Power is to fast track the company’s growth in the interest of its over 40 lakhs valued shareholdersReliance Infrastructure Limited, the Reliance Power promoter, will increase its equity holding by more than  ₹600 crore. Through the preferential offer, the company's net worth will increase from over  ₹11,155 crore to over  ₹12,680 crore with ZERO bank debt.The other investors in the Preferential Issue are Authum Investment and Infrastructure Limited and Sanatan Financial Advisory Services Private Limited.Enhanced capital will support the company’s participation In the renewable energy sector, said Reliance Power in its release.The Preferential Issue proceeds would be utilised for expansion of business operations directly and/or through investment in subsidiaries and joint ventures, debt reduction and for general corporate purposes, as per Reliance Power.","cleaned_content":"stock market today reliance power share price gained \u003cFIVE_PERCENT\u003e in morning trades to hit upper circuit having risen \u003cONE_HUNDRED_PERCENT\u003e in a year has given multibagger returns to investors approves preferential allotment of shares worth \u003cONE_THOUSAND\u003e crore reliance power share price opened at \u003cFOUR_TEN\u003e higher than previous close of \u003cTHREE_TEN\u003e the reliance power share price thereafter continued to remain locked in the upper band limit on the bse on tuesday reliance power share price has risen regularly in last five trading sessions and has risen more than \u003cTWO_TEN_PERCENT\u003e the reliance power share price has risen \u003cSIX_TEN_PERCENT\u003e year to date during \u003cTWO_THOUSAND\u003e and has risen \u003cONE_HUNDRED_PERCENT\u003e in last one year having given multibagger returns to the investors notably the reliance power share price has risen multifold from \u003cFIVE_TEN\u003e week lows of \u003cONE_TEN\u003e in october last year to \u003cFOUR_TEN\u003e nowthe reliance power share price has gained on regular news flow and developments that are improving its outlook on monday post market hours reliance power announced that its board has approves preferential issue of equity shares of \u003cONE_THOUSAND\u003e crorepreferential issue as per reliance power is to fast track the company s growth in the interest of its over \u003cFOUR_TEN\u003e lakhs valued shareholdersreliance infrastructure limited the reliance power promoter will increase its equity holding by more than \u003cSIX_HUNDRED\u003e crore through the preferential offer the companys net worth will increase from over \u003cONE_TEN_THOUSAND\u003e crore to over \u003cONE_TEN_THOUSAND\u003e crore with zero bank debt the other investors in the preferential issue are authum investment and infrastructure limited and sanatan financial advisory services private limited enhanced capital will support the company s participation in the renewable energy sector said reliance power in its release the preferential issue proceeds would be utilised for expansion of business operations directly and or through investment in subsidiaries and joint ventures debt reduction and for general corporate purposes as per reliance power","timestamp":"2024-09-24T09:33:00+05:30","market_timestamp":"2024-09-24T09:33:00+05:30","off_market_hours":false}