{"url":"https://www.livemint.com/market/stock-market-news/itc-share-price-hits-record-high-market-cap-crosses-rs-6-5-lakh-crore-for-the-first-time-should-you-buy-11727330876137.html","title":"ITC share price hits record high, market cap crosses  ₹6.5 lakh crore for the first time. Should you buy?","description":"ITC stock has risen 22% in three months and 12% YTD. Analysts see continued strength in the stock above  ₹500, with the potential to touch highs of  ₹530-538.","content":"ITC share price gained nearly a per cent on Thursday, September 26 to hit a record high of  ₹522.50 on BSE, with its market capitalisation crossing  ₹6.5 lakh crore for the first time.The hotels-to-FMCG conglomerate ITC on September 25 announced that it has been allotted 1,413 Compulsorily Convertible Preference Shares of Sproutlife Foods Private Ltd.The preference shares of Sproutlife have been acquired pursuant to a follow-on investment in terms of the Securities Subscription \u0026 Purchase Agreement and the Shareholders Agreement executed on 19th April, 2023 to acquire 100% of the share capital (on a fully diluted basis) of Sproutlife in one or more tranches.With the acquisition of 1,413 CCPS, ITC’s shareholding in Sproutlife aggregates to around 47.50% of its share capital at a total investment of  ₹255 crore.“The acquisition is in line with the strategy to augment the Company’s future ready portfolio in the foods segment,” ITC said.Sproutlife is a start-up engaged in the business of manufacturing and selling food products under the trademark ‘Yoga Bar’. It currently has high salience of on-line sales (D2C, e-commerce platforms etc.) with growing presence in offline stores.ITC stock price has seen a gradual upmove as it has risen nearly 22% in the past three months. The stock has gained over 12% year-to-date (YTD), while it is up more than 17% in the past one year.Analysts are bullish on ITC shares as long as they remains above the psychological mark of  ₹500 level.“I expect ITC shares to stay strong and make incremental highs. The overall FMCG sector is expected to outperform the broader markets and so will ITC stock. ITC shares are estimated to do well above the  ₹500 level, which is its major technical as well as psychological support,” said Milan Vaishnav, founder of ChartWizard FZE and Gemstone Equity Research.He expects ITC stock to see an upside to  ₹530 -  ₹538 levels in the near term. However, if ITC shares fall below  ₹500 level, Vaishnav expects the stock to see a consolidation thereon.At 11:45 am, ITC shares were trading 0.39% higher at  ₹519.45 apiece on the BSE, commanding a market cap of over  ₹6.49 lakh crore.","cleaned_content":"itc share price gained nearly a per cent on thursday september \u003cTWO_TEN\u003e to hit a record high of \u003cFIVE_HUNDRED\u003e on bse with its market capitalisation crossing \u003cSIX_\u003e lakh crore for the first time the hotels to fmcg conglomerate itc on september \u003cTWO_TEN\u003e announced that it has been allotted \u003cONE_THOUSAND\u003e compulsorily convertible preference shares of sproutlife foods private ltd the preference shares of sproutlife have been acquired pursuant to a follow on investment in terms of the securities subscription purchase agreement and the shareholders agreement executed on \u003cONE_TEN\u003e th april \u003cTWO_THOUSAND\u003e to acquire \u003cONE_HUNDRED_PERCENT\u003e of the share capital on a fully diluted basis of sproutlife in one or more tranches with the acquisition of \u003cONE_THOUSAND\u003e ccps itc s shareholding in sproutlife aggregates to around \u003cFOUR_TEN_PERCENT\u003e of its share capital at a total investment of \u003cTWO_HUNDRED\u003e crore the acquisition is in line with the strategy to augment the company s future ready portfolio in the foods segment itc said sproutlife is a start up engaged in the business of manufacturing and selling food products under the trademark yoga bar it currently has high salience of on line sales d2c e commerce platforms etc with growing presence in offline stores itc stock price has seen a gradual upmove as it has risen nearly \u003cTWO_TEN_PERCENT\u003e in the past three months the stock has gained over \u003cONE_TEN_PERCENT\u003e year to date ytd while it is up more than \u003cONE_TEN_PERCENT\u003e in the past one year analysts are bullish on itc shares as long as they remains above the psychological mark of \u003cFIVE_HUNDRED\u003e level i expect itc shares to stay strong and make incremental highs the overall fmcg sector is expected to outperform the broader markets and so will itc stock itc shares are estimated to do well above the \u003cFIVE_HUNDRED\u003e level which is its major technical as well as psychological support said milan vaishnav founder of chartwizard fze and gemstone equity research he expects itc stock to see an upside to \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e levels in the near term however if itc shares fall below \u003cFIVE_HUNDRED\u003e level vaishnav expects the stock to see a consolidation thereon at \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e am itc shares were trading \u003cZERO_PERCENT\u003e higher at \u003cFIVE_HUNDRED\u003e apiece on the bse commanding a market cap of over \u003cSIX_\u003e lakh crore","timestamp":"2024-09-26T11:46:00+05:30","market_timestamp":"2024-09-26T11:46:00+05:30","off_market_hours":false}