{"url":"https://www.livemint.com/market/stock-market-news/stock-to-buy-reliance-power-share-price-rises-50-in-eight-days-experts-see-33-more-upside-11727501160157.html","title":"Stock to buy: Reliance Power share price rises 50% in eight days. Experts see 33% more upside","description":"Stock to buy: Reliance Power share price has been hitting upper circuit since 18th September 2024","content":"Reliance Power share: Anil Ambani-owned Reliance Power shares have been on an uptrend for the last eight sessions. After the announcement of debt settlement as a guarantor on behalf of Vidarbha Industries Power Limited (VIPL), Reliance Power shares came out of the base building mode and started hitting the upper circuit. The Anil Ambani-owned Anil Dhirubhai Ambani Group (ADAG) stock turned out to be a circuit-to-circuit stock when the company board declared a board meeting date to consider and approve fundraising for the long term. Reliance Power's share price has remained one of the circuit-to-circuit stocks of the Indian stock market since 18th September 2024, logging around a 50% rise in the last eight straight sessions.On Friday last week, Anil Ambani-owned Reliance Power set a board meeting date to consider the fundraising proposal, saying, \"We wish to inform you that a meeting of the Board of Directors of the Company will be held on Thursday, October 03, 2024, inter alia, to consider and approve raising of long term resources from domestic and/or global markets, inter alia, by issue of equity shares/equity-linked securities/ warrants convertible into equity shares, by way of preferential issue and/or qualified institutional placement and/or rights issue and/or foreign currency convertible bonds or any other method including determination of issue price, if any and seeking members' and other approval(s), as the Board may deem appropriate.\"On September 17, 2024, Reliance Power declared debt settlement as guarantor on behalf of VIPL, saying, \"Reliance Power Limited (Reliance Power) today announced that the entire obligations of the Company as a Guarantor on behalf of Vidarbha Industries Power Limited (VIPL) stand fully settled resulting in release and discharge of Corporate Guarantee, Undertakings and all obligations and claims thereunder about the outstanding debt of VIPL amounting to  ₹3872.04 Crore. Reliance Power has settled all disputes with CFM Asset Reconstruction Private Limited (CFM). 100% shares of VIPL have been pledged in favour of CFM against the release and discharge of Corporate Guarantee given by Reliance Power.\"\"Reliance Power shares have been under the radar of Dalal Street bulls since the Company became debt-free on bulls on a standalone basis. However, the stock received some dent after SEBI banned Anil Ambani from the Security markets. But the Company is slowly but steadily coming out of debt and has recently announced that it will settle all its outstanding debt with CFM,\" said Avinash Gorakshkar, Head of Research at Profitmart Securities.Speaking on the technical setup regarding Reliance Power shares, Sumeet Bagadia, Executive Director at Choice Broking, said, “Reliance Power share price today is in a long-term uptrend, currently trading at  ₹46.35, which aligns with its previous high. The stock has consistently formed higher highs and higher lows over the past few months, signalling a strong bullish pattern. The recent increase in trading volume further supports this upward momentum. Buying on dips is recommended, with a positional target in the  ₹58 to  ₹62 range, offering a favourable risk-reward ratio for investors.”On the suggestion to investors regarding Reliance Power shares, Bagadia said, \"Investors who entered at lower levels may consider a prudent approach by booking partial profits at the current market price. For fresh investments, a disciplined strategy involves waiting for potential dips. Additionally, placing trailing stop-loss orders near the  ₹40 level can safeguard profits and manage risks effectively.\"So, Bagadia expects around 33% more upside from Reliance Power shares' current market price of  ₹46.35 apiece.","cleaned_content":"reliance power share anil ambani owned reliance power shares have been on an uptrend for the last eight sessions after the announcement of debt settlement as a guarantor on behalf of vidarbha industries power limited vipl reliance power shares came out of the base building mode and started hitting the upper circuit the anil ambani owned anil dhirubhai ambani group adag stock turned out to be a circuit to circuit stock when the company board declared a board meeting date to consider and approve fundraising for the long term reliance powers share price has remained one of the circuit to circuit stocks of the indian stock market since \u003cONE_TEN\u003e th september \u003cTWO_THOUSAND\u003e logging around a \u003cFIVE_TEN_PERCENT\u003e rise in the last eight straight sessions on friday last week anil ambani owned reliance power set a board meeting date to consider the fundraising proposal saying we wish to inform you that a meeting of the board of directors of the company will be held on thursday october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e inter alia to consider and approve raising of long term resources from domestic and or global markets inter alia by issue of equity shares equity linked securities warrants convertible into equity shares by way of preferential issue and or qualified institutional placement and or rights issue and or foreign currency convertible bonds or any other method including determination of issue price if any and seeking members and other approval s as the board may deem appropriate on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e reliance power declared debt settlement as guarantor on behalf of vipl saying reliance power limited reliance power today announced that the entire obligations of the company as a guarantor on behalf of vidarbha industries power limited vipl stand fully settled resulting in release and discharge of corporate guarantee undertakings and all obligations and claims thereunder about the outstanding debt of vipl amounting to \u003cTHREE_THOUSAND\u003e crore reliance power has settled all disputes with cfm asset reconstruction private limited cfm \u003cONE_HUNDRED_PERCENT\u003e shares of vipl have been pledged in favour of cfm against the release and discharge of corporate guarantee given by reliance power reliance power shares have been under the radar of dalal street bulls since the company became debt free on bulls on a standalone basis however the stock received some dent after sebi banned anil ambani from the security markets but the company is slowly but steadily coming out of debt and has recently announced that it will settle all its outstanding debt with cfm said avinash gorakshkar head of research at profitmart securities speaking on the technical setup regarding reliance power shares sumeet bagadia executive director at choice broking said reliance power share price today is in a long term uptrend currently trading at \u003cFOUR_TEN\u003e which aligns with its previous high the stock has consistently formed higher highs and higher lows over the past few months signalling a strong bullish pattern the recent increase in trading volume further supports this upward momentum buying on dips is recommended with a positional target in the \u003cFIVE_TEN\u003e to \u003cSIX_TEN\u003e range offering a favourable risk reward ratio for investors on the suggestion to investors regarding reliance power shares bagadia said investors who entered at lower levels may consider a prudent approach by booking partial profits at the current market price for fresh investments a disciplined strategy involves waiting for potential dips additionally placing trailing stop loss orders near the \u003cFOUR_TEN\u003e level can safeguard profits and manage risks effectively so bagadia expects around \u003cTHREE_TEN_PERCENT\u003e more upside from reliance power shares current market price of \u003cFOUR_TEN\u003e apiece","timestamp":"2024-09-28T14:45:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}