{"url":"https://www.livemint.com/market/stock-market-news/subam-papers-ipo-day-01-latest-gmp-subscription-status-listing-date-and-more-11727692731958.html","title":"Subam Papers IPO Day 03: Latest GMP, subscription status, listing date and more","description":"Subam Papers IPO has booked at 92.93 times on the final day of bidding. The company aims to raise  ₹93.70 crore and has an installed capacity of 140 MTPD for Duplex Board, with FY 2024 utilization at 43,963 tons.","content":"The IPO of Subam Papers, which opened for bidding on Monday, September 30, has continued to receive healthy response from investors during its final day of bidding. As of 5 p.m., the overall subscription rate was 92.93 times. The portion allocated for retail investors was subscribed at 48.97 times, while the non-institutional investor (NII) portion received bids for 243 times. The QIB portion was booked at 57.18 times, as per the exchange data.Subam Papers aims to raise  ₹93.70 crore through the IPO, which is entirely a fresh issue of 61.65 lakh shares. The price band for the offer is set between  ₹144 and  ₹152 per equity share, with a face value of  ₹10 each. The IPO lot size is fixed at 800 shares, requiring a minimum investment of  ₹1,21,600 for retail investors.The allotment for the IPO is expected to be finalised on Friday, October 4, 2024. The shares are scheduled to list on the BSE SME platform, with a tentative listing date of Tuesday, October 8, 2024.Gretex Corporate Services Limited is the bookrunning lead manager of the Subam Papers IPO, while Bigshare Services Pvt Ltd is the registrar for the issue. The market maker for Subam Papers IPO is Gretex Share Broking. The IPO is set to close on Thursday, October 3.As of today, the grey market premium (GMP) for Subam Papers IPO stands at  ₹60 per share. This suggests that the shares are anticipated to list at  ₹60 above their issue price. With this GMP and the IPO price, the estimated listing price of the shares would be  ₹212, reflecting a 23% premium over the issue price of  ₹152 per share.The grey market premium represents the expected difference between an IPO’s issue price and its anticipated listing price in the unofficial market. However, it’s important to remember that GMP is a preliminary indicator and should not be the sole factor in making investment decisions.Subam Papers specializes in the manufacturing of Kraft paper and paper products. The company began its operations in 2004 by producing paper cones and later expanded its product range to include Duplex board and Kraft paper.Instead of using wood pulp, the company primarily utilizes waste paper as its raw material for production. This approach is integral to its manufacturing of Kraft paper and Duplex board.For Duplex Board, the company had an installed capacity of 140 metric tons per day (MTPD), equivalent to an annual capacity of 47,200 tons. For the financial year ending March 31, 2024, the utilization of this capacity reached 43,963 tons.This marks a significant increase compared to previous years, where the utilization was 30,393 tons for the financial year ending March 31, 2023, and just 3,336 tons for the financial year ending March 31, 2022.At the end of FY24, the installed capacity for Kraft Paper was 300 metric tons per day (MTPD), resulting in a total annual capacity of 93,600 tons. During this period, the utilization of Kraft Paper capacity was 93,081 tons. Comparatively, in the financial years ending on March 31, 2023, and March 31, 2022, the utilization was 83,691 tons and 82,371 tons, respectively, according to the company's DRHP report.","cleaned_content":"the ipo of subam papers which opened for bidding on monday september \u003cTHREE_TEN\u003e has continued to receive healthy response from investors during its final day of bidding as of \u003cFIVE_\u003e p m the overall subscription rate was \u003cNINE_TEN\u003e times the portion allocated for retail investors was subscribed at \u003cFOUR_TEN\u003e times while the non institutional investor nii portion received bids for \u003cTWO_HUNDRED\u003e times the qib portion was booked at \u003cFIVE_TEN\u003e times as per the exchange data subam papers aims to raise \u003cNINE_TEN\u003e crore through the ipo which is entirely a fresh issue of \u003cSIX_TEN\u003e lakh shares the price band for the offer is set between \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e per equity share with a face value of \u003cONE_TEN\u003e each the ipo lot size is fixed at \u003cEIGHT_HUNDRED\u003e shares requiring a minimum investment of \u003cONE_HUNDRED_THOUSAND\u003e for retail investors the allotment for the ipo is expected to be finalised on friday october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e the shares are scheduled to list on the bse sme platform with a tentative listing date of tuesday october \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e gretex corporate services limited is the bookrunning lead manager of the subam papers ipo while bigshare services pvt ltd is the registrar for the issue the market maker for subam papers ipo is gretex share broking the ipo is set to close on thursday october \u003cTHREE_\u003e as of today the grey market premium gmp for subam papers ipo stands at \u003cSIX_TEN\u003e per share this suggests that the shares are anticipated to list at \u003cSIX_TEN\u003e above their issue price with this gmp and the ipo price the estimated listing price of the shares would be \u003cTWO_HUNDRED\u003e reflecting a \u003cTWO_TEN_PERCENT\u003e premium over the issue price of \u003cONE_HUNDRED\u003e per share the grey market premium represents the expected difference between an ipo s issue price and its anticipated listing price in the unofficial market however it s important to remember that gmp is a preliminary indicator and should not be the sole factor in making investment decisions subam papers specializes in the manufacturing of kraft paper and paper products the company began its operations in \u003cTWO_THOUSAND\u003e by producing paper cones and later expanded its product range to include duplex board and kraft paper instead of using wood pulp the company primarily utilizes waste paper as its raw material for production this approach is integral to its manufacturing of kraft paper and duplex board for duplex board the company had an installed capacity of \u003cONE_HUNDRED\u003e metric tons per day mtpd equivalent to an annual capacity of \u003cFOUR_TEN_THOUSAND\u003e tons for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the utilization of this capacity reached \u003cFOUR_TEN_THOUSAND\u003e tons this marks a significant increase compared to previous years where the utilization was \u003cTHREE_TEN_THOUSAND\u003e tons for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and just \u003cTHREE_THOUSAND\u003e tons for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e at the end of fy24 the installed capacity for kraft paper was \u003cTHREE_HUNDRED\u003e metric tons per day mtpd resulting in a total annual capacity of \u003cNINE_TEN_THOUSAND\u003e tons during this period the utilization of kraft paper capacity was \u003cNINE_TEN_THOUSAND\u003e tons comparatively in the financial years ending on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the utilization was \u003cEIGHT_TEN_THOUSAND\u003e tons and \u003cEIGHT_TEN_THOUSAND\u003e tons respectively according to the companys drhp report","timestamp":"2024-10-03T17:20:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}