{"url":"https://www.livemint.com/market/stock-market-news/avi-ansh-textile-share-price-lists-with-9-7-premium-over-the-issue-price-at-rs-68-on-the-nse-sme-11727408969580.html","title":"Avi Ansh Textile share price lists at 9.7% premium over the issue price on NSE SME","description":"Avi Ansh Textile share price was listed at around a10% premium over the issue price on the NSE SME. The IPO, which opened between September 20-24, was subscribed more than 8 times.","content":"Avi Ansh Textile share price listed with a nearly 10% premium over the issue price on Friday, September 27 at  ₹68 apiece on the NSE SME.The stock following the listing saw a slight decline of 3.57%.Avi Ansh Textile IPO, which was open between September 20-24, had garnered strong interest from investors. The IPO was subscribed more than 8 times. The retail category was subscribed 11.38 times and other categories 5.25 times.The grey market premium or GMP for Avi Ansh Textile was at  ₹2 as per investorgain.com data. This meant that the investors were anticipating Avi Ansh Textile shares to list at  ₹64, with slight listing gains of 3.24% over the issue price of  ₹62.The  ₹25.99 crore Avi Ansh Textile IPO was a fixed-price offering, with a fresh issue of 41.92 lakh shares.The company intends to use the net proceeds from the issue to fulfil the needs for working capital, repayment of term loans and general corporate purposes.The registrar for Avi Ansh Textile IPO is Skyline Financial Services Private Ltd, and the book-running lead manager is 3Dimension Capital Services Limited.Avi Ansh Textile Limited, which was incorporated in April 2005, is a producer and exporter of yarn made entirely of cotton, including carded and combed cotton yarn in different counts.Avi Ansh Textile Limited has demonstrated its commitment to environmental management and quality assurance by obtaining ISO 9001:2015 and ISO 14001:2015 certifications.In order to satisfy client demands, the company manufactures and supplies a range of yarns and textiles for both domestic and international markets.","cleaned_content":"avi ansh textile share price listed with a nearly \u003cONE_TEN_PERCENT\u003e premium over the issue price on friday september \u003cTWO_TEN\u003e at \u003cSIX_TEN\u003e apiece on the nse sme the stock following the listing saw a slight decline of \u003cTHREE_PERCENT\u003e avi ansh textile ipo which was open between september \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e had garnered strong interest from investors the ipo was subscribed more than \u003cEIGHT_\u003e times the retail category was subscribed \u003cONE_TEN\u003e times and other categories \u003cFIVE_\u003e times the grey market premium or gmp for avi ansh textile was at \u003cTWO_\u003e as per investorgain com data this meant that the investors were anticipating avi ansh textile shares to list at \u003cSIX_TEN\u003e with slight listing gains of \u003cTHREE_PERCENT\u003e over the issue price of \u003cSIX_TEN\u003e the \u003cTWO_TEN\u003e crore avi ansh textile ipo was a fixed price offering with a fresh issue of \u003cFOUR_TEN\u003e lakh shares the company intends to use the net proceeds from the issue to fulfil the needs for working capital repayment of term loans and general corporate purposes the registrar for avi ansh textile ipo is skyline financial services private ltd and the book running lead manager is \u003cTHREE_\u003e dimension capital services limited avi ansh textile limited which was incorporated in april \u003cTWO_THOUSAND\u003e is a producer and exporter of yarn made entirely of cotton including carded and combed cotton yarn in different counts avi ansh textile limited has demonstrated its commitment to environmental management and quality assurance by obtaining iso \u003cNINE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e and iso \u003cONE_TEN_THOUSAND\u003e \u003cTWO_THOUSAND\u003e certifications in order to satisfy client demands the company manufactures and supplies a range of yarns and textiles for both domestic and international markets","timestamp":"2024-09-27T10:02:00+05:30","market_timestamp":"2024-09-27T10:02:00+05:30","off_market_hours":false}