{"url":"https://www.livemint.com/market/stock-market-news/stock-market-changes-from-oct-1-nse-bse-transaction-charges-buyback-of-shares-stt-t-2-bonus-key-changes-for-investors-11727747903195.html","title":"Stock market changes from today: NSE, BSE transaction charges to buyback of shares —4 key changes for investors","description":"Stock market changes: October 1 marks a day of regulatory changes and tax implications for Indian investors. Check details on the changes","content":"Stock market changes: Effective October 1, the Indian financial markets will see significant changes. The National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) have introduced new transaction fees for brokers across various segments. Additionally, the government has implemented a new tax regime for share buybacks, taxing them as dividends. Furthermore, the securities transaction tax (STT) on Futures \u0026 Options (F\u0026O) trading has been increased. Finally, SEBI has streamlined the process of bonus share trading by introducing a T+2 framework.Both the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) announced new transaction fee structures for the cash and derivatives segments, effective October 1. For trades in the cash market, NSE will charge a fee of  ₹2.97 per lakh of traded value on each side. In equity futures, the fee will be  ₹1.73 per lakh on each side, and for equity options, it will be  ₹35.03 per lakh of premium value.On the BSE, the transaction fees for Sensex and Bankex options contracts will rise to  ₹3,250 per crore of premium turnover value. These revisions stem from a Securities and Exchange Board of India (SEBI) circular issued in July 2024 outlining new fee structures for Market Infrastructure Institutions (MIIs).Finance Minister Nirmala Sitharaman announced that income from share buybacks will now be taxed as dividends starting October 1. This shifts the tax burden from companies to shareholders, who will be taxed according to their personal income tax brackets.Previously, share buybacks were considered a tax-efficient way for companies to return money to investors.As announced by the Finance Minister earlier this year, the securities transaction tax (STT) on Futures and options (F\u0026O) trading will increase beginning October 1. The STT on futures trading will rise from 0.0125% to 0.02%, while the STT on options trading will increase to 0.1%.This hike in STT is aimed at curbing retail participation in derivatives trading, which has surged in recent times.The Securities and Exchange Board of India (SEBI) has also revised the timeline for bonus share trading. Effective October 1, shares issued through bonus schemes will be eligible for trading just two days after the record date, under the new T+2 framework.","cleaned_content":"stock market changes effective october \u003cONE_\u003e the indian financial markets will see significant changes the national stock exchange nse and bombay stock exchange bse have introduced new transaction fees for brokers across various segments additionally the government has implemented a new tax regime for share buybacks taxing them as dividends furthermore the securities transaction tax stt on futures options f o trading has been increased finally sebi has streamlined the process of bonus share trading by introducing a t \u003cTWO_\u003e framework both the national stock exchange nse and bombay stock exchange bse announced new transaction fee structures for the cash and derivatives segments effective october \u003cONE_\u003e for trades in the cash market nse will charge a fee of \u003cTWO_\u003e per lakh of traded value on each side in equity futures the fee will be \u003cONE_\u003e per lakh on each side and for equity options it will be \u003cTHREE_TEN\u003e per lakh of premium value on the bse the transaction fees for sensex and bankex options contracts will rise to \u003cTHREE_THOUSAND\u003e per crore of premium turnover value these revisions stem from a securities and exchange board of india sebi circular issued in july \u003cTWO_THOUSAND\u003e outlining new fee structures for market infrastructure institutions miis finance minister nirmala sitharaman announced that income from share buybacks will now be taxed as dividends starting october \u003cONE_\u003e this shifts the tax burden from companies to shareholders who will be taxed according to their personal income tax brackets previously share buybacks were considered a tax efficient way for companies to return money to investors as announced by the finance minister earlier this year the securities transaction tax stt on futures and options f o trading will increase beginning october \u003cONE_\u003e the stt on futures trading will rise from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e while the stt on options trading will increase to \u003cZERO_PERCENT\u003e this hike in stt is aimed at curbing retail participation in derivatives trading which has surged in recent times the securities and exchange board of india sebi has also revised the timeline for bonus share trading effective october \u003cONE_\u003e shares issued through bonus schemes will be eligible for trading just two days after the record date under the new t \u003cTWO_\u003e framework","timestamp":"2024-10-01T08:04:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}