{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-osho-krishan-of-angel-one-suggests-buying-coal-india-exide-industries-in-a-weak-market-today-11727928804083.html","title":"Stocks to buy or sell: Osho Krishan of Angel One suggests buying Coal India, Exide Industries in a weak market today","description":"Stocks to buy or sell: Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives of Angel One, recommends buying - Coal India Ltd, and Exide Industries Ltd.","content":"Stock Market News: In early trade on Thursday, the Nifty 50 and Sensex, the domestic benchmark indices, started on a lower note due to losses in most sectors, as investors expressed concerns about an increase in the Middle East conflict. Furthermore, selling pressure increased following the SEBI regulation on F\u0026O.The Nifty 50 and Sensex experienced a notable decline in their opening on Thursday. The Nifty 50 index started at 25,452.85, showing a decrease of 1.33% or 344 points, whereas the Sensex commenced at 83,002.09 points, indicating a drop of 1,264.20 points or 1.50%.During the initial stages, 12 out of the 13 main sectoral indexes saw a decrease, with real estate and auto stocks leading the losses.Experts noted that global markets are undergoing a shift due to the Fed rate cuts announcement, increasing geopolitical tensions, and foreign investors pulling funds out of Indian markets to invest in other markets like China, all contributing to the selling pressure.Nifty 50 Outlook by Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives, Angel OneNifty 50 navigated through a mixed trading session, experiencing a slight dip below 25,800. Despite an initial surge, the key indices saw limited movement, indicating a cautious approach from traders ahead of the mid-week holiday. This session resulted in a doji formation on the daily chart, reflecting some uncertainty. Considering the recent sell-off and the new sell signal by RSI smoothed with its average line, we are maintaining a vigilant outlook. The next critical support level for the index is anticipated around 25,600–25,500, aligning with the 20-EMA. On the upside, 26,000–26,150 continues to pose a significant resistance zone.Traders should consider reducing long positions during any rebound and exercise caution when taking aggressive long positions unless there are clearer signs of strength. It is also important to stay vigilant and closely monitor global factors, as they will significantly influence market trends.On stocks to buy on Thursday, Osho Krishan recommended two stocks - Coal India Ltd, and Exide Industries Ltd.Coal India has undergone a notable correction from its peak at 544 towards the 100 DEMA on the daily chart. Over the past few sessions, it has demonstrated a consolidation breakout with increasing momentum and has now surpassed all of its major EMAs on the daily timeframe chart. The MACD indicator has shown a positive crossover from the lower zone, indicating a potential reversal in the current trend.Hence, we recommend to BUY Coal India around  ₹502-500, keeping a stop loss of  ₹484 for a potential Target of  ₹528.Exide Industries has demonstrated robust momentum in recent trading sessions, surpassing all major EMAs on the daily chart. The substantial increase in trading volumes suggests a potential reversal in the stock's trend. Moreover, the sloping trendline breakout and nearby support of the clustered EMAs is poised to offer substantial support during any downward movement. Additionally, from a technical standpoint, most indicators suggest a reversal and continuation of the upward trend.Hence, we recommend to BUY Exide Industries around  ₹505-500, keeping a stop loss of  ₹480 for a potential Target of  ₹545.","cleaned_content":"stock market news in early trade on thursday the nifty \u003cFIVE_TEN\u003e and sensex the domestic benchmark indices started on a lower note due to losses in most sectors as investors expressed concerns about an increase in the middle east conflict furthermore selling pressure increased following the sebi regulation on f o the nifty \u003cFIVE_TEN\u003e and sensex experienced a notable decline in their opening on thursday the nifty \u003cFIVE_TEN\u003e index started at \u003cTWO_TEN_THOUSAND\u003e showing a decrease of \u003cONE_PERCENT\u003e or \u003cTHREE_HUNDRED\u003e points whereas the sensex commenced at \u003cEIGHT_TEN_THOUSAND\u003e points indicating a drop of \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e during the initial stages \u003cONE_TEN\u003e out of the \u003cONE_TEN\u003e main sectoral indexes saw a decrease with real estate and auto stocks leading the losses experts noted that global markets are undergoing a shift due to the fed rate cuts announcement increasing geopolitical tensions and foreign investors pulling funds out of indian markets to invest in other markets like china all contributing to the selling pressure nifty \u003cFIVE_TEN\u003e outlook by osho krishan sr analyst technical derivatives angel onenifty \u003cFIVE_TEN\u003e navigated through a mixed trading session experiencing a slight dip below \u003cTWO_TEN_THOUSAND\u003e despite an initial surge the key indices saw limited movement indicating a cautious approach from traders ahead of the mid week holiday this session resulted in a doji formation on the daily chart reflecting some uncertainty considering the recent sell off and the new sell signal by rsi smoothed with its average line we are maintaining a vigilant outlook the next critical support level for the index is anticipated around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e aligning with the \u003cTWO_TEN\u003e ema on the upside \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e continues to pose a significant resistance zone traders should consider reducing long positions during any rebound and exercise caution when taking aggressive long positions unless there are clearer signs of strength it is also important to stay vigilant and closely monitor global factors as they will significantly influence market trends on stocks to buy on thursday osho krishan recommended two stocks coal india ltd and exide industries ltd coal india has undergone a notable correction from its peak at \u003cFIVE_HUNDRED\u003e towards the \u003cONE_HUNDRED\u003e dema on the daily chart over the past few sessions it has demonstrated a consolidation breakout with increasing momentum and has now surpassed all of its major emas on the daily timeframe chart the macd indicator has shown a positive crossover from the lower zone indicating a potential reversal in the current trend hence we recommend to buy coal india around \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e keeping a stop loss of \u003cFOUR_HUNDRED\u003e for a potential target of \u003cFIVE_HUNDRED\u003e exide industries has demonstrated robust momentum in recent trading sessions surpassing all major emas on the daily chart the substantial increase in trading volumes suggests a potential reversal in the stocks trend moreover the sloping trendline breakout and nearby support of the clustered emas is poised to offer substantial support during any downward movement additionally from a technical standpoint most indicators suggest a reversal and continuation of the upward trend hence we recommend to buy exide industries around \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e keeping a stop loss of \u003cFOUR_HUNDRED\u003e for a potential target of \u003cFIVE_HUNDRED\u003e","timestamp":"2024-10-03T10:14:00+05:30","market_timestamp":"2024-10-03T10:14:00+05:30","off_market_hours":false}