{"url":"https://www.livemint.com/market/stock-market-news/hudco-reliance-home-finance-rate-cuts-government-policies-put-housing-finance-sector-in-a-sweet-spot-say-experts-11727256915020.html","title":"Rate cuts, government policies put housing finance sector in a sweet spot, say experts","description":"India's affordable housing sector is thriving due to urbanisation, supportive policies, and accessible financing. Stocks of housing finance companies have surged, and upcoming RBI rate cuts could further stimulate demand for affordable housing, making it a key area for investment.","content":"India's affordable housing sector is riding a wave of positive momentum, driven by rapid urbanisation, supportive government policies, and accessible financing options. These factors are set to create a promising environment for companies specialising in affordable housing finance.According to equity research platform Trendlyne, shares of some of the housing finance companies, such as HUDCO, Reliance Home Finance and Mehta Housing Finance have surged over 150-170 per cent over the last year. Stocks such as Manraj Housing Finance and Bajaj Housing Finance have surged 120 per cent. stocks such as Aadhar Housing Finance, Home First Finance Company and India Shelter Finance have jumped between 50-60 per cent.The housing finance sector appears to be in a sweet spot due to demographic trends, rapid urbanisation, and favourable government policies. Another key catalyst is the start of the rate reduction cycle. After the US Fed, the Reserve Bank of India (RBI) is expected to start cutting rates from October as inflation has eased significantly.\"The government continues to focus on the affordable housing sector and announced various incentives in the last budget under the PMAY program. It will further benefit from the interest rate cut, expected in the coming months, especially now that the US has initiated the rate cut cycle,\" said Sneha Poddar, VP - Research, Wealth Management, Motilal Oswal Financial Services.Poddar prefers PNB Housing Finance in this space as the company is expected to benefit from better loan growth, the expansion of spreads/margin, and the introduction of the PMAY CLSS (credit-linked subsidy scheme) scheme announced in the Union Budget 2024.\"The emerging and affordable segments contributed nearly 33 per cent of the retail disbursements in Q1FY25. The management guided that nearly 40-42 per cent of the incremental disbursements in FY25 will come from these two segments. We believe that risk-reward is favourable for a re-rating in the valuation multiple as investors gain higher confidence in the company’s sustained execution in retail (across prime, emerging and affordable) segment,\" said Poddar.Amit Goel, the co-founder and chief global strategist at Pace 360, underscored that rapid urbanisation has led to a significant increase in demand for affordable public housing in recent years. The rapid migration of people to urban areas has increased the demand for affordable housing, especially in tier-2 and tier-3 cities.The government has launched various policies and schemes to promote affordable housing, including the Pradhan Mantri Awas Yojana (PMAY). The growing economy has increased disposable incomes, enabling more people to afford their own homes.The upcoming rate cuts by the RBI could further boost the housing finance sector.\"The upcoming rate cuts from the RBI could stimulate the sector by making loans cheaper, thus encouraging both homebuyers and developers. Lower mortgage rates can make homeownership more accessible. Also, developers may find it cheaper to finance new projects, leading to more affordable housing units being built. Moreover, a favourable rate environment can attract domestic and foreign investment in the housing sector,\" said Goel.Trivesh D, COO at Tradejini, believes due to the significant income disparity across the country, affordable housing in India is on a strong growth trajectory.\"While the demand for luxury homes has surged post-COVID, affordable housing remains a key focus, especially with the government actively promoting affordable projects and urban redevelopment. With the rise of small and medium REITs, commercial and residential real estate interest is expected to climb even further,\" said Trivesh.However, some experts are cautious as they believe more government measures are required to boost the sector amid rising raw-material costs and skyrocketing land prices.\"Despite the ambitious PMAY scheme, we currently have a cautious stance on the affordable housing segment as we believe that the segment needs a fillip from the government regarding special schemes and incentives for a meaningful recovery. The rising cost of raw materials, increasing land cost and outdated definition of affordable homes, especially for metros, are the major predicaments which are making developers shy away from the affordable housing segment,\" said Manish Chowdhury, the head of research at StoxBox.Chowdhury believes that revising the size and price of the affordable housing bracket based on specific city dynamics is crucial for reviving the segment's fortunes.\"We believe that incentives on the taxation front for homebuyers, subsidies to developers and industry status to the segment would be important triggers for garnering interest in the overall affordable housing sector going ahead,\" said Chowdhury.Read all market-related news here","cleaned_content":"indias affordable housing sector is riding a wave of positive momentum driven by rapid urbanisation supportive government policies and accessible financing options these factors are set to create a promising environment for companies specialising in affordable housing finance according to equity research platform trendlyne shares of some of the housing finance companies such as hudco reliance home finance and mehta housing finance have surged over \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED_PERCENT\u003e over the last year stocks such as manraj housing finance and bajaj housing finance have surged \u003cONE_HUNDRED_PERCENT\u003e stocks such as aadhar housing finance home first finance company and india shelter finance have jumped between \u003cFIVE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e the housing finance sector appears to be in a sweet spot due to demographic trends rapid urbanisation and favourable government policies another key catalyst is the start of the rate reduction cycle after the us fed the reserve bank of india rbi is expected to start cutting rates from october as inflation has eased significantly the government continues to focus on the affordable housing sector and announced various incentives in the last budget under the pmay program it will further benefit from the interest rate cut expected in the coming months especially now that the us has initiated the rate cut cycle said sneha poddar vp research wealth management motilal oswal financial services poddar prefers pnb housing finance in this space as the company is expected to benefit from better loan growth the expansion of spreads margin and the introduction of the pmay clss credit linked subsidy scheme scheme announced in the union budget \u003cTWO_THOUSAND\u003e the emerging and affordable segments contributed nearly \u003cTHREE_TEN_PERCENT\u003e of the retail disbursements in q1fy25 the management guided that nearly \u003cFOUR_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e of the incremental disbursements in fy25 will come from these two segments we believe that risk reward is favourable for a re rating in the valuation multiple as investors gain higher confidence in the company s sustained execution in retail across prime emerging and affordable segment said poddar amit goel the co founder and chief global strategist at pace \u003cTHREE_HUNDRED\u003e underscored that rapid urbanisation has led to a significant increase in demand for affordable public housing in recent years the rapid migration of people to urban areas has increased the demand for affordable housing especially in tier \u003cTWO_\u003e and tier \u003cTHREE_\u003e cities the government has launched various policies and schemes to promote affordable housing including the pradhan mantri awas yojana pmay the growing economy has increased disposable incomes enabling more people to afford their own homes the upcoming rate cuts by the rbi could further boost the housing finance sector the upcoming rate cuts from the rbi could stimulate the sector by making loans cheaper thus encouraging both homebuyers and developers lower mortgage rates can make homeownership more accessible also developers may find it cheaper to finance new projects leading to more affordable housing units being built moreover a favourable rate environment can attract domestic and foreign investment in the housing sector said goel trivesh d coo at tradejini believes due to the significant income disparity across the country affordable housing in india is on a strong growth trajectory while the demand for luxury homes has surged post covid affordable housing remains a key focus especially with the government actively promoting affordable projects and urban redevelopment with the rise of small and medium reits commercial and residential real estate interest is expected to climb even further said trivesh however some experts are cautious as they believe more government measures are required to boost the sector amid rising raw material costs and skyrocketing land prices despite the ambitious pmay scheme we currently have a cautious stance on the affordable housing segment as we believe that the segment needs a fillip from the government regarding special schemes and incentives for a meaningful recovery the rising cost of raw materials increasing land cost and outdated definition of affordable homes especially for metros are the major predicaments which are making developers shy away from the affordable housing segment said manish chowdhury the head of research at stoxbox chowdhury believes that revising the size and price of the affordable housing bracket based on specific city dynamics is crucial for reviving the segments fortunes we believe that incentives on the taxation front for homebuyers subsidies to developers and industry status to the segment would be important triggers for garnering interest in the overall affordable housing sector going ahead said chowdhury read all market related news here","timestamp":"2024-09-25T15:14:00+05:30","market_timestamp":"2024-09-25T15:14:00+05:30","off_market_hours":false}