{"url":"https://www.livemint.com/market/stock-market-news/sebis-uniform-fee-rules-today-check-revised-rates-for-cash-and-equity-f-o-of-nse-bse-11727745298289.html","title":"Sebi’s uniform fee rules come into effect today! Check revised rates for cash and equity F\u0026O of NSE, BSE","description":"The NSE and the BSE are implementing revised transaction charges today, aligning with Sebi's mandate for uniformity. By replacing the old slab-based fee structure with equal rates, the changes aim to enhance transparency and ensure fair access for all market participants.","content":"The revised transaction charges, introduced by the National Stock Exchange (NSE) and the BSE, will come into effect today. The new rates on cash, equity futures and options, and currency derivatives align with the Securities and Exchanges Board of India (Sebi) circular mandating market infrastructure institutions (MII), including stock exchanges, to impose equal and uniform transaction charges.In July, Sebi issued a circular to revise the old slab-wise charge structure to ensure transparency and provide equal and fair access to all market participants. “The MII charges which are to be recovered from the end clients should be True to Label, ie if certain MII charge is levied on the end client by members (ie stock brokers, depository participants, and clearing members),” said SEBi in its circular dated 1 July 2024. It is the onus of MIIs to ensure that the charges levied by the members should be the same as the amount received by them.The NSE and the BSE announced a revision of their transaction fees for cash, equity futures and options, and currency derivatives on Friday. Here are the details of the new rates, which will come into effect on Tuesday, 1 October.The new transaction rates will replace the diverse slab-based fees currently imposed by various stock exchanges according to volume or activity. The older rates allowed brokers and other transaction members to earn through size—or activity-based advantages from clients, which means they could benefit from the difference between lower transaction charges paid to the exchanges (because of high trading volumes) and the charges passed on to clients (higher in value).For example, brokers could charge investors  ₹49.5 per lakh of premium value or equity options, even when they paid a lower amount of  ₹29.50 for the same transaction because of higher transaction volume. The recent adjustment in rate will cut these advantages among members and promote transparency for end clients.","cleaned_content":"the revised transaction charges introduced by the national stock exchange nse and the bse will come into effect today the new rates on cash equity futures and options and currency derivatives align with the securities and exchanges board of india sebi circular mandating market infrastructure institutions mii including stock exchanges to impose equal and uniform transaction charges in july sebi issued a circular to revise the old slab wise charge structure to ensure transparency and provide equal and fair access to all market participants the mii charges which are to be recovered from the end clients should be true to label ie if certain mii charge is levied on the end client by members ie stock brokers depository participants and clearing members said sebi in its circular dated \u003cONE_\u003e july \u003cTWO_THOUSAND\u003e it is the onus of miis to ensure that the charges levied by the members should be the same as the amount received by them the nse and the bse announced a revision of their transaction fees for cash equity futures and options and currency derivatives on friday here are the details of the new rates which will come into effect on tuesday \u003cONE_\u003e october the new transaction rates will replace the diverse slab based fees currently imposed by various stock exchanges according to volume or activity the older rates allowed brokers and other transaction members to earn through size or activity based advantages from clients which means they could benefit from the difference between lower transaction charges paid to the exchanges because of high trading volumes and the charges passed on to clients higher in value for example brokers could charge investors \u003cFOUR_TEN\u003e per lakh of premium value or equity options even when they paid a lower amount of \u003cTWO_TEN\u003e for the same transaction because of higher transaction volume the recent adjustment in rate will cut these advantages among members and promote transparency for end clients","timestamp":"2024-10-01T07:47:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}