{"url":"https://www.livemint.com/market/stock-market-news/zomato-share-price-up-369-in-2-years-should-you-buy-more-or-book-profit-heres-what-experts-say-11727092554163.html","title":"Zomato share price up 369% in 2 years. Should you buy more or book profit? Here’s what experts say","description":"Zomato share price has seen solid gains over the last two years, driven by strong earnings and positive broker outlooks. The stock has surged 369% in two years, aided by growth in its quick commerce and ticketing ventures. Experts predict continued long-term gains.","content":"Zomato share price climbed 2.5 per cent to hit a fresh all-time high of  ₹298.05 in intraday trade on BSE on Monday, September 23. The stock finally closed 2.13 per cent higher at  ₹296.90, extending gains into the fourth consecutive session.The stock has skyrocketed by an impressive 369 per cent over the past two years, with nearly 200 per cent of that surge happening in just the last year alone. The stock has stayed in the green every month since April last year, with May 2024 being the only exception to its steady climb.In the last few months, several global brokerage firms, including JPMorgan, CLSA, and Jefferies, raised their target prices for the stock and expressed their positive views on its quick commerce business Blinkit. Moreover, the company's foray into the movie and events ticketing business as it acquired Paytm's business in the segment will add a new revenue stream for the company.From food delivery to quick commerce to movie tickets, Zomato is expanding its business, impressing experts and investors.Its earnings growth in the last few quarters has also been remarkable. Beating Street's estimates, the company's net profit jumped to  ₹253 crore in Q1FY25, from  ₹2 crore a year ago, driven by higher gross order value across its food delivery, quick commerce, and going-out verticals. Its consolidated revenue for the quarter came at  ₹4,442 crore compared to  ₹2,597 crore a year earlier.The quick commerce vertical led the growth with a 130 per cent increase in gross order value (GOV), while the food delivery and going-out verticals grew by 27 per cent and 106 per cent, respectively.\"The turnaround of Zomato stock could be attributed to strong earnings growth, positive momentum and optimism among investors. Its gross order value (GOV) has also shown impressive growth, followed by its mergers and acquisitions and profitability in its quick commerce segment Blinkit, which has scaled up well,\" said Atul Parakh, the CEO of Bigul.Experts are positive about the stock for the medium to long term. They expect Zomato's revenue and profitability to improve, with significant contributions from Blinkit and its newly acquired ticketing business.\"Blinkit offers a good opportunity to participate in the disruption of industries, viz. retail, grocery and e-commerce. Recently, Zomato acquired a ticketing business, which is expected to add  ₹230 crore to FY24 revenue, with a nearly 12 per cent take rate. Zomato's vision of creating strong brands across food delivery, grocery, and going-out could make it a formidable platform that could command a high wallet share from urban consumers. With Blinkit’s growth, Zomato is positioned for robust long-term growth,\" said Sneha Poddar, VP of Research, Wealth Management at Motilal Oswal Financial Services.In a report on September 23, Kotak Institutional Equities upgraded FY24-27E Blinkit GMV CAGR to 81 per cent and maintained a buy call on Zomato stock but revised the fair value to  ₹315 from  ₹270 earlier.Kotak pointed out that Blinkit’s rapid expansion to new cities is a strategy to attract first-time users and better utilise its mother warehouses.\"Several new initiatives are underway to increase customer wallet share: (1) pilot for product returns, especially for branded apparel; (2) larger dark stores and split shipments; and (3) new category addition,\" said Kotak.\"With Blinkit adding larger stores and expanding to new cities aggressively, we upgrade our GMV CAGR forecast to 81 per cent over FY2024-27 from 70 per cent earlier. With fairly limited delivery fees currently, we believe there is some potential to monetise customers in the event of adverse regulation on delivery rider payment. Adverse regulatory developments and competitive dynamics are the key risks to our call,\" Kotak said.According to Ajit Mishra, SVP of Research at Religare Broking, the stock has recently broken out of a month-long consolidation phase and is expected to sustain its upward momentum.\"Traders can maintain a positive outlook, with a stop loss at  ₹280 and a potential target of  ₹320 in the near term,\" said Mishra.Investors' strategy for Zomato should depend on their risk appetite and investment goal.Experts say the stock is poised for gains in the long term; however, considering its steep rise in recent times, one may consider booking some profit. Those who want to buy should wait for some correction in the stock price.Technical experts are largely positive about the stock, but they pointed out that its recent rise has placed it in the overbought zone, and the counter could see some profit-booking in the near term.Mandar Bhojane, a derivative analyst at Choice Broking, underscored that the stock has recently broken out of a daily range with a significant increase in trading volume, signalling a potential breakout.\"If the price manages to close above the  ₹295 level, it may target  ₹320 and  ₹360 in the short term. Immediate support is at  ₹275, presenting an opportunity to buy on dips,\" said Bhojane.\"The Relative Strength Index (RSI) stands at 69.2 and is trending upward, indicating increased buying momentum. For prudent risk management, a stop loss should be placed at  ₹260 to safeguard against an unexpected market reversal. After such a significant rally, investors might consider booking profits at these levels to lock in gains,\" Bhojane said.Jigar S. Patel, Senior Manager of Equity Research at Anand Rathi Share and Stock Brokers, recommends avoiding a fresh buy at this juncture.Patel highlighted that at this point, Zomato appears to be highly overextended because it is trading significantly above all key exponential moving averages (EMAs), such as the 20, 50, 100, and 200-day EMAs.\"This indicates that the stock's price has surged well beyond its typical trend, suggesting that it may be due for a mean reversion, where the price could pull back to align more closely with its average levels. Such a deviation makes the stock more susceptible to a correction. Therefore, investors are advised to avoid taking new long positions at the moment, as the risk of a downward correction is heightened. For those who have already bought, it’s recommended to set a stop loss at  ₹286 on a daily closing basis,\" said Patel.Read all market-related news here","cleaned_content":"zomato share price climbed \u003cTWO_PERCENT\u003e to hit a fresh all time high of \u003cTWO_HUNDRED\u003e in intraday trade on bse on monday september \u003cTWO_TEN\u003e the stock finally closed \u003cTWO_PERCENT\u003e higher at \u003cTWO_HUNDRED\u003e extending gains into the fourth consecutive session the stock has skyrocketed by an impressive \u003cTHREE_HUNDRED_PERCENT\u003e over the past two years with nearly \u003cTWO_HUNDRED_PERCENT\u003e of that surge happening in just the last year alone the stock has stayed in the green every month since april last year with may \u003cTWO_THOUSAND\u003e being the only exception to its steady climb in the last few months several global brokerage firms including jpmorgan clsa and jefferies raised their target prices for the stock and expressed their positive views on its quick commerce business blinkit moreover the companys foray into the movie and events ticketing business as it acquired paytms business in the segment will add a new revenue stream for the company from food delivery to quick commerce to movie tickets zomato is expanding its business impressing experts and investors its earnings growth in the last few quarters has also been remarkable beating streets estimates the companys net profit jumped to \u003cTWO_HUNDRED\u003e crore in q1fy25 from \u003cTWO_\u003e crore a year ago driven by higher gross order value across its food delivery quick commerce and going out verticals its consolidated revenue for the quarter came at \u003cFOUR_THOUSAND\u003e crore compared to \u003cTWO_THOUSAND\u003e crore a year earlier the quick commerce vertical led the growth with a \u003cONE_HUNDRED_PERCENT\u003e increase in gross order value gov while the food delivery and going out verticals grew by \u003cTWO_TEN_PERCENT\u003e and \u003cONE_HUNDRED_PERCENT\u003e respectively the turnaround of zomato stock could be attributed to strong earnings growth positive momentum and optimism among investors its gross order value gov has also shown impressive growth followed by its mergers and acquisitions and profitability in its quick commerce segment blinkit which has scaled up well said atul parakh the ceo of bigul experts are positive about the stock for the medium to long term they expect zomatos revenue and profitability to improve with significant contributions from blinkit and its newly acquired ticketing business blinkit offers a good opportunity to participate in the disruption of industries viz retail grocery and e commerce recently zomato acquired a ticketing business which is expected to add \u003cTWO_HUNDRED\u003e crore to fy24 revenue with a nearly \u003cONE_TEN_PERCENT\u003e take rate zomatos vision of creating strong brands across food delivery grocery and going out could make it a formidable platform that could command a high wallet share from urban consumers with blinkit s growth zomato is positioned for robust long term growth said sneha poddar vp of research wealth management at motilal oswal financial services in a report on september \u003cTWO_TEN\u003e kotak institutional equities upgraded fy24 \u003cTWO_TEN\u003e e blinkit gmv cagr to \u003cEIGHT_TEN_PERCENT\u003e and maintained a buy call on zomato stock but revised the fair value to \u003cTHREE_HUNDRED\u003e from \u003cTWO_HUNDRED\u003e earlier kotak pointed out that blinkit s rapid expansion to new cities is a strategy to attract first time users and better utilise its mother warehouses several new initiatives are underway to increase customer wallet share \u003cONE_\u003e pilot for product returns especially for branded apparel \u003cTWO_\u003e larger dark stores and split shipments and \u003cTHREE_\u003e new category addition said kotak with blinkit adding larger stores and expanding to new cities aggressively we upgrade our gmv cagr forecast to \u003cEIGHT_TEN_PERCENT\u003e over fy2024 \u003cTWO_TEN\u003e from \u003cSEVEN_TEN_PERCENT\u003e earlier with fairly limited delivery fees currently we believe there is some potential to monetise customers in the event of adverse regulation on delivery rider payment adverse regulatory developments and competitive dynamics are the key risks to our call kotak said according to ajit mishra svp of research at religare broking the stock has recently broken out of a month long consolidation phase and is expected to sustain its upward momentum traders can maintain a positive outlook with a stop loss at \u003cTWO_HUNDRED\u003e and a potential target of \u003cTHREE_HUNDRED\u003e in the near term said mishra investors strategy for zomato should depend on their risk appetite and investment goal experts say the stock is poised for gains in the long term however considering its steep rise in recent times one may consider booking some profit those who want to buy should wait for some correction in the stock price technical experts are largely positive about the stock but they pointed out that its recent rise has placed it in the overbought zone and the counter could see some profit booking in the near term mandar bhojane a derivative analyst at choice broking underscored that the stock has recently broken out of a daily range with a significant increase in trading volume signalling a potential breakout if the price manages to close above the \u003cTWO_HUNDRED\u003e level it may target \u003cTHREE_HUNDRED\u003e and \u003cTHREE_HUNDRED\u003e in the short term immediate support is at \u003cTWO_HUNDRED\u003e presenting an opportunity to buy on dips said bhojane the relative strength index rsi stands at \u003cSIX_TEN\u003e and is trending upward indicating increased buying momentum for prudent risk management a stop loss should be placed at \u003cTWO_HUNDRED\u003e to safeguard against an unexpected market reversal after such a significant rally investors might consider booking profits at these levels to lock in gains bhojane said jigar s patel senior manager of equity research at anand rathi share and stock brokers recommends avoiding a fresh buy at this juncture patel highlighted that at this point zomato appears to be highly overextended because it is trading significantly above all key exponential moving averages emas such as the \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day emas this indicates that the stocks price has surged well beyond its typical trend suggesting that it may be due for a mean reversion where the price could pull back to align more closely with its average levels such a deviation makes the stock more susceptible to a correction therefore investors are advised to avoid taking new long positions at the moment as the risk of a downward correction is heightened for those who have already bought it s recommended to set a stop loss at \u003cTWO_HUNDRED\u003e on a daily closing basis said patel read all market related news here","timestamp":"2024-09-23T17:56:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}