{"url":"https://www.livemint.com/market/stock-market-news/techera-engineering-ipo-day-1-issue-fully-booked-retail-portion-sees-good-demand-11727261841310.html","title":"TechEra Engineering IPO booked at 70 times on final day, NII portion subscribed 128 times","description":"The offering has been subscribed 70 times, with strong demand from non-institutional investors. The company aims to raise  ₹35.90 crore through the IPO, which is entirely a fresh issue of 43.78 lakh shares","content":"The initial public offering (IPO) of TechEra Engineering (India) Limited continued to witness a strong response from all section of investors during the final day of bidding, with a strong response from the NII segment. By 6 pm, the IPO had received bids for 20,32,44,800 shares, against a total offering of 29,12,000 shares, achieving an overall subscription rate of 70 times, according to data from Chittorgarh.The retail investors' segment was subscribed 66.52 times, while the non-institutional buyers' portion saw a 128 times subscription. The QIB portion booked at 31.22 times.The company aims to raise  ₹35.90 crore through the IPO, which is entirely a fresh issue of 43.78 lakh shares. The price band for the offer is set between  ₹75 and  ₹82 per equity share, with a face value of  ₹10 each.The allotment for the IPO is expected to be finalised on Thursday, September 30, 2024. The shares are scheduled to list on the NSE SME platform, with a tentative listing date of Thursday, October 3, 2024. SKI Capital Services Limited is the book-running lead manager of the TechEra Engineering IPO, while Kfin Technologies Limited is the registrar for the issue.The company plans to utilise the net proceeds for several key purposes. These include funding capital expenditures for the acquisition of new machinery, addressing its working capital requirements, and prepaying or repaying a portion of certain outstanding borrowings. Additionally, the proceeds will be allocated towards general corporate purposes and covering issue-related expenses.The company engages in the design, manufacture, and supply of precision tooling, components for the aerospace and defence industries, and automation system solutions. Its portfolio includes assembly toolings, jigs, fixtures, maintenance, repair, and overhaul (MRO) toolings, ground support equipment, and precision machined components. It utilises advanced manufacturing technologies, such as 5-axis machining and 3-D modelling for design visualisation, to meet the requirements of its target sectors.The company has participated in notable projects, including the manufacture of tooling for the commercial aircraft vertical fin assembly line and fighter wing skin layup tool, indicating its capability to execute complex engineering projects, as per the company's DRHP filing.The grey market premium (GMP) for TechEra Engineering’s IPO is currently  ₹20 per share, indicating that the shares may list at  ₹20 above the issue price. Given the IPO's issue price of  ₹82 per share, this suggests an estimated listing price of around  ₹102, representing a 24.4 per cent premium.GMP represents the difference between the issue price and the anticipated listing price in the unofficial market, offering insight into investor demand and sentiment ahead of the stock's official trading debut. However, it's crucial to remember that GMP is a preliminary estimate and should not be the sole factor in making investment decisions.","cleaned_content":"the initial public offering ipo of techera engineering india limited continued to witness a strong response from all section of investors during the final day of bidding with a strong response from the nii segment by \u003cSIX_\u003e pm the ipo had received bids for \u003cTWO_HUNDRED_MILLION\u003e shares against a total offering of \u003cTWO_MILLION\u003e shares achieving an overall subscription rate of \u003cSEVEN_TEN\u003e times according to data from chittorgarh the retail investors segment was subscribed \u003cSIX_TEN\u003e times while the non institutional buyers portion saw a \u003cONE_HUNDRED\u003e times subscription the qib portion booked at \u003cTHREE_TEN\u003e times the company aims to raise \u003cTHREE_TEN\u003e crore through the ipo which is entirely a fresh issue of \u003cFOUR_TEN\u003e lakh shares the price band for the offer is set between \u003cSEVEN_TEN\u003e and \u003cEIGHT_TEN\u003e per equity share with a face value of \u003cONE_TEN\u003e each the allotment for the ipo is expected to be finalised on thursday september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the shares are scheduled to list on the nse sme platform with a tentative listing date of thursday october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e ski capital services limited is the book running lead manager of the techera engineering ipo while kfin technologies limited is the registrar for the issue the company plans to utilise the net proceeds for several key purposes these include funding capital expenditures for the acquisition of new machinery addressing its working capital requirements and prepaying or repaying a portion of certain outstanding borrowings additionally the proceeds will be allocated towards general corporate purposes and covering issue related expenses the company engages in the design manufacture and supply of precision tooling components for the aerospace and defence industries and automation system solutions its portfolio includes assembly toolings jigs fixtures maintenance repair and overhaul mro toolings ground support equipment and precision machined components it utilises advanced manufacturing technologies such as \u003cFIVE_\u003e axis machining and \u003cTHREE_\u003e d modelling for design visualisation to meet the requirements of its target sectors the company has participated in notable projects including the manufacture of tooling for the commercial aircraft vertical fin assembly line and fighter wing skin layup tool indicating its capability to execute complex engineering projects as per the companys drhp filing the grey market premium gmp for techera engineering s ipo is currently \u003cTWO_TEN\u003e per share indicating that the shares may list at \u003cTWO_TEN\u003e above the issue price given the ipos issue price of \u003cEIGHT_TEN\u003e per share this suggests an estimated listing price of around \u003cONE_HUNDRED\u003e representing a \u003cTWO_TEN_PERCENT\u003e premium gmp represents the difference between the issue price and the anticipated listing price in the unofficial market offering insight into investor demand and sentiment ahead of the stocks official trading debut however its crucial to remember that gmp is a preliminary estimate and should not be the sole factor in making investment decisions","timestamp":"2024-09-27T18:00:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}