{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-ends-above-26-000-sensex-settles-over-85000-11727254496069.html","title":"Stock market today: Nifty 50 ends above 26,000, Sensex settles over 85,000 in ongoing rally","description":"Notably, five stocks—Power Grid Corporation, NTPC, Bajaj Finserv, M\u0026M, and Hindalco Industries—reached new one-year highs today.","content":"The bulls are showing no signs of backing down. Despite a weak start, they staged a strong comeback in the final hour of trading today. This resurgence has driven both the Nifty 50 and the Sensex to hit new milestones, marking their fifth consecutive session of gains.The Nifty 50 surged by 0.35 percent, reaching a fresh record high of 26,032 points in trade before closing with a gain of 0.25 percent at 26,004 points. This marks the first time the index has closed above the 26,000 level.Likewise, the S\u0026P BSE Sensex reached a new all-time high of 85,247 points, rising by 0.34 percent. It closed the session above the 85,000 level for the first time, settling at 85,169 points, which represents a 0.30 percent increase from the previous closing price.The significant rally in the last hour of trading was driven by Power Grid Corporation, Axis Bank, NTPC, Grasim Industries, and Bajaj Finserv, all of which posted gains ranging from 1 percent to 4 percent. Overall, 30 of the 50 constituents of the Nifty 50 finished in positive territory.Notably, five stocks—Power Grid Corporation, NTPC, Bajaj Finserv, M\u0026M, and Hindalco Industries—reached new one-year highs today.While large-cap stocks maintained upward momentum for the fifth consecutive trading session, mid-cap and small-cap stocks struggled to sustain the rally. The Nifty Midcap 100 ended the session down 0.71 percent at 60,465 points, and the Nifty Smallcap 100 also closed lower at 19,357 points, down 0.63 per cent compared to the previous closing price.Commenting on today's market performance, Vinod Nair, Head of Research, Geojit Financial Services, said, “After a range-bound trade, the benchmark indices inched higher towards close, led by power and banking stocks, while mid-and small-cap indices experienced corrections driven by valuation concerns.”He added, “The domestic market may face short-term challenges owing to a decline in FIIs inflow and shift of funds to other emerging markets due to their cheap valuation. Meanwhile, gold, as a safe-haven asset, gained further appeal amid escalating tensions in the Middle East and the prospect of lower interest rates.”Shares of Easy Trip Planners, one of India’s largest online tech travel platforms, tumbled 16.25 percent in intraday today, falling below  ₹35 to reach  ₹34.22 apiece on reports of a block deal.The news reports suggested that promoter Nishant Pitti was likely to sell 8.5 percent stake in Ease My Trip Planners Ltd. The sale's indicative price is set at  ₹41.5 per share, reported CNBC TV18, attributing the news to sources. Pitti owned 28.13 percent of Easy Trip Planners as of the end of the first quarter.According to the latest shareholding data, the company's promoters held a 64.3 percent stake at the end of the June quarter. Nishant Pitti was the largest promoter, holding 28.13 percent of the stake. Foreign Institutional Investors (FIIs) and Domestic Institutional Investors (DIIs) each owned 2.6 percent, while the general public accounted for the remaining 30.5 percent of the company's ownership.Media stocks were standout performers today, with Saregama India soaring by 16.2 percent. Zee Entertainment followed closely, gaining 5.7 percent. Additionally, Tips Industries and Dish TV India both recorded gains exceeding 2 percent each.Notably, Zee Media Corporation's stock surged by 12.6 percent following the announcement of an upcoming board meeting to discuss potential fundraising options, as reported in an exchange filing.","cleaned_content":"the bulls are showing no signs of backing down despite a weak start they staged a strong comeback in the final hour of trading today this resurgence has driven both the nifty \u003cFIVE_TEN\u003e and the sensex to hit new milestones marking their fifth consecutive session of gains the nifty \u003cFIVE_TEN\u003e surged by \u003cZERO_PERCENT\u003e reaching a fresh record high of \u003cTWO_TEN_THOUSAND\u003e points in trade before closing with a gain of \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e points this marks the first time the index has closed above the \u003cTWO_TEN_THOUSAND\u003e level likewise the s p bse sensex reached a new all time high of \u003cEIGHT_TEN_THOUSAND\u003e points rising by \u003cZERO_PERCENT\u003e it closed the session above the \u003cEIGHT_TEN_THOUSAND\u003e level for the first time settling at \u003cEIGHT_TEN_THOUSAND\u003e points which represents a \u003cZERO_PERCENT\u003e increase from the previous closing price the significant rally in the last hour of trading was driven by power grid corporation axis bank ntpc grasim industries and bajaj finserv all of which posted gains ranging from \u003cONE_PERCENT\u003e to \u003cFOUR_PERCENT\u003e overall \u003cTHREE_TEN\u003e of the \u003cFIVE_TEN\u003e constituents of the nifty \u003cFIVE_TEN\u003e finished in positive territory notably five stocks power grid corporation ntpc bajaj finserv m m and hindalco industries reached new one year highs today while large cap stocks maintained upward momentum for the fifth consecutive trading session mid cap and small cap stocks struggled to sustain the rally the nifty midcap \u003cONE_HUNDRED\u003e ended the session down \u003cZERO_PERCENT\u003e at \u003cSIX_TEN_THOUSAND\u003e points and the nifty smallcap \u003cONE_HUNDRED\u003e also closed lower at \u003cONE_TEN_THOUSAND\u003e points down \u003cZERO_PERCENT\u003e compared to the previous closing price commenting on todays market performance vinod nair head of research geojit financial services said after a range bound trade the benchmark indices inched higher towards close led by power and banking stocks while mid and small cap indices experienced corrections driven by valuation concerns he added the domestic market may face short term challenges owing to a decline in fiis inflow and shift of funds to other emerging markets due to their cheap valuation meanwhile gold as a safe haven asset gained further appeal amid escalating tensions in the middle east and the prospect of lower interest rates shares of easy trip planners one of india s largest online tech travel platforms tumbled \u003cONE_TEN_PERCENT\u003e in intraday today falling below \u003cTHREE_TEN\u003e to reach \u003cTHREE_TEN\u003e apiece on reports of a block deal the news reports suggested that promoter nishant pitti was likely to sell \u003cEIGHT_PERCENT\u003e stake in ease my trip planners ltd the sales indicative price is set at \u003cFOUR_TEN\u003e per share reported cnbc tv18 attributing the news to sources pitti owned \u003cTWO_TEN_PERCENT\u003e of easy trip planners as of the end of the first quarter according to the latest shareholding data the companys promoters held a \u003cSIX_TEN_PERCENT\u003e stake at the end of the june quarter nishant pitti was the largest promoter holding \u003cTWO_TEN_PERCENT\u003e of the stake foreign institutional investors fiis and domestic institutional investors diis each owned \u003cTWO_PERCENT\u003e while the general public accounted for the remaining \u003cTHREE_TEN_PERCENT\u003e of the companys ownership media stocks were standout performers today with saregama india soaring by \u003cONE_TEN_PERCENT\u003e zee entertainment followed closely gaining \u003cFIVE_PERCENT\u003e additionally tips industries and dish tv india both recorded gains exceeding \u003cTWO_PERCENT\u003e each notably zee media corporations stock surged by \u003cONE_TEN_PERCENT\u003e following the announcement of an upcoming board meeting to discuss potential fundraising options as reported in an exchange filing","timestamp":"2024-09-25T16:36:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}