{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-at-26k-nifty-metal-gains-3-to-near-2-month-high-nalco-biggest-gainer-what-fueled-the-rally-11727190942863.html","title":"Nifty 50 @26K | Nifty metal gains 3% to near 2-month high, NALCO biggest gainer; What fueled the rally?","description":"Nifty 50 at 26K | Metal stocks jumped three per cent, the most among the 13 major sectors, to a near two-month high. Tata Steel, Hindalco and JSW Steel rose between 0.5 per cent and four per cent.","content":"Domestic equity benchmarks Sensex and Nifty 50 extended their winning streak for the fourth consecutive session on Tuesday, September 24, before settling flat, having swung between slight gains and losses through the day. The boost to metal stocks from China's new stimulus measures was offset by profit-booking, especially in select banking and consumer goods and staple stocks.The bigger boost on the day came after China, the top producer of several metals including steel and coal, unveiled a slew of measures to try to spur its sluggish economy. Metal stocks jumped three per cent during the session, the most among the 13 major sectors, to a near two-month high. Heavyweights Tata Steel, Hindalco and JSW Steel rose between 0.5 per cent and four per cent.Also Read: Stocks to buy: M\u0026M to Jyothy Labs—SMC Global Securities lists four stocks to bet on this week; Check TP, upsideThe Nifty metal index gained three per cent on Tuesday fueled by the China stimulus. The metal index opened at 9,531.35 and surged to an intra day high of 9,745.30 before settling 2.97 per cent higher at 9,735.40. National Aluminium Co Ltd (NALCO) emerged as the biggest gainer logging a rose of 6.64 per cent in its stock price.Parthiv Jhonsa, Lead Analyst (Metal \u0026 Mining), Anand Rathi Institutional Equities said, “The metal and mining sector has surged today following China's announcement of measures to boost the property market. The Chinese government is expected to lower the outstanding mortgage rate and reduce the down payment required for second home purchases.”Also Read: Bull Market Marches On: Sensex tops 85,000 milestone, Nifty 50 reaches 26,000 for the first time“There may be opportunities to renegotiate or refinance existing mortgages among banks, and the government plans to enhance its re-lending program for state-owned firms to help absorb unsold property inventories,” added Jhonsa.According to the market analysts, while a rebound in metal prices is anticipated in the short term, it has often fallen short of expectations. “We believe that the Chinese housing market has been struggling for the past four years, and unless there is stabilization in prices and a reduction in unsold inventory, any government initiatives will likely be inadequate,” he added.Analysts said that a growing domestic economy would likely stop Chinese steelmakers from dumping low-priced steel in other countries, including India, in search of profits. \"Besides, the recovery in China would strengthen export demand for the metals as well,\" said Ajit Mishra, Senior Vice President (SVP) of research at domestic brokerage firm Religare Broking.Also Read: Nifty 50 rises over 19% in 2024, set to surpass full-year 2023 gains amid strong FPI inflowsChina's central bank on Tuesday unveiled the biggest stimulus since the COVID-19 pandemic to pull the economy out of its deflationary funk and back towards the government's growth target. However, analysts warned more fiscal help was vital to hit these goals. They questioned how productive the liquidity injections would be, given weak credit demand from businesses and consumers, and noted the absence of policies aimed at boosting real economic activity.The broader-than-expected package offering more funding and interest rate cuts marks the latest attempt by policymakers to restore confidence in the world's second-largest economy after multiple disappointing data raised concerns of a prolonged structural slowdown. The People's Bank of China (PBOC) will also cut the seven-day reverse repo rate, its new benchmark, by 0.2 percentage points to 1.5 per cent, as well as other interest rates.Also Read: FPIs turn aggressive buyers on US Fed verdict, pump  ₹33,691 crore in Indian equities; Sept to log highest inflows YTDThe S\u0026P BSE Sensex crossed the 85,000-level for the first time, achieving an all-time high of 85,163 points, marking the fourth straight session in which the index has recorded new highs. The NSE Nifty 50 index also achieved new heights for the fourth consecutive trading day, surpassing the 26,000 mark for the first time to hit a record high of 26,011 points.It took the index 38 sessions to rise from the 25,000 mark to 26,000. The Nifty 50 closed 0.01 per cent higher at 25,940.4 points, while the S\u0026P BSE Sensex dropped 0.02 per cent to settle at 84,914.04. The indices have hit four straight record highs after the US Federal Reserve's super sized 50 bps rate cut last Wednesday sparked hopes of higher foreign inflows in Indian equities. The magnitude of the increase has been easing in each market session.Analysts said the rally was fueled by ongoing optimism about India's economic growth prospects and the easing of monetary policy in the US, which is expected to attract more foreign investment. India's weight in the EM index rose to an all-time high of 19.8 per cent from 18.8 per cent in May, while China's, the index leader, dropped to 24.2 per cent from 24.7 per cent, according to the index aggregator's August quarterly review.Also Read: US Fed delivers supersized 50 bps rate cut: FPI inflows to stronger INR—here’s how the verdict is ‘good’ for IndiaGlobal funds are increasingly investing in India, as the fastest-growing major economy narrows its gap to take leadership in emerging markets MSCI index, which is expected to attract steady capital inflows. India's benchmarks have been on a record-hitting spree as foreign inflows have pumped up the gauges to cross newer levels.As the interest rates go down globally, emerging equity markets are likely to receive inflows, and India is expected to receive a major chunk as the economy demonstrates vastly improved macroeconomic fundamentals and buffers. Inflation domestically is on a declining trajectory and the health of banking and corporate sectors remain strong amid fiscal consolidation under way.Nifty has been one of the better-performing equity markets with Nifty rallying ~19.3 per cent on a YTD basis. \"The Nifty-50 has provided exceptional returns, compounding ~15 per cent from FY19 to FY24, driven by strong corporate earnings growth with a CAGR of 18 per cent. This resulted in Nifty profits increasing from  ₹3.5 trillion in FY19 to  ₹7.9 trillion in FY24,\" said Anil Rego, Founder and Fund Manager at Right Horizons.\"We expect earnings momentum to sustain and estimate the aggregate profit pool of all listed stocks to reach above mid-cycle level to 5.7 per cent of GDP by FY26E vs 5.1 per cent in FY24. As the drivers of earnings upcycle remains intact earnings is expected to compound at 15 per cent over FY24-26. We see reasonable valuation in largecaps and specific pockets of SMIDs,\" added Rego.","cleaned_content":"domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e extended their winning streak for the fourth consecutive session on tuesday september \u003cTWO_TEN\u003e before settling flat having swung between slight gains and losses through the day the boost to metal stocks from chinas new stimulus measures was offset by profit booking especially in select banking and consumer goods and staple stocks the bigger boost on the day came after china the top producer of several metals including steel and coal unveiled a slew of measures to try to spur its sluggish economy metal stocks jumped three per cent during the session the most among the \u003cONE_TEN\u003e major sectors to a near two month high heavyweights tata steel hindalco and jsw steel rose between \u003cZERO_PERCENT\u003e and four per cent also read stocks to buy m m to jyothy labs smc global securities lists four stocks to bet on this week check tp upsidethe nifty metal index gained three per cent on tuesday fueled by the china stimulus the metal index opened at \u003cNINE_THOUSAND\u003e and surged to an intra day high of \u003cNINE_THOUSAND\u003e before settling \u003cTWO_PERCENT\u003e higher at \u003cNINE_THOUSAND\u003e national aluminium co ltd nalco emerged as the biggest gainer logging a rose of \u003cSIX_PERCENT\u003e in its stock price parthiv jhonsa lead analyst metal mining anand rathi institutional equities said the metal and mining sector has surged today following chinas announcement of measures to boost the property market the chinese government is expected to lower the outstanding mortgage rate and reduce the down payment required for second home purchases also read bull market marches on sensex tops \u003cEIGHT_TEN_THOUSAND\u003e milestone nifty \u003cFIVE_TEN\u003e reaches \u003cTWO_TEN_THOUSAND\u003e for the first time there may be opportunities to renegotiate or refinance existing mortgages among banks and the government plans to enhance its re lending program for state owned firms to help absorb unsold property inventories added jhonsa according to the market analysts while a rebound in metal prices is anticipated in the short term it has often fallen short of expectations we believe that the chinese housing market has been struggling for the past four years and unless there is stabilization in prices and a reduction in unsold inventory any government initiatives will likely be inadequate he added analysts said that a growing domestic economy would likely stop chinese steelmakers from dumping low priced steel in other countries including india in search of profits besides the recovery in china would strengthen export demand for the metals as well said ajit mishra senior vice president svp of research at domestic brokerage firm religare broking also read nifty \u003cFIVE_TEN\u003e rises over \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e set to surpass full year \u003cTWO_THOUSAND\u003e gains amid strong fpi inflowschinas central bank on tuesday unveiled the biggest stimulus since the covid \u003cONE_TEN\u003e pandemic to pull the economy out of its deflationary funk and back towards the governments growth target however analysts warned more fiscal help was vital to hit these goals they questioned how productive the liquidity injections would be given weak credit demand from businesses and consumers and noted the absence of policies aimed at boosting real economic activity the broader than expected package offering more funding and interest rate cuts marks the latest attempt by policymakers to restore confidence in the worlds second largest economy after multiple disappointing data raised concerns of a prolonged structural slowdown the peoples bank of china pboc will also cut the seven day reverse repo rate its new benchmark by \u003cZERO_PERCENT\u003e age points to \u003cONE_PERCENT\u003e as well as other interest rates also read fpis turn aggressive buyers on us fed verdict pump \u003cTHREE_TEN_THOUSAND\u003e crore in indian equities sept to log highest inflows ytdthe s p bse sensex crossed the \u003cEIGHT_TEN_THOUSAND\u003e level for the first time achieving an all time high of \u003cEIGHT_TEN_THOUSAND\u003e points marking the fourth straight session in which the index has recorded new highs the nse nifty \u003cFIVE_TEN\u003e index also achieved new heights for the fourth consecutive trading day surpassing the \u003cTWO_TEN_THOUSAND\u003e mark for the first time to hit a record high of \u003cTWO_TEN_THOUSAND\u003e points it took the index \u003cTHREE_TEN\u003e sessions to rise from the \u003cTWO_TEN_THOUSAND\u003e mark to \u003cTWO_TEN_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e closed \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e points while the s p bse sensex dropped \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e the indices have hit four straight record highs after the us federal reserves super sized \u003cFIVE_TEN\u003e bps rate cut last wednesday sparked hopes of higher foreign inflows in indian equities the magnitude of the increase has been easing in each market session analysts said the rally was fueled by ongoing optimism about indias economic growth prospects and the easing of monetary policy in the us which is expected to attract more foreign investment indias weight in the em index rose to an all time high of \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in may while chinas the index leader dropped to \u003cTWO_TEN_PERCENT\u003e from \u003cTWO_TEN_PERCENT\u003e according to the index aggregators august quarterly review also read us fed delivers supersized \u003cFIVE_TEN\u003e bps rate cut fpi inflows to stronger inr here s how the verdict is good for indiaglobal funds are increasingly investing in india as the fastest growing major economy narrows its gap to take leadership in emerging markets msci index which is expected to attract steady capital inflows indias benchmarks have been on a record hitting spree as foreign inflows have pumped up the gauges to cross newer levels as the interest rates go down globally emerging equity markets are likely to receive inflows and india is expected to receive a major chunk as the economy demonstrates vastly improved macroeconomic fundamentals and buffers inflation domestically is on a declining trajectory and the health of banking and corporate sectors remain strong amid fiscal consolidation under way nifty has been one of the better performing equity markets with nifty rallying \u003cONE_TEN_PERCENT\u003e on a ytd basis the nifty \u003cFIVE_TEN\u003e has provided exceptional returns compounding \u003cONE_TEN_PERCENT\u003e from fy19 to fy24 driven by strong corporate earnings growth with a cagr of \u003cONE_TEN_PERCENT\u003e this resulted in nifty profits increasing from \u003cTHREE_\u003e trillion in fy19 to \u003cSEVEN_\u003e trillion in fy24 said anil rego founder and fund manager at right horizons we expect earnings momentum to sustain and estimate the aggregate profit pool of all listed stocks to reach above mid cycle level to \u003cFIVE_PERCENT\u003e of gdp by fy26e vs \u003cFIVE_PERCENT\u003e in fy24 as the drivers of earnings upcycle remains intact earnings is expected to compound at \u003cONE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e we see reasonable valuation in largecaps and specific pockets of smids added rego","timestamp":"2024-09-24T20:52:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}