{"url":"https://www.livemint.com/market/stock-market-news/krn-heat-exchanger-and-refrigeration-ipo-gmp-indicates-towards-strong-debut-of-shares-on-nse-bse-tomorrow-3-oct-11727857026453.html","title":"KRN Heat Exchanger and Refrigeration IPO: GMP indicates strong debut for shares on NSE, BSE tomorrow - 3 October","description":"KRN Heat Exchanger and Refrigeration IPO: The subscription period for the IPO ended on 27 September, with the listing scheduled for 3 October on NSE and BSE. The GMP indicates strong debut expectations by market participants.","content":"KRN Heat Exchanger and Refrigeration IPO: KRN Heat Exchanger and Refrigeration share price will list on the NSE and BSE on Thursday, October 3 after receiving a strong subscription for its initial public offering (IPO).KRN Heat Exchanger IPO was subscribed 213.41 times. The public issue had received 96.74 times bids in the retail category, 253.04 times in the QIB category, and 430.54 times in the NII category.The strong subscription received by KRN Heat Exchanger IPO indicates strong investor interest. Further, the GMP also indicates that market participants are expecting a blockbuster debut for KRN Heat Exchanger shares.KRN Heat Exchanger and Refrigeration IPO opened for subscription on September 25 and closed on September 27. The allocation for the public offer was completed on Monday, September 30.KRN Heat Exchanger IPO GMP stood at  ₹230, although it was lower than  ₹270 at the start of the subscription period. The GMP stood at  ₹235 on day 2, according to data from Investorg ain.com. The current GMP still indicates strong listing gains for KRN Heat Exchanger shares.The current GMP of KRN Heat Exchanger shows that investors are expecting KRN Heat Exchanger shares to list at  ₹450 apiece, a 104.55% premium over the upper end of the issue price of  ₹220.KRN Heat Exchanger and Refrigeration is one of the leading manufacturers of heat exchangers. The company makes water coils, condenser coils, evaporator coils, heat exchangers with copper and aluminium fins and copper tubes. It produces heat exchanger tubes with a variety of diameters and forms, ranging from 5 mm to 7 mm, 9.52 mm, 12.7 mm, and 15.88 mm. All products on offer are utilised in the HVAC (heating, ventilation, air conditioning, and refrigeration) sector, which serves residential, commercial, and industrial customers.","cleaned_content":"krn heat exchanger and refrigeration ipo krn heat exchanger and refrigeration share price will list on the nse and bse on thursday october \u003cTHREE_\u003e after receiving a strong subscription for its initial public offering ipo krn heat exchanger ipo was subscribed \u003cTWO_HUNDRED\u003e times the public issue had received \u003cNINE_TEN\u003e times bids in the retail category \u003cTWO_HUNDRED\u003e times in the qib category and \u003cFOUR_HUNDRED\u003e times in the nii category the strong subscription received by krn heat exchanger ipo indicates strong investor interest further the gmp also indicates that market participants are expecting a blockbuster debut for krn heat exchanger shares krn heat exchanger and refrigeration ipo opened for subscription on september \u003cTWO_TEN\u003e and closed on september \u003cTWO_TEN\u003e the allocation for the public offer was completed on monday september \u003cTHREE_TEN\u003e krn heat exchanger ipo gmp stood at \u003cTWO_HUNDRED\u003e although it was lower than \u003cTWO_HUNDRED\u003e at the start of the subscription period the gmp stood at \u003cTWO_HUNDRED\u003e on day \u003cTWO_\u003e according to data from investorg ain com the current gmp still indicates strong listing gains for krn heat exchanger shares the current gmp of krn heat exchanger shows that investors are expecting krn heat exchanger shares to list at \u003cFOUR_HUNDRED\u003e apiece a \u003cONE_HUNDRED_PERCENT\u003e premium over the upper end of the issue price of \u003cTWO_HUNDRED\u003e krn heat exchanger and refrigeration is one of the leading manufacturers of heat exchangers the company makes water coils condenser coils evaporator coils heat exchangers with copper and aluminium fins and copper tubes it produces heat exchanger tubes with a variety of diameters and forms ranging from \u003cFIVE_\u003e mm to \u003cSEVEN_\u003e mm \u003cNINE_\u003e mm \u003cONE_TEN\u003e mm and \u003cONE_TEN\u003e mm all products on offer are utilised in the hvac heating ventilation air conditioning and refrigeration sector which serves residential commercial and industrial customers","timestamp":"2024-10-02T15:22:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}