{"url":"https://www.livemint.com/market/stock-market-news/hdfc-securities-faces-tech-glitch-investors-facing-issues-in-placing-order-11727942280036.html","title":"HDFC Securities faces tech glitch; users experience issues in placing order","description":"HDFC Securities faced user complaints on October 3 due to a technical glitch preventing order placements during a market slump, with the Sensex and Nifty 50 dropping over 1.5%. The company acknowledged the issue and committed to resolving it swiftly while offering direct assistance.","content":"HDFC Securities faced a technical on Thursday, 3 October, with several users complaining that they were unable to place orders on the platform.The glitch comes at a time when the Indian stock market was witnessing heavy selling pressure. In today's trade, both the Sensex and the Nifty 50 tumbled over 2% due to escalating geopolitical tensions among other reasons.Users took to the microblogging website X, formerly known as Twitter, to raise their complaint with HDFC Securities. The company, meanwhile, in response said, “We know some customers are having trouble with their orders not going through. We're working hard to fix this as soon as we can. If you need immediate help, please DM us your contact details, and we’ll assist you right away.”Subsequently, the brokerage firm released an official statement stating, \"We are experiencing intermittent issues concerning NSE derivative segment orders.\" In order to fix the same, we are collaborating with our vendor, TCS. The remaining segments—Equity, BSE Derivatives, SLBM, Currency, and Commodities Derivatives—all function as intended.\"In March of this year, there were reports of HDFC Securities experiencing downtime for numerous users in India. Users reported that the app was displaying data from the previous day. Ashish Rathi, the Whole Time Director of HDFC Securities, provided an explanation for the issue and stated that it was been fixed. During that period, many users expressed their complaints about the problem on X.“Few customers on one of our digital applications were facing broadcast issues with respect to rates. However, order routing to Exchanges was not impacted. The same has been resolved at 9:45 am. All other channels of trading are fully operational,” said Rathi, according to Business Today news report.On Thursday, around 14:04 IST, the domestic benchmark indices, the Sensex and the Nifty 50, fell by more than 2%, with the Sensex shedding over 1,700 points and the Nifty 50 falling by almost 553 points. Increasing geopolitical tensions in the Middle East is one of the negative factors contributing to the rapid fall.Furthermore, SEBI's recent regulatory reforms in the F\u0026O industry are anticipated to have an effect on trading volumes since they may result in a drop in retail participation due to the higher contract size and weekly expiry limitations.Market analysts do not predict an extended extension of losses in the Indian market in spite of these challenges.“From a technical perspective, as long as prices hold above the 25,250–25,100 zone, any decline could present an opportunity to build fresh long positions. A stock-specific approach is advisable, with sectors such as Oil, IT, PSU Banks, Metals, and Chemicals likely to outperform in the coming days,” said Vishnu Kant Upadhyay, AVP, Research \u0026 Advisory at Master Capital Services.","cleaned_content":"hdfc securities faced a technical on thursday \u003cTHREE_\u003e october with several users complaining that they were unable to place orders on the platform the glitch comes at a time when the indian stock market was witnessing heavy selling pressure in todays trade both the sensex and the nifty \u003cFIVE_TEN\u003e tumbled over \u003cTWO_PERCENT\u003e due to escalating geopolitical tensions among other reasons users took to the microblogging website x formerly known as twitter to raise their complaint with hdfc securities the company meanwhile in response said we know some customers are having trouble with their orders not going through were working hard to fix this as soon as we can if you need immediate help please dm us your contact details and we ll assist you right away subsequently the brokerage firm released an official statement stating we are experiencing intermittent issues concerning nse derivative segment orders in order to fix the same we are collaborating with our vendor tcs the remaining segments equity bse derivatives slbm currency and commodities derivatives all function as intended in march of this year there were reports of hdfc securities experiencing downtime for numerous users in india users reported that the app was displaying data from the previous day ashish rathi the whole time director of hdfc securities provided an explanation for the issue and stated that it was been fixed during that period many users expressed their complaints about the problem on x few customers on one of our digital applications were facing broadcast issues with respect to rates however order routing to exchanges was not impacted the same has been resolved at \u003cNINE_\u003e \u003cFOUR_TEN\u003e am all other channels of trading are fully operational said rathi according to business today news report on thursday around \u003cONE_TEN\u003e \u003cFOUR_\u003e ist the domestic benchmark indices the sensex and the nifty \u003cFIVE_TEN\u003e fell by more than \u003cTWO_PERCENT\u003e with the sensex shedding over \u003cONE_THOUSAND\u003e points and the nifty \u003cFIVE_TEN\u003e falling by almost \u003cFIVE_HUNDRED\u003e points increasing geopolitical tensions in the middle east is one of the negative factors contributing to the rapid fall furthermore sebis recent regulatory reforms in the f o industry are anticipated to have an effect on trading volumes since they may result in a drop in retail participation due to the higher contract size and weekly expiry limitations market analysts do not predict an extended extension of losses in the indian market in spite of these challenges from a technical perspective as long as prices hold above the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e zone any decline could present an opportunity to build fresh long positions a stock specific approach is advisable with sectors such as oil it psu banks metals and chemicals likely to outperform in the coming days said vishnu kant upadhyay avp research advisory at master capital services","timestamp":"2024-10-03T13:34:00+05:30","market_timestamp":"2024-10-03T13:34:00+05:30","off_market_hours":false}