{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-markets-outlook-five-stocks-to-buy-or-sell-on-tuesday-sept-24-11727088523151.html","title":"Stock market today: Trade setup for Nifty 50 to global markets outlook, five stocks to buy or sell on Tuesday — Sept 24","description":"Stock Market Today: After a decisive upside breakout on Friday, the market continued its upward journey on Monday and closed near the day high, not before scaling fresh highs","content":"Stock Market Today: The markets started a week on a strong note maintaining Friday's momentum . The benchmark Nifty 50 index and the S\u0026P BSE Sensex scaled all time highs. The Nifty ended the day at 25,939.04, up 0.57% and not far from day's high of  25956.  The Sensex that ended at 84,928.61 with gains of 0.45% was also not far from all time highs of 84,980.53 scaled during the day.Bank Nifty strengthened, ending with 0.56% gains at 54,105.80. Realty, auto, and energy were leading gainers during the day, and the broader indices also bounced back, posting gains between 0.8% and 1%.After a decisive upside breakout on Friday, the market continued their upward journey on Monday and closed close to the days high. The short-term trend of Nifty continues to be positive. Nifty is now heading towards the upside target of 26250 (1.618% Fibonacci Extension) in the near term. Immediate support is at 25750, said Nagaraj Shetti, Senior Technical Research Analyst at HDFC SecuritiesTechnically, the Bank Index is oscillating within a rising channel. In the short-term index might face a hurdle near 54500 levels and if sustains above  might test 55,000-55,500, level, said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd. On the downside, the breakout level of rounding bottom pattern near 53,350 and the Psychological level of 53,000 will serve as support points, added Yedve.The Fed’s aggressive rate cut and dovish outlook triggered a rally both in global and domestic markets. Even FIIs have been strong buyers in the last few sessions, said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services. Khemka added that he expects positive momentum to continue with index heavyweights continuing to outperform. We expect key events like the US GDP \u0026 Core PCE data, Fed Chair Powell's speech \u0026 monthly derivatives expiry will keep the markets busy.Market experts as Sumeet Bagadia, Executive Director at Choice Broking has recommended two stock picks for Monday, while Ganesh Dongre, Senior Manager of technical Research at Anand Rathi also has given another three picks.These include Bajaj Auto Ltd, Apollo Hospitals Enterprise LTD , Gujarat State Petronet Ltd , Indus Towers Ltd and Intellect Design Arena Ltd.Bajaj Auto is presently trading at  ₹12338.95 levels. On the daily chart, the stock has formed a strong bullish momentum candle, signifying a resurgence of strength in its price action. A robust support level is situated at 11900 levels. This confluence of support factors enhances the stock's stability and resilience said Bagadia2. Apollo Hospitals Enterprise Ltd-  Sumeet Bagadia recommends buying Apollo Hospitals Enterprise Ltd at  ₹7152.8 with a stoploss at  ₹6900 for a target price of  ₹7600Apollo Hospitals daily chart analysis as per Bagadia offers a favourable view for the following week, indicating a steady higher advance. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price, said Bagadia3. Gujarat State Petronet Ltd- Dongre recommends buying Gujarat State Petronet Ltd at  ₹404 keeping Stoploss at  ₹390 for a target price of  ₹425The stock found a substantial support level at Rs. 390, marking a crucial juncture in its recent trading. Presently, at Rs.404, the stock has demonstrated a definitive reversal in price action, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at Rs.390. The anticipated target for this trade is Rs.425, representing the next significant resistance level. This strategy positions traders favorably to capitalize on the stock's anticipated rally in the weeks ahead..4. Indus Towers Ltd - Dongre recommends Buying Indus Towers Ltd at  ₹403 keeping Stop loss at  ₹392 and a target price of  ₹430.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 430. At present, the stock is maintaining a crucial support level at Rs.392. Given the current market price of Rs.403, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 430, said Dongre5. Intellect Design Arena Ltd - Dongre recommends buying Intellect Design Arena Ltd at  ₹980 keeping stop loss at  ₹970 with a target price of  ₹1020On the daily chart of this stock, a breakout at the Rs. 980 price level has been observed, signaling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 970 is recommended. The target price for this strategy is Rs. 1020 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"stock market today the markets started a week on a strong note maintaining fridays momentum the benchmark nifty \u003cFIVE_TEN\u003e index and the s p bse sensex scaled all time highs the nifty ended the day at \u003cTWO_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e and not far from days high of \u003cTWO_TEN_THOUSAND\u003e the sensex that ended at \u003cEIGHT_TEN_THOUSAND\u003e with gains of \u003cZERO_PERCENT\u003e was also not far from all time highs of \u003cEIGHT_TEN_THOUSAND\u003e scaled during the day bank nifty strengthened ending with \u003cZERO_PERCENT\u003e gains at \u003cFIVE_TEN_THOUSAND\u003e realty auto and energy were leading gainers during the day and the broader indices also bounced back posting gains between \u003cZERO_PERCENT\u003e and \u003cONE_PERCENT\u003e after a decisive upside breakout on friday the market continued their upward journey on monday and closed close to the days high the short term trend of nifty continues to be positive nifty is now heading towards the upside target of \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension in the near term immediate support is at \u003cTWO_TEN_THOUSAND\u003e said nagaraj shetti senior technical research analyst at hdfc securitiestechnically the bank index is oscillating within a rising channel in the short term index might face a hurdle near \u003cFIVE_TEN_THOUSAND\u003e levels and if sustains above might test \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e level said hrishikesh yedve avp technical and derivatives research at asit c mehta investment interrmediates ltd on the downside the breakout level of rounding bottom pattern near \u003cFIVE_TEN_THOUSAND\u003e and the psychological level of \u003cFIVE_TEN_THOUSAND\u003e will serve as support points added yedve the fed s aggressive rate cut and dovish outlook triggered a rally both in global and domestic markets even fiis have been strong buyers in the last few sessions said siddhartha khemka head research wealth management motilal oswal financial services khemka added that he expects positive momentum to continue with index heavyweights continuing to outperform we expect key events like the us gdp core pce data fed chair powells speech monthly derivatives expiry will keep the markets busy market experts as sumeet bagadia executive director at choice broking has recommended two stock picks for monday while ganesh dongre senior manager of technical research at anand rathi also has given another three picks these include bajaj auto ltd apollo hospitals enterprise ltd gujarat state petronet ltd indus towers ltd and intellect design arena ltd bajaj auto is presently trading at \u003cONE_TEN_THOUSAND\u003e levels on the daily chart the stock has formed a strong bullish momentum candle signifying a resurgence of strength in its price action a robust support level is situated at \u003cONE_TEN_THOUSAND\u003e levels this confluence of support factors enhances the stocks stability and resilience said bagadia2 apollo hospitals enterprise ltd sumeet bagadia recommends buying apollo hospitals enterprise ltd at \u003cSEVEN_THOUSAND\u003e with a stoploss at \u003cSIX_THOUSAND\u003e for a target price of \u003cSEVEN_THOUSAND\u003e apollo hospitals daily chart analysis as per bagadia offers a favourable view for the following week indicating a steady higher advance notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price said bagadia3 gujarat state petronet ltd dongre recommends buying gujarat state petronet ltd at \u003cFOUR_HUNDRED\u003e keeping stoploss at \u003cTHREE_HUNDRED\u003e for a target price of \u003cFOUR_HUNDRED\u003e the stock found a substantial support level at rs \u003cTHREE_HUNDRED\u003e marking a crucial juncture in its recent trading presently at rs 404 the stock has demonstrated a definitive reversal in price action suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at rs 390 the anticipated target for this trade is rs 425 representing the next significant resistance level this strategy positions traders favorably to capitalize on the stocks anticipated rally in the weeks ahead 4 indus towers ltd dongre recommends buying indus towers ltd at \u003cFOUR_HUNDRED\u003e keeping stop loss at \u003cTHREE_HUNDRED\u003e and a target price of \u003cFOUR_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cFOUR_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 392 given the current market price of rs 403 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cFOUR_HUNDRED\u003e said dongre5 intellect design arena ltd dongre recommends buying intellect design arena ltd at \u003cNINE_HUNDRED\u003e keeping stop loss at \u003cNINE_HUNDRED\u003e with a target price of \u003cONE_THOUSAND\u003e on the daily chart of this stock a breakout at the rs \u003cNINE_HUNDRED\u003e price level has been observed signaling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cNINE_HUNDRED\u003e is recommended the target price for this strategy is rs \u003cONE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-09-24T06:16:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}