{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-today-analysts-expect-up-to-40-upside-on-cg-power-samvardhana-motherson-shares-here-s-why-11727670178506.html","title":"Stocks to buy today: Analysts expect up to 40% upside on CG Power, Samvardhana Motherson shares. Here’s why","description":"Stocks to buy: Samvardhana Motherson International Ltd displays strong bullish signals, with a target price of  ₹300, suggesting a 40% upside. CG Power is also recommended to buy, with a target of  ₹950, indicating a promising outlook based on growth factors.","content":"Indian stock market indices, Sensex and Nifty 50, traded lower on Monday dragged by heavy selling in auto, IT, realty, private banks and energy stocks amid mixed cues from global peers. The midcap and smallcap indices were also down over half a percent in early trade.Analysts have recommended two stocks to buy amid this market setup based on the fundamentals and technical analysis. These two stocks to buy today are CG Power and Industrial Solutions and Samvardhana Motherson International.Brokerage firm Anand Rathi has initiated coverage on CG Power and Industrial Solutions with a bullish view. The stock is among its fundamental value picks.On the other hand, Samvardhana Motherson International shares have given a technical breakout on the price chart after accumulating for three months and analysts at Ventura Securities expect the stock to see further upward momentum. Here are stocks to buy:Anand Rathi expects CG Power and Industrial Solutions to see strong growth going forward due to many factors such as capacity expansion on strong order book visibility, increasing its presence in the domestic market and looking for export opportunities and OSAT facility to provide additional growth.With all these positives, the brokerage firm expects the company’s Revenue, EBITDA and PAT CAGR of 17%, 21% and 18% over FY23-26.Anand Rathi has initiated coverage on CG Power and Industrial Solutions shares with a ‘Buy’ rating and a target price of  ₹950, implying an upside potential of nearly 25% from Friday’s closing price. The time horizon is 12 months.Samvardhana Motherson International Ltd is a promising stock to buy as it is showing a bullish pattern. The Aroon, ADX and MACD indicators are showing positive signs. With a continuous average support, it has given a 3-month accumulation breakout. An ascending triangle breakout is visible now after a higher bottom formation, said Bharat Gala, COO - Equity Broking, Ventura Securities.Additionally, there is a long build up in the stock’s futures as well, he added.Gala recommends to buy Samvardhana Motherson shares at its current market price (CMP) and add more at the support areas of  ₹203 - 196 and  ₹186 - 181, keeping a stop loss at  ₹169. The target price for the stock is  ₹300 apiece, implying an upside potential of nearly 40% from Friday’s closing price.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e traded lower on monday dragged by heavy selling in auto it realty private banks and energy stocks amid mixed cues from global peers the midcap and smallcap indices were also down over half a percent in early trade analysts have recommended two stocks to buy amid this market setup based on the fundamentals and technical analysis these two stocks to buy today are cg power and industrial solutions and samvardhana motherson international brokerage firm anand rathi has initiated coverage on cg power and industrial solutions with a bullish view the stock is among its fundamental value picks on the other hand samvardhana motherson international shares have given a technical breakout on the price chart after accumulating for three months and analysts at ventura securities expect the stock to see further upward momentum here are stocks to buy anand rathi expects cg power and industrial solutions to see strong growth going forward due to many factors such as capacity expansion on strong order book visibility increasing its presence in the domestic market and looking for export opportunities and osat facility to provide additional growth with all these positives the brokerage firm expects the company s revenue ebitda and pat cagr of \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e over fy23 \u003cTWO_TEN\u003e anand rathi has initiated coverage on cg power and industrial solutions shares with a buy rating and a target price of \u003cNINE_HUNDRED\u003e implying an upside potential of nearly \u003cTWO_TEN_PERCENT\u003e from friday s closing price the time horizon is \u003cONE_TEN\u003e months samvardhana motherson international ltd is a promising stock to buy as it is showing a bullish pattern the aroon adx and macd indicators are showing positive signs with a continuous average support it has given a \u003cTHREE_\u003e month accumulation breakout an ascending triangle breakout is visible now after a higher bottom formation said bharat gala coo equity broking ventura securities additionally there is a long build up in the stock s futures as well he added gala recommends to buy samvardhana motherson shares at its current market price cmp and add more at the support areas of \u003cTWO_HUNDRED\u003e \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e keeping a stop loss at \u003cONE_HUNDRED\u003e the target price for the stock is \u003cTHREE_HUNDRED\u003e apiece implying an upside potential of nearly \u003cFOUR_TEN_PERCENT\u003e from friday s closing price","timestamp":"2024-09-30T10:02:00+05:30","market_timestamp":"2024-09-30T10:02:00+05:30","off_market_hours":false}