{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-grm-overseas-share-price-jumps-125-in-six-months-experts-see-more-rally-11727168655458.html","title":"Multibagger stock: GRM Overseas share price jumps 125% in six months. Experts see more rally","description":"Multibagger stock: GRM Overseas share price has risen from around  ₹118 to  ₹270 apiece on the NSE in last six months","content":"Stocks to buy today: GRM Overseas shares are one of the multibagger stocks the Indian stock market has delivered in recent years. In the last six months, this small-cap stock has risen from around  ₹118 to  ₹270 apiece mark on the NSE, logging a nearly 125 per cent rally in this time horizon. However, some stock market experts still see upside potential in this multibagger FMCG stock. GRM Overseas' share price may soon reach  ₹300 apiece from the current market price.On triggers that are working in favour of GRM Overseas shares, Saurabh Jain, Deputy Vice President — Research at SMC Global Securities, said, \"Ahead of the festival season and continuous rise in the Indian stock market, FMCG stocks are expected to attract fresh buying as it is expected to outperform other segments in short to medium term. So, those FMCG stocks that have done well recently are expected to continue delivering stellar returns.\"On the technical pattern regarding GRM Overseas's share price, Vaibhav Kaushik, Research Analyst at GCL Broking, said, \"GRM Overseas share price is on an uptrend and trading above all the major moving averages. One can continue to hold existing longs with a stop at  ₹240 as the stock is poised for newer highs, as indicated by momentum indicators and price action.\" the GCL Broking expert said that the company had delivered strong Q1FY25 results. In the wake of the fast-approaching festival season, the market expects strong quarterly numbers in the upcoming quarters.Expecting more rally in GRM Overseas shares, Sumeet Bagadia, Executive Director at Choice Broking, said, \"GRM Overseas share price has made a strong base at  ₹245, and the FMCG stock is facing hurdle at  ₹300. However, the technical chart suggests an uptrend in this multibagger stock. So, GRM Overseas shareholders are advised to hold the scrip for the near-term target of  ₹300, maintaining a stop loss at  ₹245.\"On the suggestion to fresh investors, Sumeet Bagadia said, “Fresh investors can also buy this scrip, maintaining a buy-on-dips strategy until  ₹245 support remains sacrosanct. The stock may become further bullish on breaching the above  ₹300 hurdle decisively.”GRM Overseas Limited today unveiled its new packaging for the 10X brand range, featuring Bollywood superstar Salman Khan. This strategic move aligns with GRM's mission to elevate its brand presence and strengthen its connection with consumers across India and beyond.The updated packaging showcases Salman Khan and will be rolled out across the 10X product range, including basmati rice, flour, and other offerings. The new look combines a modern, sleek design with a vibrant colour palette, emphasizing 10X's commitment to quality and authenticity. The packaging reflects the brand's dynamic energy, making it an appealing choice for today's discerning consumers seeking quality and brand tru we cIn Q1FY25 results, the FMCG company registered a YoY increase in total income and net profit from April to June 2024. The company's total income during the April to June 2024 quarter grew by over 15 per cent to  ₹375.25 crore, compared to  ₹325.90 crore in the corresponding period of the previous financial year. The company's net profit surged from  ₹17.44 crore to  ₹18.02 crore in the June 2024 quarter, logging a YoY rise of around 3.35 per cent.","cleaned_content":"stocks to buy today grm overseas shares are one of the multibagger stocks the indian stock market has delivered in recent years in the last six months this small cap stock has risen from around \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e apiece mark on the nse logging a nearly \u003cONE_HUNDRED_PERCENT\u003e rally in this time horizon however some stock market experts still see upside potential in this multibagger fmcg stock grm overseas share price may soon reach \u003cTHREE_HUNDRED\u003e apiece from the current market price on triggers that are working in favour of grm overseas shares saurabh jain deputy vice president research at smc global securities said ahead of the festival season and continuous rise in the indian stock market fmcg stocks are expected to attract fresh buying as it is expected to outperform other segments in short to medium term so those fmcg stocks that have done well recently are expected to continue delivering stellar returns on the technical pattern regarding grm overseass share price vaibhav kaushik research analyst at gcl broking said grm overseas share price is on an uptrend and trading above all the major moving averages one can continue to hold existing longs with a stop at \u003cTWO_HUNDRED\u003e as the stock is poised for newer highs as indicated by momentum indicators and price action the gcl broking expert said that the company had delivered strong q1fy25 results in the wake of the fast approaching festival season the market expects strong quarterly numbers in the upcoming quarters expecting more rally in grm overseas shares sumeet bagadia executive director at choice broking said grm overseas share price has made a strong base at \u003cTWO_HUNDRED\u003e and the fmcg stock is facing hurdle at \u003cTHREE_HUNDRED\u003e however the technical chart suggests an uptrend in this multibagger stock so grm overseas shareholders are advised to hold the scrip for the near term target of \u003cTHREE_HUNDRED\u003e maintaining a stop loss at \u003cTWO_HUNDRED\u003e on the suggestion to fresh investors sumeet bagadia said fresh investors can also buy this scrip maintaining a buy on dips strategy until \u003cTWO_HUNDRED\u003e support remains sacrosanct the stock may become further bullish on breaching the above \u003cTHREE_HUNDRED\u003e hurdle decisively grm overseas limited today unveiled its new packaging for the \u003cONE_TEN\u003e x brand range featuring bollywood superstar salman khan this strategic move aligns with grms mission to elevate its brand presence and strengthen its connection with consumers across india and beyond the updated packaging showcases salman khan and will be rolled out across the \u003cONE_TEN\u003e x product range including basmati rice flour and other offerings the new look combines a modern sleek design with a vibrant colour palette emphasizing \u003cONE_TEN\u003e xs commitment to quality and authenticity the packaging reflects the brands dynamic energy making it an appealing choice for todays discerning consumers seeking quality and brand tru we cin q1fy25 results the fmcg company registered a yoy increase in total income and net profit from april to june \u003cTWO_THOUSAND\u003e the companys total income during the april to june \u003cTWO_THOUSAND\u003e quarter grew by over \u003cONE_TEN_PERCENT\u003e to \u003cTHREE_HUNDRED\u003e crore compared to \u003cTHREE_HUNDRED\u003e crore in the corresponding period of the previous financial year the companys net profit surged from \u003cONE_TEN\u003e crore to \u003cONE_TEN\u003e crore in the june \u003cTWO_THOUSAND\u003e quarter logging a yoy rise of around \u003cTHREE_PERCENT\u003e","timestamp":"2024-09-24T14:53:00+05:30","market_timestamp":"2024-09-24T14:53:00+05:30","off_market_hours":false}