{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-up-over-19-in-2024-so-far-set-to-outperform-full-year-2023-gains-11727147775956.html","title":"Nifty 50 rises over 19% in 2024, set to surpass full-year 2023 gains amid strong FPI inflows","description":"Despite elevated valuations, Indian equities have seen significant investment inflows, pushing the Nifty 50 to record highs. Analysts highlight robust GDP growth and recommend focusing on sectors like real estate and infrastructure that may benefit from lower interest rates.","content":"If you’ve been following the Indian stock market closely, you’ve likely heard analysts caution about the high valuations of Indian equities and predict a near-term correction. However, investors appear unfazed by these warnings as they continue to pour money into equities, driving the indices to record significant milestones.Foreign Portfolio Investors (FPIs), along with Domestic Institutional Investors (DIIs) and retail investors, have been steadily injecting billions into Indian equities, helping the market maintain record levels. Notably, the flows from FPIs accelerated post-the US Fed rate cut.Against this backdrop, the Nifty 50 has set record highs over 50 times in the past nine months, with its most recent milestone occurring in today's trading session as it surpassed the 25,950 level, reaching a new all-time high of 25,981, moving closer to the 26,000 level.This impressive rally has driven the index to a 19.36 percent gain so far in 2024, just 0.64 percent short of surpassing the total 2023 gain of 20 percent. Over the past nine months, the index has posted gains in seven of those months, with June delivering the highest monthly gain of 6.57 percent (on policy continuity optimism), followed by July with a 4 percent increase.Analysts attribute the continued investor interest in Indian stocks, despite globally high valuations, to the country's robust economic growth potential. India’s economy is expanding at a pace faster than its peers, with GDP projected to grow at 7.2 percent in FY25.According to a recent report by domestic brokerage firm IDBI Capital, the Indian economy is expected to add USD 1 trillion every 1.5 years, reaching USD 10 trillion by 2032. The report highlights that India is on the brink of a significant transformation, set to become the third-largest economy globally by 2030.The data also revealed India's rapid economic growth over the past decade. While it took 63 years, from 1947 to 2010, to reach a GDP of USD 1 trillion, the pace has since accelerated. India reached USD 2 trillion in 2017, just seven years later, and USD 3 trillion in 2020.After the US Federal Reserve's decision to cut interest rates by 50 basis points on September 18, the Nifty 50 index surged by over 2 percent, with rate-sensitive stocks leading the rally. Over the last three trading sessions, the Nifty 50 climbed by 2.1 percent, gaining 544 points. Sensex also jumped 2.3 percent during this time frame.This rally has driven the 12-month forward price-to-earnings ratios of the Nifty 50 and Sensex to 23.6 and 24.4, respectively, making them the most expensive among emerging markets.Moreover, the steady upward trend has also positioned Indian benchmark indices ahead of their global counterparts, with the Nifty 50 and Sensex now ranking third and fourth in year-to-date (YTD) gains among major global exchanges. Japan's Nikkei 225 and Germany's DAX follow closely with 13 percent and 12 percent increases, respectively.Last week, India's weightage in a key MSCI index topped China for the first time.Following the rate cut, foreign institutional investors (FIIs) purchased Indian shares worth  ₹14,468 crore, boosting total inflows for September to  ₹34,103 crore. September saw the second-highest monthly inflow for 2024, with the top inflow recorded in March at  ₹35,100 crore. According to depository data, FIIs have invested  ₹77,000 crore in Indian equities year-to-date.Amit Golia, Group CEO of MarketsMojo, pointed out that the US Federal Reserve's decision to cut rates by 50 basis points marks a significant shift in global monetary policy, with ripple effects extending to markets worldwide, including India.He explained that sectors benefiting from lower interest costs include real estate and infrastructure companies, which are heavily debt-funded. Additionally, many of the Indian NBFCs in the recent past have looked outside India to fund their capital at lower interest rates and might benefit from this regime.Golia further noted that discretionary sectors such as automotive and FMCG could also be indirect beneficiaries. The telecom sector, burdened by heavy debt, particularly with the ongoing 5G rollouts, may see enhanced profitability under the lower interest rate regime, potentially attracting greater investor interest.He added that mid-cap and small-cap companies with significant debt and relatively low valuations could also present opportunities for future value appreciation. Over the past three months, the dollar index (DXY) has declined by nearly 6 percent in anticipation of a rate cut by the Federal Reserve.Amit emphasised that Indian investors should be aware of sectors such as IT and pharmaceuticals, which have higher exposure to revenues in USD.A depreciating dollar could result in lower sales realisation in INR terms for these sectors. He advised that investors should strive to maintain a diversified portfolio to mitigate the impacts of global monetary actions. This diversification would require minimal effort in terms of rebalancing while providing satisfactory returns over the long term.“Indian market valuations are already elevated, suggesting that the potential benefits of a rate cut have largely been priced in. As a result, expecting substantial returns from investments in rate-sensitive stocks may no longer be a viable strategy. India's growth narrative remains robust, reflected in the markets commanding some of the highest valuations globally. Retail investors should focus on selecting promising companies in the right sectors and holding their positions for the long term,” Amit Golia added.","cleaned_content":"if you ve been following the indian stock market closely you ve likely heard analysts caution about the high valuations of indian equities and predict a near term correction however investors appear unfazed by these warnings as they continue to pour money into equities driving the indices to record significant milestones foreign portfolio investors fpis along with domestic institutional investors diis and retail investors have been steadily injecting billions into indian equities helping the market maintain record levels notably the flows from fpis accelerated post the us fed rate cut against this backdrop the nifty \u003cFIVE_TEN\u003e has set record highs over \u003cFIVE_TEN\u003e times in the past nine months with its most recent milestone occurring in todays trading session as it surpassed the \u003cTWO_TEN_THOUSAND\u003e level reaching a new all time high of \u003cTWO_TEN_THOUSAND\u003e moving closer to the \u003cTWO_TEN_THOUSAND\u003e level this impressive rally has driven the index to a \u003cONE_TEN_PERCENT\u003e gain so far in \u003cTWO_THOUSAND\u003e just \u003cZERO_PERCENT\u003e short of surpassing the total \u003cTWO_THOUSAND\u003e gain of \u003cTWO_TEN_PERCENT\u003e over the past nine months the index has posted gains in seven of those months with june delivering the highest monthly gain of \u003cSIX_PERCENT\u003e on policy continuity optimism followed by july with a \u003cFOUR_PERCENT\u003e increase analysts attribute the continued investor interest in indian stocks despite globally high valuations to the countrys robust economic growth potential india s economy is expanding at a pace faster than its peers with gdp projected to grow at \u003cSEVEN_PERCENT\u003e in fy25 according to a recent report by domestic brokerage firm idbi capital the indian economy is expected to add usd \u003cONE_\u003e trillion every \u003cONE_\u003e years reaching usd \u003cONE_TEN\u003e trillion by \u003cTWO_THOUSAND\u003e the report highlights that india is on the brink of a significant transformation set to become the third largest economy globally by \u003cTWO_THOUSAND\u003e the data also revealed indias rapid economic growth over the past decade while it took \u003cSIX_TEN\u003e years from \u003cONE_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e to reach a gdp of usd \u003cONE_\u003e trillion the pace has since accelerated india reached usd \u003cTWO_\u003e trillion in \u003cTWO_THOUSAND\u003e just seven years later and usd \u003cTHREE_\u003e trillion in \u003cTWO_THOUSAND\u003e after the us federal reserves decision to cut interest rates by \u003cFIVE_TEN\u003e basis points on september \u003cONE_TEN\u003e the nifty \u003cFIVE_TEN\u003e index surged by over \u003cTWO_PERCENT\u003e with rate sensitive stocks leading the rally over the last three trading sessions the nifty \u003cFIVE_TEN\u003e climbed by \u003cTWO_PERCENT\u003e gaining \u003cFIVE_HUNDRED\u003e points sensex also jumped \u003cTWO_PERCENT\u003e during this time frame this rally has driven the \u003cONE_TEN\u003e month forward price to earnings ratios of the nifty \u003cFIVE_TEN\u003e and sensex to \u003cTWO_TEN\u003e and \u003cTWO_TEN\u003e respectively making them the most expensive among emerging markets moreover the steady upward trend has also positioned indian benchmark indices ahead of their global counterparts with the nifty \u003cFIVE_TEN\u003e and sensex now ranking third and fourth in year to date ytd gains among major global exchanges japans nikkei \u003cTWO_HUNDRED\u003e and germanys dax follow closely with \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e increases respectively last week indias weightage in a key msci index topped china for the first time following the rate cut foreign institutional investors fiis purchased indian shares worth \u003cONE_TEN_THOUSAND\u003e crore boosting total inflows for september to \u003cTHREE_TEN_THOUSAND\u003e crore september saw the second highest monthly inflow for \u003cTWO_THOUSAND\u003e with the top inflow recorded in march at \u003cTHREE_TEN_THOUSAND\u003e crore according to depository data fiis have invested \u003cSEVEN_TEN_THOUSAND\u003e crore in indian equities year to date amit golia group ceo of marketsmojo pointed out that the us federal reserves decision to cut rates by \u003cFIVE_TEN\u003e basis points marks a significant shift in global monetary policy with ripple effects extending to markets worldwide including india he explained that sectors benefiting from lower interest costs include real estate and infrastructure companies which are heavily debt funded additionally many of the indian nbfcs in the recent past have looked outside india to fund their capital at lower interest rates and might benefit from this regime golia further noted that discretionary sectors such as automotive and fmcg could also be indirect beneficiaries the telecom sector burdened by heavy debt particularly with the ongoing \u003cFIVE_\u003e g rollouts may see enhanced profitability under the lower interest rate regime potentially attracting greater investor interest he added that mid cap and small cap companies with significant debt and relatively low valuations could also present opportunities for future value appreciation over the past three months the dollar index dxy has declined by nearly \u003cSIX_PERCENT\u003e in anticipation of a rate cut by the federal reserve amit emphasised that indian investors should be aware of sectors such as it and pharmaceuticals which have higher exposure to revenues in usd a depreciating dollar could result in lower sales realisation in inr terms for these sectors he advised that investors should strive to maintain a diversified portfolio to mitigate the impacts of global monetary actions this diversification would require minimal effort in terms of rebalancing while providing satisfactory returns over the long term indian market valuations are already elevated suggesting that the potential benefits of a rate cut have largely been priced in as a result expecting substantial returns from investments in rate sensitive stocks may no longer be a viable strategy indias growth narrative remains robust reflected in the markets commanding some of the highest valuations globally retail investors should focus on selecting promising companies in the right sectors and holding their positions for the long term amit golia added","timestamp":"2024-09-24T13:01:00+05:30","market_timestamp":"2024-09-24T13:01:00+05:30","off_market_hours":false}