{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-saregama-india-to-shemaroo-sumeet-bagadia-recommends-five-shares-to-buy-today-11727317513169.html","title":"Breakout stocks to buy or sell: Saregama India to Shemaroo — Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Pritish Nandy Communications or PNC, Saregama India, Shemaroo Entertainment, Optiemus Infracom, and Medicamen Biotech","content":"Breakout stocks to buy or sell: After moving into a sideways range in the last couple of sessions, the Indian stock market attempted to bounce back from the intraday low and finished higher on Wednesday. The Nifty 50 index finished 63 points higher at the 26,004 mark, the BSE Sensex gained 255 points and closed at 85,169, whereas the Nifty Bank index ended 133 points upward at 54,101. Cash market volumes on the NSE were 11.4% higher than the previous session. The Small-cap index ended marginally in the green even as the advance-decline ratio dipped to 0.96:1.Sumeet Bagadia, Executive Director at Choice Broking, believes the Indian stock market bias has improved as the Nifty 50 index closed above the psychological 26,000 mark. The Choice Broking expert said that the 50-stock index is set to touch 26,350 to 26,400 soon. Bagadia said that the positive bias in the Bank Nifty index is still intact and predicted a fresh rally in the Bank Nifty index once it breaches above 54,200 decisively. He advised investors to maintain a stock-specific approach and suggested looking at breakout stocks for intraday trading.On the outlook for the Indian stock market today, Sumeet Bagadia said, \"The positive bias of the Indian stock market has further improved as the Nifty 50 index has closed above the psychological 26,000 mark. Now, the Opening Bell on Thursday is important. If Nifty sustains above the 26,000 mark in the first hour of trade, we can expect the 50-stock index to touch 26,350 to 26,400 soon.\"Regarding breakout stocks to buy today, Sumeet Bagadia suggested buying these five shares: Pritish Nandy Communications or PNC, Saregama India, Shemaroo Entertainment, Optiemus Infracom, and Medicamen Biotech.1] PNC: Buy at  ₹78, target  ₹83.30, stop loss  ₹75.80;2] Saregama India: Buy at  ₹614.50, target  ₹650, stop loss  ₹590;3] Optiemus Infracom: Buy at  ₹841.35, target  ₹890, stop loss  ₹810;4] Medicamen Biotech: Buy at  ₹516.75, target  ₹550, stop loss  ₹499; and5] Shemaroo Entertainment: Buy at  ₹207.70, target  ₹220, stop loss  ₹200.","cleaned_content":"breakout stocks to buy or sell after moving into a sideways range in the last couple of sessions the indian stock market attempted to bounce back from the intraday low and finished higher on wednesday the nifty \u003cFIVE_TEN\u003e index finished \u003cSIX_TEN\u003e points higher at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex gained \u003cTWO_HUNDRED\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the nifty bank index ended \u003cONE_HUNDRED\u003e points upward at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were \u003cONE_TEN_PERCENT\u003e higher than the previous session the small cap index ended marginally in the green even as the advance decline ratio dipped to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes the indian stock market bias has improved as the nifty \u003cFIVE_TEN\u003e index closed above the psychological \u003cTWO_TEN_THOUSAND\u003e mark the choice broking expert said that the \u003cFIVE_TEN\u003e stock index is set to touch \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e soon bagadia said that the positive bias in the bank nifty index is still intact and predicted a fresh rally in the bank nifty index once it breaches above \u003cFIVE_TEN_THOUSAND\u003e decisively he advised investors to maintain a stock specific approach and suggested looking at breakout stocks for intraday trading on the outlook for the indian stock market today sumeet bagadia said the positive bias of the indian stock market has further improved as the nifty \u003cFIVE_TEN\u003e index has closed above the psychological \u003cTWO_TEN_THOUSAND\u003e mark now the opening bell on thursday is important if nifty sustains above the \u003cTWO_TEN_THOUSAND\u003e mark in the first hour of trade we can expect the \u003cFIVE_TEN\u003e stock index to touch \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e soon regarding breakout stocks to buy today sumeet bagadia suggested buying these five shares pritish nandy communications or pnc saregama india shemaroo entertainment optiemus infracom and medicamen biotech 1 pnc buy at \u003cSEVEN_TEN\u003e target \u003cEIGHT_TEN\u003e stop loss \u003cSEVEN_TEN\u003e \u003cTWO_\u003e saregama india buy at \u003cSIX_HUNDRED\u003e target \u003cSIX_HUNDRED\u003e stop loss \u003cFIVE_HUNDRED\u003e \u003cTHREE_\u003e optiemus infracom buy at \u003cEIGHT_HUNDRED\u003e target \u003cEIGHT_HUNDRED\u003e stop loss \u003cEIGHT_HUNDRED\u003e \u003cFOUR_\u003e medicamen biotech buy at \u003cFIVE_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e and5 shemaroo entertainment buy at \u003cTWO_HUNDRED\u003e target \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e","timestamp":"2024-09-26T08:24:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}