{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-vodafone-idea-bhel-hdfc-bank-iifl-finance-tata-steel-and-more-11727027820682.html","title":"Stocks to Watch: Vodafone Idea, BHEL, HDFC Bank, IIFL Finance, Tata Steel and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"HDFC Bank: HDB Financial Services (HDBFS), a subsidiary of HDFC Bank, is set to list its equity shares, including a fresh issue of up to  ₹2,500 crore and an offer for sale by existing shareholders. In the June quarter, HDBFS posted a 2.6 percent year-on-year growth in net profit to  ₹580 crore, with its loan book expanding 30 percent to  ₹95,600 crore.Vodafone Idea: The company faces financial pressures following the Supreme Court's ruling on AGR dues. An unexpected investor meeting is scheduled to discuss the latest developments. Vodafone Idea has also inked a three-year, $3.6 billion deal with Nokia, Ericsson, and Samsung to expand its 4G and upcoming 5G network.IIFL Finance: CARE Ratings downgraded IIFL's long-term instruments from “AA” to “AA-” due to a decline in its gold loan portfolio. Despite the recent lifting of RBI restrictions, the company’s ability to reclaim its market share remains crucial.Tata Steel: Tata Steel has inaugurated a new blast furnace at its Kalinganagar plant in Odisha, increasing its capacity from 3 million tonnes to 8 million tonnes with an investment of  ₹27,000 crore. The plant’s total capacity in Odisha now stands at 14.6 million tonnes, complemented by facilities like a pellet plant and a coke plant.Mankind Pharma: The pharmaceutical giant is set to raise up to  ₹10,000 crore via non-convertible debentures and commercial papers to finance its recent acquisition of Bharat Serums and Vaccines.Reliance Infrastructure: The company has announced a fundraising effort, including  ₹1,100 crore from promoters and  ₹1,910 crore from Mumbai-based investors. In total, Reliance Infrastructure plans to raise over  ₹6,000 crore through preferential allotments and qualified institutional placements (QIPs).Bharat Heavy Electricals Ltd (BHEL): BHEL secured an order worth  ₹6,100 crore from NTPC for an EPC package for the 1x800 MW Sipat Supercritical Thermal Power Project.Adani Total Gas: The city gas distribution joint venture between Adani Group and France’s TotalEnergies has secured a $375 million financing package from global lenders. This marks the largest global funding initiative in the city gas distribution sector.SpiceJet: The airline’s board approved the issuance of 48.7 crore equity shares to qualified institutional buyers at  ₹61.60 per share, raising  ₹2,999.99 crore.Aarti Drugs: The USFDA completed an inspection of Aarti Drugs' API manufacturing facility in Tarapur, Maharashtra, from September 12-20. The company received seven inspectional observations in Form 483, none related to data integrity.Adani Ports \u0026 SEZ: Adani Ports and Special Economic Zone (APSEZ) entered into a Memorandum of Understanding (MoU) with Rorix Holdings to integrate advanced technologies into their logistics and trading platforms. This partnership is designed to transform commodity trading and improve operational efficiencies. Karan Adani, CEO of APSEZ, emphasized that this collaboration is pivotal in their strategy to become a leading global transport and logistics infrastructure provider.ONGC: ONGC Videsh, a subsidiary of ONGC, signed a non-associated gas agreement for the Azeri-Chirag-Deepwater Gunashili (ACG) field in Azerbaijan. The field's non-associated natural gas (NAG) resources are estimated to be substantial, with around 4 trillion cubic feet (tcf) of gas in place.","cleaned_content":"hdfc bank hdb financial services hdbfs a subsidiary of hdfc bank is set to list its equity shares including a fresh issue of up to \u003cTWO_THOUSAND\u003e crore and an offer for sale by existing shareholders in the june quarter hdbfs posted a \u003cTWO_PERCENT\u003e year on year growth in net profit to \u003cFIVE_HUNDRED\u003e crore with its loan book expanding \u003cTHREE_TEN_PERCENT\u003e to \u003cNINE_TEN_THOUSAND\u003e crore vodafone idea the company faces financial pressures following the supreme courts ruling on agr dues an unexpected investor meeting is scheduled to discuss the latest developments vodafone idea has also inked a three year \u003cTHREE_\u003e billion deal with nokia ericsson and samsung to expand its \u003cFOUR_\u003e g and upcoming \u003cFIVE_\u003e g network iifl finance care ratings downgraded iifls long term instruments from aa to aa due to a decline in its gold loan portfolio despite the recent lifting of rbi restrictions the company s ability to reclaim its market share remains crucial tata steel tata steel has inaugurated a new blast furnace at its kalinganagar plant in odisha increasing its capacity from \u003cTHREE_\u003e million tonnes to \u003cEIGHT_\u003e million tonnes with an investment of \u003cTWO_TEN_THOUSAND\u003e crore the plant s total capacity in odisha now stands at \u003cONE_TEN\u003e million tonnes complemented by facilities like a pellet plant and a coke plant mankind pharma the pharmaceutical giant is set to raise up to \u003cONE_TEN_THOUSAND\u003e crore via non convertible debentures and commercial papers to finance its recent acquisition of bharat serums and vaccines reliance infrastructure the company has announced a fundraising effort including \u003cONE_THOUSAND\u003e crore from promoters and \u003cONE_THOUSAND\u003e crore from mumbai based investors in total reliance infrastructure plans to raise over \u003cSIX_THOUSAND\u003e crore through preferential allotments and qualified institutional placements qips bharat heavy electricals ltd bhel bhel secured an order worth \u003cSIX_THOUSAND\u003e crore from ntpc for an epc package for the \u003cONE_\u003e x800 mw sipat supercritical thermal power project adani total gas the city gas distribution joint venture between adani group and france s totalenergies has secured a \u003cTHREE_HUNDRED\u003e million financing package from global lenders this marks the largest global funding initiative in the city gas distribution sector spicejet the airline s board approved the issuance of \u003cFOUR_TEN\u003e crore equity shares to qualified institutional buyers at \u003cSIX_TEN\u003e per share raising \u003cTWO_THOUSAND\u003e crore aarti drugs the usfda completed an inspection of aarti drugs api manufacturing facility in tarapur maharashtra from september \u003cONE_TEN\u003e \u003cTWO_TEN\u003e the company received seven inspectional observations in form \u003cFOUR_HUNDRED\u003e none related to data integrity adani ports sez adani ports and special economic zone apsez entered into a memorandum of understanding mou with rorix holdings to integrate advanced technologies into their logistics and trading platforms this partnership is designed to transform commodity trading and improve operational efficiencies karan adani ceo of apsez emphasized that this collaboration is pivotal in their strategy to become a leading global transport and logistics infrastructure provider ongc ongc videsh a subsidiary of ongc signed a non associated gas agreement for the azeri chirag deepwater gunashili acg field in azerbaijan the fields non associated natural gas nag resources are estimated to be substantial with around \u003cFOUR_\u003e trillion cubic feet tcf of gas in place","timestamp":"2024-09-23T08:18:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}