{"url":"https://www.livemint.com/market/stock-market-news/deccan-transcon-leasing-listing-stock-lists-at-rs-116-7-4-per-cent-premium-to-ipo-price-11727158112918.html","title":"Deccan Transcon Leasing price: NSE SME stock lists at  ₹116, 7.4% premium to IPO price","description":"Shares of Deccan Transcon Leasing, a company that offers comprehensive solutions for freight and shipping services, debuted on the NSE today at  ₹116 each, reflecting a 7.4 percent premium.","content":"Deccan Transcon Leasing made a decent market debut on Tuesday, September 24. Its shares are listed at  ₹116 each on the NSE SME, representing a 7.4 percent premium over the issue price of  ₹108 apiece.The IPO achieved an overall subscription rate of 102.60 times. The SME IPO, valued at  ₹65 crore, includes a fresh issue of 55.24 lakh shares aggregating  ₹59.66 crore and an offer for sale of 5 lakh shares aggregating  ₹5.40 crore.The company plans to use the net proceeds from the fresh issue for capital expenditure requirements towards procurement of tank containers, working capital requirements of the company, and general corporate purposes.The company provides end-to-end solutions for freight and shipping services, which include domestic logistics of tank containers, tank fleet management solutions, customs clearance and transportation, and non-vessel operating common carriers (NVOCC) services.It primarily provides tank containers on lease and logistic and supply chain solutions to clients in various sectors. The company specialises in the transportation of bulk liquids and hazardous chemicals, primarily utilising tank containers as a mode of transport.One of the company's key strengths is its extensive agency network, built over years of experience in the industry. This network provides access to shippers worldwide, enabling it to cater to clients' logistics needs globally.Additionally, the company has established a strong network of partners with global coverage, apart from its own subsidiary and associate company, allowing it to provide complete, end-to-end logistics solutions.Having all tank container services under one roof enables the company to offer services tailored to meet specific customer needs. As of December 31, 2023, more than 100 customers have been associated with the company for longer than three years. It has served more than 750 customers in the last year, as per the company's DRHP report.","cleaned_content":"deccan transcon leasing made a decent market debut on tuesday september \u003cTWO_TEN\u003e its shares are listed at \u003cONE_HUNDRED\u003e each on the nse sme representing a \u003cSEVEN_PERCENT\u003e premium over the issue price of \u003cONE_HUNDRED\u003e apiece the ipo achieved an overall subscription rate of \u003cONE_HUNDRED\u003e times the sme ipo valued at \u003cSIX_TEN\u003e crore includes a fresh issue of \u003cFIVE_TEN\u003e lakh shares aggregating \u003cFIVE_TEN\u003e crore and an offer for sale of \u003cFIVE_\u003e lakh shares aggregating \u003cFIVE_\u003e crore the company plans to use the net proceeds from the fresh issue for capital expenditure requirements towards procurement of tank containers working capital requirements of the company and general corporate purposes the company provides end to end solutions for freight and shipping services which include domestic logistics of tank containers tank fleet management solutions customs clearance and transportation and non vessel operating common carriers nvocc services it primarily provides tank containers on lease and logistic and supply chain solutions to clients in various sectors the company specialises in the transportation of bulk liquids and hazardous chemicals primarily utilising tank containers as a mode of transport one of the companys key strengths is its extensive agency network built over years of experience in the industry this network provides access to shippers worldwide enabling it to cater to clients logistics needs globally additionally the company has established a strong network of partners with global coverage apart from its own subsidiary and associate company allowing it to provide complete end to end logistics solutions having all tank container services under one roof enables the company to offer services tailored to meet specific customer needs as of december \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e more than \u003cONE_HUNDRED\u003e customers have been associated with the company for longer than three years it has served more than \u003cSEVEN_HUNDRED\u003e customers in the last year as per the companys drhp report","timestamp":"2024-09-24T11:55:00+05:30","market_timestamp":"2024-09-24T11:55:00+05:30","off_market_hours":false}