{"url":"https://www.livemint.com/market/stock-market-news/buy-calls-are-slowly-vanishing-from-booming-indian-stock-market-rally-equity-earnings-nifty-bse-valuation-margins-growth-11727226453342.html","title":"Buy calls are slowly vanishing from India’s booming stock market","description":"Analysts struggle to recommend stocks in India's $5 trillion equity market, with only 61 stocks on the NSE Nifty 200 index rated as ‘buy’—the lowest in a decade. Many stocks are deemed overpriced, prompting a shift toward larger, reasonably valued stocks as earnings growth slows.","content":"Analysts are having a hard time recommending stocks worth buying in India’s $5 trillion equity market.The number of stocks on the NSE Nifty 200 index with a consensus ‘buy’ rating totaled 61 as of Tuesday, the lowest in at least a decade, data analyzed by Bloomberg show. LIC Housing Finance Ltd., Sun TV Network Ltd. and Dr. Lal PathLabs Ltd. are among stocks that saw multiple downgrades this quarter, putting their average analyst rating at ‘hold’.A dimmer outlook for corporate earnings in one of the world’s most expensive stock markets is making analysts skeptical of further gains in some of the shares that drove a years-long rally in Indian equities, now in its ninth year.“Many stocks have now become obscenely expensive,” said Sahil Kapoor, a strategist at DSP Mutual Fund. Analysts are rolling forward their earnings estimates as sales growth is weak and margins are already at their peak, he said.The Nifty 200 index is valued at about 24 times its 12-month forward earnings estimates, versus last decade’s mean of about 19 times. Corporate profits, which partly drove the valuation multiples, are set to slow. Kotak Institutional Equities estimates earnings for the benchmark Nifty 50 firms to grow at 8.4% in the current fiscal year ending March 2025, against 20% last year.Indian stocks have been hitting successive records, with both domestic and overseas investors betting on the nation’s rapid economic expansion. A risk-on sentiment in global markets following the Federal Reserve’s jumbo rate cut last week sent Nifty to a fresh peak on Tuesday.While market watchers debate whether the recent returns can be sustained, an investment shift appears to be underway. Some investors are moving to larger stocks, where valuations seem reasonable, while others are rotating funds to sectors like financials, which have trailed the broader market rally.As analysts revise their calls, more than two-third of the Nifty 200 stocks now carry a ‘hold’ recommendation, compared to an almost equal split between buy and hold a decade ago. The shift reflects a more cautious stance, even as India remains a bright spot globally despite concerns around expensive valuations. Notably, only five of the 196 stocks under review have a sell rating, little changed from 2015.“India being a growth market, analysts would try to have a buy or hold rating rather than a sell,” said Kapoor.Methodology: The study rates each analyst’s rating on a scale of five (buy) to one (sell) to find the average consensus rating. If the value is equal to or above four, the stock is counted a consensus buy, while an average rating of two or below considers it a consensus sell. Those falling in the middle are taken as a hold.","cleaned_content":"analysts are having a hard time recommending stocks worth buying in india s \u003cFIVE_\u003e trillion equity market the number of stocks on the nse nifty \u003cTWO_HUNDRED\u003e index with a consensus buy rating totaled \u003cSIX_TEN\u003e as of tuesday the lowest in at least a decade data analyzed by bloomberg show lic housing finance ltd sun tv network ltd and dr lal pathlabs ltd are among stocks that saw multiple downgrades this quarter putting their average analyst rating at hold a dimmer outlook for corporate earnings in one of the world s most expensive stock markets is making analysts skeptical of further gains in some of the shares that drove a years long rally in indian equities now in its ninth year many stocks have now become obscenely expensive said sahil kapoor a strategist at dsp mutual fund analysts are rolling forward their earnings estimates as sales growth is weak and margins are already at their peak he said the nifty \u003cTWO_HUNDRED\u003e index is valued at about \u003cTWO_TEN\u003e times its \u003cONE_TEN\u003e month forward earnings estimates versus last decade s mean of about \u003cONE_TEN\u003e times corporate profits which partly drove the valuation multiples are set to slow kotak institutional equities estimates earnings for the benchmark nifty \u003cFIVE_TEN\u003e firms to grow at \u003cEIGHT_PERCENT\u003e in the current fiscal year ending march \u003cTWO_THOUSAND\u003e against \u003cTWO_TEN_PERCENT\u003e last year indian stocks have been hitting successive records with both domestic and overseas investors betting on the nation s rapid economic expansion a risk on sentiment in global markets following the federal reserve s jumbo rate cut last week sent nifty to a fresh peak on tuesday while market watchers debate whether the recent returns can be sustained an investment shift appears to be underway some investors are moving to larger stocks where valuations seem reasonable while others are rotating funds to sectors like financials which have trailed the broader market rally as analysts revise their calls more than two third of the nifty \u003cTWO_HUNDRED\u003e stocks now carry a hold recommendation compared to an almost equal split between buy and hold a decade ago the shift reflects a more cautious stance even as india remains a bright spot globally despite concerns around expensive valuations notably only five of the \u003cONE_HUNDRED\u003e stocks under review have a sell rating little changed from \u003cTWO_THOUSAND\u003e india being a growth market analysts would try to have a buy or hold rating rather than a sell said kapoor methodology the study rates each analyst s rating on a scale of five buy to one sell to find the average consensus rating if the value is equal to or above four the stock is counted a consensus buy while an average rating of two or below considers it a consensus sell those falling in the middle are taken as a hold","timestamp":"2024-09-25T07:40:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}