{"url":"https://www.livemint.com/market/stock-market-news/unilex-colours-and-chemicals-ipo-day-1-check-for-subscription-status-gmp-key-dates-all-you-need-to-know-11727256533241.html","title":"Unilex Colours and Chemicals IPO Day 3: Check for Subscription status, GMP, key dates, all you need to know","description":"Unilex Colours and Chemicals Limited IPO: The issue opened for subscription on 25 September. Check here for Subscription status, GMP, key dates, all you need to know","content":"Unilex Colours and Chemicals Limited IPO (Unilex Colours and Chemicals IPO): The issue opened for subscription on 25 September. Check here for Subscription status, GMP, key dates, all you need to knowUnilex Colours and Chemicals IPO subscribed 32.53 times. By September 27 2024, 4:05 PM, the public issue had been subscribed 30.44 times in the retail category, 15.58 times in the QIB category, and 59.97 times in the NII category as per chittorgarh.com dataThe subscription period for the Unilex Colours and Chemicals IPO begins on September 25, 2024, and ends on September 27, 2024. On Monday, September 30, 2024, the allocation for the Unilex Colors and Chemicals IPO is anticipated to be completed. The proposed listing date for the Unilex Colours and Chemicals IPO is Thursday, October 3, 2024, and it will be place on the NSE SME.The book-built issue of Unilex Colors \u0026 Chemicals is valued at  ₹31.32 crores. where the company is issuing 36 lakh fresh shares.The IPO pricing range or Price Band for Unilex Colors and Chemicals is  ₹82 to  ₹87 per share. A minimum lot size of 1600 shares is required for an application by the retail investors. Considering the IPO price Band and lot size the retail investors are needed to invest a minimum of  ₹139,200. For HNI, a minimum investment of two lots (3,200 shares) means a minimum requirement of  ₹278,400.Based on information from Investorgain.com, the GMP for the Unilex Colours and Chemicals IPO was +13. This implies that shares of Unilex Colours and Chemicals initial public offering (IPO) are available at  ₹13 premium over the issue price in the grey market.The market participants thereby are expecting listing of Unilex Colours and Chemicals share price at  ₹100, which is 14.94% higher than the upper band of the issue price of  ₹87.Unilex Colours and Chemicals IPO","cleaned_content":"unilex colours and chemicals limited ipo unilex colours and chemicals ipo the issue opened for subscription on \u003cTWO_TEN\u003e september check here for subscription status gmp key dates all you need to knowunilex colours and chemicals ipo subscribed \u003cTHREE_TEN\u003e times by september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e \u003cFOUR_\u003e \u003cFIVE_\u003e pm the public issue had been subscribed \u003cTHREE_TEN\u003e times in the retail category \u003cONE_TEN\u003e times in the qib category and \u003cFIVE_TEN\u003e times in the nii category as per chittorgarh com datathe subscription period for the unilex colours and chemicals ipo begins on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and ends on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e on monday september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the allocation for the unilex colors and chemicals ipo is anticipated to be completed the proposed listing date for the unilex colours and chemicals ipo is thursday october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e and it will be place on the nse sme the book built issue of unilex colors chemicals is valued at \u003cTHREE_TEN\u003e crores where the company is issuing \u003cTHREE_TEN\u003e lakh fresh shares the ipo pricing range or price band for unilex colors and chemicals is \u003cEIGHT_TEN\u003e to \u003cEIGHT_TEN\u003e per share a minimum lot size of \u003cONE_THOUSAND\u003e shares is required for an application by the retail investors considering the ipo price band and lot size the retail investors are needed to invest a minimum of \u003cONE_HUNDRED_THOUSAND\u003e for hni a minimum investment of two lots \u003cTHREE_THOUSAND\u003e shares means a minimum requirement of \u003cTWO_HUNDRED_THOUSAND\u003e based on information from investorgain com the gmp for the unilex colours and chemicals ipo was \u003cONE_TEN\u003e this implies that shares of unilex colours and chemicals initial public offering ipo are available at \u003cONE_TEN\u003e premium over the issue price in the grey market the market participants thereby are expecting listing of unilex colours and chemicals share price at \u003cONE_HUNDRED\u003e which is \u003cONE_TEN_PERCENT\u003e higher than the upper band of the issue price of \u003cEIGHT_TEN\u003e unilex colours and chemicals ipo","timestamp":"2024-09-26T16:52:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}