{"url":"https://www.livemint.com/market/stock-market-news/aadhar-housing-finance-share-price-jumps-to-record-high-experts-remain-bullish-on-the-stock-heres-what-they-say-11727076648035.html","title":"Aadhar Housing Finance share price jumps to record high. Experts remain bullish on the stock; here’s what they say","description":"Aadhar Housing Finance shares rose 8.5% to a record high of  ₹503.40, reflecting a 72% gain from its 52-week low in just about four months. Analysts are optimistic about its growth potential, with JM Financial and Kotak recommending buy ratings and target prices of  ₹600 and  ₹550, respectively.","content":"Aadhar Housing Finance share price surged 8.5 per cent to hit its fresh all-time high of  ₹503.40 in intraday trade on the BSE on Monday, September 23. Shares of Aadhar Housing Finance opened at  ₹478.25 against its previous close of  ₹464.05 and jumped as much as 8.5 per cent to hit its record high level. The stock finally closed 7.60 per cent higher at  ₹499.30 apiece. Equity benchmark Sensex closed 0.45 per cent up at 84,928.61.The stock has seen healthy gains over the last six months, and experts believe it has more steam left. Aadhar Housing Finance share price hit its 52-week low of  ₹293.35 on May 15 this year but has been rising since. At the current high of  ₹503.40, the stock has gained 72 per cent from its one-year low level in just four months.Aadhar Housing looks poised to reap the benefits of momentum in the housing finance sector, which is one of the few that are maintaining healthy momentum, especially in affordable housing.\"Aadhar Housing is well-positioned with a balanced mix of salaried and self-employed clients and geographic diversification. We see strong potential for growth and believe that the current valuations present a favourable risk-reward scenario,\" said Jignesh Shial, Director - Research, Head of BFSI Sector at InCred Capital.Experts are positive about the stock for the long term as they highlight the company's bright growth prospects.Expressing its bullish view on India's largest listed affordable housing financier, brokerage firm JM Financial has initiated coverage on the stock with a buy call and a target price of  ₹600, implying an upside potential of 29 per cent from the stock's Friday (September 20) close of  ₹464.05 on the BSE.\"Aadhar has the longest track record in the affordable housing space with total asset under management (AUM) of  ₹21,700 crore. Post-acquisition by Blackstone L.P., the company has made significant progress in corporate governance, growth, efficiency and profitability,\" JM Financial observed.The brokerage firm pointed out that Aadhar's diversified presence across 21 states should mean healthy growth.\"The company's graded branch expansion strategy allows it to set footprints in tier-4/5 areas at cheaper costs while using Aadhar Mitra (lead generation channel) and smart use of tech to handle day-to-day operations significantly contribute to operational efficiencies,\" JM Financial said.Despite the start of the potential interest rate cut cycle in India, the brokerage firm expects Aadhar’s margins to remain stable and credit costs to remain benign due to its well-matched and positive ALM (asset liability management) mix as it has 78 per cent floating liabilities versus 80 per cent floating assets.\"We expect Aadhar to deliver an EPS (earning per share) CAGR of 26 per cent over FY24- 26E led by: (i) a 23 per cent CAGR AUM growth, (ii) steady margins, (iii) operating leverage, and (iv) steady credit costs. This entails RoAs (return on assets) of 4.3 per cent and 4.5 per cent for FY25E and FY26E, respectively. Due to an IPO infusion of  ₹1000 crore, RoEs (return on equities) will continue to be robust at 17 per cent (versus 18.4 per cent in FY24),\" said JM Financial.Earlier in September, brokerage firm Kotak Institutional Equities initiated coverage on the stock with a 'buy' rating and set a target price of  ₹550 apiece.As Mint reported earlier, Kotak noted that Aadhar stands out among its affordable housing finance peers due to its larger balance sheet, longer operational history, and superior RoE. The brokerage firm also pointed out that Aadhar's projected loan growth of 21 per cent CAGR during FY2024-27 is more in line with mature housing finance companies than smaller, faster-growing affordable housing finance companies.The stock's fundamentals appear strong at this point, and technical indicators also point to positive short-term momentum.Ameya Ranadive, CMT CFTe, Senior Technical Analyst at StoxBox, underscored that the stock had previously faced resistance in the  ₹485-490 zone back in July. This time, it has managed to break through, signalling the potential for further upside.\"The stock must hold above  ₹490 for sustained gains over the next few trading sessions. Technically, the Relative Strength Index (RSI) is at 71, indicating that the stock is in overbought territory, which may suggest a pause or minor correction in the short term. On the other hand, the ADX (Average Directional Index) is at 28, reflecting a strong underlying trend, though not yet in extreme territory. The combination of these indicators suggests that while the stock has momentum, investors should watch for consolidation before a potential breakout,\" Ranadive said.\"Fundamentally, Aadhar Housing Finance benefits from strong growth prospects in the housing finance sector, which are driven by increasing demand for affordable housing. The company’s fundamentals and technical positioning suggest a positive outlook, with targets set at  ₹550 and  ₹580, provided it maintains support above  ₹490. A close below this level could shift the view towards caution, as the stock had previously corrected from this level,\" said Ranadive.According to Pravesh Gour, Senior Technical Analyst at Swastika Investment, on the daily chart, the stock has witnessed an inverse head and shoulder with strong volume. It has also given a V-shaped recovery from the last breakout level of  ₹380.\"The overall structure of the counter is also very impressive, as it is trading above all its important moving averages. The MACD (Moving Average Convergence Divergence) reinforces the current bullish momentum, while the RSI (Relative Strength Index) remains favourably positioned, further supporting the positive outlook,\" said Gour.\"On the higher side,  ₹500 is acting as an important psychological level; above this, we can expect a level of  ₹600+ in the near-short term, while on the lower side,  ₹440 will act as a major support during any correction,\" Gour said.Read all market-related news here","cleaned_content":"aadhar housing finance share price surged \u003cEIGHT_PERCENT\u003e to hit its fresh all time high of \u003cFIVE_HUNDRED\u003e in intraday trade on the bse on monday september \u003cTWO_TEN\u003e shares of aadhar housing finance opened at \u003cFOUR_HUNDRED\u003e against its previous close of \u003cFOUR_HUNDRED\u003e and jumped as much as \u003cEIGHT_PERCENT\u003e to hit its record high level the stock finally closed \u003cSEVEN_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece equity benchmark sensex closed \u003cZERO_PERCENT\u003e up at \u003cEIGHT_TEN_THOUSAND\u003e the stock has seen healthy gains over the last six months and experts believe it has more steam left aadhar housing finance share price hit its \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e on may \u003cONE_TEN\u003e this year but has been rising since at the current high of \u003cFIVE_HUNDRED\u003e the stock has gained \u003cSEVEN_TEN_PERCENT\u003e from its one year low level in just four months aadhar housing looks poised to reap the benefits of momentum in the housing finance sector which is one of the few that are maintaining healthy momentum especially in affordable housing aadhar housing is well positioned with a balanced mix of salaried and self employed clients and geographic diversification we see strong potential for growth and believe that the current valuations present a favourable risk reward scenario said jignesh shial director research head of bfsi sector at incred capital experts are positive about the stock for the long term as they highlight the companys bright growth prospects expressing its bullish view on indias largest listed affordable housing financier brokerage firm jm financial has initiated coverage on the stock with a buy call and a target price of \u003cSIX_HUNDRED\u003e implying an upside potential of \u003cTWO_TEN_PERCENT\u003e from the stocks friday september \u003cTWO_TEN\u003e close of \u003cFOUR_HUNDRED\u003e on the bse aadhar has the longest track record in the affordable housing space with total asset under management aum of \u003cTWO_TEN_THOUSAND\u003e crore post acquisition by blackstone l p the company has made significant progress in corporate governance growth efficiency and profitability jm financial observed the brokerage firm pointed out that aadhars diversified presence across \u003cTWO_TEN\u003e states should mean healthy growth the companys graded branch expansion strategy allows it to set footprints in tier \u003cFOUR_\u003e \u003cFIVE_\u003e areas at cheaper costs while using aadhar mitra lead generation channel and smart use of tech to handle day to day operations significantly contribute to operational efficiencies jm financial said despite the start of the potential interest rate cut cycle in india the brokerage firm expects aadhar s margins to remain stable and credit costs to remain benign due to its well matched and positive alm asset liability management mix as it has \u003cSEVEN_TEN_PERCENT\u003e floating liabilities versus \u003cEIGHT_TEN_PERCENT\u003e floating assets we expect aadhar to deliver an eps earning per share cagr of \u003cTWO_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e led by i a \u003cTWO_TEN_PERCENT\u003e cagr aum growth ii steady margins iii operating leverage and iv steady credit costs this entails roas return on assets of \u003cFOUR_PERCENT\u003e and \u003cFOUR_PERCENT\u003e for fy25e and fy26e respectively due to an ipo infusion of \u003cONE_THOUSAND\u003e crore roes return on equities will continue to be robust at \u003cONE_TEN_PERCENT\u003e versus \u003cONE_TEN_PERCENT\u003e in fy24 said jm financial earlier in september brokerage firm kotak institutional equities initiated coverage on the stock with a buy rating and set a target price of \u003cFIVE_HUNDRED\u003e apiece as mint reported earlier kotak noted that aadhar stands out among its affordable housing finance peers due to its larger balance sheet longer operational history and superior roe the brokerage firm also pointed out that aadhars projected loan growth of \u003cTWO_TEN_PERCENT\u003e cagr during fy2024 \u003cTWO_TEN\u003e is more in line with mature housing finance companies than smaller faster growing affordable housing finance companies the stocks fundamentals appear strong at this point and technical indicators also point to positive short term momentum ameya ranadive cmt cfte senior technical analyst at stoxbox underscored that the stock had previously faced resistance in the \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e zone back in july this time it has managed to break through signalling the potential for further upside the stock must hold above \u003cFOUR_HUNDRED\u003e for sustained gains over the next few trading sessions technically the relative strength index rsi is at \u003cSEVEN_TEN\u003e indicating that the stock is in overbought territory which may suggest a pause or minor correction in the short term on the other hand the adx average directional index is at \u003cTWO_TEN\u003e reflecting a strong underlying trend though not yet in extreme territory the combination of these indicators suggests that while the stock has momentum investors should watch for consolidation before a potential breakout ranadive said fundamentally aadhar housing finance benefits from strong growth prospects in the housing finance sector which are driven by increasing demand for affordable housing the company s fundamentals and technical positioning suggest a positive outlook with targets set at \u003cFIVE_HUNDRED\u003e and \u003cFIVE_HUNDRED\u003e provided it maintains support above \u003cFOUR_HUNDRED\u003e a close below this level could shift the view towards caution as the stock had previously corrected from this level said ranadive according to pravesh gour senior technical analyst at swastika investment on the daily chart the stock has witnessed an inverse head and shoulder with strong volume it has also given a v shaped recovery from the last breakout level of \u003cTHREE_HUNDRED\u003e the overall structure of the counter is also very impressive as it is trading above all its important moving averages the macd moving average convergence divergence reinforces the current bullish momentum while the rsi relative strength index remains favourably positioned further supporting the positive outlook said gour on the higher side \u003cFIVE_HUNDRED\u003e is acting as an important psychological level above this we can expect a level of \u003cSIX_HUNDRED\u003e in the near short term while on the lower side \u003cFOUR_HUNDRED\u003e will act as a major support during any correction gour said read all market related news here","timestamp":"2024-09-23T16:26:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}