{"url":"https://www.livemint.com/market/stock-market-news/zee-media-share-price-jumps-19-amid-fundraise-plans-11727253778111.html","title":"Zee Media share price jumps 19% amid fund raising plans","description":"ZMCL share price: Zee Media stock surges on news the company plans to raise funds. Shares of the media company jumped 19% on Wednesday after it announced plans for an upcoming board meeting to discuss potential fundraising options, including private and qualified institutional placements.","content":"Zee Media Corporation's stock price jumped 19 per cent to  ₹16.5 during September 25, Wednesday's trading session on the BSE. This surge followed the company's announcement of an upcoming board meeting to discuss potential fundraising options, per an exchange filing.The media company revealed in a regulatory filing that its board of directors will convene on September 27, 2024, to consider various fundraising methods. These could include \"private placement, qualified institutional placement, preferential issue, or other combinations,\" subject to necessary approvals.Zee Media's share price was trading in the green, up 11.52 per cent, at  ₹15.58, on September 25, at 2:17 pm, on the NSE. The company enjoys a market capitalisation of  ₹974.42 crore, as per NSE. Zee Media Corporation's stock price hit its 52-week high on December 12, 2023, at  ₹18.30.This meeting builds upon earlier decisions made by the company's board and shareholders on June 26 and August 10, 2024, respectively. The proposed fundraising will require regulatory clearances, with specific terms to be determined during the upcoming meeting.By 11:29 am, Zee Media shares had moderated slightly but were still trading 15 per cent higher at  ₹16.06 on the BSE. The stock has shown strong performance over recent months, with a 45 per cent increase in the last six months and a 32 per cent rise over the past year. This outpaces the Nifty index, which gained 28.6 per cent during the same 12-month period.As of June 2024, the ownership structure of Zee Media Corporation shows that 0.42 per cent of equity is held by the promoter and promoter group, while the remaining 99.58 per cent is in the hands of public shareholders.","cleaned_content":"zee media corporations stock price jumped \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN\u003e during september \u003cTWO_TEN\u003e wednesdays trading session on the bse this surge followed the companys announcement of an upcoming board meeting to discuss potential fundraising options per an exchange filing the media company revealed in a regulatory filing that its board of directors will convene on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to consider various fundraising methods these could include private placement qualified institutional placement preferential issue or other combinations subject to necessary approvals zee medias share price was trading in the green up \u003cONE_TEN_PERCENT\u003e at \u003cONE_TEN\u003e on september \u003cTWO_TEN\u003e at \u003cTWO_\u003e \u003cONE_TEN\u003e pm on the nse the company enjoys a market capitalisation of \u003cNINE_HUNDRED\u003e crore as per nse zee media corporations stock price hit its \u003cFIVE_TEN\u003e week high on december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cONE_TEN\u003e this meeting builds upon earlier decisions made by the companys board and shareholders on june \u003cTWO_TEN\u003e and august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e respectively the proposed fundraising will require regulatory clearances with specific terms to be determined during the upcoming meeting by \u003cONE_TEN\u003e \u003cTWO_TEN\u003e am zee media shares had moderated slightly but were still trading \u003cONE_TEN_PERCENT\u003e higher at \u003cONE_TEN\u003e on the bse the stock has shown strong performance over recent months with a \u003cFOUR_TEN_PERCENT\u003e increase in the last six months and a \u003cTHREE_TEN_PERCENT\u003e rise over the past year this outpaces the nifty index which gained \u003cTWO_TEN_PERCENT\u003e during the same \u003cONE_TEN\u003e month period as of june \u003cTWO_THOUSAND\u003e the ownership structure of zee media corporation shows that \u003cZERO_PERCENT\u003e of equity is held by the promoter and promoter group while the remaining \u003cNINE_TEN_PERCENT\u003e is in the hands of public shareholders","timestamp":"2024-09-25T14:27:00+05:30","market_timestamp":"2024-09-25T14:27:00+05:30","off_market_hours":false}