{"url":"https://www.livemint.com/market/stock-market-news/nse-bse-revise-transaction-fees-effective-from-october-1-details-here-11727447339488.html","title":"NSE, BSE revise transaction fees effective from October 1; details here","description":"Meanwhile, the transaction charges for other contracts in the equity derivatives segment will remain unchanged. For Sensex 50 options and stock options, BSE imposes a transaction fee of  ₹500 per crore of premium turnover value. There is no transaction fee for index and stock futures.","content":"Bombay Stock Exchange (BSE), on Friday, revised the transaction fees for Sensex and Bankex options contracts in the equity derivatives segment to  ₹3,250 per crore of premium turnover. The revised rate will take effect from Tuesday, October 1.Meanwhile, the transaction charges for other contracts in the equity derivatives segment will remain unchanged. For Sensex 50 options and stock options, BSE imposes a transaction fee of  ₹500 per crore of premium turnover value. There is no transaction fee for index and stock futures.The NSE also introduced new transaction charges across various segments. In the cash market, a fee of  ₹2.97 will be applied per lakh of traded value on each side, while in equity futures, the charge will be  ₹1.73 per lakh of traded value on each side.For equity options, the transaction fee will be  ₹35.03 per lakh of premium value on both sides. For NSE currency futures, the fee will be  ₹0.35 per lakh of traded value on each side. For currency options and interest rate options, the charge will be  ₹31.10 per lakh of premium value on both sides.The changes in the fee structure were implemented following a circular issued by the Securities and Exchange Board of India (Sebi) on July 1, 2024, regarding the charges imposed by Market Infrastructure Institutions (MIIs). The circular instructed MIIs to adopt a uniform and equal charge structure for all members, replacing the current volume-based slab structure.Additionally, Sebi mandated that the charges recovered by trading members from their end clients must be \"True to Label,\" meaning the amount collected from clients should exactly match the amount paid by the trading members to the MIIs.The directive seeks to standardize the diverse slab-based fees currently imposed by various stock exchanges according to volume or activity. This adjustment will eliminate any size- or activity-based advantages among members and promote transparency for end clients.Earlier this week, the Multi Commodity Exchange of India Ltd. (MCX) also updated its transaction fees for futures and options contracts, effective from October 1st. The transaction fee for futures contracts is now set at  ₹2.1 per lakh of turnover value, while the fee for options contracts has been revised to  ₹41.8 per lakh of premium turnover value.","cleaned_content":"bombay stock exchange bse on friday revised the transaction fees for sensex and bankex options contracts in the equity derivatives segment to \u003cTHREE_THOUSAND\u003e per crore of premium turnover the revised rate will take effect from tuesday october \u003cONE_\u003e meanwhile the transaction charges for other contracts in the equity derivatives segment will remain unchanged for sensex \u003cFIVE_TEN\u003e options and stock options bse imposes a transaction fee of \u003cFIVE_HUNDRED\u003e per crore of premium turnover value there is no transaction fee for index and stock futures the nse also introduced new transaction charges across various segments in the cash market a fee of \u003cTWO_\u003e will be applied per lakh of traded value on each side while in equity futures the charge will be \u003cONE_\u003e per lakh of traded value on each side for equity options the transaction fee will be \u003cTHREE_TEN\u003e per lakh of premium value on both sides for nse currency futures the fee will be \u003cZERO_\u003e per lakh of traded value on each side for currency options and interest rate options the charge will be \u003cTHREE_TEN\u003e per lakh of premium value on both sides the changes in the fee structure were implemented following a circular issued by the securities and exchange board of india sebi on july \u003cONE_\u003e \u003cTWO_THOUSAND\u003e regarding the charges imposed by market infrastructure institutions miis the circular instructed miis to adopt a uniform and equal charge structure for all members replacing the current volume based slab structure additionally sebi mandated that the charges recovered by trading members from their end clients must be true to label meaning the amount collected from clients should exactly match the amount paid by the trading members to the miis the directive seeks to standardize the diverse slab based fees currently imposed by various stock exchanges according to volume or activity this adjustment will eliminate any size or activity based advantages among members and promote transparency for end clients earlier this week the multi commodity exchange of india ltd mcx also updated its transaction fees for futures and options contracts effective from october \u003cONE_\u003e st the transaction fee for futures contracts is now set at \u003cTWO_\u003e per lakh of turnover value while the fee for options contracts has been revised to \u003cFOUR_TEN\u003e per lakh of premium turnover value","timestamp":"2024-09-27T20:01:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}