{"url":"https://www.livemint.com/market/stock-market-news/vedanta-share-price-13-50-dividend-yield-98-return-in-ytd-is-this-a-stock-to-buy-11727495124109.html","title":"Vedanta share price: 13.50% dividend yield, 98% return in YTD. Is this a stock to buy?","description":"Vedanta share price has risen from  ₹258.50 apiece to  ₹512 per share in YTD","content":"Dividend stock to buy: Vedanta shares are one of those dividend stocks that gave its shareholders stellar returns and a high dividend yield in 2024. According to the information on the BSE website, Vedanta delivered three dividends ( ₹11,  ₹4 and  ₹20 per share) in 2024, leading to an annual dividend yield of over 13.50%. This Vedanta dividend yield in 2024 is higher than many guarantees and assured return options like Public Provident Fund (PPF), Sukanya Samriddhi Yojana (SSY), bank fixed deposits (FDs), etc. Vedanta's share price recently experienced a technical breakout, which has attracted the attention of Indian stock market bulls.According to stock market experts, Vedanta shares have delivered resilience despite global challenges to the company's business. The metal company has delivered positive quarterly numbers and recently gave a fresh technical breakout on the chart pattern. They said that Vedanta shares look positive on the chart pattern and may soon touch  ₹575 apiece.Regarding why Vedanta shares are skyrocketing, Ravi Singh, SVP of Retail Research at Religare Broking, said, “Vedanta Limited operates across sectors like zinc, oil and gas, aluminium, and iron ore. The company has demonstrated strong earnings and resilience despite global challenges. Its profitability and operational efficiency remain robust, supported by favorable commodity prices. With a solid market position and improved demand in the energy and metals sectors, Vedanta's share is expected to reach 550 levels soon.”Speaking on the technical setup regarding Vedanta shares, Sumeet Bagadia, Executive Director at Choice Broking, said, “Currently, Vedanta share price is trading at  ₹513 and has recently broken out of a Rounding Bottom pattern on the daily chart. Vedanta share has moved beyond its consolidation range and closed sustainably above the  ₹500 level, suggesting potential targets in the short term around  ₹560 to  ₹575. Immediate support for the dividend stock is identified near  ₹490. The breakout was accompanied by a significant increase in trading volumes, indicating strength in the upward move.”On the suggestion to investors regarding Vedanta shares, Bagadia said, \"Investors could consider buying on dips, with a stop loss at  ₹490 to manage risk. The target price of  ₹560 to  ₹575 aligns with resistance levels, offering a favourable risk-reward ratio and making this a promising trading opportunity.\"Vedanta has recently declared its board meeting to consider the fourth dividend proposal. However, taking the first three Vedanta dividends, the annual Vedanta dividend yield is  ₹35 ( ₹11 +  ₹4 +  ₹20). As Vedanta's share price was around  ₹258.50 at the end of 2023, the annual dividend yield of Vedanta comes to around 13.50%, which is much higher than the PPOF interest rate, SSY interest rate and bank FD interest rates. So, Vedanta's dividend yield is much higher than PPF, SSY, and bank FD returns.In CY24, Vedanta's share price rose from  ₹258.50 apiece to  ₹512 per share, a 98% increase year over year.","cleaned_content":"dividend stock to buy vedanta shares are one of those dividend stocks that gave its shareholders stellar returns and a high dividend yield in \u003cTWO_THOUSAND\u003e according to the information on the bse website vedanta delivered three dividends \u003cONE_TEN\u003e \u003cFOUR_\u003e and \u003cTWO_TEN\u003e per share in \u003cTWO_THOUSAND\u003e leading to an annual dividend yield of over \u003cONE_TEN_PERCENT\u003e this vedanta dividend yield in \u003cTWO_THOUSAND\u003e is higher than many guarantees and assured return options like public provident fund ppf sukanya samriddhi yojana ssy bank fixed deposits fds etc vedantas share price recently experienced a technical breakout which has attracted the attention of indian stock market bulls according to stock market experts vedanta shares have delivered resilience despite global challenges to the companys business the metal company has delivered positive quarterly numbers and recently gave a fresh technical breakout on the chart pattern they said that vedanta shares look positive on the chart pattern and may soon touch \u003cFIVE_HUNDRED\u003e apiece regarding why vedanta shares are skyrocketing ravi singh svp of retail research at religare broking said vedanta limited operates across sectors like zinc oil and gas aluminium and iron ore the company has demonstrated strong earnings and resilience despite global challenges its profitability and operational efficiency remain robust supported by favorable commodity prices with a solid market position and improved demand in the energy and metals sectors vedantas share is expected to reach \u003cFIVE_HUNDRED\u003e levels soon speaking on the technical setup regarding vedanta shares sumeet bagadia executive director at choice broking said currently vedanta share price is trading at \u003cFIVE_HUNDRED\u003e and has recently broken out of a rounding bottom pattern on the daily chart vedanta share has moved beyond its consolidation range and closed sustainably above the \u003cFIVE_HUNDRED\u003e level suggesting potential targets in the short term around \u003cFIVE_HUNDRED\u003e to \u003cFIVE_HUNDRED\u003e immediate support for the dividend stock is identified near \u003cFOUR_HUNDRED\u003e the breakout was accompanied by a significant increase in trading volumes indicating strength in the upward move on the suggestion to investors regarding vedanta shares bagadia said investors could consider buying on dips with a stop loss at \u003cFOUR_HUNDRED\u003e to manage risk the target price of \u003cFIVE_HUNDRED\u003e to \u003cFIVE_HUNDRED\u003e aligns with resistance levels offering a favourable risk reward ratio and making this a promising trading opportunity vedanta has recently declared its board meeting to consider the fourth dividend proposal however taking the first three vedanta dividends the annual vedanta dividend yield is \u003cTHREE_TEN\u003e \u003cONE_TEN\u003e \u003cFOUR_\u003e \u003cTWO_TEN\u003e as vedantas share price was around \u003cTWO_HUNDRED\u003e at the end of \u003cTWO_THOUSAND\u003e the annual dividend yield of vedanta comes to around \u003cONE_TEN_PERCENT\u003e which is much higher than the ppof interest rate ssy interest rate and bank fd interest rates so vedantas dividend yield is much higher than ppf ssy and bank fd returns in cy24 vedantas share price rose from \u003cTWO_HUNDRED\u003e apiece to \u003cFIVE_HUNDRED\u003e per share a \u003cNINE_TEN_PERCENT\u003e increase year over year","timestamp":"2024-09-28T14:45:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}