{"url":"https://www.livemint.com/market/stock-market-news/september-ipo-surge-47-companies-raise-over-rs-16-000-crore-61-trade-above-issue-price-11727405420205.html","title":"September IPO Surge: 47 companies raise over  ₹16,000 crore; 61% trade above issue price","description":"India's IPO market is booming, with 47 companies raising  ₹16,152 crore in September. Retail investors are driving demand, especially in the SME segment, where offerings are often oversubscribed.","content":"While excitement remains high in India's secondary market, where the benchmark indices are reaching new heights daily, the primary markets are also buzzing and witnessing a flurry of activity.Once dominated by institutions, India's primary market is now experiencing a surge in retail participation, driven by the potential for higher returns and easier access to the financial markets.In September, 47 companies debuted in the secondary market, collectively raising  ₹16,152 crore, according to the data compiled by Livemint.Of these, 13 were from the mainboard category, with Bajaj Housing Finance being the largest, having an initial public offering (IPO) size of  ₹6,560 crore. It was followed by Premier Energies, with an issue size of  ₹2,830.4 crore. The remaining 34 companies belonged to the SME category.Nearly 61% of the 47 companies that listed in September are trading above their issue prices. Travels \u0026 Rentals' SME IPO leads the pack with a 283% gain, followed by Premier Energies at 146%, and Namo eWaste Management at 127%.Retail investors' enthusiastic participation in IPOs has pushed subscription levels to staggering heights, particularly in the SME segment. Finding an SME IPO that isn’t fully subscribed in the retail category has become quite uncommon.Many offerings are now being oversubscribed by significant margins, with the retail portion, in some cases, garnering up to 2,000 times bids. Investors are increasingly drawn to the excitement surrounding listing days, as the majority of stocks—particularly those in the SME category—are witnessing listing gains of over 100%.In September, the retail portion of WOL 3D, an SME IPO, was oversubscribed by 488 times. Of the 34 SME IPOs that were listed last month, 16 saw their retail portions being subscribed more than 100 times.The surge in retail participation has encouraged many companies to tap into the financial markets for fundraising. Furthermore, given the favourable market conditions, companies are also motivated to raise funds from the IPO route.In India, 227 IPOs were listed in the first eight months of 2024, raising a combined USD 12.2 billion—a nearly threefold increase from USD 4.3 billion raised during the same period in 2023, according to a report by GlobalData.India stood out within the Asia-Pacific (APAC) region, significantly contributing to the region's IPO success. In total, APAC recorded 575 IPO listings during this period, generating USD 23.7 billion. This marks a 15.6% rise in IPO proceeds compared to the same time frame in 2023, as per the report.The recent listings, including Bajaj Housing Finance, Ola Electric and Premier Energies, have made headlines for their stock market debuts. Current trends indicate that we are just at the beginning of a significant momentum building in the tech startup IPO space.Moreover, several companies, including Hyundai Motor, Swiggy, the National Stock Exchange, Waaree Energies, Mobikwik, and NTPC Green, are preparing for their Dalal Street debuts. Notably, Hyundai's upcoming public offering is poised to surpass the LIC IPO size of  ₹21,000 crore.The recent surge in IPO activity is not just a fleeting trend, it is fundamentally reshaping the landscape of the Indian market. With an increasing number of companies tapping the primary market, the expansion of the IPO space is significantly contributing to the overall growth of the Indian economy.Manish Bhandari, CEO \u0026 Portfolio Manager, Vallum Capital Advisors, said, “IPO is part of the evolution cycle of capital raising in the lifecycle of a firm. This activity can help accelerate a country's economic momentum. Indian investors are shifting savings towards the financial market and it's quite natural for them to participate in IPO activities. This has resulted in the froth in the IPO market, where raising money is quite easy today. In such a scenario where greed is overpowering, investors have to due their due diligence and adhere to the maxim of caveat emptor.”","cleaned_content":"while excitement remains high in indias secondary market where the benchmark indices are reaching new heights daily the primary markets are also buzzing and witnessing a flurry of activity once dominated by institutions indias primary market is now experiencing a surge in retail participation driven by the potential for higher returns and easier access to the financial markets in september \u003cFOUR_TEN\u003e companies debuted in the secondary market collectively raising \u003cONE_TEN_THOUSAND\u003e crore according to the data compiled by livemint of these \u003cONE_TEN\u003e were from the mainboard category with bajaj housing finance being the largest having an initial public offering ipo size of \u003cSIX_THOUSAND\u003e crore it was followed by premier energies with an issue size of \u003cTWO_THOUSAND\u003e crore the remaining \u003cTHREE_TEN\u003e companies belonged to the sme category nearly \u003cSIX_TEN_PERCENT\u003e of the \u003cFOUR_TEN\u003e companies that listed in september are trading above their issue prices travels rentals sme ipo leads the pack with a \u003cTWO_HUNDRED_PERCENT\u003e gain followed by premier energies at \u003cONE_HUNDRED_PERCENT\u003e and namo ewaste management at \u003cONE_HUNDRED_PERCENT\u003e retail investors enthusiastic participation in ipos has pushed subscription levels to staggering heights particularly in the sme segment finding an sme ipo that isn t fully subscribed in the retail category has become quite uncommon many offerings are now being oversubscribed by significant margins with the retail portion in some cases garnering up to \u003cTWO_THOUSAND\u003e times bids investors are increasingly drawn to the excitement surrounding listing days as the majority of stocks particularly those in the sme category are witnessing listing gains of over \u003cONE_HUNDRED_PERCENT\u003e in september the retail portion of wol \u003cTHREE_\u003e d an sme ipo was oversubscribed by \u003cFOUR_HUNDRED\u003e times of the \u003cTHREE_TEN\u003e sme ipos that were listed last month \u003cONE_TEN\u003e saw their retail portions being subscribed more than \u003cONE_HUNDRED\u003e times the surge in retail participation has encouraged many companies to tap into the financial markets for fundraising furthermore given the favourable market conditions companies are also motivated to raise funds from the ipo route in india \u003cTWO_HUNDRED\u003e ipos were listed in the first eight months of \u003cTWO_THOUSAND\u003e raising a combined usd \u003cONE_TEN\u003e billion a nearly threefold increase from usd \u003cFOUR_\u003e billion raised during the same period in \u003cTWO_THOUSAND\u003e according to a report by globaldata india stood out within the asia pacific apac region significantly contributing to the regions ipo success in total apac recorded \u003cFIVE_HUNDRED\u003e ipo listings during this period generating usd \u003cTWO_TEN\u003e billion this marks a \u003cONE_TEN_PERCENT\u003e rise in ipo proceeds compared to the same time frame in \u003cTWO_THOUSAND\u003e as per the report the recent listings including bajaj housing finance ola electric and premier energies have made headlines for their stock market debuts current trends indicate that we are just at the beginning of a significant momentum building in the tech startup ipo space moreover several companies including hyundai motor swiggy the national stock exchange waaree energies mobikwik and ntpc green are preparing for their dalal street debuts notably hyundais upcoming public offering is poised to surpass the lic ipo size of \u003cTWO_TEN_THOUSAND\u003e crore the recent surge in ipo activity is not just a fleeting trend it is fundamentally reshaping the landscape of the indian market with an increasing number of companies tapping the primary market the expansion of the ipo space is significantly contributing to the overall growth of the indian economy manish bhandari ceo portfolio manager vallum capital advisors said ipo is part of the evolution cycle of capital raising in the lifecycle of a firm this activity can help accelerate a countrys economic momentum indian investors are shifting savings towards the financial market and its quite natural for them to participate in ipo activities this has resulted in the froth in the ipo market where raising money is quite easy today in such a scenario where greed is overpowering investors have to due their due diligence and adhere to the maxim of caveat emptor","timestamp":"2024-10-02T10:50:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}