{"url":"https://www.livemint.com/market/stock-market-news/up-552-in-4-months-sudarshan-pharma-stock-nears-record-high-after-1-10-stock-split-announcement-11727756644470.html","title":"Up 552% in 4 months! Sudarshan Pharma stock nears record high after 1:10 stock split announcement","description":"Sudarshan Pharma's shares rose nearly 2% after announcing a 1:10 stock split. The company is expanding its operations through acquisitions and plans to boost production capacity, particularly in oncology, while maintaining a strong presence in international markets.","content":"Shares of Sudarshan Pharma Industries surged nearly 2% in early morning trade on Tuesday, October 1, reaching  ₹419 per share on BSE and approaching their all-time high of  ₹434. This increase follows the approval of a stock split by the company’s board of directors in the ratio of 1:10.\"Sub-division/split of the company's 1 (one) equity share having a face value of Rs. 10/- (Rupees Ten only), each fully paid-up, into 10 (ten) equity shares of the company having a face value of Rs. 1/- (Rupee One only), each fully paid-up, subject to the approval of shareholders and such other approvals as may be required. Consequent to the sub-division of the face value of the equity shares of the company, the alteration of the capital clause of the Memorandum of Association of the company is subject to the approval of shareholders of the company,\" the company said in its regulatory filing.In August, the company established a subsidiary, Sudarshan Maven Pharma, focusing on the development and manufacturing of a wide range of pharmaceuticals, active pharmaceutical ingredients, and intermediates. The company also acquired a 100% stake in Ratna Lifesciences Pvt Ltd, which will facilitate Sudarshan Pharma’s entry into the oncology business.Additionally, the company is in the process of acquiring adjacent land in the Maharashtra Industrial Development Corporation (MIDC) area to expand its overall plant capacity. This land acquisition is expected to significantly boost Ratna Lifesciences' annual turnover, increasing it by approximately ten times from its current capacity.The company’s shares have experienced a significant upward trend over the past four months, rising from  ₹64.25 to the current level of  ₹419, which translates to an impressive gain of 552%. Notably, in September alone, the shares surged by 123%, building on a 20% increase in August and a 90% rise in July.Sudarshan Pharma Industries operates in the pharmaceutical and specialty chemicals sectors, establishing a strong presence in both domestic and international markets. Its products are exported to various countries, including the UK, Australia, Uzbekistan, Syria, Oman, Taiwan, and the MENA region.In addition to these core businesses, the company is engaged in contract manufacturing and the outsourcing of generic pharmaceutical formulations and medicines to healthcare institutions, government bodies, NGOs, and hospitals. SPIL has developed its own distribution network and salesforce dedicated to the ethical marketing of pharmaceutical formulations and products in both domestic and international markets, as per the company's website.","cleaned_content":"shares of sudarshan pharma industries surged nearly \u003cTWO_PERCENT\u003e in early morning trade on tuesday october \u003cONE_\u003e reaching \u003cFOUR_HUNDRED\u003e per share on bse and approaching their all time high of \u003cFOUR_HUNDRED\u003e this increase follows the approval of a stock split by the company s board of directors in the ratio of \u003cONE_\u003e \u003cONE_TEN\u003e sub division split of the companys \u003cONE_\u003e one equity share having a face value of rs \u003cONE_TEN\u003e rupees ten only each fully paid up into \u003cONE_TEN\u003e ten equity shares of the company having a face value of rs \u003cONE_\u003e rupee one only each fully paid up subject to the approval of shareholders and such other approvals as may be required consequent to the sub division of the face value of the equity shares of the company the alteration of the capital clause of the memorandum of association of the company is subject to the approval of shareholders of the company the company said in its regulatory filing in august the company established a subsidiary sudarshan maven pharma focusing on the development and manufacturing of a wide range of pharmaceuticals active pharmaceutical ingredients and intermediates the company also acquired a \u003cONE_HUNDRED_PERCENT\u003e stake in ratna lifesciences pvt ltd which will facilitate sudarshan pharma s entry into the oncology business additionally the company is in the process of acquiring adjacent land in the maharashtra industrial development corporation midc area to expand its overall plant capacity this land acquisition is expected to significantly boost ratna lifesciences annual turnover increasing it by approximately ten times from its current capacity the company s shares have experienced a significant upward trend over the past four months rising from \u003cSIX_TEN\u003e to the current level of \u003cFOUR_HUNDRED\u003e which translates to an impressive gain of \u003cFIVE_HUNDRED_PERCENT\u003e notably in september alone the shares surged by \u003cONE_HUNDRED_PERCENT\u003e building on a \u003cTWO_TEN_PERCENT\u003e increase in august and a \u003cNINE_TEN_PERCENT\u003e rise in july sudarshan pharma industries operates in the pharmaceutical and specialty chemicals sectors establishing a strong presence in both domestic and international markets its products are exported to various countries including the uk australia uzbekistan syria oman taiwan and the mena region in addition to these core businesses the company is engaged in contract manufacturing and the outsourcing of generic pharmaceutical formulations and medicines to healthcare institutions government bodies ngos and hospitals spil has developed its own distribution network and salesforce dedicated to the ethical marketing of pharmaceutical formulations and products in both domestic and international markets as per the companys website","timestamp":"2024-10-01T10:35:00+05:30","market_timestamp":"2024-10-01T10:35:00+05:30","off_market_hours":false}