{"url":"https://www.livemint.com/market/stock-market-news/vipul-organics-shares-jump-over-13-to-new-peak-after-company-announces-rights-issue-at-13-11727759929544.html","title":"Vipul Organics shares jump over 13% to new peak after company announces rights issue at 1:3","description":"Vipul Organics' shares jumped 13.13% to  ₹295 after announcing a rights issue of one new share for every three at  ₹54. The company is expanding capacity at its Ambernath and Sayakha facilities to meet growing demand in the specialty chemicals sector.","content":"Shares of Vipul Organics, a prominent player in the specialty chemicals sector focusing on pigments and dyes, surged 13.13% to their fresh all-time high of  ₹295 in early trade on Tuesday.The stock rose after the company on September 30 announced a rights issue, offering one new share for every three shares held at a price of  ₹54 per share. The company indicated that the record date for the rights issue will be announced later.“The company today announced their rights issue, after the meeting of the Rights Issue Committee. Vipul Organics will offer 1 share for every 3 shares held on the record date at a premium of  ₹44 for the share of face value  ₹10 (total price  ₹54). The rights issue will not exceed the size of  ₹25 crore,” the company said in its regulatory filing.“The company has undertaken substantial capacity expansion and has decided to do a rights issue to mobilise funds. With a view to rewarding our shareholders and including them in the growth of the company, the issue price is at a substantial discount to the current market price,\" said Vipul P Shah, Managing Director, Vipul Organics LimitedVipul Organics is investing significantly in the expansion of its capacity. It just concluded capacity expansion at its Ambernath facility. Meanwhile, construction is on full steam at its greenfield facility at Sayakha. The funds raised will be utilised to ensure the development of the Sayakha facility, and production will begin in a phased manner from the first quarter of 2025-2026.The Sayakha facility will focus on the production of pigments, pigment intermediates, and high-performance colours.\"With the establishment of this new facility, Vipul Organics is poised to become a global leader in pigment and colorant manufacturing, rivaling even the largest capacities outside of China. Over the past few years, we have diligently focused on cost optimisation and enhancing our product portfolio. The Sayakha Plant marks a crucial milestone in our journey toward achieving these goals,\" the company said in its FY24 annual report.As a leading player in the specialty chemicals sector, the company is well-positioned to capitalize on the growing demand for dyes and pigments. According to the recent estimates, the Indian dyes and pigments market, which constitutes nearly 25% of the global market, is projected to grow at a CAGR of 11% from 2024 to 2032. Organic pigments dominate production in India, making up 58% of total output.Demand for naphthols is rising due to their extensive applications across industries, with leading Indian manufacturers meeting the needs of both domestic and international markets. This demand surge is driven by the expanding textile industry, which requires high-quality dyes, along with increased use of pigments in paints, inks, and plastics, and the chemical and pharmaceutical sectors, which rely on reliable intermediates.Although the Indian dyes and pigments market faced challenges in FY24 due to a decline in demand from the textile industry, the future prospects look promising. Increased consumer purchasing power and changing preferences for innovative and high-quality products are expected to boost demand across all end-user segments. Furthermore, urbanisation has intensified competition among major players, leading to a more diverse range of available products.","cleaned_content":"shares of vipul organics a prominent player in the specialty chemicals sector focusing on pigments and dyes surged \u003cONE_TEN_PERCENT\u003e to their fresh all time high of \u003cTWO_HUNDRED\u003e in early trade on tuesday the stock rose after the company on september \u003cTHREE_TEN\u003e announced a rights issue offering one new share for every three shares held at a price of \u003cFIVE_TEN\u003e per share the company indicated that the record date for the rights issue will be announced later the company today announced their rights issue after the meeting of the rights issue committee vipul organics will offer \u003cONE_\u003e share for every \u003cTHREE_\u003e shares held on the record date at a premium of \u003cFOUR_TEN\u003e for the share of face value \u003cONE_TEN\u003e total price \u003cFIVE_TEN\u003e the rights issue will not exceed the size of \u003cTWO_TEN\u003e crore the company said in its regulatory filing the company has undertaken substantial capacity expansion and has decided to do a rights issue to mobilise funds with a view to rewarding our shareholders and including them in the growth of the company the issue price is at a substantial discount to the current market price said vipul p shah managing director vipul organics limitedvipul organics is investing significantly in the expansion of its capacity it just concluded capacity expansion at its ambernath facility meanwhile construction is on full steam at its greenfield facility at sayakha the funds raised will be utilised to ensure the development of the sayakha facility and production will begin in a phased manner from the first quarter of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e the sayakha facility will focus on the production of pigments pigment intermediates and high performance colours with the establishment of this new facility vipul organics is poised to become a global leader in pigment and colorant manufacturing rivaling even the largest capacities outside of china over the past few years we have diligently focused on cost optimisation and enhancing our product portfolio the sayakha plant marks a crucial milestone in our journey toward achieving these goals the company said in its fy24 annual report as a leading player in the specialty chemicals sector the company is well positioned to capitalize on the growing demand for dyes and pigments according to the recent estimates the indian dyes and pigments market which constitutes nearly \u003cTWO_TEN_PERCENT\u003e of the global market is projected to grow at a cagr of \u003cONE_TEN_PERCENT\u003e from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e organic pigments dominate production in india making up \u003cFIVE_TEN_PERCENT\u003e of total output demand for naphthols is rising due to their extensive applications across industries with leading indian manufacturers meeting the needs of both domestic and international markets this demand surge is driven by the expanding textile industry which requires high quality dyes along with increased use of pigments in paints inks and plastics and the chemical and pharmaceutical sectors which rely on reliable intermediates although the indian dyes and pigments market faced challenges in fy24 due to a decline in demand from the textile industry the future prospects look promising increased consumer purchasing power and changing preferences for innovative and high quality products are expected to boost demand across all end user segments furthermore urbanisation has intensified competition among major players leading to a more diverse range of available products","timestamp":"2024-10-01T11:30:00+05:30","market_timestamp":"2024-10-01T11:30:00+05:30","off_market_hours":false}