{"url":"https://www.livemint.com/market/stock-market-news/adani-ports-motilal-oswal-recommends-buy-with-up-to-29-upside-11727077097076.html","title":"Adani Ports: Motilal Oswal recommends ‘buy’ with up to 29% upside","description":"Motilal Oswal maintains a 'buy' rating for Adani Ports, targeting  ₹1,850. The firm anticipates 11 per cent cargo growth from FY24 to FY26, despite temporary disruptions. APSEZ aims to be India's largest transport utility by 2030, bolstered by strategic investments and acquisitions.","content":"Domestic brokerage house Motilal Oswal Financial Services (MOFSL) reaffirmed its 'buy' rating on Adani Ports and Special Economic Zone (APSEZ) stock, maintaining a target price of  ₹1,850, implying an upside potential of almost 29 per cent. The brokerage cited the company's strategic positioning and continued investments in port and logistics infrastructure as key drivers for growth.According to MOFSL, APSEZ is well-positioned to surpass India's overall growth trajectory, thanks to a balanced port presence along both the western and eastern coasts and a diversified cargo mix. The company's heavy investments in its port and logistics businesses are expected to fuel long-term expansion.MOFSL projected an 11 per cent growth in cargo volumes from FY24 to FY26, resulting in a compound annual growth rate (CAGR) of 14 per cent in revenue, 15 per cent in EBITDA, and 22 per cent in profit after tax (PAT) during the same period. Despite some short-term volume disruptions, the firm's long-term growth outlook remains robust.The stock has jumped 74 per cent in the last one year and 42 per cent in 2024 YTD. The Adani Group stock has lost around 2 per cent in September so far after a 5.6 per cent fall in August. Prior to that, it rose 6.2 per cent in July, 2.8 per cent in June and 8.5 per cent in May.The stock hit its record high of  ₹1,607.95 in June 2024. Currently trading at  ₹1438.45, the large-cap stock is just 10.5 per cent away from its peak. Meanwhile, it has soared almost 91 per cent from its 52-week low of  ₹754.50, recorded in October last year.During the first half of FY25, APSEZ handled 183 million metric tons (mmt) of cargo. While cargo volumes grew by 7 per cent year-on-year (YoY) in the first quarter, the growth was temporarily impacted by a worker strike at Gangavaram port in April-May 2024, which normalised by June. Severe weather conditions in Kutch also affected operations at the Mundra and Tuna ports in August 2024. Despite these challenges, APSEZ management maintained its full-year volume guidance of 460-480 mmt for FY25.The company is expected to grow at a rate two to three times higher than India's overall cargo volume growth. APSEZ has set ambitious goals to become India’s largest integrated transport utility and the world’s largest private port company by 2030.APSEZ continues to prioritise capacity expansion, with recent developments including a concession agreement with Deendayal Port Authority to develop a berth with a 5.7 mmt capacity at Kandla, Gujarat. The new 300-metre berth is expected to be operational by FY27, further strengthening APSEZ’s presence at Deendayal port.Additionally, APSEZ announced the acquisition of an 80 per cent stake in Astro for USD 185 million, valuing the company at USD 235 million. Founded in 2009, Astro operates 26 vessels across key regions, including the Middle East, India, Far East Asia, and Africa. This acquisition increases APSEZ’s fleet to 168 vessels, enhancing its presence in strategic markets and expanding its Tier-1 customer base.Despite temporary setbacks in the first half of FY25, Adani Ports and SEZ is on track for long-term growth, driven by its strategic investments in port capacity, logistics infrastructure, and global acquisitions. With MOFSL projecting strong financial performance over the next few years, APSEZ remains well-positioned to achieve its ambitious goals and deliver solid returns for investors.","cleaned_content":"domestic brokerage house motilal oswal financial services mofsl reaffirmed its buy rating on adani ports and special economic zone apsez stock maintaining a target price of \u003cONE_THOUSAND\u003e implying an upside potential of almost \u003cTWO_TEN_PERCENT\u003e the brokerage cited the companys strategic positioning and continued investments in port and logistics infrastructure as key drivers for growth according to mofsl apsez is well positioned to surpass indias overall growth trajectory thanks to a balanced port presence along both the western and eastern coasts and a diversified cargo mix the companys heavy investments in its port and logistics businesses are expected to fuel long term expansion mofsl projected an \u003cONE_TEN_PERCENT\u003e growth in cargo volumes from fy24 to fy26 resulting in a compound annual growth rate cagr of \u003cONE_TEN_PERCENT\u003e in revenue \u003cONE_TEN_PERCENT\u003e in ebitda and \u003cTWO_TEN_PERCENT\u003e in profit after tax pat during the same period despite some short term volume disruptions the firms long term growth outlook remains robust the stock has jumped \u003cSEVEN_TEN_PERCENT\u003e in the last one year and \u003cFOUR_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd the adani group stock has lost around \u003cTWO_PERCENT\u003e in september so far after a \u003cFIVE_PERCENT\u003e fall in august prior to that it rose \u003cSIX_PERCENT\u003e in july \u003cTWO_PERCENT\u003e in june and \u003cEIGHT_PERCENT\u003e in may the stock hit its record high of \u003cONE_THOUSAND\u003e in june \u003cTWO_THOUSAND\u003e currently trading at \u003cONE_THOUSAND\u003e the large cap stock is just \u003cONE_TEN_PERCENT\u003e away from its peak meanwhile it has soared almost \u003cNINE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSEVEN_HUNDRED\u003e recorded in october last year during the first half of fy25 apsez handled \u003cONE_HUNDRED\u003e million metric tons mmt of cargo while cargo volumes grew by \u003cSEVEN_PERCENT\u003e year on year yoy in the first quarter the growth was temporarily impacted by a worker strike at gangavaram port in april may \u003cTWO_THOUSAND\u003e which normalised by june severe weather conditions in kutch also affected operations at the mundra and tuna ports in august \u003cTWO_THOUSAND\u003e despite these challenges apsez management maintained its full year volume guidance of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e mmt for fy25 the company is expected to grow at a rate two to three times higher than indias overall cargo volume growth apsez has set ambitious goals to become india s largest integrated transport utility and the world s largest private port company by \u003cTWO_THOUSAND\u003e apsez continues to prioritise capacity expansion with recent developments including a concession agreement with deendayal port authority to develop a berth with a \u003cFIVE_\u003e mmt capacity at kandla gujarat the new \u003cTHREE_HUNDRED\u003e metre berth is expected to be operational by fy27 further strengthening apsez s presence at deendayal port additionally apsez announced the acquisition of an \u003cEIGHT_TEN_PERCENT\u003e stake in astro for usd \u003cONE_HUNDRED\u003e million valuing the company at usd \u003cTWO_HUNDRED\u003e million founded in \u003cTWO_THOUSAND\u003e astro operates \u003cTWO_TEN\u003e vessels across key regions including the middle east india far east asia and africa this acquisition increases apsez s fleet to \u003cONE_HUNDRED\u003e vessels enhancing its presence in strategic markets and expanding its tier \u003cONE_\u003e customer base despite temporary setbacks in the first half of fy25 adani ports and sez is on track for long term growth driven by its strategic investments in port capacity logistics infrastructure and global acquisitions with mofsl projecting strong financial performance over the next few years apsez remains well positioned to achieve its ambitious goals and deliver solid returns for investors","timestamp":"2024-09-23T14:59:00+05:30","market_timestamp":"2024-09-23T14:59:00+05:30","off_market_hours":false}