{"url":"https://www.livemint.com/market/stock-market-news/after-multibagger-rally-in-1-year-ubs-sees-46-downside-in-hero-motocorp-shares-retains-sell-call-11727416659728.html","title":"After multibagger rally in 1 year, UBS sees 46% downside in Hero MotoCorp shares, retains ‘sell’ call","description":"UBS has maintained a sell rating on Hero MotoCorp with a target price of  ₹3,350, citing concerns over declining retail market share and rising inventory levels despite a 102% stock surge in the past year.","content":"Global brokerage house UBS maintained its sell rating on the multibagger two-wheeler auto stock Hero MotoCorp with a target price of  ₹3,350, implying a downside potential of almost 45 per cent.\"The stock is trading at c26x FY26E PE, which is more than 3SD higher than its five-year historical average. We maintain our Sell rating with PT of  ₹3,350,\" it said in a report.Despite Hero MotoCorp's stock surging after its Q1 FY25 earnings call, concerns over its long-term retail performance remain. UBS highlighted that while the company is expected to benefit from a boost in wholesale volumes during the upcoming festive season, its declining retail market share and rising inventory levels paint a less optimistic picture. Intense competition and shifts in consumer preferences further challenge Hero's position in the market, it added.The auto stock had surged over 102 per cent in the past year and more than 46 per cent in the last six months. The stock is up 10 per cent in September, following two consecutive months of losses. In August, the stock declined by 0.6 per cent, and in July, it dropped by 1.6 per cent. Before that, Hero MotoCorp shares had exhibited a positive trend, rising 9 per cent in June and 13 per cent in May. The first four months of the year were marked by volatility, with the stock down 4 per cent in April, up 6.7 per cent in March, down 4.2 per cent in February, and up 11.6 per cent in January.The scrip also hit its record high of  ₹6,245 earlier this week. Currently trading at  ₹6049.35, it has given multibagger returns, soaring 107 per cent from its 52-week low of  ₹2,925, recorded in October last year.UBS observed that despite Hero MotoCorp missing Q1 FY25 earnings and steadily losing retail market share, the stock rallied around 20 per cent since its earnings call. UBS attributed this rally, which outperformed the BSE Auto Index by 1,300 basis points, to expected increases in wholesale volumes for September and October, along with management’s positive commentary on the festive season.Investors and dealers expect Hero’s wholesale volumes for September to exceed 600,000 units, but UBS believes this would not align with retail trends, leading to significant inventory buildup. With Vahan data showing retail volumes of around 300,000 units, dealer inventories could surpass 1.3 million units. High inventories, coupled with strong competition from Honda, are expected to prompt increased discounting during the festive season, according to the brokerage.Despite the positive outlook for the festive season, UBS noted that Hero's full-year retail performance has not been as strong in recent years. According to stock exchange filings, the company’s festive retail volumes grew by 20 per cent in 2022 and 19 per cent in 2023. However, UBS's analysis of FY23 and FY24 Vahan retail data showed that while festive growth was strong, overall retail volume growth for the full year was only 11 per cent and 6 per cent for FY23 and FY24, respectively. Hero's volume growth lagged behind its peers, which saw growth rates of 23 per cent and 12 per cent in the same period.Despite claims of record festive sales, Hero’s retail market share during the festive season (October to December) has been consistently falling, expected to hit a new low of sub-24 per cent by September 2024, according to UBS. Additionally, despite claims of strong double-digit volume growth during previous festive seasons, Hero’s festive retail volumes remained around the 1.4 million mark, based on regulatory filings.UBS also highlighted Hero’s retail market share erosion in 2024. From April to August 2024, Hero’s market share contracted by 310 basis points, dropping to 28.8 per cent. By September 2024, this has fallen below 24 per cent, leaving Hero approximately 400 basis points behind Honda, suggested UBS.Even though the launch of the Xtreme 125 met with success, Hero’s commuter motorcycle segment faced significant challenges, according to the report. Competition from Honda Shine and Bajaj Freedom, coupled with a rising preference for scooters and electric vehicles in smaller towns further eroded Hero's core customer base. UBS believes that while the market seems to be pricing in a recovery for commuter motorcycles, Hero’s declining market share paints a less optimistic picture for the company going forward.In conclusion, UBS indicated that while Hero MotoCorp may benefit from wholesale volume gains in the short term, long-term challenges remained, particularly in its core retail performance and declining market share.","cleaned_content":"global brokerage house ubs maintained its sell rating on the multibagger two wheeler auto stock hero motocorp with a target price of \u003cTHREE_THOUSAND\u003e implying a downside potential of almost \u003cFOUR_TEN_PERCENT\u003e the stock is trading at c26x fy26e pe which is more than \u003cTHREE_\u003e sd higher than its five year historical average we maintain our sell rating with pt of \u003cTHREE_THOUSAND\u003e it said in a report despite hero motocorps stock surging after its q1 fy25 earnings call concerns over its long term retail performance remain ubs highlighted that while the company is expected to benefit from a boost in wholesale volumes during the upcoming festive season its declining retail market share and rising inventory levels paint a less optimistic picture intense competition and shifts in consumer preferences further challenge heros position in the market it added the auto stock had surged over \u003cONE_HUNDRED_PERCENT\u003e in the past year and more than \u003cFOUR_TEN_PERCENT\u003e in the last six months the stock is up \u003cONE_TEN_PERCENT\u003e in september following two consecutive months of losses in august the stock declined by \u003cZERO_PERCENT\u003e and in july it dropped by \u003cONE_PERCENT\u003e before that hero motocorp shares had exhibited a positive trend rising \u003cNINE_PERCENT\u003e in june and \u003cONE_TEN_PERCENT\u003e in may the first four months of the year were marked by volatility with the stock down \u003cFOUR_PERCENT\u003e in april up \u003cSIX_PERCENT\u003e in march down \u003cFOUR_PERCENT\u003e in february and up \u003cONE_TEN_PERCENT\u003e in january the scrip also hit its record high of \u003cSIX_THOUSAND\u003e earlier this week currently trading at \u003cSIX_THOUSAND\u003e it has given multibagger returns soaring \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_THOUSAND\u003e recorded in october last year ubs observed that despite hero motocorp missing q1 fy25 earnings and steadily losing retail market share the stock rallied around \u003cTWO_TEN_PERCENT\u003e since its earnings call ubs attributed this rally which outperformed the bse auto index by \u003cONE_THOUSAND\u003e basis points to expected increases in wholesale volumes for september and october along with management s positive commentary on the festive season investors and dealers expect hero s wholesale volumes for september to exceed \u003cSIX_HUNDRED_THOUSAND\u003e units but ubs believes this would not align with retail trends leading to significant inventory buildup with vahan data showing retail volumes of around \u003cTHREE_HUNDRED_THOUSAND\u003e units dealer inventories could surpass \u003cONE_\u003e million units high inventories coupled with strong competition from honda are expected to prompt increased discounting during the festive season according to the brokerage despite the positive outlook for the festive season ubs noted that heros full year retail performance has not been as strong in recent years according to stock exchange filings the company s festive retail volumes grew by \u003cTWO_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e however ubss analysis of fy23 and fy24 vahan retail data showed that while festive growth was strong overall retail volume growth for the full year was only \u003cONE_TEN_PERCENT\u003e and \u003cSIX_PERCENT\u003e for fy23 and fy24 respectively heros volume growth lagged behind its peers which saw growth rates of \u003cTWO_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e in the same period despite claims of record festive sales hero s retail market share during the festive season october to december has been consistently falling expected to hit a new low of sub \u003cTWO_TEN_PERCENT\u003e by september \u003cTWO_THOUSAND\u003e according to ubs additionally despite claims of strong double digit volume growth during previous festive seasons hero s festive retail volumes remained around the \u003cONE_\u003e million mark based on regulatory filings ubs also highlighted hero s retail market share erosion in \u003cTWO_THOUSAND\u003e from april to august \u003cTWO_THOUSAND\u003e hero s market share contracted by \u003cTHREE_HUNDRED\u003e basis points dropping to \u003cTWO_TEN_PERCENT\u003e by september \u003cTWO_THOUSAND\u003e this has fallen below \u003cTWO_TEN_PERCENT\u003e leaving hero approximately \u003cFOUR_HUNDRED\u003e basis points behind honda suggested ubs even though the launch of the xtreme \u003cONE_HUNDRED\u003e met with success hero s commuter motorcycle segment faced significant challenges according to the report competition from honda shine and bajaj freedom coupled with a rising preference for scooters and electric vehicles in smaller towns further eroded heros core customer base ubs believes that while the market seems to be pricing in a recovery for commuter motorcycles hero s declining market share paints a less optimistic picture for the company going forward in conclusion ubs indicated that while hero motocorp may benefit from wholesale volume gains in the short term long term challenges remained particularly in its core retail performance and declining market share","timestamp":"2024-09-27T12:18:00+05:30","market_timestamp":"2024-09-27T12:18:00+05:30","off_market_hours":false}