{"url":"https://www.livemint.com/market/stock-market-news/financial-stocks-overvalued-amid-short-term-rally-says-emkays-seshadri-sen-picks-hdfc-bank-indusind-shriram-finance-11727339103012.html","title":"Financial stocks overvalued, says Emkay, suggests HDFC Bank, IndusInd Bank, RBL for the short term","description":"With growth rates and ROEs in the mid-teens, the fair value for large banks is 1.5-1.7x PBV. Banks will continue to derate till they settle at these valuations, says Seshadri Sen.","content":"The financial sector is witnessing a short-term rally driven by a potential recovery in deposit growth as the RBI embarks on its anticipated easing cycle. With moderate valuations attracting investors amidst a TINA (There Is No Alternative) factor, financial stocks are seeing a surge in interest. However, analysts caution that this rally may be fleeting, with banks likely to face margin pressure as repo rates are cut, impacting long-term growth.Seshadri Sen, Head Of Research And Strategist at Emkay Global Financial Services Ltd believes lenders are still overvalued in the longer term, with fair value ranging at 1.5-1.7x PBV versus current levels of 2-2.8x.“This is a short-term trade, and long-term investors should use this rally to lighten weightage,” Sen said.The 50 basis bps (bps) interest rate cut from the US Federal Reserve is likely to accelerate the Reserve Bank of India’s (RBI) easing cycle. Sen believes that the RBI may have to move quicker than it wants, to prevent excessive upward pressure on the rupee which it can only partly mitigate by intervention.Importantly, the RBI is likely to shift to an accommodative stance with its first cut in October 2024 or December 2024, which could mark a decisive turn in domestic liquidity. Thus, Sen expects deposit growth to bounce back as soon as the RBI reverses its stance, leading to a significant shift in sentiment for lenders.Since March 2023, the 1-year forward (1YF) Nifty price-to-earnings ratio (PER) has surged by 46%, reaching 24x, pushing much of the broader market into overvalued territory. In contrast, the PER for the financial sector has seen its discount to the Nifty 50 expand from 20% to 25%, positioning it as a relatively undervalued segment. Information Technology (IT) remains the cheapest sector in the Nifty, aside from energy.With limited options for investors seeking reasonably priced assets, the combination of attractive valuations and the prospect of easier liquidity has fueled a short-term rally in financials, Sen explained.“We see this as a short-lived rally. Rate cuts in 3QFY25 would lead to margin cuts in 4QFY25 for most major banks, given that mortgages (~30% of loan book for most large banks) reprice immediately. Also, banks may delay deposit rate cuts due to the recent tightness and HDFC Bank’s need to replace deposits of the erstwhile HDFC Ltd borrowings. Moreover, the structural adjustment to bank valuations is still WIP,” Sens said.He believes that with growth rates and ROEs in the mid-teens, the fair value for large banks is 1.5 - 1.7x PBV and banks will continue to derate till they settle at these valuations.Emkay Global chooses HDFC Bank, IndusInd Bank, RBL Bank, and Shriram Finance as the key stock picks in the financial sector to play this short-term rally.","cleaned_content":"the financial sector is witnessing a short term rally driven by a potential recovery in deposit growth as the rbi embarks on its anticipated easing cycle with moderate valuations attracting investors amidst a tina there is no alternative factor financial stocks are seeing a surge in interest however analysts caution that this rally may be fleeting with banks likely to face margin pressure as repo rates are cut impacting long term growth seshadri sen head of research and strategist at emkay global financial services ltd believes lenders are still overvalued in the longer term with fair value ranging at \u003cONE_\u003e \u003cONE_\u003e x pbv versus current levels of \u003cTWO_\u003e \u003cTWO_\u003e x this is a short term trade and long term investors should use this rally to lighten weightage sen said the \u003cFIVE_TEN\u003e basis bps bps interest rate cut from the us federal reserve is likely to accelerate the reserve bank of india s rbi easing cycle sen believes that the rbi may have to move quicker than it wants to prevent excessive upward pressure on the rupee which it can only partly mitigate by intervention importantly the rbi is likely to shift to an accommodative stance with its first cut in october \u003cTWO_THOUSAND\u003e or december \u003cTWO_THOUSAND\u003e which could mark a decisive turn in domestic liquidity thus sen expects deposit growth to bounce back as soon as the rbi reverses its stance leading to a significant shift in sentiment for lenders since march \u003cTWO_THOUSAND\u003e the \u003cONE_\u003e year forward \u003cONE_\u003e yf nifty price to earnings ratio per has surged by \u003cFOUR_TEN_PERCENT\u003e reaching \u003cTWO_TEN\u003e x pushing much of the broader market into overvalued territory in contrast the per for the financial sector has seen its discount to the nifty \u003cFIVE_TEN\u003e expand from \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_TEN_PERCENT\u003e positioning it as a relatively undervalued segment information technology it remains the cheapest sector in the nifty aside from energy with limited options for investors seeking reasonably priced assets the combination of attractive valuations and the prospect of easier liquidity has fueled a short term rally in financials sen explained we see this as a short lived rally rate cuts in \u003cTHREE_\u003e qfy25 would lead to margin cuts in \u003cFOUR_\u003e qfy25 for most major banks given that mortgages \u003cTHREE_TEN_PERCENT\u003e of loan book for most large banks reprice immediately also banks may delay deposit rate cuts due to the recent tightness and hdfc bank s need to replace deposits of the erstwhile hdfc ltd borrowings moreover the structural adjustment to bank valuations is still wip sens said he believes that with growth rates and roes in the mid teens the fair value for large banks is \u003cONE_\u003e \u003cONE_\u003e x pbv and banks will continue to derate till they settle at these valuations emkay global chooses hdfc bank indusind bank rbl bank and shriram finance as the key stock picks in the financial sector to play this short term rally","timestamp":"2024-09-26T14:10:00+05:30","market_timestamp":"2024-09-26T14:10:00+05:30","off_market_hours":false}