{"url":"https://www.livemint.com/market/stock-market-news/zee-media-shares-hit-one-year-high-logging-8-intraday-gain-11727668561220.html","title":"Zee Media shares surge 8%, hit one-year high; rally 75% in just six sessions","description":"Zee Media shares extedned the winning streak for the fourth straight session on Monday and touched a fresh 52-week high of  ₹22.79 apiece on the NSE","content":"Stock market today: Extending the rally for a fourth straight session during early morning deals on Monday, September 30, Zee Media's share price touched an intraday high of  ₹22.79 apiece on the NSE. While climbing to this intraday high, Zee Media's share price also touched a new one-year high.Zee Media share price today opened with an upside gap at  ₹22.55 apiece and touched the day's high of  ₹22.79 per share, recording an over 8% intraday gain against its Friday's close of  ₹20.75 per share. However, the stock failed to sustain at higher levels and witnessed profit-taking. Within a few minutes of hitting their one-year high, Zee Media shares made an intraday low of  ₹21.79 apiece.Zee Media shares started rising after the company informed the Indian stock market exchanges about the fundraising plan. Zee Media had proposed the issuance of up to 13,33,33,333 (Thirteen Crores Thirty-Three Lakhs Thirty-Three Thousand Three Hundred and Thirty-Three) warrants, fully convertible or exchangeable into one fully paid-up equity share each. These warrants are priced at  ₹15 apiece, not exceeding  ₹200 crore.Zee Media Corporation said that an initial payment of 25% of the issue price would be required at the time of warrant subscription and allotment, with the remaining 75% to be paid upon exercising the conversion option within the specified 18-month period. The issue is subject to approval from the company's members and other regulatory authorities as needed.In the last six sessions, Zee Media's share price has risen from  ₹13 to  ₹22.79 apiece, recording a nearly 75% rise. In the last six months, Zee Media shares have risen from around  ₹11.55 apiece to  ₹22.79 per share, logging a nearly 90% rise.","cleaned_content":"stock market today extending the rally for a fourth straight session during early morning deals on monday september \u003cTHREE_TEN\u003e zee medias share price touched an intraday high of \u003cTWO_TEN\u003e apiece on the nse while climbing to this intraday high zee medias share price also touched a new one year high zee media share price today opened with an upside gap at \u003cTWO_TEN\u003e apiece and touched the days high of \u003cTWO_TEN\u003e per share recording an over \u003cEIGHT_PERCENT\u003e intraday gain against its fridays close of \u003cTWO_TEN\u003e per share however the stock failed to sustain at higher levels and witnessed profit taking within a few minutes of hitting their one year high zee media shares made an intraday low of \u003cTWO_TEN\u003e apiece zee media shares started rising after the company informed the indian stock market exchanges about the fundraising plan zee media had proposed the issuance of up to \u003cONE_HUNDRED_MILLION\u003e thirteen crores thirty three lakhs thirty three thousand three hundred and thirty three warrants fully convertible or exchangeable into one fully paid up equity share each these warrants are priced at \u003cONE_TEN\u003e apiece not exceeding \u003cTWO_HUNDRED\u003e crore zee media corporation said that an initial payment of \u003cTWO_TEN_PERCENT\u003e of the issue price would be required at the time of warrant subscription and allotment with the remaining \u003cSEVEN_TEN_PERCENT\u003e to be paid upon exercising the conversion option within the specified \u003cONE_TEN\u003e month period the issue is subject to approval from the companys members and other regulatory authorities as needed in the last six sessions zee medias share price has risen from \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e apiece recording a nearly \u003cSEVEN_TEN_PERCENT\u003e rise in the last six months zee media shares have risen from around \u003cONE_TEN\u003e apiece to \u003cTWO_TEN\u003e per share logging a nearly \u003cNINE_TEN_PERCENT\u003e rise","timestamp":"2024-09-30T09:47:00+05:30","market_timestamp":"2024-09-30T09:47:00+05:30","off_market_hours":false}