{"url":"https://www.livemint.com/market/stock-market-news/zaggle-prepaid-shares-surge-85-in-3-months-165-in-one-year-what-s-next-for-this-fintech-stock-11727676675481.html","title":"Zaggle Prepaid shares surge 85% in 3 months, 165% in one year. What’s next for this fintech stock?","description":"Zaggle Prepaid Ocean Services, a SaaS fintech firm, has seen an 85% rally in its stock over three months. Analysts predict further upside potential of over 30%, bolstered by strategic acquisitions and partnerships.","content":"Shares of Zaggle Prepaid Ocean Services, a SaaS fintech company, have made significant strides on Dalal Street, rewarding shareholders with an impressive 85% gain over the last three months. During this period, the stock price has risen from  ₹235 to its current trading value of  ₹434.50.The recent rally has driven the stock to a 164% gain in one year. Since its listing in September last year, the stock has maintained a steady upward trajectory.Zaggle Prepaid recently announced several acquisitions and strategic tie-ups, boosting Equirus Securities' confidence in the company's growth potential. The brokerage noted that Zaggle's recent tie-ups and acquisitions are with companies that, on a standalone basis, are still nascent in their respective segments. It believes these associations will help the company enhance product offerings (and thus provide more comprehensive solutions) while generating fee income streams.Zaggle's recent acquisitions and tie-ups include a strategic alliance with Founderlink Technologies (Recur Club) to provide financial facilities, such as business loans to Zaggle's customers, vendors, and channel partners.Additionally, the company acquired a 98.3% stake in Span Across IT Solutions (TaxSpanner), which specialises in online bookkeeping and filing of TDS, GST, and ITR. Moreover, Zaggle has secured a 26% stake in Mobileware Technologies, known for its comprehensive suite of products, including NPCI switches for UPI, IMPS, BBPS, and AePS.\"These announcements reinforce our confidence in Zaggle's intent to expand its value-added offerings to corporate clients, thus ensuring stickiness in relationships, and adding fee income streams, which would buoy EBITDA margins. With these benefits set to reflect from FY26E, we raise our FY26 EBITDA margin/PAT estimates by 40 bps/4.5%,\" said Equirus Securities.While Equirus' earlier revenue growth estimates were in line with management guidance, the brokerage was conservative on Zaggle’s EBITDA trajectory over the next 3-4 years, given the company’s high growth phase.However, in light of the recent announcements, Equirus Securities raised its FY26E/FY27E EBITDA margin estimates by 40 bps/70 bps and PAT estimates by 4.5%/8.5%. It retained a 'Long' rating on the stock and revised its target price to  ₹595, indicating an upside potential of 37% from the stock's previous closing price.Incorporated in 2011, Zaggle began as a bootstrapped startup and has since established itself as a prominent player in the spend management space. The company’s value proposition is built around its diversified user base and unique offerings in the market.It provides a SaaS-based spend management and analytics platform, offering solutions in three key areas: business spend management (including vendor and employee expense management), rewards and incentives management for employees and channel partners, and gift card management for merchants.","cleaned_content":"shares of zaggle prepaid ocean services a saas fintech company have made significant strides on dalal street rewarding shareholders with an impressive \u003cEIGHT_TEN_PERCENT\u003e gain over the last three months during this period the stock price has risen from \u003cTWO_HUNDRED\u003e to its current trading value of \u003cFOUR_HUNDRED\u003e the recent rally has driven the stock to a \u003cONE_HUNDRED_PERCENT\u003e gain in one year since its listing in september last year the stock has maintained a steady upward trajectory zaggle prepaid recently announced several acquisitions and strategic tie ups boosting equirus securities confidence in the companys growth potential the brokerage noted that zaggles recent tie ups and acquisitions are with companies that on a standalone basis are still nascent in their respective segments it believes these associations will help the company enhance product offerings and thus provide more comprehensive solutions while generating fee income streams zaggles recent acquisitions and tie ups include a strategic alliance with founderlink technologies recur club to provide financial facilities such as business loans to zaggles customers vendors and channel partners additionally the company acquired a \u003cNINE_TEN_PERCENT\u003e stake in span across it solutions taxspanner which specialises in online bookkeeping and filing of tds gst and itr moreover zaggle has secured a \u003cTWO_TEN_PERCENT\u003e stake in mobileware technologies known for its comprehensive suite of products including npci switches for upi imps bbps and aeps these announcements reinforce our confidence in zaggles intent to expand its value added offerings to corporate clients thus ensuring stickiness in relationships and adding fee income streams which would buoy ebitda margins with these benefits set to reflect from fy26e we raise our fy26 ebitda margin pat estimates by \u003cFOUR_TEN\u003e bps \u003cFOUR_PERCENT\u003e said equirus securities while equirus earlier revenue growth estimates were in line with management guidance the brokerage was conservative on zaggle s ebitda trajectory over the next \u003cTHREE_\u003e \u003cFOUR_\u003e years given the company s high growth phase however in light of the recent announcements equirus securities raised its fy26e fy27e ebitda margin estimates by \u003cFOUR_TEN\u003e bps \u003cSEVEN_TEN\u003e bps and pat estimates by \u003cFOUR_PERCENT\u003e \u003cEIGHT_PERCENT\u003e it retained a long rating on the stock and revised its target price to \u003cFIVE_HUNDRED\u003e indicating an upside potential of \u003cTHREE_TEN_PERCENT\u003e from the stocks previous closing price incorporated in \u003cTWO_THOUSAND\u003e zaggle began as a bootstrapped startup and has since established itself as a prominent player in the spend management space the company s value proposition is built around its diversified user base and unique offerings in the market it provides a saas based spend management and analytics platform offering solutions in three key areas business spend management including vendor and employee expense management rewards and incentives management for employees and channel partners and gift card management for merchants","timestamp":"2024-09-30T13:31:00+05:30","market_timestamp":"2024-09-30T13:31:00+05:30","off_market_hours":false}