{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-kec-pc-jeweller-nbcc-nhpc-mcx-india-hdfc-life-and-more-11727197656545.html","title":"Stocks to Watch: KEC, PC Jeweller, NBCC, NHPC, MCX India, HDFC Life, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"KEC International: Engineering and construction major KEC International has initiated a Qualified Institutional Placement (QIP) to raise  ₹4,500 crore through equity shares. The QIP floor price has been set at  ₹976.64 per share, though the company may offer a discount of up to 5% on the floor price. This follows a board approval on July 26, 2024, and a special resolution passed at the company's AGM on August 22, 2024.PC Jewellers: Multibagger stock PC Jewellers is set to undergo its first-ever stock split as the Board of Directors will convene on September 30, 2024, to discuss the subdivision of shares. Currently, each equity share has a face value of  ₹10, and the company is expected to reveal more details about the split during the meeting.NBCC: In a major move, the Supreme Court will consider NBCC’s proposal to complete 17 stalled projects of Supertech Limited, a decision that could positively affect 27,000 homebuyers. This is reminiscent of a similar intervention with the Amrapali Group, aimed at bringing relief to homebuyers stuck in unfinished projects.MCX: Multi Commodity Exchange (MCX) has revised its transaction fees for Futures and Options contracts, effective October 1, 2024. Fees for Futures contracts will be  ₹2.1 per lakh of turnover value, while fees for Options contracts will be  ₹41.8 per lakh of premium turnover value.NHPC: State-run hydropower firm NHPC Ltd is set to raise approximately  ₹2,300 crore in the current financial year, exceeding its original target of  ₹2,000 crore. This move aligns with the Union government's monetisation goals and supports NHPC’s growth ambitions. The company plans to achieve this by securitising the return on equity from its Dulhasti Power Station in Jammu and Kashmir for the next eight years. Despite this financial arrangement, NHPC will retain full ownership of the project.HDFC Life Insurance: HDFC Life Insurance has scheduled a board meeting on September 27, 2024, to finalize the commercial terms for issuing non-convertible debentures (NCDs). The company had previously approved raising up to  ₹2,000 crore through NCDs in July 2024, to be issued in multiple tranches on a private placement basis.Delta Corp: Delta Corp has approved the demerger of its hospitality and real estate business via a Composite Scheme of Arrangement. The demerged business will now operate under Delta Penland, a newly incorporated subsidiary. According to the share entitlement ratio, eligible shareholders of Delta Corp will receive one new equity share in Delta Penland for every one equity share held in Delta Corp.Easy Trip Planners: Promoter Nishant Pitti of Easy Trip Planners is expected to sell up to 8.5% of his stake in the company through block deals. The block size is estimated at  ₹622 crore, with an indicative price of  ₹41.5 per share. As of the June quarter, Pitti held a 28.13% stake in the travel tech platform.CarTrade Tech: In a recent development, Warburg Pincus-owned Highdell Investment has sold its 8.64% stake in CarTrade Tech for over  ₹375 crore. Mirae Asset Mutual Fund has acquired a 6.4% stake in the company, marking a significant reshuffling of ownership.JSW Group: Sajjan Jindal's JSW Group has confirmed that it will not be relocating its  ₹40,000 crore electric vehicle (EV) and battery manufacturing project from Odisha to Maharashtra. In a press statement issued on Tuesday, the company dismissed earlier reports suggesting a possible shift to Aurangabad or Nagpur. Initially, JSW had signed a Memorandum of Understanding (MoU) with the Odisha government in February to establish the project in Cuttack and Paradip. Despite speculation about a move, the company reaffirmed its commitment to the Odisha sites for the project.","cleaned_content":"kec international engineering and construction major kec international has initiated a qualified institutional placement qip to raise \u003cFOUR_THOUSAND\u003e crore through equity shares the qip floor price has been set at \u003cNINE_HUNDRED\u003e per share though the company may offer a discount of up to \u003cFIVE_PERCENT\u003e on the floor price this follows a board approval on july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and a special resolution passed at the companys agm on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e pc jewellers multibagger stock pc jewellers is set to undergo its first ever stock split as the board of directors will convene on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e to discuss the subdivision of shares currently each equity share has a face value of \u003cONE_TEN\u003e and the company is expected to reveal more details about the split during the meeting nbcc in a major move the supreme court will consider nbcc s proposal to complete \u003cONE_TEN\u003e stalled projects of supertech limited a decision that could positively affect \u003cTWO_TEN_THOUSAND\u003e homebuyers this is reminiscent of a similar intervention with the amrapali group aimed at bringing relief to homebuyers stuck in unfinished projects mcx multi commodity exchange mcx has revised its transaction fees for futures and options contracts effective october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e fees for futures contracts will be \u003cTWO_\u003e per lakh of turnover value while fees for options contracts will be \u003cFOUR_TEN\u003e per lakh of premium turnover value nhpc state run hydropower firm nhpc ltd is set to raise approximately \u003cTWO_THOUSAND\u003e crore in the current financial year exceeding its original target of \u003cTWO_THOUSAND\u003e crore this move aligns with the union governments monetisation goals and supports nhpc s growth ambitions the company plans to achieve this by securitising the return on equity from its dulhasti power station in jammu and kashmir for the next eight years despite this financial arrangement nhpc will retain full ownership of the project hdfc life insurance hdfc life insurance has scheduled a board meeting on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to finalize the commercial terms for issuing non convertible debentures ncds the company had previously approved raising up to \u003cTWO_THOUSAND\u003e crore through ncds in july \u003cTWO_THOUSAND\u003e to be issued in multiple tranches on a private placement basis delta corp delta corp has approved the demerger of its hospitality and real estate business via a composite scheme of arrangement the demerged business will now operate under delta penland a newly incorporated subsidiary according to the share entitlement ratio eligible shareholders of delta corp will receive one new equity share in delta penland for every one equity share held in delta corp easy trip planners promoter nishant pitti of easy trip planners is expected to sell up to \u003cEIGHT_PERCENT\u003e of his stake in the company through block deals the block size is estimated at \u003cSIX_HUNDRED\u003e crore with an indicative price of \u003cFOUR_TEN\u003e per share as of the june quarter pitti held a \u003cTWO_TEN_PERCENT\u003e stake in the travel tech platform cartrade tech in a recent development warburg pincus owned highdell investment has sold its \u003cEIGHT_PERCENT\u003e stake in cartrade tech for over \u003cTHREE_HUNDRED\u003e crore mirae asset mutual fund has acquired a \u003cSIX_PERCENT\u003e stake in the company marking a significant reshuffling of ownership jsw group sajjan jindals jsw group has confirmed that it will not be relocating its \u003cFOUR_TEN_THOUSAND\u003e crore electric vehicle ev and battery manufacturing project from odisha to maharashtra in a press statement issued on tuesday the company dismissed earlier reports suggesting a possible shift to aurangabad or nagpur initially jsw had signed a memorandum of understanding mou with the odisha government in february to establish the project in cuttack and paradip despite speculation about a move the company reaffirmed its commitment to the odisha sites for the project","timestamp":"2024-09-25T08:25:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}