{"url":"https://www.livemint.com/market/stock-market-news/fii-favourite-small-cap-it-stock-hits-5-upper-circuit-for-3rd-straight-day-up-1100-in-20-months-11727253538504.html","title":"FII favourite small-cap IT stock hits 5% upper circuit for 3rd straight day, up 1100% in 20 months","description":"Foreign Institutional Investors (FIIs) hold a 22.9% stake in the company, according to the latest shareholding data for the end of the June quarter. Over the past 20 months, the company's shares have surged from  ₹14 apiece to  ₹168.20, reflecting a remarkable gain of 1,100%.","content":"Shares of Blue Cloud Softech Solutions were locked at the 5% upper circuit limit for the third consecutive session on Wednesday, reaching  ₹168.20 per share. This rally followed the company’s announcement that it has received ISO 9001:2015 and ISO 27001:2022 certifications, which further reinforce its commitment to quality management, information security, and service excellence.According to the company's regulatory filing, the ISO 9001:2015 certification ensures that Blue Cloud Softech maintains a robust quality management system, enhancing customer satisfaction by consistently meeting client expectations. Meanwhile, the ISO 27001:2022 certification signifies the company’s effective management of sensitive information, ensuring the confidentiality, integrity, and availability of data.CFO and Whole-Time Director of Blue Cloud Softech Solutions Limited, Mr. Manoj Sandilya Telakapalli, stated that \"achieving these ISO certifications is a significant milestone for our organization. It reflects our commitment to maintaining the highest standards of quality, security, and service delivery. These certifications are a direct result of our team's hard work and dedication, and they further strengthen our ability to deliver exceptional value to our clients across the globe.The company is a leading IT solutions provider specializing in innovative, secure, and scalable technology solutions, with a strong emphasis on healthcare, enterprise-grade AI applications, and AI-enabled cybersecurity products. By leveraging artificial intelligence, the company offers cutting-edge healthcare technology designed to improve patient care, optimize healthcare processes, and enhance medical decision-making.In July, the company secured a contract worth  ₹3.7 crore from Vidyavikas College and Schools to deploy its flagship AI product offerings, 'Emotifics' and 'Edugenie.'According to the company, Emotifics is an innovative 'Emotion AI' analytics solution that tracks human emotions through advanced computer vision technology. This helps schools and colleges improve student performance, staff productivity, and the mental health of students. Edugenie is a comprehensive platform addressing educational needs, featuring ERP, CRM, LMS, and assessment tools, all powered by AI technology.Foreign Institutional Investors (FIIs) hold a 22.9% stake in the company, according to the latest shareholding data for the end of the June quarter. General shareholders own the largest portion, comprising 43.1% of the total stake, while promoters hold the remaining 34%.Over the past 20 months, the company's shares have surged from  ₹14 apiece to the current market price of  ₹168.20, reflecting a remarkable gain of 1,100%.","cleaned_content":"shares of blue cloud softech solutions were locked at the \u003cFIVE_PERCENT\u003e upper circuit limit for the third consecutive session on wednesday reaching \u003cONE_HUNDRED\u003e per share this rally followed the company s announcement that it has received iso \u003cNINE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e and iso \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_THOUSAND\u003e certifications which further reinforce its commitment to quality management information security and service excellence according to the companys regulatory filing the iso \u003cNINE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e certification ensures that blue cloud softech maintains a robust quality management system enhancing customer satisfaction by consistently meeting client expectations meanwhile the iso \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_THOUSAND\u003e certification signifies the company s effective management of sensitive information ensuring the confidentiality integrity and availability of data cfo and whole time director of blue cloud softech solutions limited mr manoj sandilya telakapalli stated that achieving these iso certifications is a significant milestone for our organization it reflects our commitment to maintaining the highest standards of quality security and service delivery these certifications are a direct result of our teams hard work and dedication and they further strengthen our ability to deliver exceptional value to our clients across the globe the company is a leading it solutions provider specializing in innovative secure and scalable technology solutions with a strong emphasis on healthcare enterprise grade ai applications and ai enabled cybersecurity products by leveraging artificial intelligence the company offers cutting edge healthcare technology designed to improve patient care optimize healthcare processes and enhance medical decision making in july the company secured a contract worth \u003cTHREE_\u003e crore from vidyavikas college and schools to deploy its flagship ai product offerings emotifics and edugenie according to the company emotifics is an innovative emotion ai analytics solution that tracks human emotions through advanced computer vision technology this helps schools and colleges improve student performance staff productivity and the mental health of students edugenie is a comprehensive platform addressing educational needs featuring erp crm lms and assessment tools all powered by ai technology foreign institutional investors fiis hold a \u003cTWO_TEN_PERCENT\u003e stake in the company according to the latest shareholding data for the end of the june quarter general shareholders own the largest portion comprising \u003cFOUR_TEN_PERCENT\u003e of the total stake while promoters hold the remaining \u003cTHREE_TEN_PERCENT\u003e over the past \u003cTWO_TEN\u003e months the companys shares have surged from \u003cONE_TEN\u003e apiece to the current market price of \u003cONE_HUNDRED\u003e reflecting a remarkable gain of \u003cONE_THOUSAND_PERCENT\u003e","timestamp":"2024-09-25T14:41:00+05:30","market_timestamp":"2024-09-25T14:41:00+05:30","off_market_hours":false}