{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-under-rs-150-80-rally-in-one-month-auto-stock-hits-upper-circuit-for-fifth-straight-session-11727758044823.html","title":"Small-cap stock under  ₹150: 80% rally in one month, auto stock hits upper circuit for fifth straight session","description":"Small-cap stock under  ₹150: Mercury Ev-Tech share price jumped more than 81% in one month and over 86% in three months. However, the small-cap stock has risen 11% year-to-date (YTD), while it gave multibagger returns of more than 171% in one year.","content":"Mercury Ev-Tech share price was locked at 5% upper circuit for the fifth straight session on Tuesday led by strong buying momentum. Mercury Ev-Tech shares have rallied over 25% in one week.Mercury Ev-Tech announced that its board of directors approved the acquisition of 70% stake in Haitek Automotive Private Limited for  ₹35 lakh.“...the Board of Directors the Company at its meeting held today, inter-alia had considered and approved the acquisition/purchase of 70% stake in Haitek Automotive Private Limited, equivalent to 350,000 equity shares of Rs.10/- each at a price of Rs.10/- each, total consideration being  ₹35,00,000,” Mercury Ev-Tech said in a BSE filing on September 30.Henceforth, Haitek Automotive Private Limited will be considered as Subsidiary Company of Mercury EV-Tech Limited, it added.Haitek Automotive is engaged in the manufacturing of Electric Vehicles and Sales Network of electric three-wheelers. The indicative time period for completion of the acquisition is 90 days.“Mercury’s acquisition of a 70% stake in Haitek is a strategic move to strengthen its position in the 3W (three-wheeler) market in West Bengal. This region is known for its growing demand and potential for scale, which could enhance production efficiency and reduce costs,” Mercury Ev-Tech said.By acquiring a majority stake, Mercury can leverage Haitek's existing operations, distribution networks, and customer base. This could lead to increased market share and improved profitability. Additionally, synergies from this acquisition might allow for shared resources, technology transfer, and innovation in product development, it added.Additionally, the board of Mercury Ev-Tech also approved the appointment of Ajay Ramkrishna Shukla as an Additional Director of the Company with effect from October 01, 2024 under the Category of Independent Director for the second term of 5 years.Arif Rajjak Sayyad has also been appointed as an Additional Director under the Category of Non-Executive-Non Independent with effect from October 01, 2024.Mercury Ev-Tech share price jumped more than 81% in one month and over 86% in three months. However, the small-cap stock has risen 11% year-to-date (YTD), while it gave multibagger returns of more than 171% in one year and a staggering 19,400% return in three years.At 10:20 am, Mercury Ev-Tech shares were still locked at 5% upper circuit at  ₹132.60 apiece on the BSE.","cleaned_content":"mercury ev tech share price was locked at \u003cFIVE_PERCENT\u003e upper circuit for the fifth straight session on tuesday led by strong buying momentum mercury ev tech shares have rallied over \u003cTWO_TEN_PERCENT\u003e in one week mercury ev tech announced that its board of directors approved the acquisition of \u003cSEVEN_TEN_PERCENT\u003e stake in haitek automotive private limited for \u003cTHREE_TEN\u003e lakh the board of directors the company at its meeting held today inter alia had considered and approved the acquisition purchase of \u003cSEVEN_TEN_PERCENT\u003e stake in haitek automotive private limited equivalent to \u003cTHREE_HUNDRED_THOUSAND\u003e equity shares of rs 10 each at a price of rs 10 each total consideration being \u003cTHREE_MILLION\u003e mercury ev tech said in a bse filing on september \u003cTHREE_TEN\u003e henceforth haitek automotive private limited will be considered as subsidiary company of mercury ev tech limited it added haitek automotive is engaged in the manufacturing of electric vehicles and sales network of electric three wheelers the indicative time period for completion of the acquisition is \u003cNINE_TEN\u003e days mercury s acquisition of a \u003cSEVEN_TEN_PERCENT\u003e stake in haitek is a strategic move to strengthen its position in the \u003cTHREE_\u003e w three wheeler market in west bengal this region is known for its growing demand and potential for scale which could enhance production efficiency and reduce costs mercury ev tech said by acquiring a majority stake mercury can leverage haiteks existing operations distribution networks and customer base this could lead to increased market share and improved profitability additionally synergies from this acquisition might allow for shared resources technology transfer and innovation in product development it added additionally the board of mercury ev tech also approved the appointment of ajay ramkrishna shukla as an additional director of the company with effect from october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e under the category of independent director for the second term of \u003cFIVE_\u003e years arif rajjak sayyad has also been appointed as an additional director under the category of non executive non independent with effect from october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e mercury ev tech share price jumped more than \u003cEIGHT_TEN_PERCENT\u003e in one month and over \u003cEIGHT_TEN_PERCENT\u003e in three months however the small cap stock has risen \u003cONE_TEN_PERCENT\u003e year to date ytd while it gave multibagger returns of more than \u003cONE_HUNDRED_PERCENT\u003e in one year and a staggering \u003cONE_TEN_THOUSAND_PERCENT\u003e return in three years at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e am mercury ev tech shares were still locked at \u003cFIVE_PERCENT\u003e upper circuit at \u003cONE_HUNDRED\u003e apiece on the bse","timestamp":"2024-10-01T10:24:00+05:30","market_timestamp":"2024-10-01T10:24:00+05:30","off_market_hours":false}