{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-ruchit-jain-of-5paisa-recommends-amara-raja-energy-aurobindo-pharma-futures-today-11727754727852.html","title":"Shares to buy or sell: Ruchit Jain of 5paisa recommends Amara Raja Energy, Aurobindo Pharma Futures today","description":"Shares to buy or sell: Ruchit Jain of 5paisa has recommended two stocks today - Amara Raja Energy \u0026 Mobility Ltd, and Aurobindo Pharma Futures.","content":"Stock Market News: On Tuesday, the Nifty 50 and Sensex, the key domestic indices, started the day without significant changes as the market underwent a phase of consolidation following a shift in focus by foreign investors towards other Asian markets such as China and Hong Kong.The Nifty 50 index saw a slight decrease of 22.40 points or 0.09%, opening at 25,788 points, while the Sensex opened at 84,257, showing a decline of 42 points or 0.05%.Experts in the market have observed that the redirection of funds from Indian markets to other Asian markets has resulted in a period of consolidation in the Indian stock market.The unprecedented volatility in stock markets is evident in yesterday's 4.8% collapse in the Nikkei index and the 8% jump in the Shanghai Composite Index, according to Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. It is expected that this high volatility will shortly stabilize.Massive capital inflows into Chinese equities have been sparked by the anticipated revival in the Chinese economy. In the previous five days, this has produced 20% gains in the Shanghai Composite, and in the last month, it has produced 19.45% returns in the Hang Seng. FIIs are drawn to this momentum, but it's unclear how long this tactical trade will endure.Nifty 50 started the week on a negative note as the correction in some of the Asian bourses had a rub off effect on our markets. The index traded with a negative bias throughout the day and ended just above 25,800 with a loss of about 370 points.The large cap stocks witnessed profit booking which led to a sharp correction in the benchmark indices at the start of the week. The FII’s had ‘long heavy’ positions in the index futures segment with over 80 percent positions on the long side and the RSI readings on the charts were in overbought zone post the recent run up. Such a combination usually leads to a contra trend move and thus, we witnessed the same on Monday. The immediate support for Nifty 50 is placed in the range of 25,750-25,700 which will be important to watch, if this gets breached then we could see the retracement towards 25,520 and 25,340. In case of a pullback move, resistance will be seen around 26,000-26,100.On shares to buy or sell on Tuesday, Ruchit Jain recommends Amara Raja Energy \u0026 Mobility Ltd, and Aurobindo Pharma Futures.Amara Raja Energy \u0026 Mobility (Buy)The stock has recently gone through a corrective phase and prices are now hovering around the 100 EMA support. The stock has formed a bullish engulfing pattern on the daily chart during end of last week. The RSI on the daily chart has given a positive crossover and hence, we expect a pullback move in the near term.Hence, short term traders can look to buy the stock in the range of  ₹1,425-1,415 for potential near term target around  ₹1,530-1,550. The stop loss on long positions should be placed below  ₹1,350.The stock has formed a lower top lower bottom on the daily chart and is thus in a short term corrective phase. The RSI oscillator is negative while short build was seen in the futures segment.The stock has closed below the 1,500 mark where high open interest was placed which could lead to unwinding of positions of put writers.Hence, short term traders can look to short the October Futures in the range of  ₹1,480-1,490 for potential target around  ₹1,390. The stoploss on short positions should be placed above  ₹1,550.","cleaned_content":"stock market news on tuesday the nifty \u003cFIVE_TEN\u003e and sensex the key domestic indices started the day without significant changes as the market underwent a phase of consolidation following a shift in focus by foreign investors towards other asian markets such as china and hong kong the nifty \u003cFIVE_TEN\u003e index saw a slight decrease of \u003cTWO_TEN\u003e points or \u003cZERO_PERCENT\u003e opening at \u003cTWO_TEN_THOUSAND\u003e points while the sensex opened at \u003cEIGHT_TEN_THOUSAND\u003e showing a decline of \u003cFOUR_TEN\u003e points or \u003cZERO_PERCENT\u003e experts in the market have observed that the redirection of funds from indian markets to other asian markets has resulted in a period of consolidation in the indian stock market the unprecedented volatility in stock markets is evident in yesterdays \u003cFOUR_PERCENT\u003e collapse in the nikkei index and the \u003cEIGHT_PERCENT\u003e jump in the shanghai composite index according to dr v k vijayakumar chief investment strategist at geojit financial services it is expected that this high volatility will shortly stabilize massive capital inflows into chinese equities have been sparked by the anticipated revival in the chinese economy in the previous five days this has produced \u003cTWO_TEN_PERCENT\u003e gains in the shanghai composite and in the last month it has produced \u003cONE_TEN_PERCENT\u003e returns in the hang seng fiis are drawn to this momentum but its unclear how long this tactical trade will endure nifty \u003cFIVE_TEN\u003e started the week on a negative note as the correction in some of the asian bourses had a rub off effect on our markets the index traded with a negative bias throughout the day and ended just above \u003cTWO_TEN_THOUSAND\u003e with a loss of about \u003cTHREE_HUNDRED\u003e points the large cap stocks witnessed profit booking which led to a sharp correction in the benchmark indices at the start of the week the fii s had long heavy positions in the index futures segment with over \u003cEIGHT_TEN_PERCENT\u003e positions on the long side and the rsi readings on the charts were in overbought zone post the recent run up such a combination usually leads to a contra trend move and thus we witnessed the same on monday the immediate support for nifty \u003cFIVE_TEN\u003e is placed in the range of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e which will be important to watch if this gets breached then we could see the retracement towards \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in case of a pullback move resistance will be seen around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on shares to buy or sell on tuesday ruchit jain recommends amara raja energy mobility ltd and aurobindo pharma futures amara raja energy mobility buy the stock has recently gone through a corrective phase and prices are now hovering around the \u003cONE_HUNDRED\u003e ema support the stock has formed a bullish engulfing pattern on the daily chart during end of last week the rsi on the daily chart has given a positive crossover and hence we expect a pullback move in the near term hence short term traders can look to buy the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for potential near term target around \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e the stop loss on long positions should be placed below \u003cONE_THOUSAND\u003e the stock has formed a lower top lower bottom on the daily chart and is thus in a short term corrective phase the rsi oscillator is negative while short build was seen in the futures segment the stock has closed below the \u003cONE_THOUSAND\u003e mark where high open interest was placed which could lead to unwinding of positions of put writers hence short term traders can look to short the october futures in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for potential target around \u003cONE_THOUSAND\u003e the stoploss on short positions should be placed above \u003cONE_THOUSAND\u003e","timestamp":"2024-10-01T10:01:00+05:30","market_timestamp":"2024-10-01T10:01:00+05:30","off_market_hours":false}