{"url":"https://www.livemint.com/market/stock-market-news/us-fed-rate-cut-indian-market-is-on-the-backburner-due-to-premium-valuation-says-analyst-11727011545860.html","title":"US Fed rate cut: Indian market is on the backburner due to premium valuation, says analyst","description":"The market will become data based in the short to medium term, looking at the strength of the economy and slowdown in inflation. Any signs of a more pronounced economic slowdown, as the Fed fears, could have a negative impact on the market.","content":"In the past month, the global equity market had exhibited volatility and mixed performance leading towards the pivotal FOMC decision of September 18. It was highly anticipated that the Fed would break its hawkish policy started since early 2022 and shift to an accommodative monetary policy by initiating a 25bps cut. The market believed that, given the strength of the economy, the FOMC would take a gradual approach in reducing interest rates.As the event drew nearer, market momentum weakened, assuming that the 25bps rate cut is already factored in, stock prices was hovering near record highs. This tempered outlook was stemmed from the Fed's aggressive stance in June and the Fed chair’s recent comments at the Jackson Hole symposium, where concerns over persistent inflation and a strong economy were highlighted.Notably, the recent monthly \u0026 quarterly frequency data indicated elevated economic growth and CPI, which suggests that the economy does not need a drastic change in interest rate policy. Inflation remains above the Fed's target, and the unemployment rate improved from 4.3% in July to 4.2% in August, signalling ongoing economic growth. But the expectation changed this week, a fraction of days before the event, and the market started to build-in the plausibility of a 50-bps cut. There is a lack of clarity as to why the view changed so swiftly as data points continue to hold the ground.A few considerations that the Fed would have addressed include the sharp drop in bond market yields, which reflects growing concerns about a potential economic slowdown. US govt 10yr vs 2yrs yields are at status que of ~3.7% and ~3.6%, respectively, when the Fed rate was at 5.50%. Huge discount between market yield and Fed rate and lack of discount between 10yr and 2yr paper indicate caution in the air. Currently, investors inflows are favouring debt market over equities. Accordingly, in the September policy, the Fed has become more cautious compared to June. It has slightly lowered the GDP growth forecast for 2024 from 2.1% to 2.0%, while raising the unemployment forecast from 4.0% to 4.4%.In the lead-up to the November presidential election, following the 50-bps rate cut in September, the Fed has signalled an additional 50-bps reduction by the end of 2024. This accelerated pace of rate cuts is expected to extend into 2025, bringing the Fed rate down to average 3.25% by December 2025, significantly below the market's previous expectation of 3.60% for the same period.The Fed appears to have taken a proactive stance, recognizing that lending rates are at a decade high, which may affect consumer demand and the workforce in 2025. The benefit of the rate transition is expected to happen over a lag of quarters to the consumers and businesses through commercial lending. Today it has positively surprised the equity markets, as a lower discount rate enhances the present value of assets and potentially boosting valuations akin to those in emerging markets due to FII inflows. Following this announcement, Asian currencies have appreciated, however, the Indian rupee (INR) has not seen similar gains, primarily due to its premium valuation.On the downside, a weakening U.S. dollar resulting from interest rate cuts could negatively impact the income of export-oriented sectors such as IT, pharmaceuticals, and auto ancillaries. Indian IT stocks are facing profit booking after the strong rally of the last 3-4months. Compounding is the negative view of IT players to delayed promotions, economic slowdown and minor layoffs in the US.Notably, the recent monthly \u0026 quarterly frequency data indicated elevated economic growth and CPI, which suggests that the economy does not need a drastic change in interest rate policy. Inflation remains above the Fed's target, and the unemployment rate improved from 4.3% in July to 4.2% in August, signalling ongoing economic growth. But the expectation changed this week, a fraction of days before the event, and the market started to build-in the plausibility of a 50-bps cut. There is a lack of clarity as to why the view changed so swiftly as data points continue to hold the ground.A few considerations that the Fed would have addressed include the sharp drop in bond market yields, which reflects growing concerns about a potential economic slowdown. US govt 10yr vs 2yrs yields are at status que of ~3.7% and ~3.6%, respectively, when the Fed rate was at 5.50%. Huge discount between market yield and Fed rate and lack of discount between 10yr and 2yr paper indicate caution in the air. Currently, investors inflows are favouring debt market over equities. Accordingly, in the September policy, the Fed has become more cautious compared to June. It has slightly lowered the GDP growth forecast for 2024 from 2.1% to 2.0%, while raising the unemployment forecast from 4.0% to 4.4%.In the lead-up to the November presidential election, following the 50-bps rate cut in September, the Fed has signalled an additional 50-bps reduction by the end of 2024. This accelerated pace of rate cuts is expected to extend into 2025, bringing the Fed rate down to average 3.25% by December 2025, significantly below the market's previous expectation of 3.60% for the same period.The Fed appears to have taken a proactive stance, recognizing that lending rates are at a decade high, which may affect consumer demand and the workforce in 2025. The benefit of the rate transition is expected to happen over a lag of quarters to the consumers and businesses through commercial lending. Today it has positively surprised the equity markets, as a lower discount rate enhances the present value of assets and potentially boosting valuations akin to those in emerging markets due to FII inflows. Following this announcement, Asian currencies have appreciated, however, the Indian rupee (INR) has not seen similar gains, primarily due to its premium valuation.On the downside, a weakening U.S. dollar resulting from interest rate cuts could negatively impact the income of export-oriented sectors such as IT, pharmaceuticals, and auto ancillaries. Indian IT stocks are facing profit booking after the strong rally of the last 3-4months. Compounding is the negative view of IT players to delayed promotions, economic slowdown and minor layoffs in the US.|#+|The rapid shift in monetary policy has significantly improved market conditions. Asian peers are expected to do well in the short-term, while the Indian market is on the backburner due to premium valuation. Like China is available at a 1-year forward P/E of 10x while India is at 21x. The market will become data based in the short to medium term, looking at the strength of the economy and slowdown in inflation. Any signs of a more pronounced economic slowdown, as the Fed fears, could have a negative impact on the market. Nevertheless, current data is encouraging, and the expected rapid reduction in interest rates should boost the economy and stock markets in the short term. In that emerging markets will be the immediate beneficiary due to increase in FIIs inflow.The author Vinod Nair is the Head of Research at Geojit Financial Services.","cleaned_content":"in the past month the global equity market had exhibited volatility and mixed performance leading towards the pivotal fomc decision of september \u003cONE_TEN\u003e it was highly anticipated that the fed would break its hawkish policy started since early \u003cTWO_THOUSAND\u003e and shift to an accommodative monetary policy by initiating a \u003cTWO_TEN\u003e bps cut the market believed that given the strength of the economy the fomc would take a gradual approach in reducing interest rates as the event drew nearer market momentum weakened assuming that the \u003cTWO_TEN\u003e bps rate cut is already factored in stock prices was hovering near record highs this tempered outlook was stemmed from the feds aggressive stance in june and the fed chair s recent comments at the jackson hole symposium where concerns over persistent inflation and a strong economy were highlighted notably the recent monthly quarterly frequency data indicated elevated economic growth and cpi which suggests that the economy does not need a drastic change in interest rate policy inflation remains above the feds target and the unemployment rate improved from \u003cFOUR_PERCENT\u003e in july to \u003cFOUR_PERCENT\u003e in august signalling ongoing economic growth but the expectation changed this week a fraction of days before the event and the market started to build in the plausibility of a \u003cFIVE_TEN\u003e bps cut there is a lack of clarity as to why the view changed so swiftly as data points continue to hold the ground a few considerations that the fed would have addressed include the sharp drop in bond market yields which reflects growing concerns about a potential economic slowdown us govt \u003cONE_TEN\u003e yr vs \u003cTWO_\u003e yrs yields are at status que of \u003cTHREE_PERCENT\u003e and \u003cTHREE_PERCENT\u003e respectively when the fed rate was at \u003cFIVE_PERCENT\u003e huge discount between market yield and fed rate and lack of discount between \u003cONE_TEN\u003e yr and \u003cTWO_\u003e yr paper indicate caution in the air currently investors inflows are favouring debt market over equities accordingly in the september policy the fed has become more cautious compared to june it has slightly lowered the gdp growth forecast for \u003cTWO_THOUSAND\u003e from \u003cTWO_PERCENT\u003e to \u003cTWO_PERCENT\u003e while raising the unemployment forecast from \u003cFOUR_PERCENT\u003e to \u003cFOUR_PERCENT\u003e in the lead up to the november presidential election following the \u003cFIVE_TEN\u003e bps rate cut in september the fed has signalled an additional \u003cFIVE_TEN\u003e bps reduction by the end of \u003cTWO_THOUSAND\u003e this accelerated pace of rate cuts is expected to extend into \u003cTWO_THOUSAND\u003e bringing the fed rate down to average \u003cTHREE_PERCENT\u003e by december \u003cTWO_THOUSAND\u003e significantly below the markets previous expectation of \u003cTHREE_PERCENT\u003e for the same period the fed appears to have taken a proactive stance recognizing that lending rates are at a decade high which may affect consumer demand and the workforce in \u003cTWO_THOUSAND\u003e the benefit of the rate transition is expected to happen over a lag of quarters to the consumers and businesses through commercial lending today it has positively surprised the equity markets as a lower discount rate enhances the present value of assets and potentially boosting valuations akin to those in emerging markets due to fii inflows following this announcement asian currencies have appreciated however the indian rupee inr has not seen similar gains primarily due to its premium valuation on the downside a weakening u s dollar resulting from interest rate cuts could negatively impact the income of export oriented sectors such as it pharmaceuticals and auto ancillaries indian it stocks are facing profit booking after the strong rally of the last \u003cTHREE_\u003e \u003cFOUR_\u003e months compounding is the negative view of it players to delayed promotions economic slowdown and minor layoffs in the us notably the recent monthly quarterly frequency data indicated elevated economic growth and cpi which suggests that the economy does not need a drastic change in interest rate policy inflation remains above the feds target and the unemployment rate improved from \u003cFOUR_PERCENT\u003e in july to \u003cFOUR_PERCENT\u003e in august signalling ongoing economic growth but the expectation changed this week a fraction of days before the event and the market started to build in the plausibility of a \u003cFIVE_TEN\u003e bps cut there is a lack of clarity as to why the view changed so swiftly as data points continue to hold the ground a few considerations that the fed would have addressed include the sharp drop in bond market yields which reflects growing concerns about a potential economic slowdown us govt \u003cONE_TEN\u003e yr vs \u003cTWO_\u003e yrs yields are at status que of \u003cTHREE_PERCENT\u003e and \u003cTHREE_PERCENT\u003e respectively when the fed rate was at \u003cFIVE_PERCENT\u003e huge discount between market yield and fed rate and lack of discount between \u003cONE_TEN\u003e yr and \u003cTWO_\u003e yr paper indicate caution in the air currently investors inflows are favouring debt market over equities accordingly in the september policy the fed has become more cautious compared to june it has slightly lowered the gdp growth forecast for \u003cTWO_THOUSAND\u003e from \u003cTWO_PERCENT\u003e to \u003cTWO_PERCENT\u003e while raising the unemployment forecast from \u003cFOUR_PERCENT\u003e to \u003cFOUR_PERCENT\u003e in the lead up to the november presidential election following the \u003cFIVE_TEN\u003e bps rate cut in september the fed has signalled an additional \u003cFIVE_TEN\u003e bps reduction by the end of \u003cTWO_THOUSAND\u003e this accelerated pace of rate cuts is expected to extend into \u003cTWO_THOUSAND\u003e bringing the fed rate down to average \u003cTHREE_PERCENT\u003e by december \u003cTWO_THOUSAND\u003e significantly below the markets previous expectation of \u003cTHREE_PERCENT\u003e for the same period the fed appears to have taken a proactive stance recognizing that lending rates are at a decade high which may affect consumer demand and the workforce in \u003cTWO_THOUSAND\u003e the benefit of the rate transition is expected to happen over a lag of quarters to the consumers and businesses through commercial lending today it has positively surprised the equity markets as a lower discount rate enhances the present value of assets and potentially boosting valuations akin to those in emerging markets due to fii inflows following this announcement asian currencies have appreciated however the indian rupee inr has not seen similar gains primarily due to its premium valuation on the downside a weakening u s dollar resulting from interest rate cuts could negatively impact the income of export oriented sectors such as it pharmaceuticals and auto ancillaries indian it stocks are facing profit booking after the strong rally of the last \u003cTHREE_\u003e \u003cFOUR_\u003e months compounding is the negative view of it players to delayed promotions economic slowdown and minor layoffs in the us the rapid shift in monetary policy has significantly improved market conditions asian peers are expected to do well in the short term while the indian market is on the backburner due to premium valuation like china is available at a \u003cONE_\u003e year forward p e of \u003cONE_TEN\u003e x while india is at \u003cTWO_TEN\u003e x the market will become data based in the short to medium term looking at the strength of the economy and slowdown in inflation any signs of a more pronounced economic slowdown as the fed fears could have a negative impact on the market nevertheless current data is encouraging and the expected rapid reduction in interest rates should boost the economy and stock markets in the short term in that emerging markets will be the immediate beneficiary due to increase in fiis inflow the author vinod nair is the head of research at geojit financial services","timestamp":"2024-09-22T19:21:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}