{"url":"https://www.livemint.com/market/stock-market-news/pb-fintech-up-over-140-in-2024-so-far-on-track-to-hit-rs-2200-in-near-term-says-analyst-11726995106472.html","title":"PB Fintech: Up over 140% in 2024 so far, on track to hit  ₹2,200 in near term, says analyst","description":"PB Fintech shares have jumped from  ₹from  ₹794 apiece to their current trading price of  ₹1,931, reflecting an impressive gain of 144%. Analysts predict further growth, targeting  ₹2,200 level in the near term.","content":"Shares of PB Fintech, the parent company of Policy Bazaar and Paisa Bazaar, have been on a remarkable upward trajectory in recent months, consistently breaking record highs and delivering impressive returns to shareholders.The stock began its steady ascent in January, when it crossed its IPO price for the first time in two years, and has since made significant strides on Dalal Street. Over the course of this year, shares have surged from  ₹794 apiece to their current trading price of  ₹1,931, reflecting an impressive gain of 144 per cent.Notably, the stock has posted gains in 8 out of 9 months, including September, with January recording the highest monthly increase of 26.14 per cent, followed by a 22 per cent gain in August. This extraordinary rally has brought the stock close to the  ₹2,000 mark, as the company's market capitalization approaches the  ₹1 lakh crore milestone. It is currently about  ₹12,000 crore short of reaching the milestone.At its current price, the stock is trading 97 per cent higher than its IPO price of  ₹980 apiece. Moreover, from its all-time low of  ₹356 apiece in November 2022, PB Fintech has soared by a staggering 442 per cent, showcasing the company's strong performance and investor confidence.The company is engaged in providing integrated online marketing, IT consulting, and support services largely for the financial services industry, including insurance. PB Fintech operates Policy Bazaar, India's largest digital insurance marketplace, and Paisa Bazaar, which provides services related to lending products.It plans to expand its offerings with the launch of PB Money, a personal finance management platform that will help users manage payments, investments, and insurance. The launch is scheduled for Q2.As of March 31, 2024, Policy Bazaar boasted over 77.3 million registered consumers, with 16.6 million unique buyers purchasing a total of 42.1 million policies, averaging 2.5 policies per customer. Meanwhile, Paisa Bazaar serves 43.4 million consumers who accessed their free credit score, accounting for 15 per cent of India's active credit score users.The company had established 53 partnerships with insurance providers and more than 65 lending collaborations at the end of FY24, reinforcing its dominant position in the industry.In its recent report, global brokerage firm Jefferies highlighted that digital brokers like PB Fintech are benefiting from rising insurance penetration and the growing consumer preference for online channels. As the operator of India's largest online insurance platform, with over 90 per cent market share, PB Fintech is expected to achieve a 30 per cent CAGR in premiums from FY25-27E. Additionally, strong operating leverage in its renewal book could drive 5x EBITDA growth, according to Jefferies.Riyank Arora, Technical Analyst, Mehta Equities, said, \"PB Fintech has maintained a consistent upward trajectory over the past six months, breaking above its all-time high of  ₹1470 set on its IPO day and currently trading around  ₹1930.\"\"The technical structure suggests strong support at  ₹1,680, with immediate support at  ₹1,800, indicating limited downside risk. As the bullish momentum persists, the stock is well-positioned to reach  ₹2100 and  ₹2200 in the near term. Based on Fibonacci retracements, the longer-term upside targets could extend to the  ₹2,500- ₹2,640 zone, reinforcing the positive outlook,\" Riyank Arora added.","cleaned_content":"shares of pb fintech the parent company of policy bazaar and paisa bazaar have been on a remarkable upward trajectory in recent months consistently breaking record highs and delivering impressive returns to shareholders the stock began its steady ascent in january when it crossed its ipo price for the first time in two years and has since made significant strides on dalal street over the course of this year shares have surged from \u003cSEVEN_HUNDRED\u003e apiece to their current trading price of \u003cONE_THOUSAND\u003e reflecting an impressive gain of \u003cONE_HUNDRED_PERCENT\u003e notably the stock has posted gains in \u003cEIGHT_\u003e out of \u003cNINE_\u003e months including september with january recording the highest monthly increase of \u003cTWO_TEN_PERCENT\u003e followed by a \u003cTWO_TEN_PERCENT\u003e gain in august this extraordinary rally has brought the stock close to the \u003cTWO_THOUSAND\u003e mark as the companys market capitalization approaches the \u003cONE_\u003e lakh crore milestone it is currently about \u003cONE_TEN_THOUSAND\u003e crore short of reaching the milestone at its current price the stock is trading \u003cNINE_TEN_PERCENT\u003e higher than its ipo price of \u003cNINE_HUNDRED\u003e apiece moreover from its all time low of \u003cTHREE_HUNDRED\u003e apiece in november \u003cTWO_THOUSAND\u003e pb fintech has soared by a staggering \u003cFOUR_HUNDRED_PERCENT\u003e showcasing the companys strong performance and investor confidence the company is engaged in providing integrated online marketing it consulting and support services largely for the financial services industry including insurance pb fintech operates policy bazaar indias largest digital insurance marketplace and paisa bazaar which provides services related to lending products it plans to expand its offerings with the launch of pb money a personal finance management platform that will help users manage payments investments and insurance the launch is scheduled for q2 as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e policy bazaar boasted over \u003cSEVEN_TEN\u003e million registered consumers with \u003cONE_TEN\u003e million unique buyers purchasing a total of \u003cFOUR_TEN\u003e million policies averaging \u003cTWO_\u003e policies per customer meanwhile paisa bazaar serves \u003cFOUR_TEN\u003e million consumers who accessed their free credit score accounting for \u003cONE_TEN_PERCENT\u003e of indias active credit score users the company had established \u003cFIVE_TEN\u003e partnerships with insurance providers and more than \u003cSIX_TEN\u003e lending collaborations at the end of fy24 reinforcing its dominant position in the industry in its recent report global brokerage firm jefferies highlighted that digital brokers like pb fintech are benefiting from rising insurance penetration and the growing consumer preference for online channels as the operator of indias largest online insurance platform with over \u003cNINE_TEN_PERCENT\u003e market share pb fintech is expected to achieve a \u003cTHREE_TEN_PERCENT\u003e cagr in premiums from fy25 \u003cTWO_TEN\u003e e additionally strong operating leverage in its renewal book could drive \u003cFIVE_\u003e x ebitda growth according to jefferies riyank arora technical analyst mehta equities said pb fintech has maintained a consistent upward trajectory over the past six months breaking above its all time high of \u003cONE_THOUSAND\u003e set on its ipo day and currently trading around \u003cONE_THOUSAND\u003e the technical structure suggests strong support at \u003cONE_THOUSAND\u003e with immediate support at \u003cONE_THOUSAND\u003e indicating limited downside risk as the bullish momentum persists the stock is well positioned to reach \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e in the near term based on fibonacci retracements the longer term upside targets could extend to the \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e zone reinforcing the positive outlook riyank arora added","timestamp":"2024-09-23T11:17:00+05:30","market_timestamp":"2024-09-23T11:17:00+05:30","off_market_hours":false}