{"url":"https://www.livemint.com/market/stock-market-news/radhika-gupta-on-investing-will-be-trolled-but-need-to-move-beyond-active-passive-funds-understand-index-behind-markets-11727243137195.html","title":"Radhika Gupta on investing: ‘Will be trolled for this, but need to move beyond active vs passive funds…’","description":"Radhika Gupta on investing: The Edelweiss MF CEO stressed the need to evaluate passive and active funds individually, pointing out that good and bad options exist in each category. She also advocated for one to understand the index before investing.","content":"Radhika Gupta on investing: Edelweiss Mutual Fund MD and CEO Radhika Gupta has in a post on social media, stressed the need to evaluate passive and active funds individually, pointing out that good and bad options exist in each category. She also advocated to her followers to understand the index behind a fund before investing in it.In a post on X (formerly known as Twitter), Gupta expressed that she “will get trolled for saying this” but added that investors “need move beyond the buckets of active vs. passive and start understanding funds for what they are individually — good or bad.”“There are brilliant active funds out there and terrible passive ones. The reverse is also true. In passive since the category is newer and evolving, more rigour needs to be applied in looking at the index behind the fund,” she added.Further advising on how one can evaluate before investing, she said, “More rigour needs to be applied in looking at the index behind the fund—construct, methodology, valuations, weighting, market cap exposure. It isn't as simple as buying an index fund based on the last one or three years' returns.”Gupta's consistent stance on social media has been to encourage her followers, who include many young Indians, to invest in systematic investment plans or SIPs. In her many posts about financial planning, she advocates for steady investment of a part of your earnings in SIPs.Last week Gupta said she would love for SIP investments to become the “new measure” of wealth. “With India financializing, the new measure should be the size of your monthly SIP book. I would love to hear young people say, ‘Meri toh mahine ki 1L ki SIP hai, what about you?’” Gupta wote on X. (Hindi translation - I invest  ₹1 lakh monthly in SIP, what about you?).In July 2024, came advice for ‘dal-chawal’ funds, in which she asked users to ensure that 80 per cent of their portfolios were comprised. According to Gupta, broad-based mutual funds that are “all-weather” and “span a range of sectors” would be ‘dal-chawal’ funds.Earlier in May 2024 too, Gupta posted a video from being backstage at Shark Tank India, where she encouraged staff to begin investing in mutual funds through SIPs. In a video, she is seen behind the scenes on the sets of Shark Tank India, advising and encouraging staff to begin investing.","cleaned_content":"radhika gupta on investing edelweiss mutual fund md and ceo radhika gupta has in a post on social media stressed the need to evaluate passive and active funds individually pointing out that good and bad options exist in each category she also advocated to her followers to understand the index behind a fund before investing in it in a post on x formerly known as twitter gupta expressed that she will get trolled for saying this but added that investors need move beyond the buckets of active vs passive and start understanding funds for what they are individually good or bad there are brilliant active funds out there and terrible passive ones the reverse is also true in passive since the category is newer and evolving more rigour needs to be applied in looking at the index behind the fund she added further advising on how one can evaluate before investing she said more rigour needs to be applied in looking at the index behind the fund construct methodology valuations weighting market cap exposure it isnt as simple as buying an index fund based on the last one or three years returns guptas consistent stance on social media has been to encourage her followers who include many young indians to invest in systematic investment plans or sips in her many posts about financial planning she advocates for steady investment of a part of your earnings in sips last week gupta said she would love for sip investments to become the new measure of wealth with india financializing the new measure should be the size of your monthly sip book i would love to hear young people say meri toh mahine ki \u003cONE_\u003e l ki sip hai what about you gupta wote on x hindi translation i invest \u003cONE_\u003e lakh monthly in sip what about you in july \u003cTWO_THOUSAND\u003e came advice for dal chawal funds in which she asked users to ensure that \u003cEIGHT_TEN_PERCENT\u003e of their portfolios were comprised according to gupta broad based mutual funds that are all weather and span a range of sectors would be dal chawal funds earlier in may \u003cTWO_THOUSAND\u003e too gupta posted a video from being backstage at shark tank india where she encouraged staff to begin investing in mutual funds through sips in a video she is seen behind the scenes on the sets of shark tank india advising and encouraging staff to begin investing","timestamp":"2024-09-25T13:40:00+05:30","market_timestamp":"2024-09-25T13:40:00+05:30","off_market_hours":false}