{"url":"https://www.livemint.com/market/stock-market-news/itd-cementation-shares-multibagger-small-cap-stock-hits-20-upper-circuit-more-steam-left-11727941511955.html","title":"ITD Cementation shares: Multibagger small-cap stock hits 20% upper circuit; More steam left?","description":"ITD Cementation shares have been on a stellar rally as they have gained over 17% in one month. The small-cap stock has given multibagger returns of nearly 126% year-to-date (YTD) and more than 187% returns in one year.","content":"ITD Cementation share price jumped 20% to hit the upper circuit on Thursday after the company won a new contract for a commercial building in Uttar Pradesh. The multibagger small-cap stock, ITD Cementation shares hit 20% upper circuit to touch a 52-week high of  ₹644.40 apiece on the BSE.ITD Cementation India said the total value of the contract is  ₹1,937 crore including taxes and duties.“ITD Cementation India Limited has secured a contract for constructing a multistoried commercial building worth approximately  ₹1,937 crore including taxes and duties in Uttar Pradesh,” the company said in a BSE filing.Volumes traded of ITD Cementation shares also spiked on October 3. Around 1 crore ITD Cementation shares changed hands on BSE and NSE combined as compared with the one-month average trading volume of 41 lakh equity shares.The rally in ITD Cementation stock comes on a day when the broader stock market crashed amid weak global cues. The Sensex and Nifty 50 slumped more than 1.5% each as selling intensified across sectors.ITD Cementation shares have been on a stellar rally as they have gained over 17% in one month. The small-cap stock has given multibagger returns of nearly 126% year-to-date (YTD) and more than 187% returns in one year.“The trend in ITD Cementation shares seems positive as the stock has made higher top higher bottom formation on the price chart with heavy volumes. The upward momentum in the stock is estimated to continue going ahead given strong buying interest led by positive news flow,” said Ruchit Jain, Lead Research Analyst at 5Paisa Capital.According to Jain, ITD Cementation shares have a strong support at  ₹520 level and unless this support is broken, the uptrend is expected to continue.“ITD Cementation stock price has the potential to test  ₹725 level in the near term,” Jain said.’At 1:15 pm, ITD Cementation shares were still locked at 20% upper circuit at  ₹644.40 apiece on the BSE, commanding a market capitalisation of over  ₹11,000 crore.","cleaned_content":"itd cementation share price jumped \u003cTWO_TEN_PERCENT\u003e to hit the upper circuit on thursday after the company won a new contract for a commercial building in uttar pradesh the multibagger small cap stock itd cementation shares hit \u003cTWO_TEN_PERCENT\u003e upper circuit to touch a \u003cFIVE_TEN\u003e week high of \u003cSIX_HUNDRED\u003e apiece on the bse itd cementation india said the total value of the contract is \u003cONE_THOUSAND\u003e crore including taxes and duties itd cementation india limited has secured a contract for constructing a multistoried commercial building worth approximately \u003cONE_THOUSAND\u003e crore including taxes and duties in uttar pradesh the company said in a bse filing volumes traded of itd cementation shares also spiked on october \u003cTHREE_\u003e around \u003cONE_\u003e crore itd cementation shares changed hands on bse and nse combined as compared with the one month average trading volume of \u003cFOUR_TEN\u003e lakh equity shares the rally in itd cementation stock comes on a day when the broader stock market crashed amid weak global cues the sensex and nifty \u003cFIVE_TEN\u003e slumped more than \u003cONE_PERCENT\u003e each as selling intensified across sectors itd cementation shares have been on a stellar rally as they have gained over \u003cONE_TEN_PERCENT\u003e in one month the small cap stock has given multibagger returns of nearly \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and more than \u003cONE_HUNDRED_PERCENT\u003e returns in one year the trend in itd cementation shares seems positive as the stock has made higher top higher bottom formation on the price chart with heavy volumes the upward momentum in the stock is estimated to continue going ahead given strong buying interest led by positive news flow said ruchit jain lead research analyst at \u003cFIVE_\u003e paisa capital according to jain itd cementation shares have a strong support at \u003cFIVE_HUNDRED\u003e level and unless this support is broken the uptrend is expected to continue itd cementation stock price has the potential to test \u003cSEVEN_HUNDRED\u003e level in the near term jain said at \u003cONE_\u003e \u003cONE_TEN\u003e pm itd cementation shares were still locked at \u003cTWO_TEN_PERCENT\u003e upper circuit at \u003cSIX_HUNDRED\u003e apiece on the bse commanding a market capitalisation of over \u003cONE_TEN_THOUSAND\u003e crore","timestamp":"2024-10-03T13:22:00+05:30","market_timestamp":"2024-10-03T13:22:00+05:30","off_market_hours":false}