{"url":"https://www.livemint.com/market/stock-market-news/texas-stock-exchange-names-nasdaq-nyse-veterans-to-top-jobs-11727716944331.html","title":"Texas Stock Exchange Names Nasdaq, NYSE Veterans to Top Jobs","description":"The upstart Texas Stock Exchange said it had hired executives from Charles Schwab Corp., Nasdaq Inc. and the New York Stock Exchange as it builds up a leadership team ahead of plans to begin operations next year.","content":"The upstart Texas Stock Exchange said it had hired executives from Charles Schwab Corp., Nasdaq Inc. and the New York Stock Exchange as it builds up a leadership team ahead of plans to begin operations next year.Cam Smith, a veteran of the US Securities and Exchange Commission who most recently worked for Inca Digital, becomes global head of trading. Jeffrey Brown will join as general counsel and chief regulatory officer, after previously working at Charles Schwab. Nicole Chambers, a senior managing director of listings at Nasdaq, will serve a similar role for TXSE Group Inc., the company said Monday in a statement.The Texas Stock Exchange has raised $135 million and plans to file registration documents with the SEC in the next few months, Chief Executive Officer James Lee told reporters in Austin.The bourse has the backing of BlackRock Inc., Citadel Securities and other investors, and aims to challenge the NYSE and Nasdaq as the state tries to grab more of the financial services industry. The TXSE, which aims to begin all-electronic trading operations next year, will be headquartered in Dallas, bolstering a metro area that has been gaining financial jobs from the likes of Goldman Sachs Group Inc. and Charles Schwab.Companies that list on the exchange won’t need to meet any environmental, social and governance thresholds, in line with a pledge to slash burdensome regulations for businesses, Lee said at a press conference with Governor Greg Abbott by his side. Abbott and the Texas Republican Party have been at the forefront of efforts by lawmakers to crack down on so-called ESG investment practices that take into consideration non-financial factors such as environmental risks.“This is as apolitical of an exchange as could ever be put together,” Lee said.Marc Cunningham will serve as global managing director after working as a regional head of capital markets for the NYSE in Houston. Richard Fisher, the former Federal Reserve Bank of Dallas president, will be a strategic adviser, as will Brett Redfearn, a former director of the Division of Trading and Markets at the SEC.TXSE named to its board Tom Long, the co-chief executive of Energy Transfer LP, and Paul Foster, who founded Western Refining Inc. Alex Bussandri, global head of strategy at Citadel Securities, will become a director. Tyson Tuttle, former CEO of Silicon Labs, will also serve on the board, along with former Texas Governor Rick Perry, among others.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"the upstart texas stock exchange said it had hired executives from charles schwab corp nasdaq inc and the new york stock exchange as it builds up a leadership team ahead of plans to begin operations next year cam smith a veteran of the us securities and exchange commission who most recently worked for inca digital becomes global head of trading jeffrey brown will join as general counsel and chief regulatory officer after previously working at charles schwab nicole chambers a senior managing director of listings at nasdaq will serve a similar role for txse group inc the company said monday in a statement the texas stock exchange has raised \u003cONE_HUNDRED\u003e million and plans to file registration documents with the sec in the next few months chief executive officer james lee told reporters in austin the bourse has the backing of blackrock inc citadel securities and other investors and aims to challenge the nyse and nasdaq as the state tries to grab more of the financial services industry the txse which aims to begin all electronic trading operations next year will be headquartered in dallas bolstering a metro area that has been gaining financial jobs from the likes of goldman sachs group inc and charles schwab companies that list on the exchange won t need to meet any environmental social and governance thresholds in line with a pledge to slash burdensome regulations for businesses lee said at a press conference with governor greg abbott by his side abbott and the texas republican party have been at the forefront of efforts by lawmakers to crack down on so called esg investment practices that take into consideration non financial factors such as environmental risks this is as apolitical of an exchange as could ever be put together lee said marc cunningham will serve as global managing director after working as a regional head of capital markets for the nyse in houston richard fisher the former federal reserve bank of dallas president will be a strategic adviser as will brett redfearn a former director of the division of trading and markets at the sec txse named to its board tom long the co chief executive of energy transfer lp and paul foster who founded western refining inc alex bussandri global head of strategy at citadel securities will become a director tyson tuttle former ceo of silicon labs will also serve on the board along with former texas governor rick perry among others this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-30T22:52:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}