{"url":"https://www.livemint.com/market/stock-market-news/forge-auto-international-ipo-day-1-check-here-for-subscription-status-gmp-key-dates-all-you-need-to-know-11727334239481.html","title":"Forge Auto International IPO Day 3: Subscription status, GMP, key dates and other details you need to know","description":"Forge Auto International IPO: The IPO, priced between  ₹102 and  ₹108, opened for subscription on September 26, and saw strong demand from investors. The shares of Forge Auto International are set to list on October 4.","content":"Forge Auto International Limited IPO: This initial public offer (IPO), which opened for subscription on Thursday, September 26 is set to close today. Check here for subscription status, GMP, key dates, and other details.The IPO of Forge Auto International garnered 48.87 times bids by 4.35 pm on Monday, September 30, the last day of the bidding process. The retail category was subscribed 61.17 times, the qualified institutional buyers (QIB) portion 20.13 times and the non-institutional investor (NII) category 58.49 times.Forge Auto International IPO began on September 26 and will close on September 30. The allocation for Forge Auto International IPO is anticipated to be completed on Tuesday, October 1. The proposed listing date for Forge Auto International IPO is Friday, October 4. The shares will list on the NSE SME platform.The  ₹31.10 crore Forge Auto International IPO is a book-built offering, wherein the company is issuing 28.8 lakh shares.The pricing range or price band for Forge Auto International IPO is  ₹102 to  ₹108 per share. The minimum lot size is 1200 shares. Hence, retail investors are required to invest a minimum of  ₹129,600. For HNIs, the minimum investment is two lots (2,400 shares), priced at  ₹259,200.For Forge Auto International IPO, the GMP was  ₹15, which was lower than  ₹36 on day 2 but higher than  ₹30 on day 1, according to data from Investorgain.com. This suggests that the shares of Forge Auto International are accessible in the grey market for  ₹15 more than the issue price.This indicates that market participants anticipate Forge Auto International share price to list at  ₹123, which is a 13.89% premium over the upper band of the issue price.","cleaned_content":"forge auto international limited ipo this initial public offer ipo which opened for subscription on thursday september \u003cTWO_TEN\u003e is set to close today check here for subscription status gmp key dates and other details the ipo of forge auto international garnered \u003cFOUR_TEN\u003e times bids by \u003cFOUR_\u003e pm on monday september \u003cTHREE_TEN\u003e the last day of the bidding process the retail category was subscribed \u003cSIX_TEN\u003e times the qualified institutional buyers qib portion \u003cTWO_TEN\u003e times and the non institutional investor nii category \u003cFIVE_TEN\u003e times forge auto international ipo began on september \u003cTWO_TEN\u003e and will close on september \u003cTHREE_TEN\u003e the allocation for forge auto international ipo is anticipated to be completed on tuesday october \u003cONE_\u003e the proposed listing date for forge auto international ipo is friday october \u003cFOUR_\u003e the shares will list on the nse sme platform the \u003cTHREE_TEN\u003e crore forge auto international ipo is a book built offering wherein the company is issuing \u003cTWO_TEN\u003e lakh shares the pricing range or price band for forge auto international ipo is \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e per share the minimum lot size is \u003cONE_THOUSAND\u003e shares hence retail investors are required to invest a minimum of \u003cONE_HUNDRED_THOUSAND\u003e for hnis the minimum investment is two lots \u003cTWO_THOUSAND\u003e shares priced at \u003cTWO_HUNDRED_THOUSAND\u003e for forge auto international ipo the gmp was \u003cONE_TEN\u003e which was lower than \u003cTHREE_TEN\u003e on day \u003cTWO_\u003e but higher than \u003cTHREE_TEN\u003e on day \u003cONE_\u003e according to data from investorgain com this suggests that the shares of forge auto international are accessible in the grey market for \u003cONE_TEN\u003e more than the issue price this indicates that market participants anticipate forge auto international share price to list at \u003cONE_HUNDRED\u003e which is a \u003cONE_TEN_PERCENT\u003e premium over the upper band of the issue price","timestamp":"2024-09-30T16:45:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}