{"url":"https://www.livemint.com/market/stock-market-news/northern-arc-capital-vs-arkade-developer-vs-western-carriers-india-which-stock-to-buy-sell-or-hold-postlisting-11727165476624.html","title":"Northern Arc Capital vs Arkade Developer vs Western Carriers India: Which stock to buy, sell or hold post-listing?","description":"Northern Arc Capital vs Arkade Developer vs Western Carriers India: Experts believe that Northern Arc Capital shares are better placed against other two shares","content":"Stocks to buy, sell or hold: In an overcrowded primary market, three mainboard public issues and five SME IPOs are listed on the Indian stock market exchanges. Among the three mainboard IPOs, Northern Arc Capital and Arkade Developers opened higher, whereas Western Carriers (India) had a flat debut on Dalal Street. In fact, Western Carriers (India) shares received some beating post-flat listing as well. So, it is trading below its upper price band of  ₹172 apiece.According to stock market experts, Norther Arc Capital shares are expected to bounce back strongly as the company has a robust business model. They said its demand and revenue growth are expected to be sustained, as they are in B2C and B2B lending. They advised allottees to book profit in Western Carriers (India) and Arkade Developers and hold Northern Arc Capital shares for the long term.Highlighting the fundamentals of Northern Arc Capital shares, Prashanth Tapse, Senior Vice President — Research at Mehta Equities, said, \"Post listing, we continue to believe the investors should continue to HOLD as we get an opportunity to hold a stake in a diversified financial services platform dedicated to addressing the retail credit needs of under-served households and businesses in India. Northern Arc Capital share is well-positioned for sustained growth in the long term with the company's strong sectoral focus on MSME, microfinance, and consumer finance. Hence, we believe the market could give Northern Arc Capital a premium multiple towards its leadership position, which may result in a healthy post listing.\"Putting Northern Arc Capital shares ahead of Western Carriers (India) and Arkade Developers shares, Arun Kejriwal, Founder of Kejriwal Research and Investment Services, said, \"Northern Arc Capital has strong fundamentals compared to the other two mainboard companies that made its debut today. The NBFC has lending business in both B2B and B2C. So, both demand and growth of the company are expected to remain on a rising trajectory. Thus, I advise sharing allottees to book profit in Western Carriers and Arkade Developers and hold Northern Arc Capital shares for medium to long-term.\"\"The company's differentiated credit underwriting processes and risk models have helped deliver strong asset quality. Northern Arc's risk models are supported by a substantial data repository comprising over 35.17 million data points, as of 31st March 2024, on portfolios across multiple sectors assessed throughout the journey and qualitative field-level insights that aid credit assessment and monitoring. According to the CRISIL Report, the company had one of the lowest gross non-performing assets (GNPA) of 0.45% and net non-performing assets (NNPA) of 0.08% as of FY24. We thus recommend that investors allotted shares consider holding their positions from a medium to long-term perspective,\" said Prathamesh P Masdekar, Research Analyst, StoxBox.","cleaned_content":"stocks to buy sell or hold in an overcrowded primary market three mainboard public issues and five sme ipos are listed on the indian stock market exchanges among the three mainboard ipos northern arc capital and arkade developers opened higher whereas western carriers india had a flat debut on dalal street in fact western carriers india shares received some beating post flat listing as well so it is trading below its upper price band of \u003cONE_HUNDRED\u003e apiece according to stock market experts norther arc capital shares are expected to bounce back strongly as the company has a robust business model they said its demand and revenue growth are expected to be sustained as they are in b2c and b2b lending they advised allottees to book profit in western carriers india and arkade developers and hold northern arc capital shares for the long term highlighting the fundamentals of northern arc capital shares prashanth tapse senior vice president research at mehta equities said post listing we continue to believe the investors should continue to hold as we get an opportunity to hold a stake in a diversified financial services platform dedicated to addressing the retail credit needs of under served households and businesses in india northern arc capital share is well positioned for sustained growth in the long term with the companys strong sectoral focus on msme microfinance and consumer finance hence we believe the market could give northern arc capital a premium multiple towards its leadership position which may result in a healthy post listing putting northern arc capital shares ahead of western carriers india and arkade developers shares arun kejriwal founder of kejriwal research and investment services said northern arc capital has strong fundamentals compared to the other two mainboard companies that made its debut today the nbfc has lending business in both b2b and b2c so both demand and growth of the company are expected to remain on a rising trajectory thus i advise sharing allottees to book profit in western carriers and arkade developers and hold northern arc capital shares for medium to long term the companys differentiated credit underwriting processes and risk models have helped deliver strong asset quality northern arcs risk models are supported by a substantial data repository comprising over \u003cTHREE_TEN\u003e million data points as of \u003cTHREE_TEN\u003e st march \u003cTWO_THOUSAND\u003e on portfolios across multiple sectors assessed throughout the journey and qualitative field level insights that aid credit assessment and monitoring according to the crisil report the company had one of the lowest gross non performing assets gnpa of \u003cZERO_PERCENT\u003e and net non performing assets nnpa of \u003cZERO_PERCENT\u003e as of fy24 we thus recommend that investors allotted shares consider holding their positions from a medium to long term perspective said prathamesh p masdekar research analyst stoxbox","timestamp":"2024-09-24T13:58:00+05:30","market_timestamp":"2024-09-24T13:58:00+05:30","off_market_hours":false}