{"url":"https://www.livemint.com/market/stock-market-news/mutual-funds-raise-stake-in-paytm-during-q2fy25-stock-surges-70-in-july-sept-quarter-11728884584899.html","title":"Mutual funds raise stake in Paytm during Q2FY25; stock surges 70% in July-Sept quarter","description":"During Q2FY25, mutual funds raised their stake in Paytm from 4.32 crore shares (6.80%) to 5 crore shares (7.86%), indicating increasing institutional belief in the company's long-term potential as its stock delivered a 71% return during this period","content":"During the second quarter of FY25 (Q2FY25), mutual funds increased their stake by 15 per cent in One97 Communications, the parent company of Paytm, reflecting growing institutional confidence in the digital payments company. The period between July and September saw a notable shift, as mutual funds ramped up their holdings with the stock delivering an impressive 70 per cent return.At the end of Q1FY25 (June 30, 2024), Paytm's share price was  ₹402.2. Meanwhile, at the end of Q2FY25 (September 30, 2024), it closed at  ₹688.35, as per BSE analytics, indicating a return of around 71 percent during the period.During the first quarter (Q1 FY25), mutual funds held around 4.32 crore shares of Paytm, accounting for 6.80 per cent of the company’s total shareholding. However, by the end of the second quarter (Q2 FY25), this number surged to approximately 5 crore shares, raising their total stake to 7.86 per cent. This increase in shareholding highlights the growing belief among institutional investors in Paytm's long-term growth potential.Paytm share price was trading in the red, down 0.57 per cent, at  ₹720 on October 14, at 11:29 am, on BSE. The Vijay Shekhar Sharma-led company enjoys a market capitalisation of  ₹45,838 crore. Paytm's share price last hit its 52-week high of  ₹998.30 on October 20, 2023.Leading the increase in mutual fund holdings, Nippon Mutual Funds significantly raised its stake in Paytm. The number of shares held by Nippon increased from around 1.11 crore in Q1 to 1.44 crore in Q2. This resulted in an increase in its shareholding percentage from 1.76 per cent in Q1 to 2.27 per cent in Q2.Similarly, Mirae Mutual Funds also raised its holdings, with the number of shares rising from around 2.29 crore in Q1 to 2.85 crore in Q2. Consequently, Mirae's shareholding percentage grew from 3.92 per cent in Q1 to 4.49 per cent in Q2.","cleaned_content":"during the second quarter of fy25 q2fy25 mutual funds increased their stake by \u003cONE_TEN_PERCENT\u003e in one97 communications the parent company of paytm reflecting growing institutional confidence in the digital payments company the period between july and september saw a notable shift as mutual funds ramped up their holdings with the stock delivering an impressive \u003cSEVEN_TEN_PERCENT\u003e return at the end of q1fy25 june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e paytms share price was \u003cFOUR_HUNDRED\u003e meanwhile at the end of q2fy25 september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e it closed at \u003cSIX_HUNDRED\u003e as per bse analytics indicating a return of around \u003cSEVEN_TEN_PERCENT\u003e during the period during the first quarter q1 fy25 mutual funds held around \u003cFOUR_\u003e crore shares of paytm accounting for \u003cSIX_PERCENT\u003e of the company s total shareholding however by the end of the second quarter q2 fy25 this number surged to approximately \u003cFIVE_\u003e crore shares raising their total stake to \u003cSEVEN_PERCENT\u003e this increase in shareholding highlights the growing belief among institutional investors in paytms long term growth potential paytm share price was trading in the red down \u003cZERO_PERCENT\u003e at \u003cSEVEN_HUNDRED\u003e on october \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e am on bse the vijay shekhar sharma led company enjoys a market capitalisation of \u003cFOUR_TEN_THOUSAND\u003e crore paytms share price last hit its \u003cFIVE_TEN\u003e week high of \u003cNINE_HUNDRED\u003e on october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e leading the increase in mutual fund holdings nippon mutual funds significantly raised its stake in paytm the number of shares held by nippon increased from around \u003cONE_\u003e crore in q1 to \u003cONE_\u003e crore in q2 this resulted in an increase in its shareholding percentage from \u003cONE_PERCENT\u003e in q1 to \u003cTWO_PERCENT\u003e in q2 similarly mirae mutual funds also raised its holdings with the number of shares rising from around \u003cTWO_\u003e crore in q1 to \u003cTWO_\u003e crore in q2 consequently miraes shareholding percentage grew from \u003cTHREE_PERCENT\u003e in q1 to \u003cFOUR_PERCENT\u003e in q2","timestamp":"2024-10-14T12:17:00+05:30","market_timestamp":"2024-10-14T12:17:00+05:30","off_market_hours":false}