{"url":"https://www.livemint.com/market/stock-market-news/rbi-monetary-policy-from-policy-rates-to-inflation-growth-forecast-5-key-highlights-from-rbi-mpc-outcome-11728449604126.html","title":"RBI monetary policy: From policy rates to inflation, growth forecast - 5 key highlights from RBI MPC outcome","description":"RBI monetary policy: RBI MPC on Wednesday, October 9, announced a status quo on repo rates but tweaked the policy stance to neutral from withdrawal of accommodation.","content":"RBI monetary policy: Broadly in line with market expectations, the Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) on Wednesday, October 9, announced a status quo on repo rates but tweaked the policy stance to \"neutral\" from \"withdrawal of accommodation\", while reiterating the risk of inflation.The central bank retained FY25 GDP growth and inflation estimates. However, it highlighted the risk of sticky inflation, as it expects the September CPI to increase because of unfavourable base effects and a rise in fuel prices.Some experts found the RBI Governor Shaktikanta Das' tone slightly hawkish and believe the change in stance may not necessarily mean a rate cut in December as there is no downward revision in growth and inflation estimates.\"The next move is unlikely to be a rate cut; at this juncture, RBI will only keep its options open towards accommodation,\" said Anitha Rangan, Economist, Equirus.\"The hawkish points emanate from the points around (a) inflation is on a declining path, although there is some distance to cover with upside risks from geopolitics and weather, while the agricultural outlook is buoyant for food prices, (b) RBI keeps its guard on noting that “we have to be very careful of opening the gate and need to keep the horse to a tight leash” and mentioning that RBI cannot be complacent with the rapidly evolving global conditions. The change in stance instead gives greater flexibility and optionality to act in sync with the evolving outlook,\" said Rangan.Let's take a look at five key highlights of the RBI MPC October meeting:The RBI kept the repo rates unchanged at 6.5 per cent even though the US Fed cut rates by 50 bps in September. There are strong signals that the US central bank will also cut rates in November and December.However, the RBI changed its policy stance to \"neutral.\" While all six members of the committee voted to shift the policy stance, five of the six members voted to keep the repo rate unchanged.Track RBI Monetary Policy Meeting Updates HereEven though the RBI did not upwardly revise its overall inflation projection for FY25, it highlighted the risk of sticky inflation and fluctuating food and fuel prices.RBI kept CPI Inflation estimate for FY25 unchanged at 4.5 per cent, but cut Q2FY25 CPI estimates to 4.1 per cent from 4.4 per cent. For Q3FY25, it raised CPI estimates to 4.8 per cent from 4.7 per cent.However, it slightly trimmed inflation estimates for the next two quarters—Q4FY25 and Q1FY26. RBI cut Q4FY25 CPI estimates to 4.2 per cent from 4.3 per cent, and Q1FY26 CPI estimates to 4.3 per cent from 4.4 per cent.Governor Das observed that while headline inflation significantly decreased in July and August, mainly due to the base effect in July, core inflation increased in these two months. The CPI for September is expected to increase because of unfavourable base effects and a rise in fuel prices.RBI remains upbeat about the prospects of the Indian economy. It projected the real GDP growth rate for FY25 to be 7.2 per cent while trimming the growth outlook for the second quarter and raising expectations for the last two quarters of the financial year and the first quarter of FY26.RBI cut the Q2FY25 GDP growth forecast to 7 per cent from 7.2 per cent. The central bank raised Q3FY25 GDP growth forecast to 7.4 per cent from 7.3 per cent, Q4FY25 GDP growth forecast to 7.4 per cent from 7.2 per cent, and Q1FY26 GDP growth forecast to 7.3 per cent from 7.2 per cent.The RBI proposed increasing the UPI 1 2 3 pay per-transaction limit from  ₹5,000 to 10,000. Additionally, the UPI Lite wallet limit has been raised from  ₹2,000 to  ₹5,000.\"To further encourage wider adoption of UPI and make it more inclusive, it has been decided to (i) enhance the per-transaction limit in UPI 123 Pay from  ₹5,000 to  ₹10,000, and (ii) increase the UPI Lite wallet limit from  ₹2,000 to  ₹5,000 and the per-transaction limit from  ₹500 to  ₹1,000,\" Das announced.Governor Das underscored the likelihood of stress buildup in a few unsecured loan segments, such as loans for consumption purposes, microfinance, loans, and credit cards. He said the RBI is closely monitoring the incoming information and will take measures as may be considered necessary.\"Banks and NBFC need to carefully assess the individual exposures in these areas, both in terms of size and quality. Their underwriting standards and post-sanction monitoring have to be robust. Continued attention must also be given to potential risks from inoperative deposit accounts, cyber security landscape, mule accounts, and a few other factors,\" said Das.Read all market-related news here","cleaned_content":"rbi monetary policy broadly in line with market expectations the monetary policy committee mpc of the reserve bank of india rbi on wednesday october \u003cNINE_\u003e announced a status quo on repo rates but tweaked the policy stance to neutral from withdrawal of accommodation while reiterating the risk of inflation the central bank retained fy25 gdp growth and inflation estimates however it highlighted the risk of sticky inflation as it expects the september cpi to increase because of unfavourable base effects and a rise in fuel prices some experts found the rbi governor shaktikanta das tone slightly hawkish and believe the change in stance may not necessarily mean a rate cut in december as there is no downward revision in growth and inflation estimates the next move is unlikely to be a rate cut at this juncture rbi will only keep its options open towards accommodation said anitha rangan economist equirus the hawkish points emanate from the points around a inflation is on a declining path although there is some distance to cover with upside risks from geopolitics and weather while the agricultural outlook is buoyant for food prices b rbi keeps its guard on noting that we have to be very careful of opening the gate and need to keep the horse to a tight leash and mentioning that rbi cannot be complacent with the rapidly evolving global conditions the change in stance instead gives greater flexibility and optionality to act in sync with the evolving outlook said rangan lets take a look at five key highlights of the rbi mpc october meeting the rbi kept the repo rates unchanged at \u003cSIX_PERCENT\u003e even though the us fed cut rates by \u003cFIVE_TEN\u003e bps in september there are strong signals that the us central bank will also cut rates in november and december however the rbi changed its policy stance to neutral while all six members of the committee voted to shift the policy stance five of the six members voted to keep the repo rate unchanged track rbi monetary policy meeting updates hereeven though the rbi did not upwardly revise its overall inflation projection for fy25 it highlighted the risk of sticky inflation and fluctuating food and fuel prices rbi kept cpi inflation estimate for fy25 unchanged at \u003cFOUR_PERCENT\u003e but cut q2fy25 cpi estimates to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e for q3fy25 it raised cpi estimates to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e however it slightly trimmed inflation estimates for the next two quarters q4fy25 and q1fy26 rbi cut q4fy25 cpi estimates to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e and q1fy26 cpi estimates to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e governor das observed that while headline inflation significantly decreased in july and august mainly due to the base effect in july core inflation increased in these two months the cpi for september is expected to increase because of unfavourable base effects and a rise in fuel prices rbi remains upbeat about the prospects of the indian economy it projected the real gdp growth rate for fy25 to be \u003cSEVEN_PERCENT\u003e while trimming the growth outlook for the second quarter and raising expectations for the last two quarters of the financial year and the first quarter of fy26 rbi cut the q2fy25 gdp growth forecast to \u003cSEVEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e the central bank raised q3fy25 gdp growth forecast to \u003cSEVEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e q4fy25 gdp growth forecast to \u003cSEVEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e and q1fy26 gdp growth forecast to \u003cSEVEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e the rbi proposed increasing the upi \u003cONE_\u003e \u003cTWO_\u003e \u003cTHREE_\u003e pay per transaction limit from \u003cFIVE_THOUSAND\u003e to \u003cONE_TEN_THOUSAND\u003e additionally the upi lite wallet limit has been raised from \u003cTWO_THOUSAND\u003e to \u003cFIVE_THOUSAND\u003e to further encourage wider adoption of upi and make it more inclusive it has been decided to i enhance the per transaction limit in upi \u003cONE_HUNDRED\u003e pay from \u003cFIVE_THOUSAND\u003e to \u003cONE_TEN_THOUSAND\u003e and ii increase the upi lite wallet limit from \u003cTWO_THOUSAND\u003e to \u003cFIVE_THOUSAND\u003e and the per transaction limit from \u003cFIVE_HUNDRED\u003e to \u003cONE_THOUSAND\u003e das announced governor das underscored the likelihood of stress buildup in a few unsecured loan segments such as loans for consumption purposes microfinance loans and credit cards he said the rbi is closely monitoring the incoming information and will take measures as may be considered necessary banks and nbfc need to carefully assess the individual exposures in these areas both in terms of size and quality their underwriting standards and post sanction monitoring have to be robust continued attention must also be given to potential risks from inoperative deposit accounts cyber security landscape mule accounts and a few other factors said das read all market related news here","timestamp":"2024-10-09T12:32:00+05:30","market_timestamp":"2024-10-09T12:32:00+05:30","off_market_hours":false}