{"url":"https://www.livemint.com/market/stock-market-news/indias-sovereign-bonds-to-enter-emerging-market-index-of-ftse-russell-by-2025-11728436957511.html","title":"India’s sovereign bonds to enter Emerging Market Index of FTSE Russell by 2025","description":"India's sovereign bonds are set for a major boost. FTSE Russell announced on Tuesday that it will add Indian bonds to its Emerging Markets Government Bond Index (EMGBI) in September 2025.","content":"FTSE Russell announced on Tuesday, October 8, that it will add India's sovereign bonds to its Emerging Markets Government Bond Index (EMGBI) in September 2025. This decision follows similar inclusions by JP Morgan and Bloomberg, potentially drawing billions of dollars into India’s bond market, Reuters reported.The London-based index provider also revealed that South Korean government bonds will be added to the FTSE World Government Bond Index (WGBI). These bonds will make up 2.22% of the index based on market value, with inclusion starting in November 2025. South Korea's addition comes after two years on FTSE’s watch list, as per the report by Reuters.Indian government bonds, which have been on FTSE's watch list for the past three years, will account for 9.35% of the EMGBI. According to FTSE, the index has a total market value of $4.7 trillion, according to the Reuters report.The inclusion is seen as a positive development for India’s bond market. \"The decision is a sentiment positive and will strengthen the demand side of India bonds structurally,\"  Madhavi Arora, chief economist at Emkay Global Financial Services, told Reuters.Indian bonds have already attracted nearly $18.5 billion in foreign inflows since JPMorgan announced in September 2023 that it would add Indian bonds to its Emerging Markets index, the report further added.FTSE had previously delayed the inclusion of Indian bonds in its index during a review in March, citing taxation and settlement issues. However, it acknowledged improvements in India’s bond market accessibility. The latest announcement follows India’s inclusion in JPMorgan’s bond index starting in June 2024 and Bloomberg’s index in January 2025, according to the Reuters report.Government bond are usually  debt instrument issued by the Central and State Governments of India. Issuance of such bonds occur when the issuing body (Central or State governments) faces a liquidity crisis and requires funds for the purpose of infrastructure development.(With Inputs from Reuters)","cleaned_content":"ftse russell announced on tuesday october \u003cEIGHT_\u003e that it will add indias sovereign bonds to its emerging markets government bond index emgbi in september \u003cTWO_THOUSAND\u003e this decision follows similar inclusions by jp morgan and bloomberg potentially drawing billions of dollars into india s bond market reuters reported the london based index provider also revealed that south korean government bonds will be added to the ftse world government bond index wgbi these bonds will make up \u003cTWO_PERCENT\u003e of the index based on market value with inclusion starting in november \u003cTWO_THOUSAND\u003e south koreas addition comes after two years on ftse s watch list as per the report by reuters indian government bonds which have been on ftses watch list for the past three years will account for \u003cNINE_PERCENT\u003e of the emgbi according to ftse the index has a total market value of \u003cFOUR_\u003e trillion according to the reuters report the inclusion is seen as a positive development for india s bond market the decision is a sentiment positive and will strengthen the demand side of india bonds structurally madhavi arora chief economist at emkay global financial services told reuters indian bonds have already attracted nearly \u003cONE_TEN\u003e billion in foreign inflows since jpmorgan announced in september \u003cTWO_THOUSAND\u003e that it would add indian bonds to its emerging markets index the report further added ftse had previously delayed the inclusion of indian bonds in its index during a review in march citing taxation and settlement issues however it acknowledged improvements in india s bond market accessibility the latest announcement follows india s inclusion in jpmorgan s bond index starting in june \u003cTWO_THOUSAND\u003e and bloomberg s index in january \u003cTWO_THOUSAND\u003e according to the reuters report government bond are usually debt instrument issued by the central and state governments of india issuance of such bonds occur when the issuing body central or state governments faces a liquidity crisis and requires funds for the purpose of infrastructure development with inputs from reuters","timestamp":"2024-10-09T08:02:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}