{"url":"https://www.livemint.com/market/stock-market-news/zomato-vs-swiggy-who-is-leading-the-fight-in-food-delivery-and-quick-commerce-motilal-oswal-decodes-11728462607266.html","title":"Zomato vs Swiggy: Who is leading the fight in food delivery and quick commerce? Motilal Oswal decodes","description":"Motilal Oswal Financial Services analysed Swiggy and Zomato's competitive landscape, noting that Zomato is the current market leader in the food delivery segment. However, Swiggy's innovative strategies could spark a shift in dynamics as both companies vie for urban consumers' wallet share.","content":"In a recent analysis, domestic brokerage house Motilal Oswal Financial Services (MOSL) compared Swiggy’s freshly filed Draft Red Herring Prospectus (DRHP) to its key competitor, Zomato, shedding light on the evolving battle between these two food delivery giants.With market leadership in both food delivery and quick commerce at stake, MOSL emphasised that Zomato currently holds the upper hand, although the competition for wallet share among urban consumers is far from over. Swiggy's stronger customer cohorts and innovation prowess suggest the battle can intensify.Zomato’s food delivery business has not only become stable but also profitable, showing a consistent rise in Gross Order Value (GOV) and EBITDA margins of 3.4 per cent. This stable performance contrasts with Swiggy, whose food delivery business has just reached breakeven, with a modest EBITDA margin of 0.8 per cent.According to MOSL, Zomato’s multi-faceted approach, especially with its acquisition of Blinkit, offers long-term potential. MOSL projected a 55 per cent revenue CAGR for Zomato over FY24-FY27, with PAT margins increasing to 4.3 per cent in FY25, 8.7 per cent in FY26, and 13.2 per cent in FY27.MOSL valued Zomato at  ₹320 per share, indicating a 15 per cent upside from current levels as it reiterated its “BUY” rating.MOSL pointed out that Zomato has successfully increased its market share in food delivery, rising from 54 per cent in FY22 to 58 per cent by the first quarter of FY25. The company's growth was driven by its robust execution, which has outpaced Swiggy's expansion despite both players witnessing significant growth in user base and restaurant partners. Zomato’s monthly transacting users (MTUs) reached 20 million, while Swiggy had 14 million MTUs.Despite this, Swiggy recorded a 6 per cent higher Gross Order Value (GOV) per MTU, signalling that Swiggy’s customer base is more mature and engaged. Swiggy also outperformed intake rates, demonstrating better monetisation of its platform. That said, MOSL expects these rates to converge as Zomato continues to dominate the market.In the quick commerce space, MOSL highlighted that Zomato's Blinkit has gained an edge over Swiggy’s Instamart, even though Instamart pioneered the segment.Blinkit boasted 639 active dark stores across 44 cities, compared to Instamart's 557 stores in 32 cities. In 1QFY25, Blinkit’s GOV was 81 per cent higher than Instamart’s, with superior take rates and profitability margins. Blinkit achieved an EBITDA margin of -0.1 per cent, significantly better than Instamart's -11.7 per cent. Despite Blinkit’s current lead, MOSL emphasised that the quick commerce market is still in its infancy, and the final winners are yet to emerge.MOSL further noted that Swiggy’s integrated app strategy gives it an edge in innovation. Instamart’s development stemmed from such synergies, and Swiggy is once again pushing the envelope with its 10-minute food delivery platform, Bolt. Zomato attempted a similar pilot but could not scale it.MOSL believes Swiggy's focus on innovation and scalability will keep it at the forefront of food delivery and quick commerce. With fast-growing initiatives in quick commerce and partnerships with major brands, Swiggy is well-positioned to drive future innovations in these spaces.MOSL’s analysis concluded that while Zomato is currently the leader in food delivery and quick commerce, Swiggy's innovative approach and strong customer cohorts make it a formidable contender. Both companies are set to shape the future of the food delivery and quick commerce sectors, and the competitive dynamics between them will continue to evolve.MOSL remains bullish on Zomato’s long-term prospects but acknowledges Swiggy's potential to innovate and disrupt the market. As the quick commerce race is still in its early stages, the competition for market dominance is far from settled.","cleaned_content":"in a recent analysis domestic brokerage house motilal oswal financial services mosl compared swiggy s freshly filed draft red herring prospectus drhp to its key competitor zomato shedding light on the evolving battle between these two food delivery giants with market leadership in both food delivery and quick commerce at stake mosl emphasised that zomato currently holds the upper hand although the competition for wallet share among urban consumers is far from over swiggys stronger customer cohorts and innovation prowess suggest the battle can intensify zomato s food delivery business has not only become stable but also profitable showing a consistent rise in gross order value gov and ebitda margins of \u003cTHREE_PERCENT\u003e this stable performance contrasts with swiggy whose food delivery business has just reached breakeven with a modest ebitda margin of \u003cZERO_PERCENT\u003e according to mosl zomato s multi faceted approach especially with its acquisition of blinkit offers long term potential mosl projected a \u003cFIVE_TEN_PERCENT\u003e revenue cagr for zomato over fy24 fy27 with pat margins increasing to \u003cFOUR_PERCENT\u003e in fy25 \u003cEIGHT_PERCENT\u003e in fy26 and \u003cONE_TEN_PERCENT\u003e in fy27 mosl valued zomato at \u003cTHREE_HUNDRED\u003e per share indicating a \u003cONE_TEN_PERCENT\u003e upside from current levels as it reiterated its buy rating mosl pointed out that zomato has successfully increased its market share in food delivery rising from \u003cFIVE_TEN_PERCENT\u003e in fy22 to \u003cFIVE_TEN_PERCENT\u003e by the first quarter of fy25 the companys growth was driven by its robust execution which has outpaced swiggys expansion despite both players witnessing significant growth in user base and restaurant partners zomato s monthly transacting users mtus reached \u003cTWO_TEN\u003e million while swiggy had \u003cONE_TEN\u003e million mtus despite this swiggy recorded a \u003cSIX_PERCENT\u003e higher gross order value gov per mtu signalling that swiggy s customer base is more mature and engaged swiggy also outperformed intake rates demonstrating better monetisation of its platform that said mosl expects these rates to converge as zomato continues to dominate the market in the quick commerce space mosl highlighted that zomatos blinkit has gained an edge over swiggy s instamart even though instamart pioneered the segment blinkit boasted \u003cSIX_HUNDRED\u003e active dark stores across \u003cFOUR_TEN\u003e cities compared to instamarts \u003cFIVE_HUNDRED\u003e stores in \u003cTHREE_TEN\u003e cities in \u003cONE_\u003e qfy25 blinkit s gov was \u003cEIGHT_TEN_PERCENT\u003e higher than instamart s with superior take rates and profitability margins blinkit achieved an ebitda margin of \u003cZERO_PERCENT\u003e significantly better than instamarts \u003cONE_TEN_PERCENT\u003e despite blinkit s current lead mosl emphasised that the quick commerce market is still in its infancy and the final winners are yet to emerge mosl further noted that swiggy s integrated app strategy gives it an edge in innovation instamart s development stemmed from such synergies and swiggy is once again pushing the envelope with its \u003cONE_TEN\u003e minute food delivery platform bolt zomato attempted a similar pilot but could not scale it mosl believes swiggys focus on innovation and scalability will keep it at the forefront of food delivery and quick commerce with fast growing initiatives in quick commerce and partnerships with major brands swiggy is well positioned to drive future innovations in these spaces mosl s analysis concluded that while zomato is currently the leader in food delivery and quick commerce swiggys innovative approach and strong customer cohorts make it a formidable contender both companies are set to shape the future of the food delivery and quick commerce sectors and the competitive dynamics between them will continue to evolve mosl remains bullish on zomato s long term prospects but acknowledges swiggys potential to innovate and disrupt the market as the quick commerce race is still in its early stages the competition for market dominance is far from settled","timestamp":"2024-10-09T14:38:00+05:30","market_timestamp":"2024-10-09T14:38:00+05:30","off_market_hours":false}