{"url":"https://www.livemint.com/market/stock-market-news/apollo-fortis-max-healthcare-others-rise-up-to-38-ytd-should-you-buy-or-sell-the-hospital-stocks-11728530582294.html","title":"Apollo, Fortis, Max Healthcare \u0026 other hospital stocks rise up to 38% YTD: Should you buy or sell them?","description":"Stock Market Today: Apollo Hospitals, Fortis Healthcare, and Max Healthcare Institute share prices have seen gains of 22-38% year to date. Should you buy or sell these hospital stocks and what are the expectations from their Q2 performance? Check here.","content":"Stock Market Today: Apollo Hospitals Enterprise, Fortis Healthcare and Max Healthcare Institute share prices have seen handsome gains of 22-38% year-to-date (YTD) and analysts remain positive on their prospects.The expansion being undertaken, the rising demand, indoor procedures, revival of foreign patients through pick up in medical tourism and capacity expansions are all key drivers of growth for these companies.HSBC Securities and Capital Markets (India) Private has retained its positive view on the growth outlook for the hospital sector on intact structural drivers: an ageing population, rising lifestyle-related disorders, increasing healthcare insurance coverage, and rising income levels. They like hospitals with room to improve occupancy, average revenue per occupied bed (ARPOB), and payor mix. The top picks of HSBC from the companies it is covering include Apollo Hospitals Enterprise for a target price of  ₹7,720, Aster DM Healthcare with a target price of  ₹450, and Krishna Institute of Medical Sciences with a target price of  ₹660.Meanwhile, for the July-September quarter, the earnings expectations remain strong for hospital companies. Delhi National Capital Region (NCR) saw heavy monsoon in 2Q with parts of Delhi under flood-like situation which analysts at Jefferies India Pvt Ltd believe led to healthy occupancy in the quarter. Jefferies expects high EBITDA growth for Apollo (up 20% YoY) and Fortis (up 19% YoY) followed by Max (up 11% YoY) while Medanta (up 4% YoY) could have another subdued quarter. Apollo Hospitals will likely be led by improving profitability in pharmacy and sustained high occupancy in hospitals. Fortis should benefit from higher occupancy and higher margins.The benefits from Delhi NCR's rising occupancy are also to benefit Max Healthcare and existing bed capacities are likely to deliver healthy EBITDA growth, said the brokerage. However, expansions that accrue benefits for longer see lower profitability initially as fixed costs remain high.Global Health, popularly known as Medanta, may see modest growth, which as per Jefferies will likely be due to a year-on-year EBITDA decline in Lucknow hospitals.","cleaned_content":"stock market today apollo hospitals enterprise fortis healthcare and max healthcare institute share prices have seen handsome gains of \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e year to date ytd and analysts remain positive on their prospects the expansion being undertaken the rising demand indoor procedures revival of foreign patients through pick up in medical tourism and capacity expansions are all key drivers of growth for these companies hsbc securities and capital markets india private has retained its positive view on the growth outlook for the hospital sector on intact structural drivers an ageing population rising lifestyle related disorders increasing healthcare insurance coverage and rising income levels they like hospitals with room to improve occupancy average revenue per occupied bed arpob and payor mix the top picks of hsbc from the companies it is covering include apollo hospitals enterprise for a target price of \u003cSEVEN_THOUSAND\u003e aster dm healthcare with a target price of \u003cFOUR_HUNDRED\u003e and krishna institute of medical sciences with a target price of \u003cSIX_HUNDRED\u003e meanwhile for the july september quarter the earnings expectations remain strong for hospital companies delhi national capital region ncr saw heavy monsoon in \u003cTWO_\u003e q with parts of delhi under flood like situation which analysts at jefferies india pvt ltd believe led to healthy occupancy in the quarter jefferies expects high ebitda growth for apollo up \u003cTWO_TEN_PERCENT\u003e yoy and fortis up \u003cONE_TEN_PERCENT\u003e yoy followed by max up \u003cONE_TEN_PERCENT\u003e yoy while medanta up \u003cFOUR_PERCENT\u003e yoy could have another subdued quarter apollo hospitals will likely be led by improving profitability in pharmacy and sustained high occupancy in hospitals fortis should benefit from higher occupancy and higher margins the benefits from delhi ncrs rising occupancy are also to benefit max healthcare and existing bed capacities are likely to deliver healthy ebitda growth said the brokerage however expansions that accrue benefits for longer see lower profitability initially as fixed costs remain high global health popularly known as medanta may see modest growth which as per jefferies will likely be due to a year on year ebitda decline in lucknow hospitals","timestamp":"2024-10-14T14:03:00+05:30","market_timestamp":"2024-10-14T14:03:00+05:30","off_market_hours":false}