{"url":"https://www.livemint.com/market/stock-market-news/angel-one-share-price-soars-over-10-5-on-robust-performance-in-q2-11728965801267.html","title":"Angel One share price surges over 10.5% on robust performance in Q2","description":"Angel One's shares surged 10.53% to  ₹3,010 after strong Q2FY25 results, with the net profit growing 44.36% QoQ. The company added 3 million clients and processed 489 million orders, showcasing significant growth in revenue and market share.","content":"Shares of Angel One, a leading retail full-service broking firm in India, saw a significant surge of 10.53% during early morning trade on Tuesday, October 15, to  ₹3,010 apiece. The stock surpassed the  ₹3,000 per share mark for the first time since mid-April. This remarkable increase followed the company’s best-ever quarterly performance for the three months ended September 2024 (Q2 FY25).The company reported a net profit of  ₹423 crore in Q2FY25, reflecting a notable 44.36% quarter-on-quarter (QoQ) increase and a 39.14% YoY improvement due to better-than-expected operational efficiency. Its total revenue from operations for Q2 FY25 witnessed a growth of 7.8% QoQ and a 44.56% YoY surge, reaching  ₹1,515 crore.ShaIts earnings before interest, tax, depreciation, and amortisation (EBITDA) improved by 51.5% to  ₹671.9 crore, while the EBITDA margin expanded by 210 basis points to 44.4% from 42.3% last year.During the quarter, Angel One added 3 million clients. As of September 2024, the company's client base had expanded to 27.5 million, marking an 11.2% QoQ increase and a 61% YoY growth.In terms of transactions, the company processed 489 million orders in 2QFY24, representing a 44.5% YoY increase. Its average daily turnover (ADTO) surged to  ₹45.4 trillion in Q2 FY25, showcasing a 3.7% QoQ and 53.2% YoY jump. Angel One also demonstrated its strength in the retail turnover market share, securing 19.3% in Q2FY25, marking a 42-basis point improvement in QoQ and a 282 bps jump on a YoY basis, as indicated in the company's exchange filing.Maintaining its position as No. 2 in Incremental NSE Active Clients, the company's share in NSE Active Clients grew to 15.4% during the quarter, marking a 79-basis point growth YoY. Furthermore, Angel One's share in the country's demat accounts at the end of the September quarter stood at 15.7%, representing a noteworthy increase of 251 basis points YoY.Between February 2023 and December 2023, the stock experienced exponential growth, yielding a remarkable return of 247%. However, this upward momentum was followed by a significant downturn that lasted until July 2024, during which the stock lost 44% of its value. In August 2024, the stock showed signs of recovery, bouncing back with a notable increase of 19.4%.While it finished September flat, it has risen by 17% in the current month. Despite this recovery, the stock remains about 23.3% below its all-time high of  ₹3,896 scaled in January 2024.","cleaned_content":"shares of angel one a leading retail full service broking firm in india saw a significant surge of \u003cONE_TEN_PERCENT\u003e during early morning trade on tuesday october \u003cONE_TEN\u003e to \u003cTHREE_THOUSAND\u003e apiece the stock surpassed the \u003cTHREE_THOUSAND\u003e per share mark for the first time since mid april this remarkable increase followed the company s best ever quarterly performance for the three months ended september \u003cTWO_THOUSAND\u003e q2 fy25 the company reported a net profit of \u003cFOUR_HUNDRED\u003e crore in q2fy25 reflecting a notable \u003cFOUR_TEN_PERCENT\u003e quarter on quarter qoq increase and a \u003cTHREE_TEN_PERCENT\u003e yoy improvement due to better than expected operational efficiency its total revenue from operations for q2 fy25 witnessed a growth of \u003cSEVEN_PERCENT\u003e qoq and a \u003cFOUR_TEN_PERCENT\u003e yoy surge reaching \u003cONE_THOUSAND\u003e crore shaits earnings before interest tax depreciation and amortisation ebitda improved by \u003cFIVE_TEN_PERCENT\u003e to \u003cSIX_HUNDRED\u003e crore while the ebitda margin expanded by \u003cTWO_HUNDRED\u003e basis points to \u003cFOUR_TEN_PERCENT\u003e from \u003cFOUR_TEN_PERCENT\u003e last year during the quarter angel one added \u003cTHREE_\u003e million clients as of september \u003cTWO_THOUSAND\u003e the companys client base had expanded to \u003cTWO_TEN\u003e million marking an \u003cONE_TEN_PERCENT\u003e qoq increase and a \u003cSIX_TEN_PERCENT\u003e yoy growth in terms of transactions the company processed \u003cFOUR_HUNDRED\u003e million orders in \u003cTWO_\u003e qfy24 representing a \u003cFOUR_TEN_PERCENT\u003e yoy increase its average daily turnover adto surged to \u003cFOUR_TEN\u003e trillion in q2 fy25 showcasing a \u003cTHREE_PERCENT\u003e qoq and \u003cFIVE_TEN_PERCENT\u003e yoy jump angel one also demonstrated its strength in the retail turnover market share securing \u003cONE_TEN_PERCENT\u003e in q2fy25 marking a \u003cFOUR_TEN\u003e basis point improvement in qoq and a \u003cTWO_HUNDRED\u003e bps jump on a yoy basis as indicated in the companys exchange filing maintaining its position as no \u003cTWO_\u003e in incremental nse active clients the companys share in nse active clients grew to \u003cONE_TEN_PERCENT\u003e during the quarter marking a \u003cSEVEN_TEN\u003e basis point growth yoy furthermore angel ones share in the countrys demat accounts at the end of the september quarter stood at \u003cONE_TEN_PERCENT\u003e representing a noteworthy increase of \u003cTWO_HUNDRED\u003e basis points yoy between february \u003cTWO_THOUSAND\u003e and december \u003cTWO_THOUSAND\u003e the stock experienced exponential growth yielding a remarkable return of \u003cTWO_HUNDRED_PERCENT\u003e however this upward momentum was followed by a significant downturn that lasted until july \u003cTWO_THOUSAND\u003e during which the stock lost \u003cFOUR_TEN_PERCENT\u003e of its value in august \u003cTWO_THOUSAND\u003e the stock showed signs of recovery bouncing back with a notable increase of \u003cONE_TEN_PERCENT\u003e while it finished september flat it has risen by \u003cONE_TEN_PERCENT\u003e in the current month despite this recovery the stock remains about \u003cTWO_TEN_PERCENT\u003e below its all time high of \u003cTHREE_THOUSAND\u003e scaled in january \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-15T10:41:00+05:30","market_timestamp":"2024-10-15T10:41:00+05:30","off_market_hours":false}