{"url":"https://www.livemint.com/market/stock-market-news/trent-stock-surges-12-in-two-days-following-launch-of-lab-grown-diamond-pome-11728473124198.html","title":"Trent stock surges 12% in two days following launch of lab-grown diamond brand Pome","description":"Trent's shares climbed 12 percent in the last two days, hitting a record high of  ₹8,318.25 on the BSE on Wednesday. This increase comes after the pilot launch of its new lab-grown diamond (LGD) brand, ‘Pome,’ in Westside stores.","content":"Shares of Trent surged by 12 per cent over the past two days, reaching a new all-time high of  ₹8,318.25 on the BSE on Wednesday. This rally follows the pilot launch of its new lab-grown diamond (LGD) brand, ‘Pome,’ in Westside stores.Pome has recently been launched in select Westside stores in Mumbai, Bengaluru, Hyderabad, and Gurgaon. This pilot initiative by Trent aims to assess the market with SKUs presented in a kiosk format. The company plans to develop an LGD jewelry brand, introduce exclusive brand outlets (EBOs), and accelerate its growth.Kotak Equities, a domestic brokerage firm, refers to Pome as the Zudio of the jewellery segment, highlighting how the brand has strategically positioned itself with a pricing strategy centered on the concept of \"diamonds for all.\"Pome has set the prices for LGD jewelry to align with Trent’s typical competitive pricing. A 1-carat solitaire engagement ring is listed at  ₹24,000-29,000. A quick estimate indicates that the implied cost of a lab-grown diamond solitaire in Pome LGD jewelry is approximately  ₹13,000-17,000 per carat.“As per this pricing framework, on an average, Pome’s pricing could be at (1) 30% discount to  ₹15-20k SKUs of natural diamond studded jewelry and (2) 80-85% discount to high value  ₹500k+ natural diamond studded jewelry,” the brokerage firm said.Calculations indicate that with current end-product prices and raw material costs, Pome achieves gross margins of approximately 45-50%. Broadly speaking, Pome's retail economics (for exclusive brand outlets) may be somewhat comparable to Caratlane, provided higher foot traffic and sales volumes offset the lower pricing.“The company’s foray into the mass-priced beauty segment with Zudio Beauty has given conviction. The BPC sales contribution was already quite material in Westside and Zudio stores. BPC business had built scale over time, as customers have become more indulgent and impulsive. Emerging categories' salience has increased to 20 per cent of standalone revenue, versus 10 per cent earlier,” the brokerage firm said in its note.Trent's shares have become multibaggers, delivering returns of 111.7 per cent over the past six months, 297 per cent over the last year, and 175 per cent so far this year.","cleaned_content":"shares of trent surged by \u003cONE_TEN_PERCENT\u003e over the past two days reaching a new all time high of \u003cEIGHT_THOUSAND\u003e on the bse on wednesday this rally follows the pilot launch of its new lab grown diamond lgd brand pome in westside stores pome has recently been launched in select westside stores in mumbai bengaluru hyderabad and gurgaon this pilot initiative by trent aims to assess the market with skus presented in a kiosk format the company plans to develop an lgd jewelry brand introduce exclusive brand outlets ebos and accelerate its growth kotak equities a domestic brokerage firm refers to pome as the zudio of the jewellery segment highlighting how the brand has strategically positioned itself with a pricing strategy centered on the concept of diamonds for all pome has set the prices for lgd jewelry to align with trent s typical competitive pricing a \u003cONE_\u003e carat solitaire engagement ring is listed at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e a quick estimate indicates that the implied cost of a lab grown diamond solitaire in pome lgd jewelry is approximately \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e per carat as per this pricing framework on an average pome s pricing could be at \u003cONE_\u003e \u003cTHREE_TEN_PERCENT\u003e discount to \u003cONE_TEN\u003e \u003cTWO_TEN\u003e k skus of natural diamond studded jewelry and \u003cTWO_\u003e \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN_PERCENT\u003e discount to high value \u003cFIVE_HUNDRED\u003e k natural diamond studded jewelry the brokerage firm said calculations indicate that with current end product prices and raw material costs pome achieves gross margins of approximately \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e broadly speaking pomes retail economics for exclusive brand outlets may be somewhat comparable to caratlane provided higher foot traffic and sales volumes offset the lower pricing the company s foray into the mass priced beauty segment with zudio beauty has given conviction the bpc sales contribution was already quite material in westside and zudio stores bpc business had built scale over time as customers have become more indulgent and impulsive emerging categories salience has increased to \u003cTWO_TEN_PERCENT\u003e of standalone revenue versus \u003cONE_TEN_PERCENT\u003e earlier the brokerage firm said in its note trents shares have become multibaggers delivering returns of \u003cONE_HUNDRED_PERCENT\u003e over the past six months \u003cTWO_HUNDRED_PERCENT\u003e over the last year and \u003cONE_HUNDRED_PERCENT\u003e so far this year","timestamp":"2024-10-09T17:32:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}