{"url":"https://www.livemint.com/market/stock-market-news/ola-electric-share-price-soars-nearly-4-as-market-share-expands-to-34-amid-festive-season-11728965660494.html","title":"Ola Electric share price soars nearly 4% as market share expands to 34% amid festive season sales","description":"Ola Electric's shares surged nearly 4% on Tuesday as the company reported a significant increase in market share in India's electric two-wheeler market.","content":"Ola Electric's share price jumped nearly 4 per cent on Tuesday, October 15, to  ₹90.72 apiece as the company reported a significant increase in its market share. The electric vehicle (EV) leader now holds a 34 per cent share in India’s electric two-wheeler (2W) market, according to a press release from the company.However, this rebound comes amid a challenging trend for the stock. On Monday, Ola Electric Mobility Ltd shares extended their fall for the third consecutive session, slipping by 3.03 per cent to settle at  ₹87.46. The stock has now dropped 44.48 per cent from its all-time high of  ₹157.53, scaled on August 20, 2024. Despite this decline, the scrip remains 15.07% above its listing price of  ₹76.Ola Electric Mobility share price was trading in the green today, up 3.13 per cent at 9:44 am on the BSE. The company enjoys a market capitalisation of  ₹39,723.93 crore.Ola Electric has recorded 15,672 new registrations this month as of October 14, 2024, according to data from the government’s Vahan portal. The growth is driven by the company’s diverse S1 portfolio of electric scooters and expanding service network. Ola Electric aims to maintain this momentum for the rest of the festive season, with an eye on further bolstering its market presence leading up to Diwali.In a statement, the company said, “Ola Electric has kickstarted the festive season on a strong note and consolidated its market leadership in the EV 2W segment.”In its pursuit to deepen EV penetration in tier-2 and tier-3 cities, Ola Electric has rolled out several initiatives. The company plans to double its service centers to 1,000 by December 2024 and aims to onboard 10,000 partners by the end of 2025 as part of its Network Partner Program.“Ola’s commitment to providing best-in-class after-sales experiences and expanding its service reach will further cement its leadership,” said a company spokesperson.Ola Electric also recently announced an ambitious EV Service Training Program aimed at training 100,000 third-party mechanics across India to become EV-ready.The company’s expansive S1 portfolio offers scooters across multiple price points, catering to different consumer needs. Its premium models, the S1 Pro and S1 Air, are priced at  ₹1,34,999 and  ₹1,07,499, while the mass-market S1 X models are priced between  ₹74,999 and  ₹1,01,999.At its annual ‘Sankalp’ event in August, Ola Electric unveiled its Roadster motorcycle series, priced between  ₹74,999 and  ₹1,99,999, further diversifying its electric vehicle offerings. These motorcycles feature cutting-edge technology, with battery capacities ranging from 2.5 kWh to 16 kWh.","cleaned_content":"ola electrics share price jumped nearly \u003cFOUR_PERCENT\u003e on tuesday october \u003cONE_TEN\u003e to \u003cNINE_TEN\u003e apiece as the company reported a significant increase in its market share the electric vehicle ev leader now holds a \u003cTHREE_TEN_PERCENT\u003e share in india s electric two wheeler \u003cTWO_\u003e w market according to a press release from the company however this rebound comes amid a challenging trend for the stock on monday ola electric mobility ltd shares extended their fall for the third consecutive session slipping by \u003cTHREE_PERCENT\u003e to settle at \u003cEIGHT_TEN\u003e the stock has now dropped \u003cFOUR_TEN_PERCENT\u003e from its all time high of \u003cONE_HUNDRED\u003e scaled on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e despite this decline the scrip remains \u003cONE_TEN_PERCENT\u003e above its listing price of \u003cSEVEN_TEN\u003e ola electric mobility share price was trading in the green today up \u003cTHREE_PERCENT\u003e at \u003cNINE_\u003e \u003cFOUR_TEN\u003e am on the bse the company enjoys a market capitalisation of \u003cTHREE_TEN_THOUSAND\u003e crore ola electric has recorded \u003cONE_TEN_THOUSAND\u003e new registrations this month as of october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e according to data from the government s vahan portal the growth is driven by the company s diverse s1 portfolio of electric scooters and expanding service network ola electric aims to maintain this momentum for the rest of the festive season with an eye on further bolstering its market presence leading up to diwali in a statement the company said ola electric has kickstarted the festive season on a strong note and consolidated its market leadership in the ev \u003cTWO_\u003e w segment in its pursuit to deepen ev penetration in tier \u003cTWO_\u003e and tier \u003cTHREE_\u003e cities ola electric has rolled out several initiatives the company plans to double its service centers to \u003cONE_THOUSAND\u003e by december \u003cTWO_THOUSAND\u003e and aims to onboard \u003cONE_TEN_THOUSAND\u003e partners by the end of \u003cTWO_THOUSAND\u003e as part of its network partner program ola s commitment to providing best in class after sales experiences and expanding its service reach will further cement its leadership said a company spokesperson ola electric also recently announced an ambitious ev service training program aimed at training \u003cONE_HUNDRED_THOUSAND\u003e third party mechanics across india to become ev ready the company s expansive s1 portfolio offers scooters across multiple price points catering to different consumer needs its premium models the s1 pro and s1 air are priced at \u003cONE_HUNDRED_THOUSAND\u003e and \u003cONE_HUNDRED_THOUSAND\u003e while the mass market s1 x models are priced between \u003cSEVEN_TEN_THOUSAND\u003e and \u003cONE_HUNDRED_THOUSAND\u003e at its annual sankalp event in august ola electric unveiled its roadster motorcycle series priced between \u003cSEVEN_TEN_THOUSAND\u003e and \u003cONE_HUNDRED_THOUSAND\u003e further diversifying its electric vehicle offerings these motorcycles feature cutting edge technology with battery capacities ranging from \u003cTWO_\u003e kwh to \u003cONE_TEN\u003e kwh","timestamp":"2024-10-15T10:02:00+05:30","market_timestamp":"2024-10-15T10:02:00+05:30","off_market_hours":false}