{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-paytm-to-precision-wires-sumeet-bagadia-recommends-five-shares-to-buy-today-11728443684602.html","title":"Breakout stocks to buy or sell: Paytm to Precision Wires — Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Foreign portfolio investors sell Indian equities, while domestic institutional investors support the market. Sumeet Bagadia recommends a stock-specific approach and lists five stocks to buy, including Paytm and Precision Wires India.","content":"Breakout stocks to buy or sell: Even though foreign portfolio investors (FPIs) continued selling Indian equities, strong support from domestic institutional investors (DIIs) underpinned the Indian stock market in the previous session on Tuesday, October 8, as the benchmarks, the Sensex and the Nifty 50 saw healthy gains of almost a per cent. The Sensex closed 0.72 per cent up at 81,634.81, while the Nifty 50 clocked a gain of 0.88 per cent to end at 25,013.15. The BSE Midcap and Smallcap indices witnessed strong gains of 1.86 per cent and 2.44 per cent, respectively.The recent strong selloff in the Indian stock market has primarily been led by the outflow of foreign investments after China announced several measures to support its economy and financial market. Due to the significantly cheaper valuation of Chinese markets, compared to the Indian market, foreign investors are rushing to buy Chinese stocks while selling Indian equities that are at premium valuation. NSE data showed that FPIs took away  ₹5,729.60 crore from the Indian markets on Tuesday, while DIIs invested  ₹7,000.68 crore. According to NSDL data, FPIs have taken out  ₹47,003 crore from the Indian financial markets in October so far.Sumeet Bagadia, Executive Director at Choice Broking, believes that even though the market mood appears to have improved, caution is likely to prevail. In the current environment, one should continue taking a stock-specific approach.\"The Indian market mood has improved as the Nifty index has ended above 25,000. However, the overall trend on Dalal Street would remain cautious until the frontline index breaches the hurdle placed at 25,400 on a decisive basis. The Nifty Bank index has also improved its bias after closing above 51,000. However, the index would become bullish after decisively breaching the 51,800 barrier. So, one is advised to maintain a stock-specific approach and look at breakout stocks for intraday trading,\" said Bagadia.Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: Paytm, Precision Wires India, India Glycols, Allied Digital Services and Nagarjuna Fertilizers and Chemicals.1. One 97 Communications (Paytm) | Buy at  ₹753 | Target price:  ₹799 | Stop loss:  ₹7222. Precision Wires India | Buy at  ₹208.20 | Target price:  ₹222 | Stop loss:  ₹2013. India Glycols | Buy at  ₹1,483.10 | Target price:  ₹1,585 | Stop loss:  ₹1,4354. Allied Digital Services | Buy at  ₹283.15 | Target price:  ₹303 | Stop loss:  ₹ 2735. Nagarjuna Fertilizers and Chemicals | Buy at  ₹11.84 | Target price:  ₹12.60 | Stop loss:  ₹11.40","cleaned_content":"breakout stocks to buy or sell even though foreign portfolio investors fpis continued selling indian equities strong support from domestic institutional investors diis underpinned the indian stock market in the previous session on tuesday october \u003cEIGHT_\u003e as the benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e saw healthy gains of almost a per cent the sensex closed \u003cZERO_PERCENT\u003e up at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e clocked a gain of \u003cZERO_PERCENT\u003e to end at \u003cTWO_TEN_THOUSAND\u003e the bse midcap and smallcap indices witnessed strong gains of \u003cONE_PERCENT\u003e and \u003cTWO_PERCENT\u003e respectively the recent strong selloff in the indian stock market has primarily been led by the outflow of foreign investments after china announced several measures to support its economy and financial market due to the significantly cheaper valuation of chinese markets compared to the indian market foreign investors are rushing to buy chinese stocks while selling indian equities that are at premium valuation nse data showed that fpis took away \u003cFIVE_THOUSAND\u003e crore from the indian markets on tuesday while diis invested \u003cSEVEN_THOUSAND\u003e crore according to nsdl data fpis have taken out \u003cFOUR_TEN_THOUSAND\u003e crore from the indian financial markets in october so far sumeet bagadia executive director at choice broking believes that even though the market mood appears to have improved caution is likely to prevail in the current environment one should continue taking a stock specific approach the indian market mood has improved as the nifty index has ended above \u003cTWO_TEN_THOUSAND\u003e however the overall trend on dalal street would remain cautious until the frontline index breaches the hurdle placed at \u003cTWO_TEN_THOUSAND\u003e on a decisive basis the nifty bank index has also improved its bias after closing above \u003cFIVE_TEN_THOUSAND\u003e however the index would become bullish after decisively breaching the \u003cFIVE_TEN_THOUSAND\u003e barrier so one is advised to maintain a stock specific approach and look at breakout stocks for intraday trading said bagadia regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares paytm precision wires india india glycols allied digital services and nagarjuna fertilizers and chemicals 1 one \u003cNINE_TEN\u003e communications paytm buy at \u003cSEVEN_HUNDRED\u003e target price \u003cSEVEN_HUNDRED\u003e stop loss \u003cSEVEN_THOUSAND\u003e precision wires india buy at \u003cTWO_HUNDRED\u003e target price \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_THOUSAND\u003e india glycols buy at \u003cONE_THOUSAND\u003e target price \u003cONE_THOUSAND\u003e stop loss \u003cONE_TEN_THOUSAND\u003e allied digital services buy at \u003cTWO_HUNDRED\u003e target price \u003cTHREE_HUNDRED\u003e stop loss \u003cTWO_THOUSAND\u003e nagarjuna fertilizers and chemicals buy at \u003cONE_TEN\u003e target price \u003cONE_TEN\u003e stop loss \u003cONE_TEN\u003e","timestamp":"2024-10-09T08:54:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}