{"url":"https://www.livemint.com/market/stock-market-news/garuda-construction-and-engineering-shares-make-decent-debut-list-at-rs-105-up-9-5-from-ipo-price-11728965584032.html","title":"Garuda Construction and Engineering shares make decent debut, list at  ₹105, up 9.5% from IPO price","description":"Shares of Garuda Construction and Engineering made a robust debut on the bourses today. It listed at  ₹105 on NSE, a premium of 9.5 percent from its IPO price of  ₹95. Meanwhile, on BSE, it listed at  ₹103.20, up 8.63 percent from issue price.","content":"Garuda Construction and Engineering IPO listing: Shares of Garuda Construction and Engineering made a robust debut on the bourses today. It listed at  ₹105 on NSE, a premium of 9.5 percent from its IPO price of  ₹95. Meanwhile, on BSE, it listed at  ₹103.20, up 8.63 percent from issue price.The initial public offering (IPO), valued at  ₹264.10 crore, was open for subscription from October 8, 2024, to October 10, 2024, with a price set in the range of  ₹90-95 per share.During the 3 days of bidding the IPO closed with overwhelming demand, with the issue subscribed 7.55 times overall. The IPO received bids for 15.03 crore shares against the 1.99 crore shares on offer. The retail investor segment saw a subscription of 10.81 times, while the NII category was booked 9.03 times. The QIB quota was bid 1.24 times.The Garuda Construction and Engineering IPO consists a combination of fresh issue of 1.83 crore shares aggregating to  ₹173.85 crore and offer for sale of 0.95 crore shares aggregating to  ₹90.25 crore. Retail investors could apply with a minimum lot size of 157 shares, requiring a minimum investment of  ₹14,915.The company plans to use the funds raised to meet its working capital requirements, cover general corporate expenses, and support potential unidentified inorganic acquisitions.Corpwis Advisors Private Limited is the book running lead manager of the Garuda Construction and Engineering IPO, while Link Intime India Private Ltd is the registrar for the issue.Garuda Construction and Engineering Limited, established in 2010, is a prominent player in the construction industry. The company offers a wide range of construction services, covering residential, commercial, infrastructure, and industrial projects. It also provides additional services, including operation and maintenance (O\u0026M), mechanical, electrical, and plumbing (MEP) services, along with finishing works as part of its construction solutions. However, between the financial years ending March 31, 2023, and March 31, 2024, Garuda experienced a revenue decline of 4 percent, while its profit after tax (PAT) dropped by 11 percent.","cleaned_content":"garuda construction and engineering ipo listing shares of garuda construction and engineering made a robust debut on the bourses today it listed at \u003cONE_HUNDRED\u003e on nse a premium of \u003cNINE_PERCENT\u003e from its ipo price of \u003cNINE_TEN\u003e meanwhile on bse it listed at \u003cONE_HUNDRED\u003e up \u003cEIGHT_PERCENT\u003e from issue price the initial public offering ipo valued at \u003cTWO_HUNDRED\u003e crore was open for subscription from october \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e to october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with a price set in the range of \u003cNINE_TEN\u003e \u003cNINE_TEN\u003e per share during the \u003cTHREE_\u003e days of bidding the ipo closed with overwhelming demand with the issue subscribed \u003cSEVEN_\u003e times overall the ipo received bids for \u003cONE_TEN\u003e crore shares against the \u003cONE_\u003e crore shares on offer the retail investor segment saw a subscription of \u003cONE_TEN\u003e times while the nii category was booked \u003cNINE_\u003e times the qib quota was bid \u003cONE_\u003e times the garuda construction and engineering ipo consists a combination of fresh issue of \u003cONE_\u003e crore shares aggregating to \u003cONE_HUNDRED\u003e crore and offer for sale of \u003cZERO_\u003e crore shares aggregating to \u003cNINE_TEN\u003e crore retail investors could apply with a minimum lot size of \u003cONE_HUNDRED\u003e shares requiring a minimum investment of \u003cONE_TEN_THOUSAND\u003e the company plans to use the funds raised to meet its working capital requirements cover general corporate expenses and support potential unidentified inorganic acquisitions corpwis advisors private limited is the book running lead manager of the garuda construction and engineering ipo while link intime india private ltd is the registrar for the issue garuda construction and engineering limited established in \u003cTWO_THOUSAND\u003e is a prominent player in the construction industry the company offers a wide range of construction services covering residential commercial infrastructure and industrial projects it also provides additional services including operation and maintenance o m mechanical electrical and plumbing mep services along with finishing works as part of its construction solutions however between the financial years ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e garuda experienced a revenue decline of \u003cFOUR_PERCENT\u003e while its profit after tax pat dropped by \u003cONE_TEN_PERCENT\u003e","timestamp":"2024-10-15T10:00:00+05:30","market_timestamp":"2024-10-15T10:00:00+05:30","off_market_hours":false}