{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-hdfc-bank-bank-of-baroda-reliance-power-bse-bajaj-finance-and-more-11727978446722.html","title":"Stocks to Watch: HDFC Bank, Bank of Baroda, Reliance Power, BSE, Bajaj Finance, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Bajaj Finance: Bajaj Finance saw impressive growth in its customer franchise, which expanded to 92.09 million as of the September 2024 quarter, compared to 76.56 million in the same period last year. The company's Assets Under Management (AUM) increased by 29% to  ₹3,73,900 crore in Q2 FY25, while new loans booked grew by 14% to 9.69 million. The deposits book rose by 21% to  ₹66,100 crore, and the net liquidity surplus stood at  ₹20,100 crore as of September 2024.HDFC Bank: BNP Paribas Financial Markets divested 43.75 lakh equity shares of HDFC Bank at an average price of  ₹1,726.2 per share, totaling  ₹755.3 crore. Morgan Stanley Asia (Singapore) Pte and Citigroup Global Markets Mauritius were the key buyers, with Morgan Stanley acquiring 17.5 lakh shares and Citigroup purchasing 26.25 lakh shares, both at the same price.Reliance Power: Reliance Power’s board approved raising up to $500 million ( ₹4,200 crore) through unsecured, 10-year Foreign Currency Convertible Bonds (FCCBs) with an annual interest rate of 5%. The FCCBs will be issued to affiliates of Värde Investment Partners, LP. Additionally, the board gave the green light for an Employee Stock Option Scheme (ESOS) for eligible employees.Bank of Baroda: For the quarter ended September 2024, Bank of Baroda posted a global business of  ₹25.06 lakh crore, a 10.23% year-on-year (YoY) growth. Global deposits increased by 9.11% YoY to  ₹13.63 lakh crore, while advances surged by 11.60% to  ₹11.43 lakh crore. On the domestic front, deposits grew by 7.14% YoY to  ₹11.50 lakh crore, and advances increased by 12.51% to  ₹9.39 lakh crore.M\u0026M Financial Services: In Q2 FY25, M\u0026M Financial Services reported total disbursements of  ₹13,160 crore, marking a slight 1% YoY decline. Collection efficiency remained steady at 96%. Stage-3 assets dropped to 3.8% as of September 2024 from 4.3% a year ago, while Stage-2 assets rose to 6.4% from 5.7%. The company maintained a solid liquidity chest exceeding  ₹8,500 crore.BSE: The Bombay Stock Exchange (BSE) will discontinue weekly index derivatives contracts on Sensex 50 and Bankex starting November 14 and November 18, respectively. Existing unexpired contracts will remain active until their expiry, but no new weekly contracts will be issued after these dates.JTL Industries: JTL Industries, a steel pipes manufacturer, has approved the subdivision of its 19.65 crore equity shares of  ₹2 each into 39.30 crore equity shares of  ₹1 each. The record date for the split will be announced to the stock exchanges later.Refex Industries: Refex Industries has announced plans to raise up to  ₹927.81 crore through a preferential issue of equity shares and convertible warrants. The raised funds will be allocated to investments in subsidiary companies, capital expenditures, working capital needs, loan repayments, and general corporate purposes.Premier Polyfilm: Premier Polyfilm, a manufacturer of artificial leather, is set to hold a meeting on October 14, 2024, to finalize the record date for the subdivision of its equity shares. The company will also review its standalone unaudited financial results for the quarter and half-year ending September 30, 2024.Biocon: Biocon's subsidiary, Biocon Biologics, successfully refinanced $1.1 billion in long-term debt through US dollar bonds and a new syndicated facility. This includes $800 million in senior secured notes due in 2029 at a 6.67% coupon rate. CFO Kedar Upadhye highlighted that the refinancing strengthens the company’s liquidity and defers a $250 million repayment to five years, providing flexibility in financial operations.","cleaned_content":"bajaj finance bajaj finance saw impressive growth in its customer franchise which expanded to \u003cNINE_TEN\u003e million as of the september \u003cTWO_THOUSAND\u003e quarter compared to \u003cSEVEN_TEN\u003e million in the same period last year the companys assets under management aum increased by \u003cTWO_TEN_PERCENT\u003e to \u003cTHREE_HUNDRED_THOUSAND\u003e crore in q2 fy25 while new loans booked grew by \u003cONE_TEN_PERCENT\u003e to \u003cNINE_\u003e million the deposits book rose by \u003cTWO_TEN_PERCENT\u003e to \u003cSIX_TEN_THOUSAND\u003e crore and the net liquidity surplus stood at \u003cTWO_TEN_THOUSAND\u003e crore as of september \u003cTWO_THOUSAND\u003e hdfc bank bnp paribas financial markets divested \u003cFOUR_TEN\u003e lakh equity shares of hdfc bank at an average price of \u003cONE_THOUSAND\u003e per share totaling \u003cSEVEN_HUNDRED\u003e crore morgan stanley asia singapore pte and citigroup global markets mauritius were the key buyers with morgan stanley acquiring \u003cONE_TEN\u003e lakh shares and citigroup purchasing \u003cTWO_TEN\u003e lakh shares both at the same price reliance power reliance power s board approved raising up to \u003cFIVE_HUNDRED\u003e million \u003cFOUR_THOUSAND\u003e crore through unsecured \u003cONE_TEN\u003e year foreign currency convertible bonds fccbs with an annual interest rate of \u003cFIVE_PERCENT\u003e the fccbs will be issued to affiliates of v rde investment partners lp additionally the board gave the green light for an employee stock option scheme esos for eligible employees bank of baroda for the quarter ended september \u003cTWO_THOUSAND\u003e bank of baroda posted a global business of \u003cTWO_TEN\u003e lakh crore a \u003cONE_TEN_PERCENT\u003e year on year yoy growth global deposits increased by \u003cNINE_PERCENT\u003e yoy to \u003cONE_TEN\u003e lakh crore while advances surged by \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN\u003e lakh crore on the domestic front deposits grew by \u003cSEVEN_PERCENT\u003e yoy to \u003cONE_TEN\u003e lakh crore and advances increased by \u003cONE_TEN_PERCENT\u003e to \u003cNINE_\u003e lakh crore m m financial services in q2 fy25 m m financial services reported total disbursements of \u003cONE_TEN_THOUSAND\u003e crore marking a slight \u003cONE_PERCENT\u003e yoy decline collection efficiency remained steady at \u003cNINE_TEN_PERCENT\u003e stage \u003cTHREE_\u003e assets dropped to \u003cTHREE_PERCENT\u003e as of september \u003cTWO_THOUSAND\u003e from \u003cFOUR_PERCENT\u003e a year ago while stage \u003cTWO_\u003e assets rose to \u003cSIX_PERCENT\u003e from \u003cFIVE_PERCENT\u003e the company maintained a solid liquidity chest exceeding \u003cEIGHT_THOUSAND\u003e crore bse the bombay stock exchange bse will discontinue weekly index derivatives contracts on sensex \u003cFIVE_TEN\u003e and bankex starting november \u003cONE_TEN\u003e and november \u003cONE_TEN\u003e respectively existing unexpired contracts will remain active until their expiry but no new weekly contracts will be issued after these dates jtl industries jtl industries a steel pipes manufacturer has approved the subdivision of its \u003cONE_TEN\u003e crore equity shares of \u003cTWO_\u003e each into \u003cTHREE_TEN\u003e crore equity shares of \u003cONE_\u003e each the record date for the split will be announced to the stock exchanges later refex industries refex industries has announced plans to raise up to \u003cNINE_HUNDRED\u003e crore through a preferential issue of equity shares and convertible warrants the raised funds will be allocated to investments in subsidiary companies capital expenditures working capital needs loan repayments and general corporate purposes premier polyfilm premier polyfilm a manufacturer of artificial leather is set to hold a meeting on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to finalize the record date for the subdivision of its equity shares the company will also review its standalone unaudited financial results for the quarter and half year ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e biocon biocons subsidiary biocon biologics successfully refinanced \u003cONE_\u003e billion in long term debt through us dollar bonds and a new syndicated facility this includes \u003cEIGHT_HUNDRED\u003e million in senior secured notes due in \u003cTWO_THOUSAND\u003e at a \u003cSIX_PERCENT\u003e coupon rate cfo kedar upadhye highlighted that the refinancing strengthens the company s liquidity and defers a \u003cTWO_HUNDRED\u003e million repayment to five years providing flexibility in financial operations","timestamp":"2024-10-04T08:25:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}