{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-rajesh-palviya-of-axis-securities-suggests-these-three-stocks-to-buy-hold-and-accumulate-today-11728013690187.html","title":"Shares to buy or sell: Rajesh Palviya of Axis Securities suggests these three stocks to buy, hold and accumulate today","description":"Shares to buy or sell: Rajesh Palviya has recommended to buy, hold, and accumulate Ajanta Pharma Ltd, Tata Chemicals Ltd, and JSW Steel Ltd.","content":"Stock Market News: On Friday, the Nifty 50 and Sensex, the domestic benchmark indices, started the day with a decline, as most sectors experienced a selloff, causing investors to be wary due to the escalating conflict in the Middle East and increasing foreign outflows.The Sensex was flat at 82,522.54 at 9:55 IST, while the Nifty 50 index was steady at 25,241.40 points.The dramatic 2.1% decline in the Nifty 50 yesterday, according to Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, was more likely caused by heavy selling by FIIsthan by growing concerns about tensions in the Middle East. The previous three days have witnessed massive FII selling of  ₹30,614 crores in the cash market.The Q2 results will begin to be released next week, and the market will react accordingly. Leading banks are expected to experience a recovery.On September 27th, 2024, the benchmark index reached an all-time high at 26,277 levels, but then experienced a sharp price correction, dropping by over 1000 points. The current price action has led to a violation of the up-sloping trendline from the past couple of weeks at 25,400 levels on a closing basis, indicating a short-term trend reversal. Additionally, the index has also closed below the 20-day SMA (25508), confirming the short-term trend reversal.In the short term, the outlook remains bearish with an expected downside of 24,800-24,500 levels. Furthermore, the \"Bearish Gap\" formed on October 3rd, 2024 at 25,739-25,639 will act as a resistance or supply zone for any potential relief rally.The stock is in a strong uptrend across all time frames, forming a series of higher tops and bottoms. It is well positioned above its 20, 50, 100, and 200-day simple moving averages (SMA), and these averages are also rising along with the price, confirming the bullish trend. The daily, weekly, and monthly RSI indicators are in positive terrain, indicating increasing strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of 3,400-3,500 with downside support zone of 3,150-3,085 levels.The stock has experienced a significant price gain over the past couple of weeks, confirming a \"Triangular\" breakout at the 1100 level on a closing basis, which indicates a trend reversal. This breakout was accompanied by significant trading volumes, signaling increased participation in the rally. The stock is currently trading well above its 20, 50, 100, and 200-day SMA, and these averages are also rising along with the price, reaffirming the bullish trend. Both the daily and weekly Bollinger Bands indicate a buy signal, showing increased momentum. Additionally, the daily, weekly, and monthly RSI indicators are in positive terrain, justifying rising strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of  ₹1,200-1,320 with downside support zone of  ₹1,085-1,040 levels.The stock is showing a strong uptrend across all time frames, forming a series of higher tops and bottoms. It has reached an all-time high at 1060 levels, indicating bullish sentiments. The stock is comfortably above its 20, 50, 100, and 200-day SMA, which are also rising along with the price, confirming the bullish trend. The daily, weekly, and monthly Bollinger Bands are signaling a buy, showing increased momentum. Additionally, the daily, weekly, and monthly RSI are in positive terrain, supporting the strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of  ₹1,100-1,150 with downside support zone of  ₹1,000-970 levels.","cleaned_content":"stock market news on friday the nifty \u003cFIVE_TEN\u003e and sensex the domestic benchmark indices started the day with a decline as most sectors experienced a selloff causing investors to be wary due to the escalating conflict in the middle east and increasing foreign outflows the sensex was flat at \u003cEIGHT_TEN_THOUSAND\u003e at \u003cNINE_\u003e \u003cFIVE_TEN\u003e ist while the nifty \u003cFIVE_TEN\u003e index was steady at \u003cTWO_TEN_THOUSAND\u003e points the dramatic \u003cTWO_PERCENT\u003e decline in the nifty \u003cFIVE_TEN\u003e yesterday according to dr v k vijayakumar chief investment strategist at geojit financial services was more likely caused by heavy selling by fiisthan by growing concerns about tensions in the middle east the previous three days have witnessed massive fii selling of \u003cTHREE_TEN_THOUSAND\u003e crores in the cash market the q2 results will begin to be released next week and the market will react accordingly leading banks are expected to experience a recovery on september \u003cTWO_TEN\u003e th \u003cTWO_THOUSAND\u003e the benchmark index reached an all time high at \u003cTWO_TEN_THOUSAND\u003e levels but then experienced a sharp price correction dropping by over \u003cONE_THOUSAND\u003e points the current price action has led to a violation of the up sloping trendline from the past couple of weeks at \u003cTWO_TEN_THOUSAND\u003e levels on a closing basis indicating a short term trend reversal additionally the index has also closed below the \u003cTWO_TEN\u003e day sma \u003cTWO_TEN_THOUSAND\u003e confirming the short term trend reversal in the short term the outlook remains bearish with an expected downside of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels furthermore the bearish gap formed on october \u003cTHREE_\u003e rd \u003cTWO_THOUSAND\u003e at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e will act as a resistance or supply zone for any potential relief rally the stock is in a strong uptrend across all time frames forming a series of higher tops and bottoms it is well positioned above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day simple moving averages sma and these averages are also rising along with the price confirming the bullish trend the daily weekly and monthly rsi indicators are in positive terrain indicating increasing strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e with downside support zone of \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e levels the stock has experienced a significant price gain over the past couple of weeks confirming a triangular breakout at the \u003cONE_THOUSAND\u003e level on a closing basis which indicates a trend reversal this breakout was accompanied by significant trading volumes signaling increased participation in the rally the stock is currently trading well above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma and these averages are also rising along with the price reaffirming the bullish trend both the daily and weekly bollinger bands indicate a buy signal showing increased momentum additionally the daily weekly and monthly rsi indicators are in positive terrain justifying rising strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e with downside support zone of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels the stock is showing a strong uptrend across all time frames forming a series of higher tops and bottoms it has reached an all time high at \u003cONE_THOUSAND\u003e levels indicating bullish sentiments the stock is comfortably above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma which are also rising along with the price confirming the bullish trend the daily weekly and monthly bollinger bands are signaling a buy showing increased momentum additionally the daily weekly and monthly rsi are in positive terrain supporting the strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e with downside support zone of \u003cONE_THOUSAND\u003e \u003cNINE_HUNDRED\u003e levels","timestamp":"2024-10-04T10:00:00+05:30","market_timestamp":"2024-10-04T10:00:00+05:30","off_market_hours":false}