{"url":"https://www.livemint.com/market/stock-market-news/israeliran-war-experts-recommend-these-five-oil-stocks-to-buy-on-monday-11728101148415.html","title":"Israel-Iran war: Experts recommend these five oil stocks to buy on Monday","description":"Israel-Iran war: Experts have recommended five stocks to buy on Monday — Gandhar Oil Refinery, Oil India Ltd, Petronet LNG, BPCL, and ONGC","content":"Israel-Iran war: Amid escalating tension in the Middle East due to the Israel-Iran war, oil stocks in India came under selling pressure on the weekend sessions. Rising crude oil prices are also a reason for the oil stock feeling the sell-off heat. The low trading level of the Indian National Rupee (INR) is also diminishing the capacity of Indian oil-producing companies to purchase power from global merchandise. So, stock market experts predict more dips in the oil stocks listed on Dalal Street. However, they also said that falling oil stocks may showcase fast recovery once there is ease in the Middle East tension and advised medium to long-term investors to buy oil stocks in the current fall.How Iran-Israel war is weighing on the Indian oil stocks, VLA Ambala, a SEBI-registered Research Analyst and Co-Founder of Stock Market Today, said, \"The energy sector's momentum has weakened significantly and is expected to correct further after a notable decline over the past week. On the other hand, crude oil prices surged, with CRUDEOIL OCT FUT rising by 13%. This volatility is triggered by escalating tensions in the Middle East, especially the conflict between Israel and Iran, which threatens the Strait of Hormuz. Further escalation could inflate prices, impacting India's fiscal deficit and aggravating economic challenges. Additionally, the low trading level of the Rupee is diminishing our purchasing power, and the market's RSI reading above 81 suggests further corrections. However, from an investor's perspective, the ongoing Israel-Iran conflict may create opportunities in the sector, especially in these stocks.\"Regarding oil stocks to buy on Monday, VLA Ambala recommended buying these five shares: Gandhar Oil Refinery, Oil India Ltd, Petronet LNG, BPCL, and ONGC.1] Gandhar Oil Refinery: \"Its current movement suggests it is due for a breakout. GANDHAR's current PE of 16.04 is lower than the sectoral PE of 18.32, suggesting undervaluation. While it's currently trading at  ₹216, investors can explore the buying range of  ₹210 to  ₹215 for a target price of  ₹228,  ₹235, and  ₹250. They may hold it for 1–8 weeks while chasing a stop loss of  ₹200,\" said VLa Ambala.2] Oil India Limited: Speaking on OIL shares, Sugandha Sachdeva, Founder of SS WealthStreet, said, \"Shares of Oil India have gained around 135% year to date even as they witnessed a sharp correction from their peak of Rs.767.90 in August, driven by a sharp decline in crude oil prices during Q3 CY24, leading to a pullback in this upstream company's stock. However, the stock is now showing signs of stabilization, with renewed upward momentum following a surge in crude oil prices due to escalating geopolitical tensions in the Middle East.\"She said crude prices have surged by around 10% after the Israel-Iran war outbreak, marking the biggest weekly gain in nearly two years. Markets remain on edge, anticipating widening conflict in the Middle East, which could disrupt global oil supplies given that the region contributes almost a third of the world's oil production. As oil prices rise, Oil India, a state-owned oil and gas explorer, can benefit from improved margins, which could support a rebound in its stock price.\"Investors may consider accumulating Oil India shares, keeping an eye on the support level of Rs.510 mark on a closing basis. The stock looks poised to test higher targets of around  ₹665 to  ₹680 from a medium-term perspective,\" Sugandha concluded.3] Petronet LNG: \"The stock's current momentum appears lucrative for investments. Those interested can enter positions within the buying range of  ₹340 to  ₹350 for a price target of  ₹370 to  ₹430. However, the stock's PE ratio of 13.11 is slightly higher than the sectoral PE of 12.38. So, I recommend holding it for 1-10 weeks and setting a stop loss at  ₹310,\" VLA Ambala said.4] BPCL: \"Bharat Petroleum Corporation share price is currently trading at  ₹340, but its momentum suggests a possibility of further correction. Those willing to tap its potential can consider a buying range between  ₹310 and  ₹290 for a price target of Rs. 365-450. Investors may hold their units for 2–8 months but set a stop-loss order at  ₹265 to manage risks,\" added Ambala.5] ONGC: \"The stock seems promising for the midterm, especially after an anticipated correction of 10-15%. Its PE of 8.33 against the sectoral PE 17.11 suggests an attractive valuation. Investors can explore the buying range of  ₹276 and  ₹255 for a target price of  ₹310 to  ₹370. They may hold it for 1-6 months after setting a stop-loss order at  ₹240,\" VLA Ambala concluded.","cleaned_content":"israel iran war amid escalating tension in the middle east due to the israel iran war oil stocks in india came under selling pressure on the weekend sessions rising crude oil prices are also a reason for the oil stock feeling the sell off heat the low trading level of the indian national rupee inr is also diminishing the capacity of indian oil producing companies to purchase power from global merchandise so stock market experts predict more dips in the oil stocks listed on dalal street however they also said that falling oil stocks may showcase fast recovery once there is ease in the middle east tension and advised medium to long term investors to buy oil stocks in the current fall how iran israel war is weighing on the indian oil stocks vla ambala a sebi registered research analyst and co founder of stock market today said the energy sectors momentum has weakened significantly and is expected to correct further after a notable decline over the past week on the other hand crude oil prices surged with crudeoil oct fut rising by \u003cONE_TEN_PERCENT\u003e this volatility is triggered by escalating tensions in the middle east especially the conflict between israel and iran which threatens the strait of hormuz further escalation could inflate prices impacting indias fiscal deficit and aggravating economic challenges additionally the low trading level of the rupee is diminishing our purchasing power and the markets rsi reading above \u003cEIGHT_TEN\u003e suggests further corrections however from an investors perspective the ongoing israel iran conflict may create opportunities in the sector especially in these stocks regarding oil stocks to buy on monday vla ambala recommended buying these five shares gandhar oil refinery oil india ltd petronet lng bpcl and ongc 1 gandhar oil refinery its current movement suggests it is due for a breakout gandhars current pe of \u003cONE_TEN\u003e is lower than the sectoral pe of \u003cONE_TEN\u003e suggesting undervaluation while its currently trading at \u003cTWO_HUNDRED\u003e investors can explore the buying range of \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e for a target price of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e they may hold it for \u003cONE_\u003e \u003cEIGHT_\u003e weeks while chasing a stop loss of \u003cTWO_HUNDRED\u003e said vla ambala 2 oil india limited speaking on oil shares sugandha sachdeva founder of ss wealthstreet said shares of oil india have gained around \u003cONE_HUNDRED_PERCENT\u003e year to date even as they witnessed a sharp correction from their peak of rs 767 90 in august driven by a sharp decline in crude oil prices during q3 cy24 leading to a pullback in this upstream companys stock however the stock is now showing signs of stabilization with renewed upward momentum following a surge in crude oil prices due to escalating geopolitical tensions in the middle east she said crude prices have surged by around \u003cONE_TEN_PERCENT\u003e after the israel iran war outbreak marking the biggest weekly gain in nearly two years markets remain on edge anticipating widening conflict in the middle east which could disrupt global oil supplies given that the region contributes almost a third of the worlds oil production as oil prices rise oil india a state owned oil and gas explorer can benefit from improved margins which could support a rebound in its stock price investors may consider accumulating oil india shares keeping an eye on the support level of rs 510 mark on a closing basis the stock looks poised to test higher targets of around \u003cSIX_HUNDRED\u003e to \u003cSIX_HUNDRED\u003e from a medium term perspective sugandha concluded 3 petronet lng the stocks current momentum appears lucrative for investments those interested can enter positions within the buying range of \u003cTHREE_HUNDRED\u003e to \u003cTHREE_HUNDRED\u003e for a price target of \u003cTHREE_HUNDRED\u003e to \u003cFOUR_HUNDRED\u003e however the stocks pe ratio of \u003cONE_TEN\u003e is slightly higher than the sectoral pe of \u003cONE_TEN\u003e so i recommend holding it for \u003cONE_\u003e \u003cONE_TEN\u003e weeks and setting a stop loss at \u003cTHREE_HUNDRED\u003e vla ambala said 4 bpcl bharat petroleum corporation share price is currently trading at \u003cTHREE_HUNDRED\u003e but its momentum suggests a possibility of further correction those willing to tap its potential can consider a buying range between \u003cTHREE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e for a price target of rs \u003cTHREE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e investors may hold their units for \u003cTWO_\u003e \u003cEIGHT_\u003e months but set a stop loss order at \u003cTWO_HUNDRED\u003e to manage risks added ambala 5 ongc the stock seems promising for the midterm especially after an anticipated correction of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e its pe of \u003cEIGHT_\u003e against the sectoral pe \u003cONE_TEN\u003e suggests an attractive valuation investors can explore the buying range of \u003cTWO_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e for a target price of \u003cTHREE_HUNDRED\u003e to \u003cTHREE_HUNDRED\u003e they may hold it for \u003cONE_\u003e \u003cSIX_\u003e months after setting a stop loss order at \u003cTWO_HUNDRED\u003e vla ambala concluded","timestamp":"2024-10-07T06:27:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}