{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-oct-9-11728404280635.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today — Oct 9","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today – M\u0026M, MCX, and Glenmark.","content":"Shares to buy or sell: The Nifty index ended the trading session at 25,013.15, marking a 0.88% rise. During the day, it peaked at 25,044.0 and a low of 24,756.8. Meanwhile, the Sensex fluctuated between 81,763.28 and 80,813.07, closing at 81,050.0, up 0.72% or 584.81 points from its opening value.“Nifty Index opened positive and recovered right from its opening low of 24750 zones. It crossed 25000 marks and closed above the same with gains of around 220 points. It formed a bullish candle and an inside Bar on the daily frame but still made lower highs from the last six sessions. Recovery can be seen from lower levels, but follow-up is required to sustain this pullback move. Now till it holds below 25150 zones, weakness could be seen towards 24850 then 24750 zones whereas hurdles are placed at 25150 then 25350 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Maximum Call OI is at 26000 then 27000 strike while Maximum Put OI is at 24000 then 25000 strike. Call writing is seen at 25000 then 25200 strike while Put writing is seen at 25000 then 24000 strike. Option data suggests a broader trading range in between 24500 to 25500 zones while an immediate range between 24700 to 25300 levels.On the Bank Nifty outlook, Taparia further added, “Bank Nifty Index opened on a positive note and managed to hold its opening gains in the initial hour of the session. Later it remained consolidative with a positive bias near 51000 zones and ended with gains of around 540 points. However it formed an inside bar on daily scale and is still forming lower highs from the last six sessions as momentum is missing at higher zones. Now till it holds below 51250 zones weakness could be seen towards 50500 then 50250 levels while on the upside hurdle is seen at 51500 then 51750 zones.”Stock has retested breakout on daily chart and inched higher. It has negated lower highs-lower lows after four trading sessions and supports are gradually shifting higher. Momentum indicator RSI is on the verge of giving bullish cross over which may support the ongoing up move.Stock is in overall uptrend and holding gains at higher zones. It has given range breakout on daily chart and gave highest daily close ever. The MACD indicator is on the verge of giving bullish crossover which confirms the up move.Stock has given an inside bar breakout on daily scale and formed a strong bullish candle. Buying is visible across Pharma stocks which may support the bullish momentum. The ADX line is headed up which confirms the strength.","cleaned_content":"shares to buy or sell the nifty index ended the trading session at \u003cTWO_TEN_THOUSAND\u003e marking a \u003cZERO_PERCENT\u003e rise during the day it peaked at \u003cTWO_TEN_THOUSAND\u003e and a low of \u003cTWO_TEN_THOUSAND\u003e meanwhile the sensex fluctuated between \u003cEIGHT_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e closing at \u003cEIGHT_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e or \u003cFIVE_HUNDRED\u003e points from its opening value nifty index opened positive and recovered right from its opening low of \u003cTWO_TEN_THOUSAND\u003e zones it crossed \u003cTWO_TEN_THOUSAND\u003e marks and closed above the same with gains of around \u003cTWO_HUNDRED\u003e points it formed a bullish candle and an inside bar on the daily frame but still made lower highs from the last six sessions recovery can be seen from lower levels but follow up is required to sustain this pullback move now till it holds below \u003cTWO_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas hurdles are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels on the bank nifty outlook taparia further added bank nifty index opened on a positive note and managed to hold its opening gains in the initial hour of the session later it remained consolidative with a positive bias near \u003cFIVE_TEN_THOUSAND\u003e zones and ended with gains of around \u003cFIVE_HUNDRED\u003e points however it formed an inside bar on daily scale and is still forming lower highs from the last six sessions as momentum is missing at higher zones now till it holds below \u003cFIVE_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels while on the upside hurdle is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones stock has retested breakout on daily chart and inched higher it has negated lower highs lower lows after four trading sessions and supports are gradually shifting higher momentum indicator rsi is on the verge of giving bullish cross over which may support the ongoing up move stock is in overall uptrend and holding gains at higher zones it has given range breakout on daily chart and gave highest daily close ever the macd indicator is on the verge of giving bullish crossover which confirms the up move stock has given an inside bar breakout on daily scale and formed a strong bullish candle buying is visible across pharma stocks which may support the bullish momentum the adx line is headed up which confirms the strength","timestamp":"2024-10-09T07:06:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}