{"url":"https://www.livemint.com/market/stock-market-news/exxaro-tiles-share-price-jumps-after-announcement-of-1-10-stock-split-11728966792089.html","title":"Exxaro Tiles share price jumps after announcement of 1:10 stock split","description":"Stock split 2024: Exxaro Tiles' shares surged on Tuesday following the company's announcement of a stock split in the ratio of 1:10.","content":"Stock Split 2024: Exxaro Tiles share price jumped on Tuesday, October 15, following the company's announcement of a stock split. The tile manufacturer revealed plans to divide each existing share into 10 new shares, marking its first-ever stock split.The company's board approved this move on Monday, October 14, to boost stock liquidity and attract more small investors. However, the said split still requires shareholder approval.\"The board of directors approved the division of the shares to enhance the liquidity of the shares in the stock market and to encourage wider participation of small investors,\" Exxaro Tiles stated in a filing to the stock exchange.Exxaro Tiles share price was trading in the green, up 1.13 per cent at  ₹94.68 on October 15 at 10:02 am on the BSE. The stock rose 3.5 per cent in intra-day deals today to the day's high of  ₹96.99. Despite this uptick, Exxaro Tiles stock has dropped 32.88% over the past year and 19.92% since the start of 2024.On Monday, Exxaro Tiles shares rose by 4.28% during trading to the day's of  ₹95.69 on the National Stock Exchange (NSE). The stock closed 1.75% higher at  ₹93.37, outperforming the benchmark Nifty 50 index, which saw a modest 0.07% increase.Once approved, the face value of each share will drop from  ₹10 to Re 1. The company expects to complete the process within two to three months after getting a green light from the shareholders. The record date for the split will be announced later.This decision comes as Exxaro Tiles faces financial challenges. In the quarter ending June 2024, the company reported a total income of  ₹60.04 crore but suffered a loss of 4.27 crore. As of March 2024, its total debt stood at  ₹97.45 crore.Founded in 2008, Exxaro Tiles produces and sells vitrified tiles. The company manufactures both double-charge and glazed vitrified tiles, supplying to various large-scale projects including educational institutions, hotels, and hospitals. It operates two manufacturing facilities in Gujarat.","cleaned_content":"stock split \u003cTWO_THOUSAND\u003e exxaro tiles share price jumped on tuesday october \u003cONE_TEN\u003e following the companys announcement of a stock split the tile manufacturer revealed plans to divide each existing share into \u003cONE_TEN\u003e new shares marking its first ever stock split the companys board approved this move on monday october \u003cONE_TEN\u003e to boost stock liquidity and attract more small investors however the said split still requires shareholder approval the board of directors approved the division of the shares to enhance the liquidity of the shares in the stock market and to encourage wider participation of small investors exxaro tiles stated in a filing to the stock exchange exxaro tiles share price was trading in the green up \u003cONE_PERCENT\u003e at \u003cNINE_TEN\u003e on october \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cTWO_\u003e am on the bse the stock rose \u003cTHREE_PERCENT\u003e in intra day deals today to the days high of \u003cNINE_TEN\u003e despite this uptick exxaro tiles stock has dropped \u003cTHREE_TEN_PERCENT\u003e over the past year and \u003cONE_TEN_PERCENT\u003e since the start of \u003cTWO_THOUSAND\u003e on monday exxaro tiles shares rose by \u003cFOUR_PERCENT\u003e during trading to the days of \u003cNINE_TEN\u003e on the national stock exchange nse the stock closed \u003cONE_PERCENT\u003e higher at \u003cNINE_TEN\u003e outperforming the benchmark nifty \u003cFIVE_TEN\u003e index which saw a modest \u003cZERO_PERCENT\u003e increase once approved the face value of each share will drop from \u003cONE_TEN\u003e to re \u003cONE_\u003e the company expects to complete the process within two to three months after getting a green light from the shareholders the record date for the split will be announced later this decision comes as exxaro tiles faces financial challenges in the quarter ending june \u003cTWO_THOUSAND\u003e the company reported a total income of \u003cSIX_TEN\u003e crore but suffered a loss of \u003cFOUR_\u003e crore as of march \u003cTWO_THOUSAND\u003e its total debt stood at \u003cNINE_TEN\u003e crore founded in \u003cTWO_THOUSAND\u003e exxaro tiles produces and sells vitrified tiles the company manufactures both double charge and glazed vitrified tiles supplying to various large scale projects including educational institutions hotels and hospitals it operates two manufacturing facilities in gujarat","timestamp":"2024-10-15T10:30:00+05:30","market_timestamp":"2024-10-15T10:30:00+05:30","off_market_hours":false}