{"url":"https://www.livemint.com/market/stock-market-news/israel-iran-war-mazagon-dock-hal-to-bel-experts-recommend-these-eight-defence-stocks-to-buy-on-monday-oct-14-11728709684321.html","title":"Israel-Iran war: Mazagon Dock, HAL to BEL — experts recommend these eight defence stocks to buy on Monday — Oct 14","description":"Stocks to buy: According to experts, the Middle East crisis has brought defence stocks under the spotlight","content":"Israel-Iran war: Amid rising tension in the Middle East due to the Israel-Iran war-like situation, the Indian stock market, including global market investors, is cautious. Dalal Street witnessed a heavy sell-off last week. However, it has shown some signs of recovery on the weekend sessions.According to some stock market experts, some Indian defence stocks are expected to deliver stellar returns despite the Indian stock market feeling the heat of the Israel-Hamas war.The Indian stock market experts said the Middle East crisis has brought defence stocks under the spotlight. They suggested that medium—to long-term investors look at defence stocks with strong order books, as they are expected to outperform their peers.Speaking on the impact of the Israel-Iran war on the Indian defence stocks, Santosh Meena, Head of Research at Swastika Investment, said, \"The Iran-Israel conflict may not have a direct beneficiary in the Indian defence sector, but the broader geopolitical tensions have spotlighted the industry. Defence budgets worldwide, including India's, have significantly increased as countries respond to these tensions. The \"Atmanirbhar Bharat\" initiative has further propelled the sector, resulting in a notable rerating.\"\"The Israel-Iran conflict has spotlighted the defence sector, with companies like Premier Explosives, Solar Industries, and Data Patterns (India) Ltd. poised to benefit significantly,\" said Anshul Jain, Head of Research at Lakshmishree Investment and Securities.\"With a robust order book and improved financial performance, the outlook remains positive. However, concerns about valuation persist after two years of substantial growth. Fortunately, recent corrections from peak levels have created attractive buying opportunities. Long-term investors may find value in stocks such as Cochin Shipyard, GRSE, Mazagon Dockyard, and defence firms like HAL and BEL,\" Santosh Meena of Swastika Investment said.Asked about defence stocks to buy amid the Israel-Iran war-like situation in the Middle East, Anshul Jain recommended buying these three shares: Premier Explosives, Solar Industries, and Data Patterns.Premier Explosives: Premier Explosives caters to mining, infrastructure, defence, and aerospace. The company is uniquely positioned as the sole Indian exporter of fully assembled rocket motors and solid fuels for Barak missiles, which are crucial for the ongoing conflict. Premier Explosives' order book stands robust at  ₹8.9 billion, with 85% dedicated to defence. Their quarterly revenue was  ₹83 crore, a significant rise from  ₹62 crore last year. The company also expands into manufacturing mines and ammunition under the Atmanirbhar Bharat initiative, investing  ₹860 crore in new plants.Solar Industries: A top manufacturer of explosives and defence products, it is set to grow further with significant orders like the Pinaka rockets. They recently received  ₹440 crore in export orders and held an estimated order book of  ₹3,650 crore. Their acquisition of Problast in South Africa underlines their global ambitions. Solar Industries posted a record EBITDA of  ₹470 crore and a net profit of  ₹300 crore for the first quarter of FY25. They are poised for substantial growth with solid liquidity and a strategic focus on ammunition and the space sector.Data Patterns: The company is a rapidly growing player in defence and aerospace electronics, leveraging India's import bans on defence items. Revenue rose to  ₹560 crore in 2024, driven by projects from the Defence Research \u0026 Development Organisation. Their order book is robust at  ₹1140 crore, with expectations to secure  ₹2000 crore to  ₹3000 crore in projects over the next few years. Data Patterns uses advanced radar and electronic warfare products to meet diverse military needs.","cleaned_content":"israel iran war amid rising tension in the middle east due to the israel iran war like situation the indian stock market including global market investors is cautious dalal street witnessed a heavy sell off last week however it has shown some signs of recovery on the weekend sessions according to some stock market experts some indian defence stocks are expected to deliver stellar returns despite the indian stock market feeling the heat of the israel hamas war the indian stock market experts said the middle east crisis has brought defence stocks under the spotlight they suggested that medium to long term investors look at defence stocks with strong order books as they are expected to outperform their peers speaking on the impact of the israel iran war on the indian defence stocks santosh meena head of research at swastika investment said the iran israel conflict may not have a direct beneficiary in the indian defence sector but the broader geopolitical tensions have spotlighted the industry defence budgets worldwide including indias have significantly increased as countries respond to these tensions the atmanirbhar bharat initiative has further propelled the sector resulting in a notable rerating the israel iran conflict has spotlighted the defence sector with companies like premier explosives solar industries and data patterns india ltd poised to benefit significantly said anshul jain head of research at lakshmishree investment and securities with a robust order book and improved financial performance the outlook remains positive however concerns about valuation persist after two years of substantial growth fortunately recent corrections from peak levels have created attractive buying opportunities long term investors may find value in stocks such as cochin shipyard grse mazagon dockyard and defence firms like hal and bel santosh meena of swastika investment said asked about defence stocks to buy amid the israel iran war like situation in the middle east anshul jain recommended buying these three shares premier explosives solar industries and data patterns premier explosives premier explosives caters to mining infrastructure defence and aerospace the company is uniquely positioned as the sole indian exporter of fully assembled rocket motors and solid fuels for barak missiles which are crucial for the ongoing conflict premier explosives order book stands robust at \u003cEIGHT_\u003e billion with \u003cEIGHT_TEN_PERCENT\u003e dedicated to defence their quarterly revenue was \u003cEIGHT_TEN\u003e crore a significant rise from \u003cSIX_TEN\u003e crore last year the company also expands into manufacturing mines and ammunition under the atmanirbhar bharat initiative investing \u003cEIGHT_HUNDRED\u003e crore in new plants solar industries a top manufacturer of explosives and defence products it is set to grow further with significant orders like the pinaka rockets they recently received \u003cFOUR_HUNDRED\u003e crore in export orders and held an estimated order book of \u003cTHREE_THOUSAND\u003e crore their acquisition of problast in south africa underlines their global ambitions solar industries posted a record ebitda of \u003cFOUR_HUNDRED\u003e crore and a net profit of \u003cTHREE_HUNDRED\u003e crore for the first quarter of fy25 they are poised for substantial growth with solid liquidity and a strategic focus on ammunition and the space sector data patterns the company is a rapidly growing player in defence and aerospace electronics leveraging indias import bans on defence items revenue rose to \u003cFIVE_HUNDRED\u003e crore in \u003cTWO_THOUSAND\u003e driven by projects from the defence research development organisation their order book is robust at \u003cONE_THOUSAND\u003e crore with expectations to secure \u003cTWO_THOUSAND\u003e crore to \u003cTHREE_THOUSAND\u003e crore in projects over the next few years data patterns uses advanced radar and electronic warfare products to meet diverse military needs","timestamp":"2024-10-14T06:49:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}