{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-8-11728318034581.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 8","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy or sell today — LTIMindtree, Pricol, and Ambuja Cements","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, plunged amid a broad-based selloff. The indices closed lower for the sixth successive day, largely fueled by significant selloffs from foreign portfolio investors (FPIs). The Nifty 50 index closed 0.87 per cent lower at 24,795.75 points after Monday's trading session, compared to 25,014.60 points at the previous market close.The BSE Sensex index closed 0.78 per cent lower at 81,050 points after Monday's market hours, compared to 81,688.45 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty lost nearly 1,500 points from the peak zone of 26,277 level and has slipped below the important zone of 25,000, weakening the bias and expecting a further slide. Parekh estimates the Nifty 50 Spot index to find support at 24,600 points and face resistance at 25,000 points. The Bank Nifty index will likely move in a range of 49,800 to 51,000 today.For today, Parekh recommended three buy-or-sell stocks: LTIMindtree Ltd, Pricol Ltd, and Ambuja Cements Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty has lost almost 1,500 points from the peak zone of 26,277 level and has slipped below the important 50EMA zone of 25,000 levels to weaken the bias expecting for further slide.”“With the geo-political tensions hovering around, the index is precariously placed with next important support level visible near the 100 period MA at 24,300 level and further, has the major support positioned near the crucial 200 period MA at 23,200 levels,” said the stock market expert.“Bank Nifty also has lost 4,000 points from the peak zone and has moved below the important averages of 50EMA and 100 period MA with bias maintained weak. The index would have the next major and important support zone of the 200 period MA at 49,200 level which needs to be sustained to maintain the long-term trend intact,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 24,600 points, while the resistance lies at 25,000 points. The Bank Nifty index would have a daily range of 49,800 to 51,000.1. LTIMindtree Ltd. (LTIM): Buy at  ₹6,250; Target at  ₹6,400; Stop Loss at  ₹6,150.2. Pricol Ltd. (PRICOLLTD): Buy at  ₹465; Target at  ₹485; Stop Loss at  ₹455.3. Ambuja Cements Ltd. (AMBUJACEM): Buy at  ₹587; Target at  ₹610; Stop Loss at  ₹575.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e plunged amid a broad based selloff the indices closed lower for the sixth successive day largely fueled by significant selloffs from foreign portfolio investors fpis the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points after mondays trading session compared to \u003cTWO_TEN_THOUSAND\u003e points at the previous market close the bse sensex index closed \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e points after mondays market hours compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty lost nearly \u003cONE_THOUSAND\u003e points from the peak zone of \u003cTWO_TEN_THOUSAND\u003e level and has slipped below the important zone of \u003cTWO_TEN_THOUSAND\u003e weakening the bias and expecting a further slide parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFOUR_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks ltimindtree ltd pricol ltd and ambuja cements ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty has lost almost \u003cONE_THOUSAND\u003e points from the peak zone of \u003cTWO_TEN_THOUSAND\u003e level and has slipped below the important \u003cFIVE_TEN\u003e ema zone of \u003cTWO_TEN_THOUSAND\u003e levels to weaken the bias expecting for further slide with the geo political tensions hovering around the index is precariously placed with next important support level visible near the \u003cONE_HUNDRED\u003e period ma at \u003cTWO_TEN_THOUSAND\u003e level and further has the major support positioned near the crucial \u003cTWO_HUNDRED\u003e period ma at \u003cTWO_TEN_THOUSAND\u003e levels said the stock market expert bank nifty also has lost \u003cFOUR_THOUSAND\u003e points from the peak zone and has moved below the important averages of \u003cFIVE_TEN\u003e ema and \u003cONE_HUNDRED\u003e period ma with bias maintained weak the index would have the next major and important support zone of the \u003cTWO_HUNDRED\u003e period ma at \u003cFOUR_TEN_THOUSAND\u003e level which needs to be sustained to maintain the long term trend intact said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFOUR_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e ltimindtree ltd ltim buy at \u003cSIX_THOUSAND\u003e target at \u003cSIX_THOUSAND\u003e stop loss at \u003cSIX_THOUSAND\u003e pricol ltd pricolltd buy at \u003cFOUR_HUNDRED\u003e target at \u003cFOUR_HUNDRED\u003e stop loss at \u003cFOUR_HUNDRED\u003e ambuja cements ltd ambujacem buy at \u003cFIVE_HUNDRED\u003e target at \u003cSIX_HUNDRED\u003e stop loss at \u003cFIVE_HUNDRED\u003e","timestamp":"2024-10-08T06:26:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}