{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-osho-krishan-of-angel-one-suggests-buying-axis-bank-and-eih-today-11728532604082.html","title":"Stocks to buy or sell: Osho Krishan of Angel One suggests buying Axis Bank, and EIH today","description":"Stocks to buy or sell: Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives of Angel One, recommends buying - Axis Bank Ltd, and EIH Ltd today.","content":"Stock Market News: On Thursday, the domestic benchmark indices, Sensex and Nifty 50, started slightly positively, boosting investor confidence. In the opening trade, both key indices displayed gains.The Nifty 50 index showed a small increase of 0.34%, starting at 25,067.05 points, while the Sensex started at 81,832.66 points, up by 365.56 points.Market experts suggest that the market remains volatile, and traders should consider level-based trading as the preferred strategy. The positive sentiment is also linked to the RBI's shift to a neutral stance, as indicated on Wednesday.Following the passing of Ratan Tata, the Chairman Emeritus of Tata Sons and a recipient of India’s second highest civilian honor, Padma Vibhushan, on October 9, Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, emphasized the need for investors to understand that the growth of the Tata empire requires a long-term investment perspective in order to truly benefit from the wealth creation in the capital market. In the current bullish market, concerns about valuations will always arise. However, exceptional companies like those established by Ratan Tata will ultimately generate wealth for investors.Nifty 50 Outlook by Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives, Angel OneThe Indian stock markets experienced a day of unpredictable trading, with price movements occurring in both directions. Despite minimal changes in closing prices, maintaining higher levels proved to be challenging, creating a complex market environment. Furthermore, the significant downward shift from the upper price range reflects a lack of confidence among the bullish investors at present.From a technical perspective, it is anticipated that the recent low of the 24,800-24,700 subzone will offer robust support. However, if this level is breached, it could disrupt the current trend and result in increased selling pressure. At the upper end, the price represented by 25,250-25,300 poses a significant challenge for bullish market participants. Additionally, the 20-day exponential moving average (20-DEMA) positioned around the 25,360 level is expected to have an impact in the near future.Looking forward, based on the recent historical trend, the overall outlook remains cautiously optimistic, with a focus on individual stocks. It is advisable to exercise caution and refrain from making aggressive trades in either direction while also maintaining a strong risk management strategy to successfully navigate the current challenging market conditions.On stocks to buy on Thursday, Osho Krishan recommended two stocks - Axis Bank Ltd, and EIH Ltd.Axis Bank Ltd has experienced a significant correction of over 10 percent in the past few sessions, approaching the key support level (200 SMA) on the daily chart. Historical data suggests that this support level has previously acted as a strong foundation, leading to an upward trend for the stock. Moreover, the technical indicators have transitioned from overbought to oversold levels, signaling a potential reversal in the trend.Hence, we recommend to BUY Axis Bank around  ₹1,160-1,150, keeping a stop loss of  ₹1,100 for a potential Target of  ₹1,240-1,250.EIH Ltd has undergone a notable correction from its peak at 499 towards the 200 SMA on the daily chart. Over the past few sessions, it has demonstrated a consolidation breakout with increasing momentum and has now surpassed all of its major EMAs on the daily timeframe chart. The MACD indicator has shown a positive crossover from the lower zone, indicating a potential reversal in the current trend.Hence, we recommend to BUY EIH Ltd around  ₹400, keeping a stop loss of  ₹380 for a potential Target of  ₹435-440.","cleaned_content":"stock market news on thursday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e started slightly positively boosting investor confidence in the opening trade both key indices displayed gains the nifty \u003cFIVE_TEN\u003e index showed a small increase of \u003cZERO_PERCENT\u003e starting at \u003cTWO_TEN_THOUSAND\u003e points while the sensex started at \u003cEIGHT_TEN_THOUSAND\u003e points up by \u003cTHREE_HUNDRED\u003e points market experts suggest that the market remains volatile and traders should consider level based trading as the preferred strategy the positive sentiment is also linked to the rbis shift to a neutral stance as indicated on wednesday following the passing of ratan tata the chairman emeritus of tata sons and a recipient of india s second highest civilian honor padma vibhushan on october \u003cNINE_\u003e dr v k vijayakumar chief investment strategist at geojit financial services emphasized the need for investors to understand that the growth of the tata empire requires a long term investment perspective in order to truly benefit from the wealth creation in the capital market in the current bullish market concerns about valuations will always arise however exceptional companies like those established by ratan tata will ultimately generate wealth for investors nifty \u003cFIVE_TEN\u003e outlook by osho krishan sr analyst technical derivatives angel onethe indian stock markets experienced a day of unpredictable trading with price movements occurring in both directions despite minimal changes in closing prices maintaining higher levels proved to be challenging creating a complex market environment furthermore the significant downward shift from the upper price range reflects a lack of confidence among the bullish investors at present from a technical perspective it is anticipated that the recent low of the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e subzone will offer robust support however if this level is breached it could disrupt the current trend and result in increased selling pressure at the upper end the price represented by \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e poses a significant challenge for bullish market participants additionally the \u003cTWO_TEN\u003e day exponential moving average \u003cTWO_TEN\u003e dema positioned around the \u003cTWO_TEN_THOUSAND\u003e level is expected to have an impact in the near future looking forward based on the recent historical trend the overall outlook remains cautiously optimistic with a focus on individual stocks it is advisable to exercise caution and refrain from making aggressive trades in either direction while also maintaining a strong risk management strategy to successfully navigate the current challenging market conditions on stocks to buy on thursday osho krishan recommended two stocks axis bank ltd and eih ltd axis bank ltd has experienced a significant correction of over \u003cONE_TEN_PERCENT\u003e in the past few sessions approaching the key support level \u003cTWO_HUNDRED\u003e sma on the daily chart historical data suggests that this support level has previously acted as a strong foundation leading to an upward trend for the stock moreover the technical indicators have transitioned from overbought to oversold levels signaling a potential reversal in the trend hence we recommend to buy axis bank around \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e keeping a stop loss of \u003cONE_THOUSAND\u003e for a potential target of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e eih ltd has undergone a notable correction from its peak at \u003cFOUR_HUNDRED\u003e towards the \u003cTWO_HUNDRED\u003e sma on the daily chart over the past few sessions it has demonstrated a consolidation breakout with increasing momentum and has now surpassed all of its major emas on the daily timeframe chart the macd indicator has shown a positive crossover from the lower zone indicating a potential reversal in the current trend hence we recommend to buy eih ltd around \u003cFOUR_HUNDRED\u003e keeping a stop loss of \u003cTHREE_HUNDRED\u003e for a potential target of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e","timestamp":"2024-10-10T10:00:00+05:30","market_timestamp":"2024-10-10T10:00:00+05:30","off_market_hours":false}