{"url":"https://www.livemint.com/market/stock-market-news/cummins-india-shares-tank-6-after-goldman-sachs-downgrades-stock-to-sell-sees-23-downside-11728625798949.html","title":"Cummins India shares tank 6% after Goldman Sachs downgrades stock to ’sell’, sees 23% downside","description":"Cummins India shares fell 6% after Goldman Sachs downgraded the stock to 'sell' and set a target price of  ₹2,900, indicating a 23% downside. Factors include the rise of battery energy systems, a challenging macroeconomic landscape, and stricter emission regulations.","content":"Shares of Cummins India experienced a sharp decline of approximately 6 per cent during intra-day trading on Friday, October 11. This drop came in the wake of a downgrade from global brokerage house Goldman Sachs, which has revised its rating on the stock to 'sell.' Alongside this downgrade, the brokerage also reduced its target price for Cummins India to  ₹2,900. This new target price indicates a significant downside potential of over 23 per cent from the stock's last closing price, raising concerns among investors regarding the company's future performance.The brokerage outlined three primary factors behind its pessimistic outlook for Cummins India. First, Goldman Sachs emphasised the growing adoption of Battery Energy Storage Systems (BESS) and other alternative energy solutions. As industries increasingly shift towards sustainable energy sources, the demand for diesel generators is expected to decline significantly in the medium to long term. This trend poses a substantial threat to Cummins India's core business, which has historically relied on diesel-powered generators.Second, the brokerage pointed to a challenging macroeconomic environment that could negatively impact the company's export growth rates. Factors such as global economic uncertainty and fluctuating demand in international markets may hinder Cummins India's ability to expand its footprint beyond domestic boundaries. This limitation is particularly concerning given the company's ambitions for growth in overseas markets.Lastly, Goldman highlighted the impact of stringent emission norms that are being implemented worldwide. As governments enforce stricter regulations to combat pollution and promote cleaner energy alternatives, Cummins India may face additional hurdles in maintaining its market share in the diesel generator segment. The combination of these three factors has led Goldman Sachs to adopt a more cautious stance on the company's stock, prompting investors to reassess their positions and consider the potential challenges ahead for Cummins India.The stock shed as much as 5.7 per cent to its day's low of  ₹3,565.65. Post today's fall, the stock is 14.5 per cent away from its record high of  ₹4,169.50, recorded in June 2024. Meanwhile, it is still up 115 per cent from its 52-week low of  ₹1,658.65, hit in November 2023.The multibagger stock has surged 116 per cent in the last one year and 81.5 per cent in year-to-date, giving positive returns in seven of the 10 months so far. It has lost around 6 per cent in October so far after a 1.6 per cent gain in September. Prior to that, it witnessed some correction, declining around 3 per cent each in August and July. Meanwhile, it gained during the first 6 months of the year.During the Q1 earnings call, Cummins management highlighted a sharp rise in global metal prices as a challenge to maintaining the gross margins.The power solutions technology provider reported a standalone net profit of  ₹419.8 crore for the first quarter ending June 30, 2024, marking a 33 per cent year-on-year (YoY) increase from  ₹315.7 crore in the same quarter last year. The company's standalone revenue from operations rose by 4.3 per cent, reaching  ₹2,304.2 crore compared to  ₹2,208.7 crore in the corresponding period of the previous fiscal year. Additionally, the standalone EBITDA margin improved to 20.3 per cent in this reporting quarter, up from 15.4 per cent in the same quarter last year, indicating stronger operational efficiency.","cleaned_content":"shares of cummins india experienced a sharp decline of approximately \u003cSIX_PERCENT\u003e during intra day trading on friday october \u003cONE_TEN\u003e this drop came in the wake of a downgrade from global brokerage house goldman sachs which has revised its rating on the stock to sell alongside this downgrade the brokerage also reduced its target price for cummins india to \u003cTWO_THOUSAND\u003e this new target price indicates a significant downside potential of over \u003cTWO_TEN_PERCENT\u003e from the stocks last closing price raising concerns among investors regarding the companys future performance the brokerage outlined three primary factors behind its pessimistic outlook for cummins india first goldman sachs emphasised the growing adoption of battery energy storage systems bess and other alternative energy solutions as industries increasingly shift towards sustainable energy sources the demand for diesel generators is expected to decline significantly in the medium to long term this trend poses a substantial threat to cummins indias core business which has historically relied on diesel powered generators second the brokerage pointed to a challenging macroeconomic environment that could negatively impact the companys export growth rates factors such as global economic uncertainty and fluctuating demand in international markets may hinder cummins indias ability to expand its footprint beyond domestic boundaries this limitation is particularly concerning given the companys ambitions for growth in overseas markets lastly goldman highlighted the impact of stringent emission norms that are being implemented worldwide as governments enforce stricter regulations to combat pollution and promote cleaner energy alternatives cummins india may face additional hurdles in maintaining its market share in the diesel generator segment the combination of these three factors has led goldman sachs to adopt a more cautious stance on the companys stock prompting investors to reassess their positions and consider the potential challenges ahead for cummins india the stock shed as much as \u003cFIVE_PERCENT\u003e to its days low of \u003cTHREE_THOUSAND\u003e post todays fall the stock is \u003cONE_TEN_PERCENT\u003e away from its record high of \u003cFOUR_THOUSAND\u003e recorded in june \u003cTWO_THOUSAND\u003e meanwhile it is still up \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_THOUSAND\u003e hit in november \u003cTWO_THOUSAND\u003e the multibagger stock has surged \u003cONE_HUNDRED_PERCENT\u003e in the last one year and \u003cEIGHT_TEN_PERCENT\u003e in year to date giving positive returns in seven of the \u003cONE_TEN\u003e months so far it has lost around \u003cSIX_PERCENT\u003e in october so far after a \u003cONE_PERCENT\u003e gain in september prior to that it witnessed some correction declining around \u003cTHREE_PERCENT\u003e each in august and july meanwhile it gained during the first \u003cSIX_\u003e months of the year during the q1 earnings call cummins management highlighted a sharp rise in global metal prices as a challenge to maintaining the gross margins the power solutions technology provider reported a standalone net profit of \u003cFOUR_HUNDRED\u003e crore for the first quarter ending june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e marking a \u003cTHREE_TEN_PERCENT\u003e year on year yoy increase from \u003cTHREE_HUNDRED\u003e crore in the same quarter last year the companys standalone revenue from operations rose by \u003cFOUR_PERCENT\u003e reaching \u003cTWO_THOUSAND\u003e crore compared to \u003cTWO_THOUSAND\u003e crore in the corresponding period of the previous fiscal year additionally the standalone ebitda margin improved to \u003cTWO_TEN_PERCENT\u003e in this reporting quarter up from \u003cONE_TEN_PERCENT\u003e in the same quarter last year indicating stronger operational efficiency","timestamp":"2024-10-11T12:09:00+05:30","market_timestamp":"2024-10-11T12:09:00+05:30","off_market_hours":false}