{"url":"https://www.livemint.com/market/stock-market-news/midcap-stock-suzlon-energy-shares-hit-5-lower-circuit-decline-for-8th-straight-session-heres-why-11728287244327.html","title":"Midcap stock Suzlon Energy shares hit 5% lower circuit, decline for 8th straight session; here’s why","description":"Suzlon Energy shares fell 5% to  ₹70.98, marking an eighth consecutive day of decline amid corporate governance concerns. Despite a 15% drop since September 25, the stock has surged 157% over the past year. Analysts predict potential large-cap reclassification by February 2025.","content":"Shares of midcap stock Suzlon Energy hit the 5 per cent lower circuit at  ₹70.98 during intra-day trading on Monday, October 7, marking the eighth consecutive session of decline. The renewable energy stock has seen a significant drop of over 15 per cent in these eight sessions since September 25.The sharp drop in Suzlon Energy’s stock price comes after an 'advisory cum warning' letter was issued by the BSE and National Stock Exchange (NSE) earlier this month. The exchanges expressed concerns over corporate governance practices following the resignation of independent director Marc Desaedeleer. Both stock exchanges emphasised that any non-compliance with governance standards would be taken seriously in the future.However, Suzlon Energy responded, stating that it does not foresee any material impact on its financial or operational activities stemming from the warning.Despite the recent decline, Suzlon Energy shares have been on a remarkable uptrend over the past year. The stock has surged nearly 157 per cent in the past year. Over the last five years, the multibagger stock has skyrocketed by more than 2,850 per cent.In 2024, the midcap stock continued to perform well, rising approximately 86 per cent year-to-date. The stock has delivered positive returns in seven out of the 10 months this year, although it is down over 11 per cent so far in October following six straight months of gains since April.Earlier this year, the stock saw minor corrections, dipping 1.5 per cent in February and 11 per cent in March. However, Suzlon started the year on a strong note, with a gain of over 20 per cent in January.Brokerage house Nuvama Alternative Research recently predicted that Suzlon Energy could be reclassified as a large-cap stock by the Association of Mutual Funds in India (AMFI) in February 2025. Currently classified as a mid-cap stock with a threshold of  ₹27,500 crore, the company is expected to meet the revised large-cap cut-off, projected to rise to  ₹1 lakh crore from  ₹84,000 crore based on current market-cap levels.Suzlon Energy briefly surpassed the large-cap threshold, reaching a market capitalisation of  ₹1 lakh crore. However, following the recent correction, its market capitalisation has dipped to  ₹97,075 crore. Despite the potential reclassification, Nuvama's report suggested that this shift might not lead to significant fresh inflows, as fund managers routinely adjust their positions in anticipation of changes to the AMFI list.Global brokerage firm Morgan Stanley recently reaffirmed its 'Overweight' rating on Suzlon Energy after the company won a 1.17 GW order from NTPC. Morgan Stanley set a target price of  ₹73 for Suzlon, noting that the new contract enhances earnings visibility for FY26-27.Suzlon secured India’s largest wind energy order from NTPC Green Energy, a subsidiary of NTPC Limited. The company will install 370 wind turbine generators (WTGs) of the S144 model, each with a rated capacity of 3.15 MW. These turbines will be used in projects for NTPC Renewable Energy and Indian Oil NTPC Green Energy Pvt Ltd in Gujarat.While Suzlon Energy’s stock is facing short-term pressures due to corporate governance concerns, the company’s long-term outlook remains strong. Its leadership in the renewable energy sector, strategic partnerships and new orders position Suzlon well for future growth. Investors will be closely watching how the company navigates the recent challenges and capitalises on its market opportunities.","cleaned_content":"shares of midcap stock suzlon energy hit the \u003cFIVE_PERCENT\u003e lower circuit at \u003cSEVEN_TEN\u003e during intra day trading on monday october \u003cSEVEN_\u003e marking the eighth consecutive session of decline the renewable energy stock has seen a significant drop of over \u003cONE_TEN_PERCENT\u003e in these eight sessions since september \u003cTWO_TEN\u003e the sharp drop in suzlon energy s stock price comes after an advisory cum warning letter was issued by the bse and national stock exchange nse earlier this month the exchanges expressed concerns over corporate governance practices following the resignation of independent director marc desaedeleer both stock exchanges emphasised that any non compliance with governance standards would be taken seriously in the future however suzlon energy responded stating that it does not foresee any material impact on its financial or operational activities stemming from the warning despite the recent decline suzlon energy shares have been on a remarkable uptrend over the past year the stock has surged nearly \u003cONE_HUNDRED_PERCENT\u003e in the past year over the last five years the multibagger stock has skyrocketed by more than \u003cTWO_THOUSAND_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the midcap stock continued to perform well rising approximately \u003cEIGHT_TEN_PERCENT\u003e year to date the stock has delivered positive returns in seven out of the \u003cONE_TEN\u003e months this year although it is down over \u003cONE_TEN_PERCENT\u003e so far in october following six straight months of gains since april earlier this year the stock saw minor corrections dipping \u003cONE_PERCENT\u003e in february and \u003cONE_TEN_PERCENT\u003e in march however suzlon started the year on a strong note with a gain of over \u003cTWO_TEN_PERCENT\u003e in january brokerage house nuvama alternative research recently predicted that suzlon energy could be reclassified as a large cap stock by the association of mutual funds in india amfi in february \u003cTWO_THOUSAND\u003e currently classified as a mid cap stock with a threshold of \u003cTWO_TEN_THOUSAND\u003e crore the company is expected to meet the revised large cap cut off projected to rise to \u003cONE_\u003e lakh crore from \u003cEIGHT_TEN_THOUSAND\u003e crore based on current market cap levels suzlon energy briefly surpassed the large cap threshold reaching a market capitalisation of \u003cONE_\u003e lakh crore however following the recent correction its market capitalisation has dipped to \u003cNINE_TEN_THOUSAND\u003e crore despite the potential reclassification nuvamas report suggested that this shift might not lead to significant fresh inflows as fund managers routinely adjust their positions in anticipation of changes to the amfi list global brokerage firm morgan stanley recently reaffirmed its overweight rating on suzlon energy after the company won a \u003cONE_\u003e gw order from ntpc morgan stanley set a target price of \u003cSEVEN_TEN\u003e for suzlon noting that the new contract enhances earnings visibility for fy26 \u003cTWO_TEN\u003e suzlon secured india s largest wind energy order from ntpc green energy a subsidiary of ntpc limited the company will install \u003cTHREE_HUNDRED\u003e wind turbine generators wtgs of the s144 model each with a rated capacity of \u003cTHREE_\u003e mw these turbines will be used in projects for ntpc renewable energy and indian oil ntpc green energy pvt ltd in gujarat while suzlon energy s stock is facing short term pressures due to corporate governance concerns the company s long term outlook remains strong its leadership in the renewable energy sector strategic partnerships and new orders position suzlon well for future growth investors will be closely watching how the company navigates the recent challenges and capitalises on its market opportunities","timestamp":"2024-10-07T13:49:00+05:30","market_timestamp":"2024-10-07T13:49:00+05:30","off_market_hours":false}