{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-10-11728494201526.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 10","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy or sell today — Cipla, NALCO, and Birlasoft","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, started on a positive note on Wednesday and gained momentum after the Reserve Bank of India (RBI) set the stage for a potential rate cut in the upcoming MPC meetings. The momentum snapped amid investors selling heavyweights like Reliance Industries, HDFC Bank, and ITC. The Nifty 50 index closed 0.12 per cent lower at 24,981.95 points after Wednesday's trading session, compared to 25,013.15 points at the previous market close.The BSE Sensex index closed 0.21 per cent higher at 81,467.10 points today, compared to 81,634.81 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty, after pullback in the previous trading session, the index resisted near the 25,250 zone amid volatility and heavy profit booking. It erased the gains to end on a flat note near the 25,000 level as the bias is maintained and the approach remains cautious. Parekh estimates the Nifty 50 Spot index to find support at 24,800 points and face resistance at 25,150 points. The Bank Nifty index will likely move in a range of 50,500 to 51,500 today.For today, Parekh recommended three buy-or-sell stocks: Cipla Ltd, National Aluminium Co. Ltd., and Birlasoft Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty after witnessing a pullback in the previous session, resisted near the 25,250 zone and amid volatility with heavy profit booking erased the gains to end on a flat note near 25,000 levels forming a low top pattern on the daily chart.”“The bias once again is maintained with a cautious approach and the index needs to sustain the low made near 24,700 zone failing which the trend would turn very weak anticipating for further slide,” said the stock market expert.“Bank Nifty found resistance near the 51,700 zone and post the RBI policy announcement, was subjected to heavy profit booking to plunge towards the 51,000 level with bias once again turning weak. The low made near 50,200 zone needs to be sustained for the overall bias to remain intact else one can expect for intensified selling pressure once it is breached below,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 24,800 points, while the resistance lies at 25,150 points. The Bank Nifty index would have a daily range of 50,500 to 51,500.1. Cipla Ltd. (CIPLA): Buy at  ₹1,680; Target at  ₹1,745; Stop Loss at  ₹1,640.2. National Aluminium Co. Ltd. (NATIONALUM): Buy at  ₹214.25; Target at  ₹223; Stop Loss at  ₹209.3. Birlasoft Ltd. (BSOFT): Buy at  ₹591.25; Target at  ₹622; Stop Loss at  ₹578.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e started on a positive note on wednesday and gained momentum after the reserve bank of india rbi set the stage for a potential rate cut in the upcoming mpc meetings the momentum snapped amid investors selling heavyweights like reliance industries hdfc bank and itc the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points after wednesdays trading session compared to \u003cTWO_TEN_THOUSAND\u003e points at the previous market close the bse sensex index closed \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e points today compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty after pullback in the previous trading session the index resisted near the \u003cTWO_TEN_THOUSAND\u003e zone amid volatility and heavy profit booking it erased the gains to end on a flat note near the \u003cTWO_TEN_THOUSAND\u003e level as the bias is maintained and the approach remains cautious parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks cipla ltd national aluminium co ltd and birlasoft ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty after witnessing a pullback in the previous session resisted near the \u003cTWO_TEN_THOUSAND\u003e zone and amid volatility with heavy profit booking erased the gains to end on a flat note near \u003cTWO_TEN_THOUSAND\u003e levels forming a low top pattern on the daily chart the bias once again is maintained with a cautious approach and the index needs to sustain the low made near \u003cTWO_TEN_THOUSAND\u003e zone failing which the trend would turn very weak anticipating for further slide said the stock market expert bank nifty found resistance near the \u003cFIVE_TEN_THOUSAND\u003e zone and post the rbi policy announcement was subjected to heavy profit booking to plunge towards the \u003cFIVE_TEN_THOUSAND\u003e level with bias once again turning weak the low made near \u003cFIVE_TEN_THOUSAND\u003e zone needs to be sustained for the overall bias to remain intact else one can expect for intensified selling pressure once it is breached below said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e cipla ltd cipla buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e national aluminium co ltd nationalum buy at \u003cTWO_HUNDRED\u003e target at \u003cTWO_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e birlasoft ltd bsoft buy at \u003cFIVE_HUNDRED\u003e target at \u003cSIX_HUNDRED\u003e stop loss at \u003cFIVE_HUNDRED\u003e","timestamp":"2024-10-10T06:11:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}