{"url":"https://www.livemint.com/market/stock-market-news/rupee-drops-to-all-time-low-of-83-99-against-the-us-dollar-on-high-oil-prices-fii-outflow-11728626239709.html","title":"Rupee drops past 84 against the US dollar for the first time on high oil prices, FII outflow","description":"Rupee dropped to 84.05 to the dollar, down from 83.9675 in the previous session. Rupee surpassed the previous lifetime low of 83.9850 hit on September 12.","content":"Indian rupee fell below 84 against the US dollar for the first time on Friday, weighed down by concerns over the recent jump in oil prices and the exodus of foreign money from the equity markets.The local currency dropped to a low of 84.0525 to the dollar, and was last quoted at 84.05, down from 83.9675 in the previous session. Rupee surpassed the previous lifetime low of 83.9850 hit on September 12.The dollar index, which gauges the greenback’s strength against a basket of six currencies, was down 0.11% to 102.87 points.“The Rupee continues to trade within a defined range, with global headwinds keeping the pressure on. Despite these challenges, the rupee’s downside appears limited, supported by the RBI’s sizable reserves. Additionally, the recent rise in metals—known for their negative correlation with the dollar index—is expected to benefit emerging market currencies,” said Amit Pabari, MD, CR Forex Advisors.In the short term, Pabari expects USDINR to remain range-bound between 83.80 and 84.05.“Looking further ahead, the outlook for the Rupee brightens, with substantial inflows expected to hit the market. This could push the USDINR pair to trade between 83.50 and 84.05, with a possible bias toward the lower end of the range,” Pabari said.Meanwhile, crude oil prices eased on Friday after a rally the previous day, but prices remained set for a second straight weekly gain. Brent crude, the international benchmark, eased 0.09% to $79.33 a barrel. Brent oil prices have rallied more than 10% in October so far.In the domestic equity market, the 30-share BSE Sensex was down 259.05 points, or 0.32%, at 81,352.36, while Nifty 50 fell 67.40 points, or 0.27%, to 24,931.05.Foreign Institutional Investors (FIIs) were net sellers in the Indian stock market on Thursday, as they offloaded shares worth  ₹4,926.61 crore, according to exchange data.(With inputs from Reuters)","cleaned_content":"indian rupee fell below \u003cEIGHT_TEN\u003e against the us dollar for the first time on friday weighed down by concerns over the recent jump in oil prices and the exodus of foreign money from the equity markets the local currency dropped to a low of \u003cEIGHT_TEN\u003e to the dollar and was last quoted at \u003cEIGHT_TEN\u003e down from \u003cEIGHT_TEN\u003e in the previous session rupee surpassed the previous lifetime low of \u003cEIGHT_TEN\u003e hit on september \u003cONE_TEN\u003e the dollar index which gauges the greenback s strength against a basket of six currencies was down \u003cZERO_PERCENT\u003e to \u003cONE_HUNDRED\u003e points the rupee continues to trade within a defined range with global headwinds keeping the pressure on despite these challenges the rupee s downside appears limited supported by the rbi s sizable reserves additionally the recent rise in metals known for their negative correlation with the dollar index is expected to benefit emerging market currencies said amit pabari md cr forex advisors in the short term pabari expects usdinr to remain range bound between \u003cEIGHT_TEN\u003e and \u003cEIGHT_TEN\u003e looking further ahead the outlook for the rupee brightens with substantial inflows expected to hit the market this could push the usdinr pair to trade between \u003cEIGHT_TEN\u003e and \u003cEIGHT_TEN\u003e with a possible bias toward the lower end of the range pabari said meanwhile crude oil prices eased on friday after a rally the previous day but prices remained set for a second straight weekly gain brent crude the international benchmark eased \u003cZERO_PERCENT\u003e to \u003cSEVEN_TEN\u003e a barrel brent oil prices have rallied more than \u003cONE_TEN_PERCENT\u003e in october so far in the domestic equity market the \u003cTHREE_TEN\u003e share bse sensex was down \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e while nifty \u003cFIVE_TEN\u003e fell \u003cSIX_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e foreign institutional investors fiis were net sellers in the indian stock market on thursday as they offloaded shares worth \u003cFOUR_THOUSAND\u003e crore according to exchange data with inputs from reuters","timestamp":"2024-10-11T11:29:00+05:30","market_timestamp":"2024-10-11T11:29:00+05:30","off_market_hours":false}