{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-icici-bank-tata-power-among-5-large-cap-picks-of-motilal-oswal-for-october-11728974145605.html","title":"Stocks to buy: ICICI Bank, Tata Power among 5 large-cap picks of Motilal Oswal for October","description":"The US Fed's 50bps rate cut sparked market rallies, while China's stimulus led to shifts in foreign investments. India's economy remains robust with 7% GDP growth. Analysts recommend five large-cap stocks, citing buying opportunities amid corrections, supported by strong retail participation.","content":"Brokerage house Motilal Oswal Securities (MOSL) noted that equity markets maintained their upward trajectory for the fourth consecutive month in September, reaching new record highs. The Nifty surpassed the 26,000 mark in September 2024, hitting a peak of 26,277 before closing with a gain of 2.3 per cent at 25,811. This rally was driven by positive domestic factors, strong foreign institutional investor (FII) inflows, and the beginning of the US Federal Reserve's rate cut cycle.In a much-anticipated meeting, the US Federal Reserve initiated its rate cut cycle with a 50 basis points (bps) reduction, which sparked a rally in both global and domestic equity markets. Additionally, China's central bank introduced stimulus measures to support its economy, including cutting interest rates, lowering mortgage rates, and reducing the reserve ratio by 50bps. This stimulus caused a shift of FIIs from emerging markets like India to China.Despite this, India remained resilient, supported by an estimated 7 per cent GDP growth and a 15 per cent compound annual growth rate (CAGR) in Nifty earnings for FY24-26. Strong retail participation also contributed to positive market sentiment. MOSL highlighted that Nifty was trading at 21.5 times one-year forward price-to-earnings (P/E), only a 5 per cent premium to its 10-year average of 20.4 times.Given these conditions, MOSL believes that any correction in Indian equities presents a buying opportunity for long-term investors to accumulate high-quality stocks.It has picked 5 large-cap stocks for October. Let's take a look:ICICI Bank: The brokerage has a target price of  ₹1,400 on the private sector lender, implying an upside potential of almost 14 per cent.MOSL highlighted ICICI Bank's steady performance, with a 15 per cent year-on-year growth in net earnings for the quarter. Deposits grew 15 per cent year-on-year, led by time deposits, while asset quality remained stable with gross non-performing assets (GNPA) at 2.15 per cent and net non-performing assets (NNPA) at 0.43 per cent. No stress signs were noted. The bank's growth was driven by its high-yielding portfolios and expansion in business banking, SME, and secured retail segments, ensuring business diversification. MOSL projected a 12 per cent CAGR in profit after tax (PAT) for FY24-26, estimating a return on assets (RoA) of 2.2 per cent and a return on equity (RoE) of 17.3 per cent by FY26.Bharti Airtel: The brokerage has a target price of  ₹2,000 on the telecom major, indicating an upside potential of 18 per cent.MOSL highlighted that Bharti Airtel continued its deleveraging efforts in Q1FY25, supported by healthy free cash flow (FCF) generation. Capital expenditure moderated to  ₹80 billion during the quarter. Following the recent tariff hikes, MOSL expects key growth drivers for telecom stocks to include subscriber gains, reduced churn, 5G adoption, and an increase in data customers. The brokerage projected an average revenue per user (ARPU) CAGR of 18 per cent over FY24-26, factoring in both the recent tariff hikes and the likelihood of another round in FY26. MOSL also expects a 40 per cent growth in Bharti Airtel's EBITDA and halving of its net debt within the next 2-3 years.HCL Tech: The brokerage has a target price of  ₹1,777 on the IT major, which implies a downside potential of 4 per cent from current levels.MOSL noted that HCL Tech demonstrated strong financials with an EBITDA margin of 18.3 per cent in FY24, along with consistent cash flow generation. The company's effective cost management strategies are expected to further improve margins, supporting sustained profitability. HCL Tech's robust capabilities in data engineering, engineering R\u0026D (ER\u0026D) services, and ERP modernisation position it well to capture opportunities in pre-generative AI (GenAI) spending, enhancing its growth prospects. The brokerage also observed that the IT sector showed promising signs, with client spending behaviour becoming more favourable, indicating a return to modernisation and discretionary spending. HCL Tech stands to benefit from this positive momentum.Tata Power: The brokerage has a target price of  ₹441 for the power major, implying a downside potential of almost 5 per cent.Tata Power's integrated operations in thermal and renewable power generation, transmission, solar module manufacturing, and distribution provided a strategic advantage in emerging sectors like solar rooftop distribution and pumped storage, while also exploring nuclear investments. Management aims to double EBITDA and profit after tax (PAT) by FY27 compared to FY23, backed by a  ₹60,000 crore capital expenditure plan, with 45 per cent allocated to renewable energy. This growth strategy is supported by the expected commissioning of 15 GW of renewable energy capacity by FY27. Core earnings, excluding coal and non-core businesses, are projected to rise from 40 per cent in FY23 to 90 per cent in FY27, driven by renewable energy growth and the expansion of the solar module plant, resulting in a more sustainable earnings profile in the long-term.HDFC Life Insurance Company: The brokerage has a target price of  ₹706 on the insurance major, indicating a downside potential of almost 5 per cent.MOSL indicated that upcoming regulations in the insurance sector, such as risk-based solvency and IFRS, are expected to positively impact financials by releasing capital for growth and increasing market share, particularly in the protection segment. HDFC Life reported strong growth in total annual premium equivalent (APE) and individual non-single policies, with an increase of 29 per cent and 26 per cent, respectively, on a fiscal-to-date basis. MOSL believes HDFC Life is well-positioned for significant growth, driven by product innovation, expansion in HDFC Bank channels, an increased agency count, and a strong return on embedded value (RoEV) of 16-17 per cent. The brokerage projected around 18 per cent compound annual growth rate (CAGR) in the value of new business (VNB) over FY24-26, with margins expected to remain steady in the range of 25-26 per cent.","cleaned_content":"brokerage house motilal oswal securities mosl noted that equity markets maintained their upward trajectory for the fourth consecutive month in september reaching new record highs the nifty surpassed the \u003cTWO_TEN_THOUSAND\u003e mark in september \u003cTWO_THOUSAND\u003e hitting a peak of \u003cTWO_TEN_THOUSAND\u003e before closing with a gain of \u003cTWO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e this rally was driven by positive domestic factors strong foreign institutional investor fii inflows and the beginning of the us federal reserves rate cut cycle in a much anticipated meeting the us federal reserve initiated its rate cut cycle with a \u003cFIVE_TEN\u003e basis points bps reduction which sparked a rally in both global and domestic equity markets additionally chinas central bank introduced stimulus measures to support its economy including cutting interest rates lowering mortgage rates and reducing the reserve ratio by \u003cFIVE_TEN\u003e bps this stimulus caused a shift of fiis from emerging markets like india to china despite this india remained resilient supported by an estimated \u003cSEVEN_PERCENT\u003e gdp growth and a \u003cONE_TEN_PERCENT\u003e compound annual growth rate cagr in nifty earnings for fy24 \u003cTWO_TEN\u003e strong retail participation also contributed to positive market sentiment mosl highlighted that nifty was trading at \u003cTWO_TEN\u003e times one year forward price to earnings p e only a \u003cFIVE_PERCENT\u003e premium to its \u003cONE_TEN\u003e year average of \u003cTWO_TEN\u003e times given these conditions mosl believes that any correction in indian equities presents a buying opportunity for long term investors to accumulate high quality stocks it has picked \u003cFIVE_\u003e large cap stocks for october lets take a look icici bank the brokerage has a target price of \u003cONE_THOUSAND\u003e on the private sector lender implying an upside potential of almost \u003cONE_TEN_PERCENT\u003e mosl highlighted icici banks steady performance with a \u003cONE_TEN_PERCENT\u003e year on year growth in net earnings for the quarter deposits grew \u003cONE_TEN_PERCENT\u003e year on year led by time deposits while asset quality remained stable with gross non performing assets gnpa at \u003cTWO_PERCENT\u003e and net non performing assets nnpa at \u003cZERO_PERCENT\u003e no stress signs were noted the banks growth was driven by its high yielding portfolios and expansion in business banking sme and secured retail segments ensuring business diversification mosl projected a \u003cONE_TEN_PERCENT\u003e cagr in profit after tax pat for fy24 \u003cTWO_TEN\u003e estimating a return on assets roa of \u003cTWO_PERCENT\u003e and a return on equity roe of \u003cONE_TEN_PERCENT\u003e by fy26 bharti airtel the brokerage has a target price of \u003cTWO_THOUSAND\u003e on the telecom major indicating an upside potential of \u003cONE_TEN_PERCENT\u003e mosl highlighted that bharti airtel continued its deleveraging efforts in q1fy25 supported by healthy free cash flow fcf generation capital expenditure moderated to \u003cEIGHT_TEN\u003e billion during the quarter following the recent tariff hikes mosl expects key growth drivers for telecom stocks to include subscriber gains reduced churn \u003cFIVE_\u003e g adoption and an increase in data customers the brokerage projected an average revenue per user arpu cagr of \u003cONE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e factoring in both the recent tariff hikes and the likelihood of another round in fy26 mosl also expects a \u003cFOUR_TEN_PERCENT\u003e growth in bharti airtels ebitda and halving of its net debt within the next \u003cTWO_\u003e \u003cTHREE_\u003e years hcl tech the brokerage has a target price of \u003cONE_THOUSAND\u003e on the it major which implies a downside potential of \u003cFOUR_PERCENT\u003e from current levels mosl noted that hcl tech demonstrated strong financials with an ebitda margin of \u003cONE_TEN_PERCENT\u003e in fy24 along with consistent cash flow generation the companys effective cost management strategies are expected to further improve margins supporting sustained profitability hcl techs robust capabilities in data engineering engineering r d er d services and erp modernisation position it well to capture opportunities in pre generative ai genai spending enhancing its growth prospects the brokerage also observed that the it sector showed promising signs with client spending behaviour becoming more favourable indicating a return to modernisation and discretionary spending hcl tech stands to benefit from this positive momentum tata power the brokerage has a target price of \u003cFOUR_HUNDRED\u003e for the power major implying a downside potential of almost \u003cFIVE_PERCENT\u003e tata powers integrated operations in thermal and renewable power generation transmission solar module manufacturing and distribution provided a strategic advantage in emerging sectors like solar rooftop distribution and pumped storage while also exploring nuclear investments management aims to double ebitda and profit after tax pat by fy27 compared to fy23 backed by a \u003cSIX_TEN_THOUSAND\u003e crore capital expenditure plan with \u003cFOUR_TEN_PERCENT\u003e allocated to renewable energy this growth strategy is supported by the expected commissioning of \u003cONE_TEN\u003e gw of renewable energy capacity by fy27 core earnings excluding coal and non core businesses are projected to rise from \u003cFOUR_TEN_PERCENT\u003e in fy23 to \u003cNINE_TEN_PERCENT\u003e in fy27 driven by renewable energy growth and the expansion of the solar module plant resulting in a more sustainable earnings profile in the long term hdfc life insurance company the brokerage has a target price of \u003cSEVEN_HUNDRED\u003e on the insurance major indicating a downside potential of almost \u003cFIVE_PERCENT\u003e mosl indicated that upcoming regulations in the insurance sector such as risk based solvency and ifrs are expected to positively impact financials by releasing capital for growth and increasing market share particularly in the protection segment hdfc life reported strong growth in total annual premium equivalent ape and individual non single policies with an increase of \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively on a fiscal to date basis mosl believes hdfc life is well positioned for significant growth driven by product innovation expansion in hdfc bank channels an increased agency count and a strong return on embedded value roev of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e the brokerage projected around \u003cONE_TEN_PERCENT\u003e compound annual growth rate cagr in the value of new business vnb over fy24 \u003cTWO_TEN\u003e with margins expected to remain steady in the range of \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e","timestamp":"2024-10-15T12:50:00+05:30","market_timestamp":"2024-10-15T12:50:00+05:30","off_market_hours":false}