{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-oct-14-11728835226753.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — Oct 14","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy today — GAIL India, Clean Science and Technology, and Intellect Design Arena","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, ended lower after Friday's trading session, weighed down by the auto and banking sectors. Pharma and metal stocks provided some support but were not able to lift the indices higher. The Nifty 50 index closed 0.14 per cent lower at 24,964.25 points after Friday's trading session, compared to 24,998.45 points at the previous market close.The BSE Sensex index closed 0.28 per cent higher at 81,381.36 points today, compared to 81,611.41 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty witnessed a consolidated phase during the week, hovering near the 25,000 level. The bias is maintained with a cautious approach. Parekh estimates the Nifty 50 Spot index to find support at 24,800 points and face resistance at 25,150 points. The Bank Nifty index will likely move in a range of 50,700 to 51,600 today.For today, Parekh recommended three buy-or-sell stocks: GAIL India Ltd, Clean Science and Technology Ltd, and Intellect Design Arena Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty witnessed a consolidation phase during the week hovering near the important 50EMA near the 25,000 levels and is precariously placed with bias maintained with a cautious approach.”“The index would have the near-term support at around 24,700 level while the upside, it would need a decisive breach above 25,400 zone to improve the bias overall,” said the stock market expert.“Bank Nifty after witnessing the steep slide, it has taken support near 50,200 zone as of now and consolidating within a narrow band of 51,000 and 51,600 levels, it has sustained near the important 100 period MA at 51,250 zone. The index would have the important near-term support at around 50,000 levels while on the upside, it needs to breach above the 51,800 level decisively to establish some conviction,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 24,800 points, while the resistance lies at 25,150 points. The Bank Nifty index would have a daily range of 50,700 to 51,600.1. GAIL India Ltd. (GAIL): Buy at  ₹229.40; Target at  ₹240; Stop Loss at  ₹224.2. Clean Science and Technology Ltd. (CLEAN): Buy at  ₹1,568.55; Target at  ₹1,630; Stop Loss at  ₹1,535.3. Intellect Design Arena Ltd. (INTELLECT): Buy at  ₹899.90; Target at  ₹935; Stop Loss at  ₹882.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e ended lower after fridays trading session weighed down by the auto and banking sectors pharma and metal stocks provided some support but were not able to lift the indices higher the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points after fridays trading session compared to \u003cTWO_TEN_THOUSAND\u003e points at the previous market close the bse sensex index closed \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e points today compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty witnessed a consolidated phase during the week hovering near the \u003cTWO_TEN_THOUSAND\u003e level the bias is maintained with a cautious approach parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks gail india ltd clean science and technology ltd and intellect design arena ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty witnessed a consolidation phase during the week hovering near the important \u003cFIVE_TEN\u003e ema near the \u003cTWO_TEN_THOUSAND\u003e levels and is precariously placed with bias maintained with a cautious approach the index would have the near term support at around \u003cTWO_TEN_THOUSAND\u003e level while the upside it would need a decisive breach above \u003cTWO_TEN_THOUSAND\u003e zone to improve the bias overall said the stock market expert bank nifty after witnessing the steep slide it has taken support near \u003cFIVE_TEN_THOUSAND\u003e zone as of now and consolidating within a narrow band of \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e levels it has sustained near the important \u003cONE_HUNDRED\u003e period ma at \u003cFIVE_TEN_THOUSAND\u003e zone the index would have the important near term support at around \u003cFIVE_TEN_THOUSAND\u003e levels while on the upside it needs to breach above the \u003cFIVE_TEN_THOUSAND\u003e level decisively to establish some conviction said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e gail india ltd gail buy at \u003cTWO_HUNDRED\u003e target at \u003cTWO_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e clean science and technology ltd clean buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e intellect design arena ltd intellect buy at \u003cEIGHT_HUNDRED\u003e target at \u003cNINE_HUNDRED\u003e stop loss at \u003cEIGHT_HUNDRED\u003e","timestamp":"2024-10-14T06:15:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}