{"url":"https://www.livemint.com/market/stock-market-news/vedanta-board-meeting-to-consider-dividend-cancelled-11728488135597.html","title":"Vedanta board meeting to consider dividend cancelled","description":"‘We withdraw the notice of board meeting proposed to be held on October 9, and accordingly the meeting hereby stands cancelled,’ the company said in a filing.","content":"Vedanta Ltd informed the exchanges on Wednesday that its scheduled board meeting for the day was cancelled due to unforeseen circumstances. The meeting was originally planned to discuss the fourth interim dividend for FY25.\"We withdraw the notice of board meeting proposed to be held on October 9, and accordingly the meeting hereby stands cancelled,\" the company said in a filing.The company has set October 16 as the record date for the proposed dividend, should it be declared.Vedanta has a solid track record of paying dividends and boasts one of the highest dividend yields in the market. Over the past 12 months, the company distributed  ₹46 per share in dividends, resulting in a yield of 9.19%.The metals giant has already declared three dividends in the current fiscal year, with six months still remaining.In the first half of the year, Vedanta achieved its highest-ever quarterly and half-year aluminium production, reaching 1,205 kt. The company also saw a 21% year-on-year (YoY) increase in alumina production.Vedanta also recorded its highest-ever second-quarter production of mined and refined metal in Zinc India, with mined metal reaching a new high. Refined metal production rose by 5% YoY to 524 kt in the first half of the year.Vedanta's shares have had an impressive run this year, surging 92% year-to-date.ICICI Securities recently resumed coverage of Vedanta's stock, setting a target price of  ₹600. The brokerage firm believes that Vedanta's growth strategy is centered around increasing volume, enhancing value, and reducing costs across its various segments.“We value VEDL on the SoTP methodology. Our TP works out to INR 600/share, implying a 17% upside from CMP. Besides, dividend yield of 5–6% over the next three years is an additional sweetener. We resume coverage on VEDL with a BUY rating,” the brokerage firm said in a note.","cleaned_content":"vedanta ltd informed the exchanges on wednesday that its scheduled board meeting for the day was cancelled due to unforeseen circumstances the meeting was originally planned to discuss the fourth interim dividend for fy25 we withdraw the notice of board meeting proposed to be held on october \u003cNINE_\u003e and accordingly the meeting hereby stands cancelled the company said in a filing the company has set october \u003cONE_TEN\u003e as the record date for the proposed dividend should it be declared vedanta has a solid track record of paying dividends and boasts one of the highest dividend yields in the market over the past \u003cONE_TEN\u003e months the company distributed \u003cFOUR_TEN\u003e per share in dividends resulting in a yield of \u003cNINE_PERCENT\u003e the metals giant has already declared three dividends in the current fiscal year with six months still remaining in the first half of the year vedanta achieved its highest ever quarterly and half year aluminium production reaching \u003cONE_THOUSAND\u003e kt the company also saw a \u003cTWO_TEN_PERCENT\u003e year on year yoy increase in alumina production vedanta also recorded its highest ever second quarter production of mined and refined metal in zinc india with mined metal reaching a new high refined metal production rose by \u003cFIVE_PERCENT\u003e yoy to \u003cFIVE_HUNDRED\u003e kt in the first half of the year vedantas shares have had an impressive run this year surging \u003cNINE_TEN_PERCENT\u003e year to date icici securities recently resumed coverage of vedantas stock setting a target price of \u003cSIX_HUNDRED\u003e the brokerage firm believes that vedantas growth strategy is centered around increasing volume enhancing value and reducing costs across its various segments we value vedl on the sotp methodology our tp works out to inr \u003cSIX_HUNDRED\u003e share implying a \u003cONE_TEN_PERCENT\u003e upside from cmp besides dividend yield of \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e over the next three years is an additional sweetener we resume coverage on vedl with a buy rating the brokerage firm said in a note","timestamp":"2024-10-09T21:08:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}