{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-20-penny-stock-hits-the-upper-circuit-after-receiving-an-order-from-reliance-industries-11728972514736.html","title":"Small-cap stock below  ₹20: Penny stock hits the upper circuit after receiving an order from Reliance Industries","description":"Small-cap stock below  ₹20: Gujarat Toolroom's share price rose 5% after announcing the completion of a  ₹290 million order and securing a new  ₹310 million contract from Reliance Industries, marking significant progress in their partnership.","content":"Small-cap stock below  ₹20: Gujarat Toolroom share price surged 5 per cent to hit its upper circuit of  ₹14.38 on BSE in intraday trade on Tuesday, October 15, after the company announced it completed a previous order and was awarded a new one from Reliance Industries. Shares of the company that deals in plastic products opened at  ₹14.37 on Tuesday against their previous close of  ₹13.70 and rose 4.96 per cent to the level of  ₹14.38.In an exchange filing on October 15, Gujarat Toolroom said, “...successfully completed an order worth  ₹290 million for the construction supplies to Reliance Industries on 14th October 2024. This order was previously secured on 5th March 2024 and marks a critical milestone in our partnership with one of India’s most prominent conglomerates.”\"We are also excited to announce that the company has been awarded a new order worth  ₹310 million from Reliance Industries for the supply of additional construction materials. This order is expected to be completed within the next two months, further strengthening our ongoing collaboration with Reliance Industries,\" the company further said.With these two orders, the company's cumulative order value from Reliance Industries stands at  ₹600 million.\"The continuation of this partnership reinforces the trust Reliance Industries places in Gujarat Toolroom, affirming our position as a dependable provider of construction supplies. We are optimistic about receiving further orders from Reliance Industries and other key clients, which will drive future growth and revenue expansion for the company,\" said Gujarat Toolroom.The company recently successfully completed a  ₹500 million qualified institutional placement (QIP), issuing 43.48 million equity shares at  ₹11.50 per share. The company intends to utilise the capital raised from the QIP to accelerate its expansion plans, focusing on growth areas like clean energy, mining, and international operations.Gujarat Toolroom has exposed itself to multiple high-growth sectors.It has developed a hybrid energy power plant in Gujarat and has plans to integrate solar, wind, and other renewable energy sources.Additionally, the company has acquired gold mines in Zambia to add significant value to its portfolio.\"The increasing global demand for precious metals presents a lucrative opportunity for the company’s mining division. Furthermore, establishing a Dubai subsidiary marks another strategic leap, giving Gujarat Toolroom a foothold in the rapidly growing Middle Eastern and African markets. This subsidiary will focus on expanding the company’s presence in the mining and construction sectors, where demand is robust and growing,\" the company said.The small-cap stock has seen solid gains this month so far, surging as much as 20 per cent after a 15 per cent decline in September. It hit its 52-week high of  ₹45.97 on March 11 this year but witnessed significant profit booking thereafter. The stock plumbed its 52-week low of  ₹10.75 on August 14 this year.Year-to-date, the stock has seen a decline of 59 per cent.Read all market-related news here","cleaned_content":"small cap stock below \u003cTWO_TEN\u003e gujarat toolroom share price surged \u003cFIVE_PERCENT\u003e to hit its upper circuit of \u003cONE_TEN\u003e on bse in intraday trade on tuesday october \u003cONE_TEN\u003e after the company announced it completed a previous order and was awarded a new one from reliance industries shares of the company that deals in plastic products opened at \u003cONE_TEN\u003e on tuesday against their previous close of \u003cONE_TEN\u003e and rose \u003cFOUR_PERCENT\u003e to the level of \u003cONE_TEN\u003e in an exchange filing on october \u003cONE_TEN\u003e gujarat toolroom said successfully completed an order worth \u003cTWO_HUNDRED\u003e million for the construction supplies to reliance industries on \u003cONE_TEN\u003e th october \u003cTWO_THOUSAND\u003e this order was previously secured on \u003cFIVE_\u003e th march \u003cTWO_THOUSAND\u003e and marks a critical milestone in our partnership with one of india s most prominent conglomerates we are also excited to announce that the company has been awarded a new order worth \u003cTHREE_HUNDRED\u003e million from reliance industries for the supply of additional construction materials this order is expected to be completed within the next two months further strengthening our ongoing collaboration with reliance industries the company further said with these two orders the companys cumulative order value from reliance industries stands at \u003cSIX_HUNDRED\u003e million the continuation of this partnership reinforces the trust reliance industries places in gujarat toolroom affirming our position as a dependable provider of construction supplies we are optimistic about receiving further orders from reliance industries and other key clients which will drive future growth and revenue expansion for the company said gujarat toolroom the company recently successfully completed a \u003cFIVE_HUNDRED\u003e million qualified institutional placement qip issuing \u003cFOUR_TEN\u003e million equity shares at \u003cONE_TEN\u003e per share the company intends to utilise the capital raised from the qip to accelerate its expansion plans focusing on growth areas like clean energy mining and international operations gujarat toolroom has exposed itself to multiple high growth sectors it has developed a hybrid energy power plant in gujarat and has plans to integrate solar wind and other renewable energy sources additionally the company has acquired gold mines in zambia to add significant value to its portfolio the increasing global demand for precious metals presents a lucrative opportunity for the company s mining division furthermore establishing a dubai subsidiary marks another strategic leap giving gujarat toolroom a foothold in the rapidly growing middle eastern and african markets this subsidiary will focus on expanding the company s presence in the mining and construction sectors where demand is robust and growing the company said the small cap stock has seen solid gains this month so far surging as much as \u003cTWO_TEN_PERCENT\u003e after a \u003cONE_TEN_PERCENT\u003e decline in september it hit its \u003cFIVE_TEN\u003e week high of \u003cFOUR_TEN\u003e on march \u003cONE_TEN\u003e this year but witnessed significant profit booking thereafter the stock plumbed its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e on august \u003cONE_TEN\u003e this year year to date the stock has seen a decline of \u003cFIVE_TEN_PERCENT\u003e read all market related news here","timestamp":"2024-10-15T12:16:00+05:30","market_timestamp":"2024-10-15T12:16:00+05:30","off_market_hours":false}