{"url":"https://www.livemint.com/market/stock-market-news/rbi-monetary-policy-bank-nifty-rises-1-as-policy-stance-changes-to-neutral-11728449417942.html","title":"RBI Monetary Policy: Bank Nifty rises 1% as policy stance changed to ‘Neutral’","description":"RBI Monetary Policy meeting: The Bank Nifty gained more than 1% post the RBI Monetary Policy meeting outcome. While the interest rates remain unchanged, as was anticipated, the RBI changed its policy stance to ‘neutral’ from ‘withdrawal of accommodation’.","content":"RBI Monetary Policy meeting: The Bank Nifty gained more than 1% post the monetary policy outcome on Wednesday, October 9, following a shift in stance by India's rate-setting panel.The Bank Nifty opened at 51,021 today. The index gathered strength after the monetary policy decision, hitting the day's high of 51,606, an increase of over 1% from the previous close.Governor Shaktikanta Das announced that the rate-setting panel has kept the benchmark repo rate unchanged at 6.5% for the tenth consecutive meeting. However, the MPC shifted its policy stance from 'withdrawal of accommodation' to 'neutral'.The market was already anticipating no rate cut in today's policy meeting as inflationary risks have not fully abated. Further, rising crude oil prices amid the Iran-Israel war pose a risk. Concerns around food inflation continue to linger, said analysts. Furthermore, while the economic growth has been healthy, there are some early signs of softness.Nevertheless, since the RBI may want to retain the flexibility to be able to cut rates if needed, a change in stance was anticipated and the RBI did not disappoint either. The change in stance opens doors for possible rate cuts in the next few meetings.On the technical front, Bank Nifty saw a decent pullback on Tuesday as it closed above the 51,000 zone (up 1.07%) with most of the frontline banking stocks picking up from their lows. However, for the bias to improve overall, it needed to breach above the significant 50-EMA of 51,800 levels as per Vaishali Parekh Vice President - Technical Research PL Capital Group - Prabhudas Lilladher.The Bank Nifty post RBI monetary policy outcome has moved close to the 50-day exponential moving average or 50-EMA.The index has important support near the previous low made at the 49,600 level which needs to be sustained for now to keep the trend intact, as per Parekh.","cleaned_content":"rbi monetary policy meeting the bank nifty gained more than \u003cONE_PERCENT\u003e post the monetary policy outcome on wednesday october \u003cNINE_\u003e following a shift in stance by indias rate setting panel the bank nifty opened at \u003cFIVE_TEN_THOUSAND\u003e today the index gathered strength after the monetary policy decision hitting the days high of \u003cFIVE_TEN_THOUSAND\u003e an increase of over \u003cONE_PERCENT\u003e from the previous close governor shaktikanta das announced that the rate setting panel has kept the benchmark repo rate unchanged at \u003cSIX_PERCENT\u003e for the tenth consecutive meeting however the mpc shifted its policy stance from withdrawal of accommodation to neutral the market was already anticipating no rate cut in todays policy meeting as inflationary risks have not fully abated further rising crude oil prices amid the iran israel war pose a risk concerns around food inflation continue to linger said analysts furthermore while the economic growth has been healthy there are some early signs of softness nevertheless since the rbi may want to retain the flexibility to be able to cut rates if needed a change in stance was anticipated and the rbi did not disappoint either the change in stance opens doors for possible rate cuts in the next few meetings on the technical front bank nifty saw a decent pullback on tuesday as it closed above the \u003cFIVE_TEN_THOUSAND\u003e zone up \u003cONE_PERCENT\u003e with most of the frontline banking stocks picking up from their lows however for the bias to improve overall it needed to breach above the significant \u003cFIVE_TEN\u003e ema of \u003cFIVE_TEN_THOUSAND\u003e levels as per vaishali parekh vice president technical research pl capital group prabhudas lilladher the bank nifty post rbi monetary policy outcome has moved close to the \u003cFIVE_TEN\u003e day exponential moving average or \u003cFIVE_TEN\u003e ema the index has important support near the previous low made at the \u003cFOUR_TEN_THOUSAND\u003e level which needs to be sustained for now to keep the trend intact as per parekh","timestamp":"2024-10-09T11:02:00+05:30","market_timestamp":"2024-10-09T11:02:00+05:30","off_market_hours":false}