{"url":"https://www.livemint.com/market/stock-market-news/trent-vs-avenue-supermarts-this-tata-group-share-surpasses-market-cap-of-this-radhakishan-damani-s-stock-11728889769197.html","title":"This Tata group share surpasses market cap of this Radhakishan Damani’s stock","description":"Trent’s market capitalisation spiked to more than  ₹2.92 lakh crore on October 14, while Avenue Supermarts market cap slipped to  ₹2.72 lakh crore.","content":"Tata Group company Trent surpassed DMart retail chain operator Avenue Supermarts in market capitalisation on Monday. Trent share price continued its stellar rally, while the ace investor Radhakishan Damani-owned Avenue Supermarts shares witnessed a significant drop after disappointing Q2 results.Trent’s market capitalisation spiked to more than  ₹2.92 lakh crore on October 14, while Avenue Supermarts market cap slipped to  ₹2.72 lakh crore.This comes after DMart share price plunged more than 9% on Monday, witnessing its biggest single-day fall since January 2019, after its September quarter results missed Street estimates. DMart shares declined as much as 9.37% to  ₹4,143.60 apiece on the BSE.Trent operates a portfolio of retail concepts, including fashion retail store chains Westside and Zudio, along with Star, which operates in the competitive food, grocery and daily needs segment. As of 30 June 2024, Trent’s store portfolio included 228 Westside, 559 Zudio and 36 stores across other lifestyle concepts.Recently, Trent announced the pilot launch of its new lab-grown diamond (LGD) brand, ‘Pome,’ in Westside stores.Kotak Equities referred to Pome as the Zudio of the jewellery segment, highlighting how the brand has strategically positioned itself with a pricing strategy centered on the concept of “diamonds for all.”On the other hand, DMart share price cracked on Monday after the company disappointed with lower than estimated September quarter earnings growth.Avenue Supermarts Q2FY25 revenue growth of 14.4% YoY and net profit growth of 5.77% was below expectations. Sluggish revenue performance resulted in a YoY EBITDA margin compression of 40 bps.Trent share price has seen a strong rally of more than 14% in one month and 46% in three months. The Tata Group stock has given multibagger returns of 170% year-to-date (YTD) and over 296% in the past one year period. Trent stock price has jumped by a staggering 611% in three years.“Trent stock price has given a fresh breakout on the weekly chart at  ₹7,900 level. Any dip in the stock would be an opportunity to buy. Stop loss should be kept at  ₹7,600 - 7,800 levels for an upside target of  ₹8,800,” said Ganesh Dongre, Senior Manager — Technical Research at Anand Rathi.DMart share price has failed to give any significant returns as the stock has fallen over 19% in one month and more than 15% in three months. Avenue Supermarts shares are up by just over 2% YTD, while the stock has gained over 6% in one year.“Avenue Supermarts shares are trading near their support level of  ₹4,000 - 4,100. A breach below this level could trigger a more bearish trend in the stock. Traders need to wait and watch for any further move,” Dongre said.At 1:00 PM, DMart shares  were trading 8.58% lower at  ₹4,180.00 apiece with a market cap of over  ₹2.72 lakh crore, while Trent shares were trading 0.46% lower at  ₹8,200.65 apiece, commanding a market cap of more than  ₹2.91 lakh crore on BSE.","cleaned_content":"tata group company trent surpassed dmart retail chain operator avenue supermarts in market capitalisation on monday trent share price continued its stellar rally while the ace investor radhakishan damani owned avenue supermarts shares witnessed a significant drop after disappointing q2 results trent s market capitalisation spiked to more than \u003cTWO_\u003e lakh crore on october \u003cONE_TEN\u003e while avenue supermarts market cap slipped to \u003cTWO_\u003e lakh crore this comes after dmart share price plunged more than \u003cNINE_PERCENT\u003e on monday witnessing its biggest single day fall since january \u003cTWO_THOUSAND\u003e after its september quarter results missed street estimates dmart shares declined as much as \u003cNINE_PERCENT\u003e to \u003cFOUR_THOUSAND\u003e apiece on the bse trent operates a portfolio of retail concepts including fashion retail store chains westside and zudio along with star which operates in the competitive food grocery and daily needs segment as of \u003cTHREE_TEN\u003e june \u003cTWO_THOUSAND\u003e trent s store portfolio included \u003cTWO_HUNDRED\u003e westside \u003cFIVE_HUNDRED\u003e zudio and \u003cTHREE_TEN\u003e stores across other lifestyle concepts recently trent announced the pilot launch of its new lab grown diamond lgd brand pome in westside stores kotak equities referred to pome as the zudio of the jewellery segment highlighting how the brand has strategically positioned itself with a pricing strategy centered on the concept of diamonds for all on the other hand dmart share price cracked on monday after the company disappointed with lower than estimated september quarter earnings growth avenue supermarts q2fy25 revenue growth of \u003cONE_TEN_PERCENT\u003e yoy and net profit growth of \u003cFIVE_PERCENT\u003e was below expectations sluggish revenue performance resulted in a yoy ebitda margin compression of \u003cFOUR_TEN\u003e bps trent share price has seen a strong rally of more than \u003cONE_TEN_PERCENT\u003e in one month and \u003cFOUR_TEN_PERCENT\u003e in three months the tata group stock has given multibagger returns of \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and over \u003cTWO_HUNDRED_PERCENT\u003e in the past one year period trent stock price has jumped by a staggering \u003cSIX_HUNDRED_PERCENT\u003e in three years trent stock price has given a fresh breakout on the weekly chart at \u003cSEVEN_THOUSAND\u003e level any dip in the stock would be an opportunity to buy stop loss should be kept at \u003cSEVEN_THOUSAND\u003e \u003cSEVEN_THOUSAND\u003e levels for an upside target of \u003cEIGHT_THOUSAND\u003e said ganesh dongre senior manager technical research at anand rathi dmart share price has failed to give any significant returns as the stock has fallen over \u003cONE_TEN_PERCENT\u003e in one month and more than \u003cONE_TEN_PERCENT\u003e in three months avenue supermarts shares are up by just over \u003cTWO_PERCENT\u003e ytd while the stock has gained over \u003cSIX_PERCENT\u003e in one year avenue supermarts shares are trading near their support level of \u003cFOUR_THOUSAND\u003e \u003cFOUR_THOUSAND\u003e a breach below this level could trigger a more bearish trend in the stock traders need to wait and watch for any further move dongre said at \u003cONE_\u003e \u003cZERO_\u003e pm dmart shares were trading \u003cEIGHT_PERCENT\u003e lower at \u003cFOUR_THOUSAND\u003e apiece with a market cap of over \u003cTWO_\u003e lakh crore while trent shares were trading \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_THOUSAND\u003e apiece commanding a market cap of more than \u003cTWO_\u003e lakh crore on bse","timestamp":"2024-10-14T13:03:00+05:30","market_timestamp":"2024-10-14T13:03:00+05:30","off_market_hours":false}