{"url":"https://www.livemint.com/market/stock-market-news/fpis-dump-indian-stocks-for-11th-straight-session-withdraw-rs-73-000-crore-11728728103813.html","title":"FPIs dump Indian stocks for 11th straight session, withdraw  ₹73,000 crore","description":"Indian stock indices have reversed sharply in October, driven by significant foreign portfolio outflows and geopolitical tensions. The Nifty 50 and Sensex have seen declines of 2.91% and 3%, respectively, amid concerns over domestic earnings and a shift in investor focus to Chinese markets.","content":"The selling streak by foreign portfolio investors (FPIs) continues to grow, with another outflow of  ₹3,731.60 crore from Indian stocks recorded in Monday's trading session. This marks the 11th consecutive day of selling, highlighting a sustained trend of bearish sentiment among international investors towards the Indian equity market.This brings their total withdrawals over the past 11 days to  ₹73,123 crore and  ₹62,124 crore in October so far, with the most substantial sell-off occurring on October 03, when FPIs offloaded  ₹15,506 crore, according to data from Trendlyne. FPIs last engaged in net buying on September 26, acquiring stocks worth  ₹630 crore.Despite significant selling activity by FPIs, the Indian stock markets have experienced minimal impact due to strong support from domestic institutional investors. This robust buying has been acting as a cushion against the outflows from foreign investors.However, these outflows have adversely affected the Indian rupee, which has fallen to its lowest level of  ₹84.20 against the US dollar.Following China's unveiling of new policy measures aimed at reviving its faltering economy, FPIs have shifted their focus to Chinese stocks, hoping these measures will revitalise corporate earnings and the economy. Additionally, the attractive valuations of Chinese stocks compared to the elevated valuations of Indian stocks have led to significant buying interest in the former.Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services, said, \"The major trend in foreign portfolio flows in October, so far, has been the sustained selling by FPIs. FPIs have been following a strategy of ‘Sell India, Buy China’ after the Chinese authorities announced monetary and fiscal measures to stimulate the slowing Chinese economy.\"He noted that FPI money has been moving to Chinese stocks, which are cheap even now. The Hang Seng index (Chinese H stocks are listed in Hong Kong) is now trading at a PE of about 12, while Nifty is trading at a PE of 23 times estimated FY25 earnings. He believes that this valuation gap could attract further investments into Chinese stocks.However, he emphasised that India has stronger growth prospects compared to China, justifying premium valuations. Nevertheless, he added, the significant valuation differential may continue to drive FPI selling in the near term.After a relentless upward march in the first eight months of the current calendar year, where every dip was seen as a buying opportunity, Indian stocks have reversed sharply in October, propelling the front-line indices to trade at multi-month lows.In recent sessions, Indian equities have been relatively subdued as they seek direction amid a tug-of-war between the bulls and the bears after a sharp decline in the first week of October. While the bulls have dominated the market for the majority of 2024, their inability to sustain momentum has left equities without support in October.Amid this backdrop, the Nifty 50 has corrected 2.91% in October, breaching the crucial 25,000 mark. From its recent peak of 26,277, the index has experienced a nearly 4.4% decline. Similarly, the Sensex has also fallen 4.65% from its recent peak of 85,978 and is down 3% so far this month.Broader markets have not managed to escape the recent slump either, although the decline has been less severe compared to large-cap stocks. The Nifty Midcap 100 index is down 1.22% in October, while the Nifty Smallcap 100 index has lost 0.89% during the same period.Several factors have contributed to this sharp sell-off, with the primary trigger being the steady outflows of FPIs, which exerted severe pressure on Indian equities.Domestically, the anticipated weak performance from Indian companies in the September quarter has raised concerns and contributed to the reversal of Indian stocks in October.  Additionally, tensions between Iran and Israel show no signs of easing. This situation is dampening global investor sentiment, particularly regarding India, as rising crude oil prices have the potential to alter inflation projections and impact corporate earnings.Amid the ongoing tensions, the USA has recently imposed a fresh sanction on Iran, targeting the country's petroleum and petrochemical sectors in response to its October 1 attack on Israel. In addition, the US is also sanctioning 16 entities engaged in the Iranian petroleum trade and blocking 23 vessels, as per the latest media reports.The Biden administration approved the sale of billions of dollars in weapons to Saudi Arabia and the United Arab Emirates, a fresh show of support to two allies that are crucial to the US pushback against Iran and its proxies as conflict escalates in the Middle East, Bloomberg reported.Motilal Oswal estimates earnings of companies under its coverage universe to remain flat (lowest in eight quarters) and Nifty 50 earnings to grow marginally by 2% YoY in 2QFY25 (lowest in 17 quarters). Ex-OMCs, it expects the universe and Nifty earnings to grow 7% and 5% YoY, the lowest in eight and 17 quarters, respectively. Margin tailwinds are likely to ebb due to a high base.\"The EBITDA margin (ex-financials) is likely to contract by 150 bps YoY for the MOFSL Universe, reaching 16.4%, mainly dragged down by OMCs. Meanwhile, the margin is projected to contract 40 bps for the Nifty-50 at 20%. The overall earnings growth is anticipated to be primarily driven, once again, by BFSI (+11% YoY), along with healthcare (15% YoY), Utilities (+24% YoY), and the improved contribution of Telecom YoY (loss notably reducing to  ₹4 billion in September 2024 from  ₹3 billion in September 2023),\" the brokerage said.With the recent runup in the market, domestic brokerage firm Axis Securities believes that much of the current narrative is already priced in. In this context, it expects near-term consolidation, with market breadth likely to narrow further. The focus is expected to remain on style and sector rotation in the coming months.Additionally, following a strong catch-up by midcaps and smallcaps over the last few months, the brokerage sees a reduced margin of safety for these segments at current valuation levels compared to largecaps.Given this outlook, it anticipates some time correction in specific areas of the broader market, with investment flows likely to shift towards largecaps. As a result, it believes the Nifty 50 could reach new highs in the near term. Over the long term, the brokerage continues to view the broader market positively. Two themes—'growth at a reasonable price’ and ‘quality'—remain attractive at this point, it said.With the expected recovery in China, some cyclical sectors are likely to see a comeback in the domestic market. However, large-cap private banks, telecom, consumption, IT, and pharma provide more margin of safety in the near term, it opined.The brokerage maintains its March 2025 Nifty 50 target at 24,600, valuing it at 20x on March 2026 earnings. It recommends that investors stay invested, maintaining a liquidity buffer of around 10%, to capitalise on dips by building positions in high-quality companies with strong earnings visibility, over a 12- to 18-month investment horizon.","cleaned_content":"the selling streak by foreign portfolio investors fpis continues to grow with another outflow of \u003cTHREE_THOUSAND\u003e crore from indian stocks recorded in mondays trading session this marks the \u003cONE_TEN\u003e th consecutive day of selling highlighting a sustained trend of bearish sentiment among international investors towards the indian equity market this brings their total withdrawals over the past \u003cONE_TEN\u003e days to \u003cSEVEN_TEN_THOUSAND\u003e crore and \u003cSIX_TEN_THOUSAND\u003e crore in october so far with the most substantial sell off occurring on october \u003cTHREE_\u003e when fpis offloaded \u003cONE_TEN_THOUSAND\u003e crore according to data from trendlyne fpis last engaged in net buying on september \u003cTWO_TEN\u003e acquiring stocks worth \u003cSIX_HUNDRED\u003e crore despite significant selling activity by fpis the indian stock markets have experienced minimal impact due to strong support from domestic institutional investors this robust buying has been acting as a cushion against the outflows from foreign investors however these outflows have adversely affected the indian rupee which has fallen to its lowest level of \u003cEIGHT_TEN\u003e against the us dollar following chinas unveiling of new policy measures aimed at reviving its faltering economy fpis have shifted their focus to chinese stocks hoping these measures will revitalise corporate earnings and the economy additionally the attractive valuations of chinese stocks compared to the elevated valuations of indian stocks have led to significant buying interest in the former dr v k vijayakumar chief investment strategist geojit financial services said the major trend in foreign portfolio flows in october so far has been the sustained selling by fpis fpis have been following a strategy of sell india buy china after the chinese authorities announced monetary and fiscal measures to stimulate the slowing chinese economy he noted that fpi money has been moving to chinese stocks which are cheap even now the hang seng index chinese h stocks are listed in hong kong is now trading at a pe of about \u003cONE_TEN\u003e while nifty is trading at a pe of \u003cTWO_TEN\u003e times estimated fy25 earnings he believes that this valuation gap could attract further investments into chinese stocks however he emphasised that india has stronger growth prospects compared to china justifying premium valuations nevertheless he added the significant valuation differential may continue to drive fpi selling in the near term after a relentless upward march in the first eight months of the current calendar year where every dip was seen as a buying opportunity indian stocks have reversed sharply in october propelling the front line indices to trade at multi month lows in recent sessions indian equities have been relatively subdued as they seek direction amid a tug of war between the bulls and the bears after a sharp decline in the first week of october while the bulls have dominated the market for the majority of \u003cTWO_THOUSAND\u003e their inability to sustain momentum has left equities without support in october amid this backdrop the nifty \u003cFIVE_TEN\u003e has corrected \u003cTWO_PERCENT\u003e in october breaching the crucial \u003cTWO_TEN_THOUSAND\u003e mark from its recent peak of \u003cTWO_TEN_THOUSAND\u003e the index has experienced a nearly \u003cFOUR_PERCENT\u003e decline similarly the sensex has also fallen \u003cFOUR_PERCENT\u003e from its recent peak of \u003cEIGHT_TEN_THOUSAND\u003e and is down \u003cTHREE_PERCENT\u003e so far this month broader markets have not managed to escape the recent slump either although the decline has been less severe compared to large cap stocks the nifty midcap \u003cONE_HUNDRED\u003e index is down \u003cONE_PERCENT\u003e in october while the nifty smallcap \u003cONE_HUNDRED\u003e index has lost \u003cZERO_PERCENT\u003e during the same period several factors have contributed to this sharp sell off with the primary trigger being the steady outflows of fpis which exerted severe pressure on indian equities domestically the anticipated weak performance from indian companies in the september quarter has raised concerns and contributed to the reversal of indian stocks in october additionally tensions between iran and israel show no signs of easing this situation is dampening global investor sentiment particularly regarding india as rising crude oil prices have the potential to alter inflation projections and impact corporate earnings amid the ongoing tensions the usa has recently imposed a fresh sanction on iran targeting the countrys petroleum and petrochemical sectors in response to its october \u003cONE_\u003e attack on israel in addition the us is also sanctioning \u003cONE_TEN\u003e entities engaged in the iranian petroleum trade and blocking \u003cTWO_TEN\u003e vessels as per the latest media reports the biden administration approved the sale of billions of dollars in weapons to saudi arabia and the united arab emirates a fresh show of support to two allies that are crucial to the us pushback against iran and its proxies as conflict escalates in the middle east bloomberg reported motilal oswal estimates earnings of companies under its coverage universe to remain flat lowest in eight quarters and nifty \u003cFIVE_TEN\u003e earnings to grow marginally by \u003cTWO_PERCENT\u003e yoy in \u003cTWO_\u003e qfy25 lowest in \u003cONE_TEN\u003e quarters ex omcs it expects the universe and nifty earnings to grow \u003cSEVEN_PERCENT\u003e and \u003cFIVE_PERCENT\u003e yoy the lowest in eight and \u003cONE_TEN\u003e quarters respectively margin tailwinds are likely to ebb due to a high base the ebitda margin ex financials is likely to contract by \u003cONE_HUNDRED\u003e bps yoy for the mofsl universe reaching \u003cONE_TEN_PERCENT\u003e mainly dragged down by omcs meanwhile the margin is projected to contract \u003cFOUR_TEN\u003e bps for the nifty \u003cFIVE_TEN\u003e at \u003cTWO_TEN_PERCENT\u003e the overall earnings growth is anticipated to be primarily driven once again by bfsi \u003cONE_TEN_PERCENT\u003e yoy along with healthcare \u003cONE_TEN_PERCENT\u003e yoy utilities \u003cTWO_TEN_PERCENT\u003e yoy and the improved contribution of telecom yoy loss notably reducing to \u003cFOUR_\u003e billion in september \u003cTWO_THOUSAND\u003e from \u003cTHREE_\u003e billion in september \u003cTWO_THOUSAND\u003e the brokerage said with the recent runup in the market domestic brokerage firm axis securities believes that much of the current narrative is already priced in in this context it expects near term consolidation with market breadth likely to narrow further the focus is expected to remain on style and sector rotation in the coming months additionally following a strong catch up by midcaps and smallcaps over the last few months the brokerage sees a reduced margin of safety for these segments at current valuation levels compared to largecaps given this outlook it anticipates some time correction in specific areas of the broader market with investment flows likely to shift towards largecaps as a result it believes the nifty \u003cFIVE_TEN\u003e could reach new highs in the near term over the long term the brokerage continues to view the broader market positively two themes growth at a reasonable price and quality remain attractive at this point it said with the expected recovery in china some cyclical sectors are likely to see a comeback in the domestic market however large cap private banks telecom consumption it and pharma provide more margin of safety in the near term it opined the brokerage maintains its march \u003cTWO_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e target at \u003cTWO_TEN_THOUSAND\u003e valuing it at \u003cTWO_TEN\u003e x on march \u003cTWO_THOUSAND\u003e earnings it recommends that investors stay invested maintaining a liquidity buffer of around \u003cONE_TEN_PERCENT\u003e to capitalise on dips by building positions in high quality companies with strong earnings visibility over a \u003cONE_TEN\u003e to \u003cONE_TEN\u003e month investment horizon","timestamp":"2024-10-15T13:08:00+05:30","market_timestamp":"2024-10-15T13:08:00+05:30","off_market_hours":false}