{"url":"https://www.livemint.com/market/stock-market-news/fpis-pull-rs-55-700-crore-from-indian-equities-in-7-days-dii-buying-stems-severe-market-crash-11728462273850.html","title":"FPIs pull out  ₹55,700 crore from Indian equities in 7 days; DII buying stems severe market crash","description":"FPIs have withdrawn  ₹55,742 crore from Indian equities over the last seven trading sessions amid rising oil prices and valuation concerns, while DIIs have purchased stocks worth  ₹60,204 crore.","content":"Foreign portfolio investors (FPIs) continued their selling streak for the seventh consecutive trading session on Tuesday, pulling out an additional  ₹5,729 crore from Indian equities. This brings their total withdrawals over the past seven days to  ₹55,742 crore, with the most substantial sell-off occurring on October 4, when FPIs offloaded  ₹15,506 crore, according to data from Trendlyne.Notably, domestic institutional investors (DIIs) have cushioned the impact of the FPI selloff, maintaining their position as net buyers for the past seven sessions. Over this period, DIIs have purchased Indian shares valued at  ₹60,206 crore.Despite the strong buying by DIIs, the Indian stock markets could not stem their decline. The Nifty 50 lost 4.4% during the last seven trading sessions, while the Sensex declined 4.6%.During Tuesday’s trade, FPI selling slowed slightly. Experts attribute this moderation, in part, to profit booking in Chinese stocks.Dr V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services, said, \"The ‘Sell India, Buy China’ strategy pursued by the FIIs recently appears to be coming to an end, as indicated by the declining FII sell numbers and the profit booking in Chinese stocks, particularly those listed in Hong Kong.\"\"An important takeaway from the FIIs vs. DIIs tug-of-war that has happened anytime in the ongoing bull rally is that the fight ended in the victory of the DIIs each time. FIIs are selling on valuation concerns; DIIs are buying because they have deep pockets to buy, and the pockets are getting deeper. BJP’s victory in Haryana has come as a morale booster for the party and confidence booster for markets,\" he further added.According to Vijayakumar, the optimal approach right now is to focus on accumulating high-quality, fairly valued blue-chip stocks, with a particular emphasis on leading financial and IT companies.In recent times, whenever global uncertainties and market volatility prompt FPIs to sell off, domestic investors have consistently stepped in to stabilise and even drive the markets higher. This pattern of steady domestic buying, supported by strong retail investment, has helped ensure that the Indian stock market remains resilient, even amid global economic turbulence.Meanwhile, FPI selling in Indian stocks can be attributed to key factors such as rising tensions between Iran and Israel, which led to a significant spike in crude oil prices. This increase in crude prices has impacted investor sentiment, as higher oil prices could drive inflation. Another contributing factor is the elevated valuation of Indian stocks.Additionally, China has recently introduced comprehensive economic support measures, including reducing banks’ reserve requirements and key lending rates, in an effort to revive its slowing economy and bolster its capital markets.In response, FPIs have redirected funds toward Chinese stocks, anticipating a potential recovery in the Chinese economy and improved earnings for Chinese companies following these stimulus actions.Chinese stocks tumbled on Wednesday, snapping their 10-day winning run. The Shanghai Composite index slid 6.6%, while the blue-chip CSI300 index declined 7.1%. Both indexes booked their biggest one-day losses since February 2020, according to a Reuters report.Hong Kong’s Hang Seng Index also declined, finishing 1.38% lower. This followed a steep drop of more than 9% on Tuesday, marking its worst single-day performance since the 2008 global financial crisis.After gaining momentum in the last week of September due to stimulus announcements, Chinese stocks saw a reversal as a highly anticipated news conference in Beijing—following the Golden Week holiday—failed to announce new stimulus measures, offering limited details on previously promised initiatives, leaving traders disappointed.","cleaned_content":"foreign portfolio investors fpis continued their selling streak for the seventh consecutive trading session on tuesday pulling out an additional \u003cFIVE_THOUSAND\u003e crore from indian equities this brings their total withdrawals over the past seven days to \u003cFIVE_TEN_THOUSAND\u003e crore with the most substantial sell off occurring on october \u003cFOUR_\u003e when fpis offloaded \u003cONE_TEN_THOUSAND\u003e crore according to data from trendlyne notably domestic institutional investors diis have cushioned the impact of the fpi selloff maintaining their position as net buyers for the past seven sessions over this period diis have purchased indian shares valued at \u003cSIX_TEN_THOUSAND\u003e crore despite the strong buying by diis the indian stock markets could not stem their decline the nifty \u003cFIVE_TEN\u003e lost \u003cFOUR_PERCENT\u003e during the last seven trading sessions while the sensex declined \u003cFOUR_PERCENT\u003e during tuesday s trade fpi selling slowed slightly experts attribute this moderation in part to profit booking in chinese stocks dr v k vijayakumar chief investment strategist geojit financial services said the sell india buy china strategy pursued by the fiis recently appears to be coming to an end as indicated by the declining fii sell numbers and the profit booking in chinese stocks particularly those listed in hong kong an important takeaway from the fiis vs diis tug of war that has happened anytime in the ongoing bull rally is that the fight ended in the victory of the diis each time fiis are selling on valuation concerns diis are buying because they have deep pockets to buy and the pockets are getting deeper bjp s victory in haryana has come as a morale booster for the party and confidence booster for markets he further added according to vijayakumar the optimal approach right now is to focus on accumulating high quality fairly valued blue chip stocks with a particular emphasis on leading financial and it companies in recent times whenever global uncertainties and market volatility prompt fpis to sell off domestic investors have consistently stepped in to stabilise and even drive the markets higher this pattern of steady domestic buying supported by strong retail investment has helped ensure that the indian stock market remains resilient even amid global economic turbulence meanwhile fpi selling in indian stocks can be attributed to key factors such as rising tensions between iran and israel which led to a significant spike in crude oil prices this increase in crude prices has impacted investor sentiment as higher oil prices could drive inflation another contributing factor is the elevated valuation of indian stocks additionally china has recently introduced comprehensive economic support measures including reducing banks reserve requirements and key lending rates in an effort to revive its slowing economy and bolster its capital markets in response fpis have redirected funds toward chinese stocks anticipating a potential recovery in the chinese economy and improved earnings for chinese companies following these stimulus actions chinese stocks tumbled on wednesday snapping their \u003cONE_TEN\u003e day winning run the shanghai composite index slid \u003cSIX_PERCENT\u003e while the blue chip csi300 index declined \u003cSEVEN_PERCENT\u003e both indexes booked their biggest one day losses since february \u003cTWO_THOUSAND\u003e according to a reuters report hong kong s hang seng index also declined finishing \u003cONE_PERCENT\u003e lower this followed a steep drop of more than \u003cNINE_PERCENT\u003e on tuesday marking its worst single day performance since the \u003cTWO_THOUSAND\u003e global financial crisis after gaining momentum in the last week of september due to stimulus announcements chinese stocks saw a reversal as a highly anticipated news conference in beijing following the golden week holiday failed to announce new stimulus measures offering limited details on previously promised initiatives leaving traders disappointed","timestamp":"2024-10-09T15:18:00+05:30","market_timestamp":"2024-10-09T15:18:00+05:30","off_market_hours":false}