{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-ril-hcl-tech-easy-trip-planners-jsw-infra-hal-and-more-11728841943110.html","title":"Stocks to Watch: RIL, HCL Tech, Easy Trip Planners, JSW Infra, HAL, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Reliance Industries (RIL): RIL's consolidated profit for Q2 FY25 declined by 4.8 percent year-on-year to  ₹16,563 crore, missing analyst estimates. This marks the third consecutive quarter of declining profits, driven by weakness in the oil-to-chemicals (O2C) segment. However, the digital services and upstream businesses posted growth. Revenue slightly decreased to  ₹2.31 trillion, while Jio Platforms saw an 18 percent revenue growth due to telecom tariff hikes. The retail business recorded a 5.2 percent increase in net profit, though revenue fell due to challenges in the fashion and lifestyle sectors.HCL Tech: The company increased its FY25 revenue growth guidance to 3.5-5 percent, driven by strong performances in the telecommunications and media sectors. Q2 FY25 net profit rose 10.5 percent to  ₹4,235 crore. HCLTech continues to invest in AI and digital capabilities, enhancing its future growth prospects.Avenue Supermarts: The operator of D-Mart reported a 5.78 percent rise in consolidated net profit to  ₹659.44 crore for Q2 FY25. Revenue from operations grew 14.41 percent to  ₹14,444.50 crore.Easy Trip Planners: The board approved a bonus share issuance, offering one bonus share for each fully paid-up equity share. This move is aimed at rewarding shareholders and will increase the company’s share capital to  ₹354.408 crore, funded from reserves.Sterling and Wilson Renewable Energy: The company secured domestic orders worth  ₹2,050 crore in Q2 FY25, including a major order of  ₹823 crore in October. Its unexecuted order value reached a record  ₹10,500 crore.JSW Infrastructure: Received a Letter of Intent from Maharashtra Maritime Board for the development and operation of a multi-purpose port at Palghar on a public-private partnership (PPP) basis using a DBOOT model.Can Fin Homes: The board will meet on October 22 to review Q2 FY25 results and discuss raising  ₹4,000 crore through non-convertible debentures (NCDs) via private placement.Sula Vineyards: Reported its highest-ever Own Brands revenue in Q2 FY25, led by its Elite \u0026 Premium portfolio. However, growth was impacted by macroeconomic challenges and market-specific issues in Karnataka and Delhi. The company expects these issues to be temporary.Indoco Remedies: The USFDA's inspection of its Goa facility resulted in an \"Official Action Indicated\" (OAI) status following a review in July 2024.Hindustan Aeronautics (HAL): HAL was elevated to the status of a Maharatna Central Public Sector Enterprise (CPSE), giving it greater operational and financial autonomy. It becomes the 14th company to achieve this status.Upcoming Results: Several companies are set to release their Q2 FY25 earnings on October 15, including HDFC Life Insurance, HDFC Asset Management, PVR Inox, Bank of Maharashtra, and KEI Industries, among others.","cleaned_content":"reliance industries ril rils consolidated profit for q2 fy25 declined by \u003cFOUR_PERCENT\u003e year on year to \u003cONE_TEN_THOUSAND\u003e crore missing analyst estimates this marks the third consecutive quarter of declining profits driven by weakness in the oil to chemicals o2c segment however the digital services and upstream businesses posted growth revenue slightly decreased to \u003cTWO_\u003e trillion while jio platforms saw an \u003cONE_TEN_PERCENT\u003e revenue growth due to telecom tariff hikes the retail business recorded a \u003cFIVE_PERCENT\u003e increase in net profit though revenue fell due to challenges in the fashion and lifestyle sectors hcl tech the company increased its fy25 revenue growth guidance to \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e driven by strong performances in the telecommunications and media sectors q2 fy25 net profit rose \u003cONE_TEN_PERCENT\u003e to \u003cFOUR_THOUSAND\u003e crore hcltech continues to invest in ai and digital capabilities enhancing its future growth prospects avenue supermarts the operator of d mart reported a \u003cFIVE_PERCENT\u003e rise in consolidated net profit to \u003cSIX_HUNDRED\u003e crore for q2 fy25 revenue from operations grew \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e crore easy trip planners the board approved a bonus share issuance offering one bonus share for each fully paid up equity share this move is aimed at rewarding shareholders and will increase the company s share capital to \u003cTHREE_HUNDRED\u003e crore funded from reserves sterling and wilson renewable energy the company secured domestic orders worth \u003cTWO_THOUSAND\u003e crore in q2 fy25 including a major order of \u003cEIGHT_HUNDRED\u003e crore in october its unexecuted order value reached a record \u003cONE_TEN_THOUSAND\u003e crore jsw infrastructure received a letter of intent from maharashtra maritime board for the development and operation of a multi purpose port at palghar on a public private partnership ppp basis using a dboot model can fin homes the board will meet on october \u003cTWO_TEN\u003e to review q2 fy25 results and discuss raising \u003cFOUR_THOUSAND\u003e crore through non convertible debentures ncds via private placement sula vineyards reported its highest ever own brands revenue in q2 fy25 led by its elite premium portfolio however growth was impacted by macroeconomic challenges and market specific issues in karnataka and delhi the company expects these issues to be temporary indoco remedies the usfdas inspection of its goa facility resulted in an official action indicated oai status following a review in july \u003cTWO_THOUSAND\u003e hindustan aeronautics hal hal was elevated to the status of a maharatna central public sector enterprise cpse giving it greater operational and financial autonomy it becomes the \u003cONE_TEN\u003e th company to achieve this status upcoming results several companies are set to release their q2 fy25 earnings on october \u003cONE_TEN\u003e including hdfc life insurance hdfc asset management pvr inox bank of maharashtra and kei industries among others","timestamp":"2024-10-15T08:23:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}