{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-rs-10-bse-listed-small-cap-stock-jumps-following-stock-market-recovery-gains-nearly-12-in-one-week-11728021348258.html","title":"Penny stock below  ₹10: BSE-listed small-cap stock jumps following stock market recovery; gains nearly 12% in one week","description":"Penny stock below  ₹10: Scanpoint Geomatics share price gained over 14% in one month and more than 94% year-to-date (YTD). The small-cap stock has given more than 50% returns in the past one year.","content":"Scanpoint Geomatics share price jumped over 3% on Friday, extending its gaining streak for the fifth consecutive session. Scanpoint Geomatics shares rose as much as 3.64% to  ₹9.95 apiece on BSE. The small-cap stock surged nearly 12% in one week.Scanpoint Geomatics is a BSE-listed small-cap company in the IT services and software company.The five-day rally in Scanpoint Geomatics share price comes after the company’s recent announcement that it has been shortlisted for a project of the Indian armed forces.“We are pleased to inform all the stakeholders that Scanpoint Geomatics Limited (the Company) has successfully achieved a significant milestone by being shortlisted for a prestigious project of the Indian armed forces, specifically under the ‘MAKE - II’ and IDDM (Indian Design Development and Manufacturing) initiatives,” Scanpoint Geomatics said in a BSE filing on September 30.This project aims to promote indigenous design, development, and manufacturing capabilities for the armed forces, the company statement added.Meanwhile, in the quarter ended June 2024, Scanpoint Geomatics reported a sharp jump in its revenue and net profit. Scanpoint Geomatics Q1FY25 revenue spiked 416.83% to  ₹17.75 crore from  ₹3.43 crore in the year-ago quarter.The company’s net profit in the April-June quarter of FY25 jumped 104.48% to  ₹0.47 crore from  ₹0.23 crore, YoY.Scanpoint Geomatics share price gained over 14% in one month and more than 94% year-to-date (YTD). The penny stock has given more than 50% returns in the past one year.Scanpoint Geomatics stock hit a 52-week high of  ₹11.24 apiece on August 13, 2024, while it hit a 52-week low of  ₹3.76 apiece on March 06, 2024.At 11:30 am, Scanpoint Geomatics shares were trading 3.65% higher at  ₹9.95 apiece on the BSE.Read all stock market news here","cleaned_content":"scanpoint geomatics share price jumped over \u003cTHREE_PERCENT\u003e on friday extending its gaining streak for the fifth consecutive session scanpoint geomatics shares rose as much as \u003cTHREE_PERCENT\u003e to \u003cNINE_\u003e apiece on bse the small cap stock surged nearly \u003cONE_TEN_PERCENT\u003e in one week scanpoint geomatics is a bse listed small cap company in the it services and software company the five day rally in scanpoint geomatics share price comes after the company s recent announcement that it has been shortlisted for a project of the indian armed forces we are pleased to inform all the stakeholders that scanpoint geomatics limited the company has successfully achieved a significant milestone by being shortlisted for a prestigious project of the indian armed forces specifically under the make ii and iddm indian design development and manufacturing initiatives scanpoint geomatics said in a bse filing on september \u003cTHREE_TEN\u003e this project aims to promote indigenous design development and manufacturing capabilities for the armed forces the company statement added meanwhile in the quarter ended june \u003cTWO_THOUSAND\u003e scanpoint geomatics reported a sharp jump in its revenue and net profit scanpoint geomatics q1fy25 revenue spiked \u003cFOUR_HUNDRED_PERCENT\u003e to \u003cONE_TEN\u003e crore from \u003cTHREE_\u003e crore in the year ago quarter the company s net profit in the april june quarter of fy25 jumped \u003cONE_HUNDRED_PERCENT\u003e to \u003cZERO_\u003e crore from \u003cZERO_\u003e crore yoy scanpoint geomatics share price gained over \u003cONE_TEN_PERCENT\u003e in one month and more than \u003cNINE_TEN_PERCENT\u003e year to date ytd the penny stock has given more than \u003cFIVE_TEN_PERCENT\u003e returns in the past one year scanpoint geomatics stock hit a \u003cFIVE_TEN\u003e week high of \u003cONE_TEN\u003e apiece on august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e while it hit a \u003cFIVE_TEN\u003e week low of \u003cTHREE_\u003e apiece on march \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e am scanpoint geomatics shares were trading \u003cTHREE_PERCENT\u003e higher at \u003cNINE_\u003e apiece on the bse read all stock market news here","timestamp":"2024-10-04T11:34:00+05:30","market_timestamp":"2024-10-04T11:34:00+05:30","off_market_hours":false}