{"url":"https://www.livemint.com/market/stock-market-news/stock-to-buy-axis-securities-recommends-bajaj-finance-as-its-pick-of-the-week-sees-up-to-11-upside-11728972033552.html","title":"Stock to buy: Axis Securities recommends Bajaj Finance as its pick of the week; sees up to 11% upside","description":"Bajaj Finance stock price has fallen 6.5% in one month and over 3% year-to-date (YTD). The stock has declined nearly 12% in the past one year period.","content":"Stock to buy: Bajaj Finance share price declined over a percent on Tuesday, while the stock is down more than 6% in one month. The stock has failed to give positive returns this year so far. However, based on the company’s strong fundamentals, analysts expect Bajaj Finance shares to see decent upside going ahead.Axis Securities has named Bajaj Finance shares as its pick of the week. The brokerage has a ‘Buy’ rating on the stock and Bajaj Finance share price target of  ₹8,030 apiece, implying an upside of 11% from Monday’s closing price. The time horizon is six to nine months.In the first quarter of FY25, Bajaj Finance’s AUM growth was strong at 31% YoY and 7% QoQ, with growth healthy across segments. With the regulator lifting restrictions on both the digital lending products – ‘eCOM’ and ‘instaEMI’, the company went live offering the products across all platforms in mid-June 2024.“The momentum on these products is expected to improve over the next 3 quarters. While Bajaj Finance has been going slow in the rural B2C segment over the last 12-18 months with stress emerging, thus the company has trimmed its growth in the segment. However, the growth in the rural B2B remains healthy and Bajaj Finance could exit FY25 with healthy growth in the segment and a continued improving trend thereon,” Axis Securities said.On an overall portfolio, it expects Bajaj Finance to clock an AUM growth of 26-28% in FY25.In the quarter ended September 2024, net interest margins (NIM) are estimated to continue to face headwinds and margins are likely to stabilise from Q3FY25 onwards. The brokerage firm expects NIMs to settle between 9.5%-9.6% over FY25-27E versus 9.8% currently.It also expects credit cost to be contained at 1.75% - 1.85%, in-line with management guidance.Bajaj Finance stock price has fallen 6.5% in one month and over 3% year-to-date (YTD). The stock has declined nearly 12% in the past one year period.Bajaj Finance shares hit a 52-week high of  ₹8,162.00 apiece on October 17, 2023, and touched a 52-week low of  ₹6,190.00 apiece on March 06, 2024.At 11:40 Am, Bajaj Finance shares were trading 1.48% lower at  ₹7,103.20 apiece on the BSE.","cleaned_content":"stock to buy bajaj finance share price declined over a percent on tuesday while the stock is down more than \u003cSIX_PERCENT\u003e in one month the stock has failed to give positive returns this year so far however based on the company s strong fundamentals analysts expect bajaj finance shares to see decent upside going ahead axis securities has named bajaj finance shares as its pick of the week the brokerage has a buy rating on the stock and bajaj finance share price target of \u003cEIGHT_THOUSAND\u003e apiece implying an upside of \u003cONE_TEN_PERCENT\u003e from monday s closing price the time horizon is six to nine months in the first quarter of fy25 bajaj finance s aum growth was strong at \u003cTHREE_TEN_PERCENT\u003e yoy and \u003cSEVEN_PERCENT\u003e qoq with growth healthy across segments with the regulator lifting restrictions on both the digital lending products ecom and instaemi the company went live offering the products across all platforms in mid june \u003cTWO_THOUSAND\u003e the momentum on these products is expected to improve over the next \u003cTHREE_\u003e quarters while bajaj finance has been going slow in the rural b2c segment over the last \u003cONE_TEN\u003e \u003cONE_TEN\u003e months with stress emerging thus the company has trimmed its growth in the segment however the growth in the rural b2b remains healthy and bajaj finance could exit fy25 with healthy growth in the segment and a continued improving trend thereon axis securities said on an overall portfolio it expects bajaj finance to clock an aum growth of \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e in fy25 in the quarter ended september \u003cTWO_THOUSAND\u003e net interest margins nim are estimated to continue to face headwinds and margins are likely to stabilise from q3fy25 onwards the brokerage firm expects nims to settle between \u003cNINE_PERCENT\u003e \u003cNINE_PERCENT\u003e over fy25 \u003cTWO_TEN\u003e e versus \u003cNINE_PERCENT\u003e currently it also expects credit cost to be contained at \u003cONE_PERCENT\u003e \u003cONE_PERCENT\u003e in line with management guidance bajaj finance stock price has fallen \u003cSIX_PERCENT\u003e in one month and over \u003cTHREE_PERCENT\u003e year to date ytd the stock has declined nearly \u003cONE_TEN_PERCENT\u003e in the past one year period bajaj finance shares hit a \u003cFIVE_TEN\u003e week high of \u003cEIGHT_THOUSAND\u003e apiece on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and touched a \u003cFIVE_TEN\u003e week low of \u003cSIX_THOUSAND\u003e apiece on march \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e at \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e am bajaj finance shares were trading \u003cONE_PERCENT\u003e lower at \u003cSEVEN_THOUSAND\u003e apiece on the bse","timestamp":"2024-10-15T11:41:00+05:30","market_timestamp":"2024-10-15T11:41:00+05:30","off_market_hours":false}