{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-resume-upward-march-led-by-banking-it-heavyweights-11728904069165.html","title":"Stock market today: Nifty 50, Sensex resume upward march led by banking, IT heavyweights","description":"Stock market today: Indian stock market benchmarks- the Sensex and the Nifty 50- resumed their upward march on Monday, October 14.","content":"Stock market today: Thanks to gains in shares of select banking and IT heavyweights, including HDFC Bank and Infosys, Indian stock market benchmarks- the Sensex and the Nifty 50- resumed their upward march on Monday, October 14.A fall in crude oil prices influenced market sentiment. Brent crude futures fell over 2 per cent to $77.02 per barrel, while US West Texas Intermediate crude futures also fell 2.7 per cent to $73.52 per barrel.However, weak global cues capped gains. According to a Reuters report, China's broad economic stimulus promises at the weekend failed to inspire investors worldwide.The Sensex rose 592 points, or 0.73 per cent, to close at 81,973.05, while the Nifty 50 settled 164 points, or 0.66 per cent, higher at 25,127.95.Shares of Tech Mahindra, HDFC Bank, Larsen and Toubro, ITC and IndusInd Bank ended as the top gainers in the Sensex index. On the flip side, shares of Maruti Suzuki, Tata Steel, Bajaj Finance, Axis Bank and UltraTech Cement ended as the top losers in the index.The BSE Midcap and Smallcap indices closed 0.28 per cent and 0.06 per cent higher, respectively.As many as 249 stocks, including HCL Tech, Tech Mahindra, Persistent Systems, Trent and Divi's Labs, hit their fresh one-year highs in intraday trade on BSE.The overall market capitalisation of the BSE-listed stocks rose to nearly  ₹463.6 lakh crore from  ₹462.3 lakh crore in the previous session, making investors' wealth rise by about  ₹1.3 lakh crore in a single session.The advance-decline ratio slightly tilted towards gainers as out of 4,195 stocks traded on the BSE, 2,069 advanced while 1,972 declined.According to Ajit Mishra, SVP, Research, Religare Broking, traders will react to the results of heavyweights like Reliance Industries and HCL Tech in early Tuesday trades. A recovery in major banking stocks, along with continued strength in IT, could drive further gains. However, the Nifty faces resistance at the 25,300 level. Traders are advised to maintain a stock-specific approach and consider hedged strategies.On the technical front, Jatin Gedia, Technical Research Analyst at Sharekhan by BNP Paribas, pointed out that on the daily charts, the Nifty 50 has resumed its up move towards 25,500 after a brief three-day consolidation. The hourly momentum indicator has a positive crossover, which is a buy signal.\"We expect the positive momentum to continue over the next few trading sessions towards 25,234 – 25,360. The support base shifts higher towards 24,920. Bank Nifty broke out of a three-day consolidation on the upside and is now inching towards 52,500, which coincides with the 20-day average. Support base shifts higher towards 51,400 – 51,500,\" said Gedia.Read all market-related news here","cleaned_content":"stock market today thanks to gains in shares of select banking and it heavyweights including hdfc bank and infosys indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e resumed their upward march on monday october \u003cONE_TEN\u003e a fall in crude oil prices influenced market sentiment brent crude futures fell over \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e per barrel while us west texas intermediate crude futures also fell \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e per barrel however weak global cues capped gains according to a reuters report chinas broad economic stimulus promises at the weekend failed to inspire investors worldwide the sensex rose \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e shares of tech mahindra hdfc bank larsen and toubro itc and indusind bank ended as the top gainers in the sensex index on the flip side shares of maruti suzuki tata steel bajaj finance axis bank and ultratech cement ended as the top losers in the index the bse midcap and smallcap indices closed \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e higher respectively as many as \u003cTWO_HUNDRED\u003e stocks including hcl tech tech mahindra persistent systems trent and divis labs hit their fresh one year highs in intraday trade on bse the overall market capitalisation of the bse listed stocks rose to nearly \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors wealth rise by about \u003cONE_\u003e lakh crore in a single session the advance decline ratio slightly tilted towards gainers as out of \u003cFOUR_THOUSAND\u003e stocks traded on the bse \u003cTWO_THOUSAND\u003e advanced while \u003cONE_THOUSAND\u003e declined according to ajit mishra svp research religare broking traders will react to the results of heavyweights like reliance industries and hcl tech in early tuesday trades a recovery in major banking stocks along with continued strength in it could drive further gains however the nifty faces resistance at the \u003cTWO_TEN_THOUSAND\u003e level traders are advised to maintain a stock specific approach and consider hedged strategies on the technical front jatin gedia technical research analyst at sharekhan by bnp paribas pointed out that on the daily charts the nifty \u003cFIVE_TEN\u003e has resumed its up move towards \u003cTWO_TEN_THOUSAND\u003e after a brief three day consolidation the hourly momentum indicator has a positive crossover which is a buy signal we expect the positive momentum to continue over the next few trading sessions towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e the support base shifts higher towards \u003cTWO_TEN_THOUSAND\u003e bank nifty broke out of a three day consolidation on the upside and is now inching towards \u003cFIVE_TEN_THOUSAND\u003e which coincides with the \u003cTWO_TEN\u003e day average support base shifts higher towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e said gedia read all market related news here","timestamp":"2024-10-14T17:10:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}