{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-oct-4-11727972207437.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today — Oct 4","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today – JSW Steel, Polycab and Lal Path Lab– are technically placed to see a decent upside move","content":"Shares to buy or sell: The Indian stock market experienced a significant downturn, with the benchmark indices Sensex and Nifty 50 plunging by over 2 percent each, on Thursday. This decline was fueled by rising geopolitical tensions in the Middle East and unfavorable global signals. The broader market indices, including Nifty Midcap and Nifty Smallcap, also fell by more than 2 percent.“Nifty Index opened gap down below 25500 by almost 350 points and cascaded from the second hour of the trade. It fell to 25230 levels and closed with losses of around 550 points. It formed a Bearish candle on daily frame with longer upper shadow indicating pressure on the higher zones. It has been making lower highs lower lows from the last three sessions. Now till it holds below 25300 zones, more weakness could be seen towards 25100 then 24950 zones whereas hurdles are placed at 25350 then 25500 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Maximum Call OI is at 26000 then 27000 strike while Maximum Put OI is at 25000 then 24000 strike. Call writing is seen at 26000 then 25500 strike while Put writing is seen at 24000 then 25000 strike. Option data suggests a broader trading range in between 24800 to 25800 zones while an immediate range between 25000 to 25500 levels.On the Bank Nifty outlook, Taparia said, “Bank Nifty Index opened gap down by more than 600 points and remained under selling pressure throughout the session. It formed a Bearish candle on daily scale and is forming lower highs - lower lows from the last four sessions. Selling pressure was seen across banking space as the Index corrected by almost 2700 points in the last few days to close near its 50 DEMA. Now till it holds below 52222 zones weakness could be seen towards 51500 then 51250 levels while on the upside hurdle is seen at 52222 then 52350 zones.”Chandan Taparia has recommended three stocks to buy today, October 3. According to him, these stocks – JSW Steel, Polycab and Lal Path Lab– are technically placed to see a decent upmove.Stock is in a strong uptrend making higher highs-higher lows on the daily chart with noticeable volumes to support the uptrend. The ADX line is rising which suggest the up move has strength to support it.Stock has broken out of a consolidation zone with the recent candle being a large bodied bullish candle. The mechanical indicator RSI is positively placed which may support the ongoing up move.Price has surpassed from a double bottom pattern on the daily time frame with higher than average buying volumes to support the breakout. The MACD indicator has given a bullish crossover which may confirm the bullish momentum.","cleaned_content":"shares to buy or sell the indian stock market experienced a significant downturn with the benchmark indices sensex and nifty \u003cFIVE_TEN\u003e plunging by over \u003cTWO_PERCENT\u003e each on thursday this decline was fueled by rising geopolitical tensions in the middle east and unfavorable global signals the broader market indices including nifty midcap and nifty smallcap also fell by more than \u003cTWO_PERCENT\u003e nifty index opened gap down below \u003cTWO_TEN_THOUSAND\u003e by almost \u003cTHREE_HUNDRED\u003e points and cascaded from the second hour of the trade it fell to \u003cTWO_TEN_THOUSAND\u003e levels and closed with losses of around \u003cFIVE_HUNDRED\u003e points it formed a bearish candle on daily frame with longer upper shadow indicating pressure on the higher zones it has been making lower highs lower lows from the last three sessions now till it holds below \u003cTWO_TEN_THOUSAND\u003e zones more weakness could be seen towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas hurdles are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels on the bank nifty outlook taparia said bank nifty index opened gap down by more than \u003cSIX_HUNDRED\u003e points and remained under selling pressure throughout the session it formed a bearish candle on daily scale and is forming lower highs lower lows from the last four sessions selling pressure was seen across banking space as the index corrected by almost \u003cTWO_THOUSAND\u003e points in the last few days to close near its \u003cFIVE_TEN\u003e dema now till it holds below \u003cFIVE_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels while on the upside hurdle is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones chandan taparia has recommended three stocks to buy today october \u003cTHREE_\u003e according to him these stocks jsw steel polycab and lal path lab are technically placed to see a decent upmove stock is in a strong uptrend making higher highs higher lows on the daily chart with noticeable volumes to support the uptrend the adx line is rising which suggest the up move has strength to support it stock has broken out of a consolidation zone with the recent candle being a large bodied bullish candle the mechanical indicator rsi is positively placed which may support the ongoing up move price has surpassed from a double bottom pattern on the daily time frame with higher than average buying volumes to support the breakout the macd indicator has given a bullish crossover which may confirm the bullish momentum","timestamp":"2024-10-04T06:16:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}