{"url":"https://www.livemint.com/market/stock-market-news/smallcap-multibagger-stock-hi-tech-pipes-qip-opens-floor-price-other-details-of-rs-600-crore-offer-11728378547989.html","title":"Small-cap multibagger stock: Hi-Tech Pipes QIP opens. Floor price, other details of  ₹600 crore offer","description":"Multibagger stock: Hi-Tech Pipes has launched QIP at a floor price of  ₹194.98 apiece, 2060% lower than the current Hi-Tech Pipes share price","content":"Hi-Tech Pipes news: The steel pipes maker company Hi-Tech Pipes Limited launched its Qualified Institutional Placement (QIP) worth  ₹600 crore on Monday, 7th September 2024. Hi-Tech Pipes QIP was launched at a floor price of  ₹194.98 apiece, around 2.60% lower than the current Hi-Tech Pipes share price of  ₹200 per share. In an exchange filing on Monday, the small-cap multibagger stock informed us about the launch of the QIP offer at a floor price of  ₹194.98 apiece. The company board had already approved the QIP proposal not exceeding  ₹600 crore in its meeting on 19th August 2024.The small-cap stock informed the Indian stock market about the QIP launch saying, \"We wish to inform you that subsequent to the approval accorded by the Board of Directors of the Company (the \"Board\"), at its meeting held on August 19, 2024, and the special resolution passed by the shareholders' of the Company in the fortieth Annual General Meeting held on September 21, 2024, the Fund Raising Committee (the \"Committee\") has, at its meeting held today i.e. October 7, 2024, inter alia, passed resolutions for the following: a) Approved and adopted the preliminary placement document dated October 7, 2024, together with the application form in connection with the Issue (\"Preliminary Placement Document\"); b) Authorized the opening of the Issue today, i.e. October 7, 2024; and c) Approved the floor price for the Issue, being  ₹194.98 per Equity Share (\"Floor Price\"), based on the pricing formula as prescribed under Regulation 176 of the SEBI ICDR Regulations.\"On Hi-Tech Pipes date, the multibagger stock said, \"We further wish to inform you that the 'relevant date' for the purpose of the Issue, in terms of Regulation 171(b (i) of the SEBI ICDR Regulations, is October 07, 2024, and accordingly the Floor Price in respect of the aforesaid Issue, being  ₹194.98 per Equity Share, has been determined based on the pricing formula as prescribed under Regulation 176(1) of the SEBI ICDR Regulations.\"Pursuant to Regulation 176(1) of the SEBI ICDR Regulations and with the approval of the Company's shareholders accorded through a special resolution passed in the fortieth AGM held on September 21, 2024, the Company may, at its discretion, offer a discount of not more than 5% on the floor price for the Issue. The company will determine the issue price in consultation with the book-running lead manager appointed to deal with the Issue.AT 2:26 PM, Hi-Tech Pipes's share price oscillated around  ₹200 per share. The small-cap stock is one of the multibagger stocks the Indian stock market has delivered in recent years. This small-cap stock has risen nearly 70% in YTD, 135% in one year, and 1,200% in five years.Last week, on October 3rd, 2024, Hi-Tech Pipes Limited announced impressive sales volume results for the second quarter and first half of the fiscal year 2025, ending 30 September 2024. The company reported sales volumes of 123,027 MT for Q2 FY25, representing a remarkable 22.50% year-on-year (YoY) growth. For the first half of FY25, sales volumes reached 245,182 MT, reflecting an outstanding 32.55% YoY increase.","cleaned_content":"hi tech pipes news the steel pipes maker company hi tech pipes limited launched its qualified institutional placement qip worth \u003cSIX_HUNDRED\u003e crore on monday \u003cSEVEN_\u003e th september \u003cTWO_THOUSAND\u003e hi tech pipes qip was launched at a floor price of \u003cONE_HUNDRED\u003e apiece around \u003cTWO_PERCENT\u003e lower than the current hi tech pipes share price of \u003cTWO_HUNDRED\u003e per share in an exchange filing on monday the small cap multibagger stock informed us about the launch of the qip offer at a floor price of \u003cONE_HUNDRED\u003e apiece the company board had already approved the qip proposal not exceeding \u003cSIX_HUNDRED\u003e crore in its meeting on \u003cONE_TEN\u003e th august \u003cTWO_THOUSAND\u003e the small cap stock informed the indian stock market about the qip launch saying we wish to inform you that subsequent to the approval accorded by the board of directors of the company the board at its meeting held on august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and the special resolution passed by the shareholders of the company in the fortieth annual general meeting held on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the fund raising committee the committee has at its meeting held today i e october \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e inter alia passed resolutions for the following a approved and adopted the preliminary placement document dated october \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e together with the application form in connection with the issue preliminary placement document b authorized the opening of the issue today i e october \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e and c approved the floor price for the issue being \u003cONE_HUNDRED\u003e per equity share floor price based on the pricing formula as prescribed under regulation \u003cONE_HUNDRED\u003e of the sebi icdr regulations on hi tech pipes date the multibagger stock said we further wish to inform you that the relevant date for the purpose of the issue in terms of regulation \u003cONE_HUNDRED\u003e b i of the sebi icdr regulations is october \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e and accordingly the floor price in respect of the aforesaid issue being \u003cONE_HUNDRED\u003e per equity share has been determined based on the pricing formula as prescribed under regulation \u003cONE_HUNDRED\u003e \u003cONE_\u003e of the sebi icdr regulations pursuant to regulation \u003cONE_HUNDRED\u003e \u003cONE_\u003e of the sebi icdr regulations and with the approval of the companys shareholders accorded through a special resolution passed in the fortieth agm held on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company may at its discretion offer a discount of not more than \u003cFIVE_PERCENT\u003e on the floor price for the issue the company will determine the issue price in consultation with the book running lead manager appointed to deal with the issue at \u003cTWO_\u003e \u003cTWO_TEN\u003e pm hi tech pipess share price oscillated around \u003cTWO_HUNDRED\u003e per share the small cap stock is one of the multibagger stocks the indian stock market has delivered in recent years this small cap stock has risen nearly \u003cSEVEN_TEN_PERCENT\u003e in ytd \u003cONE_HUNDRED_PERCENT\u003e in one year and \u003cONE_THOUSAND_PERCENT\u003e in five years last week on october \u003cTHREE_\u003e rd \u003cTWO_THOUSAND\u003e hi tech pipes limited announced impressive sales volume results for the second quarter and first half of the fiscal year \u003cTWO_THOUSAND\u003e ending \u003cTHREE_TEN\u003e september \u003cTWO_THOUSAND\u003e the company reported sales volumes of \u003cONE_HUNDRED_THOUSAND\u003e mt for q2 fy25 representing a remarkable \u003cTWO_TEN_PERCENT\u003e year on year yoy growth for the first half of fy25 sales volumes reached \u003cTWO_HUNDRED_THOUSAND\u003e mt reflecting an outstanding \u003cTHREE_TEN_PERCENT\u003e yoy increase","timestamp":"2024-10-08T14:55:00+05:30","market_timestamp":"2024-10-08T14:55:00+05:30","off_market_hours":false}