{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-50-close-flat-for-second-day-banks-shine-11728553435275.html","title":"Stock market today: Sensex, Nifty 50 close flat for second day; banks shine","description":"The Nifty 50 closed the session with a gain of 0.07%, finishing below the 25,000 mark at 24,998. Similarly, the Sensex wrapped up the day with a 0.18% gain, settling at 81,611.","content":"The Indian market closed on a lacklustre note for the second session on Thursday, October 10, despite strong cues from global and Asian peers. Selling pressure in IT and pharma stocks kept the frontline indices near their previous day's levels.Banking stocks, on the other hand, posted notable gains during the session, as experts believed a sector rotation was underway from the pharma and IT sectors to banking. However, the significant rise in bank heavyweights failed to lift the indices higher. Consequently, the Nifty 50 closed the session with a gain of 0.07%, finishing below the 25,000 mark at 24,998. Similarly, the Sensex wrapped up the day with a 0.18% gain, settling at 81,611.Among the sectoral indices, the Nifty Private Bank index closed the session up by 1.59%, followed by the Nifty PSE, up 0.71% and the Nifty Metal, up 0.4%. Conversely, the Nifty Pharma index declined by 2.01%, while the Nifty IT index dropped by 1.25%. Additionally, the Nifty FMCG ended the trading day with a decrease of 0.45%.Out of the 50 constituents in the Nifty index, 23 closed in the positive territory, with Kotak Mahindra Bank leading the way, with a 4.2% rise. Other notable performers included HDFC Bank, Bharat Electronics, IndusInd Bank, Maruti Suzuki, Tech Mahindra, Power Grid Corp, M\u0026M, JSW Steel, NTPC and Axis Bank, all of which finished today's session with gains exceeding 1%.Mid and small-cap stocks displayed a mixed performance during the session. The Nifty Midcap 100 index closed 0.30% lower at 58,935 while the Nifty Smallcap 100 index finished in the positive territory, gaining 0.19% to end at 18,900.Commenting on today's market performance, Vinod Nair, Head of Research, Geojit Financial Services, said \"The market traded on a range-bound trend with a negative bias ahead of the start of Q2 result. The Asian market started well but could not hold on to the gains as European markets waved on a negative trend in anticipation of the key US inflation data and rising global bond yields. Domestic broader market momentum was mixed with caution as the initial expectation of Q2FY25 results is subdued due to a subpar momentum in the global and rural demand.\"The U.S. Consumer Price Index (CPI) for September is set to be released today. According to economists polled by Reuters, core inflation is expected to hold steady at a year-on-year rate of 3.2%.Meanwhile, Chinese stocks resumed their upward momentum in today's session after a significant decline on Wednesday, which was prompted by investor concerns over the lack of details in the stimulus package. This renewed rally followed the Chinese central bank's launch of a 500-billion-yuan facility aimed at boosting capital markets.China's blue-chip CSI300 index closed the session up by 1%, while Hong Kong's Hang Seng index soared over 3%. In September last week, the People's Bank of China (PBOC) unveiled two new measures to support the capital market, including a swap program designed to facilitate easier access to funding for funds, insurers, and brokers to purchase stocks.Most Tata Group stocks finished the session in the green, including Tata Investment Corporation, Tata Teleservices (Maharashtra), Tata Chemicals, Tata Elxsi, Tata Technologies, Tata Power Company, Tejas Networks, Tata Steel, Nelco, and Indian Hotels. These stocks recorded gains ranging from 1% to 6%.The whole country is paying tribute to the legendary Ratan Tata, who played a pivotal role in shaping one of India’s oldest conglomerates into a global empire through a series of visionary and eye-catching deals.Ratan Tata, who passed away on Wednesday at the age of 86, was not only a business leader but also a symbol of innovation and philanthropy.","cleaned_content":"the indian market closed on a lacklustre note for the second session on thursday october \u003cONE_TEN\u003e despite strong cues from global and asian peers selling pressure in it and pharma stocks kept the frontline indices near their previous days levels banking stocks on the other hand posted notable gains during the session as experts believed a sector rotation was underway from the pharma and it sectors to banking however the significant rise in bank heavyweights failed to lift the indices higher consequently the nifty \u003cFIVE_TEN\u003e closed the session with a gain of \u003cZERO_PERCENT\u003e finishing below the \u003cTWO_TEN_THOUSAND\u003e mark at \u003cTWO_TEN_THOUSAND\u003e similarly the sensex wrapped up the day with a \u003cZERO_PERCENT\u003e gain settling at \u003cEIGHT_TEN_THOUSAND\u003e among the sectoral indices the nifty private bank index closed the session up by \u003cONE_PERCENT\u003e followed by the nifty pse up \u003cZERO_PERCENT\u003e and the nifty metal up \u003cZERO_PERCENT\u003e conversely the nifty pharma index declined by \u003cTWO_PERCENT\u003e while the nifty it index dropped by \u003cONE_PERCENT\u003e additionally the nifty fmcg ended the trading day with a decrease of \u003cZERO_PERCENT\u003e out of the \u003cFIVE_TEN\u003e constituents in the nifty index \u003cTWO_TEN\u003e closed in the positive territory with kotak mahindra bank leading the way with a \u003cFOUR_PERCENT\u003e rise other notable performers included hdfc bank bharat electronics indusind bank maruti suzuki tech mahindra power grid corp m m jsw steel ntpc and axis bank all of which finished todays session with gains exceeding \u003cONE_PERCENT\u003e mid and small cap stocks displayed a mixed performance during the session the nifty midcap \u003cONE_HUNDRED\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e while the nifty smallcap \u003cONE_HUNDRED\u003e index finished in the positive territory gaining \u003cZERO_PERCENT\u003e to end at \u003cONE_TEN_THOUSAND\u003e commenting on todays market performance vinod nair head of research geojit financial services said the market traded on a range bound trend with a negative bias ahead of the start of q2 result the asian market started well but could not hold on to the gains as european markets waved on a negative trend in anticipation of the key us inflation data and rising global bond yields domestic broader market momentum was mixed with caution as the initial expectation of q2fy25 results is subdued due to a subpar momentum in the global and rural demand the u s consumer price index cpi for september is set to be released today according to economists polled by reuters core inflation is expected to hold steady at a year on year rate of \u003cTHREE_PERCENT\u003e meanwhile chinese stocks resumed their upward momentum in todays session after a significant decline on wednesday which was prompted by investor concerns over the lack of details in the stimulus package this renewed rally followed the chinese central banks launch of a \u003cFIVE_HUNDRED\u003e billion yuan facility aimed at boosting capital markets chinas blue chip csi300 index closed the session up by \u003cONE_PERCENT\u003e while hong kongs hang seng index soared over \u003cTHREE_PERCENT\u003e in september last week the peoples bank of china pboc unveiled two new measures to support the capital market including a swap program designed to facilitate easier access to funding for funds insurers and brokers to purchase stocks most tata group stocks finished the session in the green including tata investment corporation tata teleservices maharashtra tata chemicals tata elxsi tata technologies tata power company tejas networks tata steel nelco and indian hotels these stocks recorded gains ranging from \u003cONE_PERCENT\u003e to \u003cSIX_PERCENT\u003e the whole country is paying tribute to the legendary ratan tata who played a pivotal role in shaping one of india s oldest conglomerates into a global empire through a series of visionary and eye catching deals ratan tata who passed away on wednesday at the age of \u003cEIGHT_TEN\u003e was not only a business leader but also a symbol of innovation and philanthropy","timestamp":"2024-10-10T15:36:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}