{"url":"https://www.livemint.com/market/stock-market-news/saj-hotels-shares-make-a-weak-debut-list-with-15-4-discount-at-rs-55-on-nse-sme-11728276101928.html","title":"Saj Hotels shares make a weak debut, list with 15.4% discount at  ₹55 on NSE SME","description":"Saj Hotels debuted poorly on the stock market, with shares opening at  ₹55, a 15.4% discount to the  ₹65 issue price. The company is engaged in the hospitality industry. It offers a range of accommodation options across various destinations, each tailored to provide comfort and convenience.","content":"Saj Hotels had a disappointing debut in the stock market today, October 7, as its shares opened on the NSE SME at  ₹55 each, reflecting a 15.4% discount to the issue price of  ₹65 per share. The IPO, which was open for subscription from September 27 to October 1, 2024, garnered a lackluster response.Although the IPO was subscribed 5 times, the overall subscription levels were significantly lower compared to other recent SME IPOs, which received a much more enthusiastic reaction from investors.The IPO consisted entirely of a fresh issue of 42.5 lakh newly issued shares, without any offer-for-sale component.The company intends to utilize the funds raised for various purposes, including capital expenditure requirements for the expansion of existing resort properties, funding working capital needs, and covering general corporate expenses.The company is engaged in the hospitality industry. It provides a diverse portfolio of business-to-business (B2B), business-to-customer (B2B2C), and business-to-customer (B2C) hospitality offerings, spanning from traditional resort accommodation to villa rentals and restaurant and bar properties.The company focuses on providing comprehensive services to guests, including food and beverage options, recreational facilities, and event hosting capabilities, reflecting a commitment to ensuring a memorable experience for our visitors.It offers a range of accommodation options across various destinations, each tailored to provide comfort and convenience. The company resorts have well-appointed rooms and suites, complemented by a variety of dining venues, including restaurants, bars, and in-room dining services.The company, in its DRHP report, said that its resorts serve as versatile event venues, equipped to host a wide array of gatherings, including conferences, weddings, and social events. With comprehensive event planning and management services, the company said it ensures seamless execution and unforgettable experiences for its clients.The company manages its resorts using a combination of methods. Firstly, it directly owns and manages resort properties situated on freehold or leasehold land and buildings that are owned by the company. Secondly, it has developed resort and restaurant properties that are leased to various third-party operators under operation and management agreements on a contractual basis, the DRHP report showed.","cleaned_content":"saj hotels had a disappointing debut in the stock market today october \u003cSEVEN_\u003e as its shares opened on the nse sme at \u003cFIVE_TEN\u003e each reflecting a \u003cONE_TEN_PERCENT\u003e discount to the issue price of \u003cSIX_TEN\u003e per share the ipo which was open for subscription from september \u003cTWO_TEN\u003e to october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e garnered a lackluster response although the ipo was subscribed \u003cFIVE_\u003e times the overall subscription levels were significantly lower compared to other recent sme ipos which received a much more enthusiastic reaction from investors the ipo consisted entirely of a fresh issue of \u003cFOUR_TEN\u003e lakh newly issued shares without any offer for sale component the company intends to utilize the funds raised for various purposes including capital expenditure requirements for the expansion of existing resort properties funding working capital needs and covering general corporate expenses the company is engaged in the hospitality industry it provides a diverse portfolio of business to business b2b business to customer b2b2c and business to customer b2c hospitality offerings spanning from traditional resort accommodation to villa rentals and restaurant and bar properties the company focuses on providing comprehensive services to guests including food and beverage options recreational facilities and event hosting capabilities reflecting a commitment to ensuring a memorable experience for our visitors it offers a range of accommodation options across various destinations each tailored to provide comfort and convenience the company resorts have well appointed rooms and suites complemented by a variety of dining venues including restaurants bars and in room dining services the company in its drhp report said that its resorts serve as versatile event venues equipped to host a wide array of gatherings including conferences weddings and social events with comprehensive event planning and management services the company said it ensures seamless execution and unforgettable experiences for its clients the company manages its resorts using a combination of methods firstly it directly owns and manages resort properties situated on freehold or leasehold land and buildings that are owned by the company secondly it has developed resort and restaurant properties that are leased to various third party operators under operation and management agreements on a contractual basis the drhp report showed","timestamp":"2024-10-07T10:35:00+05:30","market_timestamp":"2024-10-07T10:35:00+05:30","off_market_hours":false}