{"url":"https://www.livemint.com/market/stock-market-news/pnc-infratech-share-price-rises-6-receives-letter-of-acceptance-for-rs-2040-crore-cidco-project-11728882044886.html","title":"PNC Infratech share price rises 6% as company receives letter of acceptance from CIDCO for  ₹2,040 crore project","description":"Stock Market Today: PNC Infratech share price gained up to 6% in morning trades on Monday. The company announced receiving a Letter of Acceptance for  ₹2040 crore EPC project from the City \u0026 Industrial Development Corporation of Maharashtra Ltd. (CIDCO).","content":"Stock Market Today: PNC Infratech share price gained 6% in morning trade on Monday, October 14, after the company announced receipt of a Letter of Acceptance (LOA) for  ₹2,040 crore EPC project from City \u0026 Industrial Development Corporation of Maharashtra (CIDCO).PNC Infratech share price opened at  ₹455.10 on the BSE on Monday, almost 3% higher than the previous close of  ₹440.60. The stock extended gains, rising over 6% to the high of  ₹467.75.PNC Infratech announced having received a Letter of Acceptance dated 10.10.2024 from CIDCO for a project. The company has won the Engineering, Procurement and Construction (EPC) on item rate percentage jointly with Aakshya Infra Projects Pvt Ltd.The project is for integrated infrastructure development of 20 million and above wide roads, construction of various major \u0026 minor structures (viz flyover, minor bridges, VUPS, PUPS etc.) and allied electrical works (Street Light) in TPS -8, 9 and TPS-12 under NAINA Project.The completion period for the project is 1,460 days (including monsoon) while the contract amount is  ₹2,039.61 crore, exclusive of GST.Analysts are positive on PNC Infratech stock. The company remains among the top three picks of Elara Securities India. As per Elara stable execution and gradual pick up in order inflows remain positive for infrastructure developers.Order inflows for infrastructure developers had remained soft in Q1 on account of the general elections. However, they picked up, with the Ministry of Road Transport and Highway (MoRTH) awarding orders of 1,152 km up to August 2024 versus 95 km in Q1FY25, as per analyst data. Although year-on-year, awarding was down 34% majorly on lower awarding in Q1. Pickup in the awarding benefits highway developers, such as PNC Infratech among others as per analysts.Rising order inflows improve the revenue visibility of companies such as PNC Infratech.With the current average book-to-bill ratio at 2x, the execution pace is likely to increase post-awarding of large L1 orders for companies like PNC Infratech ( ₹5,300 crore) among others, as per Elara Securities. Also, expeditions in the process of land acquisition are likely to result in faster receipt of appointed dates, they added.","cleaned_content":"stock market today pnc infratech share price gained \u003cSIX_PERCENT\u003e in morning trade on monday october \u003cONE_TEN\u003e after the company announced receipt of a letter of acceptance loa for \u003cTWO_THOUSAND\u003e crore epc project from city industrial development corporation of maharashtra cidco pnc infratech share price opened at \u003cFOUR_HUNDRED\u003e on the bse on monday almost \u003cTHREE_PERCENT\u003e higher than the previous close of \u003cFOUR_HUNDRED\u003e the stock extended gains rising over \u003cSIX_PERCENT\u003e to the high of \u003cFOUR_HUNDRED\u003e pnc infratech announced having received a letter of acceptance dated \u003cONE_TEN\u003e 2024 from cidco for a project the company has won the engineering procurement and construction epc on item rate percentage jointly with aakshya infra projects pvt ltd the project is for integrated infrastructure development of \u003cTWO_TEN\u003e million and above wide roads construction of various major minor structures viz flyover minor bridges vups pups etc and allied electrical works street light in tps \u003cEIGHT_\u003e \u003cNINE_\u003e and tps \u003cONE_TEN\u003e under naina project the completion period for the project is \u003cONE_THOUSAND\u003e days including monsoon while the contract amount is \u003cTWO_THOUSAND\u003e crore exclusive of gst analysts are positive on pnc infratech stock the company remains among the top three picks of elara securities india as per elara stable execution and gradual pick up in order inflows remain positive for infrastructure developers order inflows for infrastructure developers had remained soft in q1 on account of the general elections however they picked up with the ministry of road transport and highway morth awarding orders of \u003cONE_THOUSAND\u003e km up to august \u003cTWO_THOUSAND\u003e versus \u003cNINE_TEN\u003e km in q1fy25 as per analyst data although year on year awarding was down \u003cTHREE_TEN_PERCENT\u003e majorly on lower awarding in q1 pickup in the awarding benefits highway developers such as pnc infratech among others as per analysts rising order inflows improve the revenue visibility of companies such as pnc infratech with the current average book to bill ratio at \u003cTWO_\u003e x the execution pace is likely to increase post awarding of large l1 orders for companies like pnc infratech \u003cFIVE_THOUSAND\u003e crore among others as per elara securities also expeditions in the process of land acquisition are likely to result in faster receipt of appointed dates they added","timestamp":"2024-10-14T11:09:00+05:30","market_timestamp":"2024-10-14T11:09:00+05:30","off_market_hours":false}