{"url":"https://www.livemint.com/market/stock-market-news/tcs-infosys-to-tech-mahindra-is-it-opportune-to-buy-it-stocks-amid-us-fed-rate-cut-buzz-11728703263013.html","title":"TCS, Infosys to Tech Mahindra: Is it opportune to buy IT stocks amid US Fed rate cut buzz?","description":"IT stocks to buy: Amid US Fed rate cut buzz, experts have recommended four shares to buy on Monday — Infosys, Tech Mahindra, KPIT Technologies, and Persistent Systems","content":"IT stocks to buy: Amid ease in the US inflation concerns after the US CPI data released on Thursday last week, the market expects a US Fed rate cut announcement in the Federal Reserve's meeting scheduled next month. As these developments are expected to pressure the US dollar (USD) rates, the Indian IT companies who deal in the USD are expected to benefit and report better quarterly numbers in upcoming quarters. Thus, it is crucial to know whether buying IT stocks is a wise decision or not.According to stock market experts, the US Fed rate cut will positively impact Indian IT companies. The interest rate cut will fuel IT spending, leading to more business for Indian IT companies operating in the US. The cost of funding for IT companies will also come down in the wake of the lower interest rate regime.On how the US Fed rate cut would benefit Indian IT companies, Dr. Ravi Singh, SVP — Retail Research at Religare Broking, said, \"A good time might be ahead to buy IT stocks as it creates a buzz about potential US Fed rate cuts. Rate cuts generally weaken the dollar, which traditionally has been beneficial for Indian IT companies with significant exposure in the U.S., as this would fetch higher earnings in dollar terms. Lower interest rates also remain positive for business investment in technology, increasing demand for IT services.\" He advised investors to invest in strong IT stocks for long-term value.\"Historically, rate cut cycles have often signalled an economic slowdown, reducing demand for IT services exports. However, this time could be different. We believe Indian IT firms may not face the same recessionary pressures as seen in previous cycles,\" said Anshul Jain, Head of Research at Lakshmishree Investment and Securities,\" adding, \"A rate cut could also lower the cost of equity, leading to higher price-to-earnings ratios (PER) for major players in the sector. While stock prices have already shown some positive movement, the full impact of reduced interest rates may take time to unfold.\"Regarding IT stocks to buy in the wake of US Fed rate cut buzz, Anshul Jain of Lkshmishree Investment and Securities said, “Investors are advised to keep an eye on large-cap IT stocks like Infosys and Tech Mahindra, as well as mid-caps such as Persistent Systems and KPIT Technologies.”","cleaned_content":"it stocks to buy amid ease in the us inflation concerns after the us cpi data released on thursday last week the market expects a us fed rate cut announcement in the federal reserves meeting scheduled next month as these developments are expected to pressure the us dollar usd rates the indian it companies who deal in the usd are expected to benefit and report better quarterly numbers in upcoming quarters thus it is crucial to know whether buying it stocks is a wise decision or not according to stock market experts the us fed rate cut will positively impact indian it companies the interest rate cut will fuel it spending leading to more business for indian it companies operating in the us the cost of funding for it companies will also come down in the wake of the lower interest rate regime on how the us fed rate cut would benefit indian it companies dr ravi singh svp retail research at religare broking said a good time might be ahead to buy it stocks as it creates a buzz about potential us fed rate cuts rate cuts generally weaken the dollar which traditionally has been beneficial for indian it companies with significant exposure in the u s as this would fetch higher earnings in dollar terms lower interest rates also remain positive for business investment in technology increasing demand for it services he advised investors to invest in strong it stocks for long term value historically rate cut cycles have often signalled an economic slowdown reducing demand for it services exports however this time could be different we believe indian it firms may not face the same recessionary pressures as seen in previous cycles said anshul jain head of research at lakshmishree investment and securities adding a rate cut could also lower the cost of equity leading to higher price to earnings ratios per for major players in the sector while stock prices have already shown some positive movement the full impact of reduced interest rates may take time to unfold regarding it stocks to buy in the wake of us fed rate cut buzz anshul jain of lkshmishree investment and securities said investors are advised to keep an eye on large cap it stocks like infosys and tech mahindra as well as mid caps such as persistent systems and kpit technologies","timestamp":"2024-10-12T09:27:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}