{"url":"https://www.livemint.com/market/stock-market-news/guesses-about-bitcoin-creator-s-identity-stir-up-memecoin-market-11728318794771.html","title":"Guesses About Bitcoin Creator’s Identity Stir Up Memecoin Market","description":"A new HBO documentary about the creation of Bitcoin has captivated the digital-asset community, with speculators creating dozens of memecoins in hopes of profiting off of the potential revelation of the identity of the original cryptocurrency’s inventor.","content":"A new HBO documentary about the creation of Bitcoin has captivated the digital-asset community, with speculators creating dozens of memecoins in hopes of profiting off of the potential revelation of the identity of the original cryptocurrency’s inventor.The tokens being created all contain some reference to a man named Len Sassaman, a cryptographer who passed away in 2011 and is considered by many to be the person who will be named as the true identity of pseudonymous Bitcoin creator Satoshi Nakamoto in HBO’s upcoming Money Electric: The Bitcoin Mystery. Blockchain-based betting platform Polymarket shows that Sassaman is the leading candidate, though the implied probability that he is Satoshi has dropped on the site to 21% from as high as 68% on Oct. 3.Memecoins are cryptocurrencies without any utility that have become especially popular in the past year, as blockchains like Solana make it much cheaper to create and trade the tokens. Pump.fun, a platform with a design similar to the anonymous social media platform 4chan, has all but eliminated the technical complexities involved in creating a memecoin. Anyone can to go to Pump.fun and make a memecoin in a few seconds. Some traders have even created tokens related to Sassaman’s cat Sasha.“Memecoins are acting like decentralized prediction markets, with many variations of a single theme popping up around emerging topics,” said Ben Yorke, vice president of ecosystem at crypto exchange WOO X. “Unfortunately, this creates a negative-sum environment, where insiders and influencers profit by steering trends they control. On the other hand, everyday investors struggle to correctly guess the trend even as they struggle to identify the real token that’s representing the trend.”The late Sassaman’s wife Meredith Patterson has denied in the past that he was the creator of Bitcoin. Still, the memecoin craze around Sassaman has gotten so popular that Patterson posted on social media platform X on Oct. 5 that some people were sending her memecoins that honor her cat.“Right, so, me not knowing really anything about the world of memecoins, I apparently sent a few DMers a Coinbase address,” she wrote. “But if people are insisting on sending me memecoins about my cat, I’m not gonna say no.”Bitcoin was created by an anonymous person or group who used the pseudonym Satoshi Nakamoto and published the technical paper outlining the concept in late 2008. The creation of Bitcoin was inspired by the 2008 global financial crisis with the aim of establishing a decentralized digital currency system that can be operated without any intermediaries.There have been many previous efforts to reveal Nakamoto’s real identity, including a piece in Newsweek a few years ago that claimed Dorian Nakamoto created Bitcoin. The Japanese-American engineer denied his connections to Bitcoin.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"a new hbo documentary about the creation of bitcoin has captivated the digital asset community with speculators creating dozens of memecoins in hopes of profiting off of the potential revelation of the identity of the original cryptocurrency s inventor the tokens being created all contain some reference to a man named len sassaman a cryptographer who passed away in \u003cTWO_THOUSAND\u003e and is considered by many to be the person who will be named as the true identity of pseudonymous bitcoin creator satoshi nakamoto in hbo s upcoming money electric the bitcoin mystery blockchain based betting platform polymarket shows that sassaman is the leading candidate though the implied probability that he is satoshi has dropped on the site to \u003cTWO_TEN_PERCENT\u003e from as high as \u003cSIX_TEN_PERCENT\u003e on oct \u003cTHREE_\u003e memecoins are cryptocurrencies without any utility that have become especially popular in the past year as blockchains like solana make it much cheaper to create and trade the tokens pump fun a platform with a design similar to the anonymous social media platform \u003cFOUR_\u003e chan has all but eliminated the technical complexities involved in creating a memecoin anyone can to go to pump fun and make a memecoin in a few seconds some traders have even created tokens related to sassaman s cat sasha memecoins are acting like decentralized prediction markets with many variations of a single theme popping up around emerging topics said ben yorke vice president of ecosystem at crypto exchange woo x unfortunately this creates a negative sum environment where insiders and influencers profit by steering trends they control on the other hand everyday investors struggle to correctly guess the trend even as they struggle to identify the real token that s representing the trend the late sassaman s wife meredith patterson has denied in the past that he was the creator of bitcoin still the memecoin craze around sassaman has gotten so popular that patterson posted on social media platform x on oct \u003cFIVE_\u003e that some people were sending her memecoins that honor her cat right so me not knowing really anything about the world of memecoins i apparently sent a few dmers a coinbase address she wrote but if people are insisting on sending me memecoins about my cat i m not gonna say no bitcoin was created by an anonymous person or group who used the pseudonym satoshi nakamoto and published the technical paper outlining the concept in late \u003cTWO_THOUSAND\u003e the creation of bitcoin was inspired by the \u003cTWO_THOUSAND\u003e global financial crisis with the aim of establishing a decentralized digital currency system that can be operated without any intermediaries there have been many previous efforts to reveal nakamoto s real identity including a piece in newsweek a few years ago that claimed dorian nakamoto created bitcoin the japanese american engineer denied his connections to bitcoin this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-07T22:03:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}