{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-15-11728925371488.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 15","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy today — Indusind Bank, Tejas Networks, and Marksans Pharma.","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, resumed their upward trend fueled by the shares of select IT and banking heavyweights, including Infosys and HDFC Bank. The Nifty 50 index closed 0.66 per cent higher at 25,127.95 points after Monday's trading session, compared to 24,964.25 points at its previous market close.The BSE Sensex index closed 0.73 per cent higher at 81,973.05 points, compared to 81,381.36 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty, after consolidating near the 25,000 zone for a while has shown a positive candle formation moving above the zone at 25,050 levels to improve the bias with the frontline stocks picking up. Parekh estimates the Nifty 50 Spot index to find support at 25,000 points and face resistance at 25,300 points. The Bank Nifty index will likely move in a range of 51,400 to 52,600 today.For today, Parekh recommended three buy-or-sell stocks: Indusind Bank Ltd, Tejas Networks Ltd, and Marksans Pharma Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty after consolidating near the 25,000 zone for quite some time has indicated a positive candle formation moving above the significant 50EMA zone at 25,050 levels to improve the bias with some of the frontline stocks picking up.”“The index would need a decisive breach above the 25,300 zone to establish some conviction and stability, as of now, to carry on with the positive move further ahead,” said the stock market expert.“Bank Nifty has indicated a decent pullback to close just above the important 50EMA level at 51750 with bias getting better and heavyweight banking stocks like HDFC Bank and Kotak Bank looking technically good to anticipate for further rise. The index would have the near-term support of 51000 level which needs to be sustained to maintain the bias intact,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 25,000 points, while the resistance lies at 25,300 points. The Bank Nifty index would have a daily range of 51,400 to 52,600.1. Indusind Bank Ltd. (INDUSINDBK): Buy at  ₹1,368; Target at  ₹1,400; Stop Loss at  ₹1,345.2. Tejas Networks Ltd. (TEJASNET): Buy at  ₹1,210; Target at  ₹1,250; Stop Loss at  ₹1,190.3. Marksans Pharma Ltd. (MARKSANS): Buy at  ₹297; Target at  ₹315; Stop Loss at  ₹288.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e resumed their upward trend fueled by the shares of select it and banking heavyweights including infosys and hdfc bank the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e points after mondays trading session compared to \u003cTWO_TEN_THOUSAND\u003e points at its previous market close the bse sensex index closed \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e points compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty after consolidating near the \u003cTWO_TEN_THOUSAND\u003e zone for a while has shown a positive candle formation moving above the zone at \u003cTWO_TEN_THOUSAND\u003e levels to improve the bias with the frontline stocks picking up parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks indusind bank ltd tejas networks ltd and marksans pharma ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty after consolidating near the \u003cTWO_TEN_THOUSAND\u003e zone for quite some time has indicated a positive candle formation moving above the significant \u003cFIVE_TEN\u003e ema zone at \u003cTWO_TEN_THOUSAND\u003e levels to improve the bias with some of the frontline stocks picking up the index would need a decisive breach above the \u003cTWO_TEN_THOUSAND\u003e zone to establish some conviction and stability as of now to carry on with the positive move further ahead said the stock market expert bank nifty has indicated a decent pullback to close just above the important \u003cFIVE_TEN\u003e ema level at \u003cFIVE_TEN_THOUSAND\u003e with bias getting better and heavyweight banking stocks like hdfc bank and kotak bank looking technically good to anticipate for further rise the index would have the near term support of \u003cFIVE_TEN_THOUSAND\u003e level which needs to be sustained to maintain the bias intact said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e indusind bank ltd indusindbk buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e tejas networks ltd tejasnet buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e marksans pharma ltd marksans buy at \u003cTWO_HUNDRED\u003e target at \u003cTHREE_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e","timestamp":"2024-10-15T06:18:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}