{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-hcl-tech-tech-mahindra-nearly-250-stocks-hit-one-year-highs-on-bse-11728900495748.html","title":"Stock market today: HCL Tech, Tech Mahindra... nearly 250 stocks hit one-year highs on BSE","description":"Stock market today: A total of 249 stocks, such as HCL Tech, Tech Mahindra, Persistent Systems and Divi's Labs, achieved fresh one-year highs during intraday trading on the BSE.","content":"Stock market today: As many as 249 stocks, including HCL Tech, Tech Mahindra, Persistent Systems, Trent and Divi's Labs, hit their fresh one-year highs in intraday trade on BSE on Monday, October 14.Coforge, Dixon Technologies, Gujarat Fluorochemicals, Ipca Laboratories, Mankind Pharma, Oberoi Realty, Page Industries, National Aluminium Company and Glenmark Pharmaceuticals were also among the stocks that hit their 52-week highs in intraday trade.Indian stock market benchmarks, the Sensex and the Nifty 50, ended with decent gains on Monday. The Sensex closed 592 points, or 0.73 per cent, higher at 81,973.05, while the Nifty 50 settled at 25,127.95, up 164 points, or 0.66 per cent.The mid and smallcap segments also ended with gains but underperformed the benchmarks. The BSE Midcap index rose 0.28 per cent, while the Smallcap index inched up by 0.06 per cent.The overall market capitalisation of the BSE-listed stocks rose to nearly  ₹463.6 lakh crore from  ₹462.3 lakh crore in the previous session, making investors' wealth rise by about  ₹1.3 lakh crore in a single session.Shares of Tech Mahindra, HDFC Bank, Larsen and Toubro, ITC and IndusInd Bank ended as the top gainers in the Sensex index. On the flip side, shares of Maruti Suzuki, Tata Steel, Bajaj Finance, Axis Bank and UltraTech Cement ended as the top losers in the index.Banking, financial and IT stocks led the gains. The Nifty Bank index rose 1.26 per cent, while the Private Bank index and Financial Services indices climbed 1.07 per cent and 1.04 per cent, respectively. The Nifty IT index rose 1.27 per cent, the Nifty Realty index jumped 1.61 per cent.\"A sharp fall in crude oil prices provided a major impetus to the markets, as markets ended in positive territory led by gains in banking, IT and realty stocks. The recovery may not fuel strong bullish sentiment, as FIIs deserting Indian markets this month coupled with lingering West Asia conflict has created a lot of uncertainty among the investors,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities.Shrikant Chouhan, the head of equity research at Kotak Securities, underscored that the Nifty 50 is trading near its 50-day SMA (simple moving average) and on intraday charts. It is holding a higher bottom formation, which is largely positive.\"As long as the index is trading above 25,000/81,500, the pullback formation is likely to continue. On the higher side, the market could move up to 25,200-25,260/82,300-82,500. On the flip side, below 25,000/81,500, the sentiment could change. Below the same, the market could retest the level of 24,900-24,840/81,200-81,000,\" said Chouhan.Read all market-related news here","cleaned_content":"stock market today as many as \u003cTWO_HUNDRED\u003e stocks including hcl tech tech mahindra persistent systems trent and divis labs hit their fresh one year highs in intraday trade on bse on monday october \u003cONE_TEN\u003e coforge dixon technologies gujarat fluorochemicals ipca laboratories mankind pharma oberoi realty page industries national aluminium company and glenmark pharmaceuticals were also among the stocks that hit their \u003cFIVE_TEN\u003e week highs in intraday trade indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e ended with decent gains on monday the sensex closed \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e up \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e the mid and smallcap segments also ended with gains but underperformed the benchmarks the bse midcap index rose \u003cZERO_PERCENT\u003e while the smallcap index inched up by \u003cZERO_PERCENT\u003e the overall market capitalisation of the bse listed stocks rose to nearly \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors wealth rise by about \u003cONE_\u003e lakh crore in a single session shares of tech mahindra hdfc bank larsen and toubro itc and indusind bank ended as the top gainers in the sensex index on the flip side shares of maruti suzuki tata steel bajaj finance axis bank and ultratech cement ended as the top losers in the index banking financial and it stocks led the gains the nifty bank index rose \u003cONE_PERCENT\u003e while the private bank index and financial services indices climbed \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively the nifty it index rose \u003cONE_PERCENT\u003e the nifty realty index jumped \u003cONE_PERCENT\u003e a sharp fall in crude oil prices provided a major impetus to the markets as markets ended in positive territory led by gains in banking it and realty stocks the recovery may not fuel strong bullish sentiment as fiis deserting indian markets this month coupled with lingering west asia conflict has created a lot of uncertainty among the investors said prashanth tapse senior vp research mehta equities shrikant chouhan the head of equity research at kotak securities underscored that the nifty \u003cFIVE_TEN\u003e is trading near its \u003cFIVE_TEN\u003e day sma simple moving average and on intraday charts it is holding a higher bottom formation which is largely positive as long as the index is trading above \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e the pullback formation is likely to continue on the higher side the market could move up to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e on the flip side below \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e the sentiment could change below the same the market could retest the level of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e said chouhan read all market related news here","timestamp":"2024-10-14T16:31:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}