{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-rs-100-tiger-logistics-shares-jump-7-after-rating-upgrade-11728367613644.html","title":"Small-cap stock below  ₹100: Tiger Logistics shares jump 7% after rating upgrade","description":"Small-cap stock below  ₹100: Tiger Logistics' share price rose 7% after Infomerics affirmed its credit ratings, upgrading the outlook from Negative to Stable. This reflects improved financial performance driven by increased container volume.","content":"Small-cap stock below  ₹100: Tiger Logistics share price surged 7% following the announcement by the international logistics company that Infomerics Valuation and Rating Private Limited (IVR) has upheld the company's credit ratings.The company stated that its outlook has been elevated from \"Negative\" to \"Stable,\" indicating Tiger Logistics' notable enhancement in financial performance in Q1 FY25. This progress was fueled by a significant year-over-year increase in container volume, leading to increased revenue and profitability.According to the firm, this distinction highlights its solid financial standing, advantageous market position, and encouraging development trajectory.Tiger Logistics share price today opened at  ₹58.75 per share on the BSE. The stock reached an intraday high of  ₹61.40 and an intraday low of  ₹55 per share during the day. Over the course of three months, the stock has surged by more than 50%.“Long-term Bank Facilities (Cash Credit) of  ₹28.00 Crores have been reaffirmed with a rating of IVR BBB+/ Stable (IVR Triple B Plus with Stable Outlook). The outlook has been upgraded from Negative to Stable,” the company disclosed in an exchange filing.Acknowledging this remarkable achievement, Tiger Logistics (India) Ltd's CMD, Harpreet Singh Malhotra, said the company is still dedicated to providing top-notch services, bolstering its market leadership, and achieving sustainable development even as the logistics sector changes. With the backing of their robust liquidity and asset-light business strategy, their primary goals are to broaden their customer base and improve their offerings.According to the exchange filing, the company demonstrated robust financial strength and strategic expansion across key sectors in Q1 FY25. The total income for the period stood at  ₹102.8 crore, with the automobile sector contributing  ₹58.1 crore.In Q1 FY25, the revenue amounted to  ₹101.2 crore, indicating a 9.1% increase QoQ and a 2.4x increase YoY. The EBITDA for the quarter was  ₹5.2 crore, showing a 10.6% increase QoQ and a 2.0x increase YoY, with an EBITDA margin of 5.1%. Furthermore, the PAT for Q1 FY25 was  ₹4.6 crore.Established on May 23, 2000, Tiger Logistics (India) Ltd is a prominent logistics company offering comprehensive supply chain solutions throughout Northern India. The company works in several locations, including Mumbai, Kutch, Ludhiana, Kolkata, Jaipur, Mundra, Veraval, Ahmedabad, Chennai, and Pune. It provides a range of services to its clientele, including transportation, customs clearance, customs consultation, and international freight forwarding.The company has emerged as a leader in offering both inbound and outbound logistics solutions to several big corporate and international enterprises in India and overseas. It is firmly based on the idea of providing services of the highest caliber, propelled by a wealth of knowledge and experience in delivering individualised and tailored services.","cleaned_content":"small cap stock below \u003cONE_HUNDRED\u003e tiger logistics share price surged \u003cSEVEN_PERCENT\u003e following the announcement by the international logistics company that infomerics valuation and rating private limited ivr has upheld the companys credit ratings the company stated that its outlook has been elevated from negative to stable indicating tiger logistics notable enhancement in financial performance in q1 fy25 this progress was fueled by a significant year over year increase in container volume leading to increased revenue and profitability according to the firm this distinction highlights its solid financial standing advantageous market position and encouraging development trajectory tiger logistics share price today opened at \u003cFIVE_TEN\u003e per share on the bse the stock reached an intraday high of \u003cSIX_TEN\u003e and an intraday low of \u003cFIVE_TEN\u003e per share during the day over the course of three months the stock has surged by more than \u003cFIVE_TEN_PERCENT\u003e long term bank facilities cash credit of \u003cTWO_TEN\u003e crores have been reaffirmed with a rating of ivr bbb stable ivr triple b plus with stable outlook the outlook has been upgraded from negative to stable the company disclosed in an exchange filing acknowledging this remarkable achievement tiger logistics india ltds cmd harpreet singh malhotra said the company is still dedicated to providing top notch services bolstering its market leadership and achieving sustainable development even as the logistics sector changes with the backing of their robust liquidity and asset light business strategy their primary goals are to broaden their customer base and improve their offerings according to the exchange filing the company demonstrated robust financial strength and strategic expansion across key sectors in q1 fy25 the total income for the period stood at \u003cONE_HUNDRED\u003e crore with the automobile sector contributing \u003cFIVE_TEN\u003e crore in q1 fy25 the revenue amounted to \u003cONE_HUNDRED\u003e crore indicating a \u003cNINE_PERCENT\u003e increase qoq and a \u003cTWO_\u003e x increase yoy the ebitda for the quarter was \u003cFIVE_\u003e crore showing a \u003cONE_TEN_PERCENT\u003e increase qoq and a \u003cTWO_\u003e x increase yoy with an ebitda margin of \u003cFIVE_PERCENT\u003e furthermore the pat for q1 fy25 was \u003cFOUR_\u003e crore established on may \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e tiger logistics india ltd is a prominent logistics company offering comprehensive supply chain solutions throughout northern india the company works in several locations including mumbai kutch ludhiana kolkata jaipur mundra veraval ahmedabad chennai and pune it provides a range of services to its clientele including transportation customs clearance customs consultation and international freight forwarding the company has emerged as a leader in offering both inbound and outbound logistics solutions to several big corporate and international enterprises in india and overseas it is firmly based on the idea of providing services of the highest caliber propelled by a wealth of knowledge and experience in delivering individualised and tailored services","timestamp":"2024-10-08T11:49:00+05:30","market_timestamp":"2024-10-08T11:49:00+05:30","off_market_hours":false}