{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-tata-steel-to-petronet-lng-smc-global-securities-lists-four-stocks-to-bet-on-this-week-amid-volatility-11728309238337.html","title":"Stocks to buy: Tata Steel to Petronet LNG—SMC Global Securities lists four stocks to bet on this week amid volatility","description":"Stocks to buy: Domestic brokerage SMC Global Securities has recommended four stocks to buy this week based upon the fundamental and technical analysis in the current market scenario","content":"Domestic equity benchmarks Sensex and Nifty 50 settled lower for the sixth straight session, logging the longest losing streak in one year, i.e., since December 2023, dragged down by heavy selling in bellwether stocks as worries over corporate earnings and the escalation of the Israel-Iran war weighed on investor sentiment amid the outflow of foreign funds.The 30-share BSE Sensex tumbled 638.45 points or 0.78 per cent to settle at 81,050. During the day, it plummeted 962.39 points or 1.17 per cent to 80,726.06. The NSE Nifty slumped 218.85 points or 0.87 per cent to end at 24,795.75. The volatility index rose to 15.08, a one-month high on Monday.Also Read: Nifty 50, Sensex log worst week in two years over Israel-Iran war: What should be your trading strategy amid volatility?The Nifty and Sensex have lost 5.6 per cent and 5.2 per cent, respectively, since hitting record-high levels on September 27. Volatility has been rising steadily due to concerns over the escalation of geopolitical tensions and as foreign investors withdrew funds, likely to invest in China.The overall market capitalisation of the firms listed on the BSE dropped to nearly  ₹452 lakh crore from nearly  ₹461 lakh crore in the previous session, making investors lose nearly  ₹9 lakh crore in a single session. Investors have lost nearly  ₹25 lakh crore in the last six sessions.The pullback was exacerbated by disappointing corporate financial updates that kindled worries ahead of the upcoming season. The broader, more domestically focused small and mid-caps slid 2.75 per cent and two per cent, respectively.Also Read: Week Ahead: RBI Policy, Q2 Results, Israel-Iran war, FII flow, global cues among key market triggers for Nifty, SensexIn the current market scenario, domestic brokerage firm SMC Global Securities has released its top four stock picks for this week. The brokerage has selected the following stocks based on technical and fundamental parameters. According to the brokerage, the stocks have robust fundamentals and are well-placed to yield good returns for investors in the next one year.Let's take a look at the top four technical and fundamental stocks for this week by brokerage SMC Global Securities:The company recently commissioned a new facility in Andhra Pradesh and is ramping up quickly. The company expects growth in all segments, driven by the newly commissioned facility. The brokerage expects price increases and better cost management to drive margin. Plywood revenue growth is pegged at over 10 per cent with a margin of 12-14 per cent and laminates revenue growth is pegged at over 20 per cent with a margin of 10-12 per cent.Also Read: Hang Seng rallies 33% in 21 days as Nippon India ETF trades at 5% premium: Will China stimulus boost SIP returns?The company plans to raise product prices in June. It raised laminate prices in the current quarter and added that the realizations have also bottomed out. The company retained its revenue growth projection at over 15 per cent for FY25. The brokerage expects the stock to see a price target of Rs. 1,052 in 8 to 10 months on a three-year average P/BV of 8.03x and FY26 (E) BVPS of Rs. 131.01.In the KFC division, the launch of Chizza LTO in Q4FY24 has improved consumer interest, and according to the management, the company has taken its burger game to the next level by launching five new burgers. Pizza Hut is the company's second pillar of growth. The company launched a very interesting Thin N Crispy Crust pizza to support the brand revival.It continues to build its innovation over the next 4-6 quarters, allied with increased investment in marketing and consumer experience. The Sri Lanka biz continues to improve, with a quarter of double-digit SSSG. Restaurant sales grew by 13 per cent in LKR (up by 19 per cent in  ₹terms), and Restaurant EBITDA margins were at 13.2 per cent ( up 20 bps YoY).Also Read: India’s forex reserves swell by $12.5 billion to cross $700-billion milestone after seven-week surgeThe company focuses on operational efficiency by improving service levels and introducing late-night deliveries. Moreover, it is adding a new restaurant and plans to double its restaurant count. The company also invests in marketing and strengthening the consumer experience to revive the Pizza Hut brand. The brokerage expects the stock will see a price target of Rs. 404 in 8 to 10 months on current P/BVx of 8.37x and FY26 BVPS of Rs. 48.41.The stock's 200-day Exponential Moving Average (DEMA) on the daily chart is currently at 153. The stock reached a 52-week high of 184.60 in June but has since been trading lower, forming a series of lower highs on the daily charts. Recently, it found support around the 145 level and rebounded, surpassing the key resistance mark of 160 after consolidation near its 200-day exponential moving average.Technically, the stock maintains a bullish outlook as prices rise in a pattern of higher highs and higher lows on the weekly charts. Additionally, positive divergences in secondary oscillators and the upward price movement indicate a potential upswing for the stock. Therefore, one can buy the stock in the range of 163-165 for the upside target of 180-183 levels with SL below 149 levels.Also Read: IPO frenzy intensifies in September: 41 cos file papers with SEBI; listing gain soars to 114% with 239 issues YTDThe stock's 200-day Exponential Moving Average (DEMA) on the daily chart is currently at  ₹310. After marking its 52-week high of 384.20 in August, the stock witnessed a series of profit bookings and retraced towards 320 levels. Broadly, the prices hold well above their 200-day exponential moving average on daily and weekly intervals.Technically, the stock has seen a series of declines with the formation of a lower bottom pattern on daily charts. Still, last week, it gained fresh momentum in the stock as a fresh breakout was observed above the downward-sloping channel of the declining channel.The sudden spike in volume activity and price action suggests the next upside in the stock. Therefore, one can buy the stock in the range of 350-355 for the upside target of 410-415 levels with SL below 325 levels.","cleaned_content":"domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e settled lower for the sixth straight session logging the longest losing streak in one year i e since december \u003cTWO_THOUSAND\u003e dragged down by heavy selling in bellwether stocks as worries over corporate earnings and the escalation of the israel iran war weighed on investor sentiment amid the outflow of foreign funds the \u003cTHREE_TEN\u003e share bse sensex tumbled \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e during the day it plummeted \u003cNINE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e the nse nifty slumped \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to end at \u003cTWO_TEN_THOUSAND\u003e the volatility index rose to \u003cONE_TEN\u003e a one month high on monday also read nifty \u003cFIVE_TEN\u003e sensex log worst week in two years over israel iran war what should be your trading strategy amid volatility the nifty and sensex have lost \u003cFIVE_PERCENT\u003e and \u003cFIVE_PERCENT\u003e respectively since hitting record high levels on september \u003cTWO_TEN\u003e volatility has been rising steadily due to concerns over the escalation of geopolitical tensions and as foreign investors withdrew funds likely to invest in china the overall market capitalisation of the firms listed on the bse dropped to nearly \u003cFOUR_HUNDRED\u003e lakh crore from nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors lose nearly \u003cNINE_\u003e lakh crore in a single session investors have lost nearly \u003cTWO_TEN\u003e lakh crore in the last six sessions the pullback was exacerbated by disappointing corporate financial updates that kindled worries ahead of the upcoming season the broader more domestically focused small and mid caps slid \u003cTWO_PERCENT\u003e and two per cent respectively also read week ahead rbi policy q2 results israel iran war fii flow global cues among key market triggers for nifty sensexin the current market scenario domestic brokerage firm smc global securities has released its top four stock picks for this week the brokerage has selected the following stocks based on technical and fundamental parameters according to the brokerage the stocks have robust fundamentals and are well placed to yield good returns for investors in the next one year lets take a look at the top four technical and fundamental stocks for this week by brokerage smc global securities the company recently commissioned a new facility in andhra pradesh and is ramping up quickly the company expects growth in all segments driven by the newly commissioned facility the brokerage expects price increases and better cost management to drive margin plywood revenue growth is pegged at over \u003cONE_TEN_PERCENT\u003e with a margin of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e and laminates revenue growth is pegged at over \u003cTWO_TEN_PERCENT\u003e with a margin of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e also read hang seng rallies \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_TEN\u003e days as nippon india etf trades at \u003cFIVE_PERCENT\u003e premium will china stimulus boost sip returns the company plans to raise product prices in june it raised laminate prices in the current quarter and added that the realizations have also bottomed out the company retained its revenue growth projection at over \u003cONE_TEN_PERCENT\u003e for fy25 the brokerage expects the stock to see a price target of rs \u003cONE_THOUSAND\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on a three year average p bv of \u003cEIGHT_\u003e x and fy26 e bvps of rs \u003cONE_HUNDRED\u003e in the kfc division the launch of chizza lto in q4fy24 has improved consumer interest and according to the management the company has taken its burger game to the next level by launching five new burgers pizza hut is the companys second pillar of growth the company launched a very interesting thin n crispy crust pizza to support the brand revival it continues to build its innovation over the next \u003cFOUR_\u003e \u003cSIX_\u003e quarters allied with increased investment in marketing and consumer experience the sri lanka biz continues to improve with a quarter of double digit sssg restaurant sales grew by \u003cONE_TEN_PERCENT\u003e in lkr up by \u003cONE_TEN_PERCENT\u003e in terms and restaurant ebitda margins were at \u003cONE_TEN_PERCENT\u003e up \u003cTWO_TEN\u003e bps yoy also read india s forex reserves swell by \u003cONE_TEN\u003e billion to cross \u003cSEVEN_HUNDRED\u003e billion milestone after seven week surgethe company focuses on operational efficiency by improving service levels and introducing late night deliveries moreover it is adding a new restaurant and plans to double its restaurant count the company also invests in marketing and strengthening the consumer experience to revive the pizza hut brand the brokerage expects the stock will see a price target of rs \u003cFOUR_HUNDRED\u003e in \u003cEIGHT_\u003e to \u003cONE_TEN\u003e months on current p bvx of \u003cEIGHT_\u003e x and fy26 bvps of rs \u003cFOUR_TEN\u003e the stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cONE_HUNDRED\u003e the stock reached a \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e in june but has since been trading lower forming a series of lower highs on the daily charts recently it found support around the \u003cONE_HUNDRED\u003e level and rebounded surpassing the key resistance mark of \u003cONE_HUNDRED\u003e after consolidation near its \u003cTWO_HUNDRED\u003e day exponential moving average technically the stock maintains a bullish outlook as prices rise in a pattern of higher highs and higher lows on the weekly charts additionally positive divergences in secondary oscillators and the upward price movement indicate a potential upswing for the stock therefore one can buy the stock in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e for the upside target of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e levels with sl below \u003cONE_HUNDRED\u003e levels also read ipo frenzy intensifies in september \u003cFOUR_TEN\u003e cos file papers with sebi listing gain soars to \u003cONE_HUNDRED_PERCENT\u003e with \u003cTWO_HUNDRED\u003e issues ytdthe stocks \u003cTWO_HUNDRED\u003e day exponential moving average dema on the daily chart is currently at \u003cTHREE_HUNDRED\u003e after marking its \u003cFIVE_TEN\u003e week high of \u003cTHREE_HUNDRED\u003e in august the stock witnessed a series of profit bookings and retraced towards \u003cTHREE_HUNDRED\u003e levels broadly the prices hold well above their \u003cTWO_HUNDRED\u003e day exponential moving average on daily and weekly intervals technically the stock has seen a series of declines with the formation of a lower bottom pattern on daily charts still last week it gained fresh momentum in the stock as a fresh breakout was observed above the downward sloping channel of the declining channel the sudden spike in volume activity and price action suggests the next upside in the stock therefore one can buy the stock in the range of \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e for the upside target of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e levels with sl below \u003cTHREE_HUNDRED\u003e levels","timestamp":"2024-10-07T19:25:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}