{"url":"https://www.livemint.com/market/stock-market-news/motaengil-ceo-says-company-stock-worth-twice-its-current-value-11728928163549.html","title":"Mota-Engil CEO Says Company Stock Worth Twice Its Current Value","description":"Mota-Engil, Portugal’s biggest construction company, is undervalued and its shares should be worth twice their market value, its chief executive officer said.","content":"Mota-Engil, Portugal’s biggest construction company, is undervalued and its shares should be worth twice their market value, its chief executive officer said.Mota-Engil is down 27% since it released results for the first half-year on Aug. 28 and short sellers ramped up bets against the stock. Muddy Waters Capital Domino Master Fund reported a short position of 1.99 million shares, or 0.65% of the company’s stock, as of Sept. 2.“What happened between the end of August and during the month of September is a phenomenon that makes no sense to us and has to do with short positions that have no fundamental basis,” CEO Carlos Mota dos Santos said in an interview on Monday. The stock is “surely worth more than twice its current value,” he said.Mota-Engil fell 0.6% on Monday to close at €2.53 a share, giving the company a market value of €776.8 million , according to data compiled by Bloomberg.Santos said he expects the company to maintain a “strong” order book as it continues to benefit from large railway and road projects in Africa, Latin America and in Portugal. Last week, the company won a contract to build the first stretch of high-speed rail in Portugal.“All we can do is continue to work to show Mota-Engil’s value,” said Santos, adding that Muddy Waters has never contacted Mota-Engil. “We have no idea why they decided to take this short position. What we hope, in fact, is that this phenomenon is about to end.”This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"mota engil portugal s biggest construction company is undervalued and its shares should be worth twice their market value its chief executive officer said mota engil is down \u003cTWO_TEN_PERCENT\u003e since it released results for the first half year on aug \u003cTWO_TEN\u003e and short sellers ramped up bets against the stock muddy waters capital domino master fund reported a short position of \u003cONE_\u003e million shares or \u003cZERO_PERCENT\u003e of the company s stock as of sept \u003cTWO_\u003e what happened between the end of august and during the month of september is a phenomenon that makes no sense to us and has to do with short positions that have no fundamental basis ceo carlos mota dos santos said in an interview on monday the stock is surely worth more than twice its current value he said mota engil fell \u003cZERO_PERCENT\u003e on monday to close at \u003cTWO_\u003e a share giving the company a market value of \u003cSEVEN_HUNDRED\u003e million according to data compiled by bloomberg santos said he expects the company to maintain a strong order book as it continues to benefit from large railway and road projects in africa latin america and in portugal last week the company won a contract to build the first stretch of high speed rail in portugal all we can do is continue to work to show mota engil s value said santos adding that muddy waters has never contacted mota engil we have no idea why they decided to take this short position what we hope in fact is that this phenomenon is about to end this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-14T23:19:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}