{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-october-15-11728924012393.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today — October 15","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today – Persistent Systems, HDFC Life Insurance Company, and Godrej Properties.","content":"Shares to buy or sell: Due to increases in shares of notable banking and IT giants, such as HDFC Bank and Infosys, the Indian stock market benchmarks—the Sensex and Nifty 50—continued their upward trend on Monday, October 14.The Sensex climbed 592 points, or 0.73%, finishing at 81,973.05, while the Nifty 50 gained 164 points, or 0.66%, to close at 25,127.95.“Nifty Index opened positive above 25k marks and witnessed buying interest throughout the session. It remained range bound in the second half of the session but managed to close with gains of around 160 points. It formed a bullish candle daily frame and closed above its 50 DEMA. Now it has to hold above 25000 zones, for an up move towards 25,350 then 25,450 zones whereas supports are placed at 25,000 then 24,850 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Maximum Call OI is at 26000 then 25500 strike while Maximum Put OI is at 25000 then 24000 strike. Call writing is seen at 25400 then 25600 strike while Put writing is seen at 25100 then 24100 strike. Option data suggests a broader trading range in between 24700 to 25600 zones while an immediate range between 24900 to 25300 levels.On the Bank Nifty outlook, Taparia further added, “Bank Nifty Index opened on a positive note and extended the momentum towards 51,750 zones in the initial hour of the session. Later it remained consolidative at higher levels with positive bias as good buying was seen in private banks. It formed a bullish candle on daily scale and gave a range breakout on daily scale above 51,750 zones. Now it has to hold above 51,500 zones for a bounce towards 52,350 then 52,500 zones while on the downside support is seen at 51,500 then 51,250 levels.”Chandan Taparia has recommended three stocks to buy today. These stock recommendations are Persistent Systems, HDFC Life Insurance Company and Godrej Properties.A range breakout is visible on the daily chart near its all-time high price with a long bodied bullish candle to support the up move. Buying was visible across the IT space which may give strength to the bull run. The MACD Indicator is on the verge of giving a bullish crossover which may support the upward momentum, Taparia said.A Double Bottom pattern has appeared on the daily chart with an upward breakout which suggests bullish sentiment. The RSI indicator has turned up which confirms the up move.A rounding bottom pattern has formed on the daily time frame which suggests a trend reversal to bullish. It has negated lower highs-lower lows after three weeks and supports are gradually shifting higher. The Stochastic indicator has bounced up from the oversold zones and is headed up which may confirm the change in trend.","cleaned_content":"shares to buy or sell due to increases in shares of notable banking and it giants such as hdfc bank and infosys the indian stock market benchmarks the sensex and nifty \u003cFIVE_TEN\u003e continued their upward trend on monday october \u003cONE_TEN\u003e the sensex climbed \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e finishing at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e gained \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cTWO_TEN_THOUSAND\u003e nifty index opened positive above \u003cTWO_TEN\u003e k marks and witnessed buying interest throughout the session it remained range bound in the second half of the session but managed to close with gains of around \u003cONE_HUNDRED\u003e points it formed a bullish candle daily frame and closed above its \u003cFIVE_TEN\u003e dema now it has to hold above \u003cTWO_TEN_THOUSAND\u003e zones for an up move towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas supports are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels on the bank nifty outlook taparia further added bank nifty index opened on a positive note and extended the momentum towards \u003cFIVE_TEN_THOUSAND\u003e zones in the initial hour of the session later it remained consolidative at higher levels with positive bias as good buying was seen in private banks it formed a bullish candle on daily scale and gave a range breakout on daily scale above \u003cFIVE_TEN_THOUSAND\u003e zones now it has to hold above \u003cFIVE_TEN_THOUSAND\u003e zones for a bounce towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones while on the downside support is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels chandan taparia has recommended three stocks to buy today these stock recommendations are persistent systems hdfc life insurance company and godrej properties a range breakout is visible on the daily chart near its all time high price with a long bodied bullish candle to support the up move buying was visible across the it space which may give strength to the bull run the macd indicator is on the verge of giving a bullish crossover which may support the upward momentum taparia said a double bottom pattern has appeared on the daily chart with an upward breakout which suggests bullish sentiment the rsi indicator has turned up which confirms the up move a rounding bottom pattern has formed on the daily time frame which suggests a trend reversal to bullish it has negated lower highs lower lows after three weeks and supports are gradually shifting higher the stochastic indicator has bounced up from the oversold zones and is headed up which may confirm the change in trend","timestamp":"2024-10-15T06:49:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}