{"url":"https://www.livemint.com/market/stock-market-news/prabhudas-lilladher-raises-nifty50-target-to-above-27-500-advises-avoiding-fomo-in-current-scenario-11728975398777.html","title":"Prabhudas Lilladher raises Nifty50 target to above 27,500, advises avoiding FOMO in current scenario","description":"Prabhudas Lilladher expresses cautious optimism for the stock market, focusing on selective investments in key sectors. They note geopolitical tensions and US presidential election as critical influences while warning that demand uncertainties could lead to earnings reductions in the coming months.","content":"Domestic brokerage house Prabhudas Lilladher expressed a cautiously optimistic outlook for the stock market amid recent volatility. The brokerage stressed a stock-specific approach and urged investors to resist the fear of missing out (FOMO) amid the current uncertainty. With a shift in market sentiment towards defensive stocks, Prabhudas Lilladher highlighted several emerging themes and provided insights into potential growth sectors.The brokerage noted that the market tide has shifted towards defensive sectors, as many cyclicals appear expensive even when accounting for sustained growth. The strong recovery in sectors such as fast-moving consumer goods (FMCG), IT services, pharmaceuticals, and consumer durables showcased this shift.Prabhudas Lilladher has identified key sectors for investment, including capital goods, infrastructure, ports, electronic manufacturing services (EMS), hospitals, tourism, new energy, e-commerce, and telecommunications, provided they are purchased at the right valuations. The brokerage warned that while the market and analysts expect a strong rebound in demand during the festival and marriage season, any disappointment could lead to further reductions in earnings per share (EPS) estimates, following prior cuts of 3.8 per cent for FY25 and 2.8 per cent for FY26.The brokerage set a base case target for the Nifty at 27,867, up from a previous target of 26,820, valuing the index at a 15-year average P/E based on September 2026 EPS of 1,459. In a bullish scenario, they projected a target of 29,260, reflecting a 5 per cent premium to the 15-year average P/E, while the bear case target is 25,080, representing a 10 per cent discount to the long-term average.The Nifty index has experienced significant volatility in the last few weeks driven by geopolitical tensions in the Middle East, a 50-basis point interest rate cut by the US Federal Reserve, and upcoming state elections in India. Demand conditions appeared uncertain, with prolonged rains and floods impacting growth in the second quarter. However, rural demand showed signs of recovery, bolstered by government initiatives aimed at improving rural incomes. These included raising the minimum support price (MSP), increasing import duties on edible oils, permitting onion exports, and lifting price caps on rice exports, though they might also contribute to food inflation in the coming months.The recent victory of the ruling Bharatiya Janata Party (BJP) in Haryana provided a boost to market sentiment. The outcomes of elections in Maharashtra, expected in November 2024, and Jharkhand in December 2024, will be critical factors influencing market volatility. The ongoing geopolitical situation remains challenging, with the Middle East conflict threatening global supply chains. Following the US Federal Reserve's interest rate cut, market participants are likely to closely monitor the results of the upcoming US elections for future direction.The brokerage adjusted its model portfolio by reducing weights in capital goods and consumer sectors, maintaining equal weight in IT services. They cut positions in companies such as IIB, Siemens, and Britannia, and removed Carborandum and Cipla from the model portfolio. Conversely, they increased weights in companies like Kotak Mahindra Bank, Astral, InterGlobe Aviation, Nestlé, and Sun Pharma. Additionally, they added Bharat Electronics and HCL Tech to their model portfolio and maintained an overweight stance on banks, consumer sectors, capital goods, cement, telecom, and healthcare.In their high-conviction picks, they included Bharat Electronics, Crompton Consumer, Jindal Stainless, Safari, Cyient, and JB Chemicals, while removing Siemens, Praj Industries, Apar, and Lupin Labs due to recent sharp run-ups in these stocks.The upcoming US presidential election is expected to have significant implications for India, particularly in light of escalating geopolitical tensions and changing dynamics in South Asia. With leadership shifts in Bangladesh and a fragile situation in Southeast Asia, India's position in managing tensions within South Asia and the Indo-Pacific region becomes crucial. The United States' approach will play a key role in maintaining political stability in these regions.If Kamala Harris is elected, the US is likely to continue the Biden administration’s multilateral and alliance-driven foreign policies. In contrast, a return of Donald Trump could see more aggressive trade measures, including potential tariffs and stricter immigration policies. However, Trump's leadership may also ease some geopolitical tensions, particularly in conflicts like Russia-Ukraine and the Middle East. Regardless of the outcome, India will need to remain flexible and assess shifts in US policies in areas such as defense, energy, and immigration without viewing either election result as universally favorable or unfavorable.The second quarter has shown a mixed performance, with prolonged rains impacting demand. However, expectations remain high for a recovery during the upcoming festival and wedding season. Infrastructure spending and ordering have picked up, but volatility is expected to persist through FY25, with elections in Maharashtra, Jharkhand, and Delhi on the horizon. The Reserve Bank of India (RBI) has held interest rates steady, with fears of inflation resurfacing as the government takes steps to improve crop realizations for edible oilseeds, onions, and rice. A repo rate cut is anticipated in December 2024.Capital goods, travel, hospitals, AMCs, telecom, and pharmaceuticals are well-positioned for sustained growth in the coming quarters. Cement and metals are expected to perform better in the second half of FY25. However, banks may face pressure from narrowing net interest margins (NIMs) in the upcoming quarters. Wire and cable companies remain in a strong position. The second half of FY25 will be critical for urban discretionary spending, and any disappointments in this area could result in earnings cuts for consumption-driven sectors.With an eye on the forthcoming US presidential election and its implications for global geopolitics and the Indian market, Prabhudas Lilladher remains cautious yet optimistic. They believe that navigating the current volatility through selective investments in promising sectors could yield significant returns.","cleaned_content":"domestic brokerage house prabhudas lilladher expressed a cautiously optimistic outlook for the stock market amid recent volatility the brokerage stressed a stock specific approach and urged investors to resist the fear of missing out fomo amid the current uncertainty with a shift in market sentiment towards defensive stocks prabhudas lilladher highlighted several emerging themes and provided insights into potential growth sectors the brokerage noted that the market tide has shifted towards defensive sectors as many cyclicals appear expensive even when accounting for sustained growth the strong recovery in sectors such as fast moving consumer goods fmcg it services pharmaceuticals and consumer durables showcased this shift prabhudas lilladher has identified key sectors for investment including capital goods infrastructure ports electronic manufacturing services ems hospitals tourism new energy e commerce and telecommunications provided they are purchased at the right valuations the brokerage warned that while the market and analysts expect a strong rebound in demand during the festival and marriage season any disappointment could lead to further reductions in earnings per share eps estimates following prior cuts of \u003cTHREE_PERCENT\u003e for fy25 and \u003cTWO_PERCENT\u003e for fy26 the brokerage set a base case target for the nifty at \u003cTWO_TEN_THOUSAND\u003e up from a previous target of \u003cTWO_TEN_THOUSAND\u003e valuing the index at a \u003cONE_TEN\u003e year average p e based on september \u003cTWO_THOUSAND\u003e eps of \u003cONE_THOUSAND\u003e in a bullish scenario they projected a target of \u003cTWO_TEN_THOUSAND\u003e reflecting a \u003cFIVE_PERCENT\u003e premium to the \u003cONE_TEN\u003e year average p e while the bear case target is \u003cTWO_TEN_THOUSAND\u003e representing a \u003cONE_TEN_PERCENT\u003e discount to the long term average the nifty index has experienced significant volatility in the last few weeks driven by geopolitical tensions in the middle east a \u003cFIVE_TEN\u003e basis point interest rate cut by the us federal reserve and upcoming state elections in india demand conditions appeared uncertain with prolonged rains and floods impacting growth in the second quarter however rural demand showed signs of recovery bolstered by government initiatives aimed at improving rural incomes these included raising the minimum support price msp increasing import duties on edible oils permitting onion exports and lifting price caps on rice exports though they might also contribute to food inflation in the coming months the recent victory of the ruling bharatiya janata party bjp in haryana provided a boost to market sentiment the outcomes of elections in maharashtra expected in november \u003cTWO_THOUSAND\u003e and jharkhand in december \u003cTWO_THOUSAND\u003e will be critical factors influencing market volatility the ongoing geopolitical situation remains challenging with the middle east conflict threatening global supply chains following the us federal reserves interest rate cut market participants are likely to closely monitor the results of the upcoming us elections for future direction the brokerage adjusted its model portfolio by reducing weights in capital goods and consumer sectors maintaining equal weight in it services they cut positions in companies such as iib siemens and britannia and removed carborandum and cipla from the model portfolio conversely they increased weights in companies like kotak mahindra bank astral interglobe aviation nestl and sun pharma additionally they added bharat electronics and hcl tech to their model portfolio and maintained an overweight stance on banks consumer sectors capital goods cement telecom and healthcare in their high conviction picks they included bharat electronics crompton consumer jindal stainless safari cyient and jb chemicals while removing siemens praj industries apar and lupin labs due to recent sharp run ups in these stocks the upcoming us presidential election is expected to have significant implications for india particularly in light of escalating geopolitical tensions and changing dynamics in south asia with leadership shifts in bangladesh and a fragile situation in southeast asia indias position in managing tensions within south asia and the indo pacific region becomes crucial the united states approach will play a key role in maintaining political stability in these regions if kamala harris is elected the us is likely to continue the biden administration s multilateral and alliance driven foreign policies in contrast a return of donald trump could see more aggressive trade measures including potential tariffs and stricter immigration policies however trumps leadership may also ease some geopolitical tensions particularly in conflicts like russia ukraine and the middle east regardless of the outcome india will need to remain flexible and assess shifts in us policies in areas such as defense energy and immigration without viewing either election result as universally favorable or unfavorable the second quarter has shown a mixed performance with prolonged rains impacting demand however expectations remain high for a recovery during the upcoming festival and wedding season infrastructure spending and ordering have picked up but volatility is expected to persist through fy25 with elections in maharashtra jharkhand and delhi on the horizon the reserve bank of india rbi has held interest rates steady with fears of inflation resurfacing as the government takes steps to improve crop realizations for edible oilseeds onions and rice a repo rate cut is anticipated in december \u003cTWO_THOUSAND\u003e capital goods travel hospitals amcs telecom and pharmaceuticals are well positioned for sustained growth in the coming quarters cement and metals are expected to perform better in the second half of fy25 however banks may face pressure from narrowing net interest margins nims in the upcoming quarters wire and cable companies remain in a strong position the second half of fy25 will be critical for urban discretionary spending and any disappointments in this area could result in earnings cuts for consumption driven sectors with an eye on the forthcoming us presidential election and its implications for global geopolitics and the indian market prabhudas lilladher remains cautious yet optimistic they believe that navigating the current volatility through selective investments in promising sectors could yield significant returns","timestamp":"2024-10-15T13:44:00+05:30","market_timestamp":"2024-10-15T13:44:00+05:30","off_market_hours":false}