{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-outlook-amid-iran-israel-war-five-stocks-to-buy-or-sell-on-oct-8-11728300620363.html","title":"Stock market today: Trade setup for Nifty 50 to global outlook amid Iran-Israel war; five stocks to buy or sell on Oct 8","description":"Stock Market today: Nifty-50 index that continues its correction phase has declined below the crucial support of 25100-25000 levels recently and could slide down towards another lower support of around 24500-24400 in the near term, said experts","content":"Stock Market Today: The Benchmark Nifty-50 Index, continuing its correction phase, ended a volatile trading session on Monday at 24,795.75, down 0.87. The S\u0026P BSE Sensex, too, at 81,050.00, ended down 0.78%. Most of the sectors, with the exception of the IT Index, saw sharp cuts. Even Mid and Small-cap indexes were down 2.5%. Bank Nifty at 50,478.90 saw a steep correction of 1.91%The underlying trend of Nifty remains negative. Having recently declined below the crucial support of 25100-25000 levels, Nagaraj Shetti, senior technical research analyst at HDFC Securities, said Nifty could slide down towards another lower support of around 24500-24400 in the near term.The Nifty Bank index experienced a short-term trend line breakdown and closed below the 100-DSMA support, indicating further weakness. On the upside, the index will face immediate resistance near the 51,000–51,100 levels. In contrast, on the downside, the psychological level of 50,000 will act as important support, said Hrishikesh Yedve, AVP of Technical and Derivatives Research at Asit C. Mehta Investment Intermediates Ltd.Asian markets rose on Monday, supported by strong US jobs data, while European markets were mixed. The US jobs data, however, failed to lift sentiments in India.In addition to the internal market dynamics, geopolitical concerns are also shaping short-term domestic market direction. The escalating tensions between Iran and Israel have introduced a level of uncertainty and risk that investors find difficult to ignore, said Narendra Solanki, Head Fundamental Research—Investment Services, Anand Rathi Shares and Stock Brokers.Sumeet Bagadia, Executive Director at Choice Broking recommended two stock picks for Monday. Also, Ganesh Dongre, Senior Manager - Technical Research at Anand Rathi suggested three stock ideas for today.These include Gillette India Ltd  , R R Kabel Ltd , Infosys Ltd , Apollo Hospitals Enterprise Ltd and Mahindra \u0026 Mahindra Ltd .1. Gillette India Ltd -Sumeet Bagadia recommends buying Gillette India at  ₹8683.95 with a Stoploss at  ₹8423 for a target price of  ₹9205Gillette is currently trading at  ₹8683.95 and has formed a neutral candlestick pattern on the daily chart, signaling a potential bullish reversal from key support levels. The stock has recently bounced back from its support zone, indicating a possible reversal, with increased trading volumes adding strength to the bullish outlook. If Gillette can sustain above the critical resistance level of  ₹8700, it is likely to continue its upward momentum, potentially moving towards a target price of  ₹9205.2. R R Kabel Ltd -   Sumeet Bagadia recommends buying R R Kabel at  ₹1772.3 with Stoploss at  ₹1719 for a target price of  ₹1878RRKabel Ltd. is currently trading at  ₹1772.3, demonstrating a strong bullish trend. The stock recently bounced from its support zone and broke out of a consolidation range, confirming upward momentum. This breakout is backed by a significant rise in trading volumes, indicating strong buying interest from investors. RR Kabel is poised to target  ₹1878 in the short term, supported by its current technical structure.3. Infosys Ltd- Dongre recommends buying Infosys at  ₹1930 keeping Stoploss at  ₹1880 at  ₹2030.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 2030. At present, the stock is maintaining a crucial support level at Rs.1880 Given the current market price of Rs.1930, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 2030.4. Apollo Hospitals Enterprise Ltd  - Dongre recommends buying Apollo Hospitals Enterprise at  ₹ 6773 keeping Stoploss at  ₹6700 for a target price of  ₹6950On the daily chart of this stock, support at  ₹6700 level has been observed, signaling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 6700 is recommended. The target price for this strategy is Rs. 6950 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.5. Mahindra \u0026 Mahindra Ltd- Dongre recommends buying M\u0026M at  ₹3060 keeping Stop Loss at  ₹3000 for a target price of  ₹3140.On the short-term chart, this stock is forming bullish engulfing pattern, which is inherently bullish. Currently priced at Rs. 3060, this formation signals a potential upward trend. To effectively manage risk, a stop loss at Rs.3000 is recommended. .The target price for this strategy is Rs. 3140 in the upcoming weeks. This suggests a potential gain as the stock continues its upward trajectory, backed by the bullish technical signals.","cleaned_content":"stock market today the benchmark nifty \u003cFIVE_TEN\u003e index continuing its correction phase ended a volatile trading session on monday at \u003cTWO_TEN_THOUSAND\u003e down \u003cZERO_\u003e the s p bse sensex too at \u003cEIGHT_TEN_THOUSAND\u003e ended down \u003cZERO_PERCENT\u003e most of the sectors with the exception of the it index saw sharp cuts even mid and small cap indexes were down \u003cTWO_PERCENT\u003e bank nifty at \u003cFIVE_TEN_THOUSAND\u003e saw a steep correction of \u003cONE_PERCENT\u003e the underlying trend of nifty remains negative having recently declined below the crucial support of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels nagaraj shetti senior technical research analyst at hdfc securities said nifty could slide down towards another lower support of around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e in the near term the nifty bank index experienced a short term trend line breakdown and closed below the \u003cONE_HUNDRED\u003e dsma support indicating further weakness on the upside the index will face immediate resistance near the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels in contrast on the downside the psychological level of \u003cFIVE_TEN_THOUSAND\u003e will act as important support said hrishikesh yedve avp of technical and derivatives research at asit c mehta investment intermediates ltd asian markets rose on monday supported by strong us jobs data while european markets were mixed the us jobs data however failed to lift sentiments in india in addition to the internal market dynamics geopolitical concerns are also shaping short term domestic market direction the escalating tensions between iran and israel have introduced a level of uncertainty and risk that investors find difficult to ignore said narendra solanki head fundamental research investment services anand rathi shares and stock brokers sumeet bagadia executive director at choice broking recommended two stock picks for monday also ganesh dongre senior manager technical research at anand rathi suggested three stock ideas for today these include gillette india ltd r r kabel ltd infosys ltd apollo hospitals enterprise ltd and mahindra mahindra ltd 1 gillette india ltd sumeet bagadia recommends buying gillette india at \u003cEIGHT_THOUSAND\u003e with a stoploss at \u003cEIGHT_THOUSAND\u003e for a target price of \u003cNINE_THOUSAND\u003e gillette is currently trading at \u003cEIGHT_THOUSAND\u003e and has formed a neutral candlestick pattern on the daily chart signaling a potential bullish reversal from key support levels the stock has recently bounced back from its support zone indicating a possible reversal with increased trading volumes adding strength to the bullish outlook if gillette can sustain above the critical resistance level of \u003cEIGHT_THOUSAND\u003e it is likely to continue its upward momentum potentially moving towards a target price of \u003cNINE_THOUSAND\u003e r r kabel ltd sumeet bagadia recommends buying r r kabel at \u003cONE_THOUSAND\u003e with stoploss at \u003cONE_THOUSAND\u003e for a target price of \u003cONE_THOUSAND\u003e rrkabel ltd is currently trading at \u003cONE_THOUSAND\u003e demonstrating a strong bullish trend the stock recently bounced from its support zone and broke out of a consolidation range confirming upward momentum this breakout is backed by a significant rise in trading volumes indicating strong buying interest from investors rr kabel is poised to target \u003cONE_THOUSAND\u003e in the short term supported by its current technical structure 3 infosys ltd dongre recommends buying infosys at \u003cONE_THOUSAND\u003e keeping stoploss at \u003cONE_THOUSAND\u003e at \u003cTWO_THOUSAND\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cTWO_THOUSAND\u003e at present the stock is maintaining a crucial support level at rs 1880 given the current market price of rs 1930 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cTWO_THOUSAND\u003e apollo hospitals enterprise ltd dongre recommends buying apollo hospitals enterprise at \u003cSIX_THOUSAND\u003e keeping stoploss at \u003cSIX_THOUSAND\u003e for a target price of \u003cSIX_THOUSAND\u003e on the daily chart of this stock support at \u003cSIX_THOUSAND\u003e level has been observed signaling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cSIX_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cSIX_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory 5 mahindra mahindra ltd dongre recommends buying m m at \u003cTHREE_THOUSAND\u003e keeping stop loss at \u003cTHREE_THOUSAND\u003e for a target price of \u003cTHREE_THOUSAND\u003e on the short term chart this stock is forming bullish engulfing pattern which is inherently bullish currently priced at rs \u003cTHREE_THOUSAND\u003e this formation signals a potential upward trend to effectively manage risk a stop loss at rs 3000 is recommended the target price for this strategy is rs \u003cTHREE_THOUSAND\u003e in the upcoming weeks this suggests a potential gain as the stock continues its upward trajectory backed by the bullish technical signals","timestamp":"2024-10-08T06:33:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}