{"url":"https://www.livemint.com/market/stock-market-news/fo-strategy-buy-gmdc-kpit-tech-hul-suggests-rupak-de-as-indian-stock-market-begin-fresh-week-with-gains-11728881826914.html","title":"F\u0026O Strategy: Buy GMDC, KPIT Tech, HUL suggests Rupak De as Indian stock market begins fresh week with gains","description":"F\u0026O Strategy: Technical views on F\u0026O market by Rupak De, Senior Technical Analyst, LKP Securities. De suggests buying Gujarat Mineral Development Corporation Ltd (GMDC), KPIT Technologies Ltd, and Hindustan Unilever Ltd (HUL).","content":"Stock market today: On Monday, the Indian benchmark indices, Sensex and Nifty 50, started the day with a slight rise. This was driven by the increase in IT firm Wipro's stock due to its announcement of a bonus share issue, as well as the uptick in banking and financial stocks. Investors are closely watching the domestic inflation data to gauge when a potential interest rate cut may occur.At 11:13 IST, the Sensex surged by 494.34 points or 0.61% to reach 81,877.67. Similarly, the Nifty 50 rose by 131.65 points or 0.53% to reach 25,095.90.In India, the impact of geopolitical uncertainties and the Chinese stimulus is slowing down, according to experts. However, there won't be any quick respite for the markets in the near future because of the impending US presidential election, which is causing volatility across the board.According to technical analysts in the derivatives segment, Foreign Institutional Investors (FIIs) continue with their net short positions in the index futures with the ratio now around 35 percent. Until we see any signs of short covering by them, the upside in the market could be limited and would see selling pressure at higher levels. The near term trading range for Nifty 50 seen at 24,700-25,250. A breakout on either side should then lead to a directional move.Technical views by Rupak De, Senior Technical Analyst, LKP Securities on F\u0026O marketFor Bank Nifty the last expiry date was Wednesday, October 9. Bank Nifty struggled to close above its 50-day EMA, indicating bearish control over the index. However, it found support at the 51,000 level, aligning with its rising trendline support. The outlook remains sideways to mildly negative until the index closes above its 50-day EMA, currently placed at 51,700. In the near term, immediate support lies at 51,000, while resistance can be expected around the 51,600 level. Until a decisive move above the 50-day EMA occurs, the index may continue to trade within this range.Open Interest Analysis: PUT writing was not significant on the 2nd day of the new expiry; while significant CALL writing was visible at 52,000 indicating strong resistance for the short term at 52,000. Maximum CALL open interest is seen at 51,500 and maximum PUT open interest was seen at the 51,000 strike, indicating the range for the near term. CALL writers seen outnumbering PUT writers in the weekly expiry.For Nifty 50 the last expiry date was Thursday, October 10. Nifty 50 remained largely subdued on Friday, with traders anticipating India CPI data. On the upside, call writers were active at 25,000, indicating a potential strong resistance level. On the downside, weak support was noted from put writers at 24,900. The overall sentiment stays bearish as long as the index remains below 25,050, while a decisive break below 24,900 could lead to a drop towards 24,700.Open Interest Analysis: PUT writing was not significant on the first day of the new expiry; while significant CALL writing was visible at 25,000 indicating strong resistance for the short term at 25,000. Maximum CALL and PUT open interest was seen at the 25,000 strike, indicating a possibility of a weekly expiry around 25000. CALL writers seen outnumbering PUT writers in the weekly expiry.On the weekly chart, the stock has recently recovered from a number of significant reversal marks. Furthermore, it established support right before the most recent rise near the 100-week EMA. On the daily chart, a bullish harami reversal pattern is also visible. RSI displays a bullish crossover on a daily basis. On the weekly chart, the stock has recently recovered from a number of significant reversal points. It also found support right before the recent rise at the 100-week EMA. On the daily chart, a bullish harami reversal pattern is also visible. RSI displays a bullish crossover on a daily basis.With this technical setup, we can infer a positive outlook, potentially reaching 360/380 in the short term. Support is established at 320, and a break below this level would indicate weakness.The stock has moved back into a bullish zone by breaking through the rising trendline on the daily timeframe. It maintained above the crucial 100-day moving average, which led to the most recent surge. Additionally, the RSI has broken out of a falling trendline. With this technical setup, we can infer a positive outlook, potentially reaching 1,920 in the short term. Support is established at 1,734, and a break below this level would signal weakness.The stock has recently reversed from several key points on the daily chart. Additionally, it found support just above the 100-day EMA before the recent rally. A strong hidden bullish divergence is visible on the daily timeframe. With this technical setup, we can infer a positive outlook, potentially reaching 3,050 in the short to medium term. Support is placed at 2,664 (on a closing basis), and a break below this level would signal weakness.","cleaned_content":"stock market today on monday the indian benchmark indices sensex and nifty \u003cFIVE_TEN\u003e started the day with a slight rise this was driven by the increase in it firm wipros stock due to its announcement of a bonus share issue as well as the uptick in banking and financial stocks investors are closely watching the domestic inflation data to gauge when a potential interest rate cut may occur at \u003cONE_TEN\u003e \u003cONE_TEN\u003e ist the sensex surged by \u003cFOUR_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to reach \u003cEIGHT_TEN_THOUSAND\u003e similarly the nifty \u003cFIVE_TEN\u003e rose by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to reach \u003cTWO_TEN_THOUSAND\u003e in india the impact of geopolitical uncertainties and the chinese stimulus is slowing down according to experts however there wont be any quick respite for the markets in the near future because of the impending us presidential election which is causing volatility across the board according to technical analysts in the derivatives segment foreign institutional investors fiis continue with their net short positions in the index futures with the ratio now around \u003cTHREE_TEN_PERCENT\u003e until we see any signs of short covering by them the upside in the market could be limited and would see selling pressure at higher levels the near term trading range for nifty \u003cFIVE_TEN\u003e seen at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e a breakout on either side should then lead to a directional move technical views by rupak de senior technical analyst lkp securities on f o marketfor bank nifty the last expiry date was wednesday october \u003cNINE_\u003e bank nifty struggled to close above its \u003cFIVE_TEN\u003e day ema indicating bearish control over the index however it found support at the \u003cFIVE_TEN_THOUSAND\u003e level aligning with its rising trendline support the outlook remains sideways to mildly negative until the index closes above its \u003cFIVE_TEN\u003e day ema currently placed at \u003cFIVE_TEN_THOUSAND\u003e in the near term immediate support lies at \u003cFIVE_TEN_THOUSAND\u003e while resistance can be expected around the \u003cFIVE_TEN_THOUSAND\u003e level until a decisive move above the \u003cFIVE_TEN\u003e day ema occurs the index may continue to trade within this range open interest analysis put writing was not significant on the \u003cTWO_\u003e nd day of the new expiry while significant call writing was visible at \u003cFIVE_TEN_THOUSAND\u003e indicating strong resistance for the short term at \u003cFIVE_TEN_THOUSAND\u003e maximum call open interest is seen at \u003cFIVE_TEN_THOUSAND\u003e and maximum put open interest was seen at the \u003cFIVE_TEN_THOUSAND\u003e strike indicating the range for the near term call writers seen outnumbering put writers in the weekly expiry for nifty \u003cFIVE_TEN\u003e the last expiry date was thursday october \u003cONE_TEN\u003e nifty \u003cFIVE_TEN\u003e remained largely subdued on friday with traders anticipating india cpi data on the upside call writers were active at \u003cTWO_TEN_THOUSAND\u003e indicating a potential strong resistance level on the downside weak support was noted from put writers at \u003cTWO_TEN_THOUSAND\u003e the overall sentiment stays bearish as long as the index remains below \u003cTWO_TEN_THOUSAND\u003e while a decisive break below \u003cTWO_TEN_THOUSAND\u003e could lead to a drop towards \u003cTWO_TEN_THOUSAND\u003e open interest analysis put writing was not significant on the first day of the new expiry while significant call writing was visible at \u003cTWO_TEN_THOUSAND\u003e indicating strong resistance for the short term at \u003cTWO_TEN_THOUSAND\u003e maximum call and put open interest was seen at the \u003cTWO_TEN_THOUSAND\u003e strike indicating a possibility of a weekly expiry around \u003cTWO_TEN_THOUSAND\u003e call writers seen outnumbering put writers in the weekly expiry on the weekly chart the stock has recently recovered from a number of significant reversal marks furthermore it established support right before the most recent rise near the \u003cONE_HUNDRED\u003e week ema on the daily chart a bullish harami reversal pattern is also visible rsi displays a bullish crossover on a daily basis on the weekly chart the stock has recently recovered from a number of significant reversal points it also found support right before the recent rise at the \u003cONE_HUNDRED\u003e week ema on the daily chart a bullish harami reversal pattern is also visible rsi displays a bullish crossover on a daily basis with this technical setup we can infer a positive outlook potentially reaching \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e in the short term support is established at \u003cTHREE_HUNDRED\u003e and a break below this level would indicate weakness the stock has moved back into a bullish zone by breaking through the rising trendline on the daily timeframe it maintained above the crucial \u003cONE_HUNDRED\u003e day moving average which led to the most recent surge additionally the rsi has broken out of a falling trendline with this technical setup we can infer a positive outlook potentially reaching \u003cONE_THOUSAND\u003e in the short term support is established at \u003cONE_THOUSAND\u003e and a break below this level would signal weakness the stock has recently reversed from several key points on the daily chart additionally it found support just above the \u003cONE_HUNDRED\u003e day ema before the recent rally a strong hidden bullish divergence is visible on the daily timeframe with this technical setup we can infer a positive outlook potentially reaching \u003cTHREE_THOUSAND\u003e in the short to medium term support is placed at \u003cTWO_THOUSAND\u003e on a closing basis and a break below this level would signal weakness","timestamp":"2024-10-14T11:17:00+05:30","market_timestamp":"2024-10-14T11:17:00+05:30","off_market_hours":false}