{"url":"https://www.livemint.com/market/stock-market-news/indian-hotels-eih-chalet-hotel-share-prices-among-others-rise-up-to-56-ytd-should-you-buy-sell-or-hold-11728289646432.html","title":"Indian Hotels, EIH, Chalet Hotel share prices among others rise up to 56% YTD. Should you buy, sell or hold?","description":"Stock Market Today: Indian Hotels, EIH, TAJGVK, Oriental Hotels, and Chalet Hotels share prices have hogged the limelight this year following an up to 56% rise in 2024 so far. Analysts expect a rebound in demand in Q2.","content":"Stock Markets Today: Indian Hotels Co, EIH, TAJGVK Hotels \u0026 Resorts, Oriental Hotels, and Chalet Hotels share prices among other hotel stocks have hogged the limelight in 2024 so far.While many of these hotel stocks may have seen volatility in the past one month, they have risen up to 56% on a year-to-date (YTD) basis.Analysts are upbeat on the prospects of hotel stocks. They expect the occupancy to be firm and revenue per available room (RevPAR) to remain healthy.According to CareEdge's estimates, the industry's RevPAR registered a strong growth of 14% during the fiscal year 2024 (FY24). For fiscal year 2025, RevPAR is expected to grow by approximately 8-9%, building on the high base set in FY24.The growth in both domestic and foreign tourism, which has boosted profitability, is likely to remain a key driver. While hotel room supply is increasing, CareEdge Ratings believes that demand will likely continue to outstrip supply.Antique Stock Broking after its channel checks says that rates should improve strongly for the rest of FY25, with a marginal scope for improvement in occupancy. Rates have started rising back to near-high single digits and early double digits post the muted performance in Q1 as demand continues to remain strong.Travel trends improved in Q2 after a weak first quarter that was impacted by elections as per analysts. Analysts at Jefferies India said that they expect industry RevPAR growth to jump to ~10% year-on-year (YoY), reflecting in a healthy 25% YoY (like for like) EBITDA growth for Indian Hotels Co.Antique Stock Broking expects a robust Q2 due to the strong wedding business in Mumbai and the release of pent-up demand, impacted by the elections and weather disruptions in Q1.Antique Stock Broking remains constructive on Chalet Hotels due to strong EBITDA accretion helped by commercial portfolio addition. It has a ‘Hold’ rating on Indian Hotels due to its relatively expensive valuation.","cleaned_content":"stock markets today indian hotels co eih tajgvk hotels resorts oriental hotels and chalet hotels share prices among other hotel stocks have hogged the limelight in \u003cTWO_THOUSAND\u003e so far while many of these hotel stocks may have seen volatility in the past one month they have risen up to \u003cFIVE_TEN_PERCENT\u003e on a year to date ytd basis analysts are upbeat on the prospects of hotel stocks they expect the occupancy to be firm and revenue per available room revpar to remain healthy according to careedges estimates the industrys revpar registered a strong growth of \u003cONE_TEN_PERCENT\u003e during the fiscal year \u003cTWO_THOUSAND\u003e fy24 for fiscal year \u003cTWO_THOUSAND\u003e revpar is expected to grow by approximately \u003cEIGHT_\u003e \u003cNINE_PERCENT\u003e building on the high base set in fy24 the growth in both domestic and foreign tourism which has boosted profitability is likely to remain a key driver while hotel room supply is increasing careedge ratings believes that demand will likely continue to outstrip supply antique stock broking after its channel checks says that rates should improve strongly for the rest of fy25 with a marginal scope for improvement in occupancy rates have started rising back to near high single digits and early double digits post the muted performance in q1 as demand continues to remain strong travel trends improved in q2 after a weak first quarter that was impacted by elections as per analysts analysts at jefferies india said that they expect industry revpar growth to jump to \u003cONE_TEN_PERCENT\u003e year on year yoy reflecting in a healthy \u003cTWO_TEN_PERCENT\u003e yoy like for like ebitda growth for indian hotels co antique stock broking expects a robust q2 due to the strong wedding business in mumbai and the release of pent up demand impacted by the elections and weather disruptions in q1 antique stock broking remains constructive on chalet hotels due to strong ebitda accretion helped by commercial portfolio addition it has a hold rating on indian hotels due to its relatively expensive valuation","timestamp":"2024-10-07T16:00:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}