{"url":"https://www.livemint.com/market/stock-market-news/stock-market-crash-israel-iran-war-to-fii-outflows-5-reasons-why-sensex-nifty-plunged-today-amid-volatility-11728044440333.html","title":"Stock Market Crash: Israel-Iran war to FII outflows—5 reasons why Sensex, Nifty plunged today amid volatility","description":"Stock Market Crash: Sensex and Nifty 50 ended the truncated week over four per cent lower after three straight weeks of positive returns amid weak geopolitical tensions and foreign outflows.","content":"Stock Market Crash: Domestic equity benchmarks Sensex and Nifty 50 extended losses for the fifth straight session on Friday, October 4, in an exceptionally volatile session, and logged their worst week in over two years amid weak geopolitical tensions and foreign outflows. Today's crash comes after a two per cent decline seen in the previous session.The frontline indices lost about 4.5 per cent each for the week, their worst since June 2022. Overall the indices ended the truncated September 30-October 4 week after three straight weeks of positive returns. From their record highs scaled on September 27, the benchmarks have dropped over five per cent.Also Read: Market Close: Sensex, Nifty slide for 5th straight session, crash 1% amid Israel-Iran war worriesFalling for the fifth day running on Friday, the 30-share BSE Sensex tumbled 808.65 points or 0.98 per cent to settle at 81,688.45. The benchmark hit a low of 81,532.68 and a high of 83,368.32 during the day, reflecting a wild swing of 1,835.64 points during the session.The NSE Nifty 50 slumped 235.50 points or 0.93 per cent to settle at 25,014.60. Intra-day, it hit a high of 25,485.05. During the last leg of the trade, the benchmarks again slipped into the red. Sensex shed 1,835.64 points from the day's high of 81,532.68, while the Nifty tanked 518.25 points to its day's low of 24,966.8.The broader, more domestically focused small and mid-caps fell 2.5 per cent and 3.2 per cent for the week. Mukesh Ambani-led Reliance Industries, the second-heaviest Nifty 50 stock, shed 9.2 per cent, leading the index's losses this week.Over the past five trading sessions, Indian stock markets have experienced a substantial decline in investor wealth, with approximately  ₹13 lakh crore being wiped out. Last week, the total market capitalization of Indian stocks was  ₹479 lakh crore, but this week it has dropped to  ₹466 lakh crore, marking a steep loss of  ₹13 lakh crore in just five sessions.Also Read: Nifty 50 slides 4.4% this week, posts largest weekly drop since June 2022 on growing Iran-Israel war fears, FII outflowsThe escalating Middle East conflict raised alarm bells that crude supplies from the top oil-producing region may be disrupted. This has increased crude oil prices, hurting net importers such as India. The spike in oil prices on supply uncertainty due to geopolitical tensions has dented market sentiments.D-Street analysts also attributed the market drop this week to aggressive foreign selling. Foreign outflows from Indian markets hit a record high on Thursday as investors directed inflows into China after its recent stimulus measures.Indian stock market benchmarks have nosedived for five days as investors book profits at record-high levels. D-Street experts highlight the following five key factors that may have triggered the recent profit booking:Tensions are high in the region after Israel killed Hezbollah leader Sayyed Hassan Nasrallah in Beirut, followed by increased attacks against the Hezbollah militia in Lebanon and Houthi militia in Yemen.The ongoing tensions in the Middle East, particularly between Israel and Iran, have added volatility to global markets, especially with crude oil prices rising by over five per cent in the past two days. The situation escalated after a missile strike in Beirut and retaliatory threats between Israel and Iran.Also Read: Top 10 worst single-day market falls so far in 2024 as Sensex, Nifty crash for 5th day\"The increase in geopolitical tensions between Israel and Iran weighed on risk assets. In global news, mounting geopolitical tensions have contributed to a shaky start for the stock market in October,\" said Shrikant Chouhan, Head of Equity Research at Kotak Securities.Iran launched over 180 ballistic missiles at Israel. Experts say the fresh escalation has made investors cautious, driving them away from risker equities and betting on safe-haven assets like gold.Also Read: Gold and equities shine in FY25: Key drivers behind the surge and what’s next for investors\"Polymarket, a decentralized prediction platform, currently forecasts a 38 per cent chance of an Israeli response to Iran's attack by Friday. This could lead to a potential shift of capital into safe-haven assets like gold,\" said Justin Khoo, Senior Market Analyst APAC, VT Markets.Escalating tensions in the Middle East have driven up crude oil prices, with Brent crude futures rising more than one per cent on Friday, resulting in a substantial week-to-date gain of 10 per cent. The heightened Middle East tensions significantly impact oil price oversupply concerns, given that this region accounts for one-third of global oil production.One-fifth of the world’s crude passes through the Strait of Hormuz. Fears are mounting that Israel could retaliate by targeting Iran's major oil fields, which would likely push oil prices even higher. The only factor limiting the gain in oil prices is the December supply-output plan by the Organisation of Petroleum Exporting Countries and its allies (OPEC+).Also Read: Gold vs Oil | Yellow metal up 13%, Brent crashes 17% in three months: What should you bet on amid rate cuts?“The bearish sentiment continued as investors monitored the escalating conflict in the Middle East and adopted a sell-on recovery strategy. Crude prices have increased sharply but may be restricted due to increased production from OPEC+,\" said Vinod Nair, Head of Research, Geojit Financial Services.The drag was across sectors led by realty, auto, and FMCG, except IT stocks, which gained due to expected benefits from US rate cuts and their defensive nature. The pessimism on the market is expected to continue in the near term amidst rising crude prices, and fund flows to cheaper markets like China,” added Nair.Foreign Institutional Investors (FIIs) offloaded equities worth  ₹15,243.27 crore on Thursday, a record high. Foreign portfolio investors (FPIs) were the most significant sellers during the recent market downturn, withdrawing nearly  ₹30,613 crore from Indian markets over the last three trading sessions.Also Read: US Fed delivers supersized 50 bps rate cut: FPI inflows to stronger INR—here’s how the verdict is ‘good’ for IndiaA substantial portion of this selling occurred on Thursday alone, amounting to  ₹15,243 crore, marking the largest daily outflow by foreign investors in the last four years. There are growing concerns about FPIs shifting investments back to China, especially as Beijing has implemented a series of policy measures to revive its struggling economy and bolster its capital markets.\"The last three days have witnessed huge FII selling of  ₹30,614 crore in the cash market. FIIs are moving money from expensive India to cheap Hong Kong on expectations that the Chinese authorities monetary and fiscal stimulus will stimulate the Chinese economy and improve the earnings of Chinese companies.Also Read: China’s economic boost: What experts say about its impact on Indian economy and stock market\"It remains to be seen how this Chinese recovery hopes to play out. The market direction in the near term will be influenced by the tug-of-war between the FIIs and DIIs,\" said Dr V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services.Capital markets regulator Securities and Exchange Board of India (SEBI) implemented six of seven measures recommended by an expert panel to cool the exuberance in India's booming derivatives market and curb the rush in F\u0026O trading.The six that could impact volumes the most are the reduction in weekly expiries per exchange from five to just one, the increase in lot size to  ₹15-20 lakh from  ₹5-10 lakh, and the removal of the calendar spread benefit on expiry day. SEBI’s latest F\u0026O regulations introduce changes that will impact market participants in varying ways, which is why the stock market is taking time to digest these announcements.Also Read: SEBI approves new asset class for HNIs, passive fund framework; rights issue timeline slashed: 5 key highlightsAccording to Narinder Wadhwa, Managing Director at SKI Capital Services Ltd, By introducing these products, SEBI is following global trends of alternative investments for HNIs, encouraging portfolio diversification and bringing more liquidity to the market. The move strikes a balance between allowing access to higher returns and ensuring investor protection through regulation.\"Discount brokers like Zerodha and Groww, which cater to retail traders, may experience lower trading volumes due to the increase in contract size and restriction of weekly expiries to one benchmark index per exchange. In contrast, traditional brokers and wealth managers may face less impact, as their client base consists of more institutional and HNIs.Also Read: ‘SEBI changes F\u0026O game, not a bad idea on expiry day’: Capitalmind’s Deepak Shenoy on new derivates frameworkThe limitation on weekly expiries could benefit the BSE, as it may attract traders shifting from NSE. While discount brokers and retail traders are expected to adjust to these changes, AMCs and depositories will likely remain unaffected. RTAs may experience operational changes without significant disruptions,\" said Krishna Appala, Senior Research Analyst at Capitalmind Research.Experts say China's recent stimulus measures could lure foreign investors away from India due to the former's cheaper valuation. According to Dr. V K Vijayakumar of Geojit Financial Services, one significant factor influencing foreign portfolios is the outperformance of Chinese stocks, reflected in the massive surge in the Hang Seng index by around 18 per cent in September.This surge has been triggered by hopes of a revival in the Chinese economy in response to the monetary and fiscal stimulus announced by the Chinese authorities. China's central bank will cut banks' reserve requirement ratio (RRR) by 50 basis points, releasing about one trillion yuan ($142.21 billion) for new lending. Moreover, China's central bank will cut the seven-day reverse repo rate by 0.2 percentage points to 1.5 per cent.Also Read: China’s Market Rally: Will India feel the ripple effect or remain unscathed?\"The cheap valuations of Chinese stocks are keeping the momentum intact. This can be a tactical trade that can be sustained for some more time. This means FIIs may continue selling in India and move more money to better-performing markets. FII selling is unlikely to impact the Indian market significantly since the massive domestic money can easily absorb whatever the FIIs are selling,\" said Dr. V K Vijayakumar.D-Street experts say corrections such as this can be categorized as technical corrections, as the Indian growth story remains intact. Such corrections should be expected, especially when markets are at an all-time high.“While there may be a pause or slight rebound after the recent slide, the overall bias will remain negative unless Nifty decisively reclaims the 25,600 level. Key sectors such as IT, metal, and pharma show resilience, while others face selling pressure during rallies. Traders should adjust their positions accordingly and consider adopting a hedged approach,” said Ajit Mishra – SVP, Research, Religare Broking Ltd.Also Read: US Fed pivot: Does the FOMC policy rate verdict impact global central banks? Here’s what 10-year data revealsHistorically, these technical corrections have been brought into play, particularly with the high cash levels available to domestic investors. One should use this opportunity to nibble into quality stocks and deploy incremental money into their mutual fund portfolios.\"Though this correction may feel painful, it will look like an opportunity in hindsight, similar to the correction of election results. Retail investors should maintain their asset allocation and rebalance their assets if we witness a meaningful correction of 10 per cent or more during this technical phase,\" said Lt. Col. (Retd.) Rochak Bakshi, Founder and CEO of True North Financial Services.","cleaned_content":"stock market crash domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e extended losses for the fifth straight session on friday october \u003cFOUR_\u003e in an exceptionally volatile session and logged their worst week in over two years amid weak geopolitical tensions and foreign outflows todays crash comes after a two per cent decline seen in the previous session the frontline indices lost about \u003cFOUR_PERCENT\u003e each for the week their worst since june \u003cTWO_THOUSAND\u003e overall the indices ended the truncated september \u003cTHREE_TEN\u003e october \u003cFOUR_\u003e week after three straight weeks of positive returns from their record highs scaled on september \u003cTWO_TEN\u003e the benchmarks have dropped over five per cent also read market close sensex nifty slide for \u003cFIVE_\u003e th straight session crash \u003cONE_PERCENT\u003e amid israel iran war worriesfalling for the fifth day running on friday the \u003cTHREE_TEN\u003e share bse sensex tumbled \u003cEIGHT_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e the benchmark hit a low of \u003cEIGHT_TEN_THOUSAND\u003e and a high of \u003cEIGHT_TEN_THOUSAND\u003e during the day reflecting a wild swing of \u003cONE_THOUSAND\u003e points during the session the nse nifty \u003cFIVE_TEN\u003e slumped \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cTWO_TEN_THOUSAND\u003e intra day it hit a high of \u003cTWO_TEN_THOUSAND\u003e during the last leg of the trade the benchmarks again slipped into the red sensex shed \u003cONE_THOUSAND\u003e points from the days high of \u003cEIGHT_TEN_THOUSAND\u003e while the nifty tanked \u003cFIVE_HUNDRED\u003e points to its days low of \u003cTWO_TEN_THOUSAND\u003e the broader more domestically focused small and mid caps fell \u003cTWO_PERCENT\u003e and \u003cTHREE_PERCENT\u003e for the week mukesh ambani led reliance industries the second heaviest nifty \u003cFIVE_TEN\u003e stock shed \u003cNINE_PERCENT\u003e leading the indexs losses this week over the past five trading sessions indian stock markets have experienced a substantial decline in investor wealth with approximately \u003cONE_TEN\u003e lakh crore being wiped out last week the total market capitalization of indian stocks was \u003cFOUR_HUNDRED\u003e lakh crore but this week it has dropped to \u003cFOUR_HUNDRED\u003e lakh crore marking a steep loss of \u003cONE_TEN\u003e lakh crore in just five sessions also read nifty \u003cFIVE_TEN\u003e slides \u003cFOUR_PERCENT\u003e this week posts largest weekly drop since june \u003cTWO_THOUSAND\u003e on growing iran israel war fears fii outflowsthe escalating middle east conflict raised alarm bells that crude supplies from the top oil producing region may be disrupted this has increased crude oil prices hurting net importers such as india the spike in oil prices on supply uncertainty due to geopolitical tensions has dented market sentiments d street analysts also attributed the market drop this week to aggressive foreign selling foreign outflows from indian markets hit a record high on thursday as investors directed inflows into china after its recent stimulus measures indian stock market benchmarks have nosedived for five days as investors book profits at record high levels d street experts highlight the following five key factors that may have triggered the recent profit booking tensions are high in the region after israel killed hezbollah leader sayyed hassan nasrallah in beirut followed by increased attacks against the hezbollah militia in lebanon and houthi militia in yemen the ongoing tensions in the middle east particularly between israel and iran have added volatility to global markets especially with crude oil prices rising by over five per cent in the past two days the situation escalated after a missile strike in beirut and retaliatory threats between israel and iran also read top \u003cONE_TEN\u003e worst single day market falls so far in \u003cTWO_THOUSAND\u003e as sensex nifty crash for \u003cFIVE_\u003e th day the increase in geopolitical tensions between israel and iran weighed on risk assets in global news mounting geopolitical tensions have contributed to a shaky start for the stock market in october said shrikant chouhan head of equity research at kotak securities iran launched over \u003cONE_HUNDRED\u003e ballistic missiles at israel experts say the fresh escalation has made investors cautious driving them away from risker equities and betting on safe haven assets like gold also read gold and equities shine in fy25 key drivers behind the surge and what s next for investors polymarket a decentralized prediction platform currently forecasts a \u003cTHREE_TEN_PERCENT\u003e chance of an israeli response to irans attack by friday this could lead to a potential shift of capital into safe haven assets like gold said justin khoo senior market analyst apac vt markets escalating tensions in the middle east have driven up crude oil prices with brent crude futures rising more than one per cent on friday resulting in a substantial week to date gain of \u003cONE_TEN_PERCENT\u003e the heightened middle east tensions significantly impact oil price oversupply concerns given that this region accounts for one third of global oil production one fifth of the world s crude passes through the strait of hormuz fears are mounting that israel could retaliate by targeting irans major oil fields which would likely push oil prices even higher the only factor limiting the gain in oil prices is the december supply output plan by the organisation of petroleum exporting countries and its allies opec also read gold vs oil yellow metal up \u003cONE_TEN_PERCENT\u003e brent crashes \u003cONE_TEN_PERCENT\u003e in three months what should you bet on amid rate cuts the bearish sentiment continued as investors monitored the escalating conflict in the middle east and adopted a sell on recovery strategy crude prices have increased sharply but may be restricted due to increased production from opec said vinod nair head of research geojit financial services the drag was across sectors led by realty auto and fmcg except it stocks which gained due to expected benefits from us rate cuts and their defensive nature the pessimism on the market is expected to continue in the near term amidst rising crude prices and fund flows to cheaper markets like china added nair foreign institutional investors fiis offloaded equities worth \u003cONE_TEN_THOUSAND\u003e crore on thursday a record high foreign portfolio investors fpis were the most significant sellers during the recent market downturn withdrawing nearly \u003cTHREE_TEN_THOUSAND\u003e crore from indian markets over the last three trading sessions also read us fed delivers supersized \u003cFIVE_TEN\u003e bps rate cut fpi inflows to stronger inr here s how the verdict is good for indiaa substantial portion of this selling occurred on thursday alone amounting to \u003cONE_TEN_THOUSAND\u003e crore marking the largest daily outflow by foreign investors in the last four years there are growing concerns about fpis shifting investments back to china especially as beijing has implemented a series of policy measures to revive its struggling economy and bolster its capital markets the last three days have witnessed huge fii selling of \u003cTHREE_TEN_THOUSAND\u003e crore in the cash market fiis are moving money from expensive india to cheap hong kong on expectations that the chinese authorities monetary and fiscal stimulus will stimulate the chinese economy and improve the earnings of chinese companies also read china s economic boost what experts say about its impact on indian economy and stock market it remains to be seen how this chinese recovery hopes to play out the market direction in the near term will be influenced by the tug of war between the fiis and diis said dr v k vijayakumar chief investment strategist at geojit financial services capital markets regulator securities and exchange board of india sebi implemented six of seven measures recommended by an expert panel to cool the exuberance in indias booming derivatives market and curb the rush in f o trading the six that could impact volumes the most are the reduction in weekly expiries per exchange from five to just one the increase in lot size to \u003cONE_TEN\u003e \u003cTWO_TEN\u003e lakh from \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh and the removal of the calendar spread benefit on expiry day sebi s latest f o regulations introduce changes that will impact market participants in varying ways which is why the stock market is taking time to digest these announcements also read sebi approves new asset class for hnis passive fund framework rights issue timeline slashed \u003cFIVE_\u003e key highlightsaccording to narinder wadhwa managing director at ski capital services ltd by introducing these products sebi is following global trends of alternative investments for hnis encouraging portfolio diversification and bringing more liquidity to the market the move strikes a balance between allowing access to higher returns and ensuring investor protection through regulation discount brokers like zerodha and groww which cater to retail traders may experience lower trading volumes due to the increase in contract size and restriction of weekly expiries to one benchmark index per exchange in contrast traditional brokers and wealth managers may face less impact as their client base consists of more institutional and hnis also read sebi changes f o game not a bad idea on expiry day capitalmind s deepak shenoy on new derivates frameworkthe limitation on weekly expiries could benefit the bse as it may attract traders shifting from nse while discount brokers and retail traders are expected to adjust to these changes amcs and depositories will likely remain unaffected rtas may experience operational changes without significant disruptions said krishna appala senior research analyst at capitalmind research experts say chinas recent stimulus measures could lure foreign investors away from india due to the formers cheaper valuation according to dr v k vijayakumar of geojit financial services one significant factor influencing foreign portfolios is the outperformance of chinese stocks reflected in the massive surge in the hang seng index by around \u003cONE_TEN_PERCENT\u003e in september this surge has been triggered by hopes of a revival in the chinese economy in response to the monetary and fiscal stimulus announced by the chinese authorities chinas central bank will cut banks reserve requirement ratio rrr by \u003cFIVE_TEN\u003e basis points releasing about one trillion yuan \u003cONE_HUNDRED\u003e billion for new lending moreover chinas central bank will cut the seven day reverse repo rate by \u003cZERO_PERCENT\u003e age points to \u003cONE_PERCENT\u003e also read china s market rally will india feel the ripple effect or remain unscathed the cheap valuations of chinese stocks are keeping the momentum intact this can be a tactical trade that can be sustained for some more time this means fiis may continue selling in india and move more money to better performing markets fii selling is unlikely to impact the indian market significantly since the massive domestic money can easily absorb whatever the fiis are selling said dr v k vijayakumar d street experts say corrections such as this can be categorized as technical corrections as the indian growth story remains intact such corrections should be expected especially when markets are at an all time high while there may be a pause or slight rebound after the recent slide the overall bias will remain negative unless nifty decisively reclaims the \u003cTWO_TEN_THOUSAND\u003e level key sectors such as it metal and pharma show resilience while others face selling pressure during rallies traders should adjust their positions accordingly and consider adopting a hedged approach said ajit mishra svp research religare broking ltd also read us fed pivot does the fomc policy rate verdict impact global central banks here s what \u003cONE_TEN\u003e year data revealshistorically these technical corrections have been brought into play particularly with the high cash levels available to domestic investors one should use this opportunity to nibble into quality stocks and deploy incremental money into their mutual fund portfolios though this correction may feel painful it will look like an opportunity in hindsight similar to the correction of election results retail investors should maintain their asset allocation and rebalance their assets if we witness a meaningful correction of \u003cONE_TEN_PERCENT\u003e or more during this technical phase said lt col retd rochak bakshi founder and ceo of true north financial services","timestamp":"2024-10-04T17:53:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}