{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-slides-over-4-4-this-week-posts-largest-weekly-drop-since-june-2022-as-iran-israel-war-fears-intensify-11728035226560.html","title":"Nifty 50 slides 4.4% this week, posts largest weekly drop since June 2022 on growing Iran-Israel war fears, FII outflows","description":"Escalating Middle East tensions have significantly impacted the Indian market, resulting in substantial losses for the Nifty 50 and Sensex. The Nifty 50 saw a weekly drop of 4.45%, with real estate stocks hit hardest, while rising oil prices add further economic pressure.","content":"Concerns over escalating tensions in the Middle East weighed heavily on the Indian market this week, driving the benchmark equity indices lower for the fifth consecutive session on Friday, 4 October.Both the Sensex and the Nifty clocked significant losses in Friday's trading session. The Nifty 50 closed 0.81% lower at 25,014 on rising concerns that Israel may retaliate against Iran by targeting its oil facilities. This decline contributed to a total drop of 4.45% for the week, marking the index's largest weekly decline since June 2022, when it fell by 5.61%.The recent market correction has resulted in a significant decline of 1,129 points in Nifty this week alone. Similarly, the S\u0026P BSE Sensex fell by 4.54% this week, dropping below the 82,000 mark to settle at 81,688.Among the hardest-hit sectors, real estate topped the chart as the Nifty Realty index plunged 8.7% this week. Nifty Financial Services followed with a 6.2% decline, while Nifty Auto also experienced a significant decline of 5.7%.The escalating tensions in the Middle East have also driven up oil prices, with Brent crude futures rising more than 1% on Friday, resulting in a substantial week-to-date gain of 10%. Heightened Middle East tensions have a significant impact on oil prices, given that this region accounts for one-third of global oil production, and one-fifth of the world’s crude passes through the Strait of Hormuz.Corporate India is increasingly concerned about the impact of rising crude oil prices and freight costs, along with disruptions to air shipping routes caused by the ongoing conflict between Iran and Israel. Escalating crude oil prices could have repercussions for various sectors in India, including aviation, automotive, paints, tyres, cement, chemicals, synthetic textiles, and flexible packaging.According to ICRA, an increase in crude prices poses risks to India’s Wholesale Price Index (WPI)-based inflation, as well as, to a lesser extent, projections related to Consumer Price Index (CPI) inflation for FY25. A persistent rise in crude oil prices could also hinder GDP growth during the fiscal year.Moreover, the pressure from higher inflation may result in sustained interest rates until the geopolitical crisis stabilises.Foreign portfolio investors (FPIs) were the most significant sellers during the recent market downturn, withdrawing nearly  ₹30,613 crore from Indian markets over the last three trading sessions. A substantial portion of this selling occurred on Thursday alone, amounting to  ₹15,243 crore, marking the largest daily outflow by FPIs in the last four years.There are growing concerns that FPIs might shift their investments back to China, especially as Beijing has implemented a series of policy measures aimed at reviving its struggling economy and bolstering its capital markets.However, opinions within the industry are divided on this prospect. While some analysts believe that the attractiveness of India's growth potential may outweigh the allure of China, others caution that India's relatively high valuations could deter investors.Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said, \"FIIs are moving money from expensive India to cheap Hong Kong on expectations that the monetary and fiscal stimulus being implemented by the Chinese authorities will stimulate the Chinese economy and improve earnings of Chinese companies. It remains to be seen how this Chinese recovery hopes to play out.\"\"The market direction in the near term will be influenced by the tug-of-war going on between the FIIs and DIIs. The present reality is that DIIs have deeper pockets than FIIs, and they have a greater conviction to buy the India growth story,\" he added.Meanwhile, the U.S. non-farm payrolls report is set to be released later today, which is keenly eyed by investors as this key indicator could influence the future direction of U.S. interest rates.","cleaned_content":"concerns over escalating tensions in the middle east weighed heavily on the indian market this week driving the benchmark equity indices lower for the fifth consecutive session on friday \u003cFOUR_\u003e october both the sensex and the nifty clocked significant losses in fridays trading session the nifty \u003cFIVE_TEN\u003e closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e on rising concerns that israel may retaliate against iran by targeting its oil facilities this decline contributed to a total drop of \u003cFOUR_PERCENT\u003e for the week marking the indexs largest weekly decline since june \u003cTWO_THOUSAND\u003e when it fell by \u003cFIVE_PERCENT\u003e the recent market correction has resulted in a significant decline of \u003cONE_THOUSAND\u003e points in nifty this week alone similarly the s p bse sensex fell by \u003cFOUR_PERCENT\u003e this week dropping below the \u003cEIGHT_TEN_THOUSAND\u003e mark to settle at \u003cEIGHT_TEN_THOUSAND\u003e among the hardest hit sectors real estate topped the chart as the nifty realty index plunged \u003cEIGHT_PERCENT\u003e this week nifty financial services followed with a \u003cSIX_PERCENT\u003e decline while nifty auto also experienced a significant decline of \u003cFIVE_PERCENT\u003e the escalating tensions in the middle east have also driven up oil prices with brent crude futures rising more than \u003cONE_PERCENT\u003e on friday resulting in a substantial week to date gain of \u003cONE_TEN_PERCENT\u003e heightened middle east tensions have a significant impact on oil prices given that this region accounts for one third of global oil production and one fifth of the world s crude passes through the strait of hormuz corporate india is increasingly concerned about the impact of rising crude oil prices and freight costs along with disruptions to air shipping routes caused by the ongoing conflict between iran and israel escalating crude oil prices could have repercussions for various sectors in india including aviation automotive paints tyres cement chemicals synthetic textiles and flexible packaging according to icra an increase in crude prices poses risks to india s wholesale price index wpi based inflation as well as to a lesser extent projections related to consumer price index cpi inflation for fy25 a persistent rise in crude oil prices could also hinder gdp growth during the fiscal year moreover the pressure from higher inflation may result in sustained interest rates until the geopolitical crisis stabilises foreign portfolio investors fpis were the most significant sellers during the recent market downturn withdrawing nearly \u003cTHREE_TEN_THOUSAND\u003e crore from indian markets over the last three trading sessions a substantial portion of this selling occurred on thursday alone amounting to \u003cONE_TEN_THOUSAND\u003e crore marking the largest daily outflow by fpis in the last four years there are growing concerns that fpis might shift their investments back to china especially as beijing has implemented a series of policy measures aimed at reviving its struggling economy and bolstering its capital markets however opinions within the industry are divided on this prospect while some analysts believe that the attractiveness of indias growth potential may outweigh the allure of china others caution that indias relatively high valuations could deter investors dr v k vijayakumar chief investment strategist geojit financial services said fiis are moving money from expensive india to cheap hong kong on expectations that the monetary and fiscal stimulus being implemented by the chinese authorities will stimulate the chinese economy and improve earnings of chinese companies it remains to be seen how this chinese recovery hopes to play out the market direction in the near term will be influenced by the tug of war going on between the fiis and diis the present reality is that diis have deeper pockets than fiis and they have a greater conviction to buy the india growth story he added meanwhile the u s non farm payrolls report is set to be released later today which is keenly eyed by investors as this key indicator could influence the future direction of u s interest rates","timestamp":"2024-10-04T16:39:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}