{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-markets-israel-iran-5-stocks-to-buy-or-sell-on-friday-oct-11-11728558288741.html","title":"Stock market today: Trade setup for Nifty 50 to global markets; five stocks to buy or sell on Friday — Oct 11","description":"Stock Market Today: The benchmark indices trying to find direction are consolidating post correction and 25130 for Nifty-50 index and 82000 for BSE Sensex would be the key breakout level as per experts","content":"Stock Market Today: The Nifty 50 index, continuing its consolidation phase, ended with a marginal gain of 0.07% at 24,998.45 on Thursday, October 10. The S\u0026P BSE Sensex also ended with 0.18% gains at 81,611.41.The Bank Nifty rose 1.07% to 51,530.90 and was well supported by the metal and energy sectors. However, pharma and IT saw sharp declines. Broader indices failed to build on early momentum and closed on a mixed note.The current market texture is non-directional, said Shrikant Chouhan, Head of Equity Research, Kotak Securities, who feels 25,130 for Nifty and 82,000 for Sensex would be the key breakout levels. Above the same, the market could bounce back to 25,260-25,300 levels for the Nifty and 82,300-82,500 levels for the Sensex.Bank Nifty witnessed a pullback to the key hourly moving averages (51,700 – 51,800). Jatin Gedia – Technical Research Analyst at Sharekhan expects the pullback to continue on the upside and towards 52,000 – 52,400.Asian equities mostly rose on Friday triggered by overnight gains in the US stocks. European shares slipped on Thursday, with technology and mining stocks leading losses, as investors awaited the US inflation data which along with initial jobless claims numbers is expected to decide the course to be taken by the US Federal Reserve regarding its future monetary policy.Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd expects the market to consolidate in a range with stock-specific action.Sumeet Bagadia, Executive Director at Choice Broking, has recommended two stock picks for Friday. Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi has suggested three stock ideas for today.These include Apar Industries Ltd, Gujarat Fluorochemicals Ltd, Clean Science and Technology Ltd, GAIL (India) Ltd and Mahindra \u0026 Mahindra Ltd.1. Apar Industries Ltd - Bagadia recommends buying Apar Industries at  ₹10,649.7, keeping a stop loss at  ₹10,250 for a target price of  ₹11,350.Apar Industries is currently trading at 10,649.7 and remains in an uptrend, as observed by the series of higher highs and higher lows formed over time. The stock has recently touched an all-time high of 10,720, indicating it is still in an uptrend, supported by a significant increase in volume. If the stock manages to close above its key resistance level of 10,700, it could reach a short-term target of 11,350.2. Gujarat Fluorochemicals Ltd - Bagadia recommends buying Gujarat Fluorochemicals at  ₹4,659.75 keeping a stop loss at  ₹4,488 for a target price of  ₹4,900.Gujarat Fluorochemicals is presently trading at 4,659.75 levels. On the daily chart, the stock has formed a strong bullish momentum candle, signifying a resurgence of strength in its price action. A robust support level is situated at 4,488 levels. This confluence of support factors enhances the stock's stability and resilience.3.  Clean Science and Technology Ltd - Dongre recommends buying Clean Science and Technology at  ₹1,520 with a stop loss of  ₹1,485 for a target price of  ₹1,595.The stock has substantial support at  ₹1,485, marking a crucial juncture in its recent trading. Presently, at Rs1,520, the stock has demonstrated a definitive reversal in price action, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at  ₹1,485. The anticipated target for this trade is  ₹1,595, representing the next significant resistance level. This strategy positions traders favourably to capitalise on the stock's anticipated rally in the weeks ahead.4. GAIL (India) Ltd - Dongre recommends buying GAIL at  ₹226 with a stop loss at  ₹218 for a target of  ₹235.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around  ₹235. At present, the stock is maintaining a crucial support level at  ₹218. Given the current market price of  ₹226, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of  ₹235.5 Mahindra \u0026 Mahindra Ltd -  Dongre recommends buying  Mahindra \u0026 Mahindra at  ₹3,200 with a stop loss of  ₹3,140 and a target price of  ₹3,330.On the daily chart of this stock, a breakout at the  ₹3,200 price level has been observed, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at  ₹3,140 is recommended. The target price for this strategy is  ₹3,330 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"stock market today the nifty \u003cFIVE_TEN\u003e index continuing its consolidation phase ended with a marginal gain of \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e on thursday october \u003cONE_TEN\u003e the s p bse sensex also ended with \u003cZERO_PERCENT\u003e gains at \u003cEIGHT_TEN_THOUSAND\u003e the bank nifty rose \u003cONE_PERCENT\u003e to \u003cFIVE_TEN_THOUSAND\u003e and was well supported by the metal and energy sectors however pharma and it saw sharp declines broader indices failed to build on early momentum and closed on a mixed note the current market texture is non directional said shrikant chouhan head of equity research kotak securities who feels \u003cTWO_TEN_THOUSAND\u003e for nifty and \u003cEIGHT_TEN_THOUSAND\u003e for sensex would be the key breakout levels above the same the market could bounce back to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels for the nifty and \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e levels for the sensex bank nifty witnessed a pullback to the key hourly moving averages \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e jatin gedia technical research analyst at sharekhan expects the pullback to continue on the upside and towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e asian equities mostly rose on friday triggered by overnight gains in the us stocks european shares slipped on thursday with technology and mining stocks leading losses as investors awaited the us inflation data which along with initial jobless claims numbers is expected to decide the course to be taken by the us federal reserve regarding its future monetary policy siddhartha khemka head research wealth management motilal oswal financial services ltd expects the market to consolidate in a range with stock specific action sumeet bagadia executive director at choice broking has recommended two stock picks for friday ganesh dongre senior manager of technical research at anand rathi has suggested three stock ideas for today these include apar industries ltd gujarat fluorochemicals ltd clean science and technology ltd gail india ltd and mahindra mahindra ltd 1 apar industries ltd bagadia recommends buying apar industries at \u003cONE_TEN_THOUSAND\u003e keeping a stop loss at \u003cONE_TEN_THOUSAND\u003e for a target price of \u003cONE_TEN_THOUSAND\u003e apar industries is currently trading at \u003cONE_TEN_THOUSAND\u003e and remains in an uptrend as observed by the series of higher highs and higher lows formed over time the stock has recently touched an all time high of \u003cONE_TEN_THOUSAND\u003e indicating it is still in an uptrend supported by a significant increase in volume if the stock manages to close above its key resistance level of \u003cONE_TEN_THOUSAND\u003e it could reach a short term target of \u003cONE_TEN_THOUSAND\u003e gujarat fluorochemicals ltd bagadia recommends buying gujarat fluorochemicals at \u003cFOUR_THOUSAND\u003e keeping a stop loss at \u003cFOUR_THOUSAND\u003e for a target price of \u003cFOUR_THOUSAND\u003e gujarat fluorochemicals is presently trading at \u003cFOUR_THOUSAND\u003e levels on the daily chart the stock has formed a strong bullish momentum candle signifying a resurgence of strength in its price action a robust support level is situated at \u003cFOUR_THOUSAND\u003e levels this confluence of support factors enhances the stocks stability and resilience 3 clean science and technology ltd dongre recommends buying clean science and technology at \u003cONE_THOUSAND\u003e with a stop loss of \u003cONE_THOUSAND\u003e for a target price of \u003cONE_THOUSAND\u003e the stock has substantial support at \u003cONE_THOUSAND\u003e marking a crucial juncture in its recent trading presently at rs1 520 the stock has demonstrated a definitive reversal in price action suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at \u003cONE_THOUSAND\u003e the anticipated target for this trade is \u003cONE_THOUSAND\u003e representing the next significant resistance level this strategy positions traders favourably to capitalise on the stocks anticipated rally in the weeks ahead 4 gail india ltd dongre recommends buying gail at \u003cTWO_HUNDRED\u003e with a stop loss at \u003cTWO_HUNDRED\u003e for a target of \u003cTWO_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around \u003cTWO_HUNDRED\u003e at present the stock is maintaining a crucial support level at \u003cTWO_HUNDRED\u003e given the current market price of \u003cTWO_HUNDRED\u003e a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of \u003cTWO_HUNDRED\u003e mahindra mahindra ltd dongre recommends buying mahindra mahindra at \u003cTHREE_THOUSAND\u003e with a stop loss of \u003cTHREE_THOUSAND\u003e and a target price of \u003cTHREE_THOUSAND\u003e on the daily chart of this stock a breakout at the \u003cTHREE_THOUSAND\u003e price level has been observed signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at \u003cTHREE_THOUSAND\u003e is recommended the target price for this strategy is \u003cTHREE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-10-11T06:42:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}