{"url":"https://www.livemint.com/market/stock-market-news/ajmera-realty-share-price-jumps-over-6-on-strong-q2-business-updates-heres-what-technical-analysts-say-11728454259174.html","title":"Ajmera Realty share price jumps over 6% on strong Q2 business updates; here’s what technical analysts say","description":"Ajmera Realty share price rose over 6% after positive Q2FY25 updates, reporting  ₹254 crores in sales and  ₹133 crores in collections, with 20% growth. The company anticipates further demand amid favourable economic conditions and a strong response to luxury properties.","content":"Ajmera Realty share price surged over 6% during Wednesday's trading session following the release of positive business updates for the July-September quarter by the real estate company. In Q2FY25, Ajmera Realty \u0026 Infra India Ltd recorded sales worth  ₹254 crores and collected  ₹133 crores, marking a 1% and 20% growth, respectively, compared to Q2FY24. Ajmera Realty share price today opened at  ₹648.65 apiece on BSE, the stock touched an intraday high of  ₹675.45 per share, and an intraday low of  ₹643.45 apiece.“After holding on to its support levels of  ₹600, the prices have seen strong positive traction in the last two sessions. In today's session, we have seen a gap-up opening indicating a momentum shift towards bulls.  ₹600 remains a key support, whereas  ₹720 is the next key resistance to watch,” said Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One.On the other side, Ruchit Jain, Lead Research Analyst at 5paisa, believes Ajmera Realty share price is going through a consolidation phase, which seems to be a time-wise correction. Prices have support in the 600-550 range. There are no signs of a trended move, and hence, we expect the stock to continue rangebound moves.The company reported a significant 20% increase in collections over the past year, signalling improved operational efficiency and high customer demand. Sales were strong across the entire portfolio, confirming sustained demand for current projects. Notably, the company received a strong response for its luxury properties, Ajmera Manhattan and Ajmera Prive, demonstrating a keen interest in premium real estate.Ajmera Vihara in Bhandup, which was launched last quarter, has already sold 49%, indicating early success in a new market segment.\"On the strength of sales from the existing projects with several launches scheduled in the second half of FY25 during the festive season, we are confident in achieving our annual guidance and progressing towards our ambitious growth strategy,\" said Dhaval Ajmera, Director of the company.Commenting on RBI Monetary Policy today, Nitin Bavisi, CFO, Ajmera Realty \u0026 Infra India Ltd, believes that while the move by the RBI to keep the repo rate unchanged was on expected lines, the change in policy stance to 'Neutral' is an indication of a low rate regime. This coupled with lower inflation and the surplus system liquidity augurs well for the real estate industry.“In our view, the change in policy stance will help start the rate-easing cycle sooner. These developments set the stage for a positive sentiment at the homebuyers’ front with a strong backdrop of enhanced liquidity in the hands of the masses. Lower rates will enhance homebuyers' purchasing power. Indian real estate market is on a constant upward trajectory and we expect the demand to further intensify with the onset of thefestiveseason,” added Bavisi.","cleaned_content":"ajmera realty share price surged over \u003cSIX_PERCENT\u003e during wednesdays trading session following the release of positive business updates for the july september quarter by the real estate company in q2fy25 ajmera realty infra india ltd recorded sales worth \u003cTWO_HUNDRED\u003e crores and collected \u003cONE_HUNDRED\u003e crores marking a \u003cONE_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e growth respectively compared to q2fy24 ajmera realty share price today opened at \u003cSIX_HUNDRED\u003e apiece on bse the stock touched an intraday high of \u003cSIX_HUNDRED\u003e per share and an intraday low of \u003cSIX_HUNDRED\u003e apiece after holding on to its support levels of \u003cSIX_HUNDRED\u003e the prices have seen strong positive traction in the last two sessions in todays session we have seen a gap up opening indicating a momentum shift towards bulls \u003cSIX_HUNDRED\u003e remains a key support whereas \u003cSEVEN_HUNDRED\u003e is the next key resistance to watch said rajesh bhosale equity technical and derivative analyst at angel one on the other side ruchit jain lead research analyst at \u003cFIVE_\u003e paisa believes ajmera realty share price is going through a consolidation phase which seems to be a time wise correction prices have support in the \u003cSIX_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e range there are no signs of a trended move and hence we expect the stock to continue rangebound moves the company reported a significant \u003cTWO_TEN_PERCENT\u003e increase in collections over the past year signalling improved operational efficiency and high customer demand sales were strong across the entire portfolio confirming sustained demand for current projects notably the company received a strong response for its luxury properties ajmera manhattan and ajmera prive demonstrating a keen interest in premium real estate ajmera vihara in bhandup which was launched last quarter has already sold \u003cFOUR_TEN_PERCENT\u003e indicating early success in a new market segment on the strength of sales from the existing projects with several launches scheduled in the second half of fy25 during the festive season we are confident in achieving our annual guidance and progressing towards our ambitious growth strategy said dhaval ajmera director of the company commenting on rbi monetary policy today nitin bavisi cfo ajmera realty infra india ltd believes that while the move by the rbi to keep the repo rate unchanged was on expected lines the change in policy stance to neutral is an indication of a low rate regime this coupled with lower inflation and the surplus system liquidity augurs well for the real estate industry in our view the change in policy stance will help start the rate easing cycle sooner these developments set the stage for a positive sentiment at the homebuyers front with a strong backdrop of enhanced liquidity in the hands of the masses lower rates will enhance homebuyers purchasing power indian real estate market is on a constant upward trajectory and we expect the demand to further intensify with the onset of thefestiveseason added bavisi","timestamp":"2024-10-09T14:37:00+05:30","market_timestamp":"2024-10-09T14:37:00+05:30","off_market_hours":false}