{"url":"https://www.livemint.com/market/stock-market-news/top-10-worst-single-day-market-falls-so-far-in-2024-as-sensex-nifty-crash-for-5th-day-11728043783719.html","title":"Top 10 worst single-day market falls so far in 2024 as Sensex, Nifty crash for 5th day","description":"The benchmark equity indices, Sensex and Nifty, have been in a downtrend for the past five trading sessions. Amid this backdrop, here's a look at the worst intra-day falls so far in thecalendar year 2024.","content":"The Indian benchmark indices – the Sensex and the Nifty – have offered decent returns to investors so far this year, rising 13-15%. However, this rally has not been linear.This week alone, on Thursday, October 4, the benchmark indices experienced their worst single-day drop in over two months. This decline can be attributed to heavy selling by foreign portfolio investors (FPIs), who pulled out  ₹15,243 crore on that day, marking the largest daily outflow by FPIs in the last four years. In addition, growing concerns around tensions in the Middle East weighed heavily on investor sentiment.Both the Sensex and the Nifty extended this decline into Friday's trade, shedding nearly 1% each. The Nifty breached the 25,000 level in intra-day trade and finally settled near the day’s low, with a loss of over 200 points, or 0.90%, at 25,015.“We expect markets to consolidate next week amid cautiousness due to fears of escalating tensions in West Asia. With the earnings season starting next week, stock-specific action will continue. The focus will also remain on interest-sensitive stocks ahead of the RBI policy meeting. While a rate cut is not on the table, the commentary will hold significant importance,” said Siddhartha Khemka, Head of Research, Wealth Management at Motilal Oswal Financial Services.The largest single-day drop of this year occurred on June 4, the day the general election results were announced, with the Sensex falling by 5.74%. On that day, FPIs sold shares worth  ₹12,436 crore, highlighting the significant influence they have on Indian equity markets. Domestic Institutional Investors (DIIs) also contributed to the sell-off, recording net sales of  ₹3,319 crore.Meanwhile, the second-biggest fall of the year came on August 5, when the Sensex tumbled by 2.74%. The index took a hit amid a bearish mood in global markets, fueled by recessionary fears in the U.S. following disappointing job statistics and an unwinding of carry trades after the rapid rise of the yen. On this day, FPIs sold stocks worth over  ₹10,000 crore.","cleaned_content":"the indian benchmark indices the sensex and the nifty have offered decent returns to investors so far this year rising \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e however this rally has not been linear this week alone on thursday october \u003cFOUR_\u003e the benchmark indices experienced their worst single day drop in over two months this decline can be attributed to heavy selling by foreign portfolio investors fpis who pulled out \u003cONE_TEN_THOUSAND\u003e crore on that day marking the largest daily outflow by fpis in the last four years in addition growing concerns around tensions in the middle east weighed heavily on investor sentiment both the sensex and the nifty extended this decline into fridays trade shedding nearly \u003cONE_PERCENT\u003e each the nifty breached the \u003cTWO_TEN_THOUSAND\u003e level in intra day trade and finally settled near the day s low with a loss of over \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e we expect markets to consolidate next week amid cautiousness due to fears of escalating tensions in west asia with the earnings season starting next week stock specific action will continue the focus will also remain on interest sensitive stocks ahead of the rbi policy meeting while a rate cut is not on the table the commentary will hold significant importance said siddhartha khemka head of research wealth management at motilal oswal financial services the largest single day drop of this year occurred on june \u003cFOUR_\u003e the day the general election results were announced with the sensex falling by \u003cFIVE_PERCENT\u003e on that day fpis sold shares worth \u003cONE_TEN_THOUSAND\u003e crore highlighting the significant influence they have on indian equity markets domestic institutional investors diis also contributed to the sell off recording net sales of \u003cTHREE_THOUSAND\u003e crore meanwhile the second biggest fall of the year came on august \u003cFIVE_\u003e when the sensex tumbled by \u003cTWO_PERCENT\u003e the index took a hit amid a bearish mood in global markets fueled by recessionary fears in the u s following disappointing job statistics and an unwinding of carry trades after the rapid rise of the yen on this day fpis sold stocks worth over \u003cONE_TEN_THOUSAND\u003e crore","timestamp":"2024-10-04T17:51:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}