{"url":"https://www.livemint.com/market/stock-market-news/neopolitan-pizza-and-foods-ipo-day-3-check-for-subscription-status-gmp-key-dates-all-you-need-to-know-11727686630226.html","title":"NeoPolitan Pizza and Foods IPO Day 4: Check subscription status, GMP, key dates and other details","description":"NeoPolitan Pizza and Foods IPO, priced at  ₹20 per share, opened on September 30, 2024 and closes on 4 October. The offering consists of 60 lakh shares, with a minimum retail investment of  ₹120,000.","content":"NeoPolitan Pizza and Foods IPO: The initial public offering of NeoPolitan Pizza and Foods opened for subscription on Monday, September 30. Read below for details on subscription status, GMP and key dates.The IPO of NeoPolitan Pizza and Foods was subscribed 31.90 times on the fourth day of the bidding process as of 4.30 pm on Friday, October 4. The retail category was subscribed 41.07 times and the non-institutional investor (NII) portion 20.63 times.The subscription period for NeoPolitan Pizza and Foods IPO, which began on September 30, ends on October 4. On Monday, October 7, the allocation for NeoPolitan Pizza and Foods IPO is anticipated to be completed. The tentative listing date for NeoPolitan Pizza and Foods IPO is Wednesday, October 9, with the shares set to list on BSE SME.The  ₹12 crore NeoPolitan Pizza and Foods IPO is a fixed-price issue, with 60 lakh new shares on offer.The IPO price of NeoPolitan Pizza and Foods is  ₹20 per share. An application must have a minimum lot size of 6,000 shares. Retail investors thereby are required to invest a minimum of  ₹120,000. HNI quota requires a minimum investment of two lots, or 12,000 shares, totalling  ₹240,000.The registrar for the NeoPolitan Pizza and Foods IPO is Bigshare Services Pvt Ltd, while the book-running lead manager is Turnaround Corporate Advisors Private Limited. MNM Stock Broking is the market maker for NeoPolitan Pizza and Foods IPO.Information from Investorgain.com indicates that the GMP for the NeoPolitan Pizza \u0026 Foods IPO price was nil. Therefore, currently, the shares of NeoPolitan Pizza and Foods are available at zero premium over the issue price in the grey market.","cleaned_content":"neopolitan pizza and foods ipo the initial public offering of neopolitan pizza and foods opened for subscription on monday september \u003cTHREE_TEN\u003e read below for details on subscription status gmp and key dates the ipo of neopolitan pizza and foods was subscribed \u003cTHREE_TEN\u003e times on the fourth day of the bidding process as of \u003cFOUR_\u003e pm on friday october \u003cFOUR_\u003e the retail category was subscribed \u003cFOUR_TEN\u003e times and the non institutional investor nii portion \u003cTWO_TEN\u003e times the subscription period for neopolitan pizza and foods ipo which began on september \u003cTHREE_TEN\u003e ends on october \u003cFOUR_\u003e on monday october \u003cSEVEN_\u003e the allocation for neopolitan pizza and foods ipo is anticipated to be completed the tentative listing date for neopolitan pizza and foods ipo is wednesday october \u003cNINE_\u003e with the shares set to list on bse sme the \u003cONE_TEN\u003e crore neopolitan pizza and foods ipo is a fixed price issue with \u003cSIX_TEN\u003e lakh new shares on offer the ipo price of neopolitan pizza and foods is \u003cTWO_TEN\u003e per share an application must have a minimum lot size of \u003cSIX_THOUSAND\u003e shares retail investors thereby are required to invest a minimum of \u003cONE_HUNDRED_THOUSAND\u003e hni quota requires a minimum investment of two lots or \u003cONE_TEN_THOUSAND\u003e shares totalling \u003cTWO_HUNDRED_THOUSAND\u003e the registrar for the neopolitan pizza and foods ipo is bigshare services pvt ltd while the book running lead manager is turnaround corporate advisors private limited mnm stock broking is the market maker for neopolitan pizza and foods ipo information from investorgain com indicates that the gmp for the neopolitan pizza foods ipo price was nil therefore currently the shares of neopolitan pizza and foods are available at zero premium over the issue price in the grey market","timestamp":"2024-10-04T16:40:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}