{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-hi-tech-pipes-that-has-surged-130-in-one-year-completes-rs-500-crore-fundraise-via-qip-11728710766641.html","title":"Small-cap stock Hi-Tech Pipes that has surged 130% in one year completes  ₹500 crore fundraise via QIP","description":"Small-cap stock: Hi-Tech Pipes, a small-cap stock that has surged 130% in the past year, has successfully raised  ₹500 crore through a QIP","content":"Small-cap stock: Hi-Tech Pipes Limited, a small-cap company that has seen its stock price surged by around 130 per cent over the past year, has successfully raised  ₹500.79 crore through a Qualified Institutional Placement (QIP). The company made this announcement in a regulatory filing on October 11, 2024.The QIP, which opened on October 7 and closed on October 11, saw the company allot 2,69,96,734 equity shares to qualified institutional buyers at an issue price of  ₹185.50 per share. This price includes a premium of  ₹184.50 per share and represents a discount of 4.86 per cent to the floor price determined by SEBI regulations.Hi-Tech Pipes share price has risen by 68 per cent on year-to-date (YTD) basis rising from a level of  ₹119.45 to  ₹201.60, as per BSE. On Friday, October 11, Hi-Tech Pipes ended trading at  ₹201.25 per share, showing a decline. Hi-Tech Pipes share price has delivered an impressive 130 per cent return over the past year. Over the last two years, its value has jumped by 240 per cent.In March 2023, the company implemented a stock split, reducing the face value of each equity share from  ₹10 to  ₹1, effectively converting one share into 10. As of October 11, Hi-Tech Pipes holds a market capitalization of  ₹3,550.40 crore, based on BSE figures.Arun Kumar, Company Secretary and Compliance Officer of Hi-Tech Pipes, stated in the filing, \"The Fund Raising Committee at its meeting held today, i.e., October 11, 2024, approved the issue and allotment of 2,69,96,734 Equity Shares to eligible qualified institutional buyers.\"Following this allotment, the company's paid-up equity share capital has increased from  ₹17.61 crore to  ₹20.31 crore. The new shares will be listed on both the BSE and the National Stock Exchange (NSE).The QIP attracted a mix of domestic and foreign institutional investors. Notable domestic participants included Bandhan Mutual Fund, which was allotted 11.98 per cent of the total issue size, and Bank of India Mutual Fund. Foreign investors such as BOFA Securities Europe SA and Intuitive Alpha Investment Fund also participated significantly.","cleaned_content":"small cap stock hi tech pipes limited a small cap company that has seen its stock price surged by around \u003cONE_HUNDRED_PERCENT\u003e over the past year has successfully raised \u003cFIVE_HUNDRED\u003e crore through a qualified institutional placement qip the company made this announcement in a regulatory filing on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the qip which opened on october \u003cSEVEN_\u003e and closed on october \u003cONE_TEN\u003e saw the company allot \u003cTWO_TEN_MILLION\u003e equity shares to qualified institutional buyers at an issue price of \u003cONE_HUNDRED\u003e per share this price includes a premium of \u003cONE_HUNDRED\u003e per share and represents a discount of \u003cFOUR_PERCENT\u003e to the floor price determined by sebi regulations hi tech pipes share price has risen by \u003cSIX_TEN_PERCENT\u003e on year to date ytd basis rising from a level of \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e as per bse on friday october \u003cONE_TEN\u003e hi tech pipes ended trading at \u003cTWO_HUNDRED\u003e per share showing a decline hi tech pipes share price has delivered an impressive \u003cONE_HUNDRED_PERCENT\u003e return over the past year over the last two years its value has jumped by \u003cTWO_HUNDRED_PERCENT\u003e in march \u003cTWO_THOUSAND\u003e the company implemented a stock split reducing the face value of each equity share from \u003cONE_TEN\u003e to \u003cONE_\u003e effectively converting one share into \u003cONE_TEN\u003e as of october \u003cONE_TEN\u003e hi tech pipes holds a market capitalization of \u003cTHREE_THOUSAND\u003e crore based on bse figures arun kumar company secretary and compliance officer of hi tech pipes stated in the filing the fund raising committee at its meeting held today i e october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e approved the issue and allotment of \u003cTWO_TEN_MILLION\u003e equity shares to eligible qualified institutional buyers following this allotment the companys paid up equity share capital has increased from \u003cONE_TEN\u003e crore to \u003cTWO_TEN\u003e crore the new shares will be listed on both the bse and the national stock exchange nse the qip attracted a mix of domestic and foreign institutional investors notable domestic participants included bandhan mutual fund which was allotted \u003cONE_TEN_PERCENT\u003e of the total issue size and bank of india mutual fund foreign investors such as bofa securities europe sa and intuitive alpha investment fund also participated significantly","timestamp":"2024-10-12T11:50:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}