{"url":"https://www.livemint.com/market/stock-market-news/metal-stocks-plunge-sharply-as-china-fails-to-announce-new-stimulus-measures-11728375584703.html","title":"Metal stocks plunge sharply as China fails to introduce new stimulus measures","description":"Metal stocks tanked today as investors were expecting Beijing to announce significant fiscal support, including trillions of yuan in bond issuances and initiatives to stimulate consumption. However, the government instead unveiled a modest investment plan of CNY 100 billion for the upcoming year.","content":"While the Indian stock market rebounded from a sharp six-day sell-off in Tuesday's trade, metal stocks experienced a significant decline, with many stocks in the Nifty Metal index dropping by as much as 4% after China's leading economic planner failed to introduce further stimulus measures.As a result, the Nifty Metal index fell 3.15% to its lowest point since September 24 to 9,574. Although the index witnessed some recovery in the afternoon session, it was still down by 1%. Leading the decline was NMDC, which experienced a significant drop of 4.4%. The stock at one point plummeted by as much as 8%. Tata Steel and JSW Steel also faced losses, declining by more than 2%.The much-anticipated briefing by China's National Development and Reform Commission ended without any new promises for increased government spending.Analysts were expecting Beijing to announce significant fiscal support, including trillions of yuan in bond issuances and initiatives to stimulate consumption. However, the government instead unveiled a modest investment plan of CNY 100 billion for the upcoming year, a stark contrast to the current year's allocation of CNY 1 trillion, as per the recent media reports.Consequently, copper prices hit two-week lows, with the November copper contract on the Shanghai Futures Exchange (SHFE) closing 1.9% lower at 77,310 yuan ($10,952.29) per metric ton. Moreover, the prices were also impacted due to increasing expectations of a less aggressive easing strategy from the Federal Reserve, following a stronger-than-anticipated jobs report for September.According to the CME FedWatch tool, the market has shifted its outlook, no longer factoring in a 50-basis-point cut at the Fed's November meeting after the robust jobs report from last week. Instead, there is now an 88% likelihood of a 25 basis-point reduction.Market participants are keenly awaiting the minutes from the Fed's recent policy meeting, which will be released on Wednesday. This will be followed by the U.S. Consumer Price Index (CPI) report on Thursday and the Producer Price Index (PPI) data on Friday. Additionally, several Fed officials are scheduled to speak throughout the week.Barring today's fall, Indian metal stocks have managed to hold their ground amid the recent market downturn, supported by a series of stimulus measures announced by Chinese authorities. These measures include reductions in lending rates, lowered reserve requirements, and direct fiscal support for lower-income groups, which have contributed to a noticeable increase in metal prices.Metal companies are projected to deliver mixed results for the September-ending quarter (Q2FY25), with ferrous metals anticipating a significant drop in profits, while non-ferrous metals are expected to gain sharply from firm prices.According to the brokerage firm Motilal Oswal, the steel sector is anticipated to report muted performance due to weak pricing and volumes. However, the brokerage expects that softened input costs may provide some cushion.It forecasts flat volumes due to seasonal monsoon impacts and cheaper imports. The Net Sales Realization (NSR) is expected to fall by approximately  ₹3,000-3,500 per ton quarter-on-quarter (QoQ) while coking coal costs could decline by $15-25 per ton.For non-ferrous companies under their coverage, the brokerage expects better revenue, EBITDA, and Profit After Tax (PAT) on a QoQ basis compared to ferrous companies. They anticipate that the aggregate EBITDA decline for non-ferrous companies will be in the mid-single digits.On the other hand, the brokerage expects mining companies in their coverage universe to report a sequential decline due to weak volumes amid the monsoon season and softened prices during Q2 FY25. They project a 16% QoQ decline in volume for Coal India and a 2% QoQ decline for NMDC. Additionally, NMDC's price cut of  ₹1,000 per ton in Q2 is expected to result in a ~26% decline in EBITDA.","cleaned_content":"while the indian stock market rebounded from a sharp six day sell off in tuesdays trade metal stocks experienced a significant decline with many stocks in the nifty metal index dropping by as much as \u003cFOUR_PERCENT\u003e after chinas leading economic planner failed to introduce further stimulus measures as a result the nifty metal index fell \u003cTHREE_PERCENT\u003e to its lowest point since september \u003cTWO_TEN\u003e to \u003cNINE_THOUSAND\u003e although the index witnessed some recovery in the afternoon session it was still down by \u003cONE_PERCENT\u003e leading the decline was nmdc which experienced a significant drop of \u003cFOUR_PERCENT\u003e the stock at one point plummeted by as much as \u003cEIGHT_PERCENT\u003e tata steel and jsw steel also faced losses declining by more than \u003cTWO_PERCENT\u003e the much anticipated briefing by chinas national development and reform commission ended without any new promises for increased government spending analysts were expecting beijing to announce significant fiscal support including trillions of yuan in bond issuances and initiatives to stimulate consumption however the government instead unveiled a modest investment plan of cny \u003cONE_HUNDRED\u003e billion for the upcoming year a stark contrast to the current years allocation of cny \u003cONE_\u003e trillion as per the recent media reports consequently copper prices hit two week lows with the november copper contract on the shanghai futures exchange shfe closing \u003cONE_PERCENT\u003e lower at \u003cSEVEN_TEN_THOUSAND\u003e yuan \u003cONE_TEN_THOUSAND\u003e per metric ton moreover the prices were also impacted due to increasing expectations of a less aggressive easing strategy from the federal reserve following a stronger than anticipated jobs report for september according to the cme fedwatch tool the market has shifted its outlook no longer factoring in a \u003cFIVE_TEN\u003e basis point cut at the feds november meeting after the robust jobs report from last week instead there is now an \u003cEIGHT_TEN_PERCENT\u003e likelihood of a \u003cTWO_TEN\u003e basis point reduction market participants are keenly awaiting the minutes from the feds recent policy meeting which will be released on wednesday this will be followed by the u s consumer price index cpi report on thursday and the producer price index ppi data on friday additionally several fed officials are scheduled to speak throughout the week barring todays fall indian metal stocks have managed to hold their ground amid the recent market downturn supported by a series of stimulus measures announced by chinese authorities these measures include reductions in lending rates lowered reserve requirements and direct fiscal support for lower income groups which have contributed to a noticeable increase in metal prices metal companies are projected to deliver mixed results for the september ending quarter q2fy25 with ferrous metals anticipating a significant drop in profits while non ferrous metals are expected to gain sharply from firm prices according to the brokerage firm motilal oswal the steel sector is anticipated to report muted performance due to weak pricing and volumes however the brokerage expects that softened input costs may provide some cushion it forecasts flat volumes due to seasonal monsoon impacts and cheaper imports the net sales realization nsr is expected to fall by approximately \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e per ton quarter on quarter qoq while coking coal costs could decline by \u003cONE_TEN\u003e \u003cTWO_TEN\u003e per ton for non ferrous companies under their coverage the brokerage expects better revenue ebitda and profit after tax pat on a qoq basis compared to ferrous companies they anticipate that the aggregate ebitda decline for non ferrous companies will be in the mid single digits on the other hand the brokerage expects mining companies in their coverage universe to report a sequential decline due to weak volumes amid the monsoon season and softened prices during q2 fy25 they project a \u003cONE_TEN_PERCENT\u003e qoq decline in volume for coal india and a \u003cTWO_PERCENT\u003e qoq decline for nmdc additionally nmdcs price cut of \u003cONE_THOUSAND\u003e per ton in q2 is expected to result in a \u003cTWO_TEN_PERCENT\u003e decline in ebitda","timestamp":"2024-10-08T15:36:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}