{"url":"https://www.livemint.com/market/stock-market-news/nykaa-share-price-falls-over-2-despite-decent-q2-business-update-11728360211642.html","title":"Nykaa share price falls over 2% despite decent Q2 business update","description":"Nykaa share price has fallen more than 11% in one month, but has gained over 8% in three months. The stock is up over 11% year-to-date (YTD) and has rallied over 27% in one year.","content":"Nykaa share price declined over 2% in early trade on Tuesday despite the company reporting decent Q2 business performance. Nykaa shares fell as much as 2.65% to  ₹188.80 apiece on the BSE.FSN E-Commerce Ventures, the parent company of Nykaa said its consolidated net revenue growth in the quarter ended September 2024 was in mid-twenties.“Nykaa’s beauty vertical delivered a robust net revenue as well as Net Sales Value (NSV) growth of mid-twenties, with GMV growth even higher. Strong overall performance was seen across omnichannel retail business, owned brands as well as eB2B distribution business, ahead of the festive season,” FSN E-Commerce Ventures said in a stock exchange filing on October 7.The company’s fashion vertical’s NSV growth is seen at around early teens in Q2FY25. The acquisition of LBB, Nykaa’s content platform business, continues to perform well, delivering high growth taking the overall vertical’s revenue growth to early twenties for this quarter, it added.Nykaa said that consumption has witnessed subdued demand in the first half of this financial year but industry expects to see gradual revival during the second half, driven by the festive and wedding season.The online beauty products retailer FSN E-Commerce Ventures is estimated to report 26.2% year-on-year (YoY) growth in Q2FY25 revenues to  ₹1,902 crore driven by BPC business while fashion would remain subdued, according to Nuvama Institutional Equities.Nykaa’s net profit in the second quarter of FY25 is expected to jump multifold to  ₹27.9 crore from  ₹9.3 crore, YoY. EBITDA is likely to rise 45% to  ₹116.9 crore from  ₹80.6 crore, while EBITDA margin may see a slight improvement to 6.1% in Q2FY25 from 5.4%, YoY, according to Nuvama estimates.Nykaa share price has fallen more than 11% in one month, but has gained over 8% in three months. The stock is up over 11% year-to-date (YTD) and has rallied over 27% in one year.At 9:45 am, Nykaa shares were trading 1.55% lower at  ₹190.95 apiece on the BSE.","cleaned_content":"nykaa share price declined over \u003cTWO_PERCENT\u003e in early trade on tuesday despite the company reporting decent q2 business performance nykaa shares fell as much as \u003cTWO_PERCENT\u003e to \u003cONE_HUNDRED\u003e apiece on the bse fsn e commerce ventures the parent company of nykaa said its consolidated net revenue growth in the quarter ended september \u003cTWO_THOUSAND\u003e was in mid twenties nykaa s beauty vertical delivered a robust net revenue as well as net sales value nsv growth of mid twenties with gmv growth even higher strong overall performance was seen across omnichannel retail business owned brands as well as eb2b distribution business ahead of the festive season fsn e commerce ventures said in a stock exchange filing on october \u003cSEVEN_\u003e the company s fashion vertical s nsv growth is seen at around early teens in q2fy25 the acquisition of lbb nykaa s content platform business continues to perform well delivering high growth taking the overall vertical s revenue growth to early twenties for this quarter it added nykaa said that consumption has witnessed subdued demand in the first half of this financial year but industry expects to see gradual revival during the second half driven by the festive and wedding season the online beauty products retailer fsn e commerce ventures is estimated to report \u003cTWO_TEN_PERCENT\u003e year on year yoy growth in q2fy25 revenues to \u003cONE_THOUSAND\u003e crore driven by bpc business while fashion would remain subdued according to nuvama institutional equities nykaa s net profit in the second quarter of fy25 is expected to jump multifold to \u003cTWO_TEN\u003e crore from \u003cNINE_\u003e crore yoy ebitda is likely to rise \u003cFOUR_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e crore from \u003cEIGHT_TEN\u003e crore while ebitda margin may see a slight improvement to \u003cSIX_PERCENT\u003e in q2fy25 from \u003cFIVE_PERCENT\u003e yoy according to nuvama estimates nykaa share price has fallen more than \u003cONE_TEN_PERCENT\u003e in one month but has gained over \u003cEIGHT_PERCENT\u003e in three months the stock is up over \u003cONE_TEN_PERCENT\u003e year to date ytd and has rallied over \u003cTWO_TEN_PERCENT\u003e in one year at \u003cNINE_\u003e \u003cFOUR_TEN\u003e am nykaa shares were trading \u003cONE_PERCENT\u003e lower at \u003cONE_HUNDRED\u003e apiece on the bse","timestamp":"2024-10-08T09:49:00+05:30","market_timestamp":"2024-10-08T09:49:00+05:30","off_market_hours":false}