{"url":"https://www.livemint.com/market/stock-market-news/central-govt-to-offload-5-stake-in-cochin-shipyard-through-ofs-at-1-540-per-share-11728998525173.html","title":"Central govt to offload 5% stake in Cochin Shipyard through OFS at  ₹1,540 per share","description":"The OFS features a base offer of 2.5 per cent, along with an additional 2.5 per cent available through a green shoe option. The sale is set to begin on October 16 for non-retail investors and on October 17 for retail investors.","content":"The Narendra Modi administration announced plans to divest a 5% stake in Cochin Shipyard Ltd through an Offer for Sale (OFS), with the minimum share price set at  ₹1,540. The OFS is scheduled to open on October 16, 2024, for non-retail investors and on October 17 for retail investors.The OFS features a base offer of 2.5 per cent, along with an additional 2.5 per cent available through a green shoe option. The sale is set to begin on October 16 for non-retail investors and on October 17 for retail investors.As of September 30, the government held a 72.86 per cent stake in Cochin Shipyard.Cochin Shipyard reported a remarkable 76.5 per cent year-on-year increase in net profit, reaching  ₹174.2 crore for the quarter ending June 30, 2024, compared to  ₹98.7 crore in the same quarter last year. The company's revenue from operations experienced a significant surge of 61.1 per cent, climbing to  ₹771.5 crore from  ₹475.9 crore in the same period of the previous fiscal year.At the operational level, the company's Earnings Before Interest, Tax, Depreciation, and Amortisation (EBITDA) more than doubled, rising 125 per cent to  ₹177.3 crore. The EBITDA margin improved to 23 per cent for the reporting quarter, up from 16.5 per cent in the corresponding period of the prior fiscal year.Cochin Shipyard's growth was primarily driven by its Ship Building segment, which saw revenue increase by 62 per cent from the previous year, totaling  ₹527 crore. This segment accounts for 68 per cent of the company’s overall revenue.The Ship Repair segment of the company, accounting for 32 per cent of total sales, experienced a revenue increase of 63 per cent compared to last year, reaching  ₹245 crore, while margins rose to 43 per cent from 24 per cent the previous year.As of Tuesday's market close, Cochin Shipyard's shares are down 44 per cent from their peak of  ₹2,977, achieved in July of this year. However, the stock remains up fourfold from its IPO price of  ₹432.","cleaned_content":"the narendra modi administration announced plans to divest a \u003cFIVE_PERCENT\u003e stake in cochin shipyard ltd through an offer for sale ofs with the minimum share price set at \u003cONE_THOUSAND\u003e the ofs is scheduled to open on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e for non retail investors and on october \u003cONE_TEN\u003e for retail investors the ofs features a base offer of \u003cTWO_PERCENT\u003e along with an additional \u003cTWO_PERCENT\u003e available through a green shoe option the sale is set to begin on october \u003cONE_TEN\u003e for non retail investors and on october \u003cONE_TEN\u003e for retail investors as of september \u003cTHREE_TEN\u003e the government held a \u003cSEVEN_TEN_PERCENT\u003e stake in cochin shipyard cochin shipyard reported a remarkable \u003cSEVEN_TEN_PERCENT\u003e year on year increase in net profit reaching \u003cONE_HUNDRED\u003e crore for the quarter ending june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to \u003cNINE_TEN\u003e crore in the same quarter last year the companys revenue from operations experienced a significant surge of \u003cSIX_TEN_PERCENT\u003e climbing to \u003cSEVEN_HUNDRED\u003e crore from \u003cFOUR_HUNDRED\u003e crore in the same period of the previous fiscal year at the operational level the companys earnings before interest tax depreciation and amortisation ebitda more than doubled rising \u003cONE_HUNDRED_PERCENT\u003e to \u003cONE_HUNDRED\u003e crore the ebitda margin improved to \u003cTWO_TEN_PERCENT\u003e for the reporting quarter up from \u003cONE_TEN_PERCENT\u003e in the corresponding period of the prior fiscal year cochin shipyards growth was primarily driven by its ship building segment which saw revenue increase by \u003cSIX_TEN_PERCENT\u003e from the previous year totaling \u003cFIVE_HUNDRED\u003e crore this segment accounts for \u003cSIX_TEN_PERCENT\u003e of the company s overall revenue the ship repair segment of the company accounting for \u003cTHREE_TEN_PERCENT\u003e of total sales experienced a revenue increase of \u003cSIX_TEN_PERCENT\u003e compared to last year reaching \u003cTWO_HUNDRED\u003e crore while margins rose to \u003cFOUR_TEN_PERCENT\u003e from \u003cTWO_TEN_PERCENT\u003e the previous year as of tuesdays market close cochin shipyards shares are down \u003cFOUR_TEN_PERCENT\u003e from their peak of \u003cTWO_THOUSAND\u003e achieved in july of this year however the stock remains up fourfold from its ipo price of \u003cFOUR_HUNDRED\u003e","timestamp":"2024-10-15T18:54:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}