{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-oct-14-11728716101308.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Oct 14; check target price for Divi’s, HCL Tech, Hindalco","description":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Divi's Laboratories, HCL Technologies, and Hindalco Industries. Check their target prices here","content":"Buy or sell stocks: The Indian stock market continued to trade in a narrow range for yet another session on Friday last week. The Nifty 50 index ended 34 points lower at the 24,964 mark, below the psychological 25,000 level. The BSE Sensex shed 230 points and closed at 81,381, while the Nifty Bank index finished 358 points lower at 51,172. The small-cap index went up 0.44% in the broad market, whereas the mid-cap index also added 0.44% during Friday deals.Sumeet Bagadia, Executive Director at Choice Broking, believes the overall Indian stock market bias is cautious, as the Nifty 50 stocks are trading in a tight 24,900 to 25,300 range. The Choice Broking expert said that a bullish or bearish trend could be assumed on the breakage of either side of this range. On breaching either side of this range, the 50-stock index may show a 200-point upward or downside move, said Bagadia.Sumeet Bagadia recommended buying Divi's Laboratories, HCL Technologies, and Hindalco Industries on Monday.1] Divi's Laboratories: Buy at  ₹6142.25, target  ₹6555, stop loss  ₹5925.Divi's Laboratories share price daily chart analysis offers a favourable view for the coming days ahead, indicating a sustainable upside bounce this week. The stock price moved in a larger consolidation pattern in the last few months and has broken out of the consolidation range of  ₹5300 to  ₹5450 this week.A sustainable move above the hurdle has already led to a decisive upside breakout, and the stock is now attempting to reach the next target of  ₹6555, potentially driving a sharp positive impact on the stock price.Furthermore, Divi's Laboratories share price is trading above its crucial 20-day, 50-day, and 100-day Exponential Moving Average (EMA) levels, reinforcing the bullish trend. The increase in trading volume and the stock trading above the Volume Weighted Average Price (VWAP) for the short term is  ₹6085, further supporting a bullish scenario. Investors, especially those who entered at lower levels, could consider a prudent approach by booking partial profits at the current market price (CMP). Simultaneously, trailing stop-loss orders near  ₹5925 levels can safeguard profits and manage risks effectively.For fresh investments, a disciplined strategy involves waiting for potential dips, considering entry points near  ₹6060 levels. Implementing a strict stop-loss at  ₹5925 levels offers a risk management mechanism, ensuring protection against adverse market movements.2] HCL Technologies: Buy at  ₹1839.65, target  ₹1950, stop loss  ₹1777.HCL Technologies' share price has demonstrated remarkable strength and positive momentum in recent high-volume trading sessions, currently trading at  ₹1839.65. The stock's recent consolidation within the  ₹1775 to  ₹1815 range has laid the foundation for a potential upward movement, emphasized by a bullish, engulfing candlestick pattern on the weekly charts.HCL Technologies share price maintains a robust technical posture by comfortably holding its position above the crucial 20-day, 50-day, and 200-day Exponential Moving Averages (EMA), reflecting a solid base and signalling a positive trend. The Relative Strength Index (RSI), a pivotal momentum indicator, is rising and currently stands at 65 levels.As HCL Technologies' share price gears up to confront the next target level at  ₹1950, its ability to sustain itself above critical support levels during pullbacks suggests a solid technical setup. They employ trailing stop losses with a protective buffer near the significant support level of  ₹1777 — a prudent risk management strategy for investors who entered the market at lower levels. In conclusion, the technical analysis paints a favourable picture of HCL Technologies' share price, indicating the potential for further upward movement and instilling confidence among investors.3] Hindalco Industries: Buy at  ₹747.35, target  ₹800, stop loss  ₹720.Hindalco share price Limited is currently trading at  ₹747.35, showcasing a notable uptrend from the support levels around  ₹715, in close proximity to its 20-day Exponential Moving Average (EMA). The stock's positive momentum is further confirmed by its positioning above the short-term (20-day), medium-term (50-day), and long-term (200-day) EMA levels, reinforcing its technical resilience.A significant breakthrough above the resistance at  ₹750, supported by robust volumes, underscores the stock's strength. A sustained closure above this resistance could propel the stock to the next target of  ₹800. Traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near 720, aiming for the target of  ₹800 and beyond.The momentum indicator, Relative Strength Index (RSI), is currently at 65 levels, indicating positive momentum in the stock. For those considering fresh investments, purchasing at the current market price (CMP) is a viable option, targeting  ₹800, with a stringent stop loss set at  ₹720 levels to manage risk effectively.","cleaned_content":"buy or sell stocks the indian stock market continued to trade in a narrow range for yet another session on friday last week the nifty \u003cFIVE_TEN\u003e index ended \u003cTHREE_TEN\u003e points lower at the \u003cTWO_TEN_THOUSAND\u003e mark below the psychological \u003cTWO_TEN_THOUSAND\u003e level the bse sensex shed \u003cTWO_HUNDRED\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty bank index finished \u003cTHREE_HUNDRED\u003e points lower at \u003cFIVE_TEN_THOUSAND\u003e the small cap index went up \u003cZERO_PERCENT\u003e in the broad market whereas the mid cap index also added \u003cZERO_PERCENT\u003e during friday deals sumeet bagadia executive director at choice broking believes the overall indian stock market bias is cautious as the nifty \u003cFIVE_TEN\u003e stocks are trading in a tight \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range the choice broking expert said that a bullish or bearish trend could be assumed on the breakage of either side of this range on breaching either side of this range the \u003cFIVE_TEN\u003e stock index may show a \u003cTWO_HUNDRED\u003e point upward or downside move said bagadia sumeet bagadia recommended buying divis laboratories hcl technologies and hindalco industries on monday 1 divis laboratories buy at \u003cSIX_THOUSAND\u003e target \u003cSIX_THOUSAND\u003e stop loss \u003cFIVE_THOUSAND\u003e divis laboratories share price daily chart analysis offers a favourable view for the coming days ahead indicating a sustainable upside bounce this week the stock price moved in a larger consolidation pattern in the last few months and has broken out of the consolidation range of \u003cFIVE_THOUSAND\u003e to \u003cFIVE_THOUSAND\u003e this week a sustainable move above the hurdle has already led to a decisive upside breakout and the stock is now attempting to reach the next target of \u003cSIX_THOUSAND\u003e potentially driving a sharp positive impact on the stock price furthermore divis laboratories share price is trading above its crucial \u003cTWO_TEN\u003e day \u003cFIVE_TEN\u003e day and \u003cONE_HUNDRED\u003e day exponential moving average ema levels reinforcing the bullish trend the increase in trading volume and the stock trading above the volume weighted average price vwap for the short term is \u003cSIX_THOUSAND\u003e further supporting a bullish scenario investors especially those who entered at lower levels could consider a prudent approach by booking partial profits at the current market price cmp simultaneously trailing stop loss orders near \u003cFIVE_THOUSAND\u003e levels can safeguard profits and manage risks effectively for fresh investments a disciplined strategy involves waiting for potential dips considering entry points near \u003cSIX_THOUSAND\u003e levels implementing a strict stop loss at \u003cFIVE_THOUSAND\u003e levels offers a risk management mechanism ensuring protection against adverse market movements 2 hcl technologies buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e hcl technologies share price has demonstrated remarkable strength and positive momentum in recent high volume trading sessions currently trading at \u003cONE_THOUSAND\u003e the stocks recent consolidation within the \u003cONE_THOUSAND\u003e to \u003cONE_THOUSAND\u003e range has laid the foundation for a potential upward movement emphasized by a bullish engulfing candlestick pattern on the weekly charts hcl technologies share price maintains a robust technical posture by comfortably holding its position above the crucial \u003cTWO_TEN\u003e day \u003cFIVE_TEN\u003e day and \u003cTWO_HUNDRED\u003e day exponential moving averages ema reflecting a solid base and signalling a positive trend the relative strength index rsi a pivotal momentum indicator is rising and currently stands at \u003cSIX_TEN\u003e levels as hcl technologies share price gears up to confront the next target level at \u003cONE_THOUSAND\u003e its ability to sustain itself above critical support levels during pullbacks suggests a solid technical setup they employ trailing stop losses with a protective buffer near the significant support level of \u003cONE_THOUSAND\u003e a prudent risk management strategy for investors who entered the market at lower levels in conclusion the technical analysis paints a favourable picture of hcl technologies share price indicating the potential for further upward movement and instilling confidence among investors 3 hindalco industries buy at \u003cSEVEN_HUNDRED\u003e target \u003cEIGHT_HUNDRED\u003e stop loss \u003cSEVEN_HUNDRED\u003e hindalco share price limited is currently trading at \u003cSEVEN_HUNDRED\u003e showcasing a notable uptrend from the support levels around \u003cSEVEN_HUNDRED\u003e in close proximity to its \u003cTWO_TEN\u003e day exponential moving average ema the stocks positive momentum is further confirmed by its positioning above the short term \u003cTWO_TEN\u003e day medium term \u003cFIVE_TEN\u003e day and long term \u003cTWO_HUNDRED\u003e day ema levels reinforcing its technical resilience a significant breakthrough above the resistance at \u003cSEVEN_HUNDRED\u003e supported by robust volumes underscores the stocks strength a sustained closure above this resistance could propel the stock to the next target of \u003cEIGHT_HUNDRED\u003e traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near \u003cSEVEN_HUNDRED\u003e aiming for the target of \u003cEIGHT_HUNDRED\u003e and beyond the momentum indicator relative strength index rsi is currently at \u003cSIX_TEN\u003e levels indicating positive momentum in the stock for those considering fresh investments purchasing at the current market price cmp is a viable option targeting \u003cEIGHT_HUNDRED\u003e with a stringent stop loss set at \u003cSEVEN_HUNDRED\u003e levels to manage risk effectively","timestamp":"2024-10-12T16:48:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}