{"url":"https://www.livemint.com/market/stock-market-news/fpi-rush-financials-healthcare-lead-inflows-in-september-it-sector-faces-selloff-11728286800993.html","title":"FPI Rush: Financials, healthcare lead inflows in September, IT sector faces sell-off","description":"FPIs poured  ₹27,200 crore into the Financial Services sector in September, reversing the outflows of  ₹12,008 crore in August and  ₹7,648 crore in July.","content":"Foreign Portfolio Investors (FPIs) extended their buying spree in the Indian stock market for the fourth consecutive month in September, buoyed by the US Federal Reserve’s supersized 50 basis point interest rate cut.According to data from the National Securities Depository Ltd. (NSDL), FPIs injected  ₹57,724 crore (approximately $6.89 billion) into domestic equities in September. This pushed total FPI investments in Indian stocks to  ₹89,717 crore during the first half of the financial year 2024-2025 (H1FY25).However, October marked a shift, as FPIs reversed course, resulting in a substantial outflow of  ₹27,142 crore from the Indian equity market in the first week of the month.The robust FPI activity in September propelled India’s benchmark indices, the Sensex and Nifty 50, to all-time highs. On September 27, the Sensex reached a record 85,978.25, while the Nifty 50 peaked at 26,277.35.“The September 18th rate cut and the dovish commentary by the Fed can be seen as a major pivot in interest rates. This can facilitate sustained flows to emerging markets like India,” said Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.The majority of FPI purchases were concentrated in financial stocks, as they turned bullish on the sector after several months of withdrawals. FPIs poured  ₹27,200 crore into the Financial Services sector in September, reversing the outflows of  ₹12,008 crore in August and  ₹7,648 crore in July. This influx contributed to a more than 3% rise in the Bank Nifty during the month.The Healthcare sector followed, attracting FPI investments of  ₹6,639 crore in September, building on inflows of  ₹5,831 crore in August and  ₹5,054 crore in July. Real Estate also garnered significant interest, with  ₹5,375 crore in FPI inflows.Other notable sectors that benefited from FPI interest include Fast-Moving Consumer Goods (FMCG), which saw inflows of  ₹4,900 crore, and Capital Goods, with inflows of  ₹4,002 crore. The Consumer Durables and Telecommunication sectors also witnessed inflows of  ₹3,736 crore and  ₹1,935 crore, respectively.In contrast, the Consumer Services and Automobile sectors saw the highest Foreign Portfolio Investors (FPI) outflows in September 2024. FPIs pulled out  ₹2,940 crore from the Consumer Services sector. The Automobile and Auto Components sector faced significant outflows amounting to  ₹2,106 crore, following a selloff of  ₹2,379 crore in August.FPIs also turned bearish on the Information Technology (IT) sector, recording net sales of  ₹1,219 crore in September, a sharp contrast to the  ₹4,036 crore in net inflows seen in August.Going ahead, investors are expected to closely monitor the Q2 earnings season and the forthcoming Reserve Bank of India (RBI) monetary policy announcement this week. Additionally, global developments such as the Israel-Iran conflict, a rebound in the US dollar, and potential further rate cuts by the US Federal Reserve will also play a crucial role in shaping FPI flows into the Indian stock markets.","cleaned_content":"foreign portfolio investors fpis extended their buying spree in the indian stock market for the fourth consecutive month in september buoyed by the us federal reserve s supersized \u003cFIVE_TEN\u003e basis point interest rate cut according to data from the national securities depository ltd nsdl fpis injected \u003cFIVE_TEN_THOUSAND\u003e crore approximately \u003cSIX_\u003e billion into domestic equities in september this pushed total fpi investments in indian stocks to \u003cEIGHT_TEN_THOUSAND\u003e crore during the first half of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e h1fy25 however october marked a shift as fpis reversed course resulting in a substantial outflow of \u003cTWO_TEN_THOUSAND\u003e crore from the indian equity market in the first week of the month the robust fpi activity in september propelled india s benchmark indices the sensex and nifty \u003cFIVE_TEN\u003e to all time highs on september \u003cTWO_TEN\u003e the sensex reached a record \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e peaked at \u003cTWO_TEN_THOUSAND\u003e the september \u003cONE_TEN\u003e th rate cut and the dovish commentary by the fed can be seen as a major pivot in interest rates this can facilitate sustained flows to emerging markets like india said dr v k vijayakumar chief investment strategist geojit financial services the majority of fpi purchases were concentrated in financial stocks as they turned bullish on the sector after several months of withdrawals fpis poured \u003cTWO_TEN_THOUSAND\u003e crore into the financial services sector in september reversing the outflows of \u003cONE_TEN_THOUSAND\u003e crore in august and \u003cSEVEN_THOUSAND\u003e crore in july this influx contributed to a more than \u003cTHREE_PERCENT\u003e rise in the bank nifty during the month the healthcare sector followed attracting fpi investments of \u003cSIX_THOUSAND\u003e crore in september building on inflows of \u003cFIVE_THOUSAND\u003e crore in august and \u003cFIVE_THOUSAND\u003e crore in july real estate also garnered significant interest with \u003cFIVE_THOUSAND\u003e crore in fpi inflows other notable sectors that benefited from fpi interest include fast moving consumer goods fmcg which saw inflows of \u003cFOUR_THOUSAND\u003e crore and capital goods with inflows of \u003cFOUR_THOUSAND\u003e crore the consumer durables and telecommunication sectors also witnessed inflows of \u003cTHREE_THOUSAND\u003e crore and \u003cONE_THOUSAND\u003e crore respectively in contrast the consumer services and automobile sectors saw the highest foreign portfolio investors fpi outflows in september \u003cTWO_THOUSAND\u003e fpis pulled out \u003cTWO_THOUSAND\u003e crore from the consumer services sector the automobile and auto components sector faced significant outflows amounting to \u003cTWO_THOUSAND\u003e crore following a selloff of \u003cTWO_THOUSAND\u003e crore in august fpis also turned bearish on the information technology it sector recording net sales of \u003cONE_THOUSAND\u003e crore in september a sharp contrast to the \u003cFOUR_THOUSAND\u003e crore in net inflows seen in august going ahead investors are expected to closely monitor the q2 earnings season and the forthcoming reserve bank of india rbi monetary policy announcement this week additionally global developments such as the israel iran conflict a rebound in the us dollar and potential further rate cuts by the us federal reserve will also play a crucial role in shaping fpi flows into the indian stock markets","timestamp":"2024-10-07T13:23:00+05:30","market_timestamp":"2024-10-07T13:23:00+05:30","off_market_hours":false}