{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-rajesh-palviya-of-axis-securities-suggests-these-three-stocks-to-buy-hold-and-accumulate-today-11728616252717.html","title":"Shares to buy or sell: Rajesh Palviya of Axis Securities suggests these three stocks to buy, hold and accumulate today","description":"Shares to buy or sell: Rajesh Palviya has recommended to buy, hold, and accumulate Laurus Labs Ltd, Polycab India Ltd, and Siemens Ltd.","content":"Stock Market News: On Friday, the domestic benchmark indices, Sensex and Nifty 50, started slightly down due to weakness in financial stocks. Meanwhile, Tata Consultancy Services (TCS), the leading software company in the country, managed to recover from its initial losses following a quarterly profit shortfall. TCS share price opened 2% lower due to the profit miss in the September quarter but later rebounded to trade 0.1% higher.The Nifty 50 index stood at 25,003.80 points, marking a 0.02% rise as of 9:52 IST. At the same time, the Sensex was flat at 81,632.85.Over the last two weeks, the Nifty 50 has experienced profit-booking, resulting in losses in seven out of nine sessions and a decrease of approximately 5% from the all-time high reached on Sept. 27. The financials and banks sectors both declined by 0.5% following a 1% increase in the previous session.Market volatility in the near-term is expected due to alternating FII selling and DII buying, as highlighted by Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. Chinese stocks' attractive valuations may lead to further FII selling in India, as Indian valuations are currently high. Concerns about earnings downgrades in H2 FY 25 make it challenging to sustain Indian valuations.A positive trend in the market is the accumulation of leading private sector banks, which are showing resilience even in a weak market. This segment is the most attractively valued in the current market, where there is a lack of valuation comfort. Expect a lot of stock-specific action in response to Q2 results in the coming days. Banking and IT sectors are likely to post reasonably good results.On 27th September 2024, the benchmark index reached an all-time high at 26,277 levels. However, a sharp price correction caused the index to drop by more than 1000 points. Currently, the benchmark index is trading below its 20 and 50-day SMA, indicating a short-term trend reversal. The crucial support zone is around 24,800-24,700 levels, and a breach of this level may lead to further downside towards 24,300-24,000 levels. Conversely, a relief rally towards 25,300-25,500 levels can be seen as an exit opportunity for short-term traders.Shares to buy or sell: Rajesh Palviya has recommended to buy, hold, and accumulate Laurus Labs Ltd, Polycab India Ltd, and Siemens Ltd.On the weekly time frame, the stock is trending higher within an \"Up-Sloping channel,\" forming a series of higher highs and higher lows, indicating a sustained uptrend. Recently, the stock has regained support at its 200-day SMA (433) and bounced back strongly, indicating bullish sentiment. The daily and monthly Relative Strength Index (RSI) is in positive terrain, justifying increasing strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of 550-590 with downside support zone of 440-430 levels.The stock is currently in a strong uptrend across all time frames, forming a series of higher tops and bottoms. It recently reached an all-time high at 7585 levels, indicating bullish sentiments. On the weekly chart, the stock has confirmed a \"rounding bottom\" formation at 7,340 levels with significant trading volumes, further supporting the bullish outlook. Additionally, the stock is trading above its 20-day, 50-day, 100-day, and 200-day simple moving averages (SMA), all of which are trending upwards, reinforcing the bullish trend. The daily, weekly, and monthly Relative Strength Index (RSI) indicators are all in positive terrain, confirming strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of 7,700-8,000 with downside support zone of 7,250-7,060 levels.In the recent sessions, the stock has exceeded the previous swing high of 7550 levels on a closing basis, indicating a positive bias. The stock has also regained its 20, 50, and 100-day Simple Moving Averages (SMA) and rebounded sharply. The daily, weekly, and monthly Relative Strength Index (RSI) indicators are in positive terrain, supporting increasing strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of 8,200-8,750 with downside support zone of 7,350-7,000 levels.","cleaned_content":"stock market news on friday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e started slightly down due to weakness in financial stocks meanwhile tata consultancy services tcs the leading software company in the country managed to recover from its initial losses following a quarterly profit shortfall tcs share price opened \u003cTWO_PERCENT\u003e lower due to the profit miss in the september quarter but later rebounded to trade \u003cZERO_PERCENT\u003e higher the nifty \u003cFIVE_TEN\u003e index stood at \u003cTWO_TEN_THOUSAND\u003e points marking a \u003cZERO_PERCENT\u003e rise as of \u003cNINE_\u003e \u003cFIVE_TEN\u003e ist at the same time the sensex was flat at \u003cEIGHT_TEN_THOUSAND\u003e over the last two weeks the nifty \u003cFIVE_TEN\u003e has experienced profit booking resulting in losses in seven out of nine sessions and a decrease of approximately \u003cFIVE_PERCENT\u003e from the all time high reached on sept \u003cTWO_TEN\u003e the financials and banks sectors both declined by \u003cZERO_PERCENT\u003e following a \u003cONE_PERCENT\u003e increase in the previous session market volatility in the near term is expected due to alternating fii selling and dii buying as highlighted by dr v k vijayakumar chief investment strategist at geojit financial services chinese stocks attractive valuations may lead to further fii selling in india as indian valuations are currently high concerns about earnings downgrades in h2 fy \u003cTWO_TEN\u003e make it challenging to sustain indian valuations a positive trend in the market is the accumulation of leading private sector banks which are showing resilience even in a weak market this segment is the most attractively valued in the current market where there is a lack of valuation comfort expect a lot of stock specific action in response to q2 results in the coming days banking and it sectors are likely to post reasonably good results on \u003cTWO_TEN\u003e th september \u003cTWO_THOUSAND\u003e the benchmark index reached an all time high at \u003cTWO_TEN_THOUSAND\u003e levels however a sharp price correction caused the index to drop by more than \u003cONE_THOUSAND\u003e points currently the benchmark index is trading below its \u003cTWO_TEN\u003e and \u003cFIVE_TEN\u003e day sma indicating a short term trend reversal the crucial support zone is around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels and a breach of this level may lead to further downside towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels conversely a relief rally towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels can be seen as an exit opportunity for short term traders shares to buy or sell rajesh palviya has recommended to buy hold and accumulate laurus labs ltd polycab india ltd and siemens ltd on the weekly time frame the stock is trending higher within an up sloping channel forming a series of higher highs and higher lows indicating a sustained uptrend recently the stock has regained support at its \u003cTWO_HUNDRED\u003e day sma \u003cFOUR_HUNDRED\u003e and bounced back strongly indicating bullish sentiment the daily and monthly relative strength index rsi is in positive terrain justifying increasing strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e with downside support zone of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e levels the stock is currently in a strong uptrend across all time frames forming a series of higher tops and bottoms it recently reached an all time high at \u003cSEVEN_THOUSAND\u003e levels indicating bullish sentiments on the weekly chart the stock has confirmed a rounding bottom formation at \u003cSEVEN_THOUSAND\u003e levels with significant trading volumes further supporting the bullish outlook additionally the stock is trading above its \u003cTWO_TEN\u003e day \u003cFIVE_TEN\u003e day \u003cONE_HUNDRED\u003e day and \u003cTWO_HUNDRED\u003e day simple moving averages sma all of which are trending upwards reinforcing the bullish trend the daily weekly and monthly relative strength index rsi indicators are all in positive terrain confirming strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cSEVEN_THOUSAND\u003e \u003cEIGHT_THOUSAND\u003e with downside support zone of \u003cSEVEN_THOUSAND\u003e \u003cSEVEN_THOUSAND\u003e levels in the recent sessions the stock has exceeded the previous swing high of \u003cSEVEN_THOUSAND\u003e levels on a closing basis indicating a positive bias the stock has also regained its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e and \u003cONE_HUNDRED\u003e day simple moving averages sma and rebounded sharply the daily weekly and monthly relative strength index rsi indicators are in positive terrain supporting increasing strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cEIGHT_THOUSAND\u003e \u003cEIGHT_THOUSAND\u003e with downside support zone of \u003cSEVEN_THOUSAND\u003e \u003cSEVEN_THOUSAND\u003e levels","timestamp":"2024-10-11T10:00:00+05:30","market_timestamp":"2024-10-11T10:00:00+05:30","off_market_hours":false}