{"url":"https://www.livemint.com/market/stock-market-news/sensex-crashes-1-000-points-from-mondays-high-what-drags-the-indian-stock-market-11728280221166.html","title":"Sensex crashes 1,100 points from Monday’s high; what weighs on the Indian stock market?","description":"The Indian stock market experienced notable volatility on Monday, October 7, with the benchmark Sensex plunging nearly 1,100 points from its intraday high amid a broad-based selloff.","content":"The Indian stock market experienced notable volatility on Monday, October 7, with the benchmark Sensex plunging 1,088 points from its intraday high amid a broad-based selloff. The Sensex opened at 81,926.99 against its previous close of 81,688.45 and rose nearly 450 points to 82,137.77. The index, however, erased all gains and finally ended 638 points, or 0.78 per cent, lower at 81,050.The Nifty 50 opened at 25,084.10 against its previous close of 25,014.60 and touched its intraday high and low of 25,143 and 24,694.35, respectively. The Nifty 50 ended 219 points, or 0.87 per cent, down at 24,795.75. The volatility index India VIX jumped over 6 per cent.The mid and small-cap segments suffered stronger losses. The BSE Midcap index fell 1.85 per cent, while the BSE Smallcap index plunged 3.27 per cent.The overall market capitalisation of the firms listed on the BSE dropped to nearly  ₹452 lakh crore from nearly  ₹461 lakh crore in the previous session, making investors lose nearly  ₹9 lakh crore in a single session. In the last six sessions, investors have lost nearly  ₹25 lakh crore.The Sensex and Nifty 50 have remained red for six consecutive sessions, shedding over 5 per cent each. The market's decline has been largely driven by significant selloffs from foreign portfolio investors (FPIs).According to NSDL data, FPIs offloaded Indian equities worth  ₹27,142 crore in just the first three days of October. Much of this capital is being directed to China, following the country's recent measures to support its economy and financial markets. The shift is driven by the attractive valuations in the Chinese market compared to the premium valuations in the Indian market.Chinese markets have seen perplexing gains in the last few sessions. Over the last week, the Shanghai Composite Index has jumped 21 per cent, and the Hang Seng index has surged over 15 per cent.\"The massive FPI selling is the primary factor behind the market's fall. FPIs have sold more than  ₹40,000 crore in the last four days. The Hang Seng index is up by 32 per cent in one month. Big money is moving from India to China. This is abnormal. Markets tend to overreact. This is 'sell India and buy China'. How long it will last remains to be seen,\" said V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services.Apart from the FPI selling, geopolitical tensions and exit poll results of the Haryana and J\u0026K elections have also contributed to the market's poor show.\"Markets are trading under pressure as investor sentiment turned sour following exit poll results of Haryana and J\u0026K elections, which showed the BJP lagging behind its peers. Also, the ongoing geopolitical tensions in the Middle East and the constant selling from the FPIs are keeping investors on their toes,\" said Manish Chowdhury, the head of research at StoxBox.Anshul Jain, the head of Research at Lakshmishree Investment and Securities, also pointed out that the immediate reason for the weakness on Dalal Street can be attributed to the double blow predicted by the Assembly Exit Polls for Haryana and Jammu \u0026 Kashmir. However, the Middle East tension caused by the Israel-Iran war and developments in China is still pulling down the global markets, including the Indian stock market.Experts remain positive about the market's medium—to long-term prospects due to the durable growth of the Indian economy and the substantial influx of domestic investors.In the near term, experts expect a bounce back as the market looks oversold.According to Chowdhury, the markets have corrected sharply in the past week, and there should be a reversal in the short term.\"The reversal's sustenance would depend on the outcome of the RBI policy meeting this week and corporate earnings going ahead,\" said Chowdhury.According to Shrikant Chouhan, the head of equity research at Kotak Securities, after a long time, the domestic market slipped below the 50-day SMA (simple moving average). It also formed a bearish candle on daily charts and held a lower top formation on intraday charts, which is largely negative.\"The larger market texture is weak, but due to temporary oversold conditions, we could see non-directional activity in the near future. For the day traders now, 24,700/80,700 and 24,650/80,500 would be the key support zone, while 25,000/81,800 and 50-day SMA, or 25,050/82,000, could be the key resistance areas for the bulls. Short-term traders should remain cautious and be very selective as there is a risk of getting trapped at lower levels,\" said Chouhan.Read all market-related news here","cleaned_content":"the indian stock market experienced notable volatility on monday october \u003cSEVEN_\u003e with the benchmark sensex plunging \u003cONE_THOUSAND\u003e points from its intraday high amid a broad based selloff the sensex opened at \u003cEIGHT_TEN_THOUSAND\u003e against its previous close of \u003cEIGHT_TEN_THOUSAND\u003e and rose nearly \u003cFOUR_HUNDRED\u003e points to \u003cEIGHT_TEN_THOUSAND\u003e the index however erased all gains and finally ended \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e opened at \u003cTWO_TEN_THOUSAND\u003e against its previous close of \u003cTWO_TEN_THOUSAND\u003e and touched its intraday high and low of \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e respectively the nifty \u003cFIVE_TEN\u003e ended \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e down at \u003cTWO_TEN_THOUSAND\u003e the volatility index india vix jumped over \u003cSIX_PERCENT\u003e the mid and small cap segments suffered stronger losses the bse midcap index fell \u003cONE_PERCENT\u003e while the bse smallcap index plunged \u003cTHREE_PERCENT\u003e the overall market capitalisation of the firms listed on the bse dropped to nearly \u003cFOUR_HUNDRED\u003e lakh crore from nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors lose nearly \u003cNINE_\u003e lakh crore in a single session in the last six sessions investors have lost nearly \u003cTWO_TEN\u003e lakh crore the sensex and nifty \u003cFIVE_TEN\u003e have remained red for six consecutive sessions shedding over \u003cFIVE_PERCENT\u003e each the markets decline has been largely driven by significant selloffs from foreign portfolio investors fpis according to nsdl data fpis offloaded indian equities worth \u003cTWO_TEN_THOUSAND\u003e crore in just the first three days of october much of this capital is being directed to china following the countrys recent measures to support its economy and financial markets the shift is driven by the attractive valuations in the chinese market compared to the premium valuations in the indian market chinese markets have seen perplexing gains in the last few sessions over the last week the shanghai composite index has jumped \u003cTWO_TEN_PERCENT\u003e and the hang seng index has surged over \u003cONE_TEN_PERCENT\u003e the massive fpi selling is the primary factor behind the markets fall fpis have sold more than \u003cFOUR_TEN_THOUSAND\u003e crore in the last four days the hang seng index is up by \u003cTHREE_TEN_PERCENT\u003e in one month big money is moving from india to china this is abnormal markets tend to overreact this is sell india and buy china how long it will last remains to be seen said v k vijayakumar chief investment strategist at geojit financial services apart from the fpi selling geopolitical tensions and exit poll results of the haryana and j k elections have also contributed to the markets poor show markets are trading under pressure as investor sentiment turned sour following exit poll results of haryana and j k elections which showed the bjp lagging behind its peers also the ongoing geopolitical tensions in the middle east and the constant selling from the fpis are keeping investors on their toes said manish chowdhury the head of research at stoxbox anshul jain the head of research at lakshmishree investment and securities also pointed out that the immediate reason for the weakness on dalal street can be attributed to the double blow predicted by the assembly exit polls for haryana and jammu kashmir however the middle east tension caused by the israel iran war and developments in china is still pulling down the global markets including the indian stock market experts remain positive about the markets medium to long term prospects due to the durable growth of the indian economy and the substantial influx of domestic investors in the near term experts expect a bounce back as the market looks oversold according to chowdhury the markets have corrected sharply in the past week and there should be a reversal in the short term the reversals sustenance would depend on the outcome of the rbi policy meeting this week and corporate earnings going ahead said chowdhury according to shrikant chouhan the head of equity research at kotak securities after a long time the domestic market slipped below the \u003cFIVE_TEN\u003e day sma simple moving average it also formed a bearish candle on daily charts and held a lower top formation on intraday charts which is largely negative the larger market texture is weak but due to temporary oversold conditions we could see non directional activity in the near future for the day traders now \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e would be the key support zone while \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e and \u003cFIVE_TEN\u003e day sma or \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e could be the key resistance areas for the bulls short term traders should remain cautious and be very selective as there is a risk of getting trapped at lower levels said chouhan read all market related news here","timestamp":"2024-10-07T16:05:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}