{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-under-re-1-srestha-finvest-small-cap-stock-in-focus-as-board-sets-date-to-consider-fundraise-11728117930252.html","title":"Penny stock under Re 1: Small-cap stock in focus as board sets date to consider fundraise","description":"Penny stock under Re 1: The board of directors of the small-cap stock has fixed meeting on 9th October 2024","content":"Penny stock under Re 1: Srestha Finvest is one of those stocks that will be in focus on Monday. The board of directors of the small-cap stock has fixed a board meeting date on 9th October 2024 to consider the proposal for raising funds. The penny stock under Re 1 has informed the Indian stock market exchange about the decision. The BSE-listed penny stock below Re 1 hit a 5% upper circuit on Friday despite weak sentiments in the Indian stock market.The Non-Banking Financial Company (NBFC) informed the BSE on Friday about the board meeting date, saying, \"Pursuant to Regulation 29 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, the board meeting is scheduled to be held on October 09, 2024, to consider and approve fundraising, in one or more tranches, in compliance with the applicable provisions of law.\"The small-cap penny stock was in the news last month for trading ex-split. The company board had announced a stock split in a 1:2 ratio, and the stock split record date was fixed on 23rd September 2024. On 24th June 2024, the company fixed the record date for issuing rights to its eligible shareholders. So, if the small-cap company's board declares fundraising in its meeting on 9th October 2024, this would be the third big corporate decision the small-cap stock will declare this year.The small-cap penny stock under Re 1 has been on an uptrend for the last one week. The NBFC stock hit 55 upper circuits on all four sessions last week, logging around an 18.50% rise in the last five sessions. Considering the price adjustment post-stock split on 24th September 2024, this penny stock has delivered a 40% return to its positional investors in YTD time. In one year, this small-cap penny stock has given a 45% return to its shareholders.The small-cap NBFC stock is available for trade on BSE only. It ended Friday with a market cap of  ₹145 crore and a trade volume of 2,16,96,699. After price adjustment post-stock split in a 1:2 ratio, its 52-week high is  ₹1.28 apiece. Likewise, its 52-week low is  ₹0.49 per share.","cleaned_content":"penny stock under re \u003cONE_\u003e srestha finvest is one of those stocks that will be in focus on monday the board of directors of the small cap stock has fixed a board meeting date on \u003cNINE_\u003e th october \u003cTWO_THOUSAND\u003e to consider the proposal for raising funds the penny stock under re \u003cONE_\u003e has informed the indian stock market exchange about the decision the bse listed penny stock below re \u003cONE_\u003e hit a \u003cFIVE_PERCENT\u003e upper circuit on friday despite weak sentiments in the indian stock market the non banking financial company nbfc informed the bse on friday about the board meeting date saying pursuant to regulation \u003cTWO_TEN\u003e of sebi listing obligations and disclosure requirements regulations \u003cTWO_THOUSAND\u003e the board meeting is scheduled to be held on october \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e to consider and approve fundraising in one or more tranches in compliance with the applicable provisions of law the small cap penny stock was in the news last month for trading ex split the company board had announced a stock split in a \u003cONE_\u003e \u003cTWO_\u003e ratio and the stock split record date was fixed on \u003cTWO_TEN\u003e rd september \u003cTWO_THOUSAND\u003e on \u003cTWO_TEN\u003e th june \u003cTWO_THOUSAND\u003e the company fixed the record date for issuing rights to its eligible shareholders so if the small cap companys board declares fundraising in its meeting on \u003cNINE_\u003e th october \u003cTWO_THOUSAND\u003e this would be the third big corporate decision the small cap stock will declare this year the small cap penny stock under re \u003cONE_\u003e has been on an uptrend for the last one week the nbfc stock hit \u003cFIVE_TEN\u003e upper circuits on all four sessions last week logging around an \u003cONE_TEN_PERCENT\u003e rise in the last five sessions considering the price adjustment post stock split on \u003cTWO_TEN\u003e th september \u003cTWO_THOUSAND\u003e this penny stock has delivered a \u003cFOUR_TEN_PERCENT\u003e return to its positional investors in ytd time in one year this small cap penny stock has given a \u003cFOUR_TEN_PERCENT\u003e return to its shareholders the small cap nbfc stock is available for trade on bse only it ended friday with a market cap of \u003cONE_HUNDRED\u003e crore and a trade volume of \u003cTWO_TEN_MILLION\u003e after price adjustment post stock split in a \u003cONE_\u003e \u003cTWO_\u003e ratio its \u003cFIVE_TEN\u003e week high is \u003cONE_\u003e apiece likewise its \u003cFIVE_TEN\u003e week low is \u003cZERO_\u003e per share","timestamp":"2024-10-05T14:27:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}