{"url":"https://www.livemint.com/market/stock-market-news/shiv-texchem-share-price-lists-with-strong-44-premium-at-rs-239-on-the-bse-sme-11728962062808.html","title":"Shiv Texchem share price lists with strong 44% premium at  ₹239 on the BSE SME: Rises 5% further to hit upper circuit","description":"Shiv Texchem share price listed with a strong 44% premium at  ₹239 on the BSE SME on Tuesday. The IPO had received a strong response and GMP indicated good listing gains","content":"Shiv Texchem share price listed with a strong 44% premium at  ₹239 on the BSE SME on Tuesday.Shiv Texchem share price thereafter gained 5% to  ₹250.95 which remains the upper price band for the stock.The subscription received by the IPO and the GMP had indicated towards a good listing gainsThe initial public offer of Shiv Texchem had received strong response being subscribed 156.55 times. By October 10, 2024 (Day 3). The public issue had been subscribed 68.27 times in the retail category, 86.70 times in the QIB category, and 455.58 times in the NII category.156.55 times were subscribers to the Shiv Texchem IPO.The GMP for Shiv Texchem IPO stood at  ₹65 according to data from Investorgain.com. This implies that the shares of Shiv Texchem IPO can be purchased for  ₹65 more than the issue price in the grey market.After the subscription period ended, Shiv Texchem IPO GMP dropped to  ₹65 from  ₹74, however still indicated strong listing gains. According to the current GMP, investors of Shiv Texchem IPO anticipate that the company's shares will list at  ₹ 231 apiece, which represents a 39.16% premium over the upper end of the issue price of  ₹166.Shiv Texchem IPO is a book built issue of  ₹101.35 crores. The issue is entirely a fresh issue of 61.06 lakh shares.Shiv Texchem intends to use the proceeds from the IPO towards meeting its long-term working capital requirements; and General Corporate Purposes.Since being established in 2005, Shiv Texchem Limited has been importing and distributing secondary and tertiary chemicals based on hydrocarbons, which are crucial raw materials for a wide range of industries.The registrar for the Shiv Texchem IPO is Link Intime India Private Ltd, and the book running lead manager is Vivro Financial Services Private Limited.","cleaned_content":"shiv texchem share price listed with a strong \u003cFOUR_TEN_PERCENT\u003e premium at \u003cTWO_HUNDRED\u003e on the bse sme on tuesday shiv texchem share price thereafter gained \u003cFIVE_PERCENT\u003e to \u003cTWO_HUNDRED\u003e which remains the upper price band for the stock the subscription received by the ipo and the gmp had indicated towards a good listing gainsthe initial public offer of shiv texchem had received strong response being subscribed \u003cONE_HUNDRED\u003e times by october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e day \u003cTHREE_\u003e the public issue had been subscribed \u003cSIX_TEN\u003e times in the retail category \u003cEIGHT_TEN\u003e times in the qib category and \u003cFOUR_HUNDRED\u003e times in the nii category 156 55 times were subscribers to the shiv texchem ipo the gmp for shiv texchem ipo stood at \u003cSIX_TEN\u003e according to data from investorgain com this implies that the shares of shiv texchem ipo can be purchased for \u003cSIX_TEN\u003e more than the issue price in the grey market after the subscription period ended shiv texchem ipo gmp dropped to \u003cSIX_TEN\u003e from \u003cSEVEN_TEN\u003e however still indicated strong listing gains according to the current gmp investors of shiv texchem ipo anticipate that the companys shares will list at \u003cTWO_HUNDRED\u003e apiece which represents a \u003cTHREE_TEN_PERCENT\u003e premium over the upper end of the issue price of \u003cONE_HUNDRED\u003e shiv texchem ipo is a book built issue of \u003cONE_HUNDRED\u003e crores the issue is entirely a fresh issue of \u003cSIX_TEN\u003e lakh shares shiv texchem intends to use the proceeds from the ipo towards meeting its long term working capital requirements and general corporate purposes since being established in \u003cTWO_THOUSAND\u003e shiv texchem limited has been importing and distributing secondary and tertiary chemicals based on hydrocarbons which are crucial raw materials for a wide range of industries the registrar for the shiv texchem ipo is link intime india private ltd and the book running lead manager is vivro financial services private limited","timestamp":"2024-10-15T10:04:00+05:30","market_timestamp":"2024-10-15T10:04:00+05:30","off_market_hours":false}