{"url":"https://www.livemint.com/market/stock-market-news/multibagger-penny-stock-aa-plus-tradelink-locked-in-5-lower-circuit-as-board-to-consider-stock-split-and-bonus-issue-11728549740550.html","title":"Multibagger penny stock AA Plus Tradelink locked in 5% lower circuit as board to consider stock split and bonus issue","description":"AA Plus Tradelink shares fell 5 percent to  ₹20.63 on October 10, following the announcement of a board meeting on October 24 to discuss a potential stock split and bonus issue.","content":"Shares of AA Plus Tradelink was locked in its 5 percent lower circuit at  ₹20.63 on Thursday, October 10 after the company announced that its board will meet on October 24 to consider stock split and bonus issue.As per the filing, the Board of Directors of AA Plus Trade Link Ltd. is set to meet on Thursday, 24th October 2024, to consider two key corporate actions: a stock split and a bonus issue.For the stock split, the proposed ratio is up to 1:10, aimed at increasing liquidity by boosting the number of outstanding shares and reducing their face value. This move is expected to make the stock more accessible to retail investors and increase market participation.Meanwhile, the bonus issue, with a proposed 1:1 ratio, aims to reward shareholders by issuing additional shares in proportion to their holdings. This will be executed by capitalizing the company’s reserves, demonstrating its strong financial health while enhancing shareholder value without affecting cash reserves.The proposed actions align with the company’s long-term strategy to increase shareholder value, improve market accessibility, and enhance liquidity. SEBI and BSE regulations, including those related to stock splits, bonus issues, and insider trading, are being strictly followed, the exchange filing stated.Shareholders will be invited to discuss and vote on these actions at the upcoming Annual General Meeting, with further details to be communicated in due course, it added.The scrip has jumped 66 percent in the last 1 year but has given multibagger returns, soaring over 170 percent in 2024 YTD.Post today's decline, the stock is over 23 percent away from its record high of  ₹26.88, hit in July 2024. Meanwhile, it has rallied over 194 percent from its 52-week low of  ₹7.01, hit in February this year.Investing in penny stocks can be tempting because of the potential for significant returns with a small initial investment. However, this market comes with high risks. To manage the volatility of penny stocks, investors should conduct in-depth research and apply strong risk management practices. Essential steps include analyzing the company’s fundamentals, understanding its market position, and closely examining its financial health. Careful consideration of these factors can help investors make more informed decisions and better navigate the risks associated with this segment of the stock market.","cleaned_content":"shares of aa plus tradelink was locked in its \u003cFIVE_PERCENT\u003e lower circuit at \u003cTWO_TEN\u003e on thursday october \u003cONE_TEN\u003e after the company announced that its board will meet on october \u003cTWO_TEN\u003e to consider stock split and bonus issue as per the filing the board of directors of aa plus trade link ltd is set to meet on thursday \u003cTWO_TEN\u003e th october \u003cTWO_THOUSAND\u003e to consider two key corporate actions a stock split and a bonus issue for the stock split the proposed ratio is up to \u003cONE_\u003e \u003cONE_TEN\u003e aimed at increasing liquidity by boosting the number of outstanding shares and reducing their face value this move is expected to make the stock more accessible to retail investors and increase market participation meanwhile the bonus issue with a proposed \u003cONE_\u003e \u003cONE_\u003e ratio aims to reward shareholders by issuing additional shares in proportion to their holdings this will be executed by capitalizing the company s reserves demonstrating its strong financial health while enhancing shareholder value without affecting cash reserves the proposed actions align with the company s long term strategy to increase shareholder value improve market accessibility and enhance liquidity sebi and bse regulations including those related to stock splits bonus issues and insider trading are being strictly followed the exchange filing stated shareholders will be invited to discuss and vote on these actions at the upcoming annual general meeting with further details to be communicated in due course it added the scrip has jumped \u003cSIX_TEN_PERCENT\u003e in the last \u003cONE_\u003e year but has given multibagger returns soaring over \u003cONE_HUNDRED_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd post todays decline the stock is over \u003cTWO_TEN_PERCENT\u003e away from its record high of \u003cTWO_TEN\u003e hit in july \u003cTWO_THOUSAND\u003e meanwhile it has rallied over \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSEVEN_\u003e hit in february this year investing in penny stocks can be tempting because of the potential for significant returns with a small initial investment however this market comes with high risks to manage the volatility of penny stocks investors should conduct in depth research and apply strong risk management practices essential steps include analyzing the company s fundamentals understanding its market position and closely examining its financial health careful consideration of these factors can help investors make more informed decisions and better navigate the risks associated with this segment of the stock market","timestamp":"2024-10-10T15:12:00+05:30","market_timestamp":"2024-10-10T15:12:00+05:30","off_market_hours":false}