{"url":"https://www.livemint.com/market/stock-market-news/pranik-logistics-ipo-day-1-check-subscription-status-gmp-key-dates-and-other-key-details-11728554954317.html","title":"Pranik Logistics IPO Day 2: Check subscription status, GMP, key dates and other details","description":"Pranik Logistics IPO, priced at  ₹73- ₹77 per share, opened on October 10 and will close on October 14. It is an SME IPO worth  ₹22.47 crore. The company plans to use IPO proceeds to fund investment in technology.","content":"Pranik Logistics IPO: The subscription period for Pranik Logistics' initial public offering (IPO) started on October 10. The public offer will remain open for subscription till October 14. Check subscription status, GMP, key dates and other key details below.Pranik Logistics IPO was subscribed 3.94 times. on October 11 by 4.10 PM. The public issue had been subscribed 7.39 times in the retail category, 0 times in the QIB category, and 1.19 times in the NII category.Pranik Logistics IPO will go live on October 10, 2024, and end on October 14, 2024. On Tuesday, October 15, 2024, the allocation for Pranik Logistics IPO is anticipated to be completed. The proposed listing date for Pranik Logistics shares on NSE SME is Thursday, October 17.The IPO price range or price band is  ₹73– ₹77 per share. A minimum lot size of 1600 shares is required for an application. Hence, retail investors need to invest at least  ₹123,200. For HNIs, the minimum investment is two lots (3,200 shares) for which  ₹246,400 is required.The  ₹22.47 crore Pranik Logistics IPO is a book-built offering. The IPO is entirely a fresh issue of 29.18 lakh shares.The company plans to use the issue proceeds to meet the expenses for investment in technology. Some portion will also be utilised for the capital expenditure requirement, to fund working capital needs, and for general corporate purposes, as well as, to cover the issue expenses.Based on data from Investorgain.com, Pranik Logistics IPO has nil GMP. This means that the shares of Pranik Logistics are available in the grey market without any premium and at the upper band of the issue price of  ₹77.","cleaned_content":"pranik logistics ipo the subscription period for pranik logistics initial public offering ipo started on october \u003cONE_TEN\u003e the public offer will remain open for subscription till october \u003cONE_TEN\u003e check subscription status gmp key dates and other key details below pranik logistics ipo was subscribed \u003cTHREE_\u003e times on october \u003cONE_TEN\u003e by \u003cFOUR_\u003e pm the public issue had been subscribed \u003cSEVEN_\u003e times in the retail category \u003cZERO_\u003e times in the qib category and \u003cONE_\u003e times in the nii category pranik logistics ipo will go live on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and end on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on tuesday october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the allocation for pranik logistics ipo is anticipated to be completed the proposed listing date for pranik logistics shares on nse sme is thursday october \u003cONE_TEN\u003e the ipo price range or price band is \u003cSEVEN_TEN\u003e \u003cSEVEN_TEN\u003e per share a minimum lot size of \u003cONE_THOUSAND\u003e shares is required for an application hence retail investors need to invest at least \u003cONE_HUNDRED_THOUSAND\u003e for hnis the minimum investment is two lots \u003cTHREE_THOUSAND\u003e shares for which \u003cTWO_HUNDRED_THOUSAND\u003e is required the \u003cTWO_TEN\u003e crore pranik logistics ipo is a book built offering the ipo is entirely a fresh issue of \u003cTWO_TEN\u003e lakh shares the company plans to use the issue proceeds to meet the expenses for investment in technology some portion will also be utilised for the capital expenditure requirement to fund working capital needs and for general corporate purposes as well as to cover the issue expenses based on data from investorgain com pranik logistics ipo has nil gmp this means that the shares of pranik logistics are available in the grey market without any premium and at the upper band of the issue price of \u003cSEVEN_TEN\u003e","timestamp":"2024-10-11T16:15:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}