{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-ruchit-jain-of-5paisa-recommends-tech-mahindra-hdfc-life-today-11728964087100.html","title":"Shares to buy or sell: Ruchit Jain of 5paisa recommends Tech Mahindra, HDFC Life today","description":"Shares to buy or sell: Ruchit Jain of 5paisa has recommended two stocks today - Tech Mahindra Ltd, and HDFC Life Insurance Company Ltd.","content":"Stock Market News: On Tuesday, the domestic benchmark indices, Sensex and Nifty 50, opened slightly higher. This was driven by the increase in IT companies' stock prices following HCL Tech's upward revision of its revenue growth outlook. Additionally, a decline in global crude prices supported the shares of oil refining and paint companies.As of 9:52 IST, the Nifty 50 was flat at 25,121.40 points, while the Sensex was also flat at 81,989.75.Dr. V K Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, expressed optimism about the upcoming Q2 results, particularly for the IT and banking sectors. HCL Tech's strong performance has validated these hopeful expectations, and it is expected that major private banks will also announce positive results.Vijayakumar also highlighted the significant 3% decrease in Brent crude as a positive development for the Indian economy. However, there is concern regarding the higher-than-expected September CPI inflation figure of 5.49%. This may prompt the MPC to take this issue seriously and contemplate delaying the rate cut until 2025.Our markets witnessed a positive momentum at the start of the week as heavyweights from the banking and the IT sector rallied higher. Nifty 50 opened the day above 25,000 and ended and ended at 25,127 with gains of two-third of a percent. Nifty 50 rallied higher as stock specific positive momentum was seen in the private sector banks and the IT stocks. In last one week, the index has consolidated in a range with a swing high at 25,235.This is the immediate hurdle which needs to be surpassed for a deeper retracement pullback. Above this swing high, the index would have potential to rally towards 25,300 and 25,480 as per the retracements. On the flipside, 24920 is seen as the immediate support. Traders are advised to look for stock specific opportunities from a near term perspective and look for a trended move in the index only above or below the above mentioned levels.On shares to buy or sell on Tuesday, Ruchit Jain recommends Tech Mahindra Ltd, and HDFC Life Insurance Company Ltd.The stock traded within a range in last couple of weeks which seemed to be time wise correction within an uptrend. The 50 DEMA acted as a support for the stock in this consolidation, and prices have now given a breakout from this range hinting at a resumption of the uptrend. The RSI oscillator is also hinting at a positive momentum and hence, we expect the stock to rally higher in the near term.Hence, traders are advised to buy the stock in the range of  ₹1,690-1,670 for potential target of  ₹1,860. Traders are advised to keep a strict stop loss below the support of  ₹1,590.The stock consolidated in a range in last few weeks which seemed to be a time-wise correction within an uptrend. Prices now seem to have resumed the broader uptrend with a continuation of the higher top higher bottom structure. The RSI oscillator is also hinting at a positive momentum.Hence, short term traders can look to buy the stock in the range of  ₹740-730 for potential target around  ₹780. The stoploss on short positions should be placed below  ₹715.","cleaned_content":"stock market news on tuesday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e opened slightly higher this was driven by the increase in it companies stock prices following hcl techs upward revision of its revenue growth outlook additionally a decline in global crude prices supported the shares of oil refining and paint companies as of \u003cNINE_\u003e \u003cFIVE_TEN\u003e ist the nifty \u003cFIVE_TEN\u003e was flat at \u003cTWO_TEN_THOUSAND\u003e points while the sensex was also flat at \u003cEIGHT_TEN_THOUSAND\u003e dr v k vijayakumar the chief investment strategist at geojit financial services expressed optimism about the upcoming q2 results particularly for the it and banking sectors hcl techs strong performance has validated these hopeful expectations and it is expected that major private banks will also announce positive results vijayakumar also highlighted the significant \u003cTHREE_PERCENT\u003e decrease in brent crude as a positive development for the indian economy however there is concern regarding the higher than expected september cpi inflation figure of \u003cFIVE_PERCENT\u003e this may prompt the mpc to take this issue seriously and contemplate delaying the rate cut until \u003cTWO_THOUSAND\u003e our markets witnessed a positive momentum at the start of the week as heavyweights from the banking and the it sector rallied higher nifty \u003cFIVE_TEN\u003e opened the day above \u003cTWO_TEN_THOUSAND\u003e and ended and ended at \u003cTWO_TEN_THOUSAND\u003e with gains of two third of a percent nifty \u003cFIVE_TEN\u003e rallied higher as stock specific positive momentum was seen in the private sector banks and the it stocks in last one week the index has consolidated in a range with a swing high at \u003cTWO_TEN_THOUSAND\u003e this is the immediate hurdle which needs to be surpassed for a deeper retracement pullback above this swing high the index would have potential to rally towards \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e as per the retracements on the flipside \u003cTWO_TEN_THOUSAND\u003e is seen as the immediate support traders are advised to look for stock specific opportunities from a near term perspective and look for a trended move in the index only above or below the above mentioned levels on shares to buy or sell on tuesday ruchit jain recommends tech mahindra ltd and hdfc life insurance company ltd the stock traded within a range in last couple of weeks which seemed to be time wise correction within an uptrend the \u003cFIVE_TEN\u003e dema acted as a support for the stock in this consolidation and prices have now given a breakout from this range hinting at a resumption of the uptrend the rsi oscillator is also hinting at a positive momentum and hence we expect the stock to rally higher in the near term hence traders are advised to buy the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for potential target of \u003cONE_THOUSAND\u003e traders are advised to keep a strict stop loss below the support of \u003cONE_THOUSAND\u003e the stock consolidated in a range in last few weeks which seemed to be a time wise correction within an uptrend prices now seem to have resumed the broader uptrend with a continuation of the higher top higher bottom structure the rsi oscillator is also hinting at a positive momentum hence short term traders can look to buy the stock in the range of \u003cSEVEN_HUNDRED\u003e \u003cSEVEN_HUNDRED\u003e for potential target around \u003cSEVEN_HUNDRED\u003e the stoploss on short positions should be placed below \u003cSEVEN_HUNDRED\u003e","timestamp":"2024-10-15T10:00:00+05:30","market_timestamp":"2024-10-15T10:00:00+05:30","off_market_hours":false}