{"url":"https://www.livemint.com/market/stock-market-news/sebi-new-f-o-trading-norms-zerodha-to-review-pricing-after-november-20-says-ceo-nithin-kamath-11728062153955.html","title":"SEBI new F\u0026O trading norms: Zerodha to review pricing after November 20, says CEO Nithin Kamath","description":"Nithin Kamath, co-founder and CEO of Zerodha, announced that the leading online stock brokerage platform will review its pricing structure after November 20, 2024, based on the impact of new rules for index derivatives trading.","content":"Capital markets regulator Securities and Exchange Board of India (SEBI) has mandated a new framework for India's booming equity derivates market and announced sweeping changes to curb the rush in futures and options (F\u0026O) trading. Post-SEBI's announcement of new F\u0026O norms, Nithin Kamath, co-founder and CEO of Zerodha, announced that the leading online stock brokerage platform will review its pricing structure after November 20, 2024, based on the impact of new rules for index derivatives trading.Taking to microblogging platform ‘X’ (formerly Twitter) X, Zerodha's Kamath said, “Here's the potential impact of only one weekly expiry of index derivatives per exchange and contract sizes going up by around 2.5 times.”Also Read: ‘SEBI changes F\u0026O game, not a bad idea on expiry day’: Capitalmind’s Deepak Shenoy on new derivates framework“As things stand, assuming that those trading weekly don't move on to trading monthly, the impact will be ~60 per cent of overall F\u0026O trades and ~30 per cent of our overall orders. I guess things will become much clearer from November 20th. We will then decide on our change in pricing structure, based on the impact on the business,” said Kamath in a post on ‘X’.SEBI implemented six out of seven measures recommended by an expert panel to cool the exuberance in India's derivatives market. Market participants said the measures, which will be implemented in phases, could dent derivatives volumes by 20-30 per cent.Out of the six, the ones that could impact volumes the most are the reduction in weekly expiries per exchange from five to just one, the increase in lot size to  ₹15-20 lakh from  ₹5-10 lakh, and the removal of the calendar spread benefit on expiry day. The first two will take effect on November 20, and the third on February 1, 2025.Also Read: SEBI approves new asset class for HNIs, passive fund framework; rights issue timeline slashed: 5 key highlightsThis means that weekly expiries are limited to one per exchange, and contract sizes are increased. As a result, the contract size for index F\u0026O will rise from  ₹5-10 lakh to  ₹15-20 lakhs. From November 20, stock exchanges can offer weekly expiries for only one benchmark index. For example, the NSE can choose between Nifty 50 or Bank Nifty, but not both. All other indexes will move to monthly expiries.Additionally, starting in February 2025, traders will lose margin benefits on calendar spreads for contracts expiring on expiry day, increasing margin requirements for many. SEBI has also introduced an Extreme Loss Margin (ELM) of two per cent on expiry day to cover risks due to heightened volatility.Also Read: Stock Market Crash: Israel-Iran war to FII outflows—5 reasons why Sensex, Nifty plunged today amid volatility","cleaned_content":"capital markets regulator securities and exchange board of india sebi has mandated a new framework for indias booming equity derivates market and announced sweeping changes to curb the rush in futures and options f o trading post sebis announcement of new f o norms nithin kamath co founder and ceo of zerodha announced that the leading online stock brokerage platform will review its pricing structure after november \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e based on the impact of new rules for index derivatives trading taking to microblogging platform x formerly twitter x zerodhas kamath said heres the potential impact of only one weekly expiry of index derivatives per exchange and contract sizes going up by around \u003cTWO_\u003e times also read sebi changes f o game not a bad idea on expiry day capitalmind s deepak shenoy on new derivates framework as things stand assuming that those trading weekly dont move on to trading monthly the impact will be \u003cSIX_TEN_PERCENT\u003e of overall f o trades and \u003cTHREE_TEN_PERCENT\u003e of our overall orders i guess things will become much clearer from november \u003cTWO_TEN\u003e th we will then decide on our change in pricing structure based on the impact on the business said kamath in a post on x sebi implemented six out of seven measures recommended by an expert panel to cool the exuberance in indias derivatives market market participants said the measures which will be implemented in phases could dent derivatives volumes by \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e out of the six the ones that could impact volumes the most are the reduction in weekly expiries per exchange from five to just one the increase in lot size to \u003cONE_TEN\u003e \u003cTWO_TEN\u003e lakh from \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh and the removal of the calendar spread benefit on expiry day the first two will take effect on november \u003cTWO_TEN\u003e and the third on february \u003cONE_\u003e \u003cTWO_THOUSAND\u003e also read sebi approves new asset class for hnis passive fund framework rights issue timeline slashed \u003cFIVE_\u003e key highlightsthis means that weekly expiries are limited to one per exchange and contract sizes are increased as a result the contract size for index f o will rise from \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh to \u003cONE_TEN\u003e \u003cTWO_TEN\u003e lakhs from november \u003cTWO_TEN\u003e stock exchanges can offer weekly expiries for only one benchmark index for example the nse can choose between nifty \u003cFIVE_TEN\u003e or bank nifty but not both all other indexes will move to monthly expiries additionally starting in february \u003cTWO_THOUSAND\u003e traders will lose margin benefits on calendar spreads for contracts expiring on expiry day increasing margin requirements for many sebi has also introduced an extreme loss margin elm of two per cent on expiry day to cover risks due to heightened volatility also read stock market crash israel iran war to fii outflows \u003cFIVE_\u003e reasons why sensex nifty plunged today amid volatility","timestamp":"2024-10-04T22:47:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}