{"url":"https://www.livemint.com/market/stock-market-news/multibagger-defence-stock-bharat-electronics-share-price-gains-3-helped-by-rs-500-crore-order-wins-buy-sell-or-hold-11728364791577.html","title":"Multibagger defence stock Bharat Electronics share price gains 3% on  ₹500 cr order wins; Should you buy, sell or hold?","description":"Stock Market Today: Multibagger defence stock Bharat Electronics' share price gained 3% today on  ₹500 crore order inflows. Analysts remain optimistic about the stock amid a strong order pipeline, improving margins and diversification into non-defense verticals.","content":"Stock Market Today: Defence stock Bharat Electronics share price rose 3% in the morning trade on Tuesday, October 8, after the company announced order wins worth  ₹500 crore.Bharat Electronics share price opened at  ₹266.90 on the BSE on Tuesday, slightly higher than the previous close of  ₹267.35. The stock extended gains to  ₹277.80, marking a rise of more than 3%.Bharat Electronics share price, which had corrected 7% in the last five trading sessions, rebounded on Tuesday amid improved sentiments in the broader market and order wins. While Bharat Electronics share price is down 19% from highs seen in July, it has still given multibagger returns to investors. The stock is up 103% in the last one year.The Navratna defence public sector company, Bharat Electronics, in a release on Monday post market hours, said that it secured additional orders of more than  ₹500 crore since its last disclosure on September 11, 2024.EMI shelters, AMC for integrated air command and control system nodes, upgrades and spares for gun systems, radar spares, communication system spares, etc. are among the key orders received by Bharat Electronics. With these, Bharat Electronics has already amassed orders amounting to  ₹7,689 crore for the current fiscal year.Analysts are positive about the company's prospects, as the strong order book improves outlook.Analysts at Prabhudas Lilladher Institutional Equities believe that Bharat Electronics' long-term prospects will continue to remain strong driven by robust order backlog and pipeline, aided by the government’s push on defence indigenization, its diversification into non-defense verticals and improving margin profile. They expect the company to report revenue and adjusted net profit CAGR (compound annual growth rate) of 17.6% and 17.3%, respectively over FY24-26.The brokerage has an 'Accumulate' rating on the company with a target price of  ₹341.","cleaned_content":"stock market today defence stock bharat electronics share price rose \u003cTHREE_PERCENT\u003e in the morning trade on tuesday october \u003cEIGHT_\u003e after the company announced order wins worth \u003cFIVE_HUNDRED\u003e crore bharat electronics share price opened at \u003cTWO_HUNDRED\u003e on the bse on tuesday slightly higher than the previous close of \u003cTWO_HUNDRED\u003e the stock extended gains to \u003cTWO_HUNDRED\u003e marking a rise of more than \u003cTHREE_PERCENT\u003e bharat electronics share price which had corrected \u003cSEVEN_PERCENT\u003e in the last five trading sessions rebounded on tuesday amid improved sentiments in the broader market and order wins while bharat electronics share price is down \u003cONE_TEN_PERCENT\u003e from highs seen in july it has still given multibagger returns to investors the stock is up \u003cONE_HUNDRED_PERCENT\u003e in the last one year the navratna defence public sector company bharat electronics in a release on monday post market hours said that it secured additional orders of more than \u003cFIVE_HUNDRED\u003e crore since its last disclosure on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e emi shelters amc for integrated air command and control system nodes upgrades and spares for gun systems radar spares communication system spares etc are among the key orders received by bharat electronics with these bharat electronics has already amassed orders amounting to \u003cSEVEN_THOUSAND\u003e crore for the current fiscal year analysts are positive about the companys prospects as the strong order book improves outlook analysts at prabhudas lilladher institutional equities believe that bharat electronics long term prospects will continue to remain strong driven by robust order backlog and pipeline aided by the government s push on defence indigenization its diversification into non defense verticals and improving margin profile they expect the company to report revenue and adjusted net profit cagr compound annual growth rate of \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively over fy24 \u003cTWO_TEN\u003e the brokerage has an accumulate rating on the company with a target price of \u003cTHREE_HUNDRED\u003e","timestamp":"2024-10-08T12:15:00+05:30","market_timestamp":"2024-10-08T12:15:00+05:30","off_market_hours":false}