{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-s-p-500-hits-fresh-record-high-ahead-of-us-fed-minutes-alphabet-limits-gains-on-doj-action-11728495189674.html","title":"Wall Street Today: S\u0026P 500 hits fresh record high ahead of US Fed Minutes, Alphabet limits gains on DoJ action","description":"The S\u0026P 500 touched a fresh record high, with shares of Norwegian Cruise Line topping the benchmark index with a 10.2% gain after Citi upgraded its rating to buy. Peer Carnival jumped 7.8%.","content":"The main stock indexes turned higher in a choppy trading session on Wednesday as investors awaited the minutes of the Federal Reserve's latest meeting, while Alphabet shares lost ground after the U.S. said it was considering breaking up Google.Shares of Alphabet fell 1.8%, limiting broader gains, after the U.S. Department of Justice said it may ask a judge to force Google to divest parts of its business, including the Chrome browser and Android operating system, to curtail its search monopoly.The Dow Jones Industrial Average rose 387.01 points, or 0.92%, to 42,467.38, the S\u0026P 500 gained 34.55 points, or 0.60%, to 5,785.63, and the Nasdaq Composite gained 82.01 points, or 0.45%, to 18,264.91.The S\u0026P 500 touched a fresh record high, with shares of Norwegian Cruise Line topping the benchmark index with a 10.2% gain after Citi upgraded its rating to \"buy\". Peer Carnival jumped 7.8%.Trading has been choppy through the week, with investors adjusting their rate-cut expectations, seeking new catalysts for a clearer market direction. Their attention will now turn to crucial inflation data on Thursday and the upcoming third-quarter corporate earnings season.Minutes from the Fed's September meeting, when policymakers kicked off monetary policy easing with a 50-basis-point rate cut, are due later in the day. \"The Fed minutes are always interesting, but they may be a little bit more interesting this time given the last Fed meeting, though I don't expect any surprises,\" said Tim Ghriskey, senior portfolio strategist at Ingalls \u0026 Snyder.“In the very short term, we have the CPI number... then Friday is the earnings kickoff, so we've had some volatility in the markets here.” Commentary from a number of Fed officials including Philip Jefferson and Thomas Barkin are also expected through the day. Dallas Fed president Lorie Logan said the central bank should not rush policy easing.Investors are pricing in an 82% chance of a 25-basis-point reduction in borrowing costs at the Fed's November meeting, with some now seeing a slight chance it will keep rates on hold, according to CME's FedWatch.Prior to the release of strong employment data last week, markets were leaning towards an outsized 50-bps cut in November.Most S\u0026P 500 sub-sectors were higher, although rate-sensitive Utilities and Real Estate slipped 0.4% and 0.2%, respectively. Boeing lost 2.6% after talks between the company and its key manufacturing union broke down. Shares of Arcadium Lithium soared 30.8% after Rio Tinto said it would acquire the miner for $6.7 billion.U.S.-listed shares of Chinese firms dropped as investors continued to question if China would announce new stimulus measures. Alibaba Group was down 0.6% and PDD Holdings lost 1.6%.Additionally, investors were watching for the potential impact from Category 5 Hurricane Milton as well as the escalating conflict in the Middle East. Advancing issues outnumbered decliners by a 1.82-to-1 ratio on the NYSE, and by a 1.37-to-1 ratio on the Nasdaq.The S\u0026P 500 posted 44 new 52-week highs and two new lows, while the Nasdaq Composite recorded 74 new highs and 96 new lows.","cleaned_content":"the main stock indexes turned higher in a choppy trading session on wednesday as investors awaited the minutes of the federal reserves latest meeting while alphabet shares lost ground after the u s said it was considering breaking up google shares of alphabet fell \u003cONE_PERCENT\u003e limiting broader gains after the u s department of justice said it may ask a judge to force google to divest parts of its business including the chrome browser and android operating system to curtail its search monopoly the dow jones industrial average rose \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e the s p \u003cFIVE_HUNDRED\u003e gained \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cFIVE_THOUSAND\u003e and the nasdaq composite gained \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e the s p \u003cFIVE_HUNDRED\u003e touched a fresh record high with shares of norwegian cruise line topping the benchmark index with a \u003cONE_TEN_PERCENT\u003e gain after citi upgraded its rating to buy peer carnival jumped \u003cSEVEN_PERCENT\u003e trading has been choppy through the week with investors adjusting their rate cut expectations seeking new catalysts for a clearer market direction their attention will now turn to crucial inflation data on thursday and the upcoming third quarter corporate earnings season minutes from the feds september meeting when policymakers kicked off monetary policy easing with a \u003cFIVE_TEN\u003e basis point rate cut are due later in the day the fed minutes are always interesting but they may be a little bit more interesting this time given the last fed meeting though i dont expect any surprises said tim ghriskey senior portfolio strategist at ingalls snyder in the very short term we have the cpi number then friday is the earnings kickoff so weve had some volatility in the markets here commentary from a number of fed officials including philip jefferson and thomas barkin are also expected through the day dallas fed president lorie logan said the central bank should not rush policy easing investors are pricing in an \u003cEIGHT_TEN_PERCENT\u003e chance of a \u003cTWO_TEN\u003e basis point reduction in borrowing costs at the feds november meeting with some now seeing a slight chance it will keep rates on hold according to cmes fedwatch prior to the release of strong employment data last week markets were leaning towards an outsized \u003cFIVE_TEN\u003e bps cut in november most s p \u003cFIVE_HUNDRED\u003e sub sectors were higher although rate sensitive utilities and real estate slipped \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively boeing lost \u003cTWO_PERCENT\u003e after talks between the company and its key manufacturing union broke down shares of arcadium lithium soared \u003cTHREE_TEN_PERCENT\u003e after rio tinto said it would acquire the miner for \u003cSIX_\u003e billion u s listed shares of chinese firms dropped as investors continued to question if china would announce new stimulus measures alibaba group was down \u003cZERO_PERCENT\u003e and pdd holdings lost \u003cONE_PERCENT\u003e additionally investors were watching for the potential impact from category \u003cFIVE_\u003e hurricane milton as well as the escalating conflict in the middle east advancing issues outnumbered decliners by a \u003cONE_\u003e to \u003cONE_\u003e ratio on the nyse and by a \u003cONE_\u003e to \u003cONE_\u003e ratio on the nasdaq the s p \u003cFIVE_HUNDRED\u003e posted \u003cFOUR_TEN\u003e new \u003cFIVE_TEN\u003e week highs and two new lows while the nasdaq composite recorded \u003cSEVEN_TEN\u003e new highs and \u003cNINE_TEN\u003e new lows","timestamp":"2024-10-09T23:09:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}