{"url":"https://www.livemint.com/market/stock-market-news/multibagger-jyoti-structures-shares-up-10-after-ashish-kacholia-acquires-fresh-stake-in-q2-11728366994768.html","title":"Multibagger Jyoti Structures shares surge 10% as Ashish Kacholia acquires fresh stake in company in Q2","description":"Jyoti Structures is engaged in the electricity transmission, distribution, and substation sectors. Ashish Kacholia acquired a fresh 2.52% stake in the company. For the quarter ended June 2024 (Q1FY25), the company reported a consolidated net profit of  ₹5.09 crore.","content":"Shares of Jyoti Structures jumped 10% in intraday trading on Tuesday, October 8, to  ₹29.30 apiece after prominent investor Ashish Kacholia's name emerged among the company's shareholders. Known as the \"Big Whale\" of Dalal Street, Kacholia acquired a fresh 2.52% stake in Jyoti Structures during the September quarter (Q2), according to data from Trendlyne. However, the average buying price for his stake was not disclosed.Kacholia has been building his portfolio of stocks for about two decades now. His investment strategies, which include increasing and reducing stakes in individual stocks, tend to have significant implications on the scrip's movements.Kacholia primarily focuses on mid- and small-cap stocks, which make up two-thirds of his portfolio. He is known for his expertise in diversification and efficient capital allocation, often spreading investments across various sectors, especially chemicals and petrochemicals.Jyoti Structures is engaged in the electricity transmission, distribution, and substation sectors. The company specialises in delivering turnkey projects that encompass the design, testing, manufacturing, erection, and commissioning of transmission lines, substations, and power distribution projects, both in India and internationally.In August, the company secured an order valued at  ₹1.06 billion from a private developer for the supply of towers for a 765-kilovolt DC transmission line project. Additionally, in July, it won an order worth  ₹1.17 billion from Adani Energy Solutions to build and partially supply a 765-kilovolt transmission line.In April, Jyoti Structures successfully completed all three transmission lines awarded by Mundra Port and Special Economic Zone.According to the latest shareholding pattern, general shareholders own the majority stake in the company at 96.8%, followed by domestic institutional investors (DIIs) at 1.9% and foreign institutional investors (FIIs) at 1.4%.Since March 2023, the company's shares have exhibited a consistent upward trend, surging from  ₹5 apiece to the current trading price of  ₹29.30, marking an impressive gain of 486%. Despite this remarkable rally, the stock remains approximately 90% below its all-time high of  ₹311, reached in February 2008.The stock's yearly performance trend shows that it faced a decade-long decline from 2008 to 2018 before gaining momentum in 2019.For the quarter ended June 2024 (Q1FY25), the company reported a consolidated net profit of  ₹5.09 crore, compared to a net profit of  ₹2.46 crore in the same period last year. However, revenue from operations stood at  ₹88.29 crore, a decrease from  ₹185.17 crore.","cleaned_content":"shares of jyoti structures jumped \u003cONE_TEN_PERCENT\u003e in intraday trading on tuesday october \u003cEIGHT_\u003e to \u003cTWO_TEN\u003e apiece after prominent investor ashish kacholias name emerged among the companys shareholders known as the big whale of dalal street kacholia acquired a fresh \u003cTWO_PERCENT\u003e stake in jyoti structures during the september quarter q2 according to data from trendlyne however the average buying price for his stake was not disclosed kacholia has been building his portfolio of stocks for about two decades now his investment strategies which include increasing and reducing stakes in individual stocks tend to have significant implications on the scrips movements kacholia primarily focuses on mid and small cap stocks which make up two thirds of his portfolio he is known for his expertise in diversification and efficient capital allocation often spreading investments across various sectors especially chemicals and petrochemicals jyoti structures is engaged in the electricity transmission distribution and substation sectors the company specialises in delivering turnkey projects that encompass the design testing manufacturing erection and commissioning of transmission lines substations and power distribution projects both in india and internationally in august the company secured an order valued at \u003cONE_\u003e billion from a private developer for the supply of towers for a \u003cSEVEN_HUNDRED\u003e kilovolt dc transmission line project additionally in july it won an order worth \u003cONE_\u003e billion from adani energy solutions to build and partially supply a \u003cSEVEN_HUNDRED\u003e kilovolt transmission line in april jyoti structures successfully completed all three transmission lines awarded by mundra port and special economic zone according to the latest shareholding pattern general shareholders own the majority stake in the company at \u003cNINE_TEN_PERCENT\u003e followed by domestic institutional investors diis at \u003cONE_PERCENT\u003e and foreign institutional investors fiis at \u003cONE_PERCENT\u003e since march \u003cTWO_THOUSAND\u003e the companys shares have exhibited a consistent upward trend surging from \u003cFIVE_\u003e apiece to the current trading price of \u003cTWO_TEN\u003e marking an impressive gain of \u003cFOUR_HUNDRED_PERCENT\u003e despite this remarkable rally the stock remains approximately \u003cNINE_TEN_PERCENT\u003e below its all time high of \u003cTHREE_HUNDRED\u003e reached in february \u003cTWO_THOUSAND\u003e the stocks yearly performance trend shows that it faced a decade long decline from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e before gaining momentum in \u003cTWO_THOUSAND\u003e for the quarter ended june \u003cTWO_THOUSAND\u003e q1fy25 the company reported a consolidated net profit of \u003cFIVE_\u003e crore compared to a net profit of \u003cTWO_\u003e crore in the same period last year however revenue from operations stood at \u003cEIGHT_TEN\u003e crore a decrease from \u003cONE_HUNDRED\u003e crore","timestamp":"2024-10-08T11:58:00+05:30","market_timestamp":"2024-10-08T11:58:00+05:30","off_market_hours":false}