{"url":"https://www.livemint.com/market/stock-market-news/transformers-and-rectifiers-up-250-ytd-this-multibagger-stock-hits-upper-circuit-for-fifth-straight-session-11728884265691.html","title":"Up 250% YTD! This multibagger stock hits upper circuit for fifth straight session","description":"Multibagger stock: Transformers and Rectifiers India shares have surged 28% in the last five sessions. Year-to-date (YTD), the stock has soared over 252%.","content":"Multibagger stock: Shares of Transformers and Rectifiers India have enjoyed a solid uptrend lately. Hitting its 5 per cent upper circuit for the fifth consecutive session, the stock opened at  ₹816.95 on BSE on Monday, October 14, and stayed locked at this level. According to media reports, the stock saw a fresh upswing on a block deal. LiveMint could not independently verify this news.In the last five sessions of trade, the stock has surged about 28 per cent. Year-to-date, the stock has soared over 252 per cent.Transformers and Rectifiers share price hit its 52-week high of  ₹845.70 on June 13 this year. It saw profit booking in August and September. Last month, the stock plunged 15 per cent but gained momentum this month. In October so far, the sock has surged nearly 30 per cent.Transformers and Rectifiers' stock hit its 52-week low of  ₹142.10 on October 26 last year. At the current market price of  ₹816.95, the shares have skyrocketed by an impressive 475 per cent from that low point.On October 8, Transformers and Rectifiers India reported a consolidated profit of  ₹45.91 crore for the quarter ended September 30, 2024, against a profit of  ₹1.9 crore in the corresponding quarter last year and a profit of  ₹20.83 crore in the June quarter of the current financial year.Revenue from operations for Q2FY25 stood at  ₹461.54 crore against a revenue of  ₹257.1 crore in Q2FY24 and  ₹322 crore in Q1FY25.As Mint reported earlier, the company secured new orders totalling  ₹1,031 crore during the quarter, boosting its total order book to  ₹3,500 crore as of September 2024. Among the notable orders received was a contract for a 420 kV three-phase reactor with synthetic organic ester insulating fluid from Power Grid, as well as a 175 MVA EAF transformer order from ArcelorMittal. Additionally, the company said that there are ongoing negotiations for orders worth  ₹18,500 crore, as per the company's Q2FY25 investor presentation.On October 3, the company received an order valued at  ₹565 crore from Power Grid Corporation for the supply of transformers and reactors ranging from 80 MVAr to 500 MVA and 420 kV to 765 kV. Additionally, in September, the company secured orders from Rajasthan Rajya Vidyut Prasaran Nigam and SPIL. In August, it also received orders worth $14 million from Linxon Global Sweden.\"The stock has been in a steady uptrend since September 2022, surging nearly vertically from double digits to a new high of  ₹845.70 in June 2024. After spending about four months in a corrective phase, it has resumed its upward momentum and appears poised to reach new highs. Traders are advised to hold their positions, with a stop loss at  ₹720, targeting potential gains toward the  ₹980+ levels,\" said Ajit Mishra - SVP, Research, Religare Broking.Read all market-related news here","cleaned_content":"multibagger stock shares of transformers and rectifiers india have enjoyed a solid uptrend lately hitting its \u003cFIVE_PERCENT\u003e upper circuit for the fifth consecutive session the stock opened at \u003cEIGHT_HUNDRED\u003e on bse on monday october \u003cONE_TEN\u003e and stayed locked at this level according to media reports the stock saw a fresh upswing on a block deal livemint could not independently verify this news in the last five sessions of trade the stock has surged about \u003cTWO_TEN_PERCENT\u003e year to date the stock has soared over \u003cTWO_HUNDRED_PERCENT\u003e transformers and rectifiers share price hit its \u003cFIVE_TEN\u003e week high of \u003cEIGHT_HUNDRED\u003e on june \u003cONE_TEN\u003e this year it saw profit booking in august and september last month the stock plunged \u003cONE_TEN_PERCENT\u003e but gained momentum this month in october so far the sock has surged nearly \u003cTHREE_TEN_PERCENT\u003e transformers and rectifiers stock hit its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e on october \u003cTWO_TEN\u003e last year at the current market price of \u003cEIGHT_HUNDRED\u003e the shares have skyrocketed by an impressive \u003cFOUR_HUNDRED_PERCENT\u003e from that low point on october \u003cEIGHT_\u003e transformers and rectifiers india reported a consolidated profit of \u003cFOUR_TEN\u003e crore for the quarter ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e against a profit of \u003cONE_\u003e crore in the corresponding quarter last year and a profit of \u003cTWO_TEN\u003e crore in the june quarter of the current financial year revenue from operations for q2fy25 stood at \u003cFOUR_HUNDRED\u003e crore against a revenue of \u003cTWO_HUNDRED\u003e crore in q2fy24 and \u003cTHREE_HUNDRED\u003e crore in q1fy25 as mint reported earlier the company secured new orders totalling \u003cONE_THOUSAND\u003e crore during the quarter boosting its total order book to \u003cTHREE_THOUSAND\u003e crore as of september \u003cTWO_THOUSAND\u003e among the notable orders received was a contract for a \u003cFOUR_HUNDRED\u003e kv three phase reactor with synthetic organic ester insulating fluid from power grid as well as a \u003cONE_HUNDRED\u003e mva eaf transformer order from arcelormittal additionally the company said that there are ongoing negotiations for orders worth \u003cONE_TEN_THOUSAND\u003e crore as per the companys q2fy25 investor presentation on october \u003cTHREE_\u003e the company received an order valued at \u003cFIVE_HUNDRED\u003e crore from power grid corporation for the supply of transformers and reactors ranging from \u003cEIGHT_TEN\u003e mvar to \u003cFIVE_HUNDRED\u003e mva and \u003cFOUR_HUNDRED\u003e kv to \u003cSEVEN_HUNDRED\u003e kv additionally in september the company secured orders from rajasthan rajya vidyut prasaran nigam and spil in august it also received orders worth \u003cONE_TEN\u003e million from linxon global sweden the stock has been in a steady uptrend since september \u003cTWO_THOUSAND\u003e surging nearly vertically from double digits to a new high of \u003cEIGHT_HUNDRED\u003e in june \u003cTWO_THOUSAND\u003e after spending about four months in a corrective phase it has resumed its upward momentum and appears poised to reach new highs traders are advised to hold their positions with a stop loss at \u003cSEVEN_HUNDRED\u003e targeting potential gains toward the \u003cNINE_HUNDRED\u003e levels said ajit mishra svp research religare broking read all market related news here","timestamp":"2024-10-14T14:05:00+05:30","market_timestamp":"2024-10-14T14:05:00+05:30","off_market_hours":false}