{"url":"https://www.livemint.com/market/stock-market-news/rcf-share-price-soars-8-as-company-awards-rs-1-000-crore-order-to-l-t-for-a-major-fertiliser-plant-11728534361544.html","title":"RCF share price soars 8% as company awards  ₹1,000 crore order to L\u0026T for a major fertiliser plant","description":"RCF shares surged over 8% after the board approved an order placement with L\u0026T for a new fertiliser plant, valued at  ₹1,000.27 crore. This investment aims to enhance the company's production capacity, supporting India's agricultural sector amid growing demand from farmers.","content":"Shares of Rashtriya Chemicals and Fertilizers (RCF) rallied over 8 per cent in intra-day trading on Thursday, October 10, after the company placed a significant purchase order on Larsen \u0026 Toubro Ltd (L\u0026T) for a new fertiliser plant. The development follows RCF’s continuous efforts to enhance its production capacity and further support India's agricultural sector.\"...we hereby inform that the Board of Directors of the Company at its meeting held today i.e. October 9, 2024, has accorded its approval for Placement of Purchase Order on Larsen \u0026 Toubro Ltd for setting up of 1200 MTPD (DAP basis) Complex Fertilizer plant on LSTK Basis at RCF, Thal,\" the company said a stock exchange filing.The plant will be developed on a lump-sum turn-key (LSTK) basis, meaning L\u0026T will manage the entire project from design to procurement and construction. The contract is valued at  ₹1,000.27 crore, excluding GST, and the timeline for completion is set at 27 months.Once operational, the new plant will significantly enhance RCF’s fertiliser production capacity, which is crucial in meeting the growing demand from Indian farmers. This move aligns with the company’s goal of bolstering its role in India's agricultural sector by ensuring a stable supply of fertilisers.Fertiliser is essential for India's agrarian economy, and this project will help meet the increasing demands of the nation’s growing agricultural needs.This recent deal follows RCF's earlier expansion plans, which included a contract with the international firm Topsoe for the revamp of its ammonia plant at RCF Thal. The  ₹514.6 crore contract, announced in July 2024, focused on upgrading the ammonia facility to reduce specific energy consumption. The revamp involves the procurement of a basic engineering design package (BEDP) and the supply of proprietary equipment and catalysts over a 36-month period.RCF operates two major production sites, one in Trombay and another in Thal, Maharashtra. These facilities manufacture nitrogenous, phosphatic, and potassic fertilisers, along with a diverse range of industrial chemicals. The company's strategic initiatives reflect its vision of maintaining leadership in India’s fertiliser industry and ensuring sustainable growth through technological upgrades and capacity expansion.The recent contract with L\u0026T underscores RCF's focus on modernising its infrastructure and optimising production efficiency, contributing to its long-term growth objectives in both domestic and international markets.The stock climbed as much as 8.3 per cent to its day's high of  ₹185.25. Post today's jump, the stock is now over 24 per cent away from its record high of  ₹245, hit in July this year. Meanwhile, it has advanced over 57 per cent from its 52-week low of  ₹117.65, recorded in October 2023.The scrip has risen over 40 per cent in the last one year and added over 16 per cent on a year-to-date (YTD) basis. The stock is up 1 per cent in October so far after two months of decline. It shed 10 per cent in September and 8 per cent in August. Prior to that, it was positive for four straight months, up 13 per cent in July, 25 per cent in June, 2 per cent in May and 17.5 per cent in April.","cleaned_content":"shares of rashtriya chemicals and fertilizers rcf rallied over \u003cEIGHT_PERCENT\u003e in intra day trading on thursday october \u003cONE_TEN\u003e after the company placed a significant purchase order on larsen toubro ltd l t for a new fertiliser plant the development follows rcf s continuous efforts to enhance its production capacity and further support indias agricultural sector we hereby inform that the board of directors of the company at its meeting held today i e october \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e has accorded its approval for placement of purchase order on larsen toubro ltd for setting up of \u003cONE_THOUSAND\u003e mtpd dap basis complex fertilizer plant on lstk basis at rcf thal the company said a stock exchange filing the plant will be developed on a lump sum turn key lstk basis meaning l t will manage the entire project from design to procurement and construction the contract is valued at \u003cONE_THOUSAND\u003e crore excluding gst and the timeline for completion is set at \u003cTWO_TEN\u003e months once operational the new plant will significantly enhance rcf s fertiliser production capacity which is crucial in meeting the growing demand from indian farmers this move aligns with the company s goal of bolstering its role in indias agricultural sector by ensuring a stable supply of fertilisers fertiliser is essential for indias agrarian economy and this project will help meet the increasing demands of the nation s growing agricultural needs this recent deal follows rcfs earlier expansion plans which included a contract with the international firm topsoe for the revamp of its ammonia plant at rcf thal the \u003cFIVE_HUNDRED\u003e crore contract announced in july \u003cTWO_THOUSAND\u003e focused on upgrading the ammonia facility to reduce specific energy consumption the revamp involves the procurement of a basic engineering design package bedp and the supply of proprietary equipment and catalysts over a \u003cTHREE_TEN\u003e month period rcf operates two major production sites one in trombay and another in thal maharashtra these facilities manufacture nitrogenous phosphatic and potassic fertilisers along with a diverse range of industrial chemicals the companys strategic initiatives reflect its vision of maintaining leadership in india s fertiliser industry and ensuring sustainable growth through technological upgrades and capacity expansion the recent contract with l t underscores rcfs focus on modernising its infrastructure and optimising production efficiency contributing to its long term growth objectives in both domestic and international markets the stock climbed as much as \u003cEIGHT_PERCENT\u003e to its days high of \u003cONE_HUNDRED\u003e post todays jump the stock is now over \u003cTWO_TEN_PERCENT\u003e away from its record high of \u003cTWO_HUNDRED\u003e hit in july this year meanwhile it has advanced over \u003cFIVE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e recorded in october \u003cTWO_THOUSAND\u003e the scrip has risen over \u003cFOUR_TEN_PERCENT\u003e in the last one year and added over \u003cONE_TEN_PERCENT\u003e on a year to date ytd basis the stock is up \u003cONE_PERCENT\u003e in october so far after two months of decline it shed \u003cONE_TEN_PERCENT\u003e in september and \u003cEIGHT_PERCENT\u003e in august prior to that it was positive for four straight months up \u003cONE_TEN_PERCENT\u003e in july \u003cTWO_TEN_PERCENT\u003e in june \u003cTWO_PERCENT\u003e in may and \u003cONE_TEN_PERCENT\u003e in april","timestamp":"2024-10-10T10:38:00+05:30","market_timestamp":"2024-10-10T10:38:00+05:30","off_market_hours":false}