{"url":"https://www.livemint.com/market/stock-market-news/dussehra-pick-sumeet-bagadia-recommends-this-stock-to-buy-with-11-upside-11728658912914.html","title":"Dussehra pick: Sumeet Bagadia recommends this stock to buy with 11% upside","description":"Sumeet Bagadia, Executive Director at Choice Broking, has recommended State Bank of India (SBIN) to buy on the occasion of Dussehra, with an upside potential of 11 per cent.","content":"Indian stock market: The Indian market closed lower on Friday, dragged down by auto and banking stocks. While gains in pharma and metal sectors offered some support, they weren't enough to lift the indices. As a result, the Nifty 50 declined by 0.14%, marking its third consecutive close below 25,000 at 24,964. Meanwhile, the Sensex finished the session with a 0.28% loss, closing at 81,381.“The Nifty has been trading in a sideways range of 25,200 - 25,800 for the past six consecutive days. It has now closed below the 25,000 level, facing resistance at 25,044, where the 50-day EMA (Exponential Moving Average) is positioned. Price action suggests that the index may remain in a sideways to bearish trend. A decisive break below 24,900 could lead to further corrections towards 24,400 and 24,200. On the flip side, fresh buying opportunities may only emerge if the Nifty decisively moves above the 25,400 - 25,500 zone,” said brokerage firm Choice Broking in a note.It further added, “In terms of options data, significant Open Interest (OI) on the put side is concentrated around the 24,500 and 24,000 levels, indicating strong support in these areas. On the call side, notable OI concentrations are seen at the 25,500 level, suggesting this will act as a resistance zone in the near term.”Sumeet Bagadia, Executive Director at Choice Broking, has recommended State Bank of India (SBIN) to buy on the occasion of Dussehra, with an upside potential of 11 per cent.State Bank of India (SBIN) is currently trading at 2794 and is forming a symmetrical triangle pattern on the daily chart, accompanied by significant volume, signaling a potential bullish reversal. The stock is also consolidating near a rising trend line, which acts as a strong support area. Additionally, SBIN is taking support around the 200-day EMA. further reinforcing the possibility of an upward move towards the 2880 and 2950 levels. Immediate resistance is noted at :836.On the downside, key support levels are at 2 760 and =750. The Relative Strength Index (RSI) is currently at 49.7, indicating a positive trajectory with growing buying momentum.Considering these technical indicators, SBIN presents a promising buying opportunity, particularly on dips around the 2780 level. Investors could target price levels of 2880 and 2950 in the near term. However. it is crucial to employ effective risk management strategies to mitigate potential market fluctuations and protect against downside risks.","cleaned_content":"indian stock market the indian market closed lower on friday dragged down by auto and banking stocks while gains in pharma and metal sectors offered some support they werent enough to lift the indices as a result the nifty \u003cFIVE_TEN\u003e declined by \u003cZERO_PERCENT\u003e marking its third consecutive close below \u003cTWO_TEN_THOUSAND\u003e at \u003cTWO_TEN_THOUSAND\u003e meanwhile the sensex finished the session with a \u003cZERO_PERCENT\u003e loss closing at \u003cEIGHT_TEN_THOUSAND\u003e the nifty has been trading in a sideways range of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e for the past six consecutive days it has now closed below the \u003cTWO_TEN_THOUSAND\u003e level facing resistance at \u003cTWO_TEN_THOUSAND\u003e where the \u003cFIVE_TEN\u003e day ema exponential moving average is positioned price action suggests that the index may remain in a sideways to bearish trend a decisive break below \u003cTWO_TEN_THOUSAND\u003e could lead to further corrections towards \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e on the flip side fresh buying opportunities may only emerge if the nifty decisively moves above the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e zone said brokerage firm choice broking in a note it further added in terms of options data significant open interest oi on the put side is concentrated around the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e levels indicating strong support in these areas on the call side notable oi concentrations are seen at the \u003cTWO_TEN_THOUSAND\u003e level suggesting this will act as a resistance zone in the near term sumeet bagadia executive director at choice broking has recommended state bank of india sbin to buy on the occasion of dussehra with an upside potential of \u003cONE_TEN_PERCENT\u003e state bank of india sbin is currently trading at \u003cTWO_THOUSAND\u003e and is forming a symmetrical triangle pattern on the daily chart accompanied by significant volume signaling a potential bullish reversal the stock is also consolidating near a rising trend line which acts as a strong support area additionally sbin is taking support around the \u003cTWO_HUNDRED\u003e day ema further reinforcing the possibility of an upward move towards the \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e levels immediate resistance is noted at \u003cEIGHT_HUNDRED\u003e on the downside key support levels are at \u003cTWO_\u003e \u003cSEVEN_HUNDRED\u003e and \u003cSEVEN_HUNDRED\u003e the relative strength index rsi is currently at \u003cFOUR_TEN\u003e indicating a positive trajectory with growing buying momentum considering these technical indicators sbin presents a promising buying opportunity particularly on dips around the \u003cTWO_THOUSAND\u003e level investors could target price levels of \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e in the near term however it is crucial to employ effective risk management strategies to mitigate potential market fluctuations and protect against downside risks","timestamp":"2024-10-11T21:26:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}