{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-oct-7-11728108614005.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Oct 7","description":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Poonawalla Fincorp, BEML, and Zomato","content":"Buy or sell stocks: Amid the Israel-Iran war, the Indian stock market ended lower for the fifth straight session on Friday last week. The Nifty 50 index recorded its worst week in over two years amid rising tensions in the Middle East region. After the end of Friday's session, the Nifty 50 index lost 235 points and closed at the 25,014 mark; the BSE Sensex crashed 808 points and ended at 81,688, whereas the Nifty Bank index finished 288 points lower at 51,556. Cash market volumes on the NSE were 7% lower than in the previous session. The Mid-cap index fell slightly more than the Nifty, even as the advance-decline ratio dropped sharply to 0.43:1.Sumeet Bagadia, Executive Director at Choice Broking, believes the Indian stock market trend has turned highly bearish after the biggest weekly fall in the Nifty 50 index in CY24. The Choice Broking expert said the 50-stock index has crucial support at around the 24,300 to 24,250 range. Bagadia said that the nifty Bank Index also looks weak after breaching below the 51,900 mark. He said the following support for the Nifty Bank index is now in the 49,800 to 49,700 range.Sumeet Bagadia recommended buying the following three stocks on Monday: Poonawalla Fincorp, BEML, and Zomato.1] Poonawalla Fincorp: Buy at  ₹395, target  ₹425, stop loss  ₹380.Poonawalla Fincorp share is trading at  ₹394.95 and has rebounded from its support zones. The stock recently broke out from a falling trend line and is now consolidating near the breakout levels, which validates the strength of the breakout. This bounce-back indicates stability and suggests potential for further upward movement. If Poonawalla Fincorp share sustains above the  ₹400 level, it could continue its upward trajectory towards the  ₹425 level.The momentum indicator RSI trades sideways at 50.14, supporting the bullish outlook. Additionally, Poonawalla Fincorp share is trading near its short-term 20-day EMA and medium-term 50-day EMA levels, and sustaining above these would lead to further bullish momentum.In summary, based on the favourable technical setup and key indicators (RSI and moving averages), buying Poonawalla Fincorp share at the current market price of  ₹394.95, with a stop-loss at  ₹380 and a target of  ₹425, presents a compelling opportunity for potential gains. This strategy aligns with the ongoing bullish trend in the stock.2] BEML: Buy at  ₹3664, target  ₹3960, stop loss  ₹3525.BEML is trading at 3664 and consolidating within a range near its demand zone. The stock shows signs of reversal from the support levels, presenting a potential buying opportunity. A hammer candle is also on the daily chart near the support, indicating a possible reversal. If BEML sustains above the  ₹3720 level, it could continue its upward movement towards a target of  ₹3960.The Relative Strength Index (RSI) is currently at 38.84, indicating that the stock is in a neutral zone, nearing a level where buyers might enter. Additionally, BEML is trading near its long-term (200-day) EMA and below its key moving averages, including the short-term (20-day) EMA and the medium-term (50-day) EMA. If the stock surpasses and holds above these moving averages, it could further strengthen the bullish outlook.Based on technical analysis and current market conditions, BEML presents a promising buying opportunity if it holds above the resistance levels, with a target price of  ₹3960. However, appropriate risk management strategies, such as setting a stop-loss at  ₹3525, must be applied to mitigate any downside risk.3] Zomato: Buy at  ₹275.30, target  ₹300, stop loss  ₹263.Zomato's share price is in a long-term uptrend. It has recently witnessed a pullback from its record-high levels toward its demand zone. The stock has consistently formed higher highs and higher lows over the past few months, indicating a bullish pattern. A strong bullish candle has formed on the daily chart near the support zones, suggesting a continuation of the uptrend.If the stock sustains above the  ₹280 level after bouncing from its support zones, it will likely continue its upward trajectory toward new highs. The Relative Strength Index (RSI) is at 52.99, indicating the stock is not yet overbought, supporting the bullish trend.Additionally, Zomato's share price has recently rebounded from its medium-term (50-day) EMA and surpassed its short-term (20-day) EMA, further reinforcing the strength of the current uptrend.Based on technical analysis and current market conditions, ZOMATO offers a compelling buying opportunity above its recent high for investors targeting higher price levels. The critical support zone near  ₹263 strengthens its appeal, providing a solid foundation for potential upward movement. However, applying appropriate risk management strategies to protect against any downside risks is crucial.","cleaned_content":"buy or sell stocks amid the israel iran war the indian stock market ended lower for the fifth straight session on friday last week the nifty \u003cFIVE_TEN\u003e index recorded its worst week in over two years amid rising tensions in the middle east region after the end of fridays session the nifty \u003cFIVE_TEN\u003e index lost \u003cTWO_HUNDRED\u003e points and closed at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex crashed \u003cEIGHT_HUNDRED\u003e points and ended at \u003cEIGHT_TEN_THOUSAND\u003e whereas the nifty bank index finished \u003cTWO_HUNDRED\u003e points lower at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were \u003cSEVEN_PERCENT\u003e lower than in the previous session the mid cap index fell slightly more than the nifty even as the advance decline ratio dropped sharply to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes the indian stock market trend has turned highly bearish after the biggest weekly fall in the nifty \u003cFIVE_TEN\u003e index in cy24 the choice broking expert said the \u003cFIVE_TEN\u003e stock index has crucial support at around the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range bagadia said that the nifty bank index also looks weak after breaching below the \u003cFIVE_TEN_THOUSAND\u003e mark he said the following support for the nifty bank index is now in the \u003cFOUR_TEN_THOUSAND\u003e to \u003cFOUR_TEN_THOUSAND\u003e range sumeet bagadia recommended buying the following three stocks on monday poonawalla fincorp beml and zomato 1 poonawalla fincorp buy at \u003cTHREE_HUNDRED\u003e target \u003cFOUR_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e poonawalla fincorp share is trading at \u003cTHREE_HUNDRED\u003e and has rebounded from its support zones the stock recently broke out from a falling trend line and is now consolidating near the breakout levels which validates the strength of the breakout this bounce back indicates stability and suggests potential for further upward movement if poonawalla fincorp share sustains above the \u003cFOUR_HUNDRED\u003e level it could continue its upward trajectory towards the \u003cFOUR_HUNDRED\u003e level the momentum indicator rsi trades sideways at \u003cFIVE_TEN\u003e supporting the bullish outlook additionally poonawalla fincorp share is trading near its short term \u003cTWO_TEN\u003e day ema and medium term \u003cFIVE_TEN\u003e day ema levels and sustaining above these would lead to further bullish momentum in summary based on the favourable technical setup and key indicators rsi and moving averages buying poonawalla fincorp share at the current market price of \u003cTHREE_HUNDRED\u003e with a stop loss at \u003cTHREE_HUNDRED\u003e and a target of \u003cFOUR_HUNDRED\u003e presents a compelling opportunity for potential gains this strategy aligns with the ongoing bullish trend in the stock 2 beml buy at \u003cTHREE_THOUSAND\u003e target \u003cTHREE_THOUSAND\u003e stop loss \u003cTHREE_THOUSAND\u003e beml is trading at \u003cTHREE_THOUSAND\u003e and consolidating within a range near its demand zone the stock shows signs of reversal from the support levels presenting a potential buying opportunity a hammer candle is also on the daily chart near the support indicating a possible reversal if beml sustains above the \u003cTHREE_THOUSAND\u003e level it could continue its upward movement towards a target of \u003cTHREE_THOUSAND\u003e the relative strength index rsi is currently at \u003cTHREE_TEN\u003e indicating that the stock is in a neutral zone nearing a level where buyers might enter additionally beml is trading near its long term \u003cTWO_HUNDRED\u003e day ema and below its key moving averages including the short term \u003cTWO_TEN\u003e day ema and the medium term \u003cFIVE_TEN\u003e day ema if the stock surpasses and holds above these moving averages it could further strengthen the bullish outlook based on technical analysis and current market conditions beml presents a promising buying opportunity if it holds above the resistance levels with a target price of \u003cTHREE_THOUSAND\u003e however appropriate risk management strategies such as setting a stop loss at \u003cTHREE_THOUSAND\u003e must be applied to mitigate any downside risk 3 zomato buy at \u003cTWO_HUNDRED\u003e target \u003cTHREE_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e zomatos share price is in a long term uptrend it has recently witnessed a pullback from its record high levels toward its demand zone the stock has consistently formed higher highs and higher lows over the past few months indicating a bullish pattern a strong bullish candle has formed on the daily chart near the support zones suggesting a continuation of the uptrend if the stock sustains above the \u003cTWO_HUNDRED\u003e level after bouncing from its support zones it will likely continue its upward trajectory toward new highs the relative strength index rsi is at \u003cFIVE_TEN\u003e indicating the stock is not yet overbought supporting the bullish trend additionally zomatos share price has recently rebounded from its medium term \u003cFIVE_TEN\u003e day ema and surpassed its short term \u003cTWO_TEN\u003e day ema further reinforcing the strength of the current uptrend based on technical analysis and current market conditions zomato offers a compelling buying opportunity above its recent high for investors targeting higher price levels the critical support zone near \u003cTWO_HUNDRED\u003e strengthens its appeal providing a solid foundation for potential upward movement however applying appropriate risk management strategies to protect against any downside risks is crucial","timestamp":"2024-10-07T06:45:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}