{"url":"https://www.livemint.com/market/stock-market-news/asia-index-private-launches-three-new-indices-details-here-11728050977870.html","title":"Asia Index Private launches three new indices; details here","description":"Asia Index Private Ltd., a wholly-owned subsidiary of BSE, announced on Friday the launch of three new indices: the BSE SENSEX Sixty 65:35, the BSE SENSEX Sixty, and the BSE Power and Energy Index.","content":"Asia Index Private Ltd., which is fully owned subsidiary of BSE, on Friday announced the introduction of three new indices - the BSE SENSEX Sixty 65:35, the BSE SENSEX Sixty, and the BSE Power and Energy Index.“These indices are in line with the broader philosophy of BSE group of listening to the Voice of Customer and creating products that resonate with the investors and asset managers alike. These launches are a small step in expanding our offerings and we hope to continue bringing more meaningful products by working very closely with capital market participants,\" said Ashutosh Singh, MD and CEO of Asia Index Pvt Limited.BSE SENSEX Sixty 65:35 – It is a strategy index comprising of the constituents of BSE SENSEX and BSE SENSEX Next 30 in the ratio of 65: 35 respectively. The 60 constituents represent over 55% of the total free float market capitalisation of all listed entities in India. The ratio is designed to give a slightly higher exposure to the Next 30 constituents vis-a-vis the pure freefloat market capitalisation method.BSE SENSEX Sixty – This index comprises the constituents of the BSE SENSEX and the BSE SENSEX Next 30 in order of their free float market capitalization.The indices have a base value of 10000 and the first value date is 23rd June 2014. It is reconstituted semi-annually and rebalanced quarterly. It has a USD variant namely BSE SENSEX Sixty USD and BSE SENSEX Sixty 65:35 USD.BSE Power and Energy – It is a thematic index that measures the performance of companies that are present in the BSE 500 from ‘Energy’ and ‘Utility’ sectors. The index will reflect the weighted performance of the constituents belonging to the above sectors.The index has a base value of 1000, and the first value date is 31st December 2013. The index is reconstituted semi-annually and rebalanced quarterly. The weight of the 30 stocks in the index is based on their free-float market capitalization with the weight of each stock in the index capped at 15%. It has a USD variant namely BSE Power and Energy USD.The indices can be used for benchmarking of PMS strategies, MF Schemes and fund portfolios. It can also be used for running passive strategies such as ETFs and Index Funds as well as gauging the performance of companies in the aforesaid sectors. Investors can now access a broader spectrum of market opportunities, further enriching their investment strategies with the latest additions to BSE's suite of indices.Asia Index Private Ltd is a wholly owned subsidiary of BSE Ltd, Asia’s oldest stock exchange and home to the iconic SENSEX index – a leading indicator of Indian equity market performance. Asia Index Pvt. Ltd aims to provide a full array of indices to global / domestic investors and calculates, publishes, and maintains a diverse family of indices.","cleaned_content":"asia index private ltd which is fully owned subsidiary of bse on friday announced the introduction of three new indices the bse sensex sixty \u003cSIX_TEN\u003e \u003cTHREE_TEN\u003e the bse sensex sixty and the bse power and energy index these indices are in line with the broader philosophy of bse group of listening to the voice of customer and creating products that resonate with the investors and asset managers alike these launches are a small step in expanding our offerings and we hope to continue bringing more meaningful products by working very closely with capital market participants said ashutosh singh md and ceo of asia index pvt limited bse sensex sixty \u003cSIX_TEN\u003e \u003cTHREE_TEN\u003e it is a strategy index comprising of the constituents of bse sensex and bse sensex next \u003cTHREE_TEN\u003e in the ratio of \u003cSIX_TEN\u003e \u003cTHREE_TEN\u003e respectively the \u003cSIX_TEN\u003e constituents represent over \u003cFIVE_TEN_PERCENT\u003e of the total free float market capitalisation of all listed entities in india the ratio is designed to give a slightly higher exposure to the next \u003cTHREE_TEN\u003e constituents vis a vis the pure freefloat market capitalisation method bse sensex sixty this index comprises the constituents of the bse sensex and the bse sensex next \u003cTHREE_TEN\u003e in order of their free float market capitalization the indices have a base value of \u003cONE_TEN_THOUSAND\u003e and the first value date is \u003cTWO_TEN\u003e rd june \u003cTWO_THOUSAND\u003e it is reconstituted semi annually and rebalanced quarterly it has a usd variant namely bse sensex sixty usd and bse sensex sixty \u003cSIX_TEN\u003e \u003cTHREE_TEN\u003e usd bse power and energy it is a thematic index that measures the performance of companies that are present in the bse \u003cFIVE_HUNDRED\u003e from energy and utility sectors the index will reflect the weighted performance of the constituents belonging to the above sectors the index has a base value of \u003cONE_THOUSAND\u003e and the first value date is \u003cTHREE_TEN\u003e st december \u003cTWO_THOUSAND\u003e the index is reconstituted semi annually and rebalanced quarterly the weight of the \u003cTHREE_TEN\u003e stocks in the index is based on their free float market capitalization with the weight of each stock in the index capped at \u003cONE_TEN_PERCENT\u003e it has a usd variant namely bse power and energy usd the indices can be used for benchmarking of pms strategies mf schemes and fund portfolios it can also be used for running passive strategies such as etfs and index funds as well as gauging the performance of companies in the aforesaid sectors investors can now access a broader spectrum of market opportunities further enriching their investment strategies with the latest additions to bses suite of indices asia index private ltd is a wholly owned subsidiary of bse ltd asia s oldest stock exchange and home to the iconic sensex index a leading indicator of indian equity market performance asia index pvt ltd aims to provide a full array of indices to global domestic investors and calculates publishes and maintains a diverse family of indices","timestamp":"2024-10-04T20:02:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}