{"url":"https://www.livemint.com/market/stock-market-news/q2-will-see-slowest-earnings-growth-for-nifty-companies-in-17-quarters-mofsl-report-11728313203215.html","title":"Q2 FY25 to see slowest earnings growth for Nifty companies in 17 quarters: MOFSL report","description":"After four years of robust double-digit growth, the slowdown in corporate earnings is expected due to pressures from commodity prices, diminishing tailwinds from improvements in BFSI asset quality, a high comparative base, and declining demand, according to MOFSL.","content":"Motilal Oswal Financial Services (MOFSL), in its latest report, said that Q2 will see the slowest earnings growth for Nifty companies in 17 quarters, caught between tailwinds and headwinds.After four years of robust double-digit growth, the slowdown in corporate earnings is expected due to pressures from commodity prices, diminishing tailwinds from improvements in BFSI asset quality, a high comparative base, and declining demand, according to MOFSL.Considering these trends, MOFSL projected only a 2 percent earnings growth for Nifty companies in the July-September quarter. Additionally, the EBITDA margin (excluding financials) is anticipated to decrease by 40 basis points year-over-year to 20 percent, primarily affected by oil marketing companies and a reduction in favorable conditions due to a high base.According to MOFSL, earnings growth in Q2 is anticipated to be led once again by the BFSI sector, with a projected 11 percent year-on-year increase. This is further bolstered by a 15 percent rise in healthcare, a 24 percent jump in utilities, and a notable improvement in the telecom sector, where losses are expected to decrease significantly to  ₹400 crore in September 2024, down from  ₹4,300 crore the previous year.On the other hand, cyclicals could hamper earnings growth, with oil and gas (driven by OMCs) and cement projected to see earnings declines of 33 percent and 41 percent, respectively. Metals and automobiles are expected to post only single-digit growth, according to MOFSL forecasts. In contrast, other sectors are anticipated to show more robust growth, with real estate expected to rise by 44 percent, retail by 17 percent, capital goods by 13 percent, and consumer goods by 4 percent, indicating moderate overall earnings growth.For FY25, MOFSL anticipates a more balanced outlook, with earnings growth aligning more closely with revenue trends.In response to the evolving earnings landscape, MOFSL has adjusted its model portfolio. Among large-cap stocks, the brokerage is optimistic about ICICI Bank, HDFC Bank, L\u0026T, HCL Tech, HUL, M\u0026M, Power Grid, Titan, Bharti Airtel, and Mankind Pharma. In the mid-cap and small-cap categories, its top picks include Indian Hotels, Angel One, Godrej Properties, Persistent Systems, Metro Brands, PNB Housing, Global Health, Cello World, Dixon Tech, and Five Star Business Finance.","cleaned_content":"motilal oswal financial services mofsl in its latest report said that q2 will see the slowest earnings growth for nifty companies in \u003cONE_TEN\u003e quarters caught between tailwinds and headwinds after four years of robust double digit growth the slowdown in corporate earnings is expected due to pressures from commodity prices diminishing tailwinds from improvements in bfsi asset quality a high comparative base and declining demand according to mofsl considering these trends mofsl projected only a \u003cTWO_PERCENT\u003e earnings growth for nifty companies in the july september quarter additionally the ebitda margin excluding financials is anticipated to decrease by \u003cFOUR_TEN\u003e basis points year over year to \u003cTWO_TEN_PERCENT\u003e primarily affected by oil marketing companies and a reduction in favorable conditions due to a high base according to mofsl earnings growth in q2 is anticipated to be led once again by the bfsi sector with a projected \u003cONE_TEN_PERCENT\u003e year on year increase this is further bolstered by a \u003cONE_TEN_PERCENT\u003e rise in healthcare a \u003cTWO_TEN_PERCENT\u003e jump in utilities and a notable improvement in the telecom sector where losses are expected to decrease significantly to \u003cFOUR_HUNDRED\u003e crore in september \u003cTWO_THOUSAND\u003e down from \u003cFOUR_THOUSAND\u003e crore the previous year on the other hand cyclicals could hamper earnings growth with oil and gas driven by omcs and cement projected to see earnings declines of \u003cTHREE_TEN_PERCENT\u003e and \u003cFOUR_TEN_PERCENT\u003e respectively metals and automobiles are expected to post only single digit growth according to mofsl forecasts in contrast other sectors are anticipated to show more robust growth with real estate expected to rise by \u003cFOUR_TEN_PERCENT\u003e retail by \u003cONE_TEN_PERCENT\u003e capital goods by \u003cONE_TEN_PERCENT\u003e and consumer goods by \u003cFOUR_PERCENT\u003e indicating moderate overall earnings growth for fy25 mofsl anticipates a more balanced outlook with earnings growth aligning more closely with revenue trends in response to the evolving earnings landscape mofsl has adjusted its model portfolio among large cap stocks the brokerage is optimistic about icici bank hdfc bank l t hcl tech hul m m power grid titan bharti airtel and mankind pharma in the mid cap and small cap categories its top picks include indian hotels angel one godrej properties persistent systems metro brands pnb housing global health cello world dixon tech and five star business finance","timestamp":"2024-10-07T21:29:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}