{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-from-ongc-to-sbi-ganesh-dongre-recommends-three-stocks-for-monday-11728212629593.html","title":"Buy or sell: From ONGC to SBI — Ganesh Dongre recommends three stocks for Monday","description":"Buy or sell: Ganesh Dongre, Senior Manager - Technical Research at Anand Rathi believes further correction may occur if the Nifty falls below the 24,800-24,900 zone in the coming week, potentially driving the index toward 24,000 level.","content":"Buy or sell: As discussed last week, both the Nifty and Bank Nifty indices were in overbought conditions, resulting in a significant correction over the past week. The Nifty index dropped by nearly 5%, closing at 25,014, while the Bank Nifty corrected by about 6%, ending at 51,462.The Federal Reserve's decision to cut interest rates by half a percentage point had initially caused a strong upward movement in the market, reflecting optimism about the Fed’s progress in controlling inflation. This, in turn, boosted investor confidence. However, the market’s sentiment shifted as geopolitical tensions between Israel and Iran, combined with SEBI’s tighter rules on the derivatives market, prompted traders to focus on profit booking.The week started with a gap-down opening for Nifty as the index tested the 26,400-resistance zone. Continuous profit booking was observed throughout the week, and the Nifty eventually closed near the 24,800-25,000-support zone. The critical near-term support stands at 24,900, aligning with the previous month's low. A further correction may occur if the Nifty falls below the 24,800-24,900 zone in the coming week, potentially driving the index toward 24,000 level. Key support for the week is placed at 24,800, while resistance is at 25,700. If the index manages a sustainable close above the 25,700-25,800 level, it could lead to an upward trajectory.In line with the broader Nifty index, Bank Nifty has also been bearish. The index, which was in overbought territory last week, saw a correction toward its major support zone of 52,000. It opened with a gap-down on Monday and faced continuous selling pressure until it hit this support level. If Bank Nifty sustains below 52,000 on a daily closing basis, further correction toward 50,000 is likely. The immediate resistance for Bank Nifty is at 53,000, which is the previous weekly high, while key support stands at 50,000. A cautious stance is advised if the index closes below 52,000.Both the Nifty and Bank Nifty indices have managed to close above their respective monthly support zones, despite initial market volatility, maintaining a generally bullish bias. Investors are advised to closely monitor key support and resistance levels as they evaluate trading opportunities in the forthcoming sessions.1] ONGC: Buy at  ₹290-295 | Target Price:  ₹315 | Stop Loss:  ₹2802] SBI: Buy at  ₹790-795 | Target Price:  ₹815 | Stop Loss:  ₹7753] Aurobindo Pharma: Buy at  ₹1465 | Target Price:  ₹1535 | Stop Loss:  ₹1410","cleaned_content":"buy or sell as discussed last week both the nifty and bank nifty indices were in overbought conditions resulting in a significant correction over the past week the nifty index dropped by nearly \u003cFIVE_PERCENT\u003e closing at \u003cTWO_TEN_THOUSAND\u003e while the bank nifty corrected by about \u003cSIX_PERCENT\u003e ending at \u003cFIVE_TEN_THOUSAND\u003e the federal reserves decision to cut interest rates by half a percentage point had initially caused a strong upward movement in the market reflecting optimism about the fed s progress in controlling inflation this in turn boosted investor confidence however the market s sentiment shifted as geopolitical tensions between israel and iran combined with sebi s tighter rules on the derivatives market prompted traders to focus on profit booking the week started with a gap down opening for nifty as the index tested the \u003cTWO_TEN_THOUSAND\u003e resistance zone continuous profit booking was observed throughout the week and the nifty eventually closed near the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e support zone the critical near term support stands at \u003cTWO_TEN_THOUSAND\u003e aligning with the previous months low a further correction may occur if the nifty falls below the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e zone in the coming week potentially driving the index toward \u003cTWO_TEN_THOUSAND\u003e level key support for the week is placed at \u003cTWO_TEN_THOUSAND\u003e while resistance is at \u003cTWO_TEN_THOUSAND\u003e if the index manages a sustainable close above the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e level it could lead to an upward trajectory in line with the broader nifty index bank nifty has also been bearish the index which was in overbought territory last week saw a correction toward its major support zone of \u003cFIVE_TEN_THOUSAND\u003e it opened with a gap down on monday and faced continuous selling pressure until it hit this support level if bank nifty sustains below \u003cFIVE_TEN_THOUSAND\u003e on a daily closing basis further correction toward \u003cFIVE_TEN_THOUSAND\u003e is likely the immediate resistance for bank nifty is at \u003cFIVE_TEN_THOUSAND\u003e which is the previous weekly high while key support stands at \u003cFIVE_TEN_THOUSAND\u003e a cautious stance is advised if the index closes below \u003cFIVE_TEN_THOUSAND\u003e both the nifty and bank nifty indices have managed to close above their respective monthly support zones despite initial market volatility maintaining a generally bullish bias investors are advised to closely monitor key support and resistance levels as they evaluate trading opportunities in the forthcoming sessions 1 ongc buy at \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e target price \u003cTHREE_HUNDRED\u003e stop loss \u003cTWO_THOUSAND\u003e sbi buy at \u003cSEVEN_HUNDRED\u003e \u003cSEVEN_HUNDRED\u003e target price \u003cEIGHT_HUNDRED\u003e stop loss \u003cSEVEN_THOUSAND\u003e aurobindo pharma buy at \u003cONE_THOUSAND\u003e target price \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e","timestamp":"2024-10-06T16:55:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}