{"url":"https://www.livemint.com/market/stock-market-news/india-steel-companies-in-a-sweet-spot-says-nomura-assigns-buy-to-jsw-steel-jindal-steel-power-11728018703801.html","title":"India steel companies in a sweet spot, says Nomura; assigns ‘Buy’ to JSW Steel, Jindal Steel \u0026 Power","description":"Nomura's report highlights India's steel companies' competitive edge in the global market due to lower costs and strong domestic demand. The brokerage recommends 'buy' ratings for JSW Steel and Jindal Steel and Power, expecting improved earnings and growth in the sector.","content":"India's steel companies hold a favourable position in the global metals sector, said global brokerage firm, Nomura in its recent report. The brokerage noted that major steel producers in India operate with lower costs compared to global averages, mainly due to reduced labour expenses. Even non-integrated players in India have lower iron ore costs compared to those in other countries. The major Indian players have significant brownfield potential, and the brokerage foresees that the next phase of expansion will prioritise brownfield development, resulting in higher incremental ROCE.Strong domestic demand should also lessen reliance on exports. During the course of CY19–23, India's steel output grew at a 6% CAGR, compared to barely 1% for China and -1% for the ROW.“We believe Indian steel majors are among the best-placed producers globally,” said Nomura in its report.The brokerage house has initiated coverage on JSW Steel and given it a 'buy' rating, with a target price of  ₹1,220, implying a potential upside of 22% from the September 27 price of  ₹1,002. In addition, Nomura has also started covering Jindal Steel and Power, rating it as a 'buy' and setting a target price of  ₹1,200, indicating a potential upside of 17% from the September 27 price of  ₹1,028.Nomura indicated that JSW Steel Ltd and Jindal Steel and Power Ltd are gradually moving towards an optimal capital structure by consistently lowering debt, even in times of economic decline. This is anticipated to lower the cost of capital as the risk of default diminishes.Nomura initiated coverage on both stocks with a ‘Buy’ rating because of the expansion of capacity and the integration of raw materials.From FY12 to FY24, the one-year forward EV/EBITDA for JSW Steel and Jindal Steel and Power fluctuated between 4.0x and 10.0x, with a median multiple of 6.5x. Throughout this period, the median or mid-cycle EBIDTA/t for JSW Steel and Jindal Steel and Power ranged from  ₹8,000 to  ₹10,000/t.“However, we believe the mid-cycle earnings of JSW Steel and Jindal Steel and Power have structurally improved on account of stronger domestic demand, cost saving measures and improved efficiency. As a result, we expect  ₹11,000-12,000/t to be the new steady state EBITDA for these companies, and believe 7.5x to be the new mid-cycle multiple for these companies,” said Nomura.On Friday's session, at 11:07 IST, JSW Steel share price was trading 0.73% higher at  ₹1,047.40, and Jindal Steel \u0026 Power share price was trading 0.51% lower at  ₹1,045.30","cleaned_content":"indias steel companies hold a favourable position in the global metals sector said global brokerage firm nomura in its recent report the brokerage noted that major steel producers in india operate with lower costs compared to global averages mainly due to reduced labour expenses even non integrated players in india have lower iron ore costs compared to those in other countries the major indian players have significant brownfield potential and the brokerage foresees that the next phase of expansion will prioritise brownfield development resulting in higher incremental roce strong domestic demand should also lessen reliance on exports during the course of cy19 \u003cTWO_TEN\u003e indias steel output grew at a \u003cSIX_PERCENT\u003e cagr compared to barely \u003cONE_PERCENT\u003e for china and \u003cONE_PERCENT\u003e for the row we believe indian steel majors are among the best placed producers globally said nomura in its report the brokerage house has initiated coverage on jsw steel and given it a buy rating with a target price of \u003cONE_THOUSAND\u003e implying a potential upside of \u003cTWO_TEN_PERCENT\u003e from the september \u003cTWO_TEN\u003e price of \u003cONE_THOUSAND\u003e in addition nomura has also started covering jindal steel and power rating it as a buy and setting a target price of \u003cONE_THOUSAND\u003e indicating a potential upside of \u003cONE_TEN_PERCENT\u003e from the september \u003cTWO_TEN\u003e price of \u003cONE_THOUSAND\u003e nomura indicated that jsw steel ltd and jindal steel and power ltd are gradually moving towards an optimal capital structure by consistently lowering debt even in times of economic decline this is anticipated to lower the cost of capital as the risk of default diminishes nomura initiated coverage on both stocks with a buy rating because of the expansion of capacity and the integration of raw materials from fy12 to fy24 the one year forward ev ebitda for jsw steel and jindal steel and power fluctuated between \u003cFOUR_\u003e x and \u003cONE_TEN\u003e x with a median multiple of \u003cSIX_\u003e x throughout this period the median or mid cycle ebidta t for jsw steel and jindal steel and power ranged from \u003cEIGHT_THOUSAND\u003e to \u003cONE_TEN_THOUSAND\u003e t however we believe the mid cycle earnings of jsw steel and jindal steel and power have structurally improved on account of stronger domestic demand cost saving measures and improved efficiency as a result we expect \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e t to be the new steady state ebitda for these companies and believe \u003cSEVEN_\u003e x to be the new mid cycle multiple for these companies said nomura on fridays session at \u003cONE_TEN\u003e \u003cSEVEN_\u003e ist jsw steel share price was trading \u003cZERO_PERCENT\u003e higher at \u003cONE_THOUSAND\u003e and jindal steel power share price was trading \u003cZERO_PERCENT\u003e lower at \u003cONE_THOUSAND\u003e","timestamp":"2024-10-04T11:23:00+05:30","market_timestamp":"2024-10-04T11:23:00+05:30","off_market_hours":false}