{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-ruchit-jain-of-5paisa-recommends-infosys-and-kpit-technologies-today-11728358788312.html","title":"Shares to buy or sell: Ruchit Jain of 5paisa recommends Infosys, and KPIT Technologies today","description":"Shares to buy or sell: Ruchit Jain of 5paisa has recommended two stocks today - Infosys Ltd, and KPIT Technologies Ltd.","content":"Stock Market News: On Tuesday's opening session, the domestic benchmark indices, Nifty 50 and Sensex, saw continuous selling pressure, following the patterns observed in other Asian markets. Investors are eagerly awaiting the announcement of local quarterly earnings and the upcoming monetary policy decision by the Reserve Bank of India (RBI).The Nifty 50 index saw a 36-point increase, commencing at 24,832.20 points, whereas the Sensex index started at 80,826.56 points, marking a decrease of 223.44 points.According to analysts, Indian stocks are under selling pressure as a result of geopolitical tensions and the continued shift of foreign investments from India to China.Dr. V K Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, mentioned that the market's weakness is a response to negative signals stemming from escalating geopolitical tensions in the Middle East, significant FPI selling, and concerns about today's election results. The primary factor contributing to the Nifty 50's 5.6% decline from its peak has been the sustained large-scale FPI selling over the last six trading days.These are unusual times for index movements. Over the past month, the Hang Seng has surged by 32%, and the Shanghai composite experienced an 8% increase in a single day. In comparison, the Indian market remains relatively stable, despite its weakness.Nifty 50 continued its corrective phase at the start of the week. It started the day on a flat note but witnessed selling pressure throughout the day and ended below 24,800 mark.Post the recent correction from the highs, Nifty 50 has now retraced the previous upmove from 23,900 to 26,277 by 61.8%. The 89 EMA on the daily chart is around 24,525 and the RSI reading on the lower time frame chart is in the oversold zone. Hence, there's a possibility of some pullback move from the support zone of 24,800-24,525 to relieve the oversold set ups.However, there are no signs as of now that the markets would bottom out here and hence one should initially see the up move if any as a pullback move only. Depending upon the data and the price volume action, one can then review the market movement as the global news flows and the RBI policy meeting outcome during the week will be crucial to determine the near term trend. The India VIX is rising gradually hinting at the possibility of increasing volatility in the short term.On shares to buy or sell on Tuesday, Ruchit Jain recommends Infosys Ltd, and KPIT Technologies Ltd.The stock has consolidated in a range in last couple of weeks which seems to be time wise correction within an uptrend. In this consolidation, the 40 EMA on the daily chart has acted as a support and the RSI oscillator has given a positive crossover post correction from the overbought zone. Hence, traders are advised to buy the stock in the range of  ₹1,930-1,920 for potential target of  ₹2,070. Citing the market volatility, traders are advised to keep a strict stoploss below the support of  ₹1,850.The stock has corrected from its highs along with the broader markets, but is now trading around its 100 EMA support. The RSI has given a positive crossover and the risk reward seems favourable here for buying the stock.Hence, short term traders can look to buy the stock in the range of  ₹1,705-1,695 for potential target around  ₹1,850. The stoploss on short positions should be placed below  ₹1,620.","cleaned_content":"stock market news on tuesdays opening session the domestic benchmark indices nifty \u003cFIVE_TEN\u003e and sensex saw continuous selling pressure following the patterns observed in other asian markets investors are eagerly awaiting the announcement of local quarterly earnings and the upcoming monetary policy decision by the reserve bank of india rbi the nifty \u003cFIVE_TEN\u003e index saw a \u003cTHREE_TEN\u003e point increase commencing at \u003cTWO_TEN_THOUSAND\u003e points whereas the sensex index started at \u003cEIGHT_TEN_THOUSAND\u003e points marking a decrease of \u003cTWO_HUNDRED\u003e points according to analysts indian stocks are under selling pressure as a result of geopolitical tensions and the continued shift of foreign investments from india to china dr v k vijayakumar the chief investment strategist at geojit financial services mentioned that the markets weakness is a response to negative signals stemming from escalating geopolitical tensions in the middle east significant fpi selling and concerns about todays election results the primary factor contributing to the nifty \u003cFIVE_TEN\u003e s \u003cFIVE_PERCENT\u003e decline from its peak has been the sustained large scale fpi selling over the last six trading days these are unusual times for index movements over the past month the hang seng has surged by \u003cTHREE_TEN_PERCENT\u003e and the shanghai composite experienced an \u003cEIGHT_PERCENT\u003e increase in a single day in comparison the indian market remains relatively stable despite its weakness nifty \u003cFIVE_TEN\u003e continued its corrective phase at the start of the week it started the day on a flat note but witnessed selling pressure throughout the day and ended below \u003cTWO_TEN_THOUSAND\u003e mark post the recent correction from the highs nifty \u003cFIVE_TEN\u003e has now retraced the previous upmove from \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e by \u003cSIX_TEN_PERCENT\u003e the \u003cEIGHT_TEN\u003e ema on the daily chart is around \u003cTWO_TEN_THOUSAND\u003e and the rsi reading on the lower time frame chart is in the oversold zone hence theres a possibility of some pullback move from the support zone of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e to relieve the oversold set ups however there are no signs as of now that the markets would bottom out here and hence one should initially see the up move if any as a pullback move only depending upon the data and the price volume action one can then review the market movement as the global news flows and the rbi policy meeting outcome during the week will be crucial to determine the near term trend the india vix is rising gradually hinting at the possibility of increasing volatility in the short term on shares to buy or sell on tuesday ruchit jain recommends infosys ltd and kpit technologies ltd the stock has consolidated in a range in last couple of weeks which seems to be time wise correction within an uptrend in this consolidation the \u003cFOUR_TEN\u003e ema on the daily chart has acted as a support and the rsi oscillator has given a positive crossover post correction from the overbought zone hence traders are advised to buy the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for potential target of \u003cTWO_THOUSAND\u003e citing the market volatility traders are advised to keep a strict stoploss below the support of \u003cONE_THOUSAND\u003e the stock has corrected from its highs along with the broader markets but is now trading around its \u003cONE_HUNDRED\u003e ema support the rsi has given a positive crossover and the risk reward seems favourable here for buying the stock hence short term traders can look to buy the stock in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for potential target around \u003cONE_THOUSAND\u003e the stoploss on short positions should be placed below \u003cONE_THOUSAND\u003e","timestamp":"2024-10-08T10:00:00+05:30","market_timestamp":"2024-10-08T10:00:00+05:30","off_market_hours":false}