{"url":"https://www.livemint.com/market/stock-market-news/hong-kongs-hang-seng-index-plunges-9-4-highest-fall-since-2008-heres-why-11728405582308.html","title":"Hong Kong’s Hang Seng Index plunges 9.4%, highest fall since 2008; here’s why","description":"Hong Kong's Hang Seng Index fell 9.4 per cent, its biggest drop since 2008, erasing previous gains.","content":"Hang Seng Index of Hong Kong has dropped by 9.4 per cent, which is its biggest decline since 2008. This drop has wiped out its highest gains made during a Chinese holiday.Previously, Zheng Shanjie, the Chairperson of China's National Development and Reform Commission, stated that China was \"fully confident\" of accomplishing economic targets for 2024 and will use 200 billion yuan ($28.36 billion) from next year's budget to fund investment projects and support local governments, reported Reuters.Shares of Chinese companies listed in the US dipped. The shares of Alibaba Group, JD.com and PDD Holdings dropped in the range of 5.9 per cent and 6.3 per cent.The National Development and Reform Commission, China's economic planning agency, on Tuesday laid out a set of actions to boost the economy. However, these actions did not involve major investments, which contributed to the 9.4 per cent drop in the Hang Seng index in Hong Kong.China's proposed stimulus on Tuesday has disappointed investors and the global stocks dipped. The investors are now focusing on upcoming US inflation data and corporate results.However, US stocks were trading higher in the initial stages, and the benchmark S\u0026P 500 rebounded from a drop of almost 1 per cent in the previous session. The technology stocks gained about 1.3 per cent.The impact of China's economic stimulus was also felt on a few stocks of companies in Europe and the United States that trade a lot with China. Shares of Estee Lauder fell by 2.3 per cent, whereas Wynn Resorts plunged by 2 per cent. Commodity markets, too, showed the impact of China's disappointing stimulus as the Brent crude futures dropped by nearly 2 per cent.Earlier, the World Bank estimated that despite economic stimulus, China’s economic growth will further slow down in 2025. This might put extra pressure on economies in East Asia and the Pacific, according to a report by Bloomberg.According to the World Bank's latest economic outlook, the forecast for China’s growth has dropped to 4.3 per cent in 2025, marking a drop of 4.8 per cent which was expected in 2024. Due to this, growth in East Asia and the Pacific countries such as Indonesia, Australia, and South Korea is predicted to slow down to 4.4 per cent in 2025 from about 4.8 per cent in 2023, the report added.","cleaned_content":"hang seng index of hong kong has dropped by \u003cNINE_PERCENT\u003e which is its biggest decline since \u003cTWO_THOUSAND\u003e this drop has wiped out its highest gains made during a chinese holiday previously zheng shanjie the chairperson of chinas national development and reform commission stated that china was fully confident of accomplishing economic targets for \u003cTWO_THOUSAND\u003e and will use \u003cTWO_HUNDRED\u003e billion yuan \u003cTWO_TEN\u003e billion from next years budget to fund investment projects and support local governments reported reuters shares of chinese companies listed in the us dipped the shares of alibaba group jd com and pdd holdings dropped in the range of \u003cFIVE_PERCENT\u003e and \u003cSIX_PERCENT\u003e the national development and reform commission chinas economic planning agency on tuesday laid out a set of actions to boost the economy however these actions did not involve major investments which contributed to the \u003cNINE_PERCENT\u003e drop in the hang seng index in hong kong chinas proposed stimulus on tuesday has disappointed investors and the global stocks dipped the investors are now focusing on upcoming us inflation data and corporate results however us stocks were trading higher in the initial stages and the benchmark s p \u003cFIVE_HUNDRED\u003e rebounded from a drop of almost \u003cONE_PERCENT\u003e in the previous session the technology stocks gained about \u003cONE_PERCENT\u003e the impact of chinas economic stimulus was also felt on a few stocks of companies in europe and the united states that trade a lot with china shares of estee lauder fell by \u003cTWO_PERCENT\u003e whereas wynn resorts plunged by \u003cTWO_PERCENT\u003e commodity markets too showed the impact of chinas disappointing stimulus as the brent crude futures dropped by nearly \u003cTWO_PERCENT\u003e earlier the world bank estimated that despite economic stimulus china s economic growth will further slow down in \u003cTWO_THOUSAND\u003e this might put extra pressure on economies in east asia and the pacific according to a report by bloomberg according to the world banks latest economic outlook the forecast for china s growth has dropped to \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e marking a drop of \u003cFOUR_PERCENT\u003e which was expected in \u003cTWO_THOUSAND\u003e due to this growth in east asia and the pacific countries such as indonesia australia and south korea is predicted to slow down to \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e from about \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the report added","timestamp":"2024-10-08T23:14:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}