{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-50-back-in-the-red-reliance-bajaj-finance-top-drags-11728986279719.html","title":"Stock market today: Sensex, Nifty 50 back in the red; Reliance, Bajaj Finance top drags","description":"Stock market today: Indian stock market benchmarks, the Sensex and the Nifty 50, fell on October 15 due to losses in major shares and weak global cues. Concerns over inflation and unimpressive Q2 earnings contributed to the decline, although falling crude oil prices provided some relief.","content":"Stock market today: Losses in shares of select heavyweights, including Reliance Industries, Bajaj Finance, and Bajaj Auto, dragged Indian stock market benchmarks—the Sensex and the Nifty 50—into negative territory on Tuesday, October 15, even as mid and small-cap segments of the market ended with gains.Weak global cues, unimpressive Q2 earnings and concerns over sticky inflation also weighed on market sentiment. However, a sharp fall in crude oil prices offered some comfort and capped the losses for the market.There were no clear cues from global peers. European markets and US futures traded mixed, while oil prices crashed after reports that Israel will not strike Iranian energy targets. Crude benchmark Brent Crude crashed over 5 per cent to the level near $73 per barrel.The domestic market lacks new catalysts to sustain its gains, and the lacklustre September quarter earnings raise concerns that the Indian market's stretched valuations may be unsustainable.The market needs good earnings to sustain its valuations. As earnings are a key driver of a company's intrinsic value, earnings growth justifies higher prices and keeps valuation metrics like the P/E (price-to-earnings) ratio in check, supporting investor confidence. Without solid earnings, valuations become difficult to justify, and stock prices are at risk of a downturn.Meanwhile, the spectre of inflation has come back to haunt investors. India's retail inflation rose to a nine-month high in September due to higher food prices. Government data on Monday showed annual retail inflation, based on the all-India Consumer Price Index (CPI), rose to 5.49 per cent in September, higher than 3.65 per cent in August. This is the highest retail inflation rate since December 2023, when it was 5.69 per cent.The Sensex slipped 153 points, or 0.19 per cent, to 81,820.12, while the Nifty 50 closed 71 points, or 0.28 per cent, lower at 25,057.35.Shares of Reliance Industries ended as the top drag on the Sensex and the Nifty 50. The stock ended 2.06 per cent lower after it reported a fall in its net profit for Q2FY25.Among the sectoral indices on the NSE, Nifty Metal fell 1.44 per cent, followed by Nifty Auto which declined 0.83 per cent.On the other hand, the realty index jumped 2.05 per cent.The Nifty Bank index closed with a mild gain of 0.17 per cent, while the PSU Bank and Private Bank indices fell 0.21 per cent and 0.06 per cent, respectively.While the benchmark indices ended lower, the mid and smallcap segments bucked the trend. The BSE Midcap index rose 0.25 per cent, while the BSE Smallcap index witnessed a smart gain of 1.05 per cent.Thanks to gains in the mid and small-caps, the overall market capitalisation (m-cap) of BSE-listed firms inched up to nearly  ₹463.9 lakh crore from about  ₹463.6 lakh crore in the previous session.Meanwhile, as many as 258 stocks, including Infosys, HCL Tech, Tech Mahindra, Persistent Systems, Divi's Labs and HDFC Asset Management Company, hit their fresh 52-week highs in intraday trade on the BSE.According to Vinod Nair, the head of research at Geojit Financial Services, the domestic market fell due to a mixed global trend and partial profit booking. Nair underscored although declining crude prices are beneficial for the domestic economy, they signal weakening global demand.Additionally, Nair said India’s CPI surged due to food prices, which will delay expected rate cuts. Furthermore, subdued corporate Q2 results are leading to a cautious stance.On the technical front, Shrikant Chouhan, the head of equity research at Kotak Securities, underscored that on the daily charts, the Nifty 50 formed a bearish candle, which indicates temporary weakness.\"We are of the view that the short-term market texture is non-directional, and rangebound activity is likely to continue in the near future. For the day traders now, 25,000/81,500 would be the immediate support zone. Above this, we could see one quick pullback rally until 25,200-25,250/82,300-82,500. On the flip side, below 25,000/81,500, the market could retest the level of 24,920-24,900/81,000-80,700,\" said Chouhan.Read all market-related news here","cleaned_content":"stock market today losses in shares of select heavyweights including reliance industries bajaj finance and bajaj auto dragged indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e into negative territory on tuesday october \u003cONE_TEN\u003e even as mid and small cap segments of the market ended with gains weak global cues unimpressive q2 earnings and concerns over sticky inflation also weighed on market sentiment however a sharp fall in crude oil prices offered some comfort and capped the losses for the market there were no clear cues from global peers european markets and us futures traded mixed while oil prices crashed after reports that israel will not strike iranian energy targets crude benchmark brent crude crashed over \u003cFIVE_PERCENT\u003e to the level near \u003cSEVEN_TEN\u003e per barrel the domestic market lacks new catalysts to sustain its gains and the lacklustre september quarter earnings raise concerns that the indian markets stretched valuations may be unsustainable the market needs good earnings to sustain its valuations as earnings are a key driver of a companys intrinsic value earnings growth justifies higher prices and keeps valuation metrics like the p e price to earnings ratio in check supporting investor confidence without solid earnings valuations become difficult to justify and stock prices are at risk of a downturn meanwhile the spectre of inflation has come back to haunt investors indias retail inflation rose to a nine month high in september due to higher food prices government data on monday showed annual retail inflation based on the all india consumer price index cpi rose to \u003cFIVE_PERCENT\u003e in september higher than \u003cTHREE_PERCENT\u003e in august this is the highest retail inflation rate since december \u003cTWO_THOUSAND\u003e when it was \u003cFIVE_PERCENT\u003e the sensex slipped \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e closed \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e shares of reliance industries ended as the top drag on the sensex and the nifty \u003cFIVE_TEN\u003e the stock ended \u003cTWO_PERCENT\u003e lower after it reported a fall in its net profit for q2fy25 among the sectoral indices on the nse nifty metal fell \u003cONE_PERCENT\u003e followed by nifty auto which declined \u003cZERO_PERCENT\u003e on the other hand the realty index jumped \u003cTWO_PERCENT\u003e the nifty bank index closed with a mild gain of \u003cZERO_PERCENT\u003e while the psu bank and private bank indices fell \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively while the benchmark indices ended lower the mid and smallcap segments bucked the trend the bse midcap index rose \u003cZERO_PERCENT\u003e while the bse smallcap index witnessed a smart gain of \u003cONE_PERCENT\u003e thanks to gains in the mid and small caps the overall market capitalisation m cap of bse listed firms inched up to nearly \u003cFOUR_HUNDRED\u003e lakh crore from about \u003cFOUR_HUNDRED\u003e lakh crore in the previous session meanwhile as many as \u003cTWO_HUNDRED\u003e stocks including infosys hcl tech tech mahindra persistent systems divis labs and hdfc asset management company hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on the bse according to vinod nair the head of research at geojit financial services the domestic market fell due to a mixed global trend and partial profit booking nair underscored although declining crude prices are beneficial for the domestic economy they signal weakening global demand additionally nair said india s cpi surged due to food prices which will delay expected rate cuts furthermore subdued corporate q2 results are leading to a cautious stance on the technical front shrikant chouhan the head of equity research at kotak securities underscored that on the daily charts the nifty \u003cFIVE_TEN\u003e formed a bearish candle which indicates temporary weakness we are of the view that the short term market texture is non directional and rangebound activity is likely to continue in the near future for the day traders now \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e would be the immediate support zone above this we could see one quick pullback rally until \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e on the flip side below \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e the market could retest the level of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e said chouhan read all market related news here","timestamp":"2024-10-15T16:19:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}