{"url":"https://www.livemint.com/market/stock-market-news/vodafone-idea-shares-plunge-9-hit-52-week-low-amid-reports-of-notice-from-dot-over-bank-guarantee-nonsubmission-11728281722394.html","title":"Vodafone Idea shares plunge 9%, hit 52-week low amid reports of notice from DoT over non-submission of bank guarantee","description":"Vodafone Idea shares fell over 9% to a 52-week low of  ₹8.91 amid reports of the DoT's notice for non-payment of bank guarantees for past spectrum dues. This is the fifth straight day of losses for the telecom player's stock.","content":"Shares of beleaguered telecom player Vodafone Idea tumbled over 9 per cent to their 52-week low of  ₹8.91 on Monday, October 7 amid reports that the Department of Telecommunications (DoT) has issued a notice to the company over the non-payment of bank guarantees required to cover past spectrum auction dues.According to a report by The Economic Times, the latest notice was issued after the company failed to submit bank guarantees on time for past spectrum dues for auctions held before 2022. Mint could not independently verify this report.As per the report, the bank guarantee was due in the second half of September, which the company has not yet submitted.The moratorium, for spectrum auction dues for the Aditya Birla-led group company ends in September 2025 and the bank guarantees need to be submitted at least a year in advance for securing the dues. Vodafone Idea needs to submit bank guarantees worth  ₹24,700 crore to the government in the coming months, the report quoted an official as saying.Vodafone Idea had earlier asked the DoT to be exempted from submitting bank guarantees. While companies no longer need to provide guarantees for airwaves bought in auctions from 2022 onwards, previous rules required them to submit a guarantee equal to the cost of one annual payment.Amid this backdrop, Vodafone Idea share price was trading with deep cuts today. However, it recovered from the day’s low to trade at  ₹9.18 apiece on BSE, down 6.33 per cent around 11.35 am. The stock had hit a 52-week high of  ₹19.15 on June 28, 2024.Today is the fifth consecutive day of losses for Vodafone Idea share price. The stock has tumbled 17% during this period, including today’s losses from the day’s lows.On a year-to-date basis, the stock has lost 44 per cent, significantly eroding investors' wealth.","cleaned_content":"shares of beleaguered telecom player vodafone idea tumbled over \u003cNINE_PERCENT\u003e to their \u003cFIVE_TEN\u003e week low of \u003cEIGHT_\u003e on monday october \u003cSEVEN_\u003e amid reports that the department of telecommunications dot has issued a notice to the company over the non payment of bank guarantees required to cover past spectrum auction dues according to a report by the economic times the latest notice was issued after the company failed to submit bank guarantees on time for past spectrum dues for auctions held before \u003cTWO_THOUSAND\u003e mint could not independently verify this report as per the report the bank guarantee was due in the second half of september which the company has not yet submitted the moratorium for spectrum auction dues for the aditya birla led group company ends in september \u003cTWO_THOUSAND\u003e and the bank guarantees need to be submitted at least a year in advance for securing the dues vodafone idea needs to submit bank guarantees worth \u003cTWO_TEN_THOUSAND\u003e crore to the government in the coming months the report quoted an official as saying vodafone idea had earlier asked the dot to be exempted from submitting bank guarantees while companies no longer need to provide guarantees for airwaves bought in auctions from \u003cTWO_THOUSAND\u003e onwards previous rules required them to submit a guarantee equal to the cost of one annual payment amid this backdrop vodafone idea share price was trading with deep cuts today however it recovered from the day s low to trade at \u003cNINE_\u003e apiece on bse down \u003cSIX_PERCENT\u003e around \u003cONE_TEN\u003e am the stock had hit a \u003cFIVE_TEN\u003e week high of \u003cONE_TEN\u003e on june \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e today is the fifth consecutive day of losses for vodafone idea share price the stock has tumbled \u003cONE_TEN_PERCENT\u003e during this period including today s losses from the day s lows on a year to date basis the stock has lost \u003cFOUR_TEN_PERCENT\u003e significantly eroding investors wealth","timestamp":"2024-10-07T11:56:00+05:30","market_timestamp":"2024-10-07T11:56:00+05:30","off_market_hours":false}