{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-rs-5-jumps-over-5-on-this-business-update-11728983276872.html","title":"Penny stock below  ₹5: Rajesh Wellness share price jumps over 5% on THIS business update","description":"Penny stock Rajnish Wellness saw its stock price jump over 5% after unveiling plans to launch 20 new Dava Discount outlets across India.","content":"Penny stock 2024: Rajnish Wellness shares, priced below  ₹5, surged over 5 per cent on Tuesday, October 15 following the company's announcement to open 20 new Dava Discount outlets.The healthcare and wellness company announced plans to open 20 new Dava Discount outlets across key cities in India, fueling investor interest and boosting the stock price.Rajnish Wellness share price was trading in the green, up 4.12 per cent at  ₹3.03 on October 15, at 2:39 pm on BSE. The stock rose 5.5 per cent in intra-day deals to the day's high of  ₹3.07. The company enjoys a market capitalisation of  ₹232.85 crore.The company expects this expansion to generate an annual revenue of  ₹300 crore to  ₹400 crore. Each new outlet is projected to bring in  ₹15 crore to  ₹20 crore annually, with profit margins estimated between 5 per cent and 9 per cent.Rajnish Wellness has positioned itself as a key player in the affordable healthcare market. The new outlets will cater to the growing demand for cost-effective medicines and healthcare products. These outlets will also feature the company's in-house brand, PlayWin, which focuses on sexual wellness and personal care items.The company's leadership is confident about the potential impact of this expansion. The move is expected to strengthen Rajnish Wellness' revenue base and profitability and enhance its foothold in the rapidly growing healthcare sector.Rajnish Wellness, established in 2015, operates across multiple segments, including sexual wellness and personal care. Its franchise model, combined with a strong e-commerce presence, allows the company to tap into the broader healthcare market, which is expected to reach $41.78 billion ( ₹53.13 lakh crore) by 2029, according to industry forecasts.","cleaned_content":"penny stock \u003cTWO_THOUSAND\u003e rajnish wellness shares priced below \u003cFIVE_\u003e surged over \u003cFIVE_PERCENT\u003e on tuesday october \u003cONE_TEN\u003e following the companys announcement to open \u003cTWO_TEN\u003e new dava discount outlets the healthcare and wellness company announced plans to open \u003cTWO_TEN\u003e new dava discount outlets across key cities in india fueling investor interest and boosting the stock price rajnish wellness share price was trading in the green up \u003cFOUR_PERCENT\u003e at \u003cTHREE_\u003e on october \u003cONE_TEN\u003e at \u003cTWO_\u003e \u003cTHREE_TEN\u003e pm on bse the stock rose \u003cFIVE_PERCENT\u003e in intra day deals to the days high of \u003cTHREE_\u003e the company enjoys a market capitalisation of \u003cTWO_HUNDRED\u003e crore the company expects this expansion to generate an annual revenue of \u003cTHREE_HUNDRED\u003e crore to \u003cFOUR_HUNDRED\u003e crore each new outlet is projected to bring in \u003cONE_TEN\u003e crore to \u003cTWO_TEN\u003e crore annually with profit margins estimated between \u003cFIVE_PERCENT\u003e and \u003cNINE_PERCENT\u003e rajnish wellness has positioned itself as a key player in the affordable healthcare market the new outlets will cater to the growing demand for cost effective medicines and healthcare products these outlets will also feature the companys in house brand playwin which focuses on sexual wellness and personal care items the companys leadership is confident about the potential impact of this expansion the move is expected to strengthen rajnish wellness revenue base and profitability and enhance its foothold in the rapidly growing healthcare sector rajnish wellness established in \u003cTWO_THOUSAND\u003e operates across multiple segments including sexual wellness and personal care its franchise model combined with a strong e commerce presence allows the company to tap into the broader healthcare market which is expected to reach \u003cFOUR_TEN\u003e billion \u003cFIVE_TEN\u003e lakh crore by \u003cTWO_THOUSAND\u003e according to industry forecasts","timestamp":"2024-10-15T14:49:00+05:30","market_timestamp":"2024-10-15T14:49:00+05:30","off_market_hours":false}