{"url":"https://www.livemint.com/market/stock-market-news/defence-stocks-hal-mazagon-docks-among-key-picks-of-analysts-in-falling-market-pfc-rec-bob-hdfc-bank-other-key-picks-11728639035556.html","title":"Defence stocks HAL, Mazagon Dock among key picks of analysts in a falling market; PFC, REC BoB, HDFC Bank other top bets","description":"Stocks to Buy: With the Nifty-50 index correcting from its peaks and the Nifty mid and small-cap indices remaining volatile, analysts are cautious. However, they have recommended defence stocks like HAL and Mazagon Docks, along with PFC, REC, BOB, and HDFC Bank as key picks.","content":"Stocks to Buy: The benchmark Nifty 50 index and Sensex have remained volatile after correcting from record highs. The mid and smallcap stocks are also following the same course. The benchmark Nifty 50 after hitting all-time highs of 26,277.3 is now trading close to 25,000 levels. The Nifty Midcap 100 has corrected from highs of 60,925.95 levels and is now trading close to 59,400 levels. Analysts remain cautious with a view that largecaps will outperform in the near term. However, they believe certain mid and smallcaps with strong fundamentals also have the scope to deliver solid returns.“What we’re experiencing presently in the stock market is a long overdue correction. And it is not unusual to even see 20% corrections within a large bull market\" said Amar Ambani, Executive Director, Yes Securities. As per Ambani even after this deep correction, we still see a lot of midcaps and small caps devoid of any valuation comfort to invest in them.For the next few months, he expects to see downfalls in those stocks where valuations are 30-40x and promoter comfort is not high. Having said that, quality names with high business visibility and reasonable valuations will continue to deliver over the next one-two-year period, added Ambani.Manish Chowdhury, Head of Research, StoxBox said that the recent correction in markets has removed froth from some mid and small companies which had run ahead of their fundamentals. Though the overall mid and smallcap space still looks expensive, our sense is that the recent correction provides selective opportunities.Largecaps may take preference for a few months, says Ambani. A gradual outperformance from the banking financial services and insurance (BFSI) space is expected, as per Ambani. He remains bullish on insurance stocks while Bank of Baroda and HDFC Bank remain his top picks from the banking space.Manish Chowdhury, on the other hand, believes that select public sector undertakings (PUSs) in the defence and power sector which have robust earnings visibility and have sharply corrected on the valuation multiple side provide a favourable risk-reward from a medium to long-term perspective. He particularly likes Hindustan Aeronautics, Mazagon Dock Shipbuilders, Power Finance Corporation and REC from the midcap space and believes a decent move from the current levels cannot be ruled out.We would now closely track the upcoming earnings season for mid and smallcap companies to have a more constructive view on the overall space, said Chowdhury.Nishant Srivastava, CEO, Torus Wealth said that while broader indices have shown resilience, mid and smallcap stocks offer unique investment opportunities. Their valuations, though volatile, can present attractive entry points for long-term investors. However, one should check fundamentals, sector trends, and broader market conditions before investing in mid and small-cap stocks.","cleaned_content":"stocks to buy the benchmark nifty \u003cFIVE_TEN\u003e index and sensex have remained volatile after correcting from record highs the mid and smallcap stocks are also following the same course the benchmark nifty \u003cFIVE_TEN\u003e after hitting all time highs of \u003cTWO_TEN_THOUSAND\u003e is now trading close to \u003cTWO_TEN_THOUSAND\u003e levels the nifty midcap \u003cONE_HUNDRED\u003e has corrected from highs of \u003cSIX_TEN_THOUSAND\u003e levels and is now trading close to \u003cFIVE_TEN_THOUSAND\u003e levels analysts remain cautious with a view that largecaps will outperform in the near term however they believe certain mid and smallcaps with strong fundamentals also have the scope to deliver solid returns what we re experiencing presently in the stock market is a long overdue correction and it is not unusual to even see \u003cTWO_TEN_PERCENT\u003e corrections within a large bull market said amar ambani executive director yes securities as per ambani even after this deep correction we still see a lot of midcaps and small caps devoid of any valuation comfort to invest in them for the next few months he expects to see downfalls in those stocks where valuations are \u003cTHREE_TEN\u003e \u003cFOUR_TEN\u003e x and promoter comfort is not high having said that quality names with high business visibility and reasonable valuations will continue to deliver over the next one two year period added ambani manish chowdhury head of research stoxbox said that the recent correction in markets has removed froth from some mid and small companies which had run ahead of their fundamentals though the overall mid and smallcap space still looks expensive our sense is that the recent correction provides selective opportunities largecaps may take preference for a few months says ambani a gradual outperformance from the banking financial services and insurance bfsi space is expected as per ambani he remains bullish on insurance stocks while bank of baroda and hdfc bank remain his top picks from the banking space manish chowdhury on the other hand believes that select public sector undertakings puss in the defence and power sector which have robust earnings visibility and have sharply corrected on the valuation multiple side provide a favourable risk reward from a medium to long term perspective he particularly likes hindustan aeronautics mazagon dock shipbuilders power finance corporation and rec from the midcap space and believes a decent move from the current levels cannot be ruled out we would now closely track the upcoming earnings season for mid and smallcap companies to have a more constructive view on the overall space said chowdhury nishant srivastava ceo torus wealth said that while broader indices have shown resilience mid and smallcap stocks offer unique investment opportunities their valuations though volatile can present attractive entry points for long term investors however one should check fundamentals sector trends and broader market conditions before investing in mid and small cap stocks","timestamp":"2024-10-15T14:13:00+05:30","market_timestamp":"2024-10-15T14:13:00+05:30","off_market_hours":false}