{"url":"https://www.livemint.com/market/stock-market-news/pranik-logistics-ipo-allotment-expected-today-step-by-step-guide-to-check-your-allotment-status-online-11728978110025.html","title":"Pranik Logistics IPO allotment expected today: Step-by-step guide to check your allotment status online","description":"Pranik Logistics IPO allotment is set for today, following a strong response with oversubscription rates of 744 times for non-institutional investors and 97.21 times for retail investors. Refunds for non-allottees start October 16, 2024, with listing anticipated on October 17, 2024.","content":"The allotment for Pranik Logistics IPO is expected to be finalised today. Investors can check their allotment status through the registrar, Maashitla Securities Private, or on the NSE website. The IPO, which was open for subscription from October 10 to October 14, saw a healthy response from investors, being oversubscribed by 218 times.Specifically, the non-institutional investor (NII) segment was oversubscribed 744 times, while the retail portion was oversubscribed 97.21 times. The QIB portion has also been booked at 35.67 times. The IPO price was set between  ₹73 and  ₹77 per share, as per the exchange data.Given the high level of retail oversubscription, shares will be allocated to retail individual investors (RIIs) on a proportional basis. Those who do not receive an allotment can expect the refund process to start on October 16, 2024.Shares allotted will be credited to investors' demat accounts on the same day as the refunds. The SME IPO is expected to be listed on the NSE SME platform, with a tentative date of October 17, 2024.The company plans to allocate the raised funds towards several key objectives, including investing in technological advancements, fulfilling its capital expenditure requirements, and addressing its working capital needs. Additionally, the funds will be directed towards general corporate purposes and covering issue expenses.Visit the Maashitla Securities Private Limited website - https://maashitla.com/allotment-status/public-issuesSelect \"Pranik Logistics Limited\" from the drop-down list on the \"Check Application Status\" page.Enter your PAN number, demat Account Number, or Application Number.Click on the \"SUBMIT\" button.The allotment status will appear on your screen.Open the IPO allotment page at https://www.nseindia.com/products/dynaContent/equities/ipos/ipo_login.jspLog in with your credentials.Select Pranik Logistics., enter your PAN details and application number, and click “Submit.”The company serves as a carrying and forwarding agent, offering comprehensive logistics solutions that cover the entire supply chain—from origin to consumption—to meet the demands of both customers and corporations.Operating on a national scale, it provides integrated services such as transportation, warehousing, material handling, and freight forwarding to clients in diverse industries, including automotive, engineering, construction, consumer durables, retail, and textiles.Since its inception in 2015, the company has expanded its range of services, providing customized logistics solutions tailored to client needs. As of the latest update, it manages a fleet of over 80 commercial vehicles and supplements additional requirements by leasing vehicles on a per-trip basis.The company’s fleet includes a variety of trucks that differ in design, size, and capacity. Container trucks are used for parcel transportation, while platform trucks are suited for transporting heavy-duty items like automotive parts and machinery.","cleaned_content":"the allotment for pranik logistics ipo is expected to be finalised today investors can check their allotment status through the registrar maashitla securities private or on the nse website the ipo which was open for subscription from october \u003cONE_TEN\u003e to october \u003cONE_TEN\u003e saw a healthy response from investors being oversubscribed by \u003cTWO_HUNDRED\u003e times specifically the non institutional investor nii segment was oversubscribed \u003cSEVEN_HUNDRED\u003e times while the retail portion was oversubscribed \u003cNINE_TEN\u003e times the qib portion has also been booked at \u003cTHREE_TEN\u003e times the ipo price was set between \u003cSEVEN_TEN\u003e and \u003cSEVEN_TEN\u003e per share as per the exchange data given the high level of retail oversubscription shares will be allocated to retail individual investors riis on a proportional basis those who do not receive an allotment can expect the refund process to start on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e shares allotted will be credited to investors demat accounts on the same day as the refunds the sme ipo is expected to be listed on the nse sme platform with a tentative date of october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company plans to allocate the raised funds towards several key objectives including investing in technological advancements fulfilling its capital expenditure requirements and addressing its working capital needs additionally the funds will be directed towards general corporate purposes and covering issue expenses visit the maashitla securities private limited website https maashitla com allotment status public issuesselect pranik logistics limited from the drop down list on the check application status page enter your pan number demat account number or application number click on the submit button the allotment status will appear on your screen open the ipo allotment page at https www nseindia com products dynacontent equities ipos ipo login jsplog in with your credentials select pranik logistics enter your pan details and application number and click submit the company serves as a carrying and forwarding agent offering comprehensive logistics solutions that cover the entire supply chain from origin to consumption to meet the demands of both customers and corporations operating on a national scale it provides integrated services such as transportation warehousing material handling and freight forwarding to clients in diverse industries including automotive engineering construction consumer durables retail and textiles since its inception in \u003cTWO_THOUSAND\u003e the company has expanded its range of services providing customized logistics solutions tailored to client needs as of the latest update it manages a fleet of over \u003cEIGHT_TEN\u003e commercial vehicles and supplements additional requirements by leasing vehicles on a per trip basis the company s fleet includes a variety of trucks that differ in design size and capacity container trucks are used for parcel transportation while platform trucks are suited for transporting heavy duty items like automotive parts and machinery","timestamp":"2024-10-15T13:28:00+05:30","market_timestamp":"2024-10-15T13:28:00+05:30","off_market_hours":false}