{"url":"https://www.livemint.com/market/stock-market-news/jio-financial-services-share-price-rises-3-post-sebis-in-principle-nod-for-mutual-fund-business-with-blackrock-11728272590828.html","title":"Jio Financial Services share price rises 3% post SEBI’s in-principle nod for mutual fund business with BlackRock","description":"Stock Market Today: Jio Financial Services share price gained more than 3% in morning trades on Monday. The company had announced having received SEBI's in-principle nod for mutual fund business with BlackRock","content":"Stock Market Today: Jio Financial Services share price gained more than 3% in morning trades on Monday. The company had announced having received SEBI's in-principle nod for mutual fund business with BlackRockJio Financial Services share price opened at  ₹346.90 on the BSE on Monday almost 2.4% higher than its previous close. The Jio Financial Services share price thereafter gained further to highs of  ₹349.50 marking gains of more than 3%. The Jio Financial Services share price has gained more than 10% from lows in August.Jio Financial Services in its release on 4 October said that Securities and Exchange Board of India (SEBI) has granted in-principle approval to the Company and BlackRock Financial Management Inc to act as co-sponsors and set up the proposed mutual fund.The final approval for registration will be granted by SEBI subject to fulfillment by the Company and BlackRock of the requirements set out in the said letter.Jio Financial Services and BlackRock Advisors Singapore Pte. Ltd. had incorporated a joint venture company named “Jio BlackRock Investment Advisers Private Limited” on September 6, 2024, to carry on the primary business of investment advisory services .However Jio Financial Services joint venture with BlackRock Inc is quite old and developing. Jio Financial Services had announced 50:50 JV with BlackRock Inc. to set up an Asset Management Company on 26th July 2023Jio Financial Services and BlackRock had committed initial investment of $ 150 million each. They had • Filed application with SEBI in Q3FY24 for in-principle approval of sponsors. The Partnership was expanded to wealth management \u0026 broking services on 15th April 2024In other developments Jio Financial Services in May 2024 had launched JIOFINANCE APP. The app had been proposed to be used for loan on Mutual Funds , UPI and Bill Payments, Savings Account, Digital Insurance while more services were to be added.","cleaned_content":"stock market today jio financial services share price gained more than \u003cTHREE_PERCENT\u003e in morning trades on monday the company had announced having received sebis in principle nod for mutual fund business with blackrockjio financial services share price opened at \u003cTHREE_HUNDRED\u003e on the bse on monday almost \u003cTWO_PERCENT\u003e higher than its previous close the jio financial services share price thereafter gained further to highs of \u003cTHREE_HUNDRED\u003e marking gains of more than \u003cTHREE_PERCENT\u003e the jio financial services share price has gained more than \u003cONE_TEN_PERCENT\u003e from lows in august jio financial services in its release on \u003cFOUR_\u003e october said that securities and exchange board of india sebi has granted in principle approval to the company and blackrock financial management inc to act as co sponsors and set up the proposed mutual fund the final approval for registration will be granted by sebi subject to fulfillment by the company and blackrock of the requirements set out in the said letter jio financial services and blackrock advisors singapore pte ltd had incorporated a joint venture company named jio blackrock investment advisers private limited on september \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e to carry on the primary business of investment advisory services however jio financial services joint venture with blackrock inc is quite old and developing jio financial services had announced \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e jv with blackrock inc to set up an asset management company on \u003cTWO_TEN\u003e th july \u003cTWO_THOUSAND\u003e jio financial services and blackrock had committed initial investment of \u003cONE_HUNDRED\u003e million each they had filed application with sebi in q3fy24 for in principle approval of sponsors the partnership was expanded to wealth management broking services on \u003cONE_TEN\u003e th april \u003cTWO_THOUSAND\u003e in other developments jio financial services in may \u003cTWO_THOUSAND\u003e had launched jiofinance app the app had been proposed to be used for loan on mutual funds upi and bill payments savings account digital insurance while more services were to be added","timestamp":"2024-10-07T09:42:00+05:30","market_timestamp":"2024-10-07T09:42:00+05:30","off_market_hours":false}