{"url":"https://www.livemint.com/market/stock-market-news/reliance-power-stock-plunges-5-hits-lower-circuit-for-third-session-straight-heres-why-11728296542831.html","title":"Reliance Power stock plunges 5%, hits lower circuit for third session straight; here’s why","description":"The stock had soared over 60 percent in the past month, driven by strong investor sentiment following the announcement that the Anil Ambani-led company had become debt-free.","content":"Reliance Power shares extended their downward trend on October 7, hitting the 5 percent lower circuit for the third straight session as investors locked in profits. The stock is now trading 11 percent below its 52-week high of  ₹53.64, which it reached just last week.The stock had soared over 60 percent in the past month, driven by strong investor sentiment following the announcement that the Anil Ambani-led company had become debt-free. However, after this impressive rally, investors began booking profits, coinciding with a broader market sell-off.On September 18, market sentiment toward Reliance Power improved following the announcement that the company had been released from its corporate guarantee, commitments, and all obligations related to the outstanding debt of its subsidiary, Vidarbha Industries Power Limited (VIPL), amounting to  ₹3,872.04 crore.The company announced that it has resolved all disputes with CFM Asset Reconstruction Private Limited (CFM). As part of the agreement, 100% of VIPL's shares have been pledged to CFM in exchange for the release and discharge of the corporate guarantee previously provided by Reliance Power.Prior to that, the company won a significant battery storage contract of 500 MW/1000 MWh from the Solar Energy Corporation of India (SECI). This contract establishes Reliance Power as a key player in one of the world's largest standalone battery energy storage projects.Reliance Power shares are currently trading above their 5-day, 50-day, 100-day, and 200-day moving averages (DMA). With a relative strength index (RSI) of 79, the stock is indicating overbought conditions.At 1:22 PM, Reliance Power's shares hit the 5 percent lower circuit, trading at  ₹48.40 on the NSE. Despite this, the stock has surged approximately 102 percent year-to-date, significantly outperforming the Nifty, which has delivered a 15 percent return.Over the past 12 months, the stock has soared 172 percent, more than doubling investors' money, while the Nifty has gained around 28 percent during the same period.","cleaned_content":"reliance power shares extended their downward trend on october \u003cSEVEN_\u003e hitting the \u003cFIVE_PERCENT\u003e lower circuit for the third straight session as investors locked in profits the stock is now trading \u003cONE_TEN_PERCENT\u003e below its \u003cFIVE_TEN\u003e week high of \u003cFIVE_TEN\u003e which it reached just last week the stock had soared over \u003cSIX_TEN_PERCENT\u003e in the past month driven by strong investor sentiment following the announcement that the anil ambani led company had become debt free however after this impressive rally investors began booking profits coinciding with a broader market sell off on september \u003cONE_TEN\u003e market sentiment toward reliance power improved following the announcement that the company had been released from its corporate guarantee commitments and all obligations related to the outstanding debt of its subsidiary vidarbha industries power limited vipl amounting to \u003cTHREE_THOUSAND\u003e crore the company announced that it has resolved all disputes with cfm asset reconstruction private limited cfm as part of the agreement \u003cONE_HUNDRED_PERCENT\u003e of vipls shares have been pledged to cfm in exchange for the release and discharge of the corporate guarantee previously provided by reliance power prior to that the company won a significant battery storage contract of \u003cFIVE_HUNDRED\u003e mw \u003cONE_THOUSAND\u003e mwh from the solar energy corporation of india seci this contract establishes reliance power as a key player in one of the worlds largest standalone battery energy storage projects reliance power shares are currently trading above their \u003cFIVE_\u003e day \u003cFIVE_TEN\u003e day \u003cONE_HUNDRED\u003e day and \u003cTWO_HUNDRED\u003e day moving averages dma with a relative strength index rsi of \u003cSEVEN_TEN\u003e the stock is indicating overbought conditions at \u003cONE_\u003e \u003cTWO_TEN\u003e pm reliance powers shares hit the \u003cFIVE_PERCENT\u003e lower circuit trading at \u003cFOUR_TEN\u003e on the nse despite this the stock has surged approximately \u003cONE_HUNDRED_PERCENT\u003e year to date significantly outperforming the nifty which has delivered a \u003cONE_TEN_PERCENT\u003e return over the past \u003cONE_TEN\u003e months the stock has soared \u003cONE_HUNDRED_PERCENT\u003e more than doubling investors money while the nifty has gained around \u003cTWO_TEN_PERCENT\u003e during the same period","timestamp":"2024-10-07T16:14:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}