{"url":"https://www.livemint.com/market/stock-market-news/stock-market-crash-israel-hamas-war-continues-to-drag-nifty50-sensex-for-fifth-day-in-a-row-11728015407296.html","title":"Market Close: Sensex, Nifty slide for 5th straight session, crash 1% amid Israel-Iran war worries","description":"Indian stock markets experienced significant volatility today. The indices started lower, then posted a sharp recovery only to close in the red. Geopolitical tensions and rising crude oil prices contributed to a decline of over 4.5% from recent highs.","content":"Indian stock market: After an exceptionally volatile session, Indian benchmark indices ended Friday, October 4, almost a per cent lower, extending losses for the fifth straight session. This comes after an over 2 per cent decline seen in the previous session.The Sensex ended 808.65 points or 0.98 per cent lower at 81,688.45 while the broader Nifty fell 200.25 points or 0.8 percent to 25,049.85Overall the indices have ended the truncated September 30-October 4 week over 4 per cent lower after three straight weeks of positive returns. Additionally, from their record highs scaled on September 27, the benchmarks have dropped over 5 per cent.The recent market downturn has been driven by escalating tensions in the Middle East, where the conflict between Iran and Israel has intensified.Several other factors apart from geopolitical concerns have contributed to the market crash, such as rising crude oil prices, regulatory changes in the F\u0026O segment by SEBI, and outflows from foreign institutional investors (FIIs).\"The bearish sentiment continued as investors are monitoring the escalating conflict in the Middle East and have adopted a ‘sell-on recovery’ strategy. Crude prices have moved up sharply but may be restricted due to an increase in production from OPEC+. The drag was across sectors led by realty, auto, and FMCG except IT stocks, which gained due to expected benefits from US rate cuts and their defensive nature. The pessimism in the market is expected to continue in the near term amidst rising crude prices and fund flows to cheaper markets like China,\" said Vinod Nair, Head of Research, Geojit Financial Services.The benchmark equity indices, the Sensex and the Nifty, started on a negative note, falling half a per cent in morning deals. However, the indices soon recovered almost 1.5 per cent from their day's low as they witnessed lower-level buying.The Sensex then surged 1,295 points from the intra-day low to reach a high of 83,347 while the broader Nifty rallied 378 points from its low to hit the day's high of 25,472.65.But during the last leg of the trade, the Indian indices again slipped into the red. The Sensex shed 1,835.64 points from the day's high to 81,532.68 while the Nifty tanked 518.25 points to its day's low of 24,966.8.The situation worsened after Iran launched around 180 ballistic missiles at Israel, causing Brent crude prices to spike from $71 to $75 per barrel.Fears are mounting that Israel could retaliate by targeting Iran's major oil fields, which would likely push oil prices even higher. This presents a significant concern for India, which imports 80 per cent of its oil. Any substantial increase in oil prices would raise India's import costs, adding more pressure to the country's economy.Broader markets mirrored the performance of the benchmarks, with the midcap and smallcap indices witnessing a volatile trade. The Nifty Midcap and Nifty Smallcap indices ended almost a per cent lower in today's session.Meanwhile, most sectoral indices also witnessed sharp falls.Nifty Media lost the most, down 2.53 per cent followed by Nifty Realty, down 1.7 per cent. Moreover, Nifty Auto, Nifty FMCG, and Nifty Oil and Gas were also down over 1 per cent each. Meanwhile, Nifty Bank, Nifty Private Bank and Nifty Financial Services shed 0.5 per cent, 0.53 per cent and 0.9 per cent, respectively. Nifty Metal and Nifty Pharma were also in the red. However, Nifty IT and Nifty PSU Bank were the only two indices in the green, up 0.45 per cent and 0.61 per cent, respectively.On the stock-specific front, Infosys, Tata Motors, Tech Mahindra, Axis Bank, and TCS were the top gainers in the Sensex pack. Conversely, M\u0026M, Bajaj Finance, Asian Paints, Nestle, and Bharti Airtel were the top losers.Siddhartha Khemka, Head of Research at Wealth Management, Motilal Oswal Financial Services, noted that domestic equities continued their downward trend, with Nifty breaching the 25,000 mark during intra-day trading.Khemka highlighted that the rise in the volatility index, selling by foreign institutional investors, and weak global cues contributed to the market's profit booking. Nifty has now shed 1,310 points (-5.2%) after hitting a fresh high of 26,277 last week.Looking ahead, Khemka expects the markets to consolidate next week amid caution stemming from concerns over escalating tensions in “West Asia. With the upcoming earnings season and the RBI policy meeting, stock-specific action is likely to continue. While a rate cut is not anticipated, the commentary from the RBI will hold significant importance, particularly for interest-sensitive stocks,” he said.Vaishali Parekh, Vice President of Technical Research at Prabhudas Lilladher, noted that the Nifty 50 index fell below the 25,300 mark, impacted by escalating geopolitical tensions in the Middle East. Sentiment has been hit hard, and she advised maintaining a cautious approach. In the near term, the index has support around the 50-EMA zone of 25,000, while the critical major support is at the 200-period moving average near the 23,100 level.For Bank Nifty, Parekh observed that the index dipped below the key 50-EMA zone of 51,900, indicating a weakening bias. The near-term support is at 51,000, with crucial support at 49,600. A drop below this could worsen the situation. The daily range for Bank Nifty is expected to be between 51,300 and 52,400 levels.","cleaned_content":"indian stock market after an exceptionally volatile session indian benchmark indices ended friday october \u003cFOUR_\u003e almost a per cent lower extending losses for the fifth straight session this comes after an over \u003cTWO_PERCENT\u003e decline seen in the previous session the sensex ended \u003cEIGHT_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e while the broader nifty fell \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e overall the indices have ended the truncated september \u003cTHREE_TEN\u003e october \u003cFOUR_\u003e week over \u003cFOUR_PERCENT\u003e lower after three straight weeks of positive returns additionally from their record highs scaled on september \u003cTWO_TEN\u003e the benchmarks have dropped over \u003cFIVE_PERCENT\u003e the recent market downturn has been driven by escalating tensions in the middle east where the conflict between iran and israel has intensified several other factors apart from geopolitical concerns have contributed to the market crash such as rising crude oil prices regulatory changes in the f o segment by sebi and outflows from foreign institutional investors fiis the bearish sentiment continued as investors are monitoring the escalating conflict in the middle east and have adopted a sell on recovery strategy crude prices have moved up sharply but may be restricted due to an increase in production from opec the drag was across sectors led by realty auto and fmcg except it stocks which gained due to expected benefits from us rate cuts and their defensive nature the pessimism in the market is expected to continue in the near term amidst rising crude prices and fund flows to cheaper markets like china said vinod nair head of research geojit financial services the benchmark equity indices the sensex and the nifty started on a negative note falling half a per cent in morning deals however the indices soon recovered almost \u003cONE_PERCENT\u003e from their days low as they witnessed lower level buying the sensex then surged \u003cONE_THOUSAND\u003e points from the intra day low to reach a high of \u003cEIGHT_TEN_THOUSAND\u003e while the broader nifty rallied \u003cTHREE_HUNDRED\u003e points from its low to hit the days high of \u003cTWO_TEN_THOUSAND\u003e but during the last leg of the trade the indian indices again slipped into the red the sensex shed \u003cONE_THOUSAND\u003e points from the days high to \u003cEIGHT_TEN_THOUSAND\u003e while the nifty tanked \u003cFIVE_HUNDRED\u003e points to its days low of \u003cTWO_TEN_THOUSAND\u003e the situation worsened after iran launched around \u003cONE_HUNDRED\u003e ballistic missiles at israel causing brent crude prices to spike from \u003cSEVEN_TEN\u003e to \u003cSEVEN_TEN\u003e per barrel fears are mounting that israel could retaliate by targeting irans major oil fields which would likely push oil prices even higher this presents a significant concern for india which imports \u003cEIGHT_TEN_PERCENT\u003e of its oil any substantial increase in oil prices would raise indias import costs adding more pressure to the countrys economy broader markets mirrored the performance of the benchmarks with the midcap and smallcap indices witnessing a volatile trade the nifty midcap and nifty smallcap indices ended almost a per cent lower in todays session meanwhile most sectoral indices also witnessed sharp falls nifty media lost the most down \u003cTWO_PERCENT\u003e followed by nifty realty down \u003cONE_PERCENT\u003e moreover nifty auto nifty fmcg and nifty oil and gas were also down over \u003cONE_PERCENT\u003e each meanwhile nifty bank nifty private bank and nifty financial services shed \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively nifty metal and nifty pharma were also in the red however nifty it and nifty psu bank were the only two indices in the green up \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively on the stock specific front infosys tata motors tech mahindra axis bank and tcs were the top gainers in the sensex pack conversely m m bajaj finance asian paints nestle and bharti airtel were the top losers siddhartha khemka head of research at wealth management motilal oswal financial services noted that domestic equities continued their downward trend with nifty breaching the \u003cTWO_TEN_THOUSAND\u003e mark during intra day trading khemka highlighted that the rise in the volatility index selling by foreign institutional investors and weak global cues contributed to the markets profit booking nifty has now shed \u003cONE_THOUSAND\u003e points \u003cFIVE_PERCENT\u003e after hitting a fresh high of \u003cTWO_TEN_THOUSAND\u003e last week looking ahead khemka expects the markets to consolidate next week amid caution stemming from concerns over escalating tensions in west asia with the upcoming earnings season and the rbi policy meeting stock specific action is likely to continue while a rate cut is not anticipated the commentary from the rbi will hold significant importance particularly for interest sensitive stocks he said vaishali parekh vice president of technical research at prabhudas lilladher noted that the nifty \u003cFIVE_TEN\u003e index fell below the \u003cTWO_TEN_THOUSAND\u003e mark impacted by escalating geopolitical tensions in the middle east sentiment has been hit hard and she advised maintaining a cautious approach in the near term the index has support around the \u003cFIVE_TEN\u003e ema zone of \u003cTWO_TEN_THOUSAND\u003e while the critical major support is at the \u003cTWO_HUNDRED\u003e period moving average near the \u003cTWO_TEN_THOUSAND\u003e level for bank nifty parekh observed that the index dipped below the key \u003cFIVE_TEN\u003e ema zone of \u003cFIVE_TEN_THOUSAND\u003e indicating a weakening bias the near term support is at \u003cFIVE_TEN_THOUSAND\u003e with crucial support at \u003cFOUR_TEN_THOUSAND\u003e a drop below this could worsen the situation the daily range for bank nifty is expected to be between \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e levels","timestamp":"2024-10-04T15:41:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}