{"url":"https://www.livemint.com/market/stock-market-news/paramount-dye-tec-lists-at-rs-109-on-nse-sme-6-discount-to-ipo-price-11728364337460.html","title":"Paramount Dye Tec lists at  ₹109 on NSE SME, 6% discount to IPO price","description":"Paramount Dye Tec had a disappointing debut in the stock market today, October 8, as its shares opened on the NSE SME at  ₹109.90 each, reflecting a 6% discount to the issue price of  ₹117 per share.","content":"Paramount Dye Tec had a disappointing debut in the stock market today, October 8, as its shares opened on the NSE SME at  ₹109.90 each, reflecting a 6% discount to the issue price of  ₹117 per share.The SME initial public offer (IPO), valued at  ₹28.43 crore, was open for subscription from September 30 to October 3, 2024, priced in the range between  ₹111 and 117 apiece. The IPO is entirely a fresh issue of 24.3 lakh shares.The IPO received a robust response, with an overall subscription of 50.90 times. Notably, the non-institutional investor (NII) segment was oversubscribed by 135 times, while the retail portion saw an oversubscription of 36 times. The QIB portion booked at 10.22 times.The company will use the proceeds from the net fresh issue for several key purposes, including establishing a new manufacturing unit, repaying certain debt facilities, covering expenses for land registration purchased from the promoter, and supporting general corporate needs.The company specialises in the manufacturing of yarns by recycling waste synthetic fiber (recycling synthetic waste), serving the B2B segment of the textile industry. It offers a range of products, including synthetic fiber and yarns, which include acrylic yarn, polyester yarn, nylon yarn, wool yarn, hand-knitting yarn, and acrylic blend yarn with quality, finer impact, and lasting excellence.It operates from its manufacturing facility located in Village Mangarh and Village Koom Khurd, Punjab. This facility is equipped with advanced processing capabilities and staffed with industry experts.The company, in its DRHP report, said that it has established itself as a key player in the winter apparel market by producing quality yarns specifically designed for products such as caps, gloves, mufflers, and thermal innerwear.This specialization has enabled the company to build a strong reputation for reliability and excellence. However, to diversify its product range and reduce the seasonal dependency of its business, the company has undertaken a comprehensive upgrade of its machinery and production processes.","cleaned_content":"paramount dye tec had a disappointing debut in the stock market today october \u003cEIGHT_\u003e as its shares opened on the nse sme at \u003cONE_HUNDRED\u003e each reflecting a \u003cSIX_PERCENT\u003e discount to the issue price of \u003cONE_HUNDRED\u003e per share the sme initial public offer ipo valued at \u003cTWO_TEN\u003e crore was open for subscription from september \u003cTHREE_TEN\u003e to october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e priced in the range between \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e apiece the ipo is entirely a fresh issue of \u003cTWO_TEN\u003e lakh shares the ipo received a robust response with an overall subscription of \u003cFIVE_TEN\u003e times notably the non institutional investor nii segment was oversubscribed by \u003cONE_HUNDRED\u003e times while the retail portion saw an oversubscription of \u003cTHREE_TEN\u003e times the qib portion booked at \u003cONE_TEN\u003e times the company will use the proceeds from the net fresh issue for several key purposes including establishing a new manufacturing unit repaying certain debt facilities covering expenses for land registration purchased from the promoter and supporting general corporate needs the company specialises in the manufacturing of yarns by recycling waste synthetic fiber recycling synthetic waste serving the b2b segment of the textile industry it offers a range of products including synthetic fiber and yarns which include acrylic yarn polyester yarn nylon yarn wool yarn hand knitting yarn and acrylic blend yarn with quality finer impact and lasting excellence it operates from its manufacturing facility located in village mangarh and village koom khurd punjab this facility is equipped with advanced processing capabilities and staffed with industry experts the company in its drhp report said that it has established itself as a key player in the winter apparel market by producing quality yarns specifically designed for products such as caps gloves mufflers and thermal innerwear this specialization has enabled the company to build a strong reputation for reliability and excellence however to diversify its product range and reduce the seasonal dependency of its business the company has undertaken a comprehensive upgrade of its machinery and production processes","timestamp":"2024-10-08T10:53:00+05:30","market_timestamp":"2024-10-08T10:53:00+05:30","off_market_hours":false}