{"url":"https://www.livemint.com/market/stock-market-news/value-stocks-says-majority-of-psu-stocks-fairly-or-undervalued-shares-top-investment-themes-for-long-term-11729066495268.html","title":"Value Stocks says majority of PSU stocks fairly or undervalued, shares top investment themes for long term","description":"A recent study by Value Stocks indicates that while some Public Sector Undertakings (PSUs) are overvalued, many remain undervalued. Key sectors like defence, railways, and shipbuilding show significant growth potential after price corrections, making them attractive for long-term investment.","content":"According to a recent research note by Value Stocks, a smallcase manager, only a select few sub-groups of Public Sector Undertakings (PSUs) are currently overvalued, while the majority remain fairly or undervalued. This study examined 91 PSU stocks listed on the NSE, categorising them into 26 subgroups. The findings revealed that five sub-groups of PSUs are overvalued, five are fairly valued, and 16 are undervalued, highlighting significant investment opportunities in PSU stocks.The report also noted that stocks in the defence, railways, and shipbuilding sectors have corrected from their recent highs, making them attractive to investors.The research highlighted that sectors such as defence, railways, and shipbuilding have shown strong sales and profit growth, yet their stock prices have experienced significant corrections. Value Stocks identified these sectors as prime candidates for investment, given their robust financial performance and favourable pricing.Stocks like Bharat Electronics, with an order book exceeding  ₹76,000 crore, and Hindustan Aeronautics, with an order book of over  ₹94,000 crore, offer substantial growth potential, according to the smallcase manager. The study suggested that these corrections have created an attractive entry point for investors seeking long-term gains in the PSU space.One notable exception to this trend has been NTPC, whose stock price has remained relatively stable, owing to the anticipated initial public offering (IPO) of its green energy arm. NTPC’s focus on renewable energy aligns with the Indian government’s goal to achieve 500 GW of installed renewable energy capacity by 2030. This strategic positioning has helped the company avoid the price corrections seen in other PSU sectors, making it a standout in the current market environment.In the banking sector, Value Stocks noted that public sector banks (PSBs) are now better positioned in terms of valuations compared to private banks. Concerns about governance, technology, and credit costs in PSBs have largely diminished, making them comparable to their private counterparts. The report emphasised the valuation gap between the two, with the Nifty PSU Bank Index trading at a price-to-earnings (PE) ratio of 8.5, compared to the Nifty Private Bank Index's PE ratio of 15.5. This disparity presents an opportunity for investors to consider PSU banks as a value proposition.Shailesh Saraf, Founder of Value Stocks and smallcase manager, expressed confidence in the PSU sector, particularly in PSU banks. He highlighted the government’s support for infrastructure projects, energy transition, and reforms in the banking sector as key factors driving the growth potential. According to Saraf, “We remain strong believers in PSU banks, which are much better positioned than their private peers in terms of valuation. These stocks have corrected and should be viewed as excellent investment opportunities.”With most PSUs either fairly or undervalued, sectors like defence, railways, and shipbuilding present compelling investment cases due to recent corrections and strong growth prospects. Additionally, PSBs offer value in terms of valuation compared to private banks. Backed by government initiatives and robust order books, PSUs appear poised for long-term growth, making them attractive investment opportunities for those looking to diversify their portfolios.","cleaned_content":"according to a recent research note by value stocks a smallcase manager only a select few sub groups of public sector undertakings psus are currently overvalued while the majority remain fairly or undervalued this study examined \u003cNINE_TEN\u003e psu stocks listed on the nse categorising them into \u003cTWO_TEN\u003e subgroups the findings revealed that five sub groups of psus are overvalued five are fairly valued and \u003cONE_TEN\u003e are undervalued highlighting significant investment opportunities in psu stocks the report also noted that stocks in the defence railways and shipbuilding sectors have corrected from their recent highs making them attractive to investors the research highlighted that sectors such as defence railways and shipbuilding have shown strong sales and profit growth yet their stock prices have experienced significant corrections value stocks identified these sectors as prime candidates for investment given their robust financial performance and favourable pricing stocks like bharat electronics with an order book exceeding \u003cSEVEN_TEN_THOUSAND\u003e crore and hindustan aeronautics with an order book of over \u003cNINE_TEN_THOUSAND\u003e crore offer substantial growth potential according to the smallcase manager the study suggested that these corrections have created an attractive entry point for investors seeking long term gains in the psu space one notable exception to this trend has been ntpc whose stock price has remained relatively stable owing to the anticipated initial public offering ipo of its green energy arm ntpc s focus on renewable energy aligns with the indian government s goal to achieve \u003cFIVE_HUNDRED\u003e gw of installed renewable energy capacity by \u003cTWO_THOUSAND\u003e this strategic positioning has helped the company avoid the price corrections seen in other psu sectors making it a standout in the current market environment in the banking sector value stocks noted that public sector banks psbs are now better positioned in terms of valuations compared to private banks concerns about governance technology and credit costs in psbs have largely diminished making them comparable to their private counterparts the report emphasised the valuation gap between the two with the nifty psu bank index trading at a price to earnings pe ratio of \u003cEIGHT_\u003e compared to the nifty private bank indexs pe ratio of \u003cONE_TEN\u003e this disparity presents an opportunity for investors to consider psu banks as a value proposition shailesh saraf founder of value stocks and smallcase manager expressed confidence in the psu sector particularly in psu banks he highlighted the government s support for infrastructure projects energy transition and reforms in the banking sector as key factors driving the growth potential according to saraf we remain strong believers in psu banks which are much better positioned than their private peers in terms of valuation these stocks have corrected and should be viewed as excellent investment opportunities with most psus either fairly or undervalued sectors like defence railways and shipbuilding present compelling investment cases due to recent corrections and strong growth prospects additionally psbs offer value in terms of valuation compared to private banks backed by government initiatives and robust order books psus appear poised for long term growth making them attractive investment opportunities for those looking to diversify their portfolios","timestamp":"2024-10-16T14:19:00+05:30","market_timestamp":"2024-10-16T14:19:00+05:30","off_market_hours":false}