{"url":"https://www.livemint.com/market/stock-market-news/mazagon-dock-board-approves-1-2-stock-split-declares-23-19-dividend-check-record-date-other-details-11729592275271.html","title":"Mazagon Dock board approves 1:2 stock split, declares  ₹23.19 dividend. Check record date \u0026 other details","description":"Mazagon Dock approved a stock split of 1:2 and an interim dividend of  ₹23.19 per share. The record date for the dividend is set for October 30. The stock, however, fell 9.87% to  ₹4,206 amid market pressures.","content":"Mazagon Dock Shipbuilders, a leading shipbuilding yard in India, on Tuesday, October 22 announced that its board of directors approved a stock split of the company’s equity share along with an interim dividend.The board approved the splitting of shares in the ratio of 1:2, suggesting that investors who hold one share will get an additional share but at no additional cost.“Existing 1 (One) Equity Share of face value of Rs. 10/- each fully paid up shall be sub-divided/ split into 2 Equity Shares of face value of Rs. 5/- each fully paid up,” the company said in an exchange filing.The company said it is undertaking the stock split to comply with DIPAM guidelines on capital restructuring, encourage wider participation of small investors, and enhance the liquidity of the shares.It did not declare the record date for the stock split yet. It said the record date for the purpose of sub-division/ split of equity shares shall be decided after obtaining approval for sub-division/ split from the shareholders.This is the first time that the Mazagon Dock has announced a stock split.Apart from the stock split, the board also declared an interim dividend of  ₹23.19 per equity share of  ₹10 each fully paid up for the financial year 2024-25. The company has fixed Wednesday, October 30 as the record date for the payment of the interim dividend.The payment of the said dividend will be completed on or before November 20, the company said in an exchange filing.The company had declared a final dividend of  ₹12.11 per share earlier this year.These corporate announcements failed to lift investor sentiment around the stock. The stock after trading with deep cuts throughout the day ended at  ₹4,206 on NSE, down 9.87 per cent.The stock after delivering multibagger returns to investors over the past one year to the tune of 113 per cent has recently come under pressure amid a selloff in defence stocks. The stock has lost 28 per cent from its 52-week high touched in July this year.","cleaned_content":"mazagon dock shipbuilders a leading shipbuilding yard in india on tuesday october \u003cTWO_TEN\u003e announced that its board of directors approved a stock split of the company s equity share along with an interim dividend the board approved the splitting of shares in the ratio of \u003cONE_\u003e \u003cTWO_\u003e suggesting that investors who hold one share will get an additional share but at no additional cost existing \u003cONE_\u003e one equity share of face value of rs \u003cONE_TEN\u003e each fully paid up shall be sub divided split into \u003cTWO_\u003e equity shares of face value of rs \u003cFIVE_\u003e each fully paid up the company said in an exchange filing the company said it is undertaking the stock split to comply with dipam guidelines on capital restructuring encourage wider participation of small investors and enhance the liquidity of the shares it did not declare the record date for the stock split yet it said the record date for the purpose of sub division split of equity shares shall be decided after obtaining approval for sub division split from the shareholders this is the first time that the mazagon dock has announced a stock split apart from the stock split the board also declared an interim dividend of \u003cTWO_TEN\u003e per equity share of \u003cONE_TEN\u003e each fully paid up for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the company has fixed wednesday october \u003cTHREE_TEN\u003e as the record date for the payment of the interim dividend the payment of the said dividend will be completed on or before november \u003cTWO_TEN\u003e the company said in an exchange filing the company had declared a final dividend of \u003cONE_TEN\u003e per share earlier this year these corporate announcements failed to lift investor sentiment around the stock the stock after trading with deep cuts throughout the day ended at \u003cFOUR_THOUSAND\u003e on nse down \u003cNINE_PERCENT\u003e the stock after delivering multibagger returns to investors over the past one year to the tune of \u003cONE_HUNDRED_PERCENT\u003e has recently come under pressure amid a selloff in defence stocks the stock has lost \u003cTWO_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week high touched in july this year","timestamp":"2024-10-22T15:51:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}