{"url":"https://www.livemint.com/market/stock-market-news/why-is-indian-stock-market-falling-for-four-straight-sessions-explained-with-five-crucial-reasons-11729223766135.html","title":"Why is Indian stock market falling for four straight sessions? — explained with five crucial reasons","description":"Stock market today: According to experts, the Indian market is falling due to these five reasons — US presidential elections, geopolitical tension, Maharashtra state elections, below-par Q2 results 2024 season, and weakness in Indian National Rupee","content":"Stock market today: Extending the selling spree for yet another session, the Indian stock market opened lower on Friday morning deals. The Nifty 50 index opened with a downside gap at 24,664 and touched an intraday low of 24,567 within a few minutes of the Opening Bell. While touching this intraday low, the 50-stock index lost around 560 points in four successive sessions.Likewise, the BSE Sensex today opened lower at 80,749 and touched an intraday low of 80,409, recording around 1,564 points in four days. The Nifty Bank index opened lower at 51,261 and touched an intraday low of 51,000. However, banking stocks attracted buying at lower levels and regained the green territory after hitting the intraday low.According to stock market experts, the Indian stock market is reeling under selling pressure due to the uncertainty in the global and domestic markets. They said that international investors are in limbo due to the fast approaching US Presidential Elections and rising tension in the Middle East. DIIs are waiting for the Maharashtra State Assembly polls in the domestic market. Apart from this, they said that the Q2 results of the 2024 season have remained below market estimates while the falling Indian National Rupee (INR) has fueled buzz for the pressure on the fiscal deficit of the Indian economy.“The FIIs are selling heavily as there is a buzz about a close fight in the fast-approaching US Presidential polls. As DIIs are not buying in current markets, the market is unable to find support at the lower levels,” said Mahesh M Ojha, AVP — Research at Hensex Securities.“Due to the geopolitical tension in the Middle East, the market is unsure about the upcoming sessions. This status of uncertainty is also a reason for sharp selling in the Indian stock market,” said Anshul Jain, Head of Research at Lakshmishree Investment and Securities.Pointing towards the Q2 results of the 2024 season, Siddhartha Khemka, Head - of Research and Wealth Management at Motilal Oswal, said, \"The disappointing Q2 earnings from major companies have also fueled selling pressure on Dalal Street.Mahesh M Ojha of Hensex Securities said, \"The DIIs are waiting for the Maharashtra Assembly poll results on why DIIs are not buying in the current Indian stock market. After the Haryana Assembly election, this upcoming assembly election holds the key as it would signal the central government's strength in India's financial capital.\"“The Indian rupee fall in the recent sessions is also a major reason for weakness on Dalal Street as it has filed buzz about the upcoming pressure on the Indian fiscal deficit,” said Ojha.Asked about the important levels regarding the Nifty 50 index, Anshul Jain said, “The Nifty 50 index has broken its crucial support of 24,700, and the 50-stock index would find immediate support at 24,500 whereas crucial support for the frontline index is now placed at 24,350 to 24,300 mark.”","cleaned_content":"stock market today extending the selling spree for yet another session the indian stock market opened lower on friday morning deals the nifty \u003cFIVE_TEN\u003e index opened with a downside gap at \u003cTWO_TEN_THOUSAND\u003e and touched an intraday low of \u003cTWO_TEN_THOUSAND\u003e within a few minutes of the opening bell while touching this intraday low the \u003cFIVE_TEN\u003e stock index lost around \u003cFIVE_HUNDRED\u003e points in four successive sessions likewise the bse sensex today opened lower at \u003cEIGHT_TEN_THOUSAND\u003e and touched an intraday low of \u003cEIGHT_TEN_THOUSAND\u003e recording around \u003cONE_THOUSAND\u003e points in four days the nifty bank index opened lower at \u003cFIVE_TEN_THOUSAND\u003e and touched an intraday low of \u003cFIVE_TEN_THOUSAND\u003e however banking stocks attracted buying at lower levels and regained the green territory after hitting the intraday low according to stock market experts the indian stock market is reeling under selling pressure due to the uncertainty in the global and domestic markets they said that international investors are in limbo due to the fast approaching us presidential elections and rising tension in the middle east diis are waiting for the maharashtra state assembly polls in the domestic market apart from this they said that the q2 results of the \u003cTWO_THOUSAND\u003e season have remained below market estimates while the falling indian national rupee inr has fueled buzz for the pressure on the fiscal deficit of the indian economy the fiis are selling heavily as there is a buzz about a close fight in the fast approaching us presidential polls as diis are not buying in current markets the market is unable to find support at the lower levels said mahesh m ojha avp research at hensex securities due to the geopolitical tension in the middle east the market is unsure about the upcoming sessions this status of uncertainty is also a reason for sharp selling in the indian stock market said anshul jain head of research at lakshmishree investment and securities pointing towards the q2 results of the \u003cTWO_THOUSAND\u003e season siddhartha khemka head of research and wealth management at motilal oswal said the disappointing q2 earnings from major companies have also fueled selling pressure on dalal street mahesh m ojha of hensex securities said the diis are waiting for the maharashtra assembly poll results on why diis are not buying in the current indian stock market after the haryana assembly election this upcoming assembly election holds the key as it would signal the central governments strength in indias financial capital the indian rupee fall in the recent sessions is also a major reason for weakness on dalal street as it has filed buzz about the upcoming pressure on the indian fiscal deficit said ojha asked about the important levels regarding the nifty \u003cFIVE_TEN\u003e index anshul jain said the nifty \u003cFIVE_TEN\u003e index has broken its crucial support of \u003cTWO_TEN_THOUSAND\u003e and the \u003cFIVE_TEN\u003e stock index would find immediate support at \u003cTWO_TEN_THOUSAND\u003e whereas crucial support for the frontline index is now placed at \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e mark","timestamp":"2024-10-18T10:30:00+05:30","market_timestamp":"2024-10-18T10:30:00+05:30","off_market_hours":false}