{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-16-11729011392232.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 16","description":"Buy or sell stocks: Vaishali Parekh recommends three stocks to buy today — Mazagon Dock Shipbuilders, Indian Hotels, and Firstsource Solutions.","content":"Buy or sell stocks: Indian benchmarks - Sensex and Nifty - ended Tuesday's session in a negative territory. The Sensex dropped by 153 points, or 0.19%, to close at 81,820.12, while the Nifty 50 fell by 71 points, or 0.28%, ending at 25,057.35.Shares of Reliance Industries were the biggest laggard on Nifty 50,  closing down 2.06 per cent following a reported decline in net profit for Q2 FY25.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that Nifty faced resistance around the 25,200 level once more. After a bit of profit booking, it settled near the significant 50 EMA level of 25,050, exhibiting consolidation over the past five sessions. Parekh estimates that the index must decisively break above the 25,300 level to build confidence and anticipate further gains. BankNifty would have a daily range of 51600-52400 levels.For today, Parekh recommended three buy-or-sell stocks: Mazagon Dock Shipbuilders, Indian Hotels and Firstsource Solutions.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty once again found resistance near the 25,200 zone and with slight profit booking hovered near the important 50EMA zone of 25,050 levels with consolidation witnessed since the last five sessions. As mentioned earlier, the index needs to breach above the 25300 zone decisively to establish conviction and expect for further rise.”“BankNifty faced resistance near the 52,000 zone, and with some profit booking, hovered near the 51,900 levels. ICICI Bank looked promising with a positive trend reversal indication on the daily chart. The index sustaining above the important support of 51,000 levels would need to move past the 5,2500-52,600 band to establish conviction for further rise. The support for the day is seen at 24,900 levels, while the resistance would be seen at 25,200 levels. BankNifty would have a daily range of 51,600-52,400 levels,” she added.1. Mazagon Dock Shipbuilders: Buy at  ₹4,410; Target at  ₹4,600; Stop Loss at  ₹4,300.2. Indian Hotels: Buy at  ₹713; Target at  ₹728; Stop Loss at  ₹700.3. Firstsource Solutions: Buy at  ₹333; Target at  ₹360; Stop Loss at  ₹326.","cleaned_content":"buy or sell stocks indian benchmarks sensex and nifty ended tuesdays session in a negative territory the sensex dropped by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e fell by \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e ending at \u003cTWO_TEN_THOUSAND\u003e shares of reliance industries were the biggest laggard on nifty \u003cFIVE_TEN\u003e closing down \u003cTWO_PERCENT\u003e following a reported decline in net profit for q2 fy25 vaishali parekh vice president of technical research at prabhudas lilladher said that nifty faced resistance around the \u003cTWO_TEN_THOUSAND\u003e level once more after a bit of profit booking it settled near the significant \u003cFIVE_TEN\u003e ema level of \u003cTWO_TEN_THOUSAND\u003e exhibiting consolidation over the past five sessions parekh estimates that the index must decisively break above the \u003cTWO_TEN_THOUSAND\u003e level to build confidence and anticipate further gains banknifty would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels for today parekh recommended three buy or sell stocks mazagon dock shipbuilders indian hotels and firstsource solutions on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty once again found resistance near the \u003cTWO_TEN_THOUSAND\u003e zone and with slight profit booking hovered near the important \u003cFIVE_TEN\u003e ema zone of \u003cTWO_TEN_THOUSAND\u003e levels with consolidation witnessed since the last five sessions as mentioned earlier the index needs to breach above the \u003cTWO_TEN_THOUSAND\u003e zone decisively to establish conviction and expect for further rise banknifty faced resistance near the \u003cFIVE_TEN_THOUSAND\u003e zone and with some profit booking hovered near the \u003cFIVE_TEN_THOUSAND\u003e levels icici bank looked promising with a positive trend reversal indication on the daily chart the index sustaining above the important support of \u003cFIVE_TEN_THOUSAND\u003e levels would need to move past the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e band to establish conviction for further rise the support for the day is seen at \u003cTWO_TEN_THOUSAND\u003e levels while the resistance would be seen at \u003cTWO_TEN_THOUSAND\u003e levels banknifty would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels she added 1 mazagon dock shipbuilders buy at \u003cFOUR_THOUSAND\u003e target at \u003cFOUR_THOUSAND\u003e stop loss at \u003cFOUR_THOUSAND\u003e indian hotels buy at \u003cSEVEN_HUNDRED\u003e target at \u003cSEVEN_HUNDRED\u003e stop loss at \u003cSEVEN_HUNDRED\u003e firstsource solutions buy at \u003cTHREE_HUNDRED\u003e target at \u003cTHREE_HUNDRED\u003e stop loss at \u003cTHREE_HUNDRED\u003e","timestamp":"2024-10-16T06:24:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}