{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-bajaj-housing-finance-ola-electric-mobility-cyient-dlm-union-bank-of-india-and-more-11729535496335.html","title":"Stocks to Watch: Bajaj Housing Finance, Ola Electric Mobility, Cyient DLM, Union Bank of India, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Bajaj Housing Finance: It reported a 21% year-on-year (YoY) increase in net profit, reaching  ₹545.6 crore for the second quarter ending September 30, 2024. This is a rise from the  ₹451.1 crore net profit posted in the same quarter last year, according to the company’s regulatory filing. Additionally, the company's revenue from operations also saw a 21.1% increase, amounting to  ₹2,410 crore compared to  ₹1,911.5 crore in the year-ago period.Cyient DLM: It reported a 5.5% year-on-year (YoY) increase in net profit, reaching  ₹15.4 crore for the second quarter ending September 30, 2024, compared to  ₹14.6 crore in the corresponding period last year. According to the company’s regulatory filing, revenue from operations rose 33.4%, climbing to  ₹389.4 crore from  ₹291.8 crore in the same period last year.Union Bank of India: The public sector bank posted a 34.4% year-on-year (YoY) increase in standalone net profit for the second quarter, reaching  ₹4,720 crore, up from  ₹3,511 crore in the same quarter last year. However, net interest income (NII) saw a marginal decline of 0.9%, dropping to  ₹9,047 crore compared to  ₹9,126 crore in the year-ago quarter. The bank’s asset quality also saw improvements, with gross non-performing assets (NPA) dropping to 4.36% from 4.54% in the previous quarter, although net NPA rose slightly to 0.98% from 0.90% quarter-on-quarter (QoQ).City Union Bank: The private sector lender reported a net profit of  ₹285.2 crore for the second quarter of FY25, reflecting a 1.6% increase compared to  ₹280.6 crore in the same quarter last year. Its net interest income (NII) for Q2 FY25 rose by 8.2%, reaching  ₹582.5 crore, up from  ₹538.4 crore in the corresponding quarter last year. In comparison, the bank posted a 4.5% NII growth in Q1 FY25, recording  ₹546 crore.Mahindra Logistics: It reported a net loss of  ₹9.6 crore for the second quarter ending September 30, 2024, which narrowed from a net loss of  ₹15.5 crore in the same period last year. Revenue from operations increased by 11.4%, reaching  ₹1,521 crore compared to  ₹1,364.8 crore in the corresponding quarter of the previous fiscal year.Aurum PropTech: The company posted a consolidated net loss of  ₹95.5 crore for the second quarter, a significant improvement from the  ₹201 crore loss recorded in the same period last year (YoY). The company's Q2 revenue stood at  ₹63.96 crore, up from  ₹52.77 crore in the year-ago period. Aurum PropTech also posted an EBITDA profit of  ₹10.91 crore for Q2, compared to an EBITDA loss of  ₹7.6 crore in the previous year (YoY), with an EBITDA margin of 17.06%.Aurionpro Solutions: The firm reported its Q2 consolidated net profit at  ₹45.1 crore, up from  ₹43.4 crore in the previous quarter (QoQ). The company's Q2 revenue stood at  ₹278 crore, rising from  ₹261 crore in the prior quarter (QoQ). Q2 EBITDA came in at  ₹49.1 crore, slightly down from  ₹49.8 crore in the previous quarter, with an EBITDA margin of 17.65%, compared to 19.56% in the previous quarter.HFCL: The company's consolidated revenue saw a marginal decline of 1.62% year-on-year (YoY), reaching  ₹1,094 crore from  ₹1,112 crore. Despite this, consolidated EBITDA rose 19.54%, increasing to  ₹159 crore from  ₹133 crore YoY, with an improvement in the EBITDA margin to 14.53% from 11.96%. The company's consolidated net profit grew by 4.28% to  ₹73 crore, up from  ₹70 crore YoY.Eicher Motors' subsidiary, Royal Enfield, has commenced operations at its new manufacturing unit and flagship showroom in Bangladesh. This development is in partnership with IFAD Motors and marks Royal Enfield’s sixth assembly unit outside India. The company has similar facilities in Nepal, Brazil, Thailand, Colombia, and Argentina.Ola Electric reported that 99.1% of the 10,644 complaints received from the Central Consumer Protection Authority (CCPA) have been resolved. The company stated that it has provided the necessary information and clarifications in response to the Show Cause Notice from the CCPA. Ola also highlighted that it has a strong mechanism in place to address complaints related to its vehicles.Hyundai Motor India’s highly anticipated IPO is set to make its market debut soon, following an impressive subscription rate of 237% last week. The  ₹27,870 crore IPO will be listed on both the BSE and the NSE, with strong investor attention on its performance.Earnings Today: Additionally, 70 companies are slated to release their Q2 FY25 earnings today, including Adani Green, Amber Enterprises, Bajaj Finance, Can Fin Homes, Zomato, Paytm, Chennai Petroleum Corporation, Coforge, ICICI Prudential Life, Indus Towers, Mahindra \u0026 Mahindra Financial Services, Persistent Systems, and Zensar Technologies.","cleaned_content":"bajaj housing finance it reported a \u003cTWO_TEN_PERCENT\u003e year on year yoy increase in net profit reaching \u003cFIVE_HUNDRED\u003e crore for the second quarter ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e this is a rise from the \u003cFOUR_HUNDRED\u003e crore net profit posted in the same quarter last year according to the company s regulatory filing additionally the companys revenue from operations also saw a \u003cTWO_TEN_PERCENT\u003e increase amounting to \u003cTWO_THOUSAND\u003e crore compared to \u003cONE_THOUSAND\u003e crore in the year ago period cyient dlm it reported a \u003cFIVE_PERCENT\u003e year on year yoy increase in net profit reaching \u003cONE_TEN\u003e crore for the second quarter ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to \u003cONE_TEN\u003e crore in the corresponding period last year according to the company s regulatory filing revenue from operations rose \u003cTHREE_TEN_PERCENT\u003e climbing to \u003cTHREE_HUNDRED\u003e crore from \u003cTWO_HUNDRED\u003e crore in the same period last year union bank of india the public sector bank posted a \u003cTHREE_TEN_PERCENT\u003e year on year yoy increase in standalone net profit for the second quarter reaching \u003cFOUR_THOUSAND\u003e crore up from \u003cTHREE_THOUSAND\u003e crore in the same quarter last year however net interest income nii saw a marginal decline of \u003cZERO_PERCENT\u003e dropping to \u003cNINE_THOUSAND\u003e crore compared to \u003cNINE_THOUSAND\u003e crore in the year ago quarter the bank s asset quality also saw improvements with gross non performing assets npa dropping to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e in the previous quarter although net npa rose slightly to \u003cZERO_PERCENT\u003e from \u003cZERO_PERCENT\u003e quarter on quarter qoq city union bank the private sector lender reported a net profit of \u003cTWO_HUNDRED\u003e crore for the second quarter of fy25 reflecting a \u003cONE_PERCENT\u003e increase compared to \u003cTWO_HUNDRED\u003e crore in the same quarter last year its net interest income nii for q2 fy25 rose by \u003cEIGHT_PERCENT\u003e reaching \u003cFIVE_HUNDRED\u003e crore up from \u003cFIVE_HUNDRED\u003e crore in the corresponding quarter last year in comparison the bank posted a \u003cFOUR_PERCENT\u003e nii growth in q1 fy25 recording \u003cFIVE_HUNDRED\u003e crore mahindra logistics it reported a net loss of \u003cNINE_\u003e crore for the second quarter ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e which narrowed from a net loss of \u003cONE_TEN\u003e crore in the same period last year revenue from operations increased by \u003cONE_TEN_PERCENT\u003e reaching \u003cONE_THOUSAND\u003e crore compared to \u003cONE_THOUSAND\u003e crore in the corresponding quarter of the previous fiscal year aurum proptech the company posted a consolidated net loss of \u003cNINE_TEN\u003e crore for the second quarter a significant improvement from the \u003cTWO_HUNDRED\u003e crore loss recorded in the same period last year yoy the companys q2 revenue stood at \u003cSIX_TEN\u003e crore up from \u003cFIVE_TEN\u003e crore in the year ago period aurum proptech also posted an ebitda profit of \u003cONE_TEN\u003e crore for q2 compared to an ebitda loss of \u003cSEVEN_\u003e crore in the previous year yoy with an ebitda margin of \u003cONE_TEN_PERCENT\u003e aurionpro solutions the firm reported its q2 consolidated net profit at \u003cFOUR_TEN\u003e crore up from \u003cFOUR_TEN\u003e crore in the previous quarter qoq the companys q2 revenue stood at \u003cTWO_HUNDRED\u003e crore rising from \u003cTWO_HUNDRED\u003e crore in the prior quarter qoq q2 ebitda came in at \u003cFOUR_TEN\u003e crore slightly down from \u003cFOUR_TEN\u003e crore in the previous quarter with an ebitda margin of \u003cONE_TEN_PERCENT\u003e compared to \u003cONE_TEN_PERCENT\u003e in the previous quarter hfcl the companys consolidated revenue saw a marginal decline of \u003cONE_PERCENT\u003e year on year yoy reaching \u003cONE_THOUSAND\u003e crore from \u003cONE_THOUSAND\u003e crore despite this consolidated ebitda rose \u003cONE_TEN_PERCENT\u003e increasing to \u003cONE_HUNDRED\u003e crore from \u003cONE_HUNDRED\u003e crore yoy with an improvement in the ebitda margin to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e the companys consolidated net profit grew by \u003cFOUR_PERCENT\u003e to \u003cSEVEN_TEN\u003e crore up from \u003cSEVEN_TEN\u003e crore yoy eicher motors subsidiary royal enfield has commenced operations at its new manufacturing unit and flagship showroom in bangladesh this development is in partnership with ifad motors and marks royal enfield s sixth assembly unit outside india the company has similar facilities in nepal brazil thailand colombia and argentina ola electric reported that \u003cNINE_TEN_PERCENT\u003e of the \u003cONE_TEN_THOUSAND\u003e complaints received from the central consumer protection authority ccpa have been resolved the company stated that it has provided the necessary information and clarifications in response to the show cause notice from the ccpa ola also highlighted that it has a strong mechanism in place to address complaints related to its vehicles hyundai motor india s highly anticipated ipo is set to make its market debut soon following an impressive subscription rate of \u003cTWO_HUNDRED_PERCENT\u003e last week the \u003cTWO_TEN_THOUSAND\u003e crore ipo will be listed on both the bse and the nse with strong investor attention on its performance earnings today additionally \u003cSEVEN_TEN\u003e companies are slated to release their q2 fy25 earnings today including adani green amber enterprises bajaj finance can fin homes zomato paytm chennai petroleum corporation coforge icici prudential life indus towers mahindra mahindra financial services persistent systems and zensar technologies","timestamp":"2024-10-22T08:24:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}