{"url":"https://www.livemint.com/market/stock-market-news/mukul-agrawal-owned-multibagger-sme-stock-hits-lifetime-high-do-you-own-it-11729232770626.html","title":"Mukul Agrawal-owned multibagger SME stock hits lifetime high. Do you own it?","description":"Mukul Agrawal Portfolio: Siyaram Recycling Industries hit an all-time high of  ₹168, fueled by a new  ₹5 crore order. The stock has risen 20% recently and shown significant growth since its IPO.","content":"Mukul Agrawal Portfolio: Shares of Mukul Agrawal-owned small and medium enterprises (SME) firm Siyaram Recycling Industries rallied 6 per cent to its all-time high of  ₹168 apiece on Friday, October 18. The stock has rallied in three of the last four trading sessions, gaining 20 per cent during this period. The rise comes on the back of an order win for the company from a Dubai-based company for  ₹5 crore.“Company is in receipt of a purchase order for 100 tons of Brass Billets from M/s. Al Qaryan International, Dubai with a total value amounting to USD 590000 (Approx. INR 5 crore),” the company said in an exchange filing on Tuesday, October 15. The stock had closed with a gain of 8 per cent that day.Siyaram Recycling Industries’ share price opened at  ₹160 apiece on the BSE today. The stock rose to the day’s high of  ₹168 and touched the day’s low of  ₹157.50. Around 11.35 am, the scrip was trading at  ₹164, up 3.40 per cent over its previous close on the BSE.Siyaram Recycling on October 5 said its board has agreed to issue over 2 million shares to investor Mukul Agrawal.At its board meeting on Saturday (October 5), the board approved raising up to  ₹35.40 crore by issuing new shares. They decided to issue 3 million preferential shares at  ₹118 per share to 26 investors. Among them, Mukul Agrawal will receive 2.2 million shares. This decision was shared in an official statement by the company.According to Trendlyne data, Mukul Agrawal publicly holds 50 stocks with a net worth of over  ₹6,347.8 crore. During the September quarter, he increased stakes in three stocks – Raymond Lifestyle, Hind Rectifiers and Lux Industries – while reducing stakes in several other counters.Majority of the stake in Siyaram Reclying Industries at the end of the September quarter lay with the promoters at 70.9 per cent, followed by public shareholders at 27.5 per cent. Domestic institutional investors held a1.7 per cent stake as of September 30, 2024, with FIIs having no holding in the company, showed Trendlyne data.Siyaram Recycling Industries shares have been on a tear since their debut in December last year. The company has rewarded its IPO investors with multibagger returns, underscoring the stellar run witnessed by the SME issues.The company’s initial public offering (IPO), which opened from December 14 till December 18 last year, was priced in the range of  ₹43 to  ₹46 per share. As of today, the stock has delivered 265 per cent returns over its issue price.","cleaned_content":"mukul agrawal portfolio shares of mukul agrawal owned small and medium enterprises sme firm siyaram recycling industries rallied \u003cSIX_PERCENT\u003e to its all time high of \u003cONE_HUNDRED\u003e apiece on friday october \u003cONE_TEN\u003e the stock has rallied in three of the last four trading sessions gaining \u003cTWO_TEN_PERCENT\u003e during this period the rise comes on the back of an order win for the company from a dubai based company for \u003cFIVE_\u003e crore company is in receipt of a purchase order for \u003cONE_HUNDRED\u003e tons of brass billets from m s al qaryan international dubai with a total value amounting to usd \u003cFIVE_HUNDRED_THOUSAND\u003e approx inr \u003cFIVE_\u003e crore the company said in an exchange filing on tuesday october \u003cONE_TEN\u003e the stock had closed with a gain of \u003cEIGHT_PERCENT\u003e that day siyaram recycling industries share price opened at \u003cONE_HUNDRED\u003e apiece on the bse today the stock rose to the day s high of \u003cONE_HUNDRED\u003e and touched the day s low of \u003cONE_HUNDRED\u003e around \u003cONE_TEN\u003e am the scrip was trading at \u003cONE_HUNDRED\u003e up \u003cTHREE_PERCENT\u003e over its previous close on the bse siyaram recycling on october \u003cFIVE_\u003e said its board has agreed to issue over \u003cTWO_\u003e million shares to investor mukul agrawal at its board meeting on saturday october \u003cFIVE_\u003e the board approved raising up to \u003cTHREE_TEN\u003e crore by issuing new shares they decided to issue \u003cTHREE_\u003e million preferential shares at \u003cONE_HUNDRED\u003e per share to \u003cTWO_TEN\u003e investors among them mukul agrawal will receive \u003cTWO_\u003e million shares this decision was shared in an official statement by the company according to trendlyne data mukul agrawal publicly holds \u003cFIVE_TEN\u003e stocks with a net worth of over \u003cSIX_THOUSAND\u003e crore during the september quarter he increased stakes in three stocks raymond lifestyle hind rectifiers and lux industries while reducing stakes in several other counters majority of the stake in siyaram reclying industries at the end of the september quarter lay with the promoters at \u003cSEVEN_TEN_PERCENT\u003e followed by public shareholders at \u003cTWO_TEN_PERCENT\u003e domestic institutional investors held a1 7 per cent stake as of september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e with fiis having no holding in the company showed trendlyne data siyaram recycling industries shares have been on a tear since their debut in december last year the company has rewarded its ipo investors with multibagger returns underscoring the stellar run witnessed by the sme issues the company s initial public offering ipo which opened from december \u003cONE_TEN\u003e till december \u003cONE_TEN\u003e last year was priced in the range of \u003cFOUR_TEN\u003e to \u003cFOUR_TEN\u003e per share as of today the stock has delivered \u003cTWO_HUNDRED_PERCENT\u003e returns over its issue price","timestamp":"2024-10-18T12:04:00+05:30","market_timestamp":"2024-10-18T12:04:00+05:30","off_market_hours":false}