{"url":"https://www.livemint.com/market/stock-market-news/fraser-says-citigroup-not-facing-asset-cap-paring-share-drop-11729010785979.html","title":"Fraser Says Citigroup Not Facing Asset Cap, Paring Share Drop","description":"Citigroup Inc. Chief Executive Officer Jane Fraser said federal regulators have not placed any restrictions on the bank’s growth.","content":"Citigroup Inc. Chief Executive Officer Jane Fraser said federal regulators have not placed any restrictions on the bank’s growth.The clarification came after shares sank as much as 5% on Tuesday after Fraser said her bank is “working closely with our regulators” in response to repeated questions from Wells Fargo \u0026 Co. analyst Mike Mayo about whether the company has been slapped with an asset cap.Regulators have dinged Citigroup in recent years for shortcomings in its risk and controls. In July, the Federal Reserve said the bank had made insufficient progress toward resolving a pair of consent orders that the central bank and the Office of the Comptroller of the Currency had slapped on the bank in 2020.“Let me be crystal clear: we do not have an asset cap and there are no additional measures other than what was announced in July in place, and we’re not expecting any,” Fraser said.Shares of Citigroup were down about 3.5% after paring those earlier losses, which came after Fraser’s earlier response did not directly address a potential asset cap.An asset cap is viewed as one of the most prohibitive penalties that banking regulators can place on US banks.Mayo’s questions came as watchdogs recently announced in recent weeks that Toronto-Dominion Bank will pay almost $3.1 billion in fines and other penalties and face a cap on its US retail banking assets, after pleading guilty to failing to prevent money laundering by drug cartels and other criminals.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"citigroup inc chief executive officer jane fraser said federal regulators have not placed any restrictions on the bank s growth the clarification came after shares sank as much as \u003cFIVE_PERCENT\u003e on tuesday after fraser said her bank is working closely with our regulators in response to repeated questions from wells fargo co analyst mike mayo about whether the company has been slapped with an asset cap regulators have dinged citigroup in recent years for shortcomings in its risk and controls in july the federal reserve said the bank had made insufficient progress toward resolving a pair of consent orders that the central bank and the office of the comptroller of the currency had slapped on the bank in \u003cTWO_THOUSAND\u003e let me be crystal clear we do not have an asset cap and there are no additional measures other than what was announced in july in place and we re not expecting any fraser said shares of citigroup were down about \u003cTHREE_PERCENT\u003e after paring those earlier losses which came after fraser s earlier response did not directly address a potential asset cap an asset cap is viewed as one of the most prohibitive penalties that banking regulators can place on us banks mayo s questions came as watchdogs recently announced in recent weeks that toronto dominion bank will pay almost \u003cTHREE_\u003e billion in fines and other penalties and face a cap on its us retail banking assets after pleading guilty to failing to prevent money laundering by drug cartels and other criminals this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-15T22:16:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}