{"url":"https://www.livemint.com/market/stock-market-news/shriram-finance-to-consider-interim-dividend-stock-split-this-month-shares-jump-4-11729242285869.html","title":"Shriram Finance to consider interim dividend, stock split THIS month. Shares jump 4%","description":"Shriram Finance shares surged nearly 4% after announcing a board meeting on October 25 to discuss an interim dividend and stock split. The stock rebounded from initial losses, trading 3% higher.","content":"Shriram Finance share price reversed initial losses to jump nearly 4 per cent on Friday, October 18 after the company said its board will meet later this month to consider interim dividend and stock split. The said meeting is slated for Friday, October 25.Following the announcement, Shriram Finance stock jumped as much as 3.61 per cent to  ₹3,372.60 apiece. The stock opened slightly lower at  ₹3,223.80 against its previous close of  ₹3,254.95. However, it soon recouped losses to trade in the green. At 2.25 pm, the scrip was up 3.47 per cent at  ₹3,368.The company in an exchange filing on Friday said the board will consider the “proposal of alteration in the share capital of the company by sub-division/split of existing equity shares having face value of Rs. 10/- each, fully paid up in such manner as may be determined by the Board of Directors, subject to the approval of the Members of the Company.”With regards to the interim dividend, the company has fixed Thursday, November 7, as the record date for the payment of the said dividend, if approved by the board.The company’s board will also consider the unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2024, on that day.During the first quarter of the current financial year (Q1 FY25), non-banking finance company (NBFC) Shriram Finance had posted a net profit growth of 18.62 per cent year-on-year (YoY) at  ₹2,030.64 crore. It stood at  ₹1,712.19 crore in the same period last year.Meanwhile, its net interest income (NII) grew by 21 per cent YoY to  ₹5,554.87 crore in Q1 FY25 results as against  ₹4,580 crore in the year-ago period.By the end of the first quarter, the NBFC's total assets under management (AUM) grew by 21% to  ₹2,33,443.63 crore, up from  ₹1,93,214.67 crore in the same period of 2023-24. The consolidated basic EPS rose by 18.21%, reaching  ₹53.82 compared to  ₹45.53 in the corresponding period of the previous year.","cleaned_content":"shriram finance share price reversed initial losses to jump nearly \u003cFOUR_PERCENT\u003e on friday october \u003cONE_TEN\u003e after the company said its board will meet later this month to consider interim dividend and stock split the said meeting is slated for friday october \u003cTWO_TEN\u003e following the announcement shriram finance stock jumped as much as \u003cTHREE_PERCENT\u003e to \u003cTHREE_THOUSAND\u003e apiece the stock opened slightly lower at \u003cTHREE_THOUSAND\u003e against its previous close of \u003cTHREE_THOUSAND\u003e however it soon recouped losses to trade in the green at \u003cTWO_\u003e pm the scrip was up \u003cTHREE_PERCENT\u003e at \u003cTHREE_THOUSAND\u003e the company in an exchange filing on friday said the board will consider the proposal of alteration in the share capital of the company by sub division split of existing equity shares having face value of rs \u003cONE_TEN\u003e each fully paid up in such manner as may be determined by the board of directors subject to the approval of the members of the company with regards to the interim dividend the company has fixed thursday november \u003cSEVEN_\u003e as the record date for the payment of the said dividend if approved by the board the company s board will also consider the unaudited standalone and consolidated financial results for the second quarter and half year ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e on that day during the first quarter of the current financial year q1 fy25 non banking finance company nbfc shriram finance had posted a net profit growth of \u003cONE_TEN_PERCENT\u003e year on year yoy at \u003cTWO_THOUSAND\u003e crore it stood at \u003cONE_THOUSAND\u003e crore in the same period last year meanwhile its net interest income nii grew by \u003cTWO_TEN_PERCENT\u003e yoy to \u003cFIVE_THOUSAND\u003e crore in q1 fy25 results as against \u003cFOUR_THOUSAND\u003e crore in the year ago period by the end of the first quarter the nbfcs total assets under management aum grew by \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_HUNDRED_THOUSAND\u003e crore up from \u003cONE_HUNDRED_THOUSAND\u003e crore in the same period of \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the consolidated basic eps rose by \u003cONE_TEN_PERCENT\u003e reaching \u003cFIVE_TEN\u003e compared to \u003cFOUR_TEN\u003e in the corresponding period of the previous year","timestamp":"2024-10-18T14:43:00+05:30","market_timestamp":"2024-10-18T14:43:00+05:30","off_market_hours":false}