{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-cochin-shipyard-hdfc-life-pvr-inox-hdfc-life-kei-industries-and-more-11729017482956.html","title":"Stocks to Watch: Cochin Shipyard, HDFC Life, PVR Inox, HDFC Life, KEI Industries, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Cochin Shipyard: The government has announced plans to divest a 5 percent stake in Cochin Shipyard through an Offer for Sale (OFS), with the floor price set at  ₹1,540 per share. The OFS includes a base offer of 2.5 percent, with an additional 2.5 percent available under the green shoe option. The sale is scheduled to open on October 16 for non-retail investors, followed by October 17 for retail investors.KEI Industries: KEI Industries reported a 10.3 percent year-on-year (YoY) rise in net profit, reaching  ₹154.8 crore for the second quarter ending September 30, 2024. Last year, during the same period, net profit stood at  ₹140.3 crore, according to a regulatory filing. The company’s revenue from operations grew 17.2 percent to  ₹2,279.6 crore, compared to  ₹1,945 crore in the corresponding quarter of the previous fiscal. At the operating level, EBITDA rose by 9.1 percent to  ₹220.5 crore, up from  ₹202.2 crore in the prior year.Adani Energy Solutions (AESL): AESL has acquired two project-specific special purpose vehicles from PFC Consulting for approximately  ₹38 crore. This acquisition includes 100 percent equity shares of Jamnagar Transmission Ltd and Navinal Transmission Ltd, both engaged in expanding power transmission networks in Gujarat.PVR Inox: PVR Inox reported its third consecutive quarterly loss, posting a consolidated net loss of  ₹11.8 crore for the quarter ending September 30, compared to a profit of  ₹166 crore a year ago. Revenue fell 19 percent to  ₹162.2 crore, driven by a 25 percent drop in ticket sales. To counter the losses, the company is banking on upcoming releases like Singham Again and Bhool Bhulaiyaa 3 to attract audiences and boost profitability. PVR Inox also plans to add 110-120 new screens by March 2025, despite closing 42 underperforming screens.Rallis India: Rallis India reported a 19.5 percent YoY increase in net profit, reaching  ₹98 crore for the second quarter ended September 30, 2024, compared to  ₹82 crore in the same quarter last year. The company’s revenue from operations grew by 11.5 percent to  ₹928 crore, up from  ₹832 crore in the corresponding period.PNC Infratech: PNC Infratech announced that it has received Letters of Acceptance (LoA) from the Maharashtra State Road Development Corporation (MSRDC) for two significant Engineering, Procurement, and Construction (EPC) road projects. The first involves constructing the access-controlled Pune Ring Road (Package PRR E2), spanning from Indori to Chimbali in Pune district.HDFC Life: HDFC Life reported a 14.85 percent increase in net profit, reaching  ₹433 crore for Q2 FY2024-25, alongside a 17.1 percent rise in the value of new business (VNB), totaling  ₹938 crore. Despite growth in new business premiums by 14.03 percent YoY, the VNB margin slightly contracted to 24.3 percent. Additionally, the company raised  ₹1,000 crore through non-convertible debentures to bolster its solvency ratio.G R Infraprojects: G R Infraprojects announced that it received a Letter of Acceptance from the MSRDC for a project worth  ₹1,885.63 crore. This involves constructing an access-controlled 9.341-km segment of the Pune Ring Road from Kalyan/Rathwade to Shivare/Kusgaon in Pune district.Mastek: Smallcap World Fund Inc, a foreign portfolio investor, sold a 1.7 percent stake in Mastek, amounting to  ₹148.5 crore at an average price of  ₹2,801.68 per share. Meanwhile, Aalidhra Textool Engineers acquired a 0.65 percent stake in the company at an average price of  ₹2,800.81 per share.Central Bank of India: The Competition Commission of India has given approval for Central Bank of India’s proposed acquisition of a 24.91 percent shareholding in Future Generali India Insurance and a 25.18 percent stake in Future Generali India Life Insurance.RailTel Corporation of India: RailTel Corporation has secured a work order valued at  ₹79.84 crore from the Maharashtra Housing and Area Development Authority. The project involves selecting a service provider for cloud hosting and managed services, including setting up, migrating, and managing a data center and disaster recovery site for MHADA on the cloud.Bajaj Auto, L\u0026T Technology Services, Aditya Birla Money, South Indian Bank, CRISIL, Accelya Solutions India, Aditya Forge, Citizen Infoline, Hi-Tech Winding Systems, Himadri Speciality Chemical, Mphasis, Nutraplus India, Pasari Spinning Mills, Pondy Oxides \u0026 Chemicals, Rajnish Wellness, Sai Industries, Saptak Chem and Business, Shah Metacorp, Tips Music, and Vivid Mercantile are set to announce their earnings today.","cleaned_content":"cochin shipyard the government has announced plans to divest a \u003cFIVE_PERCENT\u003e stake in cochin shipyard through an offer for sale ofs with the floor price set at \u003cONE_THOUSAND\u003e per share the ofs includes a base offer of \u003cTWO_PERCENT\u003e with an additional \u003cTWO_PERCENT\u003e available under the green shoe option the sale is scheduled to open on october \u003cONE_TEN\u003e for non retail investors followed by october \u003cONE_TEN\u003e for retail investors kei industries kei industries reported a \u003cONE_TEN_PERCENT\u003e year on year yoy rise in net profit reaching \u003cONE_HUNDRED\u003e crore for the second quarter ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e last year during the same period net profit stood at \u003cONE_HUNDRED\u003e crore according to a regulatory filing the company s revenue from operations grew \u003cONE_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e crore compared to \u003cONE_THOUSAND\u003e crore in the corresponding quarter of the previous fiscal at the operating level ebitda rose by \u003cNINE_PERCENT\u003e to \u003cTWO_HUNDRED\u003e crore up from \u003cTWO_HUNDRED\u003e crore in the prior year adani energy solutions aesl aesl has acquired two project specific special purpose vehicles from pfc consulting for approximately \u003cTHREE_TEN\u003e crore this acquisition includes \u003cONE_HUNDRED_PERCENT\u003e equity shares of jamnagar transmission ltd and navinal transmission ltd both engaged in expanding power transmission networks in gujarat pvr inox pvr inox reported its third consecutive quarterly loss posting a consolidated net loss of \u003cONE_TEN\u003e crore for the quarter ending september \u003cTHREE_TEN\u003e compared to a profit of \u003cONE_HUNDRED\u003e crore a year ago revenue fell \u003cONE_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e crore driven by a \u003cTWO_TEN_PERCENT\u003e drop in ticket sales to counter the losses the company is banking on upcoming releases like singham again and bhool bhulaiyaa \u003cTHREE_\u003e to attract audiences and boost profitability pvr inox also plans to add \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e new screens by march \u003cTWO_THOUSAND\u003e despite closing \u003cFOUR_TEN\u003e underperforming screens rallis india rallis india reported a \u003cONE_TEN_PERCENT\u003e yoy increase in net profit reaching \u003cNINE_TEN\u003e crore for the second quarter ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to \u003cEIGHT_TEN\u003e crore in the same quarter last year the company s revenue from operations grew by \u003cONE_TEN_PERCENT\u003e to \u003cNINE_HUNDRED\u003e crore up from \u003cEIGHT_HUNDRED\u003e crore in the corresponding period pnc infratech pnc infratech announced that it has received letters of acceptance loa from the maharashtra state road development corporation msrdc for two significant engineering procurement and construction epc road projects the first involves constructing the access controlled pune ring road package prr e2 spanning from indori to chimbali in pune district hdfc life hdfc life reported a \u003cONE_TEN_PERCENT\u003e increase in net profit reaching \u003cFOUR_HUNDRED\u003e crore for q2 fy2024 \u003cTWO_TEN\u003e alongside a \u003cONE_TEN_PERCENT\u003e rise in the value of new business vnb totaling \u003cNINE_HUNDRED\u003e crore despite growth in new business premiums by \u003cONE_TEN_PERCENT\u003e yoy the vnb margin slightly contracted to \u003cTWO_TEN_PERCENT\u003e additionally the company raised \u003cONE_THOUSAND\u003e crore through non convertible debentures to bolster its solvency ratio g r infraprojects g r infraprojects announced that it received a letter of acceptance from the msrdc for a project worth \u003cONE_THOUSAND\u003e crore this involves constructing an access controlled \u003cNINE_\u003e km segment of the pune ring road from kalyan rathwade to shivare kusgaon in pune district mastek smallcap world fund inc a foreign portfolio investor sold a \u003cONE_PERCENT\u003e stake in mastek amounting to \u003cONE_HUNDRED\u003e crore at an average price of \u003cTWO_THOUSAND\u003e per share meanwhile aalidhra textool engineers acquired a \u003cZERO_PERCENT\u003e stake in the company at an average price of \u003cTWO_THOUSAND\u003e per share central bank of india the competition commission of india has given approval for central bank of india s proposed acquisition of a \u003cTWO_TEN_PERCENT\u003e shareholding in future generali india insurance and a \u003cTWO_TEN_PERCENT\u003e stake in future generali india life insurance railtel corporation of india railtel corporation has secured a work order valued at \u003cSEVEN_TEN\u003e crore from the maharashtra housing and area development authority the project involves selecting a service provider for cloud hosting and managed services including setting up migrating and managing a data center and disaster recovery site for mhada on the cloud bajaj auto l t technology services aditya birla money south indian bank crisil accelya solutions india aditya forge citizen infoline hi tech winding systems himadri speciality chemical mphasis nutraplus india pasari spinning mills pondy oxides chemicals rajnish wellness sai industries saptak chem and business shah metacorp tips music and vivid mercantile are set to announce their earnings today","timestamp":"2024-10-16T08:27:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}