{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-oct-19-11729315150169.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Oct 21","description":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — ICICI Bank, JSW Steel, and HDFC Life","content":"Buy or sell stocks: After losing for three straight sessions, the Indian stock market witnessed some buying interest in the Friday session. The Nifty 50 index finished 104 points higher at 24,854; the BSE Sensex ended 218 points up at 81,224, whereas the Bank Nifty index gained 805 points and closed at 52,094. Cash market volumes on the NSE rose 4.2% compared to the previous session. The broad market indices underperformed compared to the Nifty 50 index even as the advance-decline ratio fell to 0.90:1.Sumeet Bagadia, Executive Director at Choice Broking, believes that Friday's rally can be a relief until the Nifty 50 index decisively breaches the psychological 25,000 mark. The Choice Broking expert said that the Indian stock market trend is still negative, and it may retest its recent lows. So, a stock-specific approach amid the Q2 results 2024 season is advisable. He suggested looking at stocks that are looking strong on the technical chart.When asked about stocks to buy or sell on Monday, Sumeet Bagadia recommended buying ICICI Bank, JSW Steel, and HDFC Life.1] ICICI Bank: Buy at  ₹1264.50, target  ₹1333, stop loss  ₹1212.ICICI Bank share price is currently trading around  ₹1264.50, showing some consolidation after recent downward movement. The stock has been moving in a range, trying to find stability before making its next move.The stock has strong support at  ₹1212 (near the 100-day Exponential Moving Average or EMA) and resistance around  ₹1280. If the price breaks above  ₹1280, it could lead to a new upward trend, pushing the stock towards  ₹1333.The stock has witnessed consistent trading volume, but it needs to break above the resistance level on a more robust volume to confirm a sustainable uptrend. If the price is above the volume weighted average price (VWAP) of approximately  ₹1250, a recovery can be anticipated in the coming sessions. ICICI Bank is showing signs of recovery in the short term, especially if it can break above the  ₹1280 level. Investors can look for buying opportunities on dips while keeping an eye on Stop-Loss at  ₹1212 and a target of  ₹1333 for further movement.2] JSW Steel: Buy at  ₹992.60, target  ₹1050, stop loss  ₹960.JSW Steel share price is currently trading around  ₹992.60, showing a mild recovery after hitting a low of  ₹969.75. The stock has been witnessing some consolidation, trying to stabilize before the next possible move. The stock faces immediate resistance at  ₹995 (near the 20-day Exponential Moving Average or EMA). A breakout above this level could push the stock towards the next significant resistance at  ₹1050. On the downside, the stock has strong support, around  ₹960, which aligns with the 50-day EMA. A breach below this could see a further correction towards  ₹940.The stock is currently in between its 20-day and 50-day EMAs ( ₹995 and  ₹960, respectively), indicating a phase of indecision or consolidation. For current investors, holding the stock above  ₹990 is advisable. Stop-loss orders can be placed near  ₹960 to safeguard against downside risk. If the stock closes above  ₹1000, it could signal a further uptrend.New investors may look for buying opportunities near  ₹990, with a stop-loss at  ₹960. A breakout above  ₹1000 would strengthen the case for short-term gains, potentially leading to a target of  ₹1050 in the coming sessions.3] HDFC Life: Buy at  ₹742.45, target  ₹790, stop loss  ₹715.HDFC Life's share price is currently trading at  ₹742.45, showcasing a notable uptrend from the support levels around  ₹715, near its 20-day Exponential Moving Average (EMA). The stock's positive momentum is further confirmed by its positioning above the short-term (20-day), medium-term (50-day), and long-term (200-day) EMA levels, reinforcing its technical resilience.A significant breakthrough above the resistance at  ₹760, supported by robust volumes, underscores the stock's strength, which also marks its 52-week high. A breakout above this crucial resistance could set the stage for a rally towards the target of  ₹790 in the short term. Traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near  ₹715, aiming for the target of  ₹790 and beyond.The momentum indicator, Relative Strength Index (RSI), is currently at 60 levels, indicating positive momentum in the stock. For those considering fresh investments, purchasing at the current market price (CMP) is a viable option, targeting  ₹790, with a stringent stop loss set at  ₹715 levels to manage risk effectively.","cleaned_content":"buy or sell stocks after losing for three straight sessions the indian stock market witnessed some buying interest in the friday session the nifty \u003cFIVE_TEN\u003e index finished \u003cONE_HUNDRED\u003e points higher at \u003cTWO_TEN_THOUSAND\u003e the bse sensex ended \u003cTWO_HUNDRED\u003e points up at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index gained \u003cEIGHT_HUNDRED\u003e points and closed at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse rose \u003cFOUR_PERCENT\u003e compared to the previous session the broad market indices underperformed compared to the nifty \u003cFIVE_TEN\u003e index even as the advance decline ratio fell to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes that fridays rally can be a relief until the nifty \u003cFIVE_TEN\u003e index decisively breaches the psychological \u003cTWO_TEN_THOUSAND\u003e mark the choice broking expert said that the indian stock market trend is still negative and it may retest its recent lows so a stock specific approach amid the q2 results \u003cTWO_THOUSAND\u003e season is advisable he suggested looking at stocks that are looking strong on the technical chart when asked about stocks to buy or sell on monday sumeet bagadia recommended buying icici bank jsw steel and hdfc life 1 icici bank buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e icici bank share price is currently trading around \u003cONE_THOUSAND\u003e showing some consolidation after recent downward movement the stock has been moving in a range trying to find stability before making its next move the stock has strong support at \u003cONE_THOUSAND\u003e near the \u003cONE_HUNDRED\u003e day exponential moving average or ema and resistance around \u003cONE_THOUSAND\u003e if the price breaks above \u003cONE_THOUSAND\u003e it could lead to a new upward trend pushing the stock towards \u003cONE_THOUSAND\u003e the stock has witnessed consistent trading volume but it needs to break above the resistance level on a more robust volume to confirm a sustainable uptrend if the price is above the volume weighted average price vwap of approximately \u003cONE_THOUSAND\u003e a recovery can be anticipated in the coming sessions icici bank is showing signs of recovery in the short term especially if it can break above the \u003cONE_THOUSAND\u003e level investors can look for buying opportunities on dips while keeping an eye on stop loss at \u003cONE_THOUSAND\u003e and a target of \u003cONE_THOUSAND\u003e for further movement 2 jsw steel buy at \u003cNINE_HUNDRED\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cNINE_HUNDRED\u003e jsw steel share price is currently trading around \u003cNINE_HUNDRED\u003e showing a mild recovery after hitting a low of \u003cNINE_HUNDRED\u003e the stock has been witnessing some consolidation trying to stabilize before the next possible move the stock faces immediate resistance at \u003cNINE_HUNDRED\u003e near the \u003cTWO_TEN\u003e day exponential moving average or ema a breakout above this level could push the stock towards the next significant resistance at \u003cONE_THOUSAND\u003e on the downside the stock has strong support around \u003cNINE_HUNDRED\u003e which aligns with the \u003cFIVE_TEN\u003e day ema a breach below this could see a further correction towards \u003cNINE_HUNDRED\u003e the stock is currently in between its \u003cTWO_TEN\u003e day and \u003cFIVE_TEN\u003e day emas \u003cNINE_HUNDRED\u003e and \u003cNINE_HUNDRED\u003e respectively indicating a phase of indecision or consolidation for current investors holding the stock above \u003cNINE_HUNDRED\u003e is advisable stop loss orders can be placed near \u003cNINE_HUNDRED\u003e to safeguard against downside risk if the stock closes above \u003cONE_THOUSAND\u003e it could signal a further uptrend new investors may look for buying opportunities near \u003cNINE_HUNDRED\u003e with a stop loss at \u003cNINE_HUNDRED\u003e a breakout above \u003cONE_THOUSAND\u003e would strengthen the case for short term gains potentially leading to a target of \u003cONE_THOUSAND\u003e in the coming sessions 3 hdfc life buy at \u003cSEVEN_HUNDRED\u003e target \u003cSEVEN_HUNDRED\u003e stop loss \u003cSEVEN_HUNDRED\u003e hdfc lifes share price is currently trading at \u003cSEVEN_HUNDRED\u003e showcasing a notable uptrend from the support levels around \u003cSEVEN_HUNDRED\u003e near its \u003cTWO_TEN\u003e day exponential moving average ema the stocks positive momentum is further confirmed by its positioning above the short term \u003cTWO_TEN\u003e day medium term \u003cFIVE_TEN\u003e day and long term \u003cTWO_HUNDRED\u003e day ema levels reinforcing its technical resilience a significant breakthrough above the resistance at \u003cSEVEN_HUNDRED\u003e supported by robust volumes underscores the stocks strength which also marks its \u003cFIVE_TEN\u003e week high a breakout above this crucial resistance could set the stage for a rally towards the target of \u003cSEVEN_HUNDRED\u003e in the short term traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near \u003cSEVEN_HUNDRED\u003e aiming for the target of \u003cSEVEN_HUNDRED\u003e and beyond the momentum indicator relative strength index rsi is currently at \u003cSIX_TEN\u003e levels indicating positive momentum in the stock for those considering fresh investments purchasing at the current market price cmp is a viable option targeting \u003cSEVEN_HUNDRED\u003e with a stringent stop loss set at \u003cSEVEN_HUNDRED\u003e levels to manage risk effectively","timestamp":"2024-10-20T09:55:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}