{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-abb-to-glenmark-pharma-motilal-oswal-bet-on-these-three-shares-for-this-week-11729088961105.html","title":"Stocks to buy: ABB to Glenmark Pharma - Motilal Oswal bet on these three shares for this week","description":"Brokerage firm Motilal Oswal has recommended three stocks - ABB, Exide Ind, and Glenmark Pharma - to buy this week with decent upside potential.","content":"Indian stock market: Indian stock market benchmarks, the Sensex and Nifty 50, declined for the second straight session on Wednesday, October 16, due to weak global signals. The Sensex dropped 319 points, or 0.39 per cent, to 81,501.36, while the Nifty 50 closed at 24,971.30, down 86 points, or 0.34 per cent.“Nifty fell below 25000 levels and traded sideways throughout the session closing 86 points down at 24971. Nifty smallcap traded flat while midcap lost 0.3%. Baring Oil \u0026 Gas, Realty, and Financials, all sectors ended in red. Consumer durable companies were in focus especially the White Goods after the government received applications from 38 companies with a proposed investment of  ₹4,121 crore in the third phase of the PLI scheme for air-conditioners and LED lights. HDFC AMC gained significantly upon strong Q2 results which pushed other AMC stocks too. Markets are consolidating and witnessing a dip at a higher zone amid relentless selling by FIIs ( ₹63875crs in Oct so far) \u0026 muted results from index heavyweights. We expect this consolidation to continue amid mixed global cues and a lack of domestic triggers. Index-heavy weights like Infosys, Axis Bank, LTI Mindtree, Wipro, and Nestle are likely to be in focus as they announce their Q2 number on Thursday. Also globally, the focus will be on Europe's interest rate decision along with inflation numbers. Apart from that US Retail Sales and China Q3 GDP data will also be keenly watched,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd.Brokerage firm Motilal Oswal has recommended three stocks - ABB, Exide Ind, and Glenmark Pharma - to buy this week with decent upside potential.ABB gave range breakout on weekly scale after twelve weeks and formed a strong bullish candle. On daily scale the stock is forming higher lows from past few days and holding well above its short term moving averages. Momentum oscillator RSI is also moving northward on weekly scale which indicates momentum to continue in coming sessions and good buying interest is visible across Capital space. Thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below 8200 levels on closing basis for a target towards 9200 zones.Exide Ind has formed a strong base on weekly scale near 500 levels and gave consolidation breakout on weekly scale. It formed a strong bullish candle with long lower shadow on weekly scale as buying is visible at lower zones. On daily scale the stock retested the previous breakout zone and holding well above is 50DEMA. Strong outperformance is seen in last few days and stock holding well in spite of market volatility. Thus we are recommending to buy the stock with keeping stop loss below 505 levels on closing basis for a target towards 575 zones.The stock is trading at life time high territory and holding well above 1750 zones. Technically the stock gave channel breakout on weekly scale after seven weeks and formed a strong bullish candle with highest close. On daily scale as well the stock formed a bullish candle and strong buying interest visible across Pharma space. Looking at the overall chart structure the stock is likely to outperform with Pharma space and thus recommending to buy the stock with keeping stop loss below 1720 levels on closing basis for a new life time high target towards 1950 zones.","cleaned_content":"indian stock market indian stock market benchmarks the sensex and nifty \u003cFIVE_TEN\u003e declined for the second straight session on wednesday october \u003cONE_TEN\u003e due to weak global signals the sensex dropped \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e closed at \u003cTWO_TEN_THOUSAND\u003e down \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e nifty fell below \u003cTWO_TEN_THOUSAND\u003e levels and traded sideways throughout the session closing \u003cEIGHT_TEN\u003e points down at \u003cTWO_TEN_THOUSAND\u003e nifty smallcap traded flat while midcap lost \u003cZERO_PERCENT\u003e baring oil gas realty and financials all sectors ended in red consumer durable companies were in focus especially the white goods after the government received applications from \u003cTHREE_TEN\u003e companies with a proposed investment of \u003cFOUR_THOUSAND\u003e crore in the third phase of the pli scheme for air conditioners and led lights hdfc amc gained significantly upon strong q2 results which pushed other amc stocks too markets are consolidating and witnessing a dip at a higher zone amid relentless selling by fiis \u003cSIX_TEN_THOUSAND\u003e crs in oct so far muted results from index heavyweights we expect this consolidation to continue amid mixed global cues and a lack of domestic triggers index heavy weights like infosys axis bank lti mindtree wipro and nestle are likely to be in focus as they announce their q2 number on thursday also globally the focus will be on europes interest rate decision along with inflation numbers apart from that us retail sales and china q3 gdp data will also be keenly watched said siddhartha khemka head research wealth management motilal oswal financial services ltd brokerage firm motilal oswal has recommended three stocks abb exide ind and glenmark pharma to buy this week with decent upside potential abb gave range breakout on weekly scale after twelve weeks and formed a strong bullish candle on daily scale the stock is forming higher lows from past few days and holding well above its short term moving averages momentum oscillator rsi is also moving northward on weekly scale which indicates momentum to continue in coming sessions and good buying interest is visible across capital space thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below \u003cEIGHT_THOUSAND\u003e levels on closing basis for a target towards \u003cNINE_THOUSAND\u003e zones exide ind has formed a strong base on weekly scale near \u003cFIVE_HUNDRED\u003e levels and gave consolidation breakout on weekly scale it formed a strong bullish candle with long lower shadow on weekly scale as buying is visible at lower zones on daily scale the stock retested the previous breakout zone and holding well above is \u003cFIVE_TEN\u003e dema strong outperformance is seen in last few days and stock holding well in spite of market volatility thus we are recommending to buy the stock with keeping stop loss below \u003cFIVE_HUNDRED\u003e levels on closing basis for a target towards \u003cFIVE_HUNDRED\u003e zones the stock is trading at life time high territory and holding well above \u003cONE_THOUSAND\u003e zones technically the stock gave channel breakout on weekly scale after seven weeks and formed a strong bullish candle with highest close on daily scale as well the stock formed a bullish candle and strong buying interest visible across pharma space looking at the overall chart structure the stock is likely to outperform with pharma space and thus recommending to buy the stock with keeping stop loss below \u003cONE_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cONE_THOUSAND\u003e zones","timestamp":"2024-10-16T20:42:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}