{"url":"https://www.livemint.com/market/stock-market-news/dividend-stock-2024-hcl-tech-share-in-focus-as-stock-trades-ex-dividend-today-11729564374709.html","title":"Dividend stock 2024: HCL Tech share in focus as stock trades ex-dividend today","description":"Dividend stock 2024: HCL Technologies is set to make headlines on October 22 as its stock goes ex-dividend. The company has declared an interim dividend of  ₹12 per share,","content":"Dividend stock 2024: HCL Technologies Ltd. is expected to be in the spotlight on October 22, Tuesday, as its stock will trade ex-dividend. The company had declared an interim dividend of  ₹12 per equity share with a face value of  ₹2, for the financial year 2024-25. This interim dividend, approved by the board on October 14, 2024, is scheduled for payment on October 30, 2024, to shareholders who were on record by the ex-dividend date​, the company announced in an exchange filing.HCL Tech share price closed in the red, down 0.79 per cent at  ₹1842.50, on Monday, October 21 on BSE. The company enjoys a market capitalisation of  ₹4,99,992.79 crore.This announcement came alongside the release of HCL’s financial results for the quarter and half-year ending September 30, 2024. The company posted consolidated revenues of  ₹56,919 crore for the six-month period, up from  ₹52,968 crore during the same period in 2023, reflecting steady growth​. Other income for the half-year also showed a notable increase, at  ₹1,559 crore compared to  ₹709 crore in the previous year​.On the expenses front, employee benefits accounted for  ₹32,933 crore, an increase from  ₹30,267 crore in the same period last year. Depreciation and amortisation costs were  ₹2,005 crore, while other expenses totalled  ₹3,640 crore. Despite these higher costs, HCL Tech’s profit before tax stood at  ₹11,394 crore for the half-year, compared to  ₹9,824 crore in the previous year​, as per the filing.The company's net profit for the six months amounted to  ₹8,496 crore, up from  ₹7,364 crore in the previous year, showcasing HCL's robust performance in a competitive sector​​. HCL also recorded strong segment revenues, with IT and Business Services contributing  ₹42,449 crore, and Engineering and R\u0026D services generating  ₹9,000 crore​.","cleaned_content":"dividend stock \u003cTWO_THOUSAND\u003e hcl technologies ltd is expected to be in the spotlight on october \u003cTWO_TEN\u003e tuesday as its stock will trade ex dividend the company had declared an interim dividend of \u003cONE_TEN\u003e per equity share with a face value of \u003cTWO_\u003e for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e this interim dividend approved by the board on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e is scheduled for payment on october \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e to shareholders who were on record by the ex dividend date the company announced in an exchange filing hcl tech share price closed in the red down \u003cZERO_PERCENT\u003e at \u003cONE_THOUSAND\u003e on monday october \u003cTWO_TEN\u003e on bse the company enjoys a market capitalisation of \u003cFOUR_HUNDRED_THOUSAND\u003e crore this announcement came alongside the release of hcl s financial results for the quarter and half year ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company posted consolidated revenues of \u003cFIVE_TEN_THOUSAND\u003e crore for the six month period up from \u003cFIVE_TEN_THOUSAND\u003e crore during the same period in \u003cTWO_THOUSAND\u003e reflecting steady growth other income for the half year also showed a notable increase at \u003cONE_THOUSAND\u003e crore compared to \u003cSEVEN_HUNDRED\u003e crore in the previous year on the expenses front employee benefits accounted for \u003cTHREE_TEN_THOUSAND\u003e crore an increase from \u003cTHREE_TEN_THOUSAND\u003e crore in the same period last year depreciation and amortisation costs were \u003cTWO_THOUSAND\u003e crore while other expenses totalled \u003cTHREE_THOUSAND\u003e crore despite these higher costs hcl tech s profit before tax stood at \u003cONE_TEN_THOUSAND\u003e crore for the half year compared to \u003cNINE_THOUSAND\u003e crore in the previous year as per the filing the companys net profit for the six months amounted to \u003cEIGHT_THOUSAND\u003e crore up from \u003cSEVEN_THOUSAND\u003e crore in the previous year showcasing hcls robust performance in a competitive sector hcl also recorded strong segment revenues with it and business services contributing \u003cFOUR_TEN_THOUSAND\u003e crore and engineering and r d services generating \u003cNINE_THOUSAND\u003e crore","timestamp":"2024-10-22T08:26:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}