{"url":"https://www.livemint.com/market/stock-market-news/vijay-kedia-raises-stake-in-precision-camshafts-debt-free-stock-that-has-surged-45-in-six-months-11729237050660.html","title":"Vijay Kedia raises stake in debt-free stock that has surged 45% in six months","description":"Vijay Kedia, through his firm, Kedia Securities Pvt Ltd purchased 10,00,000 shares, representing a 1.05% stake, in Precision Camshafts during the September quarter.","content":"Ace investor Vijay Kedia has increased his stake in auto component manufacturer Precision Camshafts Ltd. during the July-September 2024 quarter. The small-cap stock has seen a decent rally and has jumped over 26% in one week.Vijay Kedia, through his firm, Kedia Securities Pvt Ltd purchased 10,00,000 shares, representing a 1.05% stake, in Precision Camshafts during the September quarter. Additionally, Vijay Kedia personally owns another 10,00,000 shares, also amounting to a 1.05% stake in the small-cap company, the shareholding pattern in the BSE showed.Vijay Kedia’s total shareholding in Precision Camshafts stands at 20,00,000 shares, or a 2.10% stake, as of September-end, including his personal stake and through his firm Kedia Securities.At the end of June 2024 quarter, Kedia personally held 11 lakh Precision Camshafts shares, amounting to 1.16% equity stake in the company. His firm did not hold any stake in the June quarter.Another ace investor, Ajay Upadhyaya also holds 20 lakh equity shares, or 2.11% stake in Precision Camshafts.Precision Camshafts is a supplier of camshafts in India and globally. The company is debt-free and promoters hold the largest stake in the company, with a 65.37% shareholding, while the remaining 34.63% stake is held by FIIs, DIIs and public shareholders.Precision Camshafts stock price has given decent returns to investors as the small-cap stock rallied over 27% in one week and more than 62% in three months. The Vijay Kedia-portfolio stock has gained 16% year-to-date (YTD).At 1:20 pm, Precision Camshafts shares were trading 1.22% lower at  ₹304.15 apiece, with a market capitalisation of  ₹2,889 crore on the BSE.","cleaned_content":"ace investor vijay kedia has increased his stake in auto component manufacturer precision camshafts ltd during the july september \u003cTWO_THOUSAND\u003e quarter the small cap stock has seen a decent rally and has jumped over \u003cTWO_TEN_PERCENT\u003e in one week vijay kedia through his firm kedia securities pvt ltd purchased \u003cONE_MILLION\u003e shares representing a \u003cONE_PERCENT\u003e stake in precision camshafts during the september quarter additionally vijay kedia personally owns another \u003cONE_MILLION\u003e shares also amounting to a \u003cONE_PERCENT\u003e stake in the small cap company the shareholding pattern in the bse showed vijay kedia s total shareholding in precision camshafts stands at \u003cTWO_MILLION\u003e shares or a \u003cTWO_PERCENT\u003e stake as of september end including his personal stake and through his firm kedia securities at the end of june \u003cTWO_THOUSAND\u003e quarter kedia personally held \u003cONE_TEN\u003e lakh precision camshafts shares amounting to \u003cONE_PERCENT\u003e equity stake in the company his firm did not hold any stake in the june quarter another ace investor ajay upadhyaya also holds \u003cTWO_TEN\u003e lakh equity shares or \u003cTWO_PERCENT\u003e stake in precision camshafts precision camshafts is a supplier of camshafts in india and globally the company is debt free and promoters hold the largest stake in the company with a \u003cSIX_TEN_PERCENT\u003e shareholding while the remaining \u003cTHREE_TEN_PERCENT\u003e stake is held by fiis diis and public shareholders precision camshafts stock price has given decent returns to investors as the small cap stock rallied over \u003cTWO_TEN_PERCENT\u003e in one week and more than \u003cSIX_TEN_PERCENT\u003e in three months the vijay kedia portfolio stock has gained \u003cONE_TEN_PERCENT\u003e year to date ytd at \u003cONE_\u003e \u003cTWO_TEN\u003e pm precision camshafts shares were trading \u003cONE_PERCENT\u003e lower at \u003cTHREE_HUNDRED\u003e apiece with a market capitalisation of \u003cTWO_THOUSAND\u003e crore on the bse","timestamp":"2024-10-18T13:21:00+05:30","market_timestamp":"2024-10-18T13:21:00+05:30","off_market_hours":false}