{"url":"https://www.livemint.com/market/stock-market-news/raymond-lifestyle-shares-surge-5-5-as-mosl-initiates-coverage-with-buy-rating-sees-35-upside-11729497463551.html","title":"Raymond Lifestyle shares surge 5.5% as MOSL initiates coverage with ‘buy’ rating, sees 35% upside","description":"Motilal Oswal initiates coverage on Raymond Lifestyle with a 'buy' rating and a target price of  ₹3,200, indicating over 35% upside. The stock surged 5.5% after the announcement, backed by projected revenue and profit growth of 11% and 15% CAGR from FY24 to FY27.","content":"Domestic brokerage house Motilal Oswal Financial Services (MOSL) initiated coverage on Raymond Lifestyle, a recent spin-off from Raymond Ltd, with a ‘buy’ rating and a target price of  ₹3,200, suggesting an upside potential of over 35 per cent for the stock.Following the announcement, shares of Raymond Lifestyle surged more than 5.5 per cent in Monday's trading session. MOSL projects that the company’s revenue and net profit will grow at a compounded annual growth rate (CAGR) of 11 per cent and 15 per cent, respectively from FY24 to FY27.\"Although the valuation of Raymond’s Lifestyle (RLL) business has almost doubled since the demerger, the stock is currently trading at a relatively lower P/E and an EV/EBITDA (pre-Ind-AS-116) of 25x and 16x on FY26E, respectively. The valuation is significantly lower than that of our Coverage Universe and other retail and discretionary companies, which are valued at an EV/EBITDA of ~35-40x on FY26E. While RLL benefits from strong brand affinity, its valuation has been impeded by sluggish execution in the past (volatility in PAT growth over FY10-20). However, as RLL continues to exhibit a positive growth trajectory, characterised by revenue/PAT CAGR of 11%/15% over FY24-26E, we believe valuations could re-rate,\" said the brokerage.\"Additionally, we anticipate a return on invested capital (ROIC) of 24%, 26%, and 30% in FY25, FY26, and FY27, respectively. With improved FCF generation, RLL could look to increase shareholder returns through dividends,\" it added.Raymond Lifestyle emerged as a standalone entity after the demerger from Raymond Ltd, positioning itself as a pure-play lifestyle company. With a strong presence in the men’s wear segment, RLL commands a significant market share of around 65 per cent in worsted suiting. Its portfolio includes a wide range of branded textiles, operating in both B2B and B2C segments. The company also boasts several popular apparel brands, such as Park Avenue, ColorPlus, and Ethnix by Raymond, catering to formal, casual, and ethnic wear categories. Notably, RLL holds about 5 per cent of the men’s wedding wear market, showcasing its prominence in the sector.In terms of stock performance, Raymond Lifestyle was listed on the NSE on September 5 at  ₹3,020. The stock has gained over 17 per cent from its post-listing low of  ₹2,081. However, it still trades below its listing day close of  ₹2,869. Despite this, analysts remain optimistic about the stock's future, supported by the company’s solid brand presence, wide distribution network, and ambitious growth plans.MOSL highlighted several growth drivers for RLL, including its fast-paced expansion in branded apparel, targeting a doubling of its exclusive brand outlets (EBOs). The company is also positioned to benefit from Bangladesh+1 and China+1 trends in B2B garmenting, it said. Additionally, the launch of new categories like innerwear and sleepwear as well as a shift towards casualisation and premiumisation of its product portfolio are expected to contribute to its growth, said MOSL. Enhanced sourcing efficiencies due to scale could further improve its operating leverage.In recent years, Raymond Group has undertaken strategic initiatives such as demerger of its lifestyle and real estate businesses, restructuring of its engineering division, and sale of its FMCG business. These moves have streamlined the group into distinct listed entities focused on lifestyle, real estate, and engineering, aimed at enhancing shareholder value. Each business is professionally managed with a focus on maintaining a net cash balance sheet, optimising costs, and effectively managing working capital.Despite historically facing challenges related to growth, profitability, and a high working capital cycle, RLL has made significant progress, the brokerage said, adding that it has improved its working capital management, achieved a net cash position ahead of schedule, and enhanced its pre-IFRS EBITDA margins through store rationalisation and cost control measures.Under the leadership of Sunil Kataria, former GCPL executive, RLL's margins have improved to approximately 12 per cent in FY24, up from single-digit levels between FY17 and FY20. Going forward, RLL is focused on accelerating growth in branded apparel, expanding its network, and introducing new categories such as sleepwear and innerwear, alongside scaling up its Ethnix by Raymond brand.","cleaned_content":"domestic brokerage house motilal oswal financial services mosl initiated coverage on raymond lifestyle a recent spin off from raymond ltd with a buy rating and a target price of \u003cTHREE_THOUSAND\u003e suggesting an upside potential of over \u003cTHREE_TEN_PERCENT\u003e for the stock following the announcement shares of raymond lifestyle surged more than \u003cFIVE_PERCENT\u003e in mondays trading session mosl projects that the company s revenue and net profit will grow at a compounded annual growth rate cagr of \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively from fy24 to fy27 although the valuation of raymond s lifestyle rll business has almost doubled since the demerger the stock is currently trading at a relatively lower p e and an ev ebitda pre ind as \u003cONE_HUNDRED\u003e of \u003cTWO_TEN\u003e x and \u003cONE_TEN\u003e x on fy26e respectively the valuation is significantly lower than that of our coverage universe and other retail and discretionary companies which are valued at an ev ebitda of \u003cTHREE_TEN\u003e \u003cFOUR_TEN\u003e x on fy26e while rll benefits from strong brand affinity its valuation has been impeded by sluggish execution in the past volatility in pat growth over fy10 \u003cTWO_TEN\u003e however as rll continues to exhibit a positive growth trajectory characterised by revenue pat cagr of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e we believe valuations could re rate said the brokerage additionally we anticipate a return on invested capital roic of \u003cTWO_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e in fy25 fy26 and fy27 respectively with improved fcf generation rll could look to increase shareholder returns through dividends it added raymond lifestyle emerged as a standalone entity after the demerger from raymond ltd positioning itself as a pure play lifestyle company with a strong presence in the men s wear segment rll commands a significant market share of around \u003cSIX_TEN_PERCENT\u003e in worsted suiting its portfolio includes a wide range of branded textiles operating in both b2b and b2c segments the company also boasts several popular apparel brands such as park avenue colorplus and ethnix by raymond catering to formal casual and ethnic wear categories notably rll holds about \u003cFIVE_PERCENT\u003e of the men s wedding wear market showcasing its prominence in the sector in terms of stock performance raymond lifestyle was listed on the nse on september \u003cFIVE_\u003e at \u003cTHREE_THOUSAND\u003e the stock has gained over \u003cONE_TEN_PERCENT\u003e from its post listing low of \u003cTWO_THOUSAND\u003e however it still trades below its listing day close of \u003cTWO_THOUSAND\u003e despite this analysts remain optimistic about the stocks future supported by the company s solid brand presence wide distribution network and ambitious growth plans mosl highlighted several growth drivers for rll including its fast paced expansion in branded apparel targeting a doubling of its exclusive brand outlets ebos the company is also positioned to benefit from bangladesh \u003cONE_\u003e and china \u003cONE_\u003e trends in b2b garmenting it said additionally the launch of new categories like innerwear and sleepwear as well as a shift towards casualisation and premiumisation of its product portfolio are expected to contribute to its growth said mosl enhanced sourcing efficiencies due to scale could further improve its operating leverage in recent years raymond group has undertaken strategic initiatives such as demerger of its lifestyle and real estate businesses restructuring of its engineering division and sale of its fmcg business these moves have streamlined the group into distinct listed entities focused on lifestyle real estate and engineering aimed at enhancing shareholder value each business is professionally managed with a focus on maintaining a net cash balance sheet optimising costs and effectively managing working capital despite historically facing challenges related to growth profitability and a high working capital cycle rll has made significant progress the brokerage said adding that it has improved its working capital management achieved a net cash position ahead of schedule and enhanced its pre ifrs ebitda margins through store rationalisation and cost control measures under the leadership of sunil kataria former gcpl executive rlls margins have improved to approximately \u003cONE_TEN_PERCENT\u003e in fy24 up from single digit levels between fy17 and fy20 going forward rll is focused on accelerating growth in branded apparel expanding its network and introducing new categories such as sleepwear and innerwear alongside scaling up its ethnix by raymond brand","timestamp":"2024-10-21T15:02:00+05:30","market_timestamp":"2024-10-21T15:02:00+05:30","off_market_hours":false}