{"url":"https://www.livemint.com/market/stock-market-news/mutual-funds-boost-holding-in-delhivery-to-all-time-high-in-september-quarter-11729076810095.html","title":"Mutual funds boost holding in Delhivery to all-time high in September quarter","description":"In Q2 FY25, mutual funds raised their stake in Delhivery to 24.91%, a rise from 19.05% in June. Notable funds that increased holdings in Delivery include SBI and Mirae Asset. Despite share recovery, Delhivery's stock trades below its IPO price of  ₹487.","content":"Mutual funds significantly increased their stake in Delhivery, a logistics and supply chain services provider, during the second quarter of the current fiscal year (Q2FY25) to an all-time high.As of the end of September 2024, 22 mutual funds collectively held a 24.91% stake in Delhivery, equivalent to 18.43 crore shares. This marks a notable increase from the 19.05% stake held at the close of the previous quarter in June, according to Trendlyne’s shareholding data.Mutual funds have been gradually accumulating shares in Delhivery over time, with the most substantial rise occurring in the recently-concluded quarter. Some of the key mutual funds that raised stakes include SBI Equity Hybrid Fund, which now holds an 8.89% stake in the company, Mirae Asset Large \u0026 Midcap Fund, which owns a 6.13% stake, and HDFC Mid-Cap Opportunities Fund, which has a 3.72% ownership.This increase comes as the Canada Pension Plan Investment Board (CPPIB) completed the sale of its remaining shares in Delhivery during the quarter. CPPIB offloaded its 3.18% stake, or 2.34 crore shares, through multiple block deals in July, generating approximately  ₹910.2 crore.Before Delhivery’s IPO in May 2022, CPPIB had been a major investor, holding about 4.38 crore shares. In April this year, CPPIB sold 2.04 crore shares for  ₹908 crore.As of Q2FY25, foreign institutional investors (FIIs) remained the majority shareholders in Delhivery, holding a 55% stake. The remaining 16.4% ownership is with the general shareholders, Trendlyne data showed.Delhivery's shares have shown a notable recovery in recent months but are still trading below their IPO price of  ₹487. The stock, currently at  ₹408, has seen a decline of 16.22% from the issue price. Domestic brokerage firm Kotak Institutional Equities in its latest note revised the price target on the stock downwards to  ₹500 apiece from the previous target of  ₹560, while maintaining its 'buy' rating.The brokerage adjusted its estimates, factoring in a single-digit year-over-year growth in express parcel volumes for Q2 and Q3, considering the shift of Meesho’s volumes to Valmo during this period.The near-term impact on third-party logistics providers like Delhivery remains uncertain, particularly during the initial stages of Valmo’s entry into the logistics market. This phase might involve absorbing cash burn to either develop new business opportunities or mitigate the potential influence of third-party logistics providers on pricing over time, said the brokerage.Kotak now projects an 8% and 13% year-over-year growth in express parcel volumes for FY2025 and FY2026, respectively. This forecast also considers the impact of quick-commerce models on the e-commerce sector, as Delhivery's rapid delivery service, offering 4 to 6-hour delivery, is still in the early stages of development.The strength of its Q1 print for Express Parcel’s service margin is encouraging, said the brokerage, however, it notes the risk from peers using internal and external proceeds to bring down pricing in the near term to gain relevance in non-Meesho customer sets.In this context, the brokerage noted that the company is likely to focus on expanding gross margins by leveraging improvements in its cost structure rather than implementing price hikes. Additionally, the company aims to maintain strict control over corporate costs, providing further potential for margin enhancement.","cleaned_content":"mutual funds significantly increased their stake in delhivery a logistics and supply chain services provider during the second quarter of the current fiscal year q2fy25 to an all time high as of the end of september \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e mutual funds collectively held a \u003cTWO_TEN_PERCENT\u003e stake in delhivery equivalent to \u003cONE_TEN\u003e crore shares this marks a notable increase from the \u003cONE_TEN_PERCENT\u003e stake held at the close of the previous quarter in june according to trendlyne s shareholding data mutual funds have been gradually accumulating shares in delhivery over time with the most substantial rise occurring in the recently concluded quarter some of the key mutual funds that raised stakes include sbi equity hybrid fund which now holds an \u003cEIGHT_PERCENT\u003e stake in the company mirae asset large midcap fund which owns a \u003cSIX_PERCENT\u003e stake and hdfc mid cap opportunities fund which has a \u003cTHREE_PERCENT\u003e ownership this increase comes as the canada pension plan investment board cppib completed the sale of its remaining shares in delhivery during the quarter cppib offloaded its \u003cTHREE_PERCENT\u003e stake or \u003cTWO_\u003e crore shares through multiple block deals in july generating approximately \u003cNINE_HUNDRED\u003e crore before delhivery s ipo in may \u003cTWO_THOUSAND\u003e cppib had been a major investor holding about \u003cFOUR_\u003e crore shares in april this year cppib sold \u003cTWO_\u003e crore shares for \u003cNINE_HUNDRED\u003e crore as of q2fy25 foreign institutional investors fiis remained the majority shareholders in delhivery holding a \u003cFIVE_TEN_PERCENT\u003e stake the remaining \u003cONE_TEN_PERCENT\u003e ownership is with the general shareholders trendlyne data showed delhiverys shares have shown a notable recovery in recent months but are still trading below their ipo price of \u003cFOUR_HUNDRED\u003e the stock currently at \u003cFOUR_HUNDRED\u003e has seen a decline of \u003cONE_TEN_PERCENT\u003e from the issue price domestic brokerage firm kotak institutional equities in its latest note revised the price target on the stock downwards to \u003cFIVE_HUNDRED\u003e apiece from the previous target of \u003cFIVE_HUNDRED\u003e while maintaining its buy rating the brokerage adjusted its estimates factoring in a single digit year over year growth in express parcel volumes for q2 and q3 considering the shift of meesho s volumes to valmo during this period the near term impact on third party logistics providers like delhivery remains uncertain particularly during the initial stages of valmo s entry into the logistics market this phase might involve absorbing cash burn to either develop new business opportunities or mitigate the potential influence of third party logistics providers on pricing over time said the brokerage kotak now projects an \u003cEIGHT_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e year over year growth in express parcel volumes for fy2025 and fy2026 respectively this forecast also considers the impact of quick commerce models on the e commerce sector as delhiverys rapid delivery service offering \u003cFOUR_\u003e to \u003cSIX_\u003e hour delivery is still in the early stages of development the strength of its q1 print for express parcel s service margin is encouraging said the brokerage however it notes the risk from peers using internal and external proceeds to bring down pricing in the near term to gain relevance in non meesho customer sets in this context the brokerage noted that the company is likely to focus on expanding gross margins by leveraging improvements in its cost structure rather than implementing price hikes additionally the company aims to maintain strict control over corporate costs providing further potential for margin enhancement","timestamp":"2024-10-16T17:33:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}