{"url":"https://www.livemint.com/market/stock-market-news/diwali-2024-stock-picks-ashika-group-recommends-7-stocks-with-up-to-33-upside-11729504647893.html","title":"Diwali 2024 stock picks: Ashika Group recommends 7 stocks with up to 33% upside","description":"Brokerage house Ashika Group has come out with 7 Diwali stock picks that investors can look to buy for up to 33 per cent upside scope.","content":"Brokerage house Ashika Group has released seven stock picks that investors can look to buy this Diwali for up to 33 per cent potential upside.Let's take a look:The brokerage highlighted ONGC’s competitive advantage from its vast proven reserves accumulated over six decades. In FY24, ONGC made nine new discoveries, with five more in Q1 FY25, maintaining a Reserve Replacement Ratio (RRR) above 1 for 18 consecutive years. ONGC’s capex rose 14 per cent to  ₹34,551 crore in FY24, exceeding its target. For FY25 and FY26, it projected an annual capex of  ₹32,000-33,000 crore. ONGC is also advancing key offshore and onshore projects, including the KG Basin and Mumbai High, to boost production and modernise facilities, ensuring sustainable energy growth.The brokerage noted that ONGC expects 10-15 per cent output growth, driven by increased production from the KG DW 98/2 block and other developments like the Daman upside and monetisation of stranded gas reserves. Over the next three years, ONGC projects a 12 per cent growth in crude oil and a 27 per cent growth in natural gas volumes, largely supported by the KG 98/2 project. Additionally, the windfall tax exemption for KG 98/2 and securing premium gas prices are expected to enhance future earnings, alongside improved crude oil realisations and the monetisation of new discoveries.Incorporated in 2008, Kaynes Technology is a leading end-to-end and IoT solutions-enabled integrated electronics manufacturing company. The company provides conceptual design, process engineering, integrated manufacturing, and life-cycle support for major players in the automotive, industrial, aerospace and defence, outer-space, nuclear, medical, railways, Internet of Things (IoT), Information Technology (IT) and other segments.Kaynes holds an order book of  ₹5,040 crore, expecting 60-70 per cent execution within the year. It has secured multi-year contracts and aims to expand its OSAT and PCB businesses, with contributions expected from FY27. The company has signed four MoUs for OSAT and anticipates significant export orders, particularly in the medical sector, with approvals from leading providers in the US and Europe. Kaynes' FY24 performance highlights its execution strength in the EMS sector. Growth in its strong order backlog and new initiatives, alongside partnerships like Globetronics, will drive sustainable growth and enhance its product capabilities.Eris Lifesciences is a domestic branded formulation pharmaceutical company also involved in the biocon business. Recently, it acquired Swiss Parenterals, which reported FY23 revenue of  ₹280 crore with a 37 per cent EBITDA margin. Eris ranks among the top 20 domestic formulation companies in the Indian Pharmaceutical Market (IPM), moving up from 29th since its IPO seven years ago. As of June 2024, it ranks third in the IPM for new product count and value, noted the brokerage.For FY25, the brokerage pointed out that Eris targets a revenue of  ₹3,000 crore, a nearly 49 per cent increase, and an EBITDA margin of 35 per cent. The domestic branded formulation segment aims for  ₹2,600 crore in revenue with a 36 per cent EBITDA margin, supported by a planned  ₹120 crore capex across biotech segments. Eris intends to strengthen its balance sheet by reducing its debt-to-EBITDA ratio to below 2x within 18 months, with expectations of net debt falling below  ₹2,600 crore by FY25 and  ₹2,000 crore by FY26, it added.The brokerage stated that ISGEC is poised for growth, driven by increased government spending, policy reforms, and a revitalised private sector. The company boasts extensive production capabilities across various machinery and equipment, which bolsters its growth potential. As of Q1 FY25, ISGEC's consolidated order book stands at  ₹7,741 crore, with projects accounting for 69 per cent and manufacturing 31 per cent. The company has shifted its strategy to focus on lower-duration projects, moving away from longer-term contracts like Flue Gas Desulfurization (FGD) orders. This strategic pivot aims to improve margins, especially as  ₹1,400-1,500 crore of low-margin legacy orders are executed in FY25, Ashika further stated.With double-digit revenue growth anticipated for the next two years, ISGEC is targeting an EBITDA margin of 11-12 per cent over the next 3-4 years, up from the current 8 per cent. The company's emphasis on sustainability and operational efficiency is expected to enhance its competitive edge, it added.The brokerage highlighted Nazara Technologies as a leading player in the e-sports sector across India and South Asia, mainly through its subsidiary, Nodwin. Nazara has focused on inorganic growth, increasing its stake in Kiddopia to 100%, which is now a top three-grossing app for kids in the US. The recent acquisition of PokerBaazi, India’s largest online poker platform, positions it for rapid growth, with revenue and EBITDA CAGRs of 75% and 100%, respectively, the brokerage said.Additionally, acquisitions of Fusebox, Soap Central, and Deltias Gaming are expected to boost revenue. Strategic partnerships with organisations like ComicCon India further enhance its growth prospects in the evolving gaming and e-sports landscape, said Ashika.The brokerage highlighted that EMS has a strong presence in the electrical contracting sector, focusing on turnkey projects across India. The company specialises in constructing substations and providing EPC services for building and road works. EMS is currently focusing on WWSP and WSSP projects, expanding its capacity from 4 MLD to 60 MLD, and plans to bid on larger projects ranging from  ₹1,500 crore to  ₹2,000 crore.As of Q1 FY25, EMS's order book reached  ₹1,800 crore, supported by a bid pipeline of  ₹4,000 crore. The company projects a revenue growth of 30-35% for FY25, driven by significant opportunities in the sewerage sector, where there is a notable gap in established networks. With a robust order book-to-sales ratio of 3.4x, EMS expects efficient capital utilisation, resulting in lower debt and improved EBITDA margins, it added.The brokerage highlighted that Axiscades Technologies has faced only moderate impacts from the global ER\u0026D industry slowdown, thanks to its strategic focus on diversifying its customer base over the past two years. The company is well-positioned in aerospace and defence, with these sectors contributing about 60% of its revenues. As of Q2 FY25, Axiscades' total order book stands at USD 83 million, bolstered by new deals in engineering services and defence.It further stated that the Mistral segment, which has achieved a 20% CAGR over the last five years, has planned over  ₹800 crore to  ₹1,000 crore for certified prototypes in Indian defence programs. Additionally, it is pursuing design wins with potential future production worth  ₹2,500 crore to  ₹3,000 crore. The order book at the beginning of Q2 FY25 is  ₹375 crore, with 60% scheduled for execution this financial year. The company has also reduced finance costs by repaying  ₹110 crore in borrowings, it noted.","cleaned_content":"brokerage house ashika group has released seven stock picks that investors can look to buy this diwali for up to \u003cTHREE_TEN_PERCENT\u003e potential upside lets take a look the brokerage highlighted ongc s competitive advantage from its vast proven reserves accumulated over six decades in fy24 ongc made nine new discoveries with five more in q1 fy25 maintaining a reserve replacement ratio rrr above \u003cONE_\u003e for \u003cONE_TEN\u003e consecutive years ongc s capex rose \u003cONE_TEN_PERCENT\u003e to \u003cTHREE_TEN_THOUSAND\u003e crore in fy24 exceeding its target for fy25 and fy26 it projected an annual capex of \u003cTHREE_TEN_THOUSAND\u003e \u003cTHREE_TEN_THOUSAND\u003e crore ongc is also advancing key offshore and onshore projects including the kg basin and mumbai high to boost production and modernise facilities ensuring sustainable energy growth the brokerage noted that ongc expects \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e output growth driven by increased production from the kg dw \u003cNINE_TEN\u003e \u003cTWO_\u003e block and other developments like the daman upside and monetisation of stranded gas reserves over the next three years ongc projects a \u003cONE_TEN_PERCENT\u003e growth in crude oil and a \u003cTWO_TEN_PERCENT\u003e growth in natural gas volumes largely supported by the kg \u003cNINE_TEN\u003e \u003cTWO_\u003e project additionally the windfall tax exemption for kg \u003cNINE_TEN\u003e \u003cTWO_\u003e and securing premium gas prices are expected to enhance future earnings alongside improved crude oil realisations and the monetisation of new discoveries incorporated in \u003cTWO_THOUSAND\u003e kaynes technology is a leading end to end and iot solutions enabled integrated electronics manufacturing company the company provides conceptual design process engineering integrated manufacturing and life cycle support for major players in the automotive industrial aerospace and defence outer space nuclear medical railways internet of things iot information technology it and other segments kaynes holds an order book of \u003cFIVE_THOUSAND\u003e crore expecting \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e execution within the year it has secured multi year contracts and aims to expand its osat and pcb businesses with contributions expected from fy27 the company has signed four mous for osat and anticipates significant export orders particularly in the medical sector with approvals from leading providers in the us and europe kaynes fy24 performance highlights its execution strength in the ems sector growth in its strong order backlog and new initiatives alongside partnerships like globetronics will drive sustainable growth and enhance its product capabilities eris lifesciences is a domestic branded formulation pharmaceutical company also involved in the biocon business recently it acquired swiss parenterals which reported fy23 revenue of \u003cTWO_HUNDRED\u003e crore with a \u003cTHREE_TEN_PERCENT\u003e ebitda margin eris ranks among the top \u003cTWO_TEN\u003e domestic formulation companies in the indian pharmaceutical market ipm moving up from \u003cTWO_TEN\u003e th since its ipo seven years ago as of june \u003cTWO_THOUSAND\u003e it ranks third in the ipm for new product count and value noted the brokerage for fy25 the brokerage pointed out that eris targets a revenue of \u003cTHREE_THOUSAND\u003e crore a nearly \u003cFOUR_TEN_PERCENT\u003e increase and an ebitda margin of \u003cTHREE_TEN_PERCENT\u003e the domestic branded formulation segment aims for \u003cTWO_THOUSAND\u003e crore in revenue with a \u003cTHREE_TEN_PERCENT\u003e ebitda margin supported by a planned \u003cONE_HUNDRED\u003e crore capex across biotech segments eris intends to strengthen its balance sheet by reducing its debt to ebitda ratio to below \u003cTWO_\u003e x within \u003cONE_TEN\u003e months with expectations of net debt falling below \u003cTWO_THOUSAND\u003e crore by fy25 and \u003cTWO_THOUSAND\u003e crore by fy26 it added the brokerage stated that isgec is poised for growth driven by increased government spending policy reforms and a revitalised private sector the company boasts extensive production capabilities across various machinery and equipment which bolsters its growth potential as of q1 fy25 isgecs consolidated order book stands at \u003cSEVEN_THOUSAND\u003e crore with projects accounting for \u003cSIX_TEN_PERCENT\u003e and manufacturing \u003cTHREE_TEN_PERCENT\u003e the company has shifted its strategy to focus on lower duration projects moving away from longer term contracts like flue gas desulfurization fgd orders this strategic pivot aims to improve margins especially as \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e crore of low margin legacy orders are executed in fy25 ashika further stated with double digit revenue growth anticipated for the next two years isgec is targeting an ebitda margin of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e over the next \u003cTHREE_\u003e \u003cFOUR_\u003e years up from the current \u003cEIGHT_PERCENT\u003e the companys emphasis on sustainability and operational efficiency is expected to enhance its competitive edge it added the brokerage highlighted nazara technologies as a leading player in the e sports sector across india and south asia mainly through its subsidiary nodwin nazara has focused on inorganic growth increasing its stake in kiddopia to \u003cONE_HUNDRED_PERCENT\u003e which is now a top three grossing app for kids in the us the recent acquisition of pokerbaazi india s largest online poker platform positions it for rapid growth with revenue and ebitda cagrs of \u003cSEVEN_TEN_PERCENT\u003e and \u003cONE_HUNDRED_PERCENT\u003e respectively the brokerage said additionally acquisitions of fusebox soap central and deltias gaming are expected to boost revenue strategic partnerships with organisations like comiccon india further enhance its growth prospects in the evolving gaming and e sports landscape said ashika the brokerage highlighted that ems has a strong presence in the electrical contracting sector focusing on turnkey projects across india the company specialises in constructing substations and providing epc services for building and road works ems is currently focusing on wwsp and wssp projects expanding its capacity from \u003cFOUR_\u003e mld to \u003cSIX_TEN\u003e mld and plans to bid on larger projects ranging from \u003cONE_THOUSAND\u003e crore to \u003cTWO_THOUSAND\u003e crore as of q1 fy25 emss order book reached \u003cONE_THOUSAND\u003e crore supported by a bid pipeline of \u003cFOUR_THOUSAND\u003e crore the company projects a revenue growth of \u003cTHREE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e for fy25 driven by significant opportunities in the sewerage sector where there is a notable gap in established networks with a robust order book to sales ratio of \u003cTHREE_\u003e x ems expects efficient capital utilisation resulting in lower debt and improved ebitda margins it added the brokerage highlighted that axiscades technologies has faced only moderate impacts from the global er d industry slowdown thanks to its strategic focus on diversifying its customer base over the past two years the company is well positioned in aerospace and defence with these sectors contributing about \u003cSIX_TEN_PERCENT\u003e of its revenues as of q2 fy25 axiscades total order book stands at usd \u003cEIGHT_TEN\u003e million bolstered by new deals in engineering services and defence it further stated that the mistral segment which has achieved a \u003cTWO_TEN_PERCENT\u003e cagr over the last five years has planned over \u003cEIGHT_HUNDRED\u003e crore to \u003cONE_THOUSAND\u003e crore for certified prototypes in indian defence programs additionally it is pursuing design wins with potential future production worth \u003cTWO_THOUSAND\u003e crore to \u003cTHREE_THOUSAND\u003e crore the order book at the beginning of q2 fy25 is \u003cTHREE_HUNDRED\u003e crore with \u003cSIX_TEN_PERCENT\u003e scheduled for execution this financial year the company has also reduced finance costs by repaying \u003cONE_HUNDRED\u003e crore in borrowings it noted","timestamp":"2024-10-21T16:47:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}