{"url":"https://www.livemint.com/market/stock-market-news/fpi-selling-in-october-financial-services-oil-gas-auto-sectors-hit-the-hardest-so-far-11729231422504.html","title":"FPI Exodus in October: Financial Services, Oil \u0026 Gas, Auto sectors hit the hardest so far","description":"FPIs sold  ₹66,301 crore in Indian stocks during the first half of October, with the Financial Services, Oil \u0026 Gas, and Automobile sectors experiencing the most pronounced impact.","content":"Foreign Portfolio Investors (FPIs) have been persistently offloading Indian equities throughout October, shifting focus towards more affordable markets, such as China. As of October 17, FPI outflows from the Indian stock market have reached a substantial  ₹70,398 crore (approximately $8.38 billion), following robust inflows of  ₹57,724 crore in the preceding month.This significant selling pressure has driven the Nifty 50 down by more than 1,700 points from its record high, which was achieved at the end of September.The shift in FPI sentiment stems from a combination of factors, including China's recent monetary and fiscal stimulus aimed at reviving its slowing economy. Additionally, the relatively high valuations of Indian equities, alongside rising geopolitical tensions in the Middle East, have further accelerated FPI outflows.During the first half of October, FPIs have divested  ₹66,301 crore in Indian stocks, with the Financial Services, Oil \u0026 Gas, and Automobile sectors experiencing the most pronounced impact.Here are top sectors that FPIs bought and sold the most in the first half of October 2024:The Financial Services sector experienced the highest FPI outflows from October 1 to 15, amounting to  ₹23,283 crore. This marks a stark reversal from September, when FPIs invested  ₹27,200 crore in the financial services sector, following outflows of  ₹12,008 crore in August and  ₹7,648 crore in July, according to data from the National Securities Depository Ltd. (NSDL).The Oil, Gas \u0026 Consumable Fuels sector also witnessed significant outflows, with FPIs withdrawing  ₹12,371 crore in the first half of October. The Automobile and Auto Components sector followed with  ₹8,131 crore worth of FPI selling. The auto sector has been facing sustained bearish sentiment, having recorded outflows of  ₹2,106 crore in September and  ₹2,379 crore in August, NSDL data showed.Other sectors hit by heavy FPI outflows in the first fortnight of October include Fast-Moving Consumer Goods (FMCG) with  ₹6,818 crore in outflows, and the Consumer Services sector with  ₹4,633 crore. Additionally, the Information Technology (IT) sector recorded outflows of  ₹2,727 crore, followed by the Power sector at  ₹2,678 crore, and Healthcare at  ₹2,376 crore.FPIs also pulled out  ₹1,723 crore from the Construction sector,  ₹1,603 crore from Telecommunications, and  ₹1,426 crore from Construction Materials during this period.During the first half of October, no significant FPI inflows were observed across most sectors. However, the Chemicals sector saw the highest inflows, with overseas investors purchasing  ₹552 crore worth of shares between October 1-15, per NSDL data.The Metals \u0026 Mining sector attracted modest FPI inflows of  ₹222 crore, while the Utilities sector received inflows amounting to  ₹127 crore during the same period. Despite these pockets of buying, overall FPI activity remained largely tilted towards selling.","cleaned_content":"foreign portfolio investors fpis have been persistently offloading indian equities throughout october shifting focus towards more affordable markets such as china as of october \u003cONE_TEN\u003e fpi outflows from the indian stock market have reached a substantial \u003cSEVEN_TEN_THOUSAND\u003e crore approximately \u003cEIGHT_\u003e billion following robust inflows of \u003cFIVE_TEN_THOUSAND\u003e crore in the preceding month this significant selling pressure has driven the nifty \u003cFIVE_TEN\u003e down by more than \u003cONE_THOUSAND\u003e points from its record high which was achieved at the end of september the shift in fpi sentiment stems from a combination of factors including chinas recent monetary and fiscal stimulus aimed at reviving its slowing economy additionally the relatively high valuations of indian equities alongside rising geopolitical tensions in the middle east have further accelerated fpi outflows during the first half of october fpis have divested \u003cSIX_TEN_THOUSAND\u003e crore in indian stocks with the financial services oil gas and automobile sectors experiencing the most pronounced impact here are top sectors that fpis bought and sold the most in the first half of october \u003cTWO_THOUSAND\u003e the financial services sector experienced the highest fpi outflows from october \u003cONE_\u003e to \u003cONE_TEN\u003e amounting to \u003cTWO_TEN_THOUSAND\u003e crore this marks a stark reversal from september when fpis invested \u003cTWO_TEN_THOUSAND\u003e crore in the financial services sector following outflows of \u003cONE_TEN_THOUSAND\u003e crore in august and \u003cSEVEN_THOUSAND\u003e crore in july according to data from the national securities depository ltd nsdl the oil gas consumable fuels sector also witnessed significant outflows with fpis withdrawing \u003cONE_TEN_THOUSAND\u003e crore in the first half of october the automobile and auto components sector followed with \u003cEIGHT_THOUSAND\u003e crore worth of fpi selling the auto sector has been facing sustained bearish sentiment having recorded outflows of \u003cTWO_THOUSAND\u003e crore in september and \u003cTWO_THOUSAND\u003e crore in august nsdl data showed other sectors hit by heavy fpi outflows in the first fortnight of october include fast moving consumer goods fmcg with \u003cSIX_THOUSAND\u003e crore in outflows and the consumer services sector with \u003cFOUR_THOUSAND\u003e crore additionally the information technology it sector recorded outflows of \u003cTWO_THOUSAND\u003e crore followed by the power sector at \u003cTWO_THOUSAND\u003e crore and healthcare at \u003cTWO_THOUSAND\u003e crore fpis also pulled out \u003cONE_THOUSAND\u003e crore from the construction sector \u003cONE_THOUSAND\u003e crore from telecommunications and \u003cONE_THOUSAND\u003e crore from construction materials during this period during the first half of october no significant fpi inflows were observed across most sectors however the chemicals sector saw the highest inflows with overseas investors purchasing \u003cFIVE_HUNDRED\u003e crore worth of shares between october \u003cONE_\u003e \u003cONE_TEN\u003e per nsdl data the metals mining sector attracted modest fpi inflows of \u003cTWO_HUNDRED\u003e crore while the utilities sector received inflows amounting to \u003cONE_HUNDRED\u003e crore during the same period despite these pockets of buying overall fpi activity remained largely tilted towards selling","timestamp":"2024-10-18T11:46:00+05:30","market_timestamp":"2024-10-18T11:46:00+05:30","off_market_hours":false}