{"url":"https://www.livemint.com/market/stock-market-news/forecasts-for-a-20-brazil-stock-rally-ruined-by-high-rates-11729533693543.html","title":"Forecasts for a 20% Brazil Stock Rally Ruined by High Rates","description":"The start of the Federal Reserve’s easing cycle was supposed to be the long-awaited catalyst to ignite a rally in Brazil’s stocks.","content":"The start of the Federal Reserve’s easing cycle was supposed to be the long-awaited catalyst to ignite a rally in Brazil’s stocks.Banco Santander’s local unit predicted the Ibovespa gauge would rally almost 20% this year. Analysts at Bradesco BBI saw similar gains. Bank of America favored Brazil over Mexico amid estimates for slowing US growth, while Banco Itau BBA forecast a banner year on the back of attractive valuations and earnings growth.Instead, Brazilian equities have been among the world’s worst performers, sending one valuation measure to the lowest among major stock indexes and near the lowest relative to the emerging-market benchmark in more than a decade. They’re trailing far behind most peers, beaten down by a government that’s blown out the budget deficit and forced policymakers into a hawkish stance to contain inflation expectations. Higher interest rates — the 10.75% benchmark is more than double the Fed’s target — are pushing investors away from stocks and into government bonds that promise double-digit returns with little risk.“Higher interest rates in Brazil are going to keep local investors on the sidelines,” said Josh Rubin, a portfolio manager at Thornburg Investment Management. “There’s no reason to go buy equities.”The Ibovespa has lost 2.7% this year, among the 10 worst performances in the world, but the losses are even bigger in dollar terms: a whopping 17% plunge. That’s even as the MSCI Emerging Markets Index advanced 16% when factoring in dividends and the S\u0026P 500 Index returned more than 22%.The market dynamic is set to continue, with traders betting on at least 2 percentage points of additional rate hikes in Brazil this year even as they predict the Fed will cut at least half a point. Brazil is one of the only major central banks in the world in the midst of a hiking cycle; the vast majority of its global counterparts are reducing borrowing costs. Brazil analysts raised their 2025 year-end interest rate forecasts for the second straight week, according to a weekly central bank survey published Monday.“Stocks are very cheap and it’s been like this for a long time,” said Nikolaj Lippmann, Morgan Stanley’s chief Latin American equity strategist. “It’s probably going to remain like this until we find a way to get interest rates down.”The Ibovespa trades at about 7.7 times estimated earnings, compared with a ratio of 12.2 for the MSCI gauge of emerging-market stocks. The discount for Brazilian equities reached the biggest in at least 10 years in June — approaching 5.3 points — though it has since narrowed.Local investors and foreigners seem equally pessimistic. Domestic funds have slashed their equity allocations to 8.6%, near the lowest in seven years, according to data compiled by Bank of America. Meanwhile, foreigners pulled 1.6 billion reais from the stock market in September and another 2.06 billion reais so far this month. Domestic stocks have seen foreign outflows for eight out of 10 months so far this year.“Foreign investors get tired of volatility, and Brazil has literally become a big casino,” said Daniela Da Costa-Bulthuis, a Rotterdam-based portfolio manager who helps oversee 200 billion euros at Robeco Institutional Asset Management. “Economic policy is not consistent and the market is very risky and short-term oriented.”Adding to the gloomy mood, what would have been Brazil’s first initial public offering in three years flopped this month. Moove Lubricants Holdings, a subsidiary of Brazilian conglomerate Cosan SA, cited “adverse market conditions” in calling off the sale.It’s a frustrating turn for analysts and strategists who were bullish on Brazil at the beginning of the year, predicting the Fed’s rate cuts would send investors to emerging markets in search of higher returns. But since US policymakers started easing in September, Brazilian equities have lagged behind. The Ibovespa is down 2.4% since the first Fed cut, compared with an 6.2% advance for the emerging-market benchmark.President Luiz Inacio Lula da Silva is doing little to bolster investor confidence. His administration has increased outlays and dragged its feet on budget overhauls that would shore up the fiscal position. The profligate spending has boosted the budget deficit to the equivalent of about 10% of Brazil’s gross domestic product, and fueled inflation that analysts predict will exceed the central bank’s 3% target through 2027.At Santander, optimism toward Brazilian equities remains. Aline Cardoso, head of equity research at the local unit, said stimulus from China and falling interest rates in the US should eventually lift the domestic market. That recovery depends on the government avoiding “fiscal rupture” while adopting measures that slow spending, she said early in October.Amid the gloom, investors have been ditching stocks and hedge funds and turned to parking their money in fixed income instruments. The CDI interbank reference rate, used by Brazilian investors as a benchmark for risk-free yields, has returned 8.6% this year.Ben Laidler, Bradesco BBI’s head of equity strategy, says that Brazil has fantastic companies with impressive earnings growth, and the cheap valuations are another draw.But ultimately, high rates are holding the stock market back.“The fact that Brazil is the only major economy in the planet raising interest rates stops people from buying,” he said. The government’s fiscal “policy makes interest rates go up. You take that away, and I think money comes into Brazil very quickly.”This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"the start of the federal reserve s easing cycle was supposed to be the long awaited catalyst to ignite a rally in brazil s stocks banco santander s local unit predicted the ibovespa gauge would rally almost \u003cTWO_TEN_PERCENT\u003e this year analysts at bradesco bbi saw similar gains bank of america favored brazil over mexico amid estimates for slowing us growth while banco itau bba forecast a banner year on the back of attractive valuations and earnings growth instead brazilian equities have been among the world s worst performers sending one valuation measure to the lowest among major stock indexes and near the lowest relative to the emerging market benchmark in more than a decade they re trailing far behind most peers beaten down by a government that s blown out the budget deficit and forced policymakers into a hawkish stance to contain inflation expectations higher interest rates the \u003cONE_TEN_PERCENT\u003e benchmark is more than double the fed s target are pushing investors away from stocks and into government bonds that promise double digit returns with little risk higher interest rates in brazil are going to keep local investors on the sidelines said josh rubin a portfolio manager at thornburg investment management there s no reason to go buy equities the ibovespa has lost \u003cTWO_PERCENT\u003e this year among the \u003cONE_TEN\u003e worst performances in the world but the losses are even bigger in dollar terms a whopping \u003cONE_TEN_PERCENT\u003e plunge that s even as the msci emerging markets index advanced \u003cONE_TEN_PERCENT\u003e when factoring in dividends and the s p \u003cFIVE_HUNDRED\u003e index returned more than \u003cTWO_TEN_PERCENT\u003e the market dynamic is set to continue with traders betting on at least \u003cTWO_PERCENT\u003e age points of additional rate hikes in brazil this year even as they predict the fed will cut at least half a point brazil is one of the only major central banks in the world in the midst of a hiking cycle the vast majority of its global counterparts are reducing borrowing costs brazil analysts raised their \u003cTWO_THOUSAND\u003e year end interest rate forecasts for the second straight week according to a weekly central bank survey published monday stocks are very cheap and it s been like this for a long time said nikolaj lippmann morgan stanley s chief latin american equity strategist it s probably going to remain like this until we find a way to get interest rates down the ibovespa trades at about \u003cSEVEN_\u003e times estimated earnings compared with a ratio of \u003cONE_TEN\u003e for the msci gauge of emerging market stocks the discount for brazilian equities reached the biggest in at least \u003cONE_TEN\u003e years in june approaching \u003cFIVE_\u003e points though it has since narrowed local investors and foreigners seem equally pessimistic domestic funds have slashed their equity allocations to \u003cEIGHT_PERCENT\u003e near the lowest in seven years according to data compiled by bank of america meanwhile foreigners pulled \u003cONE_\u003e billion reais from the stock market in september and another \u003cTWO_\u003e billion reais so far this month domestic stocks have seen foreign outflows for eight out of \u003cONE_TEN\u003e months so far this year foreign investors get tired of volatility and brazil has literally become a big casino said daniela da costa bulthuis a rotterdam based portfolio manager who helps oversee \u003cTWO_HUNDRED\u003e billion euros at robeco institutional asset management economic policy is not consistent and the market is very risky and short term oriented adding to the gloomy mood what would have been brazil s first initial public offering in three years flopped this month moove lubricants holdings a subsidiary of brazilian conglomerate cosan sa cited adverse market conditions in calling off the sale it s a frustrating turn for analysts and strategists who were bullish on brazil at the beginning of the year predicting the fed s rate cuts would send investors to emerging markets in search of higher returns but since us policymakers started easing in september brazilian equities have lagged behind the ibovespa is down \u003cTWO_PERCENT\u003e since the first fed cut compared with an \u003cSIX_PERCENT\u003e advance for the emerging market benchmark president luiz inacio lula da silva is doing little to bolster investor confidence his administration has increased outlays and dragged its feet on budget overhauls that would shore up the fiscal position the profligate spending has boosted the budget deficit to the equivalent of about \u003cONE_TEN_PERCENT\u003e of brazil s gross domestic product and fueled inflation that analysts predict will exceed the central bank s \u003cTHREE_PERCENT\u003e target through \u003cTWO_THOUSAND\u003e at santander optimism toward brazilian equities remains aline cardoso head of equity research at the local unit said stimulus from china and falling interest rates in the us should eventually lift the domestic market that recovery depends on the government avoiding fiscal rupture while adopting measures that slow spending she said early in october amid the gloom investors have been ditching stocks and hedge funds and turned to parking their money in fixed income instruments the cdi interbank reference rate used by brazilian investors as a benchmark for risk free yields has returned \u003cEIGHT_PERCENT\u003e this year ben laidler bradesco bbi s head of equity strategy says that brazil has fantastic companies with impressive earnings growth and the cheap valuations are another draw but ultimately high rates are holding the stock market back the fact that brazil is the only major economy in the planet raising interest rates stops people from buying he said the government s fiscal policy makes interest rates go up you take that away and i think money comes into brazil very quickly this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-21T23:31:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}