{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-dharmesh-shah-of-icici-securities-recommends-buying-bank-of-baroda-nalco-tomorrow-11729353900819.html","title":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying Bank of Baroda, NALCO today","description":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying Bank of Baroda, and National Aluminium Company Ltd (NALCO) this week.","content":"Stock Market News: The new trading week kicked off with gains in the domestic benchmark indices, with both Nifty 50 and Sensex posting strong gains on Monday.Starting at 24,956.15 points, the Nifty 50 index saw a 0.41% increase of 102.10 points, while the BSE Sensex opened at 81,770.02 points, marking a surge of 545 points or 0.67%.Analysts emphasized that this week's focus will be on the quarterly financial results announcements and the ongoing activity of foreign investors.Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, mentioned that the Chinese stimulus and the low valuations of Chinese stocks have the potential to maintain the 'Sell India, Buy China' tactical trade for a while longer, offering an opportunity for medium to long-term investors. The continuous selling by foreign institutional investors (FIIs) has made financial valuations attractive in an otherwise overvalued market. Furthermore, the financial sector is performing well and is in good shape.On Friday, the domestic benchmark indices, Sensex and Nifty 50, closed higher, recovering from the losses incurred during the opening session.By the close of the trading day, the Nifty 50 had gained 104 points or 0.42%, ending at 24,854.05. The Sensex ended at 81,224.75, showing an increase of 218.14 points or 0.27%. Both indices saw a decrease of 0.44% and 0.19%, respectively, for the third consecutive week, which was attributed to disappointing corporate earnings and foreign investors exiting the Indian market.Following the morning sell-off, Vinod Nair, Head of Research at Geojit Financial Services, noted that the market rebounded from the oversold level due to selective buying in financials, auto, and metals stocks. Positive initial results from private banks have created an expectation for optimistic upcoming financial results this weekend. The metals sector also showed strong performance, benefiting from a slightly better-than-expected growth in China’s Q3 GDP. Rate sensitive stocks were supported by consecutive rate cuts from the European Central Bank (ECB).Market experts anticipate that crucial domestic and global economic indicators, such as India's Nikkei S\u0026P Global Manufacturing PMI and Services PMI for October, as well as India's RBI MPC Meeting Minutes, along with US Initial Jobless Claims, Manufacturing PMI, Services PMI, and S\u0026P Global Composite PMI for October, and UK Composite PMI for October, will play a significant role in determining the market's trajectory.The benchmark extended losses over third consecutive week despite positive global cues. Nifty 50 settled the week at 24,854, down 0.4%. Friday’s up move helped index to recover some of intraday-week losses and settled the week on a flat to negative note. As a result, weekly price action formed a small bear candle with shadows on either side, indicating extended consolidation amid stock specific action. Key point to highlight is that, Nifty 50 managed to hold the key support of 24,700 amid oversold conditions, indicating impending pullback on expected lineGoing forward, we expect Nifty 50 to hold the key support threshold of 24,700 and challenge the upper band of consolidation placed at 25,200, that would eventually open the door for next leg of up move towards 25,500 in coming weeksStructurally, current 7% correction has made the market more healthy as most of the Nifty 50 constituents have approached their key long term averages which offers favourable risk reward set up. In a bull market, 7-10% correction is a common phenomenon. Buying in such scenario have been fruitful from medium term perspective.Hence, accumulating quality large caps would be the prudent strategy to adopt amid ongoing earning season. Our positive bias is further validated by following observations:A. The ratio chart of Bank Nifty / Nifty 50 has resolved higher after forming base at long term cycle lows. As a result, Bank Nifty managed to hold last week’s low amid elevated volatility and eventually gained ~2% during the week, highlighting inherent strength. We believe, the revival in Banking stocks would provide impetus for pullback rally in Nifty 50 as Bank Nifty carries 32% weightage in Nifty 50B. The breakout from 2 and half year’s consolidation in Russell 2000 index signifies broader participation that bodes well continuation of ongoing bull run on ahead of US election and further rate cut expectationC. Crude oil price have dropped 5% after facing stiff resistance in 80-82 zone. In upcoming weeks, we expect it to consolidate in 72-80 range1. Buy Bank of Baroda in the range of  ₹243-248 for the target of  ₹265 with a stop loss of  ₹235.2. Buy National Aluminium Company Ltd (NALCO) in the range of  ₹226-232 target  ₹248 stop loss  ₹219.The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and individual circumstances may vary.","cleaned_content":"stock market news the new trading week kicked off with gains in the domestic benchmark indices with both nifty \u003cFIVE_TEN\u003e and sensex posting strong gains on monday starting at \u003cTWO_TEN_THOUSAND\u003e points the nifty \u003cFIVE_TEN\u003e index saw a \u003cZERO_PERCENT\u003e increase of \u003cONE_HUNDRED\u003e points while the bse sensex opened at \u003cEIGHT_TEN_THOUSAND\u003e points marking a surge of \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e analysts emphasized that this weeks focus will be on the quarterly financial results announcements and the ongoing activity of foreign investors dr v k vijayakumar chief investment strategist at geojit financial services mentioned that the chinese stimulus and the low valuations of chinese stocks have the potential to maintain the sell india buy china tactical trade for a while longer offering an opportunity for medium to long term investors the continuous selling by foreign institutional investors fiis has made financial valuations attractive in an otherwise overvalued market furthermore the financial sector is performing well and is in good shape on friday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e closed higher recovering from the losses incurred during the opening session by the close of the trading day the nifty \u003cFIVE_TEN\u003e had gained \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e ending at \u003cTWO_TEN_THOUSAND\u003e the sensex ended at \u003cEIGHT_TEN_THOUSAND\u003e showing an increase of \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e both indices saw a decrease of \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively for the third consecutive week which was attributed to disappointing corporate earnings and foreign investors exiting the indian market following the morning sell off vinod nair head of research at geojit financial services noted that the market rebounded from the oversold level due to selective buying in financials auto and metals stocks positive initial results from private banks have created an expectation for optimistic upcoming financial results this weekend the metals sector also showed strong performance benefiting from a slightly better than expected growth in china s q3 gdp rate sensitive stocks were supported by consecutive rate cuts from the european central bank ecb market experts anticipate that crucial domestic and global economic indicators such as indias nikkei s p global manufacturing pmi and services pmi for october as well as indias rbi mpc meeting minutes along with us initial jobless claims manufacturing pmi services pmi and s p global composite pmi for october and uk composite pmi for october will play a significant role in determining the markets trajectory the benchmark extended losses over third consecutive week despite positive global cues nifty \u003cFIVE_TEN\u003e settled the week at \u003cTWO_TEN_THOUSAND\u003e down \u003cZERO_PERCENT\u003e friday s up move helped index to recover some of intraday week losses and settled the week on a flat to negative note as a result weekly price action formed a small bear candle with shadows on either side indicating extended consolidation amid stock specific action key point to highlight is that nifty \u003cFIVE_TEN\u003e managed to hold the key support of \u003cTWO_TEN_THOUSAND\u003e amid oversold conditions indicating impending pullback on expected line going forward we expect nifty \u003cFIVE_TEN\u003e to hold the key support threshold of \u003cTWO_TEN_THOUSAND\u003e and challenge the upper band of consolidation placed at \u003cTWO_TEN_THOUSAND\u003e that would eventually open the door for next leg of up move towards \u003cTWO_TEN_THOUSAND\u003e in coming weeks structurally current \u003cSEVEN_PERCENT\u003e correction has made the market more healthy as most of the nifty \u003cFIVE_TEN\u003e constituents have approached their key long term averages which offers favourable risk reward set up in a bull market \u003cSEVEN_\u003e \u003cONE_TEN_PERCENT\u003e correction is a common phenomenon buying in such scenario have been fruitful from medium term perspective hence accumulating quality large caps would be the prudent strategy to adopt amid ongoing earning season our positive bias is further validated by following observations a the ratio chart of bank nifty nifty \u003cFIVE_TEN\u003e has resolved higher after forming base at long term cycle lows as a result bank nifty managed to hold last week s low amid elevated volatility and eventually gained \u003cTWO_PERCENT\u003e during the week highlighting inherent strength we believe the revival in banking stocks would provide impetus for pullback rally in nifty \u003cFIVE_TEN\u003e as bank nifty carries \u003cTHREE_TEN_PERCENT\u003e weightage in nifty \u003cFIVE_TEN\u003e b the breakout from \u003cTWO_\u003e and half year s consolidation in russell \u003cTWO_THOUSAND\u003e index signifies broader participation that bodes well continuation of ongoing bull run on ahead of us election and further rate cut expectationc crude oil price have dropped \u003cFIVE_PERCENT\u003e after facing stiff resistance in \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN\u003e zone in upcoming weeks we expect it to consolidate in \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e range1 buy bank of baroda in the range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e for the target of \u003cTWO_HUNDRED\u003e with a stop loss of \u003cTWO_HUNDRED\u003e buy national aluminium company ltd nalco in the range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e target \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e the views and recommendations provided in this analysis are those of individual analysts or broking companies not mint we strongly advise investors to consult with certified experts before making any investment decisions as market conditions can change rapidly and individual circumstances may vary","timestamp":"2024-10-21T10:00:00+05:30","market_timestamp":"2024-10-21T10:00:00+05:30","off_market_hours":false}