{"url":"https://www.livemint.com/market/stock-market-news/fo-strategy-buy-icici-bank-hindalco-usha-martin-suggests-rupak-de-as-indian-stock-market-gives-up-initial-gains-11729488514636.html","title":"F\u0026O Strategy: Buy ICICI Bank, Hindalco, Usha Martin, suggests Rupak De as Indian stock market gives up initial gains","description":"F\u0026O Strategy: Technical views on F\u0026O market by Rupak De, Senior Technical Analyst, LKP Securities. De suggests buying ICICI Bank, Hindalco Industries Ltd, and Usha Martin Ltd.","content":"Stock Market News: Monday's session saw the Nifty 50 and Sensex giving up their early gains, as profit-booking across the board outweighed a post-results rally in HDFC Bank, the top private lender. As of 11:32 IST, the Nifty 50 dropped 0.26% to 24,790.30 points, while the Sensex declined 0.24% to 81,040.47 points. Both indices had initially gained about 0.4% near the open.This week will mainly center around the release of quarterly financial results and the continued involvement of foreign investors, as highlighted by analysts.According to technical analysts in the derivatives segment, foreign institutional investors (FIIs) continue to hold short positions in the index futures. Their long-short ratio is currently around 33.5%. In the options segment, the 25,000 call option has seen the highest open interest buildup in the weekly series, which is the immediate hurdle, followed by the 25,200-25,250 range. On the flipside, 24,600-24,500 is the near-term support zone. Analysts, expect the index to oscillate within this range in the short term. A breakout beyond these boundaries will lead to the next directional move.Technical views by Rupak De, Senior Technical Analyst, LKP Securities on F\u0026O marketFor Bank Nifty the last expiry date was Wednesday, October 16. The Bank Nifty has moved above its previous swing high on the hourly chart, indicating growing optimism in the near to short term. The index has also risen above the 50 EMA, signalling a positive trend ahead. On the upside, a decisive move above 52,100 could lead to a rally toward 52,580/52,850. On the downside, support is seen at 51,700, and a break below this level could trigger a decline.Open Interest Analysis: CALL unwinding at various strikes were visible on Friday; while significant Put writing was visible at 51,500 indicating strong support for the short term at 51,500. Maximum CALL open interest is seen at 53,000 and maximum PUT open interest was seen at the 51,500 strike, indicating the broader range for the near term. Overall, the CALL writers seen marginally outnumbering PUT writers in the weekly expiry.For Nifty 50 the last expiry date was Thursday, October 17. The Nifty 50 has witnessed a sharp rise after hitting a panic bottom near 24,570, unable to stay below the 24,700 mark. A positive divergence on the hourly RSI (14) points to a shift toward stronger price momentum. The immediate hurdle now is at 24,900, a level that previously served as support. If the Nifty 50 manages to break above this, it could spark a short-term rally and as long as it holds above 24,750, the trend is expected to remain strong.Open Interest Analysis:PUT writing was significant at 24,700 strike on the first day of the new expiry; while CALL writing activities was visible at 24,900. Maximum CALL and PUT open interest position was seen at the 25,000 and 24,500 strikes respectively, indicating a broader range for the Nifty 50. CALL writers seen outnumbering PUT writers in the weekly expiry.The stock has surpassed its recent high and created a bullish engulfing pattern on the daily chart. It has also re-entered the upward channel on the daily timeframe, with the RSI indicating a bullish crossover. In the short term, the stock may move towards 1,300/1,340, while support is placed at 1,224 on the lower end.The stock has remained above its previous swing high on the daily chart. A downward consolidation breakout on the daily timeframe has helped drive the recent price increase. The momentum is expected to stay strong in the short term, with potential upside toward 784. On the downside, support is placed at 734.The share price of Usha Martin has broken out of a consolidation pattern on the hourly chart, suggesting growing bullish interest in the stock. Furthermore, the stock has stayed above the 50 EMA on the hourly chart, indicating a strong trend in the short term. On the upside, it may move towards 450, with support placed at 420.","cleaned_content":"stock market news mondays session saw the nifty \u003cFIVE_TEN\u003e and sensex giving up their early gains as profit booking across the board outweighed a post results rally in hdfc bank the top private lender as of \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e ist the nifty \u003cFIVE_TEN\u003e dropped \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e points while the sensex declined \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e points both indices had initially gained about \u003cZERO_PERCENT\u003e near the open this week will mainly center around the release of quarterly financial results and the continued involvement of foreign investors as highlighted by analysts according to technical analysts in the derivatives segment foreign institutional investors fiis continue to hold short positions in the index futures their long short ratio is currently around \u003cTHREE_TEN_PERCENT\u003e in the options segment the \u003cTWO_TEN_THOUSAND\u003e call option has seen the highest open interest buildup in the weekly series which is the immediate hurdle followed by the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range on the flipside \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is the near term support zone analysts expect the index to oscillate within this range in the short term a breakout beyond these boundaries will lead to the next directional move technical views by rupak de senior technical analyst lkp securities on f o marketfor bank nifty the last expiry date was wednesday october \u003cONE_TEN\u003e the bank nifty has moved above its previous swing high on the hourly chart indicating growing optimism in the near to short term the index has also risen above the \u003cFIVE_TEN\u003e ema signalling a positive trend ahead on the upside a decisive move above \u003cFIVE_TEN_THOUSAND\u003e could lead to a rally toward \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e on the downside support is seen at \u003cFIVE_TEN_THOUSAND\u003e and a break below this level could trigger a decline open interest analysis call unwinding at various strikes were visible on friday while significant put writing was visible at \u003cFIVE_TEN_THOUSAND\u003e indicating strong support for the short term at \u003cFIVE_TEN_THOUSAND\u003e maximum call open interest is seen at \u003cFIVE_TEN_THOUSAND\u003e and maximum put open interest was seen at the \u003cFIVE_TEN_THOUSAND\u003e strike indicating the broader range for the near term overall the call writers seen marginally outnumbering put writers in the weekly expiry for nifty \u003cFIVE_TEN\u003e the last expiry date was thursday october \u003cONE_TEN\u003e the nifty \u003cFIVE_TEN\u003e has witnessed a sharp rise after hitting a panic bottom near \u003cTWO_TEN_THOUSAND\u003e unable to stay below the \u003cTWO_TEN_THOUSAND\u003e mark a positive divergence on the hourly rsi \u003cONE_TEN\u003e points to a shift toward stronger price momentum the immediate hurdle now is at \u003cTWO_TEN_THOUSAND\u003e a level that previously served as support if the nifty \u003cFIVE_TEN\u003e manages to break above this it could spark a short term rally and as long as it holds above \u003cTWO_TEN_THOUSAND\u003e the trend is expected to remain strong open interest analysis put writing was significant at \u003cTWO_TEN_THOUSAND\u003e strike on the first day of the new expiry while call writing activities was visible at \u003cTWO_TEN_THOUSAND\u003e maximum call and put open interest position was seen at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strikes respectively indicating a broader range for the nifty \u003cFIVE_TEN\u003e call writers seen outnumbering put writers in the weekly expiry the stock has surpassed its recent high and created a bullish engulfing pattern on the daily chart it has also re entered the upward channel on the daily timeframe with the rsi indicating a bullish crossover in the short term the stock may move towards \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e while support is placed at \u003cONE_THOUSAND\u003e on the lower end the stock has remained above its previous swing high on the daily chart a downward consolidation breakout on the daily timeframe has helped drive the recent price increase the momentum is expected to stay strong in the short term with potential upside toward \u003cSEVEN_HUNDRED\u003e on the downside support is placed at \u003cSEVEN_HUNDRED\u003e the share price of usha martin has broken out of a consolidation pattern on the hourly chart suggesting growing bullish interest in the stock furthermore the stock has stayed above the \u003cFIVE_TEN\u003e ema on the hourly chart indicating a strong trend in the short term on the upside it may move towards \u003cFOUR_HUNDRED\u003e with support placed at \u003cFOUR_HUNDRED\u003e","timestamp":"2024-10-21T11:45:00+05:30","market_timestamp":"2024-10-21T11:45:00+05:30","off_market_hours":false}