{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-50-fall-for-second-consecutive-session-infosys-mahindra-and-mahindra-top-drags-11729072859000.html","title":"Stock market today: Sensex, Nifty 50 fall for second consecutive session; investors lose nearly  ₹1 lakh crore in a day","description":"Stock market today: The Sensex and the Nifty 50 declined for the second day due to weak global cues and disappointing Q2 earnings.","content":"Stock market today: Indian stock market benchmarks—the Sensex and the Nifty 50—fell for the second consecutive session on Wednesday, October 16, amid weak global cues. Moreover, unimpressive Q2 earnings and concerns over sticky inflation continued to weigh on sentiment.The Sensex fell 319 points, or 0.39 per cent, to 81,501.36, while the Nifty 50 settled at 24,971.30, down 86 points, or 0.34 per cent.Shares of Infosys, Mahindra and Mahindra, ICICI Bank, ITC and Kotak Mahindra Bank ended as the top drags on the Sensex index.The BSE Midcap index also slipped 0.10 per cent. However, the BSE Smallcap index outperformed and ended with a gain of 0.31 per cent.The overall market capitalisation (m-cap) of the firms listed on the BSE stood at nearly  ₹463 lakh crore. In the previous session, the market m-cap stood at nearly  ₹464 lakh crore. Thus, investors lost about  ₹1 lakh crore in a day.Even as the Sensex declined, as many as 262 stocks, including HCL Tech, Dixon Technologies, HDFC AMC, Oberoi Realty, Page Industries and Siemens, hit their fresh 52-week highs in intraday trade on BSE.Most sectoral indices ended with losses on Wednesday, with Nifty Auto and IT falling 1.27 per cent and 1.17 per cent, respectively.Nifty Media (down 0.48 per cent), Pharma (down 0.38 per cent) and FMCG (down 0.37 per cent) declined up to half a per cent.Bank Nifty fell 0.20 per cent, while the Private Bank index dropped 0.43 per cent. The PSU Bank index ended flat.The Nifty 50 has declined 0.60 per cent in the last two sessions. Weak global cues and lacklustre September quarter earnings are keeping the sentiment low, even as the market's medium-to-long-term outlook remains positive.Experts underscore that the market struggles to reach higher levels amid stretched valuation. Foreign capital outflow is another key factor weighing on market sentiment.\"The market traded rangebound with a negative bias due to the fear of a downgrade in FY25 earnings, which could impact the sustainability of premium valuation. The participants expect only a slow pace in earnings expansion in Q2FY25 due to insipid demand and volatility in input prices. The rate of recovery in Q2 compared to Q1 is below expectation,\" said Vinod Nair, Head of Research, Geojit Financial Services.\"Markets were rangebound with a negative bias as investors mostly resorted to selective profit-taking, particularly in banking, IT and auto stocks. While weak global market cues also contributed to the overall weakness, persistent offloading of domestic shares by foreign investors this month have made local traders jittery and are mostly adopting a cautious approach,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities.As many as 34 stocks ended from the Nifty 50 index ended in the red. Shares of Trent, Mahindra and Mahindra (M\u0026M), Infosys and Hero MotoCorp emerged as the top losers in the Nifty 50 pack.On the other hand, shares of HDFC Life, Dr Reddy's Labs, Grasim and HDFC Bank ended as the top gainers in the index.\"The Nifty 50 slipped after a brief consolidation on the hourly timeframe, suggesting increasing bearish sentiment among traders. The recent weakness has led the Nifty 50 below the 38.20 per cent retracement of the previous rise from 24,694 to 25,212,\" said Rupak De, Senior Technical Analyst, LKP Securities.\"Sentiment now appears slightly bearish, with immediate support at 24,900. A break below this level could intensify the weakness, potentially dragging Nifty down to 24,700. On the upside, 25,000 remains a strong resistance; only a decisive breakout above this level may trigger a directional rally in the market,\" said De.Read all market-related news here","cleaned_content":"stock market today indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e fell for the second consecutive session on wednesday october \u003cONE_TEN\u003e amid weak global cues moreover unimpressive q2 earnings and concerns over sticky inflation continued to weigh on sentiment the sensex fell \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e down \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e shares of infosys mahindra and mahindra icici bank itc and kotak mahindra bank ended as the top drags on the sensex index the bse midcap index also slipped \u003cZERO_PERCENT\u003e however the bse smallcap index outperformed and ended with a gain of \u003cZERO_PERCENT\u003e the overall market capitalisation m cap of the firms listed on the bse stood at nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session the market m cap stood at nearly \u003cFOUR_HUNDRED\u003e lakh crore thus investors lost about \u003cONE_\u003e lakh crore in a day even as the sensex declined as many as \u003cTWO_HUNDRED\u003e stocks including hcl tech dixon technologies hdfc amc oberoi realty page industries and siemens hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on bse most sectoral indices ended with losses on wednesday with nifty auto and it falling \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively nifty media down \u003cZERO_PERCENT\u003e pharma down \u003cZERO_PERCENT\u003e and fmcg down \u003cZERO_PERCENT\u003e declined up to half a per cent bank nifty fell \u003cZERO_PERCENT\u003e while the private bank index dropped \u003cZERO_PERCENT\u003e the psu bank index ended flat the nifty \u003cFIVE_TEN\u003e has declined \u003cZERO_PERCENT\u003e in the last two sessions weak global cues and lacklustre september quarter earnings are keeping the sentiment low even as the markets medium to long term outlook remains positive experts underscore that the market struggles to reach higher levels amid stretched valuation foreign capital outflow is another key factor weighing on market sentiment the market traded rangebound with a negative bias due to the fear of a downgrade in fy25 earnings which could impact the sustainability of premium valuation the participants expect only a slow pace in earnings expansion in q2fy25 due to insipid demand and volatility in input prices the rate of recovery in q2 compared to q1 is below expectation said vinod nair head of research geojit financial services markets were rangebound with a negative bias as investors mostly resorted to selective profit taking particularly in banking it and auto stocks while weak global market cues also contributed to the overall weakness persistent offloading of domestic shares by foreign investors this month have made local traders jittery and are mostly adopting a cautious approach said prashanth tapse senior vp research mehta equities as many as \u003cTHREE_TEN\u003e stocks ended from the nifty \u003cFIVE_TEN\u003e index ended in the red shares of trent mahindra and mahindra m m infosys and hero motocorp emerged as the top losers in the nifty \u003cFIVE_TEN\u003e pack on the other hand shares of hdfc life dr reddys labs grasim and hdfc bank ended as the top gainers in the index the nifty \u003cFIVE_TEN\u003e slipped after a brief consolidation on the hourly timeframe suggesting increasing bearish sentiment among traders the recent weakness has led the nifty \u003cFIVE_TEN\u003e below the \u003cTHREE_TEN_PERCENT\u003e retracement of the previous rise from \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst lkp securities sentiment now appears slightly bearish with immediate support at \u003cTWO_TEN_THOUSAND\u003e a break below this level could intensify the weakness potentially dragging nifty down to \u003cTWO_TEN_THOUSAND\u003e on the upside \u003cTWO_TEN_THOUSAND\u003e remains a strong resistance only a decisive breakout above this level may trigger a directional rally in the market said de read all market related news here","timestamp":"2024-10-16T16:57:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}