{"url":"https://www.livemint.com/market/stock-market-news/multibagger-ipo-nse-sme-stock-blue-pebble-doubles-allottees-money-in-six-months-11729491507723.html","title":"Multibagger IPO: NSE SME stock doubles allottees’ money in just six months","description":"Blue Pebble shares soared 126% in six months since its debut on NSE SME. Despite a 5.5% dip from the peak, the stock has shown significant gains, including 18% growth in October. The IPO was heavily oversubscribed, with all categories receiving strong bids.","content":"The NSE SME-listed stock Blue Pebble Limited has provided impressive returns to its investors, becoming a multibagger just six months since its market debut.The stock, which debuted at an 18 per cent premium in April 2024, has soared 126 per cent as of today over its IPO price of  ₹168. The stock hit an all-time high of  ₹379.65 in intra-day trading on Monday, October 21. Meanwhile, from its listing price of  ₹199, the stock has risen around 91 per cent.However, after hitting a record high, the stock experienced a 5.5 per cent dip in intra-day trading, reflecting some profit booking. Despite this, Blue Pebble has witnessed significant gains recently, having jumped around 18 per cent in October alone after a modest 2.5 per cent rise in September. The stock faced minor setbacks in the preceding months, with a 9 per cent decline in August and a small 0.3 per cent drop in July. In contrast, the stock surged by over 27 per cent in June after suffering a 16.5 per cent drop in May.Blue Pebble's SME IPO, valued at  ₹18.14 crore, opened for public subscription from March 26 to 28, 2024, and made its debut on the NSE SME platform on April 3, 2024. The price band for the issue was set between  ₹159 and  ₹168 per share, with a minimum application size of 800 shares.The IPO received an overwhelming response, with subscriptions reaching 56.32 times the offered size within the three-day bidding window. Investors placed bids for 4.04 crore shares, compared to 7.18 lakh shares that were on offer. The retail investor category was subscribed 58.4 times, while the non-institutional investors (NII) segment was subscribed 97.31 times. Institutional interest was also solid, with the qualified institutional buyer (QIB) category subscribed 21.77 times.Retail investors had to invest a minimum of  ₹1,34,400 for a lot of 800 shares, while high-net-worth individuals (HNIs) needed to apply for at least two lots, amounting to  ₹2,68,800 for 1,600 shares.The company intends to use the funds raised through the IPO for several purposes, including capital expenditure for new machinery, working capital needs, and general corporate expenses.Hem Securities Limited acted as the book-running lead manager for Blue Pebble’s IPO, with Bigshare Services Pvt Ltd serving as the registrar. Hem Finlease was the market maker for the stock.Founded in 2017, Blue Pebble Limited is a leading provider of interior design and environmental branding solutions. The company offers a wide range of services, from conceptualisation to installation, specialising in vinyl graphics, signage, 3D walls, glass films, wall panels, and sculptures for corporate and workplace environments. It also provides printing services, including large format, fabric, and vinyl printing as well as 3D art installations.Blue Pebble's clients span various sectors, including banking, IT, and multinational corporations, with notable clients such as Infosys, HDFC Bank, and Nestle. Headquartered in Mumbai, the company has a nationwide presence and has received an architecture and interior design award from Beginup Research Intelligence Pvt Ltd.Blue Pebble's financial performance for the first half of FY25 has been robust. The company reported a net profit of  ₹3.76 crore, marking a 29 per cent increase from  ₹2.92 crore in the same period of the previous year. Additionally, its total income surged to  ₹23.86 crore, reflecting an 80 per cent growth from  ₹13.22 crore in H1FY24.With its consistent financial growth and strong market presence, Blue Pebble continues to be a noteworthy player in the SME space, delivering impressive returns to its investors.","cleaned_content":"the nse sme listed stock blue pebble limited has provided impressive returns to its investors becoming a multibagger just six months since its market debut the stock which debuted at an \u003cONE_TEN_PERCENT\u003e premium in april \u003cTWO_THOUSAND\u003e has soared \u003cONE_HUNDRED_PERCENT\u003e as of today over its ipo price of \u003cONE_HUNDRED\u003e the stock hit an all time high of \u003cTHREE_HUNDRED\u003e in intra day trading on monday october \u003cTWO_TEN\u003e meanwhile from its listing price of \u003cONE_HUNDRED\u003e the stock has risen around \u003cNINE_TEN_PERCENT\u003e however after hitting a record high the stock experienced a \u003cFIVE_PERCENT\u003e dip in intra day trading reflecting some profit booking despite this blue pebble has witnessed significant gains recently having jumped around \u003cONE_TEN_PERCENT\u003e in october alone after a modest \u003cTWO_PERCENT\u003e rise in september the stock faced minor setbacks in the preceding months with a \u003cNINE_PERCENT\u003e decline in august and a small \u003cZERO_PERCENT\u003e drop in july in contrast the stock surged by over \u003cTWO_TEN_PERCENT\u003e in june after suffering a \u003cONE_TEN_PERCENT\u003e drop in may blue pebbles sme ipo valued at \u003cONE_TEN\u003e crore opened for public subscription from march \u003cTWO_TEN\u003e to \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and made its debut on the nse sme platform on april \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e the price band for the issue was set between \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e per share with a minimum application size of \u003cEIGHT_HUNDRED\u003e shares the ipo received an overwhelming response with subscriptions reaching \u003cFIVE_TEN\u003e times the offered size within the three day bidding window investors placed bids for \u003cFOUR_\u003e crore shares compared to \u003cSEVEN_\u003e lakh shares that were on offer the retail investor category was subscribed \u003cFIVE_TEN\u003e times while the non institutional investors nii segment was subscribed \u003cNINE_TEN\u003e times institutional interest was also solid with the qualified institutional buyer qib category subscribed \u003cTWO_TEN\u003e times retail investors had to invest a minimum of \u003cONE_HUNDRED_THOUSAND\u003e for a lot of \u003cEIGHT_HUNDRED\u003e shares while high net worth individuals hnis needed to apply for at least two lots amounting to \u003cTWO_HUNDRED_THOUSAND\u003e for \u003cONE_THOUSAND\u003e shares the company intends to use the funds raised through the ipo for several purposes including capital expenditure for new machinery working capital needs and general corporate expenses hem securities limited acted as the book running lead manager for blue pebble s ipo with bigshare services pvt ltd serving as the registrar hem finlease was the market maker for the stock founded in \u003cTWO_THOUSAND\u003e blue pebble limited is a leading provider of interior design and environmental branding solutions the company offers a wide range of services from conceptualisation to installation specialising in vinyl graphics signage \u003cTHREE_\u003e d walls glass films wall panels and sculptures for corporate and workplace environments it also provides printing services including large format fabric and vinyl printing as well as \u003cTHREE_\u003e d art installations blue pebbles clients span various sectors including banking it and multinational corporations with notable clients such as infosys hdfc bank and nestle headquartered in mumbai the company has a nationwide presence and has received an architecture and interior design award from beginup research intelligence pvt ltd blue pebbles financial performance for the first half of fy25 has been robust the company reported a net profit of \u003cTHREE_\u003e crore marking a \u003cTWO_TEN_PERCENT\u003e increase from \u003cTWO_\u003e crore in the same period of the previous year additionally its total income surged to \u003cTWO_TEN\u003e crore reflecting an \u003cEIGHT_TEN_PERCENT\u003e growth from \u003cONE_TEN\u003e crore in h1fy24 with its consistent financial growth and strong market presence blue pebble continues to be a noteworthy player in the sme space delivering impressive returns to its investors","timestamp":"2024-10-21T12:27:00+05:30","market_timestamp":"2024-10-21T12:27:00+05:30","off_market_hours":false}