{"url":"https://www.livemint.com/market/stock-market-news/fpi-selloff-in-indian-stocks-hits-rs-82-000-crore-in-october-highest-ever-in-a-month-is-only-the-china-factor-at-play-11729568680369.html","title":"FPI selloff in Indian stocks hits  ₹82,000 crore in October, highest-ever in a month. Is only the China factor at play?","description":"October has seen record FPI outflows from Indian equities, totalling  ₹82,479 crore, amid concerns over valuations and geopolitical issues. Despite this, the market's decline has been contained due to substantial domestic institutional investor support.","content":"Indian stocks appear to be falling out of favour with foreign portfolio investors (FPIs), as reflected in the significant selling activity observed so far in October. This marks a sharp shift in sentiment, with FPIs offloading a substantial volume of equities, reflecting growing concerns over expensive valuations and rising geopolitical tensions.The robust FPI inflows into Indian equities that followed the US Fed's aggressive 50 bps rate hike have swiftly turned into outflows. FPIs have reportedly been redirecting their funds from Indian equities to Chinese stocks, encouraged by recent measures taken by Beijing to stabilise its struggling property and capital markets.These measures have renewed investor confidence that China may rebound from its economic downturn, potentially boosting corporate profits. As a part of the ongoing measures, the Chinese central bank cut its key lending rates by 25 bps to fresh lows on Monday to support an economic turnaround.So far in October, FPIs have withdrawn a record  ₹82,479 crore from Indian equities, according to Trendlyne data, marking the highest monthly outflow on record. The previous record for the largest monthly outflow was during the COVID-19 pandemic in March 2020, when FPIs sold  ₹65,816 crore worth of Indian stocks.FPIs have consistently been net sellers in all trading sessions this month, with the largest outflow recorded on October 3, when they withdrew  ₹15,506 crore.However, despite this massive sell-off, the impact on the Indian markets has been relatively contained. The Nifty 50 and Sensex have each declined by just over 4% in October, compared to a 23% drop in March 2020. From their respective peaks, both indices have corrected nearly 6%.This limited market decline can be largely attributed to strong buying by domestic institutional investors (DIIs), who have absorbed the FPI selling, thus preventing a major correction. Furthermore, ongoing retail inflows into mutual funds are supplying fund managers with ample liquidity, forcing them to invest in equities despite elevated valuations.DIIs have invested over  ₹77,000 crore in October so far, bringing their year-to-date inflows to over  ₹4 lakh crore, setting an annual record.Apart from the attractive valuations of Chinese stocks, the outflows from FPIs in October can be attributed to several other factors, including the anticipated weak performance of Indian companies in the September quarter, rising geopolitical tensions between Iran and Israel, and the elevated valuations of Indian stocks, which collectively dampened investor sentiment, leading to severe outflows.According to analysts, despite a notable correction in recent weeks, Indian stocks continue to trade at elevated valuations that may not reflect their underlying fundamentals. The financial results released by companies so far for the September quarter have failed to provide much cheer for investors, with many firms reporting lacklustre growth and profitability.Dr V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services, said, \"The record high FII sell figure didn’t impact the market severely because of the countervailing action of sustained DII buying. The fact is that even after the correction triggered by the sustained FII selling, Indian market valuations are higher than historical averages, even though large-cap valuations can be justified by their long-term growth prospects.\"Since market sentiments continue to be negative, a sharp and sustained recovery appears difficult, even though a rebound can happen at any time. Financials will be relatively resilient in the present market setting,\" he added.","cleaned_content":"indian stocks appear to be falling out of favour with foreign portfolio investors fpis as reflected in the significant selling activity observed so far in october this marks a sharp shift in sentiment with fpis offloading a substantial volume of equities reflecting growing concerns over expensive valuations and rising geopolitical tensions the robust fpi inflows into indian equities that followed the us feds aggressive \u003cFIVE_TEN\u003e bps rate hike have swiftly turned into outflows fpis have reportedly been redirecting their funds from indian equities to chinese stocks encouraged by recent measures taken by beijing to stabilise its struggling property and capital markets these measures have renewed investor confidence that china may rebound from its economic downturn potentially boosting corporate profits as a part of the ongoing measures the chinese central bank cut its key lending rates by \u003cTWO_TEN\u003e bps to fresh lows on monday to support an economic turnaround so far in october fpis have withdrawn a record \u003cEIGHT_TEN_THOUSAND\u003e crore from indian equities according to trendlyne data marking the highest monthly outflow on record the previous record for the largest monthly outflow was during the covid \u003cONE_TEN\u003e pandemic in march \u003cTWO_THOUSAND\u003e when fpis sold \u003cSIX_TEN_THOUSAND\u003e crore worth of indian stocks fpis have consistently been net sellers in all trading sessions this month with the largest outflow recorded on october \u003cTHREE_\u003e when they withdrew \u003cONE_TEN_THOUSAND\u003e crore however despite this massive sell off the impact on the indian markets has been relatively contained the nifty \u003cFIVE_TEN\u003e and sensex have each declined by just over \u003cFOUR_PERCENT\u003e in october compared to a \u003cTWO_TEN_PERCENT\u003e drop in march \u003cTWO_THOUSAND\u003e from their respective peaks both indices have corrected nearly \u003cSIX_PERCENT\u003e this limited market decline can be largely attributed to strong buying by domestic institutional investors diis who have absorbed the fpi selling thus preventing a major correction furthermore ongoing retail inflows into mutual funds are supplying fund managers with ample liquidity forcing them to invest in equities despite elevated valuations diis have invested over \u003cSEVEN_TEN_THOUSAND\u003e crore in october so far bringing their year to date inflows to over \u003cFOUR_\u003e lakh crore setting an annual record apart from the attractive valuations of chinese stocks the outflows from fpis in october can be attributed to several other factors including the anticipated weak performance of indian companies in the september quarter rising geopolitical tensions between iran and israel and the elevated valuations of indian stocks which collectively dampened investor sentiment leading to severe outflows according to analysts despite a notable correction in recent weeks indian stocks continue to trade at elevated valuations that may not reflect their underlying fundamentals the financial results released by companies so far for the september quarter have failed to provide much cheer for investors with many firms reporting lacklustre growth and profitability dr v k vijayakumar chief investment strategist geojit financial services said the record high fii sell figure didn t impact the market severely because of the countervailing action of sustained dii buying the fact is that even after the correction triggered by the sustained fii selling indian market valuations are higher than historical averages even though large cap valuations can be justified by their long term growth prospects since market sentiments continue to be negative a sharp and sustained recovery appears difficult even though a rebound can happen at any time financials will be relatively resilient in the present market setting he added","timestamp":"2024-10-22T12:20:00+05:30","market_timestamp":"2024-10-22T12:20:00+05:30","off_market_hours":false}