{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-22-11729563865770.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 22","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a muted start for the Indian benchmark index. The Gift Nifty was trading around 24,810 level, a premium of nearly 20 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open on a tepid note following weak sentiment in global markets.The trends on Gift Nifty also indicate a muted start for the Indian benchmark index. The Gift Nifty was trading around 24,810 level, a premium of nearly 20 points from the Nifty futures’ previous close.On Tuesday, the domestic equity benchmark indices succumbed to profit booking and ended lower.The Sensex fell 73.48 points to close at 81,151.27, while the Nifty 50 settled 72.95 points, or 0.29%, lower at 24,781.10.Nifty 50 formed a small reasonable candle on the daily chart with a minor lower shadow.“Technically this pattern indicates lack of strength in the market to show a sustainable upside bounce. This is not a good sign. The market is still in a broader high low range in the last few weeks. At the highs 25,200 - 25,100 is acting as a strong overhead resistance and the lower area of 24,600 - 24,500 is offering support for the market as of now,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to Shetti, the underlying trend of Nifty 50 remains weak amidst range movement and having failed to sustain the recent upside bounce, the market could revisit the lower range of 24,600 - 24,500 levels in the near term.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty Open Interest (OI) data shows the highest OI on the call side at the 24,900 and 25,000 strike prices, signaling strong resistance levels. On the put side, OI is concentrated at the 24,700 and 24,500 strike prices, highlighting these as key support levels, noted Hardik Matalia, Derivative Analyst at Choice Broking.Nifty 50 was not able to continue with upside momentum on October 21 and closed the day lower by 72 points below 24,800 level.“Nifty 50 witnessed selling pressure from the 25,000 mark which coincides with high concentration of open interest on the call side implying resistance. On the downside the 20 week average (24,730) which was defended well last week is being tested again. So there is a standoff between bulls and bears leading to heightened volatility. Overall, we expect a rangebound price action in the range 24,500 – 25,200 from a short term perspective,” said Jatin Gedia – Technical Research Analyst at Sharekhan by BNP Paribas.Dr. Praveen Dwarakanath, Vice President of Hedged.in noted that on the weekly chart, Nifty 50 is taking support at the 20 EMA (Exponential Moving Average), indicating a possible dead cat bounce from the present levels.“Although it didn't sustain the day's high, Nifty was able to break the previous day’s high, indicating possible buying. The momentum indicators are in the oversold region, indicating a possible bounce from the present levels. The ADX DI- line has turned down and the ADX DI+ line is turning upside, indicating a possible move on the upside,” said Dwarakanath.According to him, options writer's data for this month's expiry showed increased call writing at 24,800 and above levels, however, a short covering of these sold positions can lead to a bounce in coming trading sessions.Meanwhile, VLA Ambala, Co-Founder of Stock Market Today noted that the Nifty 50 closed at 24,781 range in intraday forming a “Head and Shoulders” candlestick pattern on the daily chart along with an intraday “Bearish Belt Hold” candlestick pattern.“Looking ahead, the Nifty is likely to find support around 24,640 and 24,400, with resistance expected near 24,780 and 24,900,”Ambala said.Bank Nifty ended 131.50 points, or 0.25%, lower at 51,962.70 on Monday, forming a bearish candlestick pattern on the daily timeframe.“Bank Nifty got rejected from the 20 EMA line, indicating a downside in the index from the present levels. The Stochastics is in the overbought region, however, the ADX DI- line is sloping down and the ADX DI+ line is sloping up, indicating a possible bounce. The RSI in the oversold region also indicates a possible bounce at current levels,” said Dwarakanath.According to him, options writer's data showed increased writing in calls of weekly expiry, while not much activity was shown in the monthly expiry, indicating the index likely to stay below 52,000 levels before the weekly expiry.Jatin Gedia noted that the Bank Nifty’s inability to sustain at higher levels shows lack of strength, and hence, there is likely to be further consolidation before any meaningful upside.“On the upside 52,250 – 52,300 shall act as an immediate hurdle zone while 51,100 – 51,000 shall act as a crucial support zone,” Gedia said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a tepid note following weak sentiment in global markets the trends on gift nifty also indicate a muted start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cTWO_TEN\u003e points from the nifty futures previous close on tuesday the domestic equity benchmark indices succumbed to profit booking and ended lower the sensex fell \u003cSEVEN_TEN\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small reasonable candle on the daily chart with a minor lower shadow technically this pattern indicates lack of strength in the market to show a sustainable upside bounce this is not a good sign the market is still in a broader high low range in the last few weeks at the highs \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is acting as a strong overhead resistance and the lower area of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is offering support for the market as of now said nagaraj shetti senior technical research analyst at hdfc securities according to shetti the underlying trend of nifty \u003cFIVE_TEN\u003e remains weak amidst range movement and having failed to sustain the recent upside bounce the market could revisit the lower range of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in the near term here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty open interest oi data shows the highest oi on the call side at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices signaling strong resistance levels on the put side oi is concentrated at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices highlighting these as key support levels noted hardik matalia derivative analyst at choice broking nifty \u003cFIVE_TEN\u003e was not able to continue with upside momentum on october \u003cTWO_TEN\u003e and closed the day lower by \u003cSEVEN_TEN\u003e points below \u003cTWO_TEN_THOUSAND\u003e level nifty \u003cFIVE_TEN\u003e witnessed selling pressure from the \u003cTWO_TEN_THOUSAND\u003e mark which coincides with high concentration of open interest on the call side implying resistance on the downside the \u003cTWO_TEN\u003e week average \u003cTWO_TEN_THOUSAND\u003e which was defended well last week is being tested again so there is a standoff between bulls and bears leading to heightened volatility overall we expect a rangebound price action in the range \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e from a short term perspective said jatin gedia technical research analyst at sharekhan by bnp paribas dr praveen dwarakanath vice president of hedged in noted that on the weekly chart nifty \u003cFIVE_TEN\u003e is taking support at the \u003cTWO_TEN\u003e ema exponential moving average indicating a possible dead cat bounce from the present levels although it didnt sustain the days high nifty was able to break the previous day s high indicating possible buying the momentum indicators are in the oversold region indicating a possible bounce from the present levels the adx di line has turned down and the adx di line is turning upside indicating a possible move on the upside said dwarakanath according to him options writers data for this months expiry showed increased call writing at \u003cTWO_TEN_THOUSAND\u003e and above levels however a short covering of these sold positions can lead to a bounce in coming trading sessions meanwhile vla ambala co founder of stock market today noted that the nifty \u003cFIVE_TEN\u003e closed at \u003cTWO_TEN_THOUSAND\u003e range in intraday forming a head and shoulders candlestick pattern on the daily chart along with an intraday bearish belt hold candlestick pattern looking ahead the nifty is likely to find support around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with resistance expected near \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e ambala said bank nifty ended \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e on monday forming a bearish candlestick pattern on the daily timeframe bank nifty got rejected from the \u003cTWO_TEN\u003e ema line indicating a downside in the index from the present levels the stochastics is in the overbought region however the adx di line is sloping down and the adx di line is sloping up indicating a possible bounce the rsi in the oversold region also indicates a possible bounce at current levels said dwarakanath according to him options writers data showed increased writing in calls of weekly expiry while not much activity was shown in the monthly expiry indicating the index likely to stay below \u003cFIVE_TEN_THOUSAND\u003e levels before the weekly expiry jatin gedia noted that the bank nifty s inability to sustain at higher levels shows lack of strength and hence there is likely to be further consolidation before any meaningful upside on the upside \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e shall act as an immediate hurdle zone while \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e shall act as a crucial support zone gedia said","timestamp":"2024-10-22T08:11:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}