{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-21-11729475732067.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 21","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a tepid start for the Indian benchmark index. The Gift Nifty was trading around 24,925 level, a discount of nearly 25 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50 are likely to open flat-to-lower on Monday following mixed cues from global markets.The trends on Gift Nifty also indicate a tepid start for the Indian benchmark index. The Gift Nifty was trading around 24,925 level, a discount of nearly 25 points from the Nifty futures’ previous close.On Friday, the domestic equity market indices closed higher, breaking a three-day losing streak.The Sensex gained 218.14 points to close at 81,224.75, while the Nifty 50 settled 104.20 points, or 0.42%, higher at 24,854.05.Nifty 50 formed a ‘high wave’ candlestick pattern in the weekly time frame and ‘Marubozu’ in the daily timeframe at the 20 EMA (Exponential Moving Average).“In Friday’s session, the Nifty 50 tested the 20-week EMA with a correction of 6.5% after hitting a record high in September. A cautious approach is recommended for short-term investors. However, medium and long-term investors should consider buying quality stocks that are currently undervalued,” said VLA Ambala, Co-Founder of Stock Market Today.Meanwhile, with a correction of 6.5%, Nifty's monthly RSI fell from 82 to 73, while on the daily timeframe, it was at 42. This signals that only a ‘buy on dip’ strategy should be considered for swing trading or intraday trading, Ambala added.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty’s options data reveal significant open interest (OI) at the 25,500 level on the put side, signaling potential support at that level. On the call side, notable OI concentrations are observed at the 25,000 and 25,500 levels. Traders and investors are advised to look for buying opportunities on Nifty dips, with appropriate stop-loss strategies placed below the identified support levels, said Mandar Bhojane, Technical Analyst at Choice Broking.Nifty 50 rallied 104.20 points, or 0.42%, to close at 24,854.05 on October 18, forming a positive candle on the daily chart with minor lower shadow.“Nifty 50, on its daily chart, has created a positive divergence. Nifty 50 also bounced from its critical support of 24,700 levels, as expected. The momentum indicators show signs of recovery from the fall with today's rally. However, the ADX DI- line is yet to trend down, which is only a concern technically for the index to move upside,” said Dr. Praveen Dwarakanath, Vice President of Hedged.in.According to him, options writer's data for this month's expiry showed increased call writing at 24,800 and above levels and an increased volume in call writing compared to puts, indicating weakness in the index.Aditya Agarwal, Head of Derivatives \u0026 Technical Analysis at Sanctum Wealth believes in the short term, Nifty 50 remains in the oversold zone and can continue to see short covering from current levels.“However, upside remains limited and a move towards 24,950 - 25,050 levels will be used by traders to book profit in trading long positions. On the lower side, 24,700 - 24,650 will be immediate support for the index,” said Agarwal.Bank Nifty index closed 805.40 points, or 1.57%, higher at 52,094.20 on Friday, forming a bullish candlestick pattern on the daily charts.“Bank Nifty bounced from its support at 51,000 levels. The daily chart shows the RSI line crossing over the RSI average line and a drop in the ADX DI- line, indicating the index to continue upside to its resistance at 52,500 levels. The daily candle has formed a bullish engulfing candle with a break of immediate resistance at 52,000 levels, indicating upside momentum to continue,” said Dwarakanath.According to him, options writer’s data showed short covering in the ITM calls of monthly expiry which could also be the reason for Friday’s rally in the index. Increased put writing also indicates an upside in the index from the current levels.Agarwal noted that the Bank Nifty index respected its crucial support zone of 51,000 in Friday’s session and saw sharp pullback from those levels and closed above 52,000 levels.“Short term view on Bank Nifty remains positive and, on the higher side, it can move towards 52,480 / 52,760 levels in the short term. Any dip in Bank Nifty towards 51,620 / 51,440 can be used as a fresh entry point from targets mentioned above. Only a close below 50,800 will negate bullish views on the index,” Agarwal said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open flat to lower on monday following mixed cues from global markets the trends on gift nifty also indicate a tepid start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cTWO_TEN\u003e points from the nifty futures previous close on friday the domestic equity market indices closed higher breaking a three day losing streak the sensex gained \u003cTWO_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a high wave candlestick pattern in the weekly time frame and marubozu in the daily timeframe at the \u003cTWO_TEN\u003e ema exponential moving average in friday s session the nifty \u003cFIVE_TEN\u003e tested the \u003cTWO_TEN\u003e week ema with a correction of \u003cSIX_PERCENT\u003e after hitting a record high in september a cautious approach is recommended for short term investors however medium and long term investors should consider buying quality stocks that are currently undervalued said vla ambala co founder of stock market today meanwhile with a correction of \u003cSIX_PERCENT\u003e niftys monthly rsi fell from \u003cEIGHT_TEN\u003e to \u003cSEVEN_TEN\u003e while on the daily timeframe it was at \u003cFOUR_TEN\u003e this signals that only a buy on dip strategy should be considered for swing trading or intraday trading ambala added here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty s options data reveal significant open interest oi at the \u003cTWO_TEN_THOUSAND\u003e level on the put side signaling potential support at that level on the call side notable oi concentrations are observed at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e levels traders and investors are advised to look for buying opportunities on nifty dips with appropriate stop loss strategies placed below the identified support levels said mandar bhojane technical analyst at choice broking nifty \u003cFIVE_TEN\u003e rallied \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cTWO_TEN_THOUSAND\u003e on october \u003cONE_TEN\u003e forming a positive candle on the daily chart with minor lower shadow nifty \u003cFIVE_TEN\u003e on its daily chart has created a positive divergence nifty \u003cFIVE_TEN\u003e also bounced from its critical support of \u003cTWO_TEN_THOUSAND\u003e levels as expected the momentum indicators show signs of recovery from the fall with todays rally however the adx di line is yet to trend down which is only a concern technically for the index to move upside said dr praveen dwarakanath vice president of hedged in according to him options writers data for this months expiry showed increased call writing at \u003cTWO_TEN_THOUSAND\u003e and above levels and an increased volume in call writing compared to puts indicating weakness in the index aditya agarwal head of derivatives technical analysis at sanctum wealth believes in the short term nifty \u003cFIVE_TEN\u003e remains in the oversold zone and can continue to see short covering from current levels however upside remains limited and a move towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels will be used by traders to book profit in trading long positions on the lower side \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e will be immediate support for the index said agarwal bank nifty index closed \u003cEIGHT_HUNDRED\u003e points or \u003cONE_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e on friday forming a bullish candlestick pattern on the daily charts bank nifty bounced from its support at \u003cFIVE_TEN_THOUSAND\u003e levels the daily chart shows the rsi line crossing over the rsi average line and a drop in the adx di line indicating the index to continue upside to its resistance at \u003cFIVE_TEN_THOUSAND\u003e levels the daily candle has formed a bullish engulfing candle with a break of immediate resistance at \u003cFIVE_TEN_THOUSAND\u003e levels indicating upside momentum to continue said dwarakanath according to him options writer s data showed short covering in the itm calls of monthly expiry which could also be the reason for friday s rally in the index increased put writing also indicates an upside in the index from the current levels agarwal noted that the bank nifty index respected its crucial support zone of \u003cFIVE_TEN_THOUSAND\u003e in friday s session and saw sharp pullback from those levels and closed above \u003cFIVE_TEN_THOUSAND\u003e levels short term view on bank nifty remains positive and on the higher side it can move towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels in the short term any dip in bank nifty towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e can be used as a fresh entry point from targets mentioned above only a close below \u003cFIVE_TEN_THOUSAND\u003e will negate bullish views on the index agarwal said","timestamp":"2024-10-21T07:35:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}