{"url":"https://www.livemint.com/market/stock-market-news/ptc-industries-shares-up-over-4-on-uk-based-companys-acquisition-buzz-11729483090681.html","title":"PTC Industries shares rise over 4% on acquiring stake in UK-based Trac Precision Solutions","description":"PTC Industries shares surged over 4% on October 21 after the announcement of its acquisition of Trac Precision Solutions Limited.","content":"Stock in focus: Shares of PTC Industries Limited jumped more than 4 per cent on Monday, October 21, to  ₹13,480 following the announcement of the company’s strategic acquisition of Trac Precision Solutions Limited (TSPL), a UK-based firm specialising in precision-engineered components for aerospace, defence, and energy sectors.The primary operating company involved, Trac Precision Solutions Limited, reported a turnover of £24.76 million (approximately  ₹250 crore) for the fiscal year ended April 30, 2024, a decrease from £29.52 million (around  ₹298 crore) reported in the previous fiscal period.PTC Industries share price was trading in the green, up 4.09 per cent, at  ₹13,480, on October 21, at 9:28 am, on BSE. The company enjoys a market capitalisation of  ₹20,173.60 crore. PTC Industries stock price hit its 52-week high of  ₹15,702.10 on July 10, 2024, on the NSE.The acquisition will be executed through a Share Purchase Agreement (SPA) signed on October 18, 2024. Under the terms of the deal, PTC Industries will acquire 100 per cent ownership of Trac Precision Solutions, along with its parent entity, Trac Holdings Limited, and two other non-operating subsidiaries. \"This strategic investment aligns with the company’s core business and will enhance operational synergies,\" the company said in its regulatory filing.The Lucknow-based firm emphasised that the acquisition aims to leverage the technical capabilities of both entities and expand its global presence. Once completed, Trac Precision Solutions will become a key subsidiary, potentially enhancing PTC's production capabilities and market outreach, the company announced in the exchange filing.PTC’s statement confirmed that the transaction, subject to approval under the UK’s National Security and Investment Act 2021, would be completed within three months. The SPA was negotiated with Rcapital Limited and other shareholders, including Liam Marc Bevington, Kevin Andrew Mooney, and Paul Brian Young, as per the exchange filing.","cleaned_content":"stock in focus shares of ptc industries limited jumped more than \u003cFOUR_PERCENT\u003e on monday october \u003cTWO_TEN\u003e to \u003cONE_TEN_THOUSAND\u003e following the announcement of the company s strategic acquisition of trac precision solutions limited tspl a uk based firm specialising in precision engineered components for aerospace defence and energy sectors the primary operating company involved trac precision solutions limited reported a turnover of \u003cTWO_TEN\u003e million approximately \u003cTWO_HUNDRED\u003e crore for the fiscal year ended april \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e a decrease from \u003cTWO_TEN\u003e million around \u003cTWO_HUNDRED\u003e crore reported in the previous fiscal period ptc industries share price was trading in the green up \u003cFOUR_PERCENT\u003e at \u003cONE_TEN_THOUSAND\u003e on october \u003cTWO_TEN\u003e at \u003cNINE_\u003e \u003cTWO_TEN\u003e am on bse the company enjoys a market capitalisation of \u003cTWO_TEN_THOUSAND\u003e crore ptc industries stock price hit its \u003cFIVE_TEN\u003e week high of \u003cONE_TEN_THOUSAND\u003e on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on the nse the acquisition will be executed through a share purchase agreement spa signed on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e under the terms of the deal ptc industries will acquire \u003cONE_HUNDRED_PERCENT\u003e ownership of trac precision solutions along with its parent entity trac holdings limited and two other non operating subsidiaries this strategic investment aligns with the company s core business and will enhance operational synergies the company said in its regulatory filing the lucknow based firm emphasised that the acquisition aims to leverage the technical capabilities of both entities and expand its global presence once completed trac precision solutions will become a key subsidiary potentially enhancing ptcs production capabilities and market outreach the company announced in the exchange filing ptc s statement confirmed that the transaction subject to approval under the uk s national security and investment act \u003cTWO_THOUSAND\u003e would be completed within three months the spa was negotiated with rcapital limited and other shareholders including liam marc bevington kevin andrew mooney and paul brian young as per the exchange filing","timestamp":"2024-10-21T09:42:00+05:30","market_timestamp":"2024-10-21T09:42:00+05:30","off_market_hours":false}