{"url":"https://www.livemint.com/market/stock-market-news/ril-bonus-issue-reliance-industries-board-passes-1-1-issue-of-free-shares-with-majority-votes-record-date-fixed-11729090435104.html","title":"Reliance bonus issue: RIL board passes 1:1 issue of free shares with majority votes; Record date fixed","description":"Reliance bonus issue: The oil-to-telecom conglomerate has fixed Monday, October 28, 2024 as the record date for the bonus issue.","content":"Reliance bonus issue: Billionaire Mukesh Ambani-led Reliance Industries Ltd (RIL)'s board passed the issue of bonus shares with a majority in e-voting and also fixed the record date. The oil-to-telecom conglomerate said in a regulatory filing to the stock exchanges on Wednesday, October 16 that it has fixed Monday, October 28, 2024 as the record date for the 1:1 issue of free shares.RIL board approved the bonus issue in the ratio 1:1 on Thursday, September 5, which was announced during the oil-to-telecom conglomerate's 47th annual general meeting (AGM) late in August. The board also approved an increase in authorised share capital from  ₹15,000 crore to  ₹50,000 crore.Also Read: Reliance bonus issue announced: RIL board approves 1:1 issue of free shares; 5 key things shareholders must know“This is further to our letters dated September 5 and October 16 intimating the approval by the members for the issue of bonus shares in the ratio of 1:1. In this regard, we wish to inform the company has fixed Monday, October 28, 2024 as the record date to determine the equity shareholders eligible for bonus equity shares of the company,” said RIL in its exchange filing today.This marks Reliance's sixth bonus issue and the first since 2017. Prior to the bonus issue approved in 2017, Reliance issued a 1:1 bonus share in 2009. The bonus shares will be issued by capitalizing from the company's securities premium account, general reserves, or retained earnings. The company's pre-bonus paid-up capital currently stands at  ₹6,766.23 crore, consisting of 676.62 crore equity shares of  ₹10 each, including partly paid-up shares.After the bonus issue, the paid-up capital will double to  ₹13,532.46 crore, comprising 1,353.24 crore equity shares. The company estimates that  ₹6,766.23 crore will be required to implement the bonus issue, and the final amount will be based on the paid-up capital on the record date.Also Read: Reliance Industries AGM 2024: RIL to consider bonus shares, Jio-AI cloud to issue 100 GB free storage; 5 key highlightsRIL reported a 3.6 per cent year-on-year (YoY) decline in consolidated net profit to  ₹19,101 crore during the July-September quarter from  ₹19,820 crore in the corresponding quarter a year ago. However, sequentially, or quarter-on-quarter (QoQ), the behemoth's consolidated profit rose by 9.5 per cent. In Q1FY25, the company reported a profit of  ₹17,448 crore.The company reported a two per cent YoY decline in EBITDA to  ₹43,934 crore, while the EBITDA margin shrank by 50 bps to 17 per cent. By the end of Q2FY24, the outstanding debt stood at  ₹3,36,337 crore, compared to  ₹2,95,687 crore.The revenue rose 0.8 per cent YoY to  ₹2,58,027 crore, compared to  ₹2,55,996 crore in the year-ago period. \"Our performance reflects robust growth in digital services and upstream business. This helped partially offset the weak contribution from the O2C (oil-to-chemicals) business, which was impacted by unfavourable global demand-supply dynamics,\" said Mukesh D. Ambani, Chairman and Managing Director of RIL.Also Read: RIL bonus issue: Reliance stock to outperform Nifty 50 in near-term? Here’s what JM’s technical analysis revealsShares of India's largest company by market cap have provided 15.27 per cent returns to investors in the last year, against Nifty 50's return of 26.43 per cent and Sensex's return of 22.96 per cent. In a technical note, domestic brokerage JM Financial said, “All major selling in the stock in the last 10 months ended marginally below the 100-day EMA levels.\"The stock posted gains for the next five consecutive months after reaching a 52-week low of  ₹2,221.05 on October 26 last year. This year, it has only declined in April (down nearly two per cent), May (down nearly two per cent), and July (down nearly four per cent). On Wednesday, shares of RIL settled 0.78 per cent higher at  ₹2,708 apiece on the BSE.Domestic brokerage firm Elara Securities gave the stock an ‘accumulate’ rating. “We reduce FY25E/26E EPS by 14 per cent/8 per cent, led by lower refining and petchem margins. Consequently, we reiterate Accumulate on RIL with TP pared to  ₹3,265 (from  ₹3,636), primarily on lower FY26E EBITDA. We assume 21.8x (from 22.8x) FY27E EV/EBITDA for retail, 17.5x (from 18.0x) for digital services and 5.5x (from 6.5x) for O2C,” said the brokerage.","cleaned_content":"reliance bonus issue billionaire mukesh ambani led reliance industries ltd ril s board passed the issue of bonus shares with a majority in e voting and also fixed the record date the oil to telecom conglomerate said in a regulatory filing to the stock exchanges on wednesday october \u003cONE_TEN\u003e that it has fixed monday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date for the \u003cONE_\u003e \u003cONE_\u003e issue of free shares ril board approved the bonus issue in the ratio \u003cONE_\u003e \u003cONE_\u003e on thursday september \u003cFIVE_\u003e which was announced during the oil to telecom conglomerates \u003cFOUR_TEN\u003e th annual general meeting agm late in august the board also approved an increase in authorised share capital from \u003cONE_TEN_THOUSAND\u003e crore to \u003cFIVE_TEN_THOUSAND\u003e crore also read reliance bonus issue announced ril board approves \u003cONE_\u003e \u003cONE_\u003e issue of free shares \u003cFIVE_\u003e key things shareholders must know this is further to our letters dated september \u003cFIVE_\u003e and october \u003cONE_TEN\u003e intimating the approval by the members for the issue of bonus shares in the ratio of \u003cONE_\u003e \u003cONE_\u003e in this regard we wish to inform the company has fixed monday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date to determine the equity shareholders eligible for bonus equity shares of the company said ril in its exchange filing today this marks reliances sixth bonus issue and the first since \u003cTWO_THOUSAND\u003e prior to the bonus issue approved in \u003cTWO_THOUSAND\u003e reliance issued a \u003cONE_\u003e \u003cONE_\u003e bonus share in \u003cTWO_THOUSAND\u003e the bonus shares will be issued by capitalizing from the companys securities premium account general reserves or retained earnings the companys pre bonus paid up capital currently stands at \u003cSIX_THOUSAND\u003e crore consisting of \u003cSIX_HUNDRED\u003e crore equity shares of \u003cONE_TEN\u003e each including partly paid up shares after the bonus issue the paid up capital will double to \u003cONE_TEN_THOUSAND\u003e crore comprising \u003cONE_THOUSAND\u003e crore equity shares the company estimates that \u003cSIX_THOUSAND\u003e crore will be required to implement the bonus issue and the final amount will be based on the paid up capital on the record date also read reliance industries agm \u003cTWO_THOUSAND\u003e ril to consider bonus shares jio ai cloud to issue \u003cONE_HUNDRED\u003e gb free storage \u003cFIVE_\u003e key highlightsril reported a \u003cTHREE_PERCENT\u003e year on year yoy decline in consolidated net profit to \u003cONE_TEN_THOUSAND\u003e crore during the july september quarter from \u003cONE_TEN_THOUSAND\u003e crore in the corresponding quarter a year ago however sequentially or quarter on quarter qoq the behemoths consolidated profit rose by \u003cNINE_PERCENT\u003e in q1fy25 the company reported a profit of \u003cONE_TEN_THOUSAND\u003e crore the company reported a two per cent yoy decline in ebitda to \u003cFOUR_TEN_THOUSAND\u003e crore while the ebitda margin shrank by \u003cFIVE_TEN\u003e bps to \u003cONE_TEN_PERCENT\u003e by the end of q2fy24 the outstanding debt stood at \u003cTHREE_HUNDRED_THOUSAND\u003e crore compared to \u003cTWO_HUNDRED_THOUSAND\u003e crore the revenue rose \u003cZERO_PERCENT\u003e yoy to \u003cTWO_HUNDRED_THOUSAND\u003e crore compared to \u003cTWO_HUNDRED_THOUSAND\u003e crore in the year ago period our performance reflects robust growth in digital services and upstream business this helped partially offset the weak contribution from the o2c oil to chemicals business which was impacted by unfavourable global demand supply dynamics said mukesh d ambani chairman and managing director of ril also read ril bonus issue reliance stock to outperform nifty \u003cFIVE_TEN\u003e in near term here s what jm s technical analysis revealsshares of indias largest company by market cap have provided \u003cONE_TEN_PERCENT\u003e returns to investors in the last year against nifty \u003cFIVE_TEN\u003e s return of \u003cTWO_TEN_PERCENT\u003e and sensexs return of \u003cTWO_TEN_PERCENT\u003e in a technical note domestic brokerage jm financial said all major selling in the stock in the last \u003cONE_TEN\u003e months ended marginally below the \u003cONE_HUNDRED\u003e day ema levels the stock posted gains for the next five consecutive months after reaching a \u003cFIVE_TEN\u003e week low of \u003cTWO_THOUSAND\u003e on october \u003cTWO_TEN\u003e last year this year it has only declined in april down nearly two per cent may down nearly two per cent and july down nearly four per cent on wednesday shares of ril settled \u003cZERO_PERCENT\u003e higher at \u003cTWO_THOUSAND\u003e apiece on the bse domestic brokerage firm elara securities gave the stock an accumulate rating we reduce fy25e \u003cTWO_TEN\u003e e eps by \u003cONE_TEN_PERCENT\u003e \u003cEIGHT_PERCENT\u003e led by lower refining and petchem margins consequently we reiterate accumulate on ril with tp pared to \u003cTHREE_THOUSAND\u003e from \u003cTHREE_THOUSAND\u003e primarily on lower fy26e ebitda we assume \u003cTWO_TEN\u003e x from \u003cTWO_TEN\u003e x fy27e ev ebitda for retail \u003cONE_TEN\u003e x from \u003cONE_TEN\u003e x for digital services and \u003cFIVE_\u003e x from \u003cSIX_\u003e x for o2c said the brokerage","timestamp":"2024-10-16T20:37:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}