{"url":"https://www.livemint.com/market/stock-market-news/oil-prices-gain-2-recouping-some-of-last-week-s-7-loss-11729534303011.html","title":"Oil prices gain 2%, recouping some of last week’s 7% loss","description":"GLOBAL-OIL:Oil prices gain 2%, recouping some of last week's 7% loss","content":"By Arathy SomasekharHOUSTON -Oil prices rose nearly 2% on Monday, recouping some of last week's more than 7% decline, with no let-up of fighting in the Middle East and expected Israeli retaliation on Iran worrying markets about supply from the region.Brent crude futures were up $1.44, or 1.97%, at $74.48 a barrel at 1:45 p.m. ET . U.S. West Texas Intermediate crude futures were $1.66, or nearly 2.3%, higher at $70.82 a barrel.Brent settled more than 7% lower last week, while WTI lost around 8%. Those were the contracts' biggest weekly declines since Sept. 2, due to slowing economic growth in China and falling risk premiums in the Middle East.Israeli forces besieged hospitals and shelters for displaced people in the northern Gaza Strip on Monday as they stepped up operations against Palestinian militants, medics said. Israel also carried out targeted strikes on sites belonging to Hezbollah's financial arm in Lebanon.U.S. Secretary of State Antony Blinken will make another push for a ceasefire when he heads to the Middle East on Monday, the State Department said, seeking to kick-start negotiations to end the Gaza war and also defuse the spillover conflict in Lebanon.U.S. envoy Amos Hochstein will hold talks with Lebanese officials in Beirut on Monday on conditions for a ceasefire between Israel and Hezbollah, two sources told Reuters.\"Crude futures getting a lift this morning as escalated fighting continues in Middle East... Israel is also preparing for more retaliatory attacks likely into Iran,\" said Dennis Kissler, senior vice president of trading at BOK Financial.\"The sell-off in crude over the past two weeks was mostly on long liquidation as the crude market continues to search for an equilibrium between slowing demand and continued unrest in the Middle East,\" he added.China on Monday cut benchmark lending rates as anticipated, part of a broader package of stimulus measures to revive the economy.Data on Friday showed China's economy grew at the slowest pace since early 2023 in the third quarter, fuelling growing concerns about oil demand.China's oil-demand growth is expected to remain weak in 2025 despite recent stimulus measures from Beijing as the world's No. 2 economy electrifies its car fleet and grows at a slower pace, the head of the International Energy Agency said on Monday.Saudi Aramco's CEO told an energy conference in Singapore on Monday that he was still \"fairly bullish\" on China's oil demand in light of stepped-up policy support aimed at boosting growth, and on rising demand for jet fuel and liquid-to-chemicals.The U.S. Energy Information Administration said last week that weekly oilfield production rose by 100,000 barrels per day to a record 13.5 million bpd during the week ended Oct. 11.U.S. crude oil stockpiles likely rose by about 100,000 barrels last week, while distillate and gasoline inventories were seen down, a preliminary Reuters poll showed on Monday.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"by arathy somasekharhouston oil prices rose nearly \u003cTWO_PERCENT\u003e on monday recouping some of last weeks more than \u003cSEVEN_PERCENT\u003e decline with no let up of fighting in the middle east and expected israeli retaliation on iran worrying markets about supply from the region brent crude futures were up \u003cONE_\u003e or \u003cONE_PERCENT\u003e at \u003cSEVEN_TEN\u003e a barrel at \u003cONE_\u003e \u003cFOUR_TEN\u003e p m et u s west texas intermediate crude futures were \u003cONE_\u003e or nearly \u003cTWO_PERCENT\u003e higher at \u003cSEVEN_TEN\u003e a barrel brent settled more than \u003cSEVEN_PERCENT\u003e lower last week while wti lost around \u003cEIGHT_PERCENT\u003e those were the contracts biggest weekly declines since sept \u003cTWO_\u003e due to slowing economic growth in china and falling risk premiums in the middle east israeli forces besieged hospitals and shelters for displaced people in the northern gaza strip on monday as they stepped up operations against palestinian militants medics said israel also carried out targeted strikes on sites belonging to hezbollahs financial arm in lebanon u s secretary of state antony blinken will make another push for a ceasefire when he heads to the middle east on monday the state department said seeking to kick start negotiations to end the gaza war and also defuse the spillover conflict in lebanon u s envoy amos hochstein will hold talks with lebanese officials in beirut on monday on conditions for a ceasefire between israel and hezbollah two sources told reuters crude futures getting a lift this morning as escalated fighting continues in middle east israel is also preparing for more retaliatory attacks likely into iran said dennis kissler senior vice president of trading at bok financial the sell off in crude over the past two weeks was mostly on long liquidation as the crude market continues to search for an equilibrium between slowing demand and continued unrest in the middle east he added china on monday cut benchmark lending rates as anticipated part of a broader package of stimulus measures to revive the economy data on friday showed chinas economy grew at the slowest pace since early \u003cTWO_THOUSAND\u003e in the third quarter fuelling growing concerns about oil demand chinas oil demand growth is expected to remain weak in \u003cTWO_THOUSAND\u003e despite recent stimulus measures from beijing as the worlds no \u003cTWO_\u003e economy electrifies its car fleet and grows at a slower pace the head of the international energy agency said on monday saudi aramcos ceo told an energy conference in singapore on monday that he was still fairly bullish on chinas oil demand in light of stepped up policy support aimed at boosting growth and on rising demand for jet fuel and liquid to chemicals the u s energy information administration said last week that weekly oilfield production rose by \u003cONE_HUNDRED_THOUSAND\u003e barrels per day to a record \u003cONE_TEN\u003e million bpd during the week ended oct \u003cONE_TEN\u003e u s crude oil stockpiles likely rose by about \u003cONE_HUNDRED_THOUSAND\u003e barrels last week while distillate and gasoline inventories were seen down a preliminary reuters poll showed on monday this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-21T23:41:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}