{"url":"https://www.livemint.com/market/stock-market-news/kotak-institutional-equities-remains-cautious-on-indian-market-despite-october-dip-as-valuation-concerns-linger-11729576770542.html","title":"Kotak Institutional Equities remains cautious on Indian market despite October dip; here’s why","description":"Nifty 50 and Sensex have each declined by over 4% in October so far. From their respective peaks, both indices have corrected nearly 6%. Despite this notable correction, domestic brokerage firm Kotak Institutional Equities maintains that the current valuations remain unattractive.","content":"Indian markets experienced a significant reversal in October following a relentless nine-month rally, which had positioned them as the most expensive in terms of valuations globally. This shift was underscored by foreign portfolio investors (FPIs) pulling out a record amount of  ₹82,479 crore from Indian equities in October so far.Analysts have been warning about the unsustainable valuations of Indian stocks, suggesting that a correction is imminent. They point out that the market has not witnessed any substantial pullback since the COVID-19 pandemic, which raises alarms about potential vulnerabilities.Amid this backdrop, both Nifty 50 and Sensex have each declined by over 4% in October so far. From their respective peaks, both indices have corrected nearly 6%. Despite this notable correction, domestic brokerage firm Kotak Institutional Equities maintains that the current valuations remain unattractive.In its recent note, the brokerage firm expressed concerns about the current state of market valuations, stating that they are exceedingly high across most sectors. It emphasised that the multiples for nearly all sectors—excluding banks—are significantly above their pre-pandemic levels.This elevated valuation persists despite several factors, including lower growth rates in most sectors (excluding investment stocks) compared to pre-pandemic levels, stable cost of equity based on 10-year bond yields in India, and a heightened threat of disruption across various industries.“There is no change in our cautious view of the market despite the recent correction in the market (modest in the large-cap stocks and large in certain mid-and small-cap stocks),\" said the brokerage.It noted that most areas of the market continue to trade at full-to-frothy valuations, indicating a lack of genuine value when assessed through traditional metrics. The brokerage pointed out that this lack of value is not only due to unrealistic growth and profitability assumptions—often retrofitted from the latest stock prices—but also because relative valuations become meaningless when all stocks within a sector are trading at inflated prices.\"Lastly, it remains to be seen as to how long retail investors stay agnostic about prices and valuations and continue to bid/buy stocks at all price levels, as they have done over the past 15-18 months. The recent sharp correction in some of the ‘narrative’ sectors and stocks may have brought a much-needed dose of realism to a section of investors. However, the overall market sentiment is still quite euphoric,\" said the brokerage.The brokerage has analysed the 2QFY25 results so far and suggests a broad-based slowdown in the Indian economy. Many companies have disappointed against modest expectations regarding net sales, EBITDA, and net profits.It said consumer companies have reported weak prints, with commentary suggesting a challenging demand environment. IT companies reported unexciting numbers, and their commentary suggests a gradual recovery ahead. Banks have done reasonably well, with moderate credit growth (YoY) and stable NIMs and asset quality (QoQ).It also highlighted that continued price increases implemented by various companies have squeezed household affordability and intensified competition from unorganised players. Retailers such as DMart and Reliance Retail reported muted numbers, given the stiff competition from new entrants.The unexpected success of brands like Zudio/Trent in apparel and the rise of quick commerce in household products underscore the risks of disruption, even for established players now facing new threats.Furthermore, the brokerage observed that consumer-facing companies are struggling to maintain their elevated margins, with both automobile and consumer companies experiencing margin compression alongside volume challenges.Both automobile and consumer companies have taken large price hikes in the past 3-5 years, and consumer staples companies have vacated lower price points, which has resulted in downtrading among a sector of consumers due to affordability issues and regional players occupying vacant or vacated spaces, it said.Kotak Institutional Equities cautions that significant downside risks exist regarding elevated profitability assumptions for these companies.","cleaned_content":"indian markets experienced a significant reversal in october following a relentless nine month rally which had positioned them as the most expensive in terms of valuations globally this shift was underscored by foreign portfolio investors fpis pulling out a record amount of \u003cEIGHT_TEN_THOUSAND\u003e crore from indian equities in october so far analysts have been warning about the unsustainable valuations of indian stocks suggesting that a correction is imminent they point out that the market has not witnessed any substantial pullback since the covid \u003cONE_TEN\u003e pandemic which raises alarms about potential vulnerabilities amid this backdrop both nifty \u003cFIVE_TEN\u003e and sensex have each declined by over \u003cFOUR_PERCENT\u003e in october so far from their respective peaks both indices have corrected nearly \u003cSIX_PERCENT\u003e despite this notable correction domestic brokerage firm kotak institutional equities maintains that the current valuations remain unattractive in its recent note the brokerage firm expressed concerns about the current state of market valuations stating that they are exceedingly high across most sectors it emphasised that the multiples for nearly all sectors excluding banks are significantly above their pre pandemic levels this elevated valuation persists despite several factors including lower growth rates in most sectors excluding investment stocks compared to pre pandemic levels stable cost of equity based on \u003cONE_TEN\u003e year bond yields in india and a heightened threat of disruption across various industries there is no change in our cautious view of the market despite the recent correction in the market modest in the large cap stocks and large in certain mid and small cap stocks said the brokerage it noted that most areas of the market continue to trade at full to frothy valuations indicating a lack of genuine value when assessed through traditional metrics the brokerage pointed out that this lack of value is not only due to unrealistic growth and profitability assumptions often retrofitted from the latest stock prices but also because relative valuations become meaningless when all stocks within a sector are trading at inflated prices lastly it remains to be seen as to how long retail investors stay agnostic about prices and valuations and continue to bid buy stocks at all price levels as they have done over the past \u003cONE_TEN\u003e \u003cONE_TEN\u003e months the recent sharp correction in some of the narrative sectors and stocks may have brought a much needed dose of realism to a section of investors however the overall market sentiment is still quite euphoric said the brokerage the brokerage has analysed the \u003cTWO_\u003e qfy25 results so far and suggests a broad based slowdown in the indian economy many companies have disappointed against modest expectations regarding net sales ebitda and net profits it said consumer companies have reported weak prints with commentary suggesting a challenging demand environment it companies reported unexciting numbers and their commentary suggests a gradual recovery ahead banks have done reasonably well with moderate credit growth yoy and stable nims and asset quality qoq it also highlighted that continued price increases implemented by various companies have squeezed household affordability and intensified competition from unorganised players retailers such as dmart and reliance retail reported muted numbers given the stiff competition from new entrants the unexpected success of brands like zudio trent in apparel and the rise of quick commerce in household products underscore the risks of disruption even for established players now facing new threats furthermore the brokerage observed that consumer facing companies are struggling to maintain their elevated margins with both automobile and consumer companies experiencing margin compression alongside volume challenges both automobile and consumer companies have taken large price hikes in the past \u003cTHREE_\u003e \u003cFIVE_\u003e years and consumer staples companies have vacated lower price points which has resulted in downtrading among a sector of consumers due to affordability issues and regional players occupying vacant or vacated spaces it said kotak institutional equities cautions that significant downside risks exist regarding elevated profitability assumptions for these companies","timestamp":"2024-10-22T13:38:00+05:30","market_timestamp":"2024-10-22T13:38:00+05:30","off_market_hours":false}