{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-teamo-productions-hq-below-rs-2-hits-upper-circuit-after-q2-results-2024-11729055177762.html","title":"Penny stock below  ₹2 hits upper circuit as Q2 net profit surges over 400% YoY","description":"Penny Stock: Teamo Productions HQ shares surged 5% to  ₹1.48 after reporting a 436% increase in net profit increase for Q2FY25 to  ₹1.5 crore. Total income grew 21% to  ₹146.3 crore, indicating strong operational efficiency despite market challenges.","content":"Penny stock Teamo Productions HQ hit the 5 per cent upper circuit at  ₹1.48 on Wednesday, October 16, following the announcement of robust financial results for the quarter ended September 2024 (Q2FY25). The company’s net profit witnessed an extraordinary rise of 436 per cent to  ₹1.5 crore, compared to  ₹0.28 crore in the same quarter last year. Sequentially, the net profit increased slightly from  ₹1.47 crore in the June quarter, reflecting sustained momentum.Teamo Productions HQ also reported a significant growth in its total income for Q2FY25, which increased by 21 per cent to  ₹146.3 crore, up from  ₹121 crore in the corresponding period last year. This marks an improvement from the June quarter when the company recorded a total income of  ₹115 crore.For the first half of the current financial year (H1FY25), the company’s net profit surged by 146 per cent to approximately  ₹3 crore, up from  ₹1.22 crore in the same period last year. Meanwhile, total income for H1FY25 climbed 22 per cent to  ₹261.4 crore, compared to  ₹214.5 crore in H1FY24.Teamo Productions HQ share price has delivered a mixed performance over the last year, but overall returns have been notable. The penny stock has appreciated around 15 per cent over the past year and is up 34.5 per cent year-to-date. The scrip has posted positive returns in five out of the 10 months of this year.The stock has rallied more than 12 per cent so far in October, reversing a two-month losing streak. The stock declined 16.5 per cent in September and about 2 per cent in August. Prior to this, Teamo Productions HQ posted two months of gains, rising 7.3 per cent in July and 30.4 per cent in June. However, it faced correction in the preceding three months, losing 4 per cent in May, 7.7 per cent in April, and 3.7 per cent in March. It began the year on a positive note, gaining 17.4 per cent in February and 4.5 per cent in January.As of today, the stock is 21 per cent away from its 52-week high of  ₹1.87, which was recorded in July 2024. It has also recovered by 48 per cent from its 52-week low of Re 1, touched in November 2023, signalling a substantial rebound from previous lows.Teamo Productions HQ has demonstrated impressive financial growth in recent quarters, leading to a positive response from investors. The stock’s recovery in October, following its recent downturn, suggests renewed investor confidence backed by solid earnings performance.However, as the stock remains 21 per cent below its 52-week high, it may present opportunities for further upside, especially if the company continues to deliver strong results in the coming quarters.","cleaned_content":"penny stock teamo productions hq hit the \u003cFIVE_PERCENT\u003e upper circuit at \u003cONE_\u003e on wednesday october \u003cONE_TEN\u003e following the announcement of robust financial results for the quarter ended september \u003cTWO_THOUSAND\u003e q2fy25 the company s net profit witnessed an extraordinary rise of \u003cFOUR_HUNDRED_PERCENT\u003e to \u003cONE_\u003e crore compared to \u003cZERO_\u003e crore in the same quarter last year sequentially the net profit increased slightly from \u003cONE_\u003e crore in the june quarter reflecting sustained momentum teamo productions hq also reported a significant growth in its total income for q2fy25 which increased by \u003cTWO_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e crore up from \u003cONE_HUNDRED\u003e crore in the corresponding period last year this marks an improvement from the june quarter when the company recorded a total income of \u003cONE_HUNDRED\u003e crore for the first half of the current financial year h1fy25 the company s net profit surged by \u003cONE_HUNDRED_PERCENT\u003e to approximately \u003cTHREE_\u003e crore up from \u003cONE_\u003e crore in the same period last year meanwhile total income for h1fy25 climbed \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_HUNDRED\u003e crore compared to \u003cTWO_HUNDRED\u003e crore in h1fy24 teamo productions hq share price has delivered a mixed performance over the last year but overall returns have been notable the penny stock has appreciated around \u003cONE_TEN_PERCENT\u003e over the past year and is up \u003cTHREE_TEN_PERCENT\u003e year to date the scrip has posted positive returns in five out of the \u003cONE_TEN\u003e months of this year the stock has rallied more than \u003cONE_TEN_PERCENT\u003e so far in october reversing a two month losing streak the stock declined \u003cONE_TEN_PERCENT\u003e in september and about \u003cTWO_PERCENT\u003e in august prior to this teamo productions hq posted two months of gains rising \u003cSEVEN_PERCENT\u003e in july and \u003cTHREE_TEN_PERCENT\u003e in june however it faced correction in the preceding three months losing \u003cFOUR_PERCENT\u003e in may \u003cSEVEN_PERCENT\u003e in april and \u003cTHREE_PERCENT\u003e in march it began the year on a positive note gaining \u003cONE_TEN_PERCENT\u003e in february and \u003cFOUR_PERCENT\u003e in january as of today the stock is \u003cTWO_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cONE_\u003e which was recorded in july \u003cTWO_THOUSAND\u003e it has also recovered by \u003cFOUR_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of re \u003cONE_\u003e touched in november \u003cTWO_THOUSAND\u003e signalling a substantial rebound from previous lows teamo productions hq has demonstrated impressive financial growth in recent quarters leading to a positive response from investors the stock s recovery in october following its recent downturn suggests renewed investor confidence backed by solid earnings performance however as the stock remains \u003cTWO_TEN_PERCENT\u003e below its \u003cFIVE_TEN\u003e week high it may present opportunities for further upside especially if the company continues to deliver strong results in the coming quarters","timestamp":"2024-10-16T11:07:00+05:30","market_timestamp":"2024-10-16T11:07:00+05:30","off_market_hours":false}