{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-fall-for-third-session-in-a-row-investors-lose-over-6-lakh-crore-in-a-day-11729158989004.html","title":"Sensex drops for third consecutive session; investors lose  ₹6 lakh crore in a day; key factors driving the market down","description":"Stock market today: Indian stock market benchmarks- the Sensex and the Nifty 50- closed in negative territory for the third consecutive session on Thursday.","content":"Stock market today: Indian stock market benchmarks- the Sensex and the Nifty 50- closed in negative territory for the third consecutive session on Thursday, October 17. Sensex closed with a loss of 495 points, or 0.61 per cent, at 81,007, while the Nifty 50 ended 221 points, or 0.89 per cent, lower at 24,749.85.Shares of Nestle, Mahindra and Mahindra and UltraTech Cement closed as the top losers in the Sensex index. On the other hand, Infosys, Tech Mahindra, and Power Grid were the top gainers in the index.The mid and smallcap segments suffered deeper losses. The BSE Midcap index plunged 1.65 per cent, while the BSE Smallcap index declined 1.42 per cent.The overall market capitalisation of BSE-listed firms listed on the BSE plunged to nearly  ₹457.3 lakh crore from nearly  ₹463.3 lakh crore in the previous session, making investors poorer by about  ₹6 lakh crore in a day.\"Markets continued its downward trajectory despite firm US and European cues, as foreign fund selling coupled with a sharp fall in automobile stocks ahead of the final day's IPO subscription of Hyundai weighed on sentiment. As expensive valuations continue to bite, banking, realty, metals and telecom shares also attracted significant profit-taking,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities.Barring Nifty IT, which rose 1.19 per cent, all sectoral indices ended with losses, with Nifty Realty (down 3.76 per cent), Auto (down 3.54 per cent), Consumer Durables (down 2.20 per cent) and Media (down 2.18 per cent) ending with deep cuts.The Nifty 50 has fallen about 1.5 per cent in the last three sessions. The index is now down 6 per cent from its all-time high of 26,277.35 which it hit on September 27 this year.The recent market fall could be attributed to a confluence of several headwinds, including a fresh escalation of tensions in West Asia, strong foreign capital outflow after China's stimulus announcements, and unimpressive Q2 earnings so far.The precarious situation in West Asia has led to volatile crude oil prices, leaving investors on edge. As India is one of the largest oil importers, fluctuating oil prices can negatively impact its fiscal maths and pressure the rupee.Foreign capital outflow has been a key factor in the recent market downturn. In October, foreign portfolio investors (FPIs) sold Indian equities daily, with total sales amounting to  ₹67,311 crore as of October 16.Disappointing earnings in the September quarter have increased worries about the market's high valuations.Good earnings are essential to support these valuations. Strong earnings growth justifies higher stock prices, keeps valuation measures like the P/E ratio balanced, and boosts investor confidence. Without strong earnings, it becomes hard to justify high valuations, putting stock prices at risk of falling.\"The domestic market experienced significant losses driven by widespread selloffs across various sectors. This downturn was attributed to weaker sales forecasts for the festive season, high NPAs and slow credit growth. Weak Q2 result is affecting the market sentiment,\" said Vinod Nair, the head of research at Geojit Financial Services.According to Shrikant Chouhan, the head of equity research at Kotak Securities, the Nifty 50 has formed a bearish candle, and on intraday charts, it is holding a lower top formation.\"We are of the view that the market texture is weak, and as long as the Nifty 50 trades below 24,900, weak sentiment is likely to continue. On the downside, the index could slip to 24,550-24,500. On the flip side, above 24,825, we could see a one quick pullback rally to 24,850-24,900,\" said Chouhan.Rupak De, Senior Technical Analyst at LKP Securities, underscored that on the daily chart, the Nifty 50 has broken down from a bearish flag pattern, suggesting a possible downward move in the short term. The RSI is showing a bearish crossover and is declining.However, De added that this might not be the ideal level to initiate short positions, as the index has experienced a steep correction and is near double-bottom support, which could trigger a near-term recovery toward 25,000.De said a decisive fall below 24,700 could lead to a significant correction in the market.Read all market-related news here","cleaned_content":"stock market today indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e closed in negative territory for the third consecutive session on thursday october \u003cONE_TEN\u003e sensex closed with a loss of \u003cFOUR_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e ended \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e shares of nestle mahindra and mahindra and ultratech cement closed as the top losers in the sensex index on the other hand infosys tech mahindra and power grid were the top gainers in the index the mid and smallcap segments suffered deeper losses the bse midcap index plunged \u003cONE_PERCENT\u003e while the bse smallcap index declined \u003cONE_PERCENT\u003e the overall market capitalisation of bse listed firms listed on the bse plunged to nearly \u003cFOUR_HUNDRED\u003e lakh crore from nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors poorer by about \u003cSIX_\u003e lakh crore in a day markets continued its downward trajectory despite firm us and european cues as foreign fund selling coupled with a sharp fall in automobile stocks ahead of the final days ipo subscription of hyundai weighed on sentiment as expensive valuations continue to bite banking realty metals and telecom shares also attracted significant profit taking said prashanth tapse senior vp research mehta equities barring nifty it which rose \u003cONE_PERCENT\u003e all sectoral indices ended with losses with nifty realty down \u003cTHREE_PERCENT\u003e auto down \u003cTHREE_PERCENT\u003e consumer durables down \u003cTWO_PERCENT\u003e and media down \u003cTWO_PERCENT\u003e ending with deep cuts the nifty \u003cFIVE_TEN\u003e has fallen about \u003cONE_PERCENT\u003e in the last three sessions the index is now down \u003cSIX_PERCENT\u003e from its all time high of \u003cTWO_TEN_THOUSAND\u003e which it hit on september \u003cTWO_TEN\u003e this year the recent market fall could be attributed to a confluence of several headwinds including a fresh escalation of tensions in west asia strong foreign capital outflow after chinas stimulus announcements and unimpressive q2 earnings so far the precarious situation in west asia has led to volatile crude oil prices leaving investors on edge as india is one of the largest oil importers fluctuating oil prices can negatively impact its fiscal maths and pressure the rupee foreign capital outflow has been a key factor in the recent market downturn in october foreign portfolio investors fpis sold indian equities daily with total sales amounting to \u003cSIX_TEN_THOUSAND\u003e crore as of october \u003cONE_TEN\u003e disappointing earnings in the september quarter have increased worries about the markets high valuations good earnings are essential to support these valuations strong earnings growth justifies higher stock prices keeps valuation measures like the p e ratio balanced and boosts investor confidence without strong earnings it becomes hard to justify high valuations putting stock prices at risk of falling the domestic market experienced significant losses driven by widespread selloffs across various sectors this downturn was attributed to weaker sales forecasts for the festive season high npas and slow credit growth weak q2 result is affecting the market sentiment said vinod nair the head of research at geojit financial services according to shrikant chouhan the head of equity research at kotak securities the nifty \u003cFIVE_TEN\u003e has formed a bearish candle and on intraday charts it is holding a lower top formation we are of the view that the market texture is weak and as long as the nifty \u003cFIVE_TEN\u003e trades below \u003cTWO_TEN_THOUSAND\u003e weak sentiment is likely to continue on the downside the index could slip to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the flip side above \u003cTWO_TEN_THOUSAND\u003e we could see a one quick pullback rally to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e said chouhan rupak de senior technical analyst at lkp securities underscored that on the daily chart the nifty \u003cFIVE_TEN\u003e has broken down from a bearish flag pattern suggesting a possible downward move in the short term the rsi is showing a bearish crossover and is declining however de added that this might not be the ideal level to initiate short positions as the index has experienced a steep correction and is near double bottom support which could trigger a near term recovery toward \u003cTWO_TEN_THOUSAND\u003e de said a decisive fall below \u003cTWO_TEN_THOUSAND\u003e could lead to a significant correction in the market read all market related news here","timestamp":"2024-10-17T16:32:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}