{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-sumeet-bagadia-recommends-five-shares-to-buy-today-11729046831556.html","title":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends a buy-on-dips strategy, suggesting five stocks for today.","content":"Breakout stocks to buy or sell: Indian stock market benchmarks closed lower on Tuesday, October 15, weighed down by losses in key heavyweights like Reliance Industries. In contrast, the midcap and small-cap segments recorded gains, reflecting the ongoing trend of profit-booking in one segment and dip-buying in another. Out of 4,064 stocks that traded on the BSE, 1,986 advanced, while 1,983 declined. Some 95 stocks remained unchanged.Unimpressive Q2 earnings, weak global cues and concerns over sticky inflation persist as key headwinds for the market.The Nifty 50 is expected to start negative on Wednesday, tracking weak global cues. US stock market indices ended lower on Tuesday, with the technology-heavy Nasdaq falling 1 per cent as chip stocks tumbled and the energy sector falling 3 per cent.Sumeet Bagadia, Executive Director at Choice Broking, believes the underlying sentiment of the market is sideways to positive, and one should maintain a buy-on-dips strategy.Bagadia observed that the Nifty 50 has made a significant base at 24,900, but the index has key resistance at 25,300. As long as the index remains above 24,900, one should continue buying on dips.\"The Nifty 50 index is finding resistance at 25,300, whereas it has made a strong base at 24,900. However, the 50-stock index is sustained above 25,000, which means the overall sentiment is sideways to positive. So, one can maintain buy-on-dips until 24,900 support remains sacrosanct,\" said Bagadia.Bagadia suggests that day traders should maintain a stock-specific approach, focusing on breakout stocks for intraday trading.Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: SIL Investments, Sundaram Finance Holdings, Igarashi Motors India, Vijaya Diagnostic Centre and SMC Global Securities.1. SIL Investments | Buy at  ₹655 | Target price:  ₹700 | Stop loss:  ₹6352. Sundaram Finance Holdings | Buy at  ₹374 | Target price:  ₹400 | Stop loss:  ₹3603. Igarashi Motors India | Buy at  ₹697.7 | Target price:  ₹750 | Stop loss:  ₹6754. Vijaya Diagnostic Centre | Buy at  ₹1,107.65 | Target price:  ₹1,188 | Stop loss:  ₹1,0705. SMC Global Securities | Buy at  ₹163 | Target price:  ₹175 | Stop loss:  ₹158Read all market-related news here","cleaned_content":"breakout stocks to buy or sell indian stock market benchmarks closed lower on tuesday october \u003cONE_TEN\u003e weighed down by losses in key heavyweights like reliance industries in contrast the midcap and small cap segments recorded gains reflecting the ongoing trend of profit booking in one segment and dip buying in another out of \u003cFOUR_THOUSAND\u003e stocks that traded on the bse \u003cONE_THOUSAND\u003e advanced while \u003cONE_THOUSAND\u003e declined some \u003cNINE_TEN\u003e stocks remained unchanged unimpressive q2 earnings weak global cues and concerns over sticky inflation persist as key headwinds for the market the nifty \u003cFIVE_TEN\u003e is expected to start negative on wednesday tracking weak global cues us stock market indices ended lower on tuesday with the technology heavy nasdaq falling \u003cONE_PERCENT\u003e as chip stocks tumbled and the energy sector falling \u003cTHREE_PERCENT\u003e sumeet bagadia executive director at choice broking believes the underlying sentiment of the market is sideways to positive and one should maintain a buy on dips strategy bagadia observed that the nifty \u003cFIVE_TEN\u003e has made a significant base at \u003cTWO_TEN_THOUSAND\u003e but the index has key resistance at \u003cTWO_TEN_THOUSAND\u003e as long as the index remains above \u003cTWO_TEN_THOUSAND\u003e one should continue buying on dips the nifty \u003cFIVE_TEN\u003e index is finding resistance at \u003cTWO_TEN_THOUSAND\u003e whereas it has made a strong base at \u003cTWO_TEN_THOUSAND\u003e however the \u003cFIVE_TEN\u003e stock index is sustained above \u003cTWO_TEN_THOUSAND\u003e which means the overall sentiment is sideways to positive so one can maintain buy on dips until \u003cTWO_TEN_THOUSAND\u003e support remains sacrosanct said bagadia bagadia suggests that day traders should maintain a stock specific approach focusing on breakout stocks for intraday trading regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares sil investments sundaram finance holdings igarashi motors india vijaya diagnostic centre and smc global securities 1 sil investments buy at \u003cSIX_HUNDRED\u003e target price \u003cSEVEN_HUNDRED\u003e stop loss \u003cSIX_THOUSAND\u003e sundaram finance holdings buy at \u003cTHREE_HUNDRED\u003e target price \u003cFOUR_HUNDRED\u003e stop loss \u003cTHREE_THOUSAND\u003e igarashi motors india buy at \u003cSIX_HUNDRED\u003e target price \u003cSEVEN_HUNDRED\u003e stop loss \u003cSIX_THOUSAND\u003e vijaya diagnostic centre buy at \u003cONE_THOUSAND\u003e target price \u003cONE_THOUSAND\u003e stop loss \u003cONE_TEN_THOUSAND\u003e smc global securities buy at \u003cONE_HUNDRED\u003e target price \u003cONE_HUNDRED\u003e stop loss \u003cONE_HUNDRED\u003e read all market related news here","timestamp":"2024-10-16T08:26:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}