{"url":"https://www.livemint.com/market/stock-market-news/koltepatil-developers-shares-surge-14-on-achieving-record-q2fy25-sales-11729138338158.html","title":"Kolte-Patil Developers shares surge 14% on achieving record Q2FY25 sales","description":"Kolte-Patil Developers share price increased by 14% to  ₹446.35 after achieving record quarterly sales of  ₹770 crore in Q2FY25, with the luxury 24K segment driving growth. The company's shares have delivered a 75% return in last 6 months.","content":"Shares of Kolte-Patil Developers, a leading Pune-based real estate player, jumped 14% to  ₹446.35 per share in early trade on Thursday, October 17 as the company's impressive business performance in the second quarter of fiscal 2025 (Q2FY25) boosted investor sentiment.The company recorded its highest-ever quarterly sales value of  ₹770 crore in Q2FY25, fueled by its 24K premium luxury segment, which contributed 30% to sales during the quarter. Sales for the first half of FY25 reached  ₹1,481 crore, marking an 11% year-on-year (YoY) improvement over  ₹1,333 crore in H1FY24.The company achieved quarterly sales volumes of 1.03 million sq. ft. in Q2FY25 and 1.99 million sq. ft. for H1FY25. Average realisations improved by 16% YoY to  ₹7,472 per square foot, with premium projects at Life Republic (LR) and 24K in Baner and Pimple Nilakh driving the increase, as per the company's regulatory filing.However, collections in the September 2024 quarter moderated to  ₹550 crore from  ₹612 crore in the June 2024 quarter but showed an upward trend compared to  ₹472 crore in the same period last year.Additionally, during the quarter, CRISIL upgraded Kolte-Patil Developers' long-term rating on bank loan financing to AA- from A+ and its short-term rating to A1+ from A1, with the rating outlook revised to 'stable' from 'positive'.Commenting on the performance, Atul Bohra, Group CEO, Kolte-Patil Developers Limited, said, “I am happy to announce that we have achieved our highest-ever quarterly sales performance, a testament to the market’s confidence in our offerings and execution capabilities. Our collections hit an all-time high in the first half of the year, reflecting the strong execution discipline we maintain across projects.\"\"Our 24K premium luxury segment continues to gain momentum, with the 24K segment contributing 30% to our sales in Q2FY25, reflecting the demand shift toward aspirational living. Also, Life Republic township project has seen sustained volumes. Backed by a strong pipeline of launches planned in the second half of the year, we are confident about meeting our pre-sales target of  ₹3,500 crore for FY25. With robust industry trends supporting housing demand, especially in premium categories, we remain well-positioned to capitalize on the growing opportunity,\" Atul Bohra added.Over the past 18 months, the company's shares have surged from  ₹252 per share to the current trading price of  ₹442, representing an impressive gain of 75.40%. Since hitting a low of  ₹103 in March 2020, the stock has skyrocketed by 330%.As a leading real estate firm, the company boasts a dominant presence in the Pune residential market while expanding its footprint in Mumbai and Bengaluru. To date, it has developed and constructed over 64 projects, including residential complexes, integrated townships, commercial properties, and IT parks, covering a saleable area exceeding 28 million square feet across Pune, Mumbai, and Bengaluru.","cleaned_content":"shares of kolte patil developers a leading pune based real estate player jumped \u003cONE_TEN_PERCENT\u003e to \u003cFOUR_HUNDRED\u003e per share in early trade on thursday october \u003cONE_TEN\u003e as the companys impressive business performance in the second quarter of fiscal \u003cTWO_THOUSAND\u003e q2fy25 boosted investor sentiment the company recorded its highest ever quarterly sales value of \u003cSEVEN_HUNDRED\u003e crore in q2fy25 fueled by its \u003cTWO_TEN\u003e k premium luxury segment which contributed \u003cTHREE_TEN_PERCENT\u003e to sales during the quarter sales for the first half of fy25 reached \u003cONE_THOUSAND\u003e crore marking an \u003cONE_TEN_PERCENT\u003e year on year yoy improvement over \u003cONE_THOUSAND\u003e crore in h1fy24 the company achieved quarterly sales volumes of \u003cONE_\u003e million sq ft in q2fy25 and \u003cONE_\u003e million sq ft for h1fy25 average realisations improved by \u003cONE_TEN_PERCENT\u003e yoy to \u003cSEVEN_THOUSAND\u003e per square foot with premium projects at life republic lr and \u003cTWO_TEN\u003e k in baner and pimple nilakh driving the increase as per the companys regulatory filing however collections in the september \u003cTWO_THOUSAND\u003e quarter moderated to \u003cFIVE_HUNDRED\u003e crore from \u003cSIX_HUNDRED\u003e crore in the june \u003cTWO_THOUSAND\u003e quarter but showed an upward trend compared to \u003cFOUR_HUNDRED\u003e crore in the same period last year additionally during the quarter crisil upgraded kolte patil developers long term rating on bank loan financing to aa from a and its short term rating to a1 from a1 with the rating outlook revised to stable from positive commenting on the performance atul bohra group ceo kolte patil developers limited said i am happy to announce that we have achieved our highest ever quarterly sales performance a testament to the market s confidence in our offerings and execution capabilities our collections hit an all time high in the first half of the year reflecting the strong execution discipline we maintain across projects our \u003cTWO_TEN\u003e k premium luxury segment continues to gain momentum with the \u003cTWO_TEN\u003e k segment contributing \u003cTHREE_TEN_PERCENT\u003e to our sales in q2fy25 reflecting the demand shift toward aspirational living also life republic township project has seen sustained volumes backed by a strong pipeline of launches planned in the second half of the year we are confident about meeting our pre sales target of \u003cTHREE_THOUSAND\u003e crore for fy25 with robust industry trends supporting housing demand especially in premium categories we remain well positioned to capitalize on the growing opportunity atul bohra added over the past \u003cONE_TEN\u003e months the companys shares have surged from \u003cTWO_HUNDRED\u003e per share to the current trading price of \u003cFOUR_HUNDRED\u003e representing an impressive gain of \u003cSEVEN_TEN_PERCENT\u003e since hitting a low of \u003cONE_HUNDRED\u003e in march \u003cTWO_THOUSAND\u003e the stock has skyrocketed by \u003cTHREE_HUNDRED_PERCENT\u003e as a leading real estate firm the company boasts a dominant presence in the pune residential market while expanding its footprint in mumbai and bengaluru to date it has developed and constructed over \u003cSIX_TEN\u003e projects including residential complexes integrated townships commercial properties and it parks covering a saleable area exceeding \u003cTWO_TEN\u003e million square feet across pune mumbai and bengaluru","timestamp":"2024-10-17T11:04:00+05:30","market_timestamp":"2024-10-17T11:04:00+05:30","off_market_hours":false}