{"url":"https://www.livemint.com/market/stock-market-news/axis-bank-zomato-more-kotak-securities-lists-8-stock-picks-for-diwali-2024-11729585079779.html","title":"Axis Bank, Zomato \u0026 more: Kotak Securities lists 8 stock picks for Diwali 2024","description":"Diwali stock picks: Kotak Securities advised that any market correction should be seen as an opportunity to add quality stocks with attractive valuations for long-term investment. It has identified eight potential stock ideas that are expected to perform well in Samvat 2081.","content":"Indian markets made history during Samvat 2080 by reaching new milestones, with the Nifty crossing 26,250 and the BSE Sensex surpassing 85,900 in September 2024. Both indices saw gains of around 25 per cent during the period. However, Kotak Securities observed that most sectors and stocks appear overvalued, with the degree of overvaluation varying from low in large-cap consumer, IT services, and pharmaceuticals to medium in the investment space and high in several low-quality companies.Given the rich broader market valuations, Kotak Securities advised that any market correction should be seen as an opportunity to add quality stocks with attractive valuations for long-term investment. Based on their market analysis, Kotak Securities identified eight potential stock ideas expected to perform well in Samvat 2081.The brokerage stated that Aadhar Housing Finance, a large affordable housing finance company with  ₹21,100 crore of AUM in FY24, holds a 7 per cent market share in the affordable segment. With a long track record and a well-diversified geographical presence and customer base, the company's multipronged expansion and appraisal strategy is expected to drive a 21 per cent AUM CAGR from FY24 to FY27. Stable margins and improving leverage will push RoEs back to the high teens, it noted.As per the brokerage, Aadhar Housing stands out among its peers due to its larger balance sheet, longer operating history, and geographically diverse AUM, with no state contributing more than 15 per cent. The company has also demonstrated strong asset quality over the years, it added.The brokerage noted that Axis Bank's business execution aligned with expectations, driven by its GPS strategy aimed at building a strong franchise. Regarding deposits, management maintained its view that the granular and focused initiatives would, over time, enable the bank to grow faster than the industry average. As for loan mix, the bank plans to continue building a profitable portfolio and is confident in delivering better risk-adjusted growth, it stated.As per the brokerage, the bank's current valuations have addressed most key concerns, positioning it as one of the best opportunities among large private banks. The brokerage reiterated its BUY rating with a fair value of  ₹1,500, valuing the bank at around 2.2x book and 15x FY2026E EPS, targeting RoEs of about 15 per cent.Kotak Securities highlighted Fiem as a leading tier-1 manufacturer of automotive lighting and rearview mirrors, primarily catering to two-wheeler OEMs. The brokerage noted that Fiem is well-positioned to benefit from the recovery in the two-wheeler industry, with a strong presence among key players in this segment as well as among two-wheeler EV manufacturers. The rising adoption of LED lighting in the automotive industry is expected to drive revenue growth for Fiem, as LED-based lamps offer higher content per vehicle compared to halogen lamps. The company is also leveraging its expertise in LED automotive lighting and robust R\u0026D to tap into the four-wheeler segment, which presents significant medium-term growth opportunities, it added.Kotak Securities expects Fiem's revenue to grow healthily over FY24-25E, with earnings projected to rise at a 19 per cent CAGR from FY24 to FY27E. Additionally, the brokerage emphasised Fiem’s debt-free balance sheet and robust cash flow generation.Kotak Securities noted that Gravita India is the market leader in India's growing recycling industry, with a particular focus on lead recycling. The company has a wide operational footprint, both in India and overseas. The brokerage highlighted that the organised segment's market share is expected to expand significantly, supported by regulatory tailwinds, positioning Gravita to capture this opportunity. Additionally, penalties imposed on battery OEMs for missing recycling obligations are seen as a positive catalyst for the recycling industry. Gravita is also expanding its recycling capacity by around 72 per cent, targeting approximately 500 kilotons per annum (ktpa) by FY27E, stated the brokerage.Furthermore, it pointed out that the company is diversifying into new recycling segments such as rubber, paper, steel, copper, and lithium, which are expected to drive revenue growth. Kotak Securities projected that Gravita’s earnings per share will grow by 31.8 per cent in FY25E and 31.6 per cent in FY26E.Kotak Securities noted mixed near-term trends but a promising long-term outlook for Godrej Agrovet. The brokerage highlighted subdued prices in the animal feed and downstream businesses but emphasised strength in Astec’s product pipeline, which they found promising. It expects a benefit from palm oil duties starting in Q3FY25. Godrej’s ability to attract talent is expected to support rapid growth in Astec’s CDMO segment.Consolidated earnings for Q1FY25 grew at a healthy double-digit pace year-on-year and Kotak Securities views the acquisition of the 49 per cent minority stake in Godrej Tyson Foods Ltd (GTFL) as incrementaly positive. The brokerage anticipates healthy earnings growth in FY26 and maintained an \"ADD\" rating, assigning a 15X EV/EBITDA multiple to standalone crop protection after the recent stock rally.The brokerage highlighted that JB Chemicals is primarily focused on domestic formulations, with a significant presence in export formulations and a growing CMO business. The share of domestic formulations and CMO in overall sales increased from around 55 per cent in FY2020 to 67 per cent in FY24, observed Kotak.The company also boasts a strong CMO track record and global leadership in lozenge manufacturing. Kotak noted that JB's domestic business benefits from a healthy mix of legacy and acquired brands, which are expected to drive growth. It forecasts JB Chemicals to achieve 14 per cent, 19 per cent, and 22 per cent CAGRs in revenue, EBITDA, and PAT, respectively, over FY24-27E.Kotak Securities noted that S H Kelkar (SHK), a flavours and fragrances (F\u0026F) supplier, has begun to make inroads into the global market and is well-positioned for double-digit revenue growth. While still a small player compared to global majors, SHK's technical capabilities are strong, and it has persevered over the years to see initial success. The company is benefiting from secular growth in the F\u0026F market and gaining market share, supported by its established and long-lasting relationships, it added.It further pointed out that a significant order win from Unilever has further strengthened confidence in SHK's management guidance. With high entry barriers in the F\u0026F industry and potential for margin expansion through higher-margin geographies and operating leverage, Kotak sees a long runway for growth.As per the brokerage, in CY23, Zomato held a gross merchandise value (GMV) market share of around 52 per cent compared to Swiggy's 48 per cent. It also had a wider geographical presence, operating in 750 cities versus Swiggy's 660 cities. Blinkit, Zomato’s rapidly evolving business, is experiencing high growth, expanding into new cities and adding new categories continuously. Kotak Securities expects Zomato to achieve a 44 per cent revenue CAGR over FY24-27E, along with a significant improvement in its EBITDA margin during the same period.","cleaned_content":"indian markets made history during samvat \u003cTWO_THOUSAND\u003e by reaching new milestones with the nifty crossing \u003cTWO_TEN_THOUSAND\u003e and the bse sensex surpassing \u003cEIGHT_TEN_THOUSAND\u003e in september \u003cTWO_THOUSAND\u003e both indices saw gains of around \u003cTWO_TEN_PERCENT\u003e during the period however kotak securities observed that most sectors and stocks appear overvalued with the degree of overvaluation varying from low in large cap consumer it services and pharmaceuticals to medium in the investment space and high in several low quality companies given the rich broader market valuations kotak securities advised that any market correction should be seen as an opportunity to add quality stocks with attractive valuations for long term investment based on their market analysis kotak securities identified eight potential stock ideas expected to perform well in samvat \u003cTWO_THOUSAND\u003e the brokerage stated that aadhar housing finance a large affordable housing finance company with \u003cTWO_TEN_THOUSAND\u003e crore of aum in fy24 holds a \u003cSEVEN_PERCENT\u003e market share in the affordable segment with a long track record and a well diversified geographical presence and customer base the companys multipronged expansion and appraisal strategy is expected to drive a \u003cTWO_TEN_PERCENT\u003e aum cagr from fy24 to fy27 stable margins and improving leverage will push roes back to the high teens it noted as per the brokerage aadhar housing stands out among its peers due to its larger balance sheet longer operating history and geographically diverse aum with no state contributing more than \u003cONE_TEN_PERCENT\u003e the company has also demonstrated strong asset quality over the years it added the brokerage noted that axis banks business execution aligned with expectations driven by its gps strategy aimed at building a strong franchise regarding deposits management maintained its view that the granular and focused initiatives would over time enable the bank to grow faster than the industry average as for loan mix the bank plans to continue building a profitable portfolio and is confident in delivering better risk adjusted growth it stated as per the brokerage the banks current valuations have addressed most key concerns positioning it as one of the best opportunities among large private banks the brokerage reiterated its buy rating with a fair value of \u003cONE_THOUSAND\u003e valuing the bank at around \u003cTWO_\u003e x book and \u003cONE_TEN\u003e x fy2026e eps targeting roes of about \u003cONE_TEN_PERCENT\u003e kotak securities highlighted fiem as a leading tier \u003cONE_\u003e manufacturer of automotive lighting and rearview mirrors primarily catering to two wheeler oems the brokerage noted that fiem is well positioned to benefit from the recovery in the two wheeler industry with a strong presence among key players in this segment as well as among two wheeler ev manufacturers the rising adoption of led lighting in the automotive industry is expected to drive revenue growth for fiem as led based lamps offer higher content per vehicle compared to halogen lamps the company is also leveraging its expertise in led automotive lighting and robust r d to tap into the four wheeler segment which presents significant medium term growth opportunities it added kotak securities expects fiems revenue to grow healthily over fy24 \u003cTWO_TEN\u003e e with earnings projected to rise at a \u003cONE_TEN_PERCENT\u003e cagr from fy24 to fy27e additionally the brokerage emphasised fiem s debt free balance sheet and robust cash flow generation kotak securities noted that gravita india is the market leader in indias growing recycling industry with a particular focus on lead recycling the company has a wide operational footprint both in india and overseas the brokerage highlighted that the organised segments market share is expected to expand significantly supported by regulatory tailwinds positioning gravita to capture this opportunity additionally penalties imposed on battery oems for missing recycling obligations are seen as a positive catalyst for the recycling industry gravita is also expanding its recycling capacity by around \u003cSEVEN_TEN_PERCENT\u003e targeting approximately \u003cFIVE_HUNDRED\u003e kilotons per annum ktpa by fy27e stated the brokerage furthermore it pointed out that the company is diversifying into new recycling segments such as rubber paper steel copper and lithium which are expected to drive revenue growth kotak securities projected that gravita s earnings per share will grow by \u003cTHREE_TEN_PERCENT\u003e in fy25e and \u003cTHREE_TEN_PERCENT\u003e in fy26e kotak securities noted mixed near term trends but a promising long term outlook for godrej agrovet the brokerage highlighted subdued prices in the animal feed and downstream businesses but emphasised strength in astec s product pipeline which they found promising it expects a benefit from palm oil duties starting in q3fy25 godrej s ability to attract talent is expected to support rapid growth in astec s cdmo segment consolidated earnings for q1fy25 grew at a healthy double digit pace year on year and kotak securities views the acquisition of the \u003cFOUR_TEN_PERCENT\u003e minority stake in godrej tyson foods ltd gtfl as incrementaly positive the brokerage anticipates healthy earnings growth in fy26 and maintained an add rating assigning a \u003cONE_TEN\u003e x ev ebitda multiple to standalone crop protection after the recent stock rally the brokerage highlighted that jb chemicals is primarily focused on domestic formulations with a significant presence in export formulations and a growing cmo business the share of domestic formulations and cmo in overall sales increased from around \u003cFIVE_TEN_PERCENT\u003e in fy2020 to \u003cSIX_TEN_PERCENT\u003e in fy24 observed kotak the company also boasts a strong cmo track record and global leadership in lozenge manufacturing kotak noted that jbs domestic business benefits from a healthy mix of legacy and acquired brands which are expected to drive growth it forecasts jb chemicals to achieve \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e cagrs in revenue ebitda and pat respectively over fy24 \u003cTWO_TEN\u003e e kotak securities noted that s h kelkar shk a flavours and fragrances f f supplier has begun to make inroads into the global market and is well positioned for double digit revenue growth while still a small player compared to global majors shks technical capabilities are strong and it has persevered over the years to see initial success the company is benefiting from secular growth in the f f market and gaining market share supported by its established and long lasting relationships it added it further pointed out that a significant order win from unilever has further strengthened confidence in shks management guidance with high entry barriers in the f f industry and potential for margin expansion through higher margin geographies and operating leverage kotak sees a long runway for growth as per the brokerage in cy23 zomato held a gross merchandise value gmv market share of around \u003cFIVE_TEN_PERCENT\u003e compared to swiggys \u003cFOUR_TEN_PERCENT\u003e it also had a wider geographical presence operating in \u003cSEVEN_HUNDRED\u003e cities versus swiggys \u003cSIX_HUNDRED\u003e cities blinkit zomato s rapidly evolving business is experiencing high growth expanding into new cities and adding new categories continuously kotak securities expects zomato to achieve a \u003cFOUR_TEN_PERCENT\u003e revenue cagr over fy24 \u003cTWO_TEN\u003e e along with a significant improvement in its ebitda margin during the same period","timestamp":"2024-10-22T14:28:00+05:30","market_timestamp":"2024-10-22T14:28:00+05:30","off_market_hours":false}