{"url":"https://www.livemint.com/market/stock-market-news/pfizer-went-from-covid-star-to-activist-target-as-stock-fell-11729011393985.html","title":"Pfizer Went From Covid Star to Activist Target as Stock Fell","description":"Pfizer Inc. and Albert Bourla got the upper hand in an early skirmish against Starboard Value LP — but the drugmaker and its embattled chief executive face a long war against an activist that hates to lose.","content":"Pfizer Inc. and Albert Bourla got the upper hand in an early skirmish against Starboard Value LP — but the drugmaker and its embattled chief executive face a long war against an activist that hates to lose.On Wednesday, Bourla is expected to sit down with Starboard after reports early last week that the investment firm had amassed a $1 billion stake in the $165 billion drugmaker and allied with two former Pfizer executives to help push for changes.Ian Read and Frank D’Amelio, Pfizer’s former CEO and finance chief, respectively, had multiple conversations with Starboard and agreed with many points raised in a 50-plus page slide deck critiquing the company, according to people familiar with the matter. In a bizarre twist, it emerged that D’Amelio may have tipped off Pfizer by sending a blank email to Bourla that was also addressed to someone at Starboard.At first, analysts were openly asking whether Bourla himself could be pushed out. “Investors would not mind an executive refresh,” Mizuho Securities analyst Jared Holz wrote in a note to clients.Then Read and D’Amelio abruptly reversed course and said they supported Pfizer’s management in an oddly timed, late-night news release on Wednesday from an investment bank they used to work with but didn’t appear in any way connected to the Starboard activism push.The mystery around their sudden change of heart didn’t last long. Early Thursday morning, Starboard accused Pfizer of coercing the men, claiming that the company threatened to claw back some of the executives’ pay and cancel some of their stock options. Starboard called on Pfizer’s board to investigate the company’s actions.Getting two of Pfizer’s most respected former leaders back in the fold — for now — was a victory for Bourla. However, it’s unlikely to make questions about his leadership go away. If anything, it raises new ones about how he’s managing the company. Meanwhile shares of the drugmaker have fallen by more than 50% since late 2021, when Pfizer was riding high from bringing its Covid vaccine to market.Bourla had banked on the idea that demand for Covid shots and treatments would last longer than it did. Flush with cash from selling vaccines and antiviral treatments to governments around the world, Pfizer embarked on a $70 billion string of deals.But as quickly as the pandemic pushed Pfizer to the top of the pharmaceutical industry, the end of the global public health emergency has swept the company’s legs out from under it. Sales of Covid therapies have dropped radically — and a recent flurry of drug approvals for Pfizer hasn’t yet been enough to fill the void.Starboard thinks Pfizer mismanaged its pandemic windfall with costly deals that haven’t paid off. Read and D’Amelio informed Pfizer’s board that Starboard is focused on controlling costs and being more disciplined about deals, according to a person familiar with the matter.Starboard hasn’t commented publicly on its plans for Pfizer. A Starboard representative declined to comment.A Pfizer spokesperson declined to comment.Multiple SetbacksBourla had already promised $4 billion of cost reductions last year and put forward plans for $1.5 billion more in cuts in 2024. Yet that hasn’t been enough to appease investors who have worried that Pfizer missed the boat on booming demand for obesity treatments and misspent in other places.As Covid revenues withered, Pfizer’s efforts to develop an obesity pill haven’t yet lead to much. It also botched the rollout of a promising RSV vaccine last fall, allowing rival GSK Plc to snatch a big slice of a market that Pfizer was counting on to offset slowing Covid sales.“We used to be this star. We used to be the pride of the pharma industry,” Bourla said in January. “We ended up in a situation that very rapidly deteriorated.”Pfizer’s biggest deal under Bourla, the $43 billion purchase of cancer-drug maker Seagen last year, will take years to pay off. The company hopes to have eight cancer drugs with more than $1 billion in sales by 2030, up from five today. That won’t immediately address the sales drain the company is now facing.Mark DesJardine, an associate professor at Dartmouth College’s Tuck School of Business, said Bourla has overspent on deals that “haven’t paid off.” DesJardine said Pfizer’s board shoulders some of the blame, as it should have had better monitoring in place to prevent spending from getting out of control.On Tuesday, a day before Pfizer and Starboard are expected to meet, the drugmaker appointed former Vanguard Group Inc. CEO Tim Buckley to its board of directors effective immediately. Buckley, 55, will join the board’s governance and sustainability committee and audit committee, according to a statement.Pfizer is facing competition for bestsellers like breast-cancer therapy Ibrance and pneumococcal vaccine Prevnar, and it has suffered multiple setbacks with rare-disease drugs that could have made up for lost revenue. A gene therapy for Duchenne muscular dystrophy failed a big trial in June and a sickle cell anemia drug had to be recalled in September due to safety problems.Gradual ClimbTrained as a veterinarian, Bourla joined Pfizer in 1993 and gradually climbed through the executive ranks. When he was president and general manager of Pfizer’s established products unit from 2010 to 2013, D’Amelio was sometimes critical of his deal-making, according to a person familiar with the matter.Still, for years, Read and Bourla were close, so much so that other employees used to joke that Read treated him like a son, the person said.A pivotal moment in Bourla’s ascent came in 2013, when Pfizer reorganized into three operating units. Bourla wasn’t originally picked for a leadership role, but then the executive slated to head the cancer and vaccines unit abruptly stepped down. Bourla got the job and was on the way to becoming Read’s handpicked successor.Going into the pandemic, Pfizer’s prospects were uncertain. Sales had declined 4% in 2019, and the stock fell 10% during the first year of Bourla’s tenure. But Covid changed everything.Bourla bet big on messenger RNA technology with partner BioNTech SE, taking advantage of Pfizer’s manufacturing might and clinical-trial prowess to be the first company to get a vaccine to market. Pfizer captured the majority of worldwide Covid shot sales and quickly followed up with the now widely prescribed antiviral drug Paxlovid.At their peak in 2022, Pfizer’s Covid products had more than $56 billion in combined sales. That is expected to shrivel to under $9 billion for 2024.Pipeline PressureCost cuts alone won’t solve Pfizer’s larger malaise — the lack of obvious big new hits to replace its Covid sales.As the pandemic ebbed, Bourla struck a series of deals to try to replenish Pfizer’s pipeline. He bought sickle cell anemia drugmaker Global Blood Therapeutics Inc. for $5.4 billion 2022, but the lead drug from that deal was recalled in September after a trial found a higher death rate in people who took it. Other deals brought in less groundbreaking medicines, such as a $11.6 billion pact for migraine drugs from Biohaven Pharmaceuticals in 2022.Bourla next turned to obesity pills. At the JPMorgan Healthcare Conference in 2023, he vowed that Pfizer could capture $10 billion in annual sales by developing obesity and diabetes pills that mimicked Ozempic, the hit drug from Novo Nordisk A/S.Five months later, Pfizer stopped testing one pill due to liver-related side effects. By the end of the year, a twice-daily version of a second pill was shelved. The company is still testing a new formulation of the second pill, but analysts no longer view it as a top contender in the race for next generation obesity drugs.Bourla also gave up control of an experimental bowel drug shortly before its value soared. In December 2022, Roivant Sciences Ltd. acquired US rights to the treatment in exchange for giving Pfizer a 25% stake in a company formed to develop it. A year later, Roche Holding AG bought the Roivant subsidiary for $7.1 billion. Roivant received $5.2 billion of that, according to its securities filings.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"pfizer inc and albert bourla got the upper hand in an early skirmish against starboard value lp but the drugmaker and its embattled chief executive face a long war against an activist that hates to lose on wednesday bourla is expected to sit down with starboard after reports early last week that the investment firm had amassed a \u003cONE_\u003e billion stake in the \u003cONE_HUNDRED\u003e billion drugmaker and allied with two former pfizer executives to help push for changes ian read and frank d amelio pfizer s former ceo and finance chief respectively had multiple conversations with starboard and agreed with many points raised in a \u003cFIVE_TEN\u003e plus page slide deck critiquing the company according to people familiar with the matter in a bizarre twist it emerged that d amelio may have tipped off pfizer by sending a blank email to bourla that was also addressed to someone at starboard at first analysts were openly asking whether bourla himself could be pushed out investors would not mind an executive refresh mizuho securities analyst jared holz wrote in a note to clients then read and d amelio abruptly reversed course and said they supported pfizer s management in an oddly timed late night news release on wednesday from an investment bank they used to work with but didn t appear in any way connected to the starboard activism push the mystery around their sudden change of heart didn t last long early thursday morning starboard accused pfizer of coercing the men claiming that the company threatened to claw back some of the executives pay and cancel some of their stock options starboard called on pfizer s board to investigate the company s actions getting two of pfizer s most respected former leaders back in the fold for now was a victory for bourla however it s unlikely to make questions about his leadership go away if anything it raises new ones about how he s managing the company meanwhile shares of the drugmaker have fallen by more than \u003cFIVE_TEN_PERCENT\u003e since late \u003cTWO_THOUSAND\u003e when pfizer was riding high from bringing its covid vaccine to market bourla had banked on the idea that demand for covid shots and treatments would last longer than it did flush with cash from selling vaccines and antiviral treatments to governments around the world pfizer embarked on a \u003cSEVEN_TEN\u003e billion string of deals but as quickly as the pandemic pushed pfizer to the top of the pharmaceutical industry the end of the global public health emergency has swept the company s legs out from under it sales of covid therapies have dropped radically and a recent flurry of drug approvals for pfizer hasn t yet been enough to fill the void starboard thinks pfizer mismanaged its pandemic windfall with costly deals that haven t paid off read and d amelio informed pfizer s board that starboard is focused on controlling costs and being more disciplined about deals according to a person familiar with the matter starboard hasn t commented publicly on its plans for pfizer a starboard representative declined to comment a pfizer spokesperson declined to comment multiple setbacksbourla had already promised \u003cFOUR_\u003e billion of cost reductions last year and put forward plans for \u003cONE_\u003e billion more in cuts in \u003cTWO_THOUSAND\u003e yet that hasn t been enough to appease investors who have worried that pfizer missed the boat on booming demand for obesity treatments and misspent in other places as covid revenues withered pfizer s efforts to develop an obesity pill haven t yet lead to much it also botched the rollout of a promising rsv vaccine last fall allowing rival gsk plc to snatch a big slice of a market that pfizer was counting on to offset slowing covid sales we used to be this star we used to be the pride of the pharma industry bourla said in january we ended up in a situation that very rapidly deteriorated pfizer s biggest deal under bourla the \u003cFOUR_TEN\u003e billion purchase of cancer drug maker seagen last year will take years to pay off the company hopes to have eight cancer drugs with more than \u003cONE_\u003e billion in sales by \u003cTWO_THOUSAND\u003e up from five today that won t immediately address the sales drain the company is now facing mark desjardine an associate professor at dartmouth college s tuck school of business said bourla has overspent on deals that haven t paid off desjardine said pfizer s board shoulders some of the blame as it should have had better monitoring in place to prevent spending from getting out of control on tuesday a day before pfizer and starboard are expected to meet the drugmaker appointed former vanguard group inc ceo tim buckley to its board of directors effective immediately buckley \u003cFIVE_TEN\u003e will join the board s governance and sustainability committee and audit committee according to a statement pfizer is facing competition for bestsellers like breast cancer therapy ibrance and pneumococcal vaccine prevnar and it has suffered multiple setbacks with rare disease drugs that could have made up for lost revenue a gene therapy for duchenne muscular dystrophy failed a big trial in june and a sickle cell anemia drug had to be recalled in september due to safety problems gradual climbtrained as a veterinarian bourla joined pfizer in \u003cONE_THOUSAND\u003e and gradually climbed through the executive ranks when he was president and general manager of pfizer s established products unit from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e d amelio was sometimes critical of his deal making according to a person familiar with the matter still for years read and bourla were close so much so that other employees used to joke that read treated him like a son the person said a pivotal moment in bourla s ascent came in \u003cTWO_THOUSAND\u003e when pfizer reorganized into three operating units bourla wasn t originally picked for a leadership role but then the executive slated to head the cancer and vaccines unit abruptly stepped down bourla got the job and was on the way to becoming read s handpicked successor going into the pandemic pfizer s prospects were uncertain sales had declined \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and the stock fell \u003cONE_TEN_PERCENT\u003e during the first year of bourla s tenure but covid changed everything bourla bet big on messenger rna technology with partner biontech se taking advantage of pfizer s manufacturing might and clinical trial prowess to be the first company to get a vaccine to market pfizer captured the majority of worldwide covid shot sales and quickly followed up with the now widely prescribed antiviral drug paxlovid at their peak in \u003cTWO_THOUSAND\u003e pfizer s covid products had more than \u003cFIVE_TEN\u003e billion in combined sales that is expected to shrivel to under \u003cNINE_\u003e billion for \u003cTWO_THOUSAND\u003e pipeline pressurecost cuts alone won t solve pfizer s larger malaise the lack of obvious big new hits to replace its covid sales as the pandemic ebbed bourla struck a series of deals to try to replenish pfizer s pipeline he bought sickle cell anemia drugmaker global blood therapeutics inc for \u003cFIVE_\u003e billion \u003cTWO_THOUSAND\u003e but the lead drug from that deal was recalled in september after a trial found a higher death rate in people who took it other deals brought in less groundbreaking medicines such as a \u003cONE_TEN\u003e billion pact for migraine drugs from biohaven pharmaceuticals in \u003cTWO_THOUSAND\u003e bourla next turned to obesity pills at the jpmorgan healthcare conference in \u003cTWO_THOUSAND\u003e he vowed that pfizer could capture \u003cONE_TEN\u003e billion in annual sales by developing obesity and diabetes pills that mimicked ozempic the hit drug from novo nordisk a s five months later pfizer stopped testing one pill due to liver related side effects by the end of the year a twice daily version of a second pill was shelved the company is still testing a new formulation of the second pill but analysts no longer view it as a top contender in the race for next generation obesity drugs bourla also gave up control of an experimental bowel drug shortly before its value soared in december \u003cTWO_THOUSAND\u003e roivant sciences ltd acquired us rights to the treatment in exchange for giving pfizer a \u003cTWO_TEN_PERCENT\u003e stake in a company formed to develop it a year later roche holding ag bought the roivant subsidiary for \u003cSEVEN_\u003e billion roivant received \u003cFIVE_\u003e billion of that according to its securities filings this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-15T22:26:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}