{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-ruchit-jain-of-5paisa-recommends-crompton-greaves-futures-bombay-burmah-trading-corp-today-11729568919685.html","title":"Shares to buy or sell: Ruchit Jain of 5paisa recommends Crompton Greaves Futures, Bombay Burmah Trading Corp today","description":"Shares to buy or sell: Ruchit Jain of 5paisa has recommended two stocks today - Crompton Greaves Futures, and Bombay Burmah Trading Corporation Ltd (BBTC).","content":"Stock Market News: With weak earnings and persistent foreign selling weighing on markets, the domestic benchmark indices, the Sensex and Nifty 50, opened Tuesday little changed. Overnight, global shares fell due to apprehension over the worsening Middle East crisis.In early trade, the Sensex rose 239.33 points to 81,390.60 after dropping in the previous trade. With a 72.95-point increase, the Nifty 50 reached 24,854.05.According to Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services, certain triggers will lead market values to correct when they are at high levels, bringing them down to levels that are acceptable and consistent with long-term norms. According to NSDL, the prolonged selling by FIIs, which totalled  ₹88244 crores by October 21st, served as the catalyst for the correction this time.Nifty 50 started the week on a positive note but it witnessed selling pressure and traded with a negative bias throughout the day. The market breadth was weak while the index ended the day around 24,750 with a loss of about half a percent.Our markets traded with a negative bias post open on Monday where although the index did not see any sharp move, the broader markets saw sharp correction leading to underperformance in the midcaps and the small cap space. The market breadth was very weak as the midcap and the small cap indices corrected by more than one and a half percent.On the benchmark index, 24,600-24,500 is the crucial support zone for the near term. The RSI is still negative on the daily and the weekly charts on Nifty 50 and thus, there are no reversal signs as of now from this support. On the higher side, 25,000-25,100 is seen as the immediate resistance zone, followed by 25,200-25,250. The index is expected to consolidate within this broad range and only a breakout beyond this zone would lead to the next directional move.Traders are advised to keep a wait and watch approach and wait for signs of range breakout or reversal from support.On shares to buy or sell on Tuesday, Ruchit Jain recommends Crompton Greaves Futures, and Bombay Burmah Trading Corporation Ltd.The stock has given a breakdown from its trend line support which was the neckline of a ‘Head and Shoulders’ pattern. The support broken is a bearish sign for the short term and the RSI oscillator also hints at a negative momentum.Hence, traders are advised to sell Crompton October Futures in the range of  ₹406-410 for potential target of  ₹491 and  ₹480. Traders are advised to keep a strict stop loss above  ₹421.The stock has been forming a ‘Higher Top Higher Bottom’ and is thus in an uptrend. The volumes are good in the price upmove and the 50 DEMA is acting as a support. The RSI oscillator has given a positive crossover and hence, we expect the uptrend to continue.Short term traders can buy the stock in the range of  ₹2,800-2,760 for potential near term targets of  ₹2,950 and  ₹3,050. The stop loss on long positions should be placed below  ₹2,650.","cleaned_content":"stock market news with weak earnings and persistent foreign selling weighing on markets the domestic benchmark indices the sensex and nifty \u003cFIVE_TEN\u003e opened tuesday little changed overnight global shares fell due to apprehension over the worsening middle east crisis in early trade the sensex rose \u003cTWO_HUNDRED\u003e points to \u003cEIGHT_TEN_THOUSAND\u003e after dropping in the previous trade with a \u003cSEVEN_TEN\u003e point increase the nifty \u003cFIVE_TEN\u003e reached \u003cTWO_TEN_THOUSAND\u003e according to dr v k vijayakumar chief investment strategist at geojit financial services certain triggers will lead market values to correct when they are at high levels bringing them down to levels that are acceptable and consistent with long term norms according to nsdl the prolonged selling by fiis which totalled \u003cEIGHT_TEN_THOUSAND\u003e crores by october \u003cTWO_TEN\u003e st served as the catalyst for the correction this time nifty \u003cFIVE_TEN\u003e started the week on a positive note but it witnessed selling pressure and traded with a negative bias throughout the day the market breadth was weak while the index ended the day around \u003cTWO_TEN_THOUSAND\u003e with a loss of about half a percent our markets traded with a negative bias post open on monday where although the index did not see any sharp move the broader markets saw sharp correction leading to underperformance in the midcaps and the small cap space the market breadth was very weak as the midcap and the small cap indices corrected by more than one and a half percent on the benchmark index \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is the crucial support zone for the near term the rsi is still negative on the daily and the weekly charts on nifty \u003cFIVE_TEN\u003e and thus there are no reversal signs as of now from this support on the higher side \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is seen as the immediate resistance zone followed by \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e the index is expected to consolidate within this broad range and only a breakout beyond this zone would lead to the next directional move traders are advised to keep a wait and watch approach and wait for signs of range breakout or reversal from support on shares to buy or sell on tuesday ruchit jain recommends crompton greaves futures and bombay burmah trading corporation ltd the stock has given a breakdown from its trend line support which was the neckline of a head and shoulders pattern the support broken is a bearish sign for the short term and the rsi oscillator also hints at a negative momentum hence traders are advised to sell crompton october futures in the range of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e for potential target of \u003cFOUR_HUNDRED\u003e and \u003cFOUR_HUNDRED\u003e traders are advised to keep a strict stop loss above \u003cFOUR_HUNDRED\u003e the stock has been forming a higher top higher bottom and is thus in an uptrend the volumes are good in the price upmove and the \u003cFIVE_TEN\u003e dema is acting as a support the rsi oscillator has given a positive crossover and hence we expect the uptrend to continue short term traders can buy the stock in the range of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e for potential near term targets of \u003cTWO_THOUSAND\u003e and \u003cTHREE_THOUSAND\u003e the stop loss on long positions should be placed below \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-22T10:14:00+05:30","market_timestamp":"2024-10-22T10:14:00+05:30","off_market_hours":false}