{"url":"https://www.livemint.com/market/stock-market-news/danish-power-ipo-largest-sme-issue-of-the-year-opens-check-subscription-status-gmp-other-details-11729585837510.html","title":"Danish Power IPO: Largest SME issue of the year opens – Check subscription status, GMP \u0026 other details","description":"Danish Power launched its SME IPO today, aiming to raise  ₹197.90 crore. The IPO sailed through on the first day, with strong demand from retail and institutional investors. The expected listing price is  ₹645, reflecting a 70% premium.","content":"Danish Power's SME IPO opened for subscription on Tuesday, October 22. The three-day public offer will close on October 24. The company aims to raise  ₹197.90 crore through the offering and has set a price band for the issue in the range of  ₹360-380 per share. This will be the biggest SME IPO offering seen this year.The IPO witnessed robust demand as it sailed through within a few hours of opening. The issue was subscribed 1.29 times by 2:10 pm on Day 1 of bidding. The IPO received bids for 44.95 lakh equity shares against 34.83 lakh shares on offer.The retail investor segment was booked 2 times, while the non-institutional investors (NII) category was subscribed 1.22 times. The Qualified Institutional Buyers (QIBs) portion was subscribed 0.19 times till now.The IPO's grey market premium (GMP) today is  ₹265 per share, which indicates an expected listing price of  ₹645, a premium of around 70 per cent over its issue price of  ₹380. The GMP was the same in the previous session, October 21 but rose from  ₹160 on October 20 and  ₹150 on October 19.Danish Power IPO is a fresh issue of 52.08 lakh shares with no offer-for-sale component.The net proceeds are intended to be utilised for several purposes, including funding capital expenditure for the expansion of the company's manufacturing facility through the construction of a factory shed and the installation of additional plant and machinery. Additionally, the funds will be used to meet working capital requirements, repay specific borrowings either partially or in full, and for general corporate purposes.Retail investors must apply for a minimum lot size of 300 shares, amounting to an investment of  ₹1.14 lakh. High net-worth individuals (HNIs) must apply for at least two lots, or 600 shares, totalling  ₹2.28 lakh.The allotment for the IPO is expected to be finalised on Friday, October 25, 2024. Meanwhile, the initiation of refunds for investors who were not allotted the shares and the credit of shares to the Demat account of the allottees will take place on Monday, October 28. The shares will be listed on the NSE SME platform on Tuesday, October 29, 2024.Hem Securities Limited is the book-running lead manager of the Danish Power IPO, while Link Intime India Private Ltd is the registrar for the issue. The market maker for Danish Power IPO is Hem Finlease.Founded in July 1985, Danish Power Limited specialises in the manufacture of a wide range of transformers, including inverter duty transformers designed for renewable energy projects like solar power plants and wind farms. The company also produces oil and dry-type power and distribution transformers, control relay panels, and provides substation automation services.\"The company is engaged in the manufacturing of various types of transformers and also providing substation automation services. It marked steady growth in its top lines for the reported period, but the sudden boost in bottom lines from pre-IPO periods (FY24 onwards) raises eyebrows. Well-informed investors may park funds for long term,\" Dilip Davda of Chittorgarh.com said, assigning a 'may apply' rating to the issue.","cleaned_content":"danish powers sme ipo opened for subscription on tuesday october \u003cTWO_TEN\u003e the three day public offer will close on october \u003cTWO_TEN\u003e the company aims to raise \u003cONE_HUNDRED\u003e crore through the offering and has set a price band for the issue in the range of \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e per share this will be the biggest sme ipo offering seen this year the ipo witnessed robust demand as it sailed through within a few hours of opening the issue was subscribed \u003cONE_\u003e times by \u003cTWO_\u003e \u003cONE_TEN\u003e pm on day \u003cONE_\u003e of bidding the ipo received bids for \u003cFOUR_TEN\u003e lakh equity shares against \u003cTHREE_TEN\u003e lakh shares on offer the retail investor segment was booked \u003cTWO_\u003e times while the non institutional investors nii category was subscribed \u003cONE_\u003e times the qualified institutional buyers qibs portion was subscribed \u003cZERO_\u003e times till now the ipos grey market premium gmp today is \u003cTWO_HUNDRED\u003e per share which indicates an expected listing price of \u003cSIX_HUNDRED\u003e a premium of around \u003cSEVEN_TEN_PERCENT\u003e over its issue price of \u003cTHREE_HUNDRED\u003e the gmp was the same in the previous session october \u003cTWO_TEN\u003e but rose from \u003cONE_HUNDRED\u003e on october \u003cTWO_TEN\u003e and \u003cONE_HUNDRED\u003e on october \u003cONE_TEN\u003e danish power ipo is a fresh issue of \u003cFIVE_TEN\u003e lakh shares with no offer for sale component the net proceeds are intended to be utilised for several purposes including funding capital expenditure for the expansion of the companys manufacturing facility through the construction of a factory shed and the installation of additional plant and machinery additionally the funds will be used to meet working capital requirements repay specific borrowings either partially or in full and for general corporate purposes retail investors must apply for a minimum lot size of \u003cTHREE_HUNDRED\u003e shares amounting to an investment of \u003cONE_\u003e lakh high net worth individuals hnis must apply for at least two lots or \u003cSIX_HUNDRED\u003e shares totalling \u003cTWO_\u003e lakh the allotment for the ipo is expected to be finalised on friday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e meanwhile the initiation of refunds for investors who were not allotted the shares and the credit of shares to the demat account of the allottees will take place on monday october \u003cTWO_TEN\u003e the shares will be listed on the nse sme platform on tuesday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e hem securities limited is the book running lead manager of the danish power ipo while link intime india private ltd is the registrar for the issue the market maker for danish power ipo is hem finlease founded in july \u003cONE_THOUSAND\u003e danish power limited specialises in the manufacture of a wide range of transformers including inverter duty transformers designed for renewable energy projects like solar power plants and wind farms the company also produces oil and dry type power and distribution transformers control relay panels and provides substation automation services the company is engaged in the manufacturing of various types of transformers and also providing substation automation services it marked steady growth in its top lines for the reported period but the sudden boost in bottom lines from pre ipo periods fy24 onwards raises eyebrows well informed investors may park funds for long term dilip davda of chittorgarh com said assigning a may apply rating to the issue","timestamp":"2024-10-22T15:07:00+05:30","market_timestamp":"2024-10-22T15:07:00+05:30","off_market_hours":false}