{"url":"https://www.livemint.com/market/stock-market-news/multibagger-smallcap-stock-pc-jewellers-hits-5-upper-circuit-for-3rd-straight-session-do-you-own-it-11729062694341.html","title":"This multibagger smallcap jewellery stock hits 5% upper circuit for 3rd straight session. Do you own it?","description":"PC Jeweller's shares hit the 5% upper circuit on October 16 after converting 4.35 lakh warrants into equity shares. The company aims to enhance accessibility through a potential stock split while also resolving debts via a One Time Settlement with banks.","content":"PC Jeweller, a small-cap multibagger stock, saw its shares locked in the 5 per cent upper circuit on Wednesday, October 16, at  ₹176.85 apiece after the company issued 4.35 lakh equity shares following the conversion of warrants to both promoter and public category investors.This was the third consecutive session when the stock was locked in the 5 per cent upper circuit on the bourses, taking its gains to 15% during the period.The company had earlier notified about the allocation of 48.08 crore fully convertible warrants to select members of the 'Promoter Group' and 'Non-Promoter, Public Category.' These warrants were issued through a preferential private placement and targeted specific investors, excluding the general public.On October 15, 2024, PC Jeweller's Board passed a resolution to convert a portion of these warrants into equity shares. A total of 4,35,972 warrants were converted into the same number of equity shares, each with a face value of  ₹10. This conversion occurred after the company received  ₹1.83 crore from two investors, who paid  ₹42.15 per warrant—75 per cent of the original issue price—following SEBI guidelines on issuing and converting warrants.PC Jeweller has been actively raising funds by issuing 3.66 crore warrants to 114 investors, including those from the promoter group, non-promoters, and public category. These warrants allow investors to buy equity shares of the company in the future. As per SEBI regulations, investors are required to pay 25 per cent of the issue price upfront, with the remaining 75 per cent payable within 18 months. During this time, warrant holders are entitled to benefits like bonuses, rights issues, and stock splits announced by the company.PC Jeweller has also indicated a potential stock split, which would divide each share worth  ₹10 into ten smaller shares of Re 1 each, making the stock more accessible and potentially boosting trading activity. While the exact date for the stock split hasn't been announced, it is expected to drive investor interest.Additionally, PC Jeweller received approval from the Bank of India for a One Time Settlement (OTS) proposal as part of its efforts to resolve outstanding debts to 14 banks. This plan involves cash payments, equity deals, and the release of mortgaged properties and securities, in line with the company's restructuring goals.PC Jeweller has proven to be a multibagger stock, delivering substantial returns to its investors. Over the past year, the stock surged more than 413 per cent, with a year-to-date gain of 279 per cent. The stock has posted positive returns in six out of the ten months this year.Before a modest 0.5 per cent decline in October so far, PC Jewellers recorded a stellar 60.7 per cent rise in September. It rose 18.11 per cent in August, 83.83 per cent in July, and 10 per cent in June. Despite a brief correction earlier this year, with declines of 11 per cent in May, 3 per cent in April, and 6.8 per cent in March, the stock rebounded strongly. It gained 4.6 per cent in February and 18.2 per cent in January.The stock reached a 52-week high of  ₹186.80 on October 1, and is now just 5 per cent away from that peak. It has also skyrocketed 595 per cent from its 52-week low of  ₹27.66, recorded in December last year. With its solid fundamentals and positive momentum, PC Jeweller continues to attract significant investor interest in 2024.","cleaned_content":"pc jeweller a small cap multibagger stock saw its shares locked in the \u003cFIVE_PERCENT\u003e upper circuit on wednesday october \u003cONE_TEN\u003e at \u003cONE_HUNDRED\u003e apiece after the company issued \u003cFOUR_\u003e lakh equity shares following the conversion of warrants to both promoter and public category investors this was the third consecutive session when the stock was locked in the \u003cFIVE_PERCENT\u003e upper circuit on the bourses taking its gains to \u003cONE_TEN_PERCENT\u003e during the period the company had earlier notified about the allocation of \u003cFOUR_TEN\u003e crore fully convertible warrants to select members of the promoter group and non promoter public category these warrants were issued through a preferential private placement and targeted specific investors excluding the general public on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e pc jewellers board passed a resolution to convert a portion of these warrants into equity shares a total of \u003cFOUR_HUNDRED_THOUSAND\u003e warrants were converted into the same number of equity shares each with a face value of \u003cONE_TEN\u003e this conversion occurred after the company received \u003cONE_\u003e crore from two investors who paid \u003cFOUR_TEN\u003e per warrant \u003cSEVEN_TEN_PERCENT\u003e of the original issue price following sebi guidelines on issuing and converting warrants pc jeweller has been actively raising funds by issuing \u003cTHREE_\u003e crore warrants to \u003cONE_HUNDRED\u003e investors including those from the promoter group non promoters and public category these warrants allow investors to buy equity shares of the company in the future as per sebi regulations investors are required to pay \u003cTWO_TEN_PERCENT\u003e of the issue price upfront with the remaining \u003cSEVEN_TEN_PERCENT\u003e payable within \u003cONE_TEN\u003e months during this time warrant holders are entitled to benefits like bonuses rights issues and stock splits announced by the company pc jeweller has also indicated a potential stock split which would divide each share worth \u003cONE_TEN\u003e into ten smaller shares of re \u003cONE_\u003e each making the stock more accessible and potentially boosting trading activity while the exact date for the stock split hasnt been announced it is expected to drive investor interest additionally pc jeweller received approval from the bank of india for a one time settlement ots proposal as part of its efforts to resolve outstanding debts to \u003cONE_TEN\u003e banks this plan involves cash payments equity deals and the release of mortgaged properties and securities in line with the companys restructuring goals pc jeweller has proven to be a multibagger stock delivering substantial returns to its investors over the past year the stock surged more than \u003cFOUR_HUNDRED_PERCENT\u003e with a year to date gain of \u003cTWO_HUNDRED_PERCENT\u003e the stock has posted positive returns in six out of the ten months this year before a modest \u003cZERO_PERCENT\u003e decline in october so far pc jewellers recorded a stellar \u003cSIX_TEN_PERCENT\u003e rise in september it rose \u003cONE_TEN_PERCENT\u003e in august \u003cEIGHT_TEN_PERCENT\u003e in july and \u003cONE_TEN_PERCENT\u003e in june despite a brief correction earlier this year with declines of \u003cONE_TEN_PERCENT\u003e in may \u003cTHREE_PERCENT\u003e in april and \u003cSIX_PERCENT\u003e in march the stock rebounded strongly it gained \u003cFOUR_PERCENT\u003e in february and \u003cONE_TEN_PERCENT\u003e in january the stock reached a \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e on october \u003cONE_\u003e and is now just \u003cFIVE_PERCENT\u003e away from that peak it has also skyrocketed \u003cFIVE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_TEN\u003e recorded in december last year with its solid fundamentals and positive momentum pc jeweller continues to attract significant investor interest in \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-16T13:24:00+05:30","market_timestamp":"2024-10-16T13:24:00+05:30","off_market_hours":false}