{"url":"https://www.livemint.com/market/stock-market-news/diwali-2024-stock-picks-top-10-stocks-to-buy-for-samvat-2081-by-hdfc-securities-11729059806629.html","title":"Diwali 2024 Stock Picks: Top 10 stocks to buy for Samvat 2081 by HDFC Securities","description":"Diwali 2024 Stock Picks: HDFC Securities reports a 28% rise in Nifty 50 since last Diwali, predicting moderate returns and volatility ahead. They recommend 10 stocks, including Bank of India and Reliance Industries, as promising investment opportunities for the upcoming year.","content":"Diwali 2024 Stock Picks: Since the last Diwali, Nifty 50 has seen a significant increase of approximately 28%, according to HDFC Securities. The brokerage firm anticipates moderate returns and higher volatility in the upcoming year. In its most recent report, HDFC Securities has highlighted 10 stocks as its Diwali Stock Picks: Bank of India, JK Lakshmi Cement Ltd, Jyothy Labs Ltd, L\u0026T Finance Ltd, National Aluminium Company Ltd, Navin Fluorine International Ltd, NCC Ltd, PNB Housing Finance Ltd, Reliance Industries Ltd, and State Bank of India.HDFC Securities is of the opinion that there will be continued opportunities for nuanced investors in specific stocks and sectors in the coming year.“We have constructed a portfolio of 10 stocks that offer compelling investment opportunities - two well established mega caps, and 4 each in mid cap and small cap category that are likely to offer relatively limited downside and superior upside potential,” the brokerage said in its report.Let's briefly review the valuations of the 10 stocks recommended by the brokerage.Bank of India has a robust capital adequacy ratio, better NIMs, and improved asset quality, as indicated by reduced gross and net non-performing assets (GNPA \u0026 NNPA). The bank's current trading position shows a P/B of 0.6x FY26E ABV, presenting an appealing opportunity for investment.“We expect the valuation to improve given improved financials and better outlook. We recommend investors to buy the stock in the  ₹96-106 band for a target price of Rs. 132 (0.75x FY26E ABV) till next Diwali,” the brokerage said.The brokerage anticipates an increase in cement demand to accelerate by the second half of FY25. Considering the expansion of capacity and improvement in operational performance, HDFC Securities anticipate the company to deliver strong results in the upcoming years.“We expect revenue/EBITDA/PAT to increase at a CAGR of 7.6%/15.7%/13.9% over FY24 to FY26E. We believe investors can buy the stock in Rs. 738-819 band (15x FY26E EPS) for a target of  ₹936 (18x FY26E EPS) till next Diwali,” said HDFC Securities.Jyothy Labs has effectively transitioned from a promoter-driven, focused on the south, and single-product business to a nationally operating, professionally managed, and multi-product company. Consequently, the company has experienced a 12.7% compound annual growth rate in revenue between FY20-24. Improved product mix and enhanced operating efficiencies are contributing to margin expansion.“We expect Revenue/EBITDA/PAT CAGR of 12%/15%/17% between FY24-26E. We recommend a buy on Jyothy Labs in the band of  ₹480-533 for target price of  ₹600 (43.75x FY26E EPS) till next Diwali,” the brokerage said.L\u0026T Finance LtdThe company has been consistently decreasing its reliance on wholesale lending by actively growing its diversified retail financing business.\"We envisage a 18% growth in advances over FY24-FY26. We believe the stock is available at reasonable valuations for a reason of possible asset quality hiccups in wholesale lending though the focus on this business has been falling. We recommend investors to buy the stock in the Rs. 153-170 band for a target price of Rs. 219 (2.0x FY26 ABV) till next Diwali, said HDFC Securities.The brokerage expects aluminum prices to strengthen due to limited global supply and increased demand. Margins are predicted to improve as coal production rises at Utkal D and E mines. NALCO is acknowledged worldwide for its cost-effective alumina production and has vertically integrated operations, including expanding its alumina refinery capacity.“The company is well positioned to benefit from the strong alumina prices. We expect revenue/EBITDA/PAT to increase at a CAGR of 9.7%/32.8%/29.2% over FY24 to FY26E. We believe investors can buy the stock in Rs. 198-220 band for a target of Rs. 270 (15x FY26E EPS) till next Diwali,” the brokerage said.Throughout FY24–27E, the brokerage anticipates a 23.5% CAGR in revenue, driven by strong growth from the CDMO and Specialty Chemical segments and excellent growth from the HPP division. FY24 saw poor overall performance as a result of decreased CDMO and HPP business revenue.Over the next three years, the brokerage projects a 750bps increase in profitability as a result of the Specialty Chemical business's growth and improved product mix. Over the same time period, a 35% CAGR in net profit may be achieved through strong sales growth and improved margins.“We recommend buy on Navin Fluorine in the band of  ₹3,059-3,396 for a target price of  ₹3,948 (40.5x FY26E EPS) till next Diwali,” the brokerage said.The company possesses a diversified order book, strong execution capabilities, and a firm commitment to reducing debt and enhancing working capital. NCC's key distinguishing factor lies in its diverse segments, encompassing building, mining, railways, electrical, water, and environment.\"We expect Revenue/EBITDA/PAT to grow at CAGR of 16%/21%/39.6% over FY24-26E. Investors can buy the stock in the band of  ₹273-303 for a target of Rs. 363 (18x FY26E EPS) till next Diwali,\" said HDFC Securities.The brokerage anticipates an 18% Compound Annual Growth Rate (CAGR) in its loan book from FY24 to FY26, with expected growth of 16% in Net Interest Income (NII) and 15% in Profit After Tax (PAT) over the same period. The company's Return on Assets (RoA) is projected to increase to 2.2% by the conclusion of FY26.“We recommend investors to buy the stock in the  ₹893-991 band for a target price of  ₹1,160 (1.7x FY26E ABV) till next Diwali,” the brokerage said.The brokerage anticipates that Reliance's Retail, Telecom, and new energy divisions will become the primary catalysts for expansion over the next two to three years, owing to notable technological progress and ambitious growth objectives. The company aims to double its EBITDA within the next five years by capitalising on 5G prospects, increasing investments in AI/data centers, further expanding in Retail, and commencing PV/battery facilities in the New Energy sector.“Investors can buy in the Rs. 2447-2716 band for a target of Rs. 3243 (23.5x FY26E EPS) till next Diwali,” said the brokerage house.The brokerage has confidence that State Bank of India has the capacity to maintain growth, considering its substantial liquidity ( ₹3.7 trillion) and a satisfactory LDR (76.5%). The brokerage has factored in slight NIM compression from FY24-26E due to the change in the rate cycle during H2FY25.“We recommend investors to buy in the  ₹733-813 band with a target price of  ₹960 (1.8x Mar-26 ABVPS),” the brokerage said.","cleaned_content":"diwali \u003cTWO_THOUSAND\u003e stock picks since the last diwali nifty \u003cFIVE_TEN\u003e has seen a significant increase of approximately \u003cTWO_TEN_PERCENT\u003e according to hdfc securities the brokerage firm anticipates moderate returns and higher volatility in the upcoming year in its most recent report hdfc securities has highlighted \u003cONE_TEN\u003e stocks as its diwali stock picks bank of india jk lakshmi cement ltd jyothy labs ltd l t finance ltd national aluminium company ltd navin fluorine international ltd ncc ltd pnb housing finance ltd reliance industries ltd and state bank of india hdfc securities is of the opinion that there will be continued opportunities for nuanced investors in specific stocks and sectors in the coming year we have constructed a portfolio of \u003cONE_TEN\u003e stocks that offer compelling investment opportunities two well established mega caps and \u003cFOUR_\u003e each in mid cap and small cap category that are likely to offer relatively limited downside and superior upside potential the brokerage said in its report lets briefly review the valuations of the \u003cONE_TEN\u003e stocks recommended by the brokerage bank of india has a robust capital adequacy ratio better nims and improved asset quality as indicated by reduced gross and net non performing assets gnpa nnpa the banks current trading position shows a p b of \u003cZERO_\u003e x fy26e abv presenting an appealing opportunity for investment we expect the valuation to improve given improved financials and better outlook we recommend investors to buy the stock in the \u003cNINE_TEN\u003e \u003cONE_HUNDRED\u003e band for a target price of rs \u003cONE_HUNDRED\u003e \u003cZERO_\u003e x fy26e abv till next diwali the brokerage said the brokerage anticipates an increase in cement demand to accelerate by the second half of fy25 considering the expansion of capacity and improvement in operational performance hdfc securities anticipate the company to deliver strong results in the upcoming years we expect revenue ebitda pat to increase at a cagr of \u003cSEVEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e over fy24 to fy26e we believe investors can buy the stock in rs \u003cSEVEN_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e band \u003cONE_TEN\u003e x fy26e eps for a target of \u003cNINE_HUNDRED\u003e \u003cONE_TEN\u003e x fy26e eps till next diwali said hdfc securities jyothy labs has effectively transitioned from a promoter driven focused on the south and single product business to a nationally operating professionally managed and multi product company consequently the company has experienced a \u003cONE_TEN_PERCENT\u003e compound annual growth rate in revenue between fy20 \u003cTWO_TEN\u003e improved product mix and enhanced operating efficiencies are contributing to margin expansion we expect revenue ebitda pat cagr of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e between fy24 \u003cTWO_TEN\u003e e we recommend a buy on jyothy labs in the band of \u003cFOUR_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e for target price of \u003cSIX_HUNDRED\u003e \u003cFOUR_TEN\u003e x fy26e eps till next diwali the brokerage said l t finance ltdthe company has been consistently decreasing its reliance on wholesale lending by actively growing its diversified retail financing business we envisage a \u003cONE_TEN_PERCENT\u003e growth in advances over fy24 fy26 we believe the stock is available at reasonable valuations for a reason of possible asset quality hiccups in wholesale lending though the focus on this business has been falling we recommend investors to buy the stock in the rs \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e band for a target price of rs \u003cTWO_HUNDRED\u003e \u003cTWO_\u003e x fy26 abv till next diwali said hdfc securities the brokerage expects aluminum prices to strengthen due to limited global supply and increased demand margins are predicted to improve as coal production rises at utkal d and e mines nalco is acknowledged worldwide for its cost effective alumina production and has vertically integrated operations including expanding its alumina refinery capacity the company is well positioned to benefit from the strong alumina prices we expect revenue ebitda pat to increase at a cagr of \u003cNINE_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e over fy24 to fy26e we believe investors can buy the stock in rs \u003cONE_HUNDRED\u003e \u003cTWO_HUNDRED\u003e band for a target of rs \u003cTWO_HUNDRED\u003e \u003cONE_TEN\u003e x fy26e eps till next diwali the brokerage said throughout fy24 \u003cTWO_TEN\u003e e the brokerage anticipates a \u003cTWO_TEN_PERCENT\u003e cagr in revenue driven by strong growth from the cdmo and specialty chemical segments and excellent growth from the hpp division fy24 saw poor overall performance as a result of decreased cdmo and hpp business revenue over the next three years the brokerage projects a \u003cSEVEN_HUNDRED\u003e bps increase in profitability as a result of the specialty chemical businesss growth and improved product mix over the same time period a \u003cTHREE_TEN_PERCENT\u003e cagr in net profit may be achieved through strong sales growth and improved margins we recommend buy on navin fluorine in the band of \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e for a target price of \u003cTHREE_THOUSAND\u003e \u003cFOUR_TEN\u003e x fy26e eps till next diwali the brokerage said the company possesses a diversified order book strong execution capabilities and a firm commitment to reducing debt and enhancing working capital nccs key distinguishing factor lies in its diverse segments encompassing building mining railways electrical water and environment we expect revenue ebitda pat to grow at cagr of \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e investors can buy the stock in the band of \u003cTWO_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e for a target of rs \u003cTHREE_HUNDRED\u003e \u003cONE_TEN\u003e x fy26e eps till next diwali said hdfc securities the brokerage anticipates an \u003cONE_TEN_PERCENT\u003e compound annual growth rate cagr in its loan book from fy24 to fy26 with expected growth of \u003cONE_TEN_PERCENT\u003e in net interest income nii and \u003cONE_TEN_PERCENT\u003e in profit after tax pat over the same period the companys return on assets roa is projected to increase to \u003cTWO_PERCENT\u003e by the conclusion of fy26 we recommend investors to buy the stock in the \u003cEIGHT_HUNDRED\u003e \u003cNINE_HUNDRED\u003e band for a target price of \u003cONE_THOUSAND\u003e \u003cONE_\u003e x fy26e abv till next diwali the brokerage said the brokerage anticipates that reliances retail telecom and new energy divisions will become the primary catalysts for expansion over the next two to three years owing to notable technological progress and ambitious growth objectives the company aims to double its ebitda within the next five years by capitalising on \u003cFIVE_\u003e g prospects increasing investments in ai data centers further expanding in retail and commencing pv battery facilities in the new energy sector investors can buy in the rs \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e band for a target of rs \u003cTHREE_THOUSAND\u003e \u003cTWO_TEN\u003e x fy26e eps till next diwali said the brokerage house the brokerage has confidence that state bank of india has the capacity to maintain growth considering its substantial liquidity \u003cTHREE_\u003e trillion and a satisfactory ldr \u003cSEVEN_TEN_PERCENT\u003e the brokerage has factored in slight nim compression from fy24 \u003cTWO_TEN\u003e e due to the change in the rate cycle during h2fy25 we recommend investors to buy in the \u003cSEVEN_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e band with a target price of \u003cNINE_HUNDRED\u003e \u003cONE_\u003e x mar \u003cTWO_TEN\u003e abvps the brokerage said","timestamp":"2024-10-16T13:20:00+05:30","market_timestamp":"2024-10-16T13:20:00+05:30","off_market_hours":false}