{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-rs-10-this-penny-stock-climbs-another-6-after-135-rally-in-a-year-heres-why-11729056759152.html","title":"Small-cap stock below  ₹10: This penny stock climbs another 6% after 135% rally in a year; here’s why","description":"Multi-bagger penny stock 2024: Scanpoint Geomatics has been on a remarkable run, with its share price soaring by over 135% in the past year.","content":"Small-cap penny stock 2024: Scanpoint Geomatics share price surged 6 per cent on Wednesday, October 16, to  ₹9.24 apiece after the company announced an expansion in services to leverage market opportunities and grow its customer base.The company in an exchange filing on Tuesday said it enabled its GIS-based mobile application, \"Survey 360,\" for the B2C (business to consumer) segment alongside its existing B2B (business to business) and B2G (business to government) operations.The company said the app now offers enhanced services for individual users, including the ability to create custom survey forms with flexible question types for field data collection; collection of spatial and location-based data; integration with external Bluetooth GPS/GNSS devices for improved accuracy; advanced data analysis through a powerful query builder; exporting survey data in GeoJSON format for easy sharing and further processing.Penny stock Scanpoint Geomatics has seen a remarkable rise, climbing from  ₹4.31 on January 1, 2024, to  ₹9.20 on October 16, marking a year-to-date increase of 113.46 per cent. Over the past year, the stock has surged from  ₹3.89 to  ₹9.20, reflecting an impressive gain of 136.50 per cent.Scanpoint Geomatics share price erased most gains but was trading with a positive bias, up 0.11 per cent at  ₹8.72 around 11:30 am. The company enjoys a market capitalisation of  ₹146.59 crore. Scanpoint Geomatics stock is currently 22.4 per cent away from its 52-week high of  ₹11.24.In its Q1 FY25 report, the company said its net profit increased by 104 per cent, with revenue from operations soaring by 417 per cent. Looking ahead, Scanpoint Geomatics plans to enter the commodities sector, solar projects, and EPC contracting, leveraging its core competencies in satellite image processing and GIS IT solutions.Scanpoint Geomatics developed its indigenous technology platform, IGiS, which integrates GIS, image processing, photogrammetry, and CAD into a unified solution. The company not only provides geospatial products but also partners with clients to address complex GIS challenges and drive innovation. It has a long-standing partnership with ISRO. The penny stock company caters to various needs across sectors, including agriculture, defence, forestry, disaster management, land information, mining, power, smart cities, urban planning, utilities, and location-based services.","cleaned_content":"small cap penny stock \u003cTWO_THOUSAND\u003e scanpoint geomatics share price surged \u003cSIX_PERCENT\u003e on wednesday october \u003cONE_TEN\u003e to \u003cNINE_\u003e apiece after the company announced an expansion in services to leverage market opportunities and grow its customer base the company in an exchange filing on tuesday said it enabled its gis based mobile application survey \u003cTHREE_HUNDRED\u003e for the b2c business to consumer segment alongside its existing b2b business to business and b2g business to government operations the company said the app now offers enhanced services for individual users including the ability to create custom survey forms with flexible question types for field data collection collection of spatial and location based data integration with external bluetooth gps gnss devices for improved accuracy advanced data analysis through a powerful query builder exporting survey data in geojson format for easy sharing and further processing penny stock scanpoint geomatics has seen a remarkable rise climbing from \u003cFOUR_\u003e on january \u003cONE_\u003e \u003cTWO_THOUSAND\u003e to \u003cNINE_\u003e on october \u003cONE_TEN\u003e marking a year to date increase of \u003cONE_HUNDRED_PERCENT\u003e over the past year the stock has surged from \u003cTHREE_\u003e to \u003cNINE_\u003e reflecting an impressive gain of \u003cONE_HUNDRED_PERCENT\u003e scanpoint geomatics share price erased most gains but was trading with a positive bias up \u003cZERO_PERCENT\u003e at \u003cEIGHT_\u003e around \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e am the company enjoys a market capitalisation of \u003cONE_HUNDRED\u003e crore scanpoint geomatics stock is currently \u003cTWO_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cONE_TEN\u003e in its q1 fy25 report the company said its net profit increased by \u003cONE_HUNDRED_PERCENT\u003e with revenue from operations soaring by \u003cFOUR_HUNDRED_PERCENT\u003e looking ahead scanpoint geomatics plans to enter the commodities sector solar projects and epc contracting leveraging its core competencies in satellite image processing and gis it solutions scanpoint geomatics developed its indigenous technology platform igis which integrates gis image processing photogrammetry and cad into a unified solution the company not only provides geospatial products but also partners with clients to address complex gis challenges and drive innovation it has a long standing partnership with isro the penny stock company caters to various needs across sectors including agriculture defence forestry disaster management land information mining power smart cities urban planning utilities and location based services","timestamp":"2024-10-16T12:16:00+05:30","market_timestamp":"2024-10-16T12:16:00+05:30","off_market_hours":false}