{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-from-dlf-to-lic-housing-ganesh-dongre-recommends-three-stocks-for-monday-11729432414791.html","title":"Buy or sell: From DLF to LIC Housing — Ganesh Dongre recommends three stocks for Monday","description":"Buy or sell: Ganesh Dongre, Senior Manager - Technical Research at Anand Rathi has recommended to buy DLF, LIC Housing Finance and National Aluminium Company Limited on October 21.","content":"Buy or sell: Last week, both the Nifty and Bank Nifty indices were in oversold conditions, which led to a significant rebound followed by sideways movement. The Nifty index bounced from the key support level of 24,800 but was unable to break through the immediate resistance at 25,300.Throughout the week, it remained within this range, showing some weakness but recovering towards the end. Market sentiment continues to be cautious due to the prevailing geopolitical tensions between Israel and Iran, along with SEBI's new, stricter regulations on the derivatives market.The week opened with a gap-up as the Nifty tested the 25,300-resistance zone, but profit-booking persisted throughout, causing the index to close near the support zone of 24,800-25,000 after reaching a new weekly low of 24,600. The critical near-term support is 24,800, which aligns with last month’s low. If the index falls below the 24,800-24,900 range, it may correct further toward 24,000 in the coming week. The key support level for the week is placed at 24,600, which is close to the 100-day moving average (100DMA), while resistance lies at 25,700. A sustained close above the 25,700-25,800 range could trigger an upward move targeting the previous lifetime high of 26,300.In the case of Bank Nifty, the index closed the week at the 52,000 level, registering a 2% gain. After opening with a gap-up on Monday, it experienced continuous selling pressure, reaching the support zone of 50,000-50,500 and at the weekend recovered back and close above the resistance zone of 52000 marks. If Bank Nifty closes daily above 52,000, there is a possibility for upward movement toward the 53,000-53,500 resistance zone, which corresponds to the previous weekly high. Key support remains at 50,000, and traders are advised to exercise caution if the index closes below 52,000.Both the Nifty and Bank Nifty indices have managed to close above their respective monthly support zones, despite initial market volatility, maintaining a generally bullish bias. Investors are advised to closely monitor key support and resistance levels as they evaluate trading opportunities in the forthcoming sessions.1] DLF: Buy at  ₹865-875 | Target Price:  ₹915 | Stop Loss:  ₹8402] LIC Housing Finance: Buy at  ₹615-620 | Target Price:  ₹650 | Stop Loss:  ₹5903] National Aluminium Company Limited: Buy at  ₹232 | Target Price:  ₹255 | Stop Loss:  ₹215","cleaned_content":"buy or sell last week both the nifty and bank nifty indices were in oversold conditions which led to a significant rebound followed by sideways movement the nifty index bounced from the key support level of \u003cTWO_TEN_THOUSAND\u003e but was unable to break through the immediate resistance at \u003cTWO_TEN_THOUSAND\u003e throughout the week it remained within this range showing some weakness but recovering towards the end market sentiment continues to be cautious due to the prevailing geopolitical tensions between israel and iran along with sebis new stricter regulations on the derivatives market the week opened with a gap up as the nifty tested the \u003cTWO_TEN_THOUSAND\u003e resistance zone but profit booking persisted throughout causing the index to close near the support zone of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e after reaching a new weekly low of \u003cTWO_TEN_THOUSAND\u003e the critical near term support is \u003cTWO_TEN_THOUSAND\u003e which aligns with last month s low if the index falls below the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range it may correct further toward \u003cTWO_TEN_THOUSAND\u003e in the coming week the key support level for the week is placed at \u003cTWO_TEN_THOUSAND\u003e which is close to the \u003cONE_HUNDRED\u003e day moving average \u003cONE_HUNDRED\u003e dma while resistance lies at \u003cTWO_TEN_THOUSAND\u003e a sustained close above the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range could trigger an upward move targeting the previous lifetime high of \u003cTWO_TEN_THOUSAND\u003e in the case of bank nifty the index closed the week at the \u003cFIVE_TEN_THOUSAND\u003e level registering a \u003cTWO_PERCENT\u003e gain after opening with a gap up on monday it experienced continuous selling pressure reaching the support zone of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e and at the weekend recovered back and close above the resistance zone of \u003cFIVE_TEN_THOUSAND\u003e marks if bank nifty closes daily above \u003cFIVE_TEN_THOUSAND\u003e there is a possibility for upward movement toward the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e resistance zone which corresponds to the previous weekly high key support remains at \u003cFIVE_TEN_THOUSAND\u003e and traders are advised to exercise caution if the index closes below \u003cFIVE_TEN_THOUSAND\u003e both the nifty and bank nifty indices have managed to close above their respective monthly support zones despite initial market volatility maintaining a generally bullish bias investors are advised to closely monitor key support and resistance levels as they evaluate trading opportunities in the forthcoming sessions 1 dlf buy at \u003cEIGHT_HUNDRED\u003e \u003cEIGHT_HUNDRED\u003e target price \u003cNINE_HUNDRED\u003e stop loss \u003cEIGHT_THOUSAND\u003e lic housing finance buy at \u003cSIX_HUNDRED\u003e \u003cSIX_HUNDRED\u003e target price \u003cSIX_HUNDRED\u003e stop loss \u003cFIVE_THOUSAND\u003e national aluminium company limited buy at \u003cTWO_HUNDRED\u003e target price \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e","timestamp":"2024-10-20T19:48:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}