{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-sagar-doshi-of-nuvama-recommends-rec-can-fin-homes-aurobindo-pharma-october-futures-today-11729050716754.html","title":"Stocks to buy or sell: Sagar Doshi of Nuvama recommends REC, Can Fin Homes, Aurobindo Pharma October Futures today","description":"Stocks to buy or sell: Sagar Doshi of Nuvama Professional Clients Group recommends these three stocks today - REC Ltd, Can Fin Homes Ltd, and Aurobindo Pharma October Futures.","content":"Stock Market News: At the start of trading on Wednesday, both the Sensex and Nifty 50, the domestic benchmark indices, experienced selling pressure, opening with a slight decline.The Nifty 50 index began at 25,008.55 points, showing a decrease of 48.80 points or 0.19% while the Sensex opened at 81,646 points, down by 173 points or 0.21%.According to analysts, the ongoing selling by foreign institutional investors is being countered by purchases from domestic investors, potentially leading to the Nifty 50 stabilising around the 25,000 mark.Chief Investment Strategist, Dr. V K Vijayakumar from Geojit Financial Services pointed out that the ongoing bull run in India has largely been driven by consistent domestic investments, which have offset the selling pressure from foreign institutional investors.The market will continue to receive support from domestic investments, but the high valuations will limit the potential for further gains. It is expected that the Nifty will hover around the 25000 mark during consolidation. The upcoming Q2 earnings are anticipated to be lackluster, except for the IT, banking, and certain segments of the automotive industry, explained Vijayakumar.Nifty 50 is facing resistance at its previous week’s high however charts are making higher high pattern on hourly timeframe indicating that there is buying on dips. Overall the patterns are open for a short covering move towards 25,300-25,400 odd on the upside with 24,900 odd acting as active demand zone on the index.Bank Nifty as well is showing strength for a potential upside as this index has held its closing at a 2 week high. For 2 consecutive days Bank Nifty spot has closed above the resistance of 51800 and this allows further upside towards 52,350 / 52,550 on charts. On lower timeframe – hourly charts, Bank Nifty is moving higher in an upward channel wherein support is seen emerging at 51,600 odd.On stocks to buy or Sell on Wednesday, Sagar Doshi of Nuvama recommended three stocks - REC Ltd, Can Fin Homes Ltd, and Aurobindo Pharma October Futures.For the first time in past 2 years REC had closed below its 200 DMA last week only to gain back in following days. A strong negation of the break of 200 DMA was seen in last week’s price action on REC. With REC now closing at a 2 weeks high patterns on daily charts suggest that this buying is likely to continue with momentum to trigger short covering for targets 8% to 10% higher from CMP.A retest of its previous breakout was observed on charts of CANFINHOME in last week’s trading session. Stock is forming a cup and handle pattern on daily charts after reversing its stance just before hitting the 200 DMA support. Upside momentum is likely to pick up above 900 as the stock further breaks out of a sloping trendline resistance for a 10-12% rally from CMP into new all-time highs.After a double top rejection in September 2024 stock has been making lower highs on charts for the past 4 weeks now. A fresh bearish flag pattern formation is visible on charts with momentum likely to escalate below 1,470 odd for a quick 6-8% sell off. Near to 1,380 odd zone a fresh support emerges which can act as a potential target for the ongoing bearish pattern on this stock.","cleaned_content":"stock market news at the start of trading on wednesday both the sensex and nifty \u003cFIVE_TEN\u003e the domestic benchmark indices experienced selling pressure opening with a slight decline the nifty \u003cFIVE_TEN\u003e index began at \u003cTWO_TEN_THOUSAND\u003e points showing a decrease of \u003cFOUR_TEN\u003e points or \u003cZERO_PERCENT\u003e while the sensex opened at \u003cEIGHT_TEN_THOUSAND\u003e points down by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e according to analysts the ongoing selling by foreign institutional investors is being countered by purchases from domestic investors potentially leading to the nifty \u003cFIVE_TEN\u003e stabilising around the \u003cTWO_TEN_THOUSAND\u003e mark chief investment strategist dr v k vijayakumar from geojit financial services pointed out that the ongoing bull run in india has largely been driven by consistent domestic investments which have offset the selling pressure from foreign institutional investors the market will continue to receive support from domestic investments but the high valuations will limit the potential for further gains it is expected that the nifty will hover around the \u003cTWO_TEN_THOUSAND\u003e mark during consolidation the upcoming q2 earnings are anticipated to be lackluster except for the it banking and certain segments of the automotive industry explained vijayakumar nifty \u003cFIVE_TEN\u003e is facing resistance at its previous week s high however charts are making higher high pattern on hourly timeframe indicating that there is buying on dips overall the patterns are open for a short covering move towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e odd on the upside with \u003cTWO_TEN_THOUSAND\u003e odd acting as active demand zone on the index bank nifty as well is showing strength for a potential upside as this index has held its closing at a \u003cTWO_\u003e week high for \u003cTWO_\u003e consecutive days bank nifty spot has closed above the resistance of \u003cFIVE_TEN_THOUSAND\u003e and this allows further upside towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e on charts on lower timeframe hourly charts bank nifty is moving higher in an upward channel wherein support is seen emerging at \u003cFIVE_TEN_THOUSAND\u003e odd on stocks to buy or sell on wednesday sagar doshi of nuvama recommended three stocks rec ltd can fin homes ltd and aurobindo pharma october futures for the first time in past \u003cTWO_\u003e years rec had closed below its \u003cTWO_HUNDRED\u003e dma last week only to gain back in following days a strong negation of the break of \u003cTWO_HUNDRED\u003e dma was seen in last week s price action on rec with rec now closing at a \u003cTWO_\u003e weeks high patterns on daily charts suggest that this buying is likely to continue with momentum to trigger short covering for targets \u003cEIGHT_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e higher from cmp a retest of its previous breakout was observed on charts of canfinhome in last week s trading session stock is forming a cup and handle pattern on daily charts after reversing its stance just before hitting the \u003cTWO_HUNDRED\u003e dma support upside momentum is likely to pick up above \u003cNINE_HUNDRED\u003e as the stock further breaks out of a sloping trendline resistance for a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e rally from cmp into new all time highs after a double top rejection in september \u003cTWO_THOUSAND\u003e stock has been making lower highs on charts for the past \u003cFOUR_\u003e weeks now a fresh bearish flag pattern formation is visible on charts with momentum likely to escalate below \u003cONE_THOUSAND\u003e odd for a quick \u003cSIX_\u003e \u003cEIGHT_PERCENT\u003e sell off near to \u003cONE_THOUSAND\u003e odd zone a fresh support emerges which can act as a potential target for the ongoing bearish pattern on this stock","timestamp":"2024-10-16T10:00:00+05:30","market_timestamp":"2024-10-16T10:00:00+05:30","off_market_hours":false}