{"url":"https://www.livemint.com/market/stock-market-news/tejas-networks-stock-soars-20-to-3-month-high-on-stellar-q2-numbers-up-1421-in-4-years-11729481572953.html","title":"Tejas Networks shares soar 20% to 3-month high on stellar Q2 numbers, up 1,400% in 4 years","description":"Tejas Networks shares rose 20% to  ₹1,427 after reporting a 6x increase in Q2FY25 revenue, reaching  ₹2,811 crore. The company returned to profitability with a net profit of  ₹275 crore, boosted by strong domestic demand and 4G/5G shipments for BSNL.","content":"Shares of Tejas Networks, a Tata Group-backed company, surged 20% in early morning trade on Monday, October 21 to their three-month high of  ₹1,427 apiece. This sharp rise follows the company's impressive Q2FY25 numbers, which were released after market hours on Friday.The company reported a six-times jump in consolidated revenue from operations at  ₹2,811 crore in Q2FY25 compared to  ₹396 crore during the same period last year. It posted a profit after tax (PAT) of  ₹275 crore, a significant turnaround from a net loss of  ₹13 crore in Q2FY24.After nine consecutive quarters of net losses, the company returned to profitability in Q4FY24 and has maintained this momentum, reporting a net profit of  ₹353 crore for H1FY25, compared to a net loss of  ₹39 crore in the same period last fiscal year.In the September quarter, Tejas Networks' revenue mix was primarily driven by India's private sector contributions, accounting for 93% of total revenue, a significant 13.7x YoY growth, largely due to BSNL 4G-related shipments to TCS. In contrast, the India-government segment contributed 4%, reflecting a 5% YoY decline, while international revenues comprised 3%, marking a 3% YoY decline, mainly from key shipments to Africa and South Asia.The company ramped up 4G/5G RAN shipments for BSNL's pan-India network, having cumulatively shipped equipment to over 58,000 sites. It also received additional orders for densification of installed 4G sites in select circles. Internationally, Tejas Networks saw strong traction for its GPON and DWDM products, securing new customer wins in the Americas and Africa, including an initial order for network modernisation in the U.S.At the end of September quarter, the company's order backlog stood at  ₹4,845 crore, with  ₹4,627 crore from India and  ₹218 crore from international markets, as per the company's Q2 investor presentation.Looking ahead, the company is focusing on several key opportunities across both wireless and wireline segments. In the wireless sector, the company is poised to benefit from the expansion of BSNL’s 4G network and the subsequent upgrade to 5G.Additionally, it is targeting projects such as the Indian Railways' Kavach system, a collision avoidance technology, and private 5G applications for large enterprises in India.In the wireline segment, the company aims to capitalise on Bharatnet Phase 3 initiatives and the expansion of DWDM backbone networks in the utilities sector. Furthermore, the company is pursuing FTTH (Fiber to the Home) and network modernization contracts with various operators in the EMEA (Europe, the Middle East, and Africa) region and the Americas.These strategic initiatives position Tejas Networks to leverage significant growth opportunities in the evolving telecommunications landscape.Over the last four years, the stock has delivered an impressive return of 1421%, rising from  ₹90 per share to its current trading value of  ₹1,369. Notably, in April, the stock recorded its largest monthly gain, soaring by 74%.Tejas Networks is a part of the Tata Group, with Panatone Finvest (a subsidiary of Tata Sons) being the majority shareholder. It designs and manufactures high-performance wireline and wireless networking products for telecommunications service providers, internet service providers, utilities, defense, and government entities in over 75 countries.","cleaned_content":"shares of tejas networks a tata group backed company surged \u003cTWO_TEN_PERCENT\u003e in early morning trade on monday october \u003cTWO_TEN\u003e to their three month high of \u003cONE_THOUSAND\u003e apiece this sharp rise follows the companys impressive q2fy25 numbers which were released after market hours on friday the company reported a six times jump in consolidated revenue from operations at \u003cTWO_THOUSAND\u003e crore in q2fy25 compared to \u003cTHREE_HUNDRED\u003e crore during the same period last year it posted a profit after tax pat of \u003cTWO_HUNDRED\u003e crore a significant turnaround from a net loss of \u003cONE_TEN\u003e crore in q2fy24 after nine consecutive quarters of net losses the company returned to profitability in q4fy24 and has maintained this momentum reporting a net profit of \u003cTHREE_HUNDRED\u003e crore for h1fy25 compared to a net loss of \u003cTHREE_TEN\u003e crore in the same period last fiscal year in the september quarter tejas networks revenue mix was primarily driven by indias private sector contributions accounting for \u003cNINE_TEN_PERCENT\u003e of total revenue a significant \u003cONE_TEN\u003e x yoy growth largely due to bsnl \u003cFOUR_\u003e g related shipments to tcs in contrast the india government segment contributed \u003cFOUR_PERCENT\u003e reflecting a \u003cFIVE_PERCENT\u003e yoy decline while international revenues comprised \u003cTHREE_PERCENT\u003e marking a \u003cTHREE_PERCENT\u003e yoy decline mainly from key shipments to africa and south asia the company ramped up \u003cFOUR_\u003e g \u003cFIVE_\u003e g ran shipments for bsnls pan india network having cumulatively shipped equipment to over \u003cFIVE_TEN_THOUSAND\u003e sites it also received additional orders for densification of installed \u003cFOUR_\u003e g sites in select circles internationally tejas networks saw strong traction for its gpon and dwdm products securing new customer wins in the americas and africa including an initial order for network modernisation in the u s at the end of september quarter the companys order backlog stood at \u003cFOUR_THOUSAND\u003e crore with \u003cFOUR_THOUSAND\u003e crore from india and \u003cTWO_HUNDRED\u003e crore from international markets as per the companys q2 investor presentation looking ahead the company is focusing on several key opportunities across both wireless and wireline segments in the wireless sector the company is poised to benefit from the expansion of bsnl s \u003cFOUR_\u003e g network and the subsequent upgrade to \u003cFIVE_\u003e g additionally it is targeting projects such as the indian railways kavach system a collision avoidance technology and private \u003cFIVE_\u003e g applications for large enterprises in india in the wireline segment the company aims to capitalise on bharatnet phase \u003cTHREE_\u003e initiatives and the expansion of dwdm backbone networks in the utilities sector furthermore the company is pursuing ftth fiber to the home and network modernization contracts with various operators in the emea europe the middle east and africa region and the americas these strategic initiatives position tejas networks to leverage significant growth opportunities in the evolving telecommunications landscape over the last four years the stock has delivered an impressive return of \u003cONE_THOUSAND_PERCENT\u003e rising from \u003cNINE_TEN\u003e per share to its current trading value of \u003cONE_THOUSAND\u003e notably in april the stock recorded its largest monthly gain soaring by \u003cSEVEN_TEN_PERCENT\u003e tejas networks is a part of the tata group with panatone finvest a subsidiary of tata sons being the majority shareholder it designs and manufactures high performance wireline and wireless networking products for telecommunications service providers internet service providers utilities defense and government entities in over \u003cSEVEN_TEN\u003e countries","timestamp":"2024-10-21T09:56:00+05:30","market_timestamp":"2024-10-21T09:56:00+05:30","off_market_hours":false}