{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11729219211400.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy today: Chandan Taparia has recommended three stocks to buy today – HCL Technologies, National Aluminium Co., and Hindustan Petroleum Corporation Ltd.","content":"Indian stock market indices, Sensex and Nifty 50, have been under heavy selling pressure, weighed down by escalating geopolitical tensions in the Middle East and the subsequent spike in crude oil prices, weak domestic corporate earnings, and persistent outflow of foreign funds from Indian equities.The domestic equity market is expected to open lower on Friday amid mixed global market cues. The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 24,740 level, a discount of nearly 100 points from the Nifty futures’ previous close.On Thursday, the Indian equity benchmark indices ended lower, with the Nifty 50 falling below 24,800 level. The Sensex declined 494.75 points, or 0.61%, to close at 81,006.61, while the Nifty 50 settled 221.45 points, or 0.89%, lower at 24,749.85.“Nifty 50 Index opened positive above 25,000 mark but witnessed a steep sell off in the first hour. It was followed by the domino effect throughout the session and dropped by 300 points from its high. It gave a breakdown of the head and shoulder pattern on a daily frame and closed with losses of around 220 points. It formed a bearish candle on a daily frame and has been making lower lows from the last three sessions,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Broking and Distribution, MOFSL.According to him, till Nifty 50 holds below 24,850 zones, weakness could be seen towards 24,650 and 24,500 zones while hurdles are placed at 24,850 then 25,000 zones.On option front, Maximum Call OI is at 25,000 then 26,000 strike while Maximum Put OI is at 23,500 then 24,000 strike. Call writing is seen at 25,000 then 26,000 strike while Put writing is seen at 23,500 then 24,800 strike, he noted.“Option data suggest a broader trading range in between 24,300 to 25,300 zones while an immediate range between 24,500 to 25,000 levels,” Taparia said.Bank Nifty index ended 512.25 points, or 0.99%, lower at 51,288.80 on Thursday, forming a bearish candlestick pattern on the daily charts.“Bank Nifty formed a bearish candle on a daily scale and negated the formation of higher lows of the last four sessions. Index again got stuck in a wider range and now till it holds below 51,650 zones some weakness could be seen towards 51,000 then 50,500 levels while on the upside hurdle is seen at 51,500 then 51,750 zones,” Taparia said.Chandan Taparia recommends three stocks to buy today, October 18. According to him, these stocks are technically well placed to see a decent upmove. The three stock picks by Taparia are HCL Technologies, National Aluminium Co., and Hindustan Petroleum Corporation Ltd.Here are three stocks to buy today:HCL Technologies share price has broken out of the consolidation zone on the weekly chart which could take it to new life high territory. The RSI indicator is rising which confirms the upward momentum, Taparia said.He recommends buying HCL Technologies stock for a target price of  ₹1,985 apiece, keeping a stop loss at  ₹1,815 level.National Aluminium stock is on the verge of a breakout from a pennant pattern on the daily chart with large buying volumes to support the up move. The ADX indicator is rising which confirms the upward strength, he added.Taparia recommends buying National Aluminium shares with a target of  ₹245. Stop loss is recommended at  ₹216 level.According to Taparia, HPCL share price has bounced from major support levels with higher than average buying volumes indicating a bullish sentiment. The Stochastic Indicator has exited the oversold zone confirming bullish momentum.He has a ‘buy’ call on HPCL shares with a target price of  ₹460, and a stop loss at  ₹420.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e have been under heavy selling pressure weighed down by escalating geopolitical tensions in the middle east and the subsequent spike in crude oil prices weak domestic corporate earnings and persistent outflow of foreign funds from indian equities the domestic equity market is expected to open lower on friday amid mixed global market cues the trends on gift nifty also indicate a gap down start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cONE_HUNDRED\u003e points from the nifty futures previous close on thursday the indian equity benchmark indices ended lower with the nifty \u003cFIVE_TEN\u003e falling below \u003cTWO_TEN_THOUSAND\u003e level the sensex declined \u003cFOUR_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e index opened positive above \u003cTWO_TEN_THOUSAND\u003e mark but witnessed a steep sell off in the first hour it was followed by the domino effect throughout the session and dropped by \u003cTHREE_HUNDRED\u003e points from its high it gave a breakdown of the head and shoulder pattern on a daily frame and closed with losses of around \u003cTWO_HUNDRED\u003e points it formed a bearish candle on a daily frame and has been making lower lows from the last three sessions said chandan taparia head equity derivatives and technicals broking and distribution mofsl according to him till nifty \u003cFIVE_TEN\u003e holds below \u003cTWO_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e zones while hurdles are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike he noted option data suggest a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels taparia said bank nifty index ended \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e on thursday forming a bearish candlestick pattern on the daily charts bank nifty formed a bearish candle on a daily scale and negated the formation of higher lows of the last four sessions index again got stuck in a wider range and now till it holds below \u003cFIVE_TEN_THOUSAND\u003e zones some weakness could be seen towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e levels while on the upside hurdle is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones taparia said chandan taparia recommends three stocks to buy today october \u003cONE_TEN\u003e according to him these stocks are technically well placed to see a decent upmove the three stock picks by taparia are hcl technologies national aluminium co and hindustan petroleum corporation ltd here are three stocks to buy today hcl technologies share price has broken out of the consolidation zone on the weekly chart which could take it to new life high territory the rsi indicator is rising which confirms the upward momentum taparia said he recommends buying hcl technologies stock for a target price of \u003cONE_THOUSAND\u003e apiece keeping a stop loss at \u003cONE_THOUSAND\u003e level national aluminium stock is on the verge of a breakout from a pennant pattern on the daily chart with large buying volumes to support the up move the adx indicator is rising which confirms the upward strength he added taparia recommends buying national aluminium shares with a target of \u003cTWO_HUNDRED\u003e stop loss is recommended at \u003cTWO_HUNDRED\u003e level according to taparia hpcl share price has bounced from major support levels with higher than average buying volumes indicating a bullish sentiment the stochastic indicator has exited the oversold zone confirming bullish momentum he has a buy call on hpcl shares with a target price of \u003cFOUR_HUNDRED\u003e and a stop loss at \u003cFOUR_HUNDRED\u003e","timestamp":"2024-10-18T08:17:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}