{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-snap-3-day-losing-streak-gains-04-11729245386867.html","title":"Stock market today: Nifty 50, Sensex snap 3-day losing streak, banks, metals shine","description":"Indian stocks showed a smart recovery in the second half of the trading session today, rebounding from an initial weak start. This turnaround propelled the frontline indices to close positively, breaking a three-day losing streak.","content":"Stock market today: Indian stocks showed a smart recovery in the second half of the trading session on Friday, October 18, rebounding from an initial weak start. This turnaround propelled the frontline indices to close on a positive note, breaking a three-day losing streak.The Nifty 50 concluded the session with a gain of 0.42%, closing at 24,854. At one point, the index tumbled below the 24,600 level. However, a robust recovery in the banking and auto stocks helped the index finish in positive territory. Similarly, the Sensex ended the trading day with a gain of 0.27%, closing at 81,227.In the broader market, the Nifty Midcap 100 index rose by 0.31%, closing at 58,649, while the Nifty Smallcap 100 index ended the session with a modest gain of 0.06%, finishing at 19,077.Commenting on today's market performance, Vinod Nair, Head of Research, Geojit Financial Services, said, \"After the morning sell-off, the market bounced from the oversold level driven by selective buying in financials, auto, and metals stocks. The initial set of results from private banks were positive, building an expectation that the upcoming set of financial results on the weekends will also be optimistic.\"\"The metals also performed well, benefiting from a slightly better-than-expected growth in China’s Q3 GDP. Consecutive rate cuts by the ECB supported rate-sensitive stocks,\" he added.Banking stocks demonstrated a significant recovery in today’s trading session, with the Nifty Bank index closing at 52,094, marking a gain of 1.57%. Metal stocks also rebounded significantly after a four-day decline, as investor sentiment was buoyed by China's recent funding initiatives and encouraging economic data.The Nifty Metal index closed the session with a gain of 1.57%, reaching 9,753. On the downside, IT stocks faced significant losses, with 70% of the Nifty IT constituents ending in the red. LTIMindtree and Infosys were among the biggest losers following their earnings releases on Thursday.LTIMindtree saw a decline of 6.3%, closing at  ₹5,991 per share, while Infosys tumbled by 4.5%, finishing at  ₹1,879 per share. Overall, the Nifty IT index ended the session with a drop of 1.47% at 42,106.Similarly, FMCG stocks experienced significant declines in today's session, causing the Nifty FMCG index to reach its lowest point since early August. The index closed the session in the red, down 0.51% at 61,042 points.Today's drop has pushed the index down 8.10% from its recent high of 66,427 points.Shares of Manappuram Finance, Elecon Engineering, Indraprastha Gas, and Mahanagar Gas all experienced declines ranging from 10% to 13.6% today. Overall, 50 constituents of the Nifty 500 index ended Friday's trading session in the red with losses of up to 2%.The decline in Manappuram Finance's shares came after analysts downgraded their target price for the stock due to recent regulatory restrictions imposed by the Reserve Bank of India (RBI) on its subsidiary, Asirvad Micro Finance. In today's intraday day deals, the stock hit its lowest point since November 2023.The drop in Elecon Engineering shares followed the release of its Q2FY25 results today, which missed market expectations. The company reported a profit after tax (PAT) of  ₹88 crore, reflecting a 1% year-on-year decrease, while revenues increased by 4.8% year-on-year to  ₹508 crore.Among the top Nifty 500 performers in today's session, Motilal Oswal Financial Services led the charge, with the stock surging 10.60% to  ₹1,028 per share. It also reached a new all-time high of  ₹1,063 during the trading day. This sharp rally has resulted in a remarkable 46% gain in just nine sessions.Aditya Birla Real Estate also experienced significant gains, rising 6.30% to  ₹3,040 per share. The stock recorded a fresh peak of  ₹3,125 in intraday trading, contributing to an impressive 150% increase in value year-to-date.Other stocks such as Mazagon Dock Shipbuilders, Axis Bank, Tejas Networks, Sundaram Finance, Zee Entertainment and Anand Rathi Wealth all ended with gains exceeding 5%.","cleaned_content":"stock market today indian stocks showed a smart recovery in the second half of the trading session on friday october \u003cONE_TEN\u003e rebounding from an initial weak start this turnaround propelled the frontline indices to close on a positive note breaking a three day losing streak the nifty \u003cFIVE_TEN\u003e concluded the session with a gain of \u003cZERO_PERCENT\u003e closing at \u003cTWO_TEN_THOUSAND\u003e at one point the index tumbled below the \u003cTWO_TEN_THOUSAND\u003e level however a robust recovery in the banking and auto stocks helped the index finish in positive territory similarly the sensex ended the trading day with a gain of \u003cZERO_PERCENT\u003e closing at \u003cEIGHT_TEN_THOUSAND\u003e in the broader market the nifty midcap \u003cONE_HUNDRED\u003e index rose by \u003cZERO_PERCENT\u003e closing at \u003cFIVE_TEN_THOUSAND\u003e while the nifty smallcap \u003cONE_HUNDRED\u003e index ended the session with a modest gain of \u003cZERO_PERCENT\u003e finishing at \u003cONE_TEN_THOUSAND\u003e commenting on todays market performance vinod nair head of research geojit financial services said after the morning sell off the market bounced from the oversold level driven by selective buying in financials auto and metals stocks the initial set of results from private banks were positive building an expectation that the upcoming set of financial results on the weekends will also be optimistic the metals also performed well benefiting from a slightly better than expected growth in china s q3 gdp consecutive rate cuts by the ecb supported rate sensitive stocks he added banking stocks demonstrated a significant recovery in today s trading session with the nifty bank index closing at \u003cFIVE_TEN_THOUSAND\u003e marking a gain of \u003cONE_PERCENT\u003e metal stocks also rebounded significantly after a four day decline as investor sentiment was buoyed by chinas recent funding initiatives and encouraging economic data the nifty metal index closed the session with a gain of \u003cONE_PERCENT\u003e reaching \u003cNINE_THOUSAND\u003e on the downside it stocks faced significant losses with \u003cSEVEN_TEN_PERCENT\u003e of the nifty it constituents ending in the red ltimindtree and infosys were among the biggest losers following their earnings releases on thursday ltimindtree saw a decline of \u003cSIX_PERCENT\u003e closing at \u003cFIVE_THOUSAND\u003e per share while infosys tumbled by \u003cFOUR_PERCENT\u003e finishing at \u003cONE_THOUSAND\u003e per share overall the nifty it index ended the session with a drop of \u003cONE_PERCENT\u003e at \u003cFOUR_TEN_THOUSAND\u003e similarly fmcg stocks experienced significant declines in todays session causing the nifty fmcg index to reach its lowest point since early august the index closed the session in the red down \u003cZERO_PERCENT\u003e at \u003cSIX_TEN_THOUSAND\u003e points todays drop has pushed the index down \u003cEIGHT_PERCENT\u003e from its recent high of \u003cSIX_TEN_THOUSAND\u003e points shares of manappuram finance elecon engineering indraprastha gas and mahanagar gas all experienced declines ranging from \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e today overall \u003cFIVE_TEN\u003e constituents of the nifty \u003cFIVE_HUNDRED\u003e index ended fridays trading session in the red with losses of up to \u003cTWO_PERCENT\u003e the decline in manappuram finances shares came after analysts downgraded their target price for the stock due to recent regulatory restrictions imposed by the reserve bank of india rbi on its subsidiary asirvad micro finance in todays intraday day deals the stock hit its lowest point since november \u003cTWO_THOUSAND\u003e the drop in elecon engineering shares followed the release of its q2fy25 results today which missed market expectations the company reported a profit after tax pat of \u003cEIGHT_TEN\u003e crore reflecting a \u003cONE_PERCENT\u003e year on year decrease while revenues increased by \u003cFOUR_PERCENT\u003e year on year to \u003cFIVE_HUNDRED\u003e crore among the top nifty \u003cFIVE_HUNDRED\u003e performers in todays session motilal oswal financial services led the charge with the stock surging \u003cONE_TEN_PERCENT\u003e to \u003cONE_THOUSAND\u003e per share it also reached a new all time high of \u003cONE_THOUSAND\u003e during the trading day this sharp rally has resulted in a remarkable \u003cFOUR_TEN_PERCENT\u003e gain in just nine sessions aditya birla real estate also experienced significant gains rising \u003cSIX_PERCENT\u003e to \u003cTHREE_THOUSAND\u003e per share the stock recorded a fresh peak of \u003cTHREE_THOUSAND\u003e in intraday trading contributing to an impressive \u003cONE_HUNDRED_PERCENT\u003e increase in value year to date other stocks such as mazagon dock shipbuilders axis bank tejas networks sundaram finance zee entertainment and anand rathi wealth all ended with gains exceeding \u003cFIVE_PERCENT\u003e","timestamp":"2024-10-18T15:32:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}