{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-usha-martin-gains-180-in-2-years-more-than-3180-since-may-2020-11729595345670.html","title":"Multibagger Stock: Usha Martin gains 180% in 2 years, more than 3,180% since May 2020","description":"Multibagger Stock: Over the past decade, including the year 2024, Usha Martin has ended eight out of ten calendar years in positive territory. The standout performance was recorded in CY21, when the stock rallied by an impressive 145%.","content":"In the fast-paced world of investing, finding a multibagger stock that can deliver extraordinary returns within a short period of time is the dream of every investor. Such dreams turned into reality for investors of Usha Martin as shares delivered a phenomenal return.The shares, valued at  ₹141 each just two years ago, have witnessed an astonishing surge of 180% to  ₹394. Furthermore, from their low of  ₹20.40 in May 2020, the shares have experienced an extraordinary ascent of 3,183% to date.Over the past decade, including the year 2024, Usha Martin has ended eight out of ten calendar years in positive territory. The standout performance was recorded in CY21, when the stock rallied by an impressive 145%, followed closely by a 73% gain in CY23. In the current year, Usha Martin has continued its bullish trajectory, delivering a notable 33% return to shareholders thus far.Notably, on October 15, the stock reached a significant milestone, crossing the  ₹450 mark for the first time, with an all-time high recorded at  ₹451 per share.Usha Martin specialises in producing high-performance and high-value specialty wire ropes, LRPC strands, wires, pre-stressing solutions, and cables, and providing bespoke end-fitments, accessories, and related services.Over the years, the company has transformed from a manufacturer into a comprehensive provider of specialty steel wire rope solutions. The company aims to be the leading player in the industry across the world. This objective is further reinforced by its strategically located manufacturing sites in Ranchi, Hoshiarpur, Silvassa, Dubai, Bangkok, and the UK.The company is strategically planning to expand its capacities specifically for high-end value-added products. This expansion will focus on enhancing production capabilities for premium offerings such as crane ropes, compacted ropes, plasticated ropes, mining ropes, and oil and offshore ropes.Rapid urbanisation and the aggressive development plans for Tier-2 and smart cities will remain key growth drivers in the elevator rope market segment in India, where the company has integrated its supply chain to provide faster deliveries to its customers.In FY24, the company's focus on value-driven growth has enabled it to yield a strong performance. Its core wire rope segment contributed 71% to its consolidated revenue compared to 67% during the previous financial year. Within the wire rope sector, the value-added segment's share rose to 71% in FY24 from 65% in the previous year.Additionally, revenue from international markets secured about 55% of its total revenue during the same period.The company has undertaken capital expenditure (capex) programs in a systematic phased approach. Commercial operations of its Phase 1 capex have begun, and the company is advancing into the next phase with an investment of  ₹167 crore in Ranchi and  ₹62 crore in Thailand. This next phase is expected to be completed within 18–24 months, further boosting volume and performance over the coming years.In FY24, the company incorporated a new entity in Saudi Arabia and also acquired the remaining 50% stake in an existing joint venture in Thailand. Furthermore, the company is progressing well towards the upcoming launch of its synthetic slings product—its first foray into synthetics at the Brunton Shaw facility, as per the company's FY24 annual report.","cleaned_content":"in the fast paced world of investing finding a multibagger stock that can deliver extraordinary returns within a short period of time is the dream of every investor such dreams turned into reality for investors of usha martin as shares delivered a phenomenal return the shares valued at \u003cONE_HUNDRED\u003e each just two years ago have witnessed an astonishing surge of \u003cONE_HUNDRED_PERCENT\u003e to \u003cTHREE_HUNDRED\u003e furthermore from their low of \u003cTWO_TEN\u003e in may \u003cTWO_THOUSAND\u003e the shares have experienced an extraordinary ascent of \u003cTHREE_THOUSAND_PERCENT\u003e to date over the past decade including the year \u003cTWO_THOUSAND\u003e usha martin has ended eight out of ten calendar years in positive territory the standout performance was recorded in cy21 when the stock rallied by an impressive \u003cONE_HUNDRED_PERCENT\u003e followed closely by a \u003cSEVEN_TEN_PERCENT\u003e gain in cy23 in the current year usha martin has continued its bullish trajectory delivering a notable \u003cTHREE_TEN_PERCENT\u003e return to shareholders thus far notably on october \u003cONE_TEN\u003e the stock reached a significant milestone crossing the \u003cFOUR_HUNDRED\u003e mark for the first time with an all time high recorded at \u003cFOUR_HUNDRED\u003e per share usha martin specialises in producing high performance and high value specialty wire ropes lrpc strands wires pre stressing solutions and cables and providing bespoke end fitments accessories and related services over the years the company has transformed from a manufacturer into a comprehensive provider of specialty steel wire rope solutions the company aims to be the leading player in the industry across the world this objective is further reinforced by its strategically located manufacturing sites in ranchi hoshiarpur silvassa dubai bangkok and the uk the company is strategically planning to expand its capacities specifically for high end value added products this expansion will focus on enhancing production capabilities for premium offerings such as crane ropes compacted ropes plasticated ropes mining ropes and oil and offshore ropes rapid urbanisation and the aggressive development plans for tier \u003cTWO_\u003e and smart cities will remain key growth drivers in the elevator rope market segment in india where the company has integrated its supply chain to provide faster deliveries to its customers in fy24 the companys focus on value driven growth has enabled it to yield a strong performance its core wire rope segment contributed \u003cSEVEN_TEN_PERCENT\u003e to its consolidated revenue compared to \u003cSIX_TEN_PERCENT\u003e during the previous financial year within the wire rope sector the value added segments share rose to \u003cSEVEN_TEN_PERCENT\u003e in fy24 from \u003cSIX_TEN_PERCENT\u003e in the previous year additionally revenue from international markets secured about \u003cFIVE_TEN_PERCENT\u003e of its total revenue during the same period the company has undertaken capital expenditure capex programs in a systematic phased approach commercial operations of its phase \u003cONE_\u003e capex have begun and the company is advancing into the next phase with an investment of \u003cONE_HUNDRED\u003e crore in ranchi and \u003cSIX_TEN\u003e crore in thailand this next phase is expected to be completed within \u003cONE_TEN\u003e \u003cTWO_TEN\u003e months further boosting volume and performance over the coming years in fy24 the company incorporated a new entity in saudi arabia and also acquired the remaining \u003cFIVE_TEN_PERCENT\u003e stake in an existing joint venture in thailand furthermore the company is progressing well towards the upcoming launch of its synthetic slings product its first foray into synthetics at the brunton shaw facility as per the companys fy24 annual report","timestamp":"2024-10-22T17:10:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}