{"url":"https://www.livemint.com/market/stock-market-news/wipro-bonus-issue-it-majors-board-approves-1-1-issue-of-free-shares-record-date-to-be-fixed-soon-11729157288561.html","title":"Wipro bonus issue: IT major’s board approves 1:1 issue of free shares; Record date to be fixed soon","description":"Wipro bonus issue: India's fourth-largest IT services company also said the record date for the bonus issue will be announced later. The bonus shares will be credited within two months from the date of board approval, i.e., December 15, 2024.","content":"Wipro bonus issue: Wipro announced its July-September quarter results for fiscal 2024-25 (Q2FY25) on Thursday, October 17 and approved a bonus issue of shares in the ratio 1:1 of  ₹2 each. India's fourth-largest information technology (IT) services company also said that the record date for the bonus issue will be announced later. The bonus shares will be credited within two months from the date of board approval, i.e., December 15, 2024.“The board recommended to the shareholders, for their approval, issue of bonus equity shares in the proportion of 1 :1, i.e., one bonus equity share of  ₹2 each for every one fully paid-up equity share held and a bonus issue [stock dividend on American Depositary Share (ADS)] of one ADS for every one ADS held. The record date for reckoning eligible shareholders (including ADS holders) entitled to receive bonus shares will be communicated later,” said Wipro in a regulatory filing to the stock exchanges today.Also Read: Infosys beats Wipro as European clients spur growthWipro's board have recommended a bonus share issuance to shareholders, including stock dividends for ADS holders, at a ratio of 1:1, meaning one additional equity share will be granted for each equity share held. This proposal is contingent upon shareholder approval.\"The bonus equity shares will be issued out of free reserves and/or the securities premium account and/or the capital redemption reserve account of the Company available as of September 30, 2024,\" said the Bengaluru-based IT services exporter.The leading IT giant posted a 21.2 per cent year-on-year (YoY) rise in its consolidated net profit to  ₹3,208.8 crore for the July-September quarter on higher operating profit but gave weak revenue guidance for the next quarter. Wipro had reported a profit of  ₹2,646.3 crore in the year-ago period.Also Read: Wipro Q2 results: Net profit surges 21% to  ₹3,209 crore; here are five key highlightsThe revenue from operations for the second quarter of the current fiscal was  ₹22,301.6 crore, a 0.95 per cent decline from  ₹22,515.9 crore in Q2 FY24. Srini Pallia, CEO and MD of Wipro said Q2 was driven by strong execution, enabling the firm to meet its revenue growth, bookings, and margin expectations.Wipro's net margin expanded 35 basis points (QoQ). The company's large deal bookings are $1.5 billion, the highest in 10 quarters. Operating cash flows of the company recorded at  ₹42.7 billion, an increase of 10.5 per cent YoY, which is 132.3 per cent of the net income for the quarter\"We continued to expand our top accounts, large deal bookings surpassed $1 billion once again, and Capco maintained its momentum for another consecutive quarter. We grew in three out of four markets. In BFSI, consumer, technology and communications sectors,\" he said. However, its revenue for the October-December quarter is expected to be affected by “seasonal furloughs and fewer working days.\"Also Read: Wipro Q2 Results Preview: Revenue to drop 2% YoY, EBIT margin likely flat on wage hike impact; bonus issue eyed\"As a result, we are guiding a sequential revenue growth of -2 per cent to 0 per cent in constant currency. Despite softness in revenue in Q3, we are confident of maintaining our margin in a narrow band,\" he said.The company had earlier given revenue guidance from -1 to 1 per cent for Q2 FY25. \"The long-term potential of our business is strong, and we are prepared to handle the current economic uncertainties,\" said Pallia.\"We have now trained and certified over 44,000 employees in advanced AI. Many employees actively use AI-developer tools across the company,\" said the CEO. Wipro implemented merit-based salary hikes in September 2024.Wipro Chief Human Resources Officer (CHRO) Saurabh Govil said the company will clear all the backlogs of offers made by the end of this calendar year. \"By the end of the current quarter, Q3, we will ensure no backlog of any offers made. It will all be taken care of,\" he said.Also Read: Wipro to consider bonus issue of shares; meeting to be conducted on October 17, details here\"From this fiscal, Q1 onwards, we are onboarding freshers. We have done it in Q1 and Q2, and between 2,500-3,000 freshers will be onboarded every quarter,\" said Govil. Wipro's voluntary attrition rate increased to 14.5 per cent from 14.1 per cent in the preceding June quarter. The current employee count stands at 233,889.Commenting on the Q2 numbers, Aparna Iyer, Chief Financial Officer (CFO), Wipro said, “I am pleased with our performance across all parameters including revenue, bookings, operating margin, cash flow and EPS.\"Regarding operational improvements, we further expanded our margins by 35 basis points, and our EPS grew 6.8 per cent QoQ. Our operating cash flow remains robust at 132.3 per cent of net income in Q2. In the first half of this year, we generated nearly $1B in operating cash flow,\" added Iyer.","cleaned_content":"wipro bonus issue wipro announced its july september quarter results for fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e q2fy25 on thursday october \u003cONE_TEN\u003e and approved a bonus issue of shares in the ratio \u003cONE_\u003e \u003cONE_\u003e of \u003cTWO_\u003e each indias fourth largest information technology it services company also said that the record date for the bonus issue will be announced later the bonus shares will be credited within two months from the date of board approval i e december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the board recommended to the shareholders for their approval issue of bonus equity shares in the proportion of \u003cONE_\u003e \u003cONE_\u003e i e one bonus equity share of \u003cTWO_\u003e each for every one fully paid up equity share held and a bonus issue stock dividend on american depositary share ads of one ads for every one ads held the record date for reckoning eligible shareholders including ads holders entitled to receive bonus shares will be communicated later said wipro in a regulatory filing to the stock exchanges today also read infosys beats wipro as european clients spur growthwipros board have recommended a bonus share issuance to shareholders including stock dividends for ads holders at a ratio of \u003cONE_\u003e \u003cONE_\u003e meaning one additional equity share will be granted for each equity share held this proposal is contingent upon shareholder approval the bonus equity shares will be issued out of free reserves and or the securities premium account and or the capital redemption reserve account of the company available as of september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e said the bengaluru based it services exporter the leading it giant posted a \u003cTWO_TEN_PERCENT\u003e year on year yoy rise in its consolidated net profit to \u003cTHREE_THOUSAND\u003e crore for the july september quarter on higher operating profit but gave weak revenue guidance for the next quarter wipro had reported a profit of \u003cTWO_THOUSAND\u003e crore in the year ago period also read wipro q2 results net profit surges \u003cTWO_TEN_PERCENT\u003e to \u003cTHREE_THOUSAND\u003e crore here are five key highlightsthe revenue from operations for the second quarter of the current fiscal was \u003cTWO_TEN_THOUSAND\u003e crore a \u003cZERO_PERCENT\u003e decline from \u003cTWO_TEN_THOUSAND\u003e crore in q2 fy24 srini pallia ceo and md of wipro said q2 was driven by strong execution enabling the firm to meet its revenue growth bookings and margin expectations wipros net margin expanded \u003cTHREE_TEN\u003e basis points qoq the companys large deal bookings are \u003cONE_\u003e billion the highest in \u003cONE_TEN\u003e quarters operating cash flows of the company recorded at \u003cFOUR_TEN\u003e billion an increase of \u003cONE_TEN_PERCENT\u003e yoy which is \u003cONE_HUNDRED_PERCENT\u003e of the net income for the quarter we continued to expand our top accounts large deal bookings surpassed \u003cONE_\u003e billion once again and capco maintained its momentum for another consecutive quarter we grew in three out of four markets in bfsi consumer technology and communications sectors he said however its revenue for the october december quarter is expected to be affected by seasonal furloughs and fewer working days also read wipro q2 results preview revenue to drop \u003cTWO_PERCENT\u003e yoy ebit margin likely flat on wage hike impact bonus issue eyed as a result we are guiding a sequential revenue growth of \u003cTWO_PERCENT\u003e to \u003cZERO_PERCENT\u003e in constant currency despite softness in revenue in q3 we are confident of maintaining our margin in a narrow band he said the company had earlier given revenue guidance from \u003cONE_\u003e to \u003cONE_PERCENT\u003e for q2 fy25 the long term potential of our business is strong and we are prepared to handle the current economic uncertainties said pallia we have now trained and certified over \u003cFOUR_TEN_THOUSAND\u003e employees in advanced ai many employees actively use ai developer tools across the company said the ceo wipro implemented merit based salary hikes in september \u003cTWO_THOUSAND\u003e wipro chief human resources officer chro saurabh govil said the company will clear all the backlogs of offers made by the end of this calendar year by the end of the current quarter q3 we will ensure no backlog of any offers made it will all be taken care of he said also read wipro to consider bonus issue of shares meeting to be conducted on october \u003cONE_TEN\u003e details here from this fiscal q1 onwards we are onboarding freshers we have done it in q1 and q2 and between \u003cTWO_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e freshers will be onboarded every quarter said govil wipros voluntary attrition rate increased to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in the preceding june quarter the current employee count stands at \u003cTWO_HUNDRED_THOUSAND\u003e commenting on the q2 numbers aparna iyer chief financial officer cfo wipro said i am pleased with our performance across all parameters including revenue bookings operating margin cash flow and eps regarding operational improvements we further expanded our margins by \u003cTHREE_TEN\u003e basis points and our eps grew \u003cSIX_PERCENT\u003e qoq our operating cash flow remains robust at \u003cONE_HUNDRED_PERCENT\u003e of net income in q2 in the first half of this year we generated nearly \u003cONE_\u003e b in operating cash flow added iyer","timestamp":"2024-10-17T16:15:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}