{"url":"https://www.livemint.com/market/stock-market-news/diwali-2024-stock-picks-jupiter-wagons-hindustan-zinc-tata-tech-among-7-stocks-to-buy-for-samvat-2081-by-anand-rathi-11729240116257.html","title":"Diwali 2024 Stock Picks: Jupiter Wagons, Hindustan Zinc, Tata Tech among 7 stocks to buy for Samvat 2081 by Anand Rathi","description":"Diwali 2024 Stock Picks: The 7 stocks to buy in Diwali 2024 include Jupiter Wagons, Hindustan Zinc, Tata Technologies and others.","content":"Diwali 2024 Stock Picks: Indian stock market benchmark indices, Sensex and Nifty 50, saw a short-covering rally on Friday after witnessing a sharp fall over the past three sessions. However, the benchmark Nifty 50 has rallied over 23% in the past 12 months.Brokerage firm Anand Rathi has come out with its list of Diwali stock picks. Anand Rathi’s Diwali technical picks are designed to maximize the wealth over a period of one year (This Diwali to Next Diwali), based upon strong technical patterns from the universe of NSE F\u0026O and cash counters.The seven stock recommendations for the very auspicious occasion of Diwali are selected purely based upon Technical and Derivative parameters, considering the overall momentum in the market, said the brokerage firm.The stocks to buy this Diwali 2024 include IFCI, IRB Infrastructure Developers, Jupiter Wagons, Hindustan Zinc, Tata Technologies, Garden Reach Shipbuilders \u0026 Engineers and BEML.Here are Anand Rathi’s Diwali Stock Picks 2024:After experiencing a significant 36% correction, IFCI shares have stabilized near the daily S4 camarilla pivot, aligning with the 200 days EMA (Exponential Moving Average). On the daily chart, IFCI stock has formed a bullish divergence, making it appear attractive for potential upside. Thus, investors or traders can accumulate IFCI stock with a time frame of around 1 year, Anand Rathi said.The brokerage firm recommends entry point in the stock at  ₹56 - 61 levels, with first target at  ₹80 and second target at  ₹88. Stop loss is recommended at  ₹44 level.For several months, IRB Infra stock has been forming a base just above the weekly Ichimoku Cloud, making the current levels appear attractive. The stock has corrected by approximately 30% from its peak of  ₹78. Currently, it is showing signs of a rebound from its 200-day Exponential Moving Average (DEMA). From an indicator perspective, the weekly RSI has formed an impulsive structure ( V-shape) just shying away from 30 levels, while the monthly RSI remains between  ₹70-65, both of which are positive indicators for the stock’s momentum.Thus, Anand Rathi recommends to accumulate IRB Infrastructure Developers shares at around  ₹55 - 60 levels, for a target of  ₹79 - 86 and with a time frame of around 1 year. Stop loss should be at  ₹43.Jupiter Wagon stock has eroded around 40% of its price from the top of  ₹746. At this juncture, the stock is turning from its 200 DEMA. In addition, there is a breakout from the falling trend line on the daily chart and the stock is very much near its previous demand zone, said the brokerage firm.It recommends traders can accumulate the Jupiter Wagon shares in the entry range of  ₹495 - 525, for a target range of  ₹700 - 760 and with a stop loss at  ₹390 level.Hindustan Zinc stock found support at the placement of its 200 DEMA near  ₹470 level and has been consolidating there since many weeks. We are witnessing multiple supports near  ₹470 mark and right now the stock is on the verge of fresh breakout which would resume the uptrend, Anand Rathi said.It recommends to accumulate Hindustan Zinc shares at an entry range of  ₹480-520, with a time frame of around 1 year and target range of  ₹680 - 750, keeping a stop loss at  ₹380.Tata Technologies stock witnessed a fresh breakout along with confirmation of a trend reversal. The stock has potential to retest its life high. It suggests accumulating Tata Technologies shares at  ₹1,040 - 1,080 levels, keeping a stop loss at  ₹865 and a target range of  ₹1,360 - 1,450.Garden Reach Shipbuilders stock has eroded around 45% of its price from the top. At this juncture, the stock is turning from its 200 DEMA and 61.8% retracement level. In addition, the stock is about to confirm a change of trend by making higher top and higher bottom formation.Anand Rathi suggests accumulating Garden Reach Shipbuilders \u0026 Engineers shares around  ₹1,700 - 1,780 levels, for a target range of  ₹2,425 - 2,650, with a stop loss at  ₹1,300.BEML stock price is turning from its 50 WEMA and 200 DEMA. In addition, there is a breakout from the falling trend line on the daily chart and the stock is very much near its previous demand zone.Traders can accumulate BEML shares around  ₹3,700 - 3,900, for a target price range of  ₹4,800 - 5,400, with a stop loss at  ₹2,975, Anand Rathi said.","cleaned_content":"diwali \u003cTWO_THOUSAND\u003e stock picks indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e saw a short covering rally on friday after witnessing a sharp fall over the past three sessions however the benchmark nifty \u003cFIVE_TEN\u003e has rallied over \u003cTWO_TEN_PERCENT\u003e in the past \u003cONE_TEN\u003e months brokerage firm anand rathi has come out with its list of diwali stock picks anand rathi s diwali technical picks are designed to maximize the wealth over a period of one year this diwali to next diwali based upon strong technical patterns from the universe of nse f o and cash counters the seven stock recommendations for the very auspicious occasion of diwali are selected purely based upon technical and derivative parameters considering the overall momentum in the market said the brokerage firm the stocks to buy this diwali \u003cTWO_THOUSAND\u003e include ifci irb infrastructure developers jupiter wagons hindustan zinc tata technologies garden reach shipbuilders engineers and beml here are anand rathi s diwali stock picks \u003cTWO_THOUSAND\u003e after experiencing a significant \u003cTHREE_TEN_PERCENT\u003e correction ifci shares have stabilized near the daily s4 camarilla pivot aligning with the \u003cTWO_HUNDRED\u003e days ema exponential moving average on the daily chart ifci stock has formed a bullish divergence making it appear attractive for potential upside thus investors or traders can accumulate ifci stock with a time frame of around \u003cONE_\u003e year anand rathi said the brokerage firm recommends entry point in the stock at \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e levels with first target at \u003cEIGHT_TEN\u003e and second target at \u003cEIGHT_TEN\u003e stop loss is recommended at \u003cFOUR_TEN\u003e level for several months irb infra stock has been forming a base just above the weekly ichimoku cloud making the current levels appear attractive the stock has corrected by approximately \u003cTHREE_TEN_PERCENT\u003e from its peak of \u003cSEVEN_TEN\u003e currently it is showing signs of a rebound from its \u003cTWO_HUNDRED\u003e day exponential moving average dema from an indicator perspective the weekly rsi has formed an impulsive structure v shape just shying away from \u003cTHREE_TEN\u003e levels while the monthly rsi remains between \u003cSEVEN_TEN\u003e \u003cSIX_TEN\u003e both of which are positive indicators for the stock s momentum thus anand rathi recommends to accumulate irb infrastructure developers shares at around \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e levels for a target of \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e and with a time frame of around \u003cONE_\u003e year stop loss should be at \u003cFOUR_TEN\u003e jupiter wagon stock has eroded around \u003cFOUR_TEN_PERCENT\u003e of its price from the top of \u003cSEVEN_HUNDRED\u003e at this juncture the stock is turning from its \u003cTWO_HUNDRED\u003e dema in addition there is a breakout from the falling trend line on the daily chart and the stock is very much near its previous demand zone said the brokerage firm it recommends traders can accumulate the jupiter wagon shares in the entry range of \u003cFOUR_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e for a target range of \u003cSEVEN_HUNDRED\u003e \u003cSEVEN_HUNDRED\u003e and with a stop loss at \u003cTHREE_HUNDRED\u003e level hindustan zinc stock found support at the placement of its \u003cTWO_HUNDRED\u003e dema near \u003cFOUR_HUNDRED\u003e level and has been consolidating there since many weeks we are witnessing multiple supports near \u003cFOUR_HUNDRED\u003e mark and right now the stock is on the verge of fresh breakout which would resume the uptrend anand rathi said it recommends to accumulate hindustan zinc shares at an entry range of \u003cFOUR_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e with a time frame of around \u003cONE_\u003e year and target range of \u003cSIX_HUNDRED\u003e \u003cSEVEN_HUNDRED\u003e keeping a stop loss at \u003cTHREE_HUNDRED\u003e tata technologies stock witnessed a fresh breakout along with confirmation of a trend reversal the stock has potential to retest its life high it suggests accumulating tata technologies shares at \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels keeping a stop loss at \u003cEIGHT_HUNDRED\u003e and a target range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e garden reach shipbuilders stock has eroded around \u003cFOUR_TEN_PERCENT\u003e of its price from the top at this juncture the stock is turning from its \u003cTWO_HUNDRED\u003e dema and \u003cSIX_TEN_PERCENT\u003e retracement level in addition the stock is about to confirm a change of trend by making higher top and higher bottom formation anand rathi suggests accumulating garden reach shipbuilders engineers shares around \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels for a target range of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e beml stock price is turning from its \u003cFIVE_TEN\u003e wema and \u003cTWO_HUNDRED\u003e dema in addition there is a breakout from the falling trend line on the daily chart and the stock is very much near its previous demand zone traders can accumulate beml shares around \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e for a target price range of \u003cFOUR_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e with a stop loss at \u003cTWO_THOUSAND\u003e anand rathi said","timestamp":"2024-10-18T14:13:00+05:30","market_timestamp":"2024-10-18T14:13:00+05:30","off_market_hours":false}