{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-tech-mahindra-hdfc-bank-kotak-bank-jio-financial-and-more-11729442542105.html","title":"Stocks to Watch: Tech Mahindra, HDFC Bank, Kotak Bank, Jio Financial, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Tech Mahindra reported a significant rise in consolidated net profit, which more than doubled to  ₹1,250 crore in the July-September quarter of FY2024-25. This jump was primarily driven by special income from asset sales, growth in European and non-American markets, and a strong performance in the banking, financial services, and insurance (BFSI) segment. In the same quarter last year, the company's net profit stood at  ₹493.9 crore. Revenue saw a 3.49 percent increase to  ₹13,313.2 crore, compared to  ₹12,863.9 crore in Q2 FY2023-24.HDFC Bank reported a 5.3 percent year-on-year rise in standalone net profit, reaching  ₹16,821 crore for the July-September quarter of FY2024-25. Net interest income (NII) grew by 10 percent to  ₹30,110 crore. This quarter marks the first time HDFC’s YoY numbers are comparable post-merger with Housing Development Finance Corp in July 2023, a merger that added substantial loans but fewer deposits to the bank's portfolio, leading to the need for faster deposit growth or slower loan expansion in future quarters.Kotak Mahindra Bank posted a 5 percent YoY increase in standalone profit after tax (PAT) for Q2 FY2024-25, reaching  ₹3,344 crore. Net interest income (NII) rose 11 percent to  ₹7,020 crore, though the bank's net interest margin (NIM) narrowed to 4.91 percent, down from 5.22 percent in the same period last year.Indostar Capital Finance reported a 27.9 percent YoY increase in profit for Q2 FY2024-25, with a topline growth of 8.05 percent. Despite a quarterly revenue decline of 13.11 percent, profit increased by 27.08 percent from the previous quarter, reflecting the company’s cost-control efforts. Selling, General \u0026 Administrative expenses were reduced by 5.28 percent quarter-on-quarter but grew by 24.68 percent YoY.Mastek posted an impressive 13.3 percent revenue growth and a 104.79 percent surge in profit for Q2 FY2024-25 on a YoY basis. Quarter-on-quarter, revenue grew by 6.7 percent, while profit jumped by 79.93 percent, showcasing the company's robust growth momentum despite potential economic challenges.Zee Entertainment Enterprises reported mixed Q2 FY2024-25 results on October 18, 2024, with a significant profit surge despite a decline in revenue. The company's revenue dropped by 17.93 percent year-over-year, but profit rose by an impressive 70.3 percent. Compared to the previous quarter, revenue declined by 6.09 percent, while profit surged by 77.31 percent, showcasing the company's ability to manage profitability despite lower revenues.ICICI Lombard General Insurance Company posted strong Q2 FY2024-25 results, with revenue increasing by 16.47 percent year-over-year and profit growing by 20.21 percent. On a quarter-on-quarter basis, revenue rose by 9.93 percent, and profit grew by 19.57 percent, reflecting the company's consistent growth trajectory in both topline and profitability.L\u0026T Finance reported a robust Q2 FY2024-25 performance, with year-over-year revenue growth of 13.62 percent and a profit increase of 16.88 percent. Quarter-on-quarter, revenue increased by 5.48 percent, and profit saw a modest rise of 1.47 percent, indicating the company’s ability to maintain steady growth amid fluctuating market conditions.Jio Financial Services delivered a strong Q2 FY2024-25 performance, reporting a year-over-year revenue increase of 9.47 percent and a profit rise of 3.13 percent. The company’s performance compared to the previous quarter was particularly notable, with revenue surging by 143.39 percent and profit growing by 120.41 percent, highlighting robust operational growth despite market challenges.Tata Consumer reported solid Q2 FY2024-25 results, with a 12.87 percent year-over-year increase in revenue and a 7.74 percent rise in profit. However, quarter-on-quarter, revenue declined by 3.16 percent, while profits surged by 25.52 percent. Operating income faced challenges, falling by 10.45 percent quarter-over-quarter, but saw a 4.94 percent year-over-year rise, indicating mixed operational performance as the company adapts to shifting market dynamics.Alembic Pharmaceuticals received final approval from the US FDA for its abbreviated new drug application (ANDA) for Diltiazem Hydrochloride extended-release capsules in 120 mg, 180 mg, and 240 mg strengths. This medication is used in the treatment of hypertension, marking a significant step for the company's US market expansion.KPIT Technologies' board will meet on October 23 to consider fundraising through equity shares or other financial instruments. Additionally, the company's wholly owned step-down subsidiary, PathPartner Technology GmbH in Germany, was voluntarily liquidated effective October 2, 2024.JM Financial received a positive update from the Reserve Bank of India (RBI), which lifted restrictions placed on its subsidiary, JM Financial Products. This allows the subsidiary to resume financing against shares and debentures, after restrictions had been in place since March 2023.Garden Reach Shipbuilders \u0026 Engineers announced that it has secured a letter of intent from the Ministry of Defence for a  ₹491 crore contract. The contract involves the design, development, construction, and integration of equipment for an Acoustic Research Ship (ARS), including testing and supply.","cleaned_content":"tech mahindra reported a significant rise in consolidated net profit which more than doubled to \u003cONE_THOUSAND\u003e crore in the july september quarter of fy2024 \u003cTWO_TEN\u003e this jump was primarily driven by special income from asset sales growth in european and non american markets and a strong performance in the banking financial services and insurance bfsi segment in the same quarter last year the companys net profit stood at \u003cFOUR_HUNDRED\u003e crore revenue saw a \u003cTHREE_PERCENT\u003e increase to \u003cONE_TEN_THOUSAND\u003e crore compared to \u003cONE_TEN_THOUSAND\u003e crore in q2 fy2023 \u003cTWO_TEN\u003e hdfc bank reported a \u003cFIVE_PERCENT\u003e year on year rise in standalone net profit reaching \u003cONE_TEN_THOUSAND\u003e crore for the july september quarter of fy2024 \u003cTWO_TEN\u003e net interest income nii grew by \u003cONE_TEN_PERCENT\u003e to \u003cTHREE_TEN_THOUSAND\u003e crore this quarter marks the first time hdfc s yoy numbers are comparable post merger with housing development finance corp in july \u003cTWO_THOUSAND\u003e a merger that added substantial loans but fewer deposits to the banks portfolio leading to the need for faster deposit growth or slower loan expansion in future quarters kotak mahindra bank posted a \u003cFIVE_PERCENT\u003e yoy increase in standalone profit after tax pat for q2 fy2024 \u003cTWO_TEN\u003e reaching \u003cTHREE_THOUSAND\u003e crore net interest income nii rose \u003cONE_TEN_PERCENT\u003e to \u003cSEVEN_THOUSAND\u003e crore though the banks net interest margin nim narrowed to \u003cFOUR_PERCENT\u003e down from \u003cFIVE_PERCENT\u003e in the same period last year indostar capital finance reported a \u003cTWO_TEN_PERCENT\u003e yoy increase in profit for q2 fy2024 \u003cTWO_TEN\u003e with a topline growth of \u003cEIGHT_PERCENT\u003e despite a quarterly revenue decline of \u003cONE_TEN_PERCENT\u003e profit increased by \u003cTWO_TEN_PERCENT\u003e from the previous quarter reflecting the company s cost control efforts selling general administrative expenses were reduced by \u003cFIVE_PERCENT\u003e quarter on quarter but grew by \u003cTWO_TEN_PERCENT\u003e yoy mastek posted an impressive \u003cONE_TEN_PERCENT\u003e revenue growth and a \u003cONE_HUNDRED_PERCENT\u003e surge in profit for q2 fy2024 \u003cTWO_TEN\u003e on a yoy basis quarter on quarter revenue grew by \u003cSIX_PERCENT\u003e while profit jumped by \u003cSEVEN_TEN_PERCENT\u003e showcasing the companys robust growth momentum despite potential economic challenges zee entertainment enterprises reported mixed q2 fy2024 \u003cTWO_TEN\u003e results on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with a significant profit surge despite a decline in revenue the companys revenue dropped by \u003cONE_TEN_PERCENT\u003e year over year but profit rose by an impressive \u003cSEVEN_TEN_PERCENT\u003e compared to the previous quarter revenue declined by \u003cSIX_PERCENT\u003e while profit surged by \u003cSEVEN_TEN_PERCENT\u003e showcasing the companys ability to manage profitability despite lower revenues icici lombard general insurance company posted strong q2 fy2024 \u003cTWO_TEN\u003e results with revenue increasing by \u003cONE_TEN_PERCENT\u003e year over year and profit growing by \u003cTWO_TEN_PERCENT\u003e on a quarter on quarter basis revenue rose by \u003cNINE_PERCENT\u003e and profit grew by \u003cONE_TEN_PERCENT\u003e reflecting the companys consistent growth trajectory in both topline and profitability l t finance reported a robust q2 fy2024 \u003cTWO_TEN\u003e performance with year over year revenue growth of \u003cONE_TEN_PERCENT\u003e and a profit increase of \u003cONE_TEN_PERCENT\u003e quarter on quarter revenue increased by \u003cFIVE_PERCENT\u003e and profit saw a modest rise of \u003cONE_PERCENT\u003e indicating the company s ability to maintain steady growth amid fluctuating market conditions jio financial services delivered a strong q2 fy2024 \u003cTWO_TEN\u003e performance reporting a year over year revenue increase of \u003cNINE_PERCENT\u003e and a profit rise of \u003cTHREE_PERCENT\u003e the company s performance compared to the previous quarter was particularly notable with revenue surging by \u003cONE_HUNDRED_PERCENT\u003e and profit growing by \u003cONE_HUNDRED_PERCENT\u003e highlighting robust operational growth despite market challenges tata consumer reported solid q2 fy2024 \u003cTWO_TEN\u003e results with a \u003cONE_TEN_PERCENT\u003e year over year increase in revenue and a \u003cSEVEN_PERCENT\u003e rise in profit however quarter on quarter revenue declined by \u003cTHREE_PERCENT\u003e while profits surged by \u003cTWO_TEN_PERCENT\u003e operating income faced challenges falling by \u003cONE_TEN_PERCENT\u003e quarter over quarter but saw a \u003cFOUR_PERCENT\u003e year over year rise indicating mixed operational performance as the company adapts to shifting market dynamics alembic pharmaceuticals received final approval from the us fda for its abbreviated new drug application anda for diltiazem hydrochloride extended release capsules in \u003cONE_HUNDRED\u003e mg \u003cONE_HUNDRED\u003e mg and \u003cTWO_HUNDRED\u003e mg strengths this medication is used in the treatment of hypertension marking a significant step for the companys us market expansion kpit technologies board will meet on october \u003cTWO_TEN\u003e to consider fundraising through equity shares or other financial instruments additionally the companys wholly owned step down subsidiary pathpartner technology gmbh in germany was voluntarily liquidated effective october \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e jm financial received a positive update from the reserve bank of india rbi which lifted restrictions placed on its subsidiary jm financial products this allows the subsidiary to resume financing against shares and debentures after restrictions had been in place since march \u003cTWO_THOUSAND\u003e garden reach shipbuilders engineers announced that it has secured a letter of intent from the ministry of defence for a \u003cFOUR_HUNDRED\u003e crore contract the contract involves the design development construction and integration of equipment for an acoustic research ship ars including testing and supply","timestamp":"2024-10-21T08:29:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}