{"url":"https://www.livemint.com/market/stock-market-news/hyundai-motor-shares-make-flat-debut-lists-at-rs-1-934-on-nse-a-discount-of-1-3-from-ipo-price-11729569672695.html","title":"Hyundai Motor shares make flat debut, list at  ₹1,934 on NSE, a discount of 1.3% to IPO price","description":"Shares of Hyundai Motor made a muted debut on the bourses on Tuesday, October 22 as they listed at  ₹1,934 on NSE, a discount of 1.3 per cent to the issue price of  ₹1,960. Meanwhile, on BSE, it listed at  ₹1931, a discount of 1.5 per cent.","content":"Hyundai Motor India IPO listing: Shares of Hyundai Motor made a muted debut on the bourses on Tuesday, October 22 as they listed at  ₹1,934 on NSE, a discount of 1.3 per cent to the issue price of  ₹1,960. Meanwhile, on BSE, it listed at  ₹1931, down 1.5 per cent.The initial public offering (IPO), valued at  ₹27,870.16 crore, is India's largest public offering to date. It was open for subscription from October 15 to October 17. The public offer was priced in the range of  ₹1,865-1,960 per share.Following the three days of bidding, Hyundai Motor IPO closed with a decent but less-than-anticipated demand, garnering 2.37 times bids. The IPO received bids for 23.63 crore shares against 9.89 crore shares on offer. The retail investor and non-institutional investors segments were not fully subscribed in the three days of bidding. The first one was booked 0.50 times, while the NII category saw a subscription of 0.6 times. The qualified institutional buyers (QIB) quota was the only segment that was fully subscribed, with 6.97 times bids.Hyundai Motor IPO was entirely an offer for sale (OFS) of 14.22 crore shares with no fresh issue component. Post the issue, promoter shareholding in the company will be reduced to 82.5 per cent. The company raised  ₹8,315.28 crore from anchor investors on October 14, 2024. Retail investors could apply with a minimum lot size of seven shares, requiring a minimum investment of  ₹13,720.The company will not receive any proceeds from the offer, as all proceeds will go to the Promoter Selling Shareholder. After deducting offer-related expenses and applicable taxes, which will be borne by the Promoter Selling Shareholder, the remaining funds will be allocated to them.The issue also included a reservation of up to 778,400 shares for employees, offered at a discount of  ₹186 to the issue price.Kotak Mahindra Capital Company Limited, Citigroup Global Markets India Private Limited, HSBC Securities \u0026 Capital Markets Pvt Ltd, J.P. Morgan India Private Limited and Morgan Stanley India Company Pvt Ltd are the book-running lead managers of the Hyundai Motor IPO, while Kfin Technologies Limited is the registrar for the issue.Ahead of its listing, Nomura initiated coverage on the auto stock with a ‘buy’ rating and a target pegged at  ₹2,472 per share. The suggested target implies an upside of over 26 per cent from its issue price. As per the brokerage, Hyundai Motor India is riding on technology and style. Furthermore, it believes the ongoing premiumisation should drive high-quality growth for the stock.The brokerage envisages a long runway for the Indian car industry –with a current penetration rate of 36 cars per 1,000 people. Nomura expects the company to deliver an 8 per cent volume CAGR over FY25-27F driven by 7-8 new models (including facelifts). It sees improvement in EBITDA margins to 14 per cent by FY27F from 13.1 per cent in FY24, led by improving mix, cost reduction and operating leverage.Overall, Nomura forecasts a 17 per cent earnings CAGR for Hyundai Motor India over FY25-27.Another foreign brokerage, Macquarie also initiated coverage on Hyundai Motor India ahead of its market debut with an 'outperform' rating and a target price of  ₹2,235, implying potential gains of over 14 per cent over the issue price. The brokerage believes Hyundai Motor India (HMIL) should trade at a premium price-to-earnings (P/E) multiple compared to its peers due to its favourable portfolio mix and premium positioning.Macquarie sees medium-term growth opportunities from Hyundai's powertrain options, leveraging its parent company's capabilities, and potential market share gains from new model and powertrain launches. The brokerage highlights key drivers such as strong domestic passenger vehicle (PV) demand, Hyundai’s market share trajectory, new launches, and margin improvements from its portfolio mix.Macquarie expects the market to reward consistent earnings growth and rising market share, leading to a sustained P/E premium over other PV players.Incorporated in May 1996, Hyundai Motor India Limited is part of the Hyundai Motor Group, the world's third-largest auto original equipment manufacturer (OEM) by passenger vehicle sales. The company is known for producing reliable, feature-rich, and technologically advanced four-wheeler passenger vehicles, along with manufacturing key components like transmissions and engines.Hyundai Motor India offers mobility solutions through a vast network of 1,366 sales points and 1,550 service points across India. As of March 31, 2024, it has sold nearly 12 million passenger vehicles domestically and through exports.Between the financial years ending March 31, 2023, and March 31, 2024, Hyundai Motor India's revenue increased by 16 per cent, while profit after tax (PAT) grew by 29 per cent.","cleaned_content":"hyundai motor india ipo listing shares of hyundai motor made a muted debut on the bourses on tuesday october \u003cTWO_TEN\u003e as they listed at \u003cONE_THOUSAND\u003e on nse a discount of \u003cONE_PERCENT\u003e to the issue price of \u003cONE_THOUSAND\u003e meanwhile on bse it listed at \u003cONE_THOUSAND\u003e down \u003cONE_PERCENT\u003e the initial public offering ipo valued at \u003cTWO_TEN_THOUSAND\u003e crore is indias largest public offering to date it was open for subscription from october \u003cONE_TEN\u003e to october \u003cONE_TEN\u003e the public offer was priced in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e per share following the three days of bidding hyundai motor ipo closed with a decent but less than anticipated demand garnering \u003cTWO_\u003e times bids the ipo received bids for \u003cTWO_TEN\u003e crore shares against \u003cNINE_\u003e crore shares on offer the retail investor and non institutional investors segments were not fully subscribed in the three days of bidding the first one was booked \u003cZERO_\u003e times while the nii category saw a subscription of \u003cZERO_\u003e times the qualified institutional buyers qib quota was the only segment that was fully subscribed with \u003cSIX_\u003e times bids hyundai motor ipo was entirely an offer for sale ofs of \u003cONE_TEN\u003e crore shares with no fresh issue component post the issue promoter shareholding in the company will be reduced to \u003cEIGHT_TEN_PERCENT\u003e the company raised \u003cEIGHT_THOUSAND\u003e crore from anchor investors on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e retail investors could apply with a minimum lot size of seven shares requiring a minimum investment of \u003cONE_TEN_THOUSAND\u003e the company will not receive any proceeds from the offer as all proceeds will go to the promoter selling shareholder after deducting offer related expenses and applicable taxes which will be borne by the promoter selling shareholder the remaining funds will be allocated to them the issue also included a reservation of up to \u003cSEVEN_HUNDRED_THOUSAND\u003e shares for employees offered at a discount of \u003cONE_HUNDRED\u003e to the issue price kotak mahindra capital company limited citigroup global markets india private limited hsbc securities capital markets pvt ltd j p morgan india private limited and morgan stanley india company pvt ltd are the book running lead managers of the hyundai motor ipo while kfin technologies limited is the registrar for the issue ahead of its listing nomura initiated coverage on the auto stock with a buy rating and a target pegged at \u003cTWO_THOUSAND\u003e per share the suggested target implies an upside of over \u003cTWO_TEN_PERCENT\u003e from its issue price as per the brokerage hyundai motor india is riding on technology and style furthermore it believes the ongoing premiumisation should drive high quality growth for the stock the brokerage envisages a long runway for the indian car industry with a current penetration rate of \u003cTHREE_TEN\u003e cars per \u003cONE_THOUSAND\u003e people nomura expects the company to deliver an \u003cEIGHT_PERCENT\u003e volume cagr over fy25 \u003cTWO_TEN\u003e f driven by \u003cSEVEN_\u003e \u003cEIGHT_\u003e new models including facelifts it sees improvement in ebitda margins to \u003cONE_TEN_PERCENT\u003e by fy27f from \u003cONE_TEN_PERCENT\u003e in fy24 led by improving mix cost reduction and operating leverage overall nomura forecasts a \u003cONE_TEN_PERCENT\u003e earnings cagr for hyundai motor india over fy25 \u003cTWO_TEN\u003e another foreign brokerage macquarie also initiated coverage on hyundai motor india ahead of its market debut with an outperform rating and a target price of \u003cTWO_THOUSAND\u003e implying potential gains of over \u003cONE_TEN_PERCENT\u003e over the issue price the brokerage believes hyundai motor india hmil should trade at a premium price to earnings p e multiple compared to its peers due to its favourable portfolio mix and premium positioning macquarie sees medium term growth opportunities from hyundais powertrain options leveraging its parent companys capabilities and potential market share gains from new model and powertrain launches the brokerage highlights key drivers such as strong domestic passenger vehicle pv demand hyundai s market share trajectory new launches and margin improvements from its portfolio mix macquarie expects the market to reward consistent earnings growth and rising market share leading to a sustained p e premium over other pv players incorporated in may \u003cONE_THOUSAND\u003e hyundai motor india limited is part of the hyundai motor group the worlds third largest auto original equipment manufacturer oem by passenger vehicle sales the company is known for producing reliable feature rich and technologically advanced four wheeler passenger vehicles along with manufacturing key components like transmissions and engines hyundai motor india offers mobility solutions through a vast network of \u003cONE_THOUSAND\u003e sales points and \u003cONE_THOUSAND\u003e service points across india as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e it has sold nearly \u003cONE_TEN\u003e million passenger vehicles domestically and through exports between the financial years ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e hyundai motor indias revenue increased by \u003cONE_TEN_PERCENT\u003e while profit after tax pat grew by \u003cTWO_TEN_PERCENT\u003e","timestamp":"2024-10-22T09:59:00+05:30","market_timestamp":"2024-10-22T09:59:00+05:30","off_market_hours":false}