{"url":"https://www.livemint.com/market/stock-market-news/rvnl-surges-7-on-new-order-book-update-emerges-lowest-bidder-from-maharashtra-metro-rail-11729139227197.html","title":"RVNL share price surges 7% on new order book update regarding Maharashtra Metro Rail","description":"Shares of Rail Vikas Nigam surged over 7 percent on Thursday, October 17 after the company provided and order book update. The company emerged as the Lowest Bidder (L1) from Maharashtra Metro Rail Corporation Limited.","content":"Stock market today: Shares of Rail Vikas Nigam surged over 7 per cent on Thursday, October 17 after the company provided an order book update. The company emerged as the Lowest Bidder (L1) for a project from Maharashtra Metro Rail Corporation Limited. The project worth  ₹270 crore has to be executed within 30 months.The project involves the construction of seven elevated metro stations in Reach 3A of Phase 2 of the Nagpur Metro Rail Project, including Hingna Mount View, Rajiv Nagar, Wanadongri, APMC, Raipur, Hingna Bus Station, and Hingna. Additionally, three elevated metro stations will be built in Reach 4A at Pardi, Kapsi Khurd, and Transport Nagar.Earlier this month, RVNL also emerged as the lowest bidder for an East Coast Railway project, involving the third and fourth line between Jarapada and Talcher Road as well as a new line between Angul and Balram under the MCRL Internal Corridor Phase-I doubling project. The scope includes earthwork, bridge construction, track linking, ballast supply, S\u0026T buildings, level crossings, and other works between Jarapada and Talcher, excluding station yards for both the Jarapada-Budhapank and Angul-Balram sections.The stock rose 7.3 per cent to the day's high of  ₹514.40. After today's rally, it is now 20 per cent away from its 52-week high of  ₹647, which it hit in July. Meanwhile, it has soared 262 per cent from its 52-week low of  ₹142.10, recorded in October 2023.The stock has given multibagger returns in the last one year, surging 181.5 per cent. On a year-to-date (YTD) basis, this railway PSU stock has delivered 175 per cent returns whereas in the last five years, this railway stock has surged nearly 2,000 per cent.","cleaned_content":"stock market today shares of rail vikas nigam surged over \u003cSEVEN_PERCENT\u003e on thursday october \u003cONE_TEN\u003e after the company provided an order book update the company emerged as the lowest bidder l1 for a project from maharashtra metro rail corporation limited the project worth \u003cTWO_HUNDRED\u003e crore has to be executed within \u003cTHREE_TEN\u003e months the project involves the construction of seven elevated metro stations in reach \u003cTHREE_\u003e a of phase \u003cTWO_\u003e of the nagpur metro rail project including hingna mount view rajiv nagar wanadongri apmc raipur hingna bus station and hingna additionally three elevated metro stations will be built in reach \u003cFOUR_\u003e a at pardi kapsi khurd and transport nagar earlier this month rvnl also emerged as the lowest bidder for an east coast railway project involving the third and fourth line between jarapada and talcher road as well as a new line between angul and balram under the mcrl internal corridor phase i doubling project the scope includes earthwork bridge construction track linking ballast supply s t buildings level crossings and other works between jarapada and talcher excluding station yards for both the jarapada budhapank and angul balram sections the stock rose \u003cSEVEN_PERCENT\u003e to the days high of \u003cFIVE_HUNDRED\u003e after todays rally it is now \u003cTWO_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cSIX_HUNDRED\u003e which it hit in july meanwhile it has soared \u003cTWO_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e recorded in october \u003cTWO_THOUSAND\u003e the stock has given multibagger returns in the last one year surging \u003cONE_HUNDRED_PERCENT\u003e on a year to date ytd basis this railway psu stock has delivered \u003cONE_HUNDRED_PERCENT\u003e returns whereas in the last five years this railway stock has surged nearly \u003cTWO_THOUSAND_PERCENT\u003e","timestamp":"2024-10-17T11:08:00+05:30","market_timestamp":"2024-10-17T11:08:00+05:30","off_market_hours":false}