{"url":"https://www.livemint.com/market/stock-market-news/railtel-share-price-jumps-10-on-winning-rs-79-crore-order-from-mhada-11729066989958.html","title":"RailTel share price jumps 10% on winning  ₹79 crore order from MHADA","description":"Investors have responded positively to RailTel’s consistent flow of orders this year, contributing to a 31% increase in the company’s share value year-to-date. The stock concluded CY23 with an impressive gain of 168%.","content":"Shares of RailTel Corporation of India surged 10% in Wednesday's intraday trading to  ₹449 per share following the announcement of a new contract worth  ₹79 crore from the Maharashtra Housing and Area Development Authority (MHADA). The order involves setting up, migrating, and managing a cloud-based data centre and disaster recovery site for MHADA.This is RailTel’s third order win this month. On October 2, the company received two contracts from Bangalore Metro Rail Corporation Ltd totalling  ₹142.87 crore; one for IT Network Infrastructure at various metro stations and depots, and another for upgrading the CCTV system on Reach 1, along with CAMC, as per the company's exchange filing.RailTel closed September with five new orders, including a major contract worth  ₹134 crore from Adani Connex for an Advanced Smart Metering Infrastructure Project. Additionally, the company won a  ₹48.7 crore order from the Health Insurance TPA of India to develop an integrated claims management solution and mobile application, with completion targeted for June 14, 2030.Investors have responded positively to RailTel’s consistent flow of orders this year, contributing to a 31% increase in the company’s share value year-to-date. The stock concluded CY23 with an impressive gain of 168%.RailTel, categorised as a \"Mini Ratna (Category-I)\" Central Public Sector Enterprise, operates as a prominent provider of information and communication technology (ICT) services. It stands as one of India's largest neutral telecom infrastructure providers, boasting an extensive optic fibre network that covers both urban hubs and rural areas.Established on September 26, 2000, RailTel's main goal was to modernise the existing telecom infrastructure, particularly focusing on enhancing train control, operation, and safety systems.Concurrently, it aimed to generate additional revenue streams by developing a nationwide broadband and multimedia network. This endeavour involved strategically laying optical fibre cables along railway tracks, utilising existing right of way.For the June-ending quarter (Q1FY25), the company reported a net profit of  ₹49 crore, a 25% jump as compared to a net profit of  ₹39 crore. The revenue from operations during the same period improved by 19.3% YoY to 558 crore.For the full fiscal year (FY24), the net profit jumped 31.55% YoY to  ₹246 crore, while the revenue from operations surged to 2,568 crore, a 32% YoY improvement.","cleaned_content":"shares of railtel corporation of india surged \u003cONE_TEN_PERCENT\u003e in wednesdays intraday trading to \u003cFOUR_HUNDRED\u003e per share following the announcement of a new contract worth \u003cSEVEN_TEN\u003e crore from the maharashtra housing and area development authority mhada the order involves setting up migrating and managing a cloud based data centre and disaster recovery site for mhada this is railtel s third order win this month on october \u003cTWO_\u003e the company received two contracts from bangalore metro rail corporation ltd totalling \u003cONE_HUNDRED\u003e crore one for it network infrastructure at various metro stations and depots and another for upgrading the cctv system on reach \u003cONE_\u003e along with camc as per the companys exchange filing railtel closed september with five new orders including a major contract worth \u003cONE_HUNDRED\u003e crore from adani connex for an advanced smart metering infrastructure project additionally the company won a \u003cFOUR_TEN\u003e crore order from the health insurance tpa of india to develop an integrated claims management solution and mobile application with completion targeted for june \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e investors have responded positively to railtel s consistent flow of orders this year contributing to a \u003cTHREE_TEN_PERCENT\u003e increase in the company s share value year to date the stock concluded cy23 with an impressive gain of \u003cONE_HUNDRED_PERCENT\u003e railtel categorised as a mini ratna category i central public sector enterprise operates as a prominent provider of information and communication technology ict services it stands as one of indias largest neutral telecom infrastructure providers boasting an extensive optic fibre network that covers both urban hubs and rural areas established on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e railtels main goal was to modernise the existing telecom infrastructure particularly focusing on enhancing train control operation and safety systems concurrently it aimed to generate additional revenue streams by developing a nationwide broadband and multimedia network this endeavour involved strategically laying optical fibre cables along railway tracks utilising existing right of way for the june ending quarter q1fy25 the company reported a net profit of \u003cFOUR_TEN\u003e crore a \u003cTWO_TEN_PERCENT\u003e jump as compared to a net profit of \u003cTHREE_TEN\u003e crore the revenue from operations during the same period improved by \u003cONE_TEN_PERCENT\u003e yoy to \u003cFIVE_HUNDRED\u003e crore for the full fiscal year fy24 the net profit jumped \u003cTHREE_TEN_PERCENT\u003e yoy to \u003cTWO_HUNDRED\u003e crore while the revenue from operations surged to \u003cTWO_THOUSAND\u003e crore a \u003cTHREE_TEN_PERCENT\u003e yoy improvement","timestamp":"2024-10-16T15:56:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}