{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-before-diwali-2024-sharekhan-shares-its-15-top-picks-check-full-list-11729578167973.html","title":"Stocks to buy before Diwali 2024: Sharekhan shares its 15 top picks. Check full list","description":"Diwali Picks 2024: Sharekhan recommended 15 stocks, including Reliance Industries, Bajaj Finserv, and Bharti Airtel, ahead of Diwali 2024 for a robust investment portfolio.","content":"Top stocks to buy: Sharekhan has released its list of top stock recommendations for Diwali 2024, covering a mix of large-cap and mid-cap companies. As markets face volatility due to global and domestic challenges, these stocks have been selected as they have strong potential for returns.The Diwali picks for Samvat 2081 included companies from various sectors such as telecom, finance, FMCG, real estate, and capital goods. The report showed opportunities in companies like Bharti Airtel, Bajaj Finserv, and Reliance Industries. Sharekhan expects these stocks to perform well despite the current market fluctuations.Dabur is a leading FMCG company with a revenue of over  ₹12,000 crore in FY2024. The revival in rural demand and a strong product portfolio will help the company recover from H2 FY2025. Key strategies include market share gains, distribution expansion, and new launches. The company aims for mid-teens earnings growth over FY24-26. The stock has decreased by ~16% from its recent high, presenting a good entry opportunity.CMP: Rs. 571Dee Development offers specialised process piping solutions to industries like oil, gas, and power. The company is expanding its manufacturing capacity to capitalise on the capex revival in these sectors. Strong order inflows are expected from Q4 FY25, backed by government initiatives in energy. Its established customer relationships provide it with a competitive advantage.CMP: Rs. 251Hi-Tech is set to achieve a 1-MTPA capacity by FY2025, with plans to expand to 2 MTPA in the next 3-4 years. The company has early access to solar projects and will benefit from improved steel prices. The stock trades at attractive P/E multiples, reflecting a strong projected PAT CAGR over FY2024-FY2027.CMP: Rs. 185HUDCO is expected to deliver a healthy book value CAGR of ~17%, driven by strong earnings growth and government support for affordable housing. Its recent change to an NBFC – Infrastructure Finance Company allows for financing a wider range of projects, enhancing growth potential. Most of HUDCO’s exposure is government-guaranteed, minimizing risk.CMP: Rs. 215L\u0026T targets a 10% order inflow growth and a 15% revenue increase for FY2025. With an all-time high order book, the company is well-positioned to benefit from both domestic and international markets. The stock is trading at a P/E of 28.5x/FY2026E earnings.CMP: Rs. 3,576Reliance Industries has stable gross revenue, aided by higher Oil to Chemicals (O2C) sales and improved domestic product placements. Jio Platforms reported a 17.8% EBITDA increase, driven by a better subscriber mix and expanded services. Reliance Retail improved its EBITDA margin by 30 bps through better operations. Despite challenges in the O2C segment, innovative ethane cracking helped mitigate some impacts.CMP: Rs. 2,718SBI is well-positioned in India's growing economy, with a strong balance sheet and improved operating metrics. It is expected to maintain a RoA of ~1% in the near term, with broad-based credit growth. The stock trades at attractive valuations, with a Buy rating and a target price of Rs. 975, as per the brokerage.CMP: Rs. 820Sunteck targets a 30-35% pre-sales growth for FY2025, supported by a  ₹5,000 crore project pipeline. With a GDV of  ₹37,480 crore, the company aims to increase this to  ₹60,000 crore in 2-3 years. It plans to raise the average rental income from  ₹35 crore in FY2023 to  ₹320 crore by FY2028.CMP: Rs. 592JLR maintains healthy EBITDA margins and positive cash flow, targeting an 8.5%+ EBIT margin for FY2025. The CV segment is shifting towards profitable growth, aiming for double-digit margins. Tata Motors has increased its domestic PV market share from 5% to 13.3% in H1FY2025.CMP: Rs. 910Mastek specialises in enterprise digital and cloud transformation, helping businesses leverage data and modernize applications. The company is focusing on opportunities in the UK public sector, particularly as many departments begin cloud adoption, leading to potential partnerships with Salesforce and Snowflake. Mastek is gaining traction in North America's healthcare sector, while growth in the UK is supported by the new labour government's clearer strategies, as per the report.CMP: Rs. 3,018The company has successfully repaid approximately  ₹800 crore of its gross debt using IPO proceeds, and it currently holds  ₹325 crore in working capital debt at a lower interest rate of 8.5%, down from 10-10.5%. This reduction is expected to halve the interest costs in FY2025. ABDL is strategically focusing on premiumisation, which currently makes up 35% of its sales volume.CMP: Rs. 332The company’s newer businesses—Bajaj Finserv AMC, Bajaj Securities, and Bajaj Finserv Health—are still in the early stages but represent significant long-term growth opportunities. Its existing lending business consistently outpaces industry growth while maintaining strong profitability metrics. The general insurance sector is also showing healthy growth amid competition, while the life insurance division is adapting to regulatory changes, positioning itself for market share gains. A Buy rating was maintained with a target price of Rs. 2,350.CMP: Rs. 1,821Bharti Airtel is a prominent telecom operator in India and Africa, holding a substantial market share and providing a wide array of services, including mobile voice, data, and mobile money. The company is strategically positioned to benefit from increasing smartphone penetration and data consumption trends, which drive demand for mobile internet services. Airtel is making significant investments in 5G infrastructure, preparing to meet the growing need for high-speed connectivity. The company continues to report industry-leading average revenue per user (ARPU) in the Indian mobile sector, with recent tariff hikes expected to positively impact profitability. Additionally, moderating capital expenditure intensity and improving cash flows will aid in debt reduction.CMP: Rs. 1,707Its expansion efforts are also directed towards larger markets in Mexico, Colombia, and Chile, with a significant capital expenditure of  ₹650-700 crore, of which approximately  ₹500 crore has already been utilized. The stock currently trades at around 27x and 23x its FY25E and FY26E EPS estimates, respectively, positioning it well for potential upside as the capex cycle concludes and productivity improves, as per the report.CMP: Rs. 1,926","cleaned_content":"top stocks to buy sharekhan has released its list of top stock recommendations for diwali \u003cTWO_THOUSAND\u003e covering a mix of large cap and mid cap companies as markets face volatility due to global and domestic challenges these stocks have been selected as they have strong potential for returns the diwali picks for samvat \u003cTWO_THOUSAND\u003e included companies from various sectors such as telecom finance fmcg real estate and capital goods the report showed opportunities in companies like bharti airtel bajaj finserv and reliance industries sharekhan expects these stocks to perform well despite the current market fluctuations dabur is a leading fmcg company with a revenue of over \u003cONE_TEN_THOUSAND\u003e crore in fy2024 the revival in rural demand and a strong product portfolio will help the company recover from h2 fy2025 key strategies include market share gains distribution expansion and new launches the company aims for mid teens earnings growth over fy24 \u003cTWO_TEN\u003e the stock has decreased by \u003cONE_TEN_PERCENT\u003e from its recent high presenting a good entry opportunity cmp rs \u003cFIVE_HUNDRED\u003e dee development offers specialised process piping solutions to industries like oil gas and power the company is expanding its manufacturing capacity to capitalise on the capex revival in these sectors strong order inflows are expected from q4 fy25 backed by government initiatives in energy its established customer relationships provide it with a competitive advantage cmp rs \u003cTWO_HUNDRED\u003e hi tech is set to achieve a \u003cONE_\u003e mtpa capacity by fy2025 with plans to expand to \u003cTWO_\u003e mtpa in the next \u003cTHREE_\u003e \u003cFOUR_\u003e years the company has early access to solar projects and will benefit from improved steel prices the stock trades at attractive p e multiples reflecting a strong projected pat cagr over fy2024 fy2027 cmp rs \u003cONE_HUNDRED\u003e hudco is expected to deliver a healthy book value cagr of \u003cONE_TEN_PERCENT\u003e driven by strong earnings growth and government support for affordable housing its recent change to an nbfc infrastructure finance company allows for financing a wider range of projects enhancing growth potential most of hudco s exposure is government guaranteed minimizing risk cmp rs \u003cTWO_HUNDRED\u003e l t targets a \u003cONE_TEN_PERCENT\u003e order inflow growth and a \u003cONE_TEN_PERCENT\u003e revenue increase for fy2025 with an all time high order book the company is well positioned to benefit from both domestic and international markets the stock is trading at a p e of \u003cTWO_TEN\u003e x fy2026e earnings cmp rs \u003cTHREE_THOUSAND\u003e reliance industries has stable gross revenue aided by higher oil to chemicals o2c sales and improved domestic product placements jio platforms reported a \u003cONE_TEN_PERCENT\u003e ebitda increase driven by a better subscriber mix and expanded services reliance retail improved its ebitda margin by \u003cTHREE_TEN\u003e bps through better operations despite challenges in the o2c segment innovative ethane cracking helped mitigate some impacts cmp rs \u003cTWO_THOUSAND\u003e sbi is well positioned in indias growing economy with a strong balance sheet and improved operating metrics it is expected to maintain a roa of \u003cONE_PERCENT\u003e in the near term with broad based credit growth the stock trades at attractive valuations with a buy rating and a target price of rs \u003cNINE_HUNDRED\u003e as per the brokerage cmp rs \u003cEIGHT_HUNDRED\u003e sunteck targets a \u003cTHREE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e pre sales growth for fy2025 supported by a \u003cFIVE_THOUSAND\u003e crore project pipeline with a gdv of \u003cTHREE_TEN_THOUSAND\u003e crore the company aims to increase this to \u003cSIX_TEN_THOUSAND\u003e crore in \u003cTWO_\u003e \u003cTHREE_\u003e years it plans to raise the average rental income from \u003cTHREE_TEN\u003e crore in fy2023 to \u003cTHREE_HUNDRED\u003e crore by fy2028 cmp rs \u003cFIVE_HUNDRED\u003e jlr maintains healthy ebitda margins and positive cash flow targeting an \u003cEIGHT_PERCENT\u003e ebit margin for fy2025 the cv segment is shifting towards profitable growth aiming for double digit margins tata motors has increased its domestic pv market share from \u003cFIVE_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e in h1fy2025 cmp rs \u003cNINE_HUNDRED\u003e mastek specialises in enterprise digital and cloud transformation helping businesses leverage data and modernize applications the company is focusing on opportunities in the uk public sector particularly as many departments begin cloud adoption leading to potential partnerships with salesforce and snowflake mastek is gaining traction in north americas healthcare sector while growth in the uk is supported by the new labour governments clearer strategies as per the report cmp rs \u003cTHREE_THOUSAND\u003e the company has successfully repaid approximately \u003cEIGHT_HUNDRED\u003e crore of its gross debt using ipo proceeds and it currently holds \u003cTHREE_HUNDRED\u003e crore in working capital debt at a lower interest rate of \u003cEIGHT_PERCENT\u003e down from \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e this reduction is expected to halve the interest costs in fy2025 abdl is strategically focusing on premiumisation which currently makes up \u003cTHREE_TEN_PERCENT\u003e of its sales volume cmp rs \u003cTHREE_HUNDRED\u003e the company s newer businesses bajaj finserv amc bajaj securities and bajaj finserv health are still in the early stages but represent significant long term growth opportunities its existing lending business consistently outpaces industry growth while maintaining strong profitability metrics the general insurance sector is also showing healthy growth amid competition while the life insurance division is adapting to regulatory changes positioning itself for market share gains a buy rating was maintained with a target price of rs \u003cTWO_THOUSAND\u003e cmp rs \u003cONE_THOUSAND\u003e bharti airtel is a prominent telecom operator in india and africa holding a substantial market share and providing a wide array of services including mobile voice data and mobile money the company is strategically positioned to benefit from increasing smartphone penetration and data consumption trends which drive demand for mobile internet services airtel is making significant investments in \u003cFIVE_\u003e g infrastructure preparing to meet the growing need for high speed connectivity the company continues to report industry leading average revenue per user arpu in the indian mobile sector with recent tariff hikes expected to positively impact profitability additionally moderating capital expenditure intensity and improving cash flows will aid in debt reduction cmp rs \u003cONE_THOUSAND\u003e its expansion efforts are also directed towards larger markets in mexico colombia and chile with a significant capital expenditure of \u003cSIX_HUNDRED\u003e \u003cSEVEN_HUNDRED\u003e crore of which approximately \u003cFIVE_HUNDRED\u003e crore has already been utilized the stock currently trades at around \u003cTWO_TEN\u003e x and \u003cTWO_TEN\u003e x its fy25e and fy26e eps estimates respectively positioning it well for potential upside as the capex cycle concludes and productivity improves as per the report cmp rs \u003cONE_THOUSAND\u003e","timestamp":"2024-10-22T13:27:00+05:30","market_timestamp":"2024-10-22T13:27:00+05:30","off_market_hours":false}