{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-time-technoplast-hits-fresh-record-high-rallies-1-100-in-4-years-is-it-still-a-buy-11729064591787.html","title":"Multibagger stock Time Technoplast hits fresh record high, rallies 1,100% in 4 years; is it still a ‘buy’?","description":"Time Technoplast's stock has surged 1,100% from  ₹36.70 to  ₹438 in four years. Systematix Institutional Equities projects continued growth for the stock. It has a target price of  ₹615, reflecting a 40% upside potential.","content":"Shares of Time Technoplast, a leading manufacturer of polymer products, have experienced remarkable growth in recent years, delivering substantial returns to shareholders. The stock has surged from  ₹36.70 four years ago to  ₹438 as of last close, representing a staggering gain of 1,100%.From its all-time low of  ₹22 in April 2020, the stock has surged nearly 2,000% to-date. In today's trading session (October 16), the stock touched a fresh record high of  ₹462 apiece. Despite this substantial rally, analysts believe this stock has more room to run.Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One said, \"Overall the stock is in a strong uptrend and one can continue to have a positive approach; any dips could be bought as previous resistance around 440 to now act as support. On the flip side, 500 will now act as resistance.\"Domestic brokerage Systematix Institutional Equities is also bullish on the stock and sees a strong runway for growth.The brokerage is optimistic about the company's value-added composite products, such as LPG and CNG cascade cylinders, as well as, its stable and established industrial packaging business (including drums, jerry cans, and IBCs).Additionally, Systematix highlights the company’s focus on enhancing its financials to achieve debt-free status within the next 2-3 years. Given these favourable prospects, the brokerage has initiated coverage on the stock with a target price of  ₹615, suggesting an upside potential of 40% from its previous closing price.Time Technoplast is a leader in India and ranks among the top three players globally in industrial packaging and composite products. It is also the largest manufacturer of large-sized plastic drums worldwide, holding an impressive 50-60% market share in India and significant shares in 10 other countries.Following a 17% CAGR in revenue, EBITDA, and PAT from FY22 to FY24, Systematix estimates a continued growth rate of 15%, 17%, and 27% CAGR from FY24 to FY27E, respectively, driven by strong performance in the company's value-added products (VAP) segment, which is expected to see a 20% revenue CAGR and maintain an EBITDA margin of over 18%.Despite annual capex of  ₹1.5-1.7 billion, the brokerage forecasts that pre-tax return on capital employed (RoCE) will expand from 16% in FY24 to 23% in FY27, supported by healthy operating performance, enhanced plant efficiency, and a reduced net working capital cycle (by 10-15 days).Systematix projects that the company will generate annual operating free cash flow (FCF) of over  ₹4 billion in the next three years, which is likely to be utilised to reduce debt and achieve a net cash status by FY27E (with a net debt of approximately  ₹6 billion in FY24).The brokerage anticipates healthy operating cash flow (OCF) to EBITDA ratios of over 60% and FCF to PAT ratios exceeding 80% over the next three years. Management has also identified  ₹2.5-3 billion in non-core, non-performing assets that it plans to divest during FY25-FY26.Proceeds from these divestments will likely be used to fund capital expenditures, reduce debt, and reward shareholders. However, any delays in order inflows for composite LPG cylinders and CNG cascades pose key risks to these estimates, the brokerage noted.","cleaned_content":"shares of time technoplast a leading manufacturer of polymer products have experienced remarkable growth in recent years delivering substantial returns to shareholders the stock has surged from \u003cTHREE_TEN\u003e four years ago to \u003cFOUR_HUNDRED\u003e as of last close representing a staggering gain of \u003cONE_THOUSAND_PERCENT\u003e from its all time low of \u003cTWO_TEN\u003e in april \u003cTWO_THOUSAND\u003e the stock has surged nearly \u003cTWO_THOUSAND_PERCENT\u003e to date in todays trading session october \u003cONE_TEN\u003e the stock touched a fresh record high of \u003cFOUR_HUNDRED\u003e apiece despite this substantial rally analysts believe this stock has more room to run rajesh bhosale equity technical and derivative analyst at angel one said overall the stock is in a strong uptrend and one can continue to have a positive approach any dips could be bought as previous resistance around \u003cFOUR_HUNDRED\u003e to now act as support on the flip side \u003cFIVE_HUNDRED\u003e will now act as resistance domestic brokerage systematix institutional equities is also bullish on the stock and sees a strong runway for growth the brokerage is optimistic about the companys value added composite products such as lpg and cng cascade cylinders as well as its stable and established industrial packaging business including drums jerry cans and ibcs additionally systematix highlights the company s focus on enhancing its financials to achieve debt free status within the next \u003cTWO_\u003e \u003cTHREE_\u003e years given these favourable prospects the brokerage has initiated coverage on the stock with a target price of \u003cSIX_HUNDRED\u003e suggesting an upside potential of \u003cFOUR_TEN_PERCENT\u003e from its previous closing price time technoplast is a leader in india and ranks among the top three players globally in industrial packaging and composite products it is also the largest manufacturer of large sized plastic drums worldwide holding an impressive \u003cFIVE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e market share in india and significant shares in \u003cONE_TEN\u003e other countries following a \u003cONE_TEN_PERCENT\u003e cagr in revenue ebitda and pat from fy22 to fy24 systematix estimates a continued growth rate of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e cagr from fy24 to fy27e respectively driven by strong performance in the companys value added products vap segment which is expected to see a \u003cTWO_TEN_PERCENT\u003e revenue cagr and maintain an ebitda margin of over \u003cONE_TEN_PERCENT\u003e despite annual capex of \u003cONE_\u003e \u003cONE_\u003e billion the brokerage forecasts that pre tax return on capital employed roce will expand from \u003cONE_TEN_PERCENT\u003e in fy24 to \u003cTWO_TEN_PERCENT\u003e in fy27 supported by healthy operating performance enhanced plant efficiency and a reduced net working capital cycle by \u003cONE_TEN\u003e \u003cONE_TEN\u003e days systematix projects that the company will generate annual operating free cash flow fcf of over \u003cFOUR_\u003e billion in the next three years which is likely to be utilised to reduce debt and achieve a net cash status by fy27e with a net debt of approximately \u003cSIX_\u003e billion in fy24 the brokerage anticipates healthy operating cash flow ocf to ebitda ratios of over \u003cSIX_TEN_PERCENT\u003e and fcf to pat ratios exceeding \u003cEIGHT_TEN_PERCENT\u003e over the next three years management has also identified \u003cTWO_\u003e \u003cTHREE_\u003e billion in non core non performing assets that it plans to divest during fy25 fy26 proceeds from these divestments will likely be used to fund capital expenditures reduce debt and reward shareholders however any delays in order inflows for composite lpg cylinders and cng cascades pose key risks to these estimates the brokerage noted","timestamp":"2024-10-16T14:58:00+05:30","market_timestamp":"2024-10-16T14:58:00+05:30","off_market_hours":false}