{"url":"https://www.livemint.com/market/stock-market-news/weekend-wrap-october-18-stock-market-bse-nse-top-market-movers-and-news-of-week-mutual-funds-11729254878037.html","title":"Weekend Wrap: From Mphasis to Motilal Oswal, top market movers and news of week","description":"Stock market: Presenting a comprehensive recap of the week's highlights, spanning from top news to market performance, here's your market wrap for the week concluding on October 18, 2024.","content":"On October 15, SEBI announced a major change that benefits traders in India's stock market. The regulator raised the position limits for trading members in index futures and options (F\u0026O) contracts. These limits now stand at  ₹7,500 crore or 15% of the market’s total open interest (OI), compared to the earlier limit of  ₹500 crore or 15%.The revision shows SEBI’s growing confidence in the stability of the market, allowing trading members more flexibility, while maintaining necessary controls. This move is expected to create more vibrant and dynamic trading, contributing to the overall growth of the capital markets in IndiaGaruda Construction and Engineering made a strong debut in the stock market, listing at a 10.5% premium over its issue price of  ₹95. A premium listing suggests high demand and positive investor sentiment, as buyers were willing to pay more than the original price set during the IPO.On the other hand, Hyundai Motor’s IPO was oversubscribed by 2.37 times. This level of oversubscription suggests that investors see Hyundai Motor as a promising opportunity, expecting good returns. Both companies are riding strong market sentiment, with Garuda’s premium listing and Hyundai’s oversubscription showcasing investor confidence in their growth stories.Several leading asset management companies (AMCs) have launched new fund offers (NFOs), providing fresh investment opportunities for investors. Whiteoak AMC introduced the Whiteoak Capital ESG Best in Class Strategy Fund. TrustMF Small Cap Fund targets smaller, fast-growing companies with high potential, offering investors a chance to tap into the small-cap segment.Edelweiss AMC has rolled out the Nifty500 Multicap Momentum Quality 50 Fund,SBI AMC has launched the Nifty India Consumption Index Fund, centred around India’s consumption-driven economy. Motilal Oswal AMC is focusing on the tech sector with the Digital India Fund, while Baroda BNP Paribas AMC introduced the Nifty Midcap 150 Index Fund. Groww AMC has unveiled the Gold ETF Fund of Funds (FoF), offering an easy way to invest in gold.Kuvera is a free direct mutual fund investing platform. Unless otherwise stated data sourced from BSE, NSE and kuvera.","cleaned_content":"on october \u003cONE_TEN\u003e sebi announced a major change that benefits traders in indias stock market the regulator raised the position limits for trading members in index futures and options f o contracts these limits now stand at \u003cSEVEN_THOUSAND\u003e crore or \u003cONE_TEN_PERCENT\u003e of the market s total open interest oi compared to the earlier limit of \u003cFIVE_HUNDRED\u003e crore or \u003cONE_TEN_PERCENT\u003e the revision shows sebi s growing confidence in the stability of the market allowing trading members more flexibility while maintaining necessary controls this move is expected to create more vibrant and dynamic trading contributing to the overall growth of the capital markets in indiagaruda construction and engineering made a strong debut in the stock market listing at a \u003cONE_TEN_PERCENT\u003e premium over its issue price of \u003cNINE_TEN\u003e a premium listing suggests high demand and positive investor sentiment as buyers were willing to pay more than the original price set during the ipo on the other hand hyundai motor s ipo was oversubscribed by \u003cTWO_\u003e times this level of oversubscription suggests that investors see hyundai motor as a promising opportunity expecting good returns both companies are riding strong market sentiment with garuda s premium listing and hyundai s oversubscription showcasing investor confidence in their growth stories several leading asset management companies amcs have launched new fund offers nfos providing fresh investment opportunities for investors whiteoak amc introduced the whiteoak capital esg best in class strategy fund trustmf small cap fund targets smaller fast growing companies with high potential offering investors a chance to tap into the small cap segment edelweiss amc has rolled out the nifty500 multicap momentum quality \u003cFIVE_TEN\u003e fund sbi amc has launched the nifty india consumption index fund centred around india s consumption driven economy motilal oswal amc is focusing on the tech sector with the digital india fund while baroda bnp paribas amc introduced the nifty midcap \u003cONE_HUNDRED\u003e index fund groww amc has unveiled the gold etf fund of funds fof offering an easy way to invest in gold kuvera is a free direct mutual fund investing platform unless otherwise stated data sourced from bse nse and kuvera","timestamp":"2024-10-19T11:39:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}