{"url":"https://www.livemint.com/market/stock-market-news/nearly-half-of-nifty-smallcap-stocks-trade-20-42-below-52-week-highs-what-should-investors-do-11729164555727.html","title":"Nearly half of Nifty Smallcap stocks trade 20-42% below 52-week highs. What should investors do?","description":"Small-cap stocks on Dalal Street are losing investor interest, trading significantly below recent peaks. Factors include weak earnings forecasts, geopolitical tensions, and profit-taking. Certain sectors like defense and railways have experienced notable declines.","content":"Investor interest in small-cap stocks on Dalal Street seems to be gradually fading, as many of them are now trading significantly below their recent highs. This decline in enthusiasm follows a period when small-cap stocks garnered substantial attention, which drove their valuations to elevated levels.In recent years, small-cap stocks benefited from strong investor sentiment, pushing their valuations higher and making them particularly attractive to market participants seeking growth opportunities. However, the current environment reflects a shift in sentiment, with many investors engaging in profit-taking as fresh catalysts to support further gains remain scarce.Weak earnings projections from Indian companies for the quarter ending in September, combined with escalating geopolitical tensions and significant selling pressure from foreign portfolio investors (FPIs), are currently exerting downward pressure on small-cap stocks.Notably, stocks in the defence and railway sectors, which experienced meteoric rises and substantial rallies in the first half of the current year, are now facing weakened market demand. This shift has resulted in these stocks trading at significantly lower levels compared to their recent peaks.Analysts have been raising concerns over the steep valuations of small-cap stocks, which had attracted strong retail investor interest due to their appeal as more affordable alternatives to large-cap stocks. The promise of gains from rising capital expenditure (capex) had also contributed to significant upward momentum in this segment.However, many investors are now re-evaluating their positions in these stocks.According to data from Trendlyne, 46 stocks within the Nifty Smallcap 100 index are currently trading at discounts of 20% to 42% from their recent 52-week highs. Notably, CreditAccess Grameen has taken the lead in this decline, showing a significant drop of 42% from its peak.In the defence sector, stocks like Garden Reach Shipbuilders, BEML, and Data Patterns (India) have declined up to 40% from their one-year highs. Similarly, railway stocks such as Ircon International, Titagarh Rail Systems, RailTel Corporation, and Jupiter Wagons tumbled approximately 39%.In the banking sector, stocks including Jammu \u0026 Kashmir Bank, UCO Bank, RBL Bank, and Central Bank of India are down by as much as 36%.Electric bus manufacturers have also faced setbacks, with JBM Auto and Olectra Greentech trading down by 29% and 24.26%, respectively, from their one-year highs. Furthermore, despite a recent recovery in shares of Angel One, the stock remains 19% below its one-year high.Overall, the Nifty Small Cap 100 index is currently just 3% off its October peaks, showing a less severe decline compared to larger-cap stocks. This relative stability can be attributed to certain counters within the index that are still providing support, highlighting the mixed sentiment and varied performance across different sectors in the small-cap space.According to the domestic brokerage firm Motilal Oswal, large, mid, and small caps’ market capitalisation-to-GDP continues to trade at historical highs, with small caps now surpassing midcaps.\"With a strong catch-up by midcaps and small caps in the last couple of months, we still believe the margin of safety (in terms of valuations) for these segments at current levels has reduced as compared to large caps. Keeping this in view, the broader market may see some time correction in certain pockets in the near term, and flows will likely shift to large caps,\" said Axis Secur in its recent note.","cleaned_content":"investor interest in small cap stocks on dalal street seems to be gradually fading as many of them are now trading significantly below their recent highs this decline in enthusiasm follows a period when small cap stocks garnered substantial attention which drove their valuations to elevated levels in recent years small cap stocks benefited from strong investor sentiment pushing their valuations higher and making them particularly attractive to market participants seeking growth opportunities however the current environment reflects a shift in sentiment with many investors engaging in profit taking as fresh catalysts to support further gains remain scarce weak earnings projections from indian companies for the quarter ending in september combined with escalating geopolitical tensions and significant selling pressure from foreign portfolio investors fpis are currently exerting downward pressure on small cap stocks notably stocks in the defence and railway sectors which experienced meteoric rises and substantial rallies in the first half of the current year are now facing weakened market demand this shift has resulted in these stocks trading at significantly lower levels compared to their recent peaks analysts have been raising concerns over the steep valuations of small cap stocks which had attracted strong retail investor interest due to their appeal as more affordable alternatives to large cap stocks the promise of gains from rising capital expenditure capex had also contributed to significant upward momentum in this segment however many investors are now re evaluating their positions in these stocks according to data from trendlyne \u003cFOUR_TEN\u003e stocks within the nifty smallcap \u003cONE_HUNDRED\u003e index are currently trading at discounts of \u003cTWO_TEN_PERCENT\u003e to \u003cFOUR_TEN_PERCENT\u003e from their recent \u003cFIVE_TEN\u003e week highs notably creditaccess grameen has taken the lead in this decline showing a significant drop of \u003cFOUR_TEN_PERCENT\u003e from its peak in the defence sector stocks like garden reach shipbuilders beml and data patterns india have declined up to \u003cFOUR_TEN_PERCENT\u003e from their one year highs similarly railway stocks such as ircon international titagarh rail systems railtel corporation and jupiter wagons tumbled approximately \u003cTHREE_TEN_PERCENT\u003e in the banking sector stocks including jammu kashmir bank uco bank rbl bank and central bank of india are down by as much as \u003cTHREE_TEN_PERCENT\u003e electric bus manufacturers have also faced setbacks with jbm auto and olectra greentech trading down by \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively from their one year highs furthermore despite a recent recovery in shares of angel one the stock remains \u003cONE_TEN_PERCENT\u003e below its one year high overall the nifty small cap \u003cONE_HUNDRED\u003e index is currently just \u003cTHREE_PERCENT\u003e off its october peaks showing a less severe decline compared to larger cap stocks this relative stability can be attributed to certain counters within the index that are still providing support highlighting the mixed sentiment and varied performance across different sectors in the small cap space according to the domestic brokerage firm motilal oswal large mid and small caps market capitalisation to gdp continues to trade at historical highs with small caps now surpassing midcaps with a strong catch up by midcaps and small caps in the last couple of months we still believe the margin of safety in terms of valuations for these segments at current levels has reduced as compared to large caps keeping this in view the broader market may see some time correction in certain pockets in the near term and flows will likely shift to large caps said axis secur in its recent note","timestamp":"2024-10-17T17:46:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}