{"url":"https://www.livemint.com/market/stock-market-news/from-a-3-year-perspective-midcaps-and-small-caps-remain-worth-accumulating-sushant-bhansali-of-ambit-11729499803267.html","title":"From a 3-year perspective, midcaps and small caps remain worth accumulating: Sushant Bhansali of Ambit","description":"Sushant Bhansali, CEO, Ambit Asset Management expects earnings growth to moderate, shifting from the mid-20s to the low teens, or possibly lower, for Sensex and Nifty. Furthermore, the key growth drivers are likely to undergo a sectoral shift.","content":"Sushant Bhansali, CEO, Ambit Asset Management expects earnings growth to moderate from the mid-20s to low teens, or possibly lower, for Sensex and Nifty. Furthermore, the key growth drivers are likely to undergo a sectoral shift, with the market favouring companies that outperform broader earnings growth. In an interview, Bhansali said that he believes the markets are likely to sustain at current levels, delivering reasonable positive returns for the rest of the fiscal year. From a 3-year perspective, midcaps and small caps remain worth accumulating, he added. Edited Excerpts:We expect earnings growth to moderate, shifting from the mid-20s to the low teens, or possibly lower, for Sensex and Nifty. Furthermore, the key growth drivers are likely to undergo a sectoral shift, with the market favouring companies that outperform broader earnings growth. We expect the markets to sustain at current levels, offering reasonable positive returns for the rest of the fiscal year. Significant rate cuts could provide upside potential, as quality franchises that have participated less in recent market rallies may drive the market higher as the cost of equity declines.From a three-year perspective, midcaps and smallcaps remain worth accumulating given the strong economic tailwinds benefiting many of these businesses and their improved capital efficiency with lower leverage compared to the past decade.U.S. elections, Federal Reserve policy actions, domestic state elections, and RBI's monetary policy will influence the market dynamics. Additionally, the market participants will closely watch the festival season's consumption patterns as an indicator of the macroeconomic outlook and earnings growth for next year.Highly-leveraged sectors in cyclical industries and those with exorbitant valuations do not offer an adequate risk-reward balance for investors at this juncture.The resurgence of the Chinese economy and markets, along with geopolitical tensions in the Middle East, have made global investors nervous about India and other emerging markets.Start building your portfolio gradually over time, and if the market offers volatility, embrace it by increasing allocations to equities to benefit in the long term.Gold and fixed-income investments are recommended for managing liquidity and hedging against market volatility. Gold allocations should align with your expense requirements for a period that you can sustain in case of severe global imbalances disrupting the macroeconomy and financial markets.Nifty is expected to deliver PAT growth of 5%, marking its slowest pace in several quarters. We will keenly watch trends in select sectors that have shown signs of recovery in recent months, such as chemicals, ITES, and apparel retail.The biggest challenges include select pockets of steep valuations, slowing growth, and rising geopolitical concerns.The investment mantra remains the same in all market and macroeconomic environments: invest in select good and clean businesses with great governance, and churn your portfolio only if you observe disruptive trends. Historically, earnings growth combined with strong governance has delivered the best value for investors, and that should be your primary focus.","cleaned_content":"sushant bhansali ceo ambit asset management expects earnings growth to moderate from the mid \u003cTWO_TEN\u003e s to low teens or possibly lower for sensex and nifty furthermore the key growth drivers are likely to undergo a sectoral shift with the market favouring companies that outperform broader earnings growth in an interview bhansali said that he believes the markets are likely to sustain at current levels delivering reasonable positive returns for the rest of the fiscal year from a \u003cTHREE_\u003e year perspective midcaps and small caps remain worth accumulating he added edited excerpts we expect earnings growth to moderate shifting from the mid \u003cTWO_TEN\u003e s to the low teens or possibly lower for sensex and nifty furthermore the key growth drivers are likely to undergo a sectoral shift with the market favouring companies that outperform broader earnings growth we expect the markets to sustain at current levels offering reasonable positive returns for the rest of the fiscal year significant rate cuts could provide upside potential as quality franchises that have participated less in recent market rallies may drive the market higher as the cost of equity declines from a three year perspective midcaps and smallcaps remain worth accumulating given the strong economic tailwinds benefiting many of these businesses and their improved capital efficiency with lower leverage compared to the past decade u s elections federal reserve policy actions domestic state elections and rbis monetary policy will influence the market dynamics additionally the market participants will closely watch the festival seasons consumption patterns as an indicator of the macroeconomic outlook and earnings growth for next year highly leveraged sectors in cyclical industries and those with exorbitant valuations do not offer an adequate risk reward balance for investors at this juncture the resurgence of the chinese economy and markets along with geopolitical tensions in the middle east have made global investors nervous about india and other emerging markets start building your portfolio gradually over time and if the market offers volatility embrace it by increasing allocations to equities to benefit in the long term gold and fixed income investments are recommended for managing liquidity and hedging against market volatility gold allocations should align with your expense requirements for a period that you can sustain in case of severe global imbalances disrupting the macroeconomy and financial markets nifty is expected to deliver pat growth of \u003cFIVE_PERCENT\u003e marking its slowest pace in several quarters we will keenly watch trends in select sectors that have shown signs of recovery in recent months such as chemicals ites and apparel retail the biggest challenges include select pockets of steep valuations slowing growth and rising geopolitical concerns the investment mantra remains the same in all market and macroeconomic environments invest in select good and clean businesses with great governance and churn your portfolio only if you observe disruptive trends historically earnings growth combined with strong governance has delivered the best value for investors and that should be your primary focus","timestamp":"2024-10-21T15:46:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}