{"url":"https://www.livemint.com/market/stock-market-news/veons-investor-shah-capital-urges-changes-to-boost-share-price-11729534421198.html","title":"Veon’s Investor Shah Capital Urges Changes to Boost Share Price","description":"Shah Capital Management, one of Veon Ltd.’s shareholders, has urged the wireless operator to list Ukraine’s largest mobile company Kyivstar and buy back shares to boost its stock performance.","content":"Shah Capital Management, one of Veon Ltd.’s shareholders, has urged the wireless operator to list Ukraine’s largest mobile company Kyivstar and buy back shares to boost its stock performance.Shah Capital pushed for the listing of Kyivstar on the Nasdaq while citing the potential of “being the sole Ukrainian investment theme on the US equity market,” according to an Oct. 18 dated letter sent to Veon’s management. The North Carolina-based firm owns about 7% stake in Veon.Veon operates across six markets including Ukraine, Pakistan and Bangladesh. It is in the midst of delisting its shares from Euronext Amsterdam, resulting in a sole listing on Nasdaq. The company this month also said it is moving its headquarters from Amsterdam to Dubai to be closer to its key markets.Shah Capital said Veon “should trade at a substantially higher valuation compared to its emerging market telecom peers.” The firm also suggested Veon to publicly list its Pakistan unit Jazz or digital financial services provider JazzCash in Karachi or Dubai.Veon said it shares Shah Capital’s assessment that its current share price indicates potential for further improvement. “We are evaluating options to crystallize the value of our businesses and the assets which we own, including through initial public offerings of some of our companies when relevant,” it said in a statement on Monday.Veon is considering a listing for its unit Kyivstar, Ukraine’s largest mobile operator, Chief Executive Officer Kaan Terzioglu told Bloomberg News in January. He identified Kyiv, Warsaw and London as potential venues for an IPO as soon as next year.The company is also evaluating an IPO for Jazz and will make a decision within a year, Terzioglu said in a separate interview with Bloomberg in August.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"shah capital management one of veon ltd s shareholders has urged the wireless operator to list ukraine s largest mobile company kyivstar and buy back shares to boost its stock performance shah capital pushed for the listing of kyivstar on the nasdaq while citing the potential of being the sole ukrainian investment theme on the us equity market according to an oct \u003cONE_TEN\u003e dated letter sent to veon s management the north carolina based firm owns about \u003cSEVEN_PERCENT\u003e stake in veon veon operates across six markets including ukraine pakistan and bangladesh it is in the midst of delisting its shares from euronext amsterdam resulting in a sole listing on nasdaq the company this month also said it is moving its headquarters from amsterdam to dubai to be closer to its key markets shah capital said veon should trade at a substantially higher valuation compared to its emerging market telecom peers the firm also suggested veon to publicly list its pakistan unit jazz or digital financial services provider jazzcash in karachi or dubai veon said it shares shah capital s assessment that its current share price indicates potential for further improvement we are evaluating options to crystallize the value of our businesses and the assets which we own including through initial public offerings of some of our companies when relevant it said in a statement on monday veon is considering a listing for its unit kyivstar ukraine s largest mobile operator chief executive officer kaan terzioglu told bloomberg news in january he identified kyiv warsaw and london as potential venues for an ipo as soon as next year the company is also evaluating an ipo for jazz and will make a decision within a year terzioglu said in a separate interview with bloomberg in august this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-21T23:43:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}