{"url":"https://www.livemint.com/market/stock-market-news/dmart-share-price-slides-22-in-october-posts-worst-monthly-drop-since-listing-more-pain-ahead-11729440844012.html","title":"DMart share price slides 22% in October, posts worst monthly drop since listing. More pain ahead?","description":"DMart's stock has fallen sharply, now trading below  ₹4,000 for the first time in six months. Analysts predict continued downward pressure, citing weak performance and increased competition from online grocery services.","content":"Shares of Avenue Supermarts, the operator of the retail chain DMart, have come under significant selling pressure over the past 17 trading sessions, leading to a sharp 26% correction. In the last trading session, the stock had fallen below the  ₹4,000 mark for the first time in 6 months to  ₹3,986 apiece.On October 14, the stock recorded one of its worst intraday declines in recent history, dropping 8.50%. This significant fall was triggered by disappointing Q2FY25 results, which fell short of analyst expectations. The weaker-than-expected performance led analysts to revise their target prices downward.In the current month so far, the stock has tumbled 22%, which is the biggest monthly drop since its listing in March 2017. The recent fall has also pushed the stock to trade 32.5% below its peak of  ₹5,899.Looking ahead, technical analysts warn of further downside in the near term. Some forecast that the stock could retreat to  ₹3,500, as bearish sentiment and technical indicators suggest additional weakness may be forthcoming.Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One, stated that DMart has experienced a sharp correction over the past few weeks, and there are currently no signs of a reversal. However,  ₹3,900 is a long-term support level, coinciding with the 200-week moving average. He suggests that investors can consider buying the stock within this range in a staggered manner.Dr Ravi Singh, SVP-Retail Research at Religare Broking, added that DMart has seen a significant price decline recently. He believes there could be further downward pressure in the coming days, as price action and volume analysis indicate more pain ahead. Singh expects the stock to test the  ₹3,700-3,750 mark in upcoming trading sessions, noting that this area serves as a strong support zone for the stock.The company recorded a 14.4% year-on-year (YoY) growth in consolidated revenue for Q2 FY25 at  ₹14,445 crore. However, this marks a slowdown compared to the 18-20% revenue growth seen in previous quarters. The company posted a profit after tax (PAT) of  ₹659 crore, reflecting a 5.8% YoY increase.The growth parameters reflected tepid performance, with only 1.2% YoY growth in sales per store, 1.6% YoY growth in bills per store per day, and a modest 0.5% increase in sales per square foot. Additionally, the cost of retail edged up by 65 basis points as DMart added 6 stores in Q2.Analysts attributed DMart's weak performance in the September quarter to the accelerated growth of online grocery formats, particularly quick commerce, in large metro cities. They believe this expansion has led to a slowdown in key growth metrics for DMart.According to a report by global brokerage firm Phillip Capital, 82% of DMart's stores in the top six cities have been impacted by the rise of quick commerce, while the figure stands slightly lower at 77% in the top 21 cities. The brokerage also noted that store throughput in these impacted markets is higher than the company average, meaning the revenue impact could be greater than the store impact. However, since much of this impact has already been factored into the base, the brokerage expects a moderation in the effect going forward.Phillip Capital maintained its 'Neutral' rating on DMart with a target price of  ₹4,581 per share.Similarly, Axis Securities stated that DMart will likely take time to improve its overall store performance in the near term. It pointed to several challenges, including weak demand in the discretionary category, which is expected to recover significantly only in the second half of FY25 as well as increasing competition from both organised players like Reliance, Star Bazaar, and Zudio and online platforms such as Zepto, Blinkit, and Instamart, particularly as they expand into smaller towns.In this context, the brokerage lowered its target price for the stock from  ₹4,550 to  ₹4,200 while maintaining an unchanged 'Hold' rating.The scale-up of DMart Ready remained significantly lower, growing by only 21% year-on-year in 1HFY25, compared to the rapid expansion of Quick Commerce, despite its smaller size. In light of the disruption caused by quick commerce, ICICI Securities downgraded the stock from 'Add' to 'Reduce' and revised its target price to  ₹4,100.Prabhudas Lilladher also lowered its FY25/26/27 EPS estimates by 5.0%/5.5%/4.9%, downgrading its rating from 'Accumulate' to 'Hold', with a revised target price of  ₹4,748, down from  ₹5,168. Similarly, Jefferies adjusted the DMart price target from  ₹4,600 to  ₹4,400 while maintaining its 'Hold' rating.","cleaned_content":"shares of avenue supermarts the operator of the retail chain dmart have come under significant selling pressure over the past \u003cONE_TEN\u003e trading sessions leading to a sharp \u003cTWO_TEN_PERCENT\u003e correction in the last trading session the stock had fallen below the \u003cFOUR_THOUSAND\u003e mark for the first time in \u003cSIX_\u003e months to \u003cTHREE_THOUSAND\u003e apiece on october \u003cONE_TEN\u003e the stock recorded one of its worst intraday declines in recent history dropping \u003cEIGHT_PERCENT\u003e this significant fall was triggered by disappointing q2fy25 results which fell short of analyst expectations the weaker than expected performance led analysts to revise their target prices downward in the current month so far the stock has tumbled \u003cTWO_TEN_PERCENT\u003e which is the biggest monthly drop since its listing in march \u003cTWO_THOUSAND\u003e the recent fall has also pushed the stock to trade \u003cTHREE_TEN_PERCENT\u003e below its peak of \u003cFIVE_THOUSAND\u003e looking ahead technical analysts warn of further downside in the near term some forecast that the stock could retreat to \u003cTHREE_THOUSAND\u003e as bearish sentiment and technical indicators suggest additional weakness may be forthcoming rajesh bhosale equity technical and derivative analyst at angel one stated that dmart has experienced a sharp correction over the past few weeks and there are currently no signs of a reversal however \u003cTHREE_THOUSAND\u003e is a long term support level coinciding with the \u003cTWO_HUNDRED\u003e week moving average he suggests that investors can consider buying the stock within this range in a staggered manner dr ravi singh svp retail research at religare broking added that dmart has seen a significant price decline recently he believes there could be further downward pressure in the coming days as price action and volume analysis indicate more pain ahead singh expects the stock to test the \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e mark in upcoming trading sessions noting that this area serves as a strong support zone for the stock the company recorded a \u003cONE_TEN_PERCENT\u003e year on year yoy growth in consolidated revenue for q2 fy25 at \u003cONE_TEN_THOUSAND\u003e crore however this marks a slowdown compared to the \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e revenue growth seen in previous quarters the company posted a profit after tax pat of \u003cSIX_HUNDRED\u003e crore reflecting a \u003cFIVE_PERCENT\u003e yoy increase the growth parameters reflected tepid performance with only \u003cONE_PERCENT\u003e yoy growth in sales per store \u003cONE_PERCENT\u003e yoy growth in bills per store per day and a modest \u003cZERO_PERCENT\u003e increase in sales per square foot additionally the cost of retail edged up by \u003cSIX_TEN\u003e basis points as dmart added \u003cSIX_\u003e stores in q2 analysts attributed dmarts weak performance in the september quarter to the accelerated growth of online grocery formats particularly quick commerce in large metro cities they believe this expansion has led to a slowdown in key growth metrics for dmart according to a report by global brokerage firm phillip capital \u003cEIGHT_TEN_PERCENT\u003e of dmarts stores in the top six cities have been impacted by the rise of quick commerce while the figure stands slightly lower at \u003cSEVEN_TEN_PERCENT\u003e in the top \u003cTWO_TEN\u003e cities the brokerage also noted that store throughput in these impacted markets is higher than the company average meaning the revenue impact could be greater than the store impact however since much of this impact has already been factored into the base the brokerage expects a moderation in the effect going forward phillip capital maintained its neutral rating on dmart with a target price of \u003cFOUR_THOUSAND\u003e per share similarly axis securities stated that dmart will likely take time to improve its overall store performance in the near term it pointed to several challenges including weak demand in the discretionary category which is expected to recover significantly only in the second half of fy25 as well as increasing competition from both organised players like reliance star bazaar and zudio and online platforms such as zepto blinkit and instamart particularly as they expand into smaller towns in this context the brokerage lowered its target price for the stock from \u003cFOUR_THOUSAND\u003e to \u003cFOUR_THOUSAND\u003e while maintaining an unchanged hold rating the scale up of dmart ready remained significantly lower growing by only \u003cTWO_TEN_PERCENT\u003e year on year in \u003cONE_\u003e hfy25 compared to the rapid expansion of quick commerce despite its smaller size in light of the disruption caused by quick commerce icici securities downgraded the stock from add to reduce and revised its target price to \u003cFOUR_THOUSAND\u003e prabhudas lilladher also lowered its fy25 \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e eps estimates by \u003cFIVE_PERCENT\u003e \u003cFIVE_PERCENT\u003e \u003cFOUR_PERCENT\u003e downgrading its rating from accumulate to hold with a revised target price of \u003cFOUR_THOUSAND\u003e down from \u003cFIVE_THOUSAND\u003e similarly jefferies adjusted the dmart price target from \u003cFOUR_THOUSAND\u003e to \u003cFOUR_THOUSAND\u003e while maintaining its hold rating","timestamp":"2024-10-21T11:04:00+05:30","market_timestamp":"2024-10-21T11:04:00+05:30","off_market_hours":false}