{"url":"https://www.livemint.com/market/stock-market-news/usha-financial-services-ipo-to-open-on-oct-24-at-price-band-of-rs-160-168-firm-raises-rs-20-cr-ahead-of-public-offer-11729157836086.html","title":"Usha Financial Services IPO to open on Oct 24 at price band of  ₹160-168; firm raises  ₹20 cr ahead of public offer","description":"Upcoming IPO: Usha Financial Services IPO is set to open next week, aiming to raise  ₹98.45 crore. The subscription period is from October 24 to October 28, with shares priced between  ₹160 and  ₹168. Listing is anticipated on October 31.","content":"Upcoming IPO 2024: Non-banking finance company (NBFC) Usha Financial Services’ initial public offer (IPO) is set to hit the primary market next week. The  ₹98.45 crore public offer will open for subscription on Thursday, October 24 and close on Monday, October 28. Usha Financial Services IPO price band has been fixed in the range of  ₹160 and  ₹168 apiece.The allotment for Usha Financial Services IPO will likely be finalised on Tuesday, October 29 with the stock listing likely on Thursday, October 31 on the NSE SME platform.The minimum lot size for Usha Financial Services IPO is 800 shares. Retail investors will have to shell out at least  ₹134,400 to subscribe to one lot of the SME IPO. As for high-net-worth individuals (HNIs), the minimum investment is two lots, amounting to  ₹268,800.The company, via a release, on Thursday informed that it raised  ₹20 crore through non-convertible debentures (NCDs) via private placement in September 2024.\"This successful NCD issuance reflects the trust our investors have in our business model and growth plans. The additional funds will allow us to enhance our service offerings and keep us on track to achieve our 2025 AUM target,\" said Geeta Goswami, CEO of Usha Finacial Services. The upcoming IPO will further strengthen its position in the market and support its mission of driving sustainable economic growth, Goswami added.Usha Financial Services has raised over  ₹100 crore from around 370 investors since its inception. The latest capital infusion is a step forward towards its aim to achieve asset under management (AUM) of  ₹550 crore by March 2025. As of March 2024, its AUM stood at  ₹306 crore.Usha Financial Services is an RBI-licensed NBFC based in Delhi. It offers lending solutions to other NBFCs, corporates, MSMEs, and individuals.Narnolia Financial Services and Unistone Capital are the book-running lead managers of Usha Financial Services IPO, while Skyline Financial Services Private is the registrar.","cleaned_content":"upcoming ipo \u003cTWO_THOUSAND\u003e non banking finance company nbfc usha financial services initial public offer ipo is set to hit the primary market next week the \u003cNINE_TEN\u003e crore public offer will open for subscription on thursday october \u003cTWO_TEN\u003e and close on monday october \u003cTWO_TEN\u003e usha financial services ipo price band has been fixed in the range of \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e apiece the allotment for usha financial services ipo will likely be finalised on tuesday october \u003cTWO_TEN\u003e with the stock listing likely on thursday october \u003cTHREE_TEN\u003e on the nse sme platform the minimum lot size for usha financial services ipo is \u003cEIGHT_HUNDRED\u003e shares retail investors will have to shell out at least \u003cONE_HUNDRED_THOUSAND\u003e to subscribe to one lot of the sme ipo as for high net worth individuals hnis the minimum investment is two lots amounting to \u003cTWO_HUNDRED_THOUSAND\u003e the company via a release on thursday informed that it raised \u003cTWO_TEN\u003e crore through non convertible debentures ncds via private placement in september \u003cTWO_THOUSAND\u003e this successful ncd issuance reflects the trust our investors have in our business model and growth plans the additional funds will allow us to enhance our service offerings and keep us on track to achieve our \u003cTWO_THOUSAND\u003e aum target said geeta goswami ceo of usha finacial services the upcoming ipo will further strengthen its position in the market and support its mission of driving sustainable economic growth goswami added usha financial services has raised over \u003cONE_HUNDRED\u003e crore from around \u003cTHREE_HUNDRED\u003e investors since its inception the latest capital infusion is a step forward towards its aim to achieve asset under management aum of \u003cFIVE_HUNDRED\u003e crore by march \u003cTWO_THOUSAND\u003e as of march \u003cTWO_THOUSAND\u003e its aum stood at \u003cTHREE_HUNDRED\u003e crore usha financial services is an rbi licensed nbfc based in delhi it offers lending solutions to other nbfcs corporates msmes and individuals narnolia financial services and unistone capital are the book running lead managers of usha financial services ipo while skyline financial services private is the registrar","timestamp":"2024-10-17T15:15:00+05:30","market_timestamp":"2024-10-17T15:15:00+05:30","off_market_hours":false}