{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-wall-street-notches-more-records-and-logs-its-latest-winning-week-11729282056680.html","title":"Stock market today: Wall Street notches more records and logs its latest winning week","description":"Stock market today: Wall Street notches more records and logs its latest winning week","content":"NEW YORK — U.S. stocks rose to more records and closed out their longest weekly winning streak of the year. The S\u0026P 500 rose 0.4% Friday. The benchmark index squeaked past the all-time high it set early this week and logged is sixth straight winning week. The Dow Jones Industrial Average added 0.1% to its own record set the day before, and the Nasdaq composite gained 0.6%. Netflix helped drive the market after the streaming giant reported stronger profit for the latest quarter than analysts expected. Crude oil prices fell some more, and Treasury yields moved lower in the bond market.THIS IS A BREAKING NEWS UPDATE. ’s earlier story follows below.NEW YORK — U.S. stocks are rising toward records Friday, as the S\u0026P 500 closes out a sixth straight week of gains for its longest weekly winning streak of the year.Wall Street's main measure of health was 0.5% higher in afternoon trading and on track to squeak past its all-time high set early this week. The Dow Jones Industrial Average was up 64 points, or 0.1%, a day after setting its own record, and the Nasdaq composite was 0.7% higher, as of 2:45 p.m. Eastern time.Netflix helped drive the market with a leap of 10.8% after the streaming giant reported stronger profit for the latest quarter than analysts expected. That was despite a slowdown in subscriber growth.It helped offset a 5.5% drop for CVS Health, which said it’s likely to report a profit for the latest quarter that’s well below what analysts had been expecting. The company also said David Joyner, an executive vice president, is taking over as president and CEO for Karen Lynch.Trading overall on Wall Street remained relatively calm. Solid economic data recently has boosted hopes the U.S. economy can make a perfect escape from the worst inflation in generations, one that ends without a painful recession that many investors had seen as nearly inevitable. And with the Federal Reserve now cutting interest rates to keep the economy humming, the expectation among optimists is that stocks can rise even further.But critics are warning that stock prices look too expensive given how much faster they’ve climbed than corporate profits.David Lefkowitz, head of U.S. equities at UBS Global Wealth Management, sees both sides. But while stock prices are indeed high relative to profits, he says they're \"reasonable\" when considering the Fed is cutting interest rates and other factors.He's also expecting growth in corporate profits to continue, and he raised his forecast for where the S\u0026P 500 could be in June to 6,300 from 6,200.On Wall Street, American Express fell 2.8% despite reporting better profit for the latest quarter than analysts expected. Its revenue fell short of forecasts, and it said its revenue for the full year of 2024 will likely come in at the lower end of the forecasted range it gave at the start of the year.The credit-card company's drop was the biggest reason the Dow lagged behind other stock indexes.SLB, the giant that helps companies extract oil and natural gas, fell 4.2% after delivering a mixed earnings report. Its profit edged past analysts’ expectations, but its revenue fell short as lower crude prices pushed some international producers to be cautious with their spending. CEO Olivier Le Peuch said revenue grew in the Middle East and Asia, along with offshore North America, but declined in Latin America.Oil prices tumbled this week as worries receded that Israel will attack Iranian oil facilities as part of its retaliation for Iran’s missile attack early this month. Iran is a major producer of crude, and a strike could upend its exports to China and elsewhere. Concerns about the strength of demand from China have also hit oil prices.A barrel of Brent crude, the international standard, fell another 1.9% Friday for a 7.5% decline for the week. It’s back to $73.06 after topping $80 early last week.On the winning side of Wall Street was Intuitive Surgical, which climbed 10% after reporting stronger profit for the latest quarter than expected. The company, whose robotic-assisted systems allow for less invasive surgery, also delivered better revenue than expected.In the bond market, Treasury yields eased. The yield on the 10-year Treasury fell to 4.07% from 4.10% late Thursday.Traders are coalescing around the idea that the Federal Reserve will cut its main interest rate by a quarter of a percentage point at its next meeting in November. Expectations had been high earlier for the Fed to deliver another larger-than-usual cut of half a percentage point, but strong updates on the economy have eliminated those. The federal funds rate is currently sitting in a range of 4.75% to 5%.In stock markets abroad, Chinese indexes jumped in their latest sharp swing. Stocks rose 2.9% in Shanghai and 3.6% in Hong Kong after a report showed growth slowed during the summer for the world’s second-largest economy.The slowdown, exacerbated by a weak real-estate market, has raised expectations for big stimulus from the Chinese government and central bank, though doubts are still prevalent about how much effect they will have.Stock indexes were mixed elsewhere in Asia and Europe.Business Writers Matt Ott and Elaine Kurtenbach contributed.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"new york u s stocks rose to more records and closed out their longest weekly winning streak of the year the s p \u003cFIVE_HUNDRED\u003e rose \u003cZERO_PERCENT\u003e friday the benchmark index squeaked past the all time high it set early this week and logged is sixth straight winning week the dow jones industrial average added \u003cZERO_PERCENT\u003e to its own record set the day before and the nasdaq composite gained \u003cZERO_PERCENT\u003e netflix helped drive the market after the streaming giant reported stronger profit for the latest quarter than analysts expected crude oil prices fell some more and treasury yields moved lower in the bond market this is a breaking news update s earlier story follows below new york u s stocks are rising toward records friday as the s p \u003cFIVE_HUNDRED\u003e closes out a sixth straight week of gains for its longest weekly winning streak of the year wall streets main measure of health was \u003cZERO_PERCENT\u003e higher in afternoon trading and on track to squeak past its all time high set early this week the dow jones industrial average was up \u003cSIX_TEN\u003e points or \u003cZERO_PERCENT\u003e a day after setting its own record and the nasdaq composite was \u003cZERO_PERCENT\u003e higher as of \u003cTWO_\u003e \u003cFOUR_TEN\u003e p m eastern time netflix helped drive the market with a leap of \u003cONE_TEN_PERCENT\u003e after the streaming giant reported stronger profit for the latest quarter than analysts expected that was despite a slowdown in subscriber growth it helped offset a \u003cFIVE_PERCENT\u003e drop for cvs health which said it s likely to report a profit for the latest quarter that s well below what analysts had been expecting the company also said david joyner an executive vice president is taking over as president and ceo for karen lynch trading overall on wall street remained relatively calm solid economic data recently has boosted hopes the u s economy can make a perfect escape from the worst inflation in generations one that ends without a painful recession that many investors had seen as nearly inevitable and with the federal reserve now cutting interest rates to keep the economy humming the expectation among optimists is that stocks can rise even further but critics are warning that stock prices look too expensive given how much faster they ve climbed than corporate profits david lefkowitz head of u s equities at ubs global wealth management sees both sides but while stock prices are indeed high relative to profits he says theyre reasonable when considering the fed is cutting interest rates and other factors hes also expecting growth in corporate profits to continue and he raised his forecast for where the s p \u003cFIVE_HUNDRED\u003e could be in june to \u003cSIX_THOUSAND\u003e from \u003cSIX_THOUSAND\u003e on wall street american express fell \u003cTWO_PERCENT\u003e despite reporting better profit for the latest quarter than analysts expected its revenue fell short of forecasts and it said its revenue for the full year of \u003cTWO_THOUSAND\u003e will likely come in at the lower end of the forecasted range it gave at the start of the year the credit card companys drop was the biggest reason the dow lagged behind other stock indexes slb the giant that helps companies extract oil and natural gas fell \u003cFOUR_PERCENT\u003e after delivering a mixed earnings report its profit edged past analysts expectations but its revenue fell short as lower crude prices pushed some international producers to be cautious with their spending ceo olivier le peuch said revenue grew in the middle east and asia along with offshore north america but declined in latin america oil prices tumbled this week as worries receded that israel will attack iranian oil facilities as part of its retaliation for iran s missile attack early this month iran is a major producer of crude and a strike could upend its exports to china and elsewhere concerns about the strength of demand from china have also hit oil prices a barrel of brent crude the international standard fell another \u003cONE_PERCENT\u003e friday for a \u003cSEVEN_PERCENT\u003e decline for the week it s back to \u003cSEVEN_TEN\u003e after topping \u003cEIGHT_TEN\u003e early last week on the winning side of wall street was intuitive surgical which climbed \u003cONE_TEN_PERCENT\u003e after reporting stronger profit for the latest quarter than expected the company whose robotic assisted systems allow for less invasive surgery also delivered better revenue than expected in the bond market treasury yields eased the yield on the \u003cONE_TEN\u003e year treasury fell to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e late thursday traders are coalescing around the idea that the federal reserve will cut its main interest rate by a quarter of a percentage point at its next meeting in november expectations had been high earlier for the fed to deliver another larger than usual cut of half a percentage point but strong updates on the economy have eliminated those the federal funds rate is currently sitting in a range of \u003cFOUR_PERCENT\u003e to \u003cFIVE_PERCENT\u003e in stock markets abroad chinese indexes jumped in their latest sharp swing stocks rose \u003cTWO_PERCENT\u003e in shanghai and \u003cTHREE_PERCENT\u003e in hong kong after a report showed growth slowed during the summer for the world s second largest economy the slowdown exacerbated by a weak real estate market has raised expectations for big stimulus from the chinese government and central bank though doubts are still prevalent about how much effect they will have stock indexes were mixed elsewhere in asia and europe business writers matt ott and elaine kurtenbach contributed this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-19T01:37:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}