{"url":"https://www.livemint.com/market/stock-market-news/upcoming-ipo-swiggy-targets-12-billion-ahead-of-ipo-company-eyes-november-launch-11729398051643.html","title":"Upcoming IPO: Swiggy targets $12 billion ahead of IPO, company eyes November launch","description":"The IPO will feature a fresh issue of  ₹3,750 crore and an offer for sale (OFS) of up to 182.3 million shares, according to the company’s updated draft red herring prospectus (DRHP).","content":"Swiggy, the food and grocery delivery platform backed by Prosus and SoftBank, aims for a valuation between $11.7 billion and $12.7 billion in its upcoming IPO. According to sources cited by Moneycontrol, the company is preparing to launch its IPO in the first half of November, though the timeline may shift based on market conditions, as per the Moneycontrol report.Livemint could not independently verify this news development.“Swiggy is currently working with an IPO valuation in the range of $11.7 billion to $12.7 billion, and bids have started coming in from anchor investors,” one insider said, as quoted by Moneycontrol.The IPO will feature a fresh issue of  ₹3,750 crore and an offer for sale (OFS) of up to 182.3 million shares, according to the company’s updated draft red herring prospectus (DRHP). However, a third source indicated that the fresh issue could be increased to  ₹4,500 crore, the maximum allowed under SEBI rules. The final IPO size may exceed  ₹12,000 crore (about $1.42 billion), the source added, as quoted by Moneycontrol.Swiggy received SEBI approval on September 24 after filing its IPO documents confidentially. Under SEBI's new confidential filing route, companies can keep sensitive information private until they finalize their IPO plans.Swiggy’s competitors include Zomato-owned Blinkit, Zepto, and Tata-owned BigBasket. While Swiggy moves towards its IPO, Zomato is exploring fund-raising via the Qualified Institutional Placement (QIP) route.The IPO's book-running lead managers (BRLM) include Kotak Mahindra Capital Company, Citigroup Global Markets India Private Ltd, Jefferies India Private Ltd, and Avendus Capital Private Ltd. Link Intime India Private Ltd serves as the registrar to the issue.Key investors in Swiggy include Prosus (32%), SoftBank (8%), and Accel (6%), alongside others like Tencent, Qatar Investment Authority, and Singapore’s GIC, as per the Moneycontrol report.Investment banks, including Citi, JP Morgan, Kotak Mahindra Capital, and Jefferies, are advising on the IPO, with Cyril Amarchand Mangaldas acting as legal counsel, as per the Moneycontrol report.","cleaned_content":"swiggy the food and grocery delivery platform backed by prosus and softbank aims for a valuation between \u003cONE_TEN\u003e billion and \u003cONE_TEN\u003e billion in its upcoming ipo according to sources cited by moneycontrol the company is preparing to launch its ipo in the first half of november though the timeline may shift based on market conditions as per the moneycontrol report livemint could not independently verify this news development swiggy is currently working with an ipo valuation in the range of \u003cONE_TEN\u003e billion to \u003cONE_TEN\u003e billion and bids have started coming in from anchor investors one insider said as quoted by moneycontrol the ipo will feature a fresh issue of \u003cTHREE_THOUSAND\u003e crore and an offer for sale ofs of up to \u003cONE_HUNDRED\u003e million shares according to the company s updated draft red herring prospectus drhp however a third source indicated that the fresh issue could be increased to \u003cFOUR_THOUSAND\u003e crore the maximum allowed under sebi rules the final ipo size may exceed \u003cONE_TEN_THOUSAND\u003e crore about \u003cONE_\u003e billion the source added as quoted by moneycontrol swiggy received sebi approval on september \u003cTWO_TEN\u003e after filing its ipo documents confidentially under sebis new confidential filing route companies can keep sensitive information private until they finalize their ipo plans swiggy s competitors include zomato owned blinkit zepto and tata owned bigbasket while swiggy moves towards its ipo zomato is exploring fund raising via the qualified institutional placement qip route the ipos book running lead managers brlm include kotak mahindra capital company citigroup global markets india private ltd jefferies india private ltd and avendus capital private ltd link intime india private ltd serves as the registrar to the issue key investors in swiggy include prosus \u003cTHREE_TEN_PERCENT\u003e softbank \u003cEIGHT_PERCENT\u003e and accel \u003cSIX_PERCENT\u003e alongside others like tencent qatar investment authority and singapore s gic as per the moneycontrol report investment banks including citi jp morgan kotak mahindra capital and jefferies are advising on the ipo with cyril amarchand mangaldas acting as legal counsel as per the moneycontrol report","timestamp":"2024-10-20T10:48:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}