{"url":"https://www.livemint.com/market/stock-market-news/these-2-factors-to-act-as-suit-of-armour-against-emerging-risks-in-indian-market-says-motilal-oswal-private-wealth-11729052780386.html","title":"These 2 factors to act as ’suit of armour’ against emerging risks in Indian market, says Motilal Oswal Private Wealth","description":"Motilal Oswal Private Wealth warns that geopolitical tensions and high stock valuations are increasing market volatility in India. They recommend a staggered investment strategy focusing on large and mid-cap stocks.","content":"Brokerage house Motilal Oswal Private Wealth (MOPW) recently addressed the emerging risks in the Indian equity market, driven by global geopolitical tensions and the high valuations of domestic stocks. Rising crude oil prices, bond yields, and inflation concerns have intensified market volatility. Despite these challenges, MOPW believes that sustained domestic inflows and strong corporate fundamentals will provide resilience.\"Sustained inflows from DIIs \u0026 strong corporate fundamentals will act as a “Suit of Armour” and cushion domestic equity market valuations in the wake of geopolitical events and FII outflows. Additionally, after witnessing four years of double-digit earnings growth, it seems appropriate to moderate the expectations on earnings growth,\" said the brokerage.In response to the current valuation levels, they advised investors to follow a staggered approach by investing in large and multi-cap strategies over three months and in select mid \u0026 small-cap strategies over six to 12 months. MOPW continues with its view to have a duration bias in the fixed-income portfolio to capitalise on the likely softening of yields in the next 1-2 years.MOPW emphasised that global geopolitical tensions have increased market volatility, with crude oil prices and bond yields on the rise. This has brought inflation fears back into focus and raised concerns about a potential delay in interest rate cuts, which were expected to ease financial conditions. The firm noted that this heightened uncertainty has created headwinds for equity markets worldwide, including India.According to MOPW, Indian equities, particularly small- and mid-cap stocks, are currently trading at significant premiums compared to their long-term averages. The Nifty Midcap and Nifty Smallcap indices have shown strong performance, but their forward price-to-earnings (PE) ratios are well above historical norms. Despite these elevated valuations, MOPW highlighted that the return on equity (RoE) profile has improved across indices, suggesting stronger corporate fundamentals.While valuations remain high, MOPW pointed out that sustained inflows from Domestic Institutional Investors (DIIs) are helping to stabilise the market. DIIs have continued to invest in Indian equities, providing a counterbalance to the outflows from Foreign Institutional Investors (FIIs). MOPW described this strong domestic participation as a \"Suit of Armour\" that is protecting the market from the full impact of external shocks, such as geopolitical tensions and FII withdrawals.Additionally, MOPW highlighted that monthly SIP (Systematic Investment Plan) contributions have remained robust, with gross inflows of around  ₹23,500 crore as of August 2024. The continued allocation from EPFO (Employees’ Provident Fund Organisation) into equity through ETFs is also acting as a consistent source of capital inflow.After witnessing four consecutive years of double-digit earnings growth, MOPW noted that it is time to temper expectations. The firm projected that Nifty's earnings per share (EPS) will grow by 7 per cent to 1,072 for FY25 and by 18 per cent to 1,269 for FY26. This growth is expected to be driven primarily by the financials, telecom, and utilities sectors, while sectors like cement, metals, and oil and gas may lag.Given the current valuation levels and projected earnings growth, MOPW recommended a staggered approach to equity investments. They advised investors to focus on large- and multi-cap strategies over the next three months and to consider select mid- and small-cap strategies over a six- to twelve-month horizon. This approach is intended to allow investors to navigate market volatility while taking advantage of growth opportunities.MOPW also suggested accelerated investment deployment in the event of a meaningful market correction, which could provide more attractive entry points to investors.MOPW identified the banking sector as an area of relative value. Both private and public sector banks are currently trading at a discount to their long-term 10-year averages by 22 per cent and 29 per cent, respectively. MOPW emphasised that banks are not overheated in terms of price performance, making them an attractive investment option. Banking sector offers a margin of safety, especially as the broader market trades at premium valuations, it said.Motilal Oswal Private Wealth maintains a positive outlook on the Indian equity market, driven by factors such as corporate deleveraging, an uptick in the capital expenditure (Capex) cycle, and robust earnings growth expectations. However, they acknowledge that global uncertainties and rich domestic valuations warrant caution. As such, MOPW advised investors to adopt a balanced and resilient investment strategy, staying invested while gradually increasing their equity allocation through a staggered approach.","cleaned_content":"brokerage house motilal oswal private wealth mopw recently addressed the emerging risks in the indian equity market driven by global geopolitical tensions and the high valuations of domestic stocks rising crude oil prices bond yields and inflation concerns have intensified market volatility despite these challenges mopw believes that sustained domestic inflows and strong corporate fundamentals will provide resilience sustained inflows from diis strong corporate fundamentals will act as a suit of armour and cushion domestic equity market valuations in the wake of geopolitical events and fii outflows additionally after witnessing four years of double digit earnings growth it seems appropriate to moderate the expectations on earnings growth said the brokerage in response to the current valuation levels they advised investors to follow a staggered approach by investing in large and multi cap strategies over three months and in select mid small cap strategies over six to \u003cONE_TEN\u003e months mopw continues with its view to have a duration bias in the fixed income portfolio to capitalise on the likely softening of yields in the next \u003cONE_\u003e \u003cTWO_\u003e years mopw emphasised that global geopolitical tensions have increased market volatility with crude oil prices and bond yields on the rise this has brought inflation fears back into focus and raised concerns about a potential delay in interest rate cuts which were expected to ease financial conditions the firm noted that this heightened uncertainty has created headwinds for equity markets worldwide including india according to mopw indian equities particularly small and mid cap stocks are currently trading at significant premiums compared to their long term averages the nifty midcap and nifty smallcap indices have shown strong performance but their forward price to earnings pe ratios are well above historical norms despite these elevated valuations mopw highlighted that the return on equity roe profile has improved across indices suggesting stronger corporate fundamentals while valuations remain high mopw pointed out that sustained inflows from domestic institutional investors diis are helping to stabilise the market diis have continued to invest in indian equities providing a counterbalance to the outflows from foreign institutional investors fiis mopw described this strong domestic participation as a suit of armour that is protecting the market from the full impact of external shocks such as geopolitical tensions and fii withdrawals additionally mopw highlighted that monthly sip systematic investment plan contributions have remained robust with gross inflows of around \u003cTWO_TEN_THOUSAND\u003e crore as of august \u003cTWO_THOUSAND\u003e the continued allocation from epfo employees provident fund organisation into equity through etfs is also acting as a consistent source of capital inflow after witnessing four consecutive years of double digit earnings growth mopw noted that it is time to temper expectations the firm projected that niftys earnings per share eps will grow by \u003cSEVEN_PERCENT\u003e to \u003cONE_THOUSAND\u003e for fy25 and by \u003cONE_TEN_PERCENT\u003e to \u003cONE_THOUSAND\u003e for fy26 this growth is expected to be driven primarily by the financials telecom and utilities sectors while sectors like cement metals and oil and gas may lag given the current valuation levels and projected earnings growth mopw recommended a staggered approach to equity investments they advised investors to focus on large and multi cap strategies over the next three months and to consider select mid and small cap strategies over a six to twelve month horizon this approach is intended to allow investors to navigate market volatility while taking advantage of growth opportunities mopw also suggested accelerated investment deployment in the event of a meaningful market correction which could provide more attractive entry points to investors mopw identified the banking sector as an area of relative value both private and public sector banks are currently trading at a discount to their long term \u003cONE_TEN\u003e year averages by \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively mopw emphasised that banks are not overheated in terms of price performance making them an attractive investment option banking sector offers a margin of safety especially as the broader market trades at premium valuations it said motilal oswal private wealth maintains a positive outlook on the indian equity market driven by factors such as corporate deleveraging an uptick in the capital expenditure capex cycle and robust earnings growth expectations however they acknowledge that global uncertainties and rich domestic valuations warrant caution as such mopw advised investors to adopt a balanced and resilient investment strategy staying invested while gradually increasing their equity allocation through a staggered approach","timestamp":"2024-10-16T10:40:00+05:30","market_timestamp":"2024-10-16T10:40:00+05:30","off_market_hours":false}