{"url":"https://www.livemint.com/market/stock-market-news/ambuja-cements-to-acquire-orient-cement-for-rs-8-100-crore-11729569003032.html","title":"Ambuja’s Orient buy steps up cement war","description":"Ambuja Cements, part of Adani Group, will acquire a 46.8% stake in Orient Cement Ltd for  ₹8,100 crore. The deal includes an open offer for an additional 26% stake and aims to enhance Ambuja's cement capacity to 100 MTPA by FY25.","content":"Tuesday's acquisition of Orient Cement Ltd marks an escalation in India's cement wars as rivals Adani group and Ultratech Ltd jostle for assets, squeezing prices and margins industrywide, and edging out smaller players.In the fourth major transaction in India's cement sector in less than a year, Ambuja Cement scooped up 46.8% in Orient Cement from its promoters and some of the public shareholders, to be followed by an open offer. For Ambuja, the acquisition opens doors to Orient’s 8.5 mtpa cement capacity and another 8.1 mtpa in the pipeline. Orient also owns a mining lease for over 120 mt of limestone reserves at Chittor in Rajasthan, sufficient to build a new 6 mtpa unit in the state where Ambuja is absent.Ambuja's dash for Orient, a C.K. Birla Group company, comes in quick succession to rival and market leader UltraTech's July purchase of India Cements Ltd.The latest deal was not an easy one, since at least two major rivals had their eyes on Orient: Aditya Birla Group and the JSW Group. It wasn't cheap either, valuing Orient at almost $114/tonne of enterprise value for existing 8.5 mtpa capacity. This compares to just under $100/tonne paid by UltraTech for its acquisition of India Cements’ 14.45 mtpa capacity or about $84/tonne it paid for Kesoram’s 10.75 mtpa capacity. However, analysts at Investec led by Ritesh Shah noted that this may not be the right metric to value the transaction, as it doesn’t ACCount for the additional greenfield and brownfield expansion options available to the buyer.With the Orient deal, the two groups have between them acquired six cement companies in a little over two years, since the Adani Group entered the cement sector in September 2022 with the acquisition of Ambuja and ACC. While Ambuja has acquired Sanghi Industries, My Home Group's cement business and Penna Cement during this period, Ultratech has pocketed Kesoram Industries' cement unit and India Cements.Adani's intent is clear: Become India's top cement maker by no later than 2030, as group founder Gautam Adani has stated before. The Aditya Birla Group has no intention of giving up its leadership position either.Currently, the odds are in the favour of the latter. Adani has targeted 140 million tonnes of consolidated annual capacity by FY28. This includes Orient and Penna Cement’s additional capacity in the pipeline as well as Ambuja and ACC’s brownfield expansions. This compares to UltraTech Cement’s 200 mtpa target a year before that.Other than industry leaders Ultratech and Adani, prominent independent cement makers in India include Heidelberg Cement, Nuvoco Vistas, JSW Cement, Shree Cement, Dalmia Bharat and Ramco Cement.Meanwhile, the C.K. Birla group, which exits cement making with this deal, will reallocate resources to sectors that align with its strategy and vision, Madhavan H., chief financial officer and head of strategy said in a reply to query. “In recent years, the group has invested significantly into the healthcare business along with making organic and inorganic investments across business sectors,” he said. The valuation of the deal “signals the quality of business built at Orient Cement which includes premiumization of the category through the launch of innovative brands and market leadership in all the geographies it operates in,” he said.“The C.K. Birla Group is continuously reallocating capital to sharpen its focus on consumer centric, technology driven and service-based businesses,” Orient Cement chair C.K. Birla said. “We are confident that the Adani Group, with its strong focus on cement and infrastructure, is the ideal new owner to drive continued growth at Orient Cement for our people and stakeholders,” he said.“This timed acquisition marks another significant step forward in Ambuja Cements’ accelerated growth journey, increasing cement capacity by approximately 30 mtpa within two years of Ambuja’s acquisition,” said Karan Adani, director on the board of Ambuja Cements. “By acquiring OCL, Ambuja is poised to reach 100 mtpa cement capacity in FY25.”The battle for cement hasn’t been without its share of collateral damage, as intense competition depressed prices and squeezed margins.“In the near term, industry’s profitability will take a knock,” said Investec’s Shah. “However, in the longer term, we expect industry profitability to move up as fruits of consolidation, focus on cost curve come to play,” he said.The larger cement makers are adding capacity at a faster clip than demand growth, pushing smaller entities lacking scale and deep pockets out of the market.After the Orient Cement acquisition, no immediate acquisitions are likely, a person close to the Adani Group said.While the group may evaluate options and the balance sheet of Ambuja combined with ACC has enough cash, it is unlikely the group will take over any large cement firm immediately within this fiscal, the person said on the condition of anonymity.\"Adani had about  ₹22,000 crore cash in the books. Of that, around  ₹10,000 crore has been allocated for Penna Cement and  ₹8,000 crore will be invested for this acquisition. This amount will go in the next 3-4 months, depending upon regulatory approvals. So, the cash at the end of the fiscal may be around  ₹5,000 crore, considering the average cash flows every quarter. Only if there is an absolute value proposition Adani may consider an acquisition with part funding through credit, which can be comfortably raised. The balance sheet permits inorganic, but unless something compelling comes up, the group will focus on greenfield,\" this person added.Adani Group's rapid expansion is supported by certain advantages, the person said.\"We have an edge because we have our own power generation, both green and traditional, capacities along with our extensive ports and logistics network. Together, these factors account for 60-70% of the cost. And this can be passed on to the consumers even in the southern market through the western coast,\" the person said.Analysts at Fitch Ratings expect cement demand in India to grow 7-8% over the next 4-5 years, slightly higher than the projected GDP growth rate, given the government’s focus on infrastructure development and housing.“We expect capacity for UltraTech and other large players to grow at a rate higher than demand, with continuing industry consolidation and the large players gaining market share with the help of acquisitions,” said Akash Gupta, director at Fitch Ratings.“We expect overall capacity for the industry to grow largely in-line with demand, and do not see a material risk of overcapacity in the next 4-5 years,” he added.On Tuesday, Ambuja Cement fell 2.42% on the BSE to close at  ₹558.05 on the BSE. The company’s shares, which were trading at  ₹358.8 when Adani’s acquisition bid was first announced in May 2022, saw a high of  ₹706.85 in July this year, before moderating to current prices. Subsidiary ACC's shares have traced a similar trajectory, closing at  ₹2,246.35 on Tuesday.UltraTech shares have climbed 80% over this period, closing at  ₹10,800.9 on Tuesday. They lost 0.63% on Tuesday when the Sensex was down 1.15%. Orient Cement lost 2.5% to close at  ₹343.4.","cleaned_content":"tuesdays acquisition of orient cement ltd marks an escalation in indias cement wars as rivals adani group and ultratech ltd jostle for assets squeezing prices and margins industrywide and edging out smaller players in the fourth major transaction in indias cement sector in less than a year ambuja cement scooped up \u003cFOUR_TEN_PERCENT\u003e in orient cement from its promoters and some of the public shareholders to be followed by an open offer for ambuja the acquisition opens doors to orient s \u003cEIGHT_\u003e mtpa cement capacity and another \u003cEIGHT_\u003e mtpa in the pipeline orient also owns a mining lease for over \u003cONE_HUNDRED\u003e mt of limestone reserves at chittor in rajasthan sufficient to build a new \u003cSIX_\u003e mtpa unit in the state where ambuja is absent ambujas dash for orient a c k birla group company comes in quick succession to rival and market leader ultratechs july purchase of india cements ltd the latest deal was not an easy one since at least two major rivals had their eyes on orient aditya birla group and the jsw group it wasnt cheap either valuing orient at almost \u003cONE_HUNDRED\u003e tonne of enterprise value for existing \u003cEIGHT_\u003e mtpa capacity this compares to just under \u003cONE_HUNDRED\u003e tonne paid by ultratech for its acquisition of india cements \u003cONE_TEN\u003e mtpa capacity or about \u003cEIGHT_TEN\u003e tonne it paid for kesoram s \u003cONE_TEN\u003e mtpa capacity however analysts at investec led by ritesh shah noted that this may not be the right metric to value the transaction as it doesn t account for the additional greenfield and brownfield expansion options available to the buyer with the orient deal the two groups have between them acquired six cement companies in a little over two years since the adani group entered the cement sector in september \u003cTWO_THOUSAND\u003e with the acquisition of ambuja and acc while ambuja has acquired sanghi industries my home groups cement business and penna cement during this period ultratech has pocketed kesoram industries cement unit and india cements adanis intent is clear become indias top cement maker by no later than \u003cTWO_THOUSAND\u003e as group founder gautam adani has stated before the aditya birla group has no intention of giving up its leadership position either currently the odds are in the favour of the latter adani has targeted \u003cONE_HUNDRED\u003e million tonnes of consolidated annual capacity by fy28 this includes orient and penna cement s additional capacity in the pipeline as well as ambuja and acc s brownfield expansions this compares to ultratech cement s \u003cTWO_HUNDRED\u003e mtpa target a year before that other than industry leaders ultratech and adani prominent independent cement makers in india include heidelberg cement nuvoco vistas jsw cement shree cement dalmia bharat and ramco cement meanwhile the c k birla group which exits cement making with this deal will reallocate resources to sectors that align with its strategy and vision madhavan h chief financial officer and head of strategy said in a reply to query in recent years the group has invested significantly into the healthcare business along with making organic and inorganic investments across business sectors he said the valuation of the deal signals the quality of business built at orient cement which includes premiumization of the category through the launch of innovative brands and market leadership in all the geographies it operates in he said the c k birla group is continuously reallocating capital to sharpen its focus on consumer centric technology driven and service based businesses orient cement chair c k birla said we are confident that the adani group with its strong focus on cement and infrastructure is the ideal new owner to drive continued growth at orient cement for our people and stakeholders he said this timed acquisition marks another significant step forward in ambuja cements accelerated growth journey increasing cement capacity by approximately \u003cTHREE_TEN\u003e mtpa within two years of ambuja s acquisition said karan adani director on the board of ambuja cements by acquiring ocl ambuja is poised to reach \u003cONE_HUNDRED\u003e mtpa cement capacity in fy25 the battle for cement hasn t been without its share of collateral damage as intense competition depressed prices and squeezed margins in the near term industry s profitability will take a knock said investec s shah however in the longer term we expect industry profitability to move up as fruits of consolidation focus on cost curve come to play he said the larger cement makers are adding capacity at a faster clip than demand growth pushing smaller entities lacking scale and deep pockets out of the market after the orient cement acquisition no immediate acquisitions are likely a person close to the adani group said while the group may evaluate options and the balance sheet of ambuja combined with acc has enough cash it is unlikely the group will take over any large cement firm immediately within this fiscal the person said on the condition of anonymity adani had about \u003cTWO_TEN_THOUSAND\u003e crore cash in the books of that around \u003cONE_TEN_THOUSAND\u003e crore has been allocated for penna cement and \u003cEIGHT_THOUSAND\u003e crore will be invested for this acquisition this amount will go in the next \u003cTHREE_\u003e \u003cFOUR_\u003e months depending upon regulatory approvals so the cash at the end of the fiscal may be around \u003cFIVE_THOUSAND\u003e crore considering the average cash flows every quarter only if there is an absolute value proposition adani may consider an acquisition with part funding through credit which can be comfortably raised the balance sheet permits inorganic but unless something compelling comes up the group will focus on greenfield this person added adani groups rapid expansion is supported by certain advantages the person said we have an edge because we have our own power generation both green and traditional capacities along with our extensive ports and logistics network together these factors account for \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e of the cost and this can be passed on to the consumers even in the southern market through the western coast the person said analysts at fitch ratings expect cement demand in india to grow \u003cSEVEN_\u003e \u003cEIGHT_PERCENT\u003e over the next \u003cFOUR_\u003e \u003cFIVE_\u003e years slightly higher than the projected gdp growth rate given the government s focus on infrastructure development and housing we expect capacity for ultratech and other large players to grow at a rate higher than demand with continuing industry consolidation and the large players gaining market share with the help of acquisitions said akash gupta director at fitch ratings we expect overall capacity for the industry to grow largely in line with demand and do not see a material risk of overcapacity in the next \u003cFOUR_\u003e \u003cFIVE_\u003e years he added on tuesday ambuja cement fell \u003cTWO_PERCENT\u003e on the bse to close at \u003cFIVE_HUNDRED\u003e on the bse the company s shares which were trading at \u003cTHREE_HUNDRED\u003e when adani s acquisition bid was first announced in may \u003cTWO_THOUSAND\u003e saw a high of \u003cSEVEN_HUNDRED\u003e in july this year before moderating to current prices subsidiary accs shares have traced a similar trajectory closing at \u003cTWO_THOUSAND\u003e on tuesday ultratech shares have climbed \u003cEIGHT_TEN_PERCENT\u003e over this period closing at \u003cONE_TEN_THOUSAND\u003e on tuesday they lost \u003cZERO_PERCENT\u003e on tuesday when the sensex was down \u003cONE_PERCENT\u003e orient cement lost \u003cTWO_PERCENT\u003e to close at \u003cTHREE_HUNDRED\u003e","timestamp":"2024-10-22T09:20:00+05:30","market_timestamp":"2024-10-22T09:20:00+05:30","off_market_hours":false}