{"url":"https://www.livemint.com/market/stock-market-news/top-stocks-to-buy-diwali-2024-prabhudas-lilladhers-top-picks-abb-india-bel-bhel-coal-india-kpit-tech-tata-motors-11729495613525.html","title":"Stocks to buy before Diwali 2024: Prabhudas Lilladher recommends THESE 11 top picks. Check full list","description":"Diwali Stock Picks: Prabhudas Lilladher recommended ABB India, Bharat Electronics, BHEL, Coal India, Exide Industries, Tata Motors, and KPIT Technologies as top picks for investors ahead of Diwali 2024.","content":"2024 Diwali stocks: As Diwali 2024 approaches, investors are eyeing opportunities for short-term gains. Prabhudas Lilladher, a leading brokerage firm, has released a list of stocks that are signalling strong gains on technical charts. These stocks are positioned for potential upside based on recent market trends and technical analysis.ABB India has been consolidating near the 50-EMA (Exponential Moving Average) zone at  ₹7,800, showing signs of strength with a pullback from  ₹7,750. A confirmed breakout above  ₹8,300 suggests renewed upward momentum. The rising RSI (Relative Strength Index) supports the bullish outlook, indicating further gains toward  ₹12,300, as per the brokerage firm.CMP:  ₹8,750Target:  ₹12,300Stop Loss:  ₹7,350BEL has retraced from its peak of  ₹340 and found support near  ₹265, forming a double-bottom pattern. A decisive move past the 50-EMA at  ₹290 could strengthen the uptrend, with the RSI well-positioned to support a rally towards  ₹426, as per Prabhudas Lilladher. The brokerage advised to maintain a stop loss at  ₹240.CMP:  ₹284Target:  ₹426Stop Loss:  ₹240The stock, after falling from its peak of  ₹335, has been trading in the  ₹260-270 range, near the key 200-period moving average. Recently, it corrected from  ₹290 to find support around  ₹250-254, showing signs of a potential rebound. A positive trend in RSI suggests the stock is on track for a reversal. Analysts recommend buying with a target of  ₹390 and a stop loss of  ₹215.CMP:  ₹254Target:  ₹390Stop Loss:  ₹215Coal India has been consolidating around  ₹485 and is nearing a breakout above the 50-EMA and 100-period MA at  ₹501. With RSI signalling a trend reversal, the brokerage expects the stock to reach  ₹690. Investors are advised to place a stop loss at  ₹415.CMP:  ₹490Target:  ₹690Stop Loss:  ₹415Exide has formed a bullish pattern, breaking above the 50-EMA with strong momentum. The RSI shows positive signals, indicating further gains. Analysts expect the stock to reach  ₹740 and suggest maintaining a stop loss at  ₹425.CMP:  ₹497Target:  ₹740Stop Loss:  ₹425The stock has steadily declined from its peak of  ₹506 but recently found support at  ₹308, signalling a potential rebound. The RSI is recovering from oversold levels, indicating strength and suggesting significant upside potential from the current price. The brokerage has a target price of  ₹544 on GMDC with a stop loss of  ₹305.CMP:  ₹358Target:  ₹544Stop Loss:  ₹305GRSE has stabilised near  ₹1,700 after falling from  ₹2,833. A positive candle formation with volume growth suggests further recovery. Analysts expect the stock to rally to  ₹2,770, with a stop loss at  ₹1,420.CMP:  ₹1,750Target:  ₹2,770Stop Loss:  ₹1,420HSCL has maintained strength above the 50-EMA, showing signs of a rebound. The RSI is positioned for a rally after correcting from overbought levels. The brokerage expects it to hit a target price of  ₹900. It recommends a stop loss of  ₹530.CMP:  ₹619Target:  ₹900Stop Loss:  ₹530KPIT is consolidating near  ₹1,900 levels, and a breakout will confirm bullish momentum. The RSI points to a potential rally, with analysts projecting a target price of  ₹2,500. A stop loss at  ₹1,500 is suggested to control risks.CMP:  ₹1,785Target:  ₹2,500Stop Loss:  ₹1,500NTPC has broken out of a descending channel pattern around  ₹417, with a strong upward bias. The RSI indicates early signs of recovery, supporting a target of  ₹590. A stop loss at  ₹360 is advised by the brokerage.CMP:  ₹423Target:  ₹590Stop Loss:  ₹360Tata Motors has corrected from  ₹1,142 and found support at  ₹915. The RSI is approaching the oversold zone and has been gradually rising, improving the overall bias. Analysts suggest buying with a target of  ₹1,225 and a stop loss of  ₹770 as risk-reward remains favourable and charts look attractive.CMP:  ₹907Target:  ₹1,225Stop Loss:  ₹770","cleaned_content":"2024 diwali stocks as diwali \u003cTWO_THOUSAND\u003e approaches investors are eyeing opportunities for short term gains prabhudas lilladher a leading brokerage firm has released a list of stocks that are signalling strong gains on technical charts these stocks are positioned for potential upside based on recent market trends and technical analysis abb india has been consolidating near the \u003cFIVE_TEN\u003e ema exponential moving average zone at \u003cSEVEN_THOUSAND\u003e showing signs of strength with a pullback from \u003cSEVEN_THOUSAND\u003e a confirmed breakout above \u003cEIGHT_THOUSAND\u003e suggests renewed upward momentum the rising rsi relative strength index supports the bullish outlook indicating further gains toward \u003cONE_TEN_THOUSAND\u003e as per the brokerage firm cmp \u003cEIGHT_THOUSAND\u003e target \u003cONE_TEN_THOUSAND\u003e stop loss \u003cSEVEN_THOUSAND\u003e bel has retraced from its peak of \u003cTHREE_HUNDRED\u003e and found support near \u003cTWO_HUNDRED\u003e forming a double bottom pattern a decisive move past the \u003cFIVE_TEN\u003e ema at \u003cTWO_HUNDRED\u003e could strengthen the uptrend with the rsi well positioned to support a rally towards \u003cFOUR_HUNDRED\u003e as per prabhudas lilladher the brokerage advised to maintain a stop loss at \u003cTWO_HUNDRED\u003e cmp \u003cTWO_HUNDRED\u003e target \u003cFOUR_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e the stock after falling from its peak of \u003cTHREE_HUNDRED\u003e has been trading in the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e range near the key \u003cTWO_HUNDRED\u003e period moving average recently it corrected from \u003cTWO_HUNDRED\u003e to find support around \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e showing signs of a potential rebound a positive trend in rsi suggests the stock is on track for a reversal analysts recommend buying with a target of \u003cTHREE_HUNDRED\u003e and a stop loss of \u003cTWO_HUNDRED\u003e cmp \u003cTWO_HUNDRED\u003e target \u003cTHREE_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e coal india has been consolidating around \u003cFOUR_HUNDRED\u003e and is nearing a breakout above the \u003cFIVE_TEN\u003e ema and \u003cONE_HUNDRED\u003e period ma at \u003cFIVE_HUNDRED\u003e with rsi signalling a trend reversal the brokerage expects the stock to reach \u003cSIX_HUNDRED\u003e investors are advised to place a stop loss at \u003cFOUR_HUNDRED\u003e cmp \u003cFOUR_HUNDRED\u003e target \u003cSIX_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e exide has formed a bullish pattern breaking above the \u003cFIVE_TEN\u003e ema with strong momentum the rsi shows positive signals indicating further gains analysts expect the stock to reach \u003cSEVEN_HUNDRED\u003e and suggest maintaining a stop loss at \u003cFOUR_HUNDRED\u003e cmp \u003cFOUR_HUNDRED\u003e target \u003cSEVEN_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e the stock has steadily declined from its peak of \u003cFIVE_HUNDRED\u003e but recently found support at \u003cTHREE_HUNDRED\u003e signalling a potential rebound the rsi is recovering from oversold levels indicating strength and suggesting significant upside potential from the current price the brokerage has a target price of \u003cFIVE_HUNDRED\u003e on gmdc with a stop loss of \u003cTHREE_HUNDRED\u003e cmp \u003cTHREE_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e grse has stabilised near \u003cONE_THOUSAND\u003e after falling from \u003cTWO_THOUSAND\u003e a positive candle formation with volume growth suggests further recovery analysts expect the stock to rally to \u003cTWO_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e cmp \u003cONE_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e hscl has maintained strength above the \u003cFIVE_TEN\u003e ema showing signs of a rebound the rsi is positioned for a rally after correcting from overbought levels the brokerage expects it to hit a target price of \u003cNINE_HUNDRED\u003e it recommends a stop loss of \u003cFIVE_HUNDRED\u003e cmp \u003cSIX_HUNDRED\u003e target \u003cNINE_HUNDRED\u003e stop loss \u003cFIVE_HUNDRED\u003e kpit is consolidating near \u003cONE_THOUSAND\u003e levels and a breakout will confirm bullish momentum the rsi points to a potential rally with analysts projecting a target price of \u003cTWO_THOUSAND\u003e a stop loss at \u003cONE_THOUSAND\u003e is suggested to control risks cmp \u003cONE_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e ntpc has broken out of a descending channel pattern around \u003cFOUR_HUNDRED\u003e with a strong upward bias the rsi indicates early signs of recovery supporting a target of \u003cFIVE_HUNDRED\u003e a stop loss at \u003cTHREE_HUNDRED\u003e is advised by the brokerage cmp \u003cFOUR_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e tata motors has corrected from \u003cONE_THOUSAND\u003e and found support at \u003cNINE_HUNDRED\u003e the rsi is approaching the oversold zone and has been gradually rising improving the overall bias analysts suggest buying with a target of \u003cONE_THOUSAND\u003e and a stop loss of \u003cSEVEN_HUNDRED\u003e as risk reward remains favourable and charts look attractive cmp \u003cNINE_HUNDRED\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cSEVEN_HUNDRED\u003e","timestamp":"2024-10-21T14:47:00+05:30","market_timestamp":"2024-10-21T14:47:00+05:30","off_market_hours":false}