{"url":"https://www.livemint.com/market/stock-market-news/city-union-bank-shares-rise-13-on-strong-performance-in-q2-brokerages-maintain-bullish-stance-11729570593921.html","title":"City Union Bank shares rise 13% on strong performance in Q2; brokerages maintain bullish stance","description":"City Union Bank's shares rose 13.21% to  ₹165.70 after strong Q2FY25 results, with improved asset quality and net interest income. Gross NPAs fell to 3.54%, and profit after tax increased to  ₹285 crore.","content":"Shares of City Union Bank surged 13.21% to  ₹170.50 apiece in early morning trade on Monday, October 22 following the release of the bank’s strong September quarter results. This prompted brokerages to maintain a positive outlook on the stock.The bank demonstrated improvement across key metrics, including asset quality, slippages, profitability and net interest income (NII), boosting investor sentiment. In a period when concerns around asset quality are prevalent, City Union Bank managed to reduce its gross non-performing assets (GNPA) to 3.54% in Q2FY25, down from 4.66% in the same quarter last year. Net NPAs also improved to 1.62% from 2.34% in Q2 FY24.The Net Interest Margin (NIM) for Q2 FY25 rose to 3.67%, up from 3.54% in Q1 FY25. The bank’s return on assets (RoA) stood at 1.59% for Q2FY25, and at 1.55% for the half-year ended FY25, aligning with the bank’s long-term average.Return on equity (RoE) reached 12.93% in Q2FY25 and 12.74% for the first half of FY25. The slippage ratio declined to 1.47% from 1.57% in Q2FY24.It posted a net interest income of  ₹582 crore for Q2 FY25 and  ₹1,128 crore for H1 FY25, compared to  ₹538 crore and  ₹1,061 crore, respectively, in the same period last year, reflecting NII growth of 8% for Q2 and 6% for H1.Gross profit for Q2FY25 rose to  ₹428 crore, an 11% increase from  ₹387 crore in Q2FY24. Operating profit for the first half of FY25 was  ₹802 crore, nearly flat compared to  ₹801 crore in the same period last year. However, the bank achieved positive operating profit growth for the first time in six quarters, driven by improved business growth.Provisions for Q2FY25 stood at  ₹252 crore, down from  ₹293 crore in the same quarter last year.Profit after tax increased marginally to  ₹285 crore in Q2 FY25, compared to  ₹281 crore in Q2 FY24. For H1FY25, PAT grew 8% to  ₹550 crore, up from  ₹508 crore in H1FY24.Following the bank's Q2 numbers, Macquarie retained its \"Outperform\" rating on City Union Bank with a target price of  ₹185 per share, noting that the Q2 profit was in line with expectations and indicated a return of growth momentum. It expects the return on assets (RoA) to remain stable at 1.5-1.6% despite higher credit costs, suggesting a favourable risk/reward profile given the bank's potential growth and RoA trajectory.Likewise, Investec has also maintained its 'buy' rating with a target price of  ₹200 per share, highlighting a better-than-expected Q2 performance across key metrics such as growth, profitability, and asset quality. This marks the first quarter in which all three metrics have shown improvement, it noted.","cleaned_content":"shares of city union bank surged \u003cONE_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e apiece in early morning trade on monday october \u003cTWO_TEN\u003e following the release of the bank s strong september quarter results this prompted brokerages to maintain a positive outlook on the stock the bank demonstrated improvement across key metrics including asset quality slippages profitability and net interest income nii boosting investor sentiment in a period when concerns around asset quality are prevalent city union bank managed to reduce its gross non performing assets gnpa to \u003cTHREE_PERCENT\u003e in q2fy25 down from \u003cFOUR_PERCENT\u003e in the same quarter last year net npas also improved to \u003cONE_PERCENT\u003e from \u003cTWO_PERCENT\u003e in q2 fy24 the net interest margin nim for q2 fy25 rose to \u003cTHREE_PERCENT\u003e up from \u003cTHREE_PERCENT\u003e in q1 fy25 the bank s return on assets roa stood at \u003cONE_PERCENT\u003e for q2fy25 and at \u003cONE_PERCENT\u003e for the half year ended fy25 aligning with the bank s long term average return on equity roe reached \u003cONE_TEN_PERCENT\u003e in q2fy25 and \u003cONE_TEN_PERCENT\u003e for the first half of fy25 the slippage ratio declined to \u003cONE_PERCENT\u003e from \u003cONE_PERCENT\u003e in q2fy24 it posted a net interest income of \u003cFIVE_HUNDRED\u003e crore for q2 fy25 and \u003cONE_THOUSAND\u003e crore for h1 fy25 compared to \u003cFIVE_HUNDRED\u003e crore and \u003cONE_THOUSAND\u003e crore respectively in the same period last year reflecting nii growth of \u003cEIGHT_PERCENT\u003e for q2 and \u003cSIX_PERCENT\u003e for h1 gross profit for q2fy25 rose to \u003cFOUR_HUNDRED\u003e crore an \u003cONE_TEN_PERCENT\u003e increase from \u003cTHREE_HUNDRED\u003e crore in q2fy24 operating profit for the first half of fy25 was \u003cEIGHT_HUNDRED\u003e crore nearly flat compared to \u003cEIGHT_HUNDRED\u003e crore in the same period last year however the bank achieved positive operating profit growth for the first time in six quarters driven by improved business growth provisions for q2fy25 stood at \u003cTWO_HUNDRED\u003e crore down from \u003cTWO_HUNDRED\u003e crore in the same quarter last year profit after tax increased marginally to \u003cTWO_HUNDRED\u003e crore in q2 fy25 compared to \u003cTWO_HUNDRED\u003e crore in q2 fy24 for h1fy25 pat grew \u003cEIGHT_PERCENT\u003e to \u003cFIVE_HUNDRED\u003e crore up from \u003cFIVE_HUNDRED\u003e crore in h1fy24 following the banks q2 numbers macquarie retained its outperform rating on city union bank with a target price of \u003cONE_HUNDRED\u003e per share noting that the q2 profit was in line with expectations and indicated a return of growth momentum it expects the return on assets roa to remain stable at \u003cONE_\u003e \u003cONE_PERCENT\u003e despite higher credit costs suggesting a favourable risk reward profile given the banks potential growth and roa trajectory likewise investec has also maintained its buy rating with a target price of \u003cTWO_HUNDRED\u003e per share highlighting a better than expected q2 performance across key metrics such as growth profitability and asset quality this marks the first quarter in which all three metrics have shown improvement it noted","timestamp":"2024-10-22T10:09:00+05:30","market_timestamp":"2024-10-22T10:09:00+05:30","off_market_hours":false}