{"url":"https://www.livemint.com/market/stock-market-news/mazagon-dock-shipbuilders-stock-surges-over-8-5-as-baord-to-consider-stock-split-11729233616706.html","title":"Mazagon Dock Shipbuilders stock surges over 8.5% as board to consider stock split","description":"Mazagon Dock Shipbuilders' shares rose nearly 8.7% to  ₹4,608 after announcing a potential stock split and interim dividend. The board will meet on October 22, 2024, to discuss these proposals. The shares have zoomed over 17% in the last 9 trading sessions.","content":"Shares of Mazagon Dock Shipbuilders, a leading defence public-sector shipyard under the Ministry of Defense (MoD) in India, surged nearly 8.7% to  ₹4,608 apiece on Friday, October 18 after the company said its board will consider a stock split and interim dividend for the financial year 2024-25 at its upcoming board meeting.The Board of Directors is scheduled to meet on Tuesday, October 22, 2024, to discuss and potentially approve these proposals.'A meeting of the Board of Directors of Mazagon Dock Shipbuilders Limited is scheduled on Tuesday, 22 October 2024, inter alia, to consider a) Declaration of Interim Dividend for the financial year 2024-25. b) Sub-division/split of equity shares of the company pursuant to the provisions of Section 61(1)(d) of the Companies Act, 2013,\" the company said in an exchange filing.Furthermore, the company has set Wednesday, October 30, 2024, as the record date for the potential payment of an interim dividend for the financial year 2024-25, subject to board approval.The company's shares have been making headlines recently due to several positive developments. On October 10, it secured an order valued at  ₹1.22 billion from Maharashtra State Power Generation (MAHAGENCO). In late September, the company announced the commencement of production for its first multipurpose cargo vessel (MPV) for Navi Merchants in Denmark.Furthermore, during the same month, the company won a contract worth  ₹14.86 billion from Oil and Natural Gas (ONGC) for a subsea pipeline replacement. Earlier in September, India’s defence ministry approved military equipment purchases totalling  ₹1.45 trillion ($17.27 billion).The company's shares have experienced a recovery recently, gaining 17.14% over the last nine sessions. However, this rebound has not been sufficient to bring the stock close to its recent peak.After a sustained rally from March 2023 to July 2024, the stock faced profit booking in the following months and is currently trading 21.6% below its all-time high of  ₹5,859 per share, reached in July.Mazagon Dock is a prominent public-sector defence undertaking under the Ministry of Defence (MoD), specialising in shipbuilding, submarine construction, and various engineering products. Since its establishment in 1934, the company has delivered 802 vessels, including 28 warships and 7 submarines, as highlighted in the Q1 FY25 earnings report.In June, the company was awarded Navratna status by the Department of Public Enterprises (DPE).","cleaned_content":"shares of mazagon dock shipbuilders a leading defence public sector shipyard under the ministry of defense mod in india surged nearly \u003cEIGHT_PERCENT\u003e to \u003cFOUR_THOUSAND\u003e apiece on friday october \u003cONE_TEN\u003e after the company said its board will consider a stock split and interim dividend for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e at its upcoming board meeting the board of directors is scheduled to meet on tuesday october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to discuss and potentially approve these proposals a meeting of the board of directors of mazagon dock shipbuilders limited is scheduled on tuesday \u003cTWO_TEN\u003e october \u003cTWO_THOUSAND\u003e inter alia to consider a declaration of interim dividend for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e b sub division split of equity shares of the company pursuant to the provisions of section \u003cSIX_TEN\u003e \u003cONE_\u003e d of the companies act \u003cTWO_THOUSAND\u003e the company said in an exchange filing furthermore the company has set wednesday october \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date for the potential payment of an interim dividend for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e subject to board approval the companys shares have been making headlines recently due to several positive developments on october \u003cONE_TEN\u003e it secured an order valued at \u003cONE_\u003e billion from maharashtra state power generation mahagenco in late september the company announced the commencement of production for its first multipurpose cargo vessel mpv for navi merchants in denmark furthermore during the same month the company won a contract worth \u003cONE_TEN\u003e billion from oil and natural gas ongc for a subsea pipeline replacement earlier in september india s defence ministry approved military equipment purchases totalling \u003cONE_\u003e trillion \u003cONE_TEN\u003e billion the companys shares have experienced a recovery recently gaining \u003cONE_TEN_PERCENT\u003e over the last nine sessions however this rebound has not been sufficient to bring the stock close to its recent peak after a sustained rally from march \u003cTWO_THOUSAND\u003e to july \u003cTWO_THOUSAND\u003e the stock faced profit booking in the following months and is currently trading \u003cTWO_TEN_PERCENT\u003e below its all time high of \u003cFIVE_THOUSAND\u003e per share reached in july mazagon dock is a prominent public sector defence undertaking under the ministry of defence mod specialising in shipbuilding submarine construction and various engineering products since its establishment in \u003cONE_THOUSAND\u003e the company has delivered \u003cEIGHT_HUNDRED\u003e vessels including \u003cTWO_TEN\u003e warships and \u003cSEVEN_\u003e submarines as highlighted in the q1 fy25 earnings report in june the company was awarded navratna status by the department of public enterprises dpe","timestamp":"2024-10-18T23:46:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}