{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-16-11729042694970.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 16","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a weak start for the Indian benchmark index. The Gift Nifty was trading around 25,045 level, a discount of nearly 80 points from the Nifty futures’ previous close.","content":"Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Wednesday tracking losses in global markets.The trends on Gift Nifty also indicate a weak start for the Indian benchmark index. The Gift Nifty was trading around 25,045 level, a discount of nearly 80 points from the Nifty futures’ previous close.On Tuesday, the domestic equity market benchmark indices ended lower dragged by losses in index heavyweights.The Sensex declined 152.93 points to close at 81,820.12, while the Nifty 50 settled 70.60 points, or 0.28%, lower at 25,057.35.Nifty 50 formed a reasonable negative candle on the daily chart with minor upper and lower shadow.“Technically, this market action is indicating presence of crucial resistance around 25,200 and one may expect further range movement in the short term. Minor ascending triangle type pattern has been formed in Nifty 50 as per intraday timeframe chart (rising highs and horizontal hurdle in 60 min chart). This is positive development and such a pattern more often results in an upside breakout,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to Shetti, the short-term trend of Nifty 50 continues to be choppy and the market is now placed within a broader range of 25,200 - 24,900 levels.A decisive move above 25,200 levels could open the next upside of around 25,500 - 25,600 levels in the near term, he said.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty Open Interest (OI) data shows the highest OI on the call side at the 25,100 and 25,200 strike prices, indicating strong resistance levels. On the put side, OI is concentrated at the 25,000 and 24,900 strike prices, highlighting these as key support levels, said Hardik Matalia, Derivative Analyst at Choice Broking.Nifty 50 slipped into weakness with range bound action on October 15 and closed the day lower by 70 points.“The short term structure remains positive, and on the higher side, the Nifty 50 index can gradually move towards 25,250 / 25,340 levels whereas dip towards 25,020 / 24,940 can be used to initiate fresh long positions. Only a close below 24,700 will negate a positive view as below that index can see sharp correction,” said Aditya Agarwal, Head of Derivatives \u0026 Technical Analysis at Sanctum Wealth.Dr. Praveen Dwarakanath, Vice President of Hedged.in noted that the momentum indicators are indicating a move on the upside although Tuesday’s was a sell-off.“The ADX DI- line is dropping and the ADX DI+ line is sloping upside, indicating the upside momentum might continue. Options writer's data showed increased call writing for weekly and monthly expiry, however, it can be due to today's fall. The short-covering of these calls can result in an immediate rally in coming trading sessions,” said Dwarakanath.VLA Ambala, Co-Founder of Stock Market Today suggests market participants aiming for short-term investment or trading to consider a “sell on rise” strategy from key resistance points.“The range of 25,300 to 24,900 is important for Nifty 50, and the next 3-5% move will depend on whether the index stabilizes higher or lower than it. Amid these, Nifty can expect support near 25,000 and 24,900, with resistance around 25,190 and 25,285,” Ambala said.Bank Nifty index outperformed the benchmarks on Tuesday and ended the session 89.10 points, or 0.17%, higher at 51,906.00.“The momentum indicators show bullishness to continue up to Bank Nifty’s resistance level at 52,500 level. The ADX DI- line is dropping and the ADX DI+ line is sloping upside, indicating the upside momentum might continue,” said Dr. Praveen Dwarakanath.According to him, options writer's data showed increased writing in calls and puts at 52,000 levels, indicating a pause at these levels. Also, increased call writing at 52,500 and short covering at 51,500 levels indicate bullishness in the index.Aditya Agarwal is of the view that the Bank Nifty index will find immediate resistance around 52,000 levels and if trades above that, then can see another round of short covering that can take it towards 52,460 / 52,800 levels.A dip towards 51,680 / 51,440 can be used as a buying opportunity in the Bank Nifty index, he added.","cleaned_content":"indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open lower on wednesday tracking losses in global markets the trends on gift nifty also indicate a weak start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cEIGHT_TEN\u003e points from the nifty futures previous close on tuesday the domestic equity market benchmark indices ended lower dragged by losses in index heavyweights the sensex declined \u003cONE_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a reasonable negative candle on the daily chart with minor upper and lower shadow technically this market action is indicating presence of crucial resistance around \u003cTWO_TEN_THOUSAND\u003e and one may expect further range movement in the short term minor ascending triangle type pattern has been formed in nifty \u003cFIVE_TEN\u003e as per intraday timeframe chart rising highs and horizontal hurdle in \u003cSIX_TEN\u003e min chart this is positive development and such a pattern more often results in an upside breakout said nagaraj shetti senior technical research analyst at hdfc securities according to shetti the short term trend of nifty \u003cFIVE_TEN\u003e continues to be choppy and the market is now placed within a broader range of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels a decisive move above \u003cTWO_TEN_THOUSAND\u003e levels could open the next upside of around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in the near term he said here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty open interest oi data shows the highest oi on the call side at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices indicating strong resistance levels on the put side oi is concentrated at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices highlighting these as key support levels said hardik matalia derivative analyst at choice broking nifty \u003cFIVE_TEN\u003e slipped into weakness with range bound action on october \u003cONE_TEN\u003e and closed the day lower by \u003cSEVEN_TEN\u003e points the short term structure remains positive and on the higher side the nifty \u003cFIVE_TEN\u003e index can gradually move towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels whereas dip towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e can be used to initiate fresh long positions only a close below \u003cTWO_TEN_THOUSAND\u003e will negate a positive view as below that index can see sharp correction said aditya agarwal head of derivatives technical analysis at sanctum wealth dr praveen dwarakanath vice president of hedged in noted that the momentum indicators are indicating a move on the upside although tuesday s was a sell off the adx di line is dropping and the adx di line is sloping upside indicating the upside momentum might continue options writers data showed increased call writing for weekly and monthly expiry however it can be due to todays fall the short covering of these calls can result in an immediate rally in coming trading sessions said dwarakanath vla ambala co founder of stock market today suggests market participants aiming for short term investment or trading to consider a sell on rise strategy from key resistance points the range of \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e is important for nifty \u003cFIVE_TEN\u003e and the next \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e move will depend on whether the index stabilizes higher or lower than it amid these nifty can expect support near \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with resistance around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e ambala said bank nifty index outperformed the benchmarks on tuesday and ended the session \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e the momentum indicators show bullishness to continue up to bank nifty s resistance level at \u003cFIVE_TEN_THOUSAND\u003e level the adx di line is dropping and the adx di line is sloping upside indicating the upside momentum might continue said dr praveen dwarakanath according to him options writers data showed increased writing in calls and puts at \u003cFIVE_TEN_THOUSAND\u003e levels indicating a pause at these levels also increased call writing at \u003cFIVE_TEN_THOUSAND\u003e and short covering at \u003cFIVE_TEN_THOUSAND\u003e levels indicate bullishness in the index aditya agarwal is of the view that the bank nifty index will find immediate resistance around \u003cFIVE_TEN_THOUSAND\u003e levels and if trades above that then can see another round of short covering that can take it towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels a dip towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e can be used as a buying opportunity in the bank nifty index he added","timestamp":"2024-10-16T07:28:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}