{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-rajesh-palviya-of-axis-securities-suggests-these-three-stocks-to-buy-hold-and-accumulate-today-11729224235621.html","title":"Shares to buy or sell: Rajesh Palviya of Axis Securities suggests these three stocks to buy, hold and accumulate today","description":"Shares to buy or sell: Rajesh Palviya has recommended to buy, hold, and accumulate HEG Ltd, Genus Power Infrastructures Ltd, and Orient Cement Ltd.","content":"Stock Market News: Friday's session saw significant selling on the domestic benchmark indices, Sensex and Nifty 50, with foreign investors recording high levels of selling in October.The Nifty 50 index saw an initial drop of 0.34% or 84 points, opening at 24,664.95 points. In comparison, the Sensex index opened at 80,749.26, marking a decrease of 257 points or 0.32%.Experts suggest that Indian stocks are currently experiencing continuous pressure from foreign institutional investors (FIIs), although there is hope for a better outlook in the coming weeks due to the anticipated strong recovery.Dr. V K Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, highlighted that the current patterns indicate a continuation of FII selling and DII buying. While a rebound may occur in the next two or three days, it is unlikely to be sustained due to the waning sentiments. It is recommended for investors to monitor the situation and wait for the market to stabilize, gradually accumulating largecaps, such as prominent private sector banks affected by FII selling.Over the past three weeks, the benchmark index has experienced significant profit booking, closing around 2470 levels. Currently, the benchmark index is hovering around a \"multiple support zone\" of 24,750 levels from the past couple of months. Any breach of this level on a closing basis may lead to further weakness towards 24,300-24,000 levels in the upcoming weeks. Nifty 50 is currently trading below its 20 and 50-day SMA, confirming a bearish bias. Conversely, any relief rally towards 25,000-25,300 levels could serve as an exit opportunity for short-term traders.Based on the current closing price, the stock is poised for breaking through a long-standing resistance zone around the 2650 levels. A decisive breakout above this level could lead to significant upward momentum. In the short and medium term, the stock is trending upwards, forming higher tops and bottoms, indicating bullish sentiment. The stock is comfortably trading above its 20, 50, 100, and 200-day simple moving averages (SMA), which are also trending upwards along with the stock price, confirming the bullish trend. Additionally, the daily, weekly, and monthly Relative Strength Index (RSI) indicators are in positive terrain, reinforcing strength across all time frames.Investors should buy, hold and accumulate this stock with an expected upside of  ₹2,730-2,900 with downside support zone of  ₹2,470-2,390 levels.On the weekly chart, the stock is trending higher in an \"up-sloping channel,\" forming a series of higher tops and bottoms, indicating bullish sentiments. Recently, the stock has reclaimed the 100-day SMA support at 367 levels and bounced back sharply, indicating a positive bias. The daily and weekly strength indicator RSI is in positive terrain, justifying rising strength. The significant increase in trading volumes signifies increased participation.Investors should buy, hold and accumulate this stock with an expected upside of  ₹465-485 with downside support zone of  ₹405-390 levels.On the weekly chart, the stock is trending higher in an \"up-sloping channel,\" forming a series of higher highs and higher lows, indicating bullish sentiments. Recently, the stock has reclaimed the 100-day SMA support at 367 levels and bounced back sharply, indicating a positive bias. The daily and weekly strength indicator RSI is in positive terrain, justifying rising strength. The significant increase in trading volumes signifies increased participation.Investors should buy, hold and accumulate this stock with an expected upside of  ₹395-415 with downside support zone of  ₹330-316 levels.","cleaned_content":"stock market news fridays session saw significant selling on the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e with foreign investors recording high levels of selling in october the nifty \u003cFIVE_TEN\u003e index saw an initial drop of \u003cZERO_PERCENT\u003e or \u003cEIGHT_TEN\u003e points opening at \u003cTWO_TEN_THOUSAND\u003e points in comparison the sensex index opened at \u003cEIGHT_TEN_THOUSAND\u003e marking a decrease of \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e experts suggest that indian stocks are currently experiencing continuous pressure from foreign institutional investors fiis although there is hope for a better outlook in the coming weeks due to the anticipated strong recovery dr v k vijayakumar the chief investment strategist at geojit financial services highlighted that the current patterns indicate a continuation of fii selling and dii buying while a rebound may occur in the next two or three days it is unlikely to be sustained due to the waning sentiments it is recommended for investors to monitor the situation and wait for the market to stabilize gradually accumulating largecaps such as prominent private sector banks affected by fii selling over the past three weeks the benchmark index has experienced significant profit booking closing around \u003cTWO_THOUSAND\u003e levels currently the benchmark index is hovering around a multiple support zone of \u003cTWO_TEN_THOUSAND\u003e levels from the past couple of months any breach of this level on a closing basis may lead to further weakness towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in the upcoming weeks nifty \u003cFIVE_TEN\u003e is currently trading below its \u003cTWO_TEN\u003e and \u003cFIVE_TEN\u003e day sma confirming a bearish bias conversely any relief rally towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels could serve as an exit opportunity for short term traders based on the current closing price the stock is poised for breaking through a long standing resistance zone around the \u003cTWO_THOUSAND\u003e levels a decisive breakout above this level could lead to significant upward momentum in the short and medium term the stock is trending upwards forming higher tops and bottoms indicating bullish sentiment the stock is comfortably trading above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day simple moving averages sma which are also trending upwards along with the stock price confirming the bullish trend additionally the daily weekly and monthly relative strength index rsi indicators are in positive terrain reinforcing strength across all time frames investors should buy hold and accumulate this stock with an expected upside of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e with downside support zone of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e levels on the weekly chart the stock is trending higher in an up sloping channel forming a series of higher tops and bottoms indicating bullish sentiments recently the stock has reclaimed the \u003cONE_HUNDRED\u003e day sma support at \u003cTHREE_HUNDRED\u003e levels and bounced back sharply indicating a positive bias the daily and weekly strength indicator rsi is in positive terrain justifying rising strength the significant increase in trading volumes signifies increased participation investors should buy hold and accumulate this stock with an expected upside of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e with downside support zone of \u003cFOUR_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e levels on the weekly chart the stock is trending higher in an up sloping channel forming a series of higher highs and higher lows indicating bullish sentiments recently the stock has reclaimed the \u003cONE_HUNDRED\u003e day sma support at \u003cTHREE_HUNDRED\u003e levels and bounced back sharply indicating a positive bias the daily and weekly strength indicator rsi is in positive terrain justifying rising strength the significant increase in trading volumes signifies increased participation investors should buy hold and accumulate this stock with an expected upside of \u003cTHREE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e with downside support zone of \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e levels","timestamp":"2024-10-18T10:00:00+05:30","market_timestamp":"2024-10-18T10:00:00+05:30","off_market_hours":false}