{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-rs-100-multibagger-stock-jumps-after-this-latest-corporate-update-11729060998742.html","title":"Small-cap stock below  ₹100: Multibagger stock jumps after this latest corporate update","description":"Small-cap stock below  ₹100: MIC Electronics share is a small-cap multibagger stock that has given more than 184% returns year-to-date (YTD). The stock has rallied over 148% in the past one year.","content":"Small-cap stock below  ₹100: MIC Electronics share price jumped over 4% on Wednesday after the company’s board approved the appointment of Additional Director and Non-Executive Chairman along with other business updates. The multibagger smallcap stock surged as much as 4.66% to  ₹98.50 apiece on the BSE.The board of directors of MIC Electronics at their meeting held on October 16 approved the appointment of Penumaka Venkata Ramesh as Additional Director of the company in the Non-Executive Independent category.PV Ramesh has been appointed as the Additional Director for a term of 5 years w.e.f October 15, 2024, subject to approval of members. He has also been appointed as Non-Executive Chairman of the company, MIC Electronics said in a BSE filing on Tuesday.The company’s board also approved the proposal of acquisition of the companies or body corporates engaged in the same or allied lines of business of the company in order to expand the market presence, access new markets and technologies.Meanwhile, on October 9, MIC Electronics informed that it received a Letter of Acceptance from the Malda Division of the Eastern Railway Zone for the provision of CIB at PF 1, 2 \u0026 3 of Abhaipur station of Malda Division, Eastern Railway.The aggregate value of the said work order is  ₹1.21 crore, and the time period by which the order is to be executed is six months from the date of issue of Letter of Acceptance, it said.MIC Electronics share is a small-cap multibagger stock that has given more than 184% returns year-to-date (YTD). The stock has rallied over 148% in the past one year.At 12:20 pm, MIC Electronics shares were trading 2.41% higher at  ₹96.38 apiece on the BSE.","cleaned_content":"small cap stock below \u003cONE_HUNDRED\u003e mic electronics share price jumped over \u003cFOUR_PERCENT\u003e on wednesday after the company s board approved the appointment of additional director and non executive chairman along with other business updates the multibagger smallcap stock surged as much as \u003cFOUR_PERCENT\u003e to \u003cNINE_TEN\u003e apiece on the bse the board of directors of mic electronics at their meeting held on october \u003cONE_TEN\u003e approved the appointment of penumaka venkata ramesh as additional director of the company in the non executive independent category pv ramesh has been appointed as the additional director for a term of \u003cFIVE_\u003e years w e f october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e subject to approval of members he has also been appointed as non executive chairman of the company mic electronics said in a bse filing on tuesday the company s board also approved the proposal of acquisition of the companies or body corporates engaged in the same or allied lines of business of the company in order to expand the market presence access new markets and technologies meanwhile on october \u003cNINE_\u003e mic electronics informed that it received a letter of acceptance from the malda division of the eastern railway zone for the provision of cib at pf \u003cONE_\u003e \u003cTWO_\u003e \u003cTHREE_\u003e of abhaipur station of malda division eastern railway the aggregate value of the said work order is \u003cONE_\u003e crore and the time period by which the order is to be executed is six months from the date of issue of letter of acceptance it said mic electronics share is a small cap multibagger stock that has given more than \u003cONE_HUNDRED_PERCENT\u003e returns year to date ytd the stock has rallied over \u003cONE_HUNDRED_PERCENT\u003e in the past one year at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e pm mic electronics shares were trading \u003cTWO_PERCENT\u003e higher at \u003cNINE_TEN\u003e apiece on the bse","timestamp":"2024-10-16T12:21:00+05:30","market_timestamp":"2024-10-16T12:21:00+05:30","off_market_hours":false}