{"url":"https://www.livemint.com/market/stock-market-news/hyundai-share-price-dips-after-discounted-listing-buy-sell-or-hold-11729580238753.html","title":"Hyundai share price dips after discounted listing. Buy, sell or hold?","description":"Stock market today: Hyundai shares opened on the BSE at  ₹1931 apiece, whereas, on the NSE, they were listed at 1934 per share","content":"Stock market today: In line with market estimates, Hyundai Motor India shares opened at a discounted price on the BSE and NSE on Tuesday, October 22. Hyundai share price opened on the BSE at  ₹1,931 apiece, whereas, on the NSE, it listed at  ₹1,934 per share, debuting at around a 1.50 per cent discount against the upper price band of  ₹1,960 apiece. The newly-listed stock witnessed further selling pressure and hit a new low of  ₹1,844.65 per share on the NSE.According to stock market experts, Hyundai Motor India is India's second-largest passenger vehicle manufacturer with strong fundamentals. They advised medium to long-term investors to hold the scrip as the company indulges in innovation, especially in the SUV segment, which is expected to fuel its business growth.Speaking on the outlook of Hyundai share price, Shivani Nyati, Head of Wealth at Swastika Investmart, said, “Despite the discounted listing, Hyundai Motor India's strong fundamentals, being the second-largest passenger vehicle manufacturer in India and its strategic focus on the SUV segment, continue to support its long-term growth prospects. Investors who entered with a long-term perspective may consider holding the stock, as future performance will likely be driven by the company's competitive market position and product innovations.”On the suggestion to fresh investors, Prashanth Tapse, Senior vice president of research at Mehta Equities, said, “For fresh new investors wishing to buy post listing, we advise waiting and watching for the price to settle and revisiting the space with better-discounted opportunities. The best range for accumulating Hyundai is a 10-15% discount on its issue price. For the long term, Hyundai's growth story remains intact and in line with India's growth story.”","cleaned_content":"stock market today in line with market estimates hyundai motor india shares opened at a discounted price on the bse and nse on tuesday october \u003cTWO_TEN\u003e hyundai share price opened on the bse at \u003cONE_THOUSAND\u003e apiece whereas on the nse it listed at \u003cONE_THOUSAND\u003e per share debuting at around a \u003cONE_PERCENT\u003e discount against the upper price band of \u003cONE_THOUSAND\u003e apiece the newly listed stock witnessed further selling pressure and hit a new low of \u003cONE_THOUSAND\u003e per share on the nse according to stock market experts hyundai motor india is indias second largest passenger vehicle manufacturer with strong fundamentals they advised medium to long term investors to hold the scrip as the company indulges in innovation especially in the suv segment which is expected to fuel its business growth speaking on the outlook of hyundai share price shivani nyati head of wealth at swastika investmart said despite the discounted listing hyundai motor indias strong fundamentals being the second largest passenger vehicle manufacturer in india and its strategic focus on the suv segment continue to support its long term growth prospects investors who entered with a long term perspective may consider holding the stock as future performance will likely be driven by the companys competitive market position and product innovations on the suggestion to fresh investors prashanth tapse senior vice president of research at mehta equities said for fresh new investors wishing to buy post listing we advise waiting and watching for the price to settle and revisiting the space with better discounted opportunities the best range for accumulating hyundai is a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e discount on its issue price for the long term hyundais growth story remains intact and in line with indias growth story","timestamp":"2024-10-22T12:38:00+05:30","market_timestamp":"2024-10-22T12:38:00+05:30","off_market_hours":false}