{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-breakdown-50-dema-support-opportunity-for-bottom-fishing-11729152176915.html","title":"Stock market today: Nifty 50 breakdown 50-DEMA support. Opportunity for bottom fishing?","description":"Stock market today: Experts recommend buying these four shares — Infosys, Persistent Systems, Vedanta, and NALCO","content":"Stock market today: After breaching the 50-DEMA support placed at the 20,050 mark, the Nifty 50 index deep dived during Thursday session and touched an intraday low of 24,755 mark, recording around 375 points in three straight sessions. The BSE Sensex lost over 1,000 points while touching an intraday low of 80,959.According to stock market experts, DIIs await more crashes after FIIs sell at higher levels, awaiting the US Presidential Election results and the Maharashtra Assembly poll outcome. However, the market is expected to find support at around 24,700; some relief rallies can be expected at the bottom levels. They advised bulls to wait as the Nifty 50 index may go down to 24,350 to 24,300 mark if it breaks down below 24,700 support on a closing basis.Unveiling the trade setup in this bearish Indian stock market, Mahesh M Ojha, AVP — Research at Hensex Securities, said, \"The Indian stock market is falling because FIIs are selling at higher levels and DIIs are not in the mood to buy at these levels. This FII-DII trend is because of the US presidential elections and the Maharashtra State Assembly polls. These two poll outcomes are expected to decipher the move of FIIs and DIIs. I am expecting a relief rally in the near term. However, the market is expected to remain range-bound till these two election results are out.\"\"Even if there is a relief rally, I expect the Nifty 50 Index to retest its 24,700 support after deep diving below its 50-DEMA support of 20,050. If the 50-stock index breaches below 24,700 on a closing basis, the frontline index may go down to 24,350 to 24,300 range,\" said Anshul Jain, Head of Research at Lakshmishree Investment and Securities.Unveiling the investment strategy in this bear-ridden market, Anshul Jain of Lakshmishree Investment and Securities said, \"Bottom fishing is not advisable at current levels. One should buy only when the Nifty 50 index is above 25,200, or it nosedives around 24,400.\"Both experts favoured metal and IT stocks on segments that may provide better stocks for bottom fishing.Regarding stocks to buy today, Anshul Jain said, “In the metal segment, one can look at Vedants and National Aluminium Company or NALCO. In the IT segment, one can look at Infosys and Persistent Systems shares.”","cleaned_content":"stock market today after breaching the \u003cFIVE_TEN\u003e dema support placed at the \u003cTWO_TEN_THOUSAND\u003e mark the nifty \u003cFIVE_TEN\u003e index deep dived during thursday session and touched an intraday low of \u003cTWO_TEN_THOUSAND\u003e mark recording around \u003cTHREE_HUNDRED\u003e points in three straight sessions the bse sensex lost over \u003cONE_THOUSAND\u003e points while touching an intraday low of \u003cEIGHT_TEN_THOUSAND\u003e according to stock market experts diis await more crashes after fiis sell at higher levels awaiting the us presidential election results and the maharashtra assembly poll outcome however the market is expected to find support at around \u003cTWO_TEN_THOUSAND\u003e some relief rallies can be expected at the bottom levels they advised bulls to wait as the nifty \u003cFIVE_TEN\u003e index may go down to \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e mark if it breaks down below \u003cTWO_TEN_THOUSAND\u003e support on a closing basis unveiling the trade setup in this bearish indian stock market mahesh m ojha avp research at hensex securities said the indian stock market is falling because fiis are selling at higher levels and diis are not in the mood to buy at these levels this fii dii trend is because of the us presidential elections and the maharashtra state assembly polls these two poll outcomes are expected to decipher the move of fiis and diis i am expecting a relief rally in the near term however the market is expected to remain range bound till these two election results are out even if there is a relief rally i expect the nifty \u003cFIVE_TEN\u003e index to retest its \u003cTWO_TEN_THOUSAND\u003e support after deep diving below its \u003cFIVE_TEN\u003e dema support of \u003cTWO_TEN_THOUSAND\u003e if the \u003cFIVE_TEN\u003e stock index breaches below \u003cTWO_TEN_THOUSAND\u003e on a closing basis the frontline index may go down to \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range said anshul jain head of research at lakshmishree investment and securities unveiling the investment strategy in this bear ridden market anshul jain of lakshmishree investment and securities said bottom fishing is not advisable at current levels one should buy only when the nifty \u003cFIVE_TEN\u003e index is above \u003cTWO_TEN_THOUSAND\u003e or it nosedives around \u003cTWO_TEN_THOUSAND\u003e both experts favoured metal and it stocks on segments that may provide better stocks for bottom fishing regarding stocks to buy today anshul jain said in the metal segment one can look at vedants and national aluminium company or nalco in the it segment one can look at infosys and persistent systems shares","timestamp":"2024-10-17T13:45:00+05:30","market_timestamp":"2024-10-17T13:45:00+05:30","off_market_hours":false}