{"url":"https://www.livemint.com/market/stock-market-news/waaree-energies-ipo-10-key-risks-you-should-know-about-before-investing-in-rs-4-321-crore-issue-11729501643946.html","title":"Waaree Energies IPO: 10 key risks you should know about before investing in  ₹4,321 crore issue","description":"Waaree Energies has opened its IPO to raise  ₹4,321.44 crore, which was oversubscribed 3.47 times on the first day. Investors should consider risks such as heavy U.S. market dependence and material cost fluctuations.","content":"Waaree Energies initial public offering (IPO) has opened for bidding today, October 21, and will remain available to investors until Wednesday, October 23. The company aims to raise  ₹4,321.44 crore through this IPO, which comprises a fresh issue of 2.4 crore shares aggregating to  ₹3,600.00 crore and an offer for sale of 0.48 crore shares totaling  ₹721.44 crore.The IPO received a strong response on its first day of bidding, resulting in a subscription rate of 3.47 times, driven by interest from non-institutional investors (NII) and retail investors.The price band for the IPO is set between  ₹1,427 and  ₹1,503 per share, with a minimum lot size for retail investors fixed at one lot, consisting of 9 shares. This means retail investors will need to make a minimum investment of  ₹13,527 to participate in the offering.The stock is scheduled to be listed on both BSE and NSE platforms, with a tentative listing date of Monday, October 28.As the IPO launches today, potential investors should be aware of the key risks outlined by the company in its Draft Red Herring Prospectus (RHP). In this article, we will break down some of these key risks.The company is the largest manufacturer of solar PV modules in India with the largest aggregate installed capacity of 12 GW, as of June 30, 2023. For Fiscal 2023, it had the second-best operating income among all the domestic solar PV module manufacturers in India, as per the DRHP report.Dependence on the U.S. Market: Waaree Energies has experienced substantial growth in export sales, particularly to the United States, which accounted for 98.67% of its export sales in FY23. This heavy reliance on a single market poses a significant risk if there are changes in U.S. policies or demand, which could severely impact the company's revenue.Regulatory and Policy Changes: The company operates in an evolving regulatory environment, heavily reliant on government policies and incentives that support renewable energy, particularly solar power. Any adverse changes, elimination, or reduction in these incentives or government support could negatively impact the company's business. Policy shifts may also increase compliance costs and require significant management attention, affecting the feasibility of new solar energy projects.Solar Module Pricing Volatility: It faces significant risks from fluctuations in solar module prices. While module prices surged in FY22 and FY23, they sharply declined by 21% in early FY24 due to an oversupply of components like polysilicon. Although the company mitigates some pricing risk through indexed pricing mechanisms, further unexpected price drops could pressure profit margins and impact revenue realization from customer contracts.Material Cost Volatility: Waaree Energies relies on external suppliers for key materials like solar cells, glass, and aluminum panels. Price volatility, driven by factors such as market fluctuations, currency changes, and import duties, could increase material costs. As a result, any inability to secure stable and reasonably priced supplies may affect operating margins and overall profitability.Risk from Dependency on Key Customers: The company is heavily reliant on certain key customers, with a significant portion of its revenue generated from the top 10 customers. The loss or reduction of orders from any of these customers could negatively impact the company's financial performance.Risk from Import Restrictions and Duties: It relies on imported materials, particularly solar cells from China and Southeast Asia. Any import restrictions or high customs duties, such as the 40% duty on solar modules and 25% on solar cells imposed by the Indian government, could increase production costs. If the company cannot effectively implement its backward integration strategy or source cost-effective domestic materials, its business and profitability may be adversely impacted.Risk from Competition and Industry Barriers: The company faces significant competition in the solar PV market, characterized by a geographical shift in manufacturing and an expanding distributor network. Retail consumers are price-sensitive, particularly for smaller solar installations, leading to increased competition and pressure on pricing.While the company has a strategy for backward integration and aims to expand its product offerings, rising competition could affect profit margins, pricing, and market share both domestically and in export markets. A robust distribution network is crucial for reaching consumers and maintaining customer relationships amid this competitive landscape.Risk from Exchange Rate Fluctuations: The company is heavily influenced by exchange rate fluctuations, especially concerning the import of materials such as solar cells and capital equipment, in addition to its export sales. A considerable share of its expenses is denominated in foreign currencies, predominantly the US Dollar, with foreign currency costs representing a significant portion of total expenses in recent fiscal years.Fluctuations in the exchange rate, influenced by factors such as inflation and currency depreciation, can adversely impact the company's financial results. Although Waaree Energies employs foreign currency hedging strategies to mitigate these risks, predicting future currency movements remains challenging, potentially leading to increased costs and financial uncertainty.Outstanding Legal Proceedings: The company, along with its subsidiaries, promoters, and directors, is involved in several ongoing legal proceedings. These cases are at various stages of adjudication and may potentially affect the company’s business, financial position, and operations.Legal Non-Compliance of Group Companies: In the past, certain group companies and subsidiaries of Waaree Energies, such as Waaree Renewable Technologies Limited and Indosolar Limited, failed to meet certain legal requirements of SEBI and stock exchanges. This history of non-compliance could pose reputational and regulatory risks.","cleaned_content":"waaree energies initial public offering ipo has opened for bidding today october \u003cTWO_TEN\u003e and will remain available to investors until wednesday october \u003cTWO_TEN\u003e the company aims to raise \u003cFOUR_THOUSAND\u003e crore through this ipo which comprises a fresh issue of \u003cTWO_\u003e crore shares aggregating to \u003cTHREE_THOUSAND\u003e crore and an offer for sale of \u003cZERO_\u003e crore shares totaling \u003cSEVEN_HUNDRED\u003e crore the ipo received a strong response on its first day of bidding resulting in a subscription rate of \u003cTHREE_\u003e times driven by interest from non institutional investors nii and retail investors the price band for the ipo is set between \u003cONE_THOUSAND\u003e and \u003cONE_THOUSAND\u003e per share with a minimum lot size for retail investors fixed at one lot consisting of \u003cNINE_\u003e shares this means retail investors will need to make a minimum investment of \u003cONE_TEN_THOUSAND\u003e to participate in the offering the stock is scheduled to be listed on both bse and nse platforms with a tentative listing date of monday october \u003cTWO_TEN\u003e as the ipo launches today potential investors should be aware of the key risks outlined by the company in its draft red herring prospectus rhp in this article we will break down some of these key risks the company is the largest manufacturer of solar pv modules in india with the largest aggregate installed capacity of \u003cONE_TEN\u003e gw as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e for fiscal \u003cTWO_THOUSAND\u003e it had the second best operating income among all the domestic solar pv module manufacturers in india as per the drhp report dependence on the u s market waaree energies has experienced substantial growth in export sales particularly to the united states which accounted for \u003cNINE_TEN_PERCENT\u003e of its export sales in fy23 this heavy reliance on a single market poses a significant risk if there are changes in u s policies or demand which could severely impact the companys revenue regulatory and policy changes the company operates in an evolving regulatory environment heavily reliant on government policies and incentives that support renewable energy particularly solar power any adverse changes elimination or reduction in these incentives or government support could negatively impact the companys business policy shifts may also increase compliance costs and require significant management attention affecting the feasibility of new solar energy projects solar module pricing volatility it faces significant risks from fluctuations in solar module prices while module prices surged in fy22 and fy23 they sharply declined by \u003cTWO_TEN_PERCENT\u003e in early fy24 due to an oversupply of components like polysilicon although the company mitigates some pricing risk through indexed pricing mechanisms further unexpected price drops could pressure profit margins and impact revenue realization from customer contracts material cost volatility waaree energies relies on external suppliers for key materials like solar cells glass and aluminum panels price volatility driven by factors such as market fluctuations currency changes and import duties could increase material costs as a result any inability to secure stable and reasonably priced supplies may affect operating margins and overall profitability risk from dependency on key customers the company is heavily reliant on certain key customers with a significant portion of its revenue generated from the top \u003cONE_TEN\u003e customers the loss or reduction of orders from any of these customers could negatively impact the companys financial performance risk from import restrictions and duties it relies on imported materials particularly solar cells from china and southeast asia any import restrictions or high customs duties such as the \u003cFOUR_TEN_PERCENT\u003e duty on solar modules and \u003cTWO_TEN_PERCENT\u003e on solar cells imposed by the indian government could increase production costs if the company cannot effectively implement its backward integration strategy or source cost effective domestic materials its business and profitability may be adversely impacted risk from competition and industry barriers the company faces significant competition in the solar pv market characterized by a geographical shift in manufacturing and an expanding distributor network retail consumers are price sensitive particularly for smaller solar installations leading to increased competition and pressure on pricing while the company has a strategy for backward integration and aims to expand its product offerings rising competition could affect profit margins pricing and market share both domestically and in export markets a robust distribution network is crucial for reaching consumers and maintaining customer relationships amid this competitive landscape risk from exchange rate fluctuations the company is heavily influenced by exchange rate fluctuations especially concerning the import of materials such as solar cells and capital equipment in addition to its export sales a considerable share of its expenses is denominated in foreign currencies predominantly the us dollar with foreign currency costs representing a significant portion of total expenses in recent fiscal years fluctuations in the exchange rate influenced by factors such as inflation and currency depreciation can adversely impact the companys financial results although waaree energies employs foreign currency hedging strategies to mitigate these risks predicting future currency movements remains challenging potentially leading to increased costs and financial uncertainty outstanding legal proceedings the company along with its subsidiaries promoters and directors is involved in several ongoing legal proceedings these cases are at various stages of adjudication and may potentially affect the company s business financial position and operations legal non compliance of group companies in the past certain group companies and subsidiaries of waaree energies such as waaree renewable technologies limited and indosolar limited failed to meet certain legal requirements of sebi and stock exchanges this history of non compliance could pose reputational and regulatory risks","timestamp":"2024-10-21T20:02:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}