{"url":"https://www.livemint.com/market/stock-market-news/infosys-share-price-dips-5-as-q2-numbers-miss-expectations-guidance-disappoints-11729230622412.html","title":"Infosys share price dips 5% as Q2 numbers miss expectations, guidance disappoints","description":"Infosys' shares fell 5% despite a revenue increase, as its guidance disappointed investors. Motilal Oswal remains optimistic about smaller deals and maintains a 'buy' rating for Infosys.","content":"Shares of Infosys, the country's second-largest IT company, tumbled 5% in trade on Friday, October 18 to  ₹1,869 after investors were disappointed with the lower-than-expected Q2 FY25 results and revenue guidance given by the IT bellwether.The company raised its revenue growth guidance for FY25 to 3.74%-4.5%, up from 3%-4% previously, but analysts noted this was below expectations. According to domestic brokerage Motilal Oswal, while there was broad-based revenue growth this quarter, Infosys’ commentary and guidance tempered hopes of a significant rebound in discretionary spending.The company observed limited signs of recovery in discretionary expenditures, particularly outside the US banking sector. Additionally, it postponed wage hikes to the fourth quarter of FY25 and the first quarter of FY26, indicating ongoing uncertainties.\"The guidance was upgraded by just 50 basis points at the top end, despite a robust 3.5% compound quarterly growth rate (CQGR) in the first half. This suggests a muted CQGR of approximately 0.5% for the second half of FY25. This indicates that although client pessimism may be bottoming out, a resurgence in discretionary spending remains elusive,\" the brokerage stated.However, the brokerage expressed optimism regarding the double-digit year-on-year growth rate in smaller deals (less than USD 50 million total contract value). While the company was cautious about labelling this as a trend, Motilal believes these developments signal the early return of business flow to both Infosys and the sector, positioning it favourably for FY26E.On Thursday, after market hours, Infosys reported a profit after tax of  ₹6,506 crore for the second quarter ending in September 2024, a 5% year-on-year increase from  ₹6,212 crore in the same period last year. However, this figure fell slightly short of the Street’s expectations of  ₹6,700 crore.The company recorded revenue from operations of  ₹40,986 crore, slightly above the Street’s estimate of  ₹40,890 crore. Segment-wise growth in constant currency terms showed that financial services grew by 2.3% year-on-year, energy and utilities increased by 10.9% year-on-year, manufacturing rose by 12.3% year-on-year, and communication grew by 7% year-on-year.In contrast, the retail segment experienced a decline of 9.6% year-on-year. The EBIT margin remained flat quarter-on-quarter at 21.1%, and the total contract value (TCV) of large deals was reported at $2.4 billion, compared to $4.1 billion in Q1 FY25.Following the company's Q2 performance, Motilal Oswal slightly adjusted its estimates for FY25/FY26/FY27E, reflecting a slower revenue growth outlook for the near term. Nonetheless, the company has upheld its margin guidance of 20-22%, which the brokerage views positively.It expects Infosys to benefit significantly from the anticipated acceleration in IT spending in the medium term. The brokerage values the stock at 28 times the September 2026 earnings per share (EPS), resulting in a target price of  ₹2,200, suggesting a 12% upside potential. It retained its 'buy' rating on the stock.Centrum Broking said \"The near-term demand landscape is gradually improving, particularly in the banking, financial services, and insurance (BFSI) sector. The demand for AI solutions aimed at boosting productivity is on the rise with each passing quarter. The revised revenue growth guidance to 3.75%-4.5% also indicates an improvement in the demand environment.\"The brokerage maintained its 'Add' rating on the stock with revised target price of  ₹2,122 (vs  ₹1,864 earlier) at PE of 25x on FY26E. It has increased its target PE multiple from 24x to 25x to account for increased guidance for FY25E and certain green shoots in demand environment.","cleaned_content":"shares of infosys the countrys second largest it company tumbled \u003cFIVE_PERCENT\u003e in trade on friday october \u003cONE_TEN\u003e to \u003cONE_THOUSAND\u003e after investors were disappointed with the lower than expected q2 fy25 results and revenue guidance given by the it bellwether the company raised its revenue growth guidance for fy25 to \u003cTHREE_PERCENT\u003e \u003cFOUR_PERCENT\u003e up from \u003cTHREE_PERCENT\u003e \u003cFOUR_PERCENT\u003e previously but analysts noted this was below expectations according to domestic brokerage motilal oswal while there was broad based revenue growth this quarter infosys commentary and guidance tempered hopes of a significant rebound in discretionary spending the company observed limited signs of recovery in discretionary expenditures particularly outside the us banking sector additionally it postponed wage hikes to the fourth quarter of fy25 and the first quarter of fy26 indicating ongoing uncertainties the guidance was upgraded by just \u003cFIVE_TEN\u003e basis points at the top end despite a robust \u003cTHREE_PERCENT\u003e compound quarterly growth rate cqgr in the first half this suggests a muted cqgr of approximately \u003cZERO_PERCENT\u003e for the second half of fy25 this indicates that although client pessimism may be bottoming out a resurgence in discretionary spending remains elusive the brokerage stated however the brokerage expressed optimism regarding the double digit year on year growth rate in smaller deals less than usd \u003cFIVE_TEN\u003e million total contract value while the company was cautious about labelling this as a trend motilal believes these developments signal the early return of business flow to both infosys and the sector positioning it favourably for fy26e on thursday after market hours infosys reported a profit after tax of \u003cSIX_THOUSAND\u003e crore for the second quarter ending in september \u003cTWO_THOUSAND\u003e a \u003cFIVE_PERCENT\u003e year on year increase from \u003cSIX_THOUSAND\u003e crore in the same period last year however this figure fell slightly short of the street s expectations of \u003cSIX_THOUSAND\u003e crore the company recorded revenue from operations of \u003cFOUR_TEN_THOUSAND\u003e crore slightly above the street s estimate of \u003cFOUR_TEN_THOUSAND\u003e crore segment wise growth in constant currency terms showed that financial services grew by \u003cTWO_PERCENT\u003e year on year energy and utilities increased by \u003cONE_TEN_PERCENT\u003e year on year manufacturing rose by \u003cONE_TEN_PERCENT\u003e year on year and communication grew by \u003cSEVEN_PERCENT\u003e year on year in contrast the retail segment experienced a decline of \u003cNINE_PERCENT\u003e year on year the ebit margin remained flat quarter on quarter at \u003cTWO_TEN_PERCENT\u003e and the total contract value tcv of large deals was reported at \u003cTWO_\u003e billion compared to \u003cFOUR_\u003e billion in q1 fy25 following the companys q2 performance motilal oswal slightly adjusted its estimates for fy25 fy26 fy27e reflecting a slower revenue growth outlook for the near term nonetheless the company has upheld its margin guidance of \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e which the brokerage views positively it expects infosys to benefit significantly from the anticipated acceleration in it spending in the medium term the brokerage values the stock at \u003cTWO_TEN\u003e times the september \u003cTWO_THOUSAND\u003e earnings per share eps resulting in a target price of \u003cTWO_THOUSAND\u003e suggesting a \u003cONE_TEN_PERCENT\u003e upside potential it retained its buy rating on the stock centrum broking said the near term demand landscape is gradually improving particularly in the banking financial services and insurance bfsi sector the demand for ai solutions aimed at boosting productivity is on the rise with each passing quarter the revised revenue growth guidance to \u003cTHREE_PERCENT\u003e \u003cFOUR_PERCENT\u003e also indicates an improvement in the demand environment the brokerage maintained its add rating on the stock with revised target price of \u003cTWO_THOUSAND\u003e vs \u003cONE_THOUSAND\u003e earlier at pe of \u003cTWO_TEN\u003e x on fy26e it has increased its target pe multiple from \u003cTWO_TEN\u003e x to \u003cTWO_TEN\u003e x to account for increased guidance for fy25e and certain green shoots in demand environment","timestamp":"2024-10-18T12:18:00+05:30","market_timestamp":"2024-10-18T12:18:00+05:30","off_market_hours":false}