{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-18-11729216557084.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 18","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 24,750 level, a discount of nearly 90 points from the Nifty futures’ previous close.","content":"Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open lower on Friday tracking mixed cues from global markets and sustained FII outflows.The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 24,750 level, a discount of nearly 90 points from the Nifty futures’ previous close.On Thursday, the domestic equity benchmark indices ended lower, with the Nifty 50 falling below 24,800 level.The Sensex declined 494.75 points, or 0.61%, to close at 81,006.61, while the Nifty 50 settled 221.45 points, or 0.89%, lower at 24,749.85.Nifty 50 formed a long bear candle on the daily chart, which is indicating that the market is on the verge of showing a sharp downside breakout of sideways range movement.“This is a negative indication. After the series of positive chart pattern like higher highs and lows till last month on the daily chart, the recent minor upside bounce with range bound action could be considered as a new lower top around 25,200 levels. Hence a decisive move below the support of 24,700 is expected to form a new lower bottom in the near term,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to him, the short-term trend of Nifty 50 remains weak and a slide below 24,700 could open the next downside levels of 24,500- 24,400 by next week.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty Open Interest (OI) data shows the highest OI on the call side at the 24,900 and 25,000 strike prices, signaling strong resistance levels. On the put side, OI is concentrated at the 24,700 and 24,500 strike prices, highlighting these as key support level, said Hardik Matalia, Derivative Analyst at Choice Broking.Nifty 50 slipped into sharp weakness on October 17 and closed the day lower by 221 points on back of selling pressure from FIIs.“Weekly expiry further added pressure on markets that dragged index below 24,800 levels and finally index closed below that. Short term structure for index looks weak and sell on rallies strategy can be used by traders. On the higher side, Nifty 50 will find strong resistance around 24,950 - 25,050 levels and move towards those levels will be used by traders to reduce long exposure. A close below, 24,700, will trigger another round of selling that can drag the index further towards 24,440 / 24,180 levels,” said Aditya Agarwal Head of Derivatives \u0026 Technical Analysis at Sanctum Wealth.Dr. Praveen Dwarakanath, Vice President of Hedged.in noted that the Nifty 50 broke its consolidation range and closed very near its critical support at 24,700 levels.“A close below the 24,700 can open up room for the 24,000 level. Although the ADX DI- line is sloping upside, the ADX average line is sloping down and the RSI on the daily chart is in the Oversold region, indicating a halt in the fall or a small dead cat bounce in the index from its current support at 24,700 levels,” said Dwarakanath.He added that options writer’s data for this month’s expiry showed increased call writing above 24,800 levels and a short covering of 25,000 puts, indicating weakness in the index.VLA Ambala, Co-Founder of Stock Market Today believes the 6% correction in Nifty 50 over the past three weeks could offer dip buying opportunities in stocks that have previously outperformed. Based on the market sentiments, she advises investors to remain cautious in the short term and closely follow FPI trends to refine strategies.“Nifty formed a bearish ‘Head and Shoulders’ candlestick pattern on the daily price chart. Considering these factors, positional traders should avoid buying the dips for some weeks and focus on a ‘sell on the rise’ strategy. In the next session, Nifty can find support between 24,630 and 24,500 and expect resistance between 24,810 and 24,900,” Ambala said.Bank Nifty index dropped 512.25 points, or 0.99%, to close at 51,288.80 on Thursday, forming a bearish candlestick pattern on the daily charts.“Bank Nifty also saw selloff and closed below its 50 DMA. On the lower side, Bank Nifty will find strong support around 51,000 / 50,800 and dips towards those levels can be used to initiate fresh long positions for short covering pullback. Aggressive call writing is seen around 52,000 strike option and that will act as resistance for the index from a short term perspective,” said Aditya Agarwal.Dr. Praveen Dwarakanath said that the RSI line was turning down with a cross of the RSI average line, also indicating momentum on the downside to continue.“The ADX DI- line is sloping upside, indicating further fall from the present levels. Immediate support for the index is at 51,000, a break of which can take it down to 50,200 and then 49,700 levels. Options writer’s data showed increased writing in calls at 52,000 levels and above, indicating weakness to continue in the index,” said Dwarakanath.","cleaned_content":"indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open lower on friday tracking mixed cues from global markets and sustained fii outflows the trends on gift nifty also indicate a gap down start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cNINE_TEN\u003e points from the nifty futures previous close on thursday the domestic equity benchmark indices ended lower with the nifty \u003cFIVE_TEN\u003e falling below \u003cTWO_TEN_THOUSAND\u003e level the sensex declined \u003cFOUR_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a long bear candle on the daily chart which is indicating that the market is on the verge of showing a sharp downside breakout of sideways range movement this is a negative indication after the series of positive chart pattern like higher highs and lows till last month on the daily chart the recent minor upside bounce with range bound action could be considered as a new lower top around \u003cTWO_TEN_THOUSAND\u003e levels hence a decisive move below the support of \u003cTWO_TEN_THOUSAND\u003e is expected to form a new lower bottom in the near term said nagaraj shetti senior technical research analyst at hdfc securities according to him the short term trend of nifty \u003cFIVE_TEN\u003e remains weak and a slide below \u003cTWO_TEN_THOUSAND\u003e could open the next downside levels of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e by next week here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty open interest oi data shows the highest oi on the call side at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices signaling strong resistance levels on the put side oi is concentrated at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices highlighting these as key support level said hardik matalia derivative analyst at choice broking nifty \u003cFIVE_TEN\u003e slipped into sharp weakness on october \u003cONE_TEN\u003e and closed the day lower by \u003cTWO_HUNDRED\u003e points on back of selling pressure from fiis weekly expiry further added pressure on markets that dragged index below \u003cTWO_TEN_THOUSAND\u003e levels and finally index closed below that short term structure for index looks weak and sell on rallies strategy can be used by traders on the higher side nifty \u003cFIVE_TEN\u003e will find strong resistance around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels and move towards those levels will be used by traders to reduce long exposure a close below \u003cTWO_TEN_THOUSAND\u003e will trigger another round of selling that can drag the index further towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels said aditya agarwal head of derivatives technical analysis at sanctum wealth dr praveen dwarakanath vice president of hedged in noted that the nifty \u003cFIVE_TEN\u003e broke its consolidation range and closed very near its critical support at \u003cTWO_TEN_THOUSAND\u003e levels a close below the \u003cTWO_TEN_THOUSAND\u003e can open up room for the \u003cTWO_TEN_THOUSAND\u003e level although the adx di line is sloping upside the adx average line is sloping down and the rsi on the daily chart is in the oversold region indicating a halt in the fall or a small dead cat bounce in the index from its current support at \u003cTWO_TEN_THOUSAND\u003e levels said dwarakanath he added that options writer s data for this month s expiry showed increased call writing above \u003cTWO_TEN_THOUSAND\u003e levels and a short covering of \u003cTWO_TEN_THOUSAND\u003e puts indicating weakness in the index vla ambala co founder of stock market today believes the \u003cSIX_PERCENT\u003e correction in nifty \u003cFIVE_TEN\u003e over the past three weeks could offer dip buying opportunities in stocks that have previously outperformed based on the market sentiments she advises investors to remain cautious in the short term and closely follow fpi trends to refine strategies nifty formed a bearish head and shoulders candlestick pattern on the daily price chart considering these factors positional traders should avoid buying the dips for some weeks and focus on a sell on the rise strategy in the next session nifty can find support between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and expect resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e ambala said bank nifty index dropped \u003cFIVE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on thursday forming a bearish candlestick pattern on the daily charts bank nifty also saw selloff and closed below its \u003cFIVE_TEN\u003e dma on the lower side bank nifty will find strong support around \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e and dips towards those levels can be used to initiate fresh long positions for short covering pullback aggressive call writing is seen around \u003cFIVE_TEN_THOUSAND\u003e strike option and that will act as resistance for the index from a short term perspective said aditya agarwal dr praveen dwarakanath said that the rsi line was turning down with a cross of the rsi average line also indicating momentum on the downside to continue the adx di line is sloping upside indicating further fall from the present levels immediate support for the index is at \u003cFIVE_TEN_THOUSAND\u003e a break of which can take it down to \u003cFIVE_TEN_THOUSAND\u003e and then \u003cFOUR_TEN_THOUSAND\u003e levels options writer s data showed increased writing in calls at \u003cFIVE_TEN_THOUSAND\u003e levels and above indicating weakness to continue in the index said dwarakanath","timestamp":"2024-10-18T07:34:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}