{"url":"https://www.livemint.com/market/stock-market-news/tvs-holdings-board-to-consider-raising-funds-via-non-convertible-debentures-on-october-23-11729069811284.html","title":"TVS Holdings board to consider raising funds via non-convertible debentures on October 23","description":"TVS Holdings is gearing up to raise funds. The company has scheduled a board meeting on October 23 to discuss issuing Non-Convertible Debentures (NCDs) on a private placement basis.","content":"NCD issue: TVS Holdings on Wednesday, October 16 announced that its board will meet on October 23, 2024, to consider raising funds through the issuance of non-convertible debentures (NCDs) on a private placement basis. The fundraising will be conducted in one or more tranches over time, aligning with the company’s strategic financial goals.TVS Holdings share price was trading in the red, down 0.70 per cent at  ₹13,492.80 around 2:40 pm on the NSE. The company enjoys a market capitalisation of  ₹27,298.77 crore.Apart from the fundraise, the company's board will also consider the unaudited standalone and consolidated financial results for the quarter ended September 2024 on October 23.The company, formerly known as Sundaram-Clayton Limited, operates as a Core Investment Company (CIC) registered with the Reserve Bank of India. Through its group entities, TVS Holdings is involved in the manufacturing and sale of two-wheelers, automotive components, financial services, and real estate.This fundraising initiative comes just weeks after the Competition Commission of India (CCI) approved TVS Holdings’ acquisition of an 80.74% stake in Home Credit India Finance for  ₹554.06 crore. The deal, finalised on September 24, 2024, is part of a broader transaction in which Premji Invest and other associates will acquire the remaining 19.26% stake. The acquisition will expand TVS Holdings' financial services portfolio and customer base.The company last week also informed that rating agency CRISIL has reaffirmed its rating at ‘CRISIL AA’ on the long-term bank facility and non-convertible debentures while revising the outlook to ‘Positive’ from ‘Stable’.The outlook revision factors the healthy improvement in the credit profile of its main operating company, TVS Motor Company, said CRISIL. The improvement is driven by a healthy gain in market share for TVS Motor over the past 3-4 fiscals backed by the expansion of the product portfolio including thelaunch of electric scooters and market reach through dealership expansion.","cleaned_content":"ncd issue tvs holdings on wednesday october \u003cONE_TEN\u003e announced that its board will meet on october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e to consider raising funds through the issuance of non convertible debentures ncds on a private placement basis the fundraising will be conducted in one or more tranches over time aligning with the company s strategic financial goals tvs holdings share price was trading in the red down \u003cZERO_PERCENT\u003e at \u003cONE_TEN_THOUSAND\u003e around \u003cTWO_\u003e \u003cFOUR_TEN\u003e pm on the nse the company enjoys a market capitalisation of \u003cTWO_TEN_THOUSAND\u003e crore apart from the fundraise the companys board will also consider the unaudited standalone and consolidated financial results for the quarter ended september \u003cTWO_THOUSAND\u003e on october \u003cTWO_TEN\u003e the company formerly known as sundaram clayton limited operates as a core investment company cic registered with the reserve bank of india through its group entities tvs holdings is involved in the manufacturing and sale of two wheelers automotive components financial services and real estate this fundraising initiative comes just weeks after the competition commission of india cci approved tvs holdings acquisition of an \u003cEIGHT_TEN_PERCENT\u003e stake in home credit india finance for \u003cFIVE_HUNDRED\u003e crore the deal finalised on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e is part of a broader transaction in which premji invest and other associates will acquire the remaining \u003cONE_TEN_PERCENT\u003e stake the acquisition will expand tvs holdings financial services portfolio and customer base the company last week also informed that rating agency crisil has reaffirmed its rating at crisil aa on the long term bank facility and non convertible debentures while revising the outlook to positive from stable the outlook revision factors the healthy improvement in the credit profile of its main operating company tvs motor company said crisil the improvement is driven by a healthy gain in market share for tvs motor over the past \u003cTHREE_\u003e \u003cFOUR_\u003e fiscals backed by the expansion of the product portfolio including thelaunch of electric scooters and market reach through dealership expansion","timestamp":"2024-10-16T15:27:00+05:30","market_timestamp":"2024-10-16T15:27:00+05:30","off_market_hours":false}