{"url":"https://www.livemint.com/market/stock-market-news/us-election-2024-blackrock-ceo-larry-fink-no-big-impact-on-market-donald-trump-vs-kamala-harris-battle-11729566429493.html","title":"US elections 2024: Blackrock CEO Larry Fink says outcome won’t have any big impact on markets; ‘I’m tired of...’","description":"BlackRock CEO Larry Fink has downplayed the importance of the upcoming US presidential election, arguing that its outcome will have little long-term effect on financial markets.","content":"BlackRock CEO Larry Fink downplayed the significance of the upcoming US presidential election for financial markets, stating that the outcome “really doesn’t matter” in the long run.Speaking at a conference hosted by the Securities Industry and Financial Markets Association on October 21, Fink expressed his frustration with the overemphasis placed on elections, according to the Financial Times.“I’m tired of hearing this is the biggest election in your lifetime. The reality is over time, it doesn’t matter,” Fink said during the conference.He added that the market's short-term fluctuations are less important than people often believe, particularly for retirement funds, which make up more than half of BlackRock’s $11.5 trillion in assets under management.“Unfortunately, there’s too much preoccupation with whether the market’s going up or down at any one time, any one quarter,” Fink noted. “It really doesn’t matter.”Fink also emphasised that BlackRock works with both Republican and Democratic administrations and is currently engaged in discussions with both 2024 presidential candidates.On October 1, Fink shared similar views at the Berlin Global Dialogue 2024 conference. During a panel discussion, he reiterated that elections tend to generate media buzz but have limited long-term effects on markets, per a report in Bloomberg.“We see repeatedly every year, every four years, when we have an election, everyone says that it’s going to have a dramatic change in the market, and over time it doesn’t,” Fink said during the event, as quoted by Bloomberg. He explained that markets adapt and continue to function beyond the outcome of any single election.As the November 5 election approaches, polls show a tight race between former President Donald Trump and Vice President Kamala Harris. Trump has proposed tax breaks to boost US manufacturing, while Harris has outlined policies for greater government intervention in sectors like real estate and retail.","cleaned_content":"blackrock ceo larry fink downplayed the significance of the upcoming us presidential election for financial markets stating that the outcome really doesn t matter in the long run speaking at a conference hosted by the securities industry and financial markets association on october \u003cTWO_TEN\u003e fink expressed his frustration with the overemphasis placed on elections according to the financial times i m tired of hearing this is the biggest election in your lifetime the reality is over time it doesn t matter fink said during the conference he added that the markets short term fluctuations are less important than people often believe particularly for retirement funds which make up more than half of blackrock s \u003cONE_TEN\u003e trillion in assets under management unfortunately there s too much preoccupation with whether the market s going up or down at any one time any one quarter fink noted it really doesn t matter fink also emphasised that blackrock works with both republican and democratic administrations and is currently engaged in discussions with both \u003cTWO_THOUSAND\u003e presidential candidates on october \u003cONE_\u003e fink shared similar views at the berlin global dialogue \u003cTWO_THOUSAND\u003e conference during a panel discussion he reiterated that elections tend to generate media buzz but have limited long term effects on markets per a report in bloomberg we see repeatedly every year every four years when we have an election everyone says that it s going to have a dramatic change in the market and over time it doesn t fink said during the event as quoted by bloomberg he explained that markets adapt and continue to function beyond the outcome of any single election as the november \u003cFIVE_\u003e election approaches polls show a tight race between former president donald trump and vice president kamala harris trump has proposed tax breaks to boost us manufacturing while harris has outlined policies for greater government intervention in sectors like real estate and retail","timestamp":"2024-10-22T10:01:00+05:30","market_timestamp":"2024-10-22T10:01:00+05:30","off_market_hours":false}