{"url":"https://www.livemint.com/market/stock-market-news/market-cap-of-4-of-top-10-most-valued-firms-jumps-81-151-crore-icici-bank-hdfc-bank-lead-gains-infosys-ril-top-11729402211025.html","title":"Market cap of 4 of top-10 most valued firms jumps  ₹81,151 crore; ICICI Bank, HDFC Bank lead gains, Infosys, RIL top","description":"India's top companies saw a mixed bag of fortunes last week. While some giants like ICICI Bank and HDFC Bank saw significant gains, others like Infosys and Reliance Industries faced losses.","content":"Last week, four of India’s top 10 most-valued companies added a total of  ₹81,151.31 crore to their market valuation, with ICICI Bank and HDFC Bank leading the gains. Despite this, the BSE benchmark index declined by 156.61 points, or 0.19 per cent, as per a report by PTI.ICICI Bank’s valuation increased by  ₹28,495.14 crore to  ₹8,90,191.38 crore, while HDFC Bank added  ₹23,579.11 crore, reaching  ₹12,82,848.30 crore. The State Bank of India (SBI) gained  ₹17,804.61 crore, raising its value to  ₹7,31,773.56 crore, and Bharti Airtel saw an increase of  ₹11,272.45 crore, taking its market valuation to  ₹9,71,707.61 crore, as per a report by PTI.However, several top firms faced losses in market value. Infosys saw a significant drop of  ₹23,314.31 crore, bringing its valuation down to  ₹7,80,126.10 crore. Reliance Industries lost  ₹16,645.39 crore, lowering its value to  ₹18,38,721.14 crore, as per a report by PTI.Hindustan Unilever’s market value declined by  ₹15,248.85 crore to  ₹6,38,066.75 crore, while TCS shed  ₹10,402.01 crore, reducing its valuation to  ₹14,91,321.40 crore. LIC’s valuation fell by  ₹8,760.12 crore to  ₹5,91,418.91 crore, and ITC saw a decline of  ₹2,251.37 crore, bringing its value to  ₹6,08,682.29 crore, as per a report by PTI.Despite the mixed performance, Reliance Industries retained its position as the most valuable company in India, followed by TCS, HDFC Bank, and Bharti Airtel. Other top-valued companies include ICICI Bank, Infosys, SBI, Hindustan Unilever, ITC, and LIC, as per a report by PTI.(With inputs from PTI)","cleaned_content":"last week four of india s top \u003cONE_TEN\u003e most valued companies added a total of \u003cEIGHT_TEN_THOUSAND\u003e crore to their market valuation with icici bank and hdfc bank leading the gains despite this the bse benchmark index declined by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e as per a report by pti icici bank s valuation increased by \u003cTWO_TEN_THOUSAND\u003e crore to \u003cEIGHT_HUNDRED_THOUSAND\u003e crore while hdfc bank added \u003cTWO_TEN_THOUSAND\u003e crore reaching \u003cONE_MILLION\u003e crore the state bank of india sbi gained \u003cONE_TEN_THOUSAND\u003e crore raising its value to \u003cSEVEN_HUNDRED_THOUSAND\u003e crore and bharti airtel saw an increase of \u003cONE_TEN_THOUSAND\u003e crore taking its market valuation to \u003cNINE_HUNDRED_THOUSAND\u003e crore as per a report by pti however several top firms faced losses in market value infosys saw a significant drop of \u003cTWO_TEN_THOUSAND\u003e crore bringing its valuation down to \u003cSEVEN_HUNDRED_THOUSAND\u003e crore reliance industries lost \u003cONE_TEN_THOUSAND\u003e crore lowering its value to \u003cONE_MILLION\u003e crore as per a report by pti hindustan unilever s market value declined by \u003cONE_TEN_THOUSAND\u003e crore to \u003cSIX_HUNDRED_THOUSAND\u003e crore while tcs shed \u003cONE_TEN_THOUSAND\u003e crore reducing its valuation to \u003cONE_MILLION\u003e crore lic s valuation fell by \u003cEIGHT_THOUSAND\u003e crore to \u003cFIVE_HUNDRED_THOUSAND\u003e crore and itc saw a decline of \u003cTWO_THOUSAND\u003e crore bringing its value to \u003cSIX_HUNDRED_THOUSAND\u003e crore as per a report by pti despite the mixed performance reliance industries retained its position as the most valuable company in india followed by tcs hdfc bank and bharti airtel other top valued companies include icici bank infosys sbi hindustan unilever itc and lic as per a report by pti with inputs from pti","timestamp":"2024-10-20T11:23:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}