{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-50-crash-investors-lose-over-8-lakh-crore-what-is-driving-indian-stock-market-down-11729589270053.html","title":"Stock market today: Sensex, Nifty 50 crash; investors lose  ₹9 lakh crore; what drove the Indian stock market down?","description":"Stock market today: The Indian stock market faced significant selloffs, with the Sensex and Nifty 50 dropping over 1%. Mid and small-cap indices fell up to 4%, resulting in a market capitalisation decline of  ₹9 lakh crore in one day.","content":"Stock market today: A strong wave of selloff engulfed the Indian stock market on Tuesday, October 22, dragging the benchmarks, the Sensex and the Nifty 50, down by over a per cent each.The Sensex closed the day with a loss of 931 points, or 1.15 per cent, at 80,220.72, while the Nifty 50 settled at 24,472.10, down 309 points or 1.25 per cent.The mid and smallcap segments of the market suffered even deeper losses. The BSE Midcap index ended with a loss of 2.52 per cent, while the Smallcap index crashed 3.81 per cent.The overall market capitalisation of the firms listed on the BSE plunged to nearly  ₹444.7 lakh crore from nearly  ₹453.7 lakh crore in the previous session, making investors poorer by about  ₹9 lakh crore in a single day.Only three stocks- ICICI Bank (up 0.74 per cent), Nestle (up 0.10 per cent) and Infosys (up 0.04 per cent) closed in the green in the Nifty 50 index.Among the sectoral indices, Nifty PSU Bank (down 4.18 per cent), Realty (down 3.38 per cent) and Metal (down 3 per cent) crashed the most.Nifty Auto, Media, Consumer Durables and Oil and Gas fell over 2 per cent each. The Nifty Bank index declined 1.36 per cent, while the Private Bank index suffered a loss of 0.97 per cent.Ajit Mishra, SVP of Research at Religare Broking, pointed out that the Nifty 50 has now corrected by around 7 per cent from its record high, reaching the critical moving average support at the 100 DEMA (day exponential moving average), i.e. 24,485 level.\"The outlook suggests further downside, particularly in the midcap and smallcap spaces. The next major support is around 24,000 on the index front, with potential resistance between 24,700 and 25,000 in case of a rebound. We recommend adjusting trades accordingly and advise against adding to losing positions,\" said Mishra.Experts say elevated geopolitical tensions, uncertainty surrounding the US election 2024, and a sustained selloff by foreign portfolio investors (FPIs) are the key factors weighing on market sentiment.Moreover, unimpressive September quarter earnings and the stretched valuation of the Indian stock market are also contributing to the market's downward movement.Here are five key factors that could be behind the market fall:Tensions in the Middle East remain elevated, keeping investors on tenterhooks. According to a Reuters report, \"Hezbollah said it had fired rockets at two bases near Tel Aviv and one west of Haifa on Tuesday morning just hours before US Secretary of State Antony Blinken arrived in Israel to make another push for an elusive ceasefire.\"A close fight in the US presidential election also adds to market nervousness. According to a new Reuters/Ipsos poll, \"Democratic Vice President Kamala Harris held a marginal 3-percentage-point lead over Republican Donald Trump as the two stayed locked in a tight race to win the November 5 US presidential election.\"The outcome of the US presidential election will affect market sentiment globally. A drastic change is not expected in India's context. However, it may have a notable impact on the India-US bilateral ties in defence, trade, and strategic sectors.Despite the recent correction, stock market experts underscore that the current valuation of the Indian stock market remains stretched. This might have prompted profit booking.According to Trendlyne, an equity research platform, the current price-to-earnings (PE) ratio of Nifty 50 is slightly above 23, which is above its two-year average PE of 22.2.FPIs have been in an aggressive selloff mode in the Indian market this month. So far in October, FPIs have withdrawn a record  ₹82,479 crore from Indian equities, according to Trendlyne data, marking the highest monthly outflow on record.The biggest reason behind this whopping foreign capital outflow is the 'sell India, buy China' strategy gaining momentum after Beijing announced several stimulus to boost its economic growth.Foreign investors have been flocking to the Chinese markets due to a huge valuation gap with respect to the Indian market.\"There has been no respite from FIIs selling in local equities in the current month so far, which has been creating uncertainty among domestic investors. Also, foreign investors are fleeing Indian equities to invest in relatively cheaper locations such as China, especially after the stimulus announcement by its government to boost its slowing economy,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities.India Inc.'s September quarter earnings have been mixed so far, raising concerns that more downgrades could be forthcoming.Experts point out that the rate of corporate earnings recovery in Q2 compared to Q1 is below expectation.\"We forecast a 4 per cent QoQ growth in PAT for Nifty 50. The fear of a downgrade in earnings is becoming real. We continue to be cautious about the short term due to the risk of a downgrade in corporate earnings. High global inflation is impacting operating margins. There is a plausibility for India to underperform in the global market, which is also led by a shift in funds,\" wrote Vinod Nair, the head of research at Geojit Financial Services.Read all market-related news here","cleaned_content":"stock market today a strong wave of selloff engulfed the indian stock market on tuesday october \u003cTWO_TEN\u003e dragging the benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e down by over a per cent each the sensex closed the day with a loss of \u003cNINE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e down \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e the mid and smallcap segments of the market suffered even deeper losses the bse midcap index ended with a loss of \u003cTWO_PERCENT\u003e while the smallcap index crashed \u003cTHREE_PERCENT\u003e the overall market capitalisation of the firms listed on the bse plunged to nearly \u003cFOUR_HUNDRED\u003e lakh crore from nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors poorer by about \u003cNINE_\u003e lakh crore in a single day only three stocks icici bank up \u003cZERO_PERCENT\u003e nestle up \u003cZERO_PERCENT\u003e and infosys up \u003cZERO_PERCENT\u003e closed in the green in the nifty \u003cFIVE_TEN\u003e index among the sectoral indices nifty psu bank down \u003cFOUR_PERCENT\u003e realty down \u003cTHREE_PERCENT\u003e and metal down \u003cTHREE_PERCENT\u003e crashed the most nifty auto media consumer durables and oil and gas fell over \u003cTWO_PERCENT\u003e each the nifty bank index declined \u003cONE_PERCENT\u003e while the private bank index suffered a loss of \u003cZERO_PERCENT\u003e ajit mishra svp of research at religare broking pointed out that the nifty \u003cFIVE_TEN\u003e has now corrected by around \u003cSEVEN_PERCENT\u003e from its record high reaching the critical moving average support at the \u003cONE_HUNDRED\u003e dema day exponential moving average i e \u003cTWO_TEN_THOUSAND\u003e level the outlook suggests further downside particularly in the midcap and smallcap spaces the next major support is around \u003cTWO_TEN_THOUSAND\u003e on the index front with potential resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in case of a rebound we recommend adjusting trades accordingly and advise against adding to losing positions said mishra experts say elevated geopolitical tensions uncertainty surrounding the us election \u003cTWO_THOUSAND\u003e and a sustained selloff by foreign portfolio investors fpis are the key factors weighing on market sentiment moreover unimpressive september quarter earnings and the stretched valuation of the indian stock market are also contributing to the markets downward movement here are five key factors that could be behind the market fall tensions in the middle east remain elevated keeping investors on tenterhooks according to a reuters report hezbollah said it had fired rockets at two bases near tel aviv and one west of haifa on tuesday morning just hours before us secretary of state antony blinken arrived in israel to make another push for an elusive ceasefire a close fight in the us presidential election also adds to market nervousness according to a new reuters ipsos poll democratic vice president kamala harris held a marginal \u003cTHREE_PERCENT\u003e age point lead over republican donald trump as the two stayed locked in a tight race to win the november \u003cFIVE_\u003e us presidential election the outcome of the us presidential election will affect market sentiment globally a drastic change is not expected in indias context however it may have a notable impact on the india us bilateral ties in defence trade and strategic sectors despite the recent correction stock market experts underscore that the current valuation of the indian stock market remains stretched this might have prompted profit booking according to trendlyne an equity research platform the current price to earnings pe ratio of nifty \u003cFIVE_TEN\u003e is slightly above \u003cTWO_TEN\u003e which is above its two year average pe of \u003cTWO_TEN\u003e fpis have been in an aggressive selloff mode in the indian market this month so far in october fpis have withdrawn a record \u003cEIGHT_TEN_THOUSAND\u003e crore from indian equities according to trendlyne data marking the highest monthly outflow on record the biggest reason behind this whopping foreign capital outflow is the sell india buy china strategy gaining momentum after beijing announced several stimulus to boost its economic growth foreign investors have been flocking to the chinese markets due to a huge valuation gap with respect to the indian market there has been no respite from fiis selling in local equities in the current month so far which has been creating uncertainty among domestic investors also foreign investors are fleeing indian equities to invest in relatively cheaper locations such as china especially after the stimulus announcement by its government to boost its slowing economy said prashanth tapse senior vp research mehta equities india inc s september quarter earnings have been mixed so far raising concerns that more downgrades could be forthcoming experts point out that the rate of corporate earnings recovery in q2 compared to q1 is below expectation we forecast a \u003cFOUR_PERCENT\u003e qoq growth in pat for nifty \u003cFIVE_TEN\u003e the fear of a downgrade in earnings is becoming real we continue to be cautious about the short term due to the risk of a downgrade in corporate earnings high global inflation is impacting operating margins there is a plausibility for india to underperform in the global market which is also led by a shift in funds wrote vinod nair the head of research at geojit financial services read all market related news here","timestamp":"2024-10-22T16:03:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}