{"url":"https://www.livemint.com/market/stock-market-news/mukul-agrawal-picks-stake-in-deepak-fertilisers-in-q2-amid-45-rally-yeartodate-11729575985364.html","title":"Mukul Agrawal picks stake in Deepak Fertilisers in Q2 amid 45% rally year-to-date","description":"Deepak Fertilisers has attracted investor Mukul Agrawal, who acquired a 1.19% stake in the company in Q2. The stock has surged 45% in 2024 and nearly 50% over the past year, driven by expansion strategies.","content":"Mukul Agrawal portfolio stocks: Deepak Fertilisers and Petrochemicals Corporation Ltd. (DFPCL), a prominent player in India's fertiliser and petrochemical sectors, has caught the attention of ace investor Mukul Agrawal. During the second quarter ended September 2024 (Q2FY25), Agrawal made a notable move by purchasing 15 lakh shares, equivalent to a 1.19 per cent stake in the company. His name did not appear in the company’s shareholding list during the previous quarter, which implies that he either did not hold any shares or his holdings were below the reporting threshold of  ₹2 lakh in nominal value.Agrawal's decision to invest in DFPCL comes amid consistent gains in the stock. In 2024, the stock has surged 45 per cent year-to-date (YTD), building on its impressive performance over the last year, where it saw a near 50 per cent increase in value. This rise has been driven by the company's expansion strategies, robust fundamentals, and the overall positive sentiment surrounding India's agricultural and chemical sectors.Agrawal is not the only one who showed interest in Deepak Fertilisers. Domestic institutional investors, including banks, mutual funds, non-banking financial companies (NBFCs), insurance companies, and venture capital funds, also ramped up their holdings in the company.At the end of Q2FY25, these institutions collectively owned a 10.02 per cent stake, or 1.26 crore shares, up significantly from 6.3 per cent (79.5 lakh shares) in the previous June quarter. This rise in institutional ownership reflects the growing confidence in the company's ability to deliver long-term growth.Meanwhile, foreign institutional investors (FIIs), who had a 9.84 per cent stake in the June quarter, slightly reduced their holdings to 9.67 per cent (1.22 crore shares) in Q2FY25. Despite this minor decline, the continued presence of FIIs highlights the global interest in the company's growth prospects, particularly in the Indian fertiliser and chemicals market, which has been bolstered by government initiatives and rising demand for sustainable agricultural solutions.Deepak Fertilisers has been on a remarkable bull run over the past year, with the stock appreciating by nearly 50 per cent. In 2024 alone, the stock has gained 45 per cent YTD, demonstrating consistent monthly gains. After four straight months of positive performance, the stock climbed another 7.6 per cent in October.The stock rose by 2 per cent in September, 12.5 per cent in August, 37.3 per cent in July, and 20 per cent in June, highlighting a strong growth trajectory. However, prior to this bullish streak, the stock experienced a dip of 6.6 per cent in May, following a 20 per cent rally in April. The first three months of the year saw a decline, with the stock falling 0.3 per cent in March, 18.3 per cent in February, and 9 per cent in January.Currently, the stock is trading around 15 per cent below its peak of  ₹1,163.75, which it touched in early October. Despite this slight pullback, the stock has surged by 119 per cent from its 52-week low of  ₹453.20, recorded in March 2024. The stock’s strong upward trend reflects growing investor confidence in Deepak Fertilisers, which continues to strengthen its position in the fertiliser and chemicals market.Despite the stock’s stellar performance over the last year, some concerns have emerged regarding its financial health and growth outlook. MarketsMOJO downgraded the stock to ‘Hold’ from ‘Buy’ on October 14, 2024. The downgrade came despite the company demonstrating high management efficiency, with a Return on Capital Employed (ROCE) of 15.22 per cent and a strong annual operating profit growth rate of 34.58 per cent.One of the key reasons behind the downgrade is the company’s declining profitability. Despite generating a solid return of 59.66 per cent over the past year, Deepak Fertilisers’ profits have fallen by 40.4 per cent. This decline in profitability has raised red flags, especially considering the company's high debt-to-EBITDA ratio of 2.73 times. Such a high ratio could indicate potential challenges in managing debt levels and may impact the company's financial stability in the long term, the brokerage said.Additionally, in its latest financial results for the June 2024 quarter, the company reported flat performance, with net sales declining by 20.90 per cent and profit after tax (PAT) falling by 23.84 per cent. This underwhelming performance, coupled with a 36.13 per cent increase in interest expenses, has contributed to the cautious outlook from brokerages like MarketsMOJO.Despite the recent downgrade, Deepak Fertilisers \u0026 Petrochemicals Corp remains a key player in the Indian fertiliser market, which is expected to grow significantly in the coming years. As per the brokerage, the company’s strategic expansion into petrochemicals and focus on improving operational efficiency positions it well to capitalise on future growth opportunities.","cleaned_content":"mukul agrawal portfolio stocks deepak fertilisers and petrochemicals corporation ltd dfpcl a prominent player in indias fertiliser and petrochemical sectors has caught the attention of ace investor mukul agrawal during the second quarter ended september \u003cTWO_THOUSAND\u003e q2fy25 agrawal made a notable move by purchasing \u003cONE_TEN\u003e lakh shares equivalent to a \u003cONE_PERCENT\u003e stake in the company his name did not appear in the company s shareholding list during the previous quarter which implies that he either did not hold any shares or his holdings were below the reporting threshold of \u003cTWO_\u003e lakh in nominal value agrawals decision to invest in dfpcl comes amid consistent gains in the stock in \u003cTWO_THOUSAND\u003e the stock has surged \u003cFOUR_TEN_PERCENT\u003e year to date ytd building on its impressive performance over the last year where it saw a near \u003cFIVE_TEN_PERCENT\u003e increase in value this rise has been driven by the companys expansion strategies robust fundamentals and the overall positive sentiment surrounding indias agricultural and chemical sectors agrawal is not the only one who showed interest in deepak fertilisers domestic institutional investors including banks mutual funds non banking financial companies nbfcs insurance companies and venture capital funds also ramped up their holdings in the company at the end of q2fy25 these institutions collectively owned a \u003cONE_TEN_PERCENT\u003e stake or \u003cONE_\u003e crore shares up significantly from \u003cSIX_PERCENT\u003e \u003cSEVEN_TEN\u003e lakh shares in the previous june quarter this rise in institutional ownership reflects the growing confidence in the companys ability to deliver long term growth meanwhile foreign institutional investors fiis who had a \u003cNINE_PERCENT\u003e stake in the june quarter slightly reduced their holdings to \u003cNINE_PERCENT\u003e \u003cONE_\u003e crore shares in q2fy25 despite this minor decline the continued presence of fiis highlights the global interest in the companys growth prospects particularly in the indian fertiliser and chemicals market which has been bolstered by government initiatives and rising demand for sustainable agricultural solutions deepak fertilisers has been on a remarkable bull run over the past year with the stock appreciating by nearly \u003cFIVE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e alone the stock has gained \u003cFOUR_TEN_PERCENT\u003e ytd demonstrating consistent monthly gains after four straight months of positive performance the stock climbed another \u003cSEVEN_PERCENT\u003e in october the stock rose by \u003cTWO_PERCENT\u003e in september \u003cONE_TEN_PERCENT\u003e in august \u003cTHREE_TEN_PERCENT\u003e in july and \u003cTWO_TEN_PERCENT\u003e in june highlighting a strong growth trajectory however prior to this bullish streak the stock experienced a dip of \u003cSIX_PERCENT\u003e in may following a \u003cTWO_TEN_PERCENT\u003e rally in april the first three months of the year saw a decline with the stock falling \u003cZERO_PERCENT\u003e in march \u003cONE_TEN_PERCENT\u003e in february and \u003cNINE_PERCENT\u003e in january currently the stock is trading around \u003cONE_TEN_PERCENT\u003e below its peak of \u003cONE_THOUSAND\u003e which it touched in early october despite this slight pullback the stock has surged by \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cFOUR_HUNDRED\u003e recorded in march \u003cTWO_THOUSAND\u003e the stock s strong upward trend reflects growing investor confidence in deepak fertilisers which continues to strengthen its position in the fertiliser and chemicals market despite the stock s stellar performance over the last year some concerns have emerged regarding its financial health and growth outlook marketsmojo downgraded the stock to hold from buy on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the downgrade came despite the company demonstrating high management efficiency with a return on capital employed roce of \u003cONE_TEN_PERCENT\u003e and a strong annual operating profit growth rate of \u003cTHREE_TEN_PERCENT\u003e one of the key reasons behind the downgrade is the company s declining profitability despite generating a solid return of \u003cFIVE_TEN_PERCENT\u003e over the past year deepak fertilisers profits have fallen by \u003cFOUR_TEN_PERCENT\u003e this decline in profitability has raised red flags especially considering the companys high debt to ebitda ratio of \u003cTWO_\u003e times such a high ratio could indicate potential challenges in managing debt levels and may impact the companys financial stability in the long term the brokerage said additionally in its latest financial results for the june \u003cTWO_THOUSAND\u003e quarter the company reported flat performance with net sales declining by \u003cTWO_TEN_PERCENT\u003e and profit after tax pat falling by \u003cTWO_TEN_PERCENT\u003e this underwhelming performance coupled with a \u003cTHREE_TEN_PERCENT\u003e increase in interest expenses has contributed to the cautious outlook from brokerages like marketsmojo despite the recent downgrade deepak fertilisers petrochemicals corp remains a key player in the indian fertiliser market which is expected to grow significantly in the coming years as per the brokerage the company s strategic expansion into petrochemicals and focus on improving operational efficiency positions it well to capitalise on future growth opportunities","timestamp":"2024-10-22T11:53:00+05:30","market_timestamp":"2024-10-22T11:53:00+05:30","off_market_hours":false}