{"url":"https://www.livemint.com/market/stock-market-news/chinas-stimulus-can-it-trigger-more-foreign-capital-outflows-from-india-experts-weigh-in-11729509666189.html","title":"China’s stimulus: Can it trigger more foreign capital outflows from India? Experts weigh in","description":"The Indian stock market faces foreign capital outflows as investors shift focus to China's new stimulus package. While this trend may be temporary due to China's structural issues, India's long-term economic stability continues to attract global investment interest.","content":"The Indian stock market is seeing increased foreign capital outflows as the 'sell India, buy China' strategy gains momentum. China’s latest stimulus package, unveiled in September and October, includes reductions in reserve requirements, mortgage rate cuts, and liquidity injections. It is aimed at boosting overall economic growth and has drawn substantial investor interest due to the country's attractive market valuations.NSDL data shows that foreign portfolio investors (FPIs) have sold Indian equities worth  ₹82,845 crore so far in October (till October 21).However, experts believe this trend may be short-lived, as many of China's economic challenges are structural, and the government's ability to provide further stimulus is constrained by its high debt-to-GDP ratio.\"The FPI selling can continue for some more time. However, this is unlikely to sustain for long. This enthusiasm for Chinese revival is unlikely to last long because China has some structural problems. Even their fiscal stimulus is unlikely to continue beyond a point because the debt-to-GDP ratio is high and the government does not have money to stimulate the economy beyond the point,\" said V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.China's central bank announced its largest stimulus since the pandemic on September 24, boosting the economy and bringing it closer to the government's growth target.On October 21, China cut its benchmark lending rates again. The one-year loan prime rate (LPR) was reduced by 25 basis points (bps) to 3.10 per cent from 3.35 per cent, while 25 bps also cut the five-year LPR to 3.60 per cent from 3.85 per cent previously. The People’s Bank of China (PBOC) last cut both rates in July and are sitting at historic lows.China's stimulus package to revive its economic growth attracted much attention among investors, especially as Chinese stocks rallied sharply in the last few weeks, outperforming global markets.Sharp gains in the Indian stock market shot up its valuation. There has been a widening gap in the valuation between China and India. Some investors have moved quickly to take advantage after China announced the stimulus package.However, the trend may not continue for long as the Indian economy remains in solid shape and the medium to long-term outlook of the Indian stock market remains robust.Shruti Jain, Chief Strategy Officer (CSO) at Arihant Capital Markets, underscored that India is a long-term story that is much more stable and predictable regarding government policies and corporate earnings.Moreover, revived interest by global funds in China will put emerging markets back in the spotlight. This will benefit India, as it will lead to increased portfolio allocations from global funds, with India being a top choice.Jain believes the revival of the Chinese economy through this stimulus, especially the housing and infrastructure sector, will also bode well for Indian companies. The stimulus could boost domestic steel demand in China, easing the pressure of Chinese steel exports on global markets. In some instances, we might even see increased imports by China from India.\"While the stimulus announcement led to short-term gyrations, at this point in time, it should not have any significant impact on the Indian markets. We believe India is a good investment destination for domestic and global investors,\" said Jain.Narinder Wadhwa, Managing Director of SKI Capital, also said that the Chinese market's attractiveness might not last indefinitely.\"While China benefits from the stimulus, deep-rooted structural problems persist in its economy, such as real estate debt. India remains a more attractive long-term investment destination, especially due to its robust economic fundamentals,\" said Wadhwa.\"The revival of the Chinese market could also indirectly benefit India by reducing the dumping of Chinese goods like steel, which has hurt Indian manufacturers. While China’s stimulus may prompt short-term FPI outflows from India, India’s long-term growth prospects and position in the emerging market basket could continue attracting foreign investments,\" Wadhwa said.Amit Goel, co-founder and chief global strategist at Pace 360, said while China’s stimulus might temporarily enhance its attractiveness, India’s long-term growth story still holds significant appeal. Investors may weigh these factors before making decisions.Read all market-related news here","cleaned_content":"the indian stock market is seeing increased foreign capital outflows as the sell india buy china strategy gains momentum china s latest stimulus package unveiled in september and october includes reductions in reserve requirements mortgage rate cuts and liquidity injections it is aimed at boosting overall economic growth and has drawn substantial investor interest due to the countrys attractive market valuations nsdl data shows that foreign portfolio investors fpis have sold indian equities worth \u003cEIGHT_TEN_THOUSAND\u003e crore so far in october till october \u003cTWO_TEN\u003e however experts believe this trend may be short lived as many of chinas economic challenges are structural and the governments ability to provide further stimulus is constrained by its high debt to gdp ratio the fpi selling can continue for some more time however this is unlikely to sustain for long this enthusiasm for chinese revival is unlikely to last long because china has some structural problems even their fiscal stimulus is unlikely to continue beyond a point because the debt to gdp ratio is high and the government does not have money to stimulate the economy beyond the point said v k vijayakumar chief investment strategist geojit financial services chinas central bank announced its largest stimulus since the pandemic on september \u003cTWO_TEN\u003e boosting the economy and bringing it closer to the governments growth target on october \u003cTWO_TEN\u003e china cut its benchmark lending rates again the one year loan prime rate lpr was reduced by \u003cTWO_TEN\u003e basis points bps to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e while \u003cTWO_TEN\u003e bps also cut the five year lpr to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e previously the people s bank of china pboc last cut both rates in july and are sitting at historic lows chinas stimulus package to revive its economic growth attracted much attention among investors especially as chinese stocks rallied sharply in the last few weeks outperforming global markets sharp gains in the indian stock market shot up its valuation there has been a widening gap in the valuation between china and india some investors have moved quickly to take advantage after china announced the stimulus package however the trend may not continue for long as the indian economy remains in solid shape and the medium to long term outlook of the indian stock market remains robust shruti jain chief strategy officer cso at arihant capital markets underscored that india is a long term story that is much more stable and predictable regarding government policies and corporate earnings moreover revived interest by global funds in china will put emerging markets back in the spotlight this will benefit india as it will lead to increased portfolio allocations from global funds with india being a top choice jain believes the revival of the chinese economy through this stimulus especially the housing and infrastructure sector will also bode well for indian companies the stimulus could boost domestic steel demand in china easing the pressure of chinese steel exports on global markets in some instances we might even see increased imports by china from india while the stimulus announcement led to short term gyrations at this point in time it should not have any significant impact on the indian markets we believe india is a good investment destination for domestic and global investors said jain narinder wadhwa managing director of ski capital also said that the chinese markets attractiveness might not last indefinitely while china benefits from the stimulus deep rooted structural problems persist in its economy such as real estate debt india remains a more attractive long term investment destination especially due to its robust economic fundamentals said wadhwa the revival of the chinese market could also indirectly benefit india by reducing the dumping of chinese goods like steel which has hurt indian manufacturers while china s stimulus may prompt short term fpi outflows from india india s long term growth prospects and position in the emerging market basket could continue attracting foreign investments wadhwa said amit goel co founder and chief global strategist at pace \u003cTHREE_HUNDRED\u003e said while china s stimulus might temporarily enhance its attractiveness india s long term growth story still holds significant appeal investors may weigh these factors before making decisions read all market related news here","timestamp":"2024-10-21T17:38:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}