{"url":"https://www.livemint.com/market/stock-market-news/outlook-for-invits-in-cy25-stable-says-capitalmind-research-llp-indigrid-invit-top-pick-11729578499891.html","title":"Outlook for InvITs in CY25 stable, says Capitalmind Research LLP; IndiGrid InvIT top pick","description":"The outlook for InvITs in 2025 is stable, driven by infrastructure development and supportive regulations, according to Capitalmind Research LLP. However, rising interest rates may hinder growth, particularly for InvITs with limited assets.","content":"According to a recent study by Capitalmind Research LLP, the outlook for Infrastructure Investment Trusts (InvITs) appears stable in the calendar year 2025. This is primarily driven by increasing infrastructure development in India and favourable regulatory support. The report emphasised that power transmission and road infrastructure would remain key sectors for growth, with public sector sponsorship playing a pivotal role in enhancing the credibility and performance of certain InvITs.The InvIT market in India has experienced steady growth in recent years, with major players like Powergrid InvIT and IndiGrid InvIT leading the sector. These investment vehicles provide a unique combination of stable cash flows and growth potential, as they invest in completed infrastructure assets, reducing the risks typically associated with new project development.However, the report from Capitalmind Research LLP cautioned that rising interest rates could pose a challenge for InvITs in the coming year. Higher interest rates could increase borrowing costs, making debt-financed acquisitions less attractive and potentially slowing growth in 2025. The report particularly pointed out that InvITs with limited pipelines for new assets, such as IRB InvIT, might face reduced momentum due to this challenge.Speaking about the future of InvITs, Krishna Appala, Senior Research Analyst at Capitalmind Research LLP, noted, “Tax and policy changes, especially concerning foreign investments, could have a significant impact on InvITs. Those that rely heavily on toll collections or pooled payments may also face risks from economic fluctuations or changes in policy. Effectively managing leverage and securing low-cost debt will be crucial for the growth of InvITs, particularly in a rising interest rate environment. Monitoring these factors will be essential for understanding the trajectory of InvITs in 2025.”Capitalmind Research LLP provided several key recommendations for investors looking to capitalise on the opportunities presented by InvITs. First and foremost, the report suggested that investors should focus on InvITs backed by strong sponsors, as these entities are more likely to deliver consistent cash flows and make strategic asset acquisitions. The backing of credible sponsors provides a layer of security, especially in volatile market conditions.Additionally, the research firm recommended diversification across different types of InvITs, particularly those focused on power and road infrastructure. This strategy would help mitigate sector-specific risks, ensuring that investors are not overly exposed to any single segment of the infrastructure market.Appala further emphasised the importance of keeping a close watch on interest rates, as InvITs are highly sensitive to fluctuations in borrowing costs. \"Changes in the Reserve Bank of India's (RBI) monetary policy could significantly impact the cost of debt for InvITs, making it essential for investors to monitor interest rates closely,\" he said. \"Additionally, investors should look for InvITs with long concession periods—like IndiGrid InvIT’s 26-year tenure—as this can provide more predictable and stable cash flows over time.\"Capitalmind Research LLP's report highlighted government initiatives such as Gati Shakti and the National Infrastructure Pipeline (NIP), which are set to boost demand for InvIT investments, particularly in large-scale infrastructure projects. The report also underscored the importance of public sector-sponsored InvITs, which are expected to benefit from asset monetisation plans. These plans would enable InvITs to make further acquisitions and strengthen their portfolios.The research identified power transmission InvITs, including IndiGrid and PowerGrid InvIT (PGInvIT), as having the most favourable growth prospects. These InvITs are supported by long-term contracts that ensure stable revenue streams, making them attractive options for investors seeking stable and predictable returns.On the other hand, the report was less optimistic about certain InvITs like IRB InvIT and Bharat Highways InvIT, due to their shorter concession periods—15 years and 11.5 years, respectively—and limited immediate acquisition opportunities. These factors make them less appealing for investors looking for long-term growth.IndiGrid, in particular, stood out in the report, with a 33 per cent compound annual growth rate (CAGR) in Net Distribution Cash Flow between FY20 and FY24. Additionally, IndiGrid has the lowest cost of debt in the sector, at 7.74 per cent, making it an attractive choice for investors seeking both capital appreciation and stable cash flows.For growth-oriented investors, IndiGrid InvIT presents a compelling case. The company's strong revenue growth, increasing distribution per unit (DPU), and pipeline of upcoming projects position it well for future success. Despite its relatively high levels of debt, IndiGrid's low cost of borrowing helps mitigate risk, making it a solid choice for both capital appreciation and stable, long-term cash flows.In conclusion, the outlook for InvITs in 2025 remains stable, driven by infrastructure development, favourable government policies, and robust demand for infrastructure assets. Investors, however, should remain mindful of interest rate fluctuations, policy changes, and the specific growth prospects of individual InvITs. By focusing on InvITs with strong sponsors, long concession periods, and low-cost debt, investors can navigate the potential challenges and capitalise on the growth opportunities that lie ahead.","cleaned_content":"according to a recent study by capitalmind research llp the outlook for infrastructure investment trusts invits appears stable in the calendar year \u003cTWO_THOUSAND\u003e this is primarily driven by increasing infrastructure development in india and favourable regulatory support the report emphasised that power transmission and road infrastructure would remain key sectors for growth with public sector sponsorship playing a pivotal role in enhancing the credibility and performance of certain invits the invit market in india has experienced steady growth in recent years with major players like powergrid invit and indigrid invit leading the sector these investment vehicles provide a unique combination of stable cash flows and growth potential as they invest in completed infrastructure assets reducing the risks typically associated with new project development however the report from capitalmind research llp cautioned that rising interest rates could pose a challenge for invits in the coming year higher interest rates could increase borrowing costs making debt financed acquisitions less attractive and potentially slowing growth in \u003cTWO_THOUSAND\u003e the report particularly pointed out that invits with limited pipelines for new assets such as irb invit might face reduced momentum due to this challenge speaking about the future of invits krishna appala senior research analyst at capitalmind research llp noted tax and policy changes especially concerning foreign investments could have a significant impact on invits those that rely heavily on toll collections or pooled payments may also face risks from economic fluctuations or changes in policy effectively managing leverage and securing low cost debt will be crucial for the growth of invits particularly in a rising interest rate environment monitoring these factors will be essential for understanding the trajectory of invits in \u003cTWO_THOUSAND\u003e capitalmind research llp provided several key recommendations for investors looking to capitalise on the opportunities presented by invits first and foremost the report suggested that investors should focus on invits backed by strong sponsors as these entities are more likely to deliver consistent cash flows and make strategic asset acquisitions the backing of credible sponsors provides a layer of security especially in volatile market conditions additionally the research firm recommended diversification across different types of invits particularly those focused on power and road infrastructure this strategy would help mitigate sector specific risks ensuring that investors are not overly exposed to any single segment of the infrastructure market appala further emphasised the importance of keeping a close watch on interest rates as invits are highly sensitive to fluctuations in borrowing costs changes in the reserve bank of indias rbi monetary policy could significantly impact the cost of debt for invits making it essential for investors to monitor interest rates closely he said additionally investors should look for invits with long concession periods like indigrid invit s \u003cTWO_TEN\u003e year tenure as this can provide more predictable and stable cash flows over time capitalmind research llps report highlighted government initiatives such as gati shakti and the national infrastructure pipeline nip which are set to boost demand for invit investments particularly in large scale infrastructure projects the report also underscored the importance of public sector sponsored invits which are expected to benefit from asset monetisation plans these plans would enable invits to make further acquisitions and strengthen their portfolios the research identified power transmission invits including indigrid and powergrid invit pginvit as having the most favourable growth prospects these invits are supported by long term contracts that ensure stable revenue streams making them attractive options for investors seeking stable and predictable returns on the other hand the report was less optimistic about certain invits like irb invit and bharat highways invit due to their shorter concession periods \u003cONE_TEN\u003e years and \u003cONE_TEN\u003e years respectively and limited immediate acquisition opportunities these factors make them less appealing for investors looking for long term growth indigrid in particular stood out in the report with a \u003cTHREE_TEN_PERCENT\u003e compound annual growth rate cagr in net distribution cash flow between fy20 and fy24 additionally indigrid has the lowest cost of debt in the sector at \u003cSEVEN_PERCENT\u003e making it an attractive choice for investors seeking both capital appreciation and stable cash flows for growth oriented investors indigrid invit presents a compelling case the companys strong revenue growth increasing distribution per unit dpu and pipeline of upcoming projects position it well for future success despite its relatively high levels of debt indigrids low cost of borrowing helps mitigate risk making it a solid choice for both capital appreciation and stable long term cash flows in conclusion the outlook for invits in \u003cTWO_THOUSAND\u003e remains stable driven by infrastructure development favourable government policies and robust demand for infrastructure assets investors however should remain mindful of interest rate fluctuations policy changes and the specific growth prospects of individual invits by focusing on invits with strong sponsors long concession periods and low cost debt investors can navigate the potential challenges and capitalise on the growth opportunities that lie ahead","timestamp":"2024-10-22T12:40:00+05:30","market_timestamp":"2024-10-22T12:40:00+05:30","off_market_hours":false}