{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-17-11729129682722.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 17","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a muted start for the Indian benchmark index. The Gift Nifty was trading around 25,025 level, a discount of nearly 10 points from the Nifty futures’ previous close.","content":"Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open on a tepid note on Thursday amid mixed global market cues.The trends on Gift Nifty also indicate a muted start for the Indian benchmark index. The Gift Nifty was trading around 25,025 level, a discount of nearly 10 points from the Nifty futures’ previous close.On Wednesday, the domestic equity market indices ended lower for the second consecutive session amid weak global cues.The Sensex declined 318.76 points to close at 81,501.36, while the Nifty 50 settled 86.05 points, or 0.34%, lower at 24,971.30.Nifty 50 formed a small negative candle on the daily chart with minor upper shadow.“Technically this pattern reflects ongoing range bound action in the market and the Nifty 50 is currently placed near the lower range around 24,900 levels. After sustaining above the daily 10/20 period EMA (Exponential Moving Average) in the last couple of months, the said moving average supports have been broken on the downside recently and they (10 \u0026 20 period EMA) are now acting as a hurdle as per the concept of change in polarity around 25,150 - 25,200 levels,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to him, the underlying trend of Nifty 50 continues to be choppy with weak bias and a sustainable move only above 25,200 and a sharp weakness below 24,800 - 24,700 could bring strong momentum in the market on either side.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 continued weakness with range bound action continued on October 16 and closed the day lower by 86 points.“Nifty 50 is consolidating in a narrow 350-point range of 24,900 - 25,250 levels. A break above 25,250 or a break below 24,900 can trigger a further move towards 25,500 or 24,300 levels, respectively. The momentum indicators have shifted towards the overbought region, indicating a possible fall from present levels. The ADX DI- line is trending upside with yesterday’s fall, also suggesting a possible momentum on the downside,” said Dr. Praveen Dwarakanath, Vice President of Hedged.in.He noted that options writer's data for today’s expiry showed increased call writing above 25,000 levels, indicating the expiry below this level.Aditya Agarwal, Head of Derivatives \u0026 Technical Analysis at Sanctum Wealth believes on the lower side, the Nifty 50 index will find immediate support around 24,900 levels and a dip towards those levels can be used as a buying opportunity.“Few large cap beaten down stocks provided much needed support to index and have shown the first sign of reversal that can help index to move towards 25,140 / 25,260 levels,” Agarwal said.According to VLA Ambala, Co-Founder of Stock Market Today, in Wednesday’s session, the market entered an overbought zone following a steep downward movement. This development led to profit bookings and fresh investments. Currently, both Nifty and Sensex have corrected nearly 5% but still have room for further downward movement.“Nifty 50 index has fallen below the 20 and 50-day EMAs, forming a strong High Wave Doji candlestick pattern on the daily chart. However, the Nifty index is likely to find support at 24,810 and 24,670, with resistance around 25,080 and 25,195,” Ambala said.Bank Nifty index dropped 104.95 points, 0.2%, to close at 51,801.05 on Wednesday, forming a small bullish candle with an upper shadow on the daily charts.“Bank Nifty failed to sustain above its resistance level of 52,000 and saw minor profit booking from those levels. Short term structure for Bank Nifty looks positive and correction towards 51,600 / 51,400 can be used to initiate long positions. On the higher side, the index will find resistance around 52,000 and above that can move towards 52,600 levels in the short term,” said Aditya Agarwal.According to Dr. Praveen Dwarakanath, Bank Nifty index is getting rejected from the upper Keltner channel, indicating weakness in the index at the present levels.“The momentum indicators have moved to overbought levels, indicating a likely fall to its immediate support at 51,200 levels. Options writer's data showed increased writing in calls and puts at 52,000 levels, indicating a pause at these levels. However, more call writing is suggesting a momentum towards the downside in the index,” said Dwarakanath.","cleaned_content":"indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a tepid note on thursday amid mixed global market cues the trends on gift nifty also indicate a muted start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cONE_TEN\u003e points from the nifty futures previous close on wednesday the domestic equity market indices ended lower for the second consecutive session amid weak global cues the sensex declined \u003cTHREE_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cEIGHT_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart with minor upper shadow technically this pattern reflects ongoing range bound action in the market and the nifty \u003cFIVE_TEN\u003e is currently placed near the lower range around \u003cTWO_TEN_THOUSAND\u003e levels after sustaining above the daily \u003cONE_TEN\u003e \u003cTWO_TEN\u003e period ema exponential moving average in the last couple of months the said moving average supports have been broken on the downside recently and they \u003cONE_TEN\u003e \u003cTWO_TEN\u003e period ema are now acting as a hurdle as per the concept of change in polarity around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels said nagaraj shetti senior technical research analyst at hdfc securities according to him the underlying trend of nifty \u003cFIVE_TEN\u003e continues to be choppy with weak bias and a sustainable move only above \u003cTWO_TEN_THOUSAND\u003e and a sharp weakness below \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e could bring strong momentum in the market on either side here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e continued weakness with range bound action continued on october \u003cONE_TEN\u003e and closed the day lower by \u003cEIGHT_TEN\u003e points nifty \u003cFIVE_TEN\u003e is consolidating in a narrow \u003cTHREE_HUNDRED\u003e point range of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels a break above \u003cTWO_TEN_THOUSAND\u003e or a break below \u003cTWO_TEN_THOUSAND\u003e can trigger a further move towards \u003cTWO_TEN_THOUSAND\u003e or \u003cTWO_TEN_THOUSAND\u003e levels respectively the momentum indicators have shifted towards the overbought region indicating a possible fall from present levels the adx di line is trending upside with yesterday s fall also suggesting a possible momentum on the downside said dr praveen dwarakanath vice president of hedged in he noted that options writers data for today s expiry showed increased call writing above \u003cTWO_TEN_THOUSAND\u003e levels indicating the expiry below this level aditya agarwal head of derivatives technical analysis at sanctum wealth believes on the lower side the nifty \u003cFIVE_TEN\u003e index will find immediate support around \u003cTWO_TEN_THOUSAND\u003e levels and a dip towards those levels can be used as a buying opportunity few large cap beaten down stocks provided much needed support to index and have shown the first sign of reversal that can help index to move towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels agarwal said according to vla ambala co founder of stock market today in wednesday s session the market entered an overbought zone following a steep downward movement this development led to profit bookings and fresh investments currently both nifty and sensex have corrected nearly \u003cFIVE_PERCENT\u003e but still have room for further downward movement nifty \u003cFIVE_TEN\u003e index has fallen below the \u003cTWO_TEN\u003e and \u003cFIVE_TEN\u003e day emas forming a strong high wave doji candlestick pattern on the daily chart however the nifty index is likely to find support at \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with resistance around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e ambala said bank nifty index dropped \u003cONE_HUNDRED\u003e points \u003cZERO_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on wednesday forming a small bullish candle with an upper shadow on the daily charts bank nifty failed to sustain above its resistance level of \u003cFIVE_TEN_THOUSAND\u003e and saw minor profit booking from those levels short term structure for bank nifty looks positive and correction towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e can be used to initiate long positions on the higher side the index will find resistance around \u003cFIVE_TEN_THOUSAND\u003e and above that can move towards \u003cFIVE_TEN_THOUSAND\u003e levels in the short term said aditya agarwal according to dr praveen dwarakanath bank nifty index is getting rejected from the upper keltner channel indicating weakness in the index at the present levels the momentum indicators have moved to overbought levels indicating a likely fall to its immediate support at \u003cFIVE_TEN_THOUSAND\u003e levels options writers data showed increased writing in calls and puts at \u003cFIVE_TEN_THOUSAND\u003e levels indicating a pause at these levels however more call writing is suggesting a momentum towards the downside in the index said dwarakanath","timestamp":"2024-10-17T07:28:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}