{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-to-give-80-variable-pay-to-employees-for-september-quarter/articleshow/105268564.cms","title":"Infosys to give 80% variable pay to employees for September quarter","description":"Employees at position level 6 (PL6-manager) and below band – meaning those below manager category barring entry level – are set to receive the variable pay. While the average payout would be at 80%, individual payout will differ based on their performance and contribution for the quarter, as per an official communication by the engineering team HR head at Infosys.","content":"Infosys will hand out the quarterly performance bonus for the July-September period to eligible employees at an average of 80% payout this month.Employees at position level 6 (PL6-manager) and below band – meaning those below manager category barring entry level – are set to receive the variable pay. While the average payout would be at 80%, individual payout will differ based on their performance and contribution for the quarter, as per an official communication by the engineering team HR head at Infosys.ET has seen the internal communication.“This is to keep you all informed that the quarterly performance bonus payout for Q2FY2024 will happen in November 2023 payroll for all eligible employees,” it said.Unit delivery managers will finalise the distribution of the payout for their respective units and inform the eligible employees this week, it said.","cleaned_content":"infosys will hand out the quarterly performance bonus for the july september period to eligible employees at an average of \u003cEIGHT_TEN_PERCENT\u003e payout this month employees at position level \u003cSIX_\u003e pl6 manager and below band meaning those below manager category barring entry level are set to receive the variable pay while the average payout would be at \u003cEIGHT_TEN_PERCENT\u003e individual payout will differ based on their performance and contribution for the quarter as per an official communication by the engineering team hr head at infosys et has seen the internal communication this is to keep you all informed that the quarterly performance bonus payout for q2fy2024 will happen in november \u003cTWO_THOUSAND\u003e payroll for all eligible employees it said unit delivery managers will finalise the distribution of the payout for their respective units and inform the eligible employees this week it said","timestamp":"2023-11-16T23:00:00+05:30","market_timestamp":"2023-11-17T09:15:00+05:30","off_market_hours":true}