{"url":"https://economictimes.indiatimes.com/tech/information-tech/indias-tech-outsourcing-to-embrace-30-global-share-by-2030/articleshow/105215185.cms","title":"30% IT revenues may be from non-Europe, non-US markets by 2030","description":"According to data from technology research firm UnearthInsight, the US and Europe currently contribute 75-80% of the global IT services market while the rest 20-25% is spread across 70-80 countries. This share is likely to increase to 30% by fiscal 2030 said Gaurav Vasu, founder and chief executive at UnearthInsight.","content":"A hitherto dominant Anglo-American voice in India’s $245-billion technology outsourcing industry is soon expected to acquire a more cosmopolitan accent as the rest of the world’s business share climbs to 30% by the end of this decade, up from 20-25% now.Japan, Australia and the Middle East and the home market, among others, will largely help alter the geographic mix. To be sure, average contract values in these geographies will still be relative stragglers in comparison with those finalised by Anglophone clients either side of the Atlantic.According to data from technology research firm UnearthInsight, the US and Europe currently contribute 75-80% of the global IT services market while the rest 20-25% is spread across 70-80 countries. This share is likely to increase to 30% by fiscal 2030 said Gaurav Vasu, founder and chief executive at UnearthInsight. Both TCS and Infosys have increased revenues from the rest of the world (markets outside US and Europe). While TCS drew revenues of $1.22 billion at the end of second quarter this year up from $1.14 billion at the end of Q2 last fiscal, in the case of Infosys it increased from $564 million to $585 million in the same period. Omdia's IT Services Contracts Database also said that a majority of upcoming large contract (over $500 million) renewals in the next year are centred in the US, Europe (including the UK, France, Spain, and Germany), India, and Japan.","cleaned_content":"a hitherto dominant anglo american voice in india s \u003cTWO_HUNDRED\u003e billion technology outsourcing industry is soon expected to acquire a more cosmopolitan accent as the rest of the world s business share climbs to \u003cTHREE_TEN_PERCENT\u003e by the end of this decade up from \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e now japan australia and the middle east and the home market among others will largely help alter the geographic mix to be sure average contract values in these geographies will still be relative stragglers in comparison with those finalised by anglophone clients either side of the atlantic according to data from technology research firm unearthinsight the us and europe currently contribute \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN_PERCENT\u003e of the global it services market while the rest \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e is spread across \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e countries this share is likely to increase to \u003cTHREE_TEN_PERCENT\u003e by fiscal \u003cTWO_THOUSAND\u003e said gaurav vasu founder and chief executive at unearthinsight both tcs and infosys have increased revenues from the rest of the world markets outside us and europe while tcs drew revenues of \u003cONE_\u003e billion at the end of second quarter this year up from \u003cONE_\u003e billion at the end of q2 last fiscal in the case of infosys it increased from \u003cFIVE_HUNDRED\u003e million to \u003cFIVE_HUNDRED\u003e million in the same period omdias it services contracts database also said that a majority of upcoming large contract over \u003cFIVE_HUNDRED\u003e million renewals in the next year are centred in the us europe including the uk france spain and germany india and japan","timestamp":"2023-11-15T08:50:00+05:30","market_timestamp":"2023-11-15T09:15:00+05:30","off_market_hours":true}