{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-it-stare-at-bleak-holiday-quarter-on-grim-outlook/articleshow/105269684.cms","title":"Indian IT firms stare at bleak holiday quarter on grim outlook","description":"Over the past two weeks, the likes of Microsoft, Alphabet, Amazon and even Meta, Apple and Tesla have indicated a weakening demand environment that could last at least two quarters. Even Microsoft gave a cautious outlook despite strong performance.","content":"There are dark clouds in the horizon for India’s top outsourcing companies. The holiday quarter outlook by the likes of Amazon, Google and Microsoft is far from celebratory. And there’s no reason to believe the prospects will be significantly better for the Mumbai-listed services biggies as FY25 global spending budgets take a final shape.Over the past two weeks, the likes of Microsoft, Alphabet, Amazon and even Meta, Apple and Tesla have indicated a weakening demand environment that could last at least two quarters. Even Microsoft gave a cautious outlook despite strong performance.Migration to cloud has been at the vanguard of growth the past three years, but its pace has slowed considerably and is unlikely to return at the level it was post covid. As system integrators, the likes of TCS, Infosys and HCLTech get almost a fifth of their new business from the cloud services majors.Also read | Stars of Indian IT companies dim amid challenging demand situation“Much of the growth the industry has experienced over the last three years has been the migration to cloud and this modernization phenomena has slowed considerably and is unlikely to return at the level it was post-Covid,” said Peter Bendor Samuel, chief executive, Everest Group.","cleaned_content":"there are dark clouds in the horizon for india s top outsourcing companies the holiday quarter outlook by the likes of amazon google and microsoft is far from celebratory and there s no reason to believe the prospects will be significantly better for the mumbai listed services biggies as fy25 global spending budgets take a final shape over the past two weeks the likes of microsoft alphabet amazon and even meta apple and tesla have indicated a weakening demand environment that could last at least two quarters even microsoft gave a cautious outlook despite strong performance migration to cloud has been at the vanguard of growth the past three years but its pace has slowed considerably and is unlikely to return at the level it was post covid as system integrators the likes of tcs infosys and hcltech get almost a fifth of their new business from the cloud services majors also read stars of indian it companies dim amid challenging demand situation much of the growth the industry has experienced over the last three years has been the migration to cloud and this modernization phenomena has slowed considerably and is unlikely to return at the level it was post covid said peter bendor samuel chief executive everest group","timestamp":"2023-11-17T11:54:00+05:30","market_timestamp":"2023-11-17T11:54:00+05:30","off_market_hours":false}