{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-forcing-employees-to-transfer-to-different-base-locations-nites/articleshow/105237886.cms","title":"TCS forcing employees to transfer to different base locations: NITES","description":"NITES alleged that TCS has initiated transfers of employees to different base locations without consulting the employees. The affected employees are required to relocate to the new location within 14 days or stand to have their salaries deducted. ET has reviewed a copy of the letter.","content":"The Nascent Information Technology Employees Senate (NITES), an IT sector employee rights organisation, has filed a complaint with the labour ministry against Tata Consultancy Services alleging that the IT major is forcefully transferring over 2,000 employees. NITES alleged that TCS has initiated transfers of employees to different base locations without consulting the employees. The affected employees are required to relocate to the new location within 14 days or stand to have their salaries deducted. ET has reviewed a copy of the letter.“We believe that TCS’s actions are unethical and in violation of labor laws. The company has not provided a valid reason for the transfers, and it has not given employees a fair opportunity to provide alternative solutions,” said the complaint, seen by ET. This comes at a time when the IT services sector, led by TCS, is urging employees to return to offices on all days of the week. TCS response on the allegations are awaited. TCS has been sending emails to employees, informing them about their transfer to Mumbai among other locations, NITES wrote in a complaint to the ministry. The emails state the transfers are necessary due to business requirements. However, no specific details are provided. Employees are required to report to the new location within two weeks, and will be reimbursed later, according to the emails seen by ET. ","cleaned_content":"the nascent information technology employees senate nites an it sector employee rights organisation has filed a complaint with the labour ministry against tata consultancy services alleging that the it major is forcefully transferring over \u003cTWO_THOUSAND\u003e employees nites alleged that tcs has initiated transfers of employees to different base locations without consulting the employees the affected employees are required to relocate to the new location within \u003cONE_TEN\u003e days or stand to have their salaries deducted et has reviewed a copy of the letter we believe that tcs s actions are unethical and in violation of labor laws the company has not provided a valid reason for the transfers and it has not given employees a fair opportunity to provide alternative solutions said the complaint seen by et this comes at a time when the it services sector led by tcs is urging employees to return to offices on all days of the week tcs response on the allegations are awaited tcs has been sending emails to employees informing them about their transfer to mumbai among other locations nites wrote in a complaint to the ministry the emails state the transfers are necessary due to business requirements however no specific details are provided employees are required to report to the new location within two weeks and will be reimbursed later according to the emails seen by et","timestamp":"2023-11-15T18:07:00+05:30","market_timestamp":"2023-11-16T09:15:00+05:30","off_market_hours":true}