{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-faces-210-million-penalty-in-dxc-lawsuit/articleshow/105527977.cms","title":"TCS faces $210 million penalty in DXC lawsuit","description":"“TCS respectfully disagrees with the jury’s advisory verdict. The matter will now be decided by the Court, which has ordered further briefing from the parties,” a company spokesperson said.","content":"A jury in Dallas, Texas federal court has found Tata Consultancy Services (TCS) guilty of stealing DXC Technology’s trade secrets which is likely to land a $210 million penalty on the Indian software major. This comes as last week TCS announced a $125 million provision during Q3 after it lost a lawsuit and claim from Epic Systems. TCS has refuted the allegations. “TCS respectfully disagrees with the jury’s advisory verdict. The matter will now be decided by the Court, which has ordered further briefing from the parties. We plan to continue to litigate this ongoing case. We will have no further comment as the case remains pending,” said a company spokesperson.In 2019, DXC predecessor Computer Sciences Corp filed a lawsuit against TCS claiming that it licensed its software to Transamerica subsidiary Money Services Inc. TCS had won a $2 billion deal from Transamerica in 2018. The lawsuit alleged that Tata rebadged 2,200 Transamerica employees in 2018 and used their access to CSC's software to gain knowledge of its source code and other proprietary information to build a competing life insurance platform. The lawsuit stated that TCS’ deal was for third-party administration and not for accessing the source code of its proprietary systems, which were later used to improve the TCS BaNCS software. The jury found in a verdict, last week, that the Tata Group subsidiary misused confidential information about DXC's Vantage-One and CyberLife software for managing life insurance and annuity policies to create a competing platform. It advised that TCS owed DXC $70 million for misappropriating its trade secrets and an additional $140 million because its misuse was \"willful and malicious.\"Also read | Stars of Indian IT companies dim amid challenging demand situation","cleaned_content":"a jury in dallas texas federal court has found tata consultancy services tcs guilty of stealing dxc technology s trade secrets which is likely to land a \u003cTWO_HUNDRED\u003e million penalty on the indian software major this comes as last week tcs announced a \u003cONE_HUNDRED\u003e million provision during q3 after it lost a lawsuit and claim from epic systems tcs has refuted the allegations tcs respectfully disagrees with the jury s advisory verdict the matter will now be decided by the court which has ordered further briefing from the parties we plan to continue to litigate this ongoing case we will have no further comment as the case remains pending said a company spokesperson in \u003cTWO_THOUSAND\u003e dxc predecessor computer sciences corp filed a lawsuit against tcs claiming that it licensed its software to transamerica subsidiary money services inc tcs had won a \u003cTWO_\u003e billion deal from transamerica in \u003cTWO_THOUSAND\u003e the lawsuit alleged that tata rebadged \u003cTWO_THOUSAND\u003e transamerica employees in \u003cTWO_THOUSAND\u003e and used their access to cscs software to gain knowledge of its source code and other proprietary information to build a competing life insurance platform the lawsuit stated that tcs deal was for third party administration and not for accessing the source code of its proprietary systems which were later used to improve the tcs bancs software the jury found in a verdict last week that the tata group subsidiary misused confidential information about dxcs vantage one and cyberlife software for managing life insurance and annuity policies to create a competing platform it advised that tcs owed dxc \u003cSEVEN_TEN\u003e million for misappropriating its trade secrets and an additional \u003cONE_HUNDRED\u003e million because its misuse was willful and malicious also read stars of indian it companies dim amid challenging demand situation","timestamp":"2023-11-27T12:32:00+05:30","market_timestamp":"2023-11-27T12:32:00+05:30","off_market_hours":false}