{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-sector-growth-to-inch-up-to-6-in-fy25-hiring-to-be-moderate-for-3-quarters-icra/articleshow/105733201.cms","title":"IT sector growth to inch up to 6% in FY25, hiring to be moderate for 3 quarters: Icra","description":"The muted hiring outlook is the result of a weak demand scenario and companies will be focusing on utilising the capacity in the past and improving the overall utilisation levels, the agency said.","content":"Domestic rating agency Icra on Monday said the Indian IT sector's revenue growth will inch up to over 6 per cent in 2024-25 from 3-5 per cent estimated for the ongoing financial year. The slower growth will have an impact on the hiring plans, the agency said, adding that staff addition will continue to remain \"muted\" for the next 2-3 quarters. The USD 250-billion industry grew by 9.2 per cent in FY2022-23.  The muted hiring outlook is the result of a weak demand scenario and companies will be focusing on utilising the capacity in the past and improving the overall utilisation levels, the agency said.  It explained that the macroeconomic challenges in the biggest markets of the US and Europe have caused a slowdown in demand.  The increased hiring in the recent past inflated the overall wage bills of companies and impacted the operating profit margins, but the same is likely to improve over the medium term as the wage costs stabilise and employee utilisation goes up.  The agency said attrition has tapered in the last few quarters after rising up as there was higher demand for workers during the time of high demand for the sector's services. ","cleaned_content":"domestic rating agency icra on monday said the indian it sectors revenue growth will inch up to over \u003cSIX_PERCENT\u003e in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e from \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e estimated for the ongoing financial year the slower growth will have an impact on the hiring plans the agency said adding that staff addition will continue to remain muted for the next \u003cTWO_\u003e \u003cTHREE_\u003e quarters the usd \u003cTWO_HUNDRED\u003e billion industry grew by \u003cNINE_PERCENT\u003e in fy2022 \u003cTWO_TEN\u003e the muted hiring outlook is the result of a weak demand scenario and companies will be focusing on utilising the capacity in the past and improving the overall utilisation levels the agency said it explained that the macroeconomic challenges in the biggest markets of the us and europe have caused a slowdown in demand the increased hiring in the recent past inflated the overall wage bills of companies and impacted the operating profit margins but the same is likely to improve over the medium term as the wage costs stabilise and employee utilisation goes up the agency said attrition has tapered in the last few quarters after rising up as there was higher demand for workers during the time of high demand for the sectors services","timestamp":"2023-12-04T20:29:00+05:30","market_timestamp":"2023-12-05T09:15:00+05:30","off_market_hours":true}