{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-to-build-sports-cloud-platform-on-aws/articleshow/105533334.cms","title":"Tech Mahindra to build sports cloud platform on AWS","description":"The platform will build next-generation digital capabilities for sports organisations and deliver immersive sports experiences worldwide.","content":"Tech Mahindra said on Monday that it has collaborated with Amazon Web Services (AWS) to build a sports cloud platform. The platform will build next-generation digital capabilities for sports organisations and deliver immersive sports experiences worldwide. The sports cloud offering is the result of a strategic collaboration agreement (SCA) signed between the two organisations in September 2023.AWS also announced on Monday that HDFC Securities has launched its new mobile trading app, HDFC SKY, on the hyperscalar's platform. With AWS, HDFC Securities will reduce its annual IT infrastructure and management costs by up to 50% compared to using on-premises infrastructure. To ensure consistent high performance of HDFC SKY, which serves over 75 million customers, HDFC Securities migrated its core workloads to Amazon Elastic Compute Cloud (Amazon EC2), a web service that provides secure, resizable compute capacity in the cloud.The digital platform for sports organisations will offer use cases related to content and community engagement, customer data management and audience segmentation, and sports analytics. It will deliver stadium-to-home fan experiences by leveraging augmented reality and virtual reality (AR/ VR), and metaverse gamification. The cloud offering will also enable sports organisations to build and transform digital properties of sports teams and franchises and generate new revenue streams by developing new services and features tailored to audience needs.“Our collaboration with Tech Mahindra will enable leading sports organisations to take the fan experience to the next level by creating immersive experiences and providing data-driven insights. We are excited about the potential to make sports more engaging and enjoyable for fans, and more productive for sports organizations around the world,” said Samira Bakhtiar, general manager, media, entertainment \u0026 sports, AWS.“By building a sports cloud on AWS, we aim to build a personalised, fan-focused community that transcends physical sports. The platform is positioned to disrupt the sports tech industry by providing opportunities for sports organisations and franchises worldwide to create a delightful fan engagement experience that is built on content and community, leading to commerce,” said Jagdish Mitra, chief strategy officer and head of growth, Tech Mahindra.","cleaned_content":"tech mahindra said on monday that it has collaborated with amazon web services aws to build a sports cloud platform the platform will build next generation digital capabilities for sports organisations and deliver immersive sports experiences worldwide the sports cloud offering is the result of a strategic collaboration agreement sca signed between the two organisations in september \u003cTWO_THOUSAND\u003e aws also announced on monday that hdfc securities has launched its new mobile trading app hdfc sky on the hyperscalars platform with aws hdfc securities will reduce its annual it infrastructure and management costs by up to \u003cFIVE_TEN_PERCENT\u003e compared to using on premises infrastructure to ensure consistent high performance of hdfc sky which serves over \u003cSEVEN_TEN\u003e million customers hdfc securities migrated its core workloads to amazon elastic compute cloud amazon ec2 a web service that provides secure resizable compute capacity in the cloud the digital platform for sports organisations will offer use cases related to content and community engagement customer data management and audience segmentation and sports analytics it will deliver stadium to home fan experiences by leveraging augmented reality and virtual reality ar vr and metaverse gamification the cloud offering will also enable sports organisations to build and transform digital properties of sports teams and franchises and generate new revenue streams by developing new services and features tailored to audience needs our collaboration with tech mahindra will enable leading sports organisations to take the fan experience to the next level by creating immersive experiences and providing data driven insights we are excited about the potential to make sports more engaging and enjoyable for fans and more productive for sports organizations around the world said samira bakhtiar general manager media entertainment sports aws by building a sports cloud on aws we aim to build a personalised fan focused community that transcends physical sports the platform is positioned to disrupt the sports tech industry by providing opportunities for sports organisations and franchises worldwide to create a delightful fan engagement experience that is built on content and community leading to commerce said jagdish mitra chief strategy officer and head of growth tech mahindra","timestamp":"2023-11-27T15:59:00+05:30","market_timestamp":"2023-11-28T09:15:00+05:30","off_market_hours":true}