{"url":"https://economictimes.indiatimes.com/tech/information-tech/former-tcs-ceo-rajesh-gopinathan-joins-bcg-in-advisory-role/articleshow/105550057.cms","title":"Former TCS CEO Rajesh Gopinathan joins BCG in advisory role","description":"Gopinathan has joined BCG as a senior advisor to the technology, media and telecom (TMT) practice. He will be advising in the capacity of an external consultant.","content":"Former TCS CEO Rajesh Gopinathan has joined the Boston Consulting Group (BCG) as a senior advisor to the technology, media and telecom (TMT) practice, sources in the know confirmed. Gopinathan will be advising in the capacity of an external consultant.ET has reached out to BCG for responses. Gopinathan’s sudden resignation in March had taken the IT services industry by surprise. During Gopinathan’s six-year stint, the company added over $10 billion in incremental revenues at $25.8 billion and over $70 billion increase in market capitalisation to $140 billion.Times of India first broke the story on Tuesday.Gopinathan had told ET in an interview in March, that the exit was timed in a way that his successor K Krithivasan could take over at the start of the next fiscal year.Gopinathan, 52, spent 22 years at TCS, having joined as a fresher, and was CEO for six years.","cleaned_content":"former tcs ceo rajesh gopinathan has joined the boston consulting group bcg as a senior advisor to the technology media and telecom tmt practice sources in the know confirmed gopinathan will be advising in the capacity of an external consultant et has reached out to bcg for responses gopinathan s sudden resignation in march had taken the it services industry by surprise during gopinathan s six year stint the company added over \u003cONE_TEN\u003e billion in incremental revenues at \u003cTWO_TEN\u003e billion and over \u003cSEVEN_TEN\u003e billion increase in market capitalisation to \u003cONE_HUNDRED\u003e billion times of india first broke the story on tuesday gopinathan had told et in an interview in march that the exit was timed in a way that his successor k krithivasan could take over at the start of the next fiscal year gopinathan \u003cFIVE_TEN\u003e spent \u003cTWO_TEN\u003e years at tcs having joined as a fresher and was ceo for six years","timestamp":"2023-11-28T10:19:00+05:30","market_timestamp":"2023-11-28T10:19:00+05:30","off_market_hours":false}