{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-ties-up-with-aws-to-launch-genai-practice/articleshow/105538284.cms","title":"TCS ties up with AWS to launch GenAI practice","description":"The practice will focus on using responsible AI frameworks and its \"Paceport innovation hubs\" to build a comprehensive portfolio of solutions and services for every industry sector, as per an official statement.","content":"The country's largest IT services exporter TCS on Monday announced its tie-up with Amazon Web Services to launch a dedicated generative artificial intelligence practice. The Tata Group company recently announced that it has imparted foundation training on GenAI for 1 lakh employees across the world. The practice will focus on using responsible AI frameworks and its \"Paceport innovation hubs\" to build a comprehensive portfolio of solutions and services for every industry sector, as per an official statement. It has already bagged a customer, with the world's largest hotel franchising company Wyndham Hotels and Resorts extending its strategic partnership with TCS and AWS to manage its digital transformation journey. Generative AI has captured the attention of enterprises globally for its potential to significantly reshape industries, the statement said, adding that TCS has already been working on GenAI with clients. TCS is at present focused on certifying over 25,000 employees on AWS generative AI services. ","cleaned_content":"the countrys largest it services exporter tcs on monday announced its tie up with amazon web services to launch a dedicated generative artificial intelligence practice the tata group company recently announced that it has imparted foundation training on genai for \u003cONE_\u003e lakh employees across the world the practice will focus on using responsible ai frameworks and its paceport innovation hubs to build a comprehensive portfolio of solutions and services for every industry sector as per an official statement it has already bagged a customer with the worlds largest hotel franchising company wyndham hotels and resorts extending its strategic partnership with tcs and aws to manage its digital transformation journey generative ai has captured the attention of enterprises globally for its potential to significantly reshape industries the statement said adding that tcs has already been working on genai with clients tcs is at present focused on certifying over \u003cTWO_TEN_THOUSAND\u003e employees on aws generative ai services","timestamp":"2023-11-27T19:13:00+05:30","market_timestamp":"2023-11-28T09:15:00+05:30","off_market_hours":true}