{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-launches-delivery-center-in-iasi-romania/articleshow/105844591.cms","title":"HCLTech launches delivery center in Iasi, Romania","description":"The new center in Iasi will provide next-generation digital, engineering, cloud and AI solutions. As part of its nearshore strategy to serve global clients.","content":"HCLTech said on Friday that it has launched its new Global Delivery Center (GDC) in Iasi, Romania. The new center in Iasi will provide next-generation digital, engineering, cloud and AI solutions. As part of its nearshore strategy to serve global clients.“This is a significant milestone for HCLTech in Romania as we continue our growth journey and serve our global clients with new capabilities in the latest technologies,” said Iulian Paduraru, country head, Romania, HCLTech. HCLTech has completed five years of operations in Romania and employs approximately 1,000 people across Bucharest, Iasi, and Brasov. In March, the company had said that it planned to expand its operations in Bucharest and Iasi and hire an additional 1,000 people in the country over the next two years. A third of the new roles will be offered to graduates recruited through partnerships with leading Romanian universities","cleaned_content":"hcltech said on friday that it has launched its new global delivery center gdc in iasi romania the new center in iasi will provide next generation digital engineering cloud and ai solutions as part of its nearshore strategy to serve global clients this is a significant milestone for hcltech in romania as we continue our growth journey and serve our global clients with new capabilities in the latest technologies said iulian paduraru country head romania hcltech hcltech has completed five years of operations in romania and employs approximately \u003cONE_THOUSAND\u003e people across bucharest iasi and brasov in march the company had said that it planned to expand its operations in bucharest and iasi and hire an additional \u003cONE_THOUSAND\u003e people in the country over the next two years a third of the new roles will be offered to graduates recruited through partnerships with leading romanian universities","timestamp":"2023-12-08T18:35:00+05:30","market_timestamp":"2023-12-11T09:15:00+05:30","off_market_hours":true}