{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-sectors-fresher-hiring-to-be-30-lower-in-fiscal-2024-teamlease-digital/articleshow/106123487.cms","title":"IT sector’s fresher hiring to be 30% lower in fiscal 2024: TeamLease Digital","description":"With approximately 1.5 million engineering graduates actively seeking IT/tech roles, muted market sentiments and intensified skills evaluation mechanisms will mean only 10% of the fresher pool will find coveted IT jobs.","content":"The IT sector will onboard one-third or 32% fewer engineering graduates in fiscal 2024 compared to fiscal 2023, according to a new report by TeamLease Digital. The findings indicate that 1.55 lakh freshers are likely to be hired in the IT/technology sector this fiscal as compared to 2.3 lakh in the previous year.With approximately 1.5 million engineering graduates actively seeking IT/tech roles, muted market sentiments and intensified skills evaluation mechanisms will mean only 10% of the fresher pool will find coveted IT jobs. Findings reveal that only 45% of applicants currently meet the well-rounded proficiency expectations showcasing the widening skill gap.Krishna Vij, business head, TeamLease Digital, said government initiatives will play a pivotal role in supporting skill development to meet industry-specific challenges. “A united front can be forged through the collaborative efforts of the industry, academia, and government, leading to relevant programs and curricula being designed,” said Vij. The report also reveals that companies are looking for a combination of soft skills like communication, problem-solving, teamwork, emotional intelligence etc and hard skills such as technical proficiency in programming languages, software development methodologies, cloud computing and data analytics. ","cleaned_content":"the it sector will onboard one third or \u003cTHREE_TEN_PERCENT\u003e fewer engineering graduates in fiscal \u003cTWO_THOUSAND\u003e compared to fiscal \u003cTWO_THOUSAND\u003e according to a new report by teamlease digital the findings indicate that \u003cONE_\u003e lakh freshers are likely to be hired in the it technology sector this fiscal as compared to \u003cTWO_\u003e lakh in the previous year with approximately \u003cONE_\u003e million engineering graduates actively seeking it tech roles muted market sentiments and intensified skills evaluation mechanisms will mean only \u003cONE_TEN_PERCENT\u003e of the fresher pool will find coveted it jobs findings reveal that only \u003cFOUR_TEN_PERCENT\u003e of applicants currently meet the well rounded proficiency expectations showcasing the widening skill gap krishna vij business head teamlease digital said government initiatives will play a pivotal role in supporting skill development to meet industry specific challenges a united front can be forged through the collaborative efforts of the industry academia and government leading to relevant programs and curricula being designed said vij the report also reveals that companies are looking for a combination of soft skills like communication problem solving teamwork emotional intelligence etc and hard skills such as technical proficiency in programming languages software development methodologies cloud computing and data analytics","timestamp":"2023-12-19T16:05:00+05:30","market_timestamp":"2023-12-20T09:15:00+05:30","off_market_hours":true}