{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-communications-wins-digital-transformation-deal-from-tata-motors-owned-jlr/articleshow/105931819.cms","title":"Tata Communications wins digital transformation deal from Tata Motors-owned JLR","description":"​​​The deal will power the production of JLR’s next-generation vehicles, a key part of its Reimagine strategy, and provide the connectivity foundation for the next phase of digital transformation for the organisation.","content":"Tata Communications said on Tuesday that it has won a digital transformation deal from Tata Motors-owned British automaker JLR. Deal financials were not disclosed. The deal will power the production of JLR’s next-generation vehicles, a key part of its Reimagine strategy, and provide the connectivity foundation for the next phase of digital transformation for the organisation. Tata Communications has already commenced implementation of the network transformation program and will complete the deployment by 2025. Earlier, in September, Tata Consultancy Services had announced that it had won a deal with the Digital unit of JLR in a deal valued at £800 million over the next five years to support JLR’s Rimagine strategy. Tata Communications will deploy its cloud-first, software-defined wide area network (SD-WAN) technology, connecting all of JLR’s 128 sites worldwide. This globally connected capability — between JLR’s global HQ and its plants, warehouses, sales centers, data centers, and cloud services, will boost supply chain efficiency and security. ","cleaned_content":"tata communications said on tuesday that it has won a digital transformation deal from tata motors owned british automaker jlr deal financials were not disclosed the deal will power the production of jlr s next generation vehicles a key part of its reimagine strategy and provide the connectivity foundation for the next phase of digital transformation for the organisation tata communications has already commenced implementation of the network transformation program and will complete the deployment by \u003cTWO_THOUSAND\u003e earlier in september tata consultancy services had announced that it had won a deal with the digital unit of jlr in a deal valued at \u003cEIGHT_HUNDRED\u003e million over the next five years to support jlr s rimagine strategy tata communications will deploy its cloud first software defined wide area network sd wan technology connecting all of jlr s \u003cONE_HUNDRED\u003e sites worldwide this globally connected capability between jlr s global hq and its plants warehouses sales centers data centers and cloud services will boost supply chain efficiency and security","timestamp":"2023-12-12T15:37:00+05:30","market_timestamp":"2023-12-13T09:15:00+05:30","off_market_hours":true}