{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-wins-australian-public-transport-mandate/articleshow/105985793.cms","title":"HCLTech wins Australian public transport mandate","description":"More than 605 million trips are taken on Victoria’s public transport network annually and 35% of these are taken by concession card holders, including students, retirees, veterans, and those with disabilities.","content":"HCLTech on Thursday said that it has won a deal from the Department of Transport and Planning in Victoria, Australia to automate the concession entitlement process for public transport users. Deal financials were not disclosed.More than 605 million trips are taken on Victoria’s public transport network annually and 35% of these are taken by concession card holders, including students, retirees, veterans, and those with disabilities.HCLTech will develop and support a Concessions Entitlement Validation Platform (CEVP) for the department, enabling instant proof of concession entitlement and a passenger interface to apply for and manage concession entitlement. This will improve experiences for both passengers and the department staff, said HCLTech. The linking of credit cards with concession cards, enabled by the CEVP, will be a nation-first. This feature will provide payment flexibility for concession card holders. HCLTech will deploy digital workflow orchestration solutions and leverage agile development approaches to roll out the CEVP across Victoria. The company will also provide maintenance and customer center support as well as training for the Department of Transport and Planning employees.","cleaned_content":"hcltech on thursday said that it has won a deal from the department of transport and planning in victoria australia to automate the concession entitlement process for public transport users deal financials were not disclosed more than \u003cSIX_HUNDRED\u003e million trips are taken on victoria s public transport network annually and \u003cTHREE_TEN_PERCENT\u003e of these are taken by concession card holders including students retirees veterans and those with disabilities hcltech will develop and support a concessions entitlement validation platform cevp for the department enabling instant proof of concession entitlement and a passenger interface to apply for and manage concession entitlement this will improve experiences for both passengers and the department staff said hcltech the linking of credit cards with concession cards enabled by the cevp will be a nation first this feature will provide payment flexibility for concession card holders hcltech will deploy digital workflow orchestration solutions and leverage agile development approaches to roll out the cevp across victoria the company will also provide maintenance and customer center support as well as training for the department of transport and planning employees","timestamp":"2023-12-14T13:52:00+05:30","market_timestamp":"2023-12-14T13:52:00+05:30","off_market_hours":false}