{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-to-buy-advisory-firm-thirdera-to-focus-on-workflow-solutions/articleshow/105978355.cms","title":"Cognizant to buy advisory firm Thirdera to focus on workflow solutions","description":"New Jersey-based Cognizant plans to absorb 940 people from Thirdera into its ServiceNow business group, its channel partner which has a team of 1,500 people.","content":"Software services provider Cognizant has agreed to acquire two-year-old Thirdera, a global pure-play advisory firm, as part of its focus on emerging enterprise workflow products.US-headquartered Cognizant plans to absorb 940 people from Thirdera into its ServiceNow business group, its channel partner which has a team of 1,500 people. The ServiceNow business group will be run by Jason Wojahn, CEO and cofounder of Thirdera, Cognizant said in a statement.Wojahn previously served as president of the ServiceNow business unit at Cloud Sherpas which was acquired by Accenture in 2015.Cognizant and ServiceNow are currently building a $1 billion combined business focused on AI-driven automation. The addition of Thirdera, which brings an on-and-near-shore global presence for the Cognizant ServiceNow Business Group, will build on that business.The acquisition is expected to close in January 2024. Financial details of the deal were not disclosed.","cleaned_content":"software services provider cognizant has agreed to acquire two year old thirdera a global pure play advisory firm as part of its focus on emerging enterprise workflow products us headquartered cognizant plans to absorb \u003cNINE_HUNDRED\u003e people from thirdera into its servicenow business group its channel partner which has a team of \u003cONE_THOUSAND\u003e people the servicenow business group will be run by jason wojahn ceo and cofounder of thirdera cognizant said in a statement wojahn previously served as president of the servicenow business unit at cloud sherpas which was acquired by accenture in \u003cTWO_THOUSAND\u003e cognizant and servicenow are currently building a \u003cONE_\u003e billion combined business focused on ai driven automation the addition of thirdera which brings an on and near shore global presence for the cognizant servicenow business group will build on that business the acquisition is expected to close in january \u003cTWO_THOUSAND\u003e financial details of the deal were not disclosed","timestamp":"2023-12-14T11:34:00+05:30","market_timestamp":"2023-12-14T11:34:00+05:30","off_market_hours":false}