{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-cfo-nilanjan-roy-resigns-deputy-jayesh-sanghrajka-named-as-replacement/articleshow/105910261.cms","title":"Leadership crisis deepens at Infosys as CFO Nilanjan Roy resigns","description":"Roy's last day will be effective from March 31, 2024, Infosys said in a regulatory filing.","content":"Infosys chief financial officer (CFO) Nilanjan Roy has resigned to pursue “personal aspirations”, the company said Monday, in a surprise development which deepened the leadership crisis at India’s second largest software exporter whose US-listed shares fell over 3% at opening trade.Roy's last day at work will be Match 31, 2024, Infosys said in a regulatory filing. Jayesh Sanghrajka, currently executive vice president and deputy CFO, will replace Roy.“As deputy CFO, he (Sanghrajka) has been leading multiple portfolios in the finance function for several years now and his depth of experience and knowledge will serve us well to take the function to greater heights,” chief executive Salil Parekh said in the notice. “I would also like to express my deep appreciation for Nilanjan for ably leading the function over the last five years (since 2018) …” he added.The development took the market by surprise, with the American Depository Receipts of Infosys slumping over 3% to around $17.41 apiece in the opening trade on Monday. The news came after market close in India, where the shares ended nearly flat at 1,488.60 on the BSE.\"The leadership vacuum developing at Infosys is becoming quite alarming with Nilanjan's departure. (Chairman) Nandan (Nilekani) and Salil need to lay down their plans to steady the ship in 2024,\" said Phil Fersht, chief executive of US-based IT research and analyst firm HFS Research.","cleaned_content":"infosys chief financial officer cfo nilanjan roy has resigned to pursue personal aspirations the company said monday in a surprise development which deepened the leadership crisis at india s second largest software exporter whose us listed shares fell over \u003cTHREE_PERCENT\u003e at opening trade roys last day at work will be match \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e infosys said in a regulatory filing jayesh sanghrajka currently executive vice president and deputy cfo will replace roy as deputy cfo he sanghrajka has been leading multiple portfolios in the finance function for several years now and his depth of experience and knowledge will serve us well to take the function to greater heights chief executive salil parekh said in the notice i would also like to express my deep appreciation for nilanjan for ably leading the function over the last five years since \u003cTWO_THOUSAND\u003e he added the development took the market by surprise with the american depository receipts of infosys slumping over \u003cTHREE_PERCENT\u003e to around \u003cONE_TEN\u003e apiece in the opening trade on monday the news came after market close in india where the shares ended nearly flat at \u003cONE_THOUSAND\u003e on the bse the leadership vacuum developing at infosys is becoming quite alarming with nilanjans departure chairman nandan nilekani and salil need to lay down their plans to steady the ship in \u003cTWO_THOUSAND\u003e said phil fersht chief executive of us based it research and analyst firm hfs research","timestamp":"2023-12-12T10:15:00+05:30","market_timestamp":"2023-12-12T10:15:00+05:30","off_market_hours":false}