{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-inaugurates-rs-230-crore-development-centre-in-nagpur/articleshow/106051996.cms","title":"Infosys inaugurates Rs 230 crore development centre in Nagpur","description":"\"Infosys inaugurates a new development centre in Nagpur. With over Rs 230 crore investment, the 2,65,000 sq ft unique state-of-the-art building is an integration of art and science,\" according to a release.","content":"IT services company Infosys on Saturday said it has inaugurated a new development centre at the Mihan-SEZ in Nagpur, Maharashtra. Infosys has invested over Rs 230 crore in the development of this facility, which is spread across 2,65,000 sq ft. The centre will provide greater flexibility for employees to work in a hybrid mode and enable re-skilling and up-skilling of local talent. \"Infosys inaugurates a new development centre in Nagpur. With over Rs 230 crore investment, the 2,65,000 sq ft unique state-of-the-art building is an integration of art and science,\" according to a release. The new centre will also give employees the opportunity to work on next-gen technologies like cloud, AI, and digital across multiple industries, such as telecommunications, banking, retail, aerospace, automobile, logistics, and manufacturing, among others. It will accommodate over 3,000 employees in line with Infosys' future-ready hybrid workplace strategy, the release said. ","cleaned_content":"it services company infosys on saturday said it has inaugurated a new development centre at the mihan sez in nagpur maharashtra infosys has invested over rs \u003cTWO_HUNDRED\u003e crore in the development of this facility which is spread across \u003cTWO_HUNDRED_THOUSAND\u003e sq ft the centre will provide greater flexibility for employees to work in a hybrid mode and enable re skilling and up skilling of local talent infosys inaugurates a new development centre in nagpur with over rs \u003cTWO_HUNDRED\u003e crore investment the \u003cTWO_HUNDRED_THOUSAND\u003e sq ft unique state of the art building is an integration of art and science according to a release the new centre will also give employees the opportunity to work on next gen technologies like cloud ai and digital across multiple industries such as telecommunications banking retail aerospace automobile logistics and manufacturing among others it will accommodate over \u003cTHREE_THOUSAND\u003e employees in line with infosys future ready hybrid workplace strategy the release said","timestamp":"2023-12-16T23:20:00+05:30","market_timestamp":"2023-12-18T09:15:00+05:30","off_market_hours":true}