{"url":"https://economictimes.indiatimes.com/tech/information-tech/ibm-to-buy-software-ags-enterprise-tech-business-for-2-3-billion/articleshow/106084078.cms","title":"IBM to buy Software AG's enterprise tech business for $2.3 billion","description":"IBM will acquire Software AG's StreamSets and webMethods platforms with available cash on hand, it said.","content":"IBM on Monday said it would buy Software AG's enterprise technology platforms for €2.13 billion ($2.33 billion) to bolster its artificial intelligence and hybrid cloud offerings. IBM will acquire Software AG's StreamSets and webMethods platforms with available cash on hand, it said.  The platforms provide application integration, application programming interface (API) management, and data integration among other uses.  Software AG is majority owned by private equity firm Silver Lake. \"The opportunity to bring the StreamSets and webMethods teams together with IBM to innovate in building the future of hybrid cloud and next-generation AI solutions for the enterprise is uniquely compelling,\" Christian Lucas, chairman of the supervisory board of Software AG said in a statement.","cleaned_content":"ibm on monday said it would buy software ags enterprise technology platforms for \u003cTWO_\u003e billion \u003cTWO_\u003e billion to bolster its artificial intelligence and hybrid cloud offerings ibm will acquire software ags streamsets and webmethods platforms with available cash on hand it said the platforms provide application integration application programming interface api management and data integration among other uses software ag is majority owned by private equity firm silver lake the opportunity to bring the streamsets and webmethods teams together with ibm to innovate in building the future of hybrid cloud and next generation ai solutions for the enterprise is uniquely compelling christian lucas chairman of the supervisory board of software ag said in a statement","timestamp":"2023-12-18T13:50:00+05:30","market_timestamp":"2023-12-18T13:50:00+05:30","off_market_hours":false}