{"url":"https://economictimes.indiatimes.com/tech/information-tech/https/example-com/intel-rd-lab-ctrls-data-center/articleshow/106155556.cms","title":"Intel sets up R\u0026D lab at CtrlS Bengaluru data center","description":"​​This facility is the latest extension of Intel’s global advanced data center development labs. This is an at-scale facility for developing new microprocessor architectures.","content":"Intel has set up its next-gen processor R\u0026D lab at CtrlS Datacenters Ltd’s Bengaluru facility, the latter said on Wednesday. This facility is the latest extension of Intel’s global advanced data center development labs. This is an at-scale facility for developing new microprocessor architectures.  This development lab will allow at-scale testing to build high-quality and reliable computing systems. Further, Intel will open these labs to its ecosystem partners such as memory vendors and systems Original Design Manufacturers (ODMs) to work together to build an ecosystem around Intel’s products. “The opening of Intel’s next-gen processor lab in our Bengaluru data center, takes our relationship to a higher level. I wish the Intel team great success and look forward to serving their expanding needs over the next few years,” said Sridhar Pinnapureddy, chairman, CtrlS Datacenters Ltd.","cleaned_content":"intel has set up its next gen processor r d lab at ctrls datacenters ltd s bengaluru facility the latter said on wednesday this facility is the latest extension of intel s global advanced data center development labs this is an at scale facility for developing new microprocessor architectures this development lab will allow at scale testing to build high quality and reliable computing systems further intel will open these labs to its ecosystem partners such as memory vendors and systems original design manufacturers odms to work together to build an ecosystem around intel s products the opening of intel s next gen processor lab in our bengaluru data center takes our relationship to a higher level i wish the intel team great success and look forward to serving their expanding needs over the next few years said sridhar pinnapureddy chairman ctrls datacenters ltd","timestamp":"2023-12-20T17:09:00+05:30","market_timestamp":"2023-12-21T09:15:00+05:30","off_market_hours":true}