{"url":"https://economictimes.indiatimes.com/tech/information-tech/synopsys-seeks-to-acquire-engineering-software-company-ansys/articleshow/106226786.cms","title":"Synopsys seeks to acquire engineering software company Ansys","description":"Synopsys' pursuit of a transformative acquisition amid a leadership change underscores the commercial appeal of Ansys' software, which is used widely in design, including in tennis to design rackets for players like Novak Djokovic.","content":"Synopsys Inc, a maker of software used in chip design, has submitted an offer to acquire Ansys Inc, an engineering software vendor with a market value of $30 billion, people familiar with the matter said on Friday. The deal negotiations come as Synopsys cofounder Aart de Geus prepares to transition to an executive chairman role and hand over the chief executive reins to chief operating officer Sassine Ghazi on Jan. 1. Synopsys' pursuit of a transformative acquisition amid a leadership change underscores the commercial appeal of Ansys' software, which is used widely in design, including in tennis to design rackets for players like Novak Djokovic. Synopsys is one of the companies that has been in talks with Ansys about a potential deal, the sources said. Ansys has also attracted other suitors, and there is no certainty that Synopsys' bid will prevail, the sources added. The offers that Ansys has attracted value it at well over $400 per share, and a deal could be announced in the coming weeks if the talks do not fall apart, the sources said.","cleaned_content":"synopsys inc a maker of software used in chip design has submitted an offer to acquire ansys inc an engineering software vendor with a market value of \u003cTHREE_TEN\u003e billion people familiar with the matter said on friday the deal negotiations come as synopsys cofounder aart de geus prepares to transition to an executive chairman role and hand over the chief executive reins to chief operating officer sassine ghazi on jan \u003cONE_\u003e synopsys pursuit of a transformative acquisition amid a leadership change underscores the commercial appeal of ansys software which is used widely in design including in tennis to design rackets for players like novak djokovic synopsys is one of the companies that has been in talks with ansys about a potential deal the sources said ansys has also attracted other suitors and there is no certainty that synopsys bid will prevail the sources added the offers that ansys has attracted value it at well over \u003cFOUR_HUNDRED\u003e per share and a deal could be announced in the coming weeks if the talks do not fall apart the sources said","timestamp":"2023-12-23T10:12:00+05:30","market_timestamp":"2023-12-25T09:15:00+05:30","off_market_hours":true}