{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-loses-1-5-billion-deal-with-global-firm/articleshow/106231703.cms","title":"Infosys loses $1.5 billion deal with global firm","description":"The scope of the now-terminated deal was to provide digital transformation and modernisation of business operations services through Infosys' platforms and AI solutions. ​Infosys did not name the global company nor did it mention if it is an existing client.","content":"IT major Infosys announced the termination of its $1.5 billion agreement with an undisclosed global company, focused on artificial intelligence (AI) solutions, signed in September.The Salil Parekh-led IT services giant had announced the $1.5 billion contract for a 15-year period, inked on September 14, 2023.“The global company has now elected to terminate the Memorandum of Understanding and the parties will not be pursuing the Master Agreement,” Infosys said in a stock exchange filing on Saturday.The scope of the now-terminated deal was to provide digital transformation and modernisation of business operations services through Infosys' platforms and AI solutions. Infosys did not name the global company nor did it mention if it is an existing client.Incidentally, this comes less than two weeks after the Bengaluru-based company's chief financial officer (CFO) Nilanjan Roy suddenly resigned after being in the position for around six years.","cleaned_content":"it major infosys announced the termination of its \u003cONE_\u003e billion agreement with an undisclosed global company focused on artificial intelligence ai solutions signed in september the salil parekh led it services giant had announced the \u003cONE_\u003e billion contract for a \u003cONE_TEN\u003e year period inked on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the global company has now elected to terminate the memorandum of understanding and the parties will not be pursuing the master agreement infosys said in a stock exchange filing on saturday the scope of the now terminated deal was to provide digital transformation and modernisation of business operations services through infosys platforms and ai solutions infosys did not name the global company nor did it mention if it is an existing client incidentally this comes less than two weeks after the bengaluru based companys chief financial officer cfo nilanjan roy suddenly resigned after being in the position for around six years","timestamp":"2023-12-23T14:34:00+05:30","market_timestamp":"2023-12-25T09:15:00+05:30","off_market_hours":true}