{"url":"https://economictimes.indiatimes.com/tech/information-tech/black-box-eyes-three-fold-growth-to-2-billion-by-2027-with-focus-on-critical-infra/articleshow/106354920.cms","title":"Black Box eyes three-fold revenue growth to $2 billion by 2027 with focus on critical infra","description":"Black Box president and CEO Sanjeev Verma said that focusing on digital infrastructure, connectivity, networking, modern workplace cybersecurity, along with artificial integration, is going to provide a huge runway to the company.","content":"Indian IT company Black Box is expecting a threefold increase in revenue to $2 billion over the next three years, driven by demand for critical technological infrastructure. Black Box president and CEO Sanjeev Verma told PTI that focusing on digital infrastructure, connectivity, networking, modern workplace cybersecurity, along with artificial integration, is going to provide a huge runway to the company.  \"I think we see the future for digital infrastructure business ramping up on the back of hybrid activity on the data centre side, requirement for people to collaborate across continents and cultures, hybrid workplaces that have become a norm post-Covid.\"  \"We are looking at double-digit growth organically over the next few years and expect to push towards $2 billion (Rs 16,632 crore) revenues in the next three years,\" Verma said.  The company had reported a consolidated revenue of Rs 6,233 crore in FY23, as per a BSE filing.  Black Box works with big tech companies like Amazon, Google, Meta, and Microsoft, to help build their high-density data centres. ","cleaned_content":"indian it company black box is expecting a threefold increase in revenue to \u003cTWO_\u003e billion over the next three years driven by demand for critical technological infrastructure black box president and ceo sanjeev verma told pti that focusing on digital infrastructure connectivity networking modern workplace cybersecurity along with artificial integration is going to provide a huge runway to the company i think we see the future for digital infrastructure business ramping up on the back of hybrid activity on the data centre side requirement for people to collaborate across continents and cultures hybrid workplaces that have become a norm post covid we are looking at double digit growth organically over the next few years and expect to push towards \u003cTWO_\u003e billion rs \u003cONE_TEN_THOUSAND\u003e crore revenues in the next three years verma said the company had reported a consolidated revenue of rs \u003cSIX_THOUSAND\u003e crore in fy23 as per a bse filing black box works with big tech companies like amazon google meta and microsoft to help build their high density data centres","timestamp":"2023-12-28T18:40:00+05:30","market_timestamp":"2023-12-29T09:15:00+05:30","off_market_hours":true}