{"url":"https://economictimes.indiatimes.com/tech/information-tech/cxos-much-wanted-demand-likely-to-exceed-supply-in-2024/articleshow/106225895.cms","title":"CXOs much wanted; demand likely to exceed supply in 2024","description":"Hiring action is mostly concentrated at the senior levels due to increased confidence in the economy, said experts. The entry and middle levels are not seeing much action due to the aftereffects of over-hiring in 2021 that are still being felt, they said.","content":"New Delhi: Corporate India has intensified hiring for leadership roles despite a slowdown in entry-level recruitment, according to search firms, which expect a possible shortage of senior executives to meet the demand in the new year.Executives at search firms ET spoke with said they expect at least a 20-25% increase in search mandates for CXOs in 2024.The momentum has been building up for the past few months, said Heidrick \u0026 Struggles partner Suresh Raina. “Today, we are in conversations with senior leaders for CXO roles who have at least one more offer in hand and hence are quite selective.”Hiring action is mostly concentrated at the senior levels due to increased confidence in the economy, said experts. The entry and middle levels are not seeing much action due to the aftereffects of over hiring in 2021 that are still being felt, they said.The executives said their companies are conducting searches for roles such as chief executive officer, chief financial officer, chief technology/information officer, chief business officer, chief marketing officer, chief operations officer and chief HR officer.","cleaned_content":"new delhi corporate india has intensified hiring for leadership roles despite a slowdown in entry level recruitment according to search firms which expect a possible shortage of senior executives to meet the demand in the new year executives at search firms et spoke with said they expect at least a \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e increase in search mandates for cxos in \u003cTWO_THOUSAND\u003e the momentum has been building up for the past few months said heidrick struggles partner suresh raina today we are in conversations with senior leaders for cxo roles who have at least one more offer in hand and hence are quite selective hiring action is mostly concentrated at the senior levels due to increased confidence in the economy said experts the entry and middle levels are not seeing much action due to the aftereffects of over hiring in \u003cTWO_THOUSAND\u003e that are still being felt they said the executives said their companies are conducting searches for roles such as chief executive officer chief financial officer chief technology information officer chief business officer chief marketing officer chief operations officer and chief hr officer","timestamp":"2023-12-23T12:13:00+05:30","market_timestamp":"2023-12-25T09:15:00+05:30","off_market_hours":true}