{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-investigating-ransomware-attack-on-a-project/articleshow/106147519.cms","title":"HCLTech investigating ransomware attack on isolated cloud project","description":"The ransomware incident occurred in an isolated cloud environment for one of HLCTech's projects but there has been no impact observed due to this incident on the overall HCLTech network.","content":"HCLTech said on Wednesday that one of its isolated cloud environments was subject to a ransomware attack and the company is investigating the matter. “This is to inform you that HCLTech has become aware of a ransomware incident in an isolated cloud environment for one of its projects. There has been no impact observed due to this incident on the overall HCLTech network,” the Noida-based company said in an exchange filing on Wednesday. The company added that data protection and cybersecurity is a top priority. “A detailed investigation is underway in consultation with relevant stakeholders to assess the root cause and take remedial action as necessary,” the statement added. The company’s shares traded flat on the BSE during morning trade. The disclosure was made before the markets opened for trading. This attack comes at a time when the IT services sector is facing sustained macro-economic headwinds impacting technology spending. ","cleaned_content":"hcltech said on wednesday that one of its isolated cloud environments was subject to a ransomware attack and the company is investigating the matter this is to inform you that hcltech has become aware of a ransomware incident in an isolated cloud environment for one of its projects there has been no impact observed due to this incident on the overall hcltech network the noida based company said in an exchange filing on wednesday the company added that data protection and cybersecurity is a top priority a detailed investigation is underway in consultation with relevant stakeholders to assess the root cause and take remedial action as necessary the statement added the company s shares traded flat on the bse during morning trade the disclosure was made before the markets opened for trading this attack comes at a time when the it services sector is facing sustained macro economic headwinds impacting technology spending","timestamp":"2023-12-20T13:00:00+05:30","market_timestamp":"2023-12-20T13:00:00+05:30","off_market_hours":false}