{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-appoints-richard-lobo-as-its-chief-people-officer/articleshow/106512543.cms","title":"Tech Mahindra appoints Richard Lobo as its chief people officer","description":"Lobo served as an “exclusive” advisor to troubled edtech Byju’s and was with Infosys for 23 years before that.","content":"Former Infosys chief human resource officer Richard Lobo has joined Tech Mahindra in the role of its chief people officer. This comes as the IT services sector continues to see a wave of senior-level churn. In December, former Infosys president Mohit Joshi took over as the CEO of Tech Mahindra.The company announced Lobo’s appointment on social media.In August 2023, Infosys's Lobo resigned from the firm after a 23-year stint at Infosys to work briefly with edtech major Byju’s. Joshi has already introduced a host of leadership changes in the organisation even as it has seen its share of senior leadership churn since his appointment was announced. Harshvendra Soin, global chief people officer \u0026 head - marketing, Tech Mahindra has been elevated to president APJ, telecom and enterprise business and has moved to Australia. Manish Vyas, head of the communications vertical, has moved on from the company. Dhanashree Bhat who was chief delivery officer of the communications, media, and telecom (CMT) group left the company to join as chief operating officer at Persistent Systems.","cleaned_content":"former infosys chief human resource officer richard lobo has joined tech mahindra in the role of its chief people officer this comes as the it services sector continues to see a wave of senior level churn in december former infosys president mohit joshi took over as the ceo of tech mahindra the company announced lobo s appointment on social media in august \u003cTWO_THOUSAND\u003e infosyss lobo resigned from the firm after a \u003cTWO_TEN\u003e year stint at infosys to work briefly with edtech major byju s joshi has already introduced a host of leadership changes in the organisation even as it has seen its share of senior leadership churn since his appointment was announced harshvendra soin global chief people officer head marketing tech mahindra has been elevated to president apj telecom and enterprise business and has moved to australia manish vyas head of the communications vertical has moved on from the company dhanashree bhat who was chief delivery officer of the communications media and telecom cmt group left the company to join as chief operating officer at persistent systems","timestamp":"2024-01-03T19:56:00+05:30","market_timestamp":"2024-01-04T09:15:00+05:30","off_market_hours":true}