{"url":"https://economictimes.indiatimes.com/tech/information-tech/make-first-design-next-banmali-agrawala-new-chairman-of-tata-advanced-systems/articleshow/106639169.cms","title":"Make first, design next: Banmali Agrawala, new chairman of Tata Advanced Systems","description":"Speaking at the Global Investors Meet (GIM) in Chennai, Banmali Agrawala, who is the chairman of the aerospace and defence solutions unit of Tata Sons said semiconductor fabrication was necessary, despite being capital intensive.","content":"Banmali Agrawala of Tata Advanced Systems (TASL) on Monday said the notion that one can 'leapfrog' into design without understanding manufacturing reflects an improper understanding of the manufacturing process.The chairman of the aerospace and defence solutions unit of Tata Sons was the keynote address at one of the sessions of the Global Investors Meet (GIM) in Chennai.\"It's like somebody saying I can try cooking (a) recipe without knowing how to cook,\" he said. \"It doesn't work. If we want to develop Indian brands, we had better know how to make them. Then we shall know how to design and yes, sooner or later, then we can graduate to a stage when design itself gets to be such a unique component and feature that we can then get it made elsewhere. But we've got to simply start by manufacturing. We cannot leapfrog straight into high-end design.\"Agrawala went on to make a case for why fabrication was necessary, despite being capital intensive. He said it was important as these things teach the country lessons and set things up for the future.\"I certainly think we can set up a fab,\" he said. \"Is it expensive? Yes, it is. But then, someone's got to do it. And it's got to get done. And in this dimension, when it comes to semiconductors, let us appreciate that since we don't have technology. We're going to have to buy it and then develop it on the back of that.\"","cleaned_content":"banmali agrawala of tata advanced systems tasl on monday said the notion that one can leapfrog into design without understanding manufacturing reflects an improper understanding of the manufacturing process the chairman of the aerospace and defence solutions unit of tata sons was the keynote address at one of the sessions of the global investors meet gim in chennai its like somebody saying i can try cooking a recipe without knowing how to cook he said it doesnt work if we want to develop indian brands we had better know how to make them then we shall know how to design and yes sooner or later then we can graduate to a stage when design itself gets to be such a unique component and feature that we can then get it made elsewhere but weve got to simply start by manufacturing we cannot leapfrog straight into high end design agrawala went on to make a case for why fabrication was necessary despite being capital intensive he said it was important as these things teach the country lessons and set things up for the future i certainly think we can set up a fab he said is it expensive yes it is but then someones got to do it and its got to get done and in this dimension when it comes to semiconductors let us appreciate that since we dont have technology were going to have to buy it and then develop it on the back of that","timestamp":"2024-01-08T17:17:00+05:30","market_timestamp":"2024-01-09T09:15:00+05:30","off_market_hours":true}