{"url":"https://economictimes.indiatimes.com/tech/information-tech/poaching-row-cognizant-cmd-rajesh-nambiar-says-no-impact-on-business/articleshow/106672796.cms","title":"Poaching Row: Nasscom chairperson says no impact on industry","description":"Amid employee poaching allegations levelled by two domestic IT firms, Nasscom Chairperson Rajesh Nambiar said the issue has not impacted the industry's business and operations.","content":"Amid employee poaching allegations levelled by two domestic IT firms, Nasscom Chairperson Rajesh Nambiar said the issue has not impacted the industry's business and operations. Nambiar refused to be drawn into specifics of the matter but said if companies want to enforce contracts they have with employees, \"it is certainly their prerogative\".He, however, said that there cannot be a broader industry-wide norm on non-poaching.\"There is not going to be a broader industry-wide norm saying you can't hire from each other...because this industry was built by talent moving from one company to the other, so there should not be any issue in terms of having the right flow, as long as it is done within the broader framework of how the employment contracts work.\"The issue has not impacted Cognizant, he asserted, when asked if the pitched battle has affected the company.\"It does not affect us at all. None of this has affected us. As in, if you are talking about Cognizant, I don't think there is any impact whatsoever for us. And it should not have any impact on the industry as well,\" said Nambiar, who is also Cognizant India Chairman and Managing Director.","cleaned_content":"amid employee poaching allegations levelled by two domestic it firms nasscom chairperson rajesh nambiar said the issue has not impacted the industrys business and operations nambiar refused to be drawn into specifics of the matter but said if companies want to enforce contracts they have with employees it is certainly their prerogative he however said that there cannot be a broader industry wide norm on non poaching there is not going to be a broader industry wide norm saying you cant hire from each other because this industry was built by talent moving from one company to the other so there should not be any issue in terms of having the right flow as long as it is done within the broader framework of how the employment contracts work the issue has not impacted cognizant he asserted when asked if the pitched battle has affected the company it does not affect us at all none of this has affected us as in if you are talking about cognizant i dont think there is any impact whatsoever for us and it should not have any impact on the industry as well said nambiar who is also cognizant india chairman and managing director","timestamp":"2024-01-10T16:54:00+05:30","market_timestamp":"2024-01-11T09:15:00+05:30","off_market_hours":true}