{"url":"https://economictimes.indiatimes.com/tech/information-tech/srinivas-satya-to-head-supply-chain-and-component-business-unit-at-tata-electronics/articleshow/106996768.cms","title":"Srinivas Satya to head supply chain and component business unit at Tata Electronics","description":"Previously, Srinivas Satya was the former president and managing director of Applied Materials India for eight years. Tata Electronics said he brings extensive experience in managing large organizations and delivering strong business growth in the electronics industry.","content":"Tata Electronics on Friday said it has appointed Srinivas Satya as the head of supply chain and component business unit. \"We are delighted to have Srinivas join our team,\" Dr. Randhir Thakur, CEO \u0026 managing director, Tata Electronics said in a statement. \"His extensive leadership experience, passion for performance, and customer orientation strengthens our component business unit and supply chain. We look forward to his contributions to drive the next phase of growth at Tata Electronics.\" ET had reported on Wednesday that Satya was taking over to drive the components business as the conglomerate, which is involved in domestic precision machining and assembly for electronics components manufacturing, looks to deepen its presence in the semiconductor fabrication and packaging segments. Satya was the former president and managing director of Applied Materials India for eight years and Tata Electronics said he brings extensive experience in managing large organizations and delivering strong business growth in the electronics industry. \"I am honoured to be part of the Tata family,\" Satya said. \"Creating a sustainable and robust semiconductor manufacturing industry requires a bold vision and tenacity. The Tata group is uniquely positioned to enable this vision and I look forward to contributing my expertise to drive growth.\"","cleaned_content":"tata electronics on friday said it has appointed srinivas satya as the head of supply chain and component business unit we are delighted to have srinivas join our team dr randhir thakur ceo managing director tata electronics said in a statement his extensive leadership experience passion for performance and customer orientation strengthens our component business unit and supply chain we look forward to his contributions to drive the next phase of growth at tata electronics et had reported on wednesday that satya was taking over to drive the components business as the conglomerate which is involved in domestic precision machining and assembly for electronics components manufacturing looks to deepen its presence in the semiconductor fabrication and packaging segments satya was the former president and managing director of applied materials india for eight years and tata electronics said he brings extensive experience in managing large organizations and delivering strong business growth in the electronics industry i am honoured to be part of the tata family satya said creating a sustainable and robust semiconductor manufacturing industry requires a bold vision and tenacity the tata group is uniquely positioned to enable this vision and i look forward to contributing my expertise to drive growth","timestamp":"2024-01-19T22:42:00+05:30","market_timestamp":"2024-01-22T09:15:00+05:30","off_market_hours":true}