{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-to-diversify-to-other-markets-amid-us-weakness/articleshow/106848026.cms","title":"TCS to diversify to other markets amid US weakness","description":"The plan to diversify more comes after the industry leader reported its slowest quarterly profit growth since 2020, and revenue contributions from its mainstay market, North America, have declined for four straight quarters.","content":"India's No.1 software-services exporter Tata Consultancy Services is planning to focus more on markets such as Japan, Latin America and Southern Europe amid weakness in North America, its chief executive said. The plan to diversify more comes after the industry leader reported its slowest quarterly profit growth since 2020, and revenue contributions from its mainstay market, North America, have declined for four straight quarters. \"I wouldn't say we are consciously reducing our North America exposure, but we are consciously increasing our play in other geographies because we want to work more in markets like Latin America, Southern Europe or Japan,\" K. Krithivasan said. North America has been vital for the $245 billion Indian information technology sector, with several companies deriving over half their revenue from the region. IT clients there have been reluctant to spend on discretionary projects in recent quarters amid inflationary pressures and economic uncertainty. That is making TCS look at other markets with a lot of headroom for growth despite language and other barriers.","cleaned_content":"indias no 1 software services exporter tata consultancy services is planning to focus more on markets such as japan latin america and southern europe amid weakness in north america its chief executive said the plan to diversify more comes after the industry leader reported its slowest quarterly profit growth since \u003cTWO_THOUSAND\u003e and revenue contributions from its mainstay market north america have declined for four straight quarters i wouldnt say we are consciously reducing our north america exposure but we are consciously increasing our play in other geographies because we want to work more in markets like latin america southern europe or japan k krithivasan said north america has been vital for the \u003cTWO_HUNDRED\u003e billion indian information technology sector with several companies deriving over half their revenue from the region it clients there have been reluctant to spend on discretionary projects in recent quarters amid inflationary pressures and economic uncertainty that is making tcs look at other markets with a lot of headroom for growth despite language and other barriers","timestamp":"2024-01-15T07:39:00+05:30","market_timestamp":"2024-01-15T09:15:00+05:30","off_market_hours":true}