{"url":"https://economictimes.indiatimes.com/tech/information-tech/its-not-so-bad-dalal-street-indices-soar-to-fresh-highs/articleshow/106802538.cms","title":"IT's not so bad: Dalal Street indices soar to fresh highs","description":"The Nifty IT index jumped 5.1% with Infosys soaring 8% and TCS rising 3.9% after their December quarter results and the associated commentary kept hopes alive that the environment may not deteriorate further.","content":"Mumbai: Indian stocks rose to fresh all-time closing levels on Friday led by a surge in information technology shares as investors judged the third-quarter earnings of sector leaders-TCS and Infosys-weren't as adverse as expected. The optimism inspired markets to overlook the escalating tensions in the Red Sea, which caused a jump in oil prices to $80 a barrel, and a hotter US consumer inflation report in December.The BSE Sensex gained 847.27 points, or 1.2%, to close at 72,568.45, off the record high of 72,720.96. The NSE Nifty was up 247.35 points, or 1.14%, to close at 21,894.55 after touching an all-time high of 21,928.25.The Nifty IT index jumped 5.1% with Infosys soaring 8% and TCS rising 3.9% after their December quarter results and the associated commentary kept hopes alive that the environment may not deteriorate further.\"The numbers were nothing stellar but sometimes no bad news is also well received by the markets with loud applause,\" said Aamar Deo Singh, head of advisory at brokerage AngelOne.Foreign portfolio investors (FPIs) sold shares worth a net ₹340.05 crore on Friday. Domestic institutions were buyers to the tune of ₹2,911.19 crore.","cleaned_content":"mumbai indian stocks rose to fresh all time closing levels on friday led by a surge in information technology shares as investors judged the third quarter earnings of sector leaders tcs and infosys werent as adverse as expected the optimism inspired markets to overlook the escalating tensions in the red sea which caused a jump in oil prices to \u003cEIGHT_TEN\u003e a barrel and a hotter us consumer inflation report in december the bse sensex gained \u003cEIGHT_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to close at \u003cSEVEN_TEN_THOUSAND\u003e off the record high of \u003cSEVEN_TEN_THOUSAND\u003e the nse nifty was up \u003cTWO_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to close at \u003cTWO_TEN_THOUSAND\u003e after touching an all time high of \u003cTWO_TEN_THOUSAND\u003e the nifty it index jumped \u003cFIVE_PERCENT\u003e with infosys soaring \u003cEIGHT_PERCENT\u003e and tcs rising \u003cTHREE_PERCENT\u003e after their december quarter results and the associated commentary kept hopes alive that the environment may not deteriorate further the numbers were nothing stellar but sometimes no bad news is also well received by the markets with loud applause said aamar deo singh head of advisory at brokerage angelone foreign portfolio investors fpis sold shares worth a net \u003cTHREE_HUNDRED\u003e crore on friday domestic institutions were buyers to the tune of \u003cTWO_THOUSAND\u003e crore","timestamp":"2024-01-13T07:55:00+05:30","market_timestamp":"2024-01-15T09:15:00+05:30","off_market_hours":true}