{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-charged-225-penalty-by-us-authority-on-tax-violation/articleshow/107238162.cms","title":"Infosys charged $225 penalty by US authority on tax violation","description":"On January 25, the Nevada Department of Taxation sent a communication to the Bengaluru-based software services exporter for collection of penalty. The violation(s)/contravention(s) committed or alleged to be committed is “short payment of modified business tax for Q4 2021 to Q1 2022”, Infosys said in the disclosure on Monday evening.","content":"IT major Infosys has been penalised $225 for the alleged violation of “short payment of modified business tax” for two quarters by the US taxation authority, the company said in a stock exchange disclosure.On January 25, the Nevada Department of Taxation sent a communication to the Bengaluru-based software services exporter for collection of penalty. The violation(s)/contravention(s) committed or alleged to be committed is “short payment of modified business tax for Q4 2021 to Q1 2022”, Infosys said in the disclosure on Monday evening.Short payment refers to partial or reduced payment made that is lesser than the invoiced amount. The company is in the process of determining further steps post checking the veracity, Infosys further said.The company said there is no material impact on financials, operations or other activities of the company.In August last year, a similar penalty worth $76.92 was imposed by Florida department of revenue for a shortfall of payment of tax on Infosys.","cleaned_content":"it major infosys has been penalised \u003cTWO_HUNDRED\u003e for the alleged violation of short payment of modified business tax for two quarters by the us taxation authority the company said in a stock exchange disclosure on january \u003cTWO_TEN\u003e the nevada department of taxation sent a communication to the bengaluru based software services exporter for collection of penalty the violation s contravention s committed or alleged to be committed is short payment of modified business tax for q4 \u003cTWO_THOUSAND\u003e to q1 \u003cTWO_THOUSAND\u003e infosys said in the disclosure on monday evening short payment refers to partial or reduced payment made that is lesser than the invoiced amount the company is in the process of determining further steps post checking the veracity infosys further said the company said there is no material impact on financials operations or other activities of the company in august last year a similar penalty worth \u003cSEVEN_TEN\u003e was imposed by florida department of revenue for a shortfall of payment of tax on infosys","timestamp":"2024-01-29T20:34:00+05:30","market_timestamp":"2024-01-30T09:15:00+05:30","off_market_hours":true}