{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-ion-loses-oxford-university-contract/articleshow/107091385.cms","title":"TCS iON loses Oxford University contract","description":"Oxford University had selected TCS iON, the learning and assessments-focused unit of TCS, in April 2023 to use its platform to conduct the admission tests. The university told ET some candidates faced technical problems during the delivery of this year’s online admissions tests, following which TCS will not be involved in their admissions tests.","content":"The University of Oxford has ended its deal with Tata Consultancy Services iON citing “technical problems”, less than a year after hiring it to deliver a share of the university's admission tests.“Following the technical problems experienced by some candidates during the delivery of this year’s online admissions tests by a new provider, TCS will not be involved in the delivery of Oxford admissions tests going forward,” spokespersons for the university said in an emailed statement to ET.TCS didn’t immediately respond to ET’s email seeking comment.The university had selected TCS iON, the learning and assessments-focused unit of TCS, in April 2023 to use its platform to conduct the admission tests, replacing the Cambridge Admissions Assessment Testing, for certain streams. At the time of announcing the deal, the university had stated that it would take stakeholder's feedback on the ease of navigating these tests throughout the development process.“This decision has been made following careful consideration of the issues, as well as feedback from candidates, teachers and test centres. Our priority is to ensure a high-quality experience for all candidates and those involved in supporting them…,” the statement said. “Details of the new arrangements will be communicated in the Spring, at the start of the next admissions round,” it said.","cleaned_content":"the university of oxford has ended its deal with tata consultancy services ion citing technical problems less than a year after hiring it to deliver a share of the universitys admission tests following the technical problems experienced by some candidates during the delivery of this year s online admissions tests by a new provider tcs will not be involved in the delivery of oxford admissions tests going forward spokespersons for the university said in an emailed statement to et tcs didn t immediately respond to et s email seeking comment the university had selected tcs ion the learning and assessments focused unit of tcs in april \u003cTWO_THOUSAND\u003e to use its platform to conduct the admission tests replacing the cambridge admissions assessment testing for certain streams at the time of announcing the deal the university had stated that it would take stakeholders feedback on the ease of navigating these tests throughout the development process this decision has been made following careful consideration of the issues as well as feedback from candidates teachers and test centres our priority is to ensure a high quality experience for all candidates and those involved in supporting them the statement said details of the new arrangements will be communicated in the spring at the start of the next admissions round it said","timestamp":"2024-01-23T22:36:00+05:30","market_timestamp":"2024-01-24T09:15:00+05:30","off_market_hours":true}