{"url":"https://economictimes.indiatimes.com/tech/information-tech/freshworks-cro-pradeep-rathinam-quits-abe-smith-named-global-field-operations-chief/articleshow/107482550.cms","title":"Freshworks CRO Pradeep Rathinam quits; Abe Smith named global field operations chief","description":"Freshworks has hired Abe Smith, former executive at Zoom, as its Chief of Global Field Operations. The company's Chief Revenue Officer, Pradeep Rathinam, will be leaving at the end of the month. Freshworks reported a 20% increase in total revenues to $160 million for Q4, with a net loss of $28 million.","content":"Customer relationship management (CRM)-software provider, Freshworks has roped in former Zoom executive Abe Smith as chief of its global field operations. This comes as the company’s chief revenue officer Pradeep Rathinam will leave the firm at the end of this month, the company told analysts on Wednesday. Rathinam previously founded artificial intelligence (AI)-based customer service automation company, AnswerIQ back in 2017. Before being appointed as the company’s revenue chief, Rahinam also served as the chief customer officer of the company between 2020 to 2022. With nearly 25 years of experience across technology giants, Zoom, Oracle and Cisco, Smith will lead Freshwork’s field sales team to scale the business. “Our field sales team will be led by Abe Smith, who I'm excited to announce has joined as our Chief of Global Field Operations this week … With these changes in the organisation, Pradeep Rathinam, our CRO, will be departing Freshworks at the end of this month. Pradeep stepped up to lead and stabilize our go-to-market teams during a transition period and delivered a strong Q4 to finish out the year,” Dennis Woodside, president at Freshworks told analysts during the company’s Q4 earnings call. ","cleaned_content":"customer relationship management crm software provider freshworks has roped in former zoom executive abe smith as chief of its global field operations this comes as the company s chief revenue officer pradeep rathinam will leave the firm at the end of this month the company told analysts on wednesday rathinam previously founded artificial intelligence ai based customer service automation company answeriq back in \u003cTWO_THOUSAND\u003e before being appointed as the company s revenue chief rahinam also served as the chief customer officer of the company between \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e with nearly \u003cTWO_TEN\u003e years of experience across technology giants zoom oracle and cisco smith will lead freshwork s field sales team to scale the business our field sales team will be led by abe smith who im excited to announce has joined as our chief of global field operations this week with these changes in the organisation pradeep rathinam our cro will be departing freshworks at the end of this month pradeep stepped up to lead and stabilize our go to market teams during a transition period and delivered a strong q4 to finish out the year dennis woodside president at freshworks told analysts during the company s q4 earnings call","timestamp":"2024-02-07T13:30:00+05:30","market_timestamp":"2024-02-07T13:30:00+05:30","off_market_hours":false}