{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-signs-multi-year-contract-with-singapores-pacific-international-lines/articleshow/107664365.cms","title":"Infosys signs multi-year contract with Singapore’s Pacific International Lines","description":"The multi-year, multi-phased collaboration seeks to address critical business challenges such as modernizing web and mobile applications, enhancing scalability, and providing advisory services on the latest technology and business trends, it added. Deal financials remained undisclosed.","content":"Infosys has signed a multi-year contract with Singaporean shipping company Pacific International Lines (PIL) to accelerate PIL’s digital transformation initiative and help revamp PIL’s existing customer portal and deploy a scalable and modern technology platform.“This will enable PIL to further their ‘Driving Connectivity’ mission, which is aimed at connecting their businesses across the markets that they serve. In addition, PIL's web and mobile applications will undergo a comprehensive overhaul to simplify user experience and enhance customer engagement,” Infosys said in a statement on the exchange.The multi-year, multi-phased collaboration seeks to address critical business challenges such as modernizing web and mobile applications, enhancing scalability, and providing advisory services on the latest technology and business trends, it added. Deal financials remained undisclosed.Bengaluru-headquartered Infosys will provide the technical backbone for performance and scalability of the revamped portal.“We are looking for a partner who can not only bring technology but also play an advisory role in the journey of transformation. Infosys brings together a strong combination of right capabilities as well as highly collaborative ways of working,” said Lionel Patrice Chatelet, chief commercial officer at PIL.","cleaned_content":"infosys has signed a multi year contract with singaporean shipping company pacific international lines pil to accelerate pil s digital transformation initiative and help revamp pil s existing customer portal and deploy a scalable and modern technology platform this will enable pil to further their driving connectivity mission which is aimed at connecting their businesses across the markets that they serve in addition pils web and mobile applications will undergo a comprehensive overhaul to simplify user experience and enhance customer engagement infosys said in a statement on the exchange the multi year multi phased collaboration seeks to address critical business challenges such as modernizing web and mobile applications enhancing scalability and providing advisory services on the latest technology and business trends it added deal financials remained undisclosed bengaluru headquartered infosys will provide the technical backbone for performance and scalability of the revamped portal we are looking for a partner who can not only bring technology but also play an advisory role in the journey of transformation infosys brings together a strong combination of right capabilities as well as highly collaborative ways of working said lionel patrice chatelet chief commercial officer at pil","timestamp":"2024-02-13T18:31:00+05:30","market_timestamp":"2024-02-14T09:15:00+05:30","off_market_hours":true}