{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-acquires-us-insurtech-firm-aggne-global-for-66-million/articleshow/107664664.cms","title":"Wipro acquires US insurtech firm Aggne Global for $66 million","description":"Wipro will acquire 60% of the company in an all-cash deal, with an option to purchase the remaining stake over a period of time, as per a stock exchange filing. Revenues of the Aggne Group are $4.5 million for calendar year 2021, $9.1 million for 2022, and $17.9 million 2023.","content":"Wipro, India’s fourth largest information technology (IT) services firm, on Tuesday said it will acquire US-based insurtech firm Aggne Global Inc and its Hyderabad-based affiliate Aggne Global IT Services for $66 million.Wipro will acquire 60% of the company in an all-cash deal, with an option to purchase the remaining stake over a period of time, as per a stock exchange filing.Revenues of the Aggne Group are $4.5 million for calendar year 2021, $9.1 million for 2022, and $17.9 million 2023.The transaction is expected to be completed at the latest by February 14, 2024, subject to customary closing adjustments as per terms of the purchase agreement.“This acquisition of Aggne will strengthen Wipro’s competitive advantage in the insurance sector—particularly in the property \u0026 casualty (P\u0026C) insurance space. This combination will enhance Wipro’s P\u0026C core system implementation capabilities specifically in the area of Duck Creek. Aggne’s Swift IPs combined with Wipro’s wider offerings will position us as an end-to-end player in the P\u0026C insurance space,” the IT company said in the release.","cleaned_content":"wipro india s fourth largest information technology it services firm on tuesday said it will acquire us based insurtech firm aggne global inc and its hyderabad based affiliate aggne global it services for \u003cSIX_TEN\u003e million wipro will acquire \u003cSIX_TEN_PERCENT\u003e of the company in an all cash deal with an option to purchase the remaining stake over a period of time as per a stock exchange filing revenues of the aggne group are \u003cFOUR_\u003e million for calendar year \u003cTWO_THOUSAND\u003e \u003cNINE_\u003e million for \u003cTWO_THOUSAND\u003e and \u003cONE_TEN\u003e million \u003cTWO_THOUSAND\u003e the transaction is expected to be completed at the latest by february \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e subject to customary closing adjustments as per terms of the purchase agreement this acquisition of aggne will strengthen wipro s competitive advantage in the insurance sector particularly in the property casualty p c insurance space this combination will enhance wipro s p c core system implementation capabilities specifically in the area of duck creek aggne s swift ips combined with wipro s wider offerings will position us as an end to end player in the p c insurance space the it company said in the release","timestamp":"2024-02-13T18:38:00+05:30","market_timestamp":"2024-02-14T09:15:00+05:30","off_market_hours":true}