{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-under-fire-for-failing-to-create-jobs-in-karnataka/articleshow/107689002.cms","title":"Infosys under fire for failing to create jobs in Karnataka","description":"During the Karnataka state legislature's budget session, Arvind Bellad criticizes Infosys for not delivering on job creation. Priyank Kharge suggests withdrawing incentives and land in cases of non-performance. MB Patil promises to investigate and ensures jobs at Foxconn's plant in Doddaballapur.","content":"Karnataka BJP MLA Arvind Bellad has criticised Infosys, India’s second-largest Indian IT major, saying that the company acquired 58 acres of land in his home constituency of Hubli-Dharwad West to create a campus and promising jobs but failed to do so.Addressing the state Assembly on Wednesday, Bellad, who is also Deputy Leader of the Opposition, called it “betrayal at its finest” and demanded the state government take back the land.According to him, Infosys acquired 58 acres of land in the industrial estate about ten years ago. He further said that the Bengaluru-headquartered IT giant purchased the land which had a market rate of Rs 1.5 crore per acre but paid only Rs 35 lakh per acre to the farmers promising they will set up a campus and provide employment.However, he claims, the company has not created a single job. Infosys did not immediately respond to an email seeking comments on the MLA’s statement.","cleaned_content":"karnataka bjp mla arvind bellad has criticised infosys india s second largest indian it major saying that the company acquired \u003cFIVE_TEN\u003e acres of land in his home constituency of hubli dharwad west to create a campus and promising jobs but failed to do so addressing the state assembly on wednesday bellad who is also deputy leader of the opposition called it betrayal at its finest and demanded the state government take back the land according to him infosys acquired \u003cFIVE_TEN\u003e acres of land in the industrial estate about ten years ago he further said that the bengaluru headquartered it giant purchased the land which had a market rate of rs \u003cONE_\u003e crore per acre but paid only rs \u003cTHREE_TEN\u003e lakh per acre to the farmers promising they will set up a campus and provide employment however he claims the company has not created a single job infosys did not immediately respond to an email seeking comments on the mla s statement","timestamp":"2024-02-14T15:30:00+05:30","market_timestamp":"2024-02-14T15:30:00+05:30","off_market_hours":false}