{"url":"https://economictimes.indiatimes.com/tech/information-tech/genpact-expects-fy24-revenue-to-remain-sluggish-fy23-growth-slows-to-4/articleshow/107560865.cms","title":"Genpact expects FY24 revenue to remain sluggish, FY23 growth slows to 4%","description":"Genpact forecasts total revenue for Q1FY24 in the range of $1.108-1.114 billion representing a modest growth of 1.75-2.25%. The growth on a constant currency basis is projected in the range of 1.95% to 2.45%. Gross margins are expected to remain flat at 35%. Full-year revenue growth is expected to remain lower in the range of 2-3% yoy in the range of $4.57 billion to $4.61 billion.","content":"Global professional services and business process management firm Genpact on Thursday posted a jump in its fourth-quarter net profit at $291.3 million, rising 225% year-on-year (yoy) driven by a non-recurring tax benefit of $170 million related to an intercompany transfer of intellectual property. The net profit without the tax benefit stood at $121 million as compared to $90 million a year ago and $118 million in the preceding quarter.The revenue for the quarter ended December rose 4% to $1.15 billion, beating expectations. Sequentially, the revenues grew marginally from $1.14 billion in Q3.“While the macroeconomic environment remains challenging, we have identified and begun to implement several key initiatives to improve execution. Looking ahead, 2024 will be a year of strengthening our foundation for future growth,” said president and chief executive officer Balkrishan (BK) Kalra.Genpact forecasts total revenue for Q1FY24 in the range of $1.108-1.114 billion representing a modest growth of 1.75-2.25%. The growth on a constant currency basis is projected in the range of 1.95% to 2.45%. Gross margins are expected to remain flat at 35%.Full-year revenue growth is expected to remain lower in the range of 2-3% yoy in the range of $4.57 billion to $4.61 billion.","cleaned_content":"global professional services and business process management firm genpact on thursday posted a jump in its fourth quarter net profit at \u003cTWO_HUNDRED\u003e million rising \u003cTWO_HUNDRED_PERCENT\u003e year on year yoy driven by a non recurring tax benefit of \u003cONE_HUNDRED\u003e million related to an intercompany transfer of intellectual property the net profit without the tax benefit stood at \u003cONE_HUNDRED\u003e million as compared to \u003cNINE_TEN\u003e million a year ago and \u003cONE_HUNDRED\u003e million in the preceding quarter the revenue for the quarter ended december rose \u003cFOUR_PERCENT\u003e to \u003cONE_\u003e billion beating expectations sequentially the revenues grew marginally from \u003cONE_\u003e billion in q3 while the macroeconomic environment remains challenging we have identified and begun to implement several key initiatives to improve execution looking ahead \u003cTWO_THOUSAND\u003e will be a year of strengthening our foundation for future growth said president and chief executive officer balkrishan bk kalra genpact forecasts total revenue for q1fy24 in the range of \u003cONE_\u003e \u003cONE_\u003e billion representing a modest growth of \u003cONE_\u003e \u003cTWO_PERCENT\u003e the growth on a constant currency basis is projected in the range of \u003cONE_PERCENT\u003e to \u003cTWO_PERCENT\u003e gross margins are expected to remain flat at \u003cTHREE_TEN_PERCENT\u003e full year revenue growth is expected to remain lower in the range of \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e yoy in the range of \u003cFOUR_\u003e billion to \u003cFOUR_\u003e billion","timestamp":"2024-02-09T19:09:00+05:30","market_timestamp":"2024-02-12T09:15:00+05:30","off_market_hours":true}