{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-sounds-final-call-for-staff-to-work-from-office/articleshow/107476901.cms","title":"TCS sounds final call for staff to work from office","description":"In the fiscal third quarter, India's second largest IT firm Infosys said one of its US units was affected by a cyber security issue, resulting in the unavailability of several applications. In December, HCLTech reported a ransomware incident, adding that it had made no impact.","content":"MUMBAI: Tata Consultancy Services (TCS) has extended the period by which employees should return to office by another quarter, to March end, but has informed them that this will be the last deadline for doing so. Failure to resume work from office (WFO) by then will lead to \"consequences,\" chief operating officer NG Subramaniam, told ET, citing work culture as well as security issues.\"We are exercising patience but have taken a principled stand that employees have to get back to offices,\" he said. \"We have sent employees the final communication on this and if they do not, there will be consequences to face.\"He said working from home made employees and employers vulnerable.\"With the kind of cyberattacks in today's context, an organisation can inadvertently get into trouble,\" he said. \"One cannot have the kind of controls at home and there can be security risks to businesses.In the fiscal third quarter, India's second largest IT firm Infosys said one of its US units was affected by a cyber security issue, resulting in the unavailability of several applications. In December, HCLTech reported a ransomware incident, adding that it had made no impact.","cleaned_content":"mumbai tata consultancy services tcs has extended the period by which employees should return to office by another quarter to march end but has informed them that this will be the last deadline for doing so failure to resume work from office wfo by then will lead to consequences chief operating officer ng subramaniam told et citing work culture as well as security issues we are exercising patience but have taken a principled stand that employees have to get back to offices he said we have sent employees the final communication on this and if they do not there will be consequences to face he said working from home made employees and employers vulnerable with the kind of cyberattacks in todays context an organisation can inadvertently get into trouble he said one cannot have the kind of controls at home and there can be security risks to businesses in the fiscal third quarter indias second largest it firm infosys said one of its us units was affected by a cyber security issue resulting in the unavailability of several applications in december hcltech reported a ransomware incident adding that it had made no impact","timestamp":"2024-02-06T23:37:00+05:30","market_timestamp":"2024-02-07T09:15:00+05:30","off_market_hours":true}