{"url":"https://economictimes.indiatimes.com/tech/information-tech/one-point-one-solutions-acquires-itcube-solutions-for-rs-84-crore/articleshow/107919850.cms","title":"One Point One Solutions acquires ITCube Solutions for Rs 84 crore","description":"Navi Mumbai-based One Point One Solutions is set to acquire ITCube Solutions for Rs 84 crore, expanding its presence in the KPO and BPO sectors. The acquisition will also provide entry into medical services and manufacturing commerce, while driving profitability through automation and expanding into international markets.","content":"One Point One Solutions, a Navi Mumbai-based business process management service provider, marked its overseas foray by announcing its first acquisition of smaller IT-enabled services firm ITCube Solutions for Rs 84 crore.The company’s board “approved the acquisition of 100% stake in ITCUBE Solutions Private Limited (ITCube) for a consideration Rs. 84,00,04,632 (Rupees Eighty Four Crore Four Thousand Six Hundred Thirty Two Only) in one or more tranches,” One Point One Solutions said in a regulatory filing.“We have our business only in India at present and the fastest way to grow was through an acquisition. This company has a lot of business in the KPO (Knowledge Process Outsourcing) and BPO (business process outsourcing) business with around 80 per cent coming from it and rest 20 per cent is from IT-enabled services segment,” said Akshay Chhabra, managing director, One Point One Solutions.The NSE-listed firm expects to complete the transaction by 1 April, 2026.Chhabra said the deal will also give One Point One Solutions entry into two verticals - the medical services in the US and in the manufacturing commerce space where ITCube has a large client in a B2B construction exchange.","cleaned_content":"one point one solutions a navi mumbai based business process management service provider marked its overseas foray by announcing its first acquisition of smaller it enabled services firm itcube solutions for rs \u003cEIGHT_TEN\u003e crore the company s board approved the acquisition of \u003cONE_HUNDRED_PERCENT\u003e stake in itcube solutions private limited itcube for a consideration rs \u003cEIGHT_HUNDRED_MILLION\u003e rupees eighty four crore four thousand six hundred thirty two only in one or more tranches one point one solutions said in a regulatory filing we have our business only in india at present and the fastest way to grow was through an acquisition this company has a lot of business in the kpo knowledge process outsourcing and bpo business process outsourcing business with around \u003cEIGHT_TEN_PERCENT\u003e coming from it and rest \u003cTWO_TEN_PERCENT\u003e is from it enabled services segment said akshay chhabra managing director one point one solutions the nse listed firm expects to complete the transaction by \u003cONE_\u003e april \u003cTWO_THOUSAND\u003e chhabra said the deal will also give one point one solutions entry into two verticals the medical services in the us and in the manufacturing commerce space where itcube has a large client in a b2b construction exchange","timestamp":"2024-02-22T19:45:00+05:30","market_timestamp":"2024-02-23T09:15:00+05:30","off_market_hours":true}