{"url":"https://economictimes.indiatimes.com/tech/information-tech/upbeat-it-ceos-expecting-tech-spends-to-rise-in-2024/articleshow/107861781.cms","title":"Upbeat IT CEOs expecting tech spends to rise in 2024","description":"India's technology outsourcing industry is optimistic about revenue expansion in 2024. Tata Consultancy Services and Tech Mahindra CEOs expect growth from deal renewals, vendor consolidation, and transformation projects. The IT industry is projected to reach $253.9 billion in fiscal 2024.","content":"The $250-billion technology outsourcing industry, India’s biggest export earner with the second largest weighting on stock indices, is ‘more optimistic’ of revenue expansion in 2024 as the first signs of a spending revival pierce the seemingly impenetrable fog of frozen demand from either side of the Atlantic seaboard.K Krithivasan, CEO \u0026 MD of India’s largest software firm Tata Consultancy Services (TCS), told ET that it “definitely sees green shoots in the market” and that growth will come from a mix of deal renewals and vendor consolidation, with some transformation projects rounding off the order bouquet.“I would say that I am more optimistic about 2024 and we believe it will be a better year than last year… There may not be a huge $100 billion or $5 billion plus transformation deal and transformation budgets could be small, but I don't think that they will dry out completely,” said Krithivasan. Mohit Joshi, CEO and MD of Tech Mahindra also concurred and said that 2024 should be a better year than last year, which “was quite difficult.”“The bigger economy is doing well. The overhang or the fear of recession in the largest market, the America's, seems to be lifted. There's obviously a huge focus on technology across industry,” Joshi told ET.","cleaned_content":"the \u003cTWO_HUNDRED\u003e billion technology outsourcing industry india s biggest export earner with the second largest weighting on stock indices is more optimistic of revenue expansion in \u003cTWO_THOUSAND\u003e as the first signs of a spending revival pierce the seemingly impenetrable fog of frozen demand from either side of the atlantic seaboard k krithivasan ceo md of india s largest software firm tata consultancy services tcs told et that it definitely sees green shoots in the market and that growth will come from a mix of deal renewals and vendor consolidation with some transformation projects rounding off the order bouquet i would say that i am more optimistic about \u003cTWO_THOUSAND\u003e and we believe it will be a better year than last year there may not be a huge \u003cONE_HUNDRED\u003e billion or \u003cFIVE_\u003e billion plus transformation deal and transformation budgets could be small but i dont think that they will dry out completely said krithivasan mohit joshi ceo and md of tech mahindra also concurred and said that \u003cTWO_THOUSAND\u003e should be a better year than last year which was quite difficult the bigger economy is doing well the overhang or the fear of recession in the largest market the americas seems to be lifted theres obviously a huge focus on technology across industry joshi told et","timestamp":"2024-02-21T08:10:00+05:30","market_timestamp":"2024-02-21T09:15:00+05:30","off_market_hours":true}