{"url":"https://economictimes.indiatimes.com/tech/information-tech/karnataka-minister-to-invite-infosys-officials-for-discussion-on-hubballi-project/articleshow/107857588.cms","title":"Karnataka minister to invite Infosys officials for discussion on Hubballi project","description":"Karnataka's Industries Minister plans to invite top management of Infosys for talks to understand and address concerns about the Hubballi project, including job creation and investment timelines. Discussions will involve various stakeholders, including SV Sankanur (BJP) and Arvind Bellad.","content":"Karnataka’s Industries Minister MB Patil on Tuesday said he would invite top management of Infosys for talks to understand how it planned to take its Hubballi campus forward.The minister was responding to queries about the technology major not commencing operations at its campus in Hubballi in the Legislative Council.Infosys is a globally renowned software services company with a proven track record. The government would handle the subject with the sensitivity it demands, the minister said, responding to a query from the member SV Sankanur (BJP).The company has 43 acres and the management has built buildings, roads, parking lots, food courts and other facilities in 20 acres. The company has set aside the rest for expansion later. The campus currently has 280 employees and 122 contract workers, Patil said.While getting approval from the government, the company had said it will provide 1000 jobs, but has not provided as many jobs yet, he added.","cleaned_content":"karnataka s industries minister mb patil on tuesday said he would invite top management of infosys for talks to understand how it planned to take its hubballi campus forward the minister was responding to queries about the technology major not commencing operations at its campus in hubballi in the legislative council infosys is a globally renowned software services company with a proven track record the government would handle the subject with the sensitivity it demands the minister said responding to a query from the member sv sankanur bjp the company has \u003cFOUR_TEN\u003e acres and the management has built buildings roads parking lots food courts and other facilities in \u003cTWO_TEN\u003e acres the company has set aside the rest for expansion later the campus currently has \u003cTWO_HUNDRED\u003e employees and \u003cONE_HUNDRED\u003e contract workers patil said while getting approval from the government the company had said it will provide \u003cONE_THOUSAND\u003e jobs but has not provided as many jobs yet he added","timestamp":"2024-02-20T20:18:00+05:30","market_timestamp":"2024-02-21T09:15:00+05:30","off_market_hours":true}