{"url":"https://economictimes.indiatimes.com/tech/information-tech/techm-wants-to-be-a-credible-challenger-in-key-sectors-ceo-mohit-joshi/articleshow/107861825.cms","title":"TechM wants to be a 'credible challenger' in key sectors: CEO Mohit Joshi","description":"Tech Mahindra's new CEO Mohit Joshi aims to turnaround the company by focusing on key sectors like BFSI, telecom, and manufacturing. He plans to improve productivity, emphasize higher margin service lines, increase revenues, and implement organizational changes with senior level talent and restructuring into different units.","content":"In a bid to turnaround India's fifth largest software services firm Tech Mahindra, its new chief aims to win back the mojo as a \"credible challenger\" in key sectors such as banking, financial services and insurance (BFSI), telecom and manufacturing focusing on differentiated capabilities.\"Over the next few months, we are focussed on defining the purpose of the company, coming out with a strategic narrative for the company,\" Joshi, chief executive officer and managing director of Tech Mahindra, told ET. On margins, Tech Mahindra wants to focus on productivity for clients with emphasis on higher margin service lines, turning around loss-making contracts and thinking about pyramids in the future, he added. Despite a 40 bps rise in Q3FY24, Tech Mahindra's margins stood at a meagre 8.8%.The plan to revive revenues, Joshi said, will focus on maintaining Tech Mahindra's leadership position in telecom and manufacturing while positioning itself as a credible challenger in sectors like financial services, healthcare, life sciences and retail. Mahindra group's key IT services and consulting firm TechM derives just 16% from the banking financial services sector which has always been the largest spender on technology products and services. Other large Indian IT firms such as TCS and Infosys derive close to one-third of their revenues from this vertical. ","cleaned_content":"in a bid to turnaround indias fifth largest software services firm tech mahindra its new chief aims to win back the mojo as a credible challenger in key sectors such as banking financial services and insurance bfsi telecom and manufacturing focusing on differentiated capabilities over the next few months we are focussed on defining the purpose of the company coming out with a strategic narrative for the company joshi chief executive officer and managing director of tech mahindra told et on margins tech mahindra wants to focus on productivity for clients with emphasis on higher margin service lines turning around loss making contracts and thinking about pyramids in the future he added despite a \u003cFOUR_TEN\u003e bps rise in q3fy24 tech mahindras margins stood at a meagre \u003cEIGHT_PERCENT\u003e the plan to revive revenues joshi said will focus on maintaining tech mahindras leadership position in telecom and manufacturing while positioning itself as a credible challenger in sectors like financial services healthcare life sciences and retail mahindra groups key it services and consulting firm techm derives just \u003cONE_TEN_PERCENT\u003e from the banking financial services sector which has always been the largest spender on technology products and services other large indian it firms such as tcs and infosys derive close to one third of their revenues from this vertical","timestamp":"2024-02-21T08:28:00+05:30","market_timestamp":"2024-02-21T09:15:00+05:30","off_market_hours":true}