{"url":"https://economictimes.indiatimes.com/tech/information-tech/groundbreaking-for-three-chip-plants-likely-next-week/articleshow/108244792.cms","title":"Groundbreaking for three semiconductor plants likely next week","description":"Of the three semiconductor projects, two are from the Tata Group. They include an $11 billion semiconductor fab facility, the country's first, at Dholera in Gujarat. The other unit proposed by the conglomerate involves a Rs 27,000 crore chip assembly, testing, marking and packaging facility at Morigaon in Assam","content":"Groundbreaking ceremonies for three semiconductor projects, including two from the Tata Group, are likely to be held next week, less than two weeks after the Union Cabinet cleared the proposals entailing investments of $15.14 billion, officials told ET.The projects include an $11 billion semiconductor fab facility, the country's first, to be built by the Tata Group in at Dholera in Gujarat. The other unit proposed by the conglomerate involves a Rs 27,000 crore chip assembly, testing, marking and packaging facility at Morigaon in Assam. Murugappa Group's CG Power will be setting up a chip assembly facility at Sanand in Gujarat at a cost of Rs 7,600 crore.Construction of the plants is likely to begin in 60-70 days.Chief ministers, union ministers, key government officials and top executives from the companies are likely to be present at the events, the officials said.The Tata Group has tied up with Taiwan’s Powerchip Semiconductor Corp to set up the semiconductor fabrication unit in Gujarat. Japan's Renesas and Thailand's Stars Microelectronics are CG Power’s partners in the Sanand project.","cleaned_content":"groundbreaking ceremonies for three semiconductor projects including two from the tata group are likely to be held next week less than two weeks after the union cabinet cleared the proposals entailing investments of \u003cONE_TEN\u003e billion officials told et the projects include an \u003cONE_TEN\u003e billion semiconductor fab facility the countrys first to be built by the tata group in at dholera in gujarat the other unit proposed by the conglomerate involves a rs \u003cTWO_TEN_THOUSAND\u003e crore chip assembly testing marking and packaging facility at morigaon in assam murugappa groups cg power will be setting up a chip assembly facility at sanand in gujarat at a cost of rs \u003cSEVEN_THOUSAND\u003e crore construction of the plants is likely to begin in \u003cSIX_TEN\u003e \u003cSEVEN_TEN\u003e days chief ministers union ministers key government officials and top executives from the companies are likely to be present at the events the officials said the tata group has tied up with taiwan s powerchip semiconductor corp to set up the semiconductor fabrication unit in gujarat japans renesas and thailands stars microelectronics are cg power s partners in the sanand project","timestamp":"2024-03-06T06:00:00+05:30","market_timestamp":"2024-03-06T09:15:00+05:30","off_market_hours":true}