{"url":"https://economictimes.indiatimes.com/tech/information-tech/former-foxconn-india-arm-head-foulger-to-join-zetwerk-says-indias-presence-will-democratise-electronics-manufacturing/articleshow/108081773.cms","title":"India’s presence will democratise electronics value chain: Josh Foulger","description":"Josh Foulger, the incoming president of electronics at Zetwerk, India is at the cusp of the next big revolution in electronics manufacturing and that the current situation is like the “Y2K moment” for the country.","content":"India’s presence in the electronics manufacturing ecosystem will democratise the global value chain and give customers across the world more options, said the incoming president of electronics at Zetwerk, Josh Foulger.He told ET that India is at the cusp of the next big revolution in electronics manufacturing and that the current situation is like the “Y2K moment” for the country as it leaps into the next level.“India is going to be a full stack player. We can design, do manufacturing and also be a supply chain player. We can design, develop, test and market products in our home domain and then do an India plus,” Foulger said.Foulger, who will assume charge formally on Friday, has joined the Bengaluru-based manufacturing unicorn from Bharat FIH, the India arm of Taiwanese contract manufacturing firm Foxconn.He was till recently the country head at Bharat FIH and was instrumental in setting up and expanding Nokia and Foxconn’s India capabilities.","cleaned_content":"india s presence in the electronics manufacturing ecosystem will democratise the global value chain and give customers across the world more options said the incoming president of electronics at zetwerk josh foulger he told et that india is at the cusp of the next big revolution in electronics manufacturing and that the current situation is like the y2k moment for the country as it leaps into the next level india is going to be a full stack player we can design do manufacturing and also be a supply chain player we can design develop test and market products in our home domain and then do an india plus foulger said foulger who will assume charge formally on friday has joined the bengaluru based manufacturing unicorn from bharat fih the india arm of taiwanese contract manufacturing firm foxconn he was till recently the country head at bharat fih and was instrumental in setting up and expanding nokia and foxconn s india capabilities","timestamp":"2024-02-29T06:00:00+05:30","market_timestamp":"2024-02-29T09:15:00+05:30","off_market_hours":true}