{"url":"https://economictimes.indiatimes.com/tech/information-tech/salesforce-sees-annual-revenue-below-estimates-on-weak-cloud-demand/articleshow/108087549.cms","title":"Salesforce sees annual revenue below estimates on weak cloud demand","description":"Salesforce expands buyback program and introduces dividend, but lower revenue forecast and layoffs signal a slowdown. Cloud firms, including Salesforce and Snowflake, face uncertainty. Salesforce beats Q4 estimates and becomes target for activist investors.","content":"Salesforce expanded its stock buyback program by $10 billion and announced a new dividend, but its annual revenue forecast that was below estimates pushed its shares down around 2% in after hours trading. The company's downbeat forecast signals a likely slowdown in cloud and tech spending as clients grapple with high interest rates and rising inflation, compelling them to keep a lid on costs. The company sees revenue between $37.7 billion to $38 billion for full-year 2025, compared with analysts' estimate of $38.62 billion, according to LSEG data. Warnings of a slow economy prompted Salesforce to cut about 700 employees, or roughly 1% of its global workforce, last month, adding to the slew of layoffs across the tech and media industry. \"Salesforce is guiding for only 8-9% growth (for the full year), which moves it out of the high growth category. In order to make up for that, it is introducing a dividend, which is appropriate for the lower level of growth,\" said Gil Luria, analyst at D.A. Davidson.","cleaned_content":"salesforce expanded its stock buyback program by \u003cONE_TEN\u003e billion and announced a new dividend but its annual revenue forecast that was below estimates pushed its shares down around \u003cTWO_PERCENT\u003e in after hours trading the companys downbeat forecast signals a likely slowdown in cloud and tech spending as clients grapple with high interest rates and rising inflation compelling them to keep a lid on costs the company sees revenue between \u003cTHREE_TEN\u003e billion to \u003cTHREE_TEN\u003e billion for full year \u003cTWO_THOUSAND\u003e compared with analysts estimate of \u003cTHREE_TEN\u003e billion according to lseg data warnings of a slow economy prompted salesforce to cut about \u003cSEVEN_HUNDRED\u003e employees or roughly \u003cONE_PERCENT\u003e of its global workforce last month adding to the slew of layoffs across the tech and media industry salesforce is guiding for only \u003cEIGHT_\u003e \u003cNINE_PERCENT\u003e growth for the full year which moves it out of the high growth category in order to make up for that it is introducing a dividend which is appropriate for the lower level of growth said gil luria analyst at d a davidson","timestamp":"2024-02-29T07:46:00+05:30","market_timestamp":"2024-02-29T09:15:00+05:30","off_market_hours":true}