{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-appoints-vipul-chandra-as-chief-financial-officer/articleshow/108297108.cms","title":"LTIMindtree appoints Vipul Chandra as chief financial officer","description":"Vipul Chandra takes over the post from Vinit Teredesai, CFO of the Mumbai-based technology consulting and digital solutions company since June 2020. The latter will serve as CFO till April 24.","content":"LTIMindtree on Thursday said its board of directors has appointed Vipul Chandra as the chief financial officer (CFO) of the company with effect from April 25, 2024.Chandra will take over from Vinit Teredesai, who has been CFO of the Mumbai-based technology consulting and digital solutions company since June 2020 and will continue to serve as CFO till April 24. Teredesai has decided to pursue his professional interest outside the company, the company said.Chandra’s career spans nearly three decades in financial markets, risk management, banking operations and treasury management. Joining Larsen \u0026 Toubro in October 2013 as the head of treasury in corporate finance, he has been instrumental in leading the efforts of the company in capital structuring and allocation, resource mobilisation, working capital and financial risk management across the group.Prior to joining L\u0026T, he worked with Citibank in India as managing director, head of corporate sales and structuring in the global markets business. He is an engineer with specialisation in electronics and communication from Delhi College of Engineering and is also a post-graduate from IIM Calcutta.Leadership planning is one of the key focus areas of L\u0026T group, LTIMindtree chairman AM Naik said in a statement. “Through career progression mapping we ensure that key talent gets experience of multiple roles within the system. Vipul Chandra has been in various senior roles within the organisation for more than a decade. Through his experience of three decades and his in-depth knowledge about L\u0026T group we are sure he would lead the finance function of LTIMindtree ably. I would also like to appreciate the work done by Vinit Teredesai and wish him well for his future endeavours,” he said.","cleaned_content":"ltimindtree on thursday said its board of directors has appointed vipul chandra as the chief financial officer cfo of the company with effect from april \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e chandra will take over from vinit teredesai who has been cfo of the mumbai based technology consulting and digital solutions company since june \u003cTWO_THOUSAND\u003e and will continue to serve as cfo till april \u003cTWO_TEN\u003e teredesai has decided to pursue his professional interest outside the company the company said chandra s career spans nearly three decades in financial markets risk management banking operations and treasury management joining larsen toubro in october \u003cTWO_THOUSAND\u003e as the head of treasury in corporate finance he has been instrumental in leading the efforts of the company in capital structuring and allocation resource mobilisation working capital and financial risk management across the group prior to joining l t he worked with citibank in india as managing director head of corporate sales and structuring in the global markets business he is an engineer with specialisation in electronics and communication from delhi college of engineering and is also a post graduate from iim calcutta leadership planning is one of the key focus areas of l t group ltimindtree chairman am naik said in a statement through career progression mapping we ensure that key talent gets experience of multiple roles within the system vipul chandra has been in various senior roles within the organisation for more than a decade through his experience of three decades and his in depth knowledge about l t group we are sure he would lead the finance function of ltimindtree ably i would also like to appreciate the work done by vinit teredesai and wish him well for his future endeavours he said","timestamp":"2024-03-07T15:36:00+05:30","market_timestamp":"2024-03-08T09:15:00+05:30","off_market_hours":true}