{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-plans-walk-in-recruitment-event-in-bengaluru-on-march-9/articleshow/108082453.cms","title":"Infosys plans walk-in recruitment event in Bengaluru on March 9","description":"Infosys' hiring comes after a renewal of four big-ticket contracts, spurring the need for more professionals. The company has sent a broadcast mail to employees, urging them to refer potential candidates in a sign of easing curbs on hiring and revival in business sentiment.","content":"Infosys, India’s second-largest software services exporter, has planned a walk-in recruitment event at its development centre in Electronic City, Bengaluru on March 9 as it seeks to add ‘next great talents’ to its rolls. This follows similar drives at Hyderabad on January 6 and Chennai on February 3.The talent acquisition comes amid a renewal of four big-ticket contracts at Infosys, spurring the need for more professionals. There are also other small projects the company is handling for which it needs manpower to fill vacancies caused by attrition, a person privy to the discussions said.The company has sent a broadcast mail to employees, urging them to refer potential candidates in a sign of easing curbs on hiring and revival in business sentiment. The company, however, told the employees that they will not get a referral bonus for recommendations.\"We are looking for individuals who are passionate, skilled and ready to contribute to our ongoing projects and company culture. This is an excellent chance for candidates within your professional and personal network who meet the criteria and are seeking new opportunities. They can just walk in during the event with their latest resume, 2 recent passport size photographs and a government ID proof,” the company said.Infosys is looking for professionals possessing skills in Java/DotNet/Mainframe/ServiceNowDeveloper with three to nine years of experience for its Bengaluru campus. It hired people with skills in Java/DotNet/SAPABAP/SAPFICO for Hyderabad and, with skills in Java/Dotnet/Mainframe/Python for the Chennai centre.","cleaned_content":"infosys india s second largest software services exporter has planned a walk in recruitment event at its development centre in electronic city bengaluru on march \u003cNINE_\u003e as it seeks to add next great talents to its rolls this follows similar drives at hyderabad on january \u003cSIX_\u003e and chennai on february \u003cTHREE_\u003e the talent acquisition comes amid a renewal of four big ticket contracts at infosys spurring the need for more professionals there are also other small projects the company is handling for which it needs manpower to fill vacancies caused by attrition a person privy to the discussions said the company has sent a broadcast mail to employees urging them to refer potential candidates in a sign of easing curbs on hiring and revival in business sentiment the company however told the employees that they will not get a referral bonus for recommendations we are looking for individuals who are passionate skilled and ready to contribute to our ongoing projects and company culture this is an excellent chance for candidates within your professional and personal network who meet the criteria and are seeking new opportunities they can just walk in during the event with their latest resume \u003cTWO_\u003e recent passport size photographs and a government id proof the company said infosys is looking for professionals possessing skills in java dotnet mainframe servicenowdeveloper with three to nine years of experience for its bengaluru campus it hired people with skills in java dotnet sapabap sapfico for hyderabad and with skills in java dotnet mainframe python for the chennai centre","timestamp":"2024-02-29T06:00:00+05:30","market_timestamp":"2024-02-29T09:15:00+05:30","off_market_hours":true}