{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-bags-deal-from-regional-us-lender-central-bank/articleshow/108624889.cms","title":"TCS bags deal from regional US lender Central Bank","description":"Central Bank manages more than $20 billion in assets serving more than 150 locations in 78 communities throughout Missouri, Kansas, Illinois, and Oklahoma. TCS BaNCS will help modernise the bank's core technology infrastructure.","content":"IT giant Tata Consultancy Services (TCS) has bagged a deal from regional US-based lender Central Bank to use TCS BaNCS to help modernise its core technology infrastructure. The size of the deal was not disclosed.“The leading Midwest regional bank taps Tata Consultancy Services’ next-generation banking software to simplify the technology landscape, spark organic growth and accelerate client onboarding…Central Bank’s strategic partnership with TCS aims to create frictionless and flexible customer onboarding processes, enabling continued growth for the bank,” TCS said in a stock exchange filing.Established in 1902, Central Bank manages more than $20 billion in assets serving more than 150 locations in 78 communities throughout Missouri, Kansas, Illinois, and Oklahoma.“When the decision was made to modernize our core as part of a long-term strategy, we looked extensively for a true partner. Given our shared commitment to technology and its role in the customer experience, TCS, with its TCS BaNCS product suite, was a natural choice for Central Bank,” said John Ross, President and CEO, Central Bank.TCS BaNCS is a core banking software suite developed by TCS, India’s largest IT firm, for use by retail banks.","cleaned_content":"it giant tata consultancy services tcs has bagged a deal from regional us based lender central bank to use tcs bancs to help modernise its core technology infrastructure the size of the deal was not disclosed the leading midwest regional bank taps tata consultancy services next generation banking software to simplify the technology landscape spark organic growth and accelerate client onboarding central bank s strategic partnership with tcs aims to create frictionless and flexible customer onboarding processes enabling continued growth for the bank tcs said in a stock exchange filing established in \u003cONE_THOUSAND\u003e central bank manages more than \u003cTWO_TEN\u003e billion in assets serving more than \u003cONE_HUNDRED\u003e locations in \u003cSEVEN_TEN\u003e communities throughout missouri kansas illinois and oklahoma when the decision was made to modernize our core as part of a long term strategy we looked extensively for a true partner given our shared commitment to technology and its role in the customer experience tcs with its tcs bancs product suite was a natural choice for central bank said john ross president and ceo central bank tcs bancs is a core banking software suite developed by tcs india s largest it firm for use by retail banks","timestamp":"2024-03-19T21:26:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}