{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-appoints-anne-marie-rowland-as-capco-ceo/articleshow/108652403.cms","title":"Wipro appoints Anne-Marie Rowland as Capco CEO","description":"Anne-Marie Rowland will report to Wipro CEO and managing director Thierry Delaporte and will become a member of Wipro’s Executive Committee (WEC).","content":"Wipro has announced that Anne-Marie (Annie) Rowland has been appointed as Capco’s Chief Executive Officer. Rowland is currently managing partner of Capco’s business in the United Kingdom and Ireland and a member of Capco’s Global Leadership Team, according to a press release. She will take on the CEO role effective April 1, 2024.As CEO of Capco, Rowland will report to Wipro CEO and managing director Thierry Delaporte and will become a member of Wipro’s Executive Committee (WEC), the release stated.Lance Levy, who has led Capco as CEO for close to a decade, will take on a new role as Strategic Advisor and continue to support Capco’s strategic direction and Wipro’s overall Consulting strategy.“Lance has provided unmatched leadership to Capco for over a decade. Under his guidance, Capco has differentiated itself as an industry-leading full-service transformation consultancy, and become a key growth pillar for Wipro,” said Delaporte. “Annie has a deep understanding of Capco, our clients, teams, and the Consulting industry. I’m proud to welcome Annie to lead Capco into the future, to its next phase of growth.”","cleaned_content":"wipro has announced that anne marie annie rowland has been appointed as capco s chief executive officer rowland is currently managing partner of capco s business in the united kingdom and ireland and a member of capco s global leadership team according to a press release she will take on the ceo role effective april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e as ceo of capco rowland will report to wipro ceo and managing director thierry delaporte and will become a member of wipro s executive committee wec the release stated lance levy who has led capco as ceo for close to a decade will take on a new role as strategic advisor and continue to support capco s strategic direction and wipro s overall consulting strategy lance has provided unmatched leadership to capco for over a decade under his guidance capco has differentiated itself as an industry leading full service transformation consultancy and become a key growth pillar for wipro said delaporte annie has a deep understanding of capco our clients teams and the consulting industry i m proud to welcome annie to lead capco into the future to its next phase of growth","timestamp":"2024-03-20T18:11:00+05:30","market_timestamp":"2024-03-21T09:15:00+05:30","off_market_hours":true}