{"url":"https://economictimes.indiatimes.com/tech/information-tech/top-it-companies-gain-market-share-over-global-firms/articleshow/108443112.cms","title":"TCS, HCL and other top IT companies gain market share over global firms","description":"Despite a sluggish year for IT globally, major Indian IT firms outpaced their international competitors in terms of revenue market share. ​​India-based companies added 36 basis points (bps) in revenue market share year-on-year basis though they lost 27 bps on a sequential basis, BNP Paribas said in a report.","content":"Major India-based IT firms gained in revenue market share year-on-year over their global counterparts in a year which is marked by one of the slowest demand environments for the industry. “In dollar terms, as per our sample, India-based IT firms’ revenue growth continued to slow down and grew by 0.8% y-y in the Dec-23 quarter,\" brokerage firm BNP Paribas said in a report. It was however, ahead of global IT companies’ revenue growth, indicating continued market-share gains, the report added.India based companies added 36 basis points (bps) in revenue market share year-on-year basis though they lost 27 bps on a sequential basis, the report said.     ","cleaned_content":"major india based it firms gained in revenue market share year on year over their global counterparts in a year which is marked by one of the slowest demand environments for the industry in dollar terms as per our sample india based it firms revenue growth continued to slow down and grew by \u003cZERO_PERCENT\u003e y y in the dec \u003cTWO_TEN\u003e quarter brokerage firm bnp paribas said in a report it was however ahead of global it companies revenue growth indicating continued market share gains the report added india based companies added \u003cTHREE_TEN\u003e basis points bps in revenue market share year on year basis though they lost \u003cTWO_TEN\u003e bps on a sequential basis the report said","timestamp":"2024-03-13T09:25:00+05:30","market_timestamp":"2024-03-13T09:25:00+05:30","off_market_hours":false}