{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-to-work-on-enhancing-womens-employment-in-saudi-arabia/articleshow/108749623.cms","title":"LTIMindtree to work on enhancing women's employment in Saudi Arabia","description":"The JV aims to create a next-generation digital and IT services company in Saudi Arabia to provide technology services for the rapid digitisation of the Saudi market and build a local talent pool over a period of time.","content":"The joint venture of tech consulting firm LTIMindtree and Aramco will mirror India's strategy to build a technology talent pool in Saudi Arabia and enhance women's employment in the country, a senior official of the Indian IT company said. The JV aims to create a next-generation digital and IT services company in Saudi Arabia to provide technology services for the rapid digitisation of the Saudi market and build a local talent pool over a period of time. LTIMindtree president and executive board member Sudhir Chaturvedi told PTI that the company's collaboration with Aramco Digital will establish a next-generation digital and IT services company in Saudi Arabia. \"We are going to make sure that like we do in India, wherein we hire both experienced professionals as well as freshers from universities and then train them into the process. Essentially, we will replicate that model there, obviously with nuances, which are specific to the Saudi market. As part of the focus, this aims to enhance women's employment in the Saudi market,\" Chaturvedi said. LTIMindtree will hold a 51% stake in the company while Global Digital, a completely owned subsidiary of Aramco, will hold the rest of the stake. ","cleaned_content":"the joint venture of tech consulting firm ltimindtree and aramco will mirror indias strategy to build a technology talent pool in saudi arabia and enhance womens employment in the country a senior official of the indian it company said the jv aims to create a next generation digital and it services company in saudi arabia to provide technology services for the rapid digitisation of the saudi market and build a local talent pool over a period of time ltimindtree president and executive board member sudhir chaturvedi told pti that the companys collaboration with aramco digital will establish a next generation digital and it services company in saudi arabia we are going to make sure that like we do in india wherein we hire both experienced professionals as well as freshers from universities and then train them into the process essentially we will replicate that model there obviously with nuances which are specific to the saudi market as part of the focus this aims to enhance womens employment in the saudi market chaturvedi said ltimindtree will hold a \u003cFIVE_TEN_PERCENT\u003e stake in the company while global digital a completely owned subsidiary of aramco will hold the rest of the stake","timestamp":"2024-03-24T16:03:00+05:30","market_timestamp":"2024-03-26T09:15:00+05:30","off_market_hours":true}