{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-defers-annual-hikes-to-employees/articleshow/109073155.cms","title":"Cognizant defers annual hikes to employees","description":"IT major Cognizant said a majority of its associates have seen four merit increases within three years, with the last cycle being April 1, 2023.","content":"Global IT services giant Cognizant Technology Solutions has deferred its annual salary hikes this year by four months. It now plans to roll them out to eligible employees from August 1, two people confirmed to ET.Last year, the Nasdaq-listed firm had given hikes to employees in April.Confirming the development, Cognizant said, \"We are committed to recognizing the hard work and dedication of our associates through annual merit increases and bonuses. As part of this commitment, the merit increases for eligible associates will be awarded this year on August 1.\"On emailed queries, the IT major further said that the majority of its associates have seen four merit increases within three years, with the last cycle being April 1, 2023. \"The company has also just rewarded annual bonuses to eligible associates globally. This continuity underscores our dedication to consistently acknowledge the contributions of our talented associates,\" it added.","cleaned_content":"global it services giant cognizant technology solutions has deferred its annual salary hikes this year by four months it now plans to roll them out to eligible employees from august \u003cONE_\u003e two people confirmed to et last year the nasdaq listed firm had given hikes to employees in april confirming the development cognizant said we are committed to recognizing the hard work and dedication of our associates through annual merit increases and bonuses as part of this commitment the merit increases for eligible associates will be awarded this year on august \u003cONE_\u003e on emailed queries the it major further said that the majority of its associates have seen four merit increases within three years with the last cycle being april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e the company has also just rewarded annual bonuses to eligible associates globally this continuity underscores our dedication to consistently acknowledge the contributions of our talented associates it added","timestamp":"2024-04-05T23:06:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}