{"url":"https://economictimes.indiatimes.com/tech/information-tech/malay-joshi-succeeds-srini-pallia-as-ceo-of-wipros-americas-1-smu/articleshow/109198628.cms","title":"Malay Joshi succeeds Srini Pallia as CEO of Wipro’s Americas 1","description":"Malay Joshi's appointment comes just days after his predecessor, Srini Pallia, was appointed as CEO and MD of Wipro. In his former role, Joshi helped clients drive successful enterprise transformations, enhancing client experience (CX) and strengthening delivery.","content":"Wipro on Wednesday appointed Malay Joshi as chief executive officer of Wipro Americas 1 Strategic Market Unit, effective immediately. Joshi succeeded Srini Pallia, who was appointed as CEO and MD of Wipro on April 6.Joshi will also join the Wipro Executive Board. In his last role, Joshi was the senior vice president and business unit head, leading the communications, media, tech, retail, travel, hospitality and public sector industries, which make up one of Wipro’s largest business units globally, said the company in a filing with stock exchange.In his former role, he was responsible for helping clients drive successful enterprise transformations, enhancing client experience (CX), strengthening delivery, and ensuring consistent revenue growth in the sectors he led, added the company. He will be based out of Wipro’s New York City office. Srini Pallia, CEO and MD, Wipro, said, “Malay has been leading one of the largest business units at Wipro and has delivered the highest CAGR (compound annual growth rate) over a decade across multiple global businesses. His client centricity and deep understanding of the industry makes him an ideal fit to lead Americas one strategic market. He is the perfect leader to take the helm of this fast-growing market and write its next chapter of our growth.”Joshi joined Wipro in 1996 and has been in the company for over 28 years in various leadership roles across functions, industries, and geographies. He has a strong background in delivery, consultative sales, and client engagement.","cleaned_content":"wipro on wednesday appointed malay joshi as chief executive officer of wipro americas \u003cONE_\u003e strategic market unit effective immediately joshi succeeded srini pallia who was appointed as ceo and md of wipro on april \u003cSIX_\u003e joshi will also join the wipro executive board in his last role joshi was the senior vice president and business unit head leading the communications media tech retail travel hospitality and public sector industries which make up one of wipro s largest business units globally said the company in a filing with stock exchange in his former role he was responsible for helping clients drive successful enterprise transformations enhancing client experience cx strengthening delivery and ensuring consistent revenue growth in the sectors he led added the company he will be based out of wipro s new york city office srini pallia ceo and md wipro said malay has been leading one of the largest business units at wipro and has delivered the highest cagr compound annual growth rate over a decade across multiple global businesses his client centricity and deep understanding of the industry makes him an ideal fit to lead americas one strategic market he is the perfect leader to take the helm of this fast growing market and write its next chapter of our growth joshi joined wipro in \u003cONE_THOUSAND\u003e and has been in the company for over \u003cTWO_TEN\u003e years in various leadership roles across functions industries and geographies he has a strong background in delivery consultative sales and client engagement","timestamp":"2024-04-10T18:09:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}