{"url":"https://economictimes.indiatimes.com/tech/information-tech/atos-seeks-over-1-billion-in-new-funds-report/articleshow/109143538.cms","title":"French IT firm Atos seeks over $1 billion in new funds: report","description":"Atos is aiming to convert about half of its $5 billion debt into equity as part of the plan disclosed during a confidential meeting on Monday, Bloomberg said.","content":"Crisis-hit French IT firm Atos has told creditors and bondholders it is seeking more than 1 billion euros ($1.09 billion) in new funds, Bloomberg News reported on Monday, citing people with direct knowledge of a new restructuring plan. Atos is aiming to convert about half of its $5 billion debt into equity as part of the plan disclosed during a confidential meeting on Monday, Bloomberg said. Atos has not made immediately clear who would inject cash in the company and how remaining debt terms would be renegotiated, the Bloomberg report added. An Atos spokesperson did not respond to an email seeking comment. A former French top CAC 40 blue chip, Atos has seen its stock price lose more than 90% of its value in the past three years after a series of strategic missteps, operational setbacks, and governance crises.","cleaned_content":"crisis hit french it firm atos has told creditors and bondholders it is seeking more than \u003cONE_\u003e billion euros \u003cONE_\u003e billion in new funds bloomberg news reported on monday citing people with direct knowledge of a new restructuring plan atos is aiming to convert about half of its \u003cFIVE_\u003e billion debt into equity as part of the plan disclosed during a confidential meeting on monday bloomberg said atos has not made immediately clear who would inject cash in the company and how remaining debt terms would be renegotiated the bloomberg report added an atos spokesperson did not respond to an email seeking comment a former french top cac \u003cFOUR_TEN\u003e blue chip atos has seen its stock price lose more than \u003cNINE_TEN_PERCENT\u003e of its value in the past three years after a series of strategic missteps operational setbacks and governance crises","timestamp":"2024-04-09T00:57:00+05:30","market_timestamp":"2024-04-09T09:15:00+05:30","off_market_hours":true}