{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-new-ceo-faces-challenging-quarters-impatient-investors-unrealistic-expectations-ahead/articleshow/109110324.cms","title":"Restless investors, turnaround hopes await Wipro’s new CEO Srinivas Pallia","description":"Wipro CEO Thierry Delaporte resigns, Srinivas Pallia takes charge facing tough times. Must boost morale, focus on large deals, client mining, integrate acquisitions, manage industry analysts, and address executive departures for company revival.","content":"Srinivas Pallia, the new chief executive of Wipro Ltd, will need to deal with a challenging business environment, shareholders who are getting impatient due to a delayed turnaround and sky-high expectations as he takes the baton when the $245-billion Indian IT industry is facing one of its toughest times.Azim Premji’s flagship firm on Saturday announced the resignation of its CEO Thierry Delaporte just days ahead of its full year financial results. He had another 15 months of his tenure as CEO remaining.Pallia, 56, a Wipro veteran of 30 years and CEO of its largest and fastest growth market Americas 1, took charge of the company on Sunday.The retirement age at Wipro is 58, but Pallia will continue to be CEO for five years. He will be 61 years old at the end of his tenure.Pallia is one of the rare candidates to rise up the ranks to the top within Wipro, which has seen several CEO changes in the last 15 years. Some quick to-dos as he takes charge, experts said, are to boost the morale of the employees of the country’s fourth largest IT services and consultancy firm and reverse senior level attrition. ","cleaned_content":"srinivas pallia the new chief executive of wipro ltd will need to deal with a challenging business environment shareholders who are getting impatient due to a delayed turnaround and sky high expectations as he takes the baton when the \u003cTWO_HUNDRED\u003e billion indian it industry is facing one of its toughest times azim premji s flagship firm on saturday announced the resignation of its ceo thierry delaporte just days ahead of its full year financial results he had another \u003cONE_TEN\u003e months of his tenure as ceo remaining pallia \u003cFIVE_TEN\u003e a wipro veteran of \u003cTHREE_TEN\u003e years and ceo of its largest and fastest growth market americas \u003cONE_\u003e took charge of the company on sunday the retirement age at wipro is \u003cFIVE_TEN\u003e but pallia will continue to be ceo for five years he will be \u003cSIX_TEN\u003e years old at the end of his tenure pallia is one of the rare candidates to rise up the ranks to the top within wipro which has seen several ceo changes in the last \u003cONE_TEN\u003e years some quick to dos as he takes charge experts said are to boost the morale of the employees of the country s fourth largest it services and consultancy firm and reverse senior level attrition","timestamp":"2024-04-08T09:40:00+05:30","market_timestamp":"2024-04-08T09:40:00+05:30","off_market_hours":false}