{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-became-its-cxo-nursery-under-thierry-delaporte/articleshow/109204832.cms","title":"Wipro became IT's CXO nursery under Thierry Delaporte","description":"During Delaporte's four years at Wipro, four Wipro former executives went on to become CEOs outside the company, while three became CFOs even as other senior leaders joined smaller and larger firms in top CXO roles.","content":"While India's fourth largest software services firm Wipro bled talent and saw over a dozen exits over the last four years as its former CEO Thierry Delaporte went about his \"transformation agenda\" at the $11 billion Bengaluru headquartered company, the IT major produced a slew of CXOs for the $245-billion Indian IT industry. Four Wipro former executives went on to become CEOs outside the company, while three became CFOs even as other senior leaders joined smaller and larger firms in top CXO roles, an analysis by ET shows. The company also produced five CEOs for its internal ranks, who experts say are standalone CEOs in the making. They quote the example of Srinivas Pallia who was CEO of Americas 1 and was elevated as the CEO and MD of Wipro on Sunday after Delaporte's surprise resignation 15 months before the expiry of his term.The most notable IT leaders from Wipro stable who became CEOs outside the company include former iDEAS (Integrated Digital, Engineering \u0026 Application Services) Head, Rajan Kohli who became CEO of CitiusTech. Former CEO of Wipro's Americas 2, Angan Guha was appointed chief of BirlaSoft and former COO at Wipro Sanjeev Singh who went on to lead CMS IT Services. Turki Bin Nader, who was appointed by Delaporte as general manager and country head, Kingdom of Saudi Arabia, quit Wipro to become CEO of Capgemini Saudi Arabia in January 2024.Internally Thierry appointed many CEOs including for the four Strategic Market Units (SMUs) - Srini Pallia for America 1, Suzanne Dann for Americas 2, Pierre Bruno for Europe, and Anis Chenchah for APMEA (Asia Pacific Middle East Africa). Most recently, under Delaporte's watch Anne-Marie Rowland was appointed as the CEO of Wipro's biggest acquired company - Capco. Rowland was managing partner of Capco's business in the United Kingdom and Ireland. ","cleaned_content":"while indias fourth largest software services firm wipro bled talent and saw over a dozen exits over the last four years as its former ceo thierry delaporte went about his transformation agenda at the \u003cONE_TEN\u003e billion bengaluru headquartered company the it major produced a slew of cxos for the \u003cTWO_HUNDRED\u003e billion indian it industry four wipro former executives went on to become ceos outside the company while three became cfos even as other senior leaders joined smaller and larger firms in top cxo roles an analysis by et shows the company also produced five ceos for its internal ranks who experts say are standalone ceos in the making they quote the example of srinivas pallia who was ceo of americas \u003cONE_\u003e and was elevated as the ceo and md of wipro on sunday after delaportes surprise resignation \u003cONE_TEN\u003e months before the expiry of his term the most notable it leaders from wipro stable who became ceos outside the company include former ideas integrated digital engineering application services head rajan kohli who became ceo of citiustech former ceo of wipros americas \u003cTWO_\u003e angan guha was appointed chief of birlasoft and former coo at wipro sanjeev singh who went on to lead cms it services turki bin nader who was appointed by delaporte as general manager and country head kingdom of saudi arabia quit wipro to become ceo of capgemini saudi arabia in january \u003cTWO_THOUSAND\u003e internally thierry appointed many ceos including for the four strategic market units smus srini pallia for america \u003cONE_\u003e suzanne dann for americas \u003cTWO_\u003e pierre bruno for europe and anis chenchah for apmea asia pacific middle east africa most recently under delaportes watch anne marie rowland was appointed as the ceo of wipros biggest acquired company capco rowland was managing partner of capcos business in the united kingdom and ireland","timestamp":"2024-04-11T12:38:00+05:30","market_timestamp":"2024-04-11T12:38:00+05:30","off_market_hours":false}