{"url":"https://economictimes.indiatimes.com/tech/information-tech/lti-mindtrees-coo-president-of-sales-in-fray-for-top-job-as-debashis-chatterjees-tenure-ends-soon/articleshow/109123516.cms","title":"LTI Mindtree's COO, president of sales in fray for top job as Debashis Chatterjee's tenure ends soon","description":"Wipro and LTIMindtree navigate leadership changes. Nachiket Deshpande and Sudhir Chaturvedi are key contenders for LTIMindtree's CEO role. The succession aims at sustaining growth and stability, with an eye on expanding LTIMindtree's market presence.","content":"LTI Mindtree's COO Nachiket Deshpande and president of sales Sudhir Chaturvedi are in the race for the top job as Debashis Chatterjee’s tenure as CEO will end next year. As per a TOI report, Deshpande is planning to relocate to the US. In 2018, before the acquisition, LTI named Deshpande as its COO. He is also overseeing the implementation of MCA21. Deshpande previously served as Cognizant’s SVP and global delivery head for banking and financial services, reporting to Chatterjee, who was then EVP and president of global delivery at the Nasdaq-listed company. Meanwhile, Chaturvedi has been a key strategist of the company’s transformation across brand development, market development, and business development activities, as per the report.An LTI Mindtree spokesperson told TOI, “Succession planning is an integral part of every organisation’s growth strategy. Under Debashis Chatterjee’s leadership, LTIMindtree has made its mark as a Nifty 50 company and a challenger brand in the IT industry. He continues to be the CEO \u0026 MD at LTIMindtree. Beyond this, we do not wish to comment on any speculations.”","cleaned_content":"lti mindtrees coo nachiket deshpande and president of sales sudhir chaturvedi are in the race for the top job as debashis chatterjee s tenure as ceo will end next year as per a toi report deshpande is planning to relocate to the us in \u003cTWO_THOUSAND\u003e before the acquisition lti named deshpande as its coo he is also overseeing the implementation of mca21 deshpande previously served as cognizant s svp and global delivery head for banking and financial services reporting to chatterjee who was then evp and president of global delivery at the nasdaq listed company meanwhile chaturvedi has been a key strategist of the company s transformation across brand development market development and business development activities as per the report an lti mindtree spokesperson told toi succession planning is an integral part of every organisation s growth strategy under debashis chatterjee s leadership ltimindtree has made its mark as a nifty \u003cFIVE_TEN\u003e company and a challenger brand in the it industry he continues to be the ceo md at ltimindtree beyond this we do not wish to comment on any speculations","timestamp":"2024-04-08T12:01:00+05:30","market_timestamp":"2024-04-08T12:01:00+05:30","off_market_hours":false}