{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-reports-dip-in-q4-hiring-attrition-cools-to-12-5/articleshow/109245708.cms","title":"TCS reports dip in Q4 hiring, full-year attrition cools to 12.5%","description":"For TCS, the headcount decreased by 1,759 since the last quarter, ending the fiscal year at a headcount of 601,546. In the third quarter, TCS had reported a sequential headcount dip of 5,680.","content":"India’s largest IT major Tata Consultancy Services (TCS) reported a dip on the hiring front in the fiscal fourth quarter. The company saw headcount decrease by 1,759 since the last quarter, ending the fiscal year at a headcount of 601,546. In the third quarter, TCS had reported a sequential headcount dip of 5,680. The firm, however, ended FY24 with 13,249 fewer employees compared to FY23, even as revenue grew 3.5% on-year.Increments of 4.5-7%, depending on performance, were rolled out for all employees starting in April, said Milind Lakkad, chief HR officer of TCS. Lakkad added that high-performers will get double digit hikes. The company expects to meet its usual fresher hiring target of about 40,000 for the year, Lakkad said. Most of the freshers from previous recruitment cycles have been onboarded, while the remaining will be onboarded this quarter.Also read | TCS Q4 Results: Profit rises 9% YoY to Rs 12,434 crore, beats estimates","cleaned_content":"india s largest it major tata consultancy services tcs reported a dip on the hiring front in the fiscal fourth quarter the company saw headcount decrease by \u003cONE_THOUSAND\u003e since the last quarter ending the fiscal year at a headcount of \u003cSIX_HUNDRED_THOUSAND\u003e in the third quarter tcs had reported a sequential headcount dip of \u003cFIVE_THOUSAND\u003e the firm however ended fy24 with \u003cONE_TEN_THOUSAND\u003e fewer employees compared to fy23 even as revenue grew \u003cTHREE_PERCENT\u003e on year increments of \u003cFOUR_\u003e \u003cSEVEN_PERCENT\u003e depending on performance were rolled out for all employees starting in april said milind lakkad chief hr officer of tcs lakkad added that high performers will get double digit hikes the company expects to meet its usual fresher hiring target of about \u003cFOUR_TEN_THOUSAND\u003e for the year lakkad said most of the freshers from previous recruitment cycles have been onboarded while the remaining will be onboarded this quarter also read tcs q4 results profit rises \u003cNINE_PERCENT\u003e yoy to rs \u003cONE_TEN_THOUSAND\u003e crore beats estimates","timestamp":"2024-04-12T20:46:00+05:30","market_timestamp":"2024-04-15T09:15:00+05:30","off_market_hours":true}