{"url":"https://economictimes.indiatimes.com/tech/information-tech/indias-top-3-it-companies-see-exit-of-64000-employees-in-fy23-24/articleshow/109441340.cms","title":"India's top 3 IT companies see exit of 64,000 employees in FY23-24","description":"India's IT services industry - a $254 billion powerhouse - has been feeling the heat of global macroeconomic uncertainties and geopolitical flareups as clients turned cautious with IT spends.","content":"India's largest IT services companies Tata Consultancy Services, Infosys and Wipro saw a staggering 64,000 employees exiting in FY24, amid a weak demand environment globally and tighter tech spends by clients. Wipro, which announced its Q4 earnings on Friday, reported a fall in headcount numbers to 2,34,054 as of March 2024, against 2,58,570 in the year-ago period. Headcount declined by 24,516 during the financial year ended on March 2024.  \"...immediate headcount reduction has happened primarily driven by the market and demand environment as well as the operational efficiency which we have driven, which is reflective in our margins,\" Saurabh Govil, Chief Human resources officer at Wipro said.  In the long term, as the company moves into more IP-based platform and Artificial Intelligence (AI), there could be divergence coming in terms of headcount growth, he added.  India's IT services industry - a $254 billion powerhouse - has been feeling the heat of global macroeconomic uncertainties and geopolitical flareups as clients turned cautious with IT spends.  India's second largest IT services exporter Infosys reported total headcount of 317,240 employees as of March 2024, down by 25,994 from 343,234 employees in same period of the previous year. ","cleaned_content":"indias largest it services companies tata consultancy services infosys and wipro saw a staggering \u003cSIX_TEN_THOUSAND\u003e employees exiting in fy24 amid a weak demand environment globally and tighter tech spends by clients wipro which announced its q4 earnings on friday reported a fall in headcount numbers to \u003cTWO_HUNDRED_THOUSAND\u003e as of march \u003cTWO_THOUSAND\u003e against \u003cTWO_HUNDRED_THOUSAND\u003e in the year ago period headcount declined by \u003cTWO_TEN_THOUSAND\u003e during the financial year ended on march \u003cTWO_THOUSAND\u003e immediate headcount reduction has happened primarily driven by the market and demand environment as well as the operational efficiency which we have driven which is reflective in our margins saurabh govil chief human resources officer at wipro said in the long term as the company moves into more ip based platform and artificial intelligence ai there could be divergence coming in terms of headcount growth he added indias it services industry a \u003cTWO_HUNDRED\u003e billion powerhouse has been feeling the heat of global macroeconomic uncertainties and geopolitical flareups as clients turned cautious with it spends indias second largest it services exporter infosys reported total headcount of \u003cTHREE_HUNDRED_THOUSAND\u003e employees as of march \u003cTWO_THOUSAND\u003e down by \u003cTWO_TEN_THOUSAND\u003e from \u003cTHREE_HUNDRED_THOUSAND\u003e employees in same period of the previous year","timestamp":"2024-04-19T21:43:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}