{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-q4-net-profit-is-down-7-8-to-rs-2835-crore/articleshow/109443223.cms","title":"Wipro Q4 net profit is down 7.8% to Rs 2,835 crore","description":"The fourth largest Indian IT service firm, Wipro saw its headcount decline by 9.5 % in the fiscal 24. This is the third time in a decade that the IT major saw a full-year decline in its headcount, by ending the fiscal at a lower number compared to the start of the year.","content":"India's fourth largest IT services firm, Wipro, on Friday reported a fall in net profit and revenue from a year earlier in the fiscal fourth quarter, hurt by a contraction in clients' technology spending in key growth verticals and regions.The Bengaluru-based company posted a net profit of Rs 2,834.6 crore for the quarter through March, 7.8% lower than a year earlier. Revenue fell 4.2% to Rs 22,208 crore. On a sequential basis, profit increased 5.2%, while revenue was flat. In constant currency, revenue fell 6.6% year-on-year and 0.3% on-quarter to $2.66 billion.Wipro has been underperforming its rivals in the IT sector on several counts for the past few years. This, combined with the exodus of senior management, likely triggered the surprise exit of chief executive Theirry Delaporte earlier this month, 15 months before his tenure was to end.In his first public address, Wipro veteran and new chief executive Srinivas Pallia said FY24 was a challenging year for the industry, and that the macroeconomic environment \"remains uncertain\".\"While I remain optimistic about the long term, it is important to be transparent. There is still a considerable amount of work ahead of us. My immediate priority is to accelerate growth,\" said Pallia, who is also the new managing director.","cleaned_content":"indias fourth largest it services firm wipro on friday reported a fall in net profit and revenue from a year earlier in the fiscal fourth quarter hurt by a contraction in clients technology spending in key growth verticals and regions the bengaluru based company posted a net profit of rs \u003cTWO_THOUSAND\u003e crore for the quarter through march \u003cSEVEN_PERCENT\u003e lower than a year earlier revenue fell \u003cFOUR_PERCENT\u003e to rs \u003cTWO_TEN_THOUSAND\u003e crore on a sequential basis profit increased \u003cFIVE_PERCENT\u003e while revenue was flat in constant currency revenue fell \u003cSIX_PERCENT\u003e year on year and \u003cZERO_PERCENT\u003e on quarter to \u003cTWO_\u003e billion wipro has been underperforming its rivals in the it sector on several counts for the past few years this combined with the exodus of senior management likely triggered the surprise exit of chief executive theirry delaporte earlier this month \u003cONE_TEN\u003e months before his tenure was to end in his first public address wipro veteran and new chief executive srinivas pallia said fy24 was a challenging year for the industry and that the macroeconomic environment remains uncertain while i remain optimistic about the long term it is important to be transparent there is still a considerable amount of work ahead of us my immediate priority is to accelerate growth said pallia who is also the new managing director","timestamp":"2024-04-20T06:00:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}