{"url":"https://economictimes.indiatimes.com/tech/information-tech/intel-appoints-santosh-viswanathan-as-india-region-head/articleshow/109422438.cms","title":"Intel announces Santhosh Viswanathan as India region head","description":"Intel appointed Santhosh Viswanathan as MD of India region. He brings 21 years of experience to lead Intel's new India region. Hans Chuang named GM of SMG Asia Pacific and Japan, focusing on revenue growth.","content":"Computer chip maker Intel on Friday announced Santhosh Viswanathan will head the India region business as its Managing Director (MD). Viswanathan has been with Intel for about 21 years.\"In March this year, Intel announced India as a separate region within its SMG (Sales, Marketing and Communications Group) organisation, to capitalise on the country's rapid growth and business opportunities. Santhosh Viswanathan, VP and MD-India region will lead the newly formed region, leveraging his expertise to drive value and customer-centricity,\" Intel said.Viswanathan took charge as Vice President and Managing Director for the Indian market in July 2022. Now Intel has carved out India as a separate region.","cleaned_content":"computer chip maker intel on friday announced santhosh viswanathan will head the india region business as its managing director md viswanathan has been with intel for about \u003cTWO_TEN\u003e years in march this year intel announced india as a separate region within its smg sales marketing and communications group organisation to capitalise on the countrys rapid growth and business opportunities santhosh viswanathan vp and md india region will lead the newly formed region leveraging his expertise to drive value and customer centricity intel said viswanathan took charge as vice president and managing director for the indian market in july \u003cTWO_THOUSAND\u003e now intel has carved out india as a separate region","timestamp":"2024-04-19T13:45:00+05:30","market_timestamp":"2024-04-19T13:45:00+05:30","off_market_hours":false}