{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-reports-drop-in-hiring-for-fifth-straight-quarter-in-q4/articleshow/109405452.cms","title":"Infosys reports drop in hiring for fifth straight quarter in Q4","description":"Infosys on Thursday posted a 30% YoY growth in its consolidated net profit at Rs 7,969 crore for the quarter ended March 2024. The same was at Rs 6,128 crore in the same quarter of last year.","content":"India’s second largest IT exporter Infosys on Thursday reported a drop in hiring in the fourth quarter of fiscal 2023-24 as well as the full fiscal year 2023-24. The firm ended FY24 with 25,994 fewer employees compared to FY23, which it had ended with 343,234 employees, even as revenue grew 1.4% year-on-year in constant currency. This is the first time the company has reported a full-year dip in headcount in over two decades. The company’s headcount decreased by 5,423 over the fiscal third quarter. It concluded the fiscal year ended March at a total employee count of 317,240. Also read | Infosys Q4 Results: Profit jumps 30% YoY to Rs 7,969 crore; co sees FY25 revenue growth at 1-3%By contrast, the company had seen an addition of 21,219 in FY23 over the previous fiscal.","cleaned_content":"india s second largest it exporter infosys on thursday reported a drop in hiring in the fourth quarter of fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e as well as the full fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the firm ended fy24 with \u003cTWO_TEN_THOUSAND\u003e fewer employees compared to fy23 which it had ended with \u003cTHREE_HUNDRED_THOUSAND\u003e employees even as revenue grew \u003cONE_PERCENT\u003e year on year in constant currency this is the first time the company has reported a full year dip in headcount in over two decades the company s headcount decreased by \u003cFIVE_THOUSAND\u003e over the fiscal third quarter it concluded the fiscal year ended march at a total employee count of \u003cTHREE_HUNDRED_THOUSAND\u003e also read infosys q4 results profit jumps \u003cTHREE_TEN_PERCENT\u003e yoy to rs \u003cSEVEN_THOUSAND\u003e crore co sees fy25 revenue growth at \u003cONE_\u003e \u003cTHREE_PERCENT\u003e by contrast the company had seen an addition of \u003cTWO_TEN_THOUSAND\u003e in fy23 over the previous fiscal","timestamp":"2024-04-18T21:29:00+05:30","market_timestamp":"2024-04-19T09:15:00+05:30","off_market_hours":true}