{"url":"https://economictimes.indiatimes.com/tech/information-tech/ceo-srinivas-pallia-sold-all-his-wipro-shares-month-and-half-before-taking-charge/articleshow/109322356.cms","title":"CEO Srinivas Pallia sold all his Wipro shares before taking charge","description":"Srinivas Pallia sold Wipro shares before becoming CEO. Delaporte resigned early over revenue. Wipro faced leadership exits amid transformation. Pallia led Americas 1 before CEO role, reporting to Rishad Premji in New Jersey.","content":"A month and half before being appointed as the new chief executive at Wipro, Srinivas Pallia, who has been with the company for over three decades, sold all his shares worth Rs 5 crore in it in the public market.Pallia disposed of his 1,00,000 Wipro shares through “market sale” on February 14 this year and the transaction was reported to the exchange on February 15. The total value of the transaction was Rs 5,05,12,640. As per information on the BSE, securities currently held by Pallia post transaction amounted to zero.Wipro did not reply to queries by ET, citing a silent period ahead of its quarterly and annual results announcement on Friday.On April 6, Wipro, India's fourth largest software services firm, announced the sudden resignation of former CEO Thierry Delaporte 15 months earlier than the end of his five-year tenure. Pallia was elevated to the top job with immediate effect.Wipro was under the scanner for its tepid revenue performance which had made it a laggard in FY23-24 compared to most of its large-cap Indian peers.","cleaned_content":"a month and half before being appointed as the new chief executive at wipro srinivas pallia who has been with the company for over three decades sold all his shares worth rs \u003cFIVE_\u003e crore in it in the public market pallia disposed of his \u003cONE_HUNDRED_THOUSAND\u003e wipro shares through market sale on february \u003cONE_TEN\u003e this year and the transaction was reported to the exchange on february \u003cONE_TEN\u003e the total value of the transaction was rs \u003cFIVE_TEN_MILLION\u003e as per information on the bse securities currently held by pallia post transaction amounted to zero wipro did not reply to queries by et citing a silent period ahead of its quarterly and annual results announcement on friday on april \u003cSIX_\u003e wipro indias fourth largest software services firm announced the sudden resignation of former ceo thierry delaporte \u003cONE_TEN\u003e months earlier than the end of his five year tenure pallia was elevated to the top job with immediate effect wipro was under the scanner for its tepid revenue performance which had made it a laggard in fy23 \u003cTWO_TEN\u003e compared to most of its large cap indian peers","timestamp":"2024-04-16T06:01:00+05:30","market_timestamp":"2024-04-16T09:15:00+05:30","off_market_hours":true}