{"url":"https://economictimes.indiatimes.com/tech/information-tech/new-wipro-ceo-srinivas-pallia-reveals-his-five-point-plan-to-revive-companys-growth/articleshow/109440051.cms","title":"New Wipro CEO Srinivas Pallia reveals his five point plan to revive company’s growth","description":"IT services company Wipro on Friday reported an 8% year-on-year (YoY) fall in consolidated net profit to Rs 2,835 crore for the quarter ended March 2024. It was Rs 3,074 crore in the last year quarter.","content":"New Wipro chief executive, Srinivas Pallia who has just completed two weeks at his office, revealed his strategy to revive growth at the fourth-largest IT service major. After taking over the charge, he spoke to media for the first time during the announcement of Q4 earnings.Pallia, who has been with Wipro for over three decades, said, during the Q4 earnings that the building blocks are firmly in place, and he is committed to build on this. “While I remain optimistic about the long term, it is important to be transparent. There is still a considerable amount work ahead of us. My immediate priority is to accelerate growth”, added Pallia.His five-point plans are:1 – Accelerate large deal momentum, while working closely with clients and partners.2 – Strengthen relationship with large clients and partners and further invest in accounts that has the potential to grow into large accounts.3 - Focus on industry specific profits and business commissions led by consulting and infused AI.","cleaned_content":"new wipro chief executive srinivas pallia who has just completed two weeks at his office revealed his strategy to revive growth at the fourth largest it service major after taking over the charge he spoke to media for the first time during the announcement of q4 earnings pallia who has been with wipro for over three decades said during the q4 earnings that the building blocks are firmly in place and he is committed to build on this while i remain optimistic about the long term it is important to be transparent there is still a considerable amount work ahead of us my immediate priority is to accelerate growth added pallia his five point plans are \u003cONE_\u003e accelerate large deal momentum while working closely with clients and partners 2 strengthen relationship with large clients and partners and further invest in accounts that has the potential to grow into large accounts 3 focus on industry specific profits and business commissions led by consulting and infused ai","timestamp":"2024-04-19T20:13:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}