{"url":"https://economictimes.indiatimes.com/tech/information-tech/data-centres-seek-policy-clarity-on-dark-fibre/articleshow/109322312.cms","title":"Data centre companies seek clarity on dark fibre for captive networks","description":"Data centre industry calls for clarification on dark fibre regulations for captive networks to enhance ease of doing business. India's market poised for growth, with high AI server market expectations. The industry pushes for prompt government action to reduce operational costs and improve connectivity.","content":"The data centre industry is calling for a clarification on regulations from the government to enable the use of dark fibre for captive networks, to improve ease of doing business (EoDB) at a time when the sector is poised for growth with increasing adoption of cloud and artificial intelligence.The industry currently has to rely on leasing bandwidth for these purposes from licensed telecom service providers at a significant cost. While the government has been apprised of the issue, things have been moving at a snail’s pace, executives said.“Due to existing regulatory uncertainty, licensees do not provide dark fibre to unlicensed enterprises like DCs (data centres),” Ashish Aggarwal, vice president and head of public policy at apex IT industry body Nasscom, told ET. “Dark fibre provisioning would offer a major fillip to EoDB in India. This would also be in line with the government's Digital India mission and creating EoDB for enterprises in India.”","cleaned_content":"the data centre industry is calling for a clarification on regulations from the government to enable the use of dark fibre for captive networks to improve ease of doing business eodb at a time when the sector is poised for growth with increasing adoption of cloud and artificial intelligence the industry currently has to rely on leasing bandwidth for these purposes from licensed telecom service providers at a significant cost while the government has been apprised of the issue things have been moving at a snail s pace executives said due to existing regulatory uncertainty licensees do not provide dark fibre to unlicensed enterprises like dcs data centres ashish aggarwal vice president and head of public policy at apex it industry body nasscom told et dark fibre provisioning would offer a major fillip to eodb in india this would also be in line with the governments digital india mission and creating eodb for enterprises in india","timestamp":"2024-04-16T06:01:00+05:30","market_timestamp":"2024-04-16T09:15:00+05:30","off_market_hours":true}