{"url":"https://economictimes.indiatimes.com/tech/information-tech/europe-emerges-as-hotspot-for-indian-it-mas-tops-buy-chart/articleshow/109510145.cms","title":"Europe emerges as hotspot for Indian IT M\u0026As, tops buy chart","description":"Indian IT giants are on a European shopping spree, snapping up companies at a rapid clip. Europe's booming tech sector, outpacing North America, has fueled over a dozen acquisitions since the Covid pandemic.","content":"Indian outsourcing leaders are increasingly acquiring companies in Europe, where the pace of revenue expansion has lately dwarfed growth rates the other side Atlantic seaboard to justify about a dozen M\u0026As in the continent since the pandemic.While last week’s acquisition announcement of in-tech by Infosys is tipped to be the largest in the latter’s history, even Capco’s acquisition by Wipro in 2021 is the largest ever acquisition made by the company.HCLTech has done three major acquisitions overseas in the last two years, all in Europe. Similarly, for Tech Mahindra, acquisition of CTC (Com Tec Co IT Ltd) in 2022, is the second-largest acquisition that the company has made after scam-hit Satyam in April 2010.An email to Infosys didn’t elicit any response until the publication of this report.Out of the total number of acquisitions done by Infosys in the last six years, nearly 40% focused on Europe. In absolute numbers, the IT major made a total of 16 acquisitions since April 2018, and out of that six were done in Europe, followed by five in the US, as per a Kotak analyst note. The latest acquisition being an engineering R\u0026D services provider, in-tech that is focused on the German automotive industry. The cost of the acquisition is pegged at $480 million (450 million euros).","cleaned_content":"indian outsourcing leaders are increasingly acquiring companies in europe where the pace of revenue expansion has lately dwarfed growth rates the other side atlantic seaboard to justify about a dozen m as in the continent since the pandemic while last week s acquisition announcement of in tech by infosys is tipped to be the largest in the latter s history even capco s acquisition by wipro in \u003cTWO_THOUSAND\u003e is the largest ever acquisition made by the company hcltech has done three major acquisitions overseas in the last two years all in europe similarly for tech mahindra acquisition of ctc com tec co it ltd in \u003cTWO_THOUSAND\u003e is the second largest acquisition that the company has made after scam hit satyam in april \u003cTWO_THOUSAND\u003e an email to infosys didn t elicit any response until the publication of this report out of the total number of acquisitions done by infosys in the last six years nearly \u003cFOUR_TEN_PERCENT\u003e focused on europe in absolute numbers the it major made a total of \u003cONE_TEN\u003e acquisitions since april \u003cTWO_THOUSAND\u003e and out of that six were done in europe followed by five in the us as per a kotak analyst note the latest acquisition being an engineering r d services provider in tech that is focused on the german automotive industry the cost of the acquisition is pegged at \u003cFOUR_HUNDRED\u003e million \u003cFOUR_HUNDRED\u003e million euros","timestamp":"2024-04-23T18:35:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}