{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-to-acquire-engineering-rd-services-provider-in-tech-for-480-million/articleshow/109410385.cms","title":"Infosys to acquire engineering R\u0026D services provider in-tech for $480 million","description":"Infosys said in a statement that this investment will help strengthen Infosys’ engineering R\u0026D capabilities and will help global clients to navigate their digital engineering journey.","content":"IT major Infosys on Thursday said it is acquiring in-tech, an engineering R\u0026D services provider focused on the German automotive industry. The cost of the acquisition is pegged at $480 million (450 million euros), the firm said in a filing with BSE.This strategic investment further strengthens Infosys’ engineering R\u0026D capabilities and will aid global clients to navigate their digital engineering journey, the company said in the statement. The acquisition is expected to be closed during the first half of fiscal 2025, subject to regulatory approvals.IT services companies are increasingly acquiring ER\u0026D firms to boost their topline. IT firm HCLTech last year acquired a 100% equity stake in ASAP group, a German automotive engineering services provider. Germany-headquartered in-tech shapes digitisation in the automotive, rail transport and smart industry sectors. It develops solutions pertaining to e-mobility, connected and autonomous driving, electric vehicles, off-road vehicles and railroad.in-tech brings to Infosys marquee German original equipment manufacturers (OEMs) deep client relationships, and an extensive industry expertise with a multidisciplinary team of 2200 people across locations in Germany, Austria, China, UK, and nearshore locations in Czech Republic, Romania, Spain and India.","cleaned_content":"it major infosys on thursday said it is acquiring in tech an engineering r d services provider focused on the german automotive industry the cost of the acquisition is pegged at \u003cFOUR_HUNDRED\u003e million \u003cFOUR_HUNDRED\u003e million euros the firm said in a filing with bse this strategic investment further strengthens infosys engineering r d capabilities and will aid global clients to navigate their digital engineering journey the company said in the statement the acquisition is expected to be closed during the first half of fiscal \u003cTWO_THOUSAND\u003e subject to regulatory approvals it services companies are increasingly acquiring er d firms to boost their topline it firm hcltech last year acquired a \u003cONE_HUNDRED_PERCENT\u003e equity stake in asap group a german automotive engineering services provider germany headquartered in tech shapes digitisation in the automotive rail transport and smart industry sectors it develops solutions pertaining to e mobility connected and autonomous driving electric vehicles off road vehicles and railroad in tech brings to infosys marquee german original equipment manufacturers oems deep client relationships and an extensive industry expertise with a multidisciplinary team of \u003cTWO_THOUSAND\u003e people across locations in germany austria china uk and nearshore locations in czech republic romania spain and india","timestamp":"2024-04-18T22:16:00+05:30","market_timestamp":"2024-04-19T09:15:00+05:30","off_market_hours":true}