{"url":"https://economictimes.indiatimes.com/tech/information-tech/employee-wage-cost-up-even-as-growth-falters-headcount-drops/articleshow/109480581.cms","title":"Top IT firms saw wage bills rise 5.5% even as revenue growth dips","description":"IT companies' cumulative wage cost rose by Rs 18,036 crore in the fiscal year. Experts said this was due to continuity in lateral hiring in high-demand areas such as AI, machine learning, and cloud and engineering services, coupled with the salary increments, even though they are in the lower single digits.","content":"Tata Consultancy Services (TCS), Infosys and Wipro saw their wage cost in FY24 increase by more than 5.5% on average from the previous year, even as their year-on-year revenue growth slowed, averaging 3.6%.Their cumulative wage cost went up by Rs 18,036 crore in FY24, which experts attributed to continuity in lateral hiring in high-demand areas such as artificial intelligence (AI), machine learning (ML), and cloud and engineering services, coupled with the salary increments, even though they are in the lower single digits.Analysts said higher wage base as a result of high attrition and high demand during the Covid-19 pandemic is still acting as a headwind for IT companies wanting to normalise their wage bills. ","cleaned_content":"tata consultancy services tcs infosys and wipro saw their wage cost in fy24 increase by more than \u003cFIVE_PERCENT\u003e on average from the previous year even as their year on year revenue growth slowed averaging \u003cTHREE_PERCENT\u003e their cumulative wage cost went up by rs \u003cONE_TEN_THOUSAND\u003e crore in fy24 which experts attributed to continuity in lateral hiring in high demand areas such as artificial intelligence ai machine learning ml and cloud and engineering services coupled with the salary increments even though they are in the lower single digits analysts said higher wage base as a result of high attrition and high demand during the covid \u003cONE_TEN\u003e pandemic is still acting as a headwind for it companies wanting to normalise their wage bills","timestamp":"2024-04-22T06:01:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}