{"url":"https://economictimes.indiatimes.com/tech/information-tech/kpit-posts-strong-fy24-numbers-to-add-new-verticals-and-expand-in-asia/articleshow/109697311.cms","title":"KPIT posts strong FY24 numbers, to add new verticals and expand in Asia","description":"KPIT Technologies shows robust financial performance with significant revenue and profit growth. The company focuses on consistent growth, expanding into new segments, and geographical diversification for future success.","content":"KPIT Technologies, focused on automative and mobility software services, has reported a 47.2% year-on-year rise in net profit (attributable to shareholders) at Rs 164.4 crore for the fourth quarter ending March 2024.The Pune-headquartered firm’s profit a year ago stood at Rs 111.6 crore in Q4FY23 and at Rs 155.3 crore in the preceding quarter.During the quarter, its revenue from operations also increased 29% YoY to Rs 13,178 crore from Rs 10,173.7 crore posted in the same period last year.“We have consistently delivered 15 sequential quarters of healthy growth in revenues and operating profits…Global OEMs are pledged to changing their business model. Basis committed investments by our strategic clients, a strong pipeline and solid wins of $261 million in Q4, we continue to witness robust demand,” said Kishor Patil, cofounder, CEO and MD at KPIT.Patil also pointed out that the company has growth at an average of 30% in the last four years.","cleaned_content":"kpit technologies focused on automative and mobility software services has reported a \u003cFOUR_TEN_PERCENT\u003e year on year rise in net profit attributable to shareholders at rs \u003cONE_HUNDRED\u003e crore for the fourth quarter ending march \u003cTWO_THOUSAND\u003e the pune headquartered firm s profit a year ago stood at rs \u003cONE_HUNDRED\u003e crore in q4fy23 and at rs \u003cONE_HUNDRED\u003e crore in the preceding quarter during the quarter its revenue from operations also increased \u003cTWO_TEN_PERCENT\u003e yoy to rs \u003cONE_TEN_THOUSAND\u003e crore from rs \u003cONE_TEN_THOUSAND\u003e crore posted in the same period last year we have consistently delivered \u003cONE_TEN\u003e sequential quarters of healthy growth in revenues and operating profits global oems are pledged to changing their business model basis committed investments by our strategic clients a strong pipeline and solid wins of \u003cTWO_HUNDRED\u003e million in q4 we continue to witness robust demand said kishor patil cofounder ceo and md at kpit patil also pointed out that the company has growth at an average of \u003cTHREE_TEN_PERCENT\u003e in the last four years","timestamp":"2024-04-29T18:13:00+05:30","market_timestamp":"2024-04-30T09:15:00+05:30","off_market_hours":true}