{"url":"https://economictimes.indiatimes.com/tech/information-tech/coforges-net-profit-declines-6-to-rs-223-crore/articleshow/109792474.cms","title":"Coforge’s net profit declines 6% to Rs 223 crore","description":"Coforge's net profit declined in Q4 FY24 but annual profit rose significantly. Revenue increased, and margins improved. The company plans to acquire Cigniti Technologies to enhance revenue and operating margins, aiming for $2 billion by 2027.","content":"Coforge’s net profit declined by 6% quarter on quarter (QoQ) at Rs 223 crore in the March quarter of FY24. The profit for the company grew by a whopping 94.8% on-year, from a profit of Rs 115 crore in Q4 FY23.The IT firm’s annual net profit for fiscal 24 stood at Rs 808 crore, up 16.5% year on year. Consolidated revenue stood at Rs 2,358 crore in the just concluded quarter, up 1.5% sequentially and 8.7% on-year. Margins stood at 19% in Q4 up from 18% in Q3 FY24.Coforge's fresh order intake more than doubled to $774 million from $301 million a year earlier during the March-ending quarter that also saw the company signing a $400 million deal. The Noida-based IT firm also announced its plans to acquire 54% stake in Cigniti Technologies at a per share price of Rs 1,415. The acquisition process is expected to be completed by Q2 FY25. Revenue of Cigniti for FY 24 was Rs 814.47 crore and profit after tax was Rs 94.79 crore in the same period.Sudhir Singh, CEO, Coforge, said, “FY24 was an exemplary year where the firm grew 13.3% in CC organic terms, thus becoming one of the very few firms across the industry that was able to deliver on the annual growth guidance given at the beginning of FY24. The $400 million TCV (total contract value) deal signed in Q4, the 56% YoY increase in order intake and the 102-bps sequential margin improvement in Q4 set us up strongly to deliver robust growth in FY25 with expanded margins.”","cleaned_content":"coforge s net profit declined by \u003cSIX_PERCENT\u003e quarter on quarter qoq at rs \u003cTWO_HUNDRED\u003e crore in the march quarter of fy24 the profit for the company grew by a whopping \u003cNINE_TEN_PERCENT\u003e on year from a profit of rs \u003cONE_HUNDRED\u003e crore in q4 fy23 the it firm s annual net profit for fiscal \u003cTWO_TEN\u003e stood at rs \u003cEIGHT_HUNDRED\u003e crore up \u003cONE_TEN_PERCENT\u003e year on year consolidated revenue stood at rs \u003cTWO_THOUSAND\u003e crore in the just concluded quarter up \u003cONE_PERCENT\u003e sequentially and \u003cEIGHT_PERCENT\u003e on year margins stood at \u003cONE_TEN_PERCENT\u003e in q4 up from \u003cONE_TEN_PERCENT\u003e in q3 fy24 coforges fresh order intake more than doubled to \u003cSEVEN_HUNDRED\u003e million from \u003cTHREE_HUNDRED\u003e million a year earlier during the march ending quarter that also saw the company signing a \u003cFOUR_HUNDRED\u003e million deal the noida based it firm also announced its plans to acquire \u003cFIVE_TEN_PERCENT\u003e stake in cigniti technologies at a per share price of rs \u003cONE_THOUSAND\u003e the acquisition process is expected to be completed by q2 fy25 revenue of cigniti for fy \u003cTWO_TEN\u003e was rs \u003cEIGHT_HUNDRED\u003e crore and profit after tax was rs \u003cNINE_TEN\u003e crore in the same period sudhir singh ceo coforge said fy24 was an exemplary year where the firm grew \u003cONE_TEN_PERCENT\u003e in cc organic terms thus becoming one of the very few firms across the industry that was able to deliver on the annual growth guidance given at the beginning of fy24 the \u003cFOUR_HUNDRED\u003e million tcv total contract value deal signed in q4 the \u003cFIVE_TEN_PERCENT\u003e yoy increase in order intake and the \u003cONE_HUNDRED\u003e bps sequential margin improvement in q4 set us up strongly to deliver robust growth in fy25 with expanded margins","timestamp":"2024-05-02T20:52:00+05:30","market_timestamp":"2024-05-03T09:15:00+05:30","off_market_hours":true}