{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-q4-net-profit-down-41-to-rs-661-crore-revenue-tanks-6-2/articleshow/109602808.cms","title":"Tech Mahindra Q4 net profit down 41% to Rs 661 crore; revenue tanks 6.2%","description":"​The profit stood at Rs 1,118 crore in last year's March quarter. Sequentially, profit grew 29.6% from Rs 510 crore in the December quarter because of a one-off gain.","content":"Tech Mahindra, country's fifth largest IT services firm, reported a decline in net profit of 40.9% year-on-year (YoY)to Rs 661 crore primarily driven by slowdown in its telecom, communications, media and entertainment business, which is its largest vertical with 36.5% market share.The profit stood at Rs 1,118 crore in last year's March quarter. Sequentially, profit grew 29.6% from Rs 510 crore in the December quarter because of a one-off gain. The Pune-headquartered firm’s consolidated revenue from operations fell 6.2% YoY to Rs 12,871.30 crore from Rs 13,718 crore in March quarter of FY23. Sequentially, it dipped by 1.7% from Rs 13,101 crore in the preceding quarter.“Q4 (FY24) marks the low point in our year-on-year growth trajectory. We are confident from Q1 (FY25) will see animprovement. There, however, will be volatility between quarters,” said CEO Mohit Joshi.","cleaned_content":"tech mahindra countrys fifth largest it services firm reported a decline in net profit of \u003cFOUR_TEN_PERCENT\u003e year on year yoy to rs \u003cSIX_HUNDRED\u003e crore primarily driven by slowdown in its telecom communications media and entertainment business which is its largest vertical with \u003cTHREE_TEN_PERCENT\u003e market share the profit stood at rs \u003cONE_THOUSAND\u003e crore in last years march quarter sequentially profit grew \u003cTWO_TEN_PERCENT\u003e from rs \u003cFIVE_HUNDRED\u003e crore in the december quarter because of a one off gain the pune headquartered firm s consolidated revenue from operations fell \u003cSIX_PERCENT\u003e yoy to rs \u003cONE_TEN_THOUSAND\u003e crore from rs \u003cONE_TEN_THOUSAND\u003e crore in march quarter of fy23 sequentially it dipped by \u003cONE_PERCENT\u003e from rs \u003cONE_TEN_THOUSAND\u003e crore in the preceding quarter q4 fy24 marks the low point in our year on year growth trajectory we are confident from q1 fy25 will see animprovement there however will be volatility between quarters said ceo mohit joshi","timestamp":"2024-04-26T22:23:00+05:30","market_timestamp":"2024-04-29T09:15:00+05:30","off_market_hours":true}