{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-technologies-q4-profit-dips-27-to-rs-157-crore/articleshow/109818400.cms","title":"Tata Technologies Q4 profit dips 27% to Rs 157 crore","description":"Tata Technologies faced a 27.4% YoY net profit decrease in Q4 FY24 due to reduced technology solutions revenue and increased employee costs. Despite challenges, the company demonstrated resilience with strategic focus on market performance and growth initiatives.","content":"Tata Technologies (Tata Tech) on Friday posted a 27.4% year-on-year (YoY) drop in net profit at Rs 157.24 crore in the January to March quarter FY24 as compared to Rs 216.56 crore in the same quarter a year ago on the back of degrowth in technology solutions and rise in employee costs.Sequentially, net profit declined 7.6% from Rs 170.22 crore in the preceding quarter ending December 2023.Revenue from operations for the quarter stood at Rs 1,301.05 crore, a 7.2% fall from Rs 1,402.39 crore in March quarter FY23. Revenue edged up marginally from Rs 1,289.45 crore in the previous quarter.“In the last 3 years, our revenue from operations has grown at 29% CAGR while Operating EBITDA grew at a 35% CAGR…Our large deal pipeline remains healthy and continues to grow. We are currently engaged in a number of large deal discussions with existing and new customers and anticipate an uptick in deal conversions in the current quarter,” Warren Harris, chief executive officer and managing director at Tata Tech said.The Q4 business was weighed by a 28.6% YoY decrease in technology solutions segment, which constitutes one third of its revenues. However, sequentially, the revenues in the segment rose 6.1% quarter-on-quarter (QoQ). Besides, employee expenses and foreign exchange costs also added to profit woes.","cleaned_content":"tata technologies tata tech on friday posted a \u003cTWO_TEN_PERCENT\u003e year on year yoy drop in net profit at rs \u003cONE_HUNDRED\u003e crore in the january to march quarter fy24 as compared to rs \u003cTWO_HUNDRED\u003e crore in the same quarter a year ago on the back of degrowth in technology solutions and rise in employee costs sequentially net profit declined \u003cSEVEN_PERCENT\u003e from rs \u003cONE_HUNDRED\u003e crore in the preceding quarter ending december \u003cTWO_THOUSAND\u003e revenue from operations for the quarter stood at rs \u003cONE_THOUSAND\u003e crore a \u003cSEVEN_PERCENT\u003e fall from rs \u003cONE_THOUSAND\u003e crore in march quarter fy23 revenue edged up marginally from rs \u003cONE_THOUSAND\u003e crore in the previous quarter in the last \u003cTHREE_\u003e years our revenue from operations has grown at \u003cTWO_TEN_PERCENT\u003e cagr while operating ebitda grew at a \u003cTHREE_TEN_PERCENT\u003e cagr our large deal pipeline remains healthy and continues to grow we are currently engaged in a number of large deal discussions with existing and new customers and anticipate an uptick in deal conversions in the current quarter warren harris chief executive officer and managing director at tata tech said the q4 business was weighed by a \u003cTWO_TEN_PERCENT\u003e yoy decrease in technology solutions segment which constitutes one third of its revenues however sequentially the revenues in the segment rose \u003cSIX_PERCENT\u003e quarter on quarter qoq besides employee expenses and foreign exchange costs also added to profit woes","timestamp":"2024-05-03T17:27:00+05:30","market_timestamp":"2024-05-06T09:15:00+05:30","off_market_hours":true}