{"url":"https://economictimes.indiatimes.com/tech/information-tech/mphasis-q4-profit-dips-2-9-revenue-falls-by-5-2/articleshow/109611837.cms","title":"Mphasis Q4 profit falls 2.9%, revenue up 1.5% YoY","description":"Mphasis reported a 2.9% net profit decline to Rs 393.22 crore and a 1.5% revenue drop to Rs 3,412 crore. Full-year results showed a 5% profit decrease and a 3.7% revenue dip in FY24. Deal wins totaled $1.38 billion.","content":"Mid-sized IT services firm Mphasis has reported a 2.9% dip in net profit at Rs 393.22 crore as against Rs 405.31 crore in the year ago quarter.The fall in profit was largely driven by a 10% YoY degrowth in its banking, financial services (BFS) segment, which constitutes nearly half of its revenues.Mphasis witnessed a 10.8% YoY fall in its top 1-10 client metrics due to BFS related drops in early part of the year, it said.On a sequential basis, profit increased by 5.2% from Rs 373.6 crore in the previous quarter ending December 2023.New deals with total contract value (TCV) stood at $177 million in Q4 FY24 in Direct, of which 77% in new-gen services, the company said adding that conversion to revenue pace is seeing early signs without sharing numbers.","cleaned_content":"mid sized it services firm mphasis has reported a \u003cTWO_PERCENT\u003e dip in net profit at rs \u003cTHREE_HUNDRED\u003e crore as against rs \u003cFOUR_HUNDRED\u003e crore in the year ago quarter the fall in profit was largely driven by a \u003cONE_TEN_PERCENT\u003e yoy degrowth in its banking financial services bfs segment which constitutes nearly half of its revenues mphasis witnessed a \u003cONE_TEN_PERCENT\u003e yoy fall in its top \u003cONE_\u003e \u003cONE_TEN\u003e client metrics due to bfs related drops in early part of the year it said on a sequential basis profit increased by \u003cFIVE_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore in the previous quarter ending december \u003cTWO_THOUSAND\u003e new deals with total contract value tcv stood at \u003cONE_HUNDRED\u003e million in q4 fy24 in direct of which \u003cSEVEN_TEN_PERCENT\u003e in new gen services the company said adding that conversion to revenue pace is seeing early signs without sharing numbers","timestamp":"2024-04-26T12:13:00+05:30","market_timestamp":"2024-04-26T12:13:00+05:30","off_market_hours":false}