{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-new-ceo-srinivas-pallia-to-get-a-maximum-of-7-million/articleshow/109702805.cms","title":"Wipro’s new CEO Srinivas Pallia to get max pay of $7 million","description":"Wipro's new CEO, Srinivas Pallia, to receive $7 million annual compensation for two years. Thierry Delaporte to be paid $4.33 million in cash. Pallia's contract for five years starting from 2024.","content":"Wipro’s new CEO and MD, Srinivas Pallia, will receive a maximum compensation of $7 million per annum for the first two years, including a cash compensation that may range from a minimum of $1.75 million and a maximum of $3 million per annum.The IT major in a filing with BSE also said that the former CEO, Thierry Delaporte will be paid $4.33 million in the form of cash compensation and applicable social security contributions, subject to appropriate deductions. Meanwhile another exchange filing also shows that Delaporte sold all his stocks (about 4,72,292 Wipro shares) worth Rs 21.4 crore this month.Wipro disclosed in its filing that Pallia’s basic pay would range between $1,750,000 per annum to $3,000,000 per annum. He will also receive a target variable pay in the range of $1,750,000 per annum to $3,000,000 per annum. The actual payout will vary based on the organization level achievement on parameters of revenue and profit, and such other criteria as may be determined by the Board of Directors, from time to time, added the company.The new CEO will also receive long-term incentives i.e. \"stock compensation through grant of American Depository Shares (ADS) Restricted Stock Units (ADS RSUs) and ADS Performance Stock Units (ADS PSUs) aggregating to an amount $4,000,000, consisting of ADS RSUs worth of $1,400,000 and ADS PSUs worth of $2,600,000\". Vesting schedule of RSUs and PSUs is - 25% on May 2, 2025, 25% on May 2, 2026 and 50% on May 2, 2027. ","cleaned_content":"wipro s new ceo and md srinivas pallia will receive a maximum compensation of \u003cSEVEN_\u003e million per annum for the first two years including a cash compensation that may range from a minimum of \u003cONE_\u003e million and a maximum of \u003cTHREE_\u003e million per annum the it major in a filing with bse also said that the former ceo thierry delaporte will be paid \u003cFOUR_\u003e million in the form of cash compensation and applicable social security contributions subject to appropriate deductions meanwhile another exchange filing also shows that delaporte sold all his stocks about \u003cFOUR_HUNDRED_THOUSAND\u003e wipro shares worth rs \u003cTWO_TEN\u003e crore this month wipro disclosed in its filing that pallia s basic pay would range between \u003cONE_MILLION\u003e per annum to \u003cTHREE_MILLION\u003e per annum he will also receive a target variable pay in the range of \u003cONE_MILLION\u003e per annum to \u003cTHREE_MILLION\u003e per annum the actual payout will vary based on the organization level achievement on parameters of revenue and profit and such other criteria as may be determined by the board of directors from time to time added the company the new ceo will also receive long term incentives i e stock compensation through grant of american depository shares ads restricted stock units ads rsus and ads performance stock units ads psus aggregating to an amount \u003cFOUR_MILLION\u003e consisting of ads rsus worth of \u003cONE_MILLION\u003e and ads psus worth of \u003cTWO_MILLION\u003e vesting schedule of rsus and psus is \u003cTWO_TEN_PERCENT\u003e on may \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e \u003cTWO_TEN_PERCENT\u003e on may \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e and \u003cFIVE_TEN_PERCENT\u003e on may \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-04-30T06:01:00+05:30","market_timestamp":"2024-04-30T09:15:00+05:30","off_market_hours":true}