{"url":"https://economictimes.indiatimes.com/tech/information-tech/drop-in-renewal-deals-poses-revenue-challenge-for-top-it-firms/articleshow/109701684.cms","title":"Drop in renewal deals poses revenue challenge for top IT firms","description":"Deal momentum slowed in 2023-24 despite record deals as clients favor new over old deals. Vendor consolidation and slower decision-making ensued, impacting near-term revenues for service providers who must be proactive.","content":"Despite record deals announced in the final quarter of 2023-24, the deal momentum has slowed down from a year ago as companies are witnessing clients signing more net new and transformational deals rather than renewing old deals. The new deals are often of smaller value, leading to a dip in the revenue of software companies primarily due to lesser discretionary expenditure by client firms. This has also resulted in vendor consolidation and slower decision-making on larger deals, said analysts.“We have seen a sharp drop in renewal rates in the industry from 90-95% to 70-75%,” said Vikash Daga, senior partner, McKinsey \u0026 Company. “We have also come across clients pushing for early renewal on large deals either as part of vendor consolidation or to extract higher productivity. A drop in renewal rates poses a significant challenge for incumbents because it impacts near-term revenues. It is imperative for service providers to be more proactive and innovative to win renewals.”Large deals or contracts valued at more than $500 million are key revenue drivers for most IT services firms.“Slowdown in renewals and nature of tech spend is moving towards incremental tech currently away from two-three year transformational or long-term cloud implementations putting pressure on identifying new logos/ new deals to plug the gap,” said Gaurav Vasu, CEO of Bengaluru-based research firm UnearthInsight.The firm has forecast a $20-25 billion renewal deal pipeline from domestic and overseas markets in this financial year, compared to cumulative deal renewals of $25-30 billion in 2023-24.","cleaned_content":"despite record deals announced in the final quarter of \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the deal momentum has slowed down from a year ago as companies are witnessing clients signing more net new and transformational deals rather than renewing old deals the new deals are often of smaller value leading to a dip in the revenue of software companies primarily due to lesser discretionary expenditure by client firms this has also resulted in vendor consolidation and slower decision making on larger deals said analysts we have seen a sharp drop in renewal rates in the industry from \u003cNINE_TEN\u003e \u003cNINE_TEN_PERCENT\u003e to \u003cSEVEN_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e said vikash daga senior partner mckinsey company we have also come across clients pushing for early renewal on large deals either as part of vendor consolidation or to extract higher productivity a drop in renewal rates poses a significant challenge for incumbents because it impacts near term revenues it is imperative for service providers to be more proactive and innovative to win renewals large deals or contracts valued at more than \u003cFIVE_HUNDRED\u003e million are key revenue drivers for most it services firms slowdown in renewals and nature of tech spend is moving towards incremental tech currently away from two three year transformational or long term cloud implementations putting pressure on identifying new logos new deals to plug the gap said gaurav vasu ceo of bengaluru based research firm unearthinsight the firm has forecast a \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e billion renewal deal pipeline from domestic and overseas markets in this financial year compared to cumulative deal renewals of \u003cTWO_TEN\u003e \u003cTHREE_TEN\u003e billion in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e","timestamp":"2024-04-30T06:00:00+05:30","market_timestamp":"2024-04-30T09:15:00+05:30","off_market_hours":true}