{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-bags-multi-million-dollar-deal-to-transform-nokias-digital-workplace-services/articleshow/109731954.cms","title":"Wipro bags multi million dollar deal to transform Nokia's digital workplace services","description":"Designit, a Wipro company that specialises in user experience strategy and implementation, will conduct user research to ensure personalised assistance is offered to employees at the right time.","content":"IT services company Wipro Ltd on Tuesday announced that it has been selected by Nokia to overhaul its employee service desk and offer real-time IT support to a global network of employees, in a multi-million dollar deal. Wipro team will build a bespoke AI-powered, cloud-based solution for Nokia's workforce comprising around 86,700 users globally in 130 countries of operations.  The solution aims to enhance the employee experience by providing modular, secure, and automated services, Wipro said in a release.  The release said Wipro has clinched a multi-million-dollar deal to transform Nokia's digital workplace services.  Designit, a Wipro company that specialises in user experience strategy and implementation, will conduct user research to ensure personalised assistance is offered to employees at the right time.  The project will result in the creation of an experience-driven, omni-channel, and always-on global service desk, which will provide employees with flexible and secure services to empower them to effectively navigate a hybrid work environment, the release added. ","cleaned_content":"it services company wipro ltd on tuesday announced that it has been selected by nokia to overhaul its employee service desk and offer real time it support to a global network of employees in a multi million dollar deal wipro team will build a bespoke ai powered cloud based solution for nokias workforce comprising around \u003cEIGHT_TEN_THOUSAND\u003e users globally in \u003cONE_HUNDRED\u003e countries of operations the solution aims to enhance the employee experience by providing modular secure and automated services wipro said in a release the release said wipro has clinched a multi million dollar deal to transform nokias digital workplace services designit a wipro company that specialises in user experience strategy and implementation will conduct user research to ensure personalised assistance is offered to employees at the right time the project will result in the creation of an experience driven omni channel and always on global service desk which will provide employees with flexible and secure services to empower them to effectively navigate a hybrid work environment the release added","timestamp":"2024-04-30T18:26:00+05:30","market_timestamp":"2024-05-01T09:15:00+05:30","off_market_hours":true}