{"url":"https://economictimes.indiatimes.com/tech/information-tech/with-11-million-exit-pay-delaporte-joins-other-ceos-in-costly-exits/articleshow/109572105.cms","title":"With $11 million exit pay, Delaporte joins other CEOs in costly exits","description":"An analysis of employment contracts of top IT leaders shows that in recent years, payments to exiting CEOs at companies such as Tata Consultancy Services (TCS), Cognizant and Wipro have ranged from Rs 48 crore to Rs 92 crore.","content":"Outgoing Wipro CEO Thierry Delaporte is set to get a separation payment of Rs 92.1 crore (or about $11 million) after his ahead-of-schedule exit from India's fourth-biggest outsourcing company, joining a swelling list of top executives in the country's most globalized industry to have inked iron-clad job contracts that guarantee hefty severance packages.\"Pursuant to the terms of the employment arrangement with Mr. Delaporte, if his employment is terminated by the company without a cause, the company is required to pay Mr. Delaporte, severance pay of 12 months' base salary as last applicable when in service, payable over a 12-month period following the date of termination,\" reads the employment contract with the former chief executive of Wipro. \"These payments will cease if Mr. Delaporte obtains a new employment within the 12- month period or becomes a consultant to any company.\"Delaporte's total compensation in FY23 was just over $10 million.ET's email to Wipro on the severance amount to be paid to the outgoing CEO remained unanswered until the publication of this report. ","cleaned_content":"outgoing wipro ceo thierry delaporte is set to get a separation payment of rs \u003cNINE_TEN\u003e crore or about \u003cONE_TEN\u003e million after his ahead of schedule exit from indias fourth biggest outsourcing company joining a swelling list of top executives in the countrys most globalized industry to have inked iron clad job contracts that guarantee hefty severance packages pursuant to the terms of the employment arrangement with mr delaporte if his employment is terminated by the company without a cause the company is required to pay mr delaporte severance pay of \u003cONE_TEN\u003e months base salary as last applicable when in service payable over a \u003cONE_TEN\u003e month period following the date of termination reads the employment contract with the former chief executive of wipro these payments will cease if mr delaporte obtains a new employment within the \u003cONE_TEN\u003e month period or becomes a consultant to any company delaportes total compensation in fy23 was just over \u003cONE_TEN\u003e million ets email to wipro on the severance amount to be paid to the outgoing ceo remained unanswered until the publication of this report","timestamp":"2024-04-25T09:03:00+05:30","market_timestamp":"2024-04-25T09:15:00+05:30","off_market_hours":true}