{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-promotes-hari-shetty-as-chief-strategist-and-sales-officer/articleshow/109792712.cms","title":"Wipro promotes Hari Shetty as chief strategist and sales officer","description":"Wipro named Hari Shetty as Chief Strategist. The Bengaluru-headquartered firm makes first CXO appointment under new CEO Srinivas Pallia.","content":"Indian IT major Wipro on May 2 elevated Hari Shetty as its Chief Strategist and Sales Excellence Officer from immediate effect, the company informed in an exchange filing.This is the first CXO-level appointment made by the Bengaluru-headquartered firm after the new CEO Srinivas Pallia who took charge this month on April 6 following the resignation of former CEO Thierry Delaporte.Based in the US, Shetty was until today the senior vice president \u0026 sector head for technology platforms, products \u0026 gaming at Wipro.“His expertise encompasses client engagement, strategy development, execution, and P\u0026L oversight for his business. Hari’s profound passion for technology drives his belief in its transformative potential for businesses and society,” Wipro said in the filing.An old hand with 3 decades at Wipro, Shetty previously also played leadership roles across several industries including retail and distribution.","cleaned_content":"indian it major wipro on may \u003cTWO_\u003e elevated hari shetty as its chief strategist and sales excellence officer from immediate effect the company informed in an exchange filing this is the first cxo level appointment made by the bengaluru headquartered firm after the new ceo srinivas pallia who took charge this month on april \u003cSIX_\u003e following the resignation of former ceo thierry delaporte based in the us shetty was until today the senior vice president sector head for technology platforms products gaming at wipro his expertise encompasses client engagement strategy development execution and p l oversight for his business hari s profound passion for technology drives his belief in its transformative potential for businesses and society wipro said in the filing an old hand with \u003cTHREE_\u003e decades at wipro shetty previously also played leadership roles across several industries including retail and distribution","timestamp":"2024-05-02T21:11:00+05:30","market_timestamp":"2024-05-03T09:15:00+05:30","off_market_hours":true}