{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-sweats-to-eke-out-margins-on-pricing-squeeze-staff-costs/articleshow/110092617.cms","title":"IT sweats to eke out margins on pricing squeeze, staff costs","description":"Indian outsourcing companies face a margin squeeze in FY24 due to a triple threat: aggressive deal pricing, rising employee costs, and the pressure to boost revenue despite tight global budgets. Notably, Tata Consultancy Services (TCS), the industry leader, seems to be the only exception.","content":"Competitive deal pricing, rising staff budgets, and mounting pressure to expand revenues amid a global budget crunch have combined to hurt FY24 operating margins at Indian outsourcing companies, with only market leader Tata Consultancy Services (TCS) bucking the trend.“Deal pricing is so competitive, service providers cannot reduce costs fast enough anymore to maintain operating margins,” said Phil Fersht, CEO of HFS Research.According to Fersht, to win deals, especially renewing existing contracts, service providers are negotiating as hard as up to 20-30% price decreases.“Most of the service providers have such poor deal pipelines they are bringing forward renewals with the carrot of 20-30% price decreases. We are seeing this much more across the top tier firms as large deals are in decline. Mid tiers are able to go after smaller deals more aggressively which do not eat into operation margins as much.” ","cleaned_content":"competitive deal pricing rising staff budgets and mounting pressure to expand revenues amid a global budget crunch have combined to hurt fy24 operating margins at indian outsourcing companies with only market leader tata consultancy services tcs bucking the trend deal pricing is so competitive service providers cannot reduce costs fast enough anymore to maintain operating margins said phil fersht ceo of hfs research according to fersht to win deals especially renewing existing contracts service providers are negotiating as hard as up to \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e price decreases most of the service providers have such poor deal pipelines they are bringing forward renewals with the carrot of \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e price decreases we are seeing this much more across the top tier firms as large deals are in decline mid tiers are able to go after smaller deals more aggressively which do not eat into operation margins as much","timestamp":"2024-05-14T06:01:00+05:30","market_timestamp":"2024-05-14T09:15:00+05:30","off_market_hours":true}