{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-to-settle-lawsuits-against-former-executives-jatin-dalal-haque/articleshow/110070288.cms","title":"Wipro to settle lawsuits against former executives Jatin Dalal, Haque","description":"Wipro's new CEO, Srinivas Pallia, plans to settle legal issues with former executives like Jatin Dalal for contract breaches. Settlement details undisclosed, expected this week. Times of India first reported post-Thierry Delaporte's exit amidst lawsuits in November.","content":"Srinivas Pallia, the new chief executive officer of Wipro, has decided to settle the legal suits against its former senior executives including erstwhile chief financial officer Jatin Dalal for breach of employment contracts, a person close to the development confirmed.While the terms of the settlement could not be ascertained, it is likely to be executed within this week.The settlement move, first reported by the Times of India, comes in less than a month after Pallia’s appointment following resignation of Thierry Delaporte in early April, under whose leadership at least two lawsuits were filed in November.Wipro did not respond to a request for comment.In January this year, a Bengaluru civil court referred the case against Dalal to arbitration, to be heard outside court proceedings.","cleaned_content":"srinivas pallia the new chief executive officer of wipro has decided to settle the legal suits against its former senior executives including erstwhile chief financial officer jatin dalal for breach of employment contracts a person close to the development confirmed while the terms of the settlement could not be ascertained it is likely to be executed within this week the settlement move first reported by the times of india comes in less than a month after pallia s appointment following resignation of thierry delaporte in early april under whose leadership at least two lawsuits were filed in november wipro did not respond to a request for comment in january this year a bengaluru civil court referred the case against dalal to arbitration to be heard outside court proceedings","timestamp":"2024-05-13T10:06:00+05:30","market_timestamp":"2024-05-13T10:06:00+05:30","off_market_hours":false}