{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-coo-amit-choudhary-resigns-sanjeev-jain-appointed-as-successor/articleshow/110209602.cms","title":"Wipro’s COO Amit Choudhary resigns; Sanjeev Jain appointed as successor","description":"Sanjeev Jain joined Wipro in 2023 as the global head of business operations after his stint at Cognizant, GE, IBM and Kyndryl Holdings (IBM spin-off). He will report to new CEO and MD Srinivas Pallia.","content":"Wipro's chief operating officer Amit Choudhary stepped down from his role on Friday, a week after Anis Chenchah, the chief executive of APMEA (Asia Pacific, India, Middle East \u0026 Africa) Strategic Market Unit (SMU) resigned. This is the second senior executive exit at the IT major after new CEO Srinivas Pallia took the helm last month.The IT major appointed Sanjeev Jain as the chief operating officer effective immediately.Jain will report to Pallia and will continue to be a member of Wipro’s Executive Committee, said the company in a filing with BSE.Both Chenchah and Choudhary joined Wipro when former CEO Thierry Delaporte was the CEO. All three (Delaporte, Choudhary and Chencha) joined Wipro from the French IT consulting major Capgemini. Sanjeev joined Wipro in 2023 as the global head of business operations after his stint at Cognizant, GE, IBM and Kyndryl Holdings (IBM spin-off).","cleaned_content":"wipros chief operating officer amit choudhary stepped down from his role on friday a week after anis chenchah the chief executive of apmea asia pacific india middle east africa strategic market unit smu resigned this is the second senior executive exit at the it major after new ceo srinivas pallia took the helm last month the it major appointed sanjeev jain as the chief operating officer effective immediately jain will report to pallia and will continue to be a member of wipro s executive committee said the company in a filing with bse both chenchah and choudhary joined wipro when former ceo thierry delaporte was the ceo all three delaporte choudhary and chencha joined wipro from the french it consulting major capgemini sanjeev joined wipro in \u003cTWO_THOUSAND\u003e as the global head of business operations after his stint at cognizant ge ibm and kyndryl holdings ibm spin off","timestamp":"2024-05-17T17:00:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}