{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-collaborates-with-aeee-and-iihs-to-decarbonise-indias-commercial-building-sector/articleshow/109980921.cms","title":"Infosys collaborates with AEEE, IIHS to decarbonise India’s commercial building sector","description":"Infosys, AEEE, and IIHS collaborate on 'ASSURE' to decarbonize India's commercial building sector, aiming for 100 million sq. ft. of high-performance buildings by 2030. The initiative includes experts, lighthouse projects, and engagement with financial institutions.","content":"Infosys along with Alliance for an Energy Efficient Economy (AEEE) and Indian Institute for Human Settlements (IIHS) on Thursday launched 'ASSURE' (Accelerating Sustainable and Super-efficient Real Estate) to decarbonize India’s commercial building sector and cement the country’s global leadership in climate action and sustainability.The program aims to realize 100 million sq. ft. of high-performance commercial buildings in India by 2030.ASSURE is designed as the world's largest organized effort to implement high-performance buildings at scale. Bringing together experts, innovators, enterprises, and the government, it aims to provide technical assistance to lighthouse projects, ecosystem-wide capacity development, and demonstrate viability drawing inspiration from Infosys’ campuses. In addition, ASSURE will help foster entrepreneurship, collaborate with government agencies to help create a supportive policy environment and engage with large financial institutions to implement high-performance commercial buildings, Infosys said in a statement.Infosys chairman Nandan Nilekani said India's building sector presented a significant opportunity to make progress on India’s sustainability goals. “We are delighted to collaborate with AEEE and IIHS, and to amplify the potential of their nation-wide community of industry leaders, practitioners, knowledge institutions, and students to drive positive climate action. ASSURE – our joint program – creates the next opportunity to make a significant impact on India's environmental footprint, paving the way for a greener and more sustainable future for generations to come.”AEEE President Satish Kumar said that ASSURE was being launched not just to meet global standards but to set new ones. “By integrating rigorous performance validation and ambitious emissions reduction targets, we aim to transform building practices and drive real change. Together, let's harness our collective expertise to not only reach but exceed these benchmarks, proving that a sustainable future is not only possible but inevitable.”","cleaned_content":"infosys along with alliance for an energy efficient economy aeee and indian institute for human settlements iihs on thursday launched assure accelerating sustainable and super efficient real estate to decarbonize india s commercial building sector and cement the country s global leadership in climate action and sustainability the program aims to realize \u003cONE_HUNDRED\u003e million sq ft of high performance commercial buildings in india by \u003cTWO_THOUSAND\u003e assure is designed as the worlds largest organized effort to implement high performance buildings at scale bringing together experts innovators enterprises and the government it aims to provide technical assistance to lighthouse projects ecosystem wide capacity development and demonstrate viability drawing inspiration from infosys campuses in addition assure will help foster entrepreneurship collaborate with government agencies to help create a supportive policy environment and engage with large financial institutions to implement high performance commercial buildings infosys said in a statement infosys chairman nandan nilekani said indias building sector presented a significant opportunity to make progress on india s sustainability goals we are delighted to collaborate with aeee and iihs and to amplify the potential of their nation wide community of industry leaders practitioners knowledge institutions and students to drive positive climate action assure our joint program creates the next opportunity to make a significant impact on indias environmental footprint paving the way for a greener and more sustainable future for generations to come aeee president satish kumar said that assure was being launched not just to meet global standards but to set new ones by integrating rigorous performance validation and ambitious emissions reduction targets we aim to transform building practices and drive real change together lets harness our collective expertise to not only reach but exceed these benchmarks proving that a sustainable future is not only possible but inevitable","timestamp":"2024-05-09T16:24:00+05:30","market_timestamp":"2024-05-10T09:15:00+05:30","off_market_hours":true}