{"url":"https://economictimes.indiatimes.com/tech/information-tech/top-two-tech-firms-shed-gen-z-flab-gain-silver-muscle/articleshow/110238724.cms","title":"Top two tech firms shed Gen Z flab, gain silver muscle","description":"The share of Gen Z employees - or those aged 30 and under - fell by about 5 percentage points last fiscal at Bengaluru-based Infosys, and by over 2.5 percentage points at Mumbai-based TCS. The trend underscores a tepid IT hiring climate amid industry turbulence, which have impacted onboarding of young talent the most.","content":"Bengaluru: Tata Consultancy Services Ltd and Infosys, India's top two IT services exporters, have seen the share of Gen Z employees as a percentage of their total headcount plunge to the lowest in five years and a decade, respectively, showed an ET analysis.The share of Gen Z employees - or those aged 30 and under - fell by about 5 percentage points last fiscal at Bengaluru-based Infosys, and by over 2.5 percentage points at Mumbai-based TCS. The trend underscores a tepid IT hiring climate amid industry turbulence, which have impacted onboarding of young talent the most. At Infosys, the share of such employees declined to 54.7% in FY24 from 59.6% in FY23. The figure stood at about 59.6% in FY22, and 55.4% and 57.5% in FY21 and FY20, respectively. Between FY15 and FY19, the share of young staff ranged between 58% and 68.5% at Infosys. In fact, in FY15, it was the highest at 68.5%, documents uploaded on the company's investor page showed.IT bellwether TCS saw its share of young employees (aged below 30) in India drop from 59% in FY22 to 53% in FY23 and then 50.3% in FY24. In FY21 and FY20, it was at 56% and 52%, respectively.On the other hand, the percentage of senior employees equal to or above 50 years at Infosys has been rising over the years touching 2.9% last fiscal. Like Infosys, TCS saw the percentage of employees above 50 years increase marginally in FY24.","cleaned_content":"bengaluru tata consultancy services ltd and infosys indias top two it services exporters have seen the share of gen z employees as a percentage of their total headcount plunge to the lowest in five years and a decade respectively showed an et analysis the share of gen z employees or those aged \u003cTHREE_TEN\u003e and under fell by about \u003cFIVE_PERCENT\u003e age points last fiscal at bengaluru based infosys and by over \u003cTWO_PERCENT\u003e age points at mumbai based tcs the trend underscores a tepid it hiring climate amid industry turbulence which have impacted onboarding of young talent the most at infosys the share of such employees declined to \u003cFIVE_TEN_PERCENT\u003e in fy24 from \u003cFIVE_TEN_PERCENT\u003e in fy23 the figure stood at about \u003cFIVE_TEN_PERCENT\u003e in fy22 and \u003cFIVE_TEN_PERCENT\u003e and \u003cFIVE_TEN_PERCENT\u003e in fy21 and fy20 respectively between fy15 and fy19 the share of young staff ranged between \u003cFIVE_TEN_PERCENT\u003e and \u003cSIX_TEN_PERCENT\u003e at infosys in fact in fy15 it was the highest at \u003cSIX_TEN_PERCENT\u003e documents uploaded on the companys investor page showed it bellwether tcs saw its share of young employees aged below \u003cTHREE_TEN\u003e in india drop from \u003cFIVE_TEN_PERCENT\u003e in fy22 to \u003cFIVE_TEN_PERCENT\u003e in fy23 and then \u003cFIVE_TEN_PERCENT\u003e in fy24 in fy21 and fy20 it was at \u003cFIVE_TEN_PERCENT\u003e and \u003cFIVE_TEN_PERCENT\u003e respectively on the other hand the percentage of senior employees equal to or above \u003cFIVE_TEN\u003e years at infosys has been rising over the years touching \u003cTWO_PERCENT\u003e last fiscal like infosys tcs saw the percentage of employees above \u003cFIVE_TEN\u003e years increase marginally in fy24","timestamp":"2024-05-19T07:05:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}