{"url":"https://economictimes.indiatimes.com/tech/information-tech/talent-hunting-tech-rivals-circle-around-vexed-ltimindtree/articleshow/110444164.cms","title":"Talent-hunting tech rivals circle around vexed LTIMindtree","description":"LTIMindtree was born out of the merger between L\u0026T Infotech and Mindtree in November 2022. Analysts have attributed this to integration pains. CEO Debashis Chatterjee has said it’s business as usual.","content":"The senior talent pool of LTIMindtree has become a hunting ground for other IT companies one and a half years after the merger that created the country’s sixth largest software services company. LTIMindtree was born out of the merger between L\u0026T Infotech and Mindtree in November 2022. Analysts have attributed this to integration pains. CEO Debashis Chatterjee has said it’s business as usual.While the company is reportedly devising a succession plan, about two dozen senior executives have resigned and joined rivals and other tech companies such as Cognizant, Capgemini, Persistent Systems, Tech Mahindra, Sonata and others, an ET analysis of brokerage house reports and LinkedIn profiles showed.Also read | LTIMindtree Q4 profit falls 1.2%, revenue edges upIn 2024, at least eight senior executives have quit LTIMindtree and joined Cognizant, Capgemini, Persistent Systems and Xoriant among others. The most recent instance is of Vinit Teredesai, who was appointed chief financial officer at Persistent Systems last week. Teredesai had quit in April.The exodus has got experts and analysts tracking the company worried. ","cleaned_content":"the senior talent pool of ltimindtree has become a hunting ground for other it companies one and a half years after the merger that created the country s sixth largest software services company ltimindtree was born out of the merger between l t infotech and mindtree in november \u003cTWO_THOUSAND\u003e analysts have attributed this to integration pains ceo debashis chatterjee has said it s business as usual while the company is reportedly devising a succession plan about two dozen senior executives have resigned and joined rivals and other tech companies such as cognizant capgemini persistent systems tech mahindra sonata and others an et analysis of brokerage house reports and linkedin profiles showed also read ltimindtree q4 profit falls \u003cONE_PERCENT\u003e revenue edges upin \u003cTWO_THOUSAND\u003e at least eight senior executives have quit ltimindtree and joined cognizant capgemini persistent systems and xoriant among others the most recent instance is of vinit teredesai who was appointed chief financial officer at persistent systems last week teredesai had quit in april the exodus has got experts and analysts tracking the company worried","timestamp":"2024-05-27T06:00:00+05:30","market_timestamp":"2024-05-27T09:15:00+05:30","off_market_hours":true}