{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-consumer-vc-unit-plans-more-investments-from-rs-250-crore-fund/articleshow/110253216.cms","title":"Wipro Consumer VC looks for more follow-on rounds","description":"Sumit Keshan,  managing partner of Wipro Consumer Care – Ventures, said the fund's approach has been to invest $1-3 million per deal with a follow-on investment that can go up to $4 million. The second fund will make a portfolio of around 15-16 companies, largely with the same ticket sizes, with a little more focus on follow-on funding, he added.","content":"The venture capital arm of Wipro Consumer Care \u0026 Lighting plans to do more follow-on investments from its second fund, which has a corpus of Rs 250 crore, according to its top executive.The approach of Wipro Consumer Care – Ventures has been to invest $1-3 million per deal with a follow-on investment that can go up to $4 million. The second fund will look to build a portfolio of around 15-16 companies, largely with the same ticket sizes, with a little more focus on follow-on funding, said the VC firm’s managing partner, Sumit Keshan.“We will do more cases of follow-on (investments) in fund II. The need for capital for good and growing companies is still there. So, the options they have is to either look internally or externally. Over a period through learning, we realised that probably we need to increase follow-on as that can be helpful for those companies, and can look at the return on the new money as well,” Keshan said.\"And if the going is good, you don't want to keep funding that firm. I think that is the thesis that we want to go with,” he added.Part of the billionaire businessman Azim Premji-led Wipro group, the corporate venture capital firm of Wipro Consumer Care \u0026 Lighting aims to start committing capital from the second fund after fully deploying the balance 25% from the Rs 200 crore first fund.","cleaned_content":"the venture capital arm of wipro consumer care lighting plans to do more follow on investments from its second fund which has a corpus of rs \u003cTWO_HUNDRED\u003e crore according to its top executive the approach of wipro consumer care ventures has been to invest \u003cONE_\u003e \u003cTHREE_\u003e million per deal with a follow on investment that can go up to \u003cFOUR_\u003e million the second fund will look to build a portfolio of around \u003cONE_TEN\u003e \u003cONE_TEN\u003e companies largely with the same ticket sizes with a little more focus on follow on funding said the vc firm s managing partner sumit keshan we will do more cases of follow on investments in fund ii the need for capital for good and growing companies is still there so the options they have is to either look internally or externally over a period through learning we realised that probably we need to increase follow on as that can be helpful for those companies and can look at the return on the new money as well keshan said and if the going is good you dont want to keep funding that firm i think that is the thesis that we want to go with he added part of the billionaire businessman azim premji led wipro group the corporate venture capital firm of wipro consumer care lighting aims to start committing capital from the second fund after fully deploying the balance \u003cTWO_TEN_PERCENT\u003e from the rs \u003cTWO_HUNDRED\u003e crore first fund","timestamp":"2024-05-20T06:00:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}