{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-rishad-premji-takes-pay-cut-ex-ceo-delaporte-takes-home-20-mn/articleshow/110356920.cms","title":"Wipro’s Rishad Premji takes pay cut, ex CEO Delaporte takes home $20 mn","description":"Wipro executive chairman Rishad Premji declined variable pay for the second consecutive year due to negative profit growth. He took a 20% pay cut, earning $769,456 in FY24. Former CEO Thierry Delaporte became the highest-paid IT sector CEO with $20.11 million in compensation for FY24, including a $11 million separation payment upon resignation.","content":"Wipro executive chairman Rishad Premji did not take any variable or commission pay from his annual remuneration for the second year in a row in FY24. The commission element was withheld as the company's incremental consolidated net profit for the year was negative, the IT company said in its recent 20-F filing with the US Securities and Exchange Commission.Premji took a pay cut of around 20% with a compensation package of $769,456 (around Rs 6.5 crore) in FY24 from $951,353 (around Rs 7.9 crore) a year ago. Consequently, his salary showed a decline to $692,641 (around Rs 5.8 crore) from last year’s $861,000 (around Rs 7.2 crore) with the balance being other long-term compensation, the filing released on Thursday showed.Wipro chairman Azim Premji’s son Rishad Premji is entitled to a 0.35% commission on incremental consolidated net profits of Wipro over the previous fiscal year.“However, in light of the fact that the incremental consolidated net profits for fiscal year 2024 was negative, the Company determined that no commission was payable for fiscal year 2024 to Mr. Rishad A. Premji,” the company filing said.Rishad Premji was also not granted any stock options this year as well. Aged 46, Rishad Premji took over as chairman of Wipro in 2019 for a period of five years and has been reappointed for a further five years till July 30, 2029.","cleaned_content":"wipro executive chairman rishad premji did not take any variable or commission pay from his annual remuneration for the second year in a row in fy24 the commission element was withheld as the companys incremental consolidated net profit for the year was negative the it company said in its recent \u003cTWO_TEN\u003e f filing with the us securities and exchange commission premji took a pay cut of around \u003cTWO_TEN_PERCENT\u003e with a compensation package of \u003cSEVEN_HUNDRED_THOUSAND\u003e around rs \u003cSIX_\u003e crore in fy24 from \u003cNINE_HUNDRED_THOUSAND\u003e around rs \u003cSEVEN_\u003e crore a year ago consequently his salary showed a decline to \u003cSIX_HUNDRED_THOUSAND\u003e around rs \u003cFIVE_\u003e crore from last year s \u003cEIGHT_HUNDRED_THOUSAND\u003e around rs \u003cSEVEN_\u003e crore with the balance being other long term compensation the filing released on thursday showed wipro chairman azim premji s son rishad premji is entitled to a \u003cZERO_PERCENT\u003e commission on incremental consolidated net profits of wipro over the previous fiscal year however in light of the fact that the incremental consolidated net profits for fiscal year \u003cTWO_THOUSAND\u003e was negative the company determined that no commission was payable for fiscal year \u003cTWO_THOUSAND\u003e to mr rishad a premji the company filing said rishad premji was also not granted any stock options this year as well aged \u003cFOUR_TEN\u003e rishad premji took over as chairman of wipro in \u003cTWO_THOUSAND\u003e for a period of five years and has been reappointed for a further five years till july \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-05-23T19:55:00+05:30","market_timestamp":"2024-05-24T09:15:00+05:30","off_market_hours":true}