{"url":"https://economictimes.indiatimes.com/tech/information-tech/gccs-see-regulatory-compliance-as-key-for-india-expansion-survey/articleshow/110543128.cms","title":"GCCs see regulatory compliance as key for India expansion: Survey","description":"Global capability centres (GCCs) operating in India have made it a priority to understand local compliance norms amid an evolving regulatory and GenAI landscape, as per a Nasscom-KPMG survey report.","content":"With an evolving regulatory and GenAI landscape, navigating complex compliances such as transfer pricing, SEZ (special economic zone), labour and data laws are among key priorities for the global capability centres (GCCs) operating in India, said a Nasscom-KPMG survey report. \"81% of respondents mentioned transfer pricing as the top regulatory priority for GCCs in India. More than half of the respondents highlighted SEZ laws and STPI regulations (67%) and labour laws (60%) among key regulatory priorities,\" stated the report titled 'GCCs in India: Building resilience for sustainable growth', to be released today. \"India has been quite friendly when it comes to regulatory environment in a lot of places. But I think GCCs have a very complex frameworks and the processes... maybe at certain cases the transfer pricing rates may be on the higher side. So, obviously there is scope for improvement over there,\" Achyuta Ghosh, senior director and head - Insights at Nasscom. ","cleaned_content":"with an evolving regulatory and genai landscape navigating complex compliances such as transfer pricing sez special economic zone labour and data laws are among key priorities for the global capability centres gccs operating in india said a nasscom kpmg survey report \u003cEIGHT_TEN_PERCENT\u003e of respondents mentioned transfer pricing as the top regulatory priority for gccs in india more than half of the respondents highlighted sez laws and stpi regulations \u003cSIX_TEN_PERCENT\u003e and labour laws \u003cSIX_TEN_PERCENT\u003e among key regulatory priorities stated the report titled gccs in india building resilience for sustainable growth to be released today india has been quite friendly when it comes to regulatory environment in a lot of places but i think gccs have a very complex frameworks and the processes maybe at certain cases the transfer pricing rates may be on the higher side so obviously there is scope for improvement over there achyuta ghosh senior director and head insights at nasscom","timestamp":"2024-05-30T06:00:00+05:30","market_timestamp":"2024-05-30T09:15:00+05:30","off_market_hours":true}