{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-switzerland-head-quits-firm-appoints-bruno-schenk/articleshow/110676220.cms","title":"Wipro's Switzerland head quits; Bruno Schenk to take over","description":"Indian IT major Wipro on Monday appointed Bruno Schenk succeeds René Mulder, who joined Wipro in February 2021 and has decided to pursue opportunities outside Wipro.","content":"In yet another senior appointment, Indian IT major Wipro on Monday appointed Bruno Schenk as the country head and managing director for Switzerland, effective immediately. He will report to Wipro’s Europe CEO Pierre Bruno, the company said in an exchange filing.Schenk succeeds René Mulder, who joined Wipro in February 2021 and has decided to pursue opportunities outside Wipro.Prior to Wipro, Schenk was the chief executive and country head at Cloudreach, an Atos company. Schenk also led Eviden Switzerland, another Atos business that combines digital, big data and security solutions.This comes after the Azim Premji-backed firm elevated Srinivas Pallia to the CEO position following the resignation of its former CEO Thierry Delaporte ahead of its fourth-quarter financial results in April. ET has reported on senior-level changes in the IT major.Also read | Wipro CEO banks on internal talent, promotes veterans","cleaned_content":"in yet another senior appointment indian it major wipro on monday appointed bruno schenk as the country head and managing director for switzerland effective immediately he will report to wipro s europe ceo pierre bruno the company said in an exchange filing schenk succeeds ren mulder who joined wipro in february \u003cTWO_THOUSAND\u003e and has decided to pursue opportunities outside wipro prior to wipro schenk was the chief executive and country head at cloudreach an atos company schenk also led eviden switzerland another atos business that combines digital big data and security solutions this comes after the azim premji backed firm elevated srinivas pallia to the ceo position following the resignation of its former ceo thierry delaporte ahead of its fourth quarter financial results in april et has reported on senior level changes in the it major also read wipro ceo banks on internal talent promotes veterans","timestamp":"2024-06-04T00:31:00+05:30","market_timestamp":"2024-06-04T09:15:00+05:30","off_market_hours":true}