{"url":"https://economictimes.indiatimes.com/tech/information-tech/globallogic-sees-increased-business-from-india-based-gccs/articleshow/110602576.cms","title":"GlobalLogic sees increased business from India-based GCCs","description":"GlobalLogic has seen a significant increase in its India business due to the growing number of global capability centres (GCCs) in the country, according to the company's top executives.","content":"GlobalLogic has seen a significant increase in its India business because of the growing number of global capability centres (GCCs) in the country, the IT engineering firm’s top executives said.The number of GCC clients the company has in India rose to 36 in the last fiscal year from 15, in a period also marked by 90℅ growth in its GCC business where it provides niche IT engineering services to these hubs of multinationals, chief executive Nitesh Banga and India head Piyush Jha told ET.Rising macro uncertainty globally has made the company take a strategic decision whereby it is enhancing offerings and expanding tie-ups with top clients. The firm, which became a Hitachi subsidiary after the Japanese firm acquired it in 2021, said because more mission-critical work like digital engineering and product and platform engineering is coming to Indian GCCs, engineering services companies like GlobalLogic too are getting more contracts.“I think of it as an embedded-lab kind of model, where we are working with them (GCCs), sometimes as a sidecar when let's say they have gaps in their skillsets or face scaling issues. Most of the times, if the GCC is set up in location A, we deploy our support staff in location B. They may not have an interest in going into (that location), but we become a good partner to them to support that speed of growth as more and more businesses come into India GCCs in terms of cost-efficiency or a product-based mindset,” Banga said.“Earlier, a lot of GCCs were primarily focussed on shared services and backend enablement functions, but increasingly, more and more mission-critical, digital product work and digital engineering work is coming to GCCs. That is an important point for us because we are not an IT services firm. Earlier, the GCC mandate didn't fit what we used to do, but now they are getting more and more innovation and acceleration-led work, which gives us an opportunity to join hands with them,” he added.","cleaned_content":"globallogic has seen a significant increase in its india business because of the growing number of global capability centres gccs in the country the it engineering firm s top executives said the number of gcc clients the company has in india rose to \u003cTHREE_TEN\u003e in the last fiscal year from \u003cONE_TEN\u003e in a period also marked by \u003cNINE_TEN\u003e growth in its gcc business where it provides niche it engineering services to these hubs of multinationals chief executive nitesh banga and india head piyush jha told et rising macro uncertainty globally has made the company take a strategic decision whereby it is enhancing offerings and expanding tie ups with top clients the firm which became a hitachi subsidiary after the japanese firm acquired it in \u003cTWO_THOUSAND\u003e said because more mission critical work like digital engineering and product and platform engineering is coming to indian gccs engineering services companies like globallogic too are getting more contracts i think of it as an embedded lab kind of model where we are working with them gccs sometimes as a sidecar when lets say they have gaps in their skillsets or face scaling issues most of the times if the gcc is set up in location a we deploy our support staff in location b they may not have an interest in going into that location but we become a good partner to them to support that speed of growth as more and more businesses come into india gccs in terms of cost efficiency or a product based mindset banga said earlier a lot of gccs were primarily focussed on shared services and backend enablement functions but increasingly more and more mission critical digital product work and digital engineering work is coming to gccs that is an important point for us because we are not an it services firm earlier the gcc mandate didnt fit what we used to do but now they are getting more and more innovation and acceleration led work which gives us an opportunity to join hands with them he added","timestamp":"2024-06-01T06:01:00+05:30","market_timestamp":"2024-06-03T09:15:00+05:30","off_market_hours":true}