{"url":"https://economictimes.indiatimes.com/tech/information-tech/us-court-levies-194-million-penal-charges-on-tcs-for-misappropriation-of-trade-secrets/articleshow/111005327.cms","title":"US court levies $194 million penal charges on TCS for misappropriation of trade secrets","description":"A US court ruled TCS liable for misappropriation of trade secrets, penalizing around USD 194 million. TCS to appeal. Ordered to pay damages and face injunctions, but expects no major financial or operational impact.","content":"A US court has ruled that Tata Consultancy Services is liable for misappropriation of trade secrets and levied penal charges of around USD 194 million on the IT major, a regulatory filing said on Friday. TCS, however, said it has strong arguments against the judgement and is taking necessary steps to protect its interest through review or appeal. The order has been passed against the company in a case filed by Computer Sciences Corporation (CSC) -- now merged with DXC Technology Company (DXC) -- alleging misappropriation of its trade secrets before United States District Court, Northern District of Texas, Dallas Division. \"The court ordered that the company is liable to CSC for USD 56,151,583 in compensatory damages and USD 112,303,166 in exemplary damages. The court also assessed that the company is liable for USD 25,773,576.60 in prejudgment interest through June 13, 2024,\" the IT major said in the filing. The court also passed certain injunctions and other reliefs against TCS, it added. ","cleaned_content":"a us court has ruled that tata consultancy services is liable for misappropriation of trade secrets and levied penal charges of around usd \u003cONE_HUNDRED\u003e million on the it major a regulatory filing said on friday tcs however said it has strong arguments against the judgement and is taking necessary steps to protect its interest through review or appeal the order has been passed against the company in a case filed by computer sciences corporation csc now merged with dxc technology company dxc alleging misappropriation of its trade secrets before united states district court northern district of texas dallas division the court ordered that the company is liable to csc for usd \u003cFIVE_TEN_MILLION\u003e in compensatory damages and usd \u003cONE_HUNDRED_MILLION\u003e in exemplary damages the court also assessed that the company is liable for usd \u003cTWO_TEN_MILLION\u003e in prejudgment interest through june \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the it major said in the filing the court also passed certain injunctions and other reliefs against tcs it added","timestamp":"2024-06-14T23:10:00+05:30","market_timestamp":"2024-06-17T09:15:00+05:30","off_market_hours":true}