{"url":"https://economictimes.indiatimes.com/tech/information-tech/cipl-bags-rs-114-crore-it-infra-maintenance-project-from-indian-oil/articleshow/110938070.cms","title":"CIPL bags Rs 114 crore IT infra maintenance project from Indian Oil","description":"As part of the contract, CIPL will deploy more than 400 engineers to manage the regular maintenance of IT infrastructure across 131 locations of Indian Oil nationwide. The Noida-based company has earlier served several PSUs (public sector undertakings) like ONGC, SPMCIL, PFMS, NTPC and Airport Authority of India (AAI), among others.","content":"Technology solutions company CIPL on Wednesday said it has secured a Rs 114-crore project from Indian Oil Corporation Limited (IOCL) for the comprehensive maintenance of IT infrastructure of the public sector petroleum major. The contract will be carried out over a period of three years, starting from June 2024 and ending in May 2027.  \"Corporate Infotech Pvt. Ltd. (CIPL) has secured a landmark contract from Indian Oil Corporation Limited (IOCL) for the comprehensive annual maintenance of IT infrastructure across all divisions of the state-owned company,\" CIPL said in a statement.  As part of the contract, CIPL will deploy more than 400 engineers to manage the regular maintenance of IT infrastructure across 131 locations of Indian Oil nationwide.  \"The contract, valued at Rs 114 crore, pertains to annual maintenance and Facility Management Services (FMS) for all divisions of Indian Oil across the country,\" the statement further said.  Noida-based CIPL has earlier served several PSUs (public sector undertakings) like ONGC, SPMCIL, PFMS, NTPC and Airport Authority of India (AAI), among others. ","cleaned_content":"technology solutions company cipl on wednesday said it has secured a rs \u003cONE_HUNDRED\u003e crore project from indian oil corporation limited iocl for the comprehensive maintenance of it infrastructure of the public sector petroleum major the contract will be carried out over a period of three years starting from june \u003cTWO_THOUSAND\u003e and ending in may \u003cTWO_THOUSAND\u003e corporate infotech pvt ltd cipl has secured a landmark contract from indian oil corporation limited iocl for the comprehensive annual maintenance of it infrastructure across all divisions of the state owned company cipl said in a statement as part of the contract cipl will deploy more than \u003cFOUR_HUNDRED\u003e engineers to manage the regular maintenance of it infrastructure across \u003cONE_HUNDRED\u003e locations of indian oil nationwide the contract valued at rs \u003cONE_HUNDRED\u003e crore pertains to annual maintenance and facility management services fms for all divisions of indian oil across the country the statement further said noida based cipl has earlier served several psus public sector undertakings like ongc spmcil pfms ntpc and airport authority of india aai among others","timestamp":"2024-06-12T15:37:00+05:30","market_timestamp":"2024-06-13T09:15:00+05:30","off_market_hours":true}