{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-fined-rs-1600-crore-by-us-court-in-dxc-case/articleshow/111013835.cms","title":"TCS fined Rs 1,600 crore by US court for misappropriation of trade secrets","description":"Tata Consultancy Services (TCS) was ordered by a U.S. court to pay a total of $194.2 million (around Rs 1,600 crore) in a lawsuit filed by Computer Sciences Corporation (CSC), now DXC Technology Company (DXC). The lawsuit, filed five years ago, alleged that TCS stole CSC's trade secrets.","content":"A United States District Court has slapped Tata Consultancy Services (TCS) with a total penalty of about $194.2 million (approximately Rs 1,600 crore) in multiple charges alleging misappropriation of its trade secrets.In a suit filed five years ago by Computer Sciences Corporation (CSC)/ DXC Technology Company (DXC), “The court ordered that the company is liable to CSC for $56,151,583 in compensatory damages and $112,303,166 in exemplary damages,” the IT giant informed in a regulatory filing.“The court also assessed that the company is liable for $25,773,576.60 in prejudgment interest through June 13, 2024, it added in the filing as it received the adverse judgement passed by United States District Court, Northern District of Texas, Dallas Division on Friday.TCS went on to say that the judgement has no major adverse impact on its financials and operations.Under the terms of the court orders, TCS is liable for misappropriation of trade secret under the Defend Trade Secrets Act of 2016 of the US law.","cleaned_content":"a united states district court has slapped tata consultancy services tcs with a total penalty of about \u003cONE_HUNDRED\u003e million approximately rs \u003cONE_THOUSAND\u003e crore in multiple charges alleging misappropriation of its trade secrets in a suit filed five years ago by computer sciences corporation csc dxc technology company dxc the court ordered that the company is liable to csc for \u003cFIVE_TEN_MILLION\u003e in compensatory damages and \u003cONE_HUNDRED_MILLION\u003e in exemplary damages the it giant informed in a regulatory filing the court also assessed that the company is liable for \u003cTWO_TEN_MILLION\u003e in prejudgment interest through june \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e it added in the filing as it received the adverse judgement passed by united states district court northern district of texas dallas division on friday tcs went on to say that the judgement has no major adverse impact on its financials and operations under the terms of the court orders tcs is liable for misappropriation of trade secret under the defend trade secrets act of \u003cTWO_THOUSAND\u003e of the us law","timestamp":"2024-06-15T12:52:00+05:30","market_timestamp":"2024-06-17T09:15:00+05:30","off_market_hours":true}