{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-communications-secures-five-year-contract-with-world-athletics/articleshow/110946862.cms","title":"Tata Communications secures five-year contract with World Athletics","description":"Tata Communications signed a five-year contract with global sports organization World Athletics, expanding its media business by adding over 20 international events. Dhaval Ponda, Global Head of Media and Entertainment Services at Tata Communications, highlighted the significant viewership of World Athletics events.","content":"Tata Communications has signed a five-year contract with global sports organization World Athletics as the latter’s technology broadcast partner across the globe.Known for hosting track and field running events, World Athletics' partnership is expected to add over 20 international events to Tata Communications' media business which has grown 20-25% over the last few years and enabled the company to acquire 25% market share in global sports, Dhaval Ponda, Global Head, Media and Entertainment Services at Tata Communications told ET.“World Athletics is the third most watched sport across the world hosting events such as road running relays, track and field events, marathons, race walking, cross country etc. and reaching hundreds of millions of households across the world,” he said.“Their Championship event alone draws a global viewing audience of one billion people across 180 countries. So the partnership is going to deliver thousands of million hours of content watched over multiple platforms such as mobile phones, TV and web.”The company will deliver live content to broadcasters across continents ensuring low latency, quality video feeds over dedicated bandwidth on 5G networks, localized content, analytics of viewership habits and training feeds for athletes.","cleaned_content":"tata communications has signed a five year contract with global sports organization world athletics as the latter s technology broadcast partner across the globe known for hosting track and field running events world athletics partnership is expected to add over \u003cTWO_TEN\u003e international events to tata communications media business which has grown \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e over the last few years and enabled the company to acquire \u003cTWO_TEN_PERCENT\u003e market share in global sports dhaval ponda global head media and entertainment services at tata communications told et world athletics is the third most watched sport across the world hosting events such as road running relays track and field events marathons race walking cross country etc and reaching hundreds of millions of households across the world he said their championship event alone draws a global viewing audience of one billion people across \u003cONE_HUNDRED\u003e countries so the partnership is going to deliver thousands of million hours of content watched over multiple platforms such as mobile phones tv and web the company will deliver live content to broadcasters across continents ensuring low latency quality video feeds over dedicated bandwidth on \u003cFIVE_\u003e g networks localized content analytics of viewership habits and training feeds for athletes","timestamp":"2024-06-13T06:00:00+05:30","market_timestamp":"2024-06-13T09:15:00+05:30","off_market_hours":true}