{"url":"https://economictimes.indiatimes.com/tech/information-tech/gccs-share-in-gdp-to-double-by-2030-with-a-size-of-100-billion/articleshow/110881039.cms","title":"GCC’s share in GDP to double by 2030 with a size of $100 billion","description":"The share of global capability centres (GCCs) in India’s GDP is expected to double to 2% by 2030, according to a note shared by ICICI Securities. These offshore units of multinational companies collectively generate about $46 billion in revenue, which is likely to touch $100 billion by FY30. The GCC sector grew by 11% between 2015 and 2023. The scaling up of GCCs in India is impacted by global headwinds affecting parent companies.","content":"The share of global capability centres (GCCs) in India’s GDP is expected to double to 2% by 2030, according to a note shared by ICICI Securities.These offshore units of multinational companies collectively generate about $46 billion in revenue, which is likely to touch $100 billion by FY30, the brokerage said.India accounts for around 50% of the world’s GCCs. According to the note, the sector grew by 11% between 2015 and 2023, topping the 7% growth registered by the Indian IT services sector in the same period.However, GCCs are not completely immune to the macroeconomic concerns which have impacted the IT industry. GCC additions had slowed in 2023 compared with 2022. Between January and December 2023, the country added 47 GCCs as compared with 65 in the previous year. Some analysts said this may have been because of the post-pandemic digital rush--which has settled down now—and macro concerns.","cleaned_content":"the share of global capability centres gccs in india s gdp is expected to double to \u003cTWO_PERCENT\u003e by \u003cTWO_THOUSAND\u003e according to a note shared by icici securities these offshore units of multinational companies collectively generate about \u003cFOUR_TEN\u003e billion in revenue which is likely to touch \u003cONE_HUNDRED\u003e billion by fy30 the brokerage said india accounts for around \u003cFIVE_TEN_PERCENT\u003e of the world s gccs according to the note the sector grew by \u003cONE_TEN_PERCENT\u003e between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e topping the \u003cSEVEN_PERCENT\u003e growth registered by the indian it services sector in the same period however gccs are not completely immune to the macroeconomic concerns which have impacted the it industry gcc additions had slowed in \u003cTWO_THOUSAND\u003e compared with \u003cTWO_THOUSAND\u003e between january and december \u003cTWO_THOUSAND\u003e the country added \u003cFOUR_TEN\u003e gccs as compared with \u003cSIX_TEN\u003e in the previous year some analysts said this may have been because of the post pandemic digital rush which has settled down now and macro concerns","timestamp":"2024-06-11T06:00:00+05:30","market_timestamp":"2024-06-11T09:15:00+05:30","off_market_hours":true}