{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-announces-sops-to-employees-willing-to-transfer-to-hubballi-campus/articleshow/111054499.cms","title":"Infosys announces sops for employees open to transfer to Hubballi campus","description":"Sources aware of the matter told ET, that the policy seeks to encourage employees hailing from Mumbai-Karnataka to explore the opportunity in their home region. This will also help the company put the infrastructure at the modern facility to optimal use and save on costs. The policy will also allow employees to work on their current projects from the Hubballi development centre.","content":"Infosys on Monday announced a transfer policy offering an incentive package to its employees open to take a transfer to its Hubballi development centre, as the country’s second-largest information technology company seeks to strengthen its operations in the tier-2 city in the Mumbai-Karnataka region.The company told employees in an email, a copy of which was seen by ET, that the location has a huge potential for growth and “is waiting for a talent like you to build the future”. “It’s your turn to grow glocal and consider pursuing your career at Hubballi DC,” it said.The policy applies to employees at band 2 and above handling projects (delivery) from any development centre in India. Employees at band 3 and below will get Rs 25,000 at the time of relocation (transfer) and Rs 25,000 every six months thereafter for two years. Employees at these levels will get Rs 1.25 lakh at the end of 24 months. Others will get Rs 2.5 lakh (level 4), Rs 5 lakh (level 5), Rs 6 lakh (level 6) and Rs 8 lakh (level 7), including the initial relocation allowance, at the end of 24 months.","cleaned_content":"infosys on monday announced a transfer policy offering an incentive package to its employees open to take a transfer to its hubballi development centre as the country s second largest information technology company seeks to strengthen its operations in the tier \u003cTWO_\u003e city in the mumbai karnataka region the company told employees in an email a copy of which was seen by et that the location has a huge potential for growth and is waiting for a talent like you to build the future it s your turn to grow glocal and consider pursuing your career at hubballi dc it said the policy applies to employees at band \u003cTWO_\u003e and above handling projects delivery from any development centre in india employees at band \u003cTHREE_\u003e and below will get rs \u003cTWO_TEN_THOUSAND\u003e at the time of relocation transfer and rs \u003cTWO_TEN_THOUSAND\u003e every six months thereafter for two years employees at these levels will get rs \u003cONE_\u003e lakh at the end of \u003cTWO_TEN\u003e months others will get rs \u003cTWO_\u003e lakh level \u003cFOUR_\u003e rs \u003cFIVE_\u003e lakh level \u003cFIVE_\u003e rs \u003cSIX_\u003e lakh level \u003cSIX_\u003e and rs \u003cEIGHT_\u003e lakh level \u003cSEVEN_\u003e including the initial relocation allowance at the end of \u003cTWO_TEN\u003e months","timestamp":"2024-06-18T11:42:00+05:30","market_timestamp":"2024-06-18T11:42:00+05:30","off_market_hours":false}