{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-arm-comviva-strengthens-leadership-in-europe-north-america/articleshow/110966348.cms","title":"Tech Mahindra arm Comviva strengthens leadership in Europe, North America","description":"Tech Mahindra said in a statement, \"The new leaders will aim to support Comviva's strategic vision based on the new market expansion and deep client relationship.\" To enhance its focus on growth, the digital solutions provider has divided Europe into two sub-regions. Salah Rich, head of Europe 1 subregion, will lead the markets of Italy, Russia and France.","content":"Tech Mahindra subsidiary Comviva on Thursday announced the appointment of key executives in Europe and North America to drive business expansion and growth in the western markets. Ian Paul Smith will head North America's direct business market unit. He will be responsible for building and maintaining strategic partnerships and alliances with telcos in the region.\"The new leaders will specifically aim to support Comviva's strategic vision based on new market expansion and deeper client relationships in an accelerating digital economy,\" the company said in a statement. The digital solutions provider has divided Europe into two sub-regions to ensure increased focus on growing the Europe business for Comviva.  Salah Rich, Head of the Europe 1 subregion, will lead the markets of France, Iberia, Italy, and all Eastern European countries, including Russia.  Rishi Ramphal will head the Europe 2 subregion and oversee direct sales operations across the Netherlands, Belgium, Luxembourg, Germany, Switzerland, the Nordics, the UK, and Ireland. In his current role as Chief Delivery Officer, Ramphal has global experience in handling telecom clients for Comviva. ","cleaned_content":"tech mahindra subsidiary comviva on thursday announced the appointment of key executives in europe and north america to drive business expansion and growth in the western markets ian paul smith will head north americas direct business market unit he will be responsible for building and maintaining strategic partnerships and alliances with telcos in the region the new leaders will specifically aim to support comvivas strategic vision based on new market expansion and deeper client relationships in an accelerating digital economy the company said in a statement the digital solutions provider has divided europe into two sub regions to ensure increased focus on growing the europe business for comviva salah rich head of the europe \u003cONE_\u003e subregion will lead the markets of france iberia italy and all eastern european countries including russia rishi ramphal will head the europe \u003cTWO_\u003e subregion and oversee direct sales operations across the netherlands belgium luxembourg germany switzerland the nordics the uk and ireland in his current role as chief delivery officer ramphal has global experience in handling telecom clients for comviva","timestamp":"2024-06-13T15:32:00+05:30","market_timestamp":"2024-06-14T09:15:00+05:30","off_market_hours":true}