{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-to-acquire-digital-engineering-firm-belcan-for-1-3-billion/articleshow/110873343.cms","title":"Cognizant to acquire US digital engineering firm Belcan for $1.3 billion","description":"Cognizant Technologies to acquire Belcan for $1.3 billion, expanding into aerospace, defense, space, and automotive sectors.","content":"Cognizant, the US-based outsourcing services major with a predominantly Indian technology service-delivery footprint, on Monday said it will acquire digital engineering firm Belcan for $1.29 billion (around Rs 10,700 crore) in cash and stock. US-based Belcan has been backed by American private equity firm AE Industrial Partners since 2015. The buyout will help Cognizant expand its footprint in the aerospace, defense, space and automotive sectors, primarily in North America and the United Kingdom (UK), as per the company statement. “The revenue the acquired business is expected to be over $800 million on an annualised basis and has grown at an 8% compound annual growth rate (CAGR) over the last two years,” the company said in a statement. The total purchase price of approximately $1.29 billion comprises $1.19 billion in cash consideration and a fixed 1.47 million Cognizant shares, with a current value of $97 million based on Cognizant's closing share price on Friday, June 7, 2024. The cash consideration is expected to be funded through a mix of cash on hand and debt,” Cognizant’s statement added. Cognizant intends to increase its share repurchase plan to maintain current share count guidance of 497 million for the full year 2024. In Q1 results in May, Cognizant projected a 100 basis points (bps) inorganic contribution to its full fiscal year revenue growth outlook between -2% and 2% ending December. For Q2FY24, it guided 0- 1.5% increase in the range of $4.75 billion to $4.82 billion.","cleaned_content":"cognizant the us based outsourcing services major with a predominantly indian technology service delivery footprint on monday said it will acquire digital engineering firm belcan for \u003cONE_\u003e billion around rs \u003cONE_TEN_THOUSAND\u003e crore in cash and stock us based belcan has been backed by american private equity firm ae industrial partners since \u003cTWO_THOUSAND\u003e the buyout will help cognizant expand its footprint in the aerospace defense space and automotive sectors primarily in north america and the united kingdom uk as per the company statement the revenue the acquired business is expected to be over \u003cEIGHT_HUNDRED\u003e million on an annualised basis and has grown at an \u003cEIGHT_PERCENT\u003e compound annual growth rate cagr over the last two years the company said in a statement the total purchase price of approximately \u003cONE_\u003e billion comprises \u003cONE_\u003e billion in cash consideration and a fixed \u003cONE_\u003e million cognizant shares with a current value of \u003cNINE_TEN\u003e million based on cognizants closing share price on friday june \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e the cash consideration is expected to be funded through a mix of cash on hand and debt cognizant s statement added cognizant intends to increase its share repurchase plan to maintain current share count guidance of \u003cFOUR_HUNDRED\u003e million for the full year \u003cTWO_THOUSAND\u003e in q1 results in may cognizant projected a \u003cONE_HUNDRED\u003e basis points bps inorganic contribution to its full fiscal year revenue growth outlook between \u003cTWO_PERCENT\u003e and \u003cTWO_PERCENT\u003e ending december for q2fy24 it guided \u003cZERO_\u003e \u003cONE_PERCENT\u003e increase in the range of \u003cFOUR_\u003e billion to \u003cFOUR_\u003e billion","timestamp":"2024-06-10T22:28:00+05:30","market_timestamp":"2024-06-11T09:15:00+05:30","off_market_hours":true}