{"url":"https://economictimes.indiatimes.com/tech/information-tech/ministers-laud-infosys-move-to-offer-sops-to-staffers-relocating-to-hubballi/articleshow/111066223.cms","title":"Ministers laud Infosys' move to offer sops to staffers relocating to Hubballi","description":"Union Ministers Joshi \u0026 Patil praise Infosys for offering incentives to employees relocating to Hubballi, boosting local talent and growth in tier 2 cities.","content":"Union Public Distribution \u0026 Food \u0026 Renewable Energy Minister Pralhad Joshi and State’s Industries \u0026 Infrastructure Minister MB Patil have welcomed Infosys decision to offer incentives to employees asking for transfer to its Hubballi campus.“I Wholeheartedly appreciate Infosys for its incentives to employees transferring to its Hubballi campus. Earlier demands were made from public representatives of this place for increased activity at this centre. Tier 2 cities will have a better exposure for further growth in terms of opportunities and growth for the talented youth,” the Union Minister posted on social media platform X, quoting a report from The Economic Times.Joshi represents Hubballi-Dharwad in the Lok Sabha.","cleaned_content":"union public distribution food renewable energy minister pralhad joshi and state s industries infrastructure minister mb patil have welcomed infosys decision to offer incentives to employees asking for transfer to its hubballi campus i wholeheartedly appreciate infosys for its incentives to employees transferring to its hubballi campus earlier demands were made from public representatives of this place for increased activity at this centre tier \u003cTWO_\u003e cities will have a better exposure for further growth in terms of opportunities and growth for the talented youth the union minister posted on social media platform x quoting a report from the economic times joshi represents hubballi dharwad in the lok sabha","timestamp":"2024-06-17T23:28:00+05:30","market_timestamp":"2024-06-18T09:15:00+05:30","off_market_hours":true}