{"url":"https://economictimes.indiatimes.com/tech/information-tech/japanese-meditech-olympus-corporation-to-establish-rd-and-offshore-development-centre-in-hyderabad/articleshow/110941954.cms","title":"Japanese meditech Olympus Corporation to establish R\u0026D and offshore development centre in Hyderabad","description":"Olympus currently has R\u0026D centers in Japan, US and Europe and is planning to leverage Indian local talent and resources to drive advancement in Indian medical technology. The decision follows a strategic agreement with HCL Tech, aimed at expanding Olympus' innovation generation activities globally. Olmpus makes medical devices such as endoscopy, imaging systems, surgical instruments.","content":"Olympus Corporation, the Japanese medical technology major, on Wednesday said it will establish a Research \u0026 Development (R\u0026D) Offshore Development Center (ODC) in Hyderabad.The decision follows a strategic agreement with HCL Tech, aimed at expanding Olympus' innovation generation activities globally.Olympus is planning to leverage local talent and resources in India to drive advancements in medical technology.Olympus currently has R\u0026D centers in Japan, US and Europe.In addition to the creation of the ODC, Olympus will collaborate with AIG Hospitals, Hyderabad, on joint research projects. The partnership with AIG aims to leverage clinical expertise and insights to drive the development of innovative medical solutions that address the evolving needs of patients worldwide.","cleaned_content":"olympus corporation the japanese medical technology major on wednesday said it will establish a research development r d offshore development center odc in hyderabad the decision follows a strategic agreement with hcl tech aimed at expanding olympus innovation generation activities globally olympus is planning to leverage local talent and resources in india to drive advancements in medical technology olympus currently has r d centers in japan us and europe in addition to the creation of the odc olympus will collaborate with aig hospitals hyderabad on joint research projects the partnership with aig aims to leverage clinical expertise and insights to drive the development of innovative medical solutions that address the evolving needs of patients worldwide","timestamp":"2024-06-12T17:18:00+05:30","market_timestamp":"2024-06-13T09:15:00+05:30","off_market_hours":true}