{"url":"https://economictimes.indiatimes.com/tech/information-tech/techm-to-leverage-mms-network-via-cross-selling/articleshow/111093428.cms","title":"TechM to leverage M\u0026M's network via cross selling","description":"M\u0026M aims to unlock Tech Mahindra's potential through cross-selling and synergies within the group. Tech Mahindra, India's fifth largest IT firm, plans to leverage group relationships for expansion.","content":"The Mahindra group aims to \"unlock the full potential\" of Tech Mahindra through cross-selling and synergies within the group, M\u0026M said during an India investor meet last week. The comments come at a time when Tech Mahindra, India's fifth largest IT firm, is grappling with slowing growth and margins. Tech Mahindra is planning to leverage the group relationships to expand its network, the company said in a presentation to investors. Apart from continuing to service the parent group for its technology requirements, it will leverage the parent's buying power to sell its services to the sellers of the Mahindra group, it said in an additional presentation at the group investor meeting which was also filed with the BSE.The company has strong presence across auto original equipment manufacturers, T1 (tier-1), industrial, process manufacturing and A\u0026D (aerospace and defence), said the presentation.","cleaned_content":"the mahindra group aims to unlock the full potential of tech mahindra through cross selling and synergies within the group m m said during an india investor meet last week the comments come at a time when tech mahindra indias fifth largest it firm is grappling with slowing growth and margins tech mahindra is planning to leverage the group relationships to expand its network the company said in a presentation to investors apart from continuing to service the parent group for its technology requirements it will leverage the parents buying power to sell its services to the sellers of the mahindra group it said in an additional presentation at the group investor meeting which was also filed with the bse the company has strong presence across auto original equipment manufacturers t1 tier \u003cONE_\u003e industrial process manufacturing and a d aerospace and defence said the presentation","timestamp":"2024-06-19T06:00:00+05:30","market_timestamp":"2024-06-19T09:15:00+05:30","off_market_hours":true}