{"url":"https://economictimes.indiatimes.com/tech/information-tech/erd-bucks-slowdown-in-tech-hiring/articleshow/111411418.cms","title":"Strong ER\u0026D demand helps IT buck overall soft hiring trend","description":"India's $250 billion IT services industry is facing sluggish hiring, but a bright spot is emerging in Engineering, Research \u0026 Development (ER\u0026D). Demand for ER\u0026D services is surging, driving a 15% increase in recruitment for these roles. Staffing firms report that tech companies are ramping up ER\u0026D hiring to stay competitive in the global market.","content":"An upward curve in demand for engineering, research and development (ER\u0026D) services is boosting hiring prospects in the space by around 15% when recruitment in general continues to remain soft in India’s $250 billion IT services industry.According to data from staffing firms, technology services providers are poised to ramp up ER\u0026D recruitments to sustain and enhance their global competitive edge.“In FY24, there was a robust increase in hiring within the ER\u0026D sector, marking a 10-15% rise compared to FY23 … Looking ahead, for FY25, we anticipate 12-15% growth in demand for ER\u0026D professionals,” said Aditya Narayan Mishra, managing director and chief executive at recruitment firm Ciel HR Services.Technology services companies want to have full-stack solutions and offerings as digital has a significant component of engineering services. Also, with the disruption caused by generative artificial intelligence, there has been a rush of software service providers including Infosys, Cognizant, Wipro and even smaller IT companies like Coforge, Happiest Minds Technologies and Xoriant to acquire pure-play ER\u0026D firms to expand their capabilities, in turn also increasing competition in the segment.","cleaned_content":"an upward curve in demand for engineering research and development er d services is boosting hiring prospects in the space by around \u003cONE_TEN_PERCENT\u003e when recruitment in general continues to remain soft in india s \u003cTWO_HUNDRED\u003e billion it services industry according to data from staffing firms technology services providers are poised to ramp up er d recruitments to sustain and enhance their global competitive edge in fy24 there was a robust increase in hiring within the er d sector marking a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e rise compared to fy23 looking ahead for fy25 we anticipate \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e growth in demand for er d professionals said aditya narayan mishra managing director and chief executive at recruitment firm ciel hr services technology services companies want to have full stack solutions and offerings as digital has a significant component of engineering services also with the disruption caused by generative artificial intelligence there has been a rush of software service providers including infosys cognizant wipro and even smaller it companies like coforge happiest minds technologies and xoriant to acquire pure play er d firms to expand their capabilities in turn also increasing competition in the segment","timestamp":"2024-07-02T06:00:00+05:30","market_timestamp":"2024-07-02T09:15:00+05:30","off_market_hours":true}