{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-chairman-a-m-naik-steps-down-s-n-subrahmanyan-appointed-as-chairman/articleshow/111286625.cms","title":"LTIMindtree chairman A M Naik steps down; S N Subrahmanyan appointed as chairman","description":"Stepping down as LTIMindtree chairman, I pass the baton to S N Subrahmanyan at the 28th AGM. The Board appointed Subrahmanyan, noting my privilege in leading this great organisation and laying the foundation for its future growth.","content":"IT company LTIMindtree on Wednesday said its chairman A M Naik has decided to step down from the post and announced the appointment of S N Subrahmanyan as the new chairman. Naik announced the decision at the company's 28th annual general meeting held on Wednesday.  Following this, the board of the company has appointed S N Subrahmanyan, (Vice-Chairman), as Chairman with effect from June 27, 2024, according to a regulatory filing.  \"The Board of Directors and the LTIMindtree family places on record, a deep sense of appreciation for Naik's remarkable efforts in founding this company and his unwavering dedication towards building this information technology giant within the L\u0026T group...\" the filing said. ","cleaned_content":"it company ltimindtree on wednesday said its chairman a m naik has decided to step down from the post and announced the appointment of s n subrahmanyan as the new chairman naik announced the decision at the companys \u003cTWO_TEN\u003e th annual general meeting held on wednesday following this the board of the company has appointed s n subrahmanyan vice chairman as chairman with effect from june \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e according to a regulatory filing the board of directors and the ltimindtree family places on record a deep sense of appreciation for naiks remarkable efforts in founding this company and his unwavering dedication towards building this information technology giant within the l t group the filing said","timestamp":"2024-06-27T09:07:00+05:30","market_timestamp":"2024-06-27T09:15:00+05:30","off_market_hours":true}