{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-union-seeks-probe-on-dxc-technologys-4800-campus-onboarding-delays/articleshow/111344205.cms","title":"IT union seeks probe on DXC Technology's 4,800 campus onboarding delays","description":"Data from the IT employee union NITES showed that India’s leading IT firms including Tata Consultancy Services (TCS), Infosys, Wipro and LTIMindtree have delayed joining dates of than 10,000 freshers. Harpreet Singh Saluja, president at NITES  said these young professionals well-being and careers are at risk, we have asked the ministry to act as soon as possible.","content":"IT sector employee union Nascent Information Technology Employees Senate (NITES) has asked the Ministry of Labour \u0026 Employment to look into DXC Technology for delaying onboarding of over 4,800 new campus recruits.“These delays, lasting more than two years, have caused serious problems for these new employees. Many turned down other job offers because they believed in DXC Technology's promises. Now, they are struggling financially and are unsure about their future because they haven't started working yet. DXC Technology's actions have broken the trust of these young professionals. They expected a smooth start to their careers, but instead, they are left waiting,” said Harpreet Singh Saluja, president at NITES.These young professionals' well-being and careers are at risk. We have asked the ministry to act quickly to protect them and make sure they are not unfairly punished because of DXC Technology's delays, Saluja added.Data from the IT employee union NITES showed that India’s leading IT firms including Tata Consultancy Services (TCS), Infosys, Wipro and LTIMindtree have delayed joining dates of than 10,000 freshers.Recently NITES pointed to repeated delays of onboarding of over 2,000 campus recruits by Bengaluru IT giant Infosys demanding the affected professionals be given full salary payments for the period during which the onboarding has been delayed.","cleaned_content":"it sector employee union nascent information technology employees senate nites has asked the ministry of labour employment to look into dxc technology for delaying onboarding of over \u003cFOUR_THOUSAND\u003e new campus recruits these delays lasting more than two years have caused serious problems for these new employees many turned down other job offers because they believed in dxc technologys promises now they are struggling financially and are unsure about their future because they havent started working yet dxc technologys actions have broken the trust of these young professionals they expected a smooth start to their careers but instead they are left waiting said harpreet singh saluja president at nites these young professionals well being and careers are at risk we have asked the ministry to act quickly to protect them and make sure they are not unfairly punished because of dxc technologys delays saluja added data from the it employee union nites showed that india s leading it firms including tata consultancy services tcs infosys wipro and ltimindtree have delayed joining dates of than \u003cONE_TEN_THOUSAND\u003e freshers recently nites pointed to repeated delays of onboarding of over \u003cTWO_THOUSAND\u003e campus recruits by bengaluru it giant infosys demanding the affected professionals be given full salary payments for the period during which the onboarding has been delayed","timestamp":"2024-06-28T18:10:00+05:30","market_timestamp":"2024-07-01T09:15:00+05:30","off_market_hours":true}