{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-to-pay-rs-4-crore-to-settle-cfo-jatin-dalals-lawsuit-with-wipro/articleshow/111608745.cms","title":"Cognizant to pay Rs 4 crore to settle CFO Jatin Dalal’s lawsuit with Wipro","description":"Cognizant’s CFO Jatin Dalal settled a non-compete lawsuit with Wipro for $505,087, covering legal fees, per SEC filing. Wipro cited confidentiality and compensation breaches after Dalal left in November 2023 and joined Cognizant on December 1. The Cognizant Human Capital Committee approved the payment. A similar lawsuit with Mohammad Haque was settled. The settlement terms remain confidential.","content":"Global IT services giant Cognizant Technology Solutions on Tuesday announced that its chief financial officer (CFO) Jatin Dalal has reached a settlement in the non-compete lawsuit filed by his former employer Wipro with a payment of $505,087 (around Rs 4 crore) related to its arbitration case.“The terms of the settlement, which was reached without any admission of liability by either party, are confidential. The settlement resolves all pending disputes between Mr. Dalal and Wipro,” Cognizant said in a statement.“On July 2, 2024, the Compensation and Human Capital Committee of the Board of Directors of Cognizant Technology Solutions Corporation approved the Company’s payment of $505,087 to Mr. Jatin Dalal, the Company’s Chief Financial Officer, in connection with Mr. Dalal’s settlement of the lawsuit and related arbitration brought by his former employer, Wipro Limited (Wipro)…,” according to a regulatory filing on US SEC (Securities and Exchange Commission).The arbitration had sought to obtain damages and injunctive relief arising out of Dalal’s purported breach of non-compete and confidentiality obligations under certain of Dalal’s compensation agreements with Wipro by joining the Company.“The settlement was reached without admission of liability by either party. The Company’s payment covers Mr. Dalal’s settlement payment to Wipro as well as reimbursement of his legal fees,” the filing added.","cleaned_content":"global it services giant cognizant technology solutions on tuesday announced that its chief financial officer cfo jatin dalal has reached a settlement in the non compete lawsuit filed by his former employer wipro with a payment of \u003cFIVE_HUNDRED_THOUSAND\u003e around rs \u003cFOUR_\u003e crore related to its arbitration case the terms of the settlement which was reached without any admission of liability by either party are confidential the settlement resolves all pending disputes between mr dalal and wipro cognizant said in a statement on july \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e the compensation and human capital committee of the board of directors of cognizant technology solutions corporation approved the company s payment of \u003cFIVE_HUNDRED_THOUSAND\u003e to mr jatin dalal the company s chief financial officer in connection with mr dalal s settlement of the lawsuit and related arbitration brought by his former employer wipro limited wipro according to a regulatory filing on us sec securities and exchange commission the arbitration had sought to obtain damages and injunctive relief arising out of dalal s purported breach of non compete and confidentiality obligations under certain of dalal s compensation agreements with wipro by joining the company the settlement was reached without admission of liability by either party the company s payment covers mr dalal s settlement payment to wipro as well as reimbursement of his legal fees the filing added","timestamp":"2024-07-10T20:15:00+05:30","market_timestamp":"2024-07-11T09:15:00+05:30","off_market_hours":true}