{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-elxsi-posts-2-5-dip-in-q1-profit-revenues-rise-9/articleshow/111639916.cms","title":"Tata Elxsi posts 2.5% dip in Q1 profit, revenue rises 9%","description":"Tata Elxsi's Q1FY25 net profit declined 2.5% YoY to Rs 184.1 crore, impacted by weaker healthcare, life sciences, and media segments. Revenue rose 9% YoY to Rs 926.5 crore. Operating margins fell, Europe share rose to 42.2%. Headcount decreased by 257, attrition improved to 12.3%. CEO Raghavan noted strong transportation sector. Shares increased 1.4%.","content":"Tata Elxsi, part of the Tata group companies, reported a 2.5% year-on-year decline in net profit at Rs 184.1 crore for the first quarter ending June 2024. This compares with profit after tax of Rs 188.9 crore in the year ago quarter Q1FY24.Net profit dipped 6.5% quarter-on-quarter (QoQ) from Rs 196.9 crore in the fourth quarter ending March 2024.The Bengaluru-headquartered design and technology services firm’s profit was impacted by weaker growth in its healthcare and life sciences segment which was lower by 4.3% from previous quarter and 0.5% from a year ago. Its media and communications vertical also weakened by 3.8% YoY and marginally edged up by 0.5% QoQ.Revenue for Q1FY25 grew by 9% YoY to Rs 926.5 crore from Rs 850.3 in Q1FY24. Sequentially, revenue rose by 2.3% from Rs 905.9 crore. In constant currency terms, revenue grew 8.4% YoY and 2.4% QoQ.“Our transportation business reported a strong growth of 5.3% QoQ and 20.3% YoY in constant currency, and now accounts for more than 50% of our software development \u0026 services business. We believe we are positioned well to capture growth opportunities in the coming quarters as we continue to enable the continued transformation of the automotive industry and software defined vehicles,” said Manoj Raghavan CEO and MD of Tata Elxsi.","cleaned_content":"tata elxsi part of the tata group companies reported a \u003cTWO_PERCENT\u003e year on year decline in net profit at rs \u003cONE_HUNDRED\u003e crore for the first quarter ending june \u003cTWO_THOUSAND\u003e this compares with profit after tax of rs \u003cONE_HUNDRED\u003e crore in the year ago quarter q1fy24 net profit dipped \u003cSIX_PERCENT\u003e quarter on quarter qoq from rs \u003cONE_HUNDRED\u003e crore in the fourth quarter ending march \u003cTWO_THOUSAND\u003e the bengaluru headquartered design and technology services firm s profit was impacted by weaker growth in its healthcare and life sciences segment which was lower by \u003cFOUR_PERCENT\u003e from previous quarter and \u003cZERO_PERCENT\u003e from a year ago its media and communications vertical also weakened by \u003cTHREE_PERCENT\u003e yoy and marginally edged up by \u003cZERO_PERCENT\u003e qoq revenue for q1fy25 grew by \u003cNINE_PERCENT\u003e yoy to rs \u003cNINE_HUNDRED\u003e crore from rs \u003cEIGHT_HUNDRED\u003e in q1fy24 sequentially revenue rose by \u003cTWO_PERCENT\u003e from rs \u003cNINE_HUNDRED\u003e crore in constant currency terms revenue grew \u003cEIGHT_PERCENT\u003e yoy and \u003cTWO_PERCENT\u003e qoq our transportation business reported a strong growth of \u003cFIVE_PERCENT\u003e qoq and \u003cTWO_TEN_PERCENT\u003e yoy in constant currency and now accounts for more than \u003cFIVE_TEN_PERCENT\u003e of our software development services business we believe we are positioned well to capture growth opportunities in the coming quarters as we continue to enable the continued transformation of the automotive industry and software defined vehicles said manoj raghavan ceo and md of tata elxsi","timestamp":"2024-07-10T20:40:00+05:30","market_timestamp":"2024-07-11T09:15:00+05:30","off_market_hours":true}