{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-inks-five-year-deal-with-european-security-provider/articleshow/111610930.cms","title":"Infosys inks five-year deal with European security provider","description":"Infosys collaborates with Sector Alarm to transition their ERP to Microsoft Dynamics 365 F\u0026O in phases across eight European countries. Partially owned by KKR, Sector Alarm aims to streamline finances, enhance customer acquisition, employee experience, and integrate CRM, reducing total costs.","content":"Infosys on Tuesday announced a five-year partnership with private equity-backed European security provider Sector Alarm to transform their core enterprise business systems on the cloud across eight countries. The financial terms of the deal remained undisclosed.“Through this collaboration, Infosys will work closely with Sector Alarm to migrate their disparate, on-premises enterprise resource planning (ERP) platform onto Microsoft Dynamics 365 Finance and Operations (F\u0026O), helping them modernise their financial and business operating models. Capitalising on Infosys’ digital transformation capabilities, the Microsoft platform will enable Sector Alarm to streamline finances, gain business insights, and help seamlessly integrate with their existing CRM platform,” Infosys said in a statement.Sector Alarm, partially owned by global investment firm KKR, has experience with PE customers in the Nordics region with deep domain expertise in cloud-powered ERP transformation, and next-gen application management services (AMS). The implementation will take place in a phased manner across eight European countries, including Norway, Sweden, Finland, Italy, and France, the statement added.Microsoft Dynamics 365 F\u0026O will leverage cloud adoption Infosys Cobalt to help Sector Alarm streamline business processes, enable higher customer retention and acquisition, improve customer experience, protect employee experience, and reduce total cost of ownership of new systems.“By leveraging cloud-based ERP and CRM solutions and our long-term partnership with Microsoft, we are looking forward to empowering Sector Alarm with a robust IT platform to achieve their ambitious growth. With this key win, we are well poised to establish ourselves as a trusted partner in the European security systems market,” said Jasmeet Singh, EVP and global head of manufacturing, Infosys.","cleaned_content":"infosys on tuesday announced a five year partnership with private equity backed european security provider sector alarm to transform their core enterprise business systems on the cloud across eight countries the financial terms of the deal remained undisclosed through this collaboration infosys will work closely with sector alarm to migrate their disparate on premises enterprise resource planning erp platform onto microsoft dynamics \u003cTHREE_HUNDRED\u003e finance and operations f o helping them modernise their financial and business operating models capitalising on infosys digital transformation capabilities the microsoft platform will enable sector alarm to streamline finances gain business insights and help seamlessly integrate with their existing crm platform infosys said in a statement sector alarm partially owned by global investment firm kkr has experience with pe customers in the nordics region with deep domain expertise in cloud powered erp transformation and next gen application management services ams the implementation will take place in a phased manner across eight european countries including norway sweden finland italy and france the statement added microsoft dynamics \u003cTHREE_HUNDRED\u003e f o will leverage cloud adoption infosys cobalt to help sector alarm streamline business processes enable higher customer retention and acquisition improve customer experience protect employee experience and reduce total cost of ownership of new systems by leveraging cloud based erp and crm solutions and our long term partnership with microsoft we are looking forward to empowering sector alarm with a robust it platform to achieve their ambitious growth with this key win we are well poised to establish ourselves as a trusted partner in the european security systems market said jasmeet singh evp and global head of manufacturing infosys","timestamp":"2024-07-09T18:56:00+05:30","market_timestamp":"2024-07-10T09:15:00+05:30","off_market_hours":true}