{"url":"https://economictimes.indiatimes.com/tech/information-tech/accenture-acquires-third-firm-in-silicon-design-with-cientra/articleshow/111639094.cms","title":"Accenture boosts silicon design chops with its third acquisition Cientra","description":"Accenture will add Cientra's 530 employees to its Advanced Technology Centres in India. In the growing semiconductor market, several firms are taking the acquisition route to expand their businesses in the space. From September 2023 to May 2024, Accenture made a total of 35 acquisitions. The company also acquired Excelmax Technologies earlier this week.","content":"Accenture on Wednesday announced the acquisition of New Jersey-headquartered Indian product solutions company Cientra for an undisclosed sum – its third acquisition in the semiconductor silicon design and engineering services space.Accenture will absorb Cientra’s approximately 530 engineers and practitioners entirely to its Advanced Technology Centres in India, the world’s largest IT services major said in a statement.“Our acquisition of Cientra is our latest move to expand our silicon design and engineering capabilities and it underscores our commitment to helping our clients maximise value and reinvent themselves in this space,” said Karthik Narain, group chief executive – technology at Accenture.Founded in 2015, Cientra has offices in Frankfurt, New Jersey, Bengaluru, Hyderabad, and Noida, its website said.“Joining Accenture provides exciting opportunities to expand globally and scale our capabilities to create new avenues of growth for our clients as well as our people,” said Anil Kempanna, CEO of Cientra.","cleaned_content":"accenture on wednesday announced the acquisition of new jersey headquartered indian product solutions company cientra for an undisclosed sum its third acquisition in the semiconductor silicon design and engineering services space accenture will absorb cientra s approximately \u003cFIVE_HUNDRED\u003e engineers and practitioners entirely to its advanced technology centres in india the world s largest it services major said in a statement our acquisition of cientra is our latest move to expand our silicon design and engineering capabilities and it underscores our commitment to helping our clients maximise value and reinvent themselves in this space said karthik narain group chief executive technology at accenture founded in \u003cTWO_THOUSAND\u003e cientra has offices in frankfurt new jersey bengaluru hyderabad and noida its website said joining accenture provides exciting opportunities to expand globally and scale our capabilities to create new avenues of growth for our clients as well as our people said anil kempanna ceo of cientra","timestamp":"2024-07-11T14:41:00+05:30","market_timestamp":"2024-07-11T14:41:00+05:30","off_market_hours":false}