{"url":"https://economictimes.indiatimes.com/tech/information-tech/persistent-systems-buys-us-software-firm-starfish-associates-for-rs-173-crore/articleshow/111453849.cms","title":"Persistent Systems buys US software firm Starfish Associates for Rs 173 crore","description":"Persistent Systems said in a statement, \"Known for its cutting-edge Enterprise Communications automation platform, Starfish Associates caters to the world’s largest enterprises including many Fortune 500 companies.\" Following the acquisition announcement on Wednesday morning, Persistent’s stock hit a 52-week high to 4,596 apiece rising over 2% on the BSE.","content":"Indian mid-tier IT firm Persistent Systems (Persistent) today announced the intent to acquire 100% stake in US-based software firm Starfish Associates for $20.7 million (around Rs 173 crore). The acquisition is aimed to build on Persistent’s existing engineering capabilities in the Contact Center and Unified Communications space.The total purchase consideration payable for the acquisition of Starfish is $20.7 million with upfront payment of $15.4 million (approximately Rs 130 crore) to shareholders, subject to customary adjustments for working capital, debt and cash on closing, as per the regulatory filing by Persistent.Under the financial terms, sellers will be eligible for a maximum cumulative earnout of $5.1 million over the next two years. This amount is contingent on achievement of certain performance thresholds. Further, certain key employees will be eligible for retention payment of an aggregate amount of $0.2 million over the next two years contingent on employment continuity.“Known for its cutting-edge Enterprise Communications automation platform, Starfish Associates caters to the world’s largest enterprises including many Fortune 500 companies. Starfish Associates' automation platform excels as an intelligent integration hub and workflow engine, facilitating seamless connections across a myriad of business applications and communication systems,” Persistent said in a statement.It enhances multi-vendor communication management through automation with platforms such as Amazon Connect, Avaya, Cisco, Genesys, and Microsoft Teams. In addition, it integrates with key business applications like ServiceNow, Workday, and Microsoft Active Directory to streamline workflows and operations, the statement added.","cleaned_content":"indian mid tier it firm persistent systems persistent today announced the intent to acquire \u003cONE_HUNDRED_PERCENT\u003e stake in us based software firm starfish associates for \u003cTWO_TEN\u003e million around rs \u003cONE_HUNDRED\u003e crore the acquisition is aimed to build on persistent s existing engineering capabilities in the contact center and unified communications space the total purchase consideration payable for the acquisition of starfish is \u003cTWO_TEN\u003e million with upfront payment of \u003cONE_TEN\u003e million approximately rs \u003cONE_HUNDRED\u003e crore to shareholders subject to customary adjustments for working capital debt and cash on closing as per the regulatory filing by persistent under the financial terms sellers will be eligible for a maximum cumulative earnout of \u003cFIVE_\u003e million over the next two years this amount is contingent on achievement of certain performance thresholds further certain key employees will be eligible for retention payment of an aggregate amount of \u003cZERO_\u003e million over the next two years contingent on employment continuity known for its cutting edge enterprise communications automation platform starfish associates caters to the world s largest enterprises including many fortune \u003cFIVE_HUNDRED\u003e companies starfish associates automation platform excels as an intelligent integration hub and workflow engine facilitating seamless connections across a myriad of business applications and communication systems persistent said in a statement it enhances multi vendor communication management through automation with platforms such as amazon connect avaya cisco genesys and microsoft teams in addition it integrates with key business applications like servicenow workday and microsoft active directory to streamline workflows and operations the statement added","timestamp":"2024-07-03T15:56:00+05:30","market_timestamp":"2024-07-04T09:15:00+05:30","off_market_hours":true}