{"url":"https://economictimes.indiatimes.com/tech/information-tech/glean-technologies-sets-up-india-office-to-invest-up-to-50-million/articleshow/111520378.cms","title":"Glean Technologies sets up India office, to invest up to $50 million","description":"US-based Glean Technologies, which offers AI assistant platforms for businesses, has chosen to set up shop in Bengaluru, its first in India. The company plans to significantly expand its presence there, aiming to triple its staff to 450 within the next two years.","content":"US-based enterprise AI assistant platform Glean Technologies has set up its first office in India with an aim to invest up to $50 million (around Rs 400 crore) over the next two years. It also aims to triple its headcount to 450 at the Bengaluru centre, its founder and CEO Arvind Jain told ET.The Palo Alto-headquartered company's new Bengaluru office spanning around 26,000 sq.ft. will be the centre of operations housing finance, sales, R\u0026D and business operations functions.“This office will serve as a crucial hub for our global operations, driving a significant portion of our international projects. In fact, it will be our biggest investment outside of the US…In India, currently we are working with around 5-10 clients and hence we will need a lot of investments in terms of hiring and operations. We would certainly be investing between $10-50 million in the next two years,” Jain told ET in an interaction.He wants India to be among the top five markets in two years. Currently, most of its business comes from the US, UK, Germany, Japan and Australia.“We are growing rapidly here and by end of next year we will be three times our size (in people). Bengaluru is our second centre and we want it to be one of the core centres along with Palo Alto where we have about 250 of the total 500 employees at present. We have about 150 employees in Bengaluru, which we will double in two years. We will be hiring in roles across software engineers, people in AI and ML, customer support, finance, legal, sales and marketing, etc,” he said adding it has established itself as a day zero employer at the top five IITs — Bombay, Delhi, Kanpur, Madras and Kharagpur.","cleaned_content":"us based enterprise ai assistant platform glean technologies has set up its first office in india with an aim to invest up to \u003cFIVE_TEN\u003e million around rs \u003cFOUR_HUNDRED\u003e crore over the next two years it also aims to triple its headcount to \u003cFOUR_HUNDRED\u003e at the bengaluru centre its founder and ceo arvind jain told et the palo alto headquartered companys new bengaluru office spanning around \u003cTWO_TEN_THOUSAND\u003e sq ft will be the centre of operations housing finance sales r d and business operations functions this office will serve as a crucial hub for our global operations driving a significant portion of our international projects in fact it will be our biggest investment outside of the us in india currently we are working with around \u003cFIVE_\u003e \u003cONE_TEN\u003e clients and hence we will need a lot of investments in terms of hiring and operations we would certainly be investing between \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e million in the next two years jain told et in an interaction he wants india to be among the top five markets in two years currently most of its business comes from the us uk germany japan and australia we are growing rapidly here and by end of next year we will be three times our size in people bengaluru is our second centre and we want it to be one of the core centres along with palo alto where we have about \u003cTWO_HUNDRED\u003e of the total \u003cFIVE_HUNDRED\u003e employees at present we have about \u003cONE_HUNDRED\u003e employees in bengaluru which we will double in two years we will be hiring in roles across software engineers people in ai and ml customer support finance legal sales and marketing etc he said adding it has established itself as a day zero employer at the top five iits bombay delhi kanpur madras and kharagpur","timestamp":"2024-07-05T21:30:00+05:30","market_timestamp":"2024-07-08T09:15:00+05:30","off_market_hours":true}