{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-ceo-vijayakumar-salary-climbed-to-over-10-million/articleshow/111936548.cms","title":"HCLTech CEO Vijayakumar salary climbed to over $10 million","description":"This makes Vijaykumar the second highest paid CEO of an Indian IT company after Wipro’s former chief Thierry Delaporte’s $20 million (around Rs 166 crore) compensation for FY24. In FY24, HCLTech led revenue growth for the industry at Rs 109,913 crore, up 8.3% year-on-year, and net profit at Rs 15,702 crore, up 5.7% year-on-year.","content":"The annual compensation of HCLTech chief executive officer and managing director, C Vijayakumar, climbed 190% to reach $10.06 million (around Rs 84.17 crore) in FY24 ending March, data from the annual report of the company said. In FY23, he drew $3.46 million as total compensation. This makes him the second highest paid CEO of an Indian IT company after Wipro’s former chief Thierry Delaporte’s $20 million (around Rs 166 crore) compensation for FY24.Vijayakumar or CVK as he is known, based in the US, draws remuneration from HCL America Inc, a wholly owned step-down subsidiary of the Company. “There has been no change in the overall remuneration of Mr. C. Vijayakumar, as approved by the shareholders, since his appointment,” the annual report stated. However, as part of the compensation, he received a payout that included a cash component of $2.36 million as LTI (long term incentives) from HCL America. The perquisite value of the performance based RSUs (restricted stock units) exercised by him during FY24 was $4.56 million. The performance-linked bonus of $1.14 million paid in FY24 was related to performance for the previous financial year FY23.","cleaned_content":"the annual compensation of hcltech chief executive officer and managing director c vijayakumar climbed \u003cONE_HUNDRED_PERCENT\u003e to reach \u003cONE_TEN\u003e million around rs \u003cEIGHT_TEN\u003e crore in fy24 ending march data from the annual report of the company said in fy23 he drew \u003cTHREE_\u003e million as total compensation this makes him the second highest paid ceo of an indian it company after wipro s former chief thierry delaporte s \u003cTWO_TEN\u003e million around rs \u003cONE_HUNDRED\u003e crore compensation for fy24 vijayakumar or cvk as he is known based in the us draws remuneration from hcl america inc a wholly owned step down subsidiary of the company there has been no change in the overall remuneration of mr c vijayakumar as approved by the shareholders since his appointment the annual report stated however as part of the compensation he received a payout that included a cash component of \u003cTWO_\u003e million as lti long term incentives from hcl america the perquisite value of the performance based rsus restricted stock units exercised by him during fy24 was \u003cFOUR_\u003e million the performance linked bonus of \u003cONE_\u003e million paid in fy24 was related to performance for the previous financial year fy23","timestamp":"2024-07-22T23:10:00+05:30","market_timestamp":"2024-07-23T09:15:00+05:30","off_market_hours":true}