{"url":"https://economictimes.indiatimes.com/tech/information-tech/large-it-firms-fatigue-on-deal-wins-helping-persistent-ceo-sandeep-kalra/articleshow/111868618.cms","title":"Large IT firms’ fatigue on deal wins helping Persistent: CEO Sandeep Kalra","description":"For the first quarter ending June, Persistent reported a 33.9% year-on-year (YoY) rise in net profit at Rs 306.41 crore for their April to June quarter as compared to Rs 228.76 crore in the same quarter last year. However, sequentially, the profit fell 2.8% from Rs 315.3 crore.","content":"Mid-tier IT firm Persistent Systems' top executive continues to see higher deal wins compared to its bigger outsourcing peers. This is helping the Pune-based IT firm in grabbing a higher market share. The company has grown it’s revenues by 268% since 2020.In an interaction with ET, Sandeep Kalra, chief executive officer and executive director, Persistent said, “Persistent, at $1.2 billion, is competing with bigger vendors, whether they are from India or from outside and winning market share. Obviously, when you're doing vendor consolidation, you are optimising by moving work from onset to offshore, there's transition involved in other things involved. So, there's a cost involved.”According to him, “There is a clear fatigue with the larger players. The reason being they have become too big to react, too big to take care of the customers will be complacent in their own right. And they are not able to bring the latest technology to bear for the customers.”It is now aspiring $2 billion business in the next three years.Amid the generative AI (GenAI) technology disruption, the over $250 billion IT sector is witnessing vendor consolidation and a shrinking of deal sizes thereby leading to higher competition in deal wins across large and mid-tier software service providers.","cleaned_content":"mid tier it firm persistent systems top executive continues to see higher deal wins compared to its bigger outsourcing peers this is helping the pune based it firm in grabbing a higher market share the company has grown it s revenues by \u003cTWO_HUNDRED_PERCENT\u003e since \u003cTWO_THOUSAND\u003e in an interaction with et sandeep kalra chief executive officer and executive director persistent said persistent at \u003cONE_\u003e billion is competing with bigger vendors whether they are from india or from outside and winning market share obviously when youre doing vendor consolidation you are optimising by moving work from onset to offshore theres transition involved in other things involved so theres a cost involved according to him there is a clear fatigue with the larger players the reason being they have become too big to react too big to take care of the customers will be complacent in their own right and they are not able to bring the latest technology to bear for the customers it is now aspiring \u003cTWO_\u003e billion business in the next three years amid the generative ai genai technology disruption the over \u003cTWO_HUNDRED\u003e billion it sector is witnessing vendor consolidation and a shrinking of deal sizes thereby leading to higher competition in deal wins across large and mid tier software service providers","timestamp":"2024-07-19T21:20:00+05:30","market_timestamp":"2024-07-22T09:15:00+05:30","off_market_hours":true}