{"url":"https://economictimes.indiatimes.com/tech/information-tech/cummins-india-launches-it-global-competency-centre-in-pune/articleshow/111782449.cms","title":"Cummins India launches IT global competency centre in Pune","description":"Cummins' GCC in Balewadi, Pune, uses AI, ML, and RPA, with 55% women to promote gender diversity. The staff includes engineers, product owners, and tech leads. Vishwanathan and Newsome highlight its role in IT transformation and collaboration. Internships are available for veterans, special needs individuals, and women returning from maternity leave, located at Cummins' India office campus.","content":"Power solutions technology provider Cummins India on Tuesday launched its first IT Global Competency Centre (GCC) here to drive innovation across global operations through specialised talent and technical capabilities. Set up at the company's India office campus in Pune's Balewadi area, the facility will house software engineers, product owners, architects, technology leads and process experts to drive innovation impacting the automobile, engineering research and development (ER\u0026D), manufacturing and energy sectors, Cummins India said.  The facility aims to harness emerging digital technologies like artificial intelligence, machine learning and Robotic Process Automation (RPA), the company said.  With 55 per cent of women employees, GCC is leading the charge in gender diversity, and strengthening it across all tech roles will be a key focus area, it added.  This GCC aligns with the company's aspirations for business growth and India's continued progress, Annapurna Vishwanathan, Chief Information Officer at Cummins India, said, adding that \"we will achieve this by leveraging India's exceptional talent pool to enhance digital enablement and process transformation, boosting our competitive edge\".  The facility is an integral part of the company's multi-year IT transformational strategy and will focus on scaling up the operational efficiencies and speeding up the time-to-market of its products and services. ","cleaned_content":"power solutions technology provider cummins india on tuesday launched its first it global competency centre gcc here to drive innovation across global operations through specialised talent and technical capabilities set up at the companys india office campus in punes balewadi area the facility will house software engineers product owners architects technology leads and process experts to drive innovation impacting the automobile engineering research and development er d manufacturing and energy sectors cummins india said the facility aims to harness emerging digital technologies like artificial intelligence machine learning and robotic process automation rpa the company said with \u003cFIVE_TEN_PERCENT\u003e of women employees gcc is leading the charge in gender diversity and strengthening it across all tech roles will be a key focus area it added this gcc aligns with the companys aspirations for business growth and indias continued progress annapurna vishwanathan chief information officer at cummins india said adding that we will achieve this by leveraging indias exceptional talent pool to enhance digital enablement and process transformation boosting our competitive edge the facility is an integral part of the companys multi year it transformational strategy and will focus on scaling up the operational efficiencies and speeding up the time to market of its products and services","timestamp":"2024-07-16T16:06:00+05:30","market_timestamp":"2024-07-17T09:15:00+05:30","off_market_hours":true}