{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-companies-see-shift-in-deal-scope-on-genai-muted-market/articleshow/111789460.cms","title":"IT companies see shift in deal scope on GenAI, muted market","description":"Indian IT service firms are adapting to client demands for enhanced productivity and expanded scope of work, potentially impacting profit margins.  IT companies are gifting productivity gains to clients during deals’ anniversaries","content":"Indian software services firms are experiencing a shift in their scope of contractual work following client expectations of enhanced productivity from generative AI or due to global macro uncertainties. Such contractual revisions can potentially erode margins at these companies, experts say.At least three top IT firms – Infosys, Tata Consultancy Services, and HCLTech spoke about either changes in the scope of clients’ contracts or passing productivity benefits to clients by doing the same amount of work for lower price in the last two quarters.While IT firms pass on productivity gains to clients during deal anniversaries, they are currently being asked by clients to add more scope of work during renewals. In a note on HCLTech’s Q1 earnings, Kotak Institutional Equities said, “(Revenue from) IT services declined 1.5% due to the anniversaries of a couple of mega deals in financial services.”It added the firm’s earnings before interest and tax (EBIT) margin was under pressure in the June quarter since it transferred productivity gains to clients in select contracts.TCS chief executive officer K. Krithivasan said, during the company’s quarterly earnings call, that customers expect productivity improvements during project renewals. “What they also do at the time of renewal is usually add more scope during renewals to maintain topline neutrality”.","cleaned_content":"indian software services firms are experiencing a shift in their scope of contractual work following client expectations of enhanced productivity from generative ai or due to global macro uncertainties such contractual revisions can potentially erode margins at these companies experts say at least three top it firms infosys tata consultancy services and hcltech spoke about either changes in the scope of clients contracts or passing productivity benefits to clients by doing the same amount of work for lower price in the last two quarters while it firms pass on productivity gains to clients during deal anniversaries they are currently being asked by clients to add more scope of work during renewals in a note on hcltech s q1 earnings kotak institutional equities said revenue from it services declined \u003cONE_PERCENT\u003e due to the anniversaries of a couple of mega deals in financial services it added the firm s earnings before interest and tax ebit margin was under pressure in the june quarter since it transferred productivity gains to clients in select contracts tcs chief executive officer k krithivasan said during the company s quarterly earnings call that customers expect productivity improvements during project renewals what they also do at the time of renewal is usually add more scope during renewals to maintain topline neutrality","timestamp":"2024-07-17T06:00:00+05:30","market_timestamp":"2024-07-17T09:15:00+05:30","off_market_hours":true}