{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-q1-headcount-drops-by-1908-to-hire-up-to-20000-freshers-in-fy25/articleshow/111838502.cms","title":"Infosys Q1 headcount drops by 1,908; to hire up to 20,000 freshers in FY25","description":"Total employees at Infosys for the period ending June stood at 315,332 as compared to 317,240 in the March quarter. The employee count declined by 20,962 from a year ago.  Infosys said its first-quarter net profit declined 20.1% sequentially, despite seeing a revenue gain of 3.7% quarter on quarter.","content":"Infosys, India’s second-largest IT services giant, has seen a reduction in its headcount during the April to June period by 1,908 employees, marking the sixth consecutive quarterly decline in its total workforce.Its total employees for the period ending June stood at 315,332 as compared to 317,240 in the March quarter. The employee count declined by 20,962 from a year ago.The company said it plans to hire around 15,000-20,000 freshers in the year ahead.Also read | Infosys beats PAT and revenue estimates, dials up outlookThe attrition rate for Q1 of the fiscal year 2025 on the last twelve-month basis edged up to 12.7%, from 12.6% in the previous quarter.","cleaned_content":"infosys india s second largest it services giant has seen a reduction in its headcount during the april to june period by \u003cONE_THOUSAND\u003e employees marking the sixth consecutive quarterly decline in its total workforce its total employees for the period ending june stood at \u003cTHREE_HUNDRED_THOUSAND\u003e as compared to \u003cTHREE_HUNDRED_THOUSAND\u003e in the march quarter the employee count declined by \u003cTWO_TEN_THOUSAND\u003e from a year ago the company said it plans to hire around \u003cONE_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e freshers in the year ahead also read infosys beats pat and revenue estimates dials up outlookthe attrition rate for q1 of the fiscal year \u003cTWO_THOUSAND\u003e on the last twelve month basis edged up to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in the previous quarter","timestamp":"2024-07-19T08:57:00+05:30","market_timestamp":"2024-07-19T09:15:00+05:30","off_market_hours":true}