{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-mccamish-facing-fourth-class-action-suit-over-2023-data-breach/articleshow/112032159.cms","title":"Infosys McCamish facing fourth class action suit over 2023 data breach","description":"Mails seeking comment from Infosys were directed to response made during Q1 earnings where CEO Salil Parekh said “McCamish is in the process of coordinating with its clients to ensure all the notifications are provided. In addition, the U.S. State Attorney Generals and Insurance Commissioners have also been notified.”","content":"Another class action complaint was filed against Infosys McCamish Systems LLC (IMS) this month in the US District Court for the Northern District of Georgia, the company disclosed in a filing with US Securities and Exchange Commission on Wednesday night.This is the fourth class action complaint filed against the IT major’s US subsidiary since the cyber security incident on November, 2023, that exposed approximately 6.5 million individuals’ information to unauthorised access.“On July 8, 2024, another class action complaint arising out of the same incident was filed in the same court against McCamish. The complaint was purportedly filed on behalf of all individuals residing in the United States whose private information was accessed and/or acquired by an unauthorized party as a result of the incident,” Infosys said in the filing.Mails seeking comment from Infosys were directed to response made during Q1 earnings where CEO Salil Parekh said “McCamish is in the process of coordinating with its clients to ensure all the notifications are provided. In addition, the U.S. State Attorney Generals and Insurance Commissioners have also been notified.”This development comes a month after the court consolidated two previous class actions on June 4, 2024. McCamish, in coordination with its third-party eDiscovery vendor, has identified up to approximately 6.5 million individuals whose information was subject to unauthorized access and exfiltration. ","cleaned_content":"another class action complaint was filed against infosys mccamish systems llc ims this month in the us district court for the northern district of georgia the company disclosed in a filing with us securities and exchange commission on wednesday night this is the fourth class action complaint filed against the it major s us subsidiary since the cyber security incident on november \u003cTWO_THOUSAND\u003e that exposed approximately \u003cSIX_\u003e million individuals information to unauthorised access on july \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e another class action complaint arising out of the same incident was filed in the same court against mccamish the complaint was purportedly filed on behalf of all individuals residing in the united states whose private information was accessed and or acquired by an unauthorized party as a result of the incident infosys said in the filing mails seeking comment from infosys were directed to response made during q1 earnings where ceo salil parekh said mccamish is in the process of coordinating with its clients to ensure all the notifications are provided in addition the u s state attorney generals and insurance commissioners have also been notified this development comes a month after the court consolidated two previous class actions on june \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e mccamish in coordination with its third party ediscovery vendor has identified up to approximately \u003cSIX_\u003e million individuals whose information was subject to unauthorized access and exfiltration","timestamp":"2024-07-26T10:31:00+05:30","market_timestamp":"2024-07-26T10:31:00+05:30","off_market_hours":false}