{"url":"https://economictimes.indiatimes.com/tech/information-tech/nasscom-industry-captains-erupt-in-anger-against-karnatakas-job-reservation-move/articleshow/111814805.cms","title":"Nasscom, India Inc flay Karnataka's jobs-for-locals plan","description":"They fear the bill will reverse the progress made by the state till now, drive away companies, and stifle startups. Neighbouring AP and Kerala threw their hats into the ring, welcoming tech companies to their states and promising all necessary support.","content":"The Karnataka government put on hold its decision to bring in legislation for reserving private sector jobs for Kannadigas hours after announcing it on Wednesday, following widespread backlash from the technology sector and industry captains who termed the move regressive.In a post on microblogging platform X in the evening, chief minister Siddaramaiah said the Bill was still in the “preparation” stage and that the government would make a decision on it after an elaborate discussion at the next Cabinet meeting.The Congress government also sought to alleviate industry concerns.\"Industry leaders needn’t panic as assured. The government is committed to further creation of jobs, and furthermore for Kannadigas, however in a more amicable manner,\" industries minister MB Patil said. In a post on X. He said the draft Bill has been withheld for further consultations and due diligence. ","cleaned_content":"the karnataka government put on hold its decision to bring in legislation for reserving private sector jobs for kannadigas hours after announcing it on wednesday following widespread backlash from the technology sector and industry captains who termed the move regressive in a post on microblogging platform x in the evening chief minister siddaramaiah said the bill was still in the preparation stage and that the government would make a decision on it after an elaborate discussion at the next cabinet meeting the congress government also sought to alleviate industry concerns industry leaders needn t panic as assured the government is committed to further creation of jobs and furthermore for kannadigas however in a more amicable manner industries minister mb patil said in a post on x he said the draft bill has been withheld for further consultations and due diligence","timestamp":"2024-07-18T08:32:00+05:30","market_timestamp":"2024-07-18T09:15:00+05:30","off_market_hours":true}