{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-communications-overseas-revenues-continue-to-outgrow-india-ceo/articleshow/111844113.cms","title":"Tata Communications’ overseas revenues continue to outgrow India: CEO","description":"For the April-June 2024 period, the company reported a 12.78% decline in net profit to Rs 332.93 crore for Rs 381.75 crore from a year ago. On-quarter basis the profit was up 3.54% from Rs 321.52 crore posted in the March-end quarter. During the first quarter of fiscal 2025, Tata Communications’ income from operations stood at Rs 5,659.71 crore having increased 14.1% on-year comparison, but decreased 1.55% sequentially","content":"Tata Group’s telecom, cloud and media arm Tata Communications’ overseas revenues have continued to outgrow its India revenues for three consecutive quarters and hold a 58:42 ratio as of end-June 24, chief executive AS Lakshminarayanan told ET.Read More: Crowdstrike Down Live Updates“In the US and European markets, we are a challenger, so there is a much bigger white space for us to chase and that's why two years ago we started making all these investments in sales and marketing and our products. All of that has started to pay dividends, and we are happy to see the results,” the executive said in a virtual conversation after the company declared its first quarter FY25 earnings.Meanwhile, in India, we are already a leader, our ambition is to maintain the leadership position and grow the India business, he added.For the April-June 2024 period, the company reported a 12.78% decline in net profit to Rs 332.93 crore for Rs 381.75 crore from a year ago. On-quarter basis the profit was up 3.54% from Rs 321.52 crore posted in the March-end quarter.","cleaned_content":"tata group s telecom cloud and media arm tata communications overseas revenues have continued to outgrow its india revenues for three consecutive quarters and hold a \u003cFIVE_TEN\u003e \u003cFOUR_TEN\u003e ratio as of end june \u003cTWO_TEN\u003e chief executive as lakshminarayanan told et read more crowdstrike down live updates in the us and european markets we are a challenger so there is a much bigger white space for us to chase and thats why two years ago we started making all these investments in sales and marketing and our products all of that has started to pay dividends and we are happy to see the results the executive said in a virtual conversation after the company declared its first quarter fy25 earnings meanwhile in india we are already a leader our ambition is to maintain the leadership position and grow the india business he added for the april june \u003cTWO_THOUSAND\u003e period the company reported a \u003cONE_TEN_PERCENT\u003e decline in net profit to rs \u003cTHREE_HUNDRED\u003e crore for rs \u003cTHREE_HUNDRED\u003e crore from a year ago on quarter basis the profit was up \u003cTHREE_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore posted in the march end quarter","timestamp":"2024-07-19T14:47:00+05:30","market_timestamp":"2024-07-19T14:47:00+05:30","off_market_hours":false}