{"url":"https://economictimes.indiatimes.com/tech/information-tech/persistent-systems-q1-net-profit-rises-33-9-on-year-to-rs-306-crore/articleshow/111842803.cms","title":"Persistent Systems Q1 net profit rises 33.9% on year to Rs 306 crore","description":"Persistent Systems' revenue from operations rose 17.9% YoY to Rs 2,737.17 crore as compared to Rs 2,321,17 crore in the same quarter the previous year. Quarter-on-quarter its revenues increased 5.6% from previous quarter’s revenues of Rs 2,590.5 crore.","content":"Pune-based mid-tier IT firm Persistent Systems on Thursday reported a 33.9% increase in net profit to Rs 306.41 crore for the quarter to June, from Rs 228.76 crore a year ago. Sequentially, net profit fell 2.8% from Rs 315.3 crore in the previous three-month period.The company’s revenue from operations increased 17.9% year-on-year to Rs 2,737.17 crore from Rs 2,321,17 crore. Quarter-on-quarter increase in revenue was 5.6% from Rs 2,590.5 crore in the January-March period.Persistent Systems’ core business – software, hi-tech and emerging industries – grew slower at 4.1%, as compared to the banking, financial services and insurance (BFSI) sector, which grew 8.9% to Rs 843.15 crore, boosting its overall revenue. The order booking for the quarter improved to $316.8 million in total contract value (TCV) from $462.8 million.Reporting the 17th consecutive quarter of revenue growth, chief executive Sandeep Kalra said, “We have pivoted to an AI-led, platform-driven services approach, deepening our hyperscaler partnerships and developing a suite of innovative solutions.”In dollar terms, revenue increased 14.3% year-on-year to $1.2 billion while profit was up 16% to $328.2 million.","cleaned_content":"pune based mid tier it firm persistent systems on thursday reported a \u003cTHREE_TEN_PERCENT\u003e increase in net profit to rs \u003cTHREE_HUNDRED\u003e crore for the quarter to june from rs \u003cTWO_HUNDRED\u003e crore a year ago sequentially net profit fell \u003cTWO_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore in the previous three month period the company s revenue from operations increased \u003cONE_TEN_PERCENT\u003e year on year to rs \u003cTWO_THOUSAND\u003e crore from rs \u003cTWO_HUNDRED_THOUSAND\u003e crore quarter on quarter increase in revenue was \u003cFIVE_PERCENT\u003e from rs \u003cTWO_THOUSAND\u003e crore in the january march period persistent systems core business software hi tech and emerging industries grew slower at \u003cFOUR_PERCENT\u003e as compared to the banking financial services and insurance bfsi sector which grew \u003cEIGHT_PERCENT\u003e to rs \u003cEIGHT_HUNDRED\u003e crore boosting its overall revenue the order booking for the quarter improved to \u003cTHREE_HUNDRED\u003e million in total contract value tcv from \u003cFOUR_HUNDRED\u003e million reporting the \u003cONE_TEN\u003e th consecutive quarter of revenue growth chief executive sandeep kalra said we have pivoted to an ai led platform driven services approach deepening our hyperscaler partnerships and developing a suite of innovative solutions in dollar terms revenue increased \u003cONE_TEN_PERCENT\u003e year on year to \u003cONE_\u003e billion while profit was up \u003cONE_TEN_PERCENT\u003e to \u003cTHREE_HUNDRED\u003e million","timestamp":"2024-07-18T22:46:00+05:30","market_timestamp":"2024-07-19T09:15:00+05:30","off_market_hours":true}