{"url":"https://economictimes.indiatimes.com/tech/information-tech/cyients-profit-declines-23-8-to-rs-144-crore-in-q1/articleshow/112020515.cms","title":"ER\u0026D firm Cyient's Q1 profit declines 23.8% to Rs 144 crore","description":"Unlike the previous quarter when the firm saw deal wins from Airbus and Deutsche Aircraft, the ER\u0026D (engineering and research and development) firm’s revenue was impacted by greater-than-anticipated delays and right shifts in project execution in the connectivity segment. Its Q1 revenue was down 0.6% YoY and 9.9% sequentially at Rs 1,675.7 crore.","content":"Engineering service provider Cyient reported a 23.8% sequential drop in its first-quarter net profit at Rs 144 crore. On a year-on-year (YoY) basis, the profit for the Hyderabad-based firm declined 18.6%.Unlike the previous quarter when the firm saw deal wins from Airbus and Deutsche Aircraft, the ER\u0026D (engineering and research and development) firm’s revenue was impacted by greater-than-anticipated delays and right shifts in project execution in the connectivity segment. Its Q1 revenue was down 0.6% YoY and 9.9% sequentially at Rs 1,675.7 crore.The DET (Digital, Engineering and Technology) segment of the company which accounts for more than 80% of the firm’s revenue, clocked Rs 1,414 crore in revenue, down 5% quarter on quarter (QoQ) and 2.8% YoY.Revising its annual revenue forecast downward, Cyient said that for FY25, it expects DET revenue growth to be flattish on year in constant currency terms. In April, the ER\u0026D company projected DET revenue to grow in high single digits for FY25.DET segment’s EBIT margin stood at 13.5%, down 260 bps (100 bps is one percent) YoY. Its headcount declined to 15,083 at the end of June quarter, down by 378 from the previous quarter.","cleaned_content":"engineering service provider cyient reported a \u003cTWO_TEN_PERCENT\u003e sequential drop in its first quarter net profit at rs \u003cONE_HUNDRED\u003e crore on a year on year yoy basis the profit for the hyderabad based firm declined \u003cONE_TEN_PERCENT\u003e unlike the previous quarter when the firm saw deal wins from airbus and deutsche aircraft the er d engineering and research and development firm s revenue was impacted by greater than anticipated delays and right shifts in project execution in the connectivity segment its q1 revenue was down \u003cZERO_PERCENT\u003e yoy and \u003cNINE_PERCENT\u003e sequentially at rs \u003cONE_THOUSAND\u003e crore the det digital engineering and technology segment of the company which accounts for more than \u003cEIGHT_TEN_PERCENT\u003e of the firm s revenue clocked rs \u003cONE_THOUSAND\u003e crore in revenue down \u003cFIVE_PERCENT\u003e quarter on quarter qoq and \u003cTWO_PERCENT\u003e yoy revising its annual revenue forecast downward cyient said that for fy25 it expects det revenue growth to be flattish on year in constant currency terms in april the er d company projected det revenue to grow in high single digits for fy25 det segment s ebit margin stood at \u003cONE_TEN_PERCENT\u003e down \u003cTWO_HUNDRED\u003e bps \u003cONE_HUNDRED\u003e bps is one percent yoy its headcount declined to \u003cONE_TEN_THOUSAND\u003e at the end of june quarter down by \u003cTHREE_HUNDRED\u003e from the previous quarter","timestamp":"2024-07-25T20:01:00+05:30","market_timestamp":"2024-07-26T09:15:00+05:30","off_market_hours":true}