{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-announces-plans-to-hire-40000-freshers-this-year/articleshow/111758556.cms","title":"TCS announces plans to hire 40,000 freshers this year","description":"TCS's robust growth in Q2 includes hiring 5,452 employees, with plans to recruit 40,000 more this year. CHRO Milind Lakkad affirmed India's talent appeal amid AI concerns, emphasizing reskilling and a revamped variable pay policy linked to office attendance for 70% of returning employees.","content":"As the global IT sector undergoes significant transformations, India remains a pivotal hub for talent, adeptly navigating the tectonic shifts shaping the industry.In the June quarter alone, Tata Consultancy Services (TCS) added 5,452 employees, pushing its total headcount to 606,998. The company plans to hire approximately 40,000 freshers in the current financial year, continuing its robust recruitment drive.Milind Lakkad, TCS's CHRO, underscored India's enduring appeal for talent amidst diverse skill requirements and geopolitical challenges elsewhere. \"India is the destination for talent, and that is not going to change in the near future,\" Lakkad affirmed. He emphasized TCS's initiatives to bridge academia-industry gaps through extensive reskilling and upskilling programs, uniquely positioned at scale. \"I am very confident about a positive way forward for Indian talent,\" Lakkad added, optimistic about future achievements.Addressing concerns about AI impacting employment, Lakkad reassured that while technology reshapes job landscapes, TCS employees are adept at adapting. TCS has implemented salary increments ranging from 4.5% to 7%, with high performers receiving 10-12%. The Elevate Runway program further incentivizes career growth, particularly for junior employees doubling their compensation through accelerated learning paths.The program, open to employees across all levels, focuses not only on financial rewards but also on career advancement aligned with individual aspirations. Over 400,000 employees have enrolled, demonstrating its popularity and impact. Additionally, TCS's mid-level Transformation program (MLT) supports employees in acquiring market-relevant skills to take on new roles within the organization.","cleaned_content":"as the global it sector undergoes significant transformations india remains a pivotal hub for talent adeptly navigating the tectonic shifts shaping the industry in the june quarter alone tata consultancy services tcs added \u003cFIVE_THOUSAND\u003e employees pushing its total headcount to \u003cSIX_HUNDRED_THOUSAND\u003e the company plans to hire approximately \u003cFOUR_TEN_THOUSAND\u003e freshers in the current financial year continuing its robust recruitment drive milind lakkad tcss chro underscored indias enduring appeal for talent amidst diverse skill requirements and geopolitical challenges elsewhere india is the destination for talent and that is not going to change in the near future lakkad affirmed he emphasized tcss initiatives to bridge academia industry gaps through extensive reskilling and upskilling programs uniquely positioned at scale i am very confident about a positive way forward for indian talent lakkad added optimistic about future achievements addressing concerns about ai impacting employment lakkad reassured that while technology reshapes job landscapes tcs employees are adept at adapting tcs has implemented salary increments ranging from \u003cFOUR_PERCENT\u003e to \u003cSEVEN_PERCENT\u003e with high performers receiving \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e the elevate runway program further incentivizes career growth particularly for junior employees doubling their compensation through accelerated learning paths the program open to employees across all levels focuses not only on financial rewards but also on career advancement aligned with individual aspirations over \u003cFOUR_HUNDRED_THOUSAND\u003e employees have enrolled demonstrating its popularity and impact additionally tcss mid level transformation program mlt supports employees in acquiring market relevant skills to take on new roles within the organization","timestamp":"2024-07-15T14:05:00+05:30","market_timestamp":"2024-07-15T14:05:00+05:30","off_market_hours":false}