{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-flags-singapores-new-skilled-visa-framework/articleshow/111995885.cms","title":"IT flags Singapore’s new skilled visa framework","description":"The IT industry has flagged the new framework unveiled by the Singapore government for skilled worker visas, especially pointing to its narrow criteria under the points-based framework. The new framework is set to be implemented in September for visa revalidations.","content":"The IT industry has raised concerns with the Indian government around Singapore's new framework for skilled worker visas, saying it could hinder ease of doing business due to the existing skills shortage. The industry has flagged the narrow criteria under the points-based framework, where only eight Indian universities are eligible for points and all nationalities are given equal weightage for diversity assessment, which may not reflect the on-ground realities, industry body Nasscom told ET. It also seeks to expand which roles are listed as being in a ‘shortage’. The new framework is set to be implemented in September for visa revalidations. Starting September 1, those applying for visa renewals will have to earn at least 40 points under the new Complementarity Assessment Framework (COMPASS), on top of meeting the qualifying salary, to get an Employment Pass (EP) to work in Singapore.Shivendra Singh, vice president-global trade development at Nasscom, said that the shortage of digital talent in Singapore is well known and hence critical skills need to be brought in on non-immigrant visas including the EP.“When the tech industry faces challenges globally, our government has been extremely supportive of our issues,” Singh said. “We have been raising the Singapore challenge with them and request the Singapore government to kindly consider, given the resolution will enhance our industry presence in Singapore and create a win-win partnership for value addition to Singapore's economic growth story.”","cleaned_content":"the it industry has raised concerns with the indian government around singapores new framework for skilled worker visas saying it could hinder ease of doing business due to the existing skills shortage the industry has flagged the narrow criteria under the points based framework where only eight indian universities are eligible for points and all nationalities are given equal weightage for diversity assessment which may not reflect the on ground realities industry body nasscom told et it also seeks to expand which roles are listed as being in a shortage the new framework is set to be implemented in september for visa revalidations starting september \u003cONE_\u003e those applying for visa renewals will have to earn at least \u003cFOUR_TEN\u003e points under the new complementarity assessment framework compass on top of meeting the qualifying salary to get an employment pass ep to work in singapore shivendra singh vice president global trade development at nasscom said that the shortage of digital talent in singapore is well known and hence critical skills need to be brought in on non immigrant visas including the ep when the tech industry faces challenges globally our government has been extremely supportive of our issues singh said we have been raising the singapore challenge with them and request the singapore government to kindly consider given the resolution will enhance our industry presence in singapore and create a win win partnership for value addition to singapores economic growth story","timestamp":"2024-07-25T06:01:00+05:30","market_timestamp":"2024-07-25T09:15:00+05:30","off_market_hours":true}