{"url":"https://economictimes.indiatimes.com/tech/information-tech/coforge-q1-profit-hit-by-acquisition-revenue-up-8/articleshow/111953317.cms","title":"Coforge Q1 profit hit by acquisition, revenue up 8%","description":"Coforge's revenue grew 8.1% YoY and 1.8% quarter-on-quarter (QoQ) to Rs 2,400.8 crore for the first quarter ending June as compared to Rs 2,221 crore in Q1FY24 and Rs 2,358.5 crore in the March quarter or Q4FY24.","content":"IT services and digital solutions firms Coforge announced their first quarter numbers reporting a 19.4% year-on-year (YoY) drop in profit due to a one-time hit with a stake acquisition of Cigniti Technologies announced in May. On a sequential basis, profit fell 40.5% to Rs 133.2 crore in April to June period 2024 as compared to Rs 223.7 crore in the previous quarter.The mid-tier firm’s profit stood at Rs 165.3 crore a year ago. Without the acquisition impact, the “normalised profit” grew 38.2% YoY at Rs 228.5 crore.The revenue grew 8.1% YoY and 1.8% quarter-on-quarter (QoQ) to Rs 2,400.8 crore for the first quarter ending June as compared to Rs 2,221 crore in Q1FY24 and Rs 2,358.5 crore in the March quarter or Q4FY24.In dollar terms, revenue grew 7.8% YOY and 1.6% QoQ in constant currency terms at $291.4 million.Margins were impacted due to acquisition of Cigniti-related expenses at Rs 79.5 crore. Its EBIDTA margins declined to 17.9% from 19.0% in previous quarter and up from 16% a year ago.","cleaned_content":"it services and digital solutions firms coforge announced their first quarter numbers reporting a \u003cONE_TEN_PERCENT\u003e year on year yoy drop in profit due to a one time hit with a stake acquisition of cigniti technologies announced in may on a sequential basis profit fell \u003cFOUR_TEN_PERCENT\u003e to rs \u003cONE_HUNDRED\u003e crore in april to june period \u003cTWO_THOUSAND\u003e as compared to rs \u003cTWO_HUNDRED\u003e crore in the previous quarter the mid tier firm s profit stood at rs \u003cONE_HUNDRED\u003e crore a year ago without the acquisition impact the normalised profit grew \u003cTHREE_TEN_PERCENT\u003e yoy at rs \u003cTWO_HUNDRED\u003e crore the revenue grew \u003cEIGHT_PERCENT\u003e yoy and \u003cONE_PERCENT\u003e quarter on quarter qoq to rs \u003cTWO_THOUSAND\u003e crore for the first quarter ending june as compared to rs \u003cTWO_THOUSAND\u003e crore in q1fy24 and rs \u003cTWO_THOUSAND\u003e crore in the march quarter or q4fy24 in dollar terms revenue grew \u003cSEVEN_PERCENT\u003e yoy and \u003cONE_PERCENT\u003e qoq in constant currency terms at \u003cTWO_HUNDRED\u003e million margins were impacted due to acquisition of cigniti related expenses at rs \u003cSEVEN_TEN\u003e crore its ebidta margins declined to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in previous quarter and up from \u003cONE_TEN_PERCENT\u003e a year ago","timestamp":"2024-07-23T13:14:00+05:30","market_timestamp":"2024-07-23T13:14:00+05:30","off_market_hours":false}