{"url":"https://economictimes.indiatimes.com/tech/information-tech/kpit-tech-q1-profit-jumps-54-on-one-time-gain-revenue-up-24/articleshow/111992619.cms","title":"KPIT Tech Q1 profit jumps 54% on one-time gain, revenue up 24%","description":"Pune-based KPIT, an automotive-focussed software services company, saw its net profit jump over 50% on year, while revenue was up over 24% in the first quarter of fiscal 2025.","content":"KPIT Technologies (KPIT), an automotive-focused software services provider, reported a 52.4% year-on-year (YoY) jump in net profit at Rs 204.2 crore for the first quarter ending June of the ongoing fiscal year 2025. The profit was due to a one-time income gain of Rs 39.6 crore as compared with Rs 13.4 crore a year ago.The profit stood at Rs 134.4 crore a year ago and sequentially grew by 23% from Rs 165.9 crore in Q4 FY24.The Pune-based IT company’s revenue rose 24.3% YoY to Rs 1,364 crore in Q1FY25 compared to Rs 1,097.6 crore a year ago. It grew 3.5% over the previous quarter’s revenue at Rs 1,317.8 crore. “We have started the year on a positive note with an all-round robust performance. While the mobility industry is going through certain pressures on the demand and profitability fronts, we are proactively investing in creating relevant large, differentiated offerings to support our clients reduce their costs and time-to-market. We are also investing in adjacencies and newer geographical markets. We expect creation of meaningful growth opportunities via both these investments and continue with the growth momentum, paving way for a fair demand visibility in the medium-term,” said Kishor Patil, cofounder, chief executive and managing director, KPIT.The growth was led by a rise in passenger cars revenue which was up 31% on year and over 5% quarter-on-quarter (QoQ). Business unit-wise growth was broad-based across feature development and integration, growing 22.5% (2% QoQ), architecture \u0026 middleware consulting rising 20.5% (13.7% QoQ) and cloud-based connected services growth at 28.2%, which declined marginally 0.6% on a QoQ basis.","cleaned_content":"kpit technologies kpit an automotive focused software services provider reported a \u003cFIVE_TEN_PERCENT\u003e year on year yoy jump in net profit at rs \u003cTWO_HUNDRED\u003e crore for the first quarter ending june of the ongoing fiscal year \u003cTWO_THOUSAND\u003e the profit was due to a one time income gain of rs \u003cTHREE_TEN\u003e crore as compared with rs \u003cONE_TEN\u003e crore a year ago the profit stood at rs \u003cONE_HUNDRED\u003e crore a year ago and sequentially grew by \u003cTWO_TEN_PERCENT\u003e from rs \u003cONE_HUNDRED\u003e crore in q4 fy24 the pune based it company s revenue rose \u003cTWO_TEN_PERCENT\u003e yoy to rs \u003cONE_THOUSAND\u003e crore in q1fy25 compared to rs \u003cONE_THOUSAND\u003e crore a year ago it grew \u003cTHREE_PERCENT\u003e over the previous quarter s revenue at rs \u003cONE_THOUSAND\u003e crore we have started the year on a positive note with an all round robust performance while the mobility industry is going through certain pressures on the demand and profitability fronts we are proactively investing in creating relevant large differentiated offerings to support our clients reduce their costs and time to market we are also investing in adjacencies and newer geographical markets we expect creation of meaningful growth opportunities via both these investments and continue with the growth momentum paving way for a fair demand visibility in the medium term said kishor patil cofounder chief executive and managing director kpit the growth was led by a rise in passenger cars revenue which was up \u003cTHREE_TEN_PERCENT\u003e on year and over \u003cFIVE_PERCENT\u003e quarter on quarter qoq business unit wise growth was broad based across feature development and integration growing \u003cTWO_TEN_PERCENT\u003e \u003cTWO_PERCENT\u003e qoq architecture middleware consulting rising \u003cTWO_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e qoq and cloud based connected services growth at \u003cTWO_TEN_PERCENT\u003e which declined marginally \u003cZERO_PERCENT\u003e on a qoq basis","timestamp":"2024-07-24T19:53:00+05:30","market_timestamp":"2024-07-25T09:15:00+05:30","off_market_hours":true}