{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-mulls-contesting-rs-32403-crore-gst-notice/articleshow/112212347.cms","title":"Infosys mulls contesting Rs 32,403-crore GST notice","description":"Infosys is considering contesting a Rs 32,403 crore notice for unpaid Integrated Goods and Services Tax (IGST) under the reverse charge mechanism. The issue is related to services claimed to have been received from overseas branches, according to people familiar with the matter. Infosys received a pre-showcause notice from the Bengaluru branch of Directorate General of GST Intelligence (DGGI) and has not yet responded to this latest notice.","content":"New Delhi: Tech giant Infosys is considering contesting the Rs 32,403 crore notice for unpaid Integrated Goods and Services Tax under the reverse charge mechanism for services claimed to have been received from overseas branches, people familiar with the development said.The company had received a pre-showcause notice from Bengaluru branch of Directorate General of GST Intelligence (DGGI). It is yet to respond to the latest notice.Tax officials said the notice sent to Infosys was a pre-showcause notice sent as per the provisions under the existing law and the company is still free to respond, explain and contest the notice.\"It is a pre-showcause notice sent and the company will get enough time to respond to the notice, explain its position, and contest it,\" a senior official told ET.  ","cleaned_content":"new delhi tech giant infosys is considering contesting the rs \u003cTHREE_TEN_THOUSAND\u003e crore notice for unpaid integrated goods and services tax under the reverse charge mechanism for services claimed to have been received from overseas branches people familiar with the development said the company had received a pre showcause notice from bengaluru branch of directorate general of gst intelligence dggi it is yet to respond to the latest notice tax officials said the notice sent to infosys was a pre showcause notice sent as per the provisions under the existing law and the company is still free to respond explain and contest the notice it is a pre showcause notice sent and the company will get enough time to respond to the notice explain its position and contest it a senior official told et","timestamp":"2024-08-02T00:47:00+05:30","market_timestamp":"2024-08-02T09:15:00+05:30","off_market_hours":true}