{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-coded-indias-tax-network-it-got-a-4-billion-bill/articleshow/112280955.cms","title":"Infosys coded India’s tax network, it got a $4 billion bill","description":"The Bengaluru-based firm sent out another statement Thursday evening, saying that the pre-show-cause notice by the state authority had been withdrawn, and it had been directed to submit a response to the GST intelligence directorate in New Delhi. In a further update Saturday, Infosys said that the notice for the financial year ended in March 2018, covering 12% of the demand, stood “closed.”","content":"Software outsourcing from India took off after the Y2K scare of the late 1990s by steering a vast pool of cheap engineering talent toward programming. And because the industry earned dollars, it got to keep most of its profit. New Delhi’s tax bureaucracy couldn’t come up with a plan to slaughter the golden goose. It’s never too late, however, to sharpen the knives. Take the notice last week to Infosys Ltd. for allegedly evading India’s goods and services tax, or GST, to the tune of 324 billion rupees ($4 billion) over five years. That’s its annual operating profit. Infosys said Wednesday it has paid all that it is legally required to — and even investors don’t believe that India’s second-largest software exporter needs to provide for the alleged liability. Infosys shares, the best performers on the benchmark Nifty 50 index over the past three months, have fallen 2.5% on the news.The Bengaluru-based firm sent out another statement Thursday evening, saying that the pre-show-cause notice by the state authority had been withdrawn, and it had been directed to submit a response to the GST intelligence directorate in New Delhi. In a further update Saturday, Infosys said that the notice for the financial year ended in March 2018, covering 12% of the demand, stood “closed.” I’m no tax expert, though I have seen the federal authority’s claim. It says that Infosys imported services from its own global offices, through which it solicits business from large corporations. The coding takes place mostly in India, but the foreign branches also make engineers available onsite at clients’ locations to execute outsourcing projects in coordination with Bengaluru. These units, the department claims, are distinct from the head office. And since the Indian company is paying their expenses and billing global customers for the same, it is liable to pay GST on the supply of services received from its branches overseas.Infosys must be ruing the day nine years ago when it bagged the $200 million project from the government of Prime Minister Narendra Modi to write the software for the GST, India’s biggest fiscal reform in decades. Unifying a plethora of sub-national taxes was a long-standing demand of businesses. They wanted the freedom to seamlessly access a common market of 1.4 billion people. What got implemented, however, was one of the world’s most complicated GSTs with five rates: zero, 5%, 12%, 18% and 28%, even as petroleum products and alcohol continued to be taxed separately. For smaller firms, it was a compliance nightmare.","cleaned_content":"software outsourcing from india took off after the y2k scare of the late \u003cONE_THOUSAND\u003e s by steering a vast pool of cheap engineering talent toward programming and because the industry earned dollars it got to keep most of its profit new delhi s tax bureaucracy couldn t come up with a plan to slaughter the golden goose it s never too late however to sharpen the knives take the notice last week to infosys ltd for allegedly evading india s goods and services tax or gst to the tune of \u003cTHREE_HUNDRED\u003e billion rupees \u003cFOUR_\u003e billion over five years that s its annual operating profit infosys said wednesday it has paid all that it is legally required to and even investors don t believe that india s second largest software exporter needs to provide for the alleged liability infosys shares the best performers on the benchmark nifty \u003cFIVE_TEN\u003e index over the past three months have fallen \u003cTWO_PERCENT\u003e on the news the bengaluru based firm sent out another statement thursday evening saying that the pre show cause notice by the state authority had been withdrawn and it had been directed to submit a response to the gst intelligence directorate in new delhi in a further update saturday infosys said that the notice for the financial year ended in march \u003cTWO_THOUSAND\u003e covering \u003cONE_TEN_PERCENT\u003e of the demand stood closed i m no tax expert though i have seen the federal authority s claim it says that infosys imported services from its own global offices through which it solicits business from large corporations the coding takes place mostly in india but the foreign branches also make engineers available onsite at clients locations to execute outsourcing projects in coordination with bengaluru these units the department claims are distinct from the head office and since the indian company is paying their expenses and billing global customers for the same it is liable to pay gst on the supply of services received from its branches overseas infosys must be ruing the day nine years ago when it bagged the \u003cTWO_HUNDRED\u003e million project from the government of prime minister narendra modi to write the software for the gst india s biggest fiscal reform in decades unifying a plethora of sub national taxes was a long standing demand of businesses they wanted the freedom to seamlessly access a common market of \u003cONE_\u003e billion people what got implemented however was one of the world s most complicated gsts with five rates zero \u003cFIVE_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e even as petroleum products and alcohol continued to be taxed separately for smaller firms it was a compliance nightmare","timestamp":"2024-08-05T13:17:00+05:30","market_timestamp":"2024-08-05T13:17:00+05:30","off_market_hours":false}