{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-q2-profit-up-22-at-566-million-revenue-flat/articleshow/112184070.cms","title":"Cognizant Q2 profit up 22% at $566 million, revenue flat","description":"Chief financial officer Jatin Dalal said the sequential revenue growth of 2.1% in constant currency, driven by Financial Services and Health Sciences segments, was the strongest in two years.","content":"US-headquartered information technology and professional services firm Cognizant Technology Solutions (Cognizant) posted a 22.2% year-on-year (YoY) growth in net profit at $566 million year-on-year (YoY) for the second quarter ending June 2024. Sequentially, the net profit grew 3.6% from $546 million in the previous quarter.Revenue for the Nasdaq-listed technology major came in at the higher end of its guided range at $4.85 billion, almost flat or marginally lower by 0.7% YoY from $4.89 billion a year ago quarter and 1.9% higher quarter-on-quarter (QoQ) from $4.76 billion in the March quarter. In Q1, the company had given revenue guidance for Q2 in the range of $4.75 to $4.82 billion.\"In the second quarter, we delivered revenue above the high end of our guidance range, expanded adjusted operating margin, and maintained our large deal momentum. Progress against our strategic priorities is opening new opportunities with clients and allowing us to operate with greater agility,\" said Ravi Kumar S, chief executive officer.Cognizant, whose majority of employees are based in India, follows the calendar year cycle from January to December.The global IT major has increased its full year 2024 revenue guidance in the range of $19.3 to $19.5 billion, translating to minus 0.5% to +1.0% Y/Y and constant currency (cc) terms. This includes approximately 70 bps of inorganic contribution versus prior guidance of \"up to around 100 bps\".","cleaned_content":"us headquartered information technology and professional services firm cognizant technology solutions cognizant posted a \u003cTWO_TEN_PERCENT\u003e year on year yoy growth in net profit at \u003cFIVE_HUNDRED\u003e million year on year yoy for the second quarter ending june \u003cTWO_THOUSAND\u003e sequentially the net profit grew \u003cTHREE_PERCENT\u003e from \u003cFIVE_HUNDRED\u003e million in the previous quarter revenue for the nasdaq listed technology major came in at the higher end of its guided range at \u003cFOUR_\u003e billion almost flat or marginally lower by \u003cZERO_PERCENT\u003e yoy from \u003cFOUR_\u003e billion a year ago quarter and \u003cONE_PERCENT\u003e higher quarter on quarter qoq from \u003cFOUR_\u003e billion in the march quarter in q1 the company had given revenue guidance for q2 in the range of \u003cFOUR_\u003e to \u003cFOUR_\u003e billion in the second quarter we delivered revenue above the high end of our guidance range expanded adjusted operating margin and maintained our large deal momentum progress against our strategic priorities is opening new opportunities with clients and allowing us to operate with greater agility said ravi kumar s chief executive officer cognizant whose majority of employees are based in india follows the calendar year cycle from january to december the global it major has increased its full year \u003cTWO_THOUSAND\u003e revenue guidance in the range of \u003cONE_TEN\u003e to \u003cONE_TEN\u003e billion translating to minus \u003cZERO_PERCENT\u003e to \u003cONE_PERCENT\u003e y y and constant currency cc terms this includes approximately \u003cSEVEN_TEN\u003e bps of inorganic contribution versus prior guidance of up to around \u003cONE_HUNDRED\u003e bps","timestamp":"2024-08-01T09:52:00+05:30","market_timestamp":"2024-08-01T09:52:00+05:30","off_market_hours":false}