{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-under-investigation-for-rs-32000-crore-in-gst-evasion/articleshow/112171866.cms","title":"Infosys under investigation for GST evasion of over Rs 32,000 crore","description":"IT services major Infosys is under the GST authorities' scanner for an alleged evasion of taxes worth Rs 32,000 cr, as per internal documents. The Directorate General of GST Intelligence states that as the company creates overseas branches to service clients as part of its agreement with the clients, those branches and the company are each treated as ‘distinct persons’ under the IGST Act.","content":"Infosys is being investigated by the Directorate General of GST Intelligence for the alleged evasion of over Rs 32000 crores in integrated goods and service tax, an internal document accessed by ET Prime shows.The time period of the evasion is from July 2017 to 2021-2022, the document dated 30th July 2024, says.The document states that Infosys is under the scanner for the ‘non-payment of IGST on import of services as recipient of services.’The DGGI states that as the company creates overseas branches to service clients as part of its agreement with the clients, those branches and the company are each treated as ‘distinct persons’ under the IGST Act.","cleaned_content":"infosys is being investigated by the directorate general of gst intelligence for the alleged evasion of over rs \u003cTHREE_TEN_THOUSAND\u003e crores in integrated goods and service tax an internal document accessed by et prime shows the time period of the evasion is from july \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e the document dated \u003cTHREE_TEN\u003e th july \u003cTWO_THOUSAND\u003e says the document states that infosys is under the scanner for the non payment of igst on import of services as recipient of services the dggi states that as the company creates overseas branches to service clients as part of its agreement with the clients those branches and the company are each treated as distinct persons under the igst act","timestamp":"2024-08-01T01:37:00+05:30","market_timestamp":"2024-08-01T09:15:00+05:30","off_market_hours":true}