{"url":"https://economictimes.indiatimes.com/tech/information-tech/intel-names-former-micron-vp-as-global-chief-operations-head/articleshow/112123780.cms","title":"Intel names former Micron VP as global chief operations head","description":"At Intel, where he will join on August 12, the Indian-born executive will also serve as the executive vice president and general manager of the Intel Foundry Manufacturing and Supply Chain.","content":"Global chip major Intel has appointed Indian-origin Naga Chandrasekaran as chief global operations officer, replacing company veteran Keyvan Esfarjani who has retired from the company after 30 years. “As we continue to build a globally resilient semiconductor supply chain and create the world’s first systems foundry for the AI era, Naga’s leadership will help us to accelerate our progress and capitalize on the significant long-term growth opportunities ahead,” Intel’s chief executive officer Pat Gelsinger said on his appointment. Chandrasekaran, a mechanical engineering degree holder from the University of Madras, joins Intel from Micron where he served as the senior vice president of technology development. At Intel, where he will join on August 12, the Indian-born executive will also serve as the executive vice president and general manager of the Intel Foundry Manufacturing and Supply Chain. Apart from these, Chandrasekaran will also be responsible for Intel Foundry’s worldwide manufacturing operations, including Fab Sort manufacturing, assembly test manufacturing, strategic planning for Intel Foundry, corporate quality assurance and supply chain, the company said.","cleaned_content":"global chip major intel has appointed indian origin naga chandrasekaran as chief global operations officer replacing company veteran keyvan esfarjani who has retired from the company after \u003cTHREE_TEN\u003e years as we continue to build a globally resilient semiconductor supply chain and create the world s first systems foundry for the ai era naga s leadership will help us to accelerate our progress and capitalize on the significant long term growth opportunities ahead intel s chief executive officer pat gelsinger said on his appointment chandrasekaran a mechanical engineering degree holder from the university of madras joins intel from micron where he served as the senior vice president of technology development at intel where he will join on august \u003cONE_TEN\u003e the indian born executive will also serve as the executive vice president and general manager of the intel foundry manufacturing and supply chain apart from these chandrasekaran will also be responsible for intel foundry s worldwide manufacturing operations including fab sort manufacturing assembly test manufacturing strategic planning for intel foundry corporate quality assurance and supply chain the company said","timestamp":"2024-07-30T09:12:00+05:30","market_timestamp":"2024-07-30T09:15:00+05:30","off_market_hours":true}