{"url":"https://economictimes.indiatimes.com/tech/information-tech/erd-companies-face-headwinds-in-new-twist/articleshow/112204266.cms","title":"ER\u0026D companies face headwinds in new twist","description":"After twelve consecutive quarters of growth, the cumulative workforce of five leading pure-play ER\u0026D companies fell to 77,560 by June, highlighting the industry's cyclical nature compared to technology outsourcing, which is now starting to create jobs and improve campus placements.","content":"For the first time in the past 12 quarters, the cumulative headcount at five major pureplay ER\u0026D (engineering, research and development) firms shrank to 77,560 at the end of June, spotlighting the industry's cyclicality differential with technology outsourcing that's finally beginning to add jobs – and a dash of much needed colour to pallid placements at engineering schools.The overall growth of ER\u0026D firms is still higher than IT services companies, but the trajectory of both segments have reversed in the recently concluded quarter.“Headcount growth has decelerated cumulatively for Indian pure-play ER\u0026D services companies,” Kotak Institutional Equities said in a post-earnings season note. “These companies have focused on better resource utilization and hiring trainees to optimize cost structures over the past year.”This headcount decline also comes at a time when IT services majors have announced reviving their campus recruitment programs in FY25. The Kotak note disclosed that the cumulative headcount for five ER\u0026D firms – Cyient, KPIT, LTTS, Tata Elxsi and Tata Technologies - fell for the first time in three years in the June quarter. Their aggregate staff base was 78,216 in the March quarter.Revenue growth at ER\u0026D firms has signalled weakness during their first quarterly earnings. Tata Technologies (services), LTTS (L\u0026T Technology Services), and Cyient (DET) reported revenue declines of 2.5-5% quarter on quarter (QoQ). Even IT major HCLTech’s ER\u0026D segment saw QoQ growth of negative 3.5% in the just concluded quarter. Even the segment’s margin fell by 314 bps QoQ (100 bps is one percent).","cleaned_content":"for the first time in the past \u003cONE_TEN\u003e quarters the cumulative headcount at five major pureplay er d engineering research and development firms shrank to \u003cSEVEN_TEN_THOUSAND\u003e at the end of june spotlighting the industrys cyclicality differential with technology outsourcing thats finally beginning to add jobs and a dash of much needed colour to pallid placements at engineering schools the overall growth of er d firms is still higher than it services companies but the trajectory of both segments have reversed in the recently concluded quarter headcount growth has decelerated cumulatively for indian pure play er d services companies kotak institutional equities said in a post earnings season note these companies have focused on better resource utilization and hiring trainees to optimize cost structures over the past year this headcount decline also comes at a time when it services majors have announced reviving their campus recruitment programs in fy25 the kotak note disclosed that the cumulative headcount for five er d firms cyient kpit ltts tata elxsi and tata technologies fell for the first time in three years in the june quarter their aggregate staff base was \u003cSEVEN_TEN_THOUSAND\u003e in the march quarter revenue growth at er d firms has signalled weakness during their first quarterly earnings tata technologies services ltts l t technology services and cyient det reported revenue declines of \u003cTWO_\u003e \u003cFIVE_PERCENT\u003e quarter on quarter qoq even it major hcltech s er d segment saw qoq growth of negative \u003cTHREE_PERCENT\u003e in the just concluded quarter even the segment s margin fell by \u003cTHREE_HUNDRED\u003e bps qoq \u003cONE_HUNDRED\u003e bps is one percent","timestamp":"2024-08-02T06:00:00+05:30","market_timestamp":"2024-08-02T09:15:00+05:30","off_market_hours":true}