{"url":"https://economictimes.indiatimes.com/tech/information-tech/nasscom-backs-infosys-says-rs-32000-crore-gst-notice-shows-lack-of-understanding-of-industry-model/articleshow/112196857.cms","title":"Nasscom backs Infosys; says Rs 32,000-crore GST notice shows lack of understanding of industry model","description":"IT services major Infosys is under the GST authorities' scanner for an alleged evasion of taxes worth Rs 32,000 cr, as per internal documents. The Directorate General of GST Intelligence states that as the company creates overseas branches to service clients as part of its agreement with the clients, those branches and the company are each treated as ‘distinct persons’ under the IGST Act.","content":"A day after Infosys acknowledged the receipt of a notice for alleged evasion of over Rs 32,000 crore ($3.8 billion) in integrated goods and services tax (IGST), industry body, nasscom said that the recent episode reflects GST enforcement mechanism’s lack of understanding of IT industry operating model. It added that it is not a case of ‘import of service’ by the head office from the branch, as made out to be.Nasscom in a statement said, “Recent media reports of a GST demand of over Rs 320 billion reflects a lack of understanding of industry’s operating model. This is an industry wide issue, and multiple companies are facing avoidable litigation, uncertainty, concerns from investors and customers.”The issue at hand involves the applicability of GST through the reverse charge mechanism (RCM). GST enforcement authorities have been issuing notices for remittance by the Indian head office to its foreign branches for cases where there is no service between the head office and the foreign branch for this RCM, ignoring that this is not a case of ‘import of service’ by the head office from the branch, added nasscom.The association stated, “Accelerating services exports is key to India’s ambition of Viksit Bharat and attracting global tech investment to India. This requires a supportive policy environment and ease of doing business. The government circulars issued based on recommendations of the GST Council must be honoured in enforcement mechanisms so that notices do not create uncertainty and negatively impact perceptions on India’s ease of doing business. It is crucial that compliances obligations are not subject to multiple interpretations.”This is not a new problem and courts have been ruling in favour of the industry in these cases, said the industry body. “This issue was even addressed during the erstwhile service tax law, where favourable judgments were delivered by the Customs, Excise and Service Tax Appellate Tribunal (CESTAT). The Karnataka High Court has stayed a show cause notice in a similar case for a large IT company.”","cleaned_content":"a day after infosys acknowledged the receipt of a notice for alleged evasion of over rs \u003cTHREE_TEN_THOUSAND\u003e crore \u003cTHREE_\u003e billion in integrated goods and services tax igst industry body nasscom said that the recent episode reflects gst enforcement mechanism s lack of understanding of it industry operating model it added that it is not a case of import of service by the head office from the branch as made out to be nasscom in a statement said recent media reports of a gst demand of over rs \u003cTHREE_HUNDRED\u003e billion reflects a lack of understanding of industry s operating model this is an industry wide issue and multiple companies are facing avoidable litigation uncertainty concerns from investors and customers the issue at hand involves the applicability of gst through the reverse charge mechanism rcm gst enforcement authorities have been issuing notices for remittance by the indian head office to its foreign branches for cases where there is no service between the head office and the foreign branch for this rcm ignoring that this is not a case of import of service by the head office from the branch added nasscom the association stated accelerating services exports is key to india s ambition of viksit bharat and attracting global tech investment to india this requires a supportive policy environment and ease of doing business the government circulars issued based on recommendations of the gst council must be honoured in enforcement mechanisms so that notices do not create uncertainty and negatively impact perceptions on india s ease of doing business it is crucial that compliances obligations are not subject to multiple interpretations this is not a new problem and courts have been ruling in favour of the industry in these cases said the industry body this issue was even addressed during the erstwhile service tax law where favourable judgments were delivered by the customs excise and service tax appellate tribunal cestat the karnataka high court has stayed a show cause notice in a similar case for a large it company","timestamp":"2024-08-01T17:02:00+05:30","market_timestamp":"2024-08-02T09:15:00+05:30","off_market_hours":true}