{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firms-q1-job-data-suggest-they-may-end-fy25-with-higher-headcount/articleshow/112145352.cms","title":"IT firms’ Q1 job data suggest they may end FY25 with higher headcount","description":"​​The number of aggregate employees at Tata Consultancy Services, Infosys, Wipro, HCLTech and Tech Mahindra dropped by 2,034 sequentially in the first quarter ended June 30, according to the quarterly data they announced in July. Three of the companies — TCS, Wipro and Tech Mahindra — registered net additions in headcount.","content":"Headcount at India’s top five IT services providers fell for the seventh straight quarter, but a slowdown in the pace of the decline in the April-June period raised optimism about the companies ending the fiscal year with an expanded employee count.The number of aggregate employees at Tata Consultancy Services, Infosys, Wipro, HCLTech and Tech Mahindra dropped by 2,034 sequentially in the first quarter ended June 30, according to the quarterly data they announced in July. Three of the companies — TCS, Wipro and Tech Mahindra — registered net additions in headcount.“The gradual slowdown of the degrowth with the quantum of the headcount drop reducing over the last five quarters is a positive movement,” said Deepti S, business head of technology staff augmentation at Xpheno, a specialist staffing company.With three of the top five ending the quarter with an increase in headcount, the prospects for the onset of a recovery are high this fiscal year, she added.","cleaned_content":"headcount at india s top five it services providers fell for the seventh straight quarter but a slowdown in the pace of the decline in the april june period raised optimism about the companies ending the fiscal year with an expanded employee count the number of aggregate employees at tata consultancy services infosys wipro hcltech and tech mahindra dropped by \u003cTWO_THOUSAND\u003e sequentially in the first quarter ended june \u003cTHREE_TEN\u003e according to the quarterly data they announced in july three of the companies tcs wipro and tech mahindra registered net additions in headcount the gradual slowdown of the degrowth with the quantum of the headcount drop reducing over the last five quarters is a positive movement said deepti s business head of technology staff augmentation at xpheno a specialist staffing company with three of the top five ending the quarter with an increase in headcount the prospects for the onset of a recovery are high this fiscal year she added","timestamp":"2024-07-31T00:12:00+05:30","market_timestamp":"2024-07-31T09:15:00+05:30","off_market_hours":true}