{"url":"https://economictimes.indiatimes.com/tech/technology/iran-hackers-target-harris-and-trump-campaigns-google/articleshow/112556662.cms","title":"Iran hackers target Harris and Trump campaigns: Google","description":"Democratic presidential candidate Kamala Harris's campaign said Tuesday it had been targeted by foreign hackers, days after rival Donald Trump's campaign suggested that Iran had hacked it. Google's threat analysis group continues to see unsuccessful attempts from APT42 to compromise personal accounts of individuals affiliated with President Joe Biden, Vice President Harris and Trump, the report said.","content":"Google on Tuesday confirmed that hackers backed by Iran are targeting the campaigns of US presidential rivals Kamala Harris and Donald Trump.A hacker group known as \"APT42\" linked to Iran's Islamic Revolutionary Guard Corps went after high-profile individuals and organizations in Israel and the United States, including government officials and political campaigns, according to a threat report released by Google.Democratic presidential candidate Kamala Harris's campaign said Tuesday it had been targeted by foreign hackers, days after rival Donald Trump's campaign suggested that it had been hacked by Iran.\"In July, the campaign legal and security teams were notified by the FBI that we were targeted by a foreign actor influence operation,\" a Harris campaign official told AFP.\"We have robust cybersecurity measures in place and are not aware of any security breaches of our systems resulting from those efforts.\" ","cleaned_content":"google on tuesday confirmed that hackers backed by iran are targeting the campaigns of us presidential rivals kamala harris and donald trump a hacker group known as apt42 linked to irans islamic revolutionary guard corps went after high profile individuals and organizations in israel and the united states including government officials and political campaigns according to a threat report released by google democratic presidential candidate kamala harriss campaign said tuesday it had been targeted by foreign hackers days after rival donald trumps campaign suggested that it had been hacked by iran in july the campaign legal and security teams were notified by the fbi that we were targeted by a foreign actor influence operation a harris campaign official told afp we have robust cybersecurity measures in place and are not aware of any security breaches of our systems resulting from those efforts","timestamp":"2024-08-16T09:39:00+05:30","market_timestamp":"2024-08-16T09:39:00+05:30","off_market_hours":false}