{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-showcases-its-tech-power-before-investors-analysts/articleshow/112485612.cms","title":"TCS showcases its tech power before investors, analysts","description":"Held at TCS Banyan Park on Friday, the event was attended by around 30 analysts and investors. It was hosted by TCS’s senior management and the technology team, led by chief technology officer Dr Harrick Vin. The meeting was also attended by the company’s chief executive K Krithivasan, chief financial officer Samir Seksaria, all the presidents, unit heads, and sell-side analysts.","content":"From autonomous driving and SDV (software defined vehicle) to predictive maintenance, to using artificial intelligence (AI) to upgrade legacy coding and architecture, IT bellwether Tata Consultancy Services (TCS) is exploring all possibilities to capitalise the wave of new technologies including generative AI (GenAI), it told a select group of analysts in a closed-door analyst meet in Mumbai, sources told ET.Organised at the TCS Banyan Park in suburban Mumbai on Friday for a presentation followed by dinner, the jamboree had a presence of around 30 analysts and investors. It was hosted by the TCS senior management and the technology team led by chief technology officer Dr Harrick Vin. The meeting was attended by the company’s chief executive K Krithivasan, chief financial officer Samir Seksaria, all presidents, unit heads and sell-side analysts.“The executives took us through all their work, how GenAI is being used internally and externally, what they are doing around AI and latest technologies. A walk around their facilities, the work they are doing in the niche and newer areas – automotive engineering R\u0026D (research \u0026 development), SDV, autonomous vehicle; the AI and GenAI work in the areas of logistics, supply chain, their new IPs (intellectual property) and other research-led work,” said one of the analysts present there on the condition of anonymity.The gathering was also to celebrate the 20 years of public listing of TCS which happened on 25 August 2004. TCS shares had listed at a premium of over 26.6% at Rs 1,076 apiece on the BSE. On Monday, the stock ended at Rs 4196.10.Another analyst said the last time TCS held such a meet was in 2016, close to the launch of its automation platform ignio, which marked the advent of digitisation and automation cycle.","cleaned_content":"from autonomous driving and sdv software defined vehicle to predictive maintenance to using artificial intelligence ai to upgrade legacy coding and architecture it bellwether tata consultancy services tcs is exploring all possibilities to capitalise the wave of new technologies including generative ai genai it told a select group of analysts in a closed door analyst meet in mumbai sources told et organised at the tcs banyan park in suburban mumbai on friday for a presentation followed by dinner the jamboree had a presence of around \u003cTHREE_TEN\u003e analysts and investors it was hosted by the tcs senior management and the technology team led by chief technology officer dr harrick vin the meeting was attended by the company s chief executive k krithivasan chief financial officer samir seksaria all presidents unit heads and sell side analysts the executives took us through all their work how genai is being used internally and externally what they are doing around ai and latest technologies a walk around their facilities the work they are doing in the niche and newer areas automotive engineering r d research development sdv autonomous vehicle the ai and genai work in the areas of logistics supply chain their new ips intellectual property and other research led work said one of the analysts present there on the condition of anonymity the gathering was also to celebrate the \u003cTWO_TEN\u003e years of public listing of tcs which happened on \u003cTWO_TEN\u003e august \u003cTWO_THOUSAND\u003e tcs shares had listed at a premium of over \u003cTWO_TEN_PERCENT\u003e at rs \u003cONE_THOUSAND\u003e apiece on the bse on monday the stock ended at rs \u003cFOUR_THOUSAND\u003e another analyst said the last time tcs held such a meet was in \u003cTWO_THOUSAND\u003e close to the launch of its automation platform ignio which marked the advent of digitisation and automation cycle","timestamp":"2024-08-13T11:27:00+05:30","market_timestamp":"2024-08-13T11:27:00+05:30","off_market_hours":false}