{"url":"https://economictimes.indiatimes.com/tech/technology/us-judge-delays-launch-of-sports-streaming-venture-from-disney-media-giants/articleshow/112580476.cms","title":"US judge delays launch of sports streaming venture from Disney, media giants","description":"In February, rival sports streaming service FuboTV sued the big media companies, accusing them of antitrust practices that would thwart competition and inflate prices for consumers. The judge found it is likely to succeed in its antitrust claims, and issued the injunction.","content":"A US judge on Friday temporarily blocked the launch of a new sports streaming service backed by three media giants, Walt Disney, Fox and Warner Bros Discovery, which aims to capture younger sports fans who do not watch games on TV. In February, rival sports streaming service FuboTV sued the big media companies, accusing them of antitrust practices that would thwart competition and inflate prices for consumers. The judge found it is likely to succeed in its antitrust claims, and issued the injunction.  The media companies had planned to launch Venu Sports, which would combine thousands of live professional and collegiate sporting events into a single app. The new service was scheduled to debut this fall. \"If the JV is allowed to launch, it will be the only option in the market for those television consumers who want to spend their money on multiple live sports channels they love to watch, but not on superfluous entertainment channels they do not,\" U.S. District Judge Margaret Garnett wrote. Venu's media partners could \"exercise near-monopolistic control\" over sports rights to prevent rivals from emerging, Garnett wrote, adding that the joint venture partners \"explicitly agreed to 'stay clear' of supporting another platform\" like Venu \"for at least the next three years.\"","cleaned_content":"a us judge on friday temporarily blocked the launch of a new sports streaming service backed by three media giants walt disney fox and warner bros discovery which aims to capture younger sports fans who do not watch games on tv in february rival sports streaming service fubotv sued the big media companies accusing them of antitrust practices that would thwart competition and inflate prices for consumers the judge found it is likely to succeed in its antitrust claims and issued the injunction the media companies had planned to launch venu sports which would combine thousands of live professional and collegiate sporting events into a single app the new service was scheduled to debut this fall if the jv is allowed to launch it will be the only option in the market for those television consumers who want to spend their money on multiple live sports channels they love to watch but not on superfluous entertainment channels they do not u s district judge margaret garnett wrote venus media partners could exercise near monopolistic control over sports rights to prevent rivals from emerging garnett wrote adding that the joint venture partners explicitly agreed to stay clear of supporting another platform like venu for at least the next three years","timestamp":"2024-08-17T08:37:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}