{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-hiring-likely-to-grow-by-8-5-by-next-year-as-demand-grows-report/articleshow/112430063.cms","title":"IT hiring likely to grow by 8.5% by next year as demand grows: report","description":"The demand for skilled IT talent is growing after a slow period late last year and early this year. Hiring is set to surge, with an estimated 8.5 per cent increase in job roles within the industry by next year, according to a report by Indeed, a global job matching and hiring platform and a subsidiary of Recruit Holdings.","content":"Mumbai, With IT companies gradually coming out of the slump and actively ramping up their hiring efforts, a report on Thursday said that recruitment is set to surge with an estimated 8.5 per cent increase in job roles within the industry by next year. The demand for skilled IT talent is growing after a slow period late last year and early this year. Hiring is set to surge, with an estimated 8.5 per cent increase in job roles within the industry by next year, according to a report by Indeed, a global job matching and hiring platform and a subsidiary of Recruit Holdings.  This data from Indeed has been compiled from Indeed Hiring Tracker and Indeedas platform data. Indeed Hiring Tracker is a quarterly report that explores the employment landscape and job market.  The report further revealed that almost 70 per cent of all tech jobs currently on the Indeed platform are for software roles.  The dominance of software roles on Indeed is driven by the rapid adoption of technologies by companies like AI, machine learning, and blockchain which has further amplified the need for specialised software development, the report stated.  The thriving tech startup ecosystem also plays a significant role, as new ventures prioritise hiring developers to build and scale their products, it said. ","cleaned_content":"mumbai with it companies gradually coming out of the slump and actively ramping up their hiring efforts a report on thursday said that recruitment is set to surge with an estimated \u003cEIGHT_PERCENT\u003e increase in job roles within the industry by next year the demand for skilled it talent is growing after a slow period late last year and early this year hiring is set to surge with an estimated \u003cEIGHT_PERCENT\u003e increase in job roles within the industry by next year according to a report by indeed a global job matching and hiring platform and a subsidiary of recruit holdings this data from indeed has been compiled from indeed hiring tracker and indeedas platform data indeed hiring tracker is a quarterly report that explores the employment landscape and job market the report further revealed that almost \u003cSEVEN_TEN_PERCENT\u003e of all tech jobs currently on the indeed platform are for software roles the dominance of software roles on indeed is driven by the rapid adoption of technologies by companies like ai machine learning and blockchain which has further amplified the need for specialised software development the report stated the thriving tech startup ecosystem also plays a significant role as new ventures prioritise hiring developers to build and scale their products it said","timestamp":"2024-08-10T20:05:00+05:30","market_timestamp":"2024-08-12T09:15:00+05:30","off_market_hours":true}