{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-looks-to-tech-on-more-than-making-smartphones/articleshow/112595096.cms","title":"Foxconn looks to tech on more than making smartphones","description":"Taiwanese contract manufacturer Foxconn's chairman Young Liu told ET, that the company is looking at setting up townships in Tamil Nadu, replicating its model in countries like Taiwan and China. “We have been doing this in many different countries,” he explained. Liu said, Taiwan can become India’s “most trusted and reliable partner” and that Foxconn is looking to position itself in that way.","content":"Taiwanese contract manufacturer Foxconn is looking to move up the value chain to go beyond smartphones and make products for sectors like information and communication technology (ICT), electric vehicles (EV), batteries as part of their EV strategy and digital health in its next phase of growth in India, its chairman Young Liu told ET on Saturday.“Foxconn is very well known for its vertical integration capabilities. Definitely, we want to move up on the value chain as much as we can in India. That’s what we will be doing in the ICT sector,” Liu said on the sidelines of the inauguration of the company’s massive industrial housing project in Sriperumbudur. “For sectors other than ICT, we think (we will focus on) EVs and energy and also the digital health industry, like wearables for personal use, home use type of medical devices,(and) in hospitals you can have cloud-based digital health systems,” he added.In the case of energy, Foxconn is looking to target batteries, which will be related to its larger EV strategy. Generative artificial intelligence (GenAI) will play a “very big part” in the company’s strategy as it makes “a lot of impossible things possible,” he said.Liu, who was awarded the Padma Bhushan this year, also said Foxconn is looking at setting up townships in Tamil Nadu, replicating its model in countries like Taiwan and China. “We have been doing this in many different countries,” he explained. “So, we are very used to this and we think this kind of township will eventually bring value not just to the employees but also to Foxconn and Foxconn’s customers because the efficiency will be much better.”So, are industrial parks and townships part of Foxconn’s expansion plans?","cleaned_content":"taiwanese contract manufacturer foxconn is looking to move up the value chain to go beyond smartphones and make products for sectors like information and communication technology ict electric vehicles ev batteries as part of their ev strategy and digital health in its next phase of growth in india its chairman young liu told et on saturday foxconn is very well known for its vertical integration capabilities definitely we want to move up on the value chain as much as we can in india that s what we will be doing in the ict sector liu said on the sidelines of the inauguration of the company s massive industrial housing project in sriperumbudur for sectors other than ict we think we will focus on evs and energy and also the digital health industry like wearables for personal use home use type of medical devices and in hospitals you can have cloud based digital health systems he added in the case of energy foxconn is looking to target batteries which will be related to its larger ev strategy generative artificial intelligence genai will play a very big part in the company s strategy as it makes a lot of impossible things possible he said liu who was awarded the padma bhushan this year also said foxconn is looking at setting up townships in tamil nadu replicating its model in countries like taiwan and china we have been doing this in many different countries he explained so we are very used to this and we think this kind of township will eventually bring value not just to the employees but also to foxconn and foxconn s customers because the efficiency will be much better so are industrial parks and townships part of foxconn s expansion plans","timestamp":"2024-08-18T06:00:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}