{"url":"https://economictimes.indiatimes.com/tech/technology/injunction-against-california-law-on-childrens-online-safety-narrowed/articleshow/112581306.cms","title":"Injunction against California law on children's online safety narrowed","description":"The law, the California Age-Appropriate Design Code Act required platforms, before releasing any online products and services, to assess whether their offerings could harm children.","content":"A federal appeals court on Friday narrowed an injunction that blocked California from enforcing a law meant to protect children when they use the internet, while agreeing that part of the law would likely be found unconstitutional. The 9th US Circuit Court of Appeals said NetChoice, a trade group was likely to show that the California Age-Appropriate Design Code Act violated the First Amendment by requiring businesses to opine on and reduce the risk that children may face harmful materials online. But the court set aside the rest of the preliminary injunction, saying the judge who imposed it failed to properly assess NetChoice's other objections, or whether the law could survive without the unconstitutional parts. NetChoice's members include Amazon.com, Alphabet's Google and Facebook parent Meta Platforms. The law, the California Age-Appropriate Design Code Act required platforms, before releasing any online products and services, to assess whether their offerings could harm children.","cleaned_content":"a federal appeals court on friday narrowed an injunction that blocked california from enforcing a law meant to protect children when they use the internet while agreeing that part of the law would likely be found unconstitutional the \u003cNINE_\u003e th us circuit court of appeals said netchoice a trade group was likely to show that the california age appropriate design code act violated the first amendment by requiring businesses to opine on and reduce the risk that children may face harmful materials online but the court set aside the rest of the preliminary injunction saying the judge who imposed it failed to properly assess netchoices other objections or whether the law could survive without the unconstitutional parts netchoices members include amazon com alphabets google and facebook parent meta platforms the law the california age appropriate design code act required platforms before releasing any online products and services to assess whether their offerings could harm children","timestamp":"2024-08-17T09:50:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}