{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-cto-subha-tatavarti-resigns-fourth-big-departure-from-delaporte-camp/articleshow/112472984.cms","title":"Wipro CTO Subha Tatavarti resigns, fourth big departure from 'Delaporte camp'","description":"Outgoing Wipro CTO Subha Tatavarti had joined Wipro in March 2021 under its former CEO Thierry Delaporte and operated out of San Francisco Bay Area. Tatavarti is the fourth big departure from the \"Delaporte camp\" since the appointment of new CEO Srini Pallia in April this year.","content":"Senior executive churn continued at IT giant Wipro Ltd which said its chief technology officer (CTO) Subha Tatavarti resigned on Monday and will be leaving with effect from close of business hours of August 16, 2024.\"Subha Tatavarti, Chief Technology Officer, resigned from the services of the Company to pursue opportunities outside Wipro,” Wipro said in a regulatory filing.Tatavarti had joined Wipro in March 2021 under its former CEO Thierry Delaporte and operated out of San Francisco Bay Area. Tatavarti is the fourth big departure from the \"Delaporte camp\" since the appointment of new CEO Srini Pallia in April this year.The CTO resignation comes following at least three senior executives quitting the company including the latest being Ajit Mahale who was the chief delivery officer. In May, its then chief operating officer (COO) Amit Choudhary and Anis Chenchah, the chief executive of APMEA (Asia Pacific, India, Middle East \u0026 Africa) Strategic Market Unit (SMU) resigned to pursue opportunities outside the organisation. Like Tatavarti, both Choudhary and Chencha joined Wipro when Delaporte was the CEO of Wipro.","cleaned_content":"senior executive churn continued at it giant wipro ltd which said its chief technology officer cto subha tatavarti resigned on monday and will be leaving with effect from close of business hours of august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e subha tatavarti chief technology officer resigned from the services of the company to pursue opportunities outside wipro wipro said in a regulatory filing tatavarti had joined wipro in march \u003cTWO_THOUSAND\u003e under its former ceo thierry delaporte and operated out of san francisco bay area tatavarti is the fourth big departure from the delaporte camp since the appointment of new ceo srini pallia in april this year the cto resignation comes following at least three senior executives quitting the company including the latest being ajit mahale who was the chief delivery officer in may its then chief operating officer coo amit choudhary and anis chenchah the chief executive of apmea asia pacific india middle east africa strategic market unit smu resigned to pursue opportunities outside the organisation like tatavarti both choudhary and chencha joined wipro when delaporte was the ceo of wipro","timestamp":"2024-08-12T20:28:00+05:30","market_timestamp":"2024-08-13T09:15:00+05:30","off_market_hours":true}