{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-chairman-young-liu-arrives-in-bengaluru-to-inspect-300-acre-iphone-assembly-plant-tomorrow/articleshow/112572472.cms","title":"Foxconn chairman Young Liu arrives in Bengaluru, to inspect 300-acre iPhone assembly plant tomorrow","description":"Industries Minister MB Patil and Electronics, IT/BT Minister Priyank Kharge received Liu at the airport earlier in the day. Liu will, accompanied by top officials, inspect the progress of the upcoming facility on Saturday.","content":"Foxconn Technology Group chairman Young Liu arrived in Bengaluru on Friday and is scheduled on Saturday to visit a facility that the Taiwanese contract manufacturer is building near the Kempegowda International Airport to assemble Apple’s iPhone.This is the high-profile CEO's first visit to Bengaluru after Foxconn (Hon Hai Precision Industry Co Ltd) signed a memorandum of understanding with the state government last year. The government had, in March last year, cleared Foxconn's proposal to invest $1 billion to set up the iPhone factory. The world's largest electronics manufacturer later increased the investment plan by an additional $1.7 billion.Industries minister MB Patil and electronics and IT/BT minister Priyank Kharge received Liu at the airport Friday.Chief minister Siddaramaiah and deputy CM DK Shivakumar later hosted a dinner for Liu.","cleaned_content":"foxconn technology group chairman young liu arrived in bengaluru on friday and is scheduled on saturday to visit a facility that the taiwanese contract manufacturer is building near the kempegowda international airport to assemble apple s iphone this is the high profile ceos first visit to bengaluru after foxconn hon hai precision industry co ltd signed a memorandum of understanding with the state government last year the government had in march last year cleared foxconns proposal to invest \u003cONE_\u003e billion to set up the iphone factory the worlds largest electronics manufacturer later increased the investment plan by an additional \u003cONE_\u003e billion industries minister mb patil and electronics and it bt minister priyank kharge received liu at the airport friday chief minister siddaramaiah and deputy cm dk shivakumar later hosted a dinner for liu","timestamp":"2024-08-17T07:44:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}