{"url":"https://economictimes.indiatimes.com/tech/technology/crypto-democrats-rally-behind-harris-campaign-in-push-for-policy-revamp/articleshow/112555352.cms","title":"Crypto Democrats rally behind Harris campaign in push for policy revamp","description":"On Wednesday night, the new group Crypto4Harris convened its first virtual gathering to discuss how it can support the Vice President's electoral campaign, while also calling for Harris to end the Biden administration's crackdown on the cryptocurrency industry.","content":"Billionaire Mark Cuban, Wall Street financier Anthony Scaramucci and congressman Adam Schiff were among a group of cryptocurrency advocates who called on Kamala Harris to reset the Democratic party's policy on digital assets ahead of the November election.  On Wednesday night, the new group Crypto4Harris convened its first virtual gathering to discuss how it can support the Vice President's electoral campaign, while also calling for Harris to end the Biden administration's crackdown on the cryptocurrency industry.  In a sign of how urgently crypto has become an election issue for Democrats, Senate Majority Leader Chuck Schumer appeared and said he wanted to pass a crypto bill this year, without elaborating. \"We cannot afford to continue to sit on the sidelines because then we risk crypto going overseas,\" he said.  The group also said it is planning nationwide grassroots fundraisers in September to support Harris. ","cleaned_content":"billionaire mark cuban wall street financier anthony scaramucci and congressman adam schiff were among a group of cryptocurrency advocates who called on kamala harris to reset the democratic partys policy on digital assets ahead of the november election on wednesday night the new group crypto4harris convened its first virtual gathering to discuss how it can support the vice presidents electoral campaign while also calling for harris to end the biden administrations crackdown on the cryptocurrency industry in a sign of how urgently crypto has become an election issue for democrats senate majority leader chuck schumer appeared and said he wanted to pass a crypto bill this year without elaborating we cannot afford to continue to sit on the sidelines because then we risk crypto going overseas he said the group also said it is planning nationwide grassroots fundraisers in september to support harris","timestamp":"2024-08-16T08:30:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}