{"url":"https://economictimes.indiatimes.com/tech/technology/te-connectivity-settles-with-us-for-illegally-shipping-components-to-chinese-entities/articleshow/112560732.cms","title":"TE Connectivity settles with US for illegally shipping components to Chinese entities","description":"The US imposed sweeping export controls on US technology and added hundreds of Chinese parties to its export control list in recent years to limit China's ability to strengthen its military in ways that threaten US national security.","content":"Global electronics company TE Connectivity has agreed to pay $5.8 million to settle with the U.S. Department of Commerce for illegally shipping items to parties tied to Chinese hypersonics, drone and military electronics programs. TE Connectivity violated US export control laws 79 times between 2015 and 2019, mostly by shipping wires, circuit-board connectors and other low-level items to restricted customers, the Commerce Department said in a statement on Thursday. The US imposed sweeping export controls on US technology and added hundreds of Chinese parties to its export control list in recent years to limit China's ability to strengthen its military in ways that threaten US national security. Switzerland-based TE Connectivity, the Pennsylvania and Hong Kong units of which were named in the settlement agreement, voluntarily disclosed violations of those controls to the Commerce Department's Bureau of Industry and Security (BIS) after they discovered them, the department and company said. The department's investigation found TE exported $1.74 million worth of items to Chinese parties on its restricted \"Entity List,\" among other violations. Company representatives in China concealed and disguised certain customers, such as state-owned military corporations, the department said.","cleaned_content":"global electronics company te connectivity has agreed to pay \u003cFIVE_\u003e million to settle with the u s department of commerce for illegally shipping items to parties tied to chinese hypersonics drone and military electronics programs te connectivity violated us export control laws \u003cSEVEN_TEN\u003e times between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e mostly by shipping wires circuit board connectors and other low level items to restricted customers the commerce department said in a statement on thursday the us imposed sweeping export controls on us technology and added hundreds of chinese parties to its export control list in recent years to limit chinas ability to strengthen its military in ways that threaten us national security switzerland based te connectivity the pennsylvania and hong kong units of which were named in the settlement agreement voluntarily disclosed violations of those controls to the commerce departments bureau of industry and security bis after they discovered them the department and company said the departments investigation found te exported \u003cONE_\u003e million worth of items to chinese parties on its restricted entity list among other violations company representatives in china concealed and disguised certain customers such as state owned military corporations the department said","timestamp":"2024-08-16T12:26:00+05:30","market_timestamp":"2024-08-16T12:26:00+05:30","off_market_hours":false}