{"url":"https://economictimes.indiatimes.com/tech/technology/deep-tech-has-widened-there-are-newer-areas-for-us-to-build-arjun-rao/articleshow/112594706.cms","title":"“Deep tech has widened, there are newer areas for us to build”: Arjun Rao","description":"\"The definition of deep tech has evolved. Earlier, there were EVs, space tech, software, infrastructure, cloud, data, AI. Now, deep tech has widened. There are newer areas for us to build. Academia has become a very strong source of research ideas, leading to product startups and commercialisation.\" said Arjun Rao, partner, Speciale Invest.","content":"Chennai-based Speciale Invest is a go-to venture capital firm for founders starting up in deep tech and space. Investing in such enterprises is not easy as it requires a deep understanding of sciences and a long investment horizon. Some of the companies it has invested in like CynLr, Ultraviolette and Agnikul are moving into the monetisation stage, and Speciale Invest is looking for the next big thing, says Arjun Rao, partner, Speciale Invest, in an interview with ET. Edited excerpts:When you started, there was little institutional money for deep tech in India. Things have changed. Has your approach changed too?Our initial thesis was that there is talent in the country for developing deep tech. From a demand perspective, there are enough problems to be solved, which will require deep tech companies to be built over the next decade and longer.The definition of deep tech has evolved. Earlier, there were EVs, space tech, software, infrastructure, cloud, data, AI. Now, deep tech has widened. There are newer areas for us to build. We have an early-mover advantage, but the challenge is in maintaining that advantage. Academia has become a very strong source of research ideas, leading to product startups and commercialisation.So, the time spent on academia as a source of deal flow is a critical change. Another is that great founders tend to come from R\u0026D teams of very good tech companies—both MNCs and domestic ones. We are constantly thinking about which company we should track for talent.","cleaned_content":"chennai based speciale invest is a go to venture capital firm for founders starting up in deep tech and space investing in such enterprises is not easy as it requires a deep understanding of sciences and a long investment horizon some of the companies it has invested in like cynlr ultraviolette and agnikul are moving into the monetisation stage and speciale invest is looking for the next big thing says arjun rao partner speciale invest in an interview with et edited excerpts when you started there was little institutional money for deep tech in india things have changed has your approach changed too our initial thesis was that there is talent in the country for developing deep tech from a demand perspective there are enough problems to be solved which will require deep tech companies to be built over the next decade and longer the definition of deep tech has evolved earlier there were evs space tech software infrastructure cloud data ai now deep tech has widened there are newer areas for us to build we have an early mover advantage but the challenge is in maintaining that advantage academia has become a very strong source of research ideas leading to product startups and commercialisation so the time spent on academia as a source of deal flow is a critical change another is that great founders tend to come from r d teams of very good tech companies both mncs and domestic ones we are constantly thinking about which company we should track for talent","timestamp":"2024-08-18T06:00:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}