{"url":"https://economictimes.indiatimes.com/tech/technology/singapores-grab-misses-quarterly-revenue-estimates-shares-drop/articleshow/112550240.cms","title":"Singapore's Grab misses quarterly revenue estimates, shares drop","description":"Grab Holdings failed to meet second-quarter revenue predictions, affected by a slowdown in its food-delivery segment and currency fluctuations. The company's deliveries and ride-share revenues grew but did not meet expectations. Despite these challenges, Grab retained its full-year revenue forecast, signaling confidence in future growth through investments in new products.","content":"Grab Holdings missed second-quarter revenue estimates due to slower growth in its mainstay food-delivery business and foreign exchange headwinds, sending its U.S.-listed shares down 5% on Thursday. Growth has been slowing at the Southeast Asian tech company after the pandemic-era surge in food-delivery demand, with Grab laying off 11% of its workforce last year in a major restructuring aimed at narrowing losses. Sales from the deliveries business - its largest - grew 11% to $356 million, lower than Visible Alpha estimates of $362.1 million. That compares to growth of 19% in the first quarter, and a doubling of the business in certain quarters of 2023 and 2022. Ride-share revenue grew a worse-than-expected 14%. Grab took a hit of more than 500 basis points on both revenue and gross merchandise value as Southeast Asian currencies weakened against the U.S. dollar in the recent past, CFO Peter Oey told Reuters.","cleaned_content":"grab holdings missed second quarter revenue estimates due to slower growth in its mainstay food delivery business and foreign exchange headwinds sending its u s listed shares down \u003cFIVE_PERCENT\u003e on thursday growth has been slowing at the southeast asian tech company after the pandemic era surge in food delivery demand with grab laying off \u003cONE_TEN_PERCENT\u003e of its workforce last year in a major restructuring aimed at narrowing losses sales from the deliveries business its largest grew \u003cONE_TEN_PERCENT\u003e to \u003cTHREE_HUNDRED\u003e million lower than visible alpha estimates of \u003cTHREE_HUNDRED\u003e million that compares to growth of \u003cONE_TEN_PERCENT\u003e in the first quarter and a doubling of the business in certain quarters of \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e ride share revenue grew a worse than expected \u003cONE_TEN_PERCENT\u003e grab took a hit of more than \u003cFIVE_HUNDRED\u003e basis points on both revenue and gross merchandise value as southeast asian currencies weakened against the u s dollar in the recent past cfo peter oey told reuters","timestamp":"2024-08-15T21:05:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}