{"url":"https://economictimes.indiatimes.com/tech/technology/robust-growth-ignites-rally-in-new-age-stocks/articleshow/112582588.cms","title":"Robust growth ignites rally in new-age stocks, 45% gains made in 6 months","description":"New-age stocks surged recently, thanks to higher revenue growth and increased profitability through reduced spending. The ET E-commerce Index rose 45% in six months. Shares of Zomato, Paytm, and PB Fintech showed notable gains. Foreign institutional investors significantly increased their stakes, supporting the growth of these companies.","content":"New-age stocks have made a strong comeback of late driven by robust revenue growth and improved profitability through reduced spending. Increased allocations by overseas funds and strong demand for recent public issues have further fuelled the rally. Analysts believe these stocks could continue to perform well so long as they sustain their growth momentum. The ET E-commerce Index, comprising 13 new-age companies, has surged 45% in the past six months, outperforming the 12% gain in the Nifty Index and the 8% rise in the Nifty IT Index.Shares of Zomato, PB Fintech, and One 97 Communications, the parent company of Paytm, have surged between 60% and 70% in six months, while Nykaa's promoter FSN E-Commerce Ventures and CarTrade Tech have gained 23% and 21%, respectively. Ola Electric, which debuted last Friday, has jumped 75% above its issue price.    ","cleaned_content":"new age stocks have made a strong comeback of late driven by robust revenue growth and improved profitability through reduced spending increased allocations by overseas funds and strong demand for recent public issues have further fuelled the rally analysts believe these stocks could continue to perform well so long as they sustain their growth momentum the et e commerce index comprising \u003cONE_TEN\u003e new age companies has surged \u003cFOUR_TEN_PERCENT\u003e in the past six months outperforming the \u003cONE_TEN_PERCENT\u003e gain in the nifty index and the \u003cEIGHT_PERCENT\u003e rise in the nifty it index shares of zomato pb fintech and one \u003cNINE_TEN\u003e communications the parent company of paytm have surged between \u003cSIX_TEN_PERCENT\u003e and \u003cSEVEN_TEN_PERCENT\u003e in six months while nykaas promoter fsn e commerce ventures and cartrade tech have gained \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively ola electric which debuted last friday has jumped \u003cSEVEN_TEN_PERCENT\u003e above its issue price","timestamp":"2024-08-17T10:13:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}