{"url":"https://economictimes.indiatimes.com/tech/technology/mobikwik-reports-net-profit-of-rs-14-crore-in-fy24-revenue-up-62/articleshow/112655568.cms","title":"Mobikwik reports net profit of Rs 14 crore in FY24, revenue up 62%","description":"Mobikwik, a Gurugram-based fintech, reported a net profit of Rs 14 crore in FY24, compared to a Rs 80.6 crore loss last year. Revenue increased 62% to Rs 875 crore. The company's lending expenses grew sharply. Mobikwik offers various financial services, including UPI and mobile wallet payments, and experienced a decline in new user additions in FY24.","content":"Gurugram-based fintech firm Mobikwik reported a net profit of Rs 14 crore in FY24, compared to a loss of Rs 80.6 crore a year ago. Its operational revenue jumped 62% on year to Rs 875 crore from Rs 539 crore in FY23. The company had reported a net profit in the first half of FY24 as well, and said it plans to maintain its profitable streak and continue showing strong financials.The company’s lending operational expenses shot up sharply during the year, rising 294% to Rs 270 crore from Rs 68.5 crore in FY23.Interestingly, its payment processing expenses -- core to any payment firm -- are now lower at Rs 200 crore. In the last one year, it grew at a slower pace from Rs 148 crore in FY23.Mobikwik has been focusing on building a larger financial services play with credit and mutual funds being offered along with UPI and mobile wallet payments. As per data from the National Payments Corporation of India, the firm processed around 9.1 million UPI payments in July.","cleaned_content":"gurugram based fintech firm mobikwik reported a net profit of rs \u003cONE_TEN\u003e crore in fy24 compared to a loss of rs \u003cEIGHT_TEN\u003e crore a year ago its operational revenue jumped \u003cSIX_TEN_PERCENT\u003e on year to rs \u003cEIGHT_HUNDRED\u003e crore from rs \u003cFIVE_HUNDRED\u003e crore in fy23 the company had reported a net profit in the first half of fy24 as well and said it plans to maintain its profitable streak and continue showing strong financials the company s lending operational expenses shot up sharply during the year rising \u003cTWO_HUNDRED_PERCENT\u003e to rs \u003cTWO_HUNDRED\u003e crore from rs \u003cSIX_TEN\u003e crore in fy23 interestingly its payment processing expenses core to any payment firm are now lower at rs \u003cTWO_HUNDRED\u003e crore in the last one year it grew at a slower pace from rs \u003cONE_HUNDRED\u003e crore in fy23 mobikwik has been focusing on building a larger financial services play with credit and mutual funds being offered along with upi and mobile wallet payments as per data from the national payments corporation of india the firm processed around \u003cNINE_\u003e million upi payments in july","timestamp":"2024-08-20T18:00:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}