{"url":"https://economictimes.indiatimes.com/tech/technology/google-to-help-build-cyber-protection-for-australian-infrastructure/articleshow/112697024.cms","title":"Google to help build cyber protection for Australian infrastructure","description":"The Australian government has been imposing tougher requirements on critical infrastructure operators to report and prevent cyberattacks after a spate of breaches in the past two years left the personal information of half the country's 26 million population exposed. Google said the plan was part of its five-year commitment in 2021 to spend A$1 billion ($675 million) in Australia at a time when the country's push for tougher regulation of global tech firms had cooled relations with the U.S. firm.","content":"Google and Australia's national science agency said they will work together to develop software that automatically detects and fixes network vulnerabilities for operators of critical infrastructure, seeking to contend with a surge in cyberattacks. The software for organisations such as hospitals, defence bodies and energy suppliers will be customised to be in line with Australia's regulatory environment. \"Software supply chain vulnerabilities are a global issue, and Australia has led the way in legislative measures to control and combat the risks,\" said Stefan Avgoustakis, head of security practice for Google Cloud in Australia and New Zealand. The Australian government has been imposing tougher requirements on critical infrastructure operators to report and prevent cyberattacks after a spate of breaches in the past two years left the personal information of half the country's 26 million population exposed. The research partnership will pair up Google's existing open source vulnerability database and storage cloud with the Commonwealth Scientific and Industrial Research Organisation's (CSIRO) research methods, the parties said in a statement.","cleaned_content":"google and australias national science agency said they will work together to develop software that automatically detects and fixes network vulnerabilities for operators of critical infrastructure seeking to contend with a surge in cyberattacks the software for organisations such as hospitals defence bodies and energy suppliers will be customised to be in line with australias regulatory environment software supply chain vulnerabilities are a global issue and australia has led the way in legislative measures to control and combat the risks said stefan avgoustakis head of security practice for google cloud in australia and new zealand the australian government has been imposing tougher requirements on critical infrastructure operators to report and prevent cyberattacks after a spate of breaches in the past two years left the personal information of half the countrys \u003cTWO_TEN\u003e million population exposed the research partnership will pair up googles existing open source vulnerability database and storage cloud with the commonwealth scientific and industrial research organisations csiro research methods the parties said in a statement","timestamp":"2024-08-22T08:45:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}