{"url":"https://economictimes.indiatimes.com/tech/technology/how-to-avoid-online-scams-and-what-to-do-if-you-become-a-victim/articleshow/112617377.cms","title":"How to avoid online scams and what to do if you become a victim","description":"Some of the most damaging and costly scams involve what's known as \"social engineering.\" That's when fraudsters use time-tested techniques of deception and emotional manipulation, tricking people into divulging personal or financial information, or even granting remote access to their computers.","content":"Cybercrime is on the rise, but even the best antivirus software can't thwart scammers who target the human psyche. Some of the most damaging and costly scams involve what's known as \"social engineering.\" That's when fraudsters use time-tested techniques of deception and emotional manipulation, tricking people into divulging personal or financial information, or even granting remote access to their computers. This is what happened to Barry Heitin, a 76-year-old retired lawyer who lost roughly $740,000 to sophisticated swindlers impersonating bank and government officials. People of all ages and socioeconomic levels are potential targets, but older Americans are particularly vulnerable. They're more likely to have amassed savings, and they're perceived to be more isolated or perhaps less computer savvy. There are also more entry points for scammers now -- in our text messages, social media, dating sites or online groups. That silly personality quiz you just whizzed through on Facebook? It might have been created by fraudsters phishing for personal details.","cleaned_content":"cybercrime is on the rise but even the best antivirus software cant thwart scammers who target the human psyche some of the most damaging and costly scams involve whats known as social engineering thats when fraudsters use time tested techniques of deception and emotional manipulation tricking people into divulging personal or financial information or even granting remote access to their computers this is what happened to barry heitin a \u003cSEVEN_TEN\u003e year old retired lawyer who lost roughly \u003cSEVEN_HUNDRED_THOUSAND\u003e to sophisticated swindlers impersonating bank and government officials people of all ages and socioeconomic levels are potential targets but older americans are particularly vulnerable theyre more likely to have amassed savings and theyre perceived to be more isolated or perhaps less computer savvy there are also more entry points for scammers now in our text messages social media dating sites or online groups that silly personality quiz you just whizzed through on facebook it might have been created by fraudsters phishing for personal details","timestamp":"2024-08-19T08:32:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}