{"url":"https://economictimes.indiatimes.com/tech/technology/p2p-platforms-taking-on-the-lender-role-led-rbi-to-read-the-riot-act/articleshow/112670239.cms","title":"P2P platforms taking on the lender role led RBI to read the riot act","description":"Last week, the central bank issued a revised master circular on regulations for P2P lenders. It included barring them from credit enhancement, assuring guaranteed returns and prohibiting them from selling insurance products. It also said that the T+1 transactions mandate must be adhered to.","content":"MUMBAI: The Reserve Bank of India's (RBI) tightening of norms for P2P lenders comes after several of them were found to be having hundreds of crores of rupees in escrow accounts in violation of guidelines for the platform providers, said people familiar with the matter.Many of the lenders were interpreting the regulations liberally to suit their lending practices, forcing the regulator to come up with norms that clearly state that they can't assume the role of lending institutions, said those people familiar with the matter.\"P2P lenders were supposed to be just a platform, but they had taken up the role of lenders,\" said one of the persons familiar with the developments. \"They were taking funds and keeping the funds with them, which is not permitted.\"Last week, the central bank issued a revised master circular on regulations for P2P lenders. It included barring them from credit enhancement, assuring guaranteed returns and prohibiting them from selling insurance products. It also said that the T+1 transactions mandate must be adhered to.An RBI spokesman did not reply to queries seeking comments on whether P2P operators were keeping funds in violation of the regulatory guidelines.","cleaned_content":"mumbai the reserve bank of indias rbi tightening of norms for p2p lenders comes after several of them were found to be having hundreds of crores of rupees in escrow accounts in violation of guidelines for the platform providers said people familiar with the matter many of the lenders were interpreting the regulations liberally to suit their lending practices forcing the regulator to come up with norms that clearly state that they cant assume the role of lending institutions said those people familiar with the matter p2p lenders were supposed to be just a platform but they had taken up the role of lenders said one of the persons familiar with the developments they were taking funds and keeping the funds with them which is not permitted last week the central bank issued a revised master circular on regulations for p2p lenders it included barring them from credit enhancement assuring guaranteed returns and prohibiting them from selling insurance products it also said that the t \u003cONE_\u003e transactions mandate must be adhered to an rbi spokesman did not reply to queries seeking comments on whether p2p operators were keeping funds in violation of the regulatory guidelines","timestamp":"2024-08-21T00:54:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}