{"url":"https://economictimes.indiatimes.com/tech/technology/apple-to-update-eu-browser-options-make-more-apps-deletable/articleshow/112718786.cms","title":"Apple to update EU browser options, make more apps deletable","description":"Apple will introduce changes to its browser options and default app settings for users in the European Union. A new choice screen for selecting default browsers and a dedicated section for default apps will be introduced. Users will also be able to delete certain Apple-made apps, excluding essential ones.","content":"Apple will change how users choose browser options in the European Union, add a dedicated section for changing default apps, and make more apps deletable, the company said on Thursday. The iPhone maker came under pressure from regulators to make changes after the EU's sweeping Digital Markets Act took effect on March 7, forcing it to offer mobile users the ability to select from a list of available web browsers on a \"choice screen\" the first time they open Safari. In an update later this year, Apple users will be able to select a default browser directly from the choice screen after going through a mandatory list of options.  A randomly ordered list of 12 browsers per EU country will be shown to the user with short descriptions, and the chosen one will be automatically downloaded, Apple said. The choice screen will also be available on iPads through an update later this year. Apple released a previous update in response to the new rules in March, but browser companies criticized the design of its choice screen, and the Commission opened an investigation on March 25 saying it suspected that the measures fell short of effective compliance.","cleaned_content":"apple will change how users choose browser options in the european union add a dedicated section for changing default apps and make more apps deletable the company said on thursday the iphone maker came under pressure from regulators to make changes after the eus sweeping digital markets act took effect on march \u003cSEVEN_\u003e forcing it to offer mobile users the ability to select from a list of available web browsers on a choice screen the first time they open safari in an update later this year apple users will be able to select a default browser directly from the choice screen after going through a mandatory list of options a randomly ordered list of \u003cONE_TEN\u003e browsers per eu country will be shown to the user with short descriptions and the chosen one will be automatically downloaded apple said the choice screen will also be available on ipads through an update later this year apple released a previous update in response to the new rules in march but browser companies criticized the design of its choice screen and the commission opened an investigation on march \u003cTWO_TEN\u003e saying it suspected that the measures fell short of effective compliance","timestamp":"2024-08-22T22:17:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}