{"url":"https://economictimes.indiatimes.com/tech/technology/semiconductor-veteran-lip-bu-tan-exits-intels-board/articleshow/112725651.cms","title":"Semiconductor veteran Lip-Bu Tan exits Intel's board","description":"The news of Tan's departure comes at a challenging time for Intel, which recently forecast third-quarter revenue below market estimates and announced plans to cut more than 15% of its workforce, approximately 17,500 employees, and suspend its dividend starting in the fourth quarter.","content":"Intel's director Lip-Bu Tan, a semiconductor industry veteran brought in two years ago to help with the chipmaker's comeback effort, has stepped down from its board, the chipmaker disclosed in a filing on Thursday. Tan informed the company on Monday that he was resigning from the board effective immediately. The news of Tan's departure comes at a challenging time for Intel, which recently forecast third-quarter revenue below market estimates and announced plans to cut more than 15% of its workforce, approximately 17,500 employees, and suspend its dividend starting in the fourth quarter.  \"This is a personal decision based on a need to reprioritize various commitments, and I remain supportive of the company and its important work,\" Tan said in a statement. Tan, who has served as executive chair and CEO of Cadence Design Systems Inc, joined Intel's board in Sept. 2022.","cleaned_content":"intels director lip bu tan a semiconductor industry veteran brought in two years ago to help with the chipmakers comeback effort has stepped down from its board the chipmaker disclosed in a filing on thursday tan informed the company on monday that he was resigning from the board effective immediately the news of tans departure comes at a challenging time for intel which recently forecast third quarter revenue below market estimates and announced plans to cut more than \u003cONE_TEN_PERCENT\u003e of its workforce approximately \u003cONE_TEN_THOUSAND\u003e employees and suspend its dividend starting in the fourth quarter this is a personal decision based on a need to reprioritize various commitments and i remain supportive of the company and its important work tan said in a statement tan who has served as executive chair and ceo of cadence design systems inc joined intels board in sept \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-23T08:16:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}