{"url":"https://economictimes.indiatimes.com/tech/technology/energix-signs-long-term-solar-power-deal-with-google/articleshow/112674160.cms","title":"Energix signs long-term solar power deal with Google","description":"To power their rapidly expanding AI data centers, major technology firms like Google are increasingly negotiating electricity supply agreements with energy providers.","content":"Energix Renewables said on Tuesday it has signed a long term agreement with Alphabet's Google to supply electricity and renewable energy credits generated from its solar projects to the tech giant. To power their rapidly expanding AI data centers, major technology firms like Google are increasingly negotiating electricity supply agreements with energy providers. Energix will initially supply 1.5 gigawatt peak of solar project development until 2030, with an option to further expand the partnership. The tech giant will also offer tax equity, enabling the transfer of renewable energy credits under President Biden's Inflation Reduction Act, to Energix.  Under the act, corporate entities can acquire these credits, supporting the development of clean energy storage projects across the United States.","cleaned_content":"energix renewables said on tuesday it has signed a long term agreement with alphabets google to supply electricity and renewable energy credits generated from its solar projects to the tech giant to power their rapidly expanding ai data centers major technology firms like google are increasingly negotiating electricity supply agreements with energy providers energix will initially supply \u003cONE_\u003e gigawatt peak of solar project development until \u003cTWO_THOUSAND\u003e with an option to further expand the partnership the tech giant will also offer tax equity enabling the transfer of renewable energy credits under president bidens inflation reduction act to energix under the act corporate entities can acquire these credits supporting the development of clean energy storage projects across the united states","timestamp":"2024-08-21T12:29:00+05:30","market_timestamp":"2024-08-21T12:29:00+05:30","off_market_hours":false}