{"url":"https://economictimes.indiatimes.com/tech/technology/south-korea-us-kick-off-annual-drills-over-norths-military-cyber-threats/articleshow/112620536.cms","title":"South Korea, US kick off annual drills over North's military, cyber threats","description":"The drills will reflect \"realistic threats\" across all domains, including the North's missile threats but also GPS jamming, cyberattacks and other lessons learned from recent incidents, the two countries' militaries have said. South Korea will separately carry out the simultaneous government-led Ulchi civil defence drills, under the scenario of a nuclear attack by the North, officials said.","content":"South Korea and the United States kicked off annual summertime military exercises on Monday, seeking to boost their joint readiness to fend off North Korea's weapons and cyber threats.  The Ulchi Freedom Shield exercises, set to end on Aug. 29, come as North Korea races to advance its nuclear and missile programmes and tries to launch reconnaissance satellites. The drills will reflect \"realistic threats\" across all domains, including the North's missile threats but also GPS jamming, cyberattacks and other lessons learned from recent incidents, the two countries' militaries have said.  South Korea will separately carry out the simultaneous government-led Ulchi civil defence drills, under the scenario of a nuclear attack by the North, officials said.  South Korean President Yoon Suk Yeol urged thorough readiness posture against North Korea, calling it \"the most reckless and irrational country in the world. ","cleaned_content":"south korea and the united states kicked off annual summertime military exercises on monday seeking to boost their joint readiness to fend off north koreas weapons and cyber threats the ulchi freedom shield exercises set to end on aug \u003cTWO_TEN\u003e come as north korea races to advance its nuclear and missile programmes and tries to launch reconnaissance satellites the drills will reflect realistic threats across all domains including the norths missile threats but also gps jamming cyberattacks and other lessons learned from recent incidents the two countries militaries have said south korea will separately carry out the simultaneous government led ulchi civil defence drills under the scenario of a nuclear attack by the north officials said south korean president yoon suk yeol urged thorough readiness posture against north korea calling it the most reckless and irrational country in the world","timestamp":"2024-08-19T11:01:00+05:30","market_timestamp":"2024-08-19T11:01:00+05:30","off_market_hours":false}