{"url":"https://economictimes.indiatimes.com/tech/technology/growth-of-e-commerce-in-india-matter-of-concern-nothing-to-be-proud-of-says-piyush-goyal/articleshow/112673770.cms","title":"Growth of e-commerce in India 'matter of concern, nothing to be proud of', says Piyush Goyal","description":"Union Commerce Minister Piyush Goyal expressed concerns regarding the fast expansion of e-commerce in India, highlighting potential social disruptions. At a report launch, he stressed the need to evaluate the sector's broader impact on market dynamics and consumer behavior, even as the industry continues to grow.","content":"Raising concerns over the rapid expansion of e-commerce firms in India, Union Commerce Minister Piyush Goyal on Wednesday described it as a \"matter of concern\" rather than an achievement. Speaking at an event for the launch of a report on the 'Net Impact of E-Commerce on Employment and Consumer Welfare in India', Goyal raised questions about the potential social disruption that might follow this surge.\"Are we going to cause huge, social disruption with this massive growth of e-commerce? I don't see it as a matter of pride that half our market may become part of the e-commerce network 10 years from now; it is a matter of concern,” Goyal remarked.Also Read: Death of the kirana store: Will quick commerce quicken it?Meanwhile, the report shows online vendors have generated 15.8 million jobs in India, including 3.5 million for women, with about 1.76 million retail enterprises participating in e-commerce activity.","cleaned_content":"raising concerns over the rapid expansion of e commerce firms in india union commerce minister piyush goyal on wednesday described it as a matter of concern rather than an achievement speaking at an event for the launch of a report on the net impact of e commerce on employment and consumer welfare in india goyal raised questions about the potential social disruption that might follow this surge are we going to cause huge social disruption with this massive growth of e commerce i dont see it as a matter of pride that half our market may become part of the e commerce network \u003cONE_TEN\u003e years from now it is a matter of concern goyal remarked also read death of the kirana store will quick commerce quicken it meanwhile the report shows online vendors have generated \u003cONE_TEN\u003e million jobs in india including \u003cTHREE_\u003e million for women with about \u003cONE_\u003e million retail enterprises participating in e commerce activity","timestamp":"2024-08-21T18:02:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}