{"url":"https://economictimes.indiatimes.com/tech/technology/meta-platforms-strikes-geothermal-energy-deal-to-power-us-data-centers/articleshow/112825226.cms","title":"Meta Platforms strikes geothermal energy deal to power US data centers","description":"Meta has partnered with Sage Geosystems to acquire geothermal power for its U.S. data centers. The 150-megawatt project, set to commence by 2027, aims to support Meta's growing AI infrastructure. This collaboration signifies a substantial advancement in geothermal energy in the U.S., highlighting Meta's commitment to sustainable energy sources.","content":"Facebook owner Meta Platforms struck a deal to buy geothermal power from Sage Geosystems to supply its U.S. data centers, it said on Monday, as it races to build out the infrastructure to support its massive investments in energy-hungry artificial intelligence.  The first phase of the 150-megawatt project should be operational by 2027 and \"significantly\" expand the use of geothermal power in the United States, the social media company said. The location has yet to be determined, but the companies said it will be east of the Rocky Mountains. Financial terms of the deal were not disclosed. Geothermal power is a renewable energy source that uses the Earth's internal heat to produce electricity and heat water. One-hundred and fifty megawatts is roughly enough electricity to power 38,000 homes.  Meta's announcement, made as part of a U.S. Department of Energy event on geothermal development, comes as President Joe Biden's administration is asking big technology companies to invest in new clean power generation to cover their surging electricity demand.","cleaned_content":"facebook owner meta platforms struck a deal to buy geothermal power from sage geosystems to supply its u s data centers it said on monday as it races to build out the infrastructure to support its massive investments in energy hungry artificial intelligence the first phase of the \u003cONE_HUNDRED\u003e megawatt project should be operational by \u003cTWO_THOUSAND\u003e and significantly expand the use of geothermal power in the united states the social media company said the location has yet to be determined but the companies said it will be east of the rocky mountains financial terms of the deal were not disclosed geothermal power is a renewable energy source that uses the earths internal heat to produce electricity and heat water one hundred and fifty megawatts is roughly enough electricity to power \u003cTHREE_TEN_THOUSAND\u003e homes metas announcement made as part of a u s department of energy event on geothermal development comes as president joe bidens administration is asking big technology companies to invest in new clean power generation to cover their surging electricity demand","timestamp":"2024-08-27T10:57:00+05:30","market_timestamp":"2024-08-27T10:57:00+05:30","off_market_hours":false}