{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-scouting-for-acquisitions-more-buys-matching-in-tech-scale-possible-ceo-salil-parekh/articleshow/112780829.cms","title":"Infosys scouting for acquisitions; more buys matching 'in-tech' scale possible: CEO Salil Parekh","description":"In an interview to PTI, Infosys CEO Salil Parekh said the company is keen on acquisitions in areas like data analytics, SAAS, and may look at some geographies within Europe, and the US.","content":"After two acquisitions this year, India's second-largest IT services company Infosys is on the lookout to scoop-up more firms and says the acquisition matching scale of recent in-tech buy is certainly a possibility. In an interview to PTI, Infosys CEO Salil Parekh said the company is keen on acquisitions in areas like data analytics, SAAS, and may look at some geographies within Europe, and the US.  Asked if more acquisitions could be of the scale matching in-tech, which came with a price-tag of 450 million euros, Parekh said, \"Absolutely, I think those would be the size that we will look at in terms of scale, and given our structure we could do a few of those.\"  Back in January, Infosys announced a definitive agreement to acquire 100 per cent of the equity share capital in InSemi Technology Services, a semiconductor design services company headquartered in India, for a consideration (including earn-outs, and management incentives and retention bonuses) totalling up to Rs 280 crore.  A bigger acquisition followed in three months.  In April, Infosys Germany, a wholly-owned step-down subsidiary, entered into a definitive agreement to acquire 100 per cent of the equity share capital in in-tech Holding -- leading provider of engineering R\u0026D services headquartered in Germany -- for a consideration of up to 450 million euros (about Rs 4,045 crore). ","cleaned_content":"after two acquisitions this year indias second largest it services company infosys is on the lookout to scoop up more firms and says the acquisition matching scale of recent in tech buy is certainly a possibility in an interview to pti infosys ceo salil parekh said the company is keen on acquisitions in areas like data analytics saas and may look at some geographies within europe and the us asked if more acquisitions could be of the scale matching in tech which came with a price tag of \u003cFOUR_HUNDRED\u003e million euros parekh said absolutely i think those would be the size that we will look at in terms of scale and given our structure we could do a few of those back in january infosys announced a definitive agreement to acquire \u003cONE_HUNDRED_PERCENT\u003e of the equity share capital in insemi technology services a semiconductor design services company headquartered in india for a consideration including earn outs and management incentives and retention bonuses totalling up to rs \u003cTWO_HUNDRED\u003e crore a bigger acquisition followed in three months in april infosys germany a wholly owned step down subsidiary entered into a definitive agreement to acquire \u003cONE_HUNDRED_PERCENT\u003e of the equity share capital in in tech holding leading provider of engineering r d services headquartered in germany for a consideration of up to \u003cFOUR_HUNDRED\u003e million euros about rs \u003cFOUR_THOUSAND\u003e crore","timestamp":"2024-08-25T16:03:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}