{"url":"https://economictimes.indiatimes.com/tech/technology/premji-invest-ranjan-pai-look-to-invest-125-million-in-akasa-air/articleshow/112691109.cms","title":"Premji Invest, Ranjan Pai look to invest $125 million in Akasa Air","description":"Premji Invest and Claypond Capital discussed a $125 million investment for a minority stake in Akasa Air, valuing the airline at over $350 million. This funding would help Akasa expand and manage aircraft payments. The Jhunjhunwala family and CEO Vinay Dube's stakes will be partially diluted, with the Jhunjhunwala family remaining the largest shareholder.","content":"A consortium of Premji Invest and Claypond Capital, the family offices of Wipro’s Azim Premji and the Manipal Group’s Ranjan Pai, respectively, are in talks to invest about $125 million for a significant minority stake in Akasa Air, one of India’s newest airlines, people with knowledge of the matter said.The proposed funding values Akasa at over $350 million, which is more than four times the valuation at which the initial investment of around $35 million was made by the family of the late Rakesh Jhunjhunwala. It is a rare show of confidence in the prospects of Indian carriers that have historically struggled to attract interest.The consortium has engaged consultancy firm Alvarez \u0026 Marsal to conduct due diligence for the process, said the people cited above.The funds once raised will be used for furthering expansion and making pre-delivery payments for aircraft. It will also dilute the shareholding of the Jhunjhunwala family and that of cofounder and chief executive Vinay Dube. Together, they own over 65% stake in the company.The Jhunjhunwala family, which currently holds around 40% stake, will remain the largest shareholder, a person familiar with the details said.","cleaned_content":"a consortium of premji invest and claypond capital the family offices of wipro s azim premji and the manipal group s ranjan pai respectively are in talks to invest about \u003cONE_HUNDRED\u003e million for a significant minority stake in akasa air one of india s newest airlines people with knowledge of the matter said the proposed funding values akasa at over \u003cTHREE_HUNDRED\u003e million which is more than four times the valuation at which the initial investment of around \u003cTHREE_TEN\u003e million was made by the family of the late rakesh jhunjhunwala it is a rare show of confidence in the prospects of indian carriers that have historically struggled to attract interest the consortium has engaged consultancy firm alvarez marsal to conduct due diligence for the process said the people cited above the funds once raised will be used for furthering expansion and making pre delivery payments for aircraft it will also dilute the shareholding of the jhunjhunwala family and that of cofounder and chief executive vinay dube together they own over \u003cSIX_TEN_PERCENT\u003e stake in the company the jhunjhunwala family which currently holds around \u003cFOUR_TEN_PERCENT\u003e stake will remain the largest shareholder a person familiar with the details said","timestamp":"2024-08-22T09:24:00+05:30","market_timestamp":"2024-08-22T09:24:00+05:30","off_market_hours":false}