{"url":"https://economictimes.indiatimes.com/tech/technology/google-weighs-large-data-centre-in-vietnam-source-says-in-nations-first-by-us-big-tech/articleshow/112887532.cms","title":"Google weighs large data centre in Vietnam, in nation's first by US big tech","description":"Google is considering building a large data centre near Ho Chi Minh City in Vietnam. This would be the first major investment of its kind by a big U.S. tech company in the country. The data centre could be ready by 2027, driven by growing demand for digital services and Vietnam's expanding digital economy.","content":"By Phuong Nguyen and Francesco Guarascio HANOI - Alphabet's Google is considering building a large data centre in Vietnam, a person briefed on the plans said, in what would be the first such investment by a big U.S. technology company in the Southeast Asian nation. Google is weighing setting up a \"hyperscale\" data centre close to Ho Chi Minh City, Vietnam's southern economic hub, the source said, declining to be named because the information is not public. The investment, the size of which the source did not specify, would be a shot in the arm for Vietnam which has so far failed to attract major overseas capital in data centres due to its patchy infrastructure, with large tech companies preferring to house their centres in rival nations in the region. It was not clear how quickly Google will reach a decision on an investment but the source said internal talks are on and the data centre could be ready in 2027.","cleaned_content":"by phuong nguyen and francesco guarascio hanoi alphabets google is considering building a large data centre in vietnam a person briefed on the plans said in what would be the first such investment by a big u s technology company in the southeast asian nation google is weighing setting up a hyperscale data centre close to ho chi minh city vietnams southern economic hub the source said declining to be named because the information is not public the investment the size of which the source did not specify would be a shot in the arm for vietnam which has so far failed to attract major overseas capital in data centres due to its patchy infrastructure with large tech companies preferring to house their centres in rival nations in the region it was not clear how quickly google will reach a decision on an investment but the source said internal talks are on and the data centre could be ready in \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-29T12:14:00+05:30","market_timestamp":"2024-08-29T12:14:00+05:30","off_market_hours":false}