{"url":"https://economictimes.indiatimes.com/tech/technology/antfin-singapore-to-sell-zomato-shares-worth-408-million-via-block-deal-report/articleshow/112630245.cms","title":"Antfin Singapore to sell Zomato shares worth $408 million via block deal: Report","description":"Antfin currently holds 4.3% stake in the food delivery platform. At the floor price, the shares will be available for sale at a discount of 4.6% over Monday’s closing price of Rs 263.24 on the NSE. Zomato's shares rose 6% intraday following UBS's target price hike. The company posted a substantial increase in profit and revenue for the June quarter, doubling its market capitalization in 2024.","content":"Antfin Singapore will likely sell shares in Zomato worth $408 million at floor price of Rs 251.68 per share via block deal, ET Now reported quoting agencies. It currently holds 4.3% stake in the food delivery platform. At this price, the shares will be available for sale at a discount of 4.6% over Monday’s closing price of Rs 263.24 on the NSE. Zomato shares on Monday ended down by Rs 1.2 or 0.45% over Friday’s closing price after hitting a lifetime high of Rs 280.90.It is a developing story and more information on this is awaited. Zomato shares jumped 6% on Monday on the intraday basis following a raise in target price by global brokerage firm UBS from Rs 260 to Rs 320.\"We increase our GMV estimates for food delivery (+2-3%) and quick commerce (+20-30%) for FY26-28e following the strong Q1 and solid guidance. Our adj EBITDA estimates for the next 1-2 years are up only slightly as investments in building supply for quick commerce will likely result in a more modest margin trajectory,\" UBS said in a note while maintaining buy call.","cleaned_content":"antfin singapore will likely sell shares in zomato worth \u003cFOUR_HUNDRED\u003e million at floor price of rs \u003cTWO_HUNDRED\u003e per share via block deal et now reported quoting agencies it currently holds \u003cFOUR_PERCENT\u003e stake in the food delivery platform at this price the shares will be available for sale at a discount of \u003cFOUR_PERCENT\u003e over monday s closing price of rs \u003cTWO_HUNDRED\u003e on the nse zomato shares on monday ended down by rs \u003cONE_\u003e or \u003cZERO_PERCENT\u003e over friday s closing price after hitting a lifetime high of rs \u003cTWO_HUNDRED\u003e it is a developing story and more information on this is awaited zomato shares jumped \u003cSIX_PERCENT\u003e on monday on the intraday basis following a raise in target price by global brokerage firm ubs from rs \u003cTWO_HUNDRED\u003e to rs \u003cTHREE_HUNDRED\u003e we increase our gmv estimates for food delivery \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e and quick commerce \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e for fy26 \u003cTWO_TEN\u003e e following the strong q1 and solid guidance our adj ebitda estimates for the next \u003cONE_\u003e \u003cTWO_\u003e years are up only slightly as investments in building supply for quick commerce will likely result in a more modest margin trajectory ubs said in a note while maintaining buy call","timestamp":"2024-08-19T17:12:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}