{"url":"https://economictimes.indiatimes.com/tech/technology/australia-based-rea-opens-first-india-gcc-in-gurugram/articleshow/112854018.cms","title":"Australia-based REA opens first India GCC in Gurugram","description":"\"Our aim is to unlock the extensive Indian talent in data, cloud, AI and product development to build products for our users in Australia. REA cyber city teams will work directly with Australian teams on the group's leading products and platforms to shape and deliver experiences for millions of consumers every day across all stages of the property journey\", Maidment told ET.","content":"Australia-based digital real estate advertising company REA group, which is launching its first India global capability centre (GCC) in October, plans to increase its India headcount to 10% of its global workforce in the next two years, said Steve Maidment, chief technology officer at the firm.REA group, which also owns prop tech firms like Housing.com, Makaan.com and PropTiger.com in India though REA India, is setting up the new innovation centre in Gurugram cyber city.\"Our aim is to unlock the extensive Indian talent in data, cloud, AI and product development to build products for our users in Australia. REA cyber city teams will work directly with Australian teams on the group's leading products and platforms to shape and deliver experiences for millions of consumers every day across all stages of the property journey\", Maidment told ET.The firm will initially hire 70 highly skilled tech employees before its launch date.","cleaned_content":"australia based digital real estate advertising company rea group which is launching its first india global capability centre gcc in october plans to increase its india headcount to \u003cONE_TEN_PERCENT\u003e of its global workforce in the next two years said steve maidment chief technology officer at the firm rea group which also owns prop tech firms like housing com makaan com and proptiger com in india though rea india is setting up the new innovation centre in gurugram cyber city our aim is to unlock the extensive indian talent in data cloud ai and product development to build products for our users in australia rea cyber city teams will work directly with australian teams on the groups leading products and platforms to shape and deliver experiences for millions of consumers every day across all stages of the property journey maidment told et the firm will initially hire \u003cSEVEN_TEN\u003e highly skilled tech employees before its launch date","timestamp":"2024-08-28T10:02:00+05:30","market_timestamp":"2024-08-28T10:02:00+05:30","off_market_hours":false}