{"url":"https://economictimes.indiatimes.com/tech/technology/zoho-launches-payment-gateway/articleshow/112893394.cms","title":"Zoho forays into payments space; launches payment gateway for businesses","description":"Zoho Payments as a payment aggregator has been registered as a Bharat Bill Payment Operating Unit (BBPOU) with NBBL, enabling it to onboard buyers and sellers on the BBPS network and facilitate B2B Payments. Zoho Payments also provides businesses with the flexibility to accept and send payments through multiple modes like NEFT, RTGS, IMPS, UPI, cards and netbanking.","content":"Software-as-a-Service (SaaS) major Zoho on Thursday said it is entering the payments sector with the launch of Zoho Payments which is a unified payment solution to help businesses accept money online from their customers.This announcement, which was made along the sidelines of the Global Fintech Fest, also involves B2B payments capabilities that streamline invoice presentment and payments, powered by the Bharat Bill Payment System (BBPS) of NPCI Bharat BillPay Limited (NBBL). “At Zoho, we strongly believe that business finance, banking, and payments should work together,” Sivaramakrishnan Iswaran, Global Head of Finance and Operations BU, Zoho said in a statement. “Towards this vision, we had launched our ‘Connected Banking’ solution across our finance apps, integrating with leading banks. With the launch of Zoho Payments today, along with B2B payment capabilities, we are able to achieve our goal.\"He added that the BBPS standardises invoice presentment and payments, providing multiple payment modes, instant payment confirmations, invoice financing, and a unified platform for invoice transmission and reconciliation.\"This marks a major advancement in the fintech domain. As a result, we can now offer a more holistic financial management solution for businesses,\" Iswaran stated.","cleaned_content":"software as a service saas major zoho on thursday said it is entering the payments sector with the launch of zoho payments which is a unified payment solution to help businesses accept money online from their customers this announcement which was made along the sidelines of the global fintech fest also involves b2b payments capabilities that streamline invoice presentment and payments powered by the bharat bill payment system bbps of npci bharat billpay limited nbbl at zoho we strongly believe that business finance banking and payments should work together sivaramakrishnan iswaran global head of finance and operations bu zoho said in a statement towards this vision we had launched our connected banking solution across our finance apps integrating with leading banks with the launch of zoho payments today along with b2b payment capabilities we are able to achieve our goal he added that the bbps standardises invoice presentment and payments providing multiple payment modes instant payment confirmations invoice financing and a unified platform for invoice transmission and reconciliation this marks a major advancement in the fintech domain as a result we can now offer a more holistic financial management solution for businesses iswaran stated","timestamp":"2024-08-29T15:39:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}