{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-infuses-rs-1200-crore-in-karnataka-unit/articleshow/112740318.cms","title":"Foxconn infuses Rs 1,200 crore in Karnataka unit","description":"The iPhone contract manufacturer's Singapore-based arm Foxconn Singapore Pte has bought over 120.35 crore stocks of Foxconn Hon Hai Technology India Mega Development Pvt Ltd at Rs 10 per share on August 21.","content":"Electronics manufacturing giant Foxconn has infused about Rs 1,200 crore -- approximately USD 144 million -- into its Karnataka-based Foxconn Hon Hai Technology India Mega Development Pvt Ltd, the company said in a recent regulatory filing. The iPhone contract manufacturer's Singapore-based arm Foxconn Singapore Pte has bought over 120.35 crore stocks of Foxconn Hon Hai Technology India Mega Development Pvt Ltd at Rs 10 per share on August 21.  The Karnataka government in a statement last week said Foxconn is planning to invest Rs 25,000 crore to establish a massive manufacturing plant near Dodda Ballapur that will create 40,000 jobs.  \"The unit in Karnataka will soon become the second-largest Foxconn plant after China's unit. It will create 40,000 direct jobs, especially for middle-level educated individuals, and our investment will not stop here; in the future, we plan to explore other sectors also,\" Foxconn Chairman Young Liu was quoted as saying in the statement.  With the fresh infusion, Foxconn Singapore has invested over Rs 13,800 crore in the Karnataka unit. ","cleaned_content":"electronics manufacturing giant foxconn has infused about rs \u003cONE_THOUSAND\u003e crore approximately usd \u003cONE_HUNDRED\u003e million into its karnataka based foxconn hon hai technology india mega development pvt ltd the company said in a recent regulatory filing the iphone contract manufacturers singapore based arm foxconn singapore pte has bought over \u003cONE_HUNDRED\u003e crore stocks of foxconn hon hai technology india mega development pvt ltd at rs \u003cONE_TEN\u003e per share on august \u003cTWO_TEN\u003e the karnataka government in a statement last week said foxconn is planning to invest rs \u003cTWO_TEN_THOUSAND\u003e crore to establish a massive manufacturing plant near dodda ballapur that will create \u003cFOUR_TEN_THOUSAND\u003e jobs the unit in karnataka will soon become the second largest foxconn plant after chinas unit it will create \u003cFOUR_TEN_THOUSAND\u003e direct jobs especially for middle level educated individuals and our investment will not stop here in the future we plan to explore other sectors also foxconn chairman young liu was quoted as saying in the statement with the fresh infusion foxconn singapore has invested over rs \u003cONE_TEN_THOUSAND\u003e crore in the karnataka unit","timestamp":"2024-08-23T17:14:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}