{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-ceo-durov-faces-preliminary-charges-in-france-of-allowing-crime-on-messaging-app/articleshow/112897951.cms","title":"Telegram CEO Durov faces preliminary charges in France of allowing crime on messaging app","description":"Both free-speech advocates and authoritarian governments have spoken in Durov's defense since his weekend arrest. The case has also called attention to the challenges of policing illegal activity online, and to the Russia-born Durov's own unusual biography and multiple passports.","content":"French authorities handed preliminary charges to Telegram CEO Pavel Durov on Wednesday for allowing alleged criminal activity on his messaging app and barred him from leaving France pending further investigation. Both free-speech advocates and authoritarian governments have spoken in Durov's defense since his weekend arrest. The case has also called attention to the challenges of policing illegal activity online, and to the Russia-born Durov's own unusual biography and multiple passports.  Durov was detained Saturday at Le Bourget airport outside Paris as part of a sweeping investigation opened earlier this year, and released earlier Wednesday after four days of questioning. Investigative judges filed preliminary charges Wednesday night and ordered him to pay 5 million euros bail and to report to a police station twice a week, according to a statement from the Paris prosecutor's office.  Allegations against Durov, who is also a French citizen, include that his platform is being used for child sexual abuse material and drug trafficking, and that Telegram refused to share information or documents with investigators when required by law. The first preliminary charge against him was for ''complicity in managing an online platform to allow illicit transactions by an organized group,'' a crime that can lead to sentences of up to 10 years in prison and 500,000 euro fine, the prosecutor's office said.","cleaned_content":"french authorities handed preliminary charges to telegram ceo pavel durov on wednesday for allowing alleged criminal activity on his messaging app and barred him from leaving france pending further investigation both free speech advocates and authoritarian governments have spoken in durovs defense since his weekend arrest the case has also called attention to the challenges of policing illegal activity online and to the russia born durovs own unusual biography and multiple passports durov was detained saturday at le bourget airport outside paris as part of a sweeping investigation opened earlier this year and released earlier wednesday after four days of questioning investigative judges filed preliminary charges wednesday night and ordered him to pay \u003cFIVE_\u003e million euros bail and to report to a police station twice a week according to a statement from the paris prosecutors office allegations against durov who is also a french citizen include that his platform is being used for child sexual abuse material and drug trafficking and that telegram refused to share information or documents with investigators when required by law the first preliminary charge against him was for complicity in managing an online platform to allow illicit transactions by an organized group a crime that can lead to sentences of up to \u003cONE_TEN\u003e years in prison and \u003cFIVE_HUNDRED_THOUSAND\u003e euro fine the prosecutors office said","timestamp":"2024-08-29T17:17:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}