{"url":"https://economictimes.indiatimes.com/tech/technology/paytm-to-sell-ticketing-business-insider-to-zomato-for-rs-2048-crore/articleshow/112688557.cms","title":"Zomato to acquire Paytm’s movie ticketing, events biz for Rs 2,048 crore","description":"ET reported on June 16 that Zomato is looking to acquire Paytm’s movie booking and events unit -- in a deal that may value Paytm’s vertical at around Rs 1,600-1,750 crore. Paytm also confirmed discussions regarding the potential transfer of its entertainment business in an exchange filing, saying that all discussions are preliminary and non-binding at this stage.","content":"Food delivery major Zomato will acquire Paytm’s movie ticketing and events business in an all-cash deal valuing the entity at Rs 2,048 crore, both the companies informed the stock exchanges on Thursday. One 97 Communications Ltd ( OCL) runs the Noida-based online payments brand Paytm.The deal marks a significant step towards Zomato bulking up businesses beyond food delivery, after aggressive investments in the buzzy quick commerce segment through the Blinkit acquisition in 2022. Aiding its inorganic growth is Zomato’s Rs 12,539 crore of cash war chest .ET first reported on June 16 that Vijay Shekhar Sharma-led company was in talks to sell Paytm Insider to Deepinder Goyal’s Zomato, which is looking to expand the “going-out” business that comprises its dining out, live events and movie ticketing verticals and also runs a food festival called Zomaland.","cleaned_content":"food delivery major zomato will acquire paytm s movie ticketing and events business in an all cash deal valuing the entity at rs \u003cTWO_THOUSAND\u003e crore both the companies informed the stock exchanges on thursday one \u003cNINE_TEN\u003e communications ltd ocl runs the noida based online payments brand paytm the deal marks a significant step towards zomato bulking up businesses beyond food delivery after aggressive investments in the buzzy quick commerce segment through the blinkit acquisition in \u003cTWO_THOUSAND\u003e aiding its inorganic growth is zomato s rs \u003cONE_TEN_THOUSAND\u003e crore of cash war chest et first reported on june \u003cONE_TEN\u003e that vijay shekhar sharma led company was in talks to sell paytm insider to deepinder goyal s zomato which is looking to expand the going out business that comprises its dining out live events and movie ticketing verticals and also runs a food festival called zomaland","timestamp":"2024-08-21T22:33:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}