{"url":"https://economictimes.indiatimes.com/tech/information-tech/healthcare-vertical-keeping-heart-rates-up-at-indian-it-services-companies/articleshow/112815531.cms","title":"Healthcare vertical keeping heart rates up at Indian IT services companies","description":"In recent months, the healthcare vertical of India-centric IT services firms has been in the spotlight, seeing a lot of activity and grabbing headlines for both good and bad reasons. This is in the backdrop of Cognizant TriZetto, a unit of Cognizant Technology Solutions, suing Infosys in a US court for allegedly stealing its trade secrets related to its healthcare insurance software.","content":"On Friday, Cognizant TriZetto, a unit of Cognizant Technology Solutions, sued Infosys in a US court, accusing the Indian IT service firm of stealing trade secrets related to its healthcare insurance software.This was the latest of developments in the healthcare verticals of India-centric IT services firms that have grabbed headlines in recent months, for positive or negative reasons.In November last year, the US Supreme Court rejected Tata Consultancy Services' appeal against a District Court of Wisconsin verdict, charging $140 million in punitive damages in a case filed by Epic Systems. The US healthcare software company had accused TCS of stealing its intellectual property when the Indian firm was contracted to implement its software.A month later, Bengaluru-based Wipro initiated legal action against Mohd Haque, the company’s former senior vice president and head of healthcare and medical devices for the Americas, after he joined Cognizant. Wipro demanded a jury trial for his alleged breach of non-compete clauses by joining a direct competitor.","cleaned_content":"on friday cognizant trizetto a unit of cognizant technology solutions sued infosys in a us court accusing the indian it service firm of stealing trade secrets related to its healthcare insurance software this was the latest of developments in the healthcare verticals of india centric it services firms that have grabbed headlines in recent months for positive or negative reasons in november last year the us supreme court rejected tata consultancy services appeal against a district court of wisconsin verdict charging \u003cONE_HUNDRED\u003e million in punitive damages in a case filed by epic systems the us healthcare software company had accused tcs of stealing its intellectual property when the indian firm was contracted to implement its software a month later bengaluru based wipro initiated legal action against mohd haque the company s former senior vice president and head of healthcare and medical devices for the americas after he joined cognizant wipro demanded a jury trial for his alleged breach of non compete clauses by joining a direct competitor","timestamp":"2024-08-27T06:01:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}