{"url":"https://economictimes.indiatimes.com/tech/technology/flipkart-backed-supermoney-launches-upi-app/articleshow/112684122.cms","title":"Flipkart-backed SuperMoney launches UPI app","description":"Super.Money, the fintech wing of Flipkart, debuted its credit-first UPI app post a beta phase with 10 million transactions. The venture plans to introduce new financial products, targeting a significant position in India's UPI sector.","content":"Ecommerce major Flipkart’s fintech venture Super.Money has officially launched its credit-first Unified Payments Interface (UPI) application for the public, following a successful beta phase that saw over 10 million transactions. The Bengaluru-based startup has completed testing its credit on UPI solution and has introduced a wait-list programme. Super Money’s first credit solution is a Rupay credit card that functions as an interest-bearing wallet on UPI rails, it said.Prakash Sikaria, founder and CEO of Super.Money, told ET that the company aims to be among the top five players in India’s competitive UPI market. Currently, Walmart-owned PhonePe and GooglePay dominate the market, accounting for over 85% of the 14.4 billion UPI transactions recorded in July.Flipkart has committed around $20 million to the venture last year.ET reported on August 20 that the government's proposed 30% market share cap for UPI players, put forth by the National Payments Corporation of India (NPCI), seems unlikely to be met before the deadline, which is just over four months away.To address the high concentration of UPI transactions among a few apps, NPCI has been encouraging new third-party payment apps to invest and offer incentives to consumers over the past few months.","cleaned_content":"ecommerce major flipkart s fintech venture super money has officially launched its credit first unified payments interface upi application for the public following a successful beta phase that saw over \u003cONE_TEN\u003e million transactions the bengaluru based startup has completed testing its credit on upi solution and has introduced a wait list programme super money s first credit solution is a rupay credit card that functions as an interest bearing wallet on upi rails it said prakash sikaria founder and ceo of super money told et that the company aims to be among the top five players in india s competitive upi market currently walmart owned phonepe and googlepay dominate the market accounting for over \u003cEIGHT_TEN_PERCENT\u003e of the \u003cONE_TEN\u003e billion upi transactions recorded in july flipkart has committed around \u003cTWO_TEN\u003e million to the venture last year et reported on august \u003cTWO_TEN\u003e that the governments proposed \u003cTHREE_TEN_PERCENT\u003e market share cap for upi players put forth by the national payments corporation of india npci seems unlikely to be met before the deadline which is just over four months away to address the high concentration of upi transactions among a few apps npci has been encouraging new third party payment apps to invest and offer incentives to consumers over the past few months","timestamp":"2024-08-21T18:28:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}