{"url":"https://economictimes.indiatimes.com/tech/technology/chinas-robot-makers-chase-tesla-to-deliver-humanoid-workers/articleshow/112729180.cms","title":"China's robot makers chase Tesla to deliver humanoid workers","description":"At the World Robot Conference this week in Beijing, over two dozen Chinese companies showed off humanoid robots designed to work in factories and warehouses, with even more displaying the made-in-China precision parts needed to build them. China's push into the emerging industry draws from the formula behind its initial EV drive more than a decade ago: government support, ruthless price competition from a wide field of new entrants and a deep supply chain.","content":"China dominates the market for electric vehicles. Now it's chasing Tesla in the race to build battery-powered humanoids expected to replace human workers building EVs on assembly lines. At the World Robot Conference this week in Beijing, over two dozen Chinese companies showed off humanoid robots designed to work in factories and warehouses, with even more displaying the made-in-China precision parts needed to build them. China's push into the emerging industry draws from the formula behind its initial EV drive more than a decade ago: government support, ruthless price competition from a wide field of new entrants and a deep supply chain. \"China's humanoid robot industry demonstrates clear advantages in supply-chain integration (and) mass production capabilities,\" said Arjen Rao, analyst at China-based LeadLeo Research Institute. The robotics effort is backed by President Xi Jinping's policy of developing \"new productive forces\" in technology - a point made in brochures for this week's event. ","cleaned_content":"china dominates the market for electric vehicles now its chasing tesla in the race to build battery powered humanoids expected to replace human workers building evs on assembly lines at the world robot conference this week in beijing over two dozen chinese companies showed off humanoid robots designed to work in factories and warehouses with even more displaying the made in china precision parts needed to build them chinas push into the emerging industry draws from the formula behind its initial ev drive more than a decade ago government support ruthless price competition from a wide field of new entrants and a deep supply chain chinas humanoid robot industry demonstrates clear advantages in supply chain integration and mass production capabilities said arjen rao analyst at china based leadleo research institute the robotics effort is backed by president xi jinpings policy of developing new productive forces in technology a point made in brochures for this weeks event","timestamp":"2024-08-23T11:09:00+05:30","market_timestamp":"2024-08-23T11:09:00+05:30","off_market_hours":false}