{"url":"https://economictimes.indiatimes.com/tech/technology/video-gamers-set-for-worlds-biggest-trade-show/articleshow/112629263.cms","title":"Video gamers set for world's biggest trade show","description":"The world's largest video game trade show, Gamescom, opens its doors on Tuesday in Germany at a sensitive moment for an industry battered by layoffs and studio closures.  \"I see studios that inspired me going out of business and it terrifies me,\" David Rabineau, a French developer who heads independent studio Homo Ludens, told AFP.  - 'Sharp downturn' - At least 11,000 workers have been given their marching orders already this year, more than for the whole of 2023, according to Game Industry Layoffs, a website that tracks the numbers.","content":"The world's largest video game trade show, Gamescom, opens its doors on Tuesday in Germany at a sensitive moment for an industry battered by layoffs and studio closures. Organisers expect the event, which runs until Sunday in the western city of Cologne, to welcome more than 300,000 people as firms hype forthcoming big releases like \"Indiana Jones and the Great Circle\" and \"Call of Duty: Black Ops 6\".The industry is expected to generate more than $180 billion in revenue this year and attract more than 3.4 billion players, according to the Newzoo analyst firm.But sales are far from the peaks reached in the pandemic.While smaller studios are struggling to survive, big publishers are imposing dramatic cost-cutting exercises and thousands of workers are being laid off.","cleaned_content":"the worlds largest video game trade show gamescom opens its doors on tuesday in germany at a sensitive moment for an industry battered by layoffs and studio closures organisers expect the event which runs until sunday in the western city of cologne to welcome more than \u003cTHREE_HUNDRED_THOUSAND\u003e people as firms hype forthcoming big releases like indiana jones and the great circle and call of duty black ops \u003cSIX_\u003e the industry is expected to generate more than \u003cONE_HUNDRED\u003e billion in revenue this year and attract more than \u003cTHREE_\u003e billion players according to the newzoo analyst firm but sales are far from the peaks reached in the pandemic while smaller studios are struggling to survive big publishers are imposing dramatic cost cutting exercises and thousands of workers are being laid off","timestamp":"2024-08-19T16:58:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}