{"url":"https://economictimes.indiatimes.com/tech/technology/cobranded-credit-cards-to-form-25-of-market-by-fy28-report/articleshow/112814981.cms","title":"Cobranded credit cards to form 25% of market by FY28: report","description":"By the end of FY28, cobranded credit cards are projected to capture around 25% of India's credit card market share in terms of new issuances, driven by a robust compound annual growth rate of 35-40%, according to a joint report by fintech Hyperface and Redseer.","content":"Cobranded credit cards are expected to account for about 25% of the Indian credit card market in terms of issuances by the end of FY28, growing at a compound annual growth rate of 35-40%, according to a report by fintech startup Hyperface and consultancy firm Redseer.Currently, cobranded credit cards have a market share of 12-15%, the report has estimated. Data from the Reserve Bank of India (RBI) shows that there are more than 100 million outstanding credit cards in the country.RBI does not disclose the market share for cobranded cards.Cobranded credit cards are ones where the bank is the issuer of the card and a different brand is the customer acquisition channel. Among the popular cobranded credit cards in the country are Flipkart and Axis Bank, Amazon and ICICI Bank, and Swiggy and HDFC Bank.“We have seen a higher activation rate and higher spend rate on cobranded credit cards and customer engagement with large brands is getting stronger. Overall these factors are helping in faster rate of growth for these cards vis-a-vis traditional credit cards,” said RV Ramanathan, chief executive officer, Hyperface.","cleaned_content":"cobranded credit cards are expected to account for about \u003cTWO_TEN_PERCENT\u003e of the indian credit card market in terms of issuances by the end of fy28 growing at a compound annual growth rate of \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e according to a report by fintech startup hyperface and consultancy firm redseer currently cobranded credit cards have a market share of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e the report has estimated data from the reserve bank of india rbi shows that there are more than \u003cONE_HUNDRED\u003e million outstanding credit cards in the country rbi does not disclose the market share for cobranded cards cobranded credit cards are ones where the bank is the issuer of the card and a different brand is the customer acquisition channel among the popular cobranded credit cards in the country are flipkart and axis bank amazon and icici bank and swiggy and hdfc bank we have seen a higher activation rate and higher spend rate on cobranded credit cards and customer engagement with large brands is getting stronger overall these factors are helping in faster rate of growth for these cards vis a vis traditional credit cards said rv ramanathan chief executive officer hyperface","timestamp":"2024-08-27T20:49:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}