{"url":"https://economictimes.indiatimes.com/tech/technology/southern-states-look-to-outfox-each-other-in-hunt-for-a-foxconn-city/articleshow/112846393.cms","title":"Southern states look to outfox each other in hunt for a Foxconn ‘city’","description":"Taiwanese electronics manufacturer Foxconn is being offered 2,000 acres of land in Telangana to build a 'Foxconn city' modelled on its facilities in its home country as well as in China, a top lawmaker told ET. Telangana has offered as-yet unidentified location to Foxconn, but other states are also aggressively courting the company.","content":"Foxconn, one of the world’s largest contract manufacturers for electronics, is being offered 2,000 acres at an as-yet unidentified location in Telangana to build a 'Foxconn City' modelled on its facilities in its home country as well as in China, a top lawmaker told ET.The Taiwanese company is also being wooed by at least two more states —Karnataka and Andhra Pradesh—to set up an industrial park or ‘city’, people in the know told ET.Best known as the maker of Apple’s iPhones, Foxconn has also been “offered 2,500 acres by Andhra Pradesh to build an industrial park and three hundred acres by Karnataka for a supplier park”, said a person directly aware of the developments.   ","cleaned_content":"foxconn one of the world s largest contract manufacturers for electronics is being offered \u003cTWO_THOUSAND\u003e acres at an as yet unidentified location in telangana to build a foxconn city modelled on its facilities in its home country as well as in china a top lawmaker told et the taiwanese company is also being wooed by at least two more states karnataka and andhra pradesh to set up an industrial park or city people in the know told et best known as the maker of apple s iphones foxconn has also been offered \u003cTWO_THOUSAND\u003e acres by andhra pradesh to build an industrial park and three hundred acres by karnataka for a supplier park said a person directly aware of the developments","timestamp":"2024-08-28T18:28:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}