{"url":"https://economictimes.indiatimes.com/tech/technology/swiggy-targets-15-billion-valuation-in-ipo/articleshow/112741807.cms","title":"Swiggy targets $15 billion valuation in IPO","description":"SoftBank-backed Swiggy is planning an IPO to raise $1-1.2 billion, targeting a $15 billion valuation. Competing with Zomato in the quick commerce sector, Swiggy's IPO aims to expand its Instamart business. The company received shareholder approval and expects regulatory clearance shortly.","content":"SoftBank-backed Indian food delivery giant Swiggy is targeting a valuation of around $15 billion for its upcoming stock market offering to raise $1-1.2 billion, three people familiar with the matter said. The deal would make it one of biggest Indian initial public offerings this year. Swiggy competes with Zomato in India's online restaurant and cafe food deliveries sector, and both have made major bets on the new so-called quick commerce boom where groceries and other products are being delivered in 10 minutes. Swiggy received a shareholder approval in April for an IPO that would raise up to $1.25 billion and its confidential filing is expected to be cleared by the Indian markets regulator within a month or so. Following the approval it will file a public prospectus, according to the people, who declined to be named as the matter is private. The company is targeting a valuation of around $15 billion though the final figure can change, they said. ","cleaned_content":"softbank backed indian food delivery giant swiggy is targeting a valuation of around \u003cONE_TEN\u003e billion for its upcoming stock market offering to raise \u003cONE_\u003e \u003cONE_\u003e billion three people familiar with the matter said the deal would make it one of biggest indian initial public offerings this year swiggy competes with zomato in indias online restaurant and cafe food deliveries sector and both have made major bets on the new so called quick commerce boom where groceries and other products are being delivered in \u003cONE_TEN\u003e minutes swiggy received a shareholder approval in april for an ipo that would raise up to \u003cONE_\u003e billion and its confidential filing is expected to be cleared by the indian markets regulator within a month or so following the approval it will file a public prospectus according to the people who declined to be named as the matter is private the company is targeting a valuation of around \u003cONE_TEN\u003e billion though the final figure can change they said","timestamp":"2024-08-23T17:54:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}