{"url":"https://economictimes.indiatimes.com/tech/technology/chinas-jd-com-announces-5-billion-share-buyback-plan/articleshow/112838581.cms","title":"China's JD.com announces $5 billion share buyback plan","description":"JD.com, which last week beat profit forecasts for the June quarter, and rivals such as Alibaba, have been seeking to alleviate investor concerns over the sluggish Chinese retail market through major share buybacks.","content":"JD.com said on Tuesday its board has approved a new $5 billion share repurchase program, effective September, allowing the Chinese e-commerce giant to buy back its stock over the next 36 months. US-listed shares of the company jumped 5.1% in premarket trading. JD.com, which last week beat profit forecasts for the June quarter, and rivals such as Alibaba, have been seeking to alleviate investor concerns over the sluggish Chinese retail market through major share buybacks. This marks JD.com's second share buyback announcement this year, after announcing a $3 billion repurchase in March. Alibaba announced a $25 billion share buyback in February. Chinese consumers have been shy to spend in the face of a macroeconomic slowdown, an extended property slump and employment security concerns, prompting JD.Com to offer regular discounts and promotions.","cleaned_content":"jd com said on tuesday its board has approved a new \u003cFIVE_\u003e billion share repurchase program effective september allowing the chinese e commerce giant to buy back its stock over the next \u003cTHREE_TEN\u003e months us listed shares of the company jumped \u003cFIVE_PERCENT\u003e in premarket trading jd com which last week beat profit forecasts for the june quarter and rivals such as alibaba have been seeking to alleviate investor concerns over the sluggish chinese retail market through major share buybacks this marks jd coms second share buyback announcement this year after announcing a \u003cTHREE_\u003e billion repurchase in march alibaba announced a \u003cTWO_TEN\u003e billion share buyback in february chinese consumers have been shy to spend in the face of a macroeconomic slowdown an extended property slump and employment security concerns prompting jd com to offer regular discounts and promotions","timestamp":"2024-08-27T17:20:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}