{"url":"https://economictimes.indiatimes.com/tech/technology/crypto-lobbyist-charged-with-breaking-campaign-finance-rules/articleshow/112727590.cms","title":"Crypto lobbyist charged with breaking campaign finance rules","description":"Nearly two years after FTX filed for bankruptcy, the charges against Bond show that the legal fallout from the company's implosion is not over. When FTX was a highflying exchange, its executives made tens of millions of dollars in political donations -- a spending spree that came under scrutiny from prosecutors after the company failed. Sam Bankman-Fried, founder of FTX, was convicted of fraud in November and sentenced to 25 years in prison.","content":"A former cryptocurrency industry lobbyist was charged with campaign finance fraud Thursday, the latest criminal prosecution to stem from the collapse of the FTX crypto exchange. Federal prosecutors in New York accused former lobbyist Michelle Bond, 45, of violating campaign finance laws in 2022, when she made an unsuccessful bid for Congress as a Republican on Long Island. In an indictment filed in the Southern District of New York, prosecutors said Bond received a \"sham $400,000 payment\" from FTX that was orchestrated by Ryan Salame, an executive at the exchange and Bond's boyfriend. Last year, Salame pleaded guilty to a separate campaign finance charge. He was sentenced to 7 1/2 years in prison. Nearly two years after FTX filed for bankruptcy, the charges against Bond show that the legal fallout from the company's implosion is not over. When FTX was a highflying exchange, its executives made tens of millions of dollars in political donations -- a spending spree that came under scrutiny from prosecutors after the company failed. Sam Bankman-Fried, founder of FTX, was convicted of fraud in November and sentenced to 25 years in prison. Bond, who ran a crypto industry trade group, was a longtime supporter of Bankman-Fried and FTX. Her ties to the company were strengthened after she met Salame. By 2022, they had started dating, according to the indictment.","cleaned_content":"a former cryptocurrency industry lobbyist was charged with campaign finance fraud thursday the latest criminal prosecution to stem from the collapse of the ftx crypto exchange federal prosecutors in new york accused former lobbyist michelle bond \u003cFOUR_TEN\u003e of violating campaign finance laws in \u003cTWO_THOUSAND\u003e when she made an unsuccessful bid for congress as a republican on long island in an indictment filed in the southern district of new york prosecutors said bond received a sham \u003cFOUR_HUNDRED_THOUSAND\u003e payment from ftx that was orchestrated by ryan salame an executive at the exchange and bonds boyfriend last year salame pleaded guilty to a separate campaign finance charge he was sentenced to \u003cSEVEN_\u003e \u003cONE_\u003e \u003cTWO_\u003e years in prison nearly two years after ftx filed for bankruptcy the charges against bond show that the legal fallout from the companys implosion is not over when ftx was a highflying exchange its executives made tens of millions of dollars in political donations a spending spree that came under scrutiny from prosecutors after the company failed sam bankman fried founder of ftx was convicted of fraud in november and sentenced to \u003cTWO_TEN\u003e years in prison bond who ran a crypto industry trade group was a longtime supporter of bankman fried and ftx her ties to the company were strengthened after she met salame by \u003cTWO_THOUSAND\u003e they had started dating according to the indictment","timestamp":"2024-08-23T09:51:00+05:30","market_timestamp":"2024-08-23T09:51:00+05:30","off_market_hours":false}