{"url":"https://economictimes.indiatimes.com/tech/technology/darwinbox-elevates-cto-vineet-singh-to-cofounder/articleshow/112914777.cms","title":"Darwinbox elevates CTO Vineet Singh to cofounder","description":"Darwinbox, a SaaS unicorn focused on HR services, has promoted its CTO, Vineet Singh, to cofounder. Singh aims to enhance their technological innovations, embedding AI. The company, backed by investors like Microsoft and Salesforce Ventures, recently expanded to the US and UK, serving over 900 enterprises globally.","content":"Software-as-a-Service (SaaS) unicorn Darwinbox, which specialises in human resource (HR) services, on Friday said it has elevated its chief technology officer Vineet Singh to the position of cofounder.“I’m excited to continue driving our technology strategy forward. We will further accelerate our technological innovations, embedding AI as a platform capability to deliver better experience and contextual intelligence to our customers,” said Singh, who has experience of working in the consumer and SaaS tech industries.Hyderabad and Singapore-based Darwinbox achieved unicorn status in January 2022 after raising $72 million in a funding round led by Netflix-backer TCV, at a valuation of $1 billion.The firm helps organisations manage their HR needs, including hiring and onboarding, touchless attendance and employee management.“He has been pivotal in realising Darwinbox’s vision to build a global-standard enterprise tech product from India,” said Chaitanya Peddi, cofounder of Darwinbox. “He has scaled the platform into a full-fledged HCM suite with15 modules in just six years, which is faster than any other enterprise HR tech. He was the first one to join our team back in 2015 and has successfully scaled our engineering and R\u0026D teams into the 400-member strong unit that it is today.”","cleaned_content":"software as a service saas unicorn darwinbox which specialises in human resource hr services on friday said it has elevated its chief technology officer vineet singh to the position of cofounder i m excited to continue driving our technology strategy forward we will further accelerate our technological innovations embedding ai as a platform capability to deliver better experience and contextual intelligence to our customers said singh who has experience of working in the consumer and saas tech industries hyderabad and singapore based darwinbox achieved unicorn status in january \u003cTWO_THOUSAND\u003e after raising \u003cSEVEN_TEN\u003e million in a funding round led by netflix backer tcv at a valuation of \u003cONE_\u003e billion the firm helps organisations manage their hr needs including hiring and onboarding touchless attendance and employee management he has been pivotal in realising darwinbox s vision to build a global standard enterprise tech product from india said chaitanya peddi cofounder of darwinbox he has scaled the platform into a full fledged hcm suite with15 modules in just six years which is faster than any other enterprise hr tech he was the first one to join our team back in \u003cTWO_THOUSAND\u003e and has successfully scaled our engineering and r d teams into the \u003cFOUR_HUNDRED\u003e member strong unit that it is today","timestamp":"2024-08-30T11:38:00+05:30","market_timestamp":"2024-08-30T11:38:00+05:30","off_market_hours":false}