{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-bosss-lawyer-says-probe-against-durov-is-absurd/articleshow/112901771.cms","title":"Telegram boss's lawyer says probe against Durov is 'absurd'","description":"The Kremlin also weighed in on a case that has further strained Russia's relations with France, saying the prosecution of the Russian-born tech boss, who is accused of allowing illicit content to run on a platform used by close to 1 billion people, should not turn into \"political persecution.\"","content":"A lawyer for Telegram boss Pavel Durov, who is the target of an unprecedented investigation in France, said on Thursday it was \"absurd\" to suggest the head of a social network was responsible for any criminal acts committed on the platform. The Kremlin also weighed in on a case that has further strained Russia's relations with France, saying the prosecution of the Russian-born tech boss, who is accused of allowing illicit content to run on a platform used by close to 1 billion people, should not turn into \"political persecution.\" A French judge put Durov under formal investigation on Wednesday, four days after police arrested him at Le Bourget airport near Paris, fuelling debate on where freedom of speech ends and enforcement of the law begins. Lawyer David-Olivier Kaminski, who is representing Durov in France, said it was \"absurd to say that a platform or its boss are responsible for any abuse\" carried out on the platform, and that Telegram was abiding by European laws. The French judge said on Wednesday that Durov was suspected of complicity in running an online platform that allows illicit transactions, images of child sex abuse and drug trafficking.","cleaned_content":"a lawyer for telegram boss pavel durov who is the target of an unprecedented investigation in france said on thursday it was absurd to suggest the head of a social network was responsible for any criminal acts committed on the platform the kremlin also weighed in on a case that has further strained russias relations with france saying the prosecution of the russian born tech boss who is accused of allowing illicit content to run on a platform used by close to \u003cONE_\u003e billion people should not turn into political persecution a french judge put durov under formal investigation on wednesday four days after police arrested him at le bourget airport near paris fuelling debate on where freedom of speech ends and enforcement of the law begins lawyer david olivier kaminski who is representing durov in france said it was absurd to say that a platform or its boss are responsible for any abuse carried out on the platform and that telegram was abiding by european laws the french judge said on wednesday that durov was suspected of complicity in running an online platform that allows illicit transactions images of child sex abuse and drug trafficking","timestamp":"2024-08-29T19:57:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}