{"url":"https://economictimes.indiatimes.com/tech/technology/uk-watchdog-shuts-down-probes-into-apple-and-google-app-stores/articleshow/112697442.cms","title":"UK watchdog shuts down probes into Apple and Google app stores","description":"The tech giants have faced scrutiny around the world over the dominance of their respective App Store and Google Play store platforms, which critics say impose unfair charges on app developers and limit competition.","content":"Britain's competition watchdog has closed its existing investigations into Apple and Google's respective app stores, awaiting new laws governing digital markets.  The tech giants have faced scrutiny around the world over the dominance of their respective App Store and Google Play store platforms, which critics say impose unfair charges on app developers and limit competition.  In 2022, the Competition and Markets Authority (CMA) published a market study of mobile ecosystems in Britain, which found Apple and Google held an effective monopoly over the distribution of apps in Britain.  The body subsequently launched parallel investigations into both companies for alleged anticompetitive behaviour.  But in a statement published on Wednesday, the CMA said it had dropped both probes, pending the roll-out of the Digital Markets, Competition and Consumers Act (DMCCA), which is expected to come into force later this year. ","cleaned_content":"britains competition watchdog has closed its existing investigations into apple and googles respective app stores awaiting new laws governing digital markets the tech giants have faced scrutiny around the world over the dominance of their respective app store and google play store platforms which critics say impose unfair charges on app developers and limit competition in \u003cTWO_THOUSAND\u003e the competition and markets authority cma published a market study of mobile ecosystems in britain which found apple and google held an effective monopoly over the distribution of apps in britain the body subsequently launched parallel investigations into both companies for alleged anticompetitive behaviour but in a statement published on wednesday the cma said it had dropped both probes pending the roll out of the digital markets competition and consumers act dmcca which is expected to come into force later this year","timestamp":"2024-08-22T09:07:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}