{"url":"https://economictimes.indiatimes.com/tech/technology/can-tech-executives-be-held-responsible-for-what-happens-on-their-platforms/articleshow/112857153.cms","title":"Can tech executives be held responsible for what happens on their platforms?","description":"And on Saturday, Pavel Durov, who founded the online communications tool Telegram, was arrested in France as part of an investigation into the platform's complicity in crimes including possession and distribution of child sexual abuse imagery.","content":"This month, the social platform X closed its Brazil operations after one of its executives was threatened with arrest for not taking down certain content. Last year, Changpeng Zhao, the founder of Binance, pleaded guilty to federal money-laundering violations that took place on his cryptocurrency platform. In 2021, Twitter executives in India faced arrest over posts that the government wanted removed from the site. And on Saturday, Pavel Durov, who founded the online communications tool Telegram, was arrested in France as part of an investigation into the platform's complicity in crimes including possession and distribution of child sexual abuse imagery. For years, internet company executives rarely faced personal liability in Western democracies for what took place on their platforms. But as law enforcement agencies, regulators and policymakers ramp up scrutiny of online platforms and exchanges, they are increasingly considering when to hold company leaders directly responsible. That shift was punctuated by Durov's arrest over the weekend, raising questions over whether tech executives like Meta's Mark Zuckerberg also risk being arrested when they next set foot on European soil. For now, tech executives have little to fear, with cases like Durov's likely to be outliers, experts said. Historically, companies have been held responsible for a platform's transgressions, rather than individuals. And legally, the bar is high in the United States and Europe to prosecute individuals for activities at their companies, especially with U.S. laws like Section 230 of the Communications Decency Act, which protects internet platforms from being responsible for harmful speech.","cleaned_content":"this month the social platform x closed its brazil operations after one of its executives was threatened with arrest for not taking down certain content last year changpeng zhao the founder of binance pleaded guilty to federal money laundering violations that took place on his cryptocurrency platform in \u003cTWO_THOUSAND\u003e twitter executives in india faced arrest over posts that the government wanted removed from the site and on saturday pavel durov who founded the online communications tool telegram was arrested in france as part of an investigation into the platforms complicity in crimes including possession and distribution of child sexual abuse imagery for years internet company executives rarely faced personal liability in western democracies for what took place on their platforms but as law enforcement agencies regulators and policymakers ramp up scrutiny of online platforms and exchanges they are increasingly considering when to hold company leaders directly responsible that shift was punctuated by durovs arrest over the weekend raising questions over whether tech executives like metas mark zuckerberg also risk being arrested when they next set foot on european soil for now tech executives have little to fear with cases like durovs likely to be outliers experts said historically companies have been held responsible for a platforms transgressions rather than individuals and legally the bar is high in the united states and europe to prosecute individuals for activities at their companies especially with u s laws like section \u003cTWO_HUNDRED\u003e of the communications decency act which protects internet platforms from being responsible for harmful speech","timestamp":"2024-08-28T11:53:00+05:30","market_timestamp":"2024-08-28T11:53:00+05:30","off_market_hours":false}