{"url":"https://economictimes.indiatimes.com/tech/technology/us-to-award-hp-50-million-for-semiconductor-tech-project/articleshow/112859217.cms","title":"US to award HP $50 million for semiconductor tech project","description":"The projects build on HP's expertise in microfluidics and microelectromechanical systems with funding set to support manufacturing of silicon devices critical in life sciences lab equipment used in drug discovery, singlecell research, and cell line development.","content":"The US Commerce Department said Tuesday it plans to award $50 million to HP to support the expansion and modernization of an existing company facility in Oregon that will boost key semiconductor technologies.  The proposed funding will support technologies that serve life sciences instrumentation and technology hardware used in artificial intelligence applications and other projects, the department said.  Congress in August 2022 approved a $39 billion subsidy program for U.S. semiconductor manufacturing and related components along with $75 billion in government lending authority and a 25% investment tax credit worth an estimated $24 billion.  The projects build on HP's expertise in microfluidics and microelectromechanical systems with funding set to support manufacturing of silicon devices critical in life sciences lab equipment used in drug discovery, singlecell research, and cell line development.  Commerce Secretary Gina Raimondo said the proposed $50 million funding for the Corvallis, Oregon, HP campus \"shows how we are investing in every part of the semiconductor supply chain and how important semiconductor technology is to innovation in drug discovery and critical life science equipment.\" ","cleaned_content":"the us commerce department said tuesday it plans to award \u003cFIVE_TEN\u003e million to hp to support the expansion and modernization of an existing company facility in oregon that will boost key semiconductor technologies the proposed funding will support technologies that serve life sciences instrumentation and technology hardware used in artificial intelligence applications and other projects the department said congress in august \u003cTWO_THOUSAND\u003e approved a \u003cTHREE_TEN\u003e billion subsidy program for u s semiconductor manufacturing and related components along with \u003cSEVEN_TEN\u003e billion in government lending authority and a \u003cTWO_TEN_PERCENT\u003e investment tax credit worth an estimated \u003cTWO_TEN\u003e billion the projects build on hps expertise in microfluidics and microelectromechanical systems with funding set to support manufacturing of silicon devices critical in life sciences lab equipment used in drug discovery singlecell research and cell line development commerce secretary gina raimondo said the proposed \u003cFIVE_TEN\u003e million funding for the corvallis oregon hp campus shows how we are investing in every part of the semiconductor supply chain and how important semiconductor technology is to innovation in drug discovery and critical life science equipment","timestamp":"2024-08-28T12:58:00+05:30","market_timestamp":"2024-08-28T12:58:00+05:30","off_market_hours":false}