{"url":"https://economictimes.indiatimes.com/tech/technology/success-of-paytm-biz-acquisition-hinges-on-effective-customer-transition-team-integration-ceo-deepinder-goyal/articleshow/112690630.cms","title":"Paytm biz acquisition may boost going-out vertical's gross order value to Rs 10,000 crore by FY26: Zomato CEO","description":"Zomato's purchase of Paytm's events and movie ticketing division hinges on effective customer transition and team integration, as noted by CEO Deepinder Goyal. The Rs 2,048 crore deal includes onboarding 280 employees. Initial operations will remain on separate apps, later merging into a new app, District, aimed at consolidating dining and event services.","content":"Zomato's acquisition of Noida-headquartered Paytm's events and movie ticketing business could boost the Gurugram-based firm's gross order value (GOV) from its going out business to over Rs 10,000 crore in FY26.In FY24, Zomato's going out GOV was at Rs 3,225 crore.In a letter to Zomato’s shareholders, the company's CEO Deepinder Goyal said that the potential of the going out business's scale will depend on incremental use-cases the company is able to build on top of what it has, and is acquiring.The Rs 2,048 crore all cash acquisition was announced late Wednesday. \"Any further step change in scale here will depend on our ability to build newer use-cases like shopping, staycations (travel), etc,\" Goyal said.","cleaned_content":"zomatos acquisition of noida headquartered paytms events and movie ticketing business could boost the gurugram based firms gross order value gov from its going out business to over rs \u003cONE_TEN_THOUSAND\u003e crore in fy26 in fy24 zomatos going out gov was at rs \u003cTHREE_THOUSAND\u003e crore in a letter to zomato s shareholders the companys ceo deepinder goyal said that the potential of the going out businesss scale will depend on incremental use cases the company is able to build on top of what it has and is acquiring the rs \u003cTWO_THOUSAND\u003e crore all cash acquisition was announced late wednesday any further step change in scale here will depend on our ability to build newer use cases like shopping staycations travel etc goyal said","timestamp":"2024-08-22T10:25:00+05:30","market_timestamp":"2024-08-22T10:25:00+05:30","off_market_hours":false}