{"url":"https://economictimes.indiatimes.com/tech/technology/kaynes-technologies-inaugurates-ems-facility-in-hyderabad/articleshow/112741085.cms","title":"Kaynes Technologies inaugurates EMS facility in Hyderabad","description":"The Hyderabad facility is equipped with the latest manufacturing technologies including high precision electronic assembly, 3D optical and AI enabled state of the art inspection system, and lead free/RoHS-compliant processes. The plant will cater to various sectors such as industrial, automotive, medical electronics, aerospace and telecommunications.","content":"Homegrown electronics manufacturing services firm, Kaynes Technologies on Friday inaugurated an advanced electronics unit near Hyderabad on Friday.\"This facility will primarily do products like smart meters and electronics manufacturing,\" Raghu Panicker, CEO, Kaynes Semicon told ET on the sidelines of the inauguration. \"Brightgrid will be our first customer but there will be multiple such customers and this line is primarily dedicated to the smart meter. We will do the main board, we will do the NIC card, we will do the plastic, injection molding machines and stuff like that - so we will do EMS.\"He said the company would follow it up with doing some of the other kinds of packaging. In that context he said the company had signed an MoU with Lightspeed Photonics.\"There will be some semiconductor work that will happen here (at the new facility),\" Panicker explained. \"It could be substrate based, it could be co-package optics, it could be light speed photonics, some of these packages we'll do here. Right now, there are about two lines but eventually this will be 15 to 16 lines. And out of those 15 lines some may be allotted to outsourced semiconductor assembly and test (OSAT). We have 46 acres of land, this is only one tenth of it.\"The Hyderabad facility is equipped with the latest manufacturing technologies including high precision electronic assembly, 3D optical and AI enabled state of the art inspection system, and lead free/RoHS-compliant processes. The plant will cater to various sectors such as industrial, automotive, medical electronics, aerospace and telecommunications.","cleaned_content":"homegrown electronics manufacturing services firm kaynes technologies on friday inaugurated an advanced electronics unit near hyderabad on friday this facility will primarily do products like smart meters and electronics manufacturing raghu panicker ceo kaynes semicon told et on the sidelines of the inauguration brightgrid will be our first customer but there will be multiple such customers and this line is primarily dedicated to the smart meter we will do the main board we will do the nic card we will do the plastic injection molding machines and stuff like that so we will do ems he said the company would follow it up with doing some of the other kinds of packaging in that context he said the company had signed an mou with lightspeed photonics there will be some semiconductor work that will happen here at the new facility panicker explained it could be substrate based it could be co package optics it could be light speed photonics some of these packages well do here right now there are about two lines but eventually this will be \u003cONE_TEN\u003e to \u003cONE_TEN\u003e lines and out of those \u003cONE_TEN\u003e lines some may be allotted to outsourced semiconductor assembly and test osat we have \u003cFOUR_TEN\u003e acres of land this is only one tenth of it the hyderabad facility is equipped with the latest manufacturing technologies including high precision electronic assembly \u003cTHREE_\u003e d optical and ai enabled state of the art inspection system and lead free rohs compliant processes the plant will cater to various sectors such as industrial automotive medical electronics aerospace and telecommunications","timestamp":"2024-08-23T17:39:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}