{"url":"https://economictimes.indiatimes.com/tech/technology/french-authorities-charge-telegram-ceo-pavel-durov-in-probe-into-organized-crime-on-app/articleshow/112881103.cms","title":"French authorities charge Telegram CEO Pavel Durov in probe into organized crime on app","description":"Telegram boss Pavel Durov has been placed under formal investigation by a French judge over allegations of organized crime on the messaging app. Durov, who holds French, Russian, and UAE passports, has been accused of facilitating illicit activities on Telegram. He has been granted bail with specific conditions, including reporting to police twice a week.","content":"A French judge put Telegram boss Pavel Durov under formal investigation on Wednesday in a probe into organized crime on the messaging app, but granted the entrepreneur bail on condition he pays 5 million euros, reports twice a week to police and does not leave French territory.  Paris prosecutor Laure Beccuau said in a statement the judge found there were grounds to formally investigate Durov on all the charges for which he was initially arrested four days ago. They include suspected complicity in running an online platform that allows illicit transactions, images of child sex abuse, drug trafficking and fraud, as well as the refusal to communicate information to authorities, money laundering and providing cryptographic services to criminals. Durov's lawyer did not immediately respond to a request for comment. Being placed under formal investigation in France does not imply guilt or necessarily lead to trial, but indicates judges consider there is enough evidence to proceed with the probe. Investigations can last years before being sent to trial or shelved.","cleaned_content":"a french judge put telegram boss pavel durov under formal investigation on wednesday in a probe into organized crime on the messaging app but granted the entrepreneur bail on condition he pays \u003cFIVE_\u003e million euros reports twice a week to police and does not leave french territory paris prosecutor laure beccuau said in a statement the judge found there were grounds to formally investigate durov on all the charges for which he was initially arrested four days ago they include suspected complicity in running an online platform that allows illicit transactions images of child sex abuse drug trafficking and fraud as well as the refusal to communicate information to authorities money laundering and providing cryptographic services to criminals durovs lawyer did not immediately respond to a request for comment being placed under formal investigation in france does not imply guilt or necessarily lead to trial but indicates judges consider there is enough evidence to proceed with the probe investigations can last years before being sent to trial or shelved","timestamp":"2024-08-29T07:13:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}