{"url":"https://economictimes.indiatimes.com/tech/technology/moonshot-boom-behind-spurred-investment-in-indias-thriving-space-sector/articleshow/112762349.cms","title":"Moonshot boom: behind spurred investment in India’s thriving space sector","description":"A year has passed since Chandrayaan-3’s historic landing near the Moon’s south pole, solidifying India’s status as a leading spacefaring nation. This achievement has transformed global perceptions, but also spurred significant investment in India’s thriving space sector. Suraksha P examines the current investment trends and developments.","content":"A year has passed since Chandrayaan-3’s historic landing near the Moon’s south pole, solidifying India’s status as a leading spacefaring nation. This achievement has transformed global perceptions, but also spurred significant investment in India’s thriving space sector. Suraksha P examines the current investment trends and developments.Did Chandrayaan-3’s success attract investments for the Indian space sector?“The government had already laid the groundwork through policy reforms and the creation of IN-SPACe to actively encourage private sector participation. However, Chandrayaan-3 provided a decisive push that captured the world’s attention, significantly amplifying investor interest in the rapidly growing space sector,” Pawan Goenka, Chairman, IN-SPACe.“The satellite launch vehicle market is grim and there are rockets available but are waiting for demand.”S Somanath, chairman, ISRO, at 155th Synergia Forum, Bengaluru, on June 13","cleaned_content":"a year has passed since chandrayaan \u003cTHREE_\u003e s historic landing near the moon s south pole solidifying india s status as a leading spacefaring nation this achievement has transformed global perceptions but also spurred significant investment in india s thriving space sector suraksha p examines the current investment trends and developments did chandrayaan \u003cTHREE_\u003e s success attract investments for the indian space sector the government had already laid the groundwork through policy reforms and the creation of in space to actively encourage private sector participation however chandrayaan \u003cTHREE_\u003e provided a decisive push that captured the world s attention significantly amplifying investor interest in the rapidly growing space sector pawan goenka chairman in space the satellite launch vehicle market is grim and there are rockets available but are waiting for demand s somanath chairman isro at \u003cONE_HUNDRED\u003e th synergia forum bengaluru on june \u003cONE_TEN\u003e","timestamp":"2024-08-26T20:15:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}