{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-sues-software-rival-infosys-over-trade-secrets/articleshow/112746376.cms","title":"Cognizant sues software rival Infosys over trade secrets","description":"Cognizant TriZetto sued Infosys in Texas, alleging that Infosys stole trade secrets from its healthcare insurance software. Cognizant claims Infosys extracted data from its Facets and QNXT software to develop and sell competing products. The company is seeking monetary damages and an injunction to prevent further misuse of its trade secrets.","content":"Cognizant TriZetto has sued Indian IT service major Infosys in Texas federal court on Friday, accusing the latter of stealing trade secrets related to its healthcare insurance software, as per reports. This comes 8 months after Infosys sent a missive to Cognizant accusing the US-based IT firm of unfair employee poaching.As per reports, Cognizant said in the lawsuit that Infosys illegally extracted data from its databases and used the same to build a competing software. Comments sought from Cognizant didn’t come till the press time, even as an Infosys spokesperson said, “Infosys is aware of the lawsuit. We deny all allegations and will defend our position in the court.”New Jersey-based Cognizant's software includes TriZetto's Facets and QNXT, used by healthcare insurance companies to automate administrative tasks. The reports added that “Infosys misused TriZetto's software to create ‘Test Cases for Facets,’ which improperly repackaged TriZetto's data into an Infosys product.”Cognizant in the complaint also said that the Bengaluru-based Indian IT major breached the law by creating software to extract data from QNXT that includes confidential TriZetto information and trade secrets.As monetary damages, Cognizant has asked the court for an unspecified amount, and an order to Infosys to stop misusing its trade secrets.","cleaned_content":"cognizant trizetto has sued indian it service major infosys in texas federal court on friday accusing the latter of stealing trade secrets related to its healthcare insurance software as per reports this comes \u003cEIGHT_\u003e months after infosys sent a missive to cognizant accusing the us based it firm of unfair employee poaching as per reports cognizant said in the lawsuit that infosys illegally extracted data from its databases and used the same to build a competing software comments sought from cognizant didn t come till the press time even as an infosys spokesperson said infosys is aware of the lawsuit we deny all allegations and will defend our position in the court new jersey based cognizants software includes trizettos facets and qnxt used by healthcare insurance companies to automate administrative tasks the reports added that infosys misused trizettos software to create test cases for facets which improperly repackaged trizettos data into an infosys product cognizant in the complaint also said that the bengaluru based indian it major breached the law by creating software to extract data from qnxt that includes confidential trizetto information and trade secrets as monetary damages cognizant has asked the court for an unspecified amount and an order to infosys to stop misusing its trade secrets","timestamp":"2024-08-23T23:16:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}