{"url":"https://economictimes.indiatimes.com/tech/technology/blinkit-seeing-growth-in-smaller-cities-zomato-cfo-akshant-goyal/articleshow/112862643.cms","title":"Blinkit seeing growth in smaller cities: Zomato CFO Akshant Goyal","description":"Zomato's quick commerce platform, Blinkit, is expanding into smaller cities while continuing its focus on large metropolitan areas. Quick commerce platform’s growth in FY24 was primarily on account of addition of dark stores and products, Zomato chairman said.","content":"Quick commerce platform Blinkit is witnessing growth in smaller cities as well and the plan is to widen its footprint gradually, Akshant Goyal, chief financial officer of its parent company, Zomato, said on Wednesday.Goyal was speaking at Zomato’s annual general meeting for 2023-24.“We’re in about 26 cities today and are seeing this business (quick commerce) growing in some of the smaller cities where we’ve launched as well. Slowly and steadily we want to expand and get into more cities,” he said. “Even in the large cities…in the main metros there is a lot of room for growth, so the majority of our focus will be on large cities, but we will continue to expand into smaller cities over time.”According to several brokerage firms, Blinkit contributes more to Zomato’s market cap than its mainstay food delivery business. The quick commerce platform, which was acquired by Zomato in 2022, plans to double the count of its dark stores, or micro warehouses, to 1,000 by the end of FY25 and to more than 2,000 by 2026.Zomato’s chairman Kaushik Dutta said the growth clocked by Blinkit in the previous financial year was primarily on account of addition of dark stores and expansion of the assortment of products it sells.","cleaned_content":"quick commerce platform blinkit is witnessing growth in smaller cities as well and the plan is to widen its footprint gradually akshant goyal chief financial officer of its parent company zomato said on wednesday goyal was speaking at zomato s annual general meeting for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e we re in about \u003cTWO_TEN\u003e cities today and are seeing this business quick commerce growing in some of the smaller cities where we ve launched as well slowly and steadily we want to expand and get into more cities he said even in the large cities in the main metros there is a lot of room for growth so the majority of our focus will be on large cities but we will continue to expand into smaller cities over time according to several brokerage firms blinkit contributes more to zomato s market cap than its mainstay food delivery business the quick commerce platform which was acquired by zomato in \u003cTWO_THOUSAND\u003e plans to double the count of its dark stores or micro warehouses to \u003cONE_THOUSAND\u003e by the end of fy25 and to more than \u003cTWO_THOUSAND\u003e by \u003cTWO_THOUSAND\u003e zomato s chairman kaushik dutta said the growth clocked by blinkit in the previous financial year was primarily on account of addition of dark stores and expansion of the assortment of products it sells","timestamp":"2024-08-28T15:39:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}