{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-to-offer-products-on-ondc/articleshow/112895676.cms","title":"Ola Electric to offer products on ONDC","description":"Bhavish Aggarwal announced on X that all products by Ola Electric will be available on the government's ONDC. He said the products can be bought on the ONDC's buyer side apps like Ola Cabs, MagicPin and Paytm.","content":"Ola group founder Bhavish Aggarwal on Thursday said all of Ola Electric’s products will be available on the government-backed Open Network for Digital Commerce (ONDC).Aggarwal made the announcement in a post on microblogging platform X. The products will be available on ONDC’s buyer side apps like Ola Cabs, MagicPin and Paytm, a person in the know said.  On August 15, ET had reported on Ola Cabs rebranding itself to Ola Consumer to expand its services beyond ride hailing. It also announced fully automated dark stores - placed inside container-like structures, designed and manufactured in-house - that will be offered to direct-to-consumer (D2C) brands and other sellers on the ONDC. The dark stores will be able to store 1.2 lakh items with automated storage and restocking, serving 7,000-10,000 orders per day at the rate of 60 seconds per order, Aggarwal had said at the time. They will be available from the end of calendar year 2024. Ola Consumer will also be offering automated warehousing services to ONDC participants, and is working with brands like ITC, Marico and Bombay Shaving Company for the same. On August 15, the firm also launched Ola Pay, which allows payments for rides, food and groceries through UPI on the Ola app.","cleaned_content":"ola group founder bhavish aggarwal on thursday said all of ola electric s products will be available on the government backed open network for digital commerce ondc aggarwal made the announcement in a post on microblogging platform x the products will be available on ondc s buyer side apps like ola cabs magicpin and paytm a person in the know said on august \u003cONE_TEN\u003e et had reported on ola cabs rebranding itself to ola consumer to expand its services beyond ride hailing it also announced fully automated dark stores placed inside container like structures designed and manufactured in house that will be offered to direct to consumer d2c brands and other sellers on the ondc the dark stores will be able to store \u003cONE_\u003e lakh items with automated storage and restocking serving \u003cSEVEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e orders per day at the rate of \u003cSIX_TEN\u003e seconds per order aggarwal had said at the time they will be available from the end of calendar year \u003cTWO_THOUSAND\u003e ola consumer will also be offering automated warehousing services to ondc participants and is working with brands like itc marico and bombay shaving company for the same on august \u003cONE_TEN\u003e the firm also launched ola pay which allows payments for rides food and groceries through upi on the ola app","timestamp":"2024-08-29T16:10:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}