{"url":"https://economictimes.indiatimes.com/tech/technology/paytm-issues-clarification-on-sebi-show-cause-notice-says-not-a-new-development/articleshow/112809263.cms","title":"Paytm issues clarification on Sebi show-cause notice, says not a new development","description":"One 97 Communications, which operates fintech platform Paytm said that the show-cause notice to the company as reported by the the media today by the market regulator Securities and Exchange Board of India (Sebi), was not a new development and the company had already made relevant disclosures on this matter in its financial results for the quarter and year ended March and June quarters.","content":"One 97 Communications, which operates fintech platform Paytm, on Monday said that the show-cause notice to the company as reported by the media was not a new development and the company had already made relevant disclosures on this matter in its financial results for the quarter and year ended March and June.The company's clarification further said that \"there is no impact on the financial results for previous quarters ended June 30, 2024, and March 31, 2024, respectively,\".The core issue revolves around Sharma’s classification as a promoter, despite holding management control rather than merely being an employee when filing the IPO documents. This classification is crucial because SEBI regulations prohibit promoters from receiving employee stock options (ESOPs) post-IPO. The probe was reportedly triggered by inputs from the Reserve Bank of India (RBI), which had earlier examined Paytm Payments Bank.One 97 Communication's Monday filing shared links of its earnings over the March and June quarters where it specified the page and paragraph numbers on which it said that it had then shared the information of the above issues pointed out in the reports. \"The company during year ended March 31, 2022 granted 21,000,000 Employee Stock Options to Managing Director and CEO of the Company which is subject to achievement of specified milestones. During the previous quarter, the Company had received a Show Cause Notice (\"SCN\") from SEBI related to the above options regarding compliance with SEBI SBEB Regulations. The Company had submitted its preliminary response and is in the process of seeking further information from SEBI in this regard. Based on an independent legal opinion obtained by the management, it believes that the Company is compliant with the relevant regulations. Accordingly, there is no impact on the financial results for the current and previous quarter ended June 30, 2024 and March 31, 2024, respectively,\" the July 19, 2024 filing said.","cleaned_content":"one \u003cNINE_TEN\u003e communications which operates fintech platform paytm on monday said that the show cause notice to the company as reported by the media was not a new development and the company had already made relevant disclosures on this matter in its financial results for the quarter and year ended march and june the companys clarification further said that there is no impact on the financial results for previous quarters ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e respectively the core issue revolves around sharma s classification as a promoter despite holding management control rather than merely being an employee when filing the ipo documents this classification is crucial because sebi regulations prohibit promoters from receiving employee stock options esops post ipo the probe was reportedly triggered by inputs from the reserve bank of india rbi which had earlier examined paytm payments bank one \u003cNINE_TEN\u003e communications monday filing shared links of its earnings over the march and june quarters where it specified the page and paragraph numbers on which it said that it had then shared the information of the above issues pointed out in the reports the company during year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e granted \u003cTWO_TEN_MILLION\u003e employee stock options to managing director and ceo of the company which is subject to achievement of specified milestones during the previous quarter the company had received a show cause notice scn from sebi related to the above options regarding compliance with sebi sbeb regulations the company had submitted its preliminary response and is in the process of seeking further information from sebi in this regard based on an independent legal opinion obtained by the management it believes that the company is compliant with the relevant regulations accordingly there is no impact on the financial results for the current and previous quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e respectively the july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e filing said","timestamp":"2024-08-26T17:31:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}