{"url":"https://economictimes.indiatimes.com/tech/technology/electronics-hardware-industry-seeks-clarification-on-policy-for-imports-of-computer-products/articleshow/112714916.cms","title":"Electronics hardware industry seeks clarification on policy for imports of computer products","description":"Earlier in August 2023, the government imposed restrictions on certain IT hardware goods, and later after domestic and foreign firms flagged their concerns, in October 2023, the government tweaked curbs on imports of laptops and computers. It allowed importers to bring in shipments of this hardware from overseas on a mere 'authorization' upon detailing quantity and value.","content":"The electronics hardware industry on Thursday wrote to the Ministry of Electronics and Information Technology (MeitY) to seek clarification related to the future policy plans for imports of some computer products in HS 8471 and urged the Ministry for increased stakeholder engagement.Earlier in August 2023, the government imposed restrictions on certain IT hardware goods, and later after domestic and foreign firms flagged their concerns, in October 2023, the government tweaked curbs on imports of laptops and computers. It allowed importers to bring in shipments of this hardware from overseas on a mere 'authorization' upon detailing quantity and value.\"We welcomed the government’s efforts to work with stakeholders last year to prepare for implementation and to clarify administrative procedures. Further, this approach addressed many stakeholder concerns about potential import licensing requirements and restrictions,\" ITI Council Country Director, India Kumar Deep said in the letter addressed to MeitY Secretary S Krishnan that has been reviewed by ET.He said that as the potential end date of the registration/license approaches, it was \"critical\" that the government again took actions to enable early stakeholder engagement to ensure these goods remained available in India \"to prevent far-reaching unintended consequences on key sectors.\"The Import Management System (IMS) for ICT hardware products which was launched last year is likely to end on September 30, 2024. As per the new 'import management system', the government aims to monitor shipments of laptops, tablets, and computers into the country without hurting the market supply or creating a cumbersome licensing regime. The government had said that the importers were allowed to apply for multiple authorizations and those authorizations would be valid up to September 30.","cleaned_content":"the electronics hardware industry on thursday wrote to the ministry of electronics and information technology meity to seek clarification related to the future policy plans for imports of some computer products in hs \u003cEIGHT_THOUSAND\u003e and urged the ministry for increased stakeholder engagement earlier in august \u003cTWO_THOUSAND\u003e the government imposed restrictions on certain it hardware goods and later after domestic and foreign firms flagged their concerns in october \u003cTWO_THOUSAND\u003e the government tweaked curbs on imports of laptops and computers it allowed importers to bring in shipments of this hardware from overseas on a mere authorization upon detailing quantity and value we welcomed the government s efforts to work with stakeholders last year to prepare for implementation and to clarify administrative procedures further this approach addressed many stakeholder concerns about potential import licensing requirements and restrictions iti council country director india kumar deep said in the letter addressed to meity secretary s krishnan that has been reviewed by et he said that as the potential end date of the registration license approaches it was critical that the government again took actions to enable early stakeholder engagement to ensure these goods remained available in india to prevent far reaching unintended consequences on key sectors the import management system ims for ict hardware products which was launched last year is likely to end on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as per the new import management system the government aims to monitor shipments of laptops tablets and computers into the country without hurting the market supply or creating a cumbersome licensing regime the government had said that the importers were allowed to apply for multiple authorizations and those authorizations would be valid up to september \u003cTHREE_TEN\u003e","timestamp":"2024-08-22T18:38:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}