{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-food-delivery-giant-meituan-beats-revenue-estimates/articleshow/112862621.cms","title":"Chinese food delivery giant Meituan beats revenue estimates","description":"Meituan, which has an app that provides services as varied as bike-sharing, ticket-booking and maps, reported revenue in the three months to June 30 at 82.3 billion yuan ($11.55 billion), up from 67.9 billion yuan in the same period a year earlier.","content":"Chinese food delivery giant Meituan posted a bigger than expected 21% rise in second-quarter revenue on Wednesday, defying a slowing Chinese economy. Meituan, which has an app that provides services as varied as bike-sharing, ticket-booking and maps, reported revenue in the three months to June 30 at 82.3 billion yuan ($11.55 billion), up from 67.9 billion yuan in the same period a year earlier.  That compared with 81 billion yuan average of analyst estimates compiled by LSEG. Its total segment operating profit for the second quarter increased from 5.9 billion yuan to 13.9 billion yuan, and the total segment operating margin increased from 8.7% to 16.9%. A lacklustre economic recovery in China has led to more firms pivoting towards low-cost and discounted products in the world's second-largest economy and Meituan has benefitted from delivering these goods for a small fee.","cleaned_content":"chinese food delivery giant meituan posted a bigger than expected \u003cTWO_TEN_PERCENT\u003e rise in second quarter revenue on wednesday defying a slowing chinese economy meituan which has an app that provides services as varied as bike sharing ticket booking and maps reported revenue in the three months to june \u003cTHREE_TEN\u003e at \u003cEIGHT_TEN\u003e billion yuan \u003cONE_TEN\u003e billion up from \u003cSIX_TEN\u003e billion yuan in the same period a year earlier that compared with \u003cEIGHT_TEN\u003e billion yuan average of analyst estimates compiled by lseg its total segment operating profit for the second quarter increased from \u003cFIVE_\u003e billion yuan to \u003cONE_TEN\u003e billion yuan and the total segment operating margin increased from \u003cEIGHT_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e a lacklustre economic recovery in china has led to more firms pivoting towards low cost and discounted products in the worlds second largest economy and meituan has benefitted from delivering these goods for a small fee","timestamp":"2024-08-28T14:48:00+05:30","market_timestamp":"2024-08-28T14:48:00+05:30","off_market_hours":false}