{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-must-face-lawsuit-over-10-year-old-girls-death-us-court-rules/articleshow/112869515.cms","title":"TikTok must face lawsuit over 10-year-old girl's death, US court rules","description":"While a federal law typically shields internet companies from lawsuits over content posted by users, the Philadelphia-based 3rd US Circuit Court of Appeals on Tuesday ruled the law does not bar Nylah Anderson's mother from pursuing claims that TikTok's algorithm recommended the challenge to her daughter.","content":"A US appeals court has revived a lawsuit against TikTok by the mother of a 10-year-old girl who died after taking part in a viral \"blackout challenge\" in which users of the social media platform were dared to choke themselves until they passed out. While a federal law typically shields internet companies from lawsuits over content posted by users, the Philadelphia-based 3rd US Circuit Court of Appeals on Tuesday ruled the law does not bar Nylah Anderson's mother from pursuing claims that TikTok's algorithm recommended the challenge to her daughter. US Circuit Judge Patty Shwartz, writing for the three-judge panel, said that Section 230 of the Communications Decency Act of 1996 only immunizes information provided by third parties and not recommendations TikTok itself made via an algorithm underlying its platform. She acknowledged the holding was a departure from past court rulings by her court and others holding that Section 230 immunizes an online platform from liability for failing to prevent users from transmitting harmful messages to others. But she said that reasoning no longer held after a US Supreme Court ruling in July on whether state laws designed to restrict the power of social media platforms to curb content they deem objectionable violate their free speech rights.","cleaned_content":"a us appeals court has revived a lawsuit against tiktok by the mother of a \u003cONE_TEN\u003e year old girl who died after taking part in a viral blackout challenge in which users of the social media platform were dared to choke themselves until they passed out while a federal law typically shields internet companies from lawsuits over content posted by users the philadelphia based \u003cTHREE_\u003e rd us circuit court of appeals on tuesday ruled the law does not bar nylah andersons mother from pursuing claims that tiktoks algorithm recommended the challenge to her daughter us circuit judge patty shwartz writing for the three judge panel said that section \u003cTWO_HUNDRED\u003e of the communications decency act of \u003cONE_THOUSAND\u003e only immunizes information provided by third parties and not recommendations tiktok itself made via an algorithm underlying its platform she acknowledged the holding was a departure from past court rulings by her court and others holding that section \u003cTWO_HUNDRED\u003e immunizes an online platform from liability for failing to prevent users from transmitting harmful messages to others but she said that reasoning no longer held after a us supreme court ruling in july on whether state laws designed to restrict the power of social media platforms to curb content they deem objectionable violate their free speech rights","timestamp":"2024-08-28T18:14:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}