{"url":"https://economictimes.indiatimes.com/tech/information-tech/amid-cautious-hiring-internship-becomes-mandatory-and-extended/articleshow/112872620.cms","title":"Extended internships are the order of the day at IT companies amid cautious hiring","description":"It’s a new trend that has emerged this year, said KS Shridhar, dean – placement and training, at Bengaluru-based PES University. It’s not just longer internships. There is also a reduction in the pay packages on offer, according to a placement officer at National Institute of Engineering in Mysuru.","content":"IT companies are increasingly insisting that freshers undergo mandatory internships with them for an extended period before they make the final offers, delaying the hiring process that has just started seeing some activity after a washout year.Placement officers in several tier-1 and -2 engineering colleges that ET spoke to said internships, which used to be six months, have now been extended by another four-six months.“Employers are increasingly seeking fresh graduates with internship experience in AI/ML, data roles, model development and analytics,” said Munira Loliwala, vice president, strategy and growth, at staffing services firm TeamLease Digital. “The shortage of skilled entry-level talent has led companies to offer extended internships, enhancing the likelihood of hiring through management trainee programs later.”  ","cleaned_content":"it companies are increasingly insisting that freshers undergo mandatory internships with them for an extended period before they make the final offers delaying the hiring process that has just started seeing some activity after a washout year placement officers in several tier \u003cONE_\u003e and \u003cTWO_\u003e engineering colleges that et spoke to said internships which used to be six months have now been extended by another four six months employers are increasingly seeking fresh graduates with internship experience in ai ml data roles model development and analytics said munira loliwala vice president strategy and growth at staffing services firm teamlease digital the shortage of skilled entry level talent has led companies to offer extended internships enhancing the likelihood of hiring through management trainee programs later","timestamp":"2024-08-29T10:15:00+05:30","market_timestamp":"2024-08-29T10:15:00+05:30","off_market_hours":false}