{"url":"https://economictimes.indiatimes.com/tech/technology/cloud-analytics-firm-snowflake-raises-annual-product-revenue-forecast-unchanged-margins-weigh-on-shares/articleshow/112700120.cms","title":"Cloud analytics firm Snowflake raises annual product revenue forecast, unchanged margins weigh on shares","description":"Snowflake executives said on a post-earnings conference call that they left the margin forecast unchanged partly due to the firm awaiting the deployments of certain GPUs. The company now expects product revenue of $3.36 billion for fiscal 2025, up from its prior forecast of $3.30 billion.","content":"Data cloud analytics firm Snowflake on Wednesday raised its forecast for full-year product revenue, as it attracts more clients to its cloud platform owing to advancements in artificial intelligence. However, shares of the firm fell more than 8% in extended trading. D.A. Davidson analyst Gil Luria attributed the drop to the company not pairing the rise in revenue projections with a rise in margin forecast. Snowflake executives said on a post-earnings conference call that they left the margin forecast unchanged partly due to the firm awaiting the deployments of certain GPUs.  The company now expects product revenue of $3.36 billion for fiscal 2025, up from its prior forecast of $3.30 billion. It also authorized the buyback of an additional $2.5 billion worth of the company's shares through March 2027.","cleaned_content":"data cloud analytics firm snowflake on wednesday raised its forecast for full year product revenue as it attracts more clients to its cloud platform owing to advancements in artificial intelligence however shares of the firm fell more than \u003cEIGHT_PERCENT\u003e in extended trading d a davidson analyst gil luria attributed the drop to the company not pairing the rise in revenue projections with a rise in margin forecast snowflake executives said on a post earnings conference call that they left the margin forecast unchanged partly due to the firm awaiting the deployments of certain gpus the company now expects product revenue of \u003cTHREE_\u003e billion for fiscal \u003cTWO_THOUSAND\u003e up from its prior forecast of \u003cTHREE_\u003e billion it also authorized the buyback of an additional \u003cTWO_\u003e billion worth of the companys shares through march \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-22T11:04:00+05:30","market_timestamp":"2024-08-22T11:04:00+05:30","off_market_hours":false}