{"url":"https://economictimes.indiatimes.com/tech/technology/perfios-appoints-ex-infosys-executive-rajesh-kini-as-cfo/articleshow/112674755.cms","title":"Perfios appoints ex-Infosys executive Rajesh Kini as CFO","description":"With about 25 years of experience in financial leadership roles, Rajesh Kini comes with a track record of driving growth by optimising financial performance, bolstering margins, strengthening fiscal health and enhancing operational efficiency, according to the company.","content":"Perfios, a business-to-business software-as-a-service fintech company, has appointed Rajesh Kini as its chief financial officer (CFO). With about 25 years of experience in financial leadership roles, Kini comes with a track record of driving growth by optimising financial performance, bolstering margins, strengthening fiscal health and enhancing operational efficiency, according to the company.He joins Perfios from Infosys, where he served as CFO of the product subsidiary and headed the Corporate Accounting Group. In his new role, he will spearhead financial operations and governance, enabling the company to drive its next phase of growth. “Rajesh’s deep financial expertise and proven leadership in driving growth and financial efficiency will be instrumental as we embark on our next phase of expansion. His strategic insights and experience will enhance our financial strategy and help us achieve our vision of transforming the financial technology landscape both in India and globally,\" said Sabyasachi Goswami, CEO, Perfios. Kini said, “Perfios is a made-in-India-for-the-world brand that exemplifies the potential of our innovations in the financial sector. I look forward to working with the team to further optimise our financial efficiency, enhance financial governance, drive strategic investments and maintain sustained profitability and growth for the future.” ","cleaned_content":"perfios a business to business software as a service fintech company has appointed rajesh kini as its chief financial officer cfo with about \u003cTWO_TEN\u003e years of experience in financial leadership roles kini comes with a track record of driving growth by optimising financial performance bolstering margins strengthening fiscal health and enhancing operational efficiency according to the company he joins perfios from infosys where he served as cfo of the product subsidiary and headed the corporate accounting group in his new role he will spearhead financial operations and governance enabling the company to drive its next phase of growth rajesh s deep financial expertise and proven leadership in driving growth and financial efficiency will be instrumental as we embark on our next phase of expansion his strategic insights and experience will enhance our financial strategy and help us achieve our vision of transforming the financial technology landscape both in india and globally said sabyasachi goswami ceo perfios kini said perfios is a made in india for the world brand that exemplifies the potential of our innovations in the financial sector i look forward to working with the team to further optimise our financial efficiency enhance financial governance drive strategic investments and maintain sustained profitability and growth for the future","timestamp":"2024-08-21T13:14:00+05:30","market_timestamp":"2024-08-21T13:14:00+05:30","off_market_hours":false}