{"url":"https://economictimes.indiatimes.com/tech/technology/apple-to-hold-fall-event-on-september-9-new-iphones-expected/articleshow/112814849.cms","title":"Apple to hold fall event on September 9, new iPhones expected","description":"Analysts see a strong upgrade cycle for the new iPhone series with AI features expected to be the key selling point for the new devices.","content":"Apple said on Monday it will hold its fall event on Sept. 9 in Cupertino, California, during which it is expected to launch its new iPhone series. Analysts see a strong upgrade cycle for the new iPhone series with AI features expected to be the key selling point for the new devices. During its annual developer conference in June, Apple unveiled a long-awaited AI strategy, integrating its new \"Apple Intelligence\" technology across its suite of apps, including Siri, and bringing OpenAI's chatbot ChatGPT to its devices. The upcoming launches will be crucial for Apple as it looks to reverse a global slowdown in sales, particularly in China.  It will also show more clearly how Apple is integrating AI across its next generation devices.","cleaned_content":"apple said on monday it will hold its fall event on sept \u003cNINE_\u003e in cupertino california during which it is expected to launch its new iphone series analysts see a strong upgrade cycle for the new iphone series with ai features expected to be the key selling point for the new devices during its annual developer conference in june apple unveiled a long awaited ai strategy integrating its new apple intelligence technology across its suite of apps including siri and bringing openais chatbot chatgpt to its devices the upcoming launches will be crucial for apple as it looks to reverse a global slowdown in sales particularly in china it will also show more clearly how apple is integrating ai across its next generation devices","timestamp":"2024-08-26T22:15:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}