{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-introduces-food-expense-management-platform-zomato-for-enterprise/articleshow/112865929.cms","title":"Zomato introduces food expense management platform 'Zomato for Enterprise'","description":"Legends offered iconic dishes from 10 cities to other parts of the country. The company had earlier put on hold the service and restarted it in July with a few tweaks.","content":"Zomato CEO Deepinder Goyal on Wednesday announced that the food delivery giant is set to introduce Zomato For Enterprise (ZFE) for companies to solve food expense management. The introduction of ZFE comes nearly a week after the company shut down its 'Intercity Legends' service.  Legends offered iconic dishes from 10 cities to other parts of the country. The company had earlier put on hold the service and restarted it in July with a few tweaks.  In a post on micro-blogging platform X, formerly Twitter, Goyal shared that over 100 top companies are already using ZFE, and their feedback has helped shape this initiative. \"Excited to introduce Zomato for Enterprise (ZFE), a platform designed for companies to solve food expense management. A lot of Zomato orders placed by corporate employees are business-related and need to be reimbursed by the company. The reimbursement process is cumbersome and time-consuming. ","cleaned_content":"zomato ceo deepinder goyal on wednesday announced that the food delivery giant is set to introduce zomato for enterprise zfe for companies to solve food expense management the introduction of zfe comes nearly a week after the company shut down its intercity legends service legends offered iconic dishes from \u003cONE_TEN\u003e cities to other parts of the country the company had earlier put on hold the service and restarted it in july with a few tweaks in a post on micro blogging platform x formerly twitter goyal shared that over \u003cONE_HUNDRED\u003e top companies are already using zfe and their feedback has helped shape this initiative excited to introduce zomato for enterprise zfe a platform designed for companies to solve food expense management a lot of zomato orders placed by corporate employees are business related and need to be reimbursed by the company the reimbursement process is cumbersome and time consuming","timestamp":"2024-08-28T16:20:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}