{"url":"https://economictimes.indiatimes.com/tech/technology/halliburton-probes-impact-of-cyber-attack-with-law-enforcement/articleshow/112754101.cms","title":"Halliburton probes impact of cyber attack with law enforcement","description":"Halliburton became aware of the cyber attack on Wednesday, it said in its first securities filing about the breach, adding its \"ongoing investigation and response included restoration of its systems and assessment of materiality.\"","content":"Top U.S. oilfield services firm Halliburton said on Friday it was working with law enforcement to determine the extent of a computer systems breach and was yet to determine if the incident would have a material impact on its business. The $23-billion company became aware of the cyber attack on Wednesday, it said in its first securities filing about the breach, adding its \"ongoing investigation and response included restoration of its systems and assessment of materiality.\"  The company also said it had taken certain systems offline to protect them. A spokesperson declined to comment on whether the company had been contacted by the people behind the breach.  Reuters was the first to report about the cyber attack on Wednesday. ","cleaned_content":"top u s oilfield services firm halliburton said on friday it was working with law enforcement to determine the extent of a computer systems breach and was yet to determine if the incident would have a material impact on its business the \u003cTWO_TEN\u003e billion company became aware of the cyber attack on wednesday it said in its first securities filing about the breach adding its ongoing investigation and response included restoration of its systems and assessment of materiality the company also said it had taken certain systems offline to protect them a spokesperson declined to comment on whether the company had been contacted by the people behind the breach reuters was the first to report about the cyber attack on wednesday","timestamp":"2024-08-24T09:02:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}