{"url":"https://economictimes.indiatimes.com/tech/technology/sebi-pulls-up-paytm-founder-director-on-ipo-breaches-report/articleshow/112809913.cms","title":"Sebi pulls up Paytm founder Vijay Shekhar Sharma, director on IPO breaches: report","description":"The issue revolves around whether Sharma should have been classified as a large shareholder, rather than an employee, when Paytm filed its IPO papers, the report said, citing two people aware of the matter.","content":"Markets regulator Sebi has issued show-cause notices to Paytm founder Vijay Shekhar Sharma and other board members who held roles during the firm's November 2021 IPO over alleged misrepresentation of facts, Moneycontrol reported on Monday. The issue revolves around whether Sharma should have been classified as a large shareholder, rather than an employee, when Paytm filed its IPO papers, the report said, citing two people aware of the matter. Sebi has questioned directors at the time for backing Sharma's view of not being a large shareholder, the report said. Sharma is classified as a public shareholder, not a large shareholder, according to exchange data, which also says Paytm has no investors categorised as \"large shareholders.\" \"The company is in regular communication with the Sebi and making necessary representations regarding this matter,\" Paytm said, adding it has already disclosed the notice in its quarterly earnings filing.","cleaned_content":"markets regulator sebi has issued show cause notices to paytm founder vijay shekhar sharma and other board members who held roles during the firms november \u003cTWO_THOUSAND\u003e ipo over alleged misrepresentation of facts moneycontrol reported on monday the issue revolves around whether sharma should have been classified as a large shareholder rather than an employee when paytm filed its ipo papers the report said citing two people aware of the matter sebi has questioned directors at the time for backing sharmas view of not being a large shareholder the report said sharma is classified as a public shareholder not a large shareholder according to exchange data which also says paytm has no investors categorised as large shareholders the company is in regular communication with the sebi and making necessary representations regarding this matter paytm said adding it has already disclosed the notice in its quarterly earnings filing","timestamp":"2024-08-26T17:34:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}