{"url":"https://economictimes.indiatimes.com/tech/technology/upi-market-share-cap-directive-a-spoiler-for-ipo-plans-phonepes-sameer-nigam/articleshow/112868780.cms","title":"UPI market share cap directive a spoiler for IPO plans: PhonePe’s Sameer Nigam","description":"PhonePe, a Walmart-backed entity, is the largest UPI payment app in India and holds around 48% of the market share in terms of transaction volume. However, the central government and the National Payments Corporation of India (NPCI) had proposed a 30% market share cap in the UPI segment earlier to prevent market concentration and duopoly.","content":"Sameer Nigam, chief executive of fintech major PhonePe, said the 30% market share cap directive on the Unified Payments Interface (UPI) segment is hindering the company’s initial public offering (IPO) plans.“We cannot go public if there is uncertainty on the regulatory side. If you are buying a share at Rs 100 and you price it assuming we have 48-49% market share, then there is an uncertainty about whether it will come down to 30% and by when,” Nigam said on the sidelines of the Global Fintech Fest held in Mumbai.“We are requesting them (the regulator) if they can find another way to at least solve whatever their concerns are or tell us what the list of concerns is,” he added.Walmart-backed PhonePe is the largest UPI payment app in India, holding around 48% of the market share in terms of transaction volume.   ","cleaned_content":"sameer nigam chief executive of fintech major phonepe said the \u003cTHREE_TEN_PERCENT\u003e market share cap directive on the unified payments interface upi segment is hindering the company s initial public offering ipo plans we cannot go public if there is uncertainty on the regulatory side if you are buying a share at rs \u003cONE_HUNDRED\u003e and you price it assuming we have \u003cFOUR_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e market share then there is an uncertainty about whether it will come down to \u003cTHREE_TEN_PERCENT\u003e and by when nigam said on the sidelines of the global fintech fest held in mumbai we are requesting them the regulator if they can find another way to at least solve whatever their concerns are or tell us what the list of concerns is he added walmart backed phonepe is the largest upi payment app in india holding around \u003cFOUR_TEN_PERCENT\u003e of the market share in terms of transaction volume","timestamp":"2024-08-28T19:34:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}