{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-internet-giant-baidu-posts-flat-revenue-as-consumption-slumps/articleshow/112710444.cms","title":"Chinese internet giant Baidu posts flat revenue as consumption slumps","description":"Chinese internet giant Baidu posted flat second-quarter revenue on Thursday, as an uncertain economic outlook in the country weighs on household consumption. Baidu faces stiff competition from fellow Chinese internet giants, such as Tencent, operator of \"super-app\" WeChat, and ByteDance, creator of TikTok and its local version Douyin.","content":"Chinese internet giant Baidu posted flat second-quarter revenue on Thursday, as an uncertain economic outlook in the country weighs on household consumption.Baidu, which operates China's top search engine, derives a large part of its sales from advertising -- a sector vulnerable to slumps in personal and business spending.Its second-quarter revenue was 33.93 billion yuan ($4.67 billion), remaining level year-on-year, according to a filing with the Hong Kong Stock Exchange.The latest figure compares to the 34.06 billion yuan posted in the same period of 2023.Net profit during the second quarter stood at 5.5 billion yuan ($770 million), the statement added, up five percent year-on-year.","cleaned_content":"chinese internet giant baidu posted flat second quarter revenue on thursday as an uncertain economic outlook in the country weighs on household consumption baidu which operates chinas top search engine derives a large part of its sales from advertising a sector vulnerable to slumps in personal and business spending its second quarter revenue was \u003cTHREE_TEN\u003e billion yuan \u003cFOUR_\u003e billion remaining level year on year according to a filing with the hong kong stock exchange the latest figure compares to the \u003cTHREE_TEN\u003e billion yuan posted in the same period of \u003cTWO_THOUSAND\u003e net profit during the second quarter stood at \u003cFIVE_\u003e billion yuan \u003cSEVEN_HUNDRED\u003e million the statement added up five percent year on year","timestamp":"2024-08-22T16:12:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}