{"url":"https://economictimes.indiatimes.com/tech/technology/medikabazaar-appoints-dinesh-lodha-as-new-ceo-amid-leadership-changes/articleshow/112865168.cms","title":"Medikabazaar appoints Dinesh Lodha as new CEO amid leadership changes","description":"Dinesh Lodha comes in place of Vivek Tiwari, the company’s cofounder who stepped down from the CEO’s position in the backdrop of the company facing allegations of financial discrepancies. Medikabazaar, last valued at $650 million, had appointed former Jet Airways CFO Ravishankar Gopalakrishnan as group chief operating officer and whole-time director in April.","content":"Business-to-business medical supplies startup Medikabazaar on Wednesday said it has appointed Dinesh Lodha as its group chief executive officer. He was earlier with medical devices firm TI Medical.Lodha comes in place of Vivek Tiwari, the company’s cofounder who stepped down from the CEO’s position in the backdrop of the company facing allegations of financial discrepancies. On July 9, ET was the first to report about the Mumbai-based company undergoing a management reshuffle, with Tiwari taking on a board role amid a financial audit.The financial audit of the Creaegis-backed company was conducted by PwC. It is believed to have found discrepancies in Medikabazaar's revenue recognition process, among other issues.Tiwari had started Medikabazaar in 2014 along with Ketan Malkan. Malkan was the company’s chief financial officer until July 2023. Since then, he has transitioned to a board role. Malkan was replaced by Raman Chawla–former top finance executive at companies such as Campus Activewear and Reckitt Benckiser–as Medikabazaar’s CFO.","cleaned_content":"business to business medical supplies startup medikabazaar on wednesday said it has appointed dinesh lodha as its group chief executive officer he was earlier with medical devices firm ti medical lodha comes in place of vivek tiwari the company s cofounder who stepped down from the ceo s position in the backdrop of the company facing allegations of financial discrepancies on july \u003cNINE_\u003e et was the first to report about the mumbai based company undergoing a management reshuffle with tiwari taking on a board role amid a financial audit the financial audit of the creaegis backed company was conducted by pwc it is believed to have found discrepancies in medikabazaars revenue recognition process among other issues tiwari had started medikabazaar in \u003cTWO_THOUSAND\u003e along with ketan malkan malkan was the company s chief financial officer until july \u003cTWO_THOUSAND\u003e since then he has transitioned to a board role malkan was replaced by raman chawla former top finance executive at companies such as campus activewear and reckitt benckiser as medikabazaar s cfo","timestamp":"2024-08-28T16:18:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}