{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-completes-two-decades-of-public-listing/articleshow/112784172.cms","title":"TCS completes two decades of public listing","description":"TCS CEO K Krithivasan said on LinkedIn that IT major has reshaped the global IT industry in these two decades. He also thanked employees of TCS, along with clients and partners. The public listing of the Tata group subsidiary happened on 25 August 2004 with TCS shares had listed at a premium of over 26.6% at Rs 1,076 apiece on the BSE.","content":"India’s largest IT giant Tata Consultancy Services (TCS) has marked 20 years of its public listing on the two key Indian bourses — the BSE and the National Stock Exchange (NSE).Celebrating the memory, its chief executive officer (CEO) K Krithivasan said in a post on the professional networking platform LinkedIn, “Today marks 20 years since TCS went public with its IPO in 2004. In these two dynamic decades we have helped our clients navigate many technology cycles, reshaped the global IT industry, built rewarding long-term careers for our colleagues and created wealth for our investors.\"“I give heartfelt thanks to all my colleagues at TCS, all our clients and partners, who have been with us on this remarkable journey. While we look back with great pride at all that we have achieved together, we remain equally focused on building a stronger future,” he added posting a picture of a newspaper advertisement of the offer opening details.The public listing of the Tata group subsidiary happened on 25 August 2004 with TCS shares had listed at a premium of over 26.6% at Rs 1,076 apiece on the BSE. On Friday August 23, the stock ended at Rs 4,464, jumping over 300% since the listing.TCS has returned 77.5% of cash generated back to the shareholders since listing. It has issued bonus shares thrice and exercised buyback five times. ","cleaned_content":"india s largest it giant tata consultancy services tcs has marked \u003cTWO_TEN\u003e years of its public listing on the two key indian bourses the bse and the national stock exchange nse celebrating the memory its chief executive officer ceo k krithivasan said in a post on the professional networking platform linkedin today marks \u003cTWO_TEN\u003e years since tcs went public with its ipo in \u003cTWO_THOUSAND\u003e in these two dynamic decades we have helped our clients navigate many technology cycles reshaped the global it industry built rewarding long term careers for our colleagues and created wealth for our investors i give heartfelt thanks to all my colleagues at tcs all our clients and partners who have been with us on this remarkable journey while we look back with great pride at all that we have achieved together we remain equally focused on building a stronger future he added posting a picture of a newspaper advertisement of the offer opening details the public listing of the tata group subsidiary happened on \u003cTWO_TEN\u003e august \u003cTWO_THOUSAND\u003e with tcs shares had listed at a premium of over \u003cTWO_TEN_PERCENT\u003e at rs \u003cONE_THOUSAND\u003e apiece on the bse on friday august \u003cTWO_TEN\u003e the stock ended at rs \u003cFOUR_THOUSAND\u003e jumping over \u003cTHREE_HUNDRED_PERCENT\u003e since the listing tcs has returned \u003cSEVEN_TEN_PERCENT\u003e of cash generated back to the shareholders since listing it has issued bonus shares thrice and exercised buyback five times","timestamp":"2024-08-25T20:02:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}