{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-introduces-secondary-market-for-event-ticketing-book-now-sell-anytime/articleshow/112830429.cms","title":"Zomato introduces secondary market for event ticketing ‘Book Now, Sell Anytime’","description":"Zomato announced a new feature, 'Book Now, Sell Anytime,' allowing users to resell event tickets purchased from the platform. Set to launch on September 30 with the Feeding India Concert headlined by Dua Lipa, this initiative caps resale prices at twice the current phase price. Zomato also recently acquired Paytm's events and movie ticketing business.","content":"Gurugram-based Zomato, which is doubling down on its going-out business, is introducing a secondary market for event ticketing on its platform, according to a blog post by the company. Called ‘Book Now, Sell Anytime’, the feature allows users who have purchased event tickets from Zomato to sell their tickets on the app. This feature will be launched on September 30, with bookings opening up for Zomato’s Feeding India Concert, which is being headlined by pop singer Dua Lipa. “If their plans change for any reason, they can list their ticket on the Zomato app for a price lower or higher than their original purchase price (capped at 2x of the current phase price live on the ticketing platform),” Zeenah Vilcassim, CEO of Zomato Live Entertainment, wrote in the blog post.","cleaned_content":"gurugram based zomato which is doubling down on its going out business is introducing a secondary market for event ticketing on its platform according to a blog post by the company called book now sell anytime the feature allows users who have purchased event tickets from zomato to sell their tickets on the app this feature will be launched on september \u003cTHREE_TEN\u003e with bookings opening up for zomato s feeding india concert which is being headlined by pop singer dua lipa if their plans change for any reason they can list their ticket on the zomato app for a price lower or higher than their original purchase price capped at \u003cTWO_\u003e x of the current phase price live on the ticketing platform zeenah vilcassim ceo of zomato live entertainment wrote in the blog post","timestamp":"2024-08-27T13:24:00+05:30","market_timestamp":"2024-08-27T13:24:00+05:30","off_market_hours":false}