{"url":"https://economictimes.indiatimes.com/tech/technology/tamil-nadu-cm-mk-stalin-lays-foundation-for-28-projects-worth-rs-51157-crore/articleshow/112689980.cms","title":"Tamil Nadu CM MK Stalin lays foundation for 28 projects worth Rs 51,157 crore","description":"Singapore-headquartered renewable energy firm Sembcorp will invest Rs 36,238 crore for the establishment of a green hydrogen and green ammonia manufacturing unit in Tuticorin district. This will make Tamil Nadu the first state in the country to roll out commercial production of hydrogen molecules.","content":"Tamil Nadu chief minister MK Stalin on Wednesday inaugurated 19 projects worth Rs 17,616 crore and laid the foundation for 28 industrial projects entailing a collective investment of Rs 51,157 crore. These 47 projects, announced during the third edition of the Global Investors Meet held in Chennai in January, are expected to generate employment for about 100,000 people.The projects are spread across sectors including textiles, food processing and pharmaceuticals.Stalin said Tamil Nadu has attracted Rs 9.74 lakh crore of investments in the past three years, creating direct and indirect employment for about 3.1 million people. He said Tamil Nadu, the second largest state in the country in terms of economy, is taking various initiatives in order to quickly achieve its goal of making the state a trillion dollar economy by 2030.“You should be the business ambassadors of the state,” the CM told investors.Singapore-headquartered renewable energy firm Sembcorp will invest Rs 36,238 crore for the establishment of a green hydrogen and green ammonia manufacturing unit in Tuticorin district. This will make Tamil Nadu the first state in the country to roll out commercial production of hydrogen molecules.","cleaned_content":"tamil nadu chief minister mk stalin on wednesday inaugurated \u003cONE_TEN\u003e projects worth rs \u003cONE_TEN_THOUSAND\u003e crore and laid the foundation for \u003cTWO_TEN\u003e industrial projects entailing a collective investment of rs \u003cFIVE_TEN_THOUSAND\u003e crore these \u003cFOUR_TEN\u003e projects announced during the third edition of the global investors meet held in chennai in january are expected to generate employment for about \u003cONE_HUNDRED_THOUSAND\u003e people the projects are spread across sectors including textiles food processing and pharmaceuticals stalin said tamil nadu has attracted rs \u003cNINE_\u003e lakh crore of investments in the past three years creating direct and indirect employment for about \u003cTHREE_\u003e million people he said tamil nadu the second largest state in the country in terms of economy is taking various initiatives in order to quickly achieve its goal of making the state a trillion dollar economy by \u003cTWO_THOUSAND\u003e you should be the business ambassadors of the state the cm told investors singapore headquartered renewable energy firm sembcorp will invest rs \u003cTHREE_TEN_THOUSAND\u003e crore for the establishment of a green hydrogen and green ammonia manufacturing unit in tuticorin district this will make tamil nadu the first state in the country to roll out commercial production of hydrogen molecules","timestamp":"2024-08-22T06:00:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}