{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-could-face-greater-eu-scrutiny/articleshow/112904376.cms","title":"Telegram could face greater EU scrutiny","description":"Telegram could face stricter EU digital rules as Brussels probes whether the popular messaging app -- whose founder faces criminal charges in France -- has more users in the bloc than claimed. But now independently of the French probe, the European Commission is investigating whether Telegram has the minimum number of users that would require it to comply with more stringent rules.","content":"Telegram could face stricter EU digital rules as Brussels probes whether the popular messaging app -- whose founder faces criminal charges in France -- has more users in the bloc than claimed.The platform was thrust into the spotlight after its chief Pavel Durov was arrested in France on Saturday. He has since been released on bail but cannot leave the country.Durov is accused of failing to curb extremist and illegal content on the increasingly controversial platform, which has over 900 million followers.Telegram had already been in the European Union's crosshairs before the French criminal investigation. Senior EU officials have described Telegram as an \"issue\".But now independently of the French probe, the European Commission is investigating whether Telegram has the minimum number of users that would require it to comply with more stringent rules.","cleaned_content":"telegram could face stricter eu digital rules as brussels probes whether the popular messaging app whose founder faces criminal charges in france has more users in the bloc than claimed the platform was thrust into the spotlight after its chief pavel durov was arrested in france on saturday he has since been released on bail but cannot leave the country durov is accused of failing to curb extremist and illegal content on the increasingly controversial platform which has over \u003cNINE_HUNDRED\u003e million followers telegram had already been in the european unions crosshairs before the french criminal investigation senior eu officials have described telegram as an issue but now independently of the french probe the european commission is investigating whether telegram has the minimum number of users that would require it to comply with more stringent rules","timestamp":"2024-08-29T23:09:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}