{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-india-plans-to-set-up-rest-points-for-delivery-associates-across-cities/articleshow/112744388.cms","title":"Amazon India plans to set up rest points for delivery associates across cities","description":"Amazon India unveiled Project Ashray to set up rest points for its delivery associates in various cities, providing amenities like clean drinking water and phone charging stations. The initiative starts in Delhi NCR, Bengaluru, and Mumbai, with plans to expand nationwide, enhancing working conditions for delivery personnel.","content":"Amazon India plans to set up rest points for its delivery associates across cities over the next couple of years under Project Ashray, a senior company official said on Friday. The Ashray centres will provide clean drinking water, phone charging stations, washrooms, and rest areas for delivery associates.  As a pilot, five rest points will be set up in collaboration with Udyasa Foundation in Delhi NCR, Bengaluru, and Mumbai.  \"Our plan is to be able to go to every city we operate in. We have 1,800 delivery stations across the length and breadth of the country. In the next couple of years, you will find this in pretty much every city in India,\" Amazon India, Vice President - Operations, Abhinav Singh said.  He said that the project will be launched initially in cities where the company has a high number of drivers.  \"As we find a scalable model we will scale it to the rest of the country,\" Singh said. ","cleaned_content":"amazon india plans to set up rest points for its delivery associates across cities over the next couple of years under project ashray a senior company official said on friday the ashray centres will provide clean drinking water phone charging stations washrooms and rest areas for delivery associates as a pilot five rest points will be set up in collaboration with udyasa foundation in delhi ncr bengaluru and mumbai our plan is to be able to go to every city we operate in we have \u003cONE_THOUSAND\u003e delivery stations across the length and breadth of the country in the next couple of years you will find this in pretty much every city in india amazon india vice president operations abhinav singh said he said that the project will be launched initially in cities where the company has a high number of drivers as we find a scalable model we will scale it to the rest of the country singh said","timestamp":"2024-08-23T19:39:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}