{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-ride-hailing-app-didi-to-become-second-largest-shareholder-of-state-backed-navinfo-unit/articleshow/112860706.cms","title":"Chinese ride-hailing app DiDi to become second largest shareholder of state-backed NavInfo unit","description":"DiDi expects the deal will help it pull back significantly from electric vehicle manufacturing where automakers compete fiercely in a consolidating market, sources said. The company will become the second-largest shareholder of AutoAi, a provider of intelligent cockpits-related software and hardware. NavInfo will be the biggest shareholder with 27%.","content":"Chinese ride-hailing giant DiDi Global will swap cash plus its smart driving and cockpit unit for 16.5% of AutoAi, a subsidiary of state-backed maps firm NavInfo, the latter said in a stock exchange filing on Wednesday. DiDi Smart Transportation Technology will make up 87% of AutoAi's plan to boost its registered capital by 27.45 million yuan ($3.85 million), with NavInfo contributing the remainder, showed the filing with the Shenzhen Stock Exchange. DiDi will become the second-largest shareholder of AutoAi, a provider of intelligent cockpits-related software and hardware. NavInfo will be the biggest shareholder with 27%. The deal, which confirms a Reuters report on Monday, values the DiDi subsidiary at 450 million yuan, the filing showed. DiDi expects the deal will help it pull back significantly from electric vehicle (EV) manufacturing where automakers compete fiercely in a consolidating market, sources have said.","cleaned_content":"chinese ride hailing giant didi global will swap cash plus its smart driving and cockpit unit for \u003cONE_TEN_PERCENT\u003e of autoai a subsidiary of state backed maps firm navinfo the latter said in a stock exchange filing on wednesday didi smart transportation technology will make up \u003cEIGHT_TEN_PERCENT\u003e of autoais plan to boost its registered capital by \u003cTWO_TEN\u003e million yuan \u003cTHREE_\u003e million with navinfo contributing the remainder showed the filing with the shenzhen stock exchange didi will become the second largest shareholder of autoai a provider of intelligent cockpits related software and hardware navinfo will be the biggest shareholder with \u003cTWO_TEN_PERCENT\u003e the deal which confirms a reuters report on monday values the didi subsidiary at \u003cFOUR_HUNDRED\u003e million yuan the filing showed didi expects the deal will help it pull back significantly from electric vehicle ev manufacturing where automakers compete fiercely in a consolidating market sources have said","timestamp":"2024-08-28T13:44:00+05:30","market_timestamp":"2024-08-28T13:44:00+05:30","off_market_hours":false}