{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-opens-power-programme-offering-freshers-up-to-rs-9-lakh-a-year/articleshow/112632726.cms","title":"Infosys opens ‘Power’ programme offering freshers up to Rs 9 lakh a year","description":"Infosys is offering a much higher package than the average entry-level pay offered by the company. TCS offers salaries in the range of Rs 9-11 lakh per annum under ‘Prime’, a programme it launched last year. The firm has expanded its scope this year, adding newer technologies such as artificial intelligence (AI), generative AI (GenAI) and machine learning (ML).","content":"As part of the campus placement drive, IT services major Infosys has launched a ‘power programme’ for colleges with differential hiring, offering packages of up to Rs 9 lakh per annum, two people aware of the development told ET.This is substantially higher than the entry-level fresher pay packages of Rs 3-3.5 lakh offered by the Bengaluru-based company.“The focus of these categories of hiring is on coding and software challenges, programming skill testing and other specialised skill tests for both tests and interviews,” one of the sources said. “For Infosys, these pay packages offered are between Rs 4-6.5 lakh and Rs 9 lakh.”The initiative is akin to bigger rival Tata Consultancy Services’ ‘Prime’ specialised hiring of freshers for software development profiles.TCS offers salaries in the range of Rs 9-11 lakh per annum under ‘Prime’, a programme it launched last year. The firm has expanded its scope this year, adding newer technologies such as artificial intelligence (AI), generative AI (GenAI) and machine learning (ML).","cleaned_content":"as part of the campus placement drive it services major infosys has launched a power programme for colleges with differential hiring offering packages of up to rs \u003cNINE_\u003e lakh per annum two people aware of the development told et this is substantially higher than the entry level fresher pay packages of rs \u003cTHREE_\u003e \u003cTHREE_\u003e lakh offered by the bengaluru based company the focus of these categories of hiring is on coding and software challenges programming skill testing and other specialised skill tests for both tests and interviews one of the sources said for infosys these pay packages offered are between rs \u003cFOUR_\u003e \u003cSIX_\u003e lakh and rs \u003cNINE_\u003e lakh the initiative is akin to bigger rival tata consultancy services prime specialised hiring of freshers for software development profiles tcs offers salaries in the range of rs \u003cNINE_\u003e \u003cONE_TEN\u003e lakh per annum under prime a programme it launched last year the firm has expanded its scope this year adding newer technologies such as artificial intelligence ai generative ai genai and machine learning ml","timestamp":"2024-08-21T12:35:00+05:30","market_timestamp":"2024-08-21T12:35:00+05:30","off_market_hours":false}