{"url":"https://economictimes.indiatimes.com/tech/technology/magicpin-cofounder-brij-bhushan-joins-prime-venture-partners/articleshow/112731951.cms","title":"Magicpin cofounder Brij Bhushan joins Prime Venture Partners","description":"Brij Bhushan, who was previously the vice president at Nexus Venture Partners, will be a key part of Prime's investment team and will manage the firm's portfolio and fundraising. Bhushan announced his exit from Magicpin earlier this year in a LinkedIn post.","content":"Brij Bhushan, cofounder of hyperlocal ecommerce startup Magicpin, has joined Prime Venture Partners as a venture partner, the Bengaluru-based early-stage venture capital (VC) firm said in a statement on Friday. In this role, Bhushan will be an integral part of the investment team, contributing to the firm’s investment decisions, portfolio management and fundraising, it said.Bhushan said early-stage startups need more than just funding – they need a real team member.“After nearly a decade as a founder, I’m excited to return to VC, where I can help founders navigate their journeys, leveraging my experiences alongside a team that truly understands what it takes to get a company off the ground,” he said. Prior to founding Zomato-backed Magicpin with Anshoo Sharma in 2015, Bhushan served as vice president at Nexus Venture Partners. ","cleaned_content":"brij bhushan cofounder of hyperlocal ecommerce startup magicpin has joined prime venture partners as a venture partner the bengaluru based early stage venture capital vc firm said in a statement on friday in this role bhushan will be an integral part of the investment team contributing to the firm s investment decisions portfolio management and fundraising it said bhushan said early stage startups need more than just funding they need a real team member after nearly a decade as a founder i m excited to return to vc where i can help founders navigate their journeys leveraging my experiences alongside a team that truly understands what it takes to get a company off the ground he said prior to founding zomato backed magicpin with anshoo sharma in \u003cTWO_THOUSAND\u003e bhushan served as vice president at nexus venture partners","timestamp":"2024-08-23T13:05:00+05:30","market_timestamp":"2024-08-23T13:05:00+05:30","off_market_hours":false}