{"url":"https://economictimes.indiatimes.com/tech/technology/binance-hiring-1000-as-compliance-spending-tops-200-million/articleshow/112696750.cms","title":"Binance hiring 1,000 as compliance spending tops $200 million","description":"Binance plans to have a 700-strong compliance workforce by the end of 2024, up from about 500 currently, chief executive officer Richard Teng said. “I’ve been a regulator all my life,” Teng said. “Government agencies are important.” He declined to say whether he has met with the securities and exchange commission during his trip. The SEC is suing Binance and wasn’t part of the US settlement.","content":"Binance Holdings Ltd. is hiring 1,000 people this year with many earmarked for compliance roles as the crypto exchange’s annual spending to meet regulatory requirements, including US oversight under a plea deal, tops $200 million.Chief executive officer Richard Teng, who is visiting the US to talk to monitors and officials, outlined the employment goals for the world’s largest crypto trading platform in an interview with Bloomberg News in New York on Wednesday.“I’ve been a regulator all my life,” Teng said. “Government agencies are important.” He declined to say whether he has met with the securities and exchange commission during his trip. The SEC is suing Binance and wasn’t part of the US settlement.That plea deal with the Justice Department and other US agencies included a $4.3 billion penalty for failures that let criminals and terror groups use the exchange. The firm faces years of compliance monitoring by the DOJ and the US Treasury’s Financial Crimes Enforcement Network.Compliance workforce","cleaned_content":"binance holdings ltd is hiring \u003cONE_THOUSAND\u003e people this year with many earmarked for compliance roles as the crypto exchange s annual spending to meet regulatory requirements including us oversight under a plea deal tops \u003cTWO_HUNDRED\u003e million chief executive officer richard teng who is visiting the us to talk to monitors and officials outlined the employment goals for the world s largest crypto trading platform in an interview with bloomberg news in new york on wednesday i ve been a regulator all my life teng said government agencies are important he declined to say whether he has met with the securities and exchange commission during his trip the sec is suing binance and wasn t part of the us settlement that plea deal with the justice department and other us agencies included a \u003cFOUR_\u003e billion penalty for failures that let criminals and terror groups use the exchange the firm faces years of compliance monitoring by the doj and the us treasury s financial crimes enforcement network compliance workforce","timestamp":"2024-08-22T08:29:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}