{"url":"https://economictimes.indiatimes.com/tech/technology/amd-to-acquire-server-builder-zt-systems-for-4-9-billion-in-cash-and-stock/articleshow/112633369.cms","title":"AMD to acquire server builder ZT Systems for $4.9 billion in cash and stock","description":"The computing requirements for AI have dictated that tech companies string together thousands of chips in clusters to achieve the necessary amount of data crunching horsepower. Stringing together the vast numbers of chips has meant the makeup of whole server systems has become increasingly important, which is why AMD is acquiring ZT Systems.","content":"AMD said on Monday it plans to acquire server maker ZT Systems for $4.9 billion as the company seeks to expand its portfolio of artificial intelligence chips and hardware and battle Nvidia. AMD plans to pay for 75% of the ZT Systems acquisition with cash and the remainder in stock. The company had $5.34 billion in cash and short-term investments as of the second quarter. The computing requirements for AI have dictated that tech companies string together thousands of chips in clusters to achieve the necessary amount of data crunching horsepower. Stringing together the vast numbers of chips has meant the makeup of whole server systems has become increasingly important, which is why AMD is acquiring ZT Systems. \"AI systems are our number one strategic priority,\" AMD CEO Lisa Su said in an interview with Reuters. The addition of ZT Systems engineers will allow AMD to more quickly test and roll out its latest AI graphics processing units (GPUs) at the scale cloud computing giants such as Microsoft require, Su said.","cleaned_content":"amd said on monday it plans to acquire server maker zt systems for \u003cFOUR_\u003e billion as the company seeks to expand its portfolio of artificial intelligence chips and hardware and battle nvidia amd plans to pay for \u003cSEVEN_TEN_PERCENT\u003e of the zt systems acquisition with cash and the remainder in stock the company had \u003cFIVE_\u003e billion in cash and short term investments as of the second quarter the computing requirements for ai have dictated that tech companies string together thousands of chips in clusters to achieve the necessary amount of data crunching horsepower stringing together the vast numbers of chips has meant the makeup of whole server systems has become increasingly important which is why amd is acquiring zt systems ai systems are our number one strategic priority amd ceo lisa su said in an interview with reuters the addition of zt systems engineers will allow amd to more quickly test and roll out its latest ai graphics processing units gpus at the scale cloud computing giants such as microsoft require su said","timestamp":"2024-08-19T21:47:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}