{"url":"https://economictimes.indiatimes.com/tech/technology/russian-lawmaker-and-putin-ally-says-us-behind-arrest-of-telegram-ceo-pavel-durov/articleshow/112827383.cms","title":"Russian lawmaker and Putin ally says US behind arrest of Telegram CEO Pavel Durov","description":"Russian President Putin's ally claimed the U.S. was behind France's arrest of Telegram CEO Pavel Durov, accused of crimes involving child pornography, drugs, and fraud. The arrest, coinciding with heightened tensions due to the Ukraine war, sparked speculations about U.S. attempts to control the influential messaging platform used extensively in Russia and Ukraine.","content":"A senior ally of Russian President Vladimir Putin said on Tuesday that Washington was behind the French arrest of Pavel Durov, the founder and the CEO of the Telegram messaging platform that plays a key role communicating the war in Ukraine. Durov, the Russian-born entrepreneur, was arrested in France over the weekend as part of an investigation into crimes related to child pornography, drug trafficking and fraudulent transactions on the platform, French prosecutors said on Monday. Without providing evidence, Vyacheslav Volodin, the chairman of Russia's State Duma lower house of parliament, said that the United States, through France, attempted to exert control over Telegram. \"Telegram is one of the few and at the same time the largest Internet platforms over which the United States has no influence,\" Volodin said in a post.  \"On the eve of the U.S. presidential election, it is important for (President Joe) Biden to take Telegram under control.\"","cleaned_content":"a senior ally of russian president vladimir putin said on tuesday that washington was behind the french arrest of pavel durov the founder and the ceo of the telegram messaging platform that plays a key role communicating the war in ukraine durov the russian born entrepreneur was arrested in france over the weekend as part of an investigation into crimes related to child pornography drug trafficking and fraudulent transactions on the platform french prosecutors said on monday without providing evidence vyacheslav volodin the chairman of russias state duma lower house of parliament said that the united states through france attempted to exert control over telegram telegram is one of the few and at the same time the largest internet platforms over which the united states has no influence volodin said in a post on the eve of the u s presidential election it is important for president joe biden to take telegram under control","timestamp":"2024-08-27T11:46:00+05:30","market_timestamp":"2024-08-27T11:46:00+05:30","off_market_hours":false}