{"url":"https://economictimes.indiatimes.com/tech/technology/how-deepfake-musk-became-internets-biggest-scammer/articleshow/112618750.cms","title":"How 'deepfake Musk' became internet's biggest scammer","description":"The scammers had edited a genuine interview with Musk, replacing his voice with a replica using AI tools. The AI was sophisticated enough that it could alter minute mouth movements to match the new script they had written for the digital fake. To a casual viewer, the manipulation might have been imperceptible.","content":"All Steve Beauchamp wanted was money for his family. And he thought Elon Musk could help. Beauchamp, an 82-year-old retiree, saw a video late last year of Musk endorsing a radical investment opportunity that promised rapid returns. He contacted the company behind the pitch and opened an account for $248. Through a series of transactions over several weeks, Beauchamp drained his retirement account, ultimately investing more than $690,000.Then the money vanished - lost to digital scammers on the forefront of a new criminal enterprise powered by artificial intelligence.The scammers had edited a genuine interview with Musk, replacing his voice with a replica using AI tools. The AI was sophisticated enough that it could alter minute mouth movements to match the new script they had written for the digital fake. To a casual viewer, the manipulation might have been imperceptible.\"I mean, the picture of him - it was him,\" Beauchamp said about the video he saw of Musk. \"Now, whether it was AI making him say the things that he was saying, I really don't know. But as far as the picture, if somebody had said, 'Pick him out of a lineup,' that's him.\"","cleaned_content":"all steve beauchamp wanted was money for his family and he thought elon musk could help beauchamp an \u003cEIGHT_TEN\u003e year old retiree saw a video late last year of musk endorsing a radical investment opportunity that promised rapid returns he contacted the company behind the pitch and opened an account for \u003cTWO_HUNDRED\u003e through a series of transactions over several weeks beauchamp drained his retirement account ultimately investing more than \u003cSIX_HUNDRED_THOUSAND\u003e then the money vanished lost to digital scammers on the forefront of a new criminal enterprise powered by artificial intelligence the scammers had edited a genuine interview with musk replacing his voice with a replica using ai tools the ai was sophisticated enough that it could alter minute mouth movements to match the new script they had written for the digital fake to a casual viewer the manipulation might have been imperceptible i mean the picture of him it was him beauchamp said about the video he saw of musk now whether it was ai making him say the things that he was saying i really dont know but as far as the picture if somebody had said pick him out of a lineup thats him","timestamp":"2024-08-19T09:39:00+05:30","market_timestamp":"2024-08-19T09:39:00+05:30","off_market_hours":false}