{"url":"https://economictimes.indiatimes.com/tech/technology/swiss-engineering-firm-schlatter-says-it-systems-back-up-after-cyberattack/articleshow/112645229.cms","title":"Swiss engineering firm Schlatter says IT systems back up after cyberattack","description":"Schlatter Industries said on August 9 that it was hit by a malware-based cyberattack and that unknown perpetrators were attempting to blackmail it, without disclosing further details.","content":"Swiss engineering company Schlatter Industries said on Tuesday that its computer network had been back up since Monday following a cyberattack nearly two weeks back. The group said on August 9 that it was hit by a malware-based cyberattack and that unknown perpetrators were attempting to blackmail it, without disclosing further details. Its latest statement also did not provide details on the impact of the cyberattack, including whether any data was stolen, or on progress on identifying the perpetrators. The financial impact of the cyberattack and its impact on financial results had not yet been quantified, Schlatter said last week. At that time, it also warned that full-year results would be significantly lower than the previous year due to a drop in orders and delayed commissioning of customer projects in its welding unit. ($1 = 0.8619 Swiss francs)","cleaned_content":"swiss engineering company schlatter industries said on tuesday that its computer network had been back up since monday following a cyberattack nearly two weeks back the group said on august \u003cNINE_\u003e that it was hit by a malware based cyberattack and that unknown perpetrators were attempting to blackmail it without disclosing further details its latest statement also did not provide details on the impact of the cyberattack including whether any data was stolen or on progress on identifying the perpetrators the financial impact of the cyberattack and its impact on financial results had not yet been quantified schlatter said last week at that time it also warned that full year results would be significantly lower than the previous year due to a drop in orders and delayed commissioning of customer projects in its welding unit \u003cONE_\u003e \u003cZERO_\u003e swiss francs","timestamp":"2024-08-20T12:16:00+05:30","market_timestamp":"2024-08-20T12:16:00+05:30","off_market_hours":false}