{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-india-set-to-tweak-seller-fees-ahead-of-festive-season/articleshow/112745765.cms","title":"Amazon India set to tweak seller fees ahead of festive season","description":"Amazon India adjusted its seller fee structures starting September 9. Reduced commissions across multiple categories aimed at supporting sellers during the festive season, with a focus on low-priced products. Categories such as ethnic wear and home furnishings saw significant fee reductions, while others like backpacks and studded fine jewellery had fee increases.","content":"Ecommerce company Amazon India is set to tweak its seller fee structures with effect September 9, with several categories seeing a reduction in commissions in the run up to the festive season.The firm has reduced commissions in the range of 3-12% for 59 sub-categories, Amazon India’s director of selling partner services, Amit Nanda, told ET. The reduction is focused on products with low average selling price (ASP), he said.“We also wanted to help our sellers in planning for their Diwali and other festive sales… with this change, we’re hoping sellers will find it as cheap, if not cheaper, to sell some products on Amazon compared to their offline channels,” Nanda added. In March, ET reported about Amazon increasing commissions in the range of 10-30% across major segments. At the time, it had shifted several categories like car electronics, keyboards and mouses, and personal care appliances from a single flat commission to a tiered system based on ASP.  ","cleaned_content":"ecommerce company amazon india is set to tweak its seller fee structures with effect september \u003cNINE_\u003e with several categories seeing a reduction in commissions in the run up to the festive season the firm has reduced commissions in the range of \u003cTHREE_\u003e \u003cONE_TEN_PERCENT\u003e for \u003cFIVE_TEN\u003e sub categories amazon india s director of selling partner services amit nanda told et the reduction is focused on products with low average selling price asp he said we also wanted to help our sellers in planning for their diwali and other festive sales with this change we re hoping sellers will find it as cheap if not cheaper to sell some products on amazon compared to their offline channels nanda added in march et reported about amazon increasing commissions in the range of \u003cONE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e across major segments at the time it had shifted several categories like car electronics keyboards and mouses and personal care appliances from a single flat commission to a tiered system based on asp","timestamp":"2024-08-24T09:43:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}