{"url":"https://economictimes.indiatimes.com/tech/technology/google-to-open-second-data-center-in-latin-america-to-invest-over-850-million/articleshow/112911951.cms","title":"Google to open second data center in Latin America, to invest over $850 million","description":"Google announced it will open its second data center in Latin America in Uruguay's Canelones, investing over $850 million. This follows the first data center in Chile's Quilicura, established in 2015. This project aims to boost technological development in Uruguay and the region.","content":"Alphabet's Google said on Thursday it will open its second data center in Latin America in the Uruguayan city of Canelones and invest more than $850 million in it. Google opened its first data center in Latin America in Quilicura, which is near Santiago, the capital city of Chile, in 2015. It invested an initial amount of $150 million in the data center and spent an additional $140 million in 2018 for expansion. \"We hope our new data center in Canelones will be a significant contribution to the professional and technological development of Uruguay and the entire region,\" Google said in a blog post. Reuters reported on Thursday that Google is considering building a \"hyperscale\" data centre close to Ho Chi Minh City in Vietnam and that the center would be ready in 2027. In April, Google announced a $3 billion investment to set up a data center campus in Indiana and expand sites in Virginia. Google also said in May that it will invest $2 billion in Malaysia to develop its first data centre and Google Cloud region in the country.","cleaned_content":"alphabets google said on thursday it will open its second data center in latin america in the uruguayan city of canelones and invest more than \u003cEIGHT_HUNDRED\u003e million in it google opened its first data center in latin america in quilicura which is near santiago the capital city of chile in \u003cTWO_THOUSAND\u003e it invested an initial amount of \u003cONE_HUNDRED\u003e million in the data center and spent an additional \u003cONE_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e for expansion we hope our new data center in canelones will be a significant contribution to the professional and technological development of uruguay and the entire region google said in a blog post reuters reported on thursday that google is considering building a hyperscale data centre close to ho chi minh city in vietnam and that the center would be ready in \u003cTWO_THOUSAND\u003e in april google announced a \u003cTHREE_\u003e billion investment to set up a data center campus in indiana and expand sites in virginia google also said in may that it will invest \u003cTWO_\u003e billion in malaysia to develop its first data centre and google cloud region in the country","timestamp":"2024-08-30T09:48:00+05:30","market_timestamp":"2024-08-30T09:48:00+05:30","off_market_hours":false}