{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-sales-likely-doubled-even-that-may-not-impress-investors/articleshow/112823246.cms","title":"Nvidia sales likely doubled - even that may not impress investors","description":"Nvidia's second-quarter revenue saw a notable rise amidst high investor expectations. The company's stock surged over 150% this year, driven by AI-related demand. However, concerns around production delays, regulatory restrictions on chip sales to China, and potential antitrust investigations could impact future growth. Investors closely monitored these developments.","content":"Nvidia is likely to report on Wednesday that its second-quarter revenue more than doubled. But investors used to its blockbuster results will be expecting even more from the artificial intelligence chip giant. A beat or a miss on Wall Street expectations could either stoke or shatter an AI rally on Thursday, a day after Nvidia reports earnings for the May-July period. The company's stock has surged more than 150% this year, adding $1.82 trillion to its market value and lifting the S\u0026P 500 to new highs. On Monday, it was down 2.2% in afternoon trading, weighing on the index. The stock is valued at about 37 times its forward earnings, compared with an average of around 29 for the top six tech companies on the benchmark index that includes the chipmaker.  Tech heavyweights, including Microsoft, which are spending heavily to build out their AI infrastructure, have been buying Nvidia's powerful graphic processing units that allow large amounts of computing quickly. These chips are difficult to replace in present-day datacenters, which has sharply boosted Nvidia's fortunes. ","cleaned_content":"nvidia is likely to report on wednesday that its second quarter revenue more than doubled but investors used to its blockbuster results will be expecting even more from the artificial intelligence chip giant a beat or a miss on wall street expectations could either stoke or shatter an ai rally on thursday a day after nvidia reports earnings for the may july period the companys stock has surged more than \u003cONE_HUNDRED_PERCENT\u003e this year adding \u003cONE_\u003e trillion to its market value and lifting the s p \u003cFIVE_HUNDRED\u003e to new highs on monday it was down \u003cTWO_PERCENT\u003e in afternoon trading weighing on the index the stock is valued at about \u003cTHREE_TEN\u003e times its forward earnings compared with an average of around \u003cTWO_TEN\u003e for the top six tech companies on the benchmark index that includes the chipmaker tech heavyweights including microsoft which are spending heavily to build out their ai infrastructure have been buying nvidias powerful graphic processing units that allow large amounts of computing quickly these chips are difficult to replace in present day datacenters which has sharply boosted nvidias fortunes","timestamp":"2024-08-27T09:07:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}