{"url":"https://economictimes.indiatimes.com/tech/technology/investor-360-one-wam-valued-swiggy-at-11-5-bn-in-june-shows-document/articleshow/112718923.cms","title":"Swiggy investor 360 One pins $11.5 billion value on IPO-bound company","description":"Swiggy, valued at $11.5 billion by 360 One WAM, is set for a $1.25 billion IPO. The company's revenue for the first half of fiscal 2024 is estimated at Rs 7,474 crore. Both Swiggy and Zomato are focusing on rapid growth in quick commerce, an area showing significant promise and revenue increase.","content":"Swiggy investor 360 One WAM, formerly IIFL Wealth Management, valued the IPO-bound food- and grocery-delivery firm at $11.5 billion as of June, according to an investor presentation seen by ET.Swiggy recorded Rs 7,474 crore in revenue in the first half of fiscal 2024, 360 One said in the presentation made to its clients. This translates into Rs 14,947 crore on an annualised basis for the year through March.Food delivery sees cyclical changes in orders. So the final figure may differ and will only be known when Swiggy — which has confidentially filed for an IPO — discloses its financial results for the year.This is the latest valuation for Swiggy available from a private investor, even as the Bengaluru-based firm is in the middle of a $1.25 billion IPO process.  ","cleaned_content":"swiggy investor \u003cTHREE_HUNDRED\u003e one wam formerly iifl wealth management valued the ipo bound food and grocery delivery firm at \u003cONE_TEN\u003e billion as of june according to an investor presentation seen by et swiggy recorded rs \u003cSEVEN_THOUSAND\u003e crore in revenue in the first half of fiscal \u003cTWO_THOUSAND\u003e \u003cTHREE_HUNDRED\u003e one said in the presentation made to its clients this translates into rs \u003cONE_TEN_THOUSAND\u003e crore on an annualised basis for the year through march food delivery sees cyclical changes in orders so the final figure may differ and will only be known when swiggy which has confidentially filed for an ipo discloses its financial results for the year this is the latest valuation for swiggy available from a private investor even as the bengaluru based firm is in the middle of a \u003cONE_\u003e billion ipo process","timestamp":"2024-08-23T17:49:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}