{"url":"https://economictimes.indiatimes.com/tech/technology/rbi-will-launch-unified-lending-interface-nationwide-in-due-course-guv-shaktikanta-das/articleshow/112799213.cms","title":"RBI will launch Unified Lending Interface nationwide in due course: Guv Shaktikanta Das","description":"The ULI architecture has common and standardised application programming interfaces (APIs) designed for a plug-and-play approach to ensure digital access to information from diverse sources, i.e., information relevant to a lender giving out a loan to a potential borrower.","content":"The Reserve Bank of India’s (RBI) technology platform the Unified Lending Interface (ULI) that enables frictionless credit will be launched nationwide in due course, said RBI Governor Shaktikanta Das here on Monday.“Last year, we launched a pilot of a technology platform which enables frictionless credit. It is still in pilot mode. From now on, we propose to call it the Unified Lending Interface (ULI),” Das said.He was speaking at the inaugural address of the two-day Global Conference on Digital Public Infrastructure and Emerging Technologies in Bengaluru being held in commemoration of RBI’s 90th year.ULI facilitates seamless flow of digital information including land records of various states from multiple data service providers to lenders. This cuts down the time taken for credit appraisal especially for smaller and rural borrowers.The ULI architecture has common and standardised application programming interfaces (APIs) designed for a plug-and-play approach to ensure digital access to information from diverse sources, i.e., information relevant to a lender giving out a loan to a potential borrower.","cleaned_content":"the reserve bank of india s rbi technology platform the unified lending interface uli that enables frictionless credit will be launched nationwide in due course said rbi governor shaktikanta das here on monday last year we launched a pilot of a technology platform which enables frictionless credit it is still in pilot mode from now on we propose to call it the unified lending interface uli das said he was speaking at the inaugural address of the two day global conference on digital public infrastructure and emerging technologies in bengaluru being held in commemoration of rbi s \u003cNINE_TEN\u003e th year uli facilitates seamless flow of digital information including land records of various states from multiple data service providers to lenders this cuts down the time taken for credit appraisal especially for smaller and rural borrowers the uli architecture has common and standardised application programming interfaces apis designed for a plug and play approach to ensure digital access to information from diverse sources i e information relevant to a lender giving out a loan to a potential borrower","timestamp":"2024-08-26T12:44:00+05:30","market_timestamp":"2024-08-26T12:44:00+05:30","off_market_hours":false}