{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-in-depth-policybazaars-dream-run-at-the-bourses-decoded/articleshow/112815495.cms","title":"ETtech in-depth: Decoding PB Fintech’s bull run on the stock markets","description":"PBFintech, the parent entity of Policybazaar, is having a dream run at the stock exchanges. The company is nearing a $10 billion market capitalisation as its stock price has grown to around Rs 1,800 from Rs 1,000 six months ago. While Policybazaar is yet to taste profits from its new initiatives, it is definitely seeing its losses cut down.","content":"At a time when the larger fintech industry is grappling with issues around stagnating private market valuation and a slowdown in venture funding, the stock price of insurance marketplace Policybazaar’s parent has been on a tear.At close of trading Monday, PB Fintech had a market capitalisation of $9.8 billion. Its stock price has crossed Rs 1,800 — closed 8% higher at 1,819.90 on the BSE Monday — compared with around Rs 1,000 six months back.A strong financial performance, with two quarters of net profit, steady revenue growth and expansion in new insurance premium collection business, is making the Gurugram-based company an attractive investment option.Returns on investments in new bizIn the June quarter, the company crossed the Rs 1,000 crore quarterly revenue mark and reported a net profit of Rs 60 crore.","cleaned_content":"at a time when the larger fintech industry is grappling with issues around stagnating private market valuation and a slowdown in venture funding the stock price of insurance marketplace policybazaar s parent has been on a tear at close of trading monday pb fintech had a market capitalisation of \u003cNINE_\u003e billion its stock price has crossed rs \u003cONE_THOUSAND\u003e closed \u003cEIGHT_PERCENT\u003e higher at \u003cONE_THOUSAND\u003e on the bse monday compared with around rs \u003cONE_THOUSAND\u003e six months back a strong financial performance with two quarters of net profit steady revenue growth and expansion in new insurance premium collection business is making the gurugram based company an attractive investment option returns on investments in new bizin the june quarter the company crossed the rs \u003cONE_THOUSAND\u003e crore quarterly revenue mark and reported a net profit of rs \u003cSIX_TEN\u003e crore","timestamp":"2024-08-27T08:59:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}