{"url":"https://economictimes.indiatimes.com/tech/technology/uber-ceo-says-growth-in-south-korea-promising-despite-underdog-status/articleshow/112913176.cms","title":"Uber CEO says growth in South Korea promising despite underdog status","description":"Khosrowshahi said about 20% of South Korean taxi drivers were on the Uber Taxi platform, and that the number of passengers grew nearly 80% year-on-year during the first half of 2024, including a more than doubling of the usage by international travellers to South Korea since the rebranding.","content":"Uber Technologies Inc's CEO on Friday expressed commitment to the South Korean market, where it is an underdog to local tech group Kakao, and said the platform will attract more taxi drivers for growth. \"The fact is that a taxi driver who uses the Uber app will make more money, will be more busy,\" Uber CEO Dara Khosrowshahi told reporters in Seoul.  \"We are growing significantly faster than the market, and we're confident that our market share will only grow from here.\" Kakao has a more than 90% market share of taxi-hailing, estimated based on app usage data. Uber first entered the South Korean market in 2013, but pulled out due to regulations that only allow companies with taxi licenses to offer ride services. ","cleaned_content":"uber technologies incs ceo on friday expressed commitment to the south korean market where it is an underdog to local tech group kakao and said the platform will attract more taxi drivers for growth the fact is that a taxi driver who uses the uber app will make more money will be more busy uber ceo dara khosrowshahi told reporters in seoul we are growing significantly faster than the market and were confident that our market share will only grow from here kakao has a more than \u003cNINE_TEN_PERCENT\u003e market share of taxi hailing estimated based on app usage data uber first entered the south korean market in \u003cTWO_THOUSAND\u003e but pulled out due to regulations that only allow companies with taxi licenses to offer ride services","timestamp":"2024-08-30T10:31:00+05:30","market_timestamp":"2024-08-30T10:31:00+05:30","off_market_hours":false}