{"url":"https://economictimes.indiatimes.com/tech/technology/india-needs-to-lead-global-tech-transition-build-jobs-of-the-future-ola-founder-bhavish-aggarwal/articleshow/112780705.cms","title":"India needs to lead global tech transition, build jobs of the future: Ola founder Bhavish Aggarwal","description":"In an interaction with PTI editors at the agency's headquarters here, he said the private sector has to do the bulk of job creation, step up and do more, while creating an enabling environment and correcting imbalances, such as that of trade, are the responsibility of the government.","content":"Ola founder Bhavish Aggarwal is placing bold bets on new-age technologies with a view for India to be at the forefront of the current global tech transition led by AI, and build jobs of the future in the country. In an interaction with PTI editors at the agency's headquarters here, he said the private sector has to do the bulk of job creation, step up and do more, while creating an enabling environment and correcting imbalances, such as that of trade, are the responsibility of the government.  Aggarwal also supported the government's move to offer fiscal incentives to global EV makers, including Tesla, through the new EV policy saying it is important for India to attract all kinds of investment, and globally established players will help in the development of the EV ecosystem in the country.  The group's newly-listed entity Ola Electric aims to make India a global electric vehicle (EV) hub but the country has to invent an EV and energy transition paradigm for itself based on its needs as the world cannot achieve a sustainable future without India, he added.  \"There is a global technology transition happening and AI is a very important technology of the future, and we in India need to lead this journey. If you look at the current state, I think we are still adopters of somebody else's technology paradigms, especially in the digital world,\" Aggarwal said, explaining why the Ola group had set up AI start-up Krutrim last year.  One of the things in Krutrim is to build AI models on Indian data, which is more attuned to Indian use cases, Indian paradigms, he said, adding, \"We are making our own AI, on our own cloud, on our own chip.\" ","cleaned_content":"ola founder bhavish aggarwal is placing bold bets on new age technologies with a view for india to be at the forefront of the current global tech transition led by ai and build jobs of the future in the country in an interaction with pti editors at the agencys headquarters here he said the private sector has to do the bulk of job creation step up and do more while creating an enabling environment and correcting imbalances such as that of trade are the responsibility of the government aggarwal also supported the governments move to offer fiscal incentives to global ev makers including tesla through the new ev policy saying it is important for india to attract all kinds of investment and globally established players will help in the development of the ev ecosystem in the country the groups newly listed entity ola electric aims to make india a global electric vehicle ev hub but the country has to invent an ev and energy transition paradigm for itself based on its needs as the world cannot achieve a sustainable future without india he added there is a global technology transition happening and ai is a very important technology of the future and we in india need to lead this journey if you look at the current state i think we are still adopters of somebody elses technology paradigms especially in the digital world aggarwal said explaining why the ola group had set up ai start up krutrim last year one of the things in krutrim is to build ai models on indian data which is more attuned to indian use cases indian paradigms he said adding we are making our own ai on our own cloud on our own chip","timestamp":"2024-08-25T15:54:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}