{"url":"https://economictimes.indiatimes.com/tech/technology/intel-exploring-division-split-ma-other-options-to-cope-with-historic-slump/articleshow/112913219.cms","title":"Intel exploring division split, M\u0026A to cope with historic slump","description":"Morgan Stanley and Goldman Sachs Group Inc., Intel’s longtime bankers, have been providing advice on the possibilities, which could also include potential M\u0026A, the people said. The discussions have only grown more urgent since the Santa Clara, California-based company delivered a grim earnings report, which sent the shares plunging to their lowest level since 2013.","content":"Intel Corp. is working with investment bankers to help navigate the most difficult period in its 56-year history, according to people familiar with the matter.The company is discussing various scenarios, including a split of its product-design and manufacturing businesses, as well as which factory projects might potentially be scrapped, said the people, who asked not to be identified because the deliberations are private.Morgan Stanley and Goldman Sachs Group Inc., Intel’s longtime bankers, have been providing advice on the possibilities, which could also include potential M\u0026A, the people said. The discussions have only grown more urgent since the Santa Clara, California-based company delivered a grim earnings report, which sent the shares plunging to their lowest level since 2013.The various options are expected to be presented during a board meeting in September, the people said.No major move is imminent and discussions are still in early stages, the people cautioned. A representative for Intel declined to comment, while Morgan Stanley and Goldman Sachs didn’t immediately respond to requests for comment.","cleaned_content":"intel corp is working with investment bankers to help navigate the most difficult period in its \u003cFIVE_TEN\u003e year history according to people familiar with the matter the company is discussing various scenarios including a split of its product design and manufacturing businesses as well as which factory projects might potentially be scrapped said the people who asked not to be identified because the deliberations are private morgan stanley and goldman sachs group inc intel s longtime bankers have been providing advice on the possibilities which could also include potential m a the people said the discussions have only grown more urgent since the santa clara california based company delivered a grim earnings report which sent the shares plunging to their lowest level since \u003cTWO_THOUSAND\u003e the various options are expected to be presented during a board meeting in september the people said no major move is imminent and discussions are still in early stages the people cautioned a representative for intel declined to comment while morgan stanley and goldman sachs didn t immediately respond to requests for comment","timestamp":"2024-08-30T10:09:00+05:30","market_timestamp":"2024-08-30T10:09:00+05:30","off_market_hours":false}