{"url":"https://economictimes.indiatimes.com/tech/technology/temasek-in-talks-for-up-to-150-million-bite-of-rebel-foods/articleshow/112787117.cms","title":"Exclusive: Temasek in talks for up to $150-million bite of Rebel Foods","description":"Temasek, Singapore's sovereign wealth fund, is in advanced talks to lead a $100-150 million investment in Rebel Foods, the parent company of brands such as Faasos and Behrouz Biryani, sources said. Started in 2011 by Jaydeep Barman and Kallol Banerjee, the company plans to go public in the coming 1-2 years.","content":"Singaporean sovereign fund Temasek is in advanced discussions to lead a $100-150 million investment in Rebel Foods, parent of Faasos, Behrouz Biryani and other cloud kitchen brands, people aware of developments said. The proposed deal will be a mix of primary and secondary share sales, with the Mumbai-based unicorn being ascribed a nearly flat valuation compared to its previous round nearly three years ago, they added.The secondary sale — where existing investors partly divest to Temasek — is likely at a lower valuation of around $700 million, said the people. In October 2021, Rebel turned unicorn following a $175-million round, valuing it at $1.4 billion.The round was led by sovereign wealth fund Qatar Investment Authority (QIA).US-based Coatue and homegrown fund Lightbox are expected to partially sell their stakes during the upcoming secondary sale. “Coatue and Lightbox are finalising the quantum of secondaries. Other investors may join in. Temasek is joining as a new investor,” said one person cited earlier.Lightbox owns 9.7%, while Coatue holds 18.6% in Rebel Foods. Peak XV Partners, Goldman Sachs are among its other investors.","cleaned_content":"singaporean sovereign fund temasek is in advanced discussions to lead a \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e million investment in rebel foods parent of faasos behrouz biryani and other cloud kitchen brands people aware of developments said the proposed deal will be a mix of primary and secondary share sales with the mumbai based unicorn being ascribed a nearly flat valuation compared to its previous round nearly three years ago they added the secondary sale where existing investors partly divest to temasek is likely at a lower valuation of around \u003cSEVEN_HUNDRED\u003e million said the people in october \u003cTWO_THOUSAND\u003e rebel turned unicorn following a \u003cONE_HUNDRED\u003e million round valuing it at \u003cONE_\u003e billion the round was led by sovereign wealth fund qatar investment authority qia us based coatue and homegrown fund lightbox are expected to partially sell their stakes during the upcoming secondary sale coatue and lightbox are finalising the quantum of secondaries other investors may join in temasek is joining as a new investor said one person cited earlier lightbox owns \u003cNINE_PERCENT\u003e while coatue holds \u003cONE_TEN_PERCENT\u003e in rebel foods peak xv partners goldman sachs are among its other investors","timestamp":"2024-08-26T09:09:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}