{"url":"https://economictimes.indiatimes.com/tech/technology/sc-refuses-to-pass-order-to-stop-coc-from-holding-meeting-in-insolvency-proceedings-against-byjus/articleshow/112714064.cms","title":"Byju's bankruptcy: SC refuses stay on Committee of Creditors meeting","description":"A bench comprising Chief Justice D Y Chandrachud and Justices J B Pardiwala and Manoj Misra, however, said it will accord the final hearing in the matter on August 27.","content":"The Supreme Court on Thursday refused to stay the meetings of the newly appointed Committee of Creditors (CoC) of debt-ridden Think \u0026 Learn Pvt Ltd, the parent of online educational services company Byju's, saying it would first hear the case on merits on Tuesday and decide accordingly.Challenging the formation of the CoC, senior counsel AM Manu Singhvi, appearing for Think and Learn, told a Bench led by Chief Justice DY Chandrachud, that the appeal will have to be heard on merits and posted the matter next Tuesday.said that the CoC was constituted on Wednesday (Aug 21), wherein 98% of the composition involves its US lender GLAS Trust Co LLC, the trustee for lenders to whom Byju’s owe $1.2 billion. “This CoC(committee of creditors) was set up without asking, and an email was sent to the resolution professional for this purpose. This isn't fair. The CoC could have been constituted tomorrow with your permission. This whole thing is done to make my argument irreversible,\" he said.The senior counsel further submitted that under Section 12A of the Insolvency and Bankruptcy Code, the insolvency pleas can only be withdrawn if 90% of the creditors approve the decision after the CoC is formed. He said that Glas Trust, which represents 98% of the lenders, was pushing forward the process without adequate consent from other stakeholders.ETtech Explainer: What's next for Byju's after SC stays settlement deal with BCCISolicitor General Tushar Mehta, appearing for the Board of Control for Cricket in India (BCCI), too asked the court to either stay or defer the CoC meeting, arguing that a balanced approach is needed to prevent any one party from dominating the proceedings. “How can this 98% decide anything?... please balance equities,” he said, adding that it would amount to allowing the appeal by the US lender to reject BCCI's settlement with Think and Learn.","cleaned_content":"the supreme court on thursday refused to stay the meetings of the newly appointed committee of creditors coc of debt ridden think learn pvt ltd the parent of online educational services company byjus saying it would first hear the case on merits on tuesday and decide accordingly challenging the formation of the coc senior counsel am manu singhvi appearing for think and learn told a bench led by chief justice dy chandrachud that the appeal will have to be heard on merits and posted the matter next tuesday said that the coc was constituted on wednesday aug \u003cTWO_TEN\u003e wherein \u003cNINE_TEN_PERCENT\u003e of the composition involves its us lender glas trust co llc the trustee for lenders to whom byju s owe \u003cONE_\u003e billion this coc committee of creditors was set up without asking and an email was sent to the resolution professional for this purpose this isnt fair the coc could have been constituted tomorrow with your permission this whole thing is done to make my argument irreversible he said the senior counsel further submitted that under section \u003cONE_TEN\u003e a of the insolvency and bankruptcy code the insolvency pleas can only be withdrawn if \u003cNINE_TEN_PERCENT\u003e of the creditors approve the decision after the coc is formed he said that glas trust which represents \u003cNINE_TEN_PERCENT\u003e of the lenders was pushing forward the process without adequate consent from other stakeholders ettech explainer whats next for byjus after sc stays settlement deal with bccisolicitor general tushar mehta appearing for the board of control for cricket in india bcci too asked the court to either stay or defer the coc meeting arguing that a balanced approach is needed to prevent any one party from dominating the proceedings how can this \u003cNINE_TEN_PERCENT\u003e decide anything please balance equities he said adding that it would amount to allowing the appeal by the us lender to reject bccis settlement with think and learn","timestamp":"2024-08-22T20:39:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}