{"url":"https://economictimes.indiatimes.com/tech/technology/oyo-projects-three-fold-rise-in-fy25-pat-at-rs-700-crore/articleshow/112865789.cms","title":"Oyo projects three-fold rise in FY25 PAT at Rs 700 crore","description":"According to founder and CEO Ritesh Agarwal, Oyo achieved a net profit (PAT) of about Rs 132 crore in Q1 FY 2025, a turnaround from the Rs 108 crore loss reported for the same quarter of the previous fiscal year.","content":"Travel tech platform Oyo has projected a three-fold rise in its profit after tax for the current financial year at over Rs 700 crore, founder and CEO Ritesh Agarwal told employees in a town hall on Wednesday, sources said. Earlier this year, Oyo reported its first-ever profit after tax of nearly Rs 229 crore for FY24.  Agarwal shared the company's provisional net profit numbers for Q1 and FY25 at the employee town hall, sources told PTI.  According to Agarwal, Oyo achieved a net profit (PAT) of about Rs 132 crore in Q1 FY 2025, a turnaround from the Rs 108 crore loss reported for the same quarter of the previous fiscal year.  He also shared that the company projects its PAT to surge three-fold to over Rs 700 crore in the current fiscal year.  The company's FY24 profitability, growth in key markets, and expected reduction in interest outgo have bolstered confidence in achieving a projected net profit of over Rs 700 crore, potentially tripling the Earnings Per Share (EPS) from 36 paise to nearly Rs 1, according to a presentation shared in the town hall. ","cleaned_content":"travel tech platform oyo has projected a three fold rise in its profit after tax for the current financial year at over rs \u003cSEVEN_HUNDRED\u003e crore founder and ceo ritesh agarwal told employees in a town hall on wednesday sources said earlier this year oyo reported its first ever profit after tax of nearly rs \u003cTWO_HUNDRED\u003e crore for fy24 agarwal shared the companys provisional net profit numbers for q1 and fy25 at the employee town hall sources told pti according to agarwal oyo achieved a net profit pat of about rs \u003cONE_HUNDRED\u003e crore in q1 fy \u003cTWO_THOUSAND\u003e a turnaround from the rs \u003cONE_HUNDRED\u003e crore loss reported for the same quarter of the previous fiscal year he also shared that the company projects its pat to surge three fold to over rs \u003cSEVEN_HUNDRED\u003e crore in the current fiscal year the companys fy24 profitability growth in key markets and expected reduction in interest outgo have bolstered confidence in achieving a projected net profit of over rs \u003cSEVEN_HUNDRED\u003e crore potentially tripling the earnings per share eps from \u003cTHREE_TEN\u003e paise to nearly rs \u003cONE_\u003e according to a presentation shared in the town hall","timestamp":"2024-08-28T16:18:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}