{"url":"https://economictimes.indiatimes.com/tech/technology/south-korea-to-ask-telegram-other-social-media-firms-to-help-tackle-digital-sex-crimes/articleshow/112856709.cms","title":"South Korea to ask Telegram, other social media firms to help tackle digital sex crimes","description":"South Korean authorities plan to seek more cooperation from social media platforms like Telegram to combat sexually explicit deepfake content. Steps include a 24-hour victim hotline and doubling digital sex crime monitoring personnel. Police will intensify efforts to tackle online sex crimes over the next seven months.","content":"South Korean authorities said on Wednesday they plan to ask Telegram and other social media platforms to more actively help with the deletion and blocking of sexually explicit deepfake content, part of measures aimed at tackling the growing problem. The steps come amid public and political outrage after several domestic media outlets reported that sexually explicit deepfake images and videos of South Korean women were often found in Telegram chatrooms. A 24-hour hotline for victims will also be set up and the number of regulatory personnel monitoring digital sex crimes will be doubled from the current number of 70, the Korea Communications Standards Commission said. The Korean National Police Agency also said it will make a seven-month push to crack down on online sex crimes. The media watchdog plans to set up a consultative body to enhance communication with social media firms about deleting and blocking sexual deepfake content, its chairman, Ryu Hee-lim, told a meeting on the issue.","cleaned_content":"south korean authorities said on wednesday they plan to ask telegram and other social media platforms to more actively help with the deletion and blocking of sexually explicit deepfake content part of measures aimed at tackling the growing problem the steps come amid public and political outrage after several domestic media outlets reported that sexually explicit deepfake images and videos of south korean women were often found in telegram chatrooms a \u003cTWO_TEN\u003e hour hotline for victims will also be set up and the number of regulatory personnel monitoring digital sex crimes will be doubled from the current number of \u003cSEVEN_TEN\u003e the korea communications standards commission said the korean national police agency also said it will make a seven month push to crack down on online sex crimes the media watchdog plans to set up a consultative body to enhance communication with social media firms about deleting and blocking sexual deepfake content its chairman ryu hee lim told a meeting on the issue","timestamp":"2024-08-28T11:37:00+05:30","market_timestamp":"2024-08-28T11:37:00+05:30","off_market_hours":false}