{"url":"https://economictimes.indiatimes.com/tech/technology/gopro-to-cut-15-of-workforce-in-restructuring-push/articleshow/112639801.cms","title":"GoPro to cut 15% of workforce in restructuring push","description":"GoPro expects to take charges in the range of $5 million to $7 million for the restructuring plan, with cash expenses of $1 million to be recognized in the third quarter and about $4 million to $6 million in the fourth quarter of 2024.","content":"-Action camera maker GoPro said on Monday it would cut about 15% of its workforce this year, as part of a restructuring plan to reduce operating expenses. The company expects to take charges in the range of $5 million to $7 million for the restructuring plan, with cash expenses of $1 million to be recognized in the third quarter and about $4 million to $6 million in the fourth quarter of 2024.  The layoffs - around 139 jobs - are expected to begin in the third quarter and would be completed by the end of 2024. Shares of the company, which had 925 full-time employees at the end of the second quarter ended June 30, were up 1.5% after the layoffs were announced. Earlier this month, GoPro reported revenue of $186 million for second quarter, down 22.7% compared to last year and operating expenses of $103 million, an increase of 5% from a year ago.","cleaned_content":"action camera maker gopro said on monday it would cut about \u003cONE_TEN_PERCENT\u003e of its workforce this year as part of a restructuring plan to reduce operating expenses the company expects to take charges in the range of \u003cFIVE_\u003e million to \u003cSEVEN_\u003e million for the restructuring plan with cash expenses of \u003cONE_\u003e million to be recognized in the third quarter and about \u003cFOUR_\u003e million to \u003cSIX_\u003e million in the fourth quarter of \u003cTWO_THOUSAND\u003e the layoffs around \u003cONE_HUNDRED\u003e jobs are expected to begin in the third quarter and would be completed by the end of \u003cTWO_THOUSAND\u003e shares of the company which had \u003cNINE_HUNDRED\u003e full time employees at the end of the second quarter ended june \u003cTHREE_TEN\u003e were up \u003cONE_PERCENT\u003e after the layoffs were announced earlier this month gopro reported revenue of \u003cONE_HUNDRED\u003e million for second quarter down \u003cTWO_TEN_PERCENT\u003e compared to last year and operating expenses of \u003cONE_HUNDRED\u003e million an increase of \u003cFIVE_PERCENT\u003e from a year ago","timestamp":"2024-08-20T08:09:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}