{"url":"https://economictimes.indiatimes.com/tech/technology/salesforce-expands-local-cloud-platform-to-israel/articleshow/113232997.cms","title":"Salesforce expands local cloud platform to Israel","description":"The platform, two years in the making, will initially run on Amazon Web Services (AWS) infrastructure and possibly later on Google Cloud Platform, company officials said.","content":"Cloud software firm Salesforce said on Tuesday its Hyperforce cloud platform was now available in Israel, which will allow sensitive government and companies' data to stay local. The platform, two years in the making, will initially run on Amazon Web Services (AWS) infrastructure and possibly later on Google Cloud Platform, company officials said. Itai Margalit, head of sales at Salesforce in Israel, said having a cloud platform would benefit government entities and those firms \"that are regulated and need to comply with privacy laws ... and cannot go out of the boundaries of Israel.\" The cloud platform in Israel is the 17th globally for Salesforce. Until now, data from its thousands of companies in Israel were storing data at its Frankfurt facility. \"The Israeli government approved our Frankfurt data center, for government use,\" Udi Shvekey, the lead architect for Hyperforce, said on the sidelines of a press conference in Tel Aviv.","cleaned_content":"cloud software firm salesforce said on tuesday its hyperforce cloud platform was now available in israel which will allow sensitive government and companies data to stay local the platform two years in the making will initially run on amazon web services aws infrastructure and possibly later on google cloud platform company officials said itai margalit head of sales at salesforce in israel said having a cloud platform would benefit government entities and those firms that are regulated and need to comply with privacy laws and cannot go out of the boundaries of israel the cloud platform in israel is the \u003cONE_TEN\u003e th globally for salesforce until now data from its thousands of companies in israel were storing data at its frankfurt facility the israeli government approved our frankfurt data center for government use udi shvekey the lead architect for hyperforce said on the sidelines of a press conference in tel aviv","timestamp":"2024-09-10T19:26:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}