{"url":"https://economictimes.indiatimes.com/tech/technology/googles-legal-scorecard-as-another-antitrust-fight-arrives/articleshow/113181148.cms","title":"Google's legal scorecard as another antitrust fight arrives","description":"Google's luck in US courts ran out in December when a federal jury sided with Epic Games, a video game developer, and its antitrust claims against Google's operation of its app store. Eight months later, a federal judge sided with the Justice Department and said Google broke the law to rig the search market.","content":"Google's next antitrust trial is set to start Monday, and after years of mostly prevailing over regulators and competitors, the tech giant is heading into its latest courtroom showdown with an increasingly shaky legal track record. Google's luck in US courts ran out in December when a federal jury sided with Epic Games, a video game developer, and its antitrust claims against Google's operation of its app store. Eight months later, a federal judge sided with the Justice Department and said Google broke the law to rig the search market. The company had already been dinged by legal challenges in Europe, where regulators brought antitrust cases against the company years before their US peers. But the August ruling by Judge Amit P. Mehta of US District Court for the District of Columbia, a decision that Google said it would appeal, could pave the way for more private lawsuits against Google and reshape the entire tech industry if it leads to the breakup of the search giant. Now, the company faces another claim by the Justice Department, this time that it broke the law to advance its advertising technology systems and should be forced to divest the unit. Google has argued that the government's claims do not account for significant competition in the advertising market from companies such as Amazon and Meta, which owns Facebook and Instagram.","cleaned_content":"googles next antitrust trial is set to start monday and after years of mostly prevailing over regulators and competitors the tech giant is heading into its latest courtroom showdown with an increasingly shaky legal track record googles luck in us courts ran out in december when a federal jury sided with epic games a video game developer and its antitrust claims against googles operation of its app store eight months later a federal judge sided with the justice department and said google broke the law to rig the search market the company had already been dinged by legal challenges in europe where regulators brought antitrust cases against the company years before their us peers but the august ruling by judge amit p mehta of us district court for the district of columbia a decision that google said it would appeal could pave the way for more private lawsuits against google and reshape the entire tech industry if it leads to the breakup of the search giant now the company faces another claim by the justice department this time that it broke the law to advance its advertising technology systems and should be forced to divest the unit google has argued that the governments claims do not account for significant competition in the advertising market from companies such as amazon and meta which owns facebook and instagram","timestamp":"2024-09-09T10:26:00+05:30","market_timestamp":"2024-09-09T10:26:00+05:30","off_market_hours":false}