{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-paytm-deal-clouds-kkrs-investment-in-bookmyshow/articleshow/113068745.cms","title":"Zomato's big Paytm play puts a spanner in KKR-BookMyShow deal","description":"KKR is talking to BookMyShow, India's largest online ticket-booking platform, to rejig the details of the $250-300 million investment it was planning for a minority stake. Zomato recently bought Paytm's live ticketing business in a deal valued at over Rs 2,000 crore.","content":"Zomato's recent acquisition of Paytm's entertainment business has put a cloud over KKR's planned investment in BookMyShow (BMS), India's largest online ticket-booking platform, said two people aware of the development. KKR is believed to be renegotiating with BMS over the deal size and valuation, said sources. KKR had earlier planned to invest about $250-300 million in Reliance Industries Ltd-backed BookMyShow to acquire a significant minority stake, ET first reported in January. The valuation of BMS then was estimated to be around Rs 7,500 crore ($900 mn), ET reported.A KKR spokesperson declined to comment, while BookMyShow did not respond to the queries sent on Saturday.Zomato's entry into the entertainment and ticketing market is expected to hit the revenue of BookMyShow, which enjoys a near-monopoly with 75% market share. The largest shareholder of BMS, operated by Bigtree Entertainment, is Reliance unit Network18, holding a 39% stake. Other existing investors include Accel, Elevation Capital, Stripes Group, and TPG Growth.","cleaned_content":"zomatos recent acquisition of paytms entertainment business has put a cloud over kkrs planned investment in bookmyshow bms indias largest online ticket booking platform said two people aware of the development kkr is believed to be renegotiating with bms over the deal size and valuation said sources kkr had earlier planned to invest about \u003cTWO_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e million in reliance industries ltd backed bookmyshow to acquire a significant minority stake et first reported in january the valuation of bms then was estimated to be around rs \u003cSEVEN_THOUSAND\u003e crore \u003cNINE_HUNDRED\u003e mn et reported a kkr spokesperson declined to comment while bookmyshow did not respond to the queries sent on saturday zomatos entry into the entertainment and ticketing market is expected to hit the revenue of bookmyshow which enjoys a near monopoly with \u003cSEVEN_TEN_PERCENT\u003e market share the largest shareholder of bms operated by bigtree entertainment is reliance unit network18 holding a \u003cTHREE_TEN_PERCENT\u003e stake other existing investors include accel elevation capital stripes group and tpg growth","timestamp":"2024-09-05T19:49:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}