{"url":"https://economictimes.indiatimes.com/tech/technology/social-media-platform-x-down-for-thousands-of-users-downdetector-shows/articleshow/113152667.cms","title":"Social media platform X down for thousands of users","description":"X (Twitter) down: Social media platform X suffered outages on Saturday, according to outage tracking site Downdetector.com.The website, which tracks outages by collating status reports from several sources including users, showed more than 7,743 reports of outages in the U.S. as of 10:28 a.m.","content":"Social media platform X suffered outages on Saturday, according to outage tracking site Downdetector.com.The website, which tracks outages by collating status reports from several sources including users, showed more than 7,743 reports of outages in the U.S. as of 10:28 a.m.About 80% people reported issues with the X website, as per Downdetector.There were more than 8,200 reports at the peak of the outage at 10:31 a.m. ET. The cause of the outage is not yet known. X did not immediately respond to Reuters' request for outside regular business hours.Notably, X has suffered multiple major outages in recent months, post Elon Musk's takeover.","cleaned_content":"social media platform x suffered outages on saturday according to outage tracking site downdetector com the website which tracks outages by collating status reports from several sources including users showed more than \u003cSEVEN_THOUSAND\u003e reports of outages in the u s as of \u003cONE_TEN\u003e \u003cTWO_TEN\u003e a m about \u003cEIGHT_TEN_PERCENT\u003e people reported issues with the x website as per downdetector there were more than \u003cEIGHT_THOUSAND\u003e reports at the peak of the outage at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e a m et the cause of the outage is not yet known x did not immediately respond to reuters request for outside regular business hours notably x has suffered multiple major outages in recent months post elon musks takeover","timestamp":"2024-09-07T21:44:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}