{"url":"https://economictimes.indiatimes.com/tech/technology/starlink-backtracks-complies-with-order-blocking-x-in-brazil/articleshow/113046981.cms","title":"Starlink backtracks, complies with order blocking X in Brazil","description":"X has been blocked in Brazil since last week after Moraes ordered all telecom providers in the country to shut down the social media platform for lacking a legal representative in the country, a decision later upheld by a panel of Supreme Court justices.","content":"Elon Musk's satellite broadband firm, Starlink, on Tuesday said that it is complying with Brazil's top court order to block access to social media platform X in the country, a day after informing the country's regulator it would not obey the order. Starlink had emerged as a fresh battleground between Musk and Brazil, as top court judge Alexandre de Moraes ordered the freeze of the company's accounts for possible use to pay fines owed by X, which is also owned by Musk. \"Regardless of the illegal treatment of Starlink in freezing of our assets, we are complying with the order to block access to X in Brazil,\" Starlink, which has more than 200,000 customers in the Latin American nation, said in a post on X.  On Monday, Brazil's telecom regulator Anatel said it had been informed by Starlink that the Musk-backed company would not obey Moraes' order for all internet providers to block domestic access to X. An Anatel representative told Reuters, however, that Starlink had backtracked and informed the regulator on Tuesday it would conclude the blocking within hours.","cleaned_content":"elon musks satellite broadband firm starlink on tuesday said that it is complying with brazils top court order to block access to social media platform x in the country a day after informing the countrys regulator it would not obey the order starlink had emerged as a fresh battleground between musk and brazil as top court judge alexandre de moraes ordered the freeze of the companys accounts for possible use to pay fines owed by x which is also owned by musk regardless of the illegal treatment of starlink in freezing of our assets we are complying with the order to block access to x in brazil starlink which has more than \u003cTWO_HUNDRED_THOUSAND\u003e customers in the latin american nation said in a post on x on monday brazils telecom regulator anatel said it had been informed by starlink that the musk backed company would not obey moraes order for all internet providers to block domestic access to x an anatel representative told reuters however that starlink had backtracked and informed the regulator on tuesday it would conclude the blocking within hours","timestamp":"2024-09-04T07:43:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}