{"url":"https://economictimes.indiatimes.com/tech/technology/centre-to-expand-semiconductor-scheme-looks-to-get-raw-material-suppliers-ism-chief/articleshow/113201144.cms","title":"Centre to expand semiconductor scheme, looks to get raw material suppliers: ISM chief","description":"“When we started ISM, the idea was that we need to support this industry for at least 10 years till we become mature. So, of course, we need to expand it. We need to (expand it) since out of this (ISM Phase one) fund, a lot has been committed for the projects which we have sanctioned,” Tripathi told reporters at an event here in the city on Monday.","content":"The government will expand the scheme for setting up semiconductor chip fabrication and packaging as well as other companies in the ecosystem under the second phase of the India Semiconductor Mission (ISM), said ISM CEO Akash Tripathi.There are about 20 more proposals by semiconductor chip fabrication units, display fabrication companies, raw material suppliers and chip packaging companies, he told media persons on Monday.“When we started ISM, the idea was that we need to support this industry for at least 10 years till we become mature. So, of course, we need to expand it. We need to (expand it) since out of this (ISM phase one) fund, a lot has been committed for the projects which we have sanctioned,” he said.The government is also focusing on getting other companies such as raw material suppliers, gas companies and other vendors of the semiconductor ecosystem to India, apart from working to get the chip fabrication and packaging units, he said.“We hope that in future also we will get more investment in this sector. Only fabs will not suffice (or) only OSATs (outsourced semiconductor assembly and test) will not suffice. So, we have this inkling that we need to support all the ecosystem components,” Tripathi said.","cleaned_content":"the government will expand the scheme for setting up semiconductor chip fabrication and packaging as well as other companies in the ecosystem under the second phase of the india semiconductor mission ism said ism ceo akash tripathi there are about \u003cTWO_TEN\u003e more proposals by semiconductor chip fabrication units display fabrication companies raw material suppliers and chip packaging companies he told media persons on monday when we started ism the idea was that we need to support this industry for at least \u003cONE_TEN\u003e years till we become mature so of course we need to expand it we need to expand it since out of this ism phase one fund a lot has been committed for the projects which we have sanctioned he said the government is also focusing on getting other companies such as raw material suppliers gas companies and other vendors of the semiconductor ecosystem to india apart from working to get the chip fabrication and packaging units he said we hope that in future also we will get more investment in this sector only fabs will not suffice or only osats outsourced semiconductor assembly and test will not suffice so we have this inkling that we need to support all the ecosystem components tripathi said","timestamp":"2024-09-09T21:51:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}