{"url":"https://economictimes.indiatimes.com/tech/technology/quick-commerce-boom-a-look-at-top-developments-in-rapid-delivery-space/articleshow/112891247.cms","title":"Quick commerce rush: A look at what Amazon, BigBasket, Flipkart and other players are up to","description":"India's quick commerce sector is seeing a surge in competition with major players like Amazon, Flipkart, and Ola planning to enter. Established names such as Blinkit, Zepto, and Swiggy's Instamart continue to expand. New investments and leadership changes mark this dynamic industry's rapid growth.","content":"The buzzing quick commerce space continues to see new entrants as more and more companies try to snag a piece of the pie.Ecommerce majors Amazon and Flipkart, and mobility major Ola are among those that are planning to enter the segment even as existing players like Zomato-owned Blinkit, Zepto and Swiggy’s Instamart continue to strengthen their play.Take a look at some of the recent developments in the quick commerce segment in India:Zepto bags $340 million in funding: Quick commerce firm Zepto has raised another $340 million (Rs 2,850 crore) from new investors General Catalyst, Mars Growth Capital and Epiq Capital, and others, taking the total funds it raised in the past two months to $1 billion. ET first reported about Zepto finalising a $300 million funding and Mars Growth joining the round on August 12. ","cleaned_content":"the buzzing quick commerce space continues to see new entrants as more and more companies try to snag a piece of the pie ecommerce majors amazon and flipkart and mobility major ola are among those that are planning to enter the segment even as existing players like zomato owned blinkit zepto and swiggy s instamart continue to strengthen their play take a look at some of the recent developments in the quick commerce segment in india zepto bags \u003cTHREE_HUNDRED\u003e million in funding quick commerce firm zepto has raised another \u003cTHREE_HUNDRED\u003e million rs \u003cTWO_THOUSAND\u003e crore from new investors general catalyst mars growth capital and epiq capital and others taking the total funds it raised in the past two months to \u003cONE_\u003e billion et first reported about zepto finalising a \u003cTHREE_HUNDRED\u003e million funding and mars growth joining the round on august \u003cONE_TEN\u003e","timestamp":"2024-08-30T12:45:00+05:30","market_timestamp":"2024-08-30T12:45:00+05:30","off_market_hours":false}