{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-supreme-court-panel-unanimously-upholds-judges-decision-to-block-x-nationwide/articleshow/113010282.cms","title":"Brazil Supreme Court panel unanimously upholds judge's decision to block X nationwide","description":"The panel that voted in a virtual session was comprised of five of the full bench's 11 justices, including de Moraes, who last Friday ordered the platform blocked for refusing to name a local legal representative, as required by law. It will stay suspended until it complies with his orders.","content":"A Brazilian Supreme Court panel on Monday unanimously upheld the decision of one of its justices to block billionaire Elon Musk's social media platform X nationwide, according to the court's website. The broader support among justices undermines the effort by Musk and his supporters to cast Justice Alexandre de Moraes as an authoritarian renegade who is intent on censoring political speech in Brazil.  The panel that voted in a virtual session was comprised of five of the full bench's 11 justices, including de Moraes, who last Friday ordered the platform blocked for refusing to name a local legal representative, as required by law. It will stay suspended until it complies with his orders and pays outstanding fines that as of last week exceeded $3 million, according to his decision. The platform has clashed with de Moraes over its reluctance to block users, and has alleged that de Moraes wants an in-country legal representative so that Brazilian authorities can exert leverage over the company by having someone to arrest. De Moraes also set a daily fine of 50,000 reais ($8,900) for people or companies using virtual private networks, or VPNs, to access X. Some legal experts questioned the grounds for that decision and how it would be enforced, including Brazil's bar association, which said it would request the Supreme Court review that provision.","cleaned_content":"a brazilian supreme court panel on monday unanimously upheld the decision of one of its justices to block billionaire elon musks social media platform x nationwide according to the courts website the broader support among justices undermines the effort by musk and his supporters to cast justice alexandre de moraes as an authoritarian renegade who is intent on censoring political speech in brazil the panel that voted in a virtual session was comprised of five of the full benchs \u003cONE_TEN\u003e justices including de moraes who last friday ordered the platform blocked for refusing to name a local legal representative as required by law it will stay suspended until it complies with his orders and pays outstanding fines that as of last week exceeded \u003cTHREE_\u003e million according to his decision the platform has clashed with de moraes over its reluctance to block users and has alleged that de moraes wants an in country legal representative so that brazilian authorities can exert leverage over the company by having someone to arrest de moraes also set a daily fine of \u003cFIVE_TEN_THOUSAND\u003e reais \u003cEIGHT_THOUSAND\u003e for people or companies using virtual private networks or vpns to access x some legal experts questioned the grounds for that decision and how it would be enforced including brazils bar association which said it would request the supreme court review that provision","timestamp":"2024-09-03T09:49:00+05:30","market_timestamp":"2024-09-03T09:49:00+05:30","off_market_hours":false}