{"url":"https://economictimes.indiatimes.com/tech/technology/why-telegram-chiefs-arrest-raises-red-flags-for-tech-bosses/articleshow/112917455.cms","title":"Why Telegram chief's arrest raises 'red flags' for tech bosses","description":"Russia-born Pavel Durov is accused of \"complicity\" in running an online platform that allowed illicit transactions, child sex abuse images, and other illegal content. Experts told AFP that Chat apps like Telegram boasts having more than 900 million users -- were almost certainly hosting illegal content whether the bosses knew it or not.","content":"Now that France has charged Telegram's founder with failing to stop illegal activity on his platform, other tech bosses may have reason to weigh the wisdom of jetting into Europe themselves.Russia-born Pavel Durov is accused of \"complicity\" in running an online platform that allowed illicit transactions, child sex abuse images and other illegal content.French lawyers told AFP it was \"unprecedented\" for an individual to be held criminally liable for what users chose to do on a tech platform.Chat apps like Telegram -- which boasts having more than 900 million users -- were almost certainly hosting illegal content whether the bosses knew it or not, experts told AFP.\"It's clear that if they take this case against Pavel Durov all the way, any other platform could be threatened with the same thing,\" lawyer Guillaume Martine told AFP.","cleaned_content":"now that france has charged telegrams founder with failing to stop illegal activity on his platform other tech bosses may have reason to weigh the wisdom of jetting into europe themselves russia born pavel durov is accused of complicity in running an online platform that allowed illicit transactions child sex abuse images and other illegal content french lawyers told afp it was unprecedented for an individual to be held criminally liable for what users chose to do on a tech platform chat apps like telegram which boasts having more than \u003cNINE_HUNDRED\u003e million users were almost certainly hosting illegal content whether the bosses knew it or not experts told afp its clear that if they take this case against pavel durov all the way any other platform could be threatened with the same thing lawyer guillaume martine told afp","timestamp":"2024-08-30T12:32:00+05:30","market_timestamp":"2024-08-30T12:32:00+05:30","off_market_hours":false}