{"url":"https://economictimes.indiatimes.com/tech/technology/esports-world-cup-reached-over-10-5-million-indians-barc/articleshow/113114042.cms","title":"Esports World Cup reached over 10.5 million Indians: BARC","description":"Esports World Cup: Social media influencers promoted the World Cup content, gathering a reach of more than 39 million. Popular creator Rishabh Shukla’s reel was watched 20.3 million times alone, Star Sports, the official broadcast partner of EWC told ET.","content":"The first edition of Esports World Cup (EWC), which concluded last week in Saudi Arabia had a reach of 10.5 million in India and a total consumption of 64 million minutes watched, the Broadcast Audience Research Council (BARC) data showed.Although Indian players did not compete in Riyadh, social media influencers promoted the World Cup content, gathering a reach of more than 39 million. Popular creator Rishabh Shukla’s reel was watched 20.3 million times alone, Star Sports, the official broadcast partner of EWC told ET.“With close to 500 million gamers and an even larger fanbase, India is solid and a promising esports market,” said Sanjog Gupta-Head of Sports at Disney Star. “This trust is highlighted by our Prime Minister's frequent mentions of supporting the gaming industry.”As for Star Sports, we sighted this opportunity quite early when we partnered with Nodwin Gaming in 2022 as a broadcast partner to their BGMI Masters series which was the first esports franchise to be broadcast in India by the Star Sports Network, Gupta said.He explained that Indian players suffer a disadvantage when it comes to participating in global tournaments as India’s most played and most affordable game, Krafton’s Battleground Mobile India (BGMI), is not available in any other geography.","cleaned_content":"the first edition of esports world cup ewc which concluded last week in saudi arabia had a reach of \u003cONE_TEN\u003e million in india and a total consumption of \u003cSIX_TEN\u003e million minutes watched the broadcast audience research council barc data showed although indian players did not compete in riyadh social media influencers promoted the world cup content gathering a reach of more than \u003cTHREE_TEN\u003e million popular creator rishabh shukla s reel was watched \u003cTWO_TEN\u003e million times alone star sports the official broadcast partner of ewc told et with close to \u003cFIVE_HUNDRED\u003e million gamers and an even larger fanbase india is solid and a promising esports market said sanjog gupta head of sports at disney star this trust is highlighted by our prime ministers frequent mentions of supporting the gaming industry as for star sports we sighted this opportunity quite early when we partnered with nodwin gaming in \u003cTWO_THOUSAND\u003e as a broadcast partner to their bgmi masters series which was the first esports franchise to be broadcast in india by the star sports network gupta said he explained that indian players suffer a disadvantage when it comes to participating in global tournaments as india s most played and most affordable game krafton s battleground mobile india bgmi is not available in any other geography","timestamp":"2024-09-06T11:30:00+05:30","market_timestamp":"2024-09-06T11:30:00+05:30","off_market_hours":false}