{"url":"https://economictimes.indiatimes.com/tech/technology/cryptos-legal-tangles-seem-as-mystifying-as-digital-asset-itself/articleshow/112973421.cms","title":"Crypto’s legal tangles seem as mystifying as digital asset itself","description":"Traders betting on crypto platform WazirX have learnt that they are “unsecured creditors” of a Singapore company named Zettai (the Japanese word for ‘no matter what’). Zettai is the parent of the Indian company Zenmai (also a Japanese word, meaning ‘mainspring’) which operates WazirX. What does this tangle mean?","content":"Legal tangles around cryptocurrency can be as mystifying as the digital asset itself.Traders betting on the troubled crypto platform WazirX, have learnt that they are “unsecured creditors” of a Singapore company named Zettai (the Japanese word for ‘no matter what’); that some of the big-ticket “creditors” or users of WazirX are bent on guarding their privacy; and, the complex relation under any usual regulation on investment schemes. Why? Because unlike a finance company, they were not exactly ‘pooling’ funds, but simply taking your money to buy cryptos you preferred.A complex relationshipIndeed, for unwitting WazirX users the July 2024 cyber heist and the chain of events are a crash course in crypto regulation—or, rather, the absence of it. They spent the weekend deciphering the affidavit filed by WazirX founder Nischal Shetty before the Singapore High Court to support Zettai’s application for a moratorium under the restructuring and insolvency law.Zettai is the parent of the Indian company Zenmai (also a Japanese word, meaning ‘mainspring’) which operates WazirX. The other director of Zettai is Paripooranam, a Singapore resident and daughter of one V Chettiar. In November 2019 Binance announced its takeover of WazirX. The affidavit does not share the details on grounds of confidentiality.","cleaned_content":"legal tangles around cryptocurrency can be as mystifying as the digital asset itself traders betting on the troubled crypto platform wazirx have learnt that they are unsecured creditors of a singapore company named zettai the japanese word for no matter what that some of the big ticket creditors or users of wazirx are bent on guarding their privacy and the complex relation under any usual regulation on investment schemes why because unlike a finance company they were not exactly pooling funds but simply taking your money to buy cryptos you preferred a complex relationshipindeed for unwitting wazirx users the july \u003cTWO_THOUSAND\u003e cyber heist and the chain of events are a crash course in crypto regulation or rather the absence of it they spent the weekend deciphering the affidavit filed by wazirx founder nischal shetty before the singapore high court to support zettai s application for a moratorium under the restructuring and insolvency law zettai is the parent of the indian company zenmai also a japanese word meaning mainspring which operates wazirx the other director of zettai is paripooranam a singapore resident and daughter of one v chettiar in november \u003cTWO_THOUSAND\u003e binance announced its takeover of wazirx the affidavit does not share the details on grounds of confidentiality","timestamp":"2024-09-02T06:11:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}