{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-sheds-279-billion-in-market-cap-reasons-behind-the-fall/articleshow/113061272.cms","title":"Nvidia sheds $279 billion in market cap: reasons behind the fall","description":"Nvidia's market capitalisation stood at $2.65 trillion after Tuesday’s close. Shares of Nvidia have been on a decline over the last week, delivering a negative 13.65% return over the five-day period.","content":"Shares of chip heavyweight Nvidia tumbled 9.53% on Tuesday, as investors questioned artificial intelligence (AI) optimism. Nvidia’s market capitalisation declined by $279 billion, marking the steepest single-day fall for a US company.The company’s market capitalisation stood at $2.65 trillion after Tuesday’s close. Shares of Nvidia have been on a decline over the last week, delivering a negative 13.65% return over the five-day period.A look at what’s driving the steep decline in Nvidia’s share price:US antitrust probeThe US Department of Justice has sent a subpoena (legally binding request) to Nvidia as it probes the company for antitrust practices. Officials are concerned that the chipmaker is making it harder to switch to other suppliers and penalizes buyers that do not exclusively use its AI chips. The DoJ launched a probe after receiving complaints from competitors that Nvidia had abused its market dominance.","cleaned_content":"shares of chip heavyweight nvidia tumbled \u003cNINE_PERCENT\u003e on tuesday as investors questioned artificial intelligence ai optimism nvidia s market capitalisation declined by \u003cTWO_HUNDRED\u003e billion marking the steepest single day fall for a us company the company s market capitalisation stood at \u003cTWO_\u003e trillion after tuesday s close shares of nvidia have been on a decline over the last week delivering a negative \u003cONE_TEN_PERCENT\u003e return over the five day period a look at what s driving the steep decline in nvidia s share price us antitrust probethe us department of justice has sent a subpoena legally binding request to nvidia as it probes the company for antitrust practices officials are concerned that the chipmaker is making it harder to switch to other suppliers and penalizes buyers that do not exclusively use its ai chips the doj launched a probe after receiving complaints from competitors that nvidia had abused its market dominance","timestamp":"2024-09-04T15:40:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}