{"url":"https://economictimes.indiatimes.com/tech/technology/stt-gdc-to-invest-3-2-billion-in-india-to-expand-data-centre-capacity/articleshow/113128699.cms","title":"STT GDC to invest $3.2 billion in India to expand data centre capacity","description":"STT GDC India, in which Tata Communications holds a minority stake, has 28 data centres across 10 cities, with a combined capacity of more than 318 megawatt of IT load. It has about 1,000 enterprise customers.","content":"ST Telemedia Global Data Centres (STT GDC) on Friday announced an investment of $3.2 billion (Rs 26,000 crore) to expand its data centre capacity in India by 550 megawatts over the next five to six years.This will nearly triple the Singapore-headquartered data centre company’s IT load capacity to meet the demands of India's thriving digital economy, it said in a statement.STT GDC India, in which Tata Communications holds a minority stake, has 28 data centres across 10 cities, with a combined capacity of more than 318 megawatt of IT load. It has about 1,000 enterprise customers.“This strategic investment reflects STT GDC's confidence in India and the growth of its digital economy, as well as aligning with the burgeoning demand for digital infrastructure, driven by the surge in data consumption, cloud computing, digital transformation and growing adoption of AI applications,” the company said.It added that the investment would solidify its market leadership in the country where it currently holds a 28% market share by revenue.","cleaned_content":"st telemedia global data centres stt gdc on friday announced an investment of \u003cTHREE_\u003e billion rs \u003cTWO_TEN_THOUSAND\u003e crore to expand its data centre capacity in india by \u003cFIVE_HUNDRED\u003e megawatts over the next five to six years this will nearly triple the singapore headquartered data centre company s it load capacity to meet the demands of indias thriving digital economy it said in a statement stt gdc india in which tata communications holds a minority stake has \u003cTWO_TEN\u003e data centres across \u003cONE_TEN\u003e cities with a combined capacity of more than \u003cTHREE_HUNDRED\u003e megawatt of it load it has about \u003cONE_THOUSAND\u003e enterprise customers this strategic investment reflects stt gdcs confidence in india and the growth of its digital economy as well as aligning with the burgeoning demand for digital infrastructure driven by the surge in data consumption cloud computing digital transformation and growing adoption of ai applications the company said it added that the investment would solidify its market leadership in the country where it currently holds a \u003cTWO_TEN_PERCENT\u003e market share by revenue","timestamp":"2024-09-06T17:56:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}