{"url":"https://economictimes.indiatimes.com/tech/technology/lt-semiconductor-technologies-and-ibm-announce-plans-to-collaborate-on-processor-technology-innovations/articleshow/113234495.cms","title":"L\u0026T Semiconductor Technologies and IBM announce plans to collaborate on processor technology innovations","description":"While L\u0026T Semiconductor Technologies is targeting to build a semiconductor portfolio of smart devices across multiple verticals, IBM is known to drive innovation in silicon and processor development, both independently and with an ecosystem of partners.","content":"L\u0026T Semiconductor Technologies on Tuesday said it is looking to collaborate with IBM to design advanced processors at the inaugural Semicon India 2024 event. The company said the scope of this work could include processor design for edge devices and hybrid cloud systems, as well as for areas like mobility, industrial, energy, and servers.Under this collaboration, IBM and L\u0026T Semiconductor Technologies said they anticipate focusing on innovation, functionality, and performance to enable reliable, secure, and scalable compute for a range of applications. They said this work would be supportive of India’s ambition to create semiconductor technologies that are competitive in the global market.“This is one of the most exciting times in the history of technology, specifically India's semiconductor tech ecosystem. Semiconductors are changing how all industries operate and reimagining how conventional architecture is being designed and used. The goal of our work with IBM is to harness our cutting-edge semiconductor design technology and IBM’s advanced processors to forge next-gen technology products,” Sandeep Kumar, CEO, L\u0026T Semiconductor Technologies said in a statement.The company said that the relationship between the companies emphasises a shared focus to revolutionize the design and development of advanced processors adhering to regulatory standards and creating competitive products for global markets. While L\u0026T Semiconductor Technologies is targeting to build a semiconductor portfolio of smart devices across multiple verticals, IBM is known to drive innovation in silicon and processor development, both independently and with an ecosystem of partners.","cleaned_content":"l t semiconductor technologies on tuesday said it is looking to collaborate with ibm to design advanced processors at the inaugural semicon india \u003cTWO_THOUSAND\u003e event the company said the scope of this work could include processor design for edge devices and hybrid cloud systems as well as for areas like mobility industrial energy and servers under this collaboration ibm and l t semiconductor technologies said they anticipate focusing on innovation functionality and performance to enable reliable secure and scalable compute for a range of applications they said this work would be supportive of india s ambition to create semiconductor technologies that are competitive in the global market this is one of the most exciting times in the history of technology specifically indias semiconductor tech ecosystem semiconductors are changing how all industries operate and reimagining how conventional architecture is being designed and used the goal of our work with ibm is to harness our cutting edge semiconductor design technology and ibm s advanced processors to forge next gen technology products sandeep kumar ceo l t semiconductor technologies said in a statement the company said that the relationship between the companies emphasises a shared focus to revolutionize the design and development of advanced processors adhering to regulatory standards and creating competitive products for global markets while l t semiconductor technologies is targeting to build a semiconductor portfolio of smart devices across multiple verticals ibm is known to drive innovation in silicon and processor development both independently and with an ecosystem of partners","timestamp":"2024-09-10T20:34:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}