{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-explainer-googles-second-big-antitrust-trial-in-us/articleshow/113172573.cms","title":"ETtech Explainer: Behind Google’s fight against a second big antitrust trial in US","description":"This case is part of US President Joe Biden’s broader push to regulate Big Tech using antitrust laws. It comes close on the heels of a significant verdict in favour of the justice department on August 5, when a judge ruled that Google had illegally monopolised online search.","content":"Google will face its second major antitrust trial in the US starting Monday, as the Biden administration’s Department of Justice (DoJ) challenges how the internet giant monetises advertising. Prosecutors argue that Google's monetisation strategies are unfairly harming the industry.This case is part of US President Joe Biden’s broader push to regulate Big Tech using antitrust laws. It comes close on the heels of a significant verdict in favour of the justice department on August 5, when a judge ruled that Google had illegally monopolised online search.What is the latest lawsuit about?The trial, which commences next week in the US state of Virginia, centres on Google’s adtech business, which connects publishers with advertisers and accounts for over three-fourths of Google’s revenue.In the quarter ended June 30, Google parent Alphabet reported ad revenue of $64.6 billion, more than 75% of its total sales. Of this, $48.5 billion was recorded from search and other businesses like Gmail and Maps, while $8.7 billion came from YouTube.","cleaned_content":"google will face its second major antitrust trial in the us starting monday as the biden administration s department of justice doj challenges how the internet giant monetises advertising prosecutors argue that googles monetisation strategies are unfairly harming the industry this case is part of us president joe biden s broader push to regulate big tech using antitrust laws it comes close on the heels of a significant verdict in favour of the justice department on august \u003cFIVE_\u003e when a judge ruled that google had illegally monopolised online search what is the latest lawsuit about the trial which commences next week in the us state of virginia centres on google s adtech business which connects publishers with advertisers and accounts for over three fourths of google s revenue in the quarter ended june \u003cTHREE_TEN\u003e google parent alphabet reported ad revenue of \u003cSIX_TEN\u003e billion more than \u003cSEVEN_TEN_PERCENT\u003e of its total sales of this \u003cFOUR_TEN\u003e billion was recorded from search and other businesses like gmail and maps while \u003cEIGHT_\u003e billion came from youtube","timestamp":"2024-09-09T08:07:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}