{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-did-not-receive-a-us-justice-department-subpoena-spokesperson/articleshow/113078779.cms","title":"Nvidia did not receive a US Justice Department subpoena: spokesperson","description":"Nvidia has confirmed it did not receive a subpoena from the U.S. Justice Department amid reports of a potential antitrust investigation. The company is willing to cooperate with regulators. The investigation includes Nvidia's business practices and its recent acquisition of Run:AI, an Israel-based company.","content":"Nvidia did not receive a U.S. Justice Department subpoena, a spokesperson said in a statement on Wednesday. \"We have inquired with the U.S. Department of Justice and have not been subpoenaed. Nonetheless, we are happy to answer any questions regulators may have about our business.\" Bloomberg News reported on Tuesday the Justice Department had sent a subpoena related to a potential antitrust investigation, which would signal an escalation in the probe. Bloomberg News said subpoenas had been sent to other companies in addition to Nvidia. The Justice Department has been asking tech companies about Nvidia's business practices in recent weeks, including questions about the company's hardware bundling practices, two sources familiar with the questions investigators are asking told Reuters. The Justice Department did not immediately respond to a request for comment.","cleaned_content":"nvidia did not receive a u s justice department subpoena a spokesperson said in a statement on wednesday we have inquired with the u s department of justice and have not been subpoenaed nonetheless we are happy to answer any questions regulators may have about our business bloomberg news reported on tuesday the justice department had sent a subpoena related to a potential antitrust investigation which would signal an escalation in the probe bloomberg news said subpoenas had been sent to other companies in addition to nvidia the justice department has been asking tech companies about nvidias business practices in recent weeks including questions about the companys hardware bundling practices two sources familiar with the questions investigators are asking told reuters the justice department did not immediately respond to a request for comment","timestamp":"2024-09-05T08:23:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}