{"url":"https://economictimes.indiatimes.com/tech/technology/isro-chairman-somanath-to-launch-cybersecurity-rd-centre-near-airport-on-thursday/articleshow/113065105.cms","title":"ISRO chairman Somanath to launch cybersecurity R\u0026D centre near airport on Thursday","description":"The project \"Cyber Nalanda\" is a step towards revolutionizing cybersecurity with the laying of the foundation stone for a state-of-the-art R\u0026D center in India. \"This initiative is more than just a technological investment; it’s a commitment to securing the future of digital space, globally,\" the company said.","content":"ISRO chairman S Somanath will launch a private-sector cybersecurity R\u0026D centre near Bengaluru international airport. The lab is being built by global forensics-driven cyber security solutions company SISA. The project \"Cyber Nalanda\" is a step towards revolutionizing cybersecurity with the laying of the foundation stone for a state-of-the-art R\u0026D center in India. \"This initiative is more than just a technological investment; it’s a commitment to securing the future of digital space, globally,\" the company said. The Cyber Nalanda's vision is to establish India as a global hub for cybersecurity innovation, focusing on collaboration with academia, significant investment in research, and bridging the global cybersecurity skills gap, SISA founder \u0026 CEO Dharshan Shathamurthy said. SISA will spend 10% of its annual revenues on R\u0026D, ensuring that the solutions developed are designed in India but built to protect the world, he added.","cleaned_content":"isro chairman s somanath will launch a private sector cybersecurity r d centre near bengaluru international airport the lab is being built by global forensics driven cyber security solutions company sisa the project cyber nalanda is a step towards revolutionizing cybersecurity with the laying of the foundation stone for a state of the art r d center in india this initiative is more than just a technological investment it s a commitment to securing the future of digital space globally the company said the cyber nalandas vision is to establish india as a global hub for cybersecurity innovation focusing on collaboration with academia significant investment in research and bridging the global cybersecurity skills gap sisa founder ceo dharshan shathamurthy said sisa will spend \u003cONE_TEN_PERCENT\u003e of its annual revenues on r d ensuring that the solutions developed are designed in india but built to protect the world he added","timestamp":"2024-09-04T17:39:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}