{"url":"https://economictimes.indiatimes.com/tech/technology/hp-to-continue-4-billion-damages-case-against-mike-lynch/articleshow/112998420.cms","title":"HP to continue $4 billion damages case against Mike Lynch","description":"HP, the US company had been seeking compensation over its acquisition of British tech firm Autonomy amid claims of fraud masterminded by its co-founder Mike Lynch to inflate the company's value. Mike Lynch, who died in August when his yacht sank off the coast of Sicily, had denied any wrongdoings.","content":"Hewlett Packard said on Monday it would continue legal proceedings to seek up to $4 billion in damages from British billionaire Mike Lynch's estate in the UK. The US company had been seeking compensation over its acquisition of British tech firm Autonomy amid claims of fraud masterminded by its co-founder Mike Lynch to inflate the company's value. Lynch, who died in August when his yacht sank off the coast of Sicily, had denied any wrongdoings. \"It is HPE's intention to follow the proceedings through to their conclusion,\" the company said in an emailed statement to Reuters. HP had bought Autonomy for $11.1 billion in 2011, in one of the UK's biggest tech deals. But in late 2012, the company said it had discovered a massive accounting scandal at the British tech firm.","cleaned_content":"hewlett packard said on monday it would continue legal proceedings to seek up to \u003cFOUR_\u003e billion in damages from british billionaire mike lynchs estate in the uk the us company had been seeking compensation over its acquisition of british tech firm autonomy amid claims of fraud masterminded by its co founder mike lynch to inflate the companys value lynch who died in august when his yacht sank off the coast of sicily had denied any wrongdoings it is hpes intention to follow the proceedings through to their conclusion the company said in an emailed statement to reuters hp had bought autonomy for \u003cONE_TEN\u003e billion in \u003cTWO_THOUSAND\u003e in one of the uks biggest tech deals but in late \u003cTWO_THOUSAND\u003e the company said it had discovered a massive accounting scandal at the british tech firm","timestamp":"2024-09-02T19:27:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}