{"url":"https://economictimes.indiatimes.com/tech/technology/five-approved-semiconductor-units-across-india-and-projects-in-pipeline/articleshow/113173492.cms","title":"Five approved semiconductor units across India and projects in pipeline","description":"The India Semiconductor Mission (ISM) has approved five semiconductor units that will each receive subsidies from both central and state governments.","content":"India Semiconductor Mission (ISM) has-approved five semiconductor units who will all receive central and state government subsidies under the programme for development of semiconductors and display manufacturing ecosystem in India with a total outlay of Rs. 76,000 crore. ET provides a quick reckoner of the five units along with those in the pipeline.Micron Technology1) In June, 2023, the Union Cabinet had approved the proposal of Micron Technology for setting up a semiconductor unit in Sanand, Gujarat2) Construction of this unit is progressing at a rapid pace. First chip expected in 20253) The memory and storage products manufactured at the assembly, testing, marking and packaging (ATMP) unit of the Idaho-based company will largely be export-led","cleaned_content":"india semiconductor mission ism has approved five semiconductor units who will all receive central and state government subsidies under the programme for development of semiconductors and display manufacturing ecosystem in india with a total outlay of rs \u003cSEVEN_TEN_THOUSAND\u003e crore et provides a quick reckoner of the five units along with those in the pipeline micron technology1 in june \u003cTWO_THOUSAND\u003e the union cabinet had approved the proposal of micron technology for setting up a semiconductor unit in sanand gujarat2 construction of this unit is progressing at a rapid pace first chip expected in \u003cTWO_TEN_THOUSAND\u003e the memory and storage products manufactured at the assembly testing marking and packaging atmp unit of the idaho based company will largely be export led","timestamp":"2024-09-09T06:11:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}