{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-watchdog-moves-to-block-access-to-elon-musks-x-after-court-order/articleshow/112938614.cms","title":"Brazil watchdog moves to block access to Elon Musk's X after court order","description":"Brazil's telecom regulator is set to suspend access to Elon Musk's X social network due to a court order. The platform failed to appoint a legal representative in Brazil and pay fines. The move comes amid a feud between Musk and Supreme Court justice Alexandre de Moraes over content regulation on social media.","content":"Brazil's telecommunications regulator said on Friday it was proceeding to suspend access to Elon Musk's X social network in the country in compliance with an order from a judge who has been locked in a months-long feud with the billionaire investor. The move followed the expiry of a court-imposed deadline for the popular social media platform to name a legal representative in Brazil. Musk has argued that Supreme Court justice Alexandre de Moraes is trying to enforce unjustified censorship, while the judge has insisted that social media needs hate speech regulations. \"They're shutting down the #1 source of truth in Brazil,\" Musk said in a post on X on Friday. X remained accessible in Brazil on Friday evening.","cleaned_content":"brazils telecommunications regulator said on friday it was proceeding to suspend access to elon musks x social network in the country in compliance with an order from a judge who has been locked in a months long feud with the billionaire investor the move followed the expiry of a court imposed deadline for the popular social media platform to name a legal representative in brazil musk has argued that supreme court justice alexandre de moraes is trying to enforce unjustified censorship while the judge has insisted that social media needs hate speech regulations theyre shutting down the \u003cONE_\u003e source of truth in brazil musk said in a post on x on friday x remained accessible in brazil on friday evening","timestamp":"2024-08-31T07:09:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}