{"url":"https://economictimes.indiatimes.com/tech/technology/tax-authorities-seek-101-million-in-byjus-insolvency-process/articleshow/113134813.cms","title":"Tax authorities seek $101 million in Byju's insolvency process","description":"Backed by General Atlantic, Byju's was valued at $22 billion in 2022, but has seen its fortunes dwindle due to many regulatory issues and more recently a dispute with U.S. lenders who are demanding $1 billion in unpaid dues, triggering the company's insolvency that led to an assets freeze.","content":"Indian tax authorities are seeking dues of $101 million from education-technology company Byju's, once the country's biggest startup which is now undergoing an insolvency process, claim documents reviewed by Reuters on Friday showed. Backed by General Atlantic, Byju's was valued at $22 billion in 2022, but has seen its fortunes dwindle due to many regulatory issues and more recently a dispute with U.S. lenders who are demanding $1 billion in unpaid dues, triggering the company's insolvency that led to an assets freeze. The company is being run by court-appointed resolution professional Pankaj Srivastava who is inviting lenders, employees, vendors and government to claim unpaid dues. India's department of revenue has filed a claim worth $18.7 million while the tax department of the state of Karnataka, where Byju's is based, is seeking $82.3 million, according to documents on the Insolvency and Bankruptcy Board of India website. Reuters is first to report the demand numbers, which reveal how much New Delhi believes Byju's owes it, and come after months of complaints by the company's employees that their salaries and mandatory tax deposits to the government have been delayed or missed.","cleaned_content":"indian tax authorities are seeking dues of \u003cONE_HUNDRED\u003e million from education technology company byjus once the countrys biggest startup which is now undergoing an insolvency process claim documents reviewed by reuters on friday showed backed by general atlantic byjus was valued at \u003cTWO_TEN\u003e billion in \u003cTWO_THOUSAND\u003e but has seen its fortunes dwindle due to many regulatory issues and more recently a dispute with u s lenders who are demanding \u003cONE_\u003e billion in unpaid dues triggering the companys insolvency that led to an assets freeze the company is being run by court appointed resolution professional pankaj srivastava who is inviting lenders employees vendors and government to claim unpaid dues indias department of revenue has filed a claim worth \u003cONE_TEN\u003e million while the tax department of the state of karnataka where byjus is based is seeking \u003cEIGHT_TEN\u003e million according to documents on the insolvency and bankruptcy board of india website reuters is first to report the demand numbers which reveal how much new delhi believes byjus owes it and come after months of complaints by the companys employees that their salaries and mandatory tax deposits to the government have been delayed or missed","timestamp":"2024-09-06T21:58:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}