{"url":"https://economictimes.indiatimes.com/tech/technology/india-beauty-and-personal-care-market-to-touch-34-billion-by-2028-report/articleshow/113064581.cms","title":"India beauty and personal care market to touch $34 billion by 2028: report","description":"The online channel, as the fastest-growing segment, is expected to expand at a compound annual growth rate (CAGR) of approximately 25%, while the organised offline channel is anticipated to grow at 14%, according to a report by Nykaa and consulting firm Redseer.","content":"The Indian beauty and personal care (BPC) market is poised to reach $34 billion by 2028, up from $21 billion now, driven by a surge in online penetration and a growing preference for high-quality, premium beauty products, according to a report by Nykaa and consulting firm Redseer.The online channel, as the fastest-growing segment, is expected to expand at a compound annual growth rate (CAGR) of approximately 25%, while the organised offline channel is anticipated to grow at 14%.“There's no one silver bullet that will make you either a successful or unsuccessful retailer,” said Anchit Nayar, chief executive of Nykaa Beauty, in an interaction with ET, when asked about capturing growing demand in the face of stiff competition.“The way the competitive landscape is evolving, everybody's doing one or two things, but nobody's doing everything. If you look at the horizontal marketplaces, their focus is predominantly mass personal care. Some of the new competition - they're going very premium. We're the only ones who are doing tier one through tier three, mass to premium, online plus offline, global brands and domestic brands. So there is no silver bullet.”Also Read | Funds make a beeline for beauty platforms","cleaned_content":"the indian beauty and personal care bpc market is poised to reach \u003cTHREE_TEN\u003e billion by \u003cTWO_THOUSAND\u003e up from \u003cTWO_TEN\u003e billion now driven by a surge in online penetration and a growing preference for high quality premium beauty products according to a report by nykaa and consulting firm redseer the online channel as the fastest growing segment is expected to expand at a compound annual growth rate cagr of approximately \u003cTWO_TEN_PERCENT\u003e while the organised offline channel is anticipated to grow at \u003cONE_TEN_PERCENT\u003e theres no one silver bullet that will make you either a successful or unsuccessful retailer said anchit nayar chief executive of nykaa beauty in an interaction with et when asked about capturing growing demand in the face of stiff competition the way the competitive landscape is evolving everybodys doing one or two things but nobodys doing everything if you look at the horizontal marketplaces their focus is predominantly mass personal care some of the new competition theyre going very premium were the only ones who are doing tier one through tier three mass to premium online plus offline global brands and domestic brands so there is no silver bullet also read funds make a beeline for beauty platforms","timestamp":"2024-09-04T22:10:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}