{"url":"https://economictimes.indiatimes.com/tech/technology/bigbasket-b2c-unit-posts-6-growth-in-fy24-revenue-cuts-losses-by-17/articleshow/113089518.cms","title":"BigBasket B2C unit posts 6% growth in FY24 revenue, cuts losses by 17%","description":"Innovative Retail Concepts runs the business-to-cusotmer (B2C) unit of BigBasket. It posted net loss of Rs 1,267 crore for FY24 and an operating revenue of Rs 7,885 crore. Over the past two years, BigBasket has seen major rivalry from quick commerce players such as Zomato-owned Blinkit, Swiggy Instamart and Nexus Venture Partners-backed Zepto in the hyperfunded online grocery delivery space.","content":"Innovative Retail Concepts Pvt Ltd, which runs the business-to-consumer (B2C) unit of online grocery and quick commerce firm BigBasket, posted a modest 6% year-on-year growth in its operating revenue for FY24 to Rs 7,885 crore, though a check on expenses reduced its net loss.It posted a net loss of Rs 1,267 crore for FY24, down 17% year-on-year, according to the company’s regulatory filings sourced from Tofler.Over the past two years BigBasket, majority owned by Tata Digital, has seen intense competition from quick commerce players such as Zomato-owned Blinkit, Swiggy Instamart and Nexus Venture Partners-backed Zepto in the hyper funded online grocery delivery space.BigBasket, too, started quick commerce under the BB Now banner 2.5 years ago, and now clocks more than 50% of its sales from the 10-minute delivery vertical, ET had reported on August 27.The company, which is the largest e-grocer known for slotted deliveries, is planning to pivot fully to quick commerce.","cleaned_content":"innovative retail concepts pvt ltd which runs the business to consumer b2c unit of online grocery and quick commerce firm bigbasket posted a modest \u003cSIX_PERCENT\u003e year on year growth in its operating revenue for fy24 to rs \u003cSEVEN_THOUSAND\u003e crore though a check on expenses reduced its net loss it posted a net loss of rs \u003cONE_THOUSAND\u003e crore for fy24 down \u003cONE_TEN_PERCENT\u003e year on year according to the company s regulatory filings sourced from tofler over the past two years bigbasket majority owned by tata digital has seen intense competition from quick commerce players such as zomato owned blinkit swiggy instamart and nexus venture partners backed zepto in the hyper funded online grocery delivery space bigbasket too started quick commerce under the bb now banner \u003cTWO_\u003e years ago and now clocks more than \u003cFIVE_TEN_PERCENT\u003e of its sales from the \u003cONE_TEN\u003e minute delivery vertical et had reported on august \u003cTWO_TEN\u003e the company which is the largest e grocer known for slotted deliveries is planning to pivot fully to quick commerce","timestamp":"2024-09-05T15:02:00+05:30","market_timestamp":"2024-09-05T15:02:00+05:30","off_market_hours":false}