{"url":"https://economictimes.indiatimes.com/tech/technology/google-search-monopoly-us-case-remedies-to-come-by-december/articleshow/113150244.cms","title":"Google search monopoly US case remedies to come by December","description":"The U.S. Department of Justice will outline by December what Alphabet's Google must do to restore competition after a judge found it monopolized the online search market. The remedy could include divesting business units or ending payments to ensure its search engine is the default on devices and browsers.","content":"The U.S. Department of Justice plans to issue an outline by December on what Alphabet's Google must do to restore competition after a judge earlier found the company illegally monopolized the market for online search, prosecutors said at a court hearing in Washington on Friday. Prosecutors did not detail what remedy they will propose, but Justice Department attorney David Dahlquist said it should be comprehensive and take into account how Google plans to integrate artificial intelligence into search. Since the case was brought, Google has rebranded its Bard AI product to Gemini, Dahlquist said. \"What else are they thinking about? What else is beyond that?\" he said at the hearing. Prosecutors could seek to have Google divest certain business units, such as its Android mobile device operating system, or end billions of dollars in annual payments to smartphone makers and others to ensure that its search engine is the default on devices and browsers.","cleaned_content":"the u s department of justice plans to issue an outline by december on what alphabets google must do to restore competition after a judge earlier found the company illegally monopolized the market for online search prosecutors said at a court hearing in washington on friday prosecutors did not detail what remedy they will propose but justice department attorney david dahlquist said it should be comprehensive and take into account how google plans to integrate artificial intelligence into search since the case was brought google has rebranded its bard ai product to gemini dahlquist said what else are they thinking about what else is beyond that he said at the hearing prosecutors could seek to have google divest certain business units such as its android mobile device operating system or end billions of dollars in annual payments to smartphone makers and others to ensure that its search engine is the default on devices and browsers","timestamp":"2024-09-07T16:14:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}