{"url":"https://economictimes.indiatimes.com/tech/technology/irelands-data-regulator-ends-court-proceedings-against-x/articleshow/113066902.cms","title":"Ireland's data regulator ends court proceedings against X","description":"Ireland's Data Protection Commission, the lead EU regulator for most of the top U.S. internet firms due to the location of their EU operations in the country, in August sought an order to suspend or restrict X from processing the data of users for the purposes of developing, training or refining its AI systems.","content":"Ireland's data regulator on Wednesday said it had ended court proceedings against social media platform X after it agreed to limit its use of personal data collected from European Union users to train its AI on a permanent basis. Ireland's Data Protection Commission, the lead EU regulator for most of the top U.S. internet firms due to the location of their EU operations in the country, in August sought an order to suspend or restrict X from processing the data of users for the purposes of developing, training or refining its AI systems. A lawyer for the platform formerly known as Twitter said at the time that data collected from EU users between May 7 and Aug. 1 would not be used until proceedings on the Irish Data Protection Commission's (DPC) order were decided by the court. \"The proceedings have been struck-out on the basis of X's agreement to continue to adhere to the terms of the undertaking on a permanent basis,\" the DPC said in a statement. The DPC said it would seek an opinion from the European Data Protection Board on the extent to which personal data is processed at various stages of the training and operation of an AI model.","cleaned_content":"irelands data regulator on wednesday said it had ended court proceedings against social media platform x after it agreed to limit its use of personal data collected from european union users to train its ai on a permanent basis irelands data protection commission the lead eu regulator for most of the top u s internet firms due to the location of their eu operations in the country in august sought an order to suspend or restrict x from processing the data of users for the purposes of developing training or refining its ai systems a lawyer for the platform formerly known as twitter said at the time that data collected from eu users between may \u003cSEVEN_\u003e and aug \u003cONE_\u003e would not be used until proceedings on the irish data protection commissions dpc order were decided by the court the proceedings have been struck out on the basis of xs agreement to continue to adhere to the terms of the undertaking on a permanent basis the dpc said in a statement the dpc said it would seek an opinion from the european data protection board on the extent to which personal data is processed at various stages of the training and operation of an ai model","timestamp":"2024-09-04T18:32:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}