{"url":"https://economictimes.indiatimes.com/tech/technology/softbank-backed-ofbusiness-plans-up-to-1-billion-india-ipo-executive-says/articleshow/113025852.cms","title":"SoftBank-backed OfBusiness plans up to $1 billion India IPO, executive says","description":"The company is in active talks with Bank of America, Citi, JP Morgan and Morgan Stanley to manage the offer and plans to list on the Indian bourses in the second half of 2025, its Chief Financial Officer Bhavesh Keswani said. The initial public offering is expected to total between $750 million and $1 billion, with about $200 million in new shares and the rest shares offered by existing shareholders to new investors, Keswani said.","content":"SoftBank-backed OfBusiness, an Indian shopping website that offers raw materials to businesses, is planning an Indian stock market offering worth up to $1 billion and is close to appointing bankers, a top executive told Reuters on Tuesday. The company is in active talks with Bank of America, Citi, JP Morgan and Morgan Stanley to manage the offer and plans to list on the Indian bourses in the second half of 2025, its Chief Financial Officer Bhavesh Keswani said. The initial public offering is expected to total between $750 million and $1 billion, with about $200 million in new shares and the rest shares offered by existing shareholders to new investors, Keswani said. \"The IPO proceeds will be used for debt repayment and growing existing business,\" he said in the company's first public comments on the IPO planning. The four banks did not respond to Reuters requests for comment.","cleaned_content":"softbank backed ofbusiness an indian shopping website that offers raw materials to businesses is planning an indian stock market offering worth up to \u003cONE_\u003e billion and is close to appointing bankers a top executive told reuters on tuesday the company is in active talks with bank of america citi jp morgan and morgan stanley to manage the offer and plans to list on the indian bourses in the second half of \u003cTWO_THOUSAND\u003e its chief financial officer bhavesh keswani said the initial public offering is expected to total between \u003cSEVEN_HUNDRED\u003e million and \u003cONE_\u003e billion with about \u003cTWO_HUNDRED\u003e million in new shares and the rest shares offered by existing shareholders to new investors keswani said the ipo proceeds will be used for debt repayment and growing existing business he said in the companys first public comments on the ipo planning the four banks did not respond to reuters requests for comment","timestamp":"2024-09-03T17:17:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}