{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-tech-giant-huawei-posts-34-3-rise-in-first-half-sales/articleshow/112919335.cms","title":"Chinese tech giant Huawei posts 34.3% rise in first-half sales","description":"Huawei posted sales of $58.72 billion in January-June, an on-year increase of 34.3 percent. That compares with 3.1 percent growth in the same period last year. The Shenzhen-based company has for several years been at the centre of an intense technological rivalry between Beijing and Washington, with US officials warning its equipment could be used to spy on behalf of Chinese authorities -- allegations it denies.","content":"Chinese tech giant Huawei said Thursday that sales surged in the first half of the year, even as it struggles under the weight of sanctions that have deprived it of technology from the United States. The Shenzhen-based company has for several years been at the centre of an intense technological rivalry between Beijing and Washington, with US officials warning its equipment could be used to spy on behalf of Chinese authorities -- allegations it denies.Since 2019, the sanctions have cut Huawei off from global supply chains for technology and US-made components, hammering its production of smartphones at the time.On Thursday it posted sales of $58.72 billion in January-June, an on-year increase of 34.3 percent. That compares with 3.1 percent growth in the same period last year.It did not break down net profit. Huawei is a private company that is not publicly traded and is therefore not subject to the same obligations as other companies to publish detailed results.","cleaned_content":"chinese tech giant huawei said thursday that sales surged in the first half of the year even as it struggles under the weight of sanctions that have deprived it of technology from the united states the shenzhen based company has for several years been at the centre of an intense technological rivalry between beijing and washington with us officials warning its equipment could be used to spy on behalf of chinese authorities allegations it denies since \u003cTWO_THOUSAND\u003e the sanctions have cut huawei off from global supply chains for technology and us made components hammering its production of smartphones at the time on thursday it posted sales of \u003cFIVE_TEN\u003e billion in january june an on year increase of \u003cTHREE_TEN_PERCENT\u003e that compares with \u003cTHREE_PERCENT\u003e growth in the same period last year it did not break down net profit huawei is a private company that is not publicly traded and is therefore not subject to the same obligations as other companies to publish detailed results","timestamp":"2024-08-30T13:35:00+05:30","market_timestamp":"2024-08-30T13:35:00+05:30","off_market_hours":false}