{"url":"https://economictimes.indiatimes.com/tech/technology/dutch-government-retakes-export-control-over-two-asml-tools-from-us/articleshow/113127819.cms","title":"Dutch government retakes export control over two ASML tools from US","description":"ASML said in a statement that it did not expect the change in oversight to impact earnings this year or in the future. Shares of the Netherlands-based ASML, Europe's largest technology firm, traded down 1.6% at 708.40 euros at 0915 GMT. \"I'm making this decision for our safety,\" said Dutch Trade Minister Reinette Klever, announcing the update.","content":"The Dutch government on Friday said it would expand export licensing requirements for some ASML chipmaking equipment, effectively retaking oversight over it from the United States and aligning the two countries' policy. The United States had previously unilaterally regulated those tools, as part of its campaign to restrict access to advanced technology by Chinese chipmakers who could contribute to Beijing's technological and military advances. ASML said in a statement that it did not expect the change in oversight to impact earnings this year or in the future. Shares of the Netherlands-based ASML, Europe's largest technology firm, traded down 1.6% at 708.40 euros at 0915 GMT. \"I'm making this decision for our safety,\" said Dutch Trade Minister Reinette Klever, announcing the update.","cleaned_content":"the dutch government on friday said it would expand export licensing requirements for some asml chipmaking equipment effectively retaking oversight over it from the united states and aligning the two countries policy the united states had previously unilaterally regulated those tools as part of its campaign to restrict access to advanced technology by chinese chipmakers who could contribute to beijings technological and military advances asml said in a statement that it did not expect the change in oversight to impact earnings this year or in the future shares of the netherlands based asml europes largest technology firm traded down \u003cONE_PERCENT\u003e at \u003cSEVEN_HUNDRED\u003e euros at \u003cNINE_HUNDRED\u003e gmt im making this decision for our safety said dutch trade minister reinette klever announcing the update","timestamp":"2024-09-06T17:20:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}