{"url":"https://economictimes.indiatimes.com/tech/technology/intel-manufacturing-business-will-see-meaningful-revenue-in-2027-cfo-says/articleshow/113080915.cms","title":"Intel manufacturing business will see 'meaningful' revenue in 2027: CFO","description":"Intel expects to generate significant revenue from its contract chip manufacturing business by 2027. The company is in discussions with 12 potential customers, aiming for initial revenue in 2026. Intel is focusing on its advanced 18A manufacturing process and undergoing a turnaround plan, including staff cuts and business shedding.","content":"Intel will begin to generate a \"meaningful\" amount of revenue from its contract chip manufacturing business in 2027, the company's CFO said at an investor conference on Wednesday. Intel is currently in talks with 12 potential customers that finance chief David Zinsner said will generate some revenue in 2026 and additional cash in 2027. The company has decided not to market its 20A manufacturing process in favor of focusing on the more advanced 18A manufacturing process, the CFO said. The foundry business currently generates revenue from its advanced packaging business, Zinsner said. Zinsner did not directly address a Reuters report on Wednesday about Intel failing to produce viable test wafers for Broadcom, a potential manufacturing customer. The Santa Clara, California-based company is amid a turnaround plan that includes shedding a number of businesses and a 15% cut to its staff. CEO Pat Gelsinger and other key executives are expected to present plans to the company's board of directors at a mid-September meeting, Reuters reported on Sunday.","cleaned_content":"intel will begin to generate a meaningful amount of revenue from its contract chip manufacturing business in \u003cTWO_THOUSAND\u003e the companys cfo said at an investor conference on wednesday intel is currently in talks with \u003cONE_TEN\u003e potential customers that finance chief david zinsner said will generate some revenue in \u003cTWO_THOUSAND\u003e and additional cash in \u003cTWO_THOUSAND\u003e the company has decided not to market its \u003cTWO_TEN\u003e a manufacturing process in favor of focusing on the more advanced \u003cONE_TEN\u003e a manufacturing process the cfo said the foundry business currently generates revenue from its advanced packaging business zinsner said zinsner did not directly address a reuters report on wednesday about intel failing to produce viable test wafers for broadcom a potential manufacturing customer the santa clara california based company is amid a turnaround plan that includes shedding a number of businesses and a \u003cONE_TEN_PERCENT\u003e cut to its staff ceo pat gelsinger and other key executives are expected to present plans to the companys board of directors at a mid september meeting reuters reported on sunday","timestamp":"2024-09-05T10:06:00+05:30","market_timestamp":"2024-09-05T10:06:00+05:30","off_market_hours":false}