{"url":"https://economictimes.indiatimes.com/tech/technology/payment-apps-working-to-take-delegated-payments-feature-upi-circle-live/articleshow/112999262.cms","title":"Payment apps open pilots to cash in on NPCI’s new UPI Circle","description":"Unified Payments Interface (UPI), the popular retail digital payments railroad is betting big on UPI Circle, the new feature around delegated payments to push the number of active users on the platform. UPI Circle is being built to solve multiple use cases for digital payment needs for different members in a single family, perhaps with one bank account.","content":"Delegated payments on Unified Payments Interface (UPI) – where a user can allow his/her children or others to undertake transactions from his/her UPI-linked account – is the next big bet for all the major payment applications that are looking to attract new users.Amazon Pay, Google Pay and National Payments Corporation of India (NPCI)-run Bharat Interface for Money (Bhim) are testing the feature, UPI Circle, in a closed user group and are expected to go live in the coming months.PhonePe, the largest third-party application on UPI, is also testing the product, ET has learnt.NPCI officially launched UPI Circle last week at the Global Fintech Fest in Mumbai.UPI Circle is a delegated payment method where the primary user can give permission to a secondary user to undertake transactions. The primary user can either authenticate each transaction or set a limit of up to Rs 15,000 within which any transaction can go through without any explicit nod.","cleaned_content":"delegated payments on unified payments interface upi where a user can allow his her children or others to undertake transactions from his her upi linked account is the next big bet for all the major payment applications that are looking to attract new users amazon pay google pay and national payments corporation of india npci run bharat interface for money bhim are testing the feature upi circle in a closed user group and are expected to go live in the coming months phonepe the largest third party application on upi is also testing the product et has learnt npci officially launched upi circle last week at the global fintech fest in mumbai upi circle is a delegated payment method where the primary user can give permission to a secondary user to undertake transactions the primary user can either authenticate each transaction or set a limit of up to rs \u003cONE_TEN_THOUSAND\u003e within which any transaction can go through without any explicit nod","timestamp":"2024-09-03T06:01:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}