{"url":"https://economictimes.indiatimes.com/tech/technology/google-limits-on-access-to-android-auto-may-breach-eu-rules-court-adviser-says/articleshow/113090450.cms","title":"Google limits on access to Android Auto may breach EU rules, court adviser says","description":"\"Google's refusal to provide third-party access to Android Auto platform may be in breach of competition rules,\" Advocate General Laila Medina at the Luxembourg-based Court of Justice of the European Union (CJEU) said.","content":"An adviser to Europe's top court on Thursday sided with Italy's antitrust authority, saying Alphabet unit Google's refusal to allow an e-mobility app developed by Enel access to its Android Auto platform may breach competition rules. \"Google's refusal to provide third-party access to Android Auto platform may be in breach of competition rules,\" Advocate General Laila Medina at the Luxembourg-based Court of Justice of the European Union (CJEU) said. The Italian antitrust watchdog fined Google 102 million euro ($113.18 million) in 2021 for favouring Google Maps while blocking Enel's JuicePass on Android Auto, a software allowing drivers to navigate with maps on their car dashboards and send messages while behind the wheel. CJEU judges, who will rule in the coming months, usually follow the majority of such non-binding opinions. The case is C-233/23 Alphabet and Others.","cleaned_content":"an adviser to europes top court on thursday sided with italys antitrust authority saying alphabet unit googles refusal to allow an e mobility app developed by enel access to its android auto platform may breach competition rules googles refusal to provide third party access to android auto platform may be in breach of competition rules advocate general laila medina at the luxembourg based court of justice of the european union cjeu said the italian antitrust watchdog fined google \u003cONE_HUNDRED\u003e million euro \u003cONE_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e for favouring google maps while blocking enels juicepass on android auto a software allowing drivers to navigate with maps on their car dashboards and send messages while behind the wheel cjeu judges who will rule in the coming months usually follow the majority of such non binding opinions the case is c \u003cTWO_HUNDRED\u003e \u003cTWO_TEN\u003e alphabet and others","timestamp":"2024-09-05T14:27:00+05:30","market_timestamp":"2024-09-05T14:27:00+05:30","off_market_hours":false}