{"url":"https://economictimes.indiatimes.com/tech/technology/israeli-defence-companies-showcase-in-india-advanced-tech-to-counter-drone-threats/articleshow/113118837.cms","title":"Israeli defence companies showcase in India advanced tech to counter drone threats","description":"The seminar from September 2 to 4 featured participation from the representatives and senior officials from Israel's Ministry of Defense, economic and security attaches, and representatives from India's Ministry of Defence, and defence and civilian industries from both countries, the statement issued by the Israeli Embassy said.","content":"Seeking to enhance security cooperation between Israel and India in combating drone threat, an event was held here during which nine Israeli defence companies showcased advanced technologies to counter such threats, according to an official statement issued on Thursday. The seminar from September 2 to 4 featured participation from the representatives and senior officials from Israel's Ministry of Defense, economic and security attaches, and representatives from India's Ministry of Defence, and defence and civilian industries from both countries, the statement issued by the Israeli Embassy said.  The seminar focused on \"addressing the growing threat of drones\", both in security and criminal aspects, which poses a significant challenge to the security forces worldwide due to their ability to be used for intelligence gathering, weapon carrying and precise attacks, it added.  Throughout the seminar, nine Israeli defence companies showcased advanced technologies to counter the drone threat.  Operational experience was shared and advanced technological capabilities were showcased, aiming to deepen security cooperation between the two countries, the statement said. ","cleaned_content":"seeking to enhance security cooperation between israel and india in combating drone threat an event was held here during which nine israeli defence companies showcased advanced technologies to counter such threats according to an official statement issued on thursday the seminar from september \u003cTWO_\u003e to \u003cFOUR_\u003e featured participation from the representatives and senior officials from israels ministry of defense economic and security attaches and representatives from indias ministry of defence and defence and civilian industries from both countries the statement issued by the israeli embassy said the seminar focused on addressing the growing threat of drones both in security and criminal aspects which poses a significant challenge to the security forces worldwide due to their ability to be used for intelligence gathering weapon carrying and precise attacks it added throughout the seminar nine israeli defence companies showcased advanced technologies to counter the drone threat operational experience was shared and advanced technological capabilities were showcased aiming to deepen security cooperation between the two countries the statement said","timestamp":"2024-09-06T13:14:00+05:30","market_timestamp":"2024-09-06T13:14:00+05:30","off_market_hours":false}