{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-supreme-court-justices-to-vote-on-x-ban/articleshow/112978815.cms","title":"Brazil Supreme Court justices to vote on X ban","description":"Brazil's Supreme Court is set to vote on maintaining Justice Alexandre de Moraes' decision to shut down social media platform X. The platform was suspended after failing to appoint a legal representative in Brazil. Moraes has advocated for stricter regulations on hate speech.","content":"A five-member panel of Brazil's Supreme Court will vote on Monday whether to uphold Justice Alexandre de Moraes' ruling to shut down social media platform X in the country.Moraes, whom X owner Elon Musk has labeled a \"dictator,\" has called a virtual session of the court's first chamber - of which he is a member - so peers can review his decision.Brazil's Supreme Court has 11 justices split between two chambers of five members each, not including the chief justice. They can vote to maintain or reject decisions by a single judge.Justices Carmen Lucia, Luiz Fux, Cristiano Zanin and Flavio Dino sit on the first chamber alongside Moraes.X was taken down in Brazil, one of its largest markets, in the early hours of Saturday following a decision by Moraes, who has been locked in a months-long feud with Musk.","cleaned_content":"a five member panel of brazils supreme court will vote on monday whether to uphold justice alexandre de moraes ruling to shut down social media platform x in the country moraes whom x owner elon musk has labeled a dictator has called a virtual session of the courts first chamber of which he is a member so peers can review his decision brazils supreme court has \u003cONE_TEN\u003e justices split between two chambers of five members each not including the chief justice they can vote to maintain or reject decisions by a single judge justices carmen lucia luiz fux cristiano zanin and flavio dino sit on the first chamber alongside moraes x was taken down in brazil one of its largest markets in the early hours of saturday following a decision by moraes who has been locked in a months long feud with musk","timestamp":"2024-09-02T09:00:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}