{"url":"https://economictimes.indiatimes.com/tech/technology/uk-watchdog-accuses-google-of-anti-competitive-behaviour-in-digital-ads-business/articleshow/113141535.cms","title":"UK watchdog accuses Google of anti-competitive behaviour in digital ads business","description":"Britain's Competition and Markets Authority said that the US company gives preference to its own services to the detriment of online publishers and advertisers in Britain's 1.8 billion pound (USD 2.4 billion) digital ad market.","content":"Google was slammed on Friday by UK regulators who say it's taking advantage of its dominance in digital advertising to thwart competition in Britain, ratcheting up pressure that the tech giant is facing on both sides of the Atlantic over its \"ad tech\" business practices. Britain's Competition and Markets Authority said that the US company gives preference to its own services to the detriment of online publishers and advertisers in Britain's 1.8 billion pound (USD 2.4 billion) digital ad market.  Google is a major player throughout the digital ad ecosystem, providing servers for publishers to manage ad space on their websites and apps, tools for advertisers and media agencies to buy display ads, and an exchange where both sides come together to buy and sell ads in real time at auctions.  \"We've provisionally found that Google is using its market power to hinder competition when it comes to the ads people see on websites,\" the watchdog's interim executive director of enforcement, Juliette Enser, said in a press release.  The watchdog's charges, known as a statement of objections, come two years after it opened its investigation. The European Union's antitrust authorities have also been Google's ad bidding services while and it has also been the focus of a state-led antitrust lawsuit against Google that's set to go to trial this month.  The CMA said that Google's \"anti-competitive\" conduct is ongoing, but the company disputed the allegations on Friday. ","cleaned_content":"google was slammed on friday by uk regulators who say its taking advantage of its dominance in digital advertising to thwart competition in britain ratcheting up pressure that the tech giant is facing on both sides of the atlantic over its ad tech business practices britains competition and markets authority said that the us company gives preference to its own services to the detriment of online publishers and advertisers in britains \u003cONE_\u003e billion pound usd \u003cTWO_\u003e billion digital ad market google is a major player throughout the digital ad ecosystem providing servers for publishers to manage ad space on their websites and apps tools for advertisers and media agencies to buy display ads and an exchange where both sides come together to buy and sell ads in real time at auctions weve provisionally found that google is using its market power to hinder competition when it comes to the ads people see on websites the watchdogs interim executive director of enforcement juliette enser said in a press release the watchdogs charges known as a statement of objections come two years after it opened its investigation the european unions antitrust authorities have also been googles ad bidding services while and it has also been the focus of a state led antitrust lawsuit against google thats set to go to trial this month the cma said that googles anti competitive conduct is ongoing but the company disputed the allegations on friday","timestamp":"2024-09-07T10:23:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}