{"url":"https://economictimes.indiatimes.com/tech/technology/like-brazil-the-european-union-also-has-an-x-problem/articleshow/113084989.cms","title":"Like Brazil, the European Union also has an X problem","description":"Elon Musk's woes are hardly limited to Brazil as he now risks possible EU sanctions in the coming months for allegedly breaking new content rules. But since X has around 106 million EU users, significantly higher than the 22 million in Brazil, the belief is that Musk would not want to risk a similar move in Europe.","content":"Elon Musk's woes are hardly limited to Brazil as he now risks possible EU sanctions in the coming months for allegedly breaking new content rules.Access to X has been suspended in South America's largest country since Saturday after a long-running legal battle over disinformation ended with a judge ordering a shutdown.But Brazil is not alone in its concerns about X.Politicians worldwide and digital rights groups have repeatedly raised concerns about Musk's actions since taking over what was then Twitter in late 2022, including sacking many employees tasked with content moderation and maintaining ties with EU regulators.Musk's \"free speech absolutist\" attitude has led to clashes with Brussels.","cleaned_content":"elon musks woes are hardly limited to brazil as he now risks possible eu sanctions in the coming months for allegedly breaking new content rules access to x has been suspended in south americas largest country since saturday after a long running legal battle over disinformation ended with a judge ordering a shutdown but brazil is not alone in its concerns about x politicians worldwide and digital rights groups have repeatedly raised concerns about musks actions since taking over what was then twitter in late \u003cTWO_THOUSAND\u003e including sacking many employees tasked with content moderation and maintaining ties with eu regulators musks free speech absolutist attitude has led to clashes with brussels","timestamp":"2024-09-05T11:54:00+05:30","market_timestamp":"2024-09-05T11:54:00+05:30","off_market_hours":false}