{"url":"https://economictimes.indiatimes.com/tech/technology/crowdstrike-exec-to-testify-before-congress-on-it-outage/articleshow/112931880.cms","title":"Crowdstrike executive to testify before Congress on IT outage","description":"Adam Meyers, senior vice president for counter adversary operations at CrowdStrike, will testify before the House Homeland Security cybersecurity and infrastructure Protection subcommittee, the panel said Friday.","content":"A senior executive at cybersecurity firm CrowdStrike will testify before a U.S. House of Representatives subcommittee on Sept. 24 on the company's faulty software update that caused a global IT outage.Adam Meyers, senior vice president for counter adversary operations at CrowdStrike, will testify before the House Homeland Security Cybersecurity and Infrastructure Protection subcommittee, the panel said Friday.\"Considering the significant impact CrowdStrike’s faulty software update had on Americans and critical sectors of the economy -- from aviation to medical services -- we must restore confidence in the IT that underpins the services Americans depend on daily,” said Representative Mark Green, who chairs the Homeland Security committee.The committee had sent a letter in July to CrowdStrike CEO George Kurtz asking him to testify on last week's global tech outage. CrowdStrike did not immediately comment Friday.The July 19 incident led to worldwide flight cancellations and impacted industries around the globe including banks, health care, media companies and hotels chains. The outage disrupted internet services, affecting 8.5 million Microsoft Windows devices.","cleaned_content":"a senior executive at cybersecurity firm crowdstrike will testify before a u s house of representatives subcommittee on sept \u003cTWO_TEN\u003e on the companys faulty software update that caused a global it outage adam meyers senior vice president for counter adversary operations at crowdstrike will testify before the house homeland security cybersecurity and infrastructure protection subcommittee the panel said friday considering the significant impact crowdstrike s faulty software update had on americans and critical sectors of the economy from aviation to medical services we must restore confidence in the it that underpins the services americans depend on daily said representative mark green who chairs the homeland security committee the committee had sent a letter in july to crowdstrike ceo george kurtz asking him to testify on last weeks global tech outage crowdstrike did not immediately comment friday the july \u003cONE_TEN\u003e incident led to worldwide flight cancellations and impacted industries around the globe including banks health care media companies and hotels chains the outage disrupted internet services affecting \u003cEIGHT_\u003e million microsoft windows devices","timestamp":"2024-08-30T22:54:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}