{"url":"https://economictimes.indiatimes.com/tech/technology/exclusive-intel-ceo-to-pitch-board-on-plans-to-shed-assets-cut-costs-source-says/articleshow/112978784.cms","title":"Intel CEO Pat Gelsinger to pitch board on plans to shed assets, cut costs","description":"Intel's CEO Pat Gelsinger is set to present a plan to the board to cut costs and revamp capital spending. This includes selling businesses such as its programmable chip unit Altera. The plan aims to address Intel's financial struggles and revive its market position.","content":"Intel CEO Pat Gelsinger and key executives are expected to present a plan later this month to the company's board of directors to slice off unnecessary businesses and revamp capital spending, according to a source familiar with the matter, as they try to revive the once-dominant chipmaker's fortunes. The plan will include ideas on how to shave overall costs by selling businesses, including its programmable chip unit Altera, that Intel can no longer afford to fund from the company's once-sizeable profit.  Gelsinger and other high-ranking executives at Intel are expected to present the plan at a mid-September board meeting, the same source said. Details of Gelsinger's proposal is reported here for the first time. Intel declined to comment.","cleaned_content":"intel ceo pat gelsinger and key executives are expected to present a plan later this month to the companys board of directors to slice off unnecessary businesses and revamp capital spending according to a source familiar with the matter as they try to revive the once dominant chipmakers fortunes the plan will include ideas on how to shave overall costs by selling businesses including its programmable chip unit altera that intel can no longer afford to fund from the companys once sizeable profit gelsinger and other high ranking executives at intel are expected to present the plan at a mid september board meeting the same source said details of gelsingers proposal is reported here for the first time intel declined to comment","timestamp":"2024-09-02T19:31:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}