{"url":"https://economictimes.indiatimes.com/tech/technology/georgia-tech-to-end-china-partnerships-following-concerns-over-military-ties/articleshow/113169553.cms","title":"Georgia Tech to end China partnerships following concerns over military ties","description":"Georgia Tech, a top tier U.S. engineering school and major recipient of Defense Department funding, said in an accompanying statement it would discontinue its participation in the Shenzhen institute, but that the approximately 300 students currently in programs there would have the opportunity to fulfill their degree requirements.","content":"Georgia Tech is ending its research and educational partnerships in the Chinese cities of Tianjin and Shenzhen, the U.S. university said on Friday, following scrutiny from Congress over its collaboration with entities allegedly linked to China's military.  In May, the House of Representatives' select committee on China wrote a letter to Georgia Tech asking for details on its research with China's northeastern Tianjin University on cutting-edge semiconductor technologies.  The Chinese school and its affiliates were added in 2020 to the U.S. Commerce Department's export restrictions list for actions contrary to U.S. national security, including trade secret theft and research collaboration to advance China's military.  Spokesperson Abbigail Tumpey told Reuters in an email that Georgia Tech has been assessing its posture in China since Tianjin University was added to the entity list.  \"Tianjin University has had ample time to correct the situation. To date, Tianjin University remains on the Entity List, making Georgia Tech's participation with Tianjin University, and subsequently Georgia Tech Shenzhen Institute (GTSI), no longer tenable,\" Tumpey said. ","cleaned_content":"georgia tech is ending its research and educational partnerships in the chinese cities of tianjin and shenzhen the u s university said on friday following scrutiny from congress over its collaboration with entities allegedly linked to chinas military in may the house of representatives select committee on china wrote a letter to georgia tech asking for details on its research with chinas northeastern tianjin university on cutting edge semiconductor technologies the chinese school and its affiliates were added in \u003cTWO_THOUSAND\u003e to the u s commerce departments export restrictions list for actions contrary to u s national security including trade secret theft and research collaboration to advance chinas military spokesperson abbigail tumpey told reuters in an email that georgia tech has been assessing its posture in china since tianjin university was added to the entity list tianjin university has had ample time to correct the situation to date tianjin university remains on the entity list making georgia techs participation with tianjin university and subsequently georgia tech shenzhen institute gtsi no longer tenable tumpey said","timestamp":"2024-09-08T18:26:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}