{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-chief-pavel-durov-blasts-surprising-and-misguided-french-charges/articleshow/113117459.cms","title":"Telegram chief Pavel Durov blasts 'surprising' and 'misguided' French charges","description":"Telegram founder and chief executive Pavel Durov on Thursday hit out at France for arresting and charging him last month over the publication of extremist and illegal content on the popular messaging app. Durov, 39, was charged after four days under arrest in France on several counts of failing to curb extremist and illegal content on Telegram.","content":"Paris, Sep 06, 2024 -Telegram founder and chief executive Pavel Durov on Thursday hit out at France for arresting and charging him last month over the publication of extremist and illegal content on the popular messaging app.In a lengthy post on Telegram, his first comment since his arrest, Durov said it was \"surprising\" he was being held responsible for other people's content.\"Using laws from the pre-smartphone era to charge a CEO with crimes committed by third parties on the platform he manages is a misguided approach,\" he said.He also lashed out at claims that \"Telegram is some sort of anarchic paradise\" as \"absolutely untrue\", insisting: \"We take down millions of harmful posts and channels every day.\"He denied accusations from France that Paris had not received responses from Telegram to its requests, saying he had personally helped French authorities \"establish a hotline with Telegram to deal with the threat of terrorism in France\".","cleaned_content":"paris sep \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e telegram founder and chief executive pavel durov on thursday hit out at france for arresting and charging him last month over the publication of extremist and illegal content on the popular messaging app in a lengthy post on telegram his first comment since his arrest durov said it was surprising he was being held responsible for other peoples content using laws from the pre smartphone era to charge a ceo with crimes committed by third parties on the platform he manages is a misguided approach he said he also lashed out at claims that telegram is some sort of anarchic paradise as absolutely untrue insisting we take down millions of harmful posts and channels every day he denied accusations from france that paris had not received responses from telegram to its requests saying he had personally helped french authorities establish a hotline with telegram to deal with the threat of terrorism in france","timestamp":"2024-09-06T12:27:00+05:30","market_timestamp":"2024-09-06T12:27:00+05:30","off_market_hours":false}