{"url":"https://economictimes.indiatimes.com/tech/technology/benefits-for-gig-workers-may-trickle-in-before-social-security-code-launch/articleshow/113183639.cms","title":"Benefits for gig workers may trickle in before social security code launch","description":"The government is considering advancing social security benefits for gig workers before the full implementation of the Social Security Code. The labour ministry has engaged with platform operators and plans to expedite enrolment on the e-Shram portal. States like Karnataka, Telangana, and Rajasthan are already working on policies to support gig workers.","content":"The government may advance the launch of certain social security benefits for gig or platform workers even before the formal implementation of a comprehensive Social Security Code. This move comes on the back of some states bringing in such provisions in their local laws.The labour and employment ministry has already sounded out the aggregators that operate platforms, or digital marketplaces, for gig work, and asked them to prepare for extending social security benefits to workers providing such temporary or freelance services, a senior government official told ET.\"We are ready for the roll out (of the social security cover). Various options are being considered and a final decision could be taken soon,\" the official said.The labour ministry will soon write to states asking them to expedite enrolment of platform workers on the e-Shram portal so that a comprehensive database is in place for a smooth nation-wide roll-out of the scheme, the official said.States including Karnataka, Telangana and Rajasthan have either announced a policy on gig workers or are preparing to come up with one, to extend health insurance and other related benefits to the local gig workers.","cleaned_content":"the government may advance the launch of certain social security benefits for gig or platform workers even before the formal implementation of a comprehensive social security code this move comes on the back of some states bringing in such provisions in their local laws the labour and employment ministry has already sounded out the aggregators that operate platforms or digital marketplaces for gig work and asked them to prepare for extending social security benefits to workers providing such temporary or freelance services a senior government official told et we are ready for the roll out of the social security cover various options are being considered and a final decision could be taken soon the official said the labour ministry will soon write to states asking them to expedite enrolment of platform workers on the e shram portal so that a comprehensive database is in place for a smooth nation wide roll out of the scheme the official said states including karnataka telangana and rajasthan have either announced a policy on gig workers or are preparing to come up with one to extend health insurance and other related benefits to the local gig workers","timestamp":"2024-09-08T23:52:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}