{"url":"https://economictimes.indiatimes.com/tech/technology/google-to-explore-manufacturing-of-pixel-8-phones-skill-development-in-tamil-nadu/articleshow/112955182.cms","title":"Google to explore manufacturing of Pixel 8 phones, skill development in Tamil Nadu","description":"According to the company statement, Google and the Government of Tamil Nadu would also explore collaborations on manufacturing of Pixel 8 phones. \"The Made in India Pixel 8 devices manufacturing is underway, happening in Tamil Nadu through local partnerships,\" the statement said.","content":"Internet giant Google would explore collaborations with the Government of Tamil Nadu, on manufacturing of its Pixel 8 range of phones, skill development, building an industrial ecosystem enabling MSMEs to create scalable AI solutions. Google, earlier in the day signed a memorandum of understanding with the visiting Chief Minister of Tamil Nadu M K Stalin at its Mountain View office in California in the presence of senior company officials including Google Cloud Vice-President and Head of Platform Amit Zavery, Minister for Industries TRB Rajaa among others. Under the MoU, Google would work with Guidance (the state government backed nodal agency to promote investments) to support the development of a robust AI ecosystem in the state. This includes providing access to advanced technologies and resources, with an emphasis on empowering individuals, businesses and government entities to leverage AI for inclusive growth and progress, a company statement said on Saturday. According to the company statement, Google and the Government of Tamil Nadu would also explore collaborations on manufacturing of Pixel 8 phones. \"The Made in India Pixel 8 devices manufacturing is underway, happening in Tamil Nadu through local partnerships,\" the statement said. ","cleaned_content":"internet giant google would explore collaborations with the government of tamil nadu on manufacturing of its pixel \u003cEIGHT_\u003e range of phones skill development building an industrial ecosystem enabling msmes to create scalable ai solutions google earlier in the day signed a memorandum of understanding with the visiting chief minister of tamil nadu m k stalin at its mountain view office in california in the presence of senior company officials including google cloud vice president and head of platform amit zavery minister for industries trb rajaa among others under the mou google would work with guidance the state government backed nodal agency to promote investments to support the development of a robust ai ecosystem in the state this includes providing access to advanced technologies and resources with an emphasis on empowering individuals businesses and government entities to leverage ai for inclusive growth and progress a company statement said on saturday according to the company statement google and the government of tamil nadu would also explore collaborations on manufacturing of pixel \u003cEIGHT_\u003e phones the made in india pixel \u003cEIGHT_\u003e devices manufacturing is underway happening in tamil nadu through local partnerships the statement said","timestamp":"2024-08-31T22:21:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}