{"url":"https://economictimes.indiatimes.com/tech/technology/payglocal-gets-rbi-nod-to-operate-as-online-merchant-payments-company/articleshow/113103235.cms","title":"PayGlocal gets RBI nod to operate as online merchant payments company","description":"PayGlocal is an international payments-focused startup and has also applied for a cross-border payments licence. That application is still being processed by the central bank. The company expects to receive this licence in due course from the Reserve Bank of India (RBI).","content":"Tiger Global-backed payments startup PayGlocal has received the online payment aggregator licence from the Reserve Bank of India (RBI).PayGlocal joins the likes of Razorpay, Cashfree, and CCAvenue to get the licence which will allow it to provide payment services for ecommerce merchants.PayGlocal is an international payments-focused startup and has also applied for a cross-border payments licence. That application is still being processed by the central bank. The company expects to receive this licence in due course from the RBI.Founded in 2021, the Bengaluru-based startup has raised $17 million to date from major investors like Peak XV, Tiger Global Management and QED Innovation.The RBI is currently in the process of regulating the online merchant payments sector. It has licenced 37 entities as of now, which includes the likes of Zoho, Worldline, Juspay Technologies, and such.","cleaned_content":"tiger global backed payments startup payglocal has received the online payment aggregator licence from the reserve bank of india rbi payglocal joins the likes of razorpay cashfree and ccavenue to get the licence which will allow it to provide payment services for ecommerce merchants payglocal is an international payments focused startup and has also applied for a cross border payments licence that application is still being processed by the central bank the company expects to receive this licence in due course from the rbi founded in \u003cTWO_THOUSAND\u003e the bengaluru based startup has raised \u003cONE_TEN\u003e million to date from major investors like peak xv tiger global management and qed innovation the rbi is currently in the process of regulating the online merchant payments sector it has licenced \u003cTHREE_TEN\u003e entities as of now which includes the likes of zoho worldline juspay technologies and such","timestamp":"2024-09-05T22:53:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}