{"url":"https://economictimes.indiatimes.com/tech/technology/india-needs-10-more-chip-fabs-in-next-10-years-says-semis-ajit-manocha/articleshow/113062728.cms","title":"India needs 10 more chip fabs in next 10 years, says SEMI's Ajit Manocha","description":"With the Rs 76,000 crore government corpus of the government to set up a semiconductor ecosystem from scratch almost exhausted, the next phase will have to focus on bringing the complete ecosystem of companies into the semiconductor space, Manocha said.","content":"India needs at least 10 more semiconductor chip fabrication companies to set up shop in India in the next decade, said Ajit Manocha, president of the global semiconductor industry body SEMI.“If we want to make India a powerhouse for the industry, there is no ceiling on the number. The challenge is to show the companies the potential for growth, business and opportunities in India,” he said at the curtain raiser for Semicon 2024.The presence of more outsourced assembly and testing units or assembly, testing, marking and packaging companies in India’s semiconductor ecosystem should be seen as a positive movement rather than something limiting for the country, he said.“If OSAT (outsourced semiconductor assembly and test) companies have a positive experience, that will also be a catalyst for other front-end companies which set up more capital-extensive projects. They go hand-in-hand. Whatever is coming to India, embrace them,” Manocha said.With the Rs 76,000 crore government corpus to set up a semiconductor ecosystem from scratch almost exhausted, the next phase will have to focus on bringing the complete ecosystem of companies into the semiconductor ecosystem, he said.","cleaned_content":"india needs at least \u003cONE_TEN\u003e more semiconductor chip fabrication companies to set up shop in india in the next decade said ajit manocha president of the global semiconductor industry body semi if we want to make india a powerhouse for the industry there is no ceiling on the number the challenge is to show the companies the potential for growth business and opportunities in india he said at the curtain raiser for semicon \u003cTWO_THOUSAND\u003e the presence of more outsourced assembly and testing units or assembly testing marking and packaging companies in india s semiconductor ecosystem should be seen as a positive movement rather than something limiting for the country he said if osat outsourced semiconductor assembly and test companies have a positive experience that will also be a catalyst for other front end companies which set up more capital extensive projects they go hand in hand whatever is coming to india embrace them manocha said with the rs \u003cSEVEN_TEN_THOUSAND\u003e crore government corpus to set up a semiconductor ecosystem from scratch almost exhausted the next phase will have to focus on bringing the complete ecosystem of companies into the semiconductor ecosystem he said","timestamp":"2024-09-04T18:21:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}