{"url":"https://economictimes.indiatimes.com/tech/technology/et-world-leaders-forum-upi-market-share-cap-not-a-problem-there-is-scope-for-everyone-google-pay-vp/articleshow/112944513.cms","title":"ET World Leaders Forum | UPI market large enough; there is scope for multiple players: Google Pay VP","description":"Ambarish Kenghe of Google Pay believes the UPI market has room for multiple players despite concerns over market share. Though the cap might hinder IPO plans for companies like PhonePe, the market remains competitive with PhonePe and Google Pay accounting for over 85% of July's UPI transactions.","content":"As players in the Unified Payments Interface (UPI) ecosystem await clarity on the long-standing issue of a ceiling on market share, Google vice president Ambarish Kenghe said he does not anticipate any challenges since there is scope for everyone in the segment.“The regulators and government are balancing a lot of things, some of which we are not privy to… I don’t see a challenge with this issue of market share because there are a large number of players operating and there is scope for everyone,” he said. Kenghe, who helms Google Pay in India and Asia Pacific region, was in conversation with ET's Samidha Sharma at the ET World Leaders Forum on Saturday.Google Pay is the second largest UPI app, according to transaction volume, only behind Walmart-backed PhonePe. The two players together command about 85% of market share, in terms of UPI volume, and stand to be affected the most if a cap is imposed on market share.The National Payments Corporation of India (NPCI), which manages the UPI railroad, had in 2021 proposed a 30% market share cap on UPI transaction volume to avoid market dominance and duopoly. However, it has yet to implement the cap.On August 28, Sameer Nigam, chief executive officer of PhonePe, said at the Global Fintech Festival that the market share cap directive is acting like an overhang, hindering the company’s initial public offering (IPO) plan.","cleaned_content":"as players in the unified payments interface upi ecosystem await clarity on the long standing issue of a ceiling on market share google vice president ambarish kenghe said he does not anticipate any challenges since there is scope for everyone in the segment the regulators and government are balancing a lot of things some of which we are not privy to i don t see a challenge with this issue of market share because there are a large number of players operating and there is scope for everyone he said kenghe who helms google pay in india and asia pacific region was in conversation with ets samidha sharma at the et world leaders forum on saturday google pay is the second largest upi app according to transaction volume only behind walmart backed phonepe the two players together command about \u003cEIGHT_TEN_PERCENT\u003e of market share in terms of upi volume and stand to be affected the most if a cap is imposed on market share the national payments corporation of india npci which manages the upi railroad had in \u003cTWO_THOUSAND\u003e proposed a \u003cTHREE_TEN_PERCENT\u003e market share cap on upi transaction volume to avoid market dominance and duopoly however it has yet to implement the cap on august \u003cTWO_TEN\u003e sameer nigam chief executive officer of phonepe said at the global fintech festival that the market share cap directive is acting like an overhang hindering the company s initial public offering ipo plan","timestamp":"2024-09-01T22:08:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}