{"url":"https://economictimes.indiatimes.com/tech/technology/russia-says-telegram-boss-durov-is-a-victim-of-his-own-independence/articleshow/112989708.cms","title":"Russia says Telegram boss Durov is a victim of his own independence","description":"A French judge put Russian-born Durov under formal investigation last week for suspected complicity in running an online platform that allows illicit transactions, child sex abuse images, drug trafficking and fraud.","content":"Pavel Durov, the Telegram boss arrested in France, was \"too free\" in his approach to running the social media platform, and this was his undoing, Russian Foreign Minister Sergei Lavrov said on Monday. A French judge put Russian-born Durov under formal investigation last week for suspected complicity in running an online platform that allows illicit transactions, child sex abuse images, drug trafficking and fraud. His lawyer has said it is \"absurd\" to suggest he should be held responsible for any crimes committed on the app, which has nearly 1 billion users and is widely popular in Russia, Ukraine and other former Soviet countries. Lavrov, in a speech to students at Moscow's elite MGIMO university run by the foreign ministry, echoed the Kremlin's position that the probe into Durov is part of a larger political ploy by the West to exert power over Russia. \"Pavel Durov was too free,\" Lavrov said. \"He didn't listen to Western advice on moderating his brainchild.\"","cleaned_content":"pavel durov the telegram boss arrested in france was too free in his approach to running the social media platform and this was his undoing russian foreign minister sergei lavrov said on monday a french judge put russian born durov under formal investigation last week for suspected complicity in running an online platform that allows illicit transactions child sex abuse images drug trafficking and fraud his lawyer has said it is absurd to suggest he should be held responsible for any crimes committed on the app which has nearly \u003cONE_\u003e billion users and is widely popular in russia ukraine and other former soviet countries lavrov in a speech to students at moscows elite mgimo university run by the foreign ministry echoed the kremlins position that the probe into durov is part of a larger political ploy by the west to exert power over russia pavel durov was too free lavrov said he didnt listen to western advice on moderating his brainchild","timestamp":"2024-09-02T14:24:00+05:30","market_timestamp":"2024-09-02T14:24:00+05:30","off_market_hours":false}