{"url":"https://economictimes.indiatimes.com/tech/technology/swiggy-takes-instamart-to-42-cities-ahead-of-festive-season/articleshow/113226551.cms","title":"Swiggy takes Instamart to 43 cities ahead of festive season","description":"IPO-bound Swiggy's quick commerce unit Instamart is now present in 43 cities across India. This is up from 27 cities at the end of March. These include Thrissur, Mangalore, Kanpur, Udaipur, Bhopal and Warangal. Instamart is also enhancing its offerings by partnering with local brands and vendors, ensuring customers have access to products that reflect regional preferences.","content":"Public markets-bound Swiggy’s quick commerce business, Instamart, has expanded its reach to 43 cities, up from 27 at the end of March, to meet growing consumer demand during the festive season.Over the past two months, the platform has launched operations in 10 new cities, including Thrissur, Mangalore, Kanpur, Udaipur, Warangal, Salem, Amritsar, Bhopal, Varanasi and Ludhiana.While the densification of Swiggy Instamart’s store network in key metros and larger cities remains the dominant axis of expansion, these new markets are the flag-bearers of tomorrow’s growth, Instamart said in a statement on Tuesday.In addition to its expanding reach through new stores, Instamart is also enhancing its offerings by partnering with local brands and vendors, ensuring customers have access to products that reflect regional preferences.“The enthusiastic demand from smaller towns and cities has been incredibly encouraging. Our expansion into these new locations marks a significant milestone, allowing even more people to experience the ease of having thousands of products—from everyday essentials to electronics and toys—delivered in just 10 minutes from both national and local brands,” said Amitesh Jha, chief executive officer of Swiggy Instamart.","cleaned_content":"public markets bound swiggy s quick commerce business instamart has expanded its reach to \u003cFOUR_TEN\u003e cities up from \u003cTWO_TEN\u003e at the end of march to meet growing consumer demand during the festive season over the past two months the platform has launched operations in \u003cONE_TEN\u003e new cities including thrissur mangalore kanpur udaipur warangal salem amritsar bhopal varanasi and ludhiana while the densification of swiggy instamart s store network in key metros and larger cities remains the dominant axis of expansion these new markets are the flag bearers of tomorrow s growth instamart said in a statement on tuesday in addition to its expanding reach through new stores instamart is also enhancing its offerings by partnering with local brands and vendors ensuring customers have access to products that reflect regional preferences the enthusiastic demand from smaller towns and cities has been incredibly encouraging our expansion into these new locations marks a significant milestone allowing even more people to experience the ease of having thousands of products from everyday essentials to electronics and toys delivered in just \u003cONE_TEN\u003e minutes from both national and local brands said amitesh jha chief executive officer of swiggy instamart","timestamp":"2024-09-10T19:34:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}