{"url":"https://economictimes.indiatimes.com/tech/technology/intels-dow-status-under-threat-as-struggling-chipmakers-shares-plunge/articleshow/113023420.cms","title":"Intel's Dow status under threat as struggling chipmaker's shares plunge","description":"Analysts and investors said Intel was likely to be removed from the Dow, pointing to a near 60% decline in the company's shares this year that has made it the worst performer on the index and left it with the lowest stock price on the price-weighted Dow.","content":"Intel was one of the first two tech companies to join the Dow Jones Industrial Average during 1999's dot-com era, along with Microsoft. Now, a slump in its share price could cost the American chipmaker its place in the blue-chip index. Analysts and investors said Intel was likely to be removed from the Dow, pointing to a near 60% decline in the company's shares this year that has made it the worst performer on the index and left it with the lowest stock price on the price-weighted Dow. A removal will hurt Intel's already bruised reputation. The company has missed out on the artificial intelligence boom after passing on an OpenAI investment and losses are mounting at the contract manufacturing unit that the chipmaker has been building out in hopes of challenging TSMC. To fund a turnaround, Intel suspended dividend and announced layoffs affecting 15% of its workforce during its earnings report last month. But some analysts and a former board member believe the moves might be too little, too late for the chipmaker. \"Intel being removed was likely a long time coming,\" said Ryan Detrick, chief market strategist at the Carson Group.","cleaned_content":"intel was one of the first two tech companies to join the dow jones industrial average during \u003cONE_THOUSAND\u003e s dot com era along with microsoft now a slump in its share price could cost the american chipmaker its place in the blue chip index analysts and investors said intel was likely to be removed from the dow pointing to a near \u003cSIX_TEN_PERCENT\u003e decline in the companys shares this year that has made it the worst performer on the index and left it with the lowest stock price on the price weighted dow a removal will hurt intels already bruised reputation the company has missed out on the artificial intelligence boom after passing on an openai investment and losses are mounting at the contract manufacturing unit that the chipmaker has been building out in hopes of challenging tsmc to fund a turnaround intel suspended dividend and announced layoffs affecting \u003cONE_TEN_PERCENT\u003e of its workforce during its earnings report last month but some analysts and a former board member believe the moves might be too little too late for the chipmaker intel being removed was likely a long time coming said ryan detrick chief market strategist at the carson group","timestamp":"2024-09-03T16:15:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}