{"url":"https://economictimes.indiatimes.com/tech/technology/global-data-centre-industry-to-emit-2-5-billion-tons-of-co2-through-2030-morgan-stanley/articleshow/113048569.cms","title":"Global data centre industry to emit 2.5 billion tons of CO2 through 2030: Morgan Stanley","description":"A surge in data centers is projected to generate around 2.5 billion metric tons of carbon dioxide-equivalent emissions globally by the end of the decade, prompting increased investments in decarbonization efforts. Major tech companies like Google, Microsoft, Meta, and Amazon are driving this growth while committing to reduce emissions from their centers by 2030.","content":"A boom in data centers is expected to produce about 2.5 billion metric tons of carbon dioxide-equivalent emissions globally through the end of the decade, and accelerate investments in decarbonization efforts, according to Morgan Stanley research. Hyperscalers, which include Google , Microsoft , Meta and Amazon , are driving the swift proliferation of electricity-guzzling data centers to expand their artificial intelligence and cloud computing technologies. At the same time, the companies are holding onto pledges to slash global warming emissions from their centers by 2030. \"This creates a large market for decarbonization solutions,\" according to Morgan Stanley's research report on Monday, which said the greenhouse gas emissions by the global data center industry will amount to about 40% of what the entire U.S. emits in a year. The build-out of the giant computer warehouses will increase investments in clean power development; energy efficient equipment and so-called green building materials, Morgan Stanley said. Carbon capture, utilization, and sequestration (CCUS) technology and carbon dioxide removal (CDR) processes are also expected to get a boost as tech companies try to keep their climate promises, the report said.","cleaned_content":"a boom in data centers is expected to produce about \u003cTWO_\u003e billion metric tons of carbon dioxide equivalent emissions globally through the end of the decade and accelerate investments in decarbonization efforts according to morgan stanley research hyperscalers which include google microsoft meta and amazon are driving the swift proliferation of electricity guzzling data centers to expand their artificial intelligence and cloud computing technologies at the same time the companies are holding onto pledges to slash global warming emissions from their centers by \u003cTWO_THOUSAND\u003e this creates a large market for decarbonization solutions according to morgan stanleys research report on monday which said the greenhouse gas emissions by the global data center industry will amount to about \u003cFOUR_TEN_PERCENT\u003e of what the entire u s emits in a year the build out of the giant computer warehouses will increase investments in clean power development energy efficient equipment and so called green building materials morgan stanley said carbon capture utilization and sequestration ccus technology and carbon dioxide removal cdr processes are also expected to get a boost as tech companies try to keep their climate promises the report said","timestamp":"2024-09-04T09:23:00+05:30","market_timestamp":"2024-09-04T09:23:00+05:30","off_market_hours":false}