{"url":"https://economictimes.indiatimes.com/tech/technology/govt-seeks-to-raise-incentives-for-companies-exceeding-production-and-sales-targets/articleshow/113069127.cms","title":"Govt eyes extra sops for mobile makers topping PLI targets","description":"Some companies under the government's production-linked incentive (PLI) scheme have consistently met and sometimes exceeded production and sales targets, a senior government figure told ET. They are now seeking additional incentives by way of a \"good faith\" measure.","content":"The government is weighing ways to raise incentives for companies that have exceeded production, sales, and export targets of mobile phones every financial year under the mobile phone production-linked incentive (PLI) scheme, sources told ET.A senior government official told ET that some companies have consistently met their production, sales and export targets under the PLI scheme and have sought additional incentives due to them as soon as possible as a “good faith” measure.“The decision on disbursement on production above the ceiling limit is pending at the empowered committee level. We are looking at how to approach this issue best and hope to arrive at a solution soon,” an official said.The PLI scheme for large-scale electronics manufacturing notified on April 1, 2020 provides an incentive of 4%-6% on incremental sales over the base year.Though the scheme was supposed to run only till 2024-25, it was extended by a year to accommodate requests from companies that fell short of their production targets due to various COVID-19-induced lockdowns.","cleaned_content":"the government is weighing ways to raise incentives for companies that have exceeded production sales and export targets of mobile phones every financial year under the mobile phone production linked incentive pli scheme sources told et a senior government official told et that some companies have consistently met their production sales and export targets under the pli scheme and have sought additional incentives due to them as soon as possible as a good faith measure the decision on disbursement on production above the ceiling limit is pending at the empowered committee level we are looking at how to approach this issue best and hope to arrive at a solution soon an official said the pli scheme for large scale electronics manufacturing notified on april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e provides an incentive of \u003cFOUR_PERCENT\u003e \u003cSIX_PERCENT\u003e on incremental sales over the base year though the scheme was supposed to run only till \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e it was extended by a year to accommodate requests from companies that fell short of their production targets due to various covid \u003cONE_TEN\u003e induced lockdowns","timestamp":"2024-09-05T06:00:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}