{"url":"https://economictimes.indiatimes.com/tech/information-tech/students-seek-clarity-as-infosys-offers-two-pre-training-rounds/articleshow/112932945.cms","title":"Students seek clarity as Infosys offers two pre-training rounds","description":"Infosys' recruitment challenges reflect a wider talent acquisition crunch in the tech industry, driven by economic uncertainty and automation. Indian IT companies face mounting pressure from students, public backlash, and worker unions to address delayed onboarding processes.","content":"Infosys has asked about 1,500 students from the April 2022 batch having offer letters to appear for two rounds of pre-training. Of the total, India’s second-largest software services company has given September 2 as the joining date to only about 115 students, while the rest remain in a state of flux about their job prospects.Hiring worries at Infosys underscore a broader squeeze in recruitment in the technology sector due to factors such as economic uncertainties and increasing automation. Indian IT firms are under pressure from students, public outcry and worker unions over the onboarding delays.In July, Infosys had called all the selected students for a mandatory virtual pre-training programme for 24 days. Following this, another self-learning module-based pre-training was organised for some students in August which resulted in joining dates allotted to the 115 students. For the remaining students, there is limited clarity on the assessment and confusion of login credentials to some students for the second pre-training round. There have been no rejection letters yet, multiple people including the students told ET.Earlier this month, students received an email from Infosys’ recruitment team for a second six-week virtual pre-training starting August 19, which included a self-learning module, followed by an in-person assessment across cities. Further, those who clear the competency tests would be invited to join an in-person immersive training programme.“Failure in the competency assessment will lead to deferment of your joining dates,” the email said. “Further, those not responsive to the email or not making it to the pre-training would be considered to have opted out of the decision to continue the engagement with Infosys,” it added.","cleaned_content":"infosys has asked about \u003cONE_THOUSAND\u003e students from the april \u003cTWO_THOUSAND\u003e batch having offer letters to appear for two rounds of pre training of the total india s second largest software services company has given september \u003cTWO_\u003e as the joining date to only about \u003cONE_HUNDRED\u003e students while the rest remain in a state of flux about their job prospects hiring worries at infosys underscore a broader squeeze in recruitment in the technology sector due to factors such as economic uncertainties and increasing automation indian it firms are under pressure from students public outcry and worker unions over the onboarding delays in july infosys had called all the selected students for a mandatory virtual pre training programme for \u003cTWO_TEN\u003e days following this another self learning module based pre training was organised for some students in august which resulted in joining dates allotted to the \u003cONE_HUNDRED\u003e students for the remaining students there is limited clarity on the assessment and confusion of login credentials to some students for the second pre training round there have been no rejection letters yet multiple people including the students told et earlier this month students received an email from infosys recruitment team for a second six week virtual pre training starting august \u003cONE_TEN\u003e which included a self learning module followed by an in person assessment across cities further those who clear the competency tests would be invited to join an in person immersive training programme failure in the competency assessment will lead to deferment of your joining dates the email said further those not responsive to the email or not making it to the pre training would be considered to have opted out of the decision to continue the engagement with infosys it added","timestamp":"2024-08-31T06:00:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}