{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-shares-rally-8-as-jpmorgan-hikes-target-price-to-rs-340/articleshow/113083497.cms","title":"Zomato shares rally 8% as JPMorgan hikes target price to Rs 340","description":"Zomato Share Price: Shares of Zomato surged 7.6% on the BSE today, hitting an intraday high of Rs 261.50, following JPMorgan's target price increase to Rs 340 from Rs 208, while maintaining an overweight rating. JPMorgan highlighted Zomato’s leadership in retail consumer transformation through Quick Commerce and its expansion across metros after validating the model in NCR.","content":"Shares of Zomato rallied 7.6% on the BSE today, reaching an intraday high of Rs 261.50, after JPMorgan raised the stock’s target price to Rs 340 from Rs 208, while maintaining an overweight rating.JPMorgan stated that Zomato is leading rapid retail consumer transformation through convenience-focused Quick Commerce. The company is expanding its presence across all metros after successfully proving the model in NCR.This scale should help Zomato drive monetization through channel margins and ad spending. The global brokerage firm expects it to lead the disruption of modern trade and e-commerce.The global brokerage has raised its forecasts for FY25-27 by 15-41%. Additionally, Zomato has expanded its \"Going Out\" business by integrating core dining with a new ticketing service.Recently, One97 Communications-operated Paytm transferred its events and movie ticketing business to Zomato. The transaction was completed earlier in August.","cleaned_content":"shares of zomato rallied \u003cSEVEN_PERCENT\u003e on the bse today reaching an intraday high of rs \u003cTWO_HUNDRED\u003e after jpmorgan raised the stock s target price to rs \u003cTHREE_HUNDRED\u003e from rs \u003cTWO_HUNDRED\u003e while maintaining an overweight rating jpmorgan stated that zomato is leading rapid retail consumer transformation through convenience focused quick commerce the company is expanding its presence across all metros after successfully proving the model in ncr this scale should help zomato drive monetization through channel margins and ad spending the global brokerage firm expects it to lead the disruption of modern trade and e commerce the global brokerage has raised its forecasts for fy25 \u003cTWO_TEN\u003e by \u003cONE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e additionally zomato has expanded its going out business by integrating core dining with a new ticketing service recently one97 communications operated paytm transferred its events and movie ticketing business to zomato the transaction was completed earlier in august","timestamp":"2024-09-05T10:35:00+05:30","market_timestamp":"2024-09-05T10:35:00+05:30","off_market_hours":false}