{"url":"https://economictimes.indiatimes.com/tech/technology/im-extremely-bullish-on-the-indian-network-balaji-srinivasan/articleshow/112972981.cms","title":"ET World Leaders Forum | Bullish on anything that's internet first within India: Balaji Srinivasan","description":"In conversation with Blume Ventures’ Sajith Pai, tech investor and author Balaji Srinivasan said he’s bullish on anything that is internet-first within India.  He also highlighted the significant impact of AI on India and the role of cryptocurrency in enhancing sovereignty.","content":"Tech investor and author Balaji Srinivasan, who was a venture capitalist at Andreessen Horowitz, said he’s bullish on anything that is internet first within India. “I am moderately optimistic in India and extremely optimistic in Indians,” he said. “I think the Indian state has done a good job in the last several years, but it's difficult to manage a billion-plus people and so on. But if you combine them with the Indian diaspora and the Indian network, that’s a very formidable thing.”Srinivasan was in conversation with Sajith Pai, partner at early-stage investment firm Blume Ventures, at the ET World Leaders Forum in New Delhi on Saturday.“I'm extremely bullish on the Indian Network, of which we see the Indian state as a subset,” he said. “What's the Indian Network? That's all of the technological, political, finance, media figures that have arisen now… globally. With the advent of Reliance Jio, a billion Indians are now actually full internet citizens. They can actually sign smart contracts. They can communicate, they can transact with anybody else online.”He underscored that this was in contrast with what happened in China, which closed off its network to the world. ","cleaned_content":"tech investor and author balaji srinivasan who was a venture capitalist at andreessen horowitz said he s bullish on anything that is internet first within india i am moderately optimistic in india and extremely optimistic in indians he said i think the indian state has done a good job in the last several years but its difficult to manage a billion plus people and so on but if you combine them with the indian diaspora and the indian network that s a very formidable thing srinivasan was in conversation with sajith pai partner at early stage investment firm blume ventures at the et world leaders forum in new delhi on saturday im extremely bullish on the indian network of which we see the indian state as a subset he said whats the indian network thats all of the technological political finance media figures that have arisen now globally with the advent of reliance jio a billion indians are now actually full internet citizens they can actually sign smart contracts they can communicate they can transact with anybody else online he underscored that this was in contrast with what happened in china which closed off its network to the world","timestamp":"2024-09-02T09:58:00+05:30","market_timestamp":"2024-09-02T09:58:00+05:30","off_market_hours":false}