{"url":"https://economictimes.indiatimes.com/tech/technology/update-1-lula-says-musk-must-respect-brazils-top-court-as-x-braces-for-shutdown/articleshow/112927538.cms","title":"Brazil President Lula says Musk must respect country's top court as X braces for shutdown","description":"X was still working normally in Brazil on Friday morning, but the platform said on Thursday that it expected Supreme Court Justice Alexandre de Moraes to order a shutdown \"soon,\" after a court-imposed deadline for the company to identify a legal representative in Brazil expired.","content":"Brazilian President Luiz Inacio Lula da Silva said on Friday that billionaire Elon Musk must respect the rulings of the country's Supreme Court, amid an ongoing feud that left social media giant X on the brink of being taken down in Brazil. X was still working normally in Brazil on Friday morning, but the platform said on Thursday that it expected Supreme Court Justice Alexandre de Moraes to order a shutdown \"soon,\" after a court-imposed deadline for the company to identify a legal representative in Brazil expired. Amid the underlying feud over X, the court also blocked the local bank accounts of Musk's Starlink satellite internet firm, which a source told Reuters was a response to the lack of legal representatives in Brazil for the social media platform. Under Brazilian laws governing the internet, social media must have a representative based in the country. To shut down X's operations in Brazil, justice Moraes would have to order telecommunication companies to stop carrying X traffic. Users, however, would still be able to dodge the blockage by using VPNs. ","cleaned_content":"brazilian president luiz inacio lula da silva said on friday that billionaire elon musk must respect the rulings of the countrys supreme court amid an ongoing feud that left social media giant x on the brink of being taken down in brazil x was still working normally in brazil on friday morning but the platform said on thursday that it expected supreme court justice alexandre de moraes to order a shutdown soon after a court imposed deadline for the company to identify a legal representative in brazil expired amid the underlying feud over x the court also blocked the local bank accounts of musks starlink satellite internet firm which a source told reuters was a response to the lack of legal representatives in brazil for the social media platform under brazilian laws governing the internet social media must have a representative based in the country to shut down xs operations in brazil justice moraes would have to order telecommunication companies to stop carrying x traffic users however would still be able to dodge the blockage by using vpns","timestamp":"2024-08-30T18:05:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}