{"url":"https://economictimes.indiatimes.com/tech/technology/black-box-looking-for-partnerships-ma-in-india-market/articleshow/112932979.cms","title":"Black Box looking for partnerships, M\u0026A in India market","description":"Black Box, a digital infrastructure firm, is looking for partnerships or mergers and acquisitions to enter India, Sanjeev Verma, a wholetime director of the Essar Group subsidiary said. The company is aiming to achieve $2 billion in revenue in the next four years.","content":"Digital infrastructure firm Black Box is looking for partnerships or mergers and acquisitions to enter the Indian market, which is the most lucrative data centre opportunity for the next three to five years, said Sanjeev Verma, a wholetime director of the Essar Group subsidiary.The systems integrator serves top tech companies in more than 35 countries. It offers data centre services, along with connectivity and networking infrastructure.The company is aiming to achieve $2 billion in revenue in the next four years, Verma said.“We are targeting an organic revenue increase from $800 million to $1.3 billion over the next four years with anticipated double-digit growth and a 10% operating margin goal. We will continue to look for accretive inorganic opportunities,” the executive said.“India, in particular, serves as a crucial hub for global expertise and delivery. Leveraging our experience with large-scale international projects, we aim to bring this expertise to India, filling a unique niche in executing global service-side projects,” Verma said.","cleaned_content":"digital infrastructure firm black box is looking for partnerships or mergers and acquisitions to enter the indian market which is the most lucrative data centre opportunity for the next three to five years said sanjeev verma a wholetime director of the essar group subsidiary the systems integrator serves top tech companies in more than \u003cTHREE_TEN\u003e countries it offers data centre services along with connectivity and networking infrastructure the company is aiming to achieve \u003cTWO_\u003e billion in revenue in the next four years verma said we are targeting an organic revenue increase from \u003cEIGHT_HUNDRED\u003e million to \u003cONE_\u003e billion over the next four years with anticipated double digit growth and a \u003cONE_TEN_PERCENT\u003e operating margin goal we will continue to look for accretive inorganic opportunities the executive said india in particular serves as a crucial hub for global expertise and delivery leveraging our experience with large scale international projects we aim to bring this expertise to india filling a unique niche in executing global service side projects verma said","timestamp":"2024-08-31T06:00:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}