{"url":"https://economictimes.indiatimes.com/tech/technology/iisc-research-team-finds-glitch-in-protein-synthesis-could-affect-tumour-growth/articleshow/113187650.cms","title":"IISc research team finds glitch in protein synthesis could affect tumour growth","description":"In the study, the researchers found that stop codon readthrough causes the translation machinery to make a longer and more unstable version of FEM1B. Ironically, this marks FEM1B itself for degradation, leading to reduced levels of the protein. The team found that a specific nucleotide sequence at the tail end of the FEM1B gene directs this readthrough.","content":"An IISc research team has zeroed in on a gene that codes for a protein called FEM1B. They show how FEM1B mRNA readthrough plays a key role in the cell cycle, with implications for cancer cell proliferation and tumour growth.In a new study published in the Journal of Cell Science, the team led by Sandeep Eswarappa, Associate Professor at the Department of Biochemistry (BC), says, during protein synthesis, or translation, genetic information transcribed in the cell’s mRNA directs the stringing together of amino acids – the building blocks of proteins. As the translation machinery carouses along the string of nucleotides that make up the mRNA, it recognises them in groups of three, called codons. Each codon corresponds to a specific amino acid. Certain codons tell the translation machinery where to start and stop. But sometimes, like a rogue driver skipping a red light, the machinery skips the stop codon and ends up making a longer protein than planned. This is called stop codon readthrough. “Because of that extra appendage, the protein can have a different localisation, a different stability, it can even have a different function,” Eswarappa said in an IISc media statement.His team is still puzzled by how exactly the stop codon readthrough happens. They are keen on nailing down the molecular machinery involved, which will help make any therapeutic approach more specific. He adds: “If we know the mechanism, we can target and regulate the readthrough process, which in turn might help in controlling the tumour progression.”The FEM1B protein is part of a complex that marks other proteins for degradation. Its job is to make sure that the right proteins are marked. The complex targets key proteins involved in many cellular processes – one of them being the cell cycle, to keep a check on how much cells proliferate. ","cleaned_content":"an iisc research team has zeroed in on a gene that codes for a protein called fem1b they show how fem1b mrna readthrough plays a key role in the cell cycle with implications for cancer cell proliferation and tumour growth in a new study published in the journal of cell science the team led by sandeep eswarappa associate professor at the department of biochemistry bc says during protein synthesis or translation genetic information transcribed in the cell s mrna directs the stringing together of amino acids the building blocks of proteins as the translation machinery carouses along the string of nucleotides that make up the mrna it recognises them in groups of three called codons each codon corresponds to a specific amino acid certain codons tell the translation machinery where to start and stop but sometimes like a rogue driver skipping a red light the machinery skips the stop codon and ends up making a longer protein than planned this is called stop codon readthrough because of that extra appendage the protein can have a different localisation a different stability it can even have a different function eswarappa said in an iisc media statement his team is still puzzled by how exactly the stop codon readthrough happens they are keen on nailing down the molecular machinery involved which will help make any therapeutic approach more specific he adds if we know the mechanism we can target and regulate the readthrough process which in turn might help in controlling the tumour progression the fem1b protein is part of a complex that marks other proteins for degradation its job is to make sure that the right proteins are marked the complex targets key proteins involved in many cellular processes one of them being the cell cycle to keep a check on how much cells proliferate","timestamp":"2024-09-09T13:45:00+05:30","market_timestamp":"2024-09-09T13:45:00+05:30","off_market_hours":false}