{"url":"https://economictimes.indiatimes.com/tech/technology/google-abusing-power-over-website-ads-uk-regulator-says/articleshow/113125646.cms","title":"Google abusing power over website ads, UK regulator says","description":"The Competition and Markets Authority (CMA) said it believed Google was using anti-competitive practices in open display ad tech through the preference of its own ad exchange, which could be harming thousands of British publishers and advertisers. Google said it disagreed with the CMA's view and would respond accordingly.","content":"Britain's antitrust regulator said on Friday it had provisionally found Alphabet's Google had abused its dominant position in digital advertising to restrict competition. The Competition and Markets Authority (CMA) said it believed Google was using anti-competitive practices in open display ad tech through the preference of its own ad exchange, which could be harming thousands of British publishers and advertisers. \"We've provisionally found that Google is using its market power to hinder competition when it comes to the ads people see on websites,\" said Juliette Enser, the CMA's interim executive director of enforcement.  \"Many businesses are able to keep their digital content free or cheaper by using online advertising to generate revenue. Adverts on these websites and apps reach millions of people across the UK - assisting the buying and selling of goods and services.\" Google said it disagreed with the CMA's view and would respond accordingly.","cleaned_content":"britains antitrust regulator said on friday it had provisionally found alphabets google had abused its dominant position in digital advertising to restrict competition the competition and markets authority cma said it believed google was using anti competitive practices in open display ad tech through the preference of its own ad exchange which could be harming thousands of british publishers and advertisers weve provisionally found that google is using its market power to hinder competition when it comes to the ads people see on websites said juliette enser the cmas interim executive director of enforcement many businesses are able to keep their digital content free or cheaper by using online advertising to generate revenue adverts on these websites and apps reach millions of people across the uk assisting the buying and selling of goods and services google said it disagreed with the cmas view and would respond accordingly","timestamp":"2024-09-06T16:16:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}