{"url":"https://economictimes.indiatimes.com/tech/technology/hindustan-composites-invests-rs-5-2-crore-in-swiggy/articleshow/113022793.cms","title":"Hindustan Composites invests Rs 5.2 crore in Swiggy","description":"Hindustan Composites purchased 1.5 lakh shares of Swiggy in the transaction, it added in an exchange filing. With this investment, the company joins a number of other investors who have been picking up stakes in the food delivery and quick commerce major.","content":"Automobile materials manufacturer Hindustan Composites Ltd said it has invested Rs 5.17 crore in public markets-bound Swiggy.Hindustan Composites purchased 1.5 lakh shares of Swiggy in the transaction, it added in an exchange filing. With this investment, the company joins a number of other investors who have been picking up stakes in the food delivery and quick commerce major.On August 28, ET reported that actor Amitabh Bachchan’s family office had picked up a stake in Swiggy by purchasing shares from employees and early investors. Raamdeo Agrawal, the chairman of Motilal Oswal Financial Services has also picked up a stake in the Bengaluru-based company.Swiggy has filed documents with the markets regulator for a $1.25-billion initial public offering (IPO).","cleaned_content":"automobile materials manufacturer hindustan composites ltd said it has invested rs \u003cFIVE_\u003e crore in public markets bound swiggy hindustan composites purchased \u003cONE_\u003e lakh shares of swiggy in the transaction it added in an exchange filing with this investment the company joins a number of other investors who have been picking up stakes in the food delivery and quick commerce major on august \u003cTWO_TEN\u003e et reported that actor amitabh bachchan s family office had picked up a stake in swiggy by purchasing shares from employees and early investors raamdeo agrawal the chairman of motilal oswal financial services has also picked up a stake in the bengaluru based company swiggy has filed documents with the markets regulator for a \u003cONE_\u003e billion initial public offering ipo","timestamp":"2024-09-03T16:05:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}