{"url":"https://economictimes.indiatimes.com/tech/technology/e-commerce-platforms-fuel-states-packaging-export-capabilities-yogi-adityanath/articleshow/112930851.cms","title":"E-commerce platforms fuel state's packaging, export capabilities: Yogi Adityanath","description":"Chief Minister Yogi Adityanath noted the key role e-commerce platforms play in boosting Uttar Pradesh's packaging and export capabilities, aligning with the Centre's One District One Product (ODOP) scheme. Speaking at the inauguration of Flipkart's new warehouses in Unnao and Varanasi, he emphasized job creation, technological advancements, and enhanced market access. The initiative is set to generate significant employment and foster local MSMEs.","content":"E-commerce platforms added momentum to Uttar Pradesh government's efforts towards enhancing packaging and export capabilities and promoting Centre's One District One Product (ODOP) scheme, Chief Minister Yogi Adityanath said on Friday. The chief minister said the state is focused on enhancing packaging and export capabilities by leveraging design, technology, and market access and also called upon companies to take advantage of the state's warehousing policy, according to an official statement.  \"We focused on enhancing packaging and export capabilities by leveraging design, technology, and market access. However, the work of giving it more momentum happened when Flipkart Group joined us,\" Adityanath said at an event at Lok Bhavan, where he virtually inaugurated Flipkart's two new warehouses in Unnao and Varanasi.  He also emphasised how these platforms are fostering healthy competition and empowering every citizen, whether in urban or rural areas, to reach global markets.  He said the ODOP scheme has gained worldwide recognition when Flipkart Group started providing services as an e-commerce platform.  The chief minister further said the micro, small, and medium enterprises (MSMEs) have been a cornerstone of the state's economy for centuries. ","cleaned_content":"e commerce platforms added momentum to uttar pradesh governments efforts towards enhancing packaging and export capabilities and promoting centres one district one product odop scheme chief minister yogi adityanath said on friday the chief minister said the state is focused on enhancing packaging and export capabilities by leveraging design technology and market access and also called upon companies to take advantage of the states warehousing policy according to an official statement we focused on enhancing packaging and export capabilities by leveraging design technology and market access however the work of giving it more momentum happened when flipkart group joined us adityanath said at an event at lok bhavan where he virtually inaugurated flipkarts two new warehouses in unnao and varanasi he also emphasised how these platforms are fostering healthy competition and empowering every citizen whether in urban or rural areas to reach global markets he said the odop scheme has gained worldwide recognition when flipkart group started providing services as an e commerce platform the chief minister further said the micro small and medium enterprises msmes have been a cornerstone of the states economy for centuries","timestamp":"2024-08-30T20:03:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}