{"url":"https://economictimes.indiatimes.com/tech/technology/zepto-in-talks-with-investment-banks-for-potential-ipo-next-year/articleshow/113136264.cms","title":"Zepto in talks with investment banks for potential IPO next year","description":"The Mumbai-based startup is also talking to domestic investment banks for a potential listing of shares by August next year, one of the people said. Swiggy, the parent of Zepto’s rival Instamart, is also readying to hit the public market later this year with a $1.25 billion IPO. Its other bigger competitor, Blinkit, is owned by Zomato, a listed company since 2021.","content":"Quick-commerce firm Zepto, which raised nearly $1 billion from private investors over the past two months, has begun active discussions with top Wall Street bankers including Morgan Stanley and Goldman Sachs for an initial public offering, said two people in the know.The Mumbai-based startup is also learnt to be talking to domestic investment banks for the potential listing of shares by August next year.IPO contingent on Flip-backHowever, the IPO plan will be contingent on its flip back to India, said people in the know. Zepto, as reported by ET earlier, is in the process of shifting its domicile from Singapore to India joining a large group of Indian startups which have flipped back recently.“The IPO timeline will depend on the flipping back process, but their aspiration is to list by next year,” said one of the people.","cleaned_content":"quick commerce firm zepto which raised nearly \u003cONE_\u003e billion from private investors over the past two months has begun active discussions with top wall street bankers including morgan stanley and goldman sachs for an initial public offering said two people in the know the mumbai based startup is also learnt to be talking to domestic investment banks for the potential listing of shares by august next year ipo contingent on flip backhowever the ipo plan will be contingent on its flip back to india said people in the know zepto as reported by et earlier is in the process of shifting its domicile from singapore to india joining a large group of indian startups which have flipped back recently the ipo timeline will depend on the flipping back process but their aspiration is to list by next year said one of the people","timestamp":"2024-09-07T07:55:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}