{"url":"https://economictimes.indiatimes.com/tech/technology/how-one-brazilian-judge-could-suspend-elon-musks-x/articleshow/112923988.cms","title":"How one Brazilian judge could suspend Elon Musk's X","description":"​​The justice, Alexandre de Moraes, has threatened to suspend social media giant X nationwide if its billionaire owner Elon Musk doesn't swiftly comply with one of his orders. Musk has responded with insults, including calling de Moraes a \"tyrant\" and \"a dictator.\"","content":"It's a showdown between the world's richest man and a Brazilian Supreme Court justice. The justice, Alexandre de Moraes, has threatened to suspend social media giant X nationwide if its billionaire owner Elon Musk doesn't swiftly comply with one of his orders. Musk has responded with insults, including calling de Moraes a \"tyrant\" and \"a dictator.\" It is the latest chapter in the monthslong feud between the two men over free speech, far-right accounts and misinformation. Many in Brazil are waiting and watching to see if either man will blink. What is the basis for de Moraes' threat? Earlier this month, X removed its legal representative from Brazil on the grounds that de Moraes had threatened her with arrest. On Wednesday night at 8:07 p.m. local time (7:07 p.m. Eastern Standard Time), de Moraes gave the platform 24 hours to appoint a new representative, or face a shutdown until his order is met. De Moraes' order is based on Brazilian law requiring foreign companies to have legal representation to operate in the country, according to the Supreme Court's press office. This ensures someone can be notified of legal decisions and is qualified to take any requisite action.","cleaned_content":"its a showdown between the worlds richest man and a brazilian supreme court justice the justice alexandre de moraes has threatened to suspend social media giant x nationwide if its billionaire owner elon musk doesnt swiftly comply with one of his orders musk has responded with insults including calling de moraes a tyrant and a dictator it is the latest chapter in the monthslong feud between the two men over free speech far right accounts and misinformation many in brazil are waiting and watching to see if either man will blink what is the basis for de moraes threat earlier this month x removed its legal representative from brazil on the grounds that de moraes had threatened her with arrest on wednesday night at \u003cEIGHT_\u003e \u003cSEVEN_\u003e p m local time \u003cSEVEN_\u003e \u003cSEVEN_\u003e p m eastern standard time de moraes gave the platform \u003cTWO_TEN\u003e hours to appoint a new representative or face a shutdown until his order is met de moraes order is based on brazilian law requiring foreign companies to have legal representation to operate in the country according to the supreme courts press office this ensures someone can be notified of legal decisions and is qualified to take any requisite action","timestamp":"2024-08-30T16:14:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}