{"url":"https://economictimes.indiatimes.com/tech/technology/us-crypto-executives-to-throw-washington-fundraiser-for-kamala-harris/articleshow/112952139.cms","title":"US crypto executives to throw Washington fundraiser for Kamala Harris","description":"The grassroots event is scheduled to take place between the Congressional Black Caucus and Congressional Hispanic Caucus conferences, and aims to bring together a diverse group of donors, the organizers told Reuters. Tickets to the fundraiser range from $500 to $5,000, said Cleve Mesidor, executive director of the Blockchain Foundation and one of the organisers.","content":"Cryptocurrency investors and industry executives calling on Vice President Kamala Harris to pursue a softer regulatory stance on the industry are planning to raise at least $100,000 for the Democratic nominee at a Sept. 13 Washington fundraiser. The grassroots event is scheduled to take place between the Congressional Black Caucus and Congressional Hispanic Caucus conferences, and aims to bring together a diverse group of donors, the organizers told Reuters. Tickets to the fundraiser range from $500 to $5,000, said Cleve Mesidor, executive director of the Blockchain Foundation and one of the organisers.  The event's fundraising goal is small compared to the hundreds of millions Harris has raked in since becoming the Democratic presidential candidate in July when President Joe Biden dropped out of the race. But it is the latest sign that at least some in the industry are rallying behind her rather than Republican nominee Donald Trump, who has courted big crypto donors with friendly policy pledges.  Reuters was first to report the fundraiser. The organizers include Tiffany Smith, co-chair of the Blockchain \u0026 Cryptocurrency Working Group at law firm WilmerHale and Rahilla Zafar, a crypto founder who has also worked in artificial intelligence. They are hoping that if elected, Harris will ease up on crypto after the Securities and Exchange Commission under Biden cracked down on the sector. ","cleaned_content":"cryptocurrency investors and industry executives calling on vice president kamala harris to pursue a softer regulatory stance on the industry are planning to raise at least \u003cONE_HUNDRED_THOUSAND\u003e for the democratic nominee at a sept \u003cONE_TEN\u003e washington fundraiser the grassroots event is scheduled to take place between the congressional black caucus and congressional hispanic caucus conferences and aims to bring together a diverse group of donors the organizers told reuters tickets to the fundraiser range from \u003cFIVE_HUNDRED\u003e to \u003cFIVE_THOUSAND\u003e said cleve mesidor executive director of the blockchain foundation and one of the organisers the events fundraising goal is small compared to the hundreds of millions harris has raked in since becoming the democratic presidential candidate in july when president joe biden dropped out of the race but it is the latest sign that at least some in the industry are rallying behind her rather than republican nominee donald trump who has courted big crypto donors with friendly policy pledges reuters was first to report the fundraiser the organizers include tiffany smith co chair of the blockchain cryptocurrency working group at law firm wilmerhale and rahilla zafar a crypto founder who has also worked in artificial intelligence they are hoping that if elected harris will ease up on crypto after the securities and exchange commission under biden cracked down on the sector","timestamp":"2024-08-31T18:53:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}