{"url":"https://economictimes.indiatimes.com/tech/technology/paypal-pushes-into-in-person-payments-with-cashback-rewards-apple-integration/articleshow/113097116.cms","title":"PayPal pushes into in-person payments with cashback rewards, Apple integration","description":"The bid to grab a slice of in-person purchases at stores, cafes and restaurants is part of an ambitious turnaround strategy by new CEO Alex Chriss who joined the company from Intuit last year.","content":"PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global online payments giant seeks direct competition with tech companies and banks. The bid to grab a slice of in-person purchases at stores, cafes and restaurants is part of an ambitious turnaround strategy by new CEO Alex Chriss who joined the company from Intuit last year. While PayPal has long dominated online payments and peer-to-peer payments via its Venmo app, it has not pushed consumers to use its products in person. \"E-commerce has obviously been one of the fastest growing areas where people are spending their dollars... but it's not everything,\" Chriss said. \"Now consumers can use PayPal for every purchase, everywhere, every time.\" The push into point-of-sales includes 5% cash back for certain products up to $1,000 per month and additional rewards from brands like DoorDash and Sephora.","cleaned_content":"paypal is expanding into u s point of sale payments by integrating its debit card with apples mobile wallet and offering cashback rewards as the global online payments giant seeks direct competition with tech companies and banks the bid to grab a slice of in person purchases at stores cafes and restaurants is part of an ambitious turnaround strategy by new ceo alex chriss who joined the company from intuit last year while paypal has long dominated online payments and peer to peer payments via its venmo app it has not pushed consumers to use its products in person e commerce has obviously been one of the fastest growing areas where people are spending their dollars but its not everything chriss said now consumers can use paypal for every purchase everywhere every time the push into point of sales includes \u003cFIVE_PERCENT\u003e cash back for certain products up to \u003cONE_THOUSAND\u003e per month and additional rewards from brands like doordash and sephora","timestamp":"2024-09-05T17:40:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}