{"url":"https://economictimes.indiatimes.com/tech/technology/nykaa-sues-former-executive-asthana-who-now-heads-tata-cliq/articleshow/113072347.cms","title":"ETtech Exclusive: Nykaa sues former CBO, current Tata Cliq CEO Asthana for contract breach","description":"Asthana, a chief executive in Tata’s ecommerce venture, was the CBO at Nykaa for four years and was also on the company’s board. Nykaa said in its petition that such a high position in the company made him privy to confidential business data. Nykaa said it granted Asthana an exception to join a direct rival despite having a non-compete agreement with him.","content":"Beauty and fashion product retailer Nykaa has sued its former chief business officer Gopal Asthana, who now heads Tata Digital’s fashion business Tata Cliq, accusing him of breaching confidentiality, misappropriation of proprietary data and seeking to harm its business. It alleged that Asthana approached several Nykaa staffers who reported to him previously to join Tata Cliq and that some of them have made the switch over the past year.In its petition in the Bombay High Court, Nykaa said it had paid Asthana a substantial remuneration, including long-term incentives and in stock options. It sought a refund of around Rs 19 crore of employee stock option benefits availed of by him along with another Rs 5 crore citing loss of goodwill and other business metrics. The company also pleaded the court to restrain him from using any Nykaa business data for his work at Tata Cliq.The high court passed an interim order on Wednesday, directing Asthana to not engage in hiring executives for Tata Cliq from Nykaa.Falguni Nayar-led Nykaa has not made Tata Digital a party to the petition.Asthana, a chief executive in Tata’s ecommerce venture, was the CBO at Nykaa for four years and was also on the company’s board. Nykaa said in its petition that such a high position in the company made him privy to confidential business data.","cleaned_content":"beauty and fashion product retailer nykaa has sued its former chief business officer gopal asthana who now heads tata digital s fashion business tata cliq accusing him of breaching confidentiality misappropriation of proprietary data and seeking to harm its business it alleged that asthana approached several nykaa staffers who reported to him previously to join tata cliq and that some of them have made the switch over the past year in its petition in the bombay high court nykaa said it had paid asthana a substantial remuneration including long term incentives and in stock options it sought a refund of around rs \u003cONE_TEN\u003e crore of employee stock option benefits availed of by him along with another rs \u003cFIVE_\u003e crore citing loss of goodwill and other business metrics the company also pleaded the court to restrain him from using any nykaa business data for his work at tata cliq the high court passed an interim order on wednesday directing asthana to not engage in hiring executives for tata cliq from nykaa falguni nayar led nykaa has not made tata digital a party to the petition asthana a chief executive in tata s ecommerce venture was the cbo at nykaa for four years and was also on the company s board nykaa said in its petition that such a high position in the company made him privy to confidential business data","timestamp":"2024-09-05T08:33:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}