{"url":"https://economictimes.indiatimes.com/tech/technology/spacex-cleared-to-fly-falcon-9-rocket-after-landing-mishap/articleshow/112939545.cms","title":"SpaceX cleared to fly Falcon 9 rocket after landing mishap","description":"US regulators on Friday cleared SpaceX to restart launching its stalwart Falcon 9 rocket, as a probe continues into a rare mishap this week during a first-stage booster landing. The Federal Aviation Administration (FAA) grounded the Falcon 9 rocket on Wednesday after a first-stage booster tipped over and exploded while attempting to land on a droneship off the Florida coast.","content":"US regulators on Friday cleared SpaceX to restart launching its stalwart Falcon 9 rocket, as a probe continues into a rare mishap this week during a first-stage booster landing.The Federal Aviation Administration (FAA) grounded the Falcon 9 rocket on Wednesday after a first-stage booster tipped over and exploded while attempting to land on a droneship off the Florida coast.The early morning launch was otherwise successful, delivering the latest batch of 21 Starlink internet satellites into orbit.\"The SpaceX Falcon 9 vehicle may return to flight operations while the overall investigation of the anomaly during the Starlink Group 8-6 mission remains open, provided all other license requirements are met,\" the FAA said in a statement Friday.A webcast from Elon Musk's company showed the first stage, which normally fires its thrusters to achieve a precise upright landing, tilting and blowing up as it descended onto a droneship off the Florida coast.","cleaned_content":"us regulators on friday cleared spacex to restart launching its stalwart falcon \u003cNINE_\u003e rocket as a probe continues into a rare mishap this week during a first stage booster landing the federal aviation administration faa grounded the falcon \u003cNINE_\u003e rocket on wednesday after a first stage booster tipped over and exploded while attempting to land on a droneship off the florida coast the early morning launch was otherwise successful delivering the latest batch of \u003cTWO_TEN\u003e starlink internet satellites into orbit the spacex falcon \u003cNINE_\u003e vehicle may return to flight operations while the overall investigation of the anomaly during the starlink group \u003cEIGHT_\u003e \u003cSIX_\u003e mission remains open provided all other license requirements are met the faa said in a statement friday a webcast from elon musks company showed the first stage which normally fires its thrusters to achieve a precise upright landing tilting and blowing up as it descended onto a droneship off the florida coast","timestamp":"2024-08-31T08:50:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}