{"url":"https://economictimes.indiatimes.com/tech/technology/apples-glowtime-event-iphone-16-series-airpods-4-new-apple-watch-and-more/articleshow/113202890.cms","title":"Apple's Glowtime event: iPhone 16 series, AirPods 4, new Apple watch  and more","description":"Apple CEO Tim Cook's tweet about Apple Park's glow has generated excitement. At the upcoming Glowtime event, Apple will unveil the iPhone 16 series, iOS 18, and the redesigned Apple Watch Series 10. Updates to AirPods, including a new design and USB-C charging, are also expected.","content":"Apple fans globally have been waiting with bated breath for the new announcements. Apple CEO Tim Cook sent the tech world buzzing with a recent tweet showcasing Apple Park’s stunning “glow”. Apple is gearing up to introduce a range of devices including the iPhone 16 series equipped with improved hardware for AI assistance at its annual \"Glowtime\" event held at the Steve Jobs Theater. Constructed using 100% renewable energy, \"The Observatory\" seamlessly blends into the surrounding landscape, reflecting Apple's commitment to environmental sustainability. \"When we built Apple Park, we wanted the entire campus to be integrated with nature,\" said John De Maio, Apple's global head of design (real estate and development).The main focus of the event is on Apple's latest lineup of devices, including the highly anticipated iPhone 16 series. The series consists of four models: the iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16 Pro Max. While the non-Pro models are expected to retain their current screen sizes, the Pro models are rumored to feature slightly larger displays.In addition to the iPhone 16 series, Apple is likely to announce iOS 18, the latest version of its mobile operating system. While the initial release will offer a range of features, more advanced capabilities, including those powered by Apple Intelligence, will be available in a subsequent update, iOS 18.1.To celebrate the 10th anniversary of the Apple Watch, the Series 10 is set to receive a significant redesign. The new model is expected to have a sleeker look and a larger display. It will also feature improved sleep tracking, including the ability to detect sleep apnea. However, features like blood oxygen and hypertension monitoring may be delayed due to regulatory challenges.","cleaned_content":"apple fans globally have been waiting with bated breath for the new announcements apple ceo tim cook sent the tech world buzzing with a recent tweet showcasing apple park s stunning glow apple is gearing up to introduce a range of devices including the iphone \u003cONE_TEN\u003e series equipped with improved hardware for ai assistance at its annual glowtime event held at the steve jobs theater constructed using \u003cONE_HUNDRED_PERCENT\u003e renewable energy the observatory seamlessly blends into the surrounding landscape reflecting apples commitment to environmental sustainability when we built apple park we wanted the entire campus to be integrated with nature said john de maio apples global head of design real estate and development the main focus of the event is on apples latest lineup of devices including the highly anticipated iphone \u003cONE_TEN\u003e series the series consists of four models the iphone \u003cONE_TEN\u003e iphone \u003cONE_TEN\u003e plus iphone \u003cONE_TEN\u003e pro and iphone \u003cONE_TEN\u003e pro max while the non pro models are expected to retain their current screen sizes the pro models are rumored to feature slightly larger displays in addition to the iphone \u003cONE_TEN\u003e series apple is likely to announce ios \u003cONE_TEN\u003e the latest version of its mobile operating system while the initial release will offer a range of features more advanced capabilities including those powered by apple intelligence will be available in a subsequent update ios \u003cONE_TEN\u003e to celebrate the \u003cONE_TEN\u003e th anniversary of the apple watch the series \u003cONE_TEN\u003e is set to receive a significant redesign the new model is expected to have a sleeker look and a larger display it will also feature improved sleep tracking including the ability to detect sleep apnea however features like blood oxygen and hypertension monitoring may be delayed due to regulatory challenges","timestamp":"2024-09-09T22:52:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}