{"url":"https://economictimes.indiatimes.com/tech/technology/meta-clears-use-of-palestinian-slogan-from-the-river-to-the-sea/articleshow/113088704.cms","title":"Meta clears use of Palestinian slogan 'From the River to the Sea'","description":"Meta's Oversight Board ruled on Wednesday that the standalone use of the phrase \"From the River to the Sea,\" a slogan oft-used by pro-Palestinian users, does not violate the company's content policies.   The phrase \"From the River to the Sea\" refers to the geographical area between the Jordan River and the Mediterranean Sea, which encompasses Israel, the West Bank, and Gaza.","content":"Meta's Oversight Board ruled on Wednesday that the standalone use of the phrase \"From the River to the Sea,\" a slogan oft-used by pro-Palestinian users, does not violate the company's content policies. The phrase \"From the river to the sea, Palestine will be free,\" has been used as a rallying cry for many since the outbreak of the war in Gaza, with Israel accusing those who use it of \"anti-Semitism.\"The independent Meta board is the top authority in Meta's content moderation decisions. It reviewed three cases involving Facebook posts containing the controversial phrase, which has gained prominence due to the conflict and the worldwide protests against it.The board found that the content did not break Meta's rules on hate speech, violence and incitement, or dangerous organizations and individuals, and should not lead to post removal on its platforms. \"In upholding Meta's decisions to keep up the content, the majority of the Board notes the phrase has multiple meanings and is used by people in various ways and with different intentions,\" it said.","cleaned_content":"metas oversight board ruled on wednesday that the standalone use of the phrase from the river to the sea a slogan oft used by pro palestinian users does not violate the companys content policies the phrase from the river to the sea palestine will be free has been used as a rallying cry for many since the outbreak of the war in gaza with israel accusing those who use it of anti semitism the independent meta board is the top authority in metas content moderation decisions it reviewed three cases involving facebook posts containing the controversial phrase which has gained prominence due to the conflict and the worldwide protests against it the board found that the content did not break metas rules on hate speech violence and incitement or dangerous organizations and individuals and should not lead to post removal on its platforms in upholding metas decisions to keep up the content the majority of the board notes the phrase has multiple meanings and is used by people in various ways and with different intentions it said","timestamp":"2024-09-05T13:39:00+05:30","market_timestamp":"2024-09-05T13:39:00+05:30","off_market_hours":false}