{"url":"https://economictimes.indiatimes.com/tech/technology/meta-faces-3-6-million-fine-in-brazil-for-allowing-bogus-ads/articleshow/112953322.cms","title":"Meta faces $3.6 million fine in Brazil for allowing bogus ads","description":"In her ruling, Judge Joana Ribeiro said it was unacceptable for Meta to sell ads in an insecure way to sustain its business model. The department store, Havan, called the decision a “landmark” in protecting the company’s rights.","content":"Meta faces a fine of up to 20 million reais ($3.62 million) after losing a lawsuit in Brazil, by a department store that accused the company of accepting paid advertisements that fraudulently used the retailer’s name to deceive consumers.In her ruling, Judge Joana Ribeiro said it was unacceptable for Meta to sell ads in an insecure way to sustain its business model. The department store, Havan, called the decision a “landmark” in protecting the company’s rights.Meta declined to comment, but can appeal the decision.Chinese EV makers suffer setback in EuropeChinese automakers registered fewer electric cars across Europe in July, as new tariffs amplified the impact of a broader slump in EV sales.","cleaned_content":"meta faces a fine of up to \u003cTWO_TEN\u003e million reais \u003cTHREE_\u003e million after losing a lawsuit in brazil by a department store that accused the company of accepting paid advertisements that fraudulently used the retailer s name to deceive consumers in her ruling judge joana ribeiro said it was unacceptable for meta to sell ads in an insecure way to sustain its business model the department store havan called the decision a landmark in protecting the company s rights meta declined to comment but can appeal the decision chinese ev makers suffer setback in europechinese automakers registered fewer electric cars across europe in july as new tariffs amplified the impact of a broader slump in ev sales","timestamp":"2024-09-01T06:00:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}