{"url":"https://economictimes.indiatimes.com/tech/technology/nvidias-stock-swoon-turns-attention-to-big-techs-sway-over-markets/articleshow/113117965.cms","title":"Nvidia's stock swoon turns attention to Big Tech's sway over markets","description":"A tumble in the chipmaker's shares shaved $279 billion off Nvidia's market capitalization on Tuesday, the single largest one-day decline in market value on record for a U.S. company. The stock was rebounding on Wednesday, rising 1% in late morning trading.","content":"Shares of Nvidia and other Big Tech stocks have helped power the markets run to record highs this year. Their recent wobble is making investors nervous.  A tumble in the chipmaker's shares shaved $279 billion off Nvidia's market capitalization on Tuesday, the single largest one-day decline in market value on record for a U.S. company. The stock was rebounding on Wednesday, rising 1% in late morning trading. Whether the steep fall is due to investors becoming more cautious towards the artificial intelligence trend that supercharged market returns this year or worries over the health of the U.S. economy, more trouble for Nvidia and other Big Tech stocks would likely spell trouble for the broader markets.  Nvidia - along with Apple, Microsoft, Amazon and Alphabet - currently make up more than a quarter of the weight in the S\u0026P 500 and over a third of the Nasdaq 100. Nvidia alone had comprised 23% of the S\u0026P 500's year-to-date total return of 19.5% as of the end of August. Further losses in their shares would likely hurt those indexes, which hit record highs in July, unless stocks in other sectors of the market pick up the slack. ","cleaned_content":"shares of nvidia and other big tech stocks have helped power the markets run to record highs this year their recent wobble is making investors nervous a tumble in the chipmakers shares shaved \u003cTWO_HUNDRED\u003e billion off nvidias market capitalization on tuesday the single largest one day decline in market value on record for a u s company the stock was rebounding on wednesday rising \u003cONE_PERCENT\u003e in late morning trading whether the steep fall is due to investors becoming more cautious towards the artificial intelligence trend that supercharged market returns this year or worries over the health of the u s economy more trouble for nvidia and other big tech stocks would likely spell trouble for the broader markets nvidia along with apple microsoft amazon and alphabet currently make up more than a quarter of the weight in the s p \u003cFIVE_HUNDRED\u003e and over a third of the nasdaq \u003cONE_HUNDRED\u003e nvidia alone had comprised \u003cTWO_TEN_PERCENT\u003e of the s p \u003cFIVE_HUNDRED\u003e s year to date total return of \u003cONE_TEN_PERCENT\u003e as of the end of august further losses in their shares would likely hurt those indexes which hit record highs in july unless stocks in other sectors of the market pick up the slack","timestamp":"2024-09-06T12:43:00+05:30","market_timestamp":"2024-09-06T12:43:00+05:30","off_market_hours":false}