{"url":"https://economictimes.indiatimes.com/tech/technology/illicit-betting-gaming-apps-laundering-money-via-kirana-stores-finds-ed/articleshow/113092542.cms","title":"Illicit betting, gaming apps laundering money via kirana stores, finds ED","description":"Under the DMT framework, banks can appoint intermediaries and agents (business correspondents) to collect cash from migrants and send it to their relatives. The cash is then deposited into a common account before being transferred to the recipient’s UPI account.","content":"The Enforcement Directorate (ED) has discovered a money laundering operation being run by illegal gaming and betting apps via local retail stores, as per a Times of India report.Unsuspecting local shop owners were made to believe that they were participating in the Reserve Bank of India’s domestic money transfer (DMT) framework, which allows instant money transfers to any bank account within the country, the report said. Under the DMT framework, banks can appoint intermediaries and agents (business correspondents) to collect cash from migrants and send it to their relatives. The cash is then deposited into a common account before being transferred to the recipient’s UPI account.The scheme is intended to provide an easy and secure money transfer option for migrants who lack access to formal banking services.The ED found that a significant portion of transactions processed by local kirana stores and small retailers were payouts to winners of gaming and betting apps.","cleaned_content":"the enforcement directorate ed has discovered a money laundering operation being run by illegal gaming and betting apps via local retail stores as per a times of india report unsuspecting local shop owners were made to believe that they were participating in the reserve bank of india s domestic money transfer dmt framework which allows instant money transfers to any bank account within the country the report said under the dmt framework banks can appoint intermediaries and agents business correspondents to collect cash from migrants and send it to their relatives the cash is then deposited into a common account before being transferred to the recipient s upi account the scheme is intended to provide an easy and secure money transfer option for migrants who lack access to formal banking services the ed found that a significant portion of transactions processed by local kirana stores and small retailers were payouts to winners of gaming and betting apps","timestamp":"2024-09-05T15:37:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}