{"url":"https://economictimes.indiatimes.com/tech/technology/first-private-spacewalk-in-spacex-capsule-achieves-new-milestone/articleshow/113318424.cms","title":"First private spacewalk in SpaceX capsule achieves new milestone","description":"The successful operation further reinforces that space travel is no longer the exclusive province of professional astronauts working at governmental space agencies like NASA, and now neither is the derring-do of spacewalks, when astronauts are protected by just their spacesuits from airless doom. The Polaris missions this one is the first of three aim to accelerate technological advances needed to fulfill Musk's hope of sending people to Mars someday.","content":"Two private astronauts moved outside their spacecraft early Thursday morning, conducting the first-ever commercial spacewalk. The spacewalk was the centerpiece of Polaris Dawn, a collaboration between Elon Musk's SpaceX and Jared Isaacman, a billionaire entrepreneur who is leading the mission. \"Back at home, we all have a lot of work to do, but from here, Earth sure looks like a perfect world,\" he said while standing in the hatch of the SpaceX Crew Dragon capsule with the planet above his head. The successful operation further reinforces that space travel is no longer the exclusive province of professional astronauts working at governmental space agencies like NASA, and now neither is the derring-do of spacewalks, when astronauts are protected by just their spacesuits from airless doom. The Polaris missions -- this one is the first of three -- aim to accelerate technological advances needed to fulfill Musk's hope of sending people to Mars someday. Bill Nelson, the NASA administrator, cheered the spacewalk, which the government space agency played almost no role in.","cleaned_content":"two private astronauts moved outside their spacecraft early thursday morning conducting the first ever commercial spacewalk the spacewalk was the centerpiece of polaris dawn a collaboration between elon musks spacex and jared isaacman a billionaire entrepreneur who is leading the mission back at home we all have a lot of work to do but from here earth sure looks like a perfect world he said while standing in the hatch of the spacex crew dragon capsule with the planet above his head the successful operation further reinforces that space travel is no longer the exclusive province of professional astronauts working at governmental space agencies like nasa and now neither is the derring do of spacewalks when astronauts are protected by just their spacesuits from airless doom the polaris missions this one is the first of three aim to accelerate technological advances needed to fulfill musks hope of sending people to mars someday bill nelson the nasa administrator cheered the spacewalk which the government space agency played almost no role in","timestamp":"2024-09-13T13:56:00+05:30","market_timestamp":"2024-09-13T13:56:00+05:30","off_market_hours":false}