{"url":"https://economictimes.indiatimes.com/tech/technology/cybersecurity-company-tenable-appoints-rajnish-gupta-as-md-for-india-saarc/articleshow/113387956.cms","title":"Cybersecurity company Tenable appoints Rajnish Gupta as MD for India, SAARC","description":"The appointment aligns with the Columbia, Maryland-headquartered firm's expansion of its cloud capabilities and exposure management platform, enabling organisations to know, expose and close their cyber exposure gaps.","content":"Cybersecurity company Tenable Monday announced the appointment of Rajnish Gupta as managing director for India and SAARC. In his new role, Gupta will lead strategic initiatives, oversee operations and drive continued growth of business and channel activities across the region.The appointment aligns with the Columbia, Maryland-headquartered firm's expansion of its cloud capabilities and exposure management platform, enabling organisations to know, expose and close their cyber exposure gaps. “Rajnish’s extensive experience in finance, telecommunications, manufacturing, public sector, and his deep knowledge of cybersecurity will be instrumental in driving further growth in the region,” said Nigel Ng, senior vice-president, Tenable Asia Pacific and Japan.“I’m confident that under his leadership, we will achieve significant advancements in delivering security solutions that address the evolving needs of our clients, ensuring they can understand and remediate their risk,\" he added. With over 30 years of IT and cybersecurity experience driving momentum for enterprises, Gupta joins the company from Palo Alto Networks, where he was the India country director for the Cortex division. Prior to that, he was a senior director and cybersecurity leader at Microsoft.","cleaned_content":"cybersecurity company tenable monday announced the appointment of rajnish gupta as managing director for india and saarc in his new role gupta will lead strategic initiatives oversee operations and drive continued growth of business and channel activities across the region the appointment aligns with the columbia maryland headquartered firms expansion of its cloud capabilities and exposure management platform enabling organisations to know expose and close their cyber exposure gaps rajnish s extensive experience in finance telecommunications manufacturing public sector and his deep knowledge of cybersecurity will be instrumental in driving further growth in the region said nigel ng senior vice president tenable asia pacific and japan i m confident that under his leadership we will achieve significant advancements in delivering security solutions that address the evolving needs of our clients ensuring they can understand and remediate their risk he added with over \u003cTHREE_TEN\u003e years of it and cybersecurity experience driving momentum for enterprises gupta joins the company from palo alto networks where he was the india country director for the cortex division prior to that he was a senior director and cybersecurity leader at microsoft","timestamp":"2024-09-16T13:30:00+05:30","market_timestamp":"2024-09-16T13:30:00+05:30","off_market_hours":false}