{"url":"https://economictimes.indiatimes.com/tech/technology/lending-firms-utilise-account-aggregator-framework-for-rs-42300-crores-in-loans-sahamati/articleshow/113391046.cms","title":"Lending firms utilise Account Aggregator framework for Rs 42,300 crores in loans: Sahamati","description":"Sahamati is a market-led industry alliance for the AA ecosystem. The report on ‘Lending facilitated by Account Aggregators’ is the first of a series. It aims to track the adoption and usage of the AA framework.","content":"Lending firms using the Account Aggregator (AA) framework facilitated loans worth Rs 42,300 crore from September 2021 to March 2024, according to a report by Sahamati, a market-led industry alliance for the AA ecosystem.The report titled ‘Lending facilitated by Account Aggregators’ issued on Monday is the first of a series and it is aimed at tracking the level of adoption and usage of the AA framework. According to the report, the loans had a cumulative average ticket size of Rs 100,237. Growth in facilitating loans is indicated by total loan disbursed at Rs 21.2 lakhs with Rs 22,100 crore worth of disbursements facilitated by AAs in the second half of FY24.\"Average loan ticket size in this period stood at Rs 1,04,245 and is expected to reduce as we expect more cash-flow based lending to MSMEs and unsecured loans to new to credit customers,\" Sahamati said in a statement.The figures represent data submitted by the nine top-performing Financial Information Users (FIUs), comprising about 60% of consents fulfilled in the second half of FY24. \"The numbers, if extrapolated for the ecosystem, are much higher,\" Sahamati said.","cleaned_content":"lending firms using the account aggregator aa framework facilitated loans worth rs \u003cFOUR_TEN_THOUSAND\u003e crore from september \u003cTWO_THOUSAND\u003e to march \u003cTWO_THOUSAND\u003e according to a report by sahamati a market led industry alliance for the aa ecosystem the report titled lending facilitated by account aggregators issued on monday is the first of a series and it is aimed at tracking the level of adoption and usage of the aa framework according to the report the loans had a cumulative average ticket size of rs \u003cONE_HUNDRED_THOUSAND\u003e growth in facilitating loans is indicated by total loan disbursed at rs \u003cTWO_TEN\u003e lakhs with rs \u003cTWO_TEN_THOUSAND\u003e crore worth of disbursements facilitated by aas in the second half of fy24 average loan ticket size in this period stood at rs \u003cONE_HUNDRED_THOUSAND\u003e and is expected to reduce as we expect more cash flow based lending to msmes and unsecured loans to new to credit customers sahamati said in a statement the figures represent data submitted by the nine top performing financial information users fius comprising about \u003cSIX_TEN_PERCENT\u003e of consents fulfilled in the second half of fy24 the numbers if extrapolated for the ecosystem are much higher sahamati said","timestamp":"2024-09-16T16:39:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}