{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-renews-deal-with-europes-posti-group-for-7-years/articleshow/113493907.cms","title":"Infosys renews deal with Europe’s Posti group for 7 years","description":"“As part of the engagement, Infosys will help Posti enhance customer experience and operational efficiency while continuing to innovate, scale, and grow its IT operations,” Infosys said in a statement.","content":"India’s second largest software services exporter has announced renewal of partnership by another seven years with Europe-based delivery and logistics services provider Posti (Finnish Postal Service), present in Finland, Sweden, and the Baltics. “As part of the engagement, Infosys will help Posti enhance customer experience and operational efficiencywhile continuing to innovate, scale, and grow its IT operations,” Infosys said in a statement. Financial details of the deal were not disclosed.The Bengaluru IT major will use its AI platform Topaz using generative AI (GenAI) technologies to empower Posti with operational efficiencies and service quality. The company will also adopt its cloud offering Cobalt to leverage its platform Live Enterprise Application Management Platform (LEAP) to provide NextGen Application Management Services for enterprises to accelerate their cloud journey and help drive business productivity. “We are pleased to announce the renewal of our collaboration with Infosys for another seven years. By harnessing the power of AI through Infosys Topaz and cloud capabilities through Infosys Cobalt, we aim to create a more efficient and customer centric organization. The collaboration with Infosys will accelerate our digital transformation journey and help us deliver exceptional services, optimize our operations, and strengthen our position as a leading delivery and logistics provider,” said Petteri Naulapää, CIO \u0026 SVP, ICT and digitalization, Posti Group. “In the last five years through the collaboration, Infosys has helped Posti improve the resilience of IT systems, reduce outages and disruptions, and improve Posti’s ability to prevent and respond to cyber threats. Infosys has helped Posti modernize the front-end consumer-facing applications and replace legacy systems and processes,” the statement added.","cleaned_content":"india s second largest software services exporter has announced renewal of partnership by another seven years with europe based delivery and logistics services provider posti finnish postal service present in finland sweden and the baltics as part of the engagement infosys will help posti enhance customer experience and operational efficiencywhile continuing to innovate scale and grow its it operations infosys said in a statement financial details of the deal were not disclosed the bengaluru it major will use its ai platform topaz using generative ai genai technologies to empower posti with operational efficiencies and service quality the company will also adopt its cloud offering cobalt to leverage its platform live enterprise application management platform leap to provide nextgen application management services for enterprises to accelerate their cloud journey and help drive business productivity we are pleased to announce the renewal of our collaboration with infosys for another seven years by harnessing the power of ai through infosys topaz and cloud capabilities through infosys cobalt we aim to create a more efficient and customer centric organization the collaboration with infosys will accelerate our digital transformation journey and help us deliver exceptional services optimize our operations and strengthen our position as a leading delivery and logistics provider said petteri naulap cio svp ict and digitalization posti group in the last five years through the collaboration infosys has helped posti improve the resilience of it systems reduce outages and disruptions and improve posti s ability to prevent and respond to cyber threats infosys has helped posti modernize the front end consumer facing applications and replace legacy systems and processes the statement added","timestamp":"2024-09-19T17:42:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}