{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-to-invest-10-billion-in-uk-data-centres/articleshow/113243845.cms","title":"Amazon to invest $10 billion in UK data centres","description":"Amazon Web Services plans to invest 8 billion pounds in the UK over the next five years to build and maintain data centres. This investment is expected to contribute 14 billion pounds to the UK's GDP by 2028 and support over 14,000 jobs. The project highlights increasing demand for cloud services driven by artificial intelligence.","content":"Internet giant Amazon's cloud computing arm, Amazon Web Services, said on Wednesday that it plans to spend 8 billion pounds ($10.45 billion) in the United Kingdom over the next five years to build, operate and maintain data centres.The company expects the investment project to contribute 14 billion pounds to the country's gross domestic product by the end of 2028 and to support more than 14,000 jobs at British businesses.The project represents a step-up in the pace of Amazon's investment in Britain. Since 2022 AWS has invested 3 billion pounds in facilities in London and Manchester.\"Our team that builds our data centres globally take into account multiple levers that they have to look at before they can decide where to put data centres ... from power to water to the local environment,\" Tanuja Randery, a managing director at AWS, told Reuters.She singled out use of artificial intelligence as among the factors driving demand for cloud services.","cleaned_content":"internet giant amazons cloud computing arm amazon web services said on wednesday that it plans to spend \u003cEIGHT_\u003e billion pounds \u003cONE_TEN\u003e billion in the united kingdom over the next five years to build operate and maintain data centres the company expects the investment project to contribute \u003cONE_TEN\u003e billion pounds to the countrys gross domestic product by the end of \u003cTWO_THOUSAND\u003e and to support more than \u003cONE_TEN_THOUSAND\u003e jobs at british businesses the project represents a step up in the pace of amazons investment in britain since \u003cTWO_THOUSAND\u003e aws has invested \u003cTHREE_\u003e billion pounds in facilities in london and manchester our team that builds our data centres globally take into account multiple levers that they have to look at before they can decide where to put data centres from power to water to the local environment tanuja randery a managing director at aws told reuters she singled out use of artificial intelligence as among the factors driving demand for cloud services","timestamp":"2024-09-11T15:56:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}