{"url":"https://economictimes.indiatimes.com/tech/technology/bridging-the-gap-between-msmes-and-b2b-commerce-how-solv-is-driving-innovation-under-amit-bansals-leadership/articleshow/113428321.cms","title":"Bridging the gap between MSMEs and B2B commerce: How Solv is driving innovation under Amit Bansal’s leadership","description":"Solv, a B2B digital marketplace led by Amit Bansal, addresses the challenges faced by India's MSMEs. Launched in 2021, Solv connects small businesses with verified suppliers and integrates financial solutions to simplify procurement and access to credit. The platform aims to empower MSMEs by providing a comprehensive digital ecosystem.","content":"In India, where over 63 million MSMEs* (Micro, Small, and Medium Enterprises) contribute significantly to the economy, these small businesses face a persistent set of challenges: fragmented supply chains, limited access to affordable procurement, and a lack of working capital. For many MSMEs, these obstacles hinder growth, making it difficult for them to compete in a rapidly changing marketplace.Solv, a leading B2B digital marketplace, is tackling these issues head-on. Under the leadership of Amit Bansal, Solv has positioned itself as a solution for MSMEs struggling with procurement inefficiencies and limited access to credit. By providing a seamless platform that connects small businesses with verified suppliers, simplifying procurement, and integrating financial solutions, Solv is not just another marketplace — it's an ecosystem designed to empower and support India’s MSMEs.Launched in 2021, Solv aims to help MSMEs break free from traditional supply chain bottlenecks and financial limitations that have long held them back, enabling them to thrive and grow in a competitive business landscape.After decades of leadership roles at companies like Reliance and Flipkart, and his own venture, EZMall.com, Bansal realised that while MSMEs are the backbone of India’s economy, no one was directly solving the issues hindering their growth. Reflecting on his interactions with numerous MSME owners, Bansal said, “We met thousands of MSMEs during our previous journeys. During those interactions, we realised that most of them struggle with procurement of products at the right prices, while manufacturers struggle to grow their businesses as they are too dependent on intermediaries.”This understanding fuelled Solv’s unique business model. Unlike traditional platforms, Solv operates on an asset-light framework, meaning it does not hold inventory, but facilitates seamless connections between buyers and sellers. This allows MSMEs to access a vast and diversified catalogue without the limitations and costs associated with inventory management. Bansal emphasised the importance of this approach, explaining, “Being asset-light empowers us to offer more choices to MSMEs, reduce working capital requirements, and serve them in a cost-efficient manner. We can scale faster and enter more markets without the hurdles of managing large inventories.”","cleaned_content":"in india where over \u003cSIX_TEN\u003e million msmes micro small and medium enterprises contribute significantly to the economy these small businesses face a persistent set of challenges fragmented supply chains limited access to affordable procurement and a lack of working capital for many msmes these obstacles hinder growth making it difficult for them to compete in a rapidly changing marketplace solv a leading b2b digital marketplace is tackling these issues head on under the leadership of amit bansal solv has positioned itself as a solution for msmes struggling with procurement inefficiencies and limited access to credit by providing a seamless platform that connects small businesses with verified suppliers simplifying procurement and integrating financial solutions solv is not just another marketplace its an ecosystem designed to empower and support india s msmes launched in \u003cTWO_THOUSAND\u003e solv aims to help msmes break free from traditional supply chain bottlenecks and financial limitations that have long held them back enabling them to thrive and grow in a competitive business landscape after decades of leadership roles at companies like reliance and flipkart and his own venture ezmall com bansal realised that while msmes are the backbone of india s economy no one was directly solving the issues hindering their growth reflecting on his interactions with numerous msme owners bansal said we met thousands of msmes during our previous journeys during those interactions we realised that most of them struggle with procurement of products at the right prices while manufacturers struggle to grow their businesses as they are too dependent on intermediaries this understanding fuelled solv s unique business model unlike traditional platforms solv operates on an asset light framework meaning it does not hold inventory but facilitates seamless connections between buyers and sellers this allows msmes to access a vast and diversified catalogue without the limitations and costs associated with inventory management bansal emphasised the importance of this approach explaining being asset light empowers us to offer more choices to msmes reduce working capital requirements and serve them in a cost efficient manner we can scale faster and enter more markets without the hurdles of managing large inventories","timestamp":"2024-09-17T17:36:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}