{"url":"https://economictimes.indiatimes.com/tech/technology/google-says-it-will-rethink-its-plans-for-a-big-data-center-in-chile-over-water-worries/articleshow/113449529.cms","title":"Google says it will rethink its plans for a big data center in Chile over water worries","description":"The U.S. technology company first obtained permits in 2020 to construct the vast project in Chile's capital, Santiago, as demand for the server farms skyrocketed across the globe, fueled by a surge in cloud-based technologies and a craze for generative AI.","content":"Google on Tuesday said it would halt plans to develop a major $200 million data center in Chile to address environmental concerns, a decision reflecting growing worries about the impact of power-thirsty projects around the world.  The U.S. technology company first obtained permits in 2020 to construct the vast project in Chile's capital, Santiago, as demand for the server farms skyrocketed across the globe, fueled by a surge in cloud-based technologies and a craze for generative AI.  But months after a Chilean court partially reversed the center's authorization over water usage concerns, Google announced Tuesday that it would revise the project to comply with more stringent environmental requirements and change its water-intensive cooling system. \"A new process will start from scratch,\" Google said in its statement. \"Sustainability is at the heart of everything we do, and the way we design and manage our data centers is no exception.\"  Community complaints in the drought-stricken South American nation over the air-conditioned computer farm's energy and water usage sharpened government scrutiny and prompted a local court to temporarily revoke the project's authorization in February. ","cleaned_content":"google on tuesday said it would halt plans to develop a major \u003cTWO_HUNDRED\u003e million data center in chile to address environmental concerns a decision reflecting growing worries about the impact of power thirsty projects around the world the u s technology company first obtained permits in \u003cTWO_THOUSAND\u003e to construct the vast project in chiles capital santiago as demand for the server farms skyrocketed across the globe fueled by a surge in cloud based technologies and a craze for generative ai but months after a chilean court partially reversed the centers authorization over water usage concerns google announced tuesday that it would revise the project to comply with more stringent environmental requirements and change its water intensive cooling system a new process will start from scratch google said in its statement sustainability is at the heart of everything we do and the way we design and manage our data centers is no exception community complaints in the drought stricken south american nation over the air conditioned computer farms energy and water usage sharpened government scrutiny and prompted a local court to temporarily revoke the projects authorization in february","timestamp":"2024-09-18T12:52:00+05:30","market_timestamp":"2024-09-18T12:52:00+05:30","off_market_hours":false}