{"url":"https://economictimes.indiatimes.com/tech/technology/semi-iesa-join-hands-to-boost-semiconductor-ecosystem-in-india/articleshow/113280402.cms","title":"SEMI, IESA join hands to boost semiconductor ecosystem in India","description":"SEMI and IESA have formed a strategic partnership to enhance the semiconductor industry ecosystem in India. This collaboration aims to strengthen supply chain resilience and promote joint policy advocacy efforts with the government. The agreement was signed during Semicon India 2024, positioning India as a potential global semiconductor powerhouse.","content":"Global semiconductor body SEMI and its peer IESA have announced a strategic agreement to boost the industry ecosystem in India, a joint statement said. As part of the agreement, the Indian Electronics and Semiconductor Association (IESA) will become part of the SEMI-- the organiser of Semicon events including Semicon India.  \"This partnership will help SEMI grow a strong presence in this critical emerging market and enable both organisations to identify tangible strategies that leverage our combined strengths to enhance supply chain resilience,\" Ajit Manocha, President and CEO, SEMI said.  The agreement was signed on the sidelines of Semicon India 2024, the statement said on Wednesday.  This agreement will also pave the way for joint policy advocacy efforts, with IESA and SEMI working closely with both Central and State governments to drive incentives for product development and manufacturing, leveraging key programmes such as the Production Linked Incentive (PLI) and Design Linked Incentive (DLI) models, it said. ","cleaned_content":"global semiconductor body semi and its peer iesa have announced a strategic agreement to boost the industry ecosystem in india a joint statement said as part of the agreement the indian electronics and semiconductor association iesa will become part of the semi the organiser of semicon events including semicon india this partnership will help semi grow a strong presence in this critical emerging market and enable both organisations to identify tangible strategies that leverage our combined strengths to enhance supply chain resilience ajit manocha president and ceo semi said the agreement was signed on the sidelines of semicon india \u003cTWO_THOUSAND\u003e the statement said on wednesday this agreement will also pave the way for joint policy advocacy efforts with iesa and semi working closely with both central and state governments to drive incentives for product development and manufacturing leveraging key programmes such as the production linked incentive pli and design linked incentive dli models it said","timestamp":"2024-09-12T11:13:00+05:30","market_timestamp":"2024-09-12T11:13:00+05:30","off_market_hours":false}