{"url":"https://economictimes.indiatimes.com/tech/technology/mobikwiks-zaakpay-partners-with-meta-to-offer-payments-on-whatsapp/articleshow/113429422.cms","title":"Mobikwik’s Zaakpay partners with Meta to offer payments on WhatsApp","description":"Users can make payments using MobiKwik Wallet, ZIP and Pocket UPI, offering flexibility to suit individual payment preferences.","content":"Mobikwik’s payment gateway arm, Zaakpay, has integrated with Meta to offer an embedded payment solution within WhatsApp, providing businesses and consumers access to multiple payment options, including credit and debit cards, Unified Payments Interface (UPI) and digital wallets.Users can make payments using MobiKwik Wallet, ZIP and Pocket UPI, offering flexibility to suit individual payment preferences.This integration enables micro, small, and medium enterprises (MSMEs) to expand their reach by tapping into WhatsApp’s vast user base, especially in tier-II and tier-III cities. It also ensures secure payments directly within WhatsApp chats, enhancing both customer convenience and business efficiency.“By combining Zaakpay’s secure payment gateway with WhatsApp’s vast user base, we aim to unlock immense potential in India’s hinterlands. We are forging an ecosystem where shopping, payments and business engagement happen seamlessly in one place,” said Harvinder Singh Chadha, business head, ZaakPay.Zaakpay allows businesses to accept payments across multiple modes, including credit and debit cards, UPI, net banking, digital wallets and Pay Later options. The gateway’s suite includes online checkouts, payment links and QR code-based payments.","cleaned_content":"mobikwik s payment gateway arm zaakpay has integrated with meta to offer an embedded payment solution within whatsapp providing businesses and consumers access to multiple payment options including credit and debit cards unified payments interface upi and digital wallets users can make payments using mobikwik wallet zip and pocket upi offering flexibility to suit individual payment preferences this integration enables micro small and medium enterprises msmes to expand their reach by tapping into whatsapp s vast user base especially in tier ii and tier iii cities it also ensures secure payments directly within whatsapp chats enhancing both customer convenience and business efficiency by combining zaakpay s secure payment gateway with whatsapp s vast user base we aim to unlock immense potential in india s hinterlands we are forging an ecosystem where shopping payments and business engagement happen seamlessly in one place said harvinder singh chadha business head zaakpay zaakpay allows businesses to accept payments across multiple modes including credit and debit cards upi net banking digital wallets and pay later options the gateway s suite includes online checkouts payment links and qr code based payments","timestamp":"2024-09-17T18:16:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}