{"url":"https://economictimes.indiatimes.com/tech/technology/google-urges-tribunal-to-throw-out-9-3-billion-uk-lawsuit-over-search-dominance/articleshow/113462869.cms","title":"Google urges tribunal to throw out $9.3 billion UK lawsuit over search 'dominance'","description":"The lawsuit - valued at up to 7 billion pounds ($9.3 billion) - is the latest case focusing on the business practices of Google, which is currently facing a major antitrust trial in the United States over its online advertising business.","content":"Google parent Alphabet on Wednesday asked a London tribunal to throw out a mass lawsuit that accuses the tech giant of abusing its dominance in the online search market. The lawsuit - valued at up to 7 billion pounds ($9.3 billion) - is the latest case focusing on the business practices of Google, which is currently facing a major antitrust trial in the United States over its online advertising business. It is also one of several multibillion-pound cases to have been filed at Britain's Competition Appeal Tribunal in recent years, including a similar case against Google for allegedly abusing its dominance in the online advertising market. Consumer rights campaigner and the lawsuit's class representative Nikki Stopford argues Google's dominance allows it to increase businesses' costs for search advertising services which are then passed on to consumers. Part of the lawsuit relies on the more than 4-billion-euro ($4.5 billion) fine levied on Google by the European Commission in 2018 for imposing restrictions on manufacturers of Android mobile devices, a decision being appealed by the tech company.","cleaned_content":"google parent alphabet on wednesday asked a london tribunal to throw out a mass lawsuit that accuses the tech giant of abusing its dominance in the online search market the lawsuit valued at up to \u003cSEVEN_\u003e billion pounds \u003cNINE_\u003e billion is the latest case focusing on the business practices of google which is currently facing a major antitrust trial in the united states over its online advertising business it is also one of several multibillion pound cases to have been filed at britains competition appeal tribunal in recent years including a similar case against google for allegedly abusing its dominance in the online advertising market consumer rights campaigner and the lawsuits class representative nikki stopford argues googles dominance allows it to increase businesses costs for search advertising services which are then passed on to consumers part of the lawsuit relies on the more than \u003cFOUR_\u003e billion euro \u003cFOUR_\u003e billion fine levied on google by the european commission in \u003cTWO_THOUSAND\u003e for imposing restrictions on manufacturers of android mobile devices a decision being appealed by the tech company","timestamp":"2024-09-18T19:01:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}