{"url":"https://economictimes.indiatimes.com/tech/technology/two-men-stole-230-million-in-cryptocurrency-and-went-on-a-spending-spree-us-says/articleshow/113552164.cms","title":"Two men stole $230 million in cryptocurrency and went on a spending spree, US says","description":"The men, Malone Lam, 20, and Jeandiel Serrano, 21, conspired last month to steal the cryptocurrency funds from a person in Washington, D.C., which they then laundered through a number of exchanges and mixing services, according to the U.S. Attorney's Office for the District of Columbia.","content":"Two men have been charged with stealing $230 million worth of cryptocurrency that they used to go on a lavish spending spree involving travel, nightclubs, luxury cars, jewelry and palatial rental properties in Los Angeles and Miami before they were caught, federal prosecutors said. The men, Malone Lam, 20, and Jeandiel Serrano, 21, conspired last month to steal the cryptocurrency funds from a person in Washington, D.C., which they then laundered through a number of exchanges and mixing services, according to the U.S. Attorney's Office for the District of Columbia. After disguising their theft by spreading the money among several cryptocurrency exchanges and mixing services, the authorities said, the men went on their spending spree. Lam, a citizen of Singapore who operated under aliases including \"Anne Hathaway,\" and Serrano, who went by \"VersaceGod,\" were arrested by the FBI on Wednesday. In an indictment unsealed Thursday, Lam and Serrano were charged with conspiracy to commit wire fraud and money laundering.","cleaned_content":"two men have been charged with stealing \u003cTWO_HUNDRED\u003e million worth of cryptocurrency that they used to go on a lavish spending spree involving travel nightclubs luxury cars jewelry and palatial rental properties in los angeles and miami before they were caught federal prosecutors said the men malone lam \u003cTWO_TEN\u003e and jeandiel serrano \u003cTWO_TEN\u003e conspired last month to steal the cryptocurrency funds from a person in washington d c which they then laundered through a number of exchanges and mixing services according to the u s attorneys office for the district of columbia after disguising their theft by spreading the money among several cryptocurrency exchanges and mixing services the authorities said the men went on their spending spree lam a citizen of singapore who operated under aliases including anne hathaway and serrano who went by versacegod were arrested by the fbi on wednesday in an indictment unsealed thursday lam and serrano were charged with conspiracy to commit wire fraud and money laundering","timestamp":"2024-09-21T17:58:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}