{"url":"https://economictimes.indiatimes.com/tech/technology/disney-to-stop-using-salesforce-owned-slack-after-hack-exposed-company-data/articleshow/113507210.cms","title":"Disney to stop using Salesforce-owned Slack after hack exposed company data","description":"Walt Disney plans to stop using Slack as its workplace collaboration tool after a hacking group leaked over a terabyte of company data online. CFO Hugh Johnston announced that most businesses would transition to new tools later this year. The data leak included computer code and details about unreleased projects.","content":"Walt Disney plans to transition away from its use of Slack as a companywide workplace collaboration system, after a hacking entity leaked online more than a terabyte of company data, according to a report in the Status media newsletter. Disney's CFO Hugh Johnston said most of the media and entertainment company's businesses would stop using the service later this year, the report said. Many teams have already started transitioning to streamlined enterprise-wide collaboration tools, according to the report. Disney and Salesforce's Slack did not immediately respond to Reuters requests for comment. Hacking group NullBulge had published data from thousands of Slack channels at the entertainment giant, including computer code and details about unreleased projects, the Wall Street Journal reported in July. The data spans more than 44 million messages from Disney's Slack workplace communications tool, WSJ reported earlier this month. The company had said in August it was investigating an unauthorized release of over a terabyte of data from one of its communication systems. NullBulge compromises software supply chains by exploiting code on GitHub and Hugging Face, collaborative coding platforms, and tricks users into downloading malicious files, as per SentinelOne's threat intelligence and malware analysis team. ","cleaned_content":"walt disney plans to transition away from its use of slack as a companywide workplace collaboration system after a hacking entity leaked online more than a terabyte of company data according to a report in the status media newsletter disneys cfo hugh johnston said most of the media and entertainment companys businesses would stop using the service later this year the report said many teams have already started transitioning to streamlined enterprise wide collaboration tools according to the report disney and salesforces slack did not immediately respond to reuters requests for comment hacking group nullbulge had published data from thousands of slack channels at the entertainment giant including computer code and details about unreleased projects the wall street journal reported in july the data spans more than \u003cFOUR_TEN\u003e million messages from disneys slack workplace communications tool wsj reported earlier this month the company had said in august it was investigating an unauthorized release of over a terabyte of data from one of its communication systems nullbulge compromises software supply chains by exploiting code on github and hugging face collaborative coding platforms and tricks users into downloading malicious files as per sentinelones threat intelligence and malware analysis team","timestamp":"2024-09-20T07:40:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}