{"url":"https://economictimes.indiatimes.com/tech/technology/dont-wait-in-line-get-your-iphone-16-delivered-in-minutes/articleshow/113517868.cms","title":"Don't wait in line, get your iPhone 16 delivered in minutes","description":"Starting today, you can order the iPhone 16 on quick-commerce platforms like Blinkit and BB Now for delivery within minutes. Blinkit has partnered with Unicorn Stores to offer this service in Delhi NCR, Mumbai, Pune, and Bengaluru. The base variant of the iPhone 16 is priced at Rs 79,900.","content":"You don't have to wait in line to buy an iPhone anymore. Starting today, order it on quick-commerce platforms like Blinkit and BB Now it will be delivered to your doorstep within minutes.Albinder Dhindsa, the co-founder and CEO of Blinkit, informed in a social media post on Friday that the company will deliver the iPhone 16 in Delhi, NCR, Mumbai, Pune, and Bengaluru on the very launch day of the iPhone. \"Get the all-new iPhone 16 delivered in 10 minutes! We've partnered with @UnicornAPR for the third year in a row, bringing the latest iPhone to Blinkit customers in Delhi NCR, Mumbai, Pune, Bengaluru (for now) -- on launch day! P.S - Unicorn is also providing discounts with select credit cards and EMI options are available too,\" said Dhindsa. Blinkit, known for delivering groceries and other essential items within minutes, is expanding its offerings to cater to the high-demand tech market. The company has collaborated with key Unicorn Stores and Apple retailers, to ensure the iPhone 16 is available to its users immediately on release. ","cleaned_content":"you dont have to wait in line to buy an iphone anymore starting today order it on quick commerce platforms like blinkit and bb now it will be delivered to your doorstep within minutes albinder dhindsa the co founder and ceo of blinkit informed in a social media post on friday that the company will deliver the iphone \u003cONE_TEN\u003e in delhi ncr mumbai pune and bengaluru on the very launch day of the iphone get the all new iphone \u003cONE_TEN\u003e delivered in \u003cONE_TEN\u003e minutes weve partnered with unicornapr for the third year in a row bringing the latest iphone to blinkit customers in delhi ncr mumbai pune bengaluru for now on launch day p s unicorn is also providing discounts with select credit cards and emi options are available too said dhindsa blinkit known for delivering groceries and other essential items within minutes is expanding its offerings to cater to the high demand tech market the company has collaborated with key unicorn stores and apple retailers to ensure the iphone \u003cONE_TEN\u003e is available to its users immediately on release","timestamp":"2024-09-20T13:22:00+05:30","market_timestamp":"2024-09-20T13:22:00+05:30","off_market_hours":false}