{"url":"https://economictimes.indiatimes.com/tech/technology/us-nuclear-plant-three-mile-island-to-reopen-to-power-microsoft/articleshow/113530847.cms","title":"US nuclear plant Three Mile Island to reopen to power Microsoft","description":"Microsoft will use this energy to support power grids in the mid-Atlantic states around Washington DC, a region considered an internet crossroads. This area faces severe strain from data centers' massive energy consumption, raising concerns about grid stability as AI demands increase.","content":"Three Mile Island, the site of America's worst nuclear accident, will restart operations to provide power to Microsoft, Constellation Energy announced Friday.The 20-year agreement involves restarting Unit 1, which \"operated at industry-leading levels of safety and reliability for decades before being shut down for economic reasons exactly five years ago,\" the company said in a statement.Unit 1 was not involved in the 1979 partial nuclear meltdown at the Pennsylvania site.Before its premature retirement in 2019, the plant could power over 800,000 average homes. Microsoft will use this energy to support power grids in the mid-Atlantic states around Washington DC, a region considered an internet crossroads. ","cleaned_content":"three mile island the site of americas worst nuclear accident will restart operations to provide power to microsoft constellation energy announced friday the \u003cTWO_TEN\u003e year agreement involves restarting unit \u003cONE_\u003e which operated at industry leading levels of safety and reliability for decades before being shut down for economic reasons exactly five years ago the company said in a statement unit \u003cONE_\u003e was not involved in the \u003cONE_THOUSAND\u003e partial nuclear meltdown at the pennsylvania site before its premature retirement in \u003cTWO_THOUSAND\u003e the plant could power over \u003cEIGHT_HUNDRED_THOUSAND\u003e average homes microsoft will use this energy to support power grids in the mid atlantic states around washington dc a region considered an internet crossroads","timestamp":"2024-09-20T20:47:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}