{"url":"https://economictimes.indiatimes.com/tech/technology/us-senate-committee-questions-tech-executives-about-election-threats/articleshow/113483069.cms","title":"US Senate committee questions tech executives about election threats","description":"\"There is a potential moment of peril ahead. Today we are 48 days away from the election... the most perilous moment will come, I think, 48 hours before the election,\" Microsoft President Brad Smith testified at the hearing, held by the U.S. Senate Intelligence Committee.","content":"U.S. lawmakers questioned tech executives on Wednesday about their preparations for battling foreign disinformation threats ahead of elections in November, with both the senators and executives identifying the 48 hours around Election Day as the most vulnerable time. \"There is a potential moment of peril ahead. Today we are 48 days away from the election... the most perilous moment will come, I think, 48 hours before the election,\" Microsoft President Brad Smith testified at the hearing, held by the U.S. Senate Intelligence Committee. Senator Mark Warner, who chairs the panel, agreed with Smith but said the 48 hours after the polls close on Nov. 5 could be \"equally if not more significant,\" especially if the election is close. Policy executives from Google and Meta, which owns Facebook, Instagram and WhatsApp, also testified at the hearing. Elon Musk's X was invited to testify but declined, several senators said. An X spokesperson said the reason was that the company's invited witness, former head of global affairs Nick Pickles, had resigned earlier this month.","cleaned_content":"u s lawmakers questioned tech executives on wednesday about their preparations for battling foreign disinformation threats ahead of elections in november with both the senators and executives identifying the \u003cFOUR_TEN\u003e hours around election day as the most vulnerable time there is a potential moment of peril ahead today we are \u003cFOUR_TEN\u003e days away from the election the most perilous moment will come i think \u003cFOUR_TEN\u003e hours before the election microsoft president brad smith testified at the hearing held by the u s senate intelligence committee senator mark warner who chairs the panel agreed with smith but said the \u003cFOUR_TEN\u003e hours after the polls close on nov \u003cFIVE_\u003e could be equally if not more significant especially if the election is close policy executives from google and meta which owns facebook instagram and whatsapp also testified at the hearing elon musks x was invited to testify but declined several senators said an x spokesperson said the reason was that the companys invited witness former head of global affairs nick pickles had resigned earlier this month","timestamp":"2024-09-19T12:52:00+05:30","market_timestamp":"2024-09-19T12:52:00+05:30","off_market_hours":false}