{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-top-court-lifts-starlink-x-bank-account-freeze-after-3-million-transfer/articleshow/113343041.cms","title":"Brazil top court lifts Starlink, X bank account freeze after $3 million transfer","description":"Brazil's Supreme Court Justice Alexandre de Moraes has lifted the freeze on Starlink and X bank accounts after transferring 18.35 million reais to the national coffers. The amount covers fines owed by X amid a dispute between Elon Musk and Moraes over compliance with court orders related to blocking certain accounts and naming a local legal representative.","content":"Brazil's Supreme Court Justice Alexandre de Moraes decided to lift freezes previously imposed on Starlink and X bank accounts after ordering the transfer of 18.35 million reais ($3.3 million) from the accounts to the national coffers. According to a court statement on Friday, the lift was ordered because the amount transferred to Brazil reached the total X owed the country in fines, which had been imposed amid a feud between billionaire owner Elon Musk and Moraes. The judge has ordered access to the X social media platform blocked in Brazil, its sixth-biggest market, after X failed to comply with orders to block some accounts accused of spreading \"fake news\" and hate messages that the judge said were a threat to democracy. Musk, in turn, has challenged those orders, calling them \"censorship.\" X also failed to name a local legal representative as required by Brazilian law and ignored a deadline for compliance with court orders, which led Moraes to order the freezing of Starlink's accounts in the country for possible use to cover fines owed by X. According to the Supreme Court, Moraes has not withdrawn his decision to block access to X in Brazil because it said the issue around a lack of legal representation has not been addressed, while content removals ordered by the judge have not been fulfilled.","cleaned_content":"brazils supreme court justice alexandre de moraes decided to lift freezes previously imposed on starlink and x bank accounts after ordering the transfer of \u003cONE_TEN\u003e million reais \u003cTHREE_\u003e million from the accounts to the national coffers according to a court statement on friday the lift was ordered because the amount transferred to brazil reached the total x owed the country in fines which had been imposed amid a feud between billionaire owner elon musk and moraes the judge has ordered access to the x social media platform blocked in brazil its sixth biggest market after x failed to comply with orders to block some accounts accused of spreading fake news and hate messages that the judge said were a threat to democracy musk in turn has challenged those orders calling them censorship x also failed to name a local legal representative as required by brazilian law and ignored a deadline for compliance with court orders which led moraes to order the freezing of starlinks accounts in the country for possible use to cover fines owed by x according to the supreme court moraes has not withdrawn his decision to block access to x in brazil because it said the issue around a lack of legal representation has not been addressed while content removals ordered by the judge have not been fulfilled","timestamp":"2024-09-14T12:13:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}