{"url":"https://economictimes.indiatimes.com/tech/technology/banks-step-up-vigil-on-fraudulent-account-opening-via-digital-banking-channels/articleshow/113465252.cms","title":"Banks step up vigil on fraudulent account opening via digital banking channels","description":"“Some of the largest banks in the country could be processing around Rs 300-400 crore worth of fraudulent transactions through mule accounts on a monthly basis; for mid-tier banks, the amount could be around Rs 50-100 crore,\" a senior banker with a private sector bank said on the condition of anonymity.","content":"Banks are working on introducing stringent background checks on customers looking to open accounts via digital banking channels. This is a practice usually followed by lenders while opening credit accounts, but is now being replicated for deposit accounts too, according to three people in the know.This comes at a time when banks are trying to weed out mule accounts —accounts which receive funds from illegal sources or through fraudulent transactions — from their systems. Reserve Bank of India governor Shaktikanta Das had at a July 3 meeting urged bank chief executives to step up their fight against such accounts.“Some of the largest banks in the country could be processing around Rs 300-400 crore worth of fraudulent transactions through mule accounts on a monthly basis; for mid-tier banks, the amount could be around Rs 50-100 crore. This is becoming a serious problem for banks as digital payments become more ubiquitous,” a senior banker with a private sector bank said on the condition of anonymity.  ","cleaned_content":"banks are working on introducing stringent background checks on customers looking to open accounts via digital banking channels this is a practice usually followed by lenders while opening credit accounts but is now being replicated for deposit accounts too according to three people in the know this comes at a time when banks are trying to weed out mule accounts accounts which receive funds from illegal sources or through fraudulent transactions from their systems reserve bank of india governor shaktikanta das had at a july \u003cTHREE_\u003e meeting urged bank chief executives to step up their fight against such accounts some of the largest banks in the country could be processing around rs \u003cTHREE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e crore worth of fraudulent transactions through mule accounts on a monthly basis for mid tier banks the amount could be around rs \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e crore this is becoming a serious problem for banks as digital payments become more ubiquitous a senior banker with a private sector bank said on the condition of anonymity","timestamp":"2024-09-19T06:00:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}