{"url":"https://economictimes.indiatimes.com/tech/technology/terraform-labs-approved-for-bankruptcy-wind-down-after-us-sec-settlement/articleshow/113509284.cms","title":"Terraform Labs approved for bankruptcy wind-down after US SEC settlement","description":"Terraform, which filed for bankruptcy in January, agreed to a $4.47 billion SEC settlement after a jury in Manhattan found the company liable in April for defrauding investors.","content":"Terraform Labs received court approval on Thursday to wind down its operations in bankruptcy after agreeing to settle a U.S. Securities and Exchange Commission lawsuit accusing the company of defrauding cryptocurrency investors who lost an estimated $40 billion when the TerraUSD and Luna tokens collapsed in 2022.U.S. Bankruptcy Judge Brendan Shannon approved Terraform's bankruptcy plan at a hearing in Wilmington, Delaware, calling it a \"welcome alternative\" to further litigation over the investor losses.Terraform, which filed for bankruptcy in January, agreed to a $4.47 billion SEC settlement after a jury in Manhattan found the company liable in April for defrauding investors.The SEC will collect little, if anything, on that settlement amount because it agreed to be paid only after Terraform satisfies crypto loss claims as part of its bankruptcy wind-down. The company said it is currently \"impossible to estimate\" the total value of crypto losses that will be eligible to be paid during the liquidation.Terraform estimated that it will be able to pay between $184.5 million and $442.2 million to crypto purchasers and other stakeholders as part of its bankruptcy liquidation.","cleaned_content":"terraform labs received court approval on thursday to wind down its operations in bankruptcy after agreeing to settle a u s securities and exchange commission lawsuit accusing the company of defrauding cryptocurrency investors who lost an estimated \u003cFOUR_TEN\u003e billion when the terrausd and luna tokens collapsed in \u003cTWO_THOUSAND\u003e u s bankruptcy judge brendan shannon approved terraforms bankruptcy plan at a hearing in wilmington delaware calling it a welcome alternative to further litigation over the investor losses terraform which filed for bankruptcy in january agreed to a \u003cFOUR_\u003e billion sec settlement after a jury in manhattan found the company liable in april for defrauding investors the sec will collect little if anything on that settlement amount because it agreed to be paid only after terraform satisfies crypto loss claims as part of its bankruptcy wind down the company said it is currently impossible to estimate the total value of crypto losses that will be eligible to be paid during the liquidation terraform estimated that it will be able to pay between \u003cONE_HUNDRED\u003e million and \u003cFOUR_HUNDRED\u003e million to crypto purchasers and other stakeholders as part of its bankruptcy liquidation","timestamp":"2024-09-20T09:07:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}