{"url":"https://economictimes.indiatimes.com/tech/technology/qcomm-data-may-turn-key-input-for-new-gdp-maths/articleshow/113379736.cms","title":"Qcomm data may turn key input for new GDP maths","description":"The government is considering using data from quick commerce platforms like Zepto, Blinkit, Instamart, and BigBasket to understand consumption patterns and economic activity. Quick commerce now accounts for 5-6% of household grocery spending and is growing rapidly. The Ministry of Statistics plans to revise the base year for national accounts to 2022-23 or 2023-24.","content":"New Delhi: The government is considering tapping into purchases made through quick commerce platforms such as Zepto, Blinkit, Instamart and BigBasket to understand changes in consumption patterns and pace of economic activity as part of an exercise to revise the base year for national accounts and various other official statistics, said officials.This comes as quick commerce platforms now account for 5-6% of overall household grocery spending in the country, according to some estimates. \"We will have to figure out ways to get data from such platforms. We will ask for it but it has to be anonymised,\" said an official, who did not wish to be identified. ","cleaned_content":"new delhi the government is considering tapping into purchases made through quick commerce platforms such as zepto blinkit instamart and bigbasket to understand changes in consumption patterns and pace of economic activity as part of an exercise to revise the base year for national accounts and various other official statistics said officials this comes as quick commerce platforms now account for \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e of overall household grocery spending in the country according to some estimates we will have to figure out ways to get data from such platforms we will ask for it but it has to be anonymised said an official who did not wish to be identified","timestamp":"2024-09-16T05:30:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}