{"url":"https://economictimes.indiatimes.com/tech/technology/eu-break-up-order-to-google-unlikely-for-now/articleshow/113332143.cms","title":"EU break-up order to Google unlikely for now","description":"European Union regulators are due to issue a decision in the coming months after antitrust chief Margrethe Vestager last year threatened to break up Google's lucrative adtech business.","content":"EU antitrust officials are considering ordering Alphabet's Google to end anti-competitive practices in its adtech business, but will not order a breakup as they had previously warned, people with direct knowledge of the matter said. European Union regulators are due to issue a decision in the coming months after antitrust chief Margrethe Vestager last year threatened to break up Google's lucrative adtech business. If this threat had been carried through, it would have been the harshest regulatory penalty to date against Google, after Vestager charged it with favouring its own advertising services. But in what would be a first for an antitrust case, competition officials will likely not issue a breakup order because of the complexity involved, the people said. A break-up order could come at a later stage if Google continues its anti-competitive practices, they said, pointing to a precedent setting case involving Microsoft two decades ago.","cleaned_content":"eu antitrust officials are considering ordering alphabets google to end anti competitive practices in its adtech business but will not order a breakup as they had previously warned people with direct knowledge of the matter said european union regulators are due to issue a decision in the coming months after antitrust chief margrethe vestager last year threatened to break up googles lucrative adtech business if this threat had been carried through it would have been the harshest regulatory penalty to date against google after vestager charged it with favouring its own advertising services but in what would be a first for an antitrust case competition officials will likely not issue a breakup order because of the complexity involved the people said a break up order could come at a later stage if google continues its anti competitive practices they said pointing to a precedent setting case involving microsoft two decades ago","timestamp":"2024-09-13T22:23:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}