{"url":"https://economictimes.indiatimes.com/tech/technology/spring-marketing-capital-picks-up-stake-in-agilitas-sports/articleshow/113325330.cms","title":"Spring Marketing Capital picks up stake in Agilitas Sports","description":"Agilitas has been expanding its core team and scaling operations over the past year. It is now focusing on marketing efforts with the new partnership.","content":"Investment firm Spring Marketing Capital has acquired an equity stake in sportswear and athleisure brand Agilitas Sports for an undisclosed amount.Agilitas, which has been expanding its core team and scaling operations over the past year, is now focusing on marketing efforts with the new partnership.\"This strategic partnership with Spring Marketing Capital stands apart because it's not just about capital infusion; it's about fostering strong brands from the ground up. With Spring’s expertise in strategic marketing and capital investment, we are confident to meet the growing demands of the Indian market and cater to our trusted consumers,\" said Abhishek Ganguly, CEO and cofounder of Agilitas Sports.In April 2023, ET reported that Agilitas acquired the India licence for Italian shoe brand Lotto for 40 years through a deal with WHP Global, Lotto’s parent company. The agreement gives Agilitas control over the manufacturing, design and sales of Lotto products in India, South Asia and Australia.In September last year, Agilitas acquired sports shoe manufacturer Mochiko in an all-cash deal.","cleaned_content":"investment firm spring marketing capital has acquired an equity stake in sportswear and athleisure brand agilitas sports for an undisclosed amount agilitas which has been expanding its core team and scaling operations over the past year is now focusing on marketing efforts with the new partnership this strategic partnership with spring marketing capital stands apart because its not just about capital infusion its about fostering strong brands from the ground up with spring s expertise in strategic marketing and capital investment we are confident to meet the growing demands of the indian market and cater to our trusted consumers said abhishek ganguly ceo and cofounder of agilitas sports in april \u003cTWO_THOUSAND\u003e et reported that agilitas acquired the india licence for italian shoe brand lotto for \u003cFOUR_TEN\u003e years through a deal with whp global lotto s parent company the agreement gives agilitas control over the manufacturing design and sales of lotto products in india south asia and australia in september last year agilitas acquired sports shoe manufacturer mochiko in an all cash deal","timestamp":"2024-09-13T17:10:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}