{"url":"https://economictimes.indiatimes.com/tech/technology/nxp-to-double-its-india-workforce-to-6000-in-five-years/articleshow/113269471.cms","title":"NXP to double its India workforce to 6,000+ in five years","description":"NXP CEO Kurt Sievers said the company will also invest $1 billion in the next five years to expand its research and development capabilities in India, both in the hardware and software segments.","content":"NXP Semiconductors plans to double its workforce in India to more than 6,000 over the next five years, the Dutch chip manufacturing and design company's chief executive, Kurt Sievers, told ET.The company will also invest $1 billion in the next five years to expand its research and development capabilities in India, both in the hardware and software segments, to work on leading devices and products such as a 5-nanometer chip it recently launched for the automotive segment, Sievers said. A majority of its expanded workforce will be design engineers who still constitute more than 80% of the company employees in India, the executive said during an interaction with ET on the sidelines of the Semicon India conference in Greater Noida.\"The most innovative products we design worldwide are co-designed in India at our Noida and Bangalore offices. So, it is not like India is doing legacy work for us. It is already at the forefront of the technology,\" he said.India, Sievers said, has made progress when it comes to the availability of raw talent by ensuring semiconductor training in colleges. This helps companies like NXP Semiconductors collaborate with these institutes.\"My big relief is that if we get college graduates straight away, that's the best we can do because then we embrace them early in the career and can raise them. We are committed to doing this,\" he said, adding that the company would also look to hire more women in time to come. Going ahead, India will be one of the countries where the company will aim to expand its offerings to include complete system solutions instead of one particular product or service, and work directly with original equipment manufacturers (OEMs), he said.","cleaned_content":"nxp semiconductors plans to double its workforce in india to more than \u003cSIX_THOUSAND\u003e over the next five years the dutch chip manufacturing and design companys chief executive kurt sievers told et the company will also invest \u003cONE_\u003e billion in the next five years to expand its research and development capabilities in india both in the hardware and software segments to work on leading devices and products such as a \u003cFIVE_\u003e nanometer chip it recently launched for the automotive segment sievers said a majority of its expanded workforce will be design engineers who still constitute more than \u003cEIGHT_TEN_PERCENT\u003e of the company employees in india the executive said during an interaction with et on the sidelines of the semicon india conference in greater noida the most innovative products we design worldwide are co designed in india at our noida and bangalore offices so it is not like india is doing legacy work for us it is already at the forefront of the technology he said india sievers said has made progress when it comes to the availability of raw talent by ensuring semiconductor training in colleges this helps companies like nxp semiconductors collaborate with these institutes my big relief is that if we get college graduates straight away thats the best we can do because then we embrace them early in the career and can raise them we are committed to doing this he said adding that the company would also look to hire more women in time to come going ahead india will be one of the countries where the company will aim to expand its offerings to include complete system solutions instead of one particular product or service and work directly with original equipment manufacturers oems he said","timestamp":"2024-09-12T06:00:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}