{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-veteran-samir-kumar-to-replace-manish-tiwary-as-india-head-of-ecommerce-major/articleshow/113443305.cms","title":"Amazon veteran Samir Kumar to replace Manish Tiwary as India head","description":"Samir Kumar, an Amazon veteran, will replace Manish Tiwary as the country manager for India starting October 1. Kumar, who has been with Amazon since 1999, will also continue to lead Amazon’s consumer businesses in the Middle East, South Africa, and Turkey. This leadership change comes as Amazon prepares for the crucial festive season.","content":"Amazon veteran Samir Kumar will take charge as country manager for India, replacing Manish Tiwary who stepped down in August. Kumar will assume responsibility for the Indian market in addition to his current charter of leading Amazon’s consumer businesses in the Middle East, South Africa and Turkey.Kumar is currently working closely with Tiwary on the transition and will assume full responsibility for India from October 1, according to a company statement.Kumar, who joined Amazon in 1999, was among key executives who visited India in 2013 to set up operations for the US ecommerce giant, working closely with Amit Agarwal, India head at the time and currently senior vice president for emerging markets at Amazon. The senior leadership churn at Amazon India comes just ahead of the crucial ecommerce festive season, which is set to start from September 27 and will see the company face its bigger rival Walmart-owned Flipkart.Amazon is also yet to make a formal entry into the red-hot quick commerce sector, currently the fastest growing consumer internet business in India. ET reported on August 28 that the US etailer has set a target of the first quarter of 2025 to enter the quick commerce business even as it held deal talks with Swiggy, which runs the Instamart quick-commerce business. ","cleaned_content":"amazon veteran samir kumar will take charge as country manager for india replacing manish tiwary who stepped down in august kumar will assume responsibility for the indian market in addition to his current charter of leading amazon s consumer businesses in the middle east south africa and turkey kumar is currently working closely with tiwary on the transition and will assume full responsibility for india from october \u003cONE_\u003e according to a company statement kumar who joined amazon in \u003cONE_THOUSAND\u003e was among key executives who visited india in \u003cTWO_THOUSAND\u003e to set up operations for the us ecommerce giant working closely with amit agarwal india head at the time and currently senior vice president for emerging markets at amazon the senior leadership churn at amazon india comes just ahead of the crucial ecommerce festive season which is set to start from september \u003cTWO_TEN\u003e and will see the company face its bigger rival walmart owned flipkart amazon is also yet to make a formal entry into the red hot quick commerce sector currently the fastest growing consumer internet business in india et reported on august \u003cTWO_TEN\u003e that the us etailer has set a target of the first quarter of \u003cTWO_THOUSAND\u003e to enter the quick commerce business even as it held deal talks with swiggy which runs the instamart quick commerce business","timestamp":"2024-09-18T12:43:00+05:30","market_timestamp":"2024-09-18T12:43:00+05:30","off_market_hours":false}