{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-shares-rise-3-near-record-high-on-ubs-optimism-for-growth/articleshow/113281392.cms","title":"Zomato shares zoom 4% to fresh all-time high as UBS reaffirms buy rating","description":"Zomato Share Price: Shares of Zomato surged 4% to a new high of Rs 283.60 after UBS maintained a buy rating with a target price of Rs 320. The growth optimism follows Zomato's acquisition of Paytm's ticketing business and positive outlooks from Jefferies and JP Morgan. The stock has risen 15.6% over six days.","content":"Shares of Zomato rose 4% on Thursday to reach a new all-time high of Rs 283.60 after global brokerage firm UBS maintained a buy rating on the stock with a target price of Rs 320, driven by optimism about the company's growth.UBS in its note stated that the industry volumes are growing at about 2.5% on a month-on-month (MoM) basis in Aug '24, which has been adjusted for the number of days.Zomato vs Swiggy is a push-and-pull scenario that is continuing into Q2FY25, said the global brokerage firm as it estimates Zomato's Q2FY25 GMV growth at 7% quarter-on-quarter (QoQ).Shares of Zomato rose for the sixth straight session. In these last six days, the shares have increased by 15.6%.The optimism started building when Zomato entered into a deal with Paytm to acquire its events and movies ticketing business which was recently completed and following this, global brokerage firms such as Jefferies and JP Morgan have also turned positive on the stock.","cleaned_content":"shares of zomato rose \u003cFOUR_PERCENT\u003e on thursday to reach a new all time high of rs \u003cTWO_HUNDRED\u003e after global brokerage firm ubs maintained a buy rating on the stock with a target price of rs \u003cTHREE_HUNDRED\u003e driven by optimism about the companys growth ubs in its note stated that the industry volumes are growing at about \u003cTWO_PERCENT\u003e on a month on month mom basis in aug 24 which has been adjusted for the number of days zomato vs swiggy is a push and pull scenario that is continuing into q2fy25 said the global brokerage firm as it estimates zomatos q2fy25 gmv growth at \u003cSEVEN_PERCENT\u003e quarter on quarter qoq shares of zomato rose for the sixth straight session in these last six days the shares have increased by \u003cONE_TEN_PERCENT\u003e the optimism started building when zomato entered into a deal with paytm to acquire its events and movies ticketing business which was recently completed and following this global brokerage firms such as jefferies and jp morgan have also turned positive on the stock","timestamp":"2024-09-12T11:23:00+05:30","market_timestamp":"2024-09-12T11:23:00+05:30","off_market_hours":false}