{"url":"https://economictimes.indiatimes.com/tech/technology/youtube-launches-hype-new-tool-for-new-creators/articleshow/113480225.cms","title":"YouTube launches Hype, new tool for emerging creators","description":"YouTube's new 'Hype' feature aims to help creators with under 500,000 subscribers grow by connecting them with new audiences. The feature allows videos to be hyped and ranked on a weekly leaderboard. YouTube also introduced tools for managing AI-generated content and announced significant economic contributions from the creator economy.","content":"In its annual event, Made on YouTube, the social media platform announced a new product called Hype to help emerging creators grow by connecting them with new audiences. The update allows any creator with under 500,000 subscribers to hype (boost) the video if it has been out for not more than 7 days. It enables the creators to get featured on a new leaderboard ranking on the weekly top 100 hyped videos with a frequency of thrice a week per creator, the platform said in a blog.Earlier this month, YouTube launched new tools to help artists identify and control AI-generated videos that sound like them. This is already used to identify and manage copyright content. “We want to make sure that our role in supporting the amazing creator economy that exists here in India remains a positive one, a vibrant one, and that is really my top priority”, said YouTube CEO Neil Mohan, in a recent exclusive to ET.Hype is the outcome of a survey conducted with a sample of over 2,500 viewers aged 18-45 from parts of the world: US, Japan, and Germany. A significant majority of respondents, including a particularly high percentage of Gen Z, expressed a desire to contribute to the growth of smaller and medium-sized creators, as per a YouTube blog.","cleaned_content":"in its annual event made on youtube the social media platform announced a new product called hype to help emerging creators grow by connecting them with new audiences the update allows any creator with under \u003cFIVE_HUNDRED_THOUSAND\u003e subscribers to hype boost the video if it has been out for not more than \u003cSEVEN_\u003e days it enables the creators to get featured on a new leaderboard ranking on the weekly top \u003cONE_HUNDRED\u003e hyped videos with a frequency of thrice a week per creator the platform said in a blog earlier this month youtube launched new tools to help artists identify and control ai generated videos that sound like them this is already used to identify and manage copyright content we want to make sure that our role in supporting the amazing creator economy that exists here in india remains a positive one a vibrant one and that is really my top priority said youtube ceo neil mohan in a recent exclusive to et hype is the outcome of a survey conducted with a sample of over \u003cTWO_THOUSAND\u003e viewers aged \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e from parts of the world us japan and germany a significant majority of respondents including a particularly high percentage of gen z expressed a desire to contribute to the growth of smaller and medium sized creators as per a youtube blog","timestamp":"2024-09-19T14:38:00+05:30","market_timestamp":"2024-09-19T14:38:00+05:30","off_market_hours":false}