{"url":"https://economictimes.indiatimes.com/tech/technology/delhivery-alleges-ecom-express-misrepresented-data-ahead-of-ipo/articleshow/113322766.cms","title":"Delhivery accuses Ecom Express of misleading numbers in its draft IPO papers","description":"Ecom Express filed its draft papers with the capital markets regulator last month for an initial public offering of shares worth nearly Rs 2,600 crore. In its DRHP, Ecom Express had said it handled more than 514 million shipments in FY24 while Delhivery clocked 740 million.","content":"New-age ecommerce logistics firm Delhivery Friday said certain claims on operating metrics by its smaller rival and IPO-bound Ecom Express are misleading. Delhivery, in a filing to the BSE, said Warburg Pincus-backed Ecom Express \"misrepresented” reach and automation scale by declaring the number of pincodes not certified by India Post. This is a rare instance of a publicly-listed firm accusing an IPO-bound rival of misrepresenting facts. “Ecom Express double-counts the number of RTO (return to origin) shipments and hence it ends up inflating its volume on a like-to-like basis,” the Gurugram-based firm said, refuting claims made by Ecom Express in the DRHP. ‘Return to origin’ is a term used by logistics firms when a product is returned or the delivery is cancelled, and the goods go back to the seller. “Ecom Express double counts the number of RTO (return to origin) shipments and hence it ends up inflating its volume on a like to like basis,” the Gurugram-based firm said, refuting claims made by Ecom Express in its draft red herring prospectus (DRHP). Return to origin is a term used by logistics firms for when a product is returned or the delivery is cancelled and the goods goes back to the seller.","cleaned_content":"new age ecommerce logistics firm delhivery friday said certain claims on operating metrics by its smaller rival and ipo bound ecom express are misleading delhivery in a filing to the bse said warburg pincus backed ecom express misrepresented reach and automation scale by declaring the number of pincodes not certified by india post this is a rare instance of a publicly listed firm accusing an ipo bound rival of misrepresenting facts ecom express double counts the number of rto return to origin shipments and hence it ends up inflating its volume on a like to like basis the gurugram based firm said refuting claims made by ecom express in the drhp return to origin is a term used by logistics firms when a product is returned or the delivery is cancelled and the goods go back to the seller ecom express double counts the number of rto return to origin shipments and hence it ends up inflating its volume on a like to like basis the gurugram based firm said refuting claims made by ecom express in its draft red herring prospectus drhp return to origin is a term used by logistics firms for when a product is returned or the delivery is cancelled and the goods goes back to the seller","timestamp":"2024-09-13T20:01:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}