{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-collaborates-with-uks-metro-bank-for-digital-transformation/articleshow/113426262.cms","title":"Infosys collaborates with UK's Metro Bank for digital transformation","description":"The collaboration will utilise Infosys Topaz, the firm's AI-first offerings, to enhance Metro Bank's digital capabilities, improve automation, refine data, and embed further AI capabilities, as per a regulatory filing.","content":"New Delhi, Indian IT major Infosys on Tuesday said it has entered into a long-term collaboration with British community bank Metro Bank to digitise the bank's operations. The collaboration will utilise Infosys Topaz, the firm's AI-first offerings, to enhance Metro Bank's digital capabilities, improve automation, refine data, and embed further AI capabilities.  This will assist the bank in increasing efficiency and saving costs, a regulatory filing said.  \"At the end of this transformation, we will be a very different business, but the true essence of Metro Bank will remain the same -- a high-quality service organisation putting customers centre-stage,\" Metro Bank CEO Daniel Frumkin said.  The bank expects to deliver 80 million pounds of annualised cost savings this year across multiple initiatives, as it progresses towards the target of reaching mid-to-high teen return on tangible equity by 2027, he added.  \"Our shared goal is to continually enhance customer engagement, community focus, and the integration of physical and digital experiences, thereby accelerating growth and value creation for Metro Bank,\" Dennis Gada, EVP and Global Head of Banking and Financial Services, Infosys, said. ","cleaned_content":"new delhi indian it major infosys on tuesday said it has entered into a long term collaboration with british community bank metro bank to digitise the banks operations the collaboration will utilise infosys topaz the firms ai first offerings to enhance metro banks digital capabilities improve automation refine data and embed further ai capabilities this will assist the bank in increasing efficiency and saving costs a regulatory filing said at the end of this transformation we will be a very different business but the true essence of metro bank will remain the same a high quality service organisation putting customers centre stage metro bank ceo daniel frumkin said the bank expects to deliver \u003cEIGHT_TEN\u003e million pounds of annualised cost savings this year across multiple initiatives as it progresses towards the target of reaching mid to high teen return on tangible equity by \u003cTWO_THOUSAND\u003e he added our shared goal is to continually enhance customer engagement community focus and the integration of physical and digital experiences thereby accelerating growth and value creation for metro bank dennis gada evp and global head of banking and financial services infosys said","timestamp":"2024-09-17T16:32:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}