{"url":"https://economictimes.indiatimes.com/tech/technology/qualcomm-asked-chip-rival-intel-if-it-would-consider-a-sale/articleshow/113539308.cms","title":"Qualcomm asked chip rival Intel if it would consider a sale","description":"Qualcomm has not yet made an official offer for Intel, one of the people said, and the obstacles to a deal remain steep. Any deal would likely draw significant regulatory scrutiny, given the mammoth size and national security importance of both chip companies. It is unclear whether regulators would allow Qualcomm to buy Intel without taking on its struggling foundry business, and it remains equally unclear whether Qualcomm would want to take on that complex endeavor.","content":"Chipmaker Qualcomm has approached its rival Intel in recent days about the possibility of acquiring the slumping Silicon Valley giant, two people familiar with the matter said Friday, requesting anonymity because the talks were confidential. Qualcomm has not yet made an official offer for Intel, one of the people said, and the obstacles to a deal remain steep. Any deal would likely draw significant regulatory scrutiny, given the mammoth size and national security importance of both chip companies. It is unclear whether regulators would allow Qualcomm to buy Intel without taking on its struggling foundry business, and it remains equally unclear whether Qualcomm would want to take on that complex endeavor. A deal would also be costly. Intel, which has seen its shares fall nearly 40% over the last year, has a market capitalization of $93 billion. Qualcomm, which has seen its shares rise 55%, has a market value of $169 billion. Qualcomm and Intel, through spokespeople, both declined to comment. The Wall Street Journal earlier reported Qualcomm's approach. That any chipmaking rival would consider trying to buy Intel would have been inconceivable a decade ago. But years of management issues and whiffs on technology transitions have weakened what was once one of Silicon Valley's most powerful companies.","cleaned_content":"chipmaker qualcomm has approached its rival intel in recent days about the possibility of acquiring the slumping silicon valley giant two people familiar with the matter said friday requesting anonymity because the talks were confidential qualcomm has not yet made an official offer for intel one of the people said and the obstacles to a deal remain steep any deal would likely draw significant regulatory scrutiny given the mammoth size and national security importance of both chip companies it is unclear whether regulators would allow qualcomm to buy intel without taking on its struggling foundry business and it remains equally unclear whether qualcomm would want to take on that complex endeavor a deal would also be costly intel which has seen its shares fall nearly \u003cFOUR_TEN_PERCENT\u003e over the last year has a market capitalization of \u003cNINE_TEN\u003e billion qualcomm which has seen its shares rise \u003cFIVE_TEN_PERCENT\u003e has a market value of \u003cONE_HUNDRED\u003e billion qualcomm and intel through spokespeople both declined to comment the wall street journal earlier reported qualcomms approach that any chipmaking rival would consider trying to buy intel would have been inconceivable a decade ago but years of management issues and whiffs on technology transitions have weakened what was once one of silicon valleys most powerful companies","timestamp":"2024-09-21T07:19:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}