{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-cmo-quits-thea-hayden-to-take-interim-position/articleshow/113500669.cms","title":"Cognizant CMO quits, Thea Hayden to take interim position","description":"Thea Hayden, senior vice president of Global Marketing, a 25-year marketing veteran and seasoned Cognizant executive, will serve as the interim Chief Marketing Officer.","content":"Global technology services giant Cognizant saw yet another senior level exit with its chief marketing officer, Gaurav Chand, being the latest to resign.Thea Hayden, senior vice president of Global Marketing, a 25-year marketing veteran and seasoned Cognizant executive, will serve as the interim Chief Marketing Officer.The US headquartered firm has mandated executive search firms to find Chand's successor, the company confirmed to ET.\"We thank Gaurav Chand for his leadership since 2019, during which he oversaw all aspects of Cognizant’s global marketing. Senior Vice President of Global Marketing Thea Hayden, a 25-year marketing veteran and seasoned Cognizant executive, will serve as our interim Chief Marketing Officer while a global search for a permanent CMO is conducted. Her deep expertise and leadership will ensure a seamless transition and adeptly steer our marketing efforts forward,\" Cognizant said in a statement.Chand had joined Cognizant in August 2019. Previously, he had worked with Ranbaxy for two years and Dell Technologies for over 13 years followed by a brief stint with CenturyLink in the US.","cleaned_content":"global technology services giant cognizant saw yet another senior level exit with its chief marketing officer gaurav chand being the latest to resign thea hayden senior vice president of global marketing a \u003cTWO_TEN\u003e year marketing veteran and seasoned cognizant executive will serve as the interim chief marketing officer the us headquartered firm has mandated executive search firms to find chands successor the company confirmed to et we thank gaurav chand for his leadership since \u003cTWO_THOUSAND\u003e during which he oversaw all aspects of cognizant s global marketing senior vice president of global marketing thea hayden a \u003cTWO_TEN\u003e year marketing veteran and seasoned cognizant executive will serve as our interim chief marketing officer while a global search for a permanent cmo is conducted her deep expertise and leadership will ensure a seamless transition and adeptly steer our marketing efforts forward cognizant said in a statement chand had joined cognizant in august \u003cTWO_THOUSAND\u003e previously he had worked with ranbaxy for two years and dell technologies for over \u003cONE_TEN\u003e years followed by a brief stint with centurylink in the us","timestamp":"2024-09-19T23:09:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}