{"url":"https://economictimes.indiatimes.com/tech/information-tech/lic-picks-infosys-to-drive-digital-transformation-with-nextgen-digital-platform/articleshow/113382128.cms","title":"Infosys ties up with LIC to push digital transformation","description":"Infosys has been chosen by Life Insurance Corporation (LIC) to lead its digital transformation with the NextGen Digital Platform. This initiative, called DIVE, aims to provide omnichannel engagement and hyper-personalised experiences for LIC's customers, agents, and employees. Infosys will use its AI and cloud services to enhance LIC's operational capabilities.","content":"Infosys Monday said it has formed a partnership with Life Insurance Corporation of India (LIC) to support the state-run insurer’s digital transformation initiative Digital Innovation and Value Enhancement (DIVE).“As part of the collaboration, Infosys will enable the creation of a cutting-edge NextGen Digital Platform, which will focus on delivering seamless omnichannel engagement and data-driven hyper-personalised experiences to LIC’s customers, agents and employees,” Infosys said in a regulatory filing. Financial details of the partnership were not disclosed.Infosys said it will provide LIC with turnkey system integration services using AI capabilities from its AI platform Infosys Topaz, and DevSecOps services from its cloud offering Cobalt. Infosys will also help set up necessary infrastructure for digital transformation and ensure ongoing monitoring and maintenance once the platform is operational.“By leveraging Infosys’ extensive experience in digital transformation initiatives and prowess in AI and Cloud, we aim to equip LIC with a robust digital infrastructure that will deliver superior customer engagement, enhance operational efficiency and enable rapid market responsiveness. Through this collaboration, we are confident that LIC will be uniquely positioned to offer unparalleled service and value to their stakeholders,” said Salil Parekh, CEO \u0026 MD, Infosys.In August, ET reported that banking, financial services and insurance (BFSI) sector, the largest business segment for Infosys, and most of India's major software service providers played a key role in the partial recovery of the country's more than $250 billion IT services industry after a lull of 4-6 quarters.","cleaned_content":"infosys monday said it has formed a partnership with life insurance corporation of india lic to support the state run insurer s digital transformation initiative digital innovation and value enhancement dive as part of the collaboration infosys will enable the creation of a cutting edge nextgen digital platform which will focus on delivering seamless omnichannel engagement and data driven hyper personalised experiences to lic s customers agents and employees infosys said in a regulatory filing financial details of the partnership were not disclosed infosys said it will provide lic with turnkey system integration services using ai capabilities from its ai platform infosys topaz and devsecops services from its cloud offering cobalt infosys will also help set up necessary infrastructure for digital transformation and ensure ongoing monitoring and maintenance once the platform is operational by leveraging infosys extensive experience in digital transformation initiatives and prowess in ai and cloud we aim to equip lic with a robust digital infrastructure that will deliver superior customer engagement enhance operational efficiency and enable rapid market responsiveness through this collaboration we are confident that lic will be uniquely positioned to offer unparalleled service and value to their stakeholders said salil parekh ceo md infosys in august et reported that banking financial services and insurance bfsi sector the largest business segment for infosys and most of indias major software service providers played a key role in the partial recovery of the countrys more than \u003cTWO_HUNDRED\u003e billion it services industry after a lull of \u003cFOUR_\u003e \u003cSIX_\u003e quarters","timestamp":"2024-09-16T17:50:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}