{"url":"https://economictimes.indiatimes.com/tech/technology/financial-software-maker-enfusion-explores-options-including-sale-sources-say/articleshow/113551131.cms","title":"Financial software maker Enfusion explores options including sale, sources say","description":"The Chicago-based company, which has a market value of $1.1 billion, decided to interview investment banks in recent weeks after receiving takeover interest from potential suitors including private equity firms, one of the sources said, requesting anonymity as the matter is confidential.","content":"Enfusion, a U.S. software provider for asset managers, is in talks with investment bankers to evaluate options that could include a potential sale, according to people familiar with the matter. The Chicago-based company, which has a market value of $1.1 billion, decided to interview investment banks in recent weeks after receiving takeover interest from potential suitors including private equity firms, one of the sources said, requesting anonymity as the matter is confidential. Enfusion has not launched a sale process yet and it is possible that the company opts to stay independent, the sources added. Enfusion did not immediately respond to requests for comment. Shares of the company jumped as much as 19% on the news before trading was briefly halted on Friday. This is not the first time Enfusion has held talks to explore a deal. Reuters reported last year that Enfusion fielded acquisition interest from several potential acquirers, including Francisco Partners, Vista Equity Partners and Irenic Capital Management.","cleaned_content":"enfusion a u s software provider for asset managers is in talks with investment bankers to evaluate options that could include a potential sale according to people familiar with the matter the chicago based company which has a market value of \u003cONE_\u003e billion decided to interview investment banks in recent weeks after receiving takeover interest from potential suitors including private equity firms one of the sources said requesting anonymity as the matter is confidential enfusion has not launched a sale process yet and it is possible that the company opts to stay independent the sources added enfusion did not immediately respond to requests for comment shares of the company jumped as much as \u003cONE_TEN_PERCENT\u003e on the news before trading was briefly halted on friday this is not the first time enfusion has held talks to explore a deal reuters reported last year that enfusion fielded acquisition interest from several potential acquirers including francisco partners vista equity partners and irenic capital management","timestamp":"2024-09-21T17:12:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}