{"url":"https://economictimes.indiatimes.com/tech/technology/the-missing-layer-of-the-india-stack/articleshow/113355067.cms","title":"The missing layer of the India stack","description":"Given our population and a proven track record of providing talent for global IT, why is India at risk of missing the AI bus? Most global travellers would vouch for the fact that no other country is as digitally savvy and inclusive as India. With hundreds of millions online, we also have the largest and most active user base for the biggest technology companies in the world.","content":"As India builds momentum towards becoming a $10-trillion economy, it’s earned plaudits for its digital-first approach in accelerating economic growth. India Stack is deservedly something to be proud of — the world’s largest system for digital identity and the world’s largest payment interface, both having set leading standards for public ecommerce and digital privacy.Most global travellers would vouch for the fact that no other country is as digitally savvy and inclusive as India. With hundreds of millions online, we also have the largest and most active user base for the biggest technology companies in the world.India has been the bulwark of IT services for a few decades now, constantly meeting and often exceeding expectations. The information and communications technology (ICT) sector creates one of the largest job pools in India and contributes to around 13% of our GDP. So, what gives when I say that there is a forgotten piece of the digital stack?Let’s look at some facts. The world is headed for some serious technological disruption with the advent of Gen AI. This requires a new kind of programming and problem-solving skill base to be developed. Robotics and industrial automation are headed for a new dimension and AI will impact all spheres of life and productivity significantly. It is as seminal a moment as the birth of the internet, or the Wright brothers learning to fly.India has the demographic dividend and a good record of producing talent for IT. The country potentially has the largest pool of young people too — around 12 million youth entering the workforce every year. The question is, what are they being trained for?","cleaned_content":"as india builds momentum towards becoming a \u003cONE_TEN\u003e trillion economy it s earned plaudits for its digital first approach in accelerating economic growth india stack is deservedly something to be proud of the world s largest system for digital identity and the world s largest payment interface both having set leading standards for public ecommerce and digital privacy most global travellers would vouch for the fact that no other country is as digitally savvy and inclusive as india with hundreds of millions online we also have the largest and most active user base for the biggest technology companies in the world india has been the bulwark of it services for a few decades now constantly meeting and often exceeding expectations the information and communications technology ict sector creates one of the largest job pools in india and contributes to around \u003cONE_TEN_PERCENT\u003e of our gdp so what gives when i say that there is a forgotten piece of the digital stack let s look at some facts the world is headed for some serious technological disruption with the advent of gen ai this requires a new kind of programming and problem solving skill base to be developed robotics and industrial automation are headed for a new dimension and ai will impact all spheres of life and productivity significantly it is as seminal a moment as the birth of the internet or the wright brothers learning to fly india has the demographic dividend and a good record of producing talent for it the country potentially has the largest pool of young people too around \u003cONE_TEN\u003e million youth entering the workforce every year the question is what are they being trained for","timestamp":"2024-09-15T06:00:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}