{"url":"https://economictimes.indiatimes.com/tech/technology/applied-materials-eyes-ops-near-semicon-units/articleshow/113373639.cms","title":"Applied Materials eyes ops near semicon units","description":"Prabu Raja, president of semiconductor products group at Applied Materials, said it expects 'second level of growth' to happen as its customers begin putting up factories in India. So far, the government has approved incentives for five projects of which four are in Gujarat and one is in Assam.","content":"Applied Materials, which supplies to semiconductor units, could set up operations at Dholera and Sanand in Gujarat or Morigaon in Assam, where chip manufacturing facilities are coming, as the materials engineering solution provider aims to be close to its customer, senior company executives told ET.  It added that it expects 'second level of growth' to happen as its customers begin putting up factories in India. So far, the government has approved incentives for five projects of which four are in Gujarat and one is in Assam. For the semiconductor ecosystem in India to leapfrog, the company said having a strong supplier base, requisite infrastructure and lucrative incentives would be key. \"We want to make sure our suppliers are close to where we are,\" Prabu Raja, president of the Semiconductor Products Group (SPG) at Applied Materials told ET on the sidelines of the Semicon India 2024 event. Suppliers need to be very close as it is all about speed... (Then) the talent is here. And also cost wise (India) is also very attractive right now. So it makes all more sense for the suppliers to come here right now.\" Raja added India should make the incentives more lucrative for the suppliers. \"Suppliers don't get 50% subsidy. The suppliers get a smaller number today. I think they (the government) also need to look at what are they (suppliers) getting in other countries. I can't talk about other countries, but today 20 plus 20 is also attractive. We want it (the incentives) to be more... Close to (the amount given for) manufacturing. Let's see what the policy comes out (with)\". But he said that India does score on the cost front as it is lower than other countries. He said suppliers consider all of these factors, not incentives alone but underscored that good incentives sweeten the deal and \"make it more attractive\". ","cleaned_content":"applied materials which supplies to semiconductor units could set up operations at dholera and sanand in gujarat or morigaon in assam where chip manufacturing facilities are coming as the materials engineering solution provider aims to be close to its customer senior company executives told et it added that it expects second level of growth to happen as its customers begin putting up factories in india so far the government has approved incentives for five projects of which four are in gujarat and one is in assam for the semiconductor ecosystem in india to leapfrog the company said having a strong supplier base requisite infrastructure and lucrative incentives would be key we want to make sure our suppliers are close to where we are prabu raja president of the semiconductor products group spg at applied materials told et on the sidelines of the semicon india \u003cTWO_THOUSAND\u003e event suppliers need to be very close as it is all about speed then the talent is here and also cost wise india is also very attractive right now so it makes all more sense for the suppliers to come here right now raja added india should make the incentives more lucrative for the suppliers suppliers dont get \u003cFIVE_TEN_PERCENT\u003e subsidy the suppliers get a smaller number today i think they the government also need to look at what are they suppliers getting in other countries i cant talk about other countries but today \u003cTWO_TEN\u003e plus \u003cTWO_TEN\u003e is also attractive we want it the incentives to be more close to the amount given for manufacturing lets see what the policy comes out with but he said that india does score on the cost front as it is lower than other countries he said suppliers consider all of these factors not incentives alone but underscored that good incentives sweeten the deal and make it more attractive","timestamp":"2024-09-16T06:00:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}