{"url":"https://economictimes.indiatimes.com/tech/technology/what-the-us-has-argued-in-the-google-ad-tech-antitrust-trial/articleshow/113539554.cms","title":"What the US has argued in the Google ad tech antitrust trial","description":"The government on Friday concluded its main arguments in the case -- US et al. v. Google -- and the internet giant started mounting its defense. The case, filed last year, accuses Google of building a monopoly over the technology that places ads on websites around the internet.","content":"Over the past two weeks, lawyers for the Department of Justice have questioned more than a dozen witnesses as they try to prove that Google has broken antitrust laws, part of a second major federal antitrust trial against the tech giant. The government on Friday concluded its main arguments in the case -- US et al. v. Google -- and the internet giant started mounting its defense. The case, filed last year, accuses Google of building a monopoly over the technology that places ads on websites around the internet. Now, Google will deny the claims. The company argues that the ad tech industry is intensely competitive, and accuses the Justice Department of ignoring rivals like Facebook and Amazon to make its case sound more compelling. The trial, which is taking place in US District Court for the Eastern District of Virginia, is expected to last about four weeks. After that, Judge Leonie Brinkema could take several months to make a decision. The stakes are high: The government has asked for a breakup of the company, requiring Google to sell off some assets. Two prime threads have emerged during the trial: what the government says Google has done to illegally build and maintain its monopoly and how those practices have harmed website operators, advertisers and ultimately consumers. Here are the Justice Department's main arguments.","cleaned_content":"over the past two weeks lawyers for the department of justice have questioned more than a dozen witnesses as they try to prove that google has broken antitrust laws part of a second major federal antitrust trial against the tech giant the government on friday concluded its main arguments in the case us et al v google and the internet giant started mounting its defense the case filed last year accuses google of building a monopoly over the technology that places ads on websites around the internet now google will deny the claims the company argues that the ad tech industry is intensely competitive and accuses the justice department of ignoring rivals like facebook and amazon to make its case sound more compelling the trial which is taking place in us district court for the eastern district of virginia is expected to last about four weeks after that judge leonie brinkema could take several months to make a decision the stakes are high the government has asked for a breakup of the company requiring google to sell off some assets two prime threads have emerged during the trial what the government says google has done to illegally build and maintain its monopoly and how those practices have harmed website operators advertisers and ultimately consumers here are the justice departments main arguments","timestamp":"2024-09-21T07:56:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}