{"url":"https://economictimes.indiatimes.com/tech/technology/apple-faces-eu-warning-to-open-up-iphone-operating/articleshow/113488072.cms","title":"Apple faces EU warning to open up iPhone operating","description":"EU watchdogs are due to announce under the bloc’s new Digital Markets Act that the Cupertino, California-based firm must step into line with strict new rules on making operating systems fully functional with other technologies, according to people familiar with the matter, who spoke under condition of anonymity.","content":"Apple Inc. is set to be warned by the European Union to open up its highly guarded iPhone operating system to rival technologies, or eventually risk significant fines. EU watchdogs are due to announce under the bloc’s new Digital Markets Act that the Cupertino, California-based firm must step into line with strict new rules on making operating systems fully functional with other technologies, according to people familiar with the matter, who spoke under condition of anonymity. Th European Commission declined to comment. Apple didn’t immediately respond to a request for comment. While the announcement is a step shy of being a formal investigation, the EU aims to compel Apple to re-engineer its services to allow rival companies to access the iPhone’s operating system. One of the aims of the DMA is to ensure that other developers can gain access to key iPhone features, such as its Siri voice commands and its payments chip.The EU may later decide to launch a formal probe if Apple doesn’t step into line with the DMA, which could eventually lead to hefty fines of up to 10% of global annual turnover.","cleaned_content":"apple inc is set to be warned by the european union to open up its highly guarded iphone operating system to rival technologies or eventually risk significant fines eu watchdogs are due to announce under the bloc s new digital markets act that the cupertino california based firm must step into line with strict new rules on making operating systems fully functional with other technologies according to people familiar with the matter who spoke under condition of anonymity th european commission declined to comment apple didn t immediately respond to a request for comment while the announcement is a step shy of being a formal investigation the eu aims to compel apple to re engineer its services to allow rival companies to access the iphone s operating system one of the aims of the dma is to ensure that other developers can gain access to key iphone features such as its siri voice commands and its payments chip the eu may later decide to launch a formal probe if apple doesn t step into line with the dma which could eventually lead to hefty fines of up to \u003cONE_TEN_PERCENT\u003e of global annual turnover","timestamp":"2024-09-19T15:11:00+05:30","market_timestamp":"2024-09-19T15:11:00+05:30","off_market_hours":false}