{"url":"https://economictimes.indiatimes.com/tech/technology/facebook-owner-meta-bans-russia-state-media-outlets-over-foreign-interference/articleshow/113426410.cms","title":"Facebook owner Meta bans Russia state media outlets over \"foreign interference\"","description":"The company, which owns Facebook, WhatsApp and Instagram, said late Monday that it will roll out the ban over the next few days in an escalation of its efforts to counter Russia's covert influence operations.","content":"Meta said it's banning Russia state media organization from its social media platforms, alleging that the outlets used deceptive tactics to amplify Moscow's propaganda. The announcement drew a rebuke from the Kremlin on Tuesday.  The company, which owns Facebook, WhatsApp and Instagram, said late Monday that it will roll out the ban over the next few days in an escalation of its efforts to counter Russia's covert influence operations.  \"After careful consideration, we expanded our ongoing enforcement against Russian state media outlets: Rossiya Segodnya, RT and other related entities are now banned from our apps globally for foreign interference activity,\" Meta said in a prepared statement.  Kremlin spokesman Dmitry Peskov lashed out, saying that \"such selective actions against Russian media are unacceptable,\" and that \"Meta with these actions are discrediting themselves.\"  \"We have an extremely negative attitude towards this. And this, of course, complicates the prospects for normalizing our relations with Meta,\" Peskov told reporters during his daily conference call.","cleaned_content":"meta said its banning russia state media organization from its social media platforms alleging that the outlets used deceptive tactics to amplify moscows propaganda the announcement drew a rebuke from the kremlin on tuesday the company which owns facebook whatsapp and instagram said late monday that it will roll out the ban over the next few days in an escalation of its efforts to counter russias covert influence operations after careful consideration we expanded our ongoing enforcement against russian state media outlets rossiya segodnya rt and other related entities are now banned from our apps globally for foreign interference activity meta said in a prepared statement kremlin spokesman dmitry peskov lashed out saying that such selective actions against russian media are unacceptable and that meta with these actions are discrediting themselves we have an extremely negative attitude towards this and this of course complicates the prospects for normalizing our relations with meta peskov told reporters during his daily conference call","timestamp":"2024-09-17T16:39:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}