{"url":"https://economictimes.indiatimes.com/tech/technology/instagram-makes-teen-accounts-private-as-pressure-mounts-on-the-app-to-protect-children/articleshow/113430729.cms","title":"Instagram makes teen accounts private as pressure mounts on the app to protect children","description":"Beginning Tuesday in the U.S., U.K., Canada and Australia, anyone under under 18 who signs up for Instagram will be placed into teen accounts and those with existing accounts will be migrated over the next 60 days. Teens in the European Union will see their accounts adjusted later this year.","content":"Instagram is making teen accounts private by default as it tries to make the platform safer for children amid a growing backlash against how social media affects young people's lives.  Beginning Tuesday in the U.S., U.K., Canada and Australia, anyone under under 18 who signs up for Instagram will be placed into teen accounts and those with existing accounts will be migrated over the next 60 days. Teens in the European Union will see their accounts adjusted later this year.  Meta acknowledges that teenagers may lie about their age and says it will require them to verify their ages in more instances, like if they try to create a new account with an adult birthday. The Menlo Park, California company also said it is building technology that proactively finds teen accounts that pretend to be grownups and automatically places them into the restricted teen accounts.  The teen accounts will be private by default. Private messages are restricted so teens can only receive them from people they follow or are already connected to. \"Sensitive content,\" such as videos of people fighting or those promoting cosmetic procedures, will be limited, Meta said. Teens will also get notifications if they are on Instagram for more than 60 minutes and a \"sleep mode\" will be enabled that turns off notifications and sends auto-replies to direct messages from 10 p.m. until 7 a.m. While these settings will be turned on for all teens, 16 and 17-year-olds will be able to turn them off. Kids under 16 will need their parents' permission to do so. ","cleaned_content":"instagram is making teen accounts private by default as it tries to make the platform safer for children amid a growing backlash against how social media affects young peoples lives beginning tuesday in the u s u k canada and australia anyone under under \u003cONE_TEN\u003e who signs up for instagram will be placed into teen accounts and those with existing accounts will be migrated over the next \u003cSIX_TEN\u003e days teens in the european union will see their accounts adjusted later this year meta acknowledges that teenagers may lie about their age and says it will require them to verify their ages in more instances like if they try to create a new account with an adult birthday the menlo park california company also said it is building technology that proactively finds teen accounts that pretend to be grownups and automatically places them into the restricted teen accounts the teen accounts will be private by default private messages are restricted so teens can only receive them from people they follow or are already connected to sensitive content such as videos of people fighting or those promoting cosmetic procedures will be limited meta said teens will also get notifications if they are on instagram for more than \u003cSIX_TEN\u003e minutes and a sleep mode will be enabled that turns off notifications and sends auto replies to direct messages from \u003cONE_TEN\u003e p m until \u003cSEVEN_\u003e a m while these settings will be turned on for all teens \u003cONE_TEN\u003e and \u003cONE_TEN\u003e year olds will be able to turn them off kids under \u003cONE_TEN\u003e will need their parents permission to do so","timestamp":"2024-09-17T19:03:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}