{"url":"https://economictimes.indiatimes.com/tech/technology/eu-moves-to-compel-apple-to-open-up-operating-system-to-rival-tech/articleshow/113496157.cms","title":"EU moves to compel Apple to open up operating system to rival tech","description":"The EU's executive branch, the European Commission, said it has opened two \"specification proceedings\" that will spell out what Apple needs to do under the 27-nation bloc's Digital Markets Act.","content":"The European Union said Thursday it will outline steps to compel Apple to open up its iPhone and iPad operating systems to competing technologies under the bloc's tough new digital rulebook, which threatens hefty fines for breaches.  The EU's executive branch, the European Commission, said it has opened two \"specification proceedings\" that will spell out what Apple needs to do under the 27-nation bloc's Digital Markets Act.  The DMA is designed to prevent Big Tech \"gatekeepers\" from dominating digital markets, including by breaking up closed tech ecosystems. It requires tech companies to make their systems operate with rivals, allowing consumers to switch more easily between platforms.  One proceeding will focus on how connected devices like smartwatches and headphones will have \"effective interoperability\" with Apple's operating system. The other will look at how Apple deals with interoperability requests from software developers for iOS and IPadOS, which should be done in a \"transparent, timely and fair\" way, the commission said.  During this process, which will take up to six months, the commission will send its findings to Apple. It's the first time the commission has used this process since the DMA took effect earlier this year. The bloc is already investigating Apple over its App Store rules for developers.","cleaned_content":"the european union said thursday it will outline steps to compel apple to open up its iphone and ipad operating systems to competing technologies under the blocs tough new digital rulebook which threatens hefty fines for breaches the eus executive branch the european commission said it has opened two specification proceedings that will spell out what apple needs to do under the \u003cTWO_TEN\u003e nation blocs digital markets act the dma is designed to prevent big tech gatekeepers from dominating digital markets including by breaking up closed tech ecosystems it requires tech companies to make their systems operate with rivals allowing consumers to switch more easily between platforms one proceeding will focus on how connected devices like smartwatches and headphones will have effective interoperability with apples operating system the other will look at how apple deals with interoperability requests from software developers for ios and ipados which should be done in a transparent timely and fair way the commission said during this process which will take up to six months the commission will send its findings to apple its the first time the commission has used this process since the dma took effect earlier this year the bloc is already investigating apple over its app store rules for developers","timestamp":"2024-09-19T18:55:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}