{"url":"https://economictimes.indiatimes.com/tech/technology/downstream-spacetech-is-workhorse-of-indias-space-sector-experts/articleshow/113509751.cms","title":"Downstream spacetech is workhorse of India's space sector: Experts","description":"\"The government is making space data open for industries to create decision support systems, mapping and monitoring applications for physical assets, agriculture, tourism, weather forecasting for aviation, marketing solutions based on spatial information, fishing and shipping sector applications, and disaster management solutions,\" Director, Space Application Centre said.","content":"Downstream spacetech market is ripe for picking by private sector, said Nilesh M Desai, Director, Space Application Centre on Thursday. He was speaking on the second day of the Bengaluru Space Expo, being organised by the Indian Space Research Organisation (ISRO) in collaboration with the Confederation of Indian Industry (CII). According to Desai, downstream spacetech transforms space data into practical applications and is a workhorse of India's space sector. \"Hence the private sector has to come forward to tap the ground segment and user segment that comprise much of the downstream market,\" he said during the session on 'Space Applications for Business Growth: Leveraging GIS Solution for the Private Sector.' Desai said that applications like GIS that leverage earth observation/remote sensing data, space communication, and space navigation offer enormous business opportunities for the startups. \"The government is making space data open for industries to create decision support systems, mapping and monitoring applications for physical assets, agriculture, tourism, weather forecasting for aviation, marketing solutions based on spatial information, fishing and shipping sector applications, and disaster management solutions,\" he added. ","cleaned_content":"downstream spacetech market is ripe for picking by private sector said nilesh m desai director space application centre on thursday he was speaking on the second day of the bengaluru space expo being organised by the indian space research organisation isro in collaboration with the confederation of indian industry cii according to desai downstream spacetech transforms space data into practical applications and is a workhorse of indias space sector hence the private sector has to come forward to tap the ground segment and user segment that comprise much of the downstream market he said during the session on space applications for business growth leveraging gis solution for the private sector desai said that applications like gis that leverage earth observation remote sensing data space communication and space navigation offer enormous business opportunities for the startups the government is making space data open for industries to create decision support systems mapping and monitoring applications for physical assets agriculture tourism weather forecasting for aviation marketing solutions based on spatial information fishing and shipping sector applications and disaster management solutions he added","timestamp":"2024-09-20T09:25:00+05:30","market_timestamp":"2024-09-20T09:25:00+05:30","off_market_hours":false}