{"url":"https://economictimes.indiatimes.com/tech/technology/x-unlikely-to-fall-under-landmark-eu-tech-rules/articleshow/113340601.cms","title":"X unlikely to fall under landmark EU tech rules","description":"Elon Musk's X social media platform is unlikely to be subjected to the EU's landmark tech rules under the Digital Markets Act. The European Commission had investigated X, but it does not meet the criteria of having over 45 million monthly active users and a market capitalisation of 75 billion euros.","content":"Elon Musk's X social media platform is unlikely to be subjected to landmark EU tech rules which aim to rein in the power of Big Tech because it does not meet the rules' gatekeeper criteria, a person with direct knowledge of the matter said on Friday. The European Commission in May opened an investigation into X after the company rebutted earlier indications that it may have to comply with the Digital Markets Act (DMA), which imposes a list of dos and don'ts on Big Tech. X has said it does not qualify as an important gateway between businesses and consumers. Under the DMA, companies with more than 45 million monthly active users and 75 billion euros ($83 billion) in market capitalisation are classified as gatekeepers. They must make their messaging apps interoperable with rivals and let users decide which apps to pre-install on their devices. They are also not allowed to favour their own services over rivals' or prevent users from removing pre-installed software or apps. The commission, which had said it would wrap up its investigation within five months, declined to comment.","cleaned_content":"elon musks x social media platform is unlikely to be subjected to landmark eu tech rules which aim to rein in the power of big tech because it does not meet the rules gatekeeper criteria a person with direct knowledge of the matter said on friday the european commission in may opened an investigation into x after the company rebutted earlier indications that it may have to comply with the digital markets act dma which imposes a list of dos and donts on big tech x has said it does not qualify as an important gateway between businesses and consumers under the dma companies with more than \u003cFOUR_TEN\u003e million monthly active users and \u003cSEVEN_TEN\u003e billion euros \u003cEIGHT_TEN\u003e billion in market capitalisation are classified as gatekeepers they must make their messaging apps interoperable with rivals and let users decide which apps to pre install on their devices they are also not allowed to favour their own services over rivals or prevent users from removing pre installed software or apps the commission which had said it would wrap up its investigation within five months declined to comment","timestamp":"2024-09-14T10:18:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}