{"url":"https://economictimes.indiatimes.com/tech/technology/nazara-to-raise-rs-900-crore-hikes-stake-in-absolute-sports-to-91/articleshow/113458880.cms","title":"Nazara to raise Rs 900 crore, hikes stake in Absolute Sports to 91%","description":"This is Mumbai-based Nazara's largest fundraise so far. Investors in the round included SBI Mutual Fund, CaratLane founder Mithun Sacheti, Jaipur Gems CEO Siddhartha Sacheti, Cohesion Investments, Chartered Finance and Leasing etc.  Additionally, Nazara Technologies acquired a further 19.35% stake in Absolute Sports, taking its total holding to 91%.","content":"Listed gaming and media firm Nazara Technologies has approved a preferential equity issue to raise Rs 900 crore from a group of investors including SBI Mutual Fund, Junomoneta Finsol (an associate of Plutus Wealth), Think Investments, Discovery Investments, CaratLane founder Mithun Sacheti, Jaipur Gems CEO Siddhartha Sacheti, Cohesion Investments, Chartered Finance and Leasing, Ratnabali Investments and Aamara Capital.The capital infusion is aimed at fuelling strategic acquisitions, funding business expansion, and strengthening the company’s ability to capitalise on new growth opportunities, Nazara said on Wednesday.This is the largest fundraise by the Mumbai-based company.Additionally, Nazara Technologies acquired a further 19.35% stake in Absolute Sports, the parent company of sports news website Sportskeeda, for Rs 145.5 crore. Half of the consideration was paid in cash, with the remaining amount settled through stock. With this acquisition, Nazara holds a 91% stake in Absolute Sports.“Nazara has demonstrated its ability to attract top-tier investors who believe in our long-term vision of establishing India’s first globally respected gaming powerhouse. This Rs 900-crore fundraise will be instrumental in accelerating our growth across key segments. Additionally, increasing our stake to 91% in Absolute Sports (Sportskeeda) reinforces our leadership in the sports media landscape,” said Nitish Mittersain, CEO \u0026 joint managing director of Nazara Technologies.","cleaned_content":"listed gaming and media firm nazara technologies has approved a preferential equity issue to raise rs \u003cNINE_HUNDRED\u003e crore from a group of investors including sbi mutual fund junomoneta finsol an associate of plutus wealth think investments discovery investments caratlane founder mithun sacheti jaipur gems ceo siddhartha sacheti cohesion investments chartered finance and leasing ratnabali investments and aamara capital the capital infusion is aimed at fuelling strategic acquisitions funding business expansion and strengthening the company s ability to capitalise on new growth opportunities nazara said on wednesday this is the largest fundraise by the mumbai based company additionally nazara technologies acquired a further \u003cONE_TEN_PERCENT\u003e stake in absolute sports the parent company of sports news website sportskeeda for rs \u003cONE_HUNDRED\u003e crore half of the consideration was paid in cash with the remaining amount settled through stock with this acquisition nazara holds a \u003cNINE_TEN_PERCENT\u003e stake in absolute sports nazara has demonstrated its ability to attract top tier investors who believe in our long term vision of establishing india s first globally respected gaming powerhouse this rs \u003cNINE_HUNDRED\u003e crore fundraise will be instrumental in accelerating our growth across key segments additionally increasing our stake to \u003cNINE_TEN_PERCENT\u003e in absolute sports sportskeeda reinforces our leadership in the sports media landscape said nitish mittersain ceo joint managing director of nazara technologies","timestamp":"2024-09-18T16:55:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}