{"url":"https://economictimes.indiatimes.com/tech/technology/apple-shares-slip-as-shorter-iphone-16-shipping-times-signal-soft-demand/articleshow/113401238.cms","title":"Apple shares slip as shorter iPhone 16 shipping times signal soft demand","description":"Early pre-order data from BofA Global Research revealed shorter global shipping times for the iPhone 16 Pro models compared to last year's 15 Pro models, as of Monday, three days after the company started taking pre-orders .","content":"Shares of Apple fell nearly 3% on Monday after several analysts said that delivery times for the new iPhone 16 Pro models indicated weaker-than-expected demand, possibly due to the delayed rollout of key artificial intelligence features. Apple last week unveiled its long-awaited iPhone 16 series designed around its AI software, Apple Intelligence. Early pre-order data from BofA Global Research revealed shorter global shipping times for the iPhone 16 Pro models compared to last year's 15 Pro models, as of Monday, three days after the company started taking pre-orders . Ship time on average for the iPhone 16 Pro currently stood at 14 days, lower than 24 days for the iPhone 15 Pro last year, the data showed, while the 19-day ship time for the iPhone 16 Pro Max compares with 32 days last year. \"The key factor is the lower-than-expected demand for the iPhone 16 Pro series...the major selling point, Apple Intelligence, is not available at launch alongside the iPhone 16 release,\" said Ming-Chi Kuo, an Apple analyst at TF International Securities, said in a blogpost.","cleaned_content":"shares of apple fell nearly \u003cTHREE_PERCENT\u003e on monday after several analysts said that delivery times for the new iphone \u003cONE_TEN\u003e pro models indicated weaker than expected demand possibly due to the delayed rollout of key artificial intelligence features apple last week unveiled its long awaited iphone \u003cONE_TEN\u003e series designed around its ai software apple intelligence early pre order data from bofa global research revealed shorter global shipping times for the iphone \u003cONE_TEN\u003e pro models compared to last years \u003cONE_TEN\u003e pro models as of monday three days after the company started taking pre orders ship time on average for the iphone \u003cONE_TEN\u003e pro currently stood at \u003cONE_TEN\u003e days lower than \u003cTWO_TEN\u003e days for the iphone \u003cONE_TEN\u003e pro last year the data showed while the \u003cONE_TEN\u003e day ship time for the iphone \u003cONE_TEN\u003e pro max compares with \u003cTHREE_TEN\u003e days last year the key factor is the lower than expected demand for the iphone \u003cONE_TEN\u003e pro series the major selling point apple intelligence is not available at launch alongside the iphone \u003cONE_TEN\u003e release said ming chi kuo an apple analyst at tf international securities said in a blogpost","timestamp":"2024-09-16T21:05:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}