{"url":"https://economictimes.indiatimes.com/tech/technology/france-uses-tough-untested-cybercrime-law-to-target-telegrams-pavel-durov/articleshow/113413864.cms","title":"France uses tough, untested cybercrime law to target Telegram's Pavel Durov","description":"France is using a new law to prosecute Telegram's Pavel Durov for allowing illegal activities on the platform. The LOPMI law, enacted in January 2023, is untested in court but aims to hold tech bosses accountable. Durov denies Telegram is an 'anarchic paradise' and claims compliance with EU laws.","content":"When French prosecutors took aim at Telegram boss Pavel Durov, they had a trump card to wield - a tough new law with no international equivalent that criminalises tech titans whose platforms allow illegal products or activities. The so-called LOPMI law, enacted in January 2023, has placed France at the forefront of a group of nations taking a sterner stance on crime-ridden websites. But the law is so recent that prosecutors have yet to secure a conviction. With the law still untested in court, France's pioneering push to prosecute figures like Durov could backfire if its judges balk at penalising tech bosses for alleged criminality on their platforms. A French judge placed Durov under formal investigation last month, charging him with various crimes, including the 2023 offence: \"Complicity in the administration of an online platform to allow an illicit transaction, in an organised gang,\" which carries a maximum 10-year sentence and a 500,000 euro ($556,300) fine. Being under formal investigation does not imply guilt or necessarily lead to trial, but indicates judges think there's enough evidence to proceed with the probe. Investigations can last years before being sent to trial or dropped.","cleaned_content":"when french prosecutors took aim at telegram boss pavel durov they had a trump card to wield a tough new law with no international equivalent that criminalises tech titans whose platforms allow illegal products or activities the so called lopmi law enacted in january \u003cTWO_THOUSAND\u003e has placed france at the forefront of a group of nations taking a sterner stance on crime ridden websites but the law is so recent that prosecutors have yet to secure a conviction with the law still untested in court frances pioneering push to prosecute figures like durov could backfire if its judges balk at penalising tech bosses for alleged criminality on their platforms a french judge placed durov under formal investigation last month charging him with various crimes including the \u003cTWO_THOUSAND\u003e offence complicity in the administration of an online platform to allow an illicit transaction in an organised gang which carries a maximum \u003cONE_TEN\u003e year sentence and a \u003cFIVE_HUNDRED_THOUSAND\u003e euro \u003cFIVE_HUNDRED_THOUSAND\u003e fine being under formal investigation does not imply guilt or necessarily lead to trial but indicates judges think theres enough evidence to proceed with the probe investigations can last years before being sent to trial or dropped","timestamp":"2024-09-17T10:53:00+05:30","market_timestamp":"2024-09-17T10:53:00+05:30","off_market_hours":false}