{"url":"https://economictimes.indiatimes.com/tech/technology/australia-threatens-fines-for-social-media-giants-enabling-misinformation/articleshow/113283866.cms","title":"Australia threatens fines for social media giants enabling misinformation","description":"The Australian government said it would make tech platforms set codes of conduct governing how they stop dangerous falsehoods spreading, to be approved by a regulator. The regulator would set its own standard if a platform failed to do so, and then fine companies for non-compliance.","content":"Australia said it will fine internet platforms up to 5% of their global revenue for failing to prevent the spread of misinformation online, joining a worldwide push to rein in borderless tech giants but angering free speech advocates. The government said it would make tech platforms set codes of conduct governing how they stop dangerous falsehoods spreading, to be approved by a regulator. The regulator would set its own standard if a platform failed to do so, then fine companies for non-compliance. The legislation, to be introduced in parliament on Thursday, targets false content that hurts election integrity or public health, calls for denouncing a group or injuring a person, or risks disrupting key infrastructure or emergency services. The bill is part of a wide-ranging regulatory crackdown by Australia, where leaders have complained that foreign-domiciled tech platforms are overriding the country's sovereignty, and comes ahead of a federal election due within a year. Already Facebook owner Meta has said it may block professional news content if it is forced to pay royalties, while X, formerly Twitter, has removed most content moderation since being bought by billionaire Elon Musk in 2022.","cleaned_content":"australia said it will fine internet platforms up to \u003cFIVE_PERCENT\u003e of their global revenue for failing to prevent the spread of misinformation online joining a worldwide push to rein in borderless tech giants but angering free speech advocates the government said it would make tech platforms set codes of conduct governing how they stop dangerous falsehoods spreading to be approved by a regulator the regulator would set its own standard if a platform failed to do so then fine companies for non compliance the legislation to be introduced in parliament on thursday targets false content that hurts election integrity or public health calls for denouncing a group or injuring a person or risks disrupting key infrastructure or emergency services the bill is part of a wide ranging regulatory crackdown by australia where leaders have complained that foreign domiciled tech platforms are overriding the countrys sovereignty and comes ahead of a federal election due within a year already facebook owner meta has said it may block professional news content if it is forced to pay royalties while x formerly twitter has removed most content moderation since being bought by billionaire elon musk in \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-12T12:44:00+05:30","market_timestamp":"2024-09-12T12:44:00+05:30","off_market_hours":false}