{"url":"https://economictimes.indiatimes.com/tech/technology/facebook-parent-meta-platforms-beats-lawsuit-over-apple-privacy-sandberg-disclosures/articleshow/113464025.cms","title":"Facebook parent Meta Platforms beats lawsuit over Apple privacy, COO Sandberg disclosures","description":"The Oakland, California-based judge also turned aside claims that Meta knew its transition to Reels, which copied TikTok's short-form video format, would hurt revenue because it offered fewer ads per hour than older formats.","content":"Meta Platforms won the dismissal of a lawsuit claiming it defrauded shareholders by concealing how changes to Apple's privacy settings would make Facebook and Instagram less desirable for advertisers. In a decision on Tuesday, U.S. District Judge Yvonne Gonzalez Rogers also rejected claims that Meta concealed former Chief Operating Officer Sheryl Sandberg's use of company resources on personal matters, including her wedding and her best-selling book \"Lean In.\" The Oakland, California-based judge also turned aside claims that Meta knew its transition to Reels, which copied TikTok's short-form video format, would hurt revenue because it offered fewer ads per hour than older formats. Shareholders led by four Israeli insurers and pension funds challenged 17 allegedly false and misleading statements that Meta made in 2021 and 2022. They said Meta's stock price fell 53% in less than a year as the truth came out, wiping out well over $500 billion of the Menlo Park, California-based company's market value.","cleaned_content":"meta platforms won the dismissal of a lawsuit claiming it defrauded shareholders by concealing how changes to apples privacy settings would make facebook and instagram less desirable for advertisers in a decision on tuesday u s district judge yvonne gonzalez rogers also rejected claims that meta concealed former chief operating officer sheryl sandbergs use of company resources on personal matters including her wedding and her best selling book lean in the oakland california based judge also turned aside claims that meta knew its transition to reels which copied tiktoks short form video format would hurt revenue because it offered fewer ads per hour than older formats shareholders led by four israeli insurers and pension funds challenged \u003cONE_TEN\u003e allegedly false and misleading statements that meta made in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e they said metas stock price fell \u003cFIVE_TEN_PERCENT\u003e in less than a year as the truth came out wiping out well over \u003cFIVE_HUNDRED\u003e billion of the menlo park california based companys market value","timestamp":"2024-09-18T19:59:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}