{"url":"https://economictimes.indiatimes.com/tech/technology/adobe-forecasts-downbeat-quarterly-earnings-on-cautious-tech-spending/articleshow/113316449.cms","title":"Adobe forecasts downbeat quarterly earnings on cautious tech spending","description":"Founded in 1982, Adobe is one of the largest suppliers of software for visual and video artists, which include household names such as Acrobat, Photoshop and Premiere Pro.","content":"Photoshop maker Adobe forecast fourth-quarter earnings below analysts' estimates on Thursday, signaling stiff competition and soft demand for its AI-integrated editing tools amid challenging economic conditions.  Shares of the company fell 9.2% in extended trading. High interest rates and a tough economy have led enterprises and individuals to focus on cutting costs, putting pressure on Adobe's growth.  Founded in 1982, Adobe is one of the largest suppliers of software for visual and video artists, which include household names such as Acrobat, Photoshop and Premiere Pro. The San Jose, California-based company also faces competition from startups such as Stability AI and Midjourney, which provide similar AI services - including generating images from text prompts. ","cleaned_content":"photoshop maker adobe forecast fourth quarter earnings below analysts estimates on thursday signaling stiff competition and soft demand for its ai integrated editing tools amid challenging economic conditions shares of the company fell \u003cNINE_PERCENT\u003e in extended trading high interest rates and a tough economy have led enterprises and individuals to focus on cutting costs putting pressure on adobes growth founded in \u003cONE_THOUSAND\u003e adobe is one of the largest suppliers of software for visual and video artists which include household names such as acrobat photoshop and premiere pro the san jose california based company also faces competition from startups such as stability ai and midjourney which provide similar ai services including generating images from text prompts","timestamp":"2024-09-13T12:57:00+05:30","market_timestamp":"2024-09-13T12:57:00+05:30","off_market_hours":false}