{"url":"https://economictimes.indiatimes.com/tech/technology/sam-bankman-frieds-jury-only-saw-half-the-picture-lawyer-says-in-appeal/articleshow/113340082.cms","title":"Sam Bankman-Fried's jury only saw 'half the picture,' lawyer says in appeal","description":"Sam Bankman-Fried's lawyer has appealed his conviction, arguing that the jury saw only \"half the picture\" due to the exclusion of critical evidence. The former FTX CEO was sentenced to 25 years for stealing billions from customers. His lawyer claims the judge's decision led to a false narrative about customer losses.","content":"The jury that convicted Sam Bankman-Fried of stealing billions of dollars from customers of his FTX cryptocurrency exchange only saw \"half the picture\" because the judge did not allow in critical evidence, his lawyer argued in their appeal on Friday. In a 102-page brief filed with the 2nd U.S. Circuit Court of Appeals, Bankman-Fried's lawyer wrote that U.S. District Judge Lewis Kaplan erred in preventing the 32-year-old former billionaire from introducing evidence to back up his belief that FTX had enough funds to cover customer withdrawals. \"The government thus presented a false narrative that FTX's customers, lenders, and investors had permanently lost their money,\" lawyer Alexandra Shapiro wrote in urging the appeals court to overturn Bankman-Fried's conviction and 25-year prison sentence. \"The jury was only allowed to see half the picture.\"  A representative of the U.S. Attorney's office in Manhattan, which brought the charges, declined to comment.  Criminal defendants face a high bar in getting their convictions overturned, as they must show that trial judges made errors that were significant enough to have affected the verdict.","cleaned_content":"the jury that convicted sam bankman fried of stealing billions of dollars from customers of his ftx cryptocurrency exchange only saw half the picture because the judge did not allow in critical evidence his lawyer argued in their appeal on friday in a \u003cONE_HUNDRED\u003e page brief filed with the \u003cTWO_\u003e nd u s circuit court of appeals bankman frieds lawyer wrote that u s district judge lewis kaplan erred in preventing the \u003cTHREE_TEN\u003e year old former billionaire from introducing evidence to back up his belief that ftx had enough funds to cover customer withdrawals the government thus presented a false narrative that ftxs customers lenders and investors had permanently lost their money lawyer alexandra shapiro wrote in urging the appeals court to overturn bankman frieds conviction and \u003cTWO_TEN\u003e year prison sentence the jury was only allowed to see half the picture a representative of the u s attorneys office in manhattan which brought the charges declined to comment criminal defendants face a high bar in getting their convictions overturned as they must show that trial judges made errors that were significant enough to have affected the verdict","timestamp":"2024-09-14T09:26:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}