{"url":"https://economictimes.indiatimes.com/tech/technology/youtube-ceo-says-google-faces-plenty-of-ad-tech-competition/articleshow/113422314.cms","title":"YouTube CEO says Google faces plenty of ad tech competition","description":"Mohan's testimony kicked off the second week of a trial over the Justice Department's allegations that Google has a monopoly on the advertising technology market. Mohan, who joined Google as part of its acquisition of advertising software company DoubleClick in 2008, said the search giant faced ample competition in the ad tech market.","content":"Neal Mohan, CEO of YouTube, testified in federal court Monday that Google acted in the best interest of consumers and the ad industry, refuting accusations by the Justice Department that the company crushed rivals as it became an advertising technology behemoth. Mohan's testimony kicked off the second week of a trial over the Justice Department's allegations that Google has a monopoly on the advertising technology market. Mohan, who joined Google as part of its acquisition of advertising software company DoubleClick in 2008, said the search giant faced ample competition in the ad tech market. Google expanded into various areas of ad technology in response to demands from its business customers, including publishers and advertisers, he said. Google's success \"falls back to one single thing: product innovation and the sale and services we were able to offer,\" Mohan said, in his testimony before the U.S. District Court for the Eastern District of Virginia. The case stems from a lawsuit, filed last year by the Justice Department and eight states, accusing Google of abusing control of its ad technology and violating antitrust law, in part through the acquisition of DoubleClick. Google has pushed up ad prices and harmed publishers by taking a big cut of each sale, the government argues. Google has argued that the case is incorrectly focused narrowly on the split-second auctions that it conducts to sell ads on web pages. Now, the competitive market for online ads is much larger, thanks to social media and other in-app ads.","cleaned_content":"neal mohan ceo of youtube testified in federal court monday that google acted in the best interest of consumers and the ad industry refuting accusations by the justice department that the company crushed rivals as it became an advertising technology behemoth mohans testimony kicked off the second week of a trial over the justice departments allegations that google has a monopoly on the advertising technology market mohan who joined google as part of its acquisition of advertising software company doubleclick in \u003cTWO_THOUSAND\u003e said the search giant faced ample competition in the ad tech market google expanded into various areas of ad technology in response to demands from its business customers including publishers and advertisers he said googles success falls back to one single thing product innovation and the sale and services we were able to offer mohan said in his testimony before the u s district court for the eastern district of virginia the case stems from a lawsuit filed last year by the justice department and eight states accusing google of abusing control of its ad technology and violating antitrust law in part through the acquisition of doubleclick google has pushed up ad prices and harmed publishers by taking a big cut of each sale the government argues google has argued that the case is incorrectly focused narrowly on the split second auctions that it conducts to sell ads on web pages now the competitive market for online ads is much larger thanks to social media and other in app ads","timestamp":"2024-09-17T14:57:00+05:30","market_timestamp":"2024-09-17T14:57:00+05:30","off_market_hours":false}