{"url":"https://economictimes.indiatimes.com/tech/technology/npci-posts-37-jump-in-fy24-net-profit-to-rs-1134-crore-revenue-up-42/articleshow/113291676.cms","title":"NPCI posts 37% jump in FY24 net profit to Rs 1,134 crore, revenue up 42%","description":"NPCI has reported a 37% growth in its net profit at Rs 1,134 crore for FY24. Total revenue was up 42% at Rs 3,278 crore on a consolidated basis. Income from payment services increased 37% to Rs 2,693 crore during the reporting period.","content":"The National Payments Corporation of India (NPCI), which operates India’s homegrown Unified Payments Interface (UPI), has reported a 37% rise in net profit at Rs 1,134 crore for the fiscal year 2024.As a not-for-profit organisation, NPCI does not report profits, instead referring to it as a revenue surplus.Also, its total revenue saw a significant 42% rise to Rs 3,278 crore on a consolidated basis. In FY23, NPCI had reported a revenue of Rs 2,311 crore.The Mumbai-based retail payment network generates revenue primarily by operating services such as UPI, IMPS (Immediate Payment Service), AePS (Aadhaar Enabled Payment System), BBPS (Bharat Bill Payment System), and NCMC (National Common Mobility Card). It receives a percentage of the transaction value processed by its partner banks.NPCI’s additional revenue sources include product and membership fees collected from banks and fintech companies. It has also secured staged contracts with foreign vendors to implement its infrastructure for retail payment platforms in different geographies.","cleaned_content":"the national payments corporation of india npci which operates india s homegrown unified payments interface upi has reported a \u003cTHREE_TEN_PERCENT\u003e rise in net profit at rs \u003cONE_THOUSAND\u003e crore for the fiscal year \u003cTWO_THOUSAND\u003e as a not for profit organisation npci does not report profits instead referring to it as a revenue surplus also its total revenue saw a significant \u003cFOUR_TEN_PERCENT\u003e rise to rs \u003cTHREE_THOUSAND\u003e crore on a consolidated basis in fy23 npci had reported a revenue of rs \u003cTWO_THOUSAND\u003e crore the mumbai based retail payment network generates revenue primarily by operating services such as upi imps immediate payment service aeps aadhaar enabled payment system bbps bharat bill payment system and ncmc national common mobility card it receives a percentage of the transaction value processed by its partner banks npci s additional revenue sources include product and membership fees collected from banks and fintech companies it has also secured staged contracts with foreign vendors to implement its infrastructure for retail payment platforms in different geographies","timestamp":"2024-09-12T16:31:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}