{"url":"https://economictimes.indiatimes.com/tech/technology/bits-bytes-huawei-shows-the-world-its-2800-trifold-phone/articleshow/113354610.cms","title":"Bits \u0026 Bytes: Huawei shows the world its $2,800 ‘trifold’ phone","description":"The technology giant unveiled its Mate XT, the first tri-foldable phone, just hours after Apple introduced its AI-enhanced iPhone 16.“Apple hasn’t fallen, but Huawei has truly risen again,” commented one user on Weibo, China’s equivalent to X. Another wrote: “Times are changing. US sanctions have been in vain.”","content":"Huawei’s new tri-foldable smartphone has ignited nationalistic pride in China with social media abuzz with what supporters see as its ability to out-innovate Apple despite US sanctions — even if many are balking at the phone’s $2,800 price tag. The technology giant unveiled its Mate XT, the first tri-foldable phone, just hours after Apple introduced its AI-enhanced iPhone 16.“Apple hasn’t fallen, but Huawei has truly risen again,” commented one user on Weibo, China’s equivalent to X. Another wrote: “Times are changing. US sanctions have been in vain.”But nationalistic pride notwithstanding, the Mate XT’s starting price of 19,999 yuan ($2,800) was widely criticised as beyond the reach of ordinary consumers and insensitive at a time of sluggish economic growth. Versions with more sophisticated features will cost as much as 23,999 yuan. Microsoft says software suite recovered after outageMicrosoft said its cloud-based productivity software suite, which includes MS Word, Excel and Teams, among other widely-used tools, has recovered after an outage impacted thousands of users this week. “We can confirm the issue impacting connectivity to Microsoft services is now mitigated,” it said on X.","cleaned_content":"huawei s new tri foldable smartphone has ignited nationalistic pride in china with social media abuzz with what supporters see as its ability to out innovate apple despite us sanctions even if many are balking at the phone s \u003cTWO_THOUSAND\u003e price tag the technology giant unveiled its mate xt the first tri foldable phone just hours after apple introduced its ai enhanced iphone \u003cONE_TEN\u003e apple hasn t fallen but huawei has truly risen again commented one user on weibo china s equivalent to x another wrote times are changing us sanctions have been in vain but nationalistic pride notwithstanding the mate xt s starting price of \u003cONE_TEN_THOUSAND\u003e yuan \u003cTWO_THOUSAND\u003e was widely criticised as beyond the reach of ordinary consumers and insensitive at a time of sluggish economic growth versions with more sophisticated features will cost as much as \u003cTWO_TEN_THOUSAND\u003e yuan microsoft says software suite recovered after outagemicrosoft said its cloud based productivity software suite which includes ms word excel and teams among other widely used tools has recovered after an outage impacted thousands of users this week we can confirm the issue impacting connectivity to microsoft services is now mitigated it said on x","timestamp":"2024-09-15T06:00:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}