{"url":"https://economictimes.indiatimes.com/tech/technology/upi-transaction-value-surges-to-rs-1669-lakh-crore-in-first-five-months-of-fy25/articleshow/113541631.cms","title":"UPI transaction value surges to Rs 1,669 lakh crore in first five months of FY25","description":"The ministry stated that the transaction volume of digital payments has reached 8,659 crore during the same period. The value of UPI transactions has grown from Rs 1 lakh crore to Rs 200 lakh crore at a CAGR of 138%.","content":"The value of digital payments has surged to Rs 1,669 lakh crore in the first five months (April-August) of the current financial year 2024-25, according to Union Finance Ministry. The ministry stated that the transaction volume of digital payments has reached 8,659 crore during the same period. The value of UPI transactions has grown from Rs 1 lakh crore to Rs 200 lakh crore at a CAGR of 138%. Additionally, in the last 5 months (April-August FY2024-25), the total transaction value has surged to an impressive Rs 101 lakh crore. The Ministry of Finance in a statement on Friday highlighted that digital payments in India have witnessed significant growth, with the total number of digital payment transactions increasing from 2,071 crore in FY 2017-18 to 18,737 crore in FY 2023-24, at a compounded annual growth rate (CAGR) of 44%. \"During the last 5 months (April-August) of the current financial year 2024-25, the transaction volume has reached 8,659 crore. The value of transactions has grown from Rs 1,962 lakh crore to Rs 3,659 lakh crore at a CAGR of 11%. Additionally, in the last 5 months (April-August) of the current financial year 2024-25, the total transaction value has surged to an impressive Rs 1,669 lakh crore,\" said the ministry. The ministry also highlighted that UPI remains the cornerstone of India's digital payment ecosystem. It added that UPI has revolutionized digital payments in the country, with UPI transactions growing from 92 crore in FY 2017-18 to 13,116 crore in FY 2023-24, at a CAGR of 129%. ","cleaned_content":"the value of digital payments has surged to rs \u003cONE_THOUSAND\u003e lakh crore in the first five months april august of the current financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e according to union finance ministry the ministry stated that the transaction volume of digital payments has reached \u003cEIGHT_THOUSAND\u003e crore during the same period the value of upi transactions has grown from rs \u003cONE_\u003e lakh crore to rs \u003cTWO_HUNDRED\u003e lakh crore at a cagr of \u003cONE_HUNDRED_PERCENT\u003e additionally in the last \u003cFIVE_\u003e months april august fy2024 \u003cTWO_TEN\u003e the total transaction value has surged to an impressive rs \u003cONE_HUNDRED\u003e lakh crore the ministry of finance in a statement on friday highlighted that digital payments in india have witnessed significant growth with the total number of digital payment transactions increasing from \u003cTWO_THOUSAND\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e to \u003cONE_TEN_THOUSAND\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e at a compounded annual growth rate cagr of \u003cFOUR_TEN_PERCENT\u003e during the last \u003cFIVE_\u003e months april august of the current financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the transaction volume has reached \u003cEIGHT_THOUSAND\u003e crore the value of transactions has grown from rs \u003cONE_THOUSAND\u003e lakh crore to rs \u003cTHREE_THOUSAND\u003e lakh crore at a cagr of \u003cONE_TEN_PERCENT\u003e additionally in the last \u003cFIVE_\u003e months april august of the current financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the total transaction value has surged to an impressive rs \u003cONE_THOUSAND\u003e lakh crore said the ministry the ministry also highlighted that upi remains the cornerstone of indias digital payment ecosystem it added that upi has revolutionized digital payments in the country with upi transactions growing from \u003cNINE_TEN\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e to \u003cONE_TEN_THOUSAND\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e at a cagr of \u003cONE_HUNDRED_PERCENT\u003e","timestamp":"2024-09-21T10:15:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}