{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-adds-chatbot-for-its-sellers-boosting-automation/articleshow/113497219.cms","title":"Amazon adds chatbot for its sellers, boosting automation","description":"Amazon announced Amelia during its annual conference in its hometown where many of its roughly 450,000 US independent sellers converge for tips and tricks, and to learn about new products and services. The software, dubbed Amelia, can provide instantaneous answers to broad questions such as how to prepare for the holidays and how a seller's business is performing, including units sold and website traffic.","content":"Amazon announced on Thursday a new artificial intelligence application that it says will help its independent sellers with sales metrics, inventory maintenance and product advertising, among other things. The move is part of a broader Big Tech effort to employ the technology for greater automation. The software, dubbed Amelia, can provide instantaneous answers to broad questions such as how to prepare for the holidays and how a seller's business is performing, including units sold and website traffic. Later, the company says, the software will be able to help resolve problems of sellers such as delayed shipments without additional human intervention. In a demonstration of the software for Reuters, Amazon showed how Amelia can quickly call up metrics for a seller, such as sales data. It also made suggestions for preparing for major sales holidays, including promotions and buying advertising on Amazon.","cleaned_content":"amazon announced on thursday a new artificial intelligence application that it says will help its independent sellers with sales metrics inventory maintenance and product advertising among other things the move is part of a broader big tech effort to employ the technology for greater automation the software dubbed amelia can provide instantaneous answers to broad questions such as how to prepare for the holidays and how a sellers business is performing including units sold and website traffic later the company says the software will be able to help resolve problems of sellers such as delayed shipments without additional human intervention in a demonstration of the software for reuters amazon showed how amelia can quickly call up metrics for a seller such as sales data it also made suggestions for preparing for major sales holidays including promotions and buying advertising on amazon","timestamp":"2024-09-19T20:02:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}