{"url":"https://economictimes.indiatimes.com/tech/technology/russians-unfazed-by-higher-prices-as-iphone-pre-order-demand-soars/articleshow/113533421.cms","title":"Russians unfazed by higher prices as iPhone pre-order demand soars","description":"Russia legalised so-called \"grey\" or \"parallel\" imports to allow goods to enter the country without the brands' permission after Western companies such as iPhone maker Apple imposed export bans in 2022 in response to the war in Ukraine.","content":"Pre-order demand in Russia for the new iPhone is 15% higher than for its predecessor, one reseller told Reuters on Friday, even though it is at least 50% more expensive than in the West. Russia legalised so-called \"grey\" or \"parallel\" imports to allow goods to enter the country without the brands' permission after Western companies such as iPhone maker Apple imposed export bans in 2022 in response to the war in Ukraine. Lyudmila Semushina, a spokesperson for electronics retailer restore:, said the iPhones going on sale this month had arrived in Russia from \"all over\", without naming specific countries. Countries that have not imposed sanctions against Moscow, such as Turkey, China, India, Kazakhstan and other former Soviet states, have seen sharp increases in trade with Russia since the conflict began.  \"Comparing with last year's pre-order, (demand) is 15% higher than pre-orders were for the iPhone 15,\" Semushina said.","cleaned_content":"pre order demand in russia for the new iphone is \u003cONE_TEN_PERCENT\u003e higher than for its predecessor one reseller told reuters on friday even though it is at least \u003cFIVE_TEN_PERCENT\u003e more expensive than in the west russia legalised so called grey or parallel imports to allow goods to enter the country without the brands permission after western companies such as iphone maker apple imposed export bans in \u003cTWO_THOUSAND\u003e in response to the war in ukraine lyudmila semushina a spokesperson for electronics retailer restore said the iphones going on sale this month had arrived in russia from all over without naming specific countries countries that have not imposed sanctions against moscow such as turkey china india kazakhstan and other former soviet states have seen sharp increases in trade with russia since the conflict began comparing with last years pre order demand is \u003cONE_TEN_PERCENT\u003e higher than pre orders were for the iphone \u003cONE_TEN\u003e semushina said","timestamp":"2024-09-20T23:16:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}