{"url":"https://economictimes.indiatimes.com/tech/technology/govt-puts-spotlight-on-quick-commerce-dark-stores-modus-operandi/articleshow/113403030.cms","title":"Government to quick commerce: throw more light on dark store ownership structures","description":"The government has shot off queries to senior ecommerce executives to understand the ownership structures of quick commerce firms and their dark stores. The chief executive of one of the top three quick commerce firms told us that he recently briefed commerce and industry minister Piyush Goyal and his team on the nature of investors in the firm and its long-term plans.","content":"Government officials have in recent weeks made enquiries with several senior ecommerce executives to understand the ownership structures of quick-commerce firms and their dark stores, the mini warehouses that are crucial for the foreign-funded platforms to deliver in 15-30 minutes, people aware of the matter said.India’s foreign direct investment rules don’t allow foreign-funded online marketplaces to own inventory or control sellers on their platforms. Because of these restrictions, the dark stores are not owned by the quick-commerce platforms themselves, but by separate entities. However, there are some grey areas in their structures.Meeting With GoyalThat is where the government is seeking clarity, the people said, as the rapid expansion of quick commerce has started affecting the business of neighbourhood stores and modern retailers.The chief executive of one of the top three quick-commerce firms said he recently met commerce and industry minister Piyush Goyal and his team in Mumbai and briefed them on the nature of investors in the firm and its long-term plans.","cleaned_content":"government officials have in recent weeks made enquiries with several senior ecommerce executives to understand the ownership structures of quick commerce firms and their dark stores the mini warehouses that are crucial for the foreign funded platforms to deliver in \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e minutes people aware of the matter said india s foreign direct investment rules don t allow foreign funded online marketplaces to own inventory or control sellers on their platforms because of these restrictions the dark stores are not owned by the quick commerce platforms themselves but by separate entities however there are some grey areas in their structures meeting with goyalthat is where the government is seeking clarity the people said as the rapid expansion of quick commerce has started affecting the business of neighbourhood stores and modern retailers the chief executive of one of the top three quick commerce firms said he recently met commerce and industry minister piyush goyal and his team in mumbai and briefed them on the nature of investors in the firm and its long term plans","timestamp":"2024-09-17T07:49:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}