{"url":"https://economictimes.indiatimes.com/tech/technology/google-buys-carbon-removal-credits-from-brazil-startup-joining-microsoft/articleshow/113509526.cms","title":"Google buys carbon removal credits from Brazil startup, joining Microsoft","description":"The Brazilian startup and Google did not reveal terms of the deal. In 2023, when it sold credits to McLaren Racing, Mombak priced them at an average of more than $50 per ton.","content":"Alphabet unit Google has agreed for the first time ever to purchase nature-based carbon removal credits from a Brazilian startup, its first engagement with carbon projects in the South American country. Google will buy 50,000 metric tons of carbon removal credits by 2030 from Mombak, which purchases degraded land from farmers and ranchers or partners with them to replant native species in the Amazon rainforest, the firms said on Thursday. Google, which had previously bought engineered removal credits, follows fellow U.S. tech giant Microsoft, which last year inked a deal to buy up to 1.5 million credits from Mombak. The Brazilian startup and Google did not reveal terms of the deal. In 2023, when it sold credits to McLaren Racing, Mombak priced them at an average of more than $50 per ton. \"The vote of confidence for us and this sector in general that comes from Google stepping into this is a really positive signal,\" Mombak's Chief Technology Officer Dan Harburg said in an interview, hoping it would trigger more deals.","cleaned_content":"alphabet unit google has agreed for the first time ever to purchase nature based carbon removal credits from a brazilian startup its first engagement with carbon projects in the south american country google will buy \u003cFIVE_TEN_THOUSAND\u003e metric tons of carbon removal credits by \u003cTWO_THOUSAND\u003e from mombak which purchases degraded land from farmers and ranchers or partners with them to replant native species in the amazon rainforest the firms said on thursday google which had previously bought engineered removal credits follows fellow u s tech giant microsoft which last year inked a deal to buy up to \u003cONE_\u003e million credits from mombak the brazilian startup and google did not reveal terms of the deal in \u003cTWO_THOUSAND\u003e when it sold credits to mclaren racing mombak priced them at an average of more than \u003cFIVE_TEN\u003e per ton the vote of confidence for us and this sector in general that comes from google stepping into this is a really positive signal mombaks chief technology officer dan harburg said in an interview hoping it would trigger more deals","timestamp":"2024-09-20T09:17:00+05:30","market_timestamp":"2024-09-20T09:17:00+05:30","off_market_hours":false}