{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-completes-acquisition-of-paris-based-software-firm-zeenea/articleshow/113319969.cms","title":"HCLTech completes acquisition of Paris based software firm Zeenea","description":"This is the second acquisition that the company made in the first half of the current fiscal. Three months ago in May, the IT major announced its plans to acquire certain assets of Hewlett Packard Enterprise’s (HPE) Communications Technology Group (CTG) for $225 million (approximately Rs1,874 crore).","content":"HCLTech late night Thursday said that it completed the acquisition of Paris based software company, Zeenea SAS. The acquisition valued Zeenea at $26.5 million (23.9 million euros), according to a BSE filing.This is the second acquisition that the company made in the first half of the current fiscal. Three months ago in May, the IT major announced its plans to acquire certain assets of Hewlett Packard Enterprise’s (HPE) Communications Technology Group (CTG) for $225 million (approximately Rs1,874 crore).HCLTech had announced its intention to acquire Zeenea in August 2024. Zeenea specialises in data catalog and governance solutions. HCL plans to use this acquisition to enhance its data and analytics business (Actian).HCL Software contributes about 10% of the HCLTech’s total revenue. Even the margins at the software segment is the highest at 20.5% during the first quarter of this fiscal. The company has three business segments including HCL Software, Engineering and Research and Development, and IT and business services.Recently State Bank of India selected HCLSoftware to automate its digital marketing program. The firm said that the bank will deploy HCL Unica martech platform to transform its customer interaction framework and deliver hyper-personalized customer experiences while ensuring data privacy.","cleaned_content":"hcltech late night thursday said that it completed the acquisition of paris based software company zeenea sas the acquisition valued zeenea at \u003cTWO_TEN\u003e million \u003cTWO_TEN\u003e million euros according to a bse filing this is the second acquisition that the company made in the first half of the current fiscal three months ago in may the it major announced its plans to acquire certain assets of hewlett packard enterprise s hpe communications technology group ctg for \u003cTWO_HUNDRED\u003e million approximately rs1 874 crore hcltech had announced its intention to acquire zeenea in august \u003cTWO_THOUSAND\u003e zeenea specialises in data catalog and governance solutions hcl plans to use this acquisition to enhance its data and analytics business actian hcl software contributes about \u003cONE_TEN_PERCENT\u003e of the hcltech s total revenue even the margins at the software segment is the highest at \u003cTWO_TEN_PERCENT\u003e during the first quarter of this fiscal the company has three business segments including hcl software engineering and research and development and it and business services recently state bank of india selected hclsoftware to automate its digital marketing program the firm said that the bank will deploy hcl unica martech platform to transform its customer interaction framework and deliver hyper personalized customer experiences while ensuring data privacy","timestamp":"2024-09-13T14:39:00+05:30","market_timestamp":"2024-09-13T14:39:00+05:30","off_market_hours":false}