{"url":"https://economictimes.indiatimes.com/tech/technology/quick-commerce-is-solving-returns-question-to-ace-fashion-ecommerce/articleshow/113373688.cms","title":"Blinkit, Zepto pilot returns, exchanges to ace fashion ecommerce","description":"Quick commerce is spreading its wings to include consumer electronics, lifestyle, and fashion in its scope. The main players in the space are looking to address one of the biggest pain points of online fashion shopping—returns and exchanges.","content":"As quick commerce firms expand further into delivering apparel and lifestyle products in 10 minutes, they are looking to address one of the biggest pain points of online fashion shopping - returns and exchanges. Gurgaon-based Blinkit has started testing 10-minute returns and exchanges for apparel, footwear and a few other lifestyle items such as handbags, as per the information displayed on the company's app. Nexus Venture Partners-backed Zepto is also offering 72-hour exchanges for apparel products in case they are damaged or defective. Quick commerce executives aware of the specifics also said that certain brands are also entering into store returns agreements - wherein a customer who has purchased a particular product from the quick commerce app can return the product at an authorised outlet of the said brand. According to industry estimates, around 25-30% of the orders in online fashion are subjected to returns as users look to replace products for want of correct sizes and fittings.    ","cleaned_content":"as quick commerce firms expand further into delivering apparel and lifestyle products in \u003cONE_TEN\u003e minutes they are looking to address one of the biggest pain points of online fashion shopping returns and exchanges gurgaon based blinkit has started testing \u003cONE_TEN\u003e minute returns and exchanges for apparel footwear and a few other lifestyle items such as handbags as per the information displayed on the companys app nexus venture partners backed zepto is also offering \u003cSEVEN_TEN\u003e hour exchanges for apparel products in case they are damaged or defective quick commerce executives aware of the specifics also said that certain brands are also entering into store returns agreements wherein a customer who has purchased a particular product from the quick commerce app can return the product at an authorised outlet of the said brand according to industry estimates around \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e of the orders in online fashion are subjected to returns as users look to replace products for want of correct sizes and fittings","timestamp":"2024-09-16T07:38:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}