{"url":"https://economictimes.indiatimes.com/tech/technology/indias-gcc-count-rises-to-1700-in-fy24-revenue-up-40-at-64-6-billion-report/articleshow/113249180.cms","title":"India's GCC count rises to 1,700 in FY24, revenue up 40% at $64.6 billion: report","description":"India is the “GCC Capital of the World” with the largest base of 17% of global technology capability centers. By 2030, the GCC market in India is estimated to grow to $99-105 billion, with the number of GCCs reaching 2,100-2,200 and headcount rising to 2.5-2.8 million, the report highlighted.","content":"The number of global capability centres (GCCs) set up in India has increased to 1,700 in the fiscal year 2024 ending March, generating $64.6 billion in export revenue and employing over 1.9 million people, as per the latest Nasscom-Zinnov India GCC landscape report.The revenue is an increase of over 40% from $46 billion in the previous fiscal year ending March 2023. The total number of GCCs increased from around 1,580 employing around 1.66 million workforce.By 2030, the GCC market in India is estimated to grow to $99-105 billion, with the number of GCCs reaching 2,100-2,200 and headcount rising to 2.5-2.8 million, the report highlighted.According to the report, India is the “GCC Capital of the World” with the largest base of 17% of global technology capability centers. Although the Indian GCC landscape has become more diverse, the Americas continue their dominance with over 1000 GCC units.Further, over 220 GCC units are housed in emerging locations (Tier-II and Tier-III cities) in the country with Ahmedabad, Kochi, Thiruvananthapuram, and Coimbatore building critical mass. “While the initial wave of GCC growth was driven by large enterprises, more mid-market enterprises and unicorns are also setting up GCCs in India. Around 40 global unicorns have an India GCC presence as of 2024,” the report said.","cleaned_content":"the number of global capability centres gccs set up in india has increased to \u003cONE_THOUSAND\u003e in the fiscal year \u003cTWO_THOUSAND\u003e ending march generating \u003cSIX_TEN\u003e billion in export revenue and employing over \u003cONE_\u003e million people as per the latest nasscom zinnov india gcc landscape report the revenue is an increase of over \u003cFOUR_TEN_PERCENT\u003e from \u003cFOUR_TEN\u003e billion in the previous fiscal year ending march \u003cTWO_THOUSAND\u003e the total number of gccs increased from around \u003cONE_THOUSAND\u003e employing around \u003cONE_\u003e million workforce by \u003cTWO_THOUSAND\u003e the gcc market in india is estimated to grow to \u003cNINE_TEN\u003e \u003cONE_HUNDRED\u003e billion with the number of gccs reaching \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e and headcount rising to \u003cTWO_\u003e \u003cTWO_\u003e million the report highlighted according to the report india is the gcc capital of the world with the largest base of \u003cONE_TEN_PERCENT\u003e of global technology capability centers although the indian gcc landscape has become more diverse the americas continue their dominance with over \u003cONE_THOUSAND\u003e gcc units further over \u003cTWO_HUNDRED\u003e gcc units are housed in emerging locations tier ii and tier iii cities in the country with ahmedabad kochi thiruvananthapuram and coimbatore building critical mass while the initial wave of gcc growth was driven by large enterprises more mid market enterprises and unicorns are also setting up gccs in india around \u003cFOUR_TEN\u003e global unicorns have an india gcc presence as of \u003cTWO_THOUSAND\u003e the report said","timestamp":"2024-09-11T11:48:00+05:30","market_timestamp":"2024-09-11T11:48:00+05:30","off_market_hours":false}