{"url":"https://economictimes.indiatimes.com/tech/technology/cybercrime-emerging-as-major-threat-says-union-minister-nityanand-rai/articleshow/113511926.cms","title":"Cybercrime emerging as major threat, says Union Minister Nityanand Rai","description":"Union Minister of State for Home Nityanand Rai emphasized the growing threat of cybercrime and urged IPS officer trainees to tackle it with technical expertise. Speaking at the Dikshant Parade of the 76th batch of Regular Recruits at SVPNPA, he highlighted initiatives like cyber forensic labs.","content":"Noting that cybercrime has emerged as a major threat, Union Minister of State for Home Nityanand Rai on Friday urged IPS officer trainees to lead the endeavour to address the challenge with technical expertise. Cyber forensic lab and other initiatives have been taken by the Union Home Ministry, he said. He was speaking at the Dikshant Parade of the 76th batch of Regular Recruits of IPS at the Sardar Vallabhbhai Patel National Police Academy (SVPNPA) on Hyderabad outskirts. The Parade marked the culmination of basic course training for 207 officer trainees, including 188 IPS officers and 19 foreign officers from countries like Nepal, Bhutan and others, with a notable 58 lady officers among them.","cleaned_content":"noting that cybercrime has emerged as a major threat union minister of state for home nityanand rai on friday urged ips officer trainees to lead the endeavour to address the challenge with technical expertise cyber forensic lab and other initiatives have been taken by the union home ministry he said he was speaking at the dikshant parade of the \u003cSEVEN_TEN\u003e th batch of regular recruits of ips at the sardar vallabhbhai patel national police academy svpnpa on hyderabad outskirts the parade marked the culmination of basic course training for \u003cTWO_HUNDRED\u003e officer trainees including \u003cONE_HUNDRED\u003e ips officers and \u003cONE_TEN\u003e foreign officers from countries like nepal bhutan and others with a notable \u003cFIVE_TEN\u003e lady officers among them","timestamp":"2024-09-20T10:35:00+05:30","market_timestamp":"2024-09-20T10:35:00+05:30","off_market_hours":false}