{"url":"https://economictimes.indiatimes.com/tech/technology/indian-space-station-will-enable-research-in-bioastronautics-biological-research-drug-discovery-isro-chairman/articleshow/113532897.cms","title":"Indian Space Station will enable research in Bioastronautics, biological research, drug discovery: Isro Chairman","description":"The four projects approved by the Union Cabinet on Wednesday that includes Chandrayaan-4, Venus Orbiter Mission, a New Generation Launch Vehicle, and building the Bharatiya Antariksh Station (an extension of the Gaganyaan programme) has an outlay of around Rs. 22,000 crore, said the Indian Space Research Organisation (Isro) Chairman S Somanath.","content":"A Station in Space will enable India's astronauts to do research in Space like Bioastronautics, biological research, drug discovery, and material science research in Space, said the Indian Space Research Organisation (Isro) Chairman S Somanath here on Friday. He was talking at a press briefing at the Bengaluru Space Expo organised by the Confederation of Indian Industry (CII). \"We are also looking at how to collaborate with other nations. There are already discussions happening with other nations on how to work together in building Space Stations and its utilisations, and joint Missions etc,\" he said. Building the Space Station is an important activity. \"With India launching several satellites, it is important to have a permanent habitat, where astronauts can go and stay. Gaganyaan programme was only a one-time Mission of sending astronauts to Space but that is not enough. We need to have a continuity of Missions. Our first Mission is still not achieved, we are already looking at how we can continue this programme,\" he said. The four projects approved by the Union Cabinet on Wednesday that includes Chandrayaan-4, Venus Orbiter Mission, a New Generation Launch Vehicle, and building the Bharatiya Antariksh Station (an extension of the Gaganyaan programme) has an outlay of around Rs. 22,000 crore, he said. ","cleaned_content":"a station in space will enable indias astronauts to do research in space like bioastronautics biological research drug discovery and material science research in space said the indian space research organisation isro chairman s somanath here on friday he was talking at a press briefing at the bengaluru space expo organised by the confederation of indian industry cii we are also looking at how to collaborate with other nations there are already discussions happening with other nations on how to work together in building space stations and its utilisations and joint missions etc he said building the space station is an important activity with india launching several satellites it is important to have a permanent habitat where astronauts can go and stay gaganyaan programme was only a one time mission of sending astronauts to space but that is not enough we need to have a continuity of missions our first mission is still not achieved we are already looking at how we can continue this programme he said the four projects approved by the union cabinet on wednesday that includes chandrayaan \u003cFOUR_\u003e venus orbiter mission a new generation launch vehicle and building the bharatiya antariksh station an extension of the gaganyaan programme has an outlay of around rs \u003cTWO_TEN_THOUSAND\u003e crore he said","timestamp":"2024-09-20T22:56:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}