{"url":"https://economictimes.indiatimes.com/tech/technology/purplle-clocks-43-rise-in-fy24-revenue-to-rs-680-crore-trims-loss-by-46/articleshow/113263863.cms","title":"Purplle clocks 43% rise in FY24 revenue to Rs 680 crore, trims loss by 46%","description":"Purplle's consolidated net loss narrowed by 46% to Rs 124 crore from Rs 230 crore a year ago. Total expenses grew to Rs 850 crore in FY24 from Rs 738 crore a year earlier. A significant amount of the expenditure was attributed to employee benefit expenses which rose to Rs 191 crore from Rs 170 crore.","content":"Beauty retailer Purplle posted a 43% rise in operating revenue to Rs 680 crore for the financial year ended March 31, 2024, from Rs 475 crore in FY23. The company’s consolidated net loss narrowed by 46% to Rs 124 crore from Rs 230 crore a year ago. Total expenses grew to Rs 850 crore in FY24 from Rs 738 crore a year earlier. A significant amount of the expenditure was attributed to employee benefit expenses which rose to Rs 191 crore from Rs 170 crore.The purchase of stock-in-trade increased to Rs 124 crore from Rs 102 crore, while other expenses rose to Rs 501 crore from Rs 453 crore. On July 1, ET reported that the Mumbai-based firm raised Rs 1,000 crore ($120 million) in a funding round led by sovereign fund Abu Dhabi Investment Authority (ADIA), valuing the unicorn at $1.3 billion. Indian family offices joined in as new shareholders, with initial angel investors and existing backers such as Goldman Sachs and Verlinvest partially selling stakes.The company had also announced its largest employee stock ownership plan (Esop) buyback programme to offer liquidity of Rs 50 crore to its employees.","cleaned_content":"beauty retailer purplle posted a \u003cFOUR_TEN_PERCENT\u003e rise in operating revenue to rs \u003cSIX_HUNDRED\u003e crore for the financial year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e from rs \u003cFOUR_HUNDRED\u003e crore in fy23 the company s consolidated net loss narrowed by \u003cFOUR_TEN_PERCENT\u003e to rs \u003cONE_HUNDRED\u003e crore from rs \u003cTWO_HUNDRED\u003e crore a year ago total expenses grew to rs \u003cEIGHT_HUNDRED\u003e crore in fy24 from rs \u003cSEVEN_HUNDRED\u003e crore a year earlier a significant amount of the expenditure was attributed to employee benefit expenses which rose to rs \u003cONE_HUNDRED\u003e crore from rs \u003cONE_HUNDRED\u003e crore the purchase of stock in trade increased to rs \u003cONE_HUNDRED\u003e crore from rs \u003cONE_HUNDRED\u003e crore while other expenses rose to rs \u003cFIVE_HUNDRED\u003e crore from rs \u003cFOUR_HUNDRED\u003e crore on july \u003cONE_\u003e et reported that the mumbai based firm raised rs \u003cONE_THOUSAND\u003e crore \u003cONE_HUNDRED\u003e million in a funding round led by sovereign fund abu dhabi investment authority adia valuing the unicorn at \u003cONE_\u003e billion indian family offices joined in as new shareholders with initial angel investors and existing backers such as goldman sachs and verlinvest partially selling stakes the company had also announced its largest employee stock ownership plan esop buyback programme to offer liquidity of rs \u003cFIVE_TEN\u003e crore to its employees","timestamp":"2024-09-11T18:24:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}