{"url":"https://economictimes.indiatimes.com/tech/technology/internet-is-worse-than-it-used-to-be-how-did-we-get-here-and-can-we-go-back/articleshow/113416480.cms","title":"Internet is worse than it used to be. How did we get here, and can we go back?","description":"Your social media feeds are full of eye-catching, provocative, hyper-targeted, or anger-inducing content, from bizarre AI-generated imagery to robot-like comments. You're lucky if your video feeds are not solely made up of exhortations to \"subscribe\".","content":"When it comes to our experience of the internet, \"the times, they are a-changin'\", as Bob Dylan would say. You can't quite recall how, but the internet certainly feels different these days. To some, it is \"less fun and less informative\" than it used to be. To others, online searches are made up of \"cookie cutter\" pages that drown out useful information and are saturated with scams, spam and content generated by artificial intelligence (AI). Your social media feeds are full of eye-catching, provocative, hyper-targeted, or anger-inducing content, from bizarre AI-generated imagery to robot-like comments. You're lucky if your video feeds are not solely made up of exhortations to \"subscribe\". How did we get here? And can we claw our way back?  Commercial interests rule ","cleaned_content":"when it comes to our experience of the internet the times they are a changin as bob dylan would say you cant quite recall how but the internet certainly feels different these days to some it is less fun and less informative than it used to be to others online searches are made up of cookie cutter pages that drown out useful information and are saturated with scams spam and content generated by artificial intelligence ai your social media feeds are full of eye catching provocative hyper targeted or anger inducing content from bizarre ai generated imagery to robot like comments youre lucky if your video feeds are not solely made up of exhortations to subscribe how did we get here and can we claw our way back commercial interests rule","timestamp":"2024-09-17T12:14:00+05:30","market_timestamp":"2024-09-17T12:14:00+05:30","off_market_hours":false}