{"url":"https://economictimes.indiatimes.com/tech/technology/morgan-stanley-latest-to-downgrade-asml-on-china-memory-intel-concerns/articleshow/113555982.cms","title":"Morgan Stanley latest to downgrade ASML on China, memory, Intel concerns","description":"MS followed UBS and Deutsche Bank in cutting estimates and reducing share price targets for ASML after the company's share price slid 30% in July and August. \"Investors may have to wrestle with weakness not just with DRAM (memory chip market) but also with Intel ... and the growing concern that China semiconductor capacity overspend will slow as we look to 2026,\" MS analysts wrote.","content":"Morgan Stanley on Friday downgraded earnings estimates for computer chip equipment maker ASML, the latest brokerage to do so following weakness in the memory chip market and concerns over demand from Chinese chipmakers and Intel. MS followed UBS and Deutsche Bank in cutting estimates and reducing share price targets for ASML after the company's share price slid 30% in July and August. \"Investors may have to wrestle with weakness not just with DRAM (memory chip market) but also with Intel ... and the growing concern that China semiconductor capacity overspend will slow as we look to 2026,\" MS analysts wrote. ASML's shares were down 2.7% at 727.80 euros at 1209 GMT on Friday. Intel last week paused its plans to expand in Germany for two years as it cuts capital spending amid a major rehaul of its bespoke chip-making arm.  MS hedged its advice, noting that ASML will still see a strong 2025 with AI-linked demand for its most advanced EUV tools from top chip manufacturer TSMC.","cleaned_content":"morgan stanley on friday downgraded earnings estimates for computer chip equipment maker asml the latest brokerage to do so following weakness in the memory chip market and concerns over demand from chinese chipmakers and intel ms followed ubs and deutsche bank in cutting estimates and reducing share price targets for asml after the companys share price slid \u003cTHREE_TEN_PERCENT\u003e in july and august investors may have to wrestle with weakness not just with dram memory chip market but also with intel and the growing concern that china semiconductor capacity overspend will slow as we look to \u003cTWO_THOUSAND\u003e ms analysts wrote asmls shares were down \u003cTWO_PERCENT\u003e at \u003cSEVEN_HUNDRED\u003e euros at \u003cONE_THOUSAND\u003e gmt on friday intel last week paused its plans to expand in germany for two years as it cuts capital spending amid a major rehaul of its bespoke chip making arm ms hedged its advice noting that asml will still see a strong \u003cTWO_THOUSAND\u003e with ai linked demand for its most advanced euv tools from top chip manufacturer tsmc","timestamp":"2024-09-21T21:26:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}