{"url":"https://economictimes.indiatimes.com/tech/technology/going-once-going-twice-googles-millisecond-ad-auctions-are-the-focus-of-monopoly-claim/articleshow/113343900.cms","title":"Going once, going twice: Google's millisecond ad auctions are the focus of monopoly claim","description":"The Justice Department and several states allege that Google's dominance in online ad sales constitutes an illegal monopoly. A trial in Virginia is examining whether Google's ad tech stack unfairly favors its own products, depriving publishers of revenue. Google argues its innovations have improved ad quality and market efficiency.","content":"It happens in milliseconds, ideally, as you browse the web. Networks of computers and software analyze who you are, what you are looking at and buy and sell the advertisements you see on web pages. The company that most likely determines which ads you get, and how much an advertiser paid to get on your screen, is Google. In fact, the Justice Department and a coalition of states say Google's dominance over the technology that controls the sale of billions of Internet display ads every day is so thorough that it constitutes an illegal monopoly that should be broken up. A trial under way in federal court in Alexandria, Virginia, will determine if Google's ad tech stack constitutes an illegal monopoly. The first week has included a deep dive into exactly how Google's products work together to conduct behind-the-scenes electronic auctions that place ads in front of consumers in the blink of an eye. Online advertising has rapidly evolved. Fifteen or so years ago, if you saw an internet display ad, there was a pretty good chance it featured people dancing over their enthusiasm for low mortgage rates, and those ads were foisted on you whether you were looking at real estate or searching for baseball scores. ","cleaned_content":"it happens in milliseconds ideally as you browse the web networks of computers and software analyze who you are what you are looking at and buy and sell the advertisements you see on web pages the company that most likely determines which ads you get and how much an advertiser paid to get on your screen is google in fact the justice department and a coalition of states say googles dominance over the technology that controls the sale of billions of internet display ads every day is so thorough that it constitutes an illegal monopoly that should be broken up a trial under way in federal court in alexandria virginia will determine if googles ad tech stack constitutes an illegal monopoly the first week has included a deep dive into exactly how googles products work together to conduct behind the scenes electronic auctions that place ads in front of consumers in the blink of an eye online advertising has rapidly evolved fifteen or so years ago if you saw an internet display ad there was a pretty good chance it featured people dancing over their enthusiasm for low mortgage rates and those ads were foisted on you whether you were looking at real estate or searching for baseball scores","timestamp":"2024-09-14T12:50:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}