{"url":"https://economictimes.indiatimes.com/tech/technology/samsung-sues-indian-labour-union-over-strike-as-dispute-escalates/articleshow/113492436.cms","title":"Samsung sues Indian labour union over strike as dispute escalates","description":"Samsung's lawsuit dated Sept. 12, which Reuters is the first to report, asks a district court in the state for a temporary injunction to restrain the union and its members from agitating, sloganeering and making speeches in and around the factory located near Chennai.","content":"Samsung Electronics' Indian unit has sued members of a labour union that has led a strike for 11 days at its only India home appliances plant in the southern state of Tamil Nadu, escalating tensions with its workers, legal papers show. Samsung's lawsuit dated Sept. 12, which Reuters is the first to report, asks a district court in the state for a temporary injunction to restrain the union and its members from agitating, sloganeering and making speeches in and around the factory located near Chennai. Lawyers were gathered in a court, near Chennai, in Kancheepuram district, where the case was expected to be heard on Thursday. Hundreds of Samsung workers have since Sept. 9 disrupted work and protested in a nearby makeshift tent, demanding higher wages and recognition of a union at the plant that contributes roughly a third of Samsung's annual India revenue of $12 billion. The Samsung protests have cast a shadow over Indian Prime Minister Narendra Modi's plan to court foreign investors to \"Make in India\" and to triple electronics production to $500 billion in six years.","cleaned_content":"samsung electronics indian unit has sued members of a labour union that has led a strike for \u003cONE_TEN\u003e days at its only india home appliances plant in the southern state of tamil nadu escalating tensions with its workers legal papers show samsungs lawsuit dated sept \u003cONE_TEN\u003e which reuters is the first to report asks a district court in the state for a temporary injunction to restrain the union and its members from agitating sloganeering and making speeches in and around the factory located near chennai lawyers were gathered in a court near chennai in kancheepuram district where the case was expected to be heard on thursday hundreds of samsung workers have since sept \u003cNINE_\u003e disrupted work and protested in a nearby makeshift tent demanding higher wages and recognition of a union at the plant that contributes roughly a third of samsungs annual india revenue of \u003cONE_TEN\u003e billion the samsung protests have cast a shadow over indian prime minister narendra modis plan to court foreign investors to make in india and to triple electronics production to \u003cFIVE_HUNDRED\u003e billion in six years","timestamp":"2024-09-19T16:54:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}