{"url":"https://economictimes.indiatimes.com/tech/technology/mamaearth-shares-tumble-5-after-rs-1763-crore-stake-sale-via-block-deal/articleshow/113283207.cms","title":"Mamaearth shares tumble 5% after Rs 1,763 crore stake sale via block deal","description":"Honasa Consumer Share Price: Shares of Honasa Consumer, the parent company of Mamaearth, fell 5% to a day’s low of Rs 495 on the NSE following a block deal on Thursday involving a 10.9% equity stake valued at Rs 1,763 crore. The likely sellers include Peak XV Partners Investments VI, Redwood Trust, Sequoia Capital Global Growth Fund III, Fireside Ventures Investment Fund I, Stellaris Venture Partners India, and Sofina Ventures SA.","content":"Shares of Honasa Consumer, the parent company of Mamaearth, dipped 5% to a day’s low of Rs 495 on the NSE after the company saw a 10.9% equity stake worth Rs 1,763 crore sold via a block deal on Thursday.Reportedly, the likely sellers in the transaction include Peak XV Partners Investments VI, Redwood Trust, Sequoia Capital Global Growth Fund III - U.S./India Annex Fund, Fireside Ventures Investment Fund I, Stellaris Venture Partners India, and Sofina Ventures SA.It was initially reported that the sellers would offload an 8% equity stake in the company, equivalent to 263 crore shares valued at Rs 1,261 crore. However, the deal size was later increased to a sale of 10.8%.Also Read: Varun Beverages shares rally 6% as stock begins trading on ex-split basis The deal likely occurred at Rs 480 per share, which represents an 8% discount from Wednesday’s closing price.","cleaned_content":"shares of honasa consumer the parent company of mamaearth dipped \u003cFIVE_PERCENT\u003e to a day s low of rs \u003cFOUR_HUNDRED\u003e on the nse after the company saw a \u003cONE_TEN_PERCENT\u003e equity stake worth rs \u003cONE_THOUSAND\u003e crore sold via a block deal on thursday reportedly the likely sellers in the transaction include peak xv partners investments vi redwood trust sequoia capital global growth fund iii u s india annex fund fireside ventures investment fund i stellaris venture partners india and sofina ventures sa it was initially reported that the sellers would offload an \u003cEIGHT_PERCENT\u003e equity stake in the company equivalent to \u003cTWO_HUNDRED\u003e crore shares valued at rs \u003cONE_THOUSAND\u003e crore however the deal size was later increased to a sale of \u003cONE_TEN_PERCENT\u003e also read varun beverages shares rally \u003cSIX_PERCENT\u003e as stock begins trading on ex split basis the deal likely occurred at rs \u003cFOUR_HUNDRED\u003e per share which represents an \u003cEIGHT_PERCENT\u003e discount from wednesday s closing price","timestamp":"2024-09-12T11:54:00+05:30","market_timestamp":"2024-09-12T11:54:00+05:30","off_market_hours":false}