{"url":"https://economictimes.indiatimes.com/tech/technology/blinkit-bbnow-to-deliver-iphone-16-within-minutes/articleshow/113524283.cms","title":"Blinkit, BB Now, Zepto deliver iPhone 16 within minutes","description":"The US technology major launched the iPhone 16 series in the second week of September, and the phone became available today. The base variant, featuring 128GB of storage, is priced at Rs 79,900.","content":"Expanding beyond daily essentials like groceries, Zomato-owned Blinkit and BigBasket’s BBNow announced today that Apple iPhones will now be delivered within minutes, intensifying competition in India’s red-hot quick commerce sector.Albinder Dhindsa, cofounder and CEO of Blinkit, shared on the microblogging platform X on Friday that Blinkit has partnered with Apple reseller Unicorn Info Solutions to deliver the newly launched iPhone 16 in cities such as Delhi NCR, Mumbai, Pune and Bengaluru on the launch day of the iPhone 16 series.“Get the all-new iPhone 16 delivered in 10 minutes! We’ve partnered with @UnicornAPR for the third year in a row, bringing the latest iPhone to Blinkit customers in Delhi NCR, Mumbai, Pune, Bengaluru (for now) — on launch day!, ” Dhindsa wrote on X.","cleaned_content":"expanding beyond daily essentials like groceries zomato owned blinkit and bigbasket s bbnow announced today that apple iphones will now be delivered within minutes intensifying competition in india s red hot quick commerce sector albinder dhindsa cofounder and ceo of blinkit shared on the microblogging platform x on friday that blinkit has partnered with apple reseller unicorn info solutions to deliver the newly launched iphone \u003cONE_TEN\u003e in cities such as delhi ncr mumbai pune and bengaluru on the launch day of the iphone \u003cONE_TEN\u003e series get the all new iphone \u003cONE_TEN\u003e delivered in \u003cONE_TEN\u003e minutes we ve partnered with unicornapr for the third year in a row bringing the latest iphone to blinkit customers in delhi ncr mumbai pune bengaluru for now on launch day dhindsa wrote on x","timestamp":"2024-09-20T21:43:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}