{"url":"https://economictimes.indiatimes.com/tech/technology/michelin-to-lay-foundation-stone-for-passenger-car-tyre-facility-at-tn-plant/articleshow/113533514.cms","title":"Michelin to lay foundation stone for passenger car tyre facility at TN plant","description":"\"India is a very big market and (there are) many Indias within India,\" Gaganjot Singh, president and managing director - Africa, India and Middle East at Michelin, said. \"We cater to the premium segment (and) we believe that we are achieving a critical mass in the premium segment, which is now going to grow significantly in the years to come.\"","content":"French tyre maker Michelin is investing Rs 564 crore in its plant near Chennai to add a passenger car tyre manufacturing facility, as part of a strategy to enhance its strategic presence in the Indian market, the company's top executives told ET.The foundation stone for the brownfield manufacturing facility will be laid on Saturday and production is expected to commence in the third quarter of 2025.\"India is a very big market and (there are) many Indias within India,\" Gaganjot Singh, president and managing director - Africa, India and Middle East at Michelin, said. \"We cater to the premium segment (and) we believe that we are achieving a critical mass in the premium segment, which is now going to grow significantly in the years to come.\"He said the investment decision for the Clermont-Ferrand-based tyre major was driven by several factors, including wanting to go \"local to local\" while also employing local talent.\"Additionally also, we stand for (being a) premium product and we want to give premium service or be closer to the market, provide our products when they are needed, where they are needed,\" said Singh.","cleaned_content":"french tyre maker michelin is investing rs \u003cFIVE_HUNDRED\u003e crore in its plant near chennai to add a passenger car tyre manufacturing facility as part of a strategy to enhance its strategic presence in the indian market the companys top executives told et the foundation stone for the brownfield manufacturing facility will be laid on saturday and production is expected to commence in the third quarter of \u003cTWO_THOUSAND\u003e india is a very big market and there are many indias within india gaganjot singh president and managing director africa india and middle east at michelin said we cater to the premium segment and we believe that we are achieving a critical mass in the premium segment which is now going to grow significantly in the years to come he said the investment decision for the clermont ferrand based tyre major was driven by several factors including wanting to go local to local while also employing local talent additionally also we stand for being a premium product and we want to give premium service or be closer to the market provide our products when they are needed where they are needed said singh","timestamp":"2024-09-21T06:00:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}