{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musk-calls-australian-government-fascists-over-misinformation-law/articleshow/113307938.cms","title":"Elon Musk calls Australian government 'fascists' over misinformation law","description":"Elon Musk criticized Australia's center-left government, calling them \"fascists\" over proposed legislation to fine social media firms for failing to prevent misinformation. The law could fine platforms up to 5% of global revenue and require codes of conduct. Government officials defended the bill, emphasizing transparency and accountability.","content":"Elon Musk, owner of social media platform X, on Friday called Australia's centre-left government \"fascists\" over proposed legislation to slap fines on social media firms for failing to prevent the spread of misinformation online. Australia's Labor government on Thursday unveiled legislation which could fine internet platforms up to 5% of their global revenue for enabling misinformation, joining a worldwide push to rein in borderless tech giants. The proposed law would require tech platforms to set codes of conduct to stop dangerous falsehoods spreading and be approved by a regulator. The regulator would set its own standard if a platform failed to do so and fine firms for non-compliance. Musk, who views himself as a champion of free speech, responded to a post by an X user linking the Reuters story about the misinformation law with one word: \"Fascists\". A spokesperson for Communications Minister Michelle Rowland said by email that companies operating in Australia must comply with Australian laws.","cleaned_content":"elon musk owner of social media platform x on friday called australias centre left government fascists over proposed legislation to slap fines on social media firms for failing to prevent the spread of misinformation online australias labor government on thursday unveiled legislation which could fine internet platforms up to \u003cFIVE_PERCENT\u003e of their global revenue for enabling misinformation joining a worldwide push to rein in borderless tech giants the proposed law would require tech platforms to set codes of conduct to stop dangerous falsehoods spreading and be approved by a regulator the regulator would set its own standard if a platform failed to do so and fine firms for non compliance musk who views himself as a champion of free speech responded to a post by an x user linking the reuters story about the misinformation law with one word fascists a spokesperson for communications minister michelle rowland said by email that companies operating in australia must comply with australian laws","timestamp":"2024-09-13T08:24:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}