{"url":"https://economictimes.indiatimes.com/tech/technology/glas-trust-moves-sc-to-challenge-removal-from-byjus-committee-of-creditors/articleshow/113431980.cms","title":"Glas Trust moves SC to challenge removal from Byju's committee of creditors","description":"Senior counsel Kapil Sibal, appearing for Glas Trust, which have claims of around Rs 11,500 crore, told a Bench led by Chief Justice DY Chandrachud that the US lender party was a financial creditor and had over 99% vote share.","content":"Glas Trust, the trustee for lenders to which Byju's owes $1.2 billion, on Tuesday moved the Supreme Court challenging its removal by the interim resolution professional from the committee of creditors (CoC) of the debt-ridden Think \u0026 Learn Pvt Ltd, the parent of online educational services company. The US lender has also sought removal of Pankaj Srivastava, the IRP of Think \u0026 Learn.Senior counsel Kapil Sibal, appearing for Glas Trust, which have claims of around Rs 11,500 crore, told a Bench led by Chief Justice DY Chandrachud that the US lender party was a financial creditor and had over 99% vote share. However, the IRP disqualified and removed it as some documents had not been provided to it. “My (Glas Trust) removal from the list of creditors has brought down its voting share in the CoC from 99.41% to zero,” he argued.“The actions of IRP clearly amount to adjudicating on claims, which is impermissible and beyond the scope of his duties and powers as IRP of the corporate debtor,’ the US lender said in its appeal.On September 3, Srivastava had removed Glas Trust after noting that it did not represent the minimum 51% of lenders in the consortium that provided a $1.2 billion term loan to the company. This was challenged by the US lender in NCLT, Bengaluru bench.Glas Trust said that the NCLT instead of passing necessary urgent directions merely renotified the matter on the ground that the issue is pending before the SC. Further, the NCLT directed that The Board of Control for Cricket in India (BCCI), in its capacity as an operational creditor, be impleaded as a party in its plea seeking removal of IRP. \"The NCLT has completely overlooked the settled position of law that an operational creditor has no role in the appointment of the Resolution Professional once the CIRP is initiated,\" Glass Trust said in its appeal.","cleaned_content":"glas trust the trustee for lenders to which byjus owes \u003cONE_\u003e billion on tuesday moved the supreme court challenging its removal by the interim resolution professional from the committee of creditors coc of the debt ridden think learn pvt ltd the parent of online educational services company the us lender has also sought removal of pankaj srivastava the irp of think learn senior counsel kapil sibal appearing for glas trust which have claims of around rs \u003cONE_TEN_THOUSAND\u003e crore told a bench led by chief justice dy chandrachud that the us lender party was a financial creditor and had over \u003cNINE_TEN_PERCENT\u003e vote share however the irp disqualified and removed it as some documents had not been provided to it my glas trust removal from the list of creditors has brought down its voting share in the coc from \u003cNINE_TEN_PERCENT\u003e to zero he argued the actions of irp clearly amount to adjudicating on claims which is impermissible and beyond the scope of his duties and powers as irp of the corporate debtor the us lender said in its appeal on september \u003cTHREE_\u003e srivastava had removed glas trust after noting that it did not represent the minimum \u003cFIVE_TEN_PERCENT\u003e of lenders in the consortium that provided a \u003cONE_\u003e billion term loan to the company this was challenged by the us lender in nclt bengaluru bench glas trust said that the nclt instead of passing necessary urgent directions merely renotified the matter on the ground that the issue is pending before the sc further the nclt directed that the board of control for cricket in india bcci in its capacity as an operational creditor be impleaded as a party in its plea seeking removal of irp the nclt has completely overlooked the settled position of law that an operational creditor has no role in the appointment of the resolution professional once the cirp is initiated glass trust said in its appeal","timestamp":"2024-09-18T08:46:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}