{"url":"https://economictimes.indiatimes.com/tech/technology/tiktoks-us-future-hangs-in-balance-at-federal-court/articleshow/113378492.cms","title":"TikTok's US future hangs in balance at federal court","description":"TikTok will attempt to convince a federal court on Monday that a law requiring the video-sharing app to divest from its Chinese ownership or face a ban in the United States is unconstitutional. Democratic President Joe Biden, whose vice president Kamala Harris is running against Trump, signed the law that gives TikTok until January to shed its Chinese ownership or be expelled from the US market.","content":"TikTok will attempt to convince a federal court on Monday that a law requiring the video-sharing app to divest from its Chinese ownership or face a ban in the United States is unconstitutional.The fate of Americans' access to TikTok has become a prominent issue in the country's political debate, with Republican presidential candidate Donald Trump opposing any ban of the wildly popular app. Democratic President Joe Biden, whose vice president Kamala Harris is running against Trump, signed the law that gives TikTok until January to shed its Chinese ownership or be expelled from the US market.ByteDance, TikTok's parent company, has stated it has no plans to sell TikTok, leaving the app's legal appeal -- focused on US guarantees for free speech -- as its only option for survival.A ban would likely provoke a strong response from the Chinese government and further strain US-China relations.","cleaned_content":"tiktok will attempt to convince a federal court on monday that a law requiring the video sharing app to divest from its chinese ownership or face a ban in the united states is unconstitutional the fate of americans access to tiktok has become a prominent issue in the countrys political debate with republican presidential candidate donald trump opposing any ban of the wildly popular app democratic president joe biden whose vice president kamala harris is running against trump signed the law that gives tiktok until january to shed its chinese ownership or be expelled from the us market bytedance tiktoks parent company has stated it has no plans to sell tiktok leaving the apps legal appeal focused on us guarantees for free speech as its only option for survival a ban would likely provoke a strong response from the chinese government and further strain us china relations","timestamp":"2024-09-16T08:00:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}