{"url":"https://economictimes.indiatimes.com/tech/technology/google-offered-to-sell-part-of-ad-tech-business-not-enough-for-eu-publishers/articleshow/113473667.cms","title":"Google offered to sell part of ad tech business, not enough for EU publishers","description":"Google's offer to sell its AdX advertising marketplace to end an EU antitrust investigation was rejected by European publishers as insufficient. The EU may order Google to stop anti-competitive practices instead of divesting assets for now. Google's ad tech business is under scrutiny after a complaint from the European Publishers Council.","content":"Alphabet's Google took a major step this year to end an EU antitrust investigation with an offer to sell its advertising marketplace AdX but European publishers rejected the proposal as insufficient, two people with direct knowledge of the matter said on Wednesday. Google's lucrative ad tech business attracted EU regulatory scrutiny last year following a complaint from the European Publishers Council. The European Commission subsequently charged Google with favouring its own advertising services, opening its fourth case against the world's most-popular search engine. Google has never before offered to sell an asset in an antitrust case, according to three lawyers involved in antitrust cases who did not have permission to speak publicly. The company is on trial in the U.S., fighting claims by antitrust authorities who seek to make Google sell its Ad Manager product, which contains AdX and Google's publisher ad server, known as DFP. Publishers rejected Google's proposal because they want it to divest more than just AdX to address conflicts of interest due to its presence in almost all levels of the ad tech supply chain, the people said. They said the EU antitrust enforcer was aware of the offer. \"As we have said before, the European Commission's case about our third-party display advertising products rests on flawed interpretations of the ad-tech sector, which is fiercely competitive and rapidly evolving. We remain committed to this business,\" a Google spokesperson said.","cleaned_content":"alphabets google took a major step this year to end an eu antitrust investigation with an offer to sell its advertising marketplace adx but european publishers rejected the proposal as insufficient two people with direct knowledge of the matter said on wednesday googles lucrative ad tech business attracted eu regulatory scrutiny last year following a complaint from the european publishers council the european commission subsequently charged google with favouring its own advertising services opening its fourth case against the worlds most popular search engine google has never before offered to sell an asset in an antitrust case according to three lawyers involved in antitrust cases who did not have permission to speak publicly the company is on trial in the u s fighting claims by antitrust authorities who seek to make google sell its ad manager product which contains adx and googles publisher ad server known as dfp publishers rejected googles proposal because they want it to divest more than just adx to address conflicts of interest due to its presence in almost all levels of the ad tech supply chain the people said they said the eu antitrust enforcer was aware of the offer as we have said before the european commissions case about our third party display advertising products rests on flawed interpretations of the ad tech sector which is fiercely competitive and rapidly evolving we remain committed to this business a google spokesperson said","timestamp":"2024-09-19T08:08:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}