{"url":"https://economictimes.indiatimes.com/tech/technology/tata-electronics-to-partially-resume-work-at-fire-hit-iphone-component-plant/articleshow/113895208.cms","title":"Tata Electronics to partially resume work at fire-hit iPhone component plant","description":"Tata Electronics said on Thursday that it will restart some of its operations at the fire-hit plant in southern India, which makes Apple iPhone components. \"We have been working diligently since Saturday...to identify the cause of the fire at our Hosur facility,\" a company spokesperson said.","content":"Tata Electronics said on Thursday it will restart some of its operations at the fire-hit plant in the southern Indian state of Tamil Nadu, which makes Apple iPhone components.A fire broke out in one of the six units at the plant in the early hours of Saturday. Fire and local government officials told Reuters that the incident occurred at an area where chemicals were stored.\"We plan to restart work in many areas of the facility today. And as we work toward resuming full operations, all our team members will continue to receive full pay,\" a company spokesperson said.District authorities and the company are yet to ascertain the cause of the fire.The Director of Industries for the state has given the company a go-ahead to start operations, district administrative official K.M. Sarayu said.","cleaned_content":"tata electronics said on thursday it will restart some of its operations at the fire hit plant in the southern indian state of tamil nadu which makes apple iphone components a fire broke out in one of the six units at the plant in the early hours of saturday fire and local government officials told reuters that the incident occurred at an area where chemicals were stored we plan to restart work in many areas of the facility today and as we work toward resuming full operations all our team members will continue to receive full pay a company spokesperson said district authorities and the company are yet to ascertain the cause of the fire the director of industries for the state has given the company a go ahead to start operations district administrative official k m sarayu said","timestamp":"2024-10-03T12:08:00+05:30","market_timestamp":"2024-10-03T12:08:00+05:30","off_market_hours":false}