{"url":"https://economictimes.indiatimes.com/tech/technology/samsung-invests-1-8-billion-more-in-vietnam-for-oled-manufacturing-plant/articleshow/113590893.cms","title":"Samsung invests $1.8 billion more in Vietnam for OLED manufacturing plant","description":"Samsung Display Co plans to invest $1.8 billion in a new factory in northern Vietnam to produce OLED displays for automobiles and technology equipment. The facility will be located in Yen Phong industrial park, Bac Ninh province, raising Samsung's total investment in the area to $8.3 billion from the current $6.5 billion.","content":"South Korean electronic manufacturer Samsung Display Co plans to invest $1.8 billion for a factory this year in northern Vietnam to produce OLED displays for automobiles and technology equipment, the Southeast Asian country said on Sunday. The new facility for the manufacture of organic light-emitting diode (OLED) displays will be located in Yen Phong industrial park in Bac Ninh province east of Hanoi and close to an existing Samsung electronics plant, the government said in a statement released after the meeting between Prime Minister Pham Minh Chinh and the General Director of Samsung Vietnam Choi Joo Ho. Bac Ninh authorities and Samsung Display on Sunday also signed a memorandum of understanding of the project, local media reported, adding the investment would raise Samsung's total investment in Bac Ninh to $8.3 billion from the current $6.5 billion. Vietnam has over the last decade emerged as one of the most attractive production hubs for electronics companies. According to Choi, Samsung has established six manufacturing plants, one research and development centre, and one sales entity in Vietnam, with a cumulative investment of $22.4 billion.","cleaned_content":"south korean electronic manufacturer samsung display co plans to invest \u003cONE_\u003e billion for a factory this year in northern vietnam to produce oled displays for automobiles and technology equipment the southeast asian country said on sunday the new facility for the manufacture of organic light emitting diode oled displays will be located in yen phong industrial park in bac ninh province east of hanoi and close to an existing samsung electronics plant the government said in a statement released after the meeting between prime minister pham minh chinh and the general director of samsung vietnam choi joo ho bac ninh authorities and samsung display on sunday also signed a memorandum of understanding of the project local media reported adding the investment would raise samsungs total investment in bac ninh to \u003cEIGHT_\u003e billion from the current \u003cSIX_\u003e billion vietnam has over the last decade emerged as one of the most attractive production hubs for electronics companies according to choi samsung has established six manufacturing plants one research and development centre and one sales entity in vietnam with a cumulative investment of \u003cTWO_TEN\u003e billion","timestamp":"2024-09-23T08:56:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}