{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-explainer-timeline-of-ccis-antitrust-probe-into-amazon-and-flipkart/articleshow/113598290.cms","title":"ETtech Explainer: Timeline of CCI's antitrust probe into Amazon and Flipkart","description":"In the antitrust case against Amazon and Flipkart, the Competition Commission of India (CCI) has sought the financial statements of the two ecommerce players to help determine the penalty. How did the four-year-long case begin, and what’s next? ETtech explains.","content":"Ecommerce majors Flipkart and Amazon are in the throes of an antitrust investigation by the Competition Commission of India (CCI), for favouring select sellers on their platforms. The case, which began four years ago, comes ahead of the festive season which is most lucrative for these companies.ETtech takes a look at its genesis and the timeline:Timeline of the caseThe case started in October 2019, when traders body Delhi Vyapar Mahasangh, an affiliate of the Confederation of All India Traders (CAIT), petitioned the CCI against Amazon and Flipkart, saying the platforms favour some sellers over others. The matter was then escalated to the federal government.In January 2020, the CCI passed an order and called for an investigation into Amazon and Flipkart, asking the Director General to probe the issue. The ecommerce giants challenged the verdict in various lower courts, denying any wrongdoing and mounted legal challenges, even going up to the Supreme Court against the investigation. They said the antitrust body did not have enough evidence to pursue the matter.","cleaned_content":"ecommerce majors flipkart and amazon are in the throes of an antitrust investigation by the competition commission of india cci for favouring select sellers on their platforms the case which began four years ago comes ahead of the festive season which is most lucrative for these companies ettech takes a look at its genesis and the timeline timeline of the casethe case started in october \u003cTWO_THOUSAND\u003e when traders body delhi vyapar mahasangh an affiliate of the confederation of all india traders cait petitioned the cci against amazon and flipkart saying the platforms favour some sellers over others the matter was then escalated to the federal government in january \u003cTWO_THOUSAND\u003e the cci passed an order and called for an investigation into amazon and flipkart asking the director general to probe the issue the ecommerce giants challenged the verdict in various lower courts denying any wrongdoing and mounted legal challenges even going up to the supreme court against the investigation they said the antitrust body did not have enough evidence to pursue the matter","timestamp":"2024-09-23T15:58:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}