{"url":"https://economictimes.indiatimes.com/tech/technology/dell-asks-global-sales-team-to-work-five-days-a-week-in-office-memo-says/articleshow/113720894.cms","title":"Dell asks global sales team to work five days a week in office, memo says","description":"The change is to leverage collaborative environment and \"grow skills\", which requires the team to be in the office, the memo said. \"Working remotely should be the exception rather than the routine,\" it added.","content":"Dell Technologies said on Thursday that their global sales team employees who are able to work from the company offices must do so five days a week, starting Sept. 30, according to a memo seen by Reuters. The change is to leverage collaborative environment and \"grow skills\", which requires the team to be in the office, the memo said. \"Working remotely should be the exception rather than the routine,\" it added. The field representatives from the sales team are expected to spend five days a week with customers and partners, or in the office. The team was previously required to work from the office for three days per week, according to the memo.  \"Remote sales team members who can't go into a Dell office should continue to work remotely,\" Dell added. The company also mentioned that it will provide more information related to remote workers in the coming weeks. ","cleaned_content":"dell technologies said on thursday that their global sales team employees who are able to work from the company offices must do so five days a week starting sept \u003cTHREE_TEN\u003e according to a memo seen by reuters the change is to leverage collaborative environment and grow skills which requires the team to be in the office the memo said working remotely should be the exception rather than the routine it added the field representatives from the sales team are expected to spend five days a week with customers and partners or in the office the team was previously required to work from the office for three days per week according to the memo remote sales team members who cant go into a dell office should continue to work remotely dell added the company also mentioned that it will provide more information related to remote workers in the coming weeks","timestamp":"2024-09-27T08:18:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}