{"url":"https://economictimes.indiatimes.com/tech/technology/zerodha-not-increasing-brokerage-charges-yet-nithin-kamath/articleshow/113846614.cms","title":"Zerodha not increasing brokerage charges yet: Nithin Kamath","description":"Nithin Kamath, CEO of Zerodha, announced that Zerodha will not increase brokerage charges despite new SEBI regulations standardizing transaction fees across brokers. The new fees, effective from October 1, are expected to reduce Zerodha's revenue by 10%.","content":"Bengaluru-based billionaire Nithin Kamath, who previously warned that all stock brokers may be forced to tweak their business models following Sebi's true-to-label circular, stated on Tuesday that Zerodha will not be increasing its brokerage charges.\"Equity delivery will continue to be free at Zerodha. As of now, we are not making any changes to our brokerage,\" Kamath wrote on social media platform X.Sebi's true-to-label circular came into effect from today, October 1, after which stock exchanges BSE and NSE have started charging a uniform fee structure as opposed to the previous regime of transaction fee based on the overall turnover contributed by a broker in a month.So far, brokers with higher turnover paid a lower transaction fee to stock exchanges. With effect from October 1, NSE will levy a transaction fee of Rs 2.97 on each side per lakh of traded value in the cash market. In equity futures, it will be Rs 1.73 each side per lakh of traded value. For equity options, the transaction fees will be Rs 35.03 on each side per lakh of premium value.For Sensex and Bankex options contracts, the transaction fee is revised to Rs 3,250 per crore of the premium turnover value.","cleaned_content":"bengaluru based billionaire nithin kamath who previously warned that all stock brokers may be forced to tweak their business models following sebis true to label circular stated on tuesday that zerodha will not be increasing its brokerage charges equity delivery will continue to be free at zerodha as of now we are not making any changes to our brokerage kamath wrote on social media platform x sebis true to label circular came into effect from today october \u003cONE_\u003e after which stock exchanges bse and nse have started charging a uniform fee structure as opposed to the previous regime of transaction fee based on the overall turnover contributed by a broker in a month so far brokers with higher turnover paid a lower transaction fee to stock exchanges with effect from october \u003cONE_\u003e nse will levy a transaction fee of rs \u003cTWO_\u003e on each side per lakh of traded value in the cash market in equity futures it will be rs \u003cONE_\u003e each side per lakh of traded value for equity options the transaction fees will be rs \u003cTHREE_TEN\u003e on each side per lakh of premium value for sensex and bankex options contracts the transaction fee is revised to rs \u003cTHREE_THOUSAND\u003e per crore of the premium turnover value","timestamp":"2024-10-01T13:35:00+05:30","market_timestamp":"2024-10-01T13:35:00+05:30","off_market_hours":false}