{"url":"https://economictimes.indiatimes.com/tech/technology/mozilla-hit-with-privacy-complaint-over-firefox-user-tracking/articleshow/113664168.cms","title":"Mozilla hit with privacy complaint over Firefox user tracking","description":"Mozilla had defended the feature, saying it wanted to help websites understand how their ads perform without collecting data about individual people. By offering what it called a non-invasive alternative to cross-site tracking, it hoped to significantly reduce collecting individual information.","content":"Vienna-based advocacy group NOYB on Wednesday said it has filed a complaint with the Austrian data protection authority against Mozilla accusing the Firefox browser maker of tracking user behaviour on websites without consent. NOYB (None Of Your Business), the digital rights group founded by privacy activist Max Schrems, said Mozilla has enabled a so-called \"privacy preserving attribution\" feature that turned the browser into a tracking tool for websites without directly telling its users.  Mozilla had defended the feature, saying it wanted to help websites understand how their ads perform without collecting data about individual people. By offering what it called a non-invasive alternative to cross-site tracking, it hoped to significantly reduce collecting individual information. While this may be less invasive than unlimited tracking, it still interferes with user rights under the EU's privacy laws, NOYB said, adding that Firefox has turned on the feature by default. \"It's a shame that an organisation like Mozilla believes that users are too dumb to say yes or no,\" said Felix Mikolasch, data protection lawyer at NOYB. \"Users should be able to make a choice and the feature should have been turned off by default.\"","cleaned_content":"vienna based advocacy group noyb on wednesday said it has filed a complaint with the austrian data protection authority against mozilla accusing the firefox browser maker of tracking user behaviour on websites without consent noyb none of your business the digital rights group founded by privacy activist max schrems said mozilla has enabled a so called privacy preserving attribution feature that turned the browser into a tracking tool for websites without directly telling its users mozilla had defended the feature saying it wanted to help websites understand how their ads perform without collecting data about individual people by offering what it called a non invasive alternative to cross site tracking it hoped to significantly reduce collecting individual information while this may be less invasive than unlimited tracking it still interferes with user rights under the eus privacy laws noyb said adding that firefox has turned on the feature by default its a shame that an organisation like mozilla believes that users are too dumb to say yes or no said felix mikolasch data protection lawyer at noyb users should be able to make a choice and the feature should have been turned off by default","timestamp":"2024-09-25T15:21:00+05:30","market_timestamp":"2024-09-25T15:21:00+05:30","off_market_hours":false}