{"url":"https://economictimes.indiatimes.com/tech/technology/d2c-startup-wakefit-records-24-jump-in-its-fy24-revenue/articleshow/113791238.cms","title":"D2C startup Wakefit records 24% jump in its FY24 revenue","description":"Wakefit cofounder Chaitanya Ramalingegowda attributed the increase in revenue to the company’s focus on strengthening its omnichannel presence, with some stores reaching maturity and a new wave of outlets opening, along with the benefits of an automated mattress factory.","content":"Bengaluru-based mattress and furniture maker Wakefit reported a 24% year-on-year increase in revenue to Rs 1,017 crore for the financial year ending March 31, 2024. The company said it returned to profitability during the financial year, with earnings before interest, taxes, depreciation and amortisation of Rs 65 crore. It had been profitable on during its first four years of operation.Operating revenue during FY24 was around Rs 985 crore, up from Rs 813 crore in the previous year, it said.Wakefit cofounder Chaitanya Ramalingegowda attributed the increase in revenue to the company’s focus on strengthening its omnichannel presence, with some stores reaching maturity and a new wave of outlets opening, along with the benefits of an automated mattress factory.“Earlier, when we started the furniture category, we had all the products built from a value-for-money perspective, mainly for early-age consumers between 25-30 years old or very young couples. Today, a larger part of the catalogue is being built from the perspective of a married, settled family, ranging in age from 25 to 50,” chief executive Ankit Garg told ET. “This means a lot of classical and very detailed designs. I think that is a significant change in the portfolio we have made.”The company entered offline retail in 2022 and now has around 80 stores across 26 cities. It aims to expand to 120 stores within the next six months.","cleaned_content":"bengaluru based mattress and furniture maker wakefit reported a \u003cTWO_TEN_PERCENT\u003e year on year increase in revenue to rs \u003cONE_THOUSAND\u003e crore for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company said it returned to profitability during the financial year with earnings before interest taxes depreciation and amortisation of rs \u003cSIX_TEN\u003e crore it had been profitable on during its first four years of operation operating revenue during fy24 was around rs \u003cNINE_HUNDRED\u003e crore up from rs \u003cEIGHT_HUNDRED\u003e crore in the previous year it said wakefit cofounder chaitanya ramalingegowda attributed the increase in revenue to the company s focus on strengthening its omnichannel presence with some stores reaching maturity and a new wave of outlets opening along with the benefits of an automated mattress factory earlier when we started the furniture category we had all the products built from a value for money perspective mainly for early age consumers between \u003cTWO_TEN\u003e \u003cTHREE_TEN\u003e years old or very young couples today a larger part of the catalogue is being built from the perspective of a married settled family ranging in age from \u003cTWO_TEN\u003e to \u003cFIVE_TEN\u003e chief executive ankit garg told et this means a lot of classical and very detailed designs i think that is a significant change in the portfolio we have made the company entered offline retail in \u003cTWO_THOUSAND\u003e and now has around \u003cEIGHT_TEN\u003e stores across \u003cTWO_TEN\u003e cities it aims to expand to \u003cONE_HUNDRED\u003e stores within the next six months","timestamp":"2024-09-30T06:00:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}