{"url":"https://economictimes.indiatimes.com/tech/technology/qualcomms-potential-intel-buyout-could-raise-antitrust-foundry-concerns/articleshow/113605667.cms","title":"Qualcomm's potential Intel buyout could raise antitrust, foundry concerns","description":"\"The rumored deal between Qualcomm and Intel is intriguing on many levels and, from a pure product perspective, makes a certain degree of sense as they have a number of complementary product lines,\" said TECHnalysis Research founder Bob O'Donnell.","content":"A potential deal to buy Intel could accelerate Qualcomm's diversification but will burden the smartphone chipmaker with a loss-making semiconductor manufacturing unit that it may struggle to turn around or sell, analysts said. A buyout will also face tough antitrust scrutiny globally as it would unite two crucial chip firms in what would be the sector's biggest ever deal, creating a behemoth with a strong share of the smartphone, personal computer and server markets.  Shares of Intel rose 3% before the bell on Monday, after media reports late on Friday about Qualcomm's early-stage approach for the struggling chipmaker. Qualcomm's shares were lower.  \"The rumored deal between Qualcomm and Intel is intriguing on many levels and, from a pure product perspective, makes a certain degree of sense as they have a number of complementary product lines,\" said TECHnalysis Research founder Bob O'Donnell. \"The reality of it actually occurring, however, is very low. Plus, it is unlikely Qualcomm would want all of Intel and trying to break apart the product business from the foundry business right now just would not be possible,\" he said.","cleaned_content":"a potential deal to buy intel could accelerate qualcomms diversification but will burden the smartphone chipmaker with a loss making semiconductor manufacturing unit that it may struggle to turn around or sell analysts said a buyout will also face tough antitrust scrutiny globally as it would unite two crucial chip firms in what would be the sectors biggest ever deal creating a behemoth with a strong share of the smartphone personal computer and server markets shares of intel rose \u003cTHREE_PERCENT\u003e before the bell on monday after media reports late on friday about qualcomms early stage approach for the struggling chipmaker qualcomms shares were lower the rumored deal between qualcomm and intel is intriguing on many levels and from a pure product perspective makes a certain degree of sense as they have a number of complementary product lines said technalysis research founder bob odonnell the reality of it actually occurring however is very low plus it is unlikely qualcomm would want all of intel and trying to break apart the product business from the foundry business right now just would not be possible he said","timestamp":"2024-09-23T20:32:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}