{"url":"https://economictimes.indiatimes.com/tech/technology/wework-incs-plans-fail-to-work-out/articleshow/113712779.cms","title":"WeWork’s plan to sell stake in India unit collapses; sector revival, valuation issues hit transaction","description":"WeWork Inc.'s plan to sell its 27% stake in its Indian unit has collapsed due to a valuation mismatch. The Embassy Group was supposed to acquire the stake and bring in new investors. Talks are ongoing with 360 One for financing as WeWork India prepares for a potential public offering.","content":"WeWork Inc.’s plan to sell the 27% it holds in its Indian unit and exit the country has collapsed, according to three people aware of the matter. This comes after the Competition Commission of India (CCI) had approved the proposal.Along with the bankruptcy-hit WeWork Inc., the coworking firm’s local partner WeWork India, promoted by Bangalore-based realtor Embassy Group, was also slated to divest a 13% stake to a consortium of investors including the Enam group family office, A91 Partners and CaratLane founder Mithun Sacheti in a Rs 1,200 crore secondary transaction, as reported first by ET on April 22. The Indian real estate group holds 73% in the India unit while WeWork Inc. owns the rest. The deal cleared by the regulator, as per a June 18 order, involved a two-step process that would see WeWork Inc. and Embassy together selling a stake of about 40% to new investors.  “The transaction didn’t go through due to a valuation mismatch even after the regulatory nod came in from the Indian antitrust body,” said one of the persons cited. The Embassy Group was supposed to acquire the 27% stake held by WeWork US in the India business and subsequently bring in investors as the company prepared a plan to go public. Karan Virwani, CEO of WeWork India, is holding talks with 360 One, formerly IIFL, to buy some part of the 27% stake held by WeWork Inc in the Indian unit, according to the people cited above.","cleaned_content":"wework inc s plan to sell the \u003cTWO_TEN_PERCENT\u003e it holds in its indian unit and exit the country has collapsed according to three people aware of the matter this comes after the competition commission of india cci had approved the proposal along with the bankruptcy hit wework inc the coworking firm s local partner wework india promoted by bangalore based realtor embassy group was also slated to divest a \u003cONE_TEN_PERCENT\u003e stake to a consortium of investors including the enam group family office a91 partners and caratlane founder mithun sacheti in a rs \u003cONE_THOUSAND\u003e crore secondary transaction as reported first by et on april \u003cTWO_TEN\u003e the indian real estate group holds \u003cSEVEN_TEN_PERCENT\u003e in the india unit while wework inc owns the rest the deal cleared by the regulator as per a june \u003cONE_TEN\u003e order involved a two step process that would see wework inc and embassy together selling a stake of about \u003cFOUR_TEN_PERCENT\u003e to new investors the transaction didn t go through due to a valuation mismatch even after the regulatory nod came in from the indian antitrust body said one of the persons cited the embassy group was supposed to acquire the \u003cTWO_TEN_PERCENT\u003e stake held by wework us in the india business and subsequently bring in investors as the company prepared a plan to go public karan virwani ceo of wework india is holding talks with \u003cTHREE_HUNDRED\u003e one formerly iifl to buy some part of the \u003cTWO_TEN_PERCENT\u003e stake held by wework inc in the indian unit according to the people cited above","timestamp":"2024-09-27T18:05:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}