{"url":"https://economictimes.indiatimes.com/tech/technology/majority-of-employees-feel-their-organisations-can-do-more-to-address-mental-health-issues-report/articleshow/113784639.cms","title":"Majority of employees feel their organisations can do more to address mental health issues: report","description":"The report is based on a survey carried out between August 5 and September 2, 2024, among 1,783 employees working across sectors.","content":"Even as the corporate sector in India is taking steps to address mental health issues at workplaces, a majority of employees believe companies could do more to improve their overall well-being, a survey report said on Saturday.  Over 79 % of those participated in the survey opined their organisations could do more to address mental health issues and well-being, according to the report by HR services and workforce solutions provider Genius Consultants.  \"We must recognise that employee well-being is not just a trend, but a crucial aspect of organizational success. The data reveals that a significant number of employees are grappling with anxiety and feeling overwhelmed in their work environments. Companies need to take proactive steps to foster a supportive atmosphere that prioritises mental health and work-life balance,\" Genius Consultants Chairman and Managing Director R P Yadav said.  The report is based on a survey carried out between August 5 and September 2, 2024, among 1,783 employees working across sectors.  It further showed that over 45 per cent of employees experience anxiety and anxiousness every Sunday evening when they prepare to return to work on Monday, while 13 per cent carry mixed feelings about the same. ","cleaned_content":"even as the corporate sector in india is taking steps to address mental health issues at workplaces a majority of employees believe companies could do more to improve their overall well being a survey report said on saturday over \u003cSEVEN_TEN_PERCENT\u003e of those participated in the survey opined their organisations could do more to address mental health issues and well being according to the report by hr services and workforce solutions provider genius consultants we must recognise that employee well being is not just a trend but a crucial aspect of organizational success the data reveals that a significant number of employees are grappling with anxiety and feeling overwhelmed in their work environments companies need to take proactive steps to foster a supportive atmosphere that prioritises mental health and work life balance genius consultants chairman and managing director r p yadav said the report is based on a survey carried out between august \u003cFIVE_\u003e and september \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e among \u003cONE_THOUSAND\u003e employees working across sectors it further showed that over \u003cFOUR_TEN_PERCENT\u003e of employees experience anxiety and anxiousness every sunday evening when they prepare to return to work on monday while \u003cONE_TEN_PERCENT\u003e carry mixed feelings about the same","timestamp":"2024-09-29T14:53:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}