{"url":"https://economictimes.indiatimes.com/tech/technology/intel-doesnt-need-a-takeover-it-needs-a-turnaround-dave-lee/articleshow/113636497.cms","title":"Intel doesn’t need a takeover, it needs a turnaround","description":"Aside from the simple question of how Qualcomm would actually pay for it, there are other huge hurdles, particularly concerning regulatory approval. The merger of two huge US chip companies with a combined market value of $283 billion isn’t something that will be allowed to happen quickly — if at all.","content":"They say if there’s ever a Silicon Valley Mount Rushmore, the first face to be chiseled into the stone would be that of Gordon Moore. The Intel Corp. co-founder’s famous prediction about the rate at which semiconductors would improve has provided the bedrock to American technology leadership.Such sentimentality around Intel and its unparalleled contribution to the computing revolution is what makes any suggestion of a takeover a huge story. The approach by Qualcomm Inc., reported late last week, comes as Intel faces the toughest period in its 56-year history. In its weakened state — shares are down 53% this year — it is vulnerable to the disruptive effects of window-shopping by rivals that are currently more prosperous.Intel Chief Executive Officer Pat Gelsinger should tune out the noise and stick to his turnaround strategy.Most analysts consider the deal unlikely to progress much further. Aside from the simple question of how Qualcomm would actually pay for it, there are other huge hurdles, particularly concerning regulatory approval. The merger of two huge US chip companies with a combined market value of $283 billion isn’t something that will be allowed to happen quickly — if at all.","cleaned_content":"they say if there s ever a silicon valley mount rushmore the first face to be chiseled into the stone would be that of gordon moore the intel corp co founder s famous prediction about the rate at which semiconductors would improve has provided the bedrock to american technology leadership such sentimentality around intel and its unparalleled contribution to the computing revolution is what makes any suggestion of a takeover a huge story the approach by qualcomm inc reported late last week comes as intel faces the toughest period in its \u003cFIVE_TEN\u003e year history in its weakened state shares are down \u003cFIVE_TEN_PERCENT\u003e this year it is vulnerable to the disruptive effects of window shopping by rivals that are currently more prosperous intel chief executive officer pat gelsinger should tune out the noise and stick to his turnaround strategy most analysts consider the deal unlikely to progress much further aside from the simple question of how qualcomm would actually pay for it there are other huge hurdles particularly concerning regulatory approval the merger of two huge us chip companies with a combined market value of \u003cTWO_HUNDRED\u003e billion isn t something that will be allowed to happen quickly if at all","timestamp":"2024-09-24T19:25:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}