{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-court-asks-x-for-documents-as-the-platform-starts-to-comply-with-orders/articleshow/113570565.cms","title":"Brazil court asks X for documents as the platform starts to comply with orders","description":"The Brazilian Supreme Court has asked Elon Musk's social platform X to present documents validating its new legal representative in Brazil. X was shut down in late August for not complying with hate speech moderation orders. The platform now plans to meet court demands, including blocking certain accounts and paying fines.","content":"The Brazilian Supreme Court on Saturday asked Elon Musk-owned social platform X to present documents validating its new legal representative in the country, as the firm's lawyers now say it will comply with court demands to be allowed to resume operations in Brazil. X was shut down in Brazil in late August after it did not comply with orders from the top court related to hate speech moderation in the social platform. But in the last few days, X representatives have started to publicly vocalize intentions to address the court demands, even though the firm had previously said it would not meet them. X lawyers said late on Friday that the platform had named a legal representative in Brazil, addressing a key demand imposed by the court. In a Saturday decision, Supreme Court judge Alexandre de Moraes gave five days for X to provide commercial registries and other documents proving that X formally signed Rachel de Oliveira Conceicao as its Brazil legal representative.","cleaned_content":"the brazilian supreme court on saturday asked elon musk owned social platform x to present documents validating its new legal representative in the country as the firms lawyers now say it will comply with court demands to be allowed to resume operations in brazil x was shut down in brazil in late august after it did not comply with orders from the top court related to hate speech moderation in the social platform but in the last few days x representatives have started to publicly vocalize intentions to address the court demands even though the firm had previously said it would not meet them x lawyers said late on friday that the platform had named a legal representative in brazil addressing a key demand imposed by the court in a saturday decision supreme court judge alexandre de moraes gave five days for x to provide commercial registries and other documents proving that x formally signed rachel de oliveira conceicao as its brazil legal representative","timestamp":"2024-09-22T16:11:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}