{"url":"https://economictimes.indiatimes.com/tech/technology/tata-electronics-unit-engulfed-in-massive-fire-production-of-iphone-components-halted/articleshow/113771641.cms","title":"Tata Electronics unit engulfed in massive fire; production of iPhone components halted","description":"One person aware of the developments said the evacuation and emergency protocols worked well. “All employees were accounted for. Around eight people needed medical attention, and they are all ok now after medical attention,” the person told ET. “The property damage is significant and the root cause is to be assessed.”","content":"In a major setback to Tata Electronics, its mobile phone accessories painting facility in Hosur was engulfed in a massive fire on Saturday morning, leading to halting of operations at the only Indian vendor for the iconic iPhone.The fire incident took place at around 5:30 am and 11 fire engines were still at the spot at 4.45 pm as the fire had not been fully doused, people aware of the matter told ET.“Our emergency protocols at the plant ensured that all our employees are safe,” Tata Electronics said in a statement. “The cause of the fire is under investigation and we will take necessary actions to safeguard the interest of our employees and other stakeholders.”One person aware of the developments said the evacuation and emergency protocols worked well. “All employees were accounted for. Around eight people needed medical attention, and they are all ok now after medical attention,” the person told ET. “The property damage is significant and the root cause is to be assessed.”One of the firefighters on the spot who did not wish to be named said their station got a call around 5:45 am and they rushed to the spot.","cleaned_content":"in a major setback to tata electronics its mobile phone accessories painting facility in hosur was engulfed in a massive fire on saturday morning leading to halting of operations at the only indian vendor for the iconic iphone the fire incident took place at around \u003cFIVE_\u003e \u003cTHREE_TEN\u003e am and \u003cONE_TEN\u003e fire engines were still at the spot at \u003cFOUR_\u003e pm as the fire had not been fully doused people aware of the matter told et our emergency protocols at the plant ensured that all our employees are safe tata electronics said in a statement the cause of the fire is under investigation and we will take necessary actions to safeguard the interest of our employees and other stakeholders one person aware of the developments said the evacuation and emergency protocols worked well all employees were accounted for around eight people needed medical attention and they are all ok now after medical attention the person told et the property damage is significant and the root cause is to be assessed one of the firefighters on the spot who did not wish to be named said their station got a call around \u003cFIVE_\u003e \u003cFOUR_TEN\u003e am and they rushed to the spot","timestamp":"2024-09-28T22:54:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}