{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-stellantis-jv-set-up-rd-for-automotive-semiconductors-tech-in-india/articleshow/113605473.cms","title":"Foxconn, Stellantis JV set up R\u0026D for automotive semiconductors tech in India","description":"Foxconn India representative V Lee, in a social media post, said the R\u0026D centre is poised to accelerate the company's innovative capabilities in the development of cutting-edge automotive technologies and solutions for the automotive industry, including Stellantis.","content":"Foxconn-backed automotive technology company SiliconAuto has set up its research and development centre in Bengaluru which will focus on semiconductor product design and system-on-chip development for the automotive sector. SiliconAuto is a joint venture between the Netherlands-based Stellantis NV and Hon Hai Technology Group (Foxconn).  \"This new centre embodies SiliconAuto's commitment to innovation and excellence in the automotive industry. Our India team is set to drive forward our vision of a smarter and safer future for transportation. Bangalore, with its rich talent pool and thriving tech ecosystem, is the perfect location for our new design centre,\" SiliconAuto CEO, Gene Liu said in a statement.  Foxconn India representative V Lee, in a social media post, said the R\u0026D centre is poised to accelerate the company's innovative capabilities in the development of cutting-edge automotive technologies and solutions for the automotive industry, including Stellantis.  Foxconn is in process of setting up its electric vehicle manufacturing plant as well as has plans to set up a battery manufacturing unit for electric vehicles. ","cleaned_content":"foxconn backed automotive technology company siliconauto has set up its research and development centre in bengaluru which will focus on semiconductor product design and system on chip development for the automotive sector siliconauto is a joint venture between the netherlands based stellantis nv and hon hai technology group foxconn this new centre embodies siliconautos commitment to innovation and excellence in the automotive industry our india team is set to drive forward our vision of a smarter and safer future for transportation bangalore with its rich talent pool and thriving tech ecosystem is the perfect location for our new design centre siliconauto ceo gene liu said in a statement foxconn india representative v lee in a social media post said the r d centre is poised to accelerate the companys innovative capabilities in the development of cutting edge automotive technologies and solutions for the automotive industry including stellantis foxconn is in process of setting up its electric vehicle manufacturing plant as well as has plans to set up a battery manufacturing unit for electric vehicles","timestamp":"2024-09-23T20:18:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}