{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-cooperates-with-s-korea-deepfake-porn-crackdown-regulators/articleshow/113816888.cms","title":"South Korea regulators say Telegram cooperating with deepfake porn crackdown","description":"South Korea regulators on Monday hailed productive talks with messaging app Telegram over a deepfake porn crisis in the country. In August, media and authorities uncovered a sprawling network of Telegram chatrooms in South Korea, often set up within schools and universities, in which users shared AI-generated deepfake porn depicting female students and staff.","content":"South Korea regulators on Monday hailed productive talks with messaging app Telegram over a deepfake porn crisis in the country.In August, media and authorities uncovered a sprawling network of Telegram chatrooms in South Korea, often set up within schools and universities, in which users shared AI-generated deepfake porn depicting female students and staff.The revelations prompted public outrage, with the president vowing stern action and lawmakers recently moving to criminalise possession or viewing of deepfake porn.The telecommunications watchdog said Monday that Telegram had fully complied with its requests for 148 videos to be taken down over the past month, with the longest removal taking 36 hours.\"Telegram has accelerated our two-way communication by deleting all deepfake videos requested by the committee and immediately sending us the results,\" said Ryu Hee-lim, chair of the Korea Communications Standards Commission (KCSC).","cleaned_content":"south korea regulators on monday hailed productive talks with messaging app telegram over a deepfake porn crisis in the country in august media and authorities uncovered a sprawling network of telegram chatrooms in south korea often set up within schools and universities in which users shared ai generated deepfake porn depicting female students and staff the revelations prompted public outrage with the president vowing stern action and lawmakers recently moving to criminalise possession or viewing of deepfake porn the telecommunications watchdog said monday that telegram had fully complied with its requests for \u003cONE_HUNDRED\u003e videos to be taken down over the past month with the longest removal taking \u003cTHREE_TEN\u003e hours telegram has accelerated our two way communication by deleting all deepfake videos requested by the committee and immediately sending us the results said ryu hee lim chair of the korea communications standards commission kcsc","timestamp":"2024-09-30T16:51:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}