{"url":"https://economictimes.indiatimes.com/tech/technology/uber-lyft-drivers-use-teslas-as-makeshift-robotaxis-raising-safety-concerns/articleshow/113909878.cms","title":"Uber, Lyft drivers use Teslas as makeshift robotaxis, raising safety concerns","description":"A self-driving Tesla used for Uber collided with an SUV in Las Vegas, causing worries about the safety of autonomous ride-hailing services. Federal and state authorities say drivers are responsible for their vehicles, even when using driver-assist software like Tesla's Full Self-Driving. Tesla is planning to expand its autonomous vehicle network.","content":"A self-driving Tesla carrying a passenger for Uber rammed into an SUV at an intersection in suburban Las Vegas in April, an accident that sparked new concerns that a growing stable of self-styled \"robotaxis\" is exploiting a regulatory gray area in U.S. cities, putting lives at risk. Tesla CEO Elon Musk aims to show off plans for a robotaxi, or self-driving car used for ride-hailing services, on Oct. 10, and he has long contemplated a Tesla-run taxi network of autonomous vehicles owned by individuals. Do-it-yourself versions, however, are already proliferating, according to 11 ride-hail drivers who use Tesla's Full Self-Driving (FSD) software. Many say the software, which costs $99 per month, has limitations, but that they use it because it helps reduce drivers' stress and therefore allows them to work longer hours and earn more money. Reuters is first to report about the Las Vegas accident and a related inquiry by federal safety officials, and of the broad use by ride-hail drivers of Tesla autonomous software.   While test versions of self-driving cabs with human backup drivers from robotaxi operators such as Alphabet's Waymo and General Motors' Cruise are heavily regulated, state and federal authorities say Tesla drivers alone are responsible for their vehicles, whether or not they use driver-assist software. Waymo and Cruise use test versions of software categorized as fully autonomous while Tesla FSD is categorized as a level requiring driver oversight. ","cleaned_content":"a self driving tesla carrying a passenger for uber rammed into an suv at an intersection in suburban las vegas in april an accident that sparked new concerns that a growing stable of self styled robotaxis is exploiting a regulatory gray area in u s cities putting lives at risk tesla ceo elon musk aims to show off plans for a robotaxi or self driving car used for ride hailing services on oct \u003cONE_TEN\u003e and he has long contemplated a tesla run taxi network of autonomous vehicles owned by individuals do it yourself versions however are already proliferating according to \u003cONE_TEN\u003e ride hail drivers who use teslas full self driving fsd software many say the software which costs \u003cNINE_TEN\u003e per month has limitations but that they use it because it helps reduce drivers stress and therefore allows them to work longer hours and earn more money reuters is first to report about the las vegas accident and a related inquiry by federal safety officials and of the broad use by ride hail drivers of tesla autonomous software while test versions of self driving cabs with human backup drivers from robotaxi operators such as alphabets waymo and general motors cruise are heavily regulated state and federal authorities say tesla drivers alone are responsible for their vehicles whether or not they use driver assist software waymo and cruise use test versions of software categorized as fully autonomous while tesla fsd is categorized as a level requiring driver oversight","timestamp":"2024-10-03T15:43:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}