{"url":"https://economictimes.indiatimes.com/tech/technology/cisco-opens-manufacturing-facility-in-chennai/articleshow/113748146.cms","title":"Cisco opens manufacturing facility in Chennai","description":"Cisco has partnered with Flex for building the Chennai factory to produce advanced telecom technologies. The facility will initially focus on Cisco’s Network Convergence System (NCS) 540 Series of routers, representing the first phase of the company’s multi-year investment plan.","content":"Cisco Systems on Friday opened its first factory in India for manufacturing routing and switching products. The facility is expected to generate 1,200 jobs.The US networking equipment giant hopes the new plant in Chennai will help drive annual revenue from the Indian operations to more than $1.3 billion besides broadening its diverse and resilient supply chain.Cisco has partnered with Flex for building the Chennai factory to produce advanced telecom technologies. The facility will initially focus on Cisco’s Network Convergence System (NCS) 540 Series of routers, representing the first phase of the company’s multi-year investment plan. Chennai will be the exclusive site for Cisco globally to make these products, according to senior management executives.They added that significant innovation and technical advancements are planned for the next phase including producing printed circuit board assembly components with several layers. This would allow Cisco to broaden its technical manufacturing capabilities in India for addressing new customers and market segments.“I met the Prime Minister in May 2023 and told him that we would open the facility, and here we are with our first product coming off the lines,” Chuck Robbins, chairman and CEO of Cisco said at the inauguration. \"We are so excited about India as a local market and export hub for Cisco. We are thrilled and excited to be a part of the GDP growth in this country, in the explosion of manufacturing and IT; leadership in telecom.\"","cleaned_content":"cisco systems on friday opened its first factory in india for manufacturing routing and switching products the facility is expected to generate \u003cONE_THOUSAND\u003e jobs the us networking equipment giant hopes the new plant in chennai will help drive annual revenue from the indian operations to more than \u003cONE_\u003e billion besides broadening its diverse and resilient supply chain cisco has partnered with flex for building the chennai factory to produce advanced telecom technologies the facility will initially focus on cisco s network convergence system ncs \u003cFIVE_HUNDRED\u003e series of routers representing the first phase of the company s multi year investment plan chennai will be the exclusive site for cisco globally to make these products according to senior management executives they added that significant innovation and technical advancements are planned for the next phase including producing printed circuit board assembly components with several layers this would allow cisco to broaden its technical manufacturing capabilities in india for addressing new customers and market segments i met the prime minister in may \u003cTWO_THOUSAND\u003e and told him that we would open the facility and here we are with our first product coming off the lines chuck robbins chairman and ceo of cisco said at the inauguration we are so excited about india as a local market and export hub for cisco we are thrilled and excited to be a part of the gdp growth in this country in the explosion of manufacturing and it leadership in telecom","timestamp":"2024-09-27T23:23:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}