{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-web-services-to-provide-cloud-computing-services-to-public-sector-banks/articleshow/113671872.cms","title":"Amazon Web Services to provide cloud computing services to public sector banks","description":"Its partner banks include SBI, UCO Bank, Union Bank, PNB, Central Bank of India, Canara Bank, Bank of Baroda, Bank of India, Bank of Maharashtra, Indian Bank, Punjab \u0026 Sind Bank, and Indian Overseas Bank.","content":"Amazon Web Services (AWS) India has been selected by the Public Sector Bank Alliance to offer cloud computing services to the country's public sector lenders. Public Sector Bank Alliance (PSBA) is an umbrella organisation formed by 12 public sector banks and acts as a nodal body to deliver end-to-end technology-enabled banking services to them. Its partner banks include SBI, UCO Bank, Union Bank, PNB, Central Bank of India, Canara Bank, Bank of Baroda, Bank of India, Bank of Maharashtra, Indian Bank, Punjab \u0026 Sind Bank, and Indian Overseas Bank. \"This empanelment will enable the public sector banks to seamlessly adopt AWS, the world's most comprehensive and broadly adopted cloud, through PSBA's Community Cloud Services, without a need to create separate procurement processes for their cloud computing requirements,\" a company statement said. AWS will provide services through its managed service providers (MSPs) Orient Technologies and Hitachi Systems, it added. AWS made a slew of announcements at its Empower India event here on Wednesday. ","cleaned_content":"amazon web services aws india has been selected by the public sector bank alliance to offer cloud computing services to the countrys public sector lenders public sector bank alliance psba is an umbrella organisation formed by \u003cONE_TEN\u003e public sector banks and acts as a nodal body to deliver end to end technology enabled banking services to them its partner banks include sbi uco bank union bank pnb central bank of india canara bank bank of baroda bank of india bank of maharashtra indian bank punjab sind bank and indian overseas bank this empanelment will enable the public sector banks to seamlessly adopt aws the worlds most comprehensive and broadly adopted cloud through psbas community cloud services without a need to create separate procurement processes for their cloud computing requirements a company statement said aws will provide services through its managed service providers msps orient technologies and hitachi systems it added aws made a slew of announcements at its empower india event here on wednesday","timestamp":"2024-09-25T19:29:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}