{"url":"https://economictimes.indiatimes.com/tech/technology/sec-appeals-decision-that-restricted-its-crypto-oversight/articleshow/113893545.cms","title":"SEC appeals decision that restricted its crypto oversight","description":"The U.S. SEC is appealing a court ruling limiting its power to regulate cryptocurrency. The decision involved Ripple Labs' XRP token, impacting $757 million in sales deemed not securities. Another $728 million in sales to institutional investors must follow securities laws. Ripple faces a potential $125 million fine.","content":"The U.S. Securities and Exchange Commission said on Wednesday it is appealing a court ruling that restricted its ability to regulate cryptocurrency markets. Wall Street's main securities regulator will ask the 2nd U.S. Circuit Court of Appeals in Manhattan to review a July 2023 decision that the XRP token sold by Ripple Labs on public exchanges did not meet the legal definition of a security. The decision by U.S. District Judge Analisa Torres meant the sales of the token, totaling about $757 million, were not subject to investor protection laws that the SEC enforces. If the appeals court agreed, or defined securities narrowly, it could impede the SEC's ability to police the cryptocurrency exchange Coinbase and other defendants selling or making markets for newer, non-traditional financial products. Torres also gave the SEC a partial victory, saying another $728 million of XRP sales to institutional investors should have complied with securities laws.","cleaned_content":"the u s securities and exchange commission said on wednesday it is appealing a court ruling that restricted its ability to regulate cryptocurrency markets wall streets main securities regulator will ask the \u003cTWO_\u003e nd u s circuit court of appeals in manhattan to review a july \u003cTWO_THOUSAND\u003e decision that the xrp token sold by ripple labs on public exchanges did not meet the legal definition of a security the decision by u s district judge analisa torres meant the sales of the token totaling about \u003cSEVEN_HUNDRED\u003e million were not subject to investor protection laws that the sec enforces if the appeals court agreed or defined securities narrowly it could impede the secs ability to police the cryptocurrency exchange coinbase and other defendants selling or making markets for newer non traditional financial products torres also gave the sec a partial victory saying another \u003cSEVEN_HUNDRED\u003e million of xrp sales to institutional investors should have complied with securities laws","timestamp":"2024-10-03T10:09:00+05:30","market_timestamp":"2024-10-03T10:09:00+05:30","off_market_hours":false}