{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musks-x-seeks-brazil-comeback-retreats-on-censorship-feud/articleshow/113728559.cms","title":"Elon Musk's X seeks Brazil comeback, retreats on 'censorship' feud","description":"A decision from the court on X's return is still pending, but people close to Musk in Brazil believe service could be restored in a matter of days. Late on Thursday, X said access to the site in Brazil \"is essential for a thriving democracy\" and that it respects the sovereignty of the countries in which it operates.","content":"In a major climbdown, Elon Musk's X told Brazil's Supreme Court it had complied with orders to stop the spread of misinformation and asked a judge to lift a ban on the platform, according to a document seen by Reuters. The billionaire had held out for more than five months against what he called \"censorship\" in a feud with a judge in one of X's largest and most coveted markets. The court shut Brazilians' access to the platform in late August. A decision from the court on X's return is still pending, but people close to Musk in Brazil believe service could be restored in a matter of days. Late on Thursday, X said access to the site in Brazil \"is essential for a thriving democracy\" and that it respects the sovereignty of the countries in which it operates. \"We will continue to defend freedom of expression and due process of law through legal processes,\" the company's global affairs team added in a post on the platform.","cleaned_content":"in a major climbdown elon musks x told brazils supreme court it had complied with orders to stop the spread of misinformation and asked a judge to lift a ban on the platform according to a document seen by reuters the billionaire had held out for more than five months against what he called censorship in a feud with a judge in one of xs largest and most coveted markets the court shut brazilians access to the platform in late august a decision from the court on xs return is still pending but people close to musk in brazil believe service could be restored in a matter of days late on thursday x said access to the site in brazil is essential for a thriving democracy and that it respects the sovereignty of the countries in which it operates we will continue to defend freedom of expression and due process of law through legal processes the companys global affairs team added in a post on the platform","timestamp":"2024-09-27T12:18:00+05:30","market_timestamp":"2024-09-27T12:18:00+05:30","off_market_hours":false}