{"url":"https://economictimes.indiatimes.com/tech/technology/alphabet-to-invest-3-3-billion-for-two-data-centers-in-south-carolina/articleshow/113730339.cms","title":"Alphabet to invest $3.3 billion for two data centers in South Carolina","description":"The new Dorchester County facilities, located in the Pine Hill Business Campus in Ridgeville and Winding Woods Commerce Park in St. George, represent a $2 billion investment and will create 200 new operational jobs, while Alphabet will invest $1.3 billion in Berkeley County, according to the statement.","content":"Alphabet plans to invest $3.3 billion in South Carolina to build two new data centers, CEO Sundar Pichai said, at a time when the Google parent and its rivals invest heavily in infrastructure supporting the development of AI applications. The search engine giant will establish the two new data center campuses in Dorchester County and expand its existing data center campus in Berkeley County, the South Carolina governor's office said in a statement on Thursday. The new Dorchester County facilities, located in the Pine Hill Business Campus in Ridgeville and Winding Woods Commerce Park in St. George, represent a $2 billion investment and will create 200 new operational jobs, while Alphabet will invest $1.3 billion in Berkeley County, according to the statement. In July, Alphabet reported capital expenditure of $13 billion in the June quarter and the company told investors that quarterly capital expenditure for the rest of 2024 would be at or above $12 billion. Microsoft said earlier this month that it has partnered with BlackRock and Abu Dhabi-backed investment firm MGX to launch a more than $30 billion fund to invest in AI infrastructure to build data centers and energy projects. (Reporting by Akash Sriram in Bengaluru; Editing by Shounak Dasgupta)","cleaned_content":"alphabet plans to invest \u003cTHREE_\u003e billion in south carolina to build two new data centers ceo sundar pichai said at a time when the google parent and its rivals invest heavily in infrastructure supporting the development of ai applications the search engine giant will establish the two new data center campuses in dorchester county and expand its existing data center campus in berkeley county the south carolina governors office said in a statement on thursday the new dorchester county facilities located in the pine hill business campus in ridgeville and winding woods commerce park in st george represent a \u003cTWO_\u003e billion investment and will create \u003cTWO_HUNDRED\u003e new operational jobs while alphabet will invest \u003cONE_\u003e billion in berkeley county according to the statement in july alphabet reported capital expenditure of \u003cONE_TEN\u003e billion in the june quarter and the company told investors that quarterly capital expenditure for the rest of \u003cTWO_THOUSAND\u003e would be at or above \u003cONE_TEN\u003e billion microsoft said earlier this month that it has partnered with blackrock and abu dhabi backed investment firm mgx to launch a more than \u003cTHREE_TEN\u003e billion fund to invest in ai infrastructure to build data centers and energy projects reporting by akash sriram in bengaluru editing by shounak dasgupta","timestamp":"2024-09-27T12:54:00+05:30","market_timestamp":"2024-09-27T12:54:00+05:30","off_market_hours":false}