{"url":"https://economictimes.indiatimes.com/tech/information-tech/persistent-systems-acquires-pune-based-data-privacy-management-firm-arrka/articleshow/113819695.cms","title":"Persistent Systems acquires Pune-based data privacy management firm Arrka","description":"In August, Persistent Systems entered into an asset purchase agreement with US-based SoHo Dragon to acquire select assets. In June this year, the company disclosed its intent to acquire New Jersey-based Starfish Associates.","content":"Persistent Systems announced on Monday its intent to acquire Pune-based data privacy management firm Arrka for a total consideration of Rs 14.4 crore. This marks the third acquisition by the IT engineering firm in this fiscal year.Earlier this month, Persistent entered into an asset purchase agreement with US-based SoHo Dragon Inc. to acquire select assets. In June this year, the company disclosed its intent to acquire New Jersey-based Starfish Associates.Arrka has operated in the data privacy space for a decade, known for its data privacy management platform, and its capabilities in AI governance, the company said in a filing with the BSE. This strategic acquisition will significantly enhance Persistent's AI-led, platform-driven services and strengthen its ability to provide comprehensive offerings in digital governance.The filing further stated, “With Arrka's expertise, Persistent will help clients accelerate their transformation journeys while ensuring ethical, responsible, and compliant AI. As AI adoption continues to expand, the need for digital governance, particularly in data privacy and responsible AI, is becoming increasingly critical for enterprises across industries.”Sandeep Kalra, CEO and executive director of Persistent Systems, said, “Arrka’s acquisition perfectly aligns with our vision to deliver AI-driven services that fuel innovation while ensuring data privacy, ethics, and compliance at every stage. By integrating Arrka’s expertise with our AI-led, platform-driven services strategy, we are empowering businesses to innovate responsibly while managing risk and compliance more effectively.”","cleaned_content":"persistent systems announced on monday its intent to acquire pune based data privacy management firm arrka for a total consideration of rs \u003cONE_TEN\u003e crore this marks the third acquisition by the it engineering firm in this fiscal year earlier this month persistent entered into an asset purchase agreement with us based soho dragon inc to acquire select assets in june this year the company disclosed its intent to acquire new jersey based starfish associates arrka has operated in the data privacy space for a decade known for its data privacy management platform and its capabilities in ai governance the company said in a filing with the bse this strategic acquisition will significantly enhance persistents ai led platform driven services and strengthen its ability to provide comprehensive offerings in digital governance the filing further stated with arrkas expertise persistent will help clients accelerate their transformation journeys while ensuring ethical responsible and compliant ai as ai adoption continues to expand the need for digital governance particularly in data privacy and responsible ai is becoming increasingly critical for enterprises across industries sandeep kalra ceo and executive director of persistent systems said arrka s acquisition perfectly aligns with our vision to deliver ai driven services that fuel innovation while ensuring data privacy ethics and compliance at every stage by integrating arrka s expertise with our ai led platform driven services strategy we are empowering businesses to innovate responsibly while managing risk and compliance more effectively","timestamp":"2024-09-30T18:07:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}