{"url":"https://economictimes.indiatimes.com/tech/technology/regulatory-frameworks-crucial-in-cybersecurity-space-quick-heal-ceo-vishal-salvi/articleshow/113897514.cms","title":"Regulatory frameworks crucial in cybersecurity space: Quick Heal CEO Vishal Salvi","description":"Regulations are crucial for cybersecurity and data protection, says Quick Heal CEO Vishal Salvi. The company launched a new AI-powered fraud prevention solution, AntiFraud.AI, available for Rs 750/year. Quick Heal plans to expand its market presence and strengthen partnerships. Quick Heal operates in over 70 countries and reported a 37 percent revenue growth in Q1 FY25.","content":"Regulations play a vital role in shaping the cybersecurity landscape by setting clear standards for protecting sensitive data and ensuring accountability across industries, said Vishal Salvi, CEO of Quick Heal Technologies. In an interview with PTI, Salvi highlighted the importance of frameworks and said that they are essential for ensuring data protection and fostering trust between businesses and consumers.  \"In today's interconnected world, rules like the (Digital Personal Data Protection Act) DPDP Act and global privacy regulations are vital to ensuring data protection and promoting trust among businesses and consumers,\" he said on the sidelines of the company's latest launch.  Quick Heal Technologies on Thursday launched an AI-based fraud prevention solution--AntiFraud.AI. It is available on Android, iOS, and Windows, at an introductory offer price of Rs 750/year.  The Made in India solution offers several protection features like fraud call alerts, banking fraud alerts, fraud app detectors, scam protection, dark web monitoring, and screen share alerts, among others. \"We plan to double our serviceable market in the next few years by adding new solutions while strengthening our channel partnerships and increasing local brand presence,\" Salvi said. ","cleaned_content":"regulations play a vital role in shaping the cybersecurity landscape by setting clear standards for protecting sensitive data and ensuring accountability across industries said vishal salvi ceo of quick heal technologies in an interview with pti salvi highlighted the importance of frameworks and said that they are essential for ensuring data protection and fostering trust between businesses and consumers in todays interconnected world rules like the digital personal data protection act dpdp act and global privacy regulations are vital to ensuring data protection and promoting trust among businesses and consumers he said on the sidelines of the companys latest launch quick heal technologies on thursday launched an ai based fraud prevention solution antifraud ai it is available on android ios and windows at an introductory offer price of rs \u003cSEVEN_HUNDRED\u003e year the made in india solution offers several protection features like fraud call alerts banking fraud alerts fraud app detectors scam protection dark web monitoring and screen share alerts among others we plan to double our serviceable market in the next few years by adding new solutions while strengthening our channel partnerships and increasing local brand presence salvi said","timestamp":"2024-10-03T11:52:00+05:30","market_timestamp":"2024-10-03T11:52:00+05:30","off_market_hours":false}