{"url":"https://economictimes.indiatimes.com/tech/technology/crowdstrike-executive-questioned-by-lawmakers-over-global-tech-outage/articleshow/113658285.cms","title":"CrowdStrike executive questioned by lawmakers over global tech outage","description":"The July incident underscored how dependent modern commerce and communications have become on just a handful of large technology companies. Travelers were stranded as airlines canceled flights. Emergency services were disrupted as 911 operators found that their systems had failed. Hospitals paused some of their services.","content":"Lawmakers on Tuesday grilled an executive from cybersecurity firm CrowdStrike about a widespread technology outage this summer that crippled global travel, hobbled government agencies and sent major companies scrambling to get their operations back online. The outage was caused by a faulty update sent to CrowdStrike software running on Microsoft's Windows operating system. Devices went spiraling, unable to properly restart unless someone removed the flawed file from their systems. Adam Meyers, CrowdStrike's senior vice president of counter adversary operations, told members of a House Homeland Security subcommittee that the company had instituted new safeguards to ensure that such a failure couldn't happen again. Lawmakers pushed Meyers to explain why the error had happened in the first place and how the company planned to answer for the outage's harm to consumers. \"I want to make sure that you all know what happened, can explain it, and then how you're making sure it's not going to happen again,\" said Rep. Andrew Garbarino, R-N.Y.","cleaned_content":"lawmakers on tuesday grilled an executive from cybersecurity firm crowdstrike about a widespread technology outage this summer that crippled global travel hobbled government agencies and sent major companies scrambling to get their operations back online the outage was caused by a faulty update sent to crowdstrike software running on microsofts windows operating system devices went spiraling unable to properly restart unless someone removed the flawed file from their systems adam meyers crowdstrikes senior vice president of counter adversary operations told members of a house homeland security subcommittee that the company had instituted new safeguards to ensure that such a failure couldnt happen again lawmakers pushed meyers to explain why the error had happened in the first place and how the company planned to answer for the outages harm to consumers i want to make sure that you all know what happened can explain it and then how youre making sure its not going to happen again said rep andrew garbarino r n y","timestamp":"2024-09-25T12:43:00+05:30","market_timestamp":"2024-09-25T12:43:00+05:30","off_market_hours":false}