{"url":"https://economictimes.indiatimes.com/tech/technology/genai-projects-are-influencing-cloud-adoption-hcltech-study/articleshow/113822378.cms","title":"GenAI projects are influencing cloud adoption: HCLTech study","description":"Commissioned by HCLTech, the study of the report was conducted by the global analyst firm, ESG via interviews with business and technology leaders. It offers an analysis of how enterprises are reshaping their cloud strategies to drive innovation and business transformation.","content":"Generative artificial intelligence (GenAI) projects are influencing cloud adoption and increasing interest in cloud native practices for application modernisation as 98% of the enterprises surveyed are exploring customised solutions, says an HCLTech report.Application modernisation is a top priority for cloud value realization and 80% of enterprises agree that the value of the public cloud can only be fully realised if applications are modernised when they are migrated (vs. just lifting and shifting them), said the report titled ‘Cloud Evolution: Mandate to Modernize’.\"Cloud is not just a technology investment; it is fundamental to how businesses modernize. The convergence of cloud, GenAI and the acceleration provided by cloud native practices is essential to how enterprises operate, enabling rapid decision-making, enhancing customer experiences and driving competitive advantage,” said Siki Giunta, executive vice president and head of cloud native center of excellence at HCLTech.\"Embracing cloud native architectures and platform engineering is essential for enterprises aiming to build a robust, future-proof IT landscape that supports continuous innovation. By refactoring applications and leveraging cloud native disciplines and practices, businesses can unlock unprecedented levels of agility, scalability and resilience,” she added.About 55% of the enterprises said that data for custom GenAI solutions resides on-premises leading organizations to initially run some solutions on-premise and scale to cloud over time.","cleaned_content":"generative artificial intelligence genai projects are influencing cloud adoption and increasing interest in cloud native practices for application modernisation as \u003cNINE_TEN_PERCENT\u003e of the enterprises surveyed are exploring customised solutions says an hcltech report application modernisation is a top priority for cloud value realization and \u003cEIGHT_TEN_PERCENT\u003e of enterprises agree that the value of the public cloud can only be fully realised if applications are modernised when they are migrated vs just lifting and shifting them said the report titled cloud evolution mandate to modernize cloud is not just a technology investment it is fundamental to how businesses modernize the convergence of cloud genai and the acceleration provided by cloud native practices is essential to how enterprises operate enabling rapid decision making enhancing customer experiences and driving competitive advantage said siki giunta executive vice president and head of cloud native center of excellence at hcltech embracing cloud native architectures and platform engineering is essential for enterprises aiming to build a robust future proof it landscape that supports continuous innovation by refactoring applications and leveraging cloud native disciplines and practices businesses can unlock unprecedented levels of agility scalability and resilience she added about \u003cFIVE_TEN_PERCENT\u003e of the enterprises said that data for custom genai solutions resides on premises leading organizations to initially run some solutions on premise and scale to cloud over time","timestamp":"2024-09-30T20:08:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}