{"url":"https://economictimes.indiatimes.com/tech/technology/telegrams-durov-announces-new-crackdown-on-illegal-content/articleshow/113616781.cms","title":"Telegram's Durov announces new crackdown on illegal content","description":"Telegram founder and chief executive Pavel Durov said Monday that the messaging platform had removed more \"problematic content\", weeks after his arrest in France on charges of failing to act against criminals using the app. \"Over the past few weeks\" staff had combed through Telegram using artificial intelligence to ensure \"all the problematic content we identified in Search is no longer accessible\", he said.","content":"Telegram founder and chief executive Pavel Durov said Monday that the messaging platform had removed more \"problematic content\", weeks after his arrest in France on charges of failing to act against criminals using the app.Telegram's search feature \"has been abused by people who violated our terms of service to sell illegal goods\", Durov told the 13 million subscribers of his personal messaging channel.\"Over the past few weeks\" staff had combed through Telegram using artificial intelligence to ensure \"all the problematic content we identified in Search is no longer accessible\", he said.Durov added that the platform had updated its terms of service and privacy policy to make clear that it would share infringers' details with authorities -- including internet IP addresses and phone numbers -- \"in response to valid legal requests\".\"We won't let bad actors jeopardise the integrity of our platform for almost a billion users,\" he said.","cleaned_content":"telegram founder and chief executive pavel durov said monday that the messaging platform had removed more problematic content weeks after his arrest in france on charges of failing to act against criminals using the app telegrams search feature has been abused by people who violated our terms of service to sell illegal goods durov told the \u003cONE_TEN\u003e million subscribers of his personal messaging channel over the past few weeks staff had combed through telegram using artificial intelligence to ensure all the problematic content we identified in search is no longer accessible he said durov added that the platform had updated its terms of service and privacy policy to make clear that it would share infringers details with authorities including internet ip addresses and phone numbers in response to valid legal requests we wont let bad actors jeopardise the integrity of our platform for almost a billion users he said","timestamp":"2024-09-24T09:09:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}