{"url":"https://economictimes.indiatimes.com/tech/technology/pb-fintech-shares-drop-over-10-on-plans-of-healthcare-foray/articleshow/113691387.cms","title":"PB Fintech shares drop over 10% on plans of healthcare foray","description":"Shares of PB Fintech fell over 10% to Rs 1,545 during Thursday's intraday trading on the BSE after the company suggested it might venture into the healthcare sector. The company stated, “We are still exploring, but currently have no decisions to announce. Any decision made will be communicated to the stock exchanges.”","content":"Shares of PB Fintech tumbled over 10% to Rs 1,545 in Thursday's intraday trade on BSE after the company indicated that it may foray into the healthcare space.In an exchange filing clarifying the news, PB Fintech stated, “We believe that if claims processes were quicker and smoother, it would increase the number of people purchasing health insurance. It would be much better if the interests of insurers and hospitals were aligned to provide customers with an exceptional claims experience, which we believe would enhance insurance penetration.”The company further said, “We continue to explore, but have no decisions to update at the moment. A decision if and when arrived will be informed to the stock exchanges.”At 11:16 am, the stock was trading 5.7% lower at Rs 1,623 on BSE. The multibagger stock has delivered 117% returns over the past one-year period while returns in 2024 so far have been to the tune of 103%. This is a significant outperformance over Sensex, which has yielded 26% in the last one year while returning 16% on a year-to-date basis.The company had reported a consolidated net profit of Rs 60 crore for the quarter ended June 30, 2024, against a loss of Rs 12 crore reported in the year-ago period. The revenue grew 52% YoY to Rs 1,010 crore.","cleaned_content":"shares of pb fintech tumbled over \u003cONE_TEN_PERCENT\u003e to rs \u003cONE_THOUSAND\u003e in thursdays intraday trade on bse after the company indicated that it may foray into the healthcare space in an exchange filing clarifying the news pb fintech stated we believe that if claims processes were quicker and smoother it would increase the number of people purchasing health insurance it would be much better if the interests of insurers and hospitals were aligned to provide customers with an exceptional claims experience which we believe would enhance insurance penetration the company further said we continue to explore but have no decisions to update at the moment a decision if and when arrived will be informed to the stock exchanges at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am the stock was trading \u003cFIVE_PERCENT\u003e lower at rs \u003cONE_THOUSAND\u003e on bse the multibagger stock has delivered \u003cONE_HUNDRED_PERCENT\u003e returns over the past one year period while returns in \u003cTWO_THOUSAND\u003e so far have been to the tune of \u003cONE_HUNDRED_PERCENT\u003e this is a significant outperformance over sensex which has yielded \u003cTWO_TEN_PERCENT\u003e in the last one year while returning \u003cONE_TEN_PERCENT\u003e on a year to date basis the company had reported a consolidated net profit of rs \u003cSIX_TEN\u003e crore for the quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e against a loss of rs \u003cONE_TEN\u003e crore reported in the year ago period the revenue grew \u003cFIVE_TEN_PERCENT\u003e yoy to rs \u003cONE_THOUSAND\u003e crore","timestamp":"2024-09-26T11:50:00+05:30","market_timestamp":"2024-09-26T11:50:00+05:30","off_market_hours":false}