{"url":"https://economictimes.indiatimes.com/tech/technology/meta-australian-banks-tout-progress-on-taking-down-celeb-bait-scam-ads/articleshow/113877609.cms","title":"Meta, Australian banks tout progress on taking down 'celeb bait' scam ads","description":"The U.S. social media giant said it took down the scam ads after receiving 102 reports since April from the Australian Financial Crimes Exchange, an intelligence-sharing body run by the country's main banks. Such scams are a global problem, but Meta is under heightened pressure to tackle the issue in Australia with Prime Minister Anthony Albanese's government planning to introduce an anti-scam law by the end of the year.","content":"Meta said it has taken down some 8,000 so-called \"celeb bait\" scam ads from Facebook and Instagram as part of a new effort with Australian banks to curb the practice. The scams use images of famous people, often generated by artificial intelligence, to trick consumers into giving money to non-existent investment schemes. The U.S. social media giant said it took down the scam ads after receiving 102 reports since April from the Australian Financial Crimes Exchange, an intelligence-sharing body run by the country's main banks. Such scams are a global problem, but Meta is under heightened pressure to tackle the issue in Australia with Prime Minister Anthony Albanese's government planning to introduce an anti-scam law by the end of the year. The bill proposes A$50 million ($34 million) fines for social media, financial and telecommunications companies which fail to meet their obligations to crack down on the practice. A public consultation closes on Oct. 4.","cleaned_content":"meta said it has taken down some \u003cEIGHT_THOUSAND\u003e so called celeb bait scam ads from facebook and instagram as part of a new effort with australian banks to curb the practice the scams use images of famous people often generated by artificial intelligence to trick consumers into giving money to non existent investment schemes the u s social media giant said it took down the scam ads after receiving \u003cONE_HUNDRED\u003e reports since april from the australian financial crimes exchange an intelligence sharing body run by the countrys main banks such scams are a global problem but meta is under heightened pressure to tackle the issue in australia with prime minister anthony albaneses government planning to introduce an anti scam law by the end of the year the bill proposes a \u003cFIVE_TEN\u003e million \u003cTHREE_TEN\u003e million fines for social media financial and telecommunications companies which fail to meet their obligations to crack down on the practice a public consultation closes on oct \u003cFOUR_\u003e","timestamp":"2024-10-02T17:08:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}