{"url":"https://economictimes.indiatimes.com/tech/information-tech/accenture-q4-profit-up-22-genai-bookings-at-1-billion/articleshow/113706481.cms","title":"Accenture Q4 profit up 22%, GenAI bookings at $1 billion","description":"Accenture follows a September-August financial year. The Accenture forecast is an important indicator of the performance of key Indian IT companies as they start reporting their quarter earnings starting from Tata Consultancy Services in early October.","content":"World’s biggest technology services player Accenture on Thursday reported a 22.6% year-on-year (YoY) rise in net profit at $1.68 billion for the fourth quarter ending August 2024. This compares with $1.37 billion profit in June-August quarter 2023. The profit grew on the back of healthy growth in North America and health \u0026 public services segment aided by robust new bookings, especially generative artificial intelligence (GenAI) deals.The Nasdaq-listed IT major hiked its annual revenue growth forecast to 3-6% for 2025, including 2-3% from mergers and acquisitions (M\u0026A). This is on the back of improvement in the macroeconomic environment and the US Federal Reserve’s recent interest rate cut of 0.5%.Accenture follows a September-August financial year. The Accenture forecast is an important indicator of the performance of key Indian IT companies as they start reporting their quarter earnings starting from Tata Consultancy Services in early October.Its fourth quarter revenues of $16.4 billion, increased 3% in dollar terms and 5% in local currency driven by faster growth in managed services as compared with consulting revenues.The Ireland headquartered IT firm’s consulting revenues were up by 1% in dollar terms and 3% in local currency at $8.26 billion as compared with the fourth quarter of fiscal 2023. Managed Services revenues increased to $8.15 billion, up 5% and 7% in dollar and local currency terms from a year ago.","cleaned_content":"world s biggest technology services player accenture on thursday reported a \u003cTWO_TEN_PERCENT\u003e year on year yoy rise in net profit at \u003cONE_\u003e billion for the fourth quarter ending august \u003cTWO_THOUSAND\u003e this compares with \u003cONE_\u003e billion profit in june august quarter \u003cTWO_THOUSAND\u003e the profit grew on the back of healthy growth in north america and health public services segment aided by robust new bookings especially generative artificial intelligence genai deals the nasdaq listed it major hiked its annual revenue growth forecast to \u003cTHREE_\u003e \u003cSIX_PERCENT\u003e for \u003cTWO_THOUSAND\u003e including \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e from mergers and acquisitions m a this is on the back of improvement in the macroeconomic environment and the us federal reserve s recent interest rate cut of \u003cZERO_PERCENT\u003e accenture follows a september august financial year the accenture forecast is an important indicator of the performance of key indian it companies as they start reporting their quarter earnings starting from tata consultancy services in early october its fourth quarter revenues of \u003cONE_TEN\u003e billion increased \u003cTHREE_PERCENT\u003e in dollar terms and \u003cFIVE_PERCENT\u003e in local currency driven by faster growth in managed services as compared with consulting revenues the ireland headquartered it firm s consulting revenues were up by \u003cONE_PERCENT\u003e in dollar terms and \u003cTHREE_PERCENT\u003e in local currency at \u003cEIGHT_\u003e billion as compared with the fourth quarter of fiscal \u003cTWO_THOUSAND\u003e managed services revenues increased to \u003cEIGHT_\u003e billion up \u003cFIVE_PERCENT\u003e and \u003cSEVEN_PERCENT\u003e in dollar and local currency terms from a year ago","timestamp":"2024-09-26T20:00:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}