{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firm-ust-to-add-over-3000-jobs-in-kochi-centre/articleshow/113811152.cms","title":"IT firm UST to add over 3,000 jobs in Kochi centre","description":"The firm will inaugurate its second own campus in Kochi by December 2027, the company said in a statement. The company laid the foundation stone for the new Kochi campus that is coming up in a 9-acre land at Infopark Kochi Phase 2 and the new UST campus will be completed in three years.","content":"IT services firm UST said on Monday that it is expanding its presence in India by adding more than 3,000 new jobs at its upcoming Kochi campus in the next five years. It has set a target of 6,000 employees, up from the current level of 2,800, in the next five years at the centre.The firm will inaugurate its second campus in Kochi by December 2027, it said in a statement.The company laid the foundation stone for the new Kochi campus that is coming up on a 9-acre land at Infopark Kochi Phase 2 and the new UST campus will be completed in three years.“When the Kochi campus goes on stream, it will become the second owned campus in India for UST after Thiruvananthapuram,” it said.While UST’s Thiruvananthapuram centre has about 7,500 employees and is the company’s largest centre globally, UST Bengaluru has about 6,500 employees. Across India, the IT firm has around 20,000 employees.","cleaned_content":"it services firm ust said on monday that it is expanding its presence in india by adding more than \u003cTHREE_THOUSAND\u003e new jobs at its upcoming kochi campus in the next five years it has set a target of \u003cSIX_THOUSAND\u003e employees up from the current level of \u003cTWO_THOUSAND\u003e in the next five years at the centre the firm will inaugurate its second campus in kochi by december \u003cTWO_THOUSAND\u003e it said in a statement the company laid the foundation stone for the new kochi campus that is coming up on a \u003cNINE_\u003e acre land at infopark kochi phase \u003cTWO_\u003e and the new ust campus will be completed in three years when the kochi campus goes on stream it will become the second owned campus in india for ust after thiruvananthapuram it said while ust s thiruvananthapuram centre has about \u003cSEVEN_THOUSAND\u003e employees and is the company s largest centre globally ust bengaluru has about \u003cSIX_THOUSAND\u003e employees across india the it firm has around \u003cTWO_TEN_THOUSAND\u003e employees","timestamp":"2024-09-30T15:11:00+05:30","market_timestamp":"2024-09-30T15:11:00+05:30","off_market_hours":false}