{"url":"https://economictimes.indiatimes.com/tech/technology/biden-exempts-some-semiconductor-factories-from-environmental-reviews/articleshow/113891156.cms","title":"Biden exempts some semiconductor factories from environmental reviews","description":"Environmental groups like the Sierra Club say the reviews are essential to \"keep communities and workers safe from the hazardous contaminants used in the semiconductor industry.\"","content":"President Joe Biden on Wednesday signed legislation that will exempt some U.S. semiconductor manufacturing facilities from federal environmental reviews that are receiving government subsidies. Without the new law, projects from the $52.7 billion CHIPS Act of 2022 could have been forced to undergo additional federal environmental reviews under the National Environmental Policy Act of 1969 to win federal permits. Proponents say those projects had already complied with federal, state and local environmental regulations and permitting requirements and that without the change they could have potentially faced years of additional delays. Environmental groups like the Sierra Club say the reviews are essential to \"keep communities and workers safe from the hazardous contaminants used in the semiconductor industry.\" The U.S. Commerce Department has allocated more than $35 billion for 26 projects including $6.4 billion in grants under the 2022 law to South Korea's Samsung, to expand chip production in Texas, $8.5 billion for Intel, $6.6 billion for Taiwan's TSMC to build out its American production and $6.1 billion for Micron Technology to fund U.S. factories.","cleaned_content":"president joe biden on wednesday signed legislation that will exempt some u s semiconductor manufacturing facilities from federal environmental reviews that are receiving government subsidies without the new law projects from the \u003cFIVE_TEN\u003e billion chips act of \u003cTWO_THOUSAND\u003e could have been forced to undergo additional federal environmental reviews under the national environmental policy act of \u003cONE_THOUSAND\u003e to win federal permits proponents say those projects had already complied with federal state and local environmental regulations and permitting requirements and that without the change they could have potentially faced years of additional delays environmental groups like the sierra club say the reviews are essential to keep communities and workers safe from the hazardous contaminants used in the semiconductor industry the u s commerce department has allocated more than \u003cTHREE_TEN\u003e billion for \u003cTWO_TEN\u003e projects including \u003cSIX_\u003e billion in grants under the \u003cTWO_THOUSAND\u003e law to south koreas samsung to expand chip production in texas \u003cEIGHT_\u003e billion for intel \u003cSIX_\u003e billion for taiwans tsmc to build out its american production and \u003cSIX_\u003e billion for micron technology to fund u s factories","timestamp":"2024-10-03T08:33:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}