{"url":"https://economictimes.indiatimes.com/tech/technology/how-google-defended-itself-in-the-ad-tech-antitrust-trial/articleshow/113757024.cms","title":"How Google defended itself in the ad tech antitrust trial","description":"The government last week concluded its main arguments in the case, US et al. v. Google, which was filed last year and accuses Google of building a monopoly over the technology that places ads on websites around the internet.","content":"Over the past week, Google has called more than a dozen witnesses to defend itself against claims by the Justice Department and a group of state attorneys general that it has a monopoly in advertising software that places ads on web pages, part of a second major federal antitrust trial against the tech giant. Google's lawyers wrapped up their arguments in the case on Friday, and the government will now offer a rebuttal. Judge Leonie Brinkema of the US District Court for the Eastern District of Virginia, who is presiding over the nonjury trial, is expected to deliver a ruling by the end of the year, after both sides summarize their cases in writing and deliver closing arguments. The government last week concluded its main arguments in the case, US et al. v. Google, which was filed last year and accuses Google of building a monopoly over the technology that places ads on websites around the internet. The company's defense has centered on how its actions were justified and how it helped publishers, advertisers and competition. Here are Google's main arguments. How Google claims its actions were justified","cleaned_content":"over the past week google has called more than a dozen witnesses to defend itself against claims by the justice department and a group of state attorneys general that it has a monopoly in advertising software that places ads on web pages part of a second major federal antitrust trial against the tech giant googles lawyers wrapped up their arguments in the case on friday and the government will now offer a rebuttal judge leonie brinkema of the us district court for the eastern district of virginia who is presiding over the nonjury trial is expected to deliver a ruling by the end of the year after both sides summarize their cases in writing and deliver closing arguments the government last week concluded its main arguments in the case us et al v google which was filed last year and accuses google of building a monopoly over the technology that places ads on websites around the internet the companys defense has centered on how its actions were justified and how it helped publishers advertisers and competition here are googles main arguments how google claims its actions were justified","timestamp":"2024-09-28T10:31:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}