{"url":"https://economictimes.indiatimes.com/tech/technology/apple-accused-by-us-labor-board-of-imposing-illegal-workplace-rules/articleshow/113868914.cms","title":"Apple accused by US labor board of imposing illegal workplace rules","description":"Apple has been accused by a U.S. labor board of infringing on workers' rights through illegal confidentiality and non-compete agreements. The board says Apple imposed broad misconduct and social media policies. Apple denies the allegations and plans to contest them. The case will go before an administrative judge if not settled.","content":"A U.S. labor board issued a complaint accusing Apple of violating employees' rights to organize and advocate for better working conditions by maintaining a series of unlawful workplace rules. The National Labor Relations Board in the complaint announced late on Monday claims Apple required employees nationwide to sign illegal confidentiality, non-disclosure, and non-compete agreements and imposed overly broad misconduct and social media policies. The complaint accuses Apple of \"interfering with, restraining, and coercing employees in the exercise of\" their rights under federal labor law. Apple, in a statement provided by a spokesperson, said it has always respected its employees' rights to discuss wages, hours and working conditions, which is reflected in its employment policies. \"We strongly disagree with these claims and will continue to share the facts at the hearing,\" the company said.","cleaned_content":"a u s labor board issued a complaint accusing apple of violating employees rights to organize and advocate for better working conditions by maintaining a series of unlawful workplace rules the national labor relations board in the complaint announced late on monday claims apple required employees nationwide to sign illegal confidentiality non disclosure and non compete agreements and imposed overly broad misconduct and social media policies the complaint accuses apple of interfering with restraining and coercing employees in the exercise of their rights under federal labor law apple in a statement provided by a spokesperson said it has always respected its employees rights to discuss wages hours and working conditions which is reflected in its employment policies we strongly disagree with these claims and will continue to share the facts at the hearing the company said","timestamp":"2024-10-02T10:07:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}