{"url":"https://economictimes.indiatimes.com/tech/technology/bharat-electronics-israel-aerospace-industries-form-joint-venture-company/articleshow/113898497.cms","title":"Bharat Electronics, Israel Aerospace Industries form joint venture company","description":"It was jointly developed by IAI and DRDO for India's defence forces and is currently used by the Indian Air Force, Indian Army, Indian Navy and also Israeli defence forces, it was noted. The system includes an Advanced Phased Array Radar, Command and Control shelter, mobile launchers and interceptors with an advanced RF seeker.","content":"Navratna defence PSU Bharat Electronics Limited (BEL) and Israel Aerospace Industries (IAI), Israel's leading aerospace and defence company, have announced the establishment of a joint venture company (JVC), which has been incorporated in the name of BEL IAI AeroSystems Private Ltd. The JVC with its registered office in Delhi shall be the single point of contact (SPOC) for extending long-term product support to the Medium Range Surface-to-Air Missile (MRSAM) systems of India's defence forces, Bengaluru-headquartered BEL said in a statement on Thursday. \"The partnership marks another significant step in cementing the relationship between the two companies that have a long history of association for strategic programmes. BEL and IAI are collaborating on several joint programmes for the Tri-services,\" it said. BEL said the JVC has been set up to provide life cycle support, both technical and maintenance related, for MRSAM air-defence systems of the country. MRSAM is an advanced, path-breaking air and missile defence system that provides protection against a variety of aerial threats, according to the company. It was jointly developed by IAI and DRDO for India's defence forces and is currently used by the Indian Air Force, Indian Army, Indian Navy and also Israeli defence forces, it was noted. The system includes an Advanced Phased Array Radar, Command and Control shelter, mobile launchers and interceptors with an advanced RF seeker. ","cleaned_content":"navratna defence psu bharat electronics limited bel and israel aerospace industries iai israels leading aerospace and defence company have announced the establishment of a joint venture company jvc which has been incorporated in the name of bel iai aerosystems private ltd the jvc with its registered office in delhi shall be the single point of contact spoc for extending long term product support to the medium range surface to air missile mrsam systems of indias defence forces bengaluru headquartered bel said in a statement on thursday the partnership marks another significant step in cementing the relationship between the two companies that have a long history of association for strategic programmes bel and iai are collaborating on several joint programmes for the tri services it said bel said the jvc has been set up to provide life cycle support both technical and maintenance related for mrsam air defence systems of the country mrsam is an advanced path breaking air and missile defence system that provides protection against a variety of aerial threats according to the company it was jointly developed by iai and drdo for indias defence forces and is currently used by the indian air force indian army indian navy and also israeli defence forces it was noted the system includes an advanced phased array radar command and control shelter mobile launchers and interceptors with an advanced rf seeker","timestamp":"2024-10-03T12:18:00+05:30","market_timestamp":"2024-10-03T12:18:00+05:30","off_market_hours":false}