{"url":"https://economictimes.indiatimes.com/tech/technology/crypto-asset-manager-bitwise-files-for-xrp-etp-with-securities-regulator/articleshow/113901491.cms","title":"Crypto asset manager Bitwise files for XRP ETP with securities regulator","description":"Bitwise earlier this year was among the firms which got the nod from the Securities and Exchange Commission for their bitcoin ETFs. The approval came after a decade-long tussle between the digital asset industry and the SEC, which had rejected the products due to market manipulation concerns.","content":"Crypto asset manager Bitwise has filed an initial registration statement with the U.S. SEC for an exchange-traded product for XRP tokens, as it seeks to introduce more crypto products after a landmark regulatory decision to approve spot bitcoin ETF earlier this year. Bitwise earlier this year was among the firms which got the nod from the Securities and Exchange Commission for their bitcoin ETFs. The approval came after a decade-long tussle between the digital asset industry and the SEC, which had rejected the products due to market manipulation concerns. XRP is a digital token that powers the XRP Ledger (XRPL) public blockchain. XRPL is best known for its role in facilitating cross-border payments and remittances. The token has a market value of above $30 billion, Bitwise said. Exchange-traded product is a regularly priced security that trades on a stock exchange. It tracks underlying security, currency or an asset. These are similar to stocks and can be bought and sold during the day.","cleaned_content":"crypto asset manager bitwise has filed an initial registration statement with the u s sec for an exchange traded product for xrp tokens as it seeks to introduce more crypto products after a landmark regulatory decision to approve spot bitcoin etf earlier this year bitwise earlier this year was among the firms which got the nod from the securities and exchange commission for their bitcoin etfs the approval came after a decade long tussle between the digital asset industry and the sec which had rejected the products due to market manipulation concerns xrp is a digital token that powers the xrp ledger xrpl public blockchain xrpl is best known for its role in facilitating cross border payments and remittances the token has a market value of above \u003cTHREE_TEN\u003e billion bitwise said exchange traded product is a regularly priced security that trades on a stock exchange it tracks underlying security currency or an asset these are similar to stocks and can be bought and sold during the day","timestamp":"2024-10-03T13:43:00+05:30","market_timestamp":"2024-10-03T13:43:00+05:30","off_market_hours":false}