{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-wins-partial-dismissal-of-us-antitrust-lawsuit/articleshow/113832423.cms","title":"Amazon wins partial dismissal of US antitrust lawsuit","description":"A federal court in Seattle partly dismissed the FTC's lawsuit against Amazon, which accused the retailer of maintaining illegal monopolies. The FTC claims Amazon used anti-competitive tactics, including price algorithms and coercing sellers to use its services. The case will proceed in two parts as per Judge John Chun's ruling.","content":"Amazon.com Inc won partial dismissal of a U.S. Federal Trade Commission lawsuit accusing it of maintaining illegal monopolies, though the details of the ruling by a federal court in Seattle on Monday were not immediately clear. The FTC has accused the online retailer of using anti-competitive tactics to maintain dominance among online superstores and marketplaces. Amazon asked U.S. District Judge John Chun to dismiss the case in December, saying the FTC had raised no evidence of harm to consumers. Last year, the FTC alleged Amazon.com, which has 1 billion items in its online superstore, was using an algorithm that pushed up prices U.S. households paid by more than $1 billion. Amazon has said in court papers it stopped using the program in 2019. Chun issued a sealed ruling, partially granting Amazon's motion. The FTC will be allowed to continue to pursue any claims the judge did not permanently dismiss, court records showed. Chun also ruled the case will be tried in two parts, rejecting Amazon's bid to have the FTC present evidence of the alleged violations and its proposed remedies in the same trial.","cleaned_content":"amazon com inc won partial dismissal of a u s federal trade commission lawsuit accusing it of maintaining illegal monopolies though the details of the ruling by a federal court in seattle on monday were not immediately clear the ftc has accused the online retailer of using anti competitive tactics to maintain dominance among online superstores and marketplaces amazon asked u s district judge john chun to dismiss the case in december saying the ftc had raised no evidence of harm to consumers last year the ftc alleged amazon com which has \u003cONE_\u003e billion items in its online superstore was using an algorithm that pushed up prices u s households paid by more than \u003cONE_\u003e billion amazon has said in court papers it stopped using the program in \u003cTWO_THOUSAND\u003e chun issued a sealed ruling partially granting amazons motion the ftc will be allowed to continue to pursue any claims the judge did not permanently dismiss court records showed chun also ruled the case will be tried in two parts rejecting amazons bid to have the ftc present evidence of the alleged violations and its proposed remedies in the same trial","timestamp":"2024-10-01T07:21:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}