{"url":"https://economictimes.indiatimes.com/tech/technology/crowdstrike-exec-to-apologise-for-faulty-update-that-caused-global-it-outage/articleshow/113634576.cms","title":"CrowdStrike exec to apologise for faulty update that caused global IT outage","description":"Adam Meyers, senior vice president for counter adversary operations at CrowdStrike, will tell the House Homeland Security Cybersecurity and Infrastructure Protection subcommittee that CrowdStrike released a content configuration update that resulted in system crashes for many customers.","content":"A senior executive at cybersecurity firm CrowdStrike will apologise at an appearance before a U.S. House of Representatives subcommittee on Tuesday for the company's faulty software update that caused a global IT outage in July. Adam Meyers, senior vice president for counter adversary operations at CrowdStrike, will tell the House Homeland Security Cybersecurity and Infrastructure Protection subcommittee that CrowdStrike released a content configuration update that resulted in system crashes for many customers.  \"We are deeply sorry this happened and are determined to prevent it from happening again,\" Meyers' written testimony said.  \"We have undertaken a full review of our systems and begun implementing plans to bolster our content update procedures so that we emerge from this experience as a stronger company.\"","cleaned_content":"a senior executive at cybersecurity firm crowdstrike will apologise at an appearance before a u s house of representatives subcommittee on tuesday for the companys faulty software update that caused a global it outage in july adam meyers senior vice president for counter adversary operations at crowdstrike will tell the house homeland security cybersecurity and infrastructure protection subcommittee that crowdstrike released a content configuration update that resulted in system crashes for many customers we are deeply sorry this happened and are determined to prevent it from happening again meyers written testimony said we have undertaken a full review of our systems and begun implementing plans to bolster our content update procedures so that we emerge from this experience as a stronger company","timestamp":"2024-09-24T17:35:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}