{"url":"https://economictimes.indiatimes.com/tech/technology/apple-may-need-to-turn-to-china-after-tata-plant-fire/articleshow/113852047.cms","title":"Apple may need to turn to China after Tata plant fire","description":"The weekend blaze has caused an indefinite production halt at Tata's Hosur plant in Tamil Nadu, the only Indian supplier of iPhone back panels and some other parts for both contract manufacturer Foxconn in the country and its own iPhone assembly at another plant.","content":"Extensive damage from a fire at Tata Group's Apple iPhone component plant in southern India could hamper production ahead of a festive season sales surge, an industry watcher and a source said, forcing the US firm's suppliers to arrange critical parts from China or elsewhere. The weekend blaze has caused an indefinite production halt at Tata's Hosur plant in Tamil Nadu, the only Indian supplier of iPhone back panels and some other parts for both contract manufacturer Foxconn in the country and its own iPhone assembly at another plant. Hong Kong-based Counterpoint Research told Reuters it estimates local sales of 1.5 million units of iPhone 14 and 15 models during the Indian festive season which runs from late October to early November, with Apple struggling to fulfil as much as 15% of that demand due to the fire. \"There will be a 10-15% impact on production of older iPhone models from India. Apple could offset that impact by importing more components, and by re-routing more export inventory towards India,\" said Neil Shah, a co-founder of Counterpoint, which has for years tracked Apple's global shipments.  Apart from local sales, Tata, one of India's biggest conglomerates, also exported iPhones to the Netherlands and United States as well as some parts to China, worth more than $250 million overall, in the year to Aug. 31, commercially available customs data shows.","cleaned_content":"extensive damage from a fire at tata groups apple iphone component plant in southern india could hamper production ahead of a festive season sales surge an industry watcher and a source said forcing the us firms suppliers to arrange critical parts from china or elsewhere the weekend blaze has caused an indefinite production halt at tatas hosur plant in tamil nadu the only indian supplier of iphone back panels and some other parts for both contract manufacturer foxconn in the country and its own iphone assembly at another plant hong kong based counterpoint research told reuters it estimates local sales of \u003cONE_\u003e million units of iphone \u003cONE_TEN\u003e and \u003cONE_TEN\u003e models during the indian festive season which runs from late october to early november with apple struggling to fulfil as much as \u003cONE_TEN_PERCENT\u003e of that demand due to the fire there will be a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e impact on production of older iphone models from india apple could offset that impact by importing more components and by re routing more export inventory towards india said neil shah a co founder of counterpoint which has for years tracked apples global shipments apart from local sales tata one of indias biggest conglomerates also exported iphones to the netherlands and united states as well as some parts to china worth more than \u003cTWO_HUNDRED\u003e million overall in the year to aug \u003cTHREE_TEN\u003e commercially available customs data shows","timestamp":"2024-10-01T17:23:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}