{"url":"https://economictimes.indiatimes.com/tech/technology/tsmc-samsung-consider-building-chip-factories-in-uae-report/articleshow/113582459.cms","title":"TSMC, Samsung consider building chip factories in UAE: report","description":"Top executives at TSMC have visited the UAE recently and talked about a plant complex on par with some of the company's largest and most advanced facilities in Taiwan, the WSJ said, citing people familiar with the interactions.","content":"Two of the world's largest chipmakers, TSMC and Samsung Electronics, have discussed building potential chip projects in the United Arab Emirates in coming years which could be worth more than $100 billion, the Wall Street Journal reported on Sunday. Top executives at TSMC have visited the UAE recently and talked about a plant complex on par with some of the company's largest and most advanced facilities in Taiwan, the WSJ said, citing people familiar with the interactions. South Korea-based Samsung Electronics, a maker of smartphones, TVs and memory chips, is also considering major new chip-making operations in the country in the years ahead, the paper said. TSMC told Reuters it had no new investment plans to announce. \"We are always open to constructive discussion on ways to promote development of the semiconductor industry, but we remain focused on our current global expansion projects and have no new investment plans to disclose at this time,\" it said in a statement on Monday, without elaborating.","cleaned_content":"two of the worlds largest chipmakers tsmc and samsung electronics have discussed building potential chip projects in the united arab emirates in coming years which could be worth more than \u003cONE_HUNDRED\u003e billion the wall street journal reported on sunday top executives at tsmc have visited the uae recently and talked about a plant complex on par with some of the companys largest and most advanced facilities in taiwan the wsj said citing people familiar with the interactions south korea based samsung electronics a maker of smartphones tvs and memory chips is also considering major new chip making operations in the country in the years ahead the paper said tsmc told reuters it had no new investment plans to announce we are always open to constructive discussion on ways to promote development of the semiconductor industry but we remain focused on our current global expansion projects and have no new investment plans to disclose at this time it said in a statement on monday without elaborating","timestamp":"2024-09-23T08:09:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}