{"url":"https://economictimes.indiatimes.com/tech/technology/sebis-new-fo-norms-to-hit-zerodhas-volumes-business-says-cofounder-nithin-kamath/articleshow/113913573.cms","title":"Sebi’s new F\u0026O norms to hit Zerodha’s volumes, business, says cofounder Nithin Kamath","description":"The new rules, which will kick in on November 20, could reduce Zerodha’s volumes by 60% he added. According to a Sebi study, retail traders in the market have shot up from 5.1 million in FY22 to 9.6 million in FY24. This has fuelled fears of savings moving away from secure investments to speculative activities in the F\u0026O segment.","content":"The Securities and Exchange Board of India’s (Sebi) recent measures on futures and options (F\u0026O) trading are expected to reduce Zerodha’s overall F\u0026O trading volumes by 60% and impact its business by nearly 30%, cofounder Nithin Kamath said. Kamath added that after November 20, when the fresh rules will be implemented the company will decide on its pricing structure.“As things stand, assuming that those trading weekly don't move on to trading monthly, the impact will be ~60% of overall F\u0026O trades and ~30% of our overall orders,” Kamath wrote on X (formerly Twitter).“I guess things will become much clearer from November 20th. We will then decide on our change in pricing structure, based on the impact on the business,” he added.On October 1, the markets regulator announced a series of directives aimed at reducing risks for retail traders in the F\u0026O market, acknowledging the speculative nature of index derivatives trading.","cleaned_content":"the securities and exchange board of india s sebi recent measures on futures and options f o trading are expected to reduce zerodha s overall f o trading volumes by \u003cSIX_TEN_PERCENT\u003e and impact its business by nearly \u003cTHREE_TEN_PERCENT\u003e cofounder nithin kamath said kamath added that after november \u003cTWO_TEN\u003e when the fresh rules will be implemented the company will decide on its pricing structure as things stand assuming that those trading weekly dont move on to trading monthly the impact will be \u003cSIX_TEN_PERCENT\u003e of overall f o trades and \u003cTHREE_TEN_PERCENT\u003e of our overall orders kamath wrote on x formerly twitter i guess things will become much clearer from november \u003cTWO_TEN\u003e th we will then decide on our change in pricing structure based on the impact on the business he added on october \u003cONE_\u003e the markets regulator announced a series of directives aimed at reducing risks for retail traders in the f o market acknowledging the speculative nature of index derivatives trading","timestamp":"2024-10-03T20:31:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}