{"url":"https://economictimes.indiatimes.com/tech/technology/oister-global-in-pact-with-tribe-capital-for-secondaries-focused-fund/articleshow/113599403.cms","title":"Oister Global, Tribe Capital India to launch fund targeting secondary deals","description":"Gurugram-based Oister Global has partnered with Tribe Capital India to launch a $500 million fund focused on secondary transactions in the Indian private market. This collaboration aims to capitalize on the growing trend of secondary stake sales in late-stage startups, leveraging both firms' expertise in due diligence and investment strategies.","content":"Oister Global, the Gurugram-based investment company that has backed private market funds across venture capital, growth equity and private equity, has partnered with the India arm of Silicon Valley VC firm Tribe Capital to launch a new fund focused on secondary transactions.The partnership aims to invest $500 million in the next two years as secondary private market transactions in India gain momentum. According to Oister Global, $7.7 billion had been transacted through private secondary deals in India in the last four to five years. This exceeds the total amount raised via IPO exits during the same period.Speaking to ET, Oister Global co-chief executive officer Sandeep Sinha said the new fund — Oister Tribe Ace Fund — has been set up as a category-II alternative investment fund.“It’s a shorter duration (five-year) fund, where we have pre-selected a few companies which are in Series C, Series D level of maturity. These are companies that are looking to do their IPOs within the next 12-36 months, which means that there is a faster path to liquidity,” Sinha said.“All these companies, which we’re talking about, are the ones which have fairly matured business models, are market leaders in their segments, and are not in need for capital in the short duration…they are either breakeven or on the path to breaking even, and have at least about 1.0-1.5 years’ worth of liquidity in hand,” he said, detailing the new fund’s investment thesis.","cleaned_content":"oister global the gurugram based investment company that has backed private market funds across venture capital growth equity and private equity has partnered with the india arm of silicon valley vc firm tribe capital to launch a new fund focused on secondary transactions the partnership aims to invest \u003cFIVE_HUNDRED\u003e million in the next two years as secondary private market transactions in india gain momentum according to oister global \u003cSEVEN_\u003e billion had been transacted through private secondary deals in india in the last four to five years this exceeds the total amount raised via ipo exits during the same period speaking to et oister global co chief executive officer sandeep sinha said the new fund oister tribe ace fund has been set up as a category ii alternative investment fund it s a shorter duration five year fund where we have pre selected a few companies which are in series c series d level of maturity these are companies that are looking to do their ipos within the next \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e months which means that there is a faster path to liquidity sinha said all these companies which we re talking about are the ones which have fairly matured business models are market leaders in their segments and are not in need for capital in the short duration they are either breakeven or on the path to breaking even and have at least about \u003cONE_\u003e \u003cONE_\u003e years worth of liquidity in hand he said detailing the new fund s investment thesis","timestamp":"2024-09-23T22:08:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}