{"url":"https://economictimes.indiatimes.com/tech/technology/flipkart-gets-seema-nair-as-new-chro/articleshow/113605834.cms","title":"Flipkart appoints Reliance Industries’ Seema Nair as HR head","description":"Prior to this, Nair spent over six years at Reliance Industries as head of group HR digitisation and head of the group HR office. She was also CHRO for India and SAARC at Hindustan Coca-Cola Beverages and Cisco Systems.","content":"Walmart-owned Flipkart has appointed Seema Nair as the chief human resources officer (CHRO), according to an internal email from group chief executive Kalyan Krishnamurthy. “In this role, she will oversee human resources for Flipkart, partnering closely with respective leaders and HR teams,” he said. In October last year, ET reported that Krishna Raghavan, who had served as the ecommerce firm's CHRO for over six years, had left the company.Before joining Flipkart, Nair spent over six years at Reliance Industries, where she handled group-level assignments as the head of group HR digitisation and the head of the group HR office.Nair has also held the position of CHRO for India and SAARC at Hindustan Coca Cola Beverages as well as Cisco Systems. ","cleaned_content":"walmart owned flipkart has appointed seema nair as the chief human resources officer chro according to an internal email from group chief executive kalyan krishnamurthy in this role she will oversee human resources for flipkart partnering closely with respective leaders and hr teams he said in october last year et reported that krishna raghavan who had served as the ecommerce firms chro for over six years had left the company before joining flipkart nair spent over six years at reliance industries where she handled group level assignments as the head of group hr digitisation and the head of the group hr office nair has also held the position of chro for india and saarc at hindustan coca cola beverages as well as cisco systems","timestamp":"2024-09-23T20:53:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}