{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-announces-commission-hike-for-content-creators-ahead-of-festive-sale/articleshow/113594304.cms","title":"Amazon announces commission hike for content creators ahead of festive sale","description":"The revised structure will offer content creators 1.5x-2x increased income across a wide range of product categories, including popular choices like fashion, beauty and personal care appliances, home, kitchen, toys, and books, Amazon said.","content":"Ecommerce platform Amazon on Monday announced an increase in its standard commission income rates across 20 plus sub-categories for over 50,000 content creators engaged with it. The revised structure will offer content creators 1.5x-2x increased income across a wide range of product categories, including popular choices like fashion, beauty and personal care appliances, home, kitchen, toys, and books, Amazon said.  \"This empowers creators to earn more during the peak shopping season and capitalise on the increased consumer demand during the Amazon Great Indian Festival (AGIF),\" a company statement said.  The Amazon Great Indian Festival is set to start on September 27, with 24-hour early access for Prime members.  Apart from the overall increase in standard commission income rates, it has also introduced target-linked incentives of up to 10-15 per cent of revenue generated, it added.  As part of the Amazon Live program, hundreds of creators will run over 1,500 live streams across categories including Mobiles, Home Appliances, Home Decor, Fashion and Beauty among many others for the AGIF (Amazon Great Indian Festival), the statement said. ","cleaned_content":"ecommerce platform amazon on monday announced an increase in its standard commission income rates across \u003cTWO_TEN\u003e plus sub categories for over \u003cFIVE_TEN_THOUSAND\u003e content creators engaged with it the revised structure will offer content creators \u003cONE_\u003e x \u003cTWO_\u003e x increased income across a wide range of product categories including popular choices like fashion beauty and personal care appliances home kitchen toys and books amazon said this empowers creators to earn more during the peak shopping season and capitalise on the increased consumer demand during the amazon great indian festival agif a company statement said the amazon great indian festival is set to start on september \u003cTWO_TEN\u003e with \u003cTWO_TEN\u003e hour early access for prime members apart from the overall increase in standard commission income rates it has also introduced target linked incentives of up to \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e of revenue generated it added as part of the amazon live program hundreds of creators will run over \u003cONE_THOUSAND\u003e live streams across categories including mobiles home appliances home decor fashion and beauty among many others for the agif amazon great indian festival the statement said","timestamp":"2024-09-23T14:23:00+05:30","market_timestamp":"2024-09-23T14:23:00+05:30","off_market_hours":false}