{"url":"https://economictimes.indiatimes.com/tech/information-tech/ust-acquires-automation-unit-of-isg-for-27-million/articleshow/113894974.cms","title":"UST acquires automation unit of ISG for Rs 226 crore","description":"IT services company UST purchased the automation unit of ISG for $27 million. The move aims to enhance UST's intelligent automation services using AI and RPA. The acquired unit will help clients improve business processes, customer experience, and reduce costs. UST will also expand its workforce in Kochi and globally onboard experienced consultants.","content":"IT services firm UST said on Thursday that it has acquired the automation unit of Stamford-based Information Services Group (ISG) for a total consideration of $27 million (about Rs 226 crore).The California-based India-centric IT firm said the acquisition will strengthen its position in the intelligent automation segment and allow it to deliver a broader set of services to its clients.The acquired unit is a leading provider of intelligent automation solutions, utilising artificial intelligence (AI), robotic process automation (RPA) and automation technologies to help clients across a range of industries, it said in a statement. It further said that the automation unit of ISG helps optimise clients’ business processes, enhance their customer experience and reduce their operational costs.The development comes days after UST set a target of increasing the headcount at its Kochi centre to 6,000 employees, up from the current level of 2,800, in the next five years. While its Thiruvananthapuram centre has about 7,500 employees and is the company’s largest centre globally, UST Bengaluru has about 6,500 employees. Across India, the firm has about 20,000 employees. Globally, it has around 30,000 employees.Founded in 2017, the automation unit offers RPA software implementation, support and licensing services. The unit has about 120 senior automation consultants and technologists across the US, UK, India, Canada and Germany. As part of the agreement, UST will onboard highly experienced intelligent automation consultants globally.","cleaned_content":"it services firm ust said on thursday that it has acquired the automation unit of stamford based information services group isg for a total consideration of \u003cTWO_TEN\u003e million about rs \u003cTWO_HUNDRED\u003e crore the california based india centric it firm said the acquisition will strengthen its position in the intelligent automation segment and allow it to deliver a broader set of services to its clients the acquired unit is a leading provider of intelligent automation solutions utilising artificial intelligence ai robotic process automation rpa and automation technologies to help clients across a range of industries it said in a statement it further said that the automation unit of isg helps optimise clients business processes enhance their customer experience and reduce their operational costs the development comes days after ust set a target of increasing the headcount at its kochi centre to \u003cSIX_THOUSAND\u003e employees up from the current level of \u003cTWO_THOUSAND\u003e in the next five years while its thiruvananthapuram centre has about \u003cSEVEN_THOUSAND\u003e employees and is the company s largest centre globally ust bengaluru has about \u003cSIX_THOUSAND\u003e employees across india the firm has about \u003cTWO_TEN_THOUSAND\u003e employees globally it has around \u003cTHREE_TEN_THOUSAND\u003e employees founded in \u003cTWO_THOUSAND\u003e the automation unit offers rpa software implementation support and licensing services the unit has about \u003cONE_HUNDRED\u003e senior automation consultants and technologists across the us uk india canada and germany as part of the agreement ust will onboard highly experienced intelligent automation consultants globally","timestamp":"2024-10-03T11:48:00+05:30","market_timestamp":"2024-10-03T11:48:00+05:30","off_market_hours":false}