{"url":"https://economictimes.indiatimes.com/tech/technology/google-files-complaint-to-eu-over-microsoft-cloud-practices/articleshow/113670864.cms","title":"Google files complaint to EU over Microsoft cloud practices","description":"Google pointed to a 2023 study by cloud services organisation CISPE which found that European businesses and public sector bodies were paying up to 1 billion euros ($1.12 billion) per year on Microsoft licensing penalties.","content":"Alphabet unit Google filed a complaint to the European Commission on Wednesday against what it said were Microsoft's anti-competitive practices to lock customers into Microsoft's cloud platform Azure. Google, whose biggest cloud computing rivals are Microsoft and Amazon Web Services, said Microsoft was exploiting its dominant Windows Server operating system to prevent competition. Google Cloud Vice President Amit Zavery told a briefing that Microsoft made customers pay a 400% mark-up to keep running Windows Server on rival cloud computing operators. This did not apply if they used Azure. Users of rival cloud systems would also get later and more limited security updates, Zavery said. Google pointed to a 2023 study by cloud services organisation CISPE which found that European businesses and public sector bodies were paying up to 1 billion euros ($1.12 billion) per year on Microsoft licensing penalties. Microsoft in July clinched a 20-million-euro deal to settle an antitrust complaint about its cloud computing licensing practices with CISPE, averting an EU investigation. However, the settlement did not include Amazon Web Services (AWS), Google Cloud Platform and AliCloud, prompting criticism from the first two companies.","cleaned_content":"alphabet unit google filed a complaint to the european commission on wednesday against what it said were microsofts anti competitive practices to lock customers into microsofts cloud platform azure google whose biggest cloud computing rivals are microsoft and amazon web services said microsoft was exploiting its dominant windows server operating system to prevent competition google cloud vice president amit zavery told a briefing that microsoft made customers pay a \u003cFOUR_HUNDRED_PERCENT\u003e mark up to keep running windows server on rival cloud computing operators this did not apply if they used azure users of rival cloud systems would also get later and more limited security updates zavery said google pointed to a \u003cTWO_THOUSAND\u003e study by cloud services organisation cispe which found that european businesses and public sector bodies were paying up to \u003cONE_\u003e billion euros \u003cONE_\u003e billion per year on microsoft licensing penalties microsoft in july clinched a \u003cTWO_TEN\u003e million euro deal to settle an antitrust complaint about its cloud computing licensing practices with cispe averting an eu investigation however the settlement did not include amazon web services aws google cloud platform and alicloud prompting criticism from the first two companies","timestamp":"2024-09-25T19:24:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}