{"url":"https://economictimes.indiatimes.com/tech/technology/recovery-in-global-it-markets-bodes-well-for-indian-tech-companies-report/articleshow/113781349.cms","title":"Recovery in global IT markets bodes well for Indian tech companies: Report","description":"After the release of strong quarterly results by global IT giant Accenture, analysts are optimistic that Indian IT companies may also post strong numbers in the upcoming quarters, following the global trend.","content":"After the release of strong quarterly results by global IT giant Accenture, analysts are optimistic that Indian IT companies may also post strong numbers in the upcoming quarters, following the global trend.A report by HDFC Securities suggests that Accenture's performance signals a potential recovery for the IT sector as a whole, offering positive insights for Indian firms.\"Accenture's Q4FY24 results validated signs of improvement for the IT sector\" said the report.The company's Q4 FY24 results have highlighted significant improvements in the IT industry. As per the report, the company's top-end guidance has factored in stable macroeconomic conditions, with a notable 4 percentage point swing in organic growth--from a negative 1 per cent in FY24 to a projected positive 3 per cent for FY25.This shift suggests that the global IT landscape is beginning to show signs of recovery, driven by demand for outsourcing and large deals.","cleaned_content":"after the release of strong quarterly results by global it giant accenture analysts are optimistic that indian it companies may also post strong numbers in the upcoming quarters following the global trend a report by hdfc securities suggests that accentures performance signals a potential recovery for the it sector as a whole offering positive insights for indian firms accentures q4fy24 results validated signs of improvement for the it sector said the report the companys q4 fy24 results have highlighted significant improvements in the it industry as per the report the companys top end guidance has factored in stable macroeconomic conditions with a notable \u003cFOUR_PERCENT\u003e age point swing in organic growth from a negative \u003cONE_PERCENT\u003e in fy24 to a projected positive \u003cTHREE_PERCENT\u003e for fy25 this shift suggests that the global it landscape is beginning to show signs of recovery driven by demand for outsourcing and large deals","timestamp":"2024-09-29T11:54:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}