{"url":"https://economictimes.indiatimes.com/tech/technology/tech-industry-urges-g7-to-unify-cloud-security-standards/articleshow/113836723.cms","title":"Tech industry urges G7 to unify cloud security standards","description":"A leading tech industry group on Tuesday called on G7 nations to harmonize cloud security certification across the world's richest nations, in an effort to stoke cooperation and counter calls that data should stay within national borders. BSA also opposes that stance, instead arguing that cybersecurity agencies across friendly nations should find ways to cooperate.","content":"Washington, Oct 01, 2024 -A leading tech industry group on Tuesday called on G7 nations to harmonize cloud security certification across the world's richest nations, in an effort to stoke cooperation and counter calls that data should stay within national borders.Industry group BSA The Software Alliance, which represents tech giants including Microsoft and IBM, argues that its initiative would reduce compliance burdens for cloud service providers while maintaining robust security standards. \"We encourage governments to look at where their cloud requirements are effectively the same, but using different language,\" said Aaron Cooper, senior vice president of global policy at BSA.Greater unity among G7 nations could also \"hopefully lead to a recognition that localization doesn't aid with security,\" he added. \"But that's not specifically what this proposal is about.\"The G7 nations are the United States, Britain, Canada, Japan and EU member states France, Germany and Italy.","cleaned_content":"washington oct \u003cONE_\u003e \u003cTWO_THOUSAND\u003e a leading tech industry group on tuesday called on g7 nations to harmonize cloud security certification across the worlds richest nations in an effort to stoke cooperation and counter calls that data should stay within national borders industry group bsa the software alliance which represents tech giants including microsoft and ibm argues that its initiative would reduce compliance burdens for cloud service providers while maintaining robust security standards we encourage governments to look at where their cloud requirements are effectively the same but using different language said aaron cooper senior vice president of global policy at bsa greater unity among g7 nations could also hopefully lead to a recognition that localization doesnt aid with security he added but thats not specifically what this proposal is about the g7 nations are the united states britain canada japan and eu member states france germany and italy","timestamp":"2024-10-01T10:22:00+05:30","market_timestamp":"2024-10-01T10:22:00+05:30","off_market_hours":false}