{"url":"https://economictimes.indiatimes.com/tech/technology/google-says-malaysia-investments-to-add-3-billion-to-its-gdp-by-2030-create-26500-jobs/articleshow/113833322.cms","title":"Google says Malaysia investments to add $3 billion to its GDP by 2030, create 26,500 jobs","description":"Google's $2 billion data centre and Cloud region project in Malaysia, part of a broader Southeast Asia expansion, aims to create 26,500 jobs and add over $3 billion to the economy by 2030. This initiative, following their partnership with Dagang NeXchange Berhad, highlights Malaysia's emerging role as a regional tech hub.","content":"Google said on Tuesday its investments in Malaysia would create 26,500 jobs and contribute more than $3 billion to its economy by 2030, as it announced its new data centre and Cloud region there had broken ground. The start of construction of the new $2 billion data centre in Malaysia follows Monday's announcement of its multi-year partnership with local tech firm Dagang NeXchange Berhad to provide sovereign cloud services. It also follows Monday's announcement that it would invest $1 billion in Thailand to build a data centre and cloud region there, to meet growing cloud demand and support Artificial Intelligence (AI) adoption in Southeast Asia. \"Our investments are designed to provide high performing and reliability, meeting demand for cloud and AI services across the country,\" Google President and Chief Investment Officer Ruth Porat told an event in Malaysia. Digital investments have helped propel Malaysia's economy this year, with growth beating market expectations in the last two quarters and the ringgit currency becoming one of Asia's top performers.","cleaned_content":"google said on tuesday its investments in malaysia would create \u003cTWO_TEN_THOUSAND\u003e jobs and contribute more than \u003cTHREE_\u003e billion to its economy by \u003cTWO_THOUSAND\u003e as it announced its new data centre and cloud region there had broken ground the start of construction of the new \u003cTWO_\u003e billion data centre in malaysia follows mondays announcement of its multi year partnership with local tech firm dagang nexchange berhad to provide sovereign cloud services it also follows mondays announcement that it would invest \u003cONE_\u003e billion in thailand to build a data centre and cloud region there to meet growing cloud demand and support artificial intelligence ai adoption in southeast asia our investments are designed to provide high performing and reliability meeting demand for cloud and ai services across the country google president and chief investment officer ruth porat told an event in malaysia digital investments have helped propel malaysias economy this year with growth beating market expectations in the last two quarters and the ringgit currency becoming one of asias top performers","timestamp":"2024-10-01T08:33:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}