{"url":"https://economictimes.indiatimes.com/tech/technology/ola-krutrim-business-head-ravi-jain-quits/articleshow/114234940.cms","title":"Ola Krutrim business head Ravi Jain quits","description":"Ravi Jain has resigned from his position as business head of Krutrim AI, marking the first top-level exit from Bhavish Aggarwal's AI startup. Jain had been associated with Ola since 2021 and took on the role at Krutrim AI in mid-2023. This news follows recent leadership changes at Ola Electric, Aggarwal's major venture.","content":"Ravi Jain, business head of Bhavish Aggarwal founded artificial intelligence startup Krutrim AI, has quit, said two people aware of the development.This marks the first top-level exit from the unicorn AI venture founded by Ola chief Aggarwal last year, and comes close on the heels of the company announcing plans to launch new products and services, such as AI chip and cloud services.Krutrim AI did not respond to ET’s email seeking confirmation of the development.Jain has been associated with Ola since 2021, first as the business head of Ola Cars and then as head of strategy at Ola Electric. He became the business head at Krutrim when Aggarwal put together a team for this new venture in the middle of 2023.The development comes amid news of leadership changes at the publicly-listed Ola Electric, Aggarwal’s biggest venture.","cleaned_content":"ravi jain business head of bhavish aggarwal founded artificial intelligence startup krutrim ai has quit said two people aware of the development this marks the first top level exit from the unicorn ai venture founded by ola chief aggarwal last year and comes close on the heels of the company announcing plans to launch new products and services such as ai chip and cloud services krutrim ai did not respond to et s email seeking confirmation of the development jain has been associated with ola since \u003cTWO_THOUSAND\u003e first as the business head of ola cars and then as head of strategy at ola electric he became the business head at krutrim when aggarwal put together a team for this new venture in the middle of \u003cTWO_THOUSAND\u003e the development comes amid news of leadership changes at the publicly listed ola electric aggarwal s biggest venture","timestamp":"2024-10-15T09:19:00+05:30","market_timestamp":"2024-10-15T09:19:00+05:30","off_market_hours":false}