{"url":"https://economictimes.indiatimes.com/tech/technology/bain-sought-10-billion-valuation-for-japans-kioxia-investors-only-wanted-to-pay-half/articleshow/114165312.cms","title":"Bain sought $10 billion valuation for Japan's Kioxia, investors only wanted to pay half","description":"The valuation gap complicates the buyout firm's effort to exit its six-year-old investment in Kioxia. It reflects concerns investors have over the strength of the memory chip market, the sources said.","content":"Investors pushed Bain Capital to almost halve the valuation it was seeking for Japan's Kioxia in an IPO, leading the U.S. buyout firm to scrap its plans for an October listing of the memory chipmaker, two sources said.  Kioxia, known as Toshiba Memory when it was acquired from Toshiba by a Bain-led consortium in 2018 for 2 trillion yen ($13.4 billion), ditched the October IPO plan, Reuters reported last month, citing sources. That decision came after global investors wanted a market value of around 800 billion yen for the chipmaker, said the two sources, compared to Bain's target of 1.5 trillion yen.  The valuation gap complicates the buyout firm's effort to exit its six-year-old investment in Kioxia. It reflects concerns investors have over the strength of the memory chip market, the sources said.  Details of the valuation sought by investors, who met with Kioxia in August and September, have not been reported previously. ","cleaned_content":"investors pushed bain capital to almost halve the valuation it was seeking for japans kioxia in an ipo leading the u s buyout firm to scrap its plans for an october listing of the memory chipmaker two sources said kioxia known as toshiba memory when it was acquired from toshiba by a bain led consortium in \u003cTWO_THOUSAND\u003e for \u003cTWO_\u003e trillion yen \u003cONE_TEN\u003e billion ditched the october ipo plan reuters reported last month citing sources that decision came after global investors wanted a market value of around \u003cEIGHT_HUNDRED\u003e billion yen for the chipmaker said the two sources compared to bains target of \u003cONE_\u003e trillion yen the valuation gap complicates the buyout firms effort to exit its six year old investment in kioxia it reflects concerns investors have over the strength of the memory chip market the sources said details of the valuation sought by investors who met with kioxia in august and september have not been reported previously","timestamp":"2024-10-12T11:33:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}