{"url":"https://economictimes.indiatimes.com/tech/technology/us-charges-18-people-companies-with-cryptocurrency-fraud/articleshow/114110275.cms","title":"US charges 18 people, companies with cryptocurrency fraud","description":"Federal prosecutors in Boston charged the firms Gotbit, ZM Quant, CLS Global and MyTrade and their leaders and employees in a case that also involved charges of people overseas. Five people have agreed to plead guilty or have already done so.","content":"Four cryptocurrency companies and 14 individuals have been charged in what U.S. prosecutors on Wednesday called the first criminal prosecution of financial services firms for market manipulation and sham trading in the crypto sector. Federal prosecutors in Boston charged the firms Gotbit, ZM Quant, CLS Global and MyTrade and their leaders and employees in a case that also involved charges of people overseas. Five people have agreed to plead guilty or have already done so. Prosecutors accused the defendants of engaging in the crypto equivalent of stock market \"pump and dump\" schemes that involved sham trades to artificially inflate the trading volume of various cryptocurrency tokens before selling them off. Prosecutors said the largest of the companies involved in the various schemes, Saitama, at one point came to have a market value of $7.5 billion, after its leadership began manipulating the market for its tokens and secretly selling them. Its chief executive, Manpreet Kohli, was arrested on Monday in the United Kingdom. Five other current or former employees were also charged, and three have pleaded guilty.","cleaned_content":"four cryptocurrency companies and \u003cONE_TEN\u003e individuals have been charged in what u s prosecutors on wednesday called the first criminal prosecution of financial services firms for market manipulation and sham trading in the crypto sector federal prosecutors in boston charged the firms gotbit zm quant cls global and mytrade and their leaders and employees in a case that also involved charges of people overseas five people have agreed to plead guilty or have already done so prosecutors accused the defendants of engaging in the crypto equivalent of stock market pump and dump schemes that involved sham trades to artificially inflate the trading volume of various cryptocurrency tokens before selling them off prosecutors said the largest of the companies involved in the various schemes saitama at one point came to have a market value of \u003cSEVEN_\u003e billion after its leadership began manipulating the market for its tokens and secretly selling them its chief executive manpreet kohli was arrested on monday in the united kingdom five other current or former employees were also charged and three have pleaded guilty","timestamp":"2024-10-10T12:32:00+05:30","market_timestamp":"2024-10-10T12:32:00+05:30","off_market_hours":false}