{"url":"https://economictimes.indiatimes.com/tech/technology/jacobs-awarded-cg-semi-contract-for-engineering-design-of-osat-facility-in-sanand/articleshow/114138302.cms","title":"Jacobs awarded CG Semi contract for engineering design of OSAT facility in Sanand","description":"CG Semi is a joint venture between CG Power, Renesas Electronics Corporation, and Stars Microelectronics (Thailand). Jacobs said it will serve as the engineering, procurement and construction services (EPCS) partner on the Mini Line, and engineering partner on the Main Line.","content":"Engineering services company Jacobs on Thursday said it has been appointed by CG Semi for the engineering design of the company new Outsourced Semiconductor Assembly and Test (OSAT) facility at Sanand, Gujarat in India.ET was the first to report on August 5 that Murugappa Group firm CG Power's semiconductor arm CG Semi had onboarded the leading global facilities management firm to build its upcoming chip assembly plant in Sanand. CG Semi is a joint venture between CG Power, Renesas Electronics Corporation, and Stars Microelectronics (Thailand).Jacobs said it will serve as the engineering, procurement and construction services (EPCS) partner on the Mini Line, and engineering partner on the Main Line. \"Jacobs partnering with CG Semi on this pivotal project underscores our commitment to delivering innovative and sustainable solutions in the rapidly expanding semiconductor market in India,\" Jacobs Chair and CEO Bob Pragada said in a statement. \"With our extensive experience in the U.S., Europe and Asia, and proven capabilities, we are eager to contribute to the success of their new facility, helping to drive growth and technological advancement in the region.\"","cleaned_content":"engineering services company jacobs on thursday said it has been appointed by cg semi for the engineering design of the company new outsourced semiconductor assembly and test osat facility at sanand gujarat in india et was the first to report on august \u003cFIVE_\u003e that murugappa group firm cg powers semiconductor arm cg semi had onboarded the leading global facilities management firm to build its upcoming chip assembly plant in sanand cg semi is a joint venture between cg power renesas electronics corporation and stars microelectronics thailand jacobs said it will serve as the engineering procurement and construction services epcs partner on the mini line and engineering partner on the main line jacobs partnering with cg semi on this pivotal project underscores our commitment to delivering innovative and sustainable solutions in the rapidly expanding semiconductor market in india jacobs chair and ceo bob pragada said in a statement with our extensive experience in the u s europe and asia and proven capabilities we are eager to contribute to the success of their new facility helping to drive growth and technological advancement in the region","timestamp":"2024-10-11T10:28:00+05:30","market_timestamp":"2024-10-11T10:28:00+05:30","off_market_hours":false}