{"url":"https://economictimes.indiatimes.com/tech/technology/google-wants-us-judges-app-store-ruling-put-on-hold/articleshow/114189920.cms","title":"Google wants US judge's app store ruling put on hold","description":"In a court filing on Friday night, Google said US District Judge James Donato's injunction order, which goes into effect on Nov. 1, would harm the company and introduce \"serious safety, security, and privacy risks into the Android ecosystem.\"","content":"Google has asked a California federal judge to pause his sweeping court order requiring it to open up its app store Play to greater competition. In a court filing on Friday night, Google said US District Judge James Donato's injunction order, which goes into effect on Nov. 1, would harm the company and introduce \"serious safety, security, and privacy risks into the Android ecosystem.\" The tech giant, a unit of Alphabet, asked Donato to stay the order while it pursues an appeal. The judge issued the injunction on Oct. 7 in a case brought by \"Fortnite\" maker Epic Games, which persuaded a federal jury last year that Google was illegally monopolizing how consumers download apps on Android devices and how they pay for in-app transactions. The judge's order said Google must allow users to download competing third-party Android app platforms or stores and can no longer prohibit the use of competing in-app payment methods. It also bars Google from making payments to device makers to preinstall its app store and from sharing revenue generated from the Play store with other app distributors.","cleaned_content":"google has asked a california federal judge to pause his sweeping court order requiring it to open up its app store play to greater competition in a court filing on friday night google said us district judge james donatos injunction order which goes into effect on nov \u003cONE_\u003e would harm the company and introduce serious safety security and privacy risks into the android ecosystem the tech giant a unit of alphabet asked donato to stay the order while it pursues an appeal the judge issued the injunction on oct \u003cSEVEN_\u003e in a case brought by fortnite maker epic games which persuaded a federal jury last year that google was illegally monopolizing how consumers download apps on android devices and how they pay for in app transactions the judges order said google must allow users to download competing third party android app platforms or stores and can no longer prohibit the use of competing in app payment methods it also bars google from making payments to device makers to preinstall its app store and from sharing revenue generated from the play store with other app distributors","timestamp":"2024-10-13T17:01:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}