{"url":"https://economictimes.indiatimes.com/tech/technology/gst-on-rides-cbic-gives-a-weeks-time-to-ecommerce-firms-to-give-views-promises-clarification/articleshow/114220954.cms","title":"GST on rides: CBIC gives a week’s time to ecommerce firms to give views, promises clarification","description":"A three-member team led by CBIC chairman Sanjay Kumar Agarwal met with representatives from the app-based transportation companies at North Block in Delhi and listened to them for about 90 minutes.","content":"The Central Board of Indirect Taxes \u0026 Customs (CBIC) on Monday gave a week's time to app-based ride hailing companies to furnish their views in writing on where each of them stands on the applicability of GST on rides booked through their platforms.A three-member team led by CBIC chairman Sanjay Kumar Agarwal met with representatives from the app-based transportation companies at North Block in Delhi and listened to them for about 90 minutes. Uber representatives talked about the lack of uniformity on the applicability of taxes, while Namma Yatri said they follow a model of business different from others.According to sources privy to discussions at the CBIC meeting, Uber India explained there were two models of business, but the end purpose was to provide transportation services to customers. Uber, its representatives said, followed an algorithm model of pricing of rides as adopted in airlines. The fare moved in sync with the demand and in conformity with local regulations in different states. The taxation too, in the same way, should be uniform regardless of the business model. Rapido said it operated under three business models. It offered services under the traditional algorithm-based fare fixation and under the base fare as prescribed by the RTO of the state concerned. The third model involved the driver collecting the fare directly from the customer. Under the third model, since it has no knowledge or exercises control over the fare collected by the driver, it cannot be expected to collect GST.Namma Yatri, hosted on an ONDC platform, said it did not have control over the ride as its app’s purpose ends with connecting a driver with the user. It neither fixes the fare nor plays a role in its collection. It only collects a fee from subscribers (read drivers) of its technology service) and pays a GST on the same. The firm said it was unable to collect the GST on the rides as they were not its supply as defined in the GST laws. The firm also argued that Section 9(5) of the CGST Act, 2017, did not apply to it as it was not an ecommerce operator. ","cleaned_content":"the central board of indirect taxes customs cbic on monday gave a weeks time to app based ride hailing companies to furnish their views in writing on where each of them stands on the applicability of gst on rides booked through their platforms a three member team led by cbic chairman sanjay kumar agarwal met with representatives from the app based transportation companies at north block in delhi and listened to them for about \u003cNINE_TEN\u003e minutes uber representatives talked about the lack of uniformity on the applicability of taxes while namma yatri said they follow a model of business different from others according to sources privy to discussions at the cbic meeting uber india explained there were two models of business but the end purpose was to provide transportation services to customers uber its representatives said followed an algorithm model of pricing of rides as adopted in airlines the fare moved in sync with the demand and in conformity with local regulations in different states the taxation too in the same way should be uniform regardless of the business model rapido said it operated under three business models it offered services under the traditional algorithm based fare fixation and under the base fare as prescribed by the rto of the state concerned the third model involved the driver collecting the fare directly from the customer under the third model since it has no knowledge or exercises control over the fare collected by the driver it cannot be expected to collect gst namma yatri hosted on an ondc platform said it did not have control over the ride as its app s purpose ends with connecting a driver with the user it neither fixes the fare nor plays a role in its collection it only collects a fee from subscribers read drivers of its technology service and pays a gst on the same the firm said it was unable to collect the gst on the rides as they were not its supply as defined in the gst laws the firm also argued that section \u003cNINE_\u003e \u003cFIVE_\u003e of the cgst act \u003cTWO_THOUSAND\u003e did not apply to it as it was not an ecommerce operator","timestamp":"2024-10-14T18:57:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}