{"url":"https://economictimes.indiatimes.com/tech/information-tech/fraud-check-infosys-candidates-need-to-check-system-for-info/articleshow/114023197.cms","title":"Fraud check: Infosys candidates need to check system for info","description":"Infosys, India’s second-largest software services company, has stopped sending job offer letters and attachments via email. Instead, new recruits will access their job application details by logging into the company’s internal system.","content":"Infosys has taken a new approach to hiring by discontinuing issuing job offer letters and attachments to new recruits through emails. India's second-largest software services company is instead asking candidates, both freshers and laterals, to login into the company's internal system to access job application details.People in the know said through this step, Infosys is seeking to not just prevent fraudulent recruitment practices, but also provide a better hiring experience to candidates, prevent defrauding of gullible candidates and make the system paperless.The latest initiative by Infosys comes amid broader controversies linked to delayed onboarding of freshers in the Indian software services industry.Infosys didn't respond to ET's queries.The company's recruitment vendors said, requesting anonymity, that the move is aimed at stemming recruitment fraud, while making it slightly difficult for candidates to window shop and bargain with rival employers. ","cleaned_content":"infosys has taken a new approach to hiring by discontinuing issuing job offer letters and attachments to new recruits through emails indias second largest software services company is instead asking candidates both freshers and laterals to login into the companys internal system to access job application details people in the know said through this step infosys is seeking to not just prevent fraudulent recruitment practices but also provide a better hiring experience to candidates prevent defrauding of gullible candidates and make the system paperless the latest initiative by infosys comes amid broader controversies linked to delayed onboarding of freshers in the indian software services industry infosys didnt respond to ets queries the companys recruitment vendors said requesting anonymity that the move is aimed at stemming recruitment fraud while making it slightly difficult for candidates to window shop and bargain with rival employers","timestamp":"2024-10-08T06:00:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}