{"url":"https://economictimes.indiatimes.com/tech/technology/big-tech-proposes-power-rate-terms-in-ohio-data-center-fight/articleshow/114137541.cms","title":"Big Tech proposes power-rate terms in Ohio data-center fight","description":"The companies had been fighting a proposal brought by utility AEP Ohio in May that would require data centers and cryptocurrency miners to provide pre-payments and other financial assurances for their massive energy needs. AEP said at the time it was overloaded with requests from those two groups.","content":"Microsoft, Alphabet, Meta, Amazon and other tech firms have proposed an alternative framework for how data centers pay for power in Ohio, according to documents filed with regulators on Thursday. The companies had been fighting a proposal brought by utility AEP Ohio in May that would require data centers and cryptocurrency miners to provide pre-payments and other financial assurances for their massive energy needs. AEP said at the time it was overloaded with requests from those two groups. Ohio is among the top U.S. states seeing an influx of interest from data centers as Big Tech rushes to acquire large amounts of power to fuel its expansion of technology such as generative AI. That explosion in demand prompted AEP Ohio this year to pause new contracts for data centers. Big Tech, power companies, including Constellation Energy, and others began fighting AEP's proposal before the Public Utilities Commission of Ohio in August. ","cleaned_content":"microsoft alphabet meta amazon and other tech firms have proposed an alternative framework for how data centers pay for power in ohio according to documents filed with regulators on thursday the companies had been fighting a proposal brought by utility aep ohio in may that would require data centers and cryptocurrency miners to provide pre payments and other financial assurances for their massive energy needs aep said at the time it was overloaded with requests from those two groups ohio is among the top u s states seeing an influx of interest from data centers as big tech rushes to acquire large amounts of power to fuel its expansion of technology such as generative ai that explosion in demand prompted aep ohio this year to pause new contracts for data centers big tech power companies including constellation energy and others began fighting aeps proposal before the public utilities commission of ohio in august","timestamp":"2024-10-11T10:03:00+05:30","market_timestamp":"2024-10-11T10:03:00+05:30","off_market_hours":false}