{"url":"https://economictimes.indiatimes.com/tech/technology/bengalurus-2-2-million-properties-get-scam-proof-e-khatas-first-in-a-metro/articleshow/114089446.cms","title":"Bengaluru’s 2.2 million properties get scam-proof e-Khatas first in a metro","description":"Bangalore's civic body, BBMP, has launched a new online system for property tax records (e-Khatas). This is the first time a metro city in India has implemented such a system. BBMP has digitized all existing property records (both A \u0026 B Khata) and made draft e-Khatas available online for citizens to review.","content":"Bengaluru’s civic body, the BBMP, has released about 2.2 million draft e-Khatas of properties online in a first such deployment of technology in citizen-facing municipal services in a metro.“Unlike other metros, we at BBMP have maintained ownership records. In many states, property ownership is handled by the Revenue department, but in Bengaluru, the city corporation is maintaining it,” BBMP Special Commissioner (Revenue) Munish Moudgil told ET. Deputy chief minister DK Shivakumar is the minister in charge of BBMP, who has given a go ahead to the ambitious project.Moudgil, who is leading the mammoth task of transforming paper khatas into e-Khatas, requested citizens to get their final e-khatas over the next two to three months unless they have a property transaction coming up and in a hurry.This is the most transparent e-Khata system, which is in control of the citizen, he added.","cleaned_content":"bengaluru s civic body the bbmp has released about \u003cTWO_\u003e million draft e khatas of properties online in a first such deployment of technology in citizen facing municipal services in a metro unlike other metros we at bbmp have maintained ownership records in many states property ownership is handled by the revenue department but in bengaluru the city corporation is maintaining it bbmp special commissioner revenue munish moudgil told et deputy chief minister dk shivakumar is the minister in charge of bbmp who has given a go ahead to the ambitious project moudgil who is leading the mammoth task of transforming paper khatas into e khatas requested citizens to get their final e khatas over the next two to three months unless they have a property transaction coming up and in a hurry this is the most transparent e khata system which is in control of the citizen he added","timestamp":"2024-10-14T18:45:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}