{"url":"https://economictimes.indiatimes.com/tech/technology/magicpin-records-15x-order-growth-on-ondc-network-in-15-months-crosses-1-5-lakh-daily-orders/articleshow/114040870.cms","title":"Magicpin records 15x order growth on ONDC network in 15 months, crosses 1.5 lakh daily orders","description":"\"In about 1.5 years, we have double-digit market share in major cities, with more than 10 per cent market share in key markets like Delhi or Bengaluru in terms of overall food delivery. We are thrilled with magicpin's success on ONDC, where we have reached 1.5 lakh daily orders for food delivery and logistics on the network,\" magicpin CEO and cofounder Anshoo Sharma said.","content":"Hyperlocal ecommerce firm magicpin on Tuesday said it has crossed the 1.5 lakh-mark for daily order of food and logistics services on the government-backed ONDC platform, registering a 15-times growth over 15 months. magicpin joined the Open Network for Digital Commerce (ONDC) network in March last year with 22,000 restaurant partners, which the company has scaled to 70,000, the company said in a statement.  The company saw 100 daily orders in early May 2023, which increased to 10,000 in four weeks, the company said.  \"In about 1.5 years, we have double-digit market share in major cities, with more than 10 per cent market share in key markets like Delhi or Bengaluru in terms of overall food delivery. We are thrilled with magicpin's success on ONDC, where we have reached 1.5 lakh daily orders for food delivery and logistics on the network,\" magicpin CEO and cofounder Anshoo Sharma said.  He said 90% of food orders from prominent buyer apps such as Paytm, Tata Neu, and Ola are now fulfilled by magicpin.  Recently, the company announced an investment of Rs 100 crore to onboard 1 lakh new restaurants and cloud kitchens on ONDC. ","cleaned_content":"hyperlocal ecommerce firm magicpin on tuesday said it has crossed the \u003cONE_\u003e lakh mark for daily order of food and logistics services on the government backed ondc platform registering a \u003cONE_TEN\u003e times growth over \u003cONE_TEN\u003e months magicpin joined the open network for digital commerce ondc network in march last year with \u003cTWO_TEN_THOUSAND\u003e restaurant partners which the company has scaled to \u003cSEVEN_TEN_THOUSAND\u003e the company said in a statement the company saw \u003cONE_HUNDRED\u003e daily orders in early may \u003cTWO_THOUSAND\u003e which increased to \u003cONE_TEN_THOUSAND\u003e in four weeks the company said in about \u003cONE_\u003e years we have double digit market share in major cities with more than \u003cONE_TEN_PERCENT\u003e market share in key markets like delhi or bengaluru in terms of overall food delivery we are thrilled with magicpins success on ondc where we have reached \u003cONE_\u003e lakh daily orders for food delivery and logistics on the network magicpin ceo and cofounder anshoo sharma said he said \u003cNINE_TEN_PERCENT\u003e of food orders from prominent buyer apps such as paytm tata neu and ola are now fulfilled by magicpin recently the company announced an investment of rs \u003cONE_HUNDRED\u003e crore to onboard \u003cONE_\u003e lakh new restaurants and cloud kitchens on ondc","timestamp":"2024-10-08T13:52:00+05:30","market_timestamp":"2024-10-08T13:52:00+05:30","off_market_hours":false}