{"url":"https://economictimes.indiatimes.com/tech/technology/isro-chief-somanath-wins-world-space-award-2024-for-chandrayaan-3/articleshow/114222476.cms","title":"ISRO chief Somanath wins 'World Space Award 2024' for Chandrayaan-3","description":"The award, presented in Milan, Italy, recognizes individuals who make significant contributions to space science and technology. The IAF highlighted Chandrayaan-3's impact on lunar exploration, unveiling new aspects of the Moon's composition and geology and showcasing India's technological and scientific capabilities.","content":"Adding another feather to his cap, Indian Space Research Organisation (ISRO) Chairman, S Somanath, was awarded the prestigious International Astronautical Federation (IAF) World Space Award 2024. The award was given in recognition of ISRO’s successful Chandrayaan-3 mission—a historic milestone in lunar exploration of the South Pole, making India one of the few countries to do so. The award ceremony took place in Milan, Italy.“ISRO is honoured to announce that Dr. S. Somanath, Secretary DOS and Chairman of ISRO, has received the prestigious IAF World Space Award for Chandrayaan-3's remarkable achievement. This recognition celebrates India’s contributions to space exploration. Celebrations are underway in Milan as we continue to strive for new frontiers,” the space agency said on X.The IAF World Space Award is presented to individuals for outstanding contributions in space science, space technology, space medicine, space law, or space management that have had exceptional impact on the world’s progress in astronautics.\"The Chandrayaan-3 mission by ISRO exemplifies the synergy of scientific curiosity and cost-effective engineering, symbolising India's commitment to excellence and the vast potential that space exploration offers humanity,” the IAF said in a statement. ","cleaned_content":"adding another feather to his cap indian space research organisation isro chairman s somanath was awarded the prestigious international astronautical federation iaf world space award \u003cTWO_THOUSAND\u003e the award was given in recognition of isro s successful chandrayaan \u003cTHREE_\u003e mission a historic milestone in lunar exploration of the south pole making india one of the few countries to do so the award ceremony took place in milan italy isro is honoured to announce that dr s somanath secretary dos and chairman of isro has received the prestigious iaf world space award for chandrayaan \u003cTHREE_\u003e s remarkable achievement this recognition celebrates india s contributions to space exploration celebrations are underway in milan as we continue to strive for new frontiers the space agency said on x the iaf world space award is presented to individuals for outstanding contributions in space science space technology space medicine space law or space management that have had exceptional impact on the world s progress in astronautics the chandrayaan \u003cTHREE_\u003e mission by isro exemplifies the synergy of scientific curiosity and cost effective engineering symbolising indias commitment to excellence and the vast potential that space exploration offers humanity the iaf said in a statement","timestamp":"2024-10-14T19:58:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}