{"url":"https://economictimes.indiatimes.com/tech/technology/cryptoverse-bored-bitcoin-seeks-direction-after-big-bang/articleshow/114040726.cms","title":"Cryptoverse: Bored bitcoin seeks direction after big bang","description":"The crypto leader has largely shuttled between $56,000 and $63,000 so far in the second half of the year - a contrast to the first six months when it jumped 45%, propelled by the launch of U.S. exchange-traded funds (ETFs) tracking its spot price.","content":"Bitcoin has been distinctly listless in the past three months after starting the year with a bang.  The crypto leader has largely shuttled between $56,000 and $63,000 so far in the second half of the year - a contrast to the first six months when it jumped 45%, propelled by the launch of U.S. exchange-traded funds (ETFs) tracking its spot price. Market players are now eyeing possible new crypto catalysts heading into year-end and early 2025, beyond broader market-moving events such as shifts in U.S. interest rates and the American presidential election. Jake Ostrovskis, trader at UK-based crypto firm Wintermute, is anticipating the upcoming launch of options on BlackRock's spot bitcoin ETF, a new product he believes could attract more U.S. retail money after its approval by the Securities and Exchange Commission last month.  Because regulators view bitcoin as a commodity, though, such options may also need the green light from the Commodity Futures Trading Commission, which oversees commodity derivatives, said Youwei Yang, chief economist at BIT Mining.","cleaned_content":"bitcoin has been distinctly listless in the past three months after starting the year with a bang the crypto leader has largely shuttled between \u003cFIVE_TEN_THOUSAND\u003e and \u003cSIX_TEN_THOUSAND\u003e so far in the second half of the year a contrast to the first six months when it jumped \u003cFOUR_TEN_PERCENT\u003e propelled by the launch of u s exchange traded funds etfs tracking its spot price market players are now eyeing possible new crypto catalysts heading into year end and early \u003cTWO_THOUSAND\u003e beyond broader market moving events such as shifts in u s interest rates and the american presidential election jake ostrovskis trader at uk based crypto firm wintermute is anticipating the upcoming launch of options on blackrocks spot bitcoin etf a new product he believes could attract more u s retail money after its approval by the securities and exchange commission last month because regulators view bitcoin as a commodity though such options may also need the green light from the commodity futures trading commission which oversees commodity derivatives said youwei yang chief economist at bit mining","timestamp":"2024-10-08T13:47:00+05:30","market_timestamp":"2024-10-08T13:47:00+05:30","off_market_hours":false}