{"url":"https://economictimes.indiatimes.com/tech/technology/60-of-unicorn-founders-achieved-1-billion-valuation-in-maiden-attempt-report/articleshow/114150164.cms","title":"60% of unicorn founders achieved $1-billion valuation in maiden attempt: report","description":"In the last two years, companies such as quick commerce platform Zepto, non-banking lender InCred, Ola founder Bhavish Aggarwal’s artificial intelligence startup Krutrim, and software-as-a-service (SaaS) fintech startup Perfios have attained a value of over $1 billion. In 2024, five startups -- Krutrim, Perfios, Rapido, electric scooter maker Ather Energy, and fintech lending startup Moneyview -- achieved unicorn status.","content":"About 60% of the 261 unicorn founders in India who built a startup valued at over $1 billion did so in their first attempt, while 29% took two attempts to reach that milestone, a report by research analytics firm PrivateCircle said. India’s startup ecosystem has grown rapidly over the last decade, producing more than 100 unicorns. Over the last two years, however, as the global technology and risk investment ecosystem was hit by a prolonged downturn, the pace of unicorn creation in India also slowed down. In the last two years, companies such as quick commerce platform Zepto, non-banking lender InCred, Ola founder Bhavish Aggarwal’s artificial intelligence startup Krutrim, and software-as-a-service (SaaS) fintech startup Perfios have attained a value of over $1 billion. In 2024, five startups -- Krutrim, Perfios, Rapido, electric scooter maker Ather Energy, and fintech lending startup Moneyview -- achieved unicorn status.ET reported on September 5 that ride-hailing platform Rapido raised $200 million in a financing round led by existing investor WestBridge Capital, becoming a unicorn with a $1.1-billion valuation.Digital payments startup Razorpay became a unicorn in October 2020 when it raised $100 million from a clutch of investors, including Singaporean sovereign wealth fund GIC and Peak XV Partners (then Sequoia Capital India and Southeast Asia). ","cleaned_content":"about \u003cSIX_TEN_PERCENT\u003e of the \u003cTWO_HUNDRED\u003e unicorn founders in india who built a startup valued at over \u003cONE_\u003e billion did so in their first attempt while \u003cTWO_TEN_PERCENT\u003e took two attempts to reach that milestone a report by research analytics firm privatecircle said india s startup ecosystem has grown rapidly over the last decade producing more than \u003cONE_HUNDRED\u003e unicorns over the last two years however as the global technology and risk investment ecosystem was hit by a prolonged downturn the pace of unicorn creation in india also slowed down in the last two years companies such as quick commerce platform zepto non banking lender incred ola founder bhavish aggarwal s artificial intelligence startup krutrim and software as a service saas fintech startup perfios have attained a value of over \u003cONE_\u003e billion in \u003cTWO_THOUSAND\u003e five startups krutrim perfios rapido electric scooter maker ather energy and fintech lending startup moneyview achieved unicorn status et reported on september \u003cFIVE_\u003e that ride hailing platform rapido raised \u003cTWO_HUNDRED\u003e million in a financing round led by existing investor westbridge capital becoming a unicorn with a \u003cONE_\u003e billion valuation digital payments startup razorpay became a unicorn in october \u003cTWO_THOUSAND\u003e when it raised \u003cONE_HUNDRED\u003e million from a clutch of investors including singaporean sovereign wealth fund gic and peak xv partners then sequoia capital india and southeast asia","timestamp":"2024-10-11T17:42:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}