{"url":"https://economictimes.indiatimes.com/tech/technology/facebook-youtube-and-tiktok-users-in-europe-get-forum-to-challenge-social-media-content-decisions/articleshow/114047478.cms","title":"Facebook, YouTube and TikTok users in Europe get forum to challenge social media content decisions","description":"The center is similar to Meta's Oversight Board, a quasi-independent body set up in 2020 that acts like a supreme court for thorny decisions about content moderation issues on Facebook, Instagram and Threads submitted by users around the world.","content":"Social media users in the European Union will soon have a new forum to challenge decisions by platforms to remove posts and videos for breaking their rules or leave up others that may violate them. An \"out of court dispute settlement body\" named the Appeals Center Europe said Tuesday it has been certified by Irish regulators to act as a referee on content moderation disputes across the 27-nation EU, starting with cases involving Facebook, YouTube and TikTok.  The center is similar to Meta's Oversight Board, a quasi-independent body set up in 2020 that acts like a supreme court for thorny decisions about content moderation issues on Facebook, Instagram and Threads submitted by users around the world. Under the EU's digital rulebook known as the Digital Services Act, or DSA, tech companies and social media platforms are required to work with dispute settlement bodies and comply with any decisions they make. EU officials in Brussels wanted to give EU citizens a way to challenge any decisions made by Big Tech companies as they sought to balance the right to free speech against the goal of curbing online risks.  The center will hear appeals from users or groups located in the EU about \"everything from violence and incitement to hate speech to bullying and harassment,\" CEO Thomas Hughes said. ","cleaned_content":"social media users in the european union will soon have a new forum to challenge decisions by platforms to remove posts and videos for breaking their rules or leave up others that may violate them an out of court dispute settlement body named the appeals center europe said tuesday it has been certified by irish regulators to act as a referee on content moderation disputes across the \u003cTWO_TEN\u003e nation eu starting with cases involving facebook youtube and tiktok the center is similar to metas oversight board a quasi independent body set up in \u003cTWO_THOUSAND\u003e that acts like a supreme court for thorny decisions about content moderation issues on facebook instagram and threads submitted by users around the world under the eus digital rulebook known as the digital services act or dsa tech companies and social media platforms are required to work with dispute settlement bodies and comply with any decisions they make eu officials in brussels wanted to give eu citizens a way to challenge any decisions made by big tech companies as they sought to balance the right to free speech against the goal of curbing online risks the center will hear appeals from users or groups located in the eu about everything from violence and incitement to hate speech to bullying and harassment ceo thomas hughes said","timestamp":"2024-10-08T16:50:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}