{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-targets-faster-deliveries-and-buying-with-new-tech/articleshow/114111165.cms","title":"Amazon targets faster deliveries and buying with new tech","description":"The technology, which Amazon is calling Vision Assisted Package Retrieval, works by shining a green light on packages so that the deliverer does not have to waste precious seconds reading labels. \"When we speed up deliveries, customers shop more,\" said Doug Herrington, CEO of Amazon worldwide stores in remarks at the event.","content":"Amazon, in its quest for greater efficiency, has developed new systems to shave seconds off each package delivery and to help customers make faster buying choices, even for new product types that they may know little about. The company announced Wednesday it has created spotlights within its trucks to guide delivery people to packages for each stop along a route. The technology, which Amazon is calling Vision Assisted Package Retrieval, works by shining a green light on packages so that the deliverer does not have to waste precious seconds reading labels. \"When we speed up deliveries, customers shop more,\" said Doug Herrington, CEO of Amazon worldwide stores in remarks at the event. \"Once a customer experiences fast delivery, they will come back sooner and shop more.\" Amazon said it would equip 1,000 active delivery trucks, supplied by EV maker Rivian, with the spotlight tech early next year. Herrington said the delivery van ceilings are equipped with cameras and LED projectors that instantly read package labels so it knows which are bound for which customers. Amazon is Rivian's largest shareholder and has placed orders for 100,000 electric delivery vans to be deployed by 2030.","cleaned_content":"amazon in its quest for greater efficiency has developed new systems to shave seconds off each package delivery and to help customers make faster buying choices even for new product types that they may know little about the company announced wednesday it has created spotlights within its trucks to guide delivery people to packages for each stop along a route the technology which amazon is calling vision assisted package retrieval works by shining a green light on packages so that the deliverer does not have to waste precious seconds reading labels when we speed up deliveries customers shop more said doug herrington ceo of amazon worldwide stores in remarks at the event once a customer experiences fast delivery they will come back sooner and shop more amazon said it would equip \u003cONE_THOUSAND\u003e active delivery trucks supplied by ev maker rivian with the spotlight tech early next year herrington said the delivery van ceilings are equipped with cameras and led projectors that instantly read package labels so it knows which are bound for which customers amazon is rivians largest shareholder and has placed orders for \u003cONE_HUNDRED_THOUSAND\u003e electric delivery vans to be deployed by \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-10T12:53:00+05:30","market_timestamp":"2024-10-10T12:53:00+05:30","off_market_hours":false}