{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-beats-q2-estimates-riding-on-strong-software-biz/articleshow/114227277.cms","title":"HCLTech beats Q2 estimates riding on strong software biz","description":"HCLTech reported a nearly 11% rise in net profit on year in the second quarter (Q2) of the current fiscal year, despite the continued impact of the divestiture of its joint venture with State Street. Revenue was also over 8% higher.","content":"HCLTech reported a flat sequential growth in net profit in Q2 of current fiscal year. This was despite the continued impact of a joint venture divestment. Year-on-year growth in its software segment of 9.4% - the strongest ever - boosted its topline, along with better incremental demand for tech and services.India's third largest software services exporter reported a 0.5% quarter on quarter (QoQ) decline in net profit at Rs 4,235 crore, beating ET estimates of Rs 4,097 crore. Better-than-expected performance in the first half of fiscal 2025 also gave the confidence to the firm to increase the lower end of the guidance. HCLTech revised its annual revenue guidance to 3.5-5% from its earlier range of 3-5% for fiscal 2025.Joining its bigger peer Tata Consultancy Services (TCS), which cited some signs of improvement in the demand environment, HCLTech too mentioned better incremental demand across multiple verticals, and reported a revenue of Rs 28,862 crore, up 2.9% quarter on quarter (QoQ). Even on-year basis, the Q2 topline was 6.7% up. The Noida-headquartered firm is the second Indian IT service provider to announce its Q2 earnings this season. Last week, bellwether TCS missed market estimates for Q2 posting a 1.08% quarter-on-quarter (QoQ) decline in net profit and revenue growth at 2.6%. \"Incrementally the demand was better. Services and overall revenue came in much higher than what we expected. So, that's really good fulfilment of the demand that was coming our way across all the verticals,\" said C Vijayakumar, CEO of HCLTech.","cleaned_content":"hcltech reported a flat sequential growth in net profit in q2 of current fiscal year this was despite the continued impact of a joint venture divestment year on year growth in its software segment of \u003cNINE_PERCENT\u003e the strongest ever boosted its topline along with better incremental demand for tech and services indias third largest software services exporter reported a \u003cZERO_PERCENT\u003e quarter on quarter qoq decline in net profit at rs \u003cFOUR_THOUSAND\u003e crore beating et estimates of rs \u003cFOUR_THOUSAND\u003e crore better than expected performance in the first half of fiscal \u003cTWO_THOUSAND\u003e also gave the confidence to the firm to increase the lower end of the guidance hcltech revised its annual revenue guidance to \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e from its earlier range of \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e for fiscal \u003cTWO_THOUSAND\u003e joining its bigger peer tata consultancy services tcs which cited some signs of improvement in the demand environment hcltech too mentioned better incremental demand across multiple verticals and reported a revenue of rs \u003cTWO_TEN_THOUSAND\u003e crore up \u003cTWO_PERCENT\u003e quarter on quarter qoq even on year basis the q2 topline was \u003cSIX_PERCENT\u003e up the noida headquartered firm is the second indian it service provider to announce its q2 earnings this season last week bellwether tcs missed market estimates for q2 posting a \u003cONE_PERCENT\u003e quarter on quarter qoq decline in net profit and revenue growth at \u003cTWO_PERCENT\u003e incrementally the demand was better services and overall revenue came in much higher than what we expected so thats really good fulfilment of the demand that was coming our way across all the verticals said c vijayakumar ceo of hcltech","timestamp":"2024-10-15T06:00:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}