{"url":"https://economictimes.indiatimes.com/tech/technology/marriott-to-open-tech-accelerator-in-hyderabad-next-year/articleshow/113971738.cms","title":"Marriott to open tech accelerator in Hyderabad next year","description":"Marriott International is setting up a tech accelerator in Hyderabad, opening in early 2025. This will be its first overseas global capability centre. The centre aims to leverage Hyderabad's technology talent, focusing on software engineering, infrastructure, operations, and cybersecurity. Marriott's expansion in India includes 153 hotels with 84 more in the pipeline.","content":"US-headquartered hospitality firm Marriott International is establishing a new tech accelerator in Hyderabad which is expected to open in early 2025 and will be the company's first overseas global capability centre (GCC), said its chief revenue \u0026 technology officer Drew Pinto.He told ET that the move is aimed at leveraging the city's technology talent and drive innovation, next-gen solutions and security capabilities across the company's global enterprise.ET had reported on September 5 that the hospitality firm was setting up its first GCC in the country in Hyderabad. \"We view this as complimentary (to our overall strategy) so we have great talent around the world, in different places, not only from a volume standpoint but also define the best people at these technologies in the world,\" Pinto said. \"So, we view this as something that we're going to plug into our existing footprint and really have another way to access this talent and bring it in. It's very critical in terms of us being able to deliver the strategy that we have because we need that top talent.\" He added that given the success that other companies have had with digital and technology talent in India, the company expects that the GCC will become very important to how the group delivers its services. ","cleaned_content":"us headquartered hospitality firm marriott international is establishing a new tech accelerator in hyderabad which is expected to open in early \u003cTWO_THOUSAND\u003e and will be the companys first overseas global capability centre gcc said its chief revenue technology officer drew pinto he told et that the move is aimed at leveraging the citys technology talent and drive innovation next gen solutions and security capabilities across the companys global enterprise et had reported on september \u003cFIVE_\u003e that the hospitality firm was setting up its first gcc in the country in hyderabad we view this as complimentary to our overall strategy so we have great talent around the world in different places not only from a volume standpoint but also define the best people at these technologies in the world pinto said so we view this as something that were going to plug into our existing footprint and really have another way to access this talent and bring it in its very critical in terms of us being able to deliver the strategy that we have because we need that top talent he added that given the success that other companies have had with digital and technology talent in india the company expects that the gcc will become very important to how the group delivers its services","timestamp":"2024-10-06T06:00:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}