{"url":"https://economictimes.indiatimes.com/tech/technology/iit-profs-amber-wings-develops-indigenous-agri-drone-prototyping-indias-largest-drone/articleshow/114222976.cms","title":"IIT Prof's Amber Wings develops indigenous agri-drone, prototyping India's largest drone","description":"The company is also developing a larger 50-kg payload drone, the E-50, which will be India's largest and the world’s first electric drone, capable of traveling up to 80 km. Founder Satya Chakravarthy, an aerospace engineering professor, revealed that the startup aims to use Indian-made components, reducing reliance on Chinese suppliers and cutting costs by 30-40%.","content":"Chennai-based drone startup Amber Wings has developed an agricultural drone 'Vihaa,' and is now set to release an indigenous version with a 20-kg payload, featuring improved unit economies. It is an arm of the flying taxi startup, The ePlane Company, incubated at the IIT-Madras.The startup is also in the process of prototyping a 50-kg payload drone to further expand its capabilities. “The E-50 kg payload would have a larger wingspan and would be able to traverse up to 80 kms. This will be India’s largest drone and the world’s first electric drone. The E-50 is currently under certification,” Amber Wings founder Satya Chakravarthy told ET. He is also a Professor of Aerospace Engineering at IIT-Madras. Anticipating the demand for a 100 kg payload aircraft, he added that the design is ready and the use cases can be agnostic, ranging from defence to civilian markets.\"In recent weeks, we've discovered that we can manufacture drones entirely with Indian components, which are significantly cheaper than those sourced from China. We will launch the indigenous version of Vihaa in 1-2 months, reducing the price point by 30 to 40%,” Chakravarthy said. ","cleaned_content":"chennai based drone startup amber wings has developed an agricultural drone vihaa and is now set to release an indigenous version with a \u003cTWO_TEN\u003e kg payload featuring improved unit economies it is an arm of the flying taxi startup the eplane company incubated at the iit madras the startup is also in the process of prototyping a \u003cFIVE_TEN\u003e kg payload drone to further expand its capabilities the e \u003cFIVE_TEN\u003e kg payload would have a larger wingspan and would be able to traverse up to \u003cEIGHT_TEN\u003e kms this will be india s largest drone and the world s first electric drone the e \u003cFIVE_TEN\u003e is currently under certification amber wings founder satya chakravarthy told et he is also a professor of aerospace engineering at iit madras anticipating the demand for a \u003cONE_HUNDRED\u003e kg payload aircraft he added that the design is ready and the use cases can be agnostic ranging from defence to civilian markets in recent weeks weve discovered that we can manufacture drones entirely with indian components which are significantly cheaper than those sourced from china we will launch the indigenous version of vihaa in \u003cONE_\u003e \u003cTWO_\u003e months reducing the price point by \u003cTHREE_TEN\u003e to \u003cFOUR_TEN_PERCENT\u003e chakravarthy said","timestamp":"2024-10-14T20:29:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}