{"url":"https://economictimes.indiatimes.com/tech/technology/us-states-accuse-tiktok-of-harming-young-users/articleshow/114056185.cms","title":"US states accuse TikTok of harming young users","description":"A group of 14 US states on Tuesday filed lawsuits accusing TikTok of ensnaring young users with addictive features, then harming their minds and violating their privacy. TikTok then hits young users with money-making ads, the lawsuits argue.","content":"A group of 14 US states on Tuesday filed lawsuits accusing TikTok of ensnaring young users with addictive features, then harming their minds and violating their privacy.The wave of local court lawsuits demanding corrective measures and financial penalties comes as the popular video-snippet sharing app faces a ban in the United States if it remains owned by China-based ByteDance.\"Our investigation has revealed that TikTok cultivates social media addiction to boost corporate profits,\" California attorney general Rob Bonta said in a news release issued jointly with officials from other states.\"TikTok intentionally targets children because they know kids do not yet have the defenses or capacity to create healthy boundaries around addictive content.\"Bonta contended that features such as beauty filters, endless scrolling, autoplay videos, and \"likes\" exploit youthful curiosity and lack of will power to stop.","cleaned_content":"a group of \u003cONE_TEN\u003e us states on tuesday filed lawsuits accusing tiktok of ensnaring young users with addictive features then harming their minds and violating their privacy the wave of local court lawsuits demanding corrective measures and financial penalties comes as the popular video snippet sharing app faces a ban in the united states if it remains owned by china based bytedance our investigation has revealed that tiktok cultivates social media addiction to boost corporate profits california attorney general rob bonta said in a news release issued jointly with officials from other states tiktok intentionally targets children because they know kids do not yet have the defenses or capacity to create healthy boundaries around addictive content bonta contended that features such as beauty filters endless scrolling autoplay videos and likes exploit youthful curiosity and lack of will power to stop","timestamp":"2024-10-08T22:58:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}