{"url":"https://economictimes.indiatimes.com/tech/technology/us-lawmakers-seek-answers-from-telecoms-on-chinese-hacking-report/articleshow/114162738.cms","title":"US lawmakers seek answers from telecoms on Chinese hacking report","description":"The Wall Street Journal reported Saturday hackers obtained information from systems the federal government uses for court-authorized wiretapping, and said the three companies were among the telecoms whose networks were breached.","content":"A bipartisan group of U.S. lawmakers asked AT\u0026T, Verizon Communications, and Lumen Technologies on Friday to answer questions after a report Chinese hackers accessed the networks of U.S. broadband providers. The Wall Street Journal reported Saturday hackers obtained information from systems the federal government uses for court-authorized wiretapping, and said the three companies were among the telecoms whose networks were breached. House Energy and Commerce Committee Chair Cathy McMorris Rodgers, a Republican, and the top Democrat on the committee Representative Frank Pallone along with Representatives Bob Latta and Doris Matsui asked the three companies to answer questions. They are seeking a briefing and detailed answers by next Friday. \"There is a growing concern regarding the cybersecurity vulnerabilities embedded in U.S. telecommunications networks,\" the lawmakers said. They are asking for details on what information was seized and when the companies learned about the intrusion. AT\u0026T and Lumen declined to comment, while Verizon did not immediately comment.","cleaned_content":"a bipartisan group of u s lawmakers asked at t verizon communications and lumen technologies on friday to answer questions after a report chinese hackers accessed the networks of u s broadband providers the wall street journal reported saturday hackers obtained information from systems the federal government uses for court authorized wiretapping and said the three companies were among the telecoms whose networks were breached house energy and commerce committee chair cathy mcmorris rodgers a republican and the top democrat on the committee representative frank pallone along with representatives bob latta and doris matsui asked the three companies to answer questions they are seeking a briefing and detailed answers by next friday there is a growing concern regarding the cybersecurity vulnerabilities embedded in u s telecommunications networks the lawmakers said they are asking for details on what information was seized and when the companies learned about the intrusion at t and lumen declined to comment while verizon did not immediately comment","timestamp":"2024-10-12T08:52:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}