{"url":"https://economictimes.indiatimes.com/tech/technology/bosch-tenstorrent-to-collaborate-on-standardising-automotive-chips/articleshow/114137269.cms","title":"Bosch, Tenstorrent to collaborate on standardising automotive chips","description":"The plans include developing a standard method to use a building block of modern chips, called chiplets, to create systems that can power vehicles with significantly different needs, Tenstorrent chief customer officer David Bennett said in an interview.","content":"German industrial giant Bosch will collaborate with U.S. chip startup Tenstorrent to develop a platform for standardizing the building blocks of automotive chips, Tenstorrent executives said. The plans include developing a standard method to use a building block of modern chips, called chiplets, to create systems that can power vehicles with significantly different needs, Tenstorrent chief customer officer David Bennett said in an interview. By combining different quantities and types of chiplets to form complete processors, the two companies aim to reduce costs and increase the speed of bringing new silicon products to the automotive industry. \"(Bosch is) collaborating with us to essentially redefine how automakers look at silicon - purchasing silicon and building silicon,\" Bennett said. Hastened by the introduction of electric vehicles, autos have increasingly become products that resemble large computer systems that operate via a battery on four wheels.","cleaned_content":"german industrial giant bosch will collaborate with u s chip startup tenstorrent to develop a platform for standardizing the building blocks of automotive chips tenstorrent executives said the plans include developing a standard method to use a building block of modern chips called chiplets to create systems that can power vehicles with significantly different needs tenstorrent chief customer officer david bennett said in an interview by combining different quantities and types of chiplets to form complete processors the two companies aim to reduce costs and increase the speed of bringing new silicon products to the automotive industry bosch is collaborating with us to essentially redefine how automakers look at silicon purchasing silicon and building silicon bennett said hastened by the introduction of electric vehicles autos have increasingly become products that resemble large computer systems that operate via a battery on four wheels","timestamp":"2024-10-11T09:46:00+05:30","market_timestamp":"2024-10-11T09:46:00+05:30","off_market_hours":false}