{"url":"https://economictimes.indiatimes.com/tech/technology/nikhil-kamath-ankit-nagori-and-prashanth-prakash-now-bengaluru-franchise-owners-of-e-cricket-league/articleshow/114014349.cms","title":"Nikhil Kamath, Ankit Nagori and Prashanth Prakash now Bengaluru franchise owners of e-cricket league","description":"In its inaugural edition, the GEPL saw eight teams compete in playing Real Cricket, the video game created by JetSynthesys. The company said it saw a multiplatform reach of over 70 million and will have an expanded team format this time.","content":"New-age digital entertainment and technology company JetSynthesys on Monday announced that Zerodha cofounder Nikhil Kamath, Curefoods founder Ankit Nagori, and Accel partner Prashanth Prakash will serve as joint owners of the Bengaluru franchise team in the second season of the Global e-Cricket Premier League (GEPL) run by the company.This marks the beginning of the sale of franchise teams for the league, which held its first season in December last year.“This is the first time that, like in IPL or other leagues, we are actually now selling our team,” Rajan Navani, chief executive, JetSynthesys, told ET. “This will take it to a different scale, because the moment you sell your team to a particular city, you will have fans from that city, you will have deeper engagement, and it will enhance the entire experience.”The new team and its owners represent a ‘perfect match’, with a set of individuals who are builders in the new India, success stories in their respective fields, representing India’s innovation capital Bengaluru, said Navani.In its inaugural edition, the GEPL saw eight teams compete in playing Real Cricket, the video game created by JetSynthesys. The company said it saw a multiplatform reach of over 70 million and will have an expanded team format this time.","cleaned_content":"new age digital entertainment and technology company jetsynthesys on monday announced that zerodha cofounder nikhil kamath curefoods founder ankit nagori and accel partner prashanth prakash will serve as joint owners of the bengaluru franchise team in the second season of the global e cricket premier league gepl run by the company this marks the beginning of the sale of franchise teams for the league which held its first season in december last year this is the first time that like in ipl or other leagues we are actually now selling our team rajan navani chief executive jetsynthesys told et this will take it to a different scale because the moment you sell your team to a particular city you will have fans from that city you will have deeper engagement and it will enhance the entire experience the new team and its owners represent a perfect match with a set of individuals who are builders in the new india success stories in their respective fields representing india s innovation capital bengaluru said navani in its inaugural edition the gepl saw eight teams compete in playing real cricket the video game created by jetsynthesys the company said it saw a multiplatform reach of over \u003cSEVEN_TEN\u003e million and will have an expanded team format this time","timestamp":"2024-10-07T18:15:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}