{"url":"https://economictimes.indiatimes.com/tech/technology/deependra-singh-rathore-is-new-cto-for-payments-at-one-97-communications/articleshow/113946920.cms","title":"Deependra Singh Rathore is new CTO for payments at One 97 Communications","description":"Manmeet Singh Dhody, who was the CTO of payments till now, moves into the role of AI Fellow.","content":"One 97 Communications, the parent company of fintech firm Paytm, has appointed Deependra Singh Rathore as its chief technology officer (CTO) for payments. Rathore, who was with Paytm Payments Bank Ltd (PPBL) since 2016 was a senior vice president in charge of technology at Paytm.Following this transition, Manmeet Singh Dhody, who was the CTO of payments has been transitioned into the role of AI Fellow.“As India’s leading tech innovator, we have always championed innovations that drive mobile payments and inclusive financial service distribution to the masses. We are excited to see Deependra Singh Rathore step into the role of CTO, and build for financial services in the AI age,” a Paytm spokesperson said. \"We also welcome Manmeet as an AI Fellow, helping accelerate our vision of integrating AI-driven processes across our business operations.\"Earlier this year, the Reserve Bank of India (RBI) had instructed its associated entity Paytm Payments Bank to stop basic banking services from March 15.","cleaned_content":"one \u003cNINE_TEN\u003e communications the parent company of fintech firm paytm has appointed deependra singh rathore as its chief technology officer cto for payments rathore who was with paytm payments bank ltd ppbl since \u003cTWO_THOUSAND\u003e was a senior vice president in charge of technology at paytm following this transition manmeet singh dhody who was the cto of payments has been transitioned into the role of ai fellow as india s leading tech innovator we have always championed innovations that drive mobile payments and inclusive financial service distribution to the masses we are excited to see deependra singh rathore step into the role of cto and build for financial services in the ai age a paytm spokesperson said we also welcome manmeet as an ai fellow helping accelerate our vision of integrating ai driven processes across our business operations earlier this year the reserve bank of india rbi had instructed its associated entity paytm payments bank to stop basic banking services from march \u003cONE_TEN\u003e","timestamp":"2024-10-04T21:49:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}