{"url":"https://economictimes.indiatimes.com/tech/information-tech/india-drives-tcs-growth-buzz/articleshow/114137999.cms","title":"India drives TCS growth buzz","description":"Tata Consultancy Services (TCS) reported a 5% increase in net profit for the second quarter, driven by a large deal with BSNL. Despite cautious spending from clients in key markets, TCS saw signs of improvement in financial services in North America. CEO Krithivasan expressed optimism about the future, suggesting that the second quarter of FY25 could be better as macroeconomic uncertainty eases.","content":"India’s largest software exporter Tata Consultancy Services (TCS) reported a 5% year-on-year increase in net profit to Rs 11,909 crore in the second quarter, driven by the ramp-up of its Rs 15,000 crore deal with state-owned telco Bharat Sanchar Nigam Ltd (BSNL) while clients in the key markets of America and Europe remained cautious with their technology spends.CEO K Krithivasan cited “some signs of improvement, most notably in financial services in North America,” acknowledging that the “demand outlook continues to remain cautious,” on an analyst call after earnings were announced. A planned press conference was cancelled due to Ratan Tata’s death on Wednesday.“Stability in the macro brings initial signs of confidence with the easing of interest rate… consumer confidence and industry confidence will get better. This can potentially lead to improved investment,” said Krithivasan, signalling that the second quarter of FY25 could be better and that the industry, which has been grappling with an unprecedented slowdown in demand, could emerge from the shadows of macroeconomic uncertainty.","cleaned_content":"india s largest software exporter tata consultancy services tcs reported a \u003cFIVE_PERCENT\u003e year on year increase in net profit to rs \u003cONE_TEN_THOUSAND\u003e crore in the second quarter driven by the ramp up of its rs \u003cONE_TEN_THOUSAND\u003e crore deal with state owned telco bharat sanchar nigam ltd bsnl while clients in the key markets of america and europe remained cautious with their technology spends ceo k krithivasan cited some signs of improvement most notably in financial services in north america acknowledging that the demand outlook continues to remain cautious on an analyst call after earnings were announced a planned press conference was cancelled due to ratan tata s death on wednesday stability in the macro brings initial signs of confidence with the easing of interest rate consumer confidence and industry confidence will get better this can potentially lead to improved investment said krithivasan signalling that the second quarter of fy25 could be better and that the industry which has been grappling with an unprecedented slowdown in demand could emerge from the shadows of macroeconomic uncertainty","timestamp":"2024-10-11T10:15:00+05:30","market_timestamp":"2024-10-11T10:15:00+05:30","off_market_hours":false}