{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-notches-record-close-could-unseat-apple-as-most-valuable-company/articleshow/114241396.cms","title":"Nvidia notches record close, could unseat Apple as most valuable company","description":"In June, Nvidia briefly became the world's most valuable company. It was overtaken by Microsoft, and the tech trio's market capitalizations have been neck-and-neck for several months.","content":"Shares of Nvidia closed at their highest ever on Monday, putting the heavyweight AI chipmaker on the brink of dethroning Apple as the world's most valuable company. With investors betting on strong demand for its current and next-generation AI processors, the Santa Clara, California company's stock climbed 2.4% to end the day at $138.07. In June, Nvidia briefly became the world's most valuable company. It was overtaken by Microsoft, and the tech trio's market capitalizations have been neck-and-neck for several months. The latest gains lifted Nvidia's market value to $3.39 trillion, just below Apple's $3.52 trillion value and above Microsoft's $3.12 trillion. Nvidia has been Wall Street's biggest winner from a race between Alphabet, Microsoft, Amazon and other major tech companies to dominate emerging AI technology.","cleaned_content":"shares of nvidia closed at their highest ever on monday putting the heavyweight ai chipmaker on the brink of dethroning apple as the worlds most valuable company with investors betting on strong demand for its current and next generation ai processors the santa clara california companys stock climbed \u003cTWO_PERCENT\u003e to end the day at \u003cONE_HUNDRED\u003e in june nvidia briefly became the worlds most valuable company it was overtaken by microsoft and the tech trios market capitalizations have been neck and neck for several months the latest gains lifted nvidias market value to \u003cTHREE_\u003e trillion just below apples \u003cTHREE_\u003e trillion value and above microsofts \u003cTHREE_\u003e trillion nvidia has been wall streets biggest winner from a race between alphabet microsoft amazon and other major tech companies to dominate emerging ai technology","timestamp":"2024-10-15T07:43:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}