{"url":"https://economictimes.indiatimes.com/tech/technology/swiggy-launches-new-service-bolt-to-deliver-food-in-10-15-minutes/articleshow/113946568.cms","title":"Swiggy launches new service Bolt to deliver food in 10-15 minutes","description":"For now, a limited set of food items from select restaurants will be on offer. According to CEO Rohit Kapoor, the service is being rolled out in Bengaluru, Hyderabad, Mumbai, Chennai, Delhi, and Pune.","content":"Public markets-bound Swiggy has rolled out a 10-minute food delivery service Bolt, the company said Under Bolt, Swiggy is offering deliveries of a limited set of items from select restaurants that will be delivered within 10 to 15 minutes.\"Ten years ago, Swiggy revolutionised food delivery by cutting average wait times to 30 minutes. Now, we’re reducing that wait even further for frequently ordered items like coffee, burgers, ice cream, and biryani, partnering with trusted restaurants to deliver the best food in just 10 minutes,\" Rohit Kapoor, CEO, Swiggy Food Marketplace, said in a statement.In Bengaluru, restaurants such as Wendy's Burgers, Meghana Foods, Cure Foods' Sharief Bhai, and Glen's Bakehouse were seen on the Bolt service. Kapoor said the service is being rolled out in key markets such as Bengaluru, Hyderabad, Mumbai, Chennai, Delhi, and Pune.Customers can choose from a mix of well-known brands like KFC, McDonald's, Burger King, Baskin Robbins, Starbucks, Chaayos, and EatFit, alongside local favourites like Karachi Bakery and G Pulla Reddy Sweets in Hyderabad, MM Mithaiwala in Mumbai, Bhartiya Jalpan and Anand Sweets in Bangalore, Sethi Ice-cream in Delhi, and Irani Cafe in Pune, among many others,\" the company said in a statement.","cleaned_content":"public markets bound swiggy has rolled out a \u003cONE_TEN\u003e minute food delivery service bolt the company said under bolt swiggy is offering deliveries of a limited set of items from select restaurants that will be delivered within \u003cONE_TEN\u003e to \u003cONE_TEN\u003e minutes ten years ago swiggy revolutionised food delivery by cutting average wait times to \u003cTHREE_TEN\u003e minutes now we re reducing that wait even further for frequently ordered items like coffee burgers ice cream and biryani partnering with trusted restaurants to deliver the best food in just \u003cONE_TEN\u003e minutes rohit kapoor ceo swiggy food marketplace said in a statement in bengaluru restaurants such as wendys burgers meghana foods cure foods sharief bhai and glens bakehouse were seen on the bolt service kapoor said the service is being rolled out in key markets such as bengaluru hyderabad mumbai chennai delhi and pune customers can choose from a mix of well known brands like kfc mcdonalds burger king baskin robbins starbucks chaayos and eatfit alongside local favourites like karachi bakery and g pulla reddy sweets in hyderabad mm mithaiwala in mumbai bhartiya jalpan and anand sweets in bangalore sethi ice cream in delhi and irani cafe in pune among many others the company said in a statement","timestamp":"2024-10-04T21:30:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}