{"url":"https://economictimes.indiatimes.com/tech/technology/republicans-hate-techs-influence-on-politics-unless-it-comes-from-elon-musk/articleshow/114113871.cms","title":"Republicans hate tech's influence on politics, unless it comes from Elon Musk","description":"The Republicans' silence about Musk's blatant politicking via his social media platform demonstrates their party's deep hypocrisy when it comes to Big Tech's power over politics. A rule to push Musk's posts to more people was apparently hard-coded into the platform's software after Musk got upset that President Joe Biden's posts about the Super Bowl received more views than his. Musk reportedly threatened to fire his own engineers unless they made sure his posts were super amplified. Sure enough, Musk's posts now get tens of millions of views.","content":"Elon Musk has not been at all subtle in his efforts to help Donald Trump win the presidency. Musk hasn't just endorsed him or donated tens of millions of dollars to pro-Trump political action committees or appeared at Trump rallies to jump up and down with joy. Musk is also using the full power of his ownership of the social platform X to portray Kamala Harris as an existential threat to America while spreading many falsehoods. The Republicans' silence about Musk's blatant politicking via his social media platform demonstrates their party's deep hypocrisy when it comes to Big Tech's power over politics. A rule to push Musk's posts to more people was apparently hard-coded into the platform's software after Musk got upset that President Joe Biden's posts about the Super Bowl received more views than his. Musk reportedly threatened to fire his own engineers unless they made sure his posts were super amplified. Sure enough, Musk's posts now get tens of millions of views. Musk has posted on X, for example, that \"if Trump is NOT elected, this will be the last election\" (103 million views). He has described Harris as \"just a puppet\" (20 million views) or \"the Kamala puppet\" (28 million views). He also regularly claims what he describes as the \"the Kamala Dem machine\" or \"the Dems\" are out to ensure a \"permanent one-party rule in America\" (33 million views). Musk also routinely makes false claims about mass electoral fraud committed to help Democrats. For example, Musk posted that Arizona is \"refusing to remove noncitizens from the voter rolls\" and shared a post claiming that hundreds of thousands of immigrants in the country illegally had registered to vote there -- both of which prompted a correction attempt from the county recorder based in Phoenix, who is a Republican.","cleaned_content":"elon musk has not been at all subtle in his efforts to help donald trump win the presidency musk hasnt just endorsed him or donated tens of millions of dollars to pro trump political action committees or appeared at trump rallies to jump up and down with joy musk is also using the full power of his ownership of the social platform x to portray kamala harris as an existential threat to america while spreading many falsehoods the republicans silence about musks blatant politicking via his social media platform demonstrates their partys deep hypocrisy when it comes to big techs power over politics a rule to push musks posts to more people was apparently hard coded into the platforms software after musk got upset that president joe bidens posts about the super bowl received more views than his musk reportedly threatened to fire his own engineers unless they made sure his posts were super amplified sure enough musks posts now get tens of millions of views musk has posted on x for example that if trump is not elected this will be the last election \u003cONE_HUNDRED\u003e million views he has described harris as just a puppet \u003cTWO_TEN\u003e million views or the kamala puppet \u003cTWO_TEN\u003e million views he also regularly claims what he describes as the the kamala dem machine or the dems are out to ensure a permanent one party rule in america \u003cTHREE_TEN\u003e million views musk also routinely makes false claims about mass electoral fraud committed to help democrats for example musk posted that arizona is refusing to remove noncitizens from the voter rolls and shared a post claiming that hundreds of thousands of immigrants in the country illegally had registered to vote there both of which prompted a correction attempt from the county recorder based in phoenix who is a republican","timestamp":"2024-10-10T13:54:00+05:30","market_timestamp":"2024-10-10T13:54:00+05:30","off_market_hours":false}