{"url":"https://economictimes.indiatimes.com/tech/technology/digital-payments-show-strong-uptick-buoyed-by-wider-adoption-of-credit-during-festive-season/articleshow/114224925.cms","title":"Digital payments show strong uptick buoyed by wider adoption of credit during festive season","description":"During this year’s festive season sales, credit cards and credit-based payment instruments like pay-later products saw a significant increase, according to industry reports. Transactions rose by 35-50% compared to last year, with a large share being made through credit cards, EMIs, and pay-later options. Unified Payments Interface (UPI) remained the dominant payment method, with a 34% rise in transactions and over 500 million daily payments recorded.","content":"Usage of credit cards and credit-based payment instruments like pay-later products showed a robust increase during this year’s festive season sales, according to industry insiders.While trends point towards a 35-50% jump in the total number of transactions this year against the festive months of last year, a significant chunk of the payments was through credit cards, EMIs (equated monthly instalments) and pay-later modes.\"Between October 3 and 12 this year, our platform saw a remarkable 106% increase in credit card transactions and a 60% rise in UPI transactions compared to the Navratri season last year,\" said Rahul Kothari, chief operating officer at Razorpay, which offers omnichannel payment capabilities to merchants.Amazon Pay, the fintech offering from the ecommerce giant, observed that around 20% of the purchases were made with EMI and 80% of EMI transactions were no-cost ones. In no-cost transactions, the brand subsidises the cost and consumers do not pay anything extra on instalments.People bought video games like PlayStation 5 on no-cost EMIs through Amazon Pay.","cleaned_content":"usage of credit cards and credit based payment instruments like pay later products showed a robust increase during this year s festive season sales according to industry insiders while trends point towards a \u003cTHREE_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e jump in the total number of transactions this year against the festive months of last year a significant chunk of the payments was through credit cards emis equated monthly instalments and pay later modes between october \u003cTHREE_\u003e and \u003cONE_TEN\u003e this year our platform saw a remarkable \u003cONE_HUNDRED_PERCENT\u003e increase in credit card transactions and a \u003cSIX_TEN_PERCENT\u003e rise in upi transactions compared to the navratri season last year said rahul kothari chief operating officer at razorpay which offers omnichannel payment capabilities to merchants amazon pay the fintech offering from the ecommerce giant observed that around \u003cTWO_TEN_PERCENT\u003e of the purchases were made with emi and \u003cEIGHT_TEN_PERCENT\u003e of emi transactions were no cost ones in no cost transactions the brand subsidises the cost and consumers do not pay anything extra on instalments people bought video games like playstation \u003cFIVE_\u003e on no cost emis through amazon pay","timestamp":"2024-10-15T06:00:00+05:30","market_timestamp":"2024-10-15T09:15:00+05:30","off_market_hours":true}