{"url":"https://economictimes.indiatimes.com/tech/information-tech/marriotts-first-overseas-gcc-in-hyderabad-will-focus-on-engineering-infrastructure-and-cybersecurity/articleshow/113939830.cms","title":"Marriott's first overseas GCC in Hyderabad will focus on engineering, infrastructure and cybersecurity","description":"ET had reported on September 5 that the hospitality major was setting up its first global capability centre (GCC) in the country in Hyderabad.","content":"Marriott International Inc. is establishing a new Marriott Tech Accelerator which is expected to open in early 2025 and will be the company’s first overseas global capability center (GCC) in Hyderabad to leverage the city's top tech talent and drive innovation, next-gen solutions, and security capabilities across its global enterprise, Drew Pinto, executive vice president and chief revenue \u0026 technology officer, Marriott International told ET.ET had reported on September 5 that the hospitality major was setting up its first global capability centre (GCC) in the country in Hyderabad.\"We view this as complimentary (to our overall strategy) so we have great talent around the world, in different places,\" he said. \"Not only from a volume standpoint but also define the best people at these technologies in the world. So we view this as something that we're going to plug into our existing footprint and really have another way to access this talent and bring it in.It's very critical in terms of us being able to deliver the strategy that we have, because we need that top talent.\"He added that given the success that other companies have had with digital and technology talent in India, the company expects that this GCC will become something that becomes very important in the overall mix of how the Group delivers its services. Naveen Manga, global chief technology officer at Marriott International said the GCC would focus on three areas specifically - software engineering, infrastructure and operations, and cybersecurity.","cleaned_content":"marriott international inc is establishing a new marriott tech accelerator which is expected to open in early \u003cTWO_THOUSAND\u003e and will be the company s first overseas global capability center gcc in hyderabad to leverage the citys top tech talent and drive innovation next gen solutions and security capabilities across its global enterprise drew pinto executive vice president and chief revenue technology officer marriott international told et et had reported on september \u003cFIVE_\u003e that the hospitality major was setting up its first global capability centre gcc in the country in hyderabad we view this as complimentary to our overall strategy so we have great talent around the world in different places he said not only from a volume standpoint but also define the best people at these technologies in the world so we view this as something that were going to plug into our existing footprint and really have another way to access this talent and bring it in its very critical in terms of us being able to deliver the strategy that we have because we need that top talent he added that given the success that other companies have had with digital and technology talent in india the company expects that this gcc will become something that becomes very important in the overall mix of how the group delivers its services naveen manga global chief technology officer at marriott international said the gcc would focus on three areas specifically software engineering infrastructure and operations and cybersecurity","timestamp":"2024-10-04T16:56:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}