{"url":"https://economictimes.indiatimes.com/tech/technology/indias-chandrayaan-missions-redefined-lunar-science-for-all/articleshow/114127982.cms","title":"‘India’s Chandrayaan missions redefined lunar science for all’","description":"India successfully landed its third lunar mission, the Chandrayaan-3, 70 degrees to the south pole of the moon on August 23, 2023. India is the fourth country to land on the moon and the first to soft land in the southern high latitudes.","content":"Lunar science can be divided into before and after Chandrayaan missions, P Veeramuthuvel, project director for Chandrayaan-3, said here on Thursday.India successfully landed its third lunar mission, the Chandrayaan-3, 70 degrees to the south pole of the moon on August 23, 2023. India is the fourth country to land on the moon and the first to soft land in the southern high latitudes.“Before the Chandrayaan missions, scientists thought the moon was bone dry. Whereas after Chandrayaan, they discovered the presence of water molecules on the surface, sub-surface and exosphere,” Veeramuthuvel said. There was a resurgence of global interest in lunar exploration post this, he said.Scientists were also under the assumption that the moon is geologically dead, but the Chandrayaan missions proved that the moon is dynamic and volcanically active, he said.The Union cabinet recently approved India's fourth lunar mission Chandrayaan-4 to bring lunar samples to earth.","cleaned_content":"lunar science can be divided into before and after chandrayaan missions p veeramuthuvel project director for chandrayaan \u003cTHREE_\u003e said here on thursday india successfully landed its third lunar mission the chandrayaan \u003cTHREE_\u003e \u003cSEVEN_TEN\u003e degrees to the south pole of the moon on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e india is the fourth country to land on the moon and the first to soft land in the southern high latitudes before the chandrayaan missions scientists thought the moon was bone dry whereas after chandrayaan they discovered the presence of water molecules on the surface sub surface and exosphere veeramuthuvel said there was a resurgence of global interest in lunar exploration post this he said scientists were also under the assumption that the moon is geologically dead but the chandrayaan missions proved that the moon is dynamic and volcanically active he said the union cabinet recently approved indias fourth lunar mission chandrayaan \u003cFOUR_\u003e to bring lunar samples to earth","timestamp":"2024-10-10T22:34:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}