{"url":"https://economictimes.indiatimes.com/tech/technology/bits-bytes-tesla-unveils-robotaxi-pledges-it-before-2027/articleshow/114176868.cms","title":"Bits \u0026 Bytes: Tesla unveils robotaxi, pledges it ‘before 2027’","description":"Tesla's self-driving robotaxi will be fully electric and cost under $30,000. Musk also revealed humanoid robots called 'Optimus' that could perform menial tasks and offer companionship. Meanwhile, the lawsuits allege that TikTok's addictive design features, like endless scrolling and push notifications, harm children's mental health. Meta has introduced AI tools called \"Meta Movie Gen\" for automatically generating, editing, and adding sound effects to videos.","content":"Elon Musk unveiled Tesla’s self-driving robotaxi this week, predicting that it would be available by 2027. Musk said the fully electric car — which has no steering wheel or pedals — would be priced under $30,000, would be charged wirelessly with inductive technology and would be “10 to 20 times safer” than human-driven cars.Few other details were given about the vehicle, but Musk said Tesla already had 50 of them.He said the company was expecting to begin “fully autonomous, unsupervised” driving next year with existing models, and then move on to production of what he called the “cybercab”.He also introduced dancing humanoid robots called ‘Optimus’ that would one day be able to do menial tasks, as well as offer friendship. “I think this will be the biggest product ever of any kind,” he said.He said it might retail for $20,000 to $30,000, though he didn’t give any timeline on this.TikTok designed to be addictive, causes kids harm: LawsuitMore than a dozen US states filed lawsuits against TikTok, saying the app is designed to be addictive to kids and harms their mental health.","cleaned_content":"elon musk unveiled tesla s self driving robotaxi this week predicting that it would be available by \u003cTWO_THOUSAND\u003e musk said the fully electric car which has no steering wheel or pedals would be priced under \u003cTHREE_TEN_THOUSAND\u003e would be charged wirelessly with inductive technology and would be \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e times safer than human driven cars few other details were given about the vehicle but musk said tesla already had \u003cFIVE_TEN\u003e of them he said the company was expecting to begin fully autonomous unsupervised driving next year with existing models and then move on to production of what he called the cybercab he also introduced dancing humanoid robots called optimus that would one day be able to do menial tasks as well as offer friendship i think this will be the biggest product ever of any kind he said he said it might retail for \u003cTWO_TEN_THOUSAND\u003e to \u003cTHREE_TEN_THOUSAND\u003e though he didn t give any timeline on this tiktok designed to be addictive causes kids harm lawsuitmore than a dozen us states filed lawsuits against tiktok saying the app is designed to be addictive to kids and harms their mental health","timestamp":"2024-10-13T06:02:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}