{"url":"https://economictimes.indiatimes.com/tech/technology/cybersecurity-firm-arctic-wolf-launches-another-gcc-in-bengaluru/articleshow/114175976.cms","title":"From Sophos to Arctic Wolf: Bengaluru becomes hub for global cybersecurity ops","description":"Jeff Green, Senior VP at Arctic Wolf, explains how they built a bootstrapped GCC business in India and the lessons learnt along the way.","content":"After the launch of their global capability centre (GCC) in Bengaluru this week, Arctic Wolf India posted on social media: “Namaskara Bengaluru! The wolves have arrived, the den is set, and we are ready to end cyber risk.”Jeff Green, senior vice-president, engineering, of the US-based cybersecurity firm, is credited with setting up four different GCCs in Bengaluru in the last 24 years, all by bootstrapping and leveraging personal connections. This week, he set up the fourth GCC in the city, this time for the cyber security firm, Arctic Wolf, and once again, he says he did this without taking any third-party help.Over the last 24 years, Green has seen the evolution of talent in India’s tech capital. The other three GCCs where he played a significant role are Sophos, McAfee and Pulse Secure, the latter being a spin-off of Juniper Network, for which they built a team in Bengaluru from scratch, Green says.“The last GCC we started was for Sophos with a team of 30 engineers. It was close to 300 by the time I left that company,” he adds.But while Sophos went from 30 to 300 employees in five years, Pulse Secure scaled up 2X in two years in his tenure. Similarly, he saw McAfee scaling up from 100 to 2,000 employees in 10 years.","cleaned_content":"after the launch of their global capability centre gcc in bengaluru this week arctic wolf india posted on social media namaskara bengaluru the wolves have arrived the den is set and we are ready to end cyber risk jeff green senior vice president engineering of the us based cybersecurity firm is credited with setting up four different gccs in bengaluru in the last \u003cTWO_TEN\u003e years all by bootstrapping and leveraging personal connections this week he set up the fourth gcc in the city this time for the cyber security firm arctic wolf and once again he says he did this without taking any third party help over the last \u003cTWO_TEN\u003e years green has seen the evolution of talent in india s tech capital the other three gccs where he played a significant role are sophos mcafee and pulse secure the latter being a spin off of juniper network for which they built a team in bengaluru from scratch green says the last gcc we started was for sophos with a team of \u003cTHREE_TEN\u003e engineers it was close to \u003cTHREE_HUNDRED\u003e by the time i left that company he adds but while sophos went from \u003cTHREE_TEN\u003e to \u003cTHREE_HUNDRED\u003e employees in five years pulse secure scaled up \u003cTWO_\u003e x in two years in his tenure similarly he saw mcafee scaling up from \u003cONE_HUNDRED\u003e to \u003cTWO_THOUSAND\u003e employees in \u003cONE_TEN\u003e years","timestamp":"2024-10-13T14:28:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}