{"url":"https://economictimes.indiatimes.com/tech/technology/cashfree-receives-npci-certification-for-its-own-upi-switch/articleshow/114249234.cms","title":"Cashfree receives NPCI certification for its own UPI switch","description":"Cashfree can offer settlement of around 12,000 transactions per second with this certification. Cashfree has built this switch in partnership with NSDL Payments Bank as the sponsor bank.","content":"Cashfree Payments has received certification from the National Payments Corporation of India for its UPI Switch service. This will allow Cashfree to directly integrate with any bank's core banking software and offer a higher transaction success rate for its merchants.Cashfree can offer settlement of around 12,000 transactions per second with this certification. Cashfree has built this switch in partnership with NSDL Payments Bank as the sponsor bank.This will help Cashfree achieve a 5% jump in its transaction success rates and help in faster merchant onboarding, instant access to new features on UPI, and better control over the entire payments journey.“Our advanced UPI Switch significantly elevates Cashfree Payments’ payment processing value proposition. This solution transforms the UPI payment experience with faster onboarding, customisable account statements, immediate access to new UPI features, and enhanced visibility of payment failure reasons,” said Aakash Sinha, cofounder, Cashfree.Cashfree Payments is a payment aggregator processing transactions worth $80 billion annually and is a trusted choice for over 6 lakh businesses for digital payment solutions. It received the PA licence from the RBI in December 2023.","cleaned_content":"cashfree payments has received certification from the national payments corporation of india for its upi switch service this will allow cashfree to directly integrate with any banks core banking software and offer a higher transaction success rate for its merchants cashfree can offer settlement of around \u003cONE_TEN_THOUSAND\u003e transactions per second with this certification cashfree has built this switch in partnership with nsdl payments bank as the sponsor bank this will help cashfree achieve a \u003cFIVE_PERCENT\u003e jump in its transaction success rates and help in faster merchant onboarding instant access to new features on upi and better control over the entire payments journey our advanced upi switch significantly elevates cashfree payments payment processing value proposition this solution transforms the upi payment experience with faster onboarding customisable account statements immediate access to new upi features and enhanced visibility of payment failure reasons said aakash sinha cofounder cashfree cashfree payments is a payment aggregator processing transactions worth \u003cEIGHT_TEN\u003e billion annually and is a trusted choice for over \u003cSIX_\u003e lakh businesses for digital payment solutions it received the pa licence from the rbi in december \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-15T16:27:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}