{"url":"https://economictimes.indiatimes.com/tech/technology/global-smartphone-shipments-rise-5-in-q3-apple-gains-share-canalys/articleshow/114238449.cms","title":"Global smartphone shipments rise 5% in Q3; Apple gains share:  Canalys","description":"Global smartphone shipments increased by 5% in Q3 2024, driven by demand in emerging economies and replacement cycles in North America, China, and Europe. Apple recorded its highest third-quarter shipments, fueled by older model sales, while Samsung narrowly maintained its lead. Xiaomi held a 14% market share.","content":"Global smartphone shipments grew 5% in the third quarter of 2024, driven by persistent demand in emerging economies and the start of a replacement cycle in North America, China and Europe, underpinning a recovery in the market after a prolonged slump. The July-September quarter marked the fourth consecutive quarter of growth in the smartphone market, research firm Canalys said in a report on Monday. Apple reached record high third-quarter shipments, backed by strong demand for its older models, the report added. WHY IT'S IMPORTANT The smartphone market has been recovering as a series of artificial intelligence features and new releases prompt users to replace their devices after a months-long downturn following the pandemic. Smartphone providers such as Apple and Samsung as well as various chipmakers have pinned high hopes on the market's resurgence amid intense competition. KEY QUOTES","cleaned_content":"global smartphone shipments grew \u003cFIVE_PERCENT\u003e in the third quarter of \u003cTWO_THOUSAND\u003e driven by persistent demand in emerging economies and the start of a replacement cycle in north america china and europe underpinning a recovery in the market after a prolonged slump the july september quarter marked the fourth consecutive quarter of growth in the smartphone market research firm canalys said in a report on monday apple reached record high third quarter shipments backed by strong demand for its older models the report added why its important the smartphone market has been recovering as a series of artificial intelligence features and new releases prompt users to replace their devices after a months long downturn following the pandemic smartphone providers such as apple and samsung as well as various chipmakers have pinned high hopes on the markets resurgence amid intense competition key quotes","timestamp":"2024-10-15T11:40:00+05:30","market_timestamp":"2024-10-15T11:40:00+05:30","off_market_hours":false}