{"url":"https://economictimes.indiatimes.com/tech/technology/spacex-uses-dominance-in-rocket-launches-to-boost-starlink/articleshow/114102068.cms","title":"SpaceX uses dominance in rocket launches to boost Starlink","description":"SpaceX, using its leading position in rocket launches, has been pressing satellite competitors to share wireless spectrum for its Starlink internet service. Attorneys have raised these practices with U.S. antitrust authorities. Regulators have mediated disputes on spectrum sharing, enhancing Starlink's market presence. T-Mobile's partnership with SpaceX aims to provide direct-to-smartphone satellite service.","content":"SpaceX has used its dominant position as the primary rocket launcher to push satellite rivals to share wireless airwaves with its Starlink broadband internet business, the Wall Street Journal reported on Wednesday. The Hawthorne, California-based company asked other firms, such as Kepler Communications and OneWeb, to share their wireless spectrum rights with SpaceX before they agree to launch their equipment, the report said, citing people familiar with the matter. Attorneys from a law firm met with the Justice Department's antitrust division in recent months to bring attention to these arrangements on behalf of some satellite and rocket companies to discuss whether SpaceX is abusing its power, the report said. SpaceX and OneWeb Communications did not immediately respond to a Reuters request for comment, while Kepler declined comment. Over the past few years, Elon Musk, CEO of SpaceX, has sought to expand Starlink's coverage to reach more users worldwide.","cleaned_content":"spacex has used its dominant position as the primary rocket launcher to push satellite rivals to share wireless airwaves with its starlink broadband internet business the wall street journal reported on wednesday the hawthorne california based company asked other firms such as kepler communications and oneweb to share their wireless spectrum rights with spacex before they agree to launch their equipment the report said citing people familiar with the matter attorneys from a law firm met with the justice departments antitrust division in recent months to bring attention to these arrangements on behalf of some satellite and rocket companies to discuss whether spacex is abusing its power the report said spacex and oneweb communications did not immediately respond to a reuters request for comment while kepler declined comment over the past few years elon musk ceo of spacex has sought to expand starlinks coverage to reach more users worldwide","timestamp":"2024-10-10T08:19:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}