{"url":"https://economictimes.indiatimes.com/tech/technology/x-to-be-reinstated-in-brazil-after-complying-with-sc-demands/articleshow/114062454.cms","title":"X to be reinstated in Brazil after complying with SC demands","description":"Brazil's Supreme Court Justice Alexandre de Moraes has allowed the return of social media platform X after it was banned over compliance issues. X met the country's legal demands, including appointing a legal representative, blocking specific accounts, and paying fines, ensuring adherence to Brazilian laws.","content":"The Brazilian Supreme Court's Justice Alexandre de Moraes on Tuesday authorized the restoration of social media platform X's service in Brazil, over a month after its nationwide shutdown, according to a court document that was made public. Elon Musk's X was blocked on Aug. 30 in the highly online country of 213 million people - and one of X's biggest markets, with estimates of its user base ranging from 20 to 40 million. De Moraes ordered the shutdown after a monthslong dispute with Musk over free speech, far-right accounts and misinformation. Musk had disparaged de Moraes, calling him an authoritarian and a censor, even though his rulings, including X's suspension, were repeatedly upheld by his peers. Despite Musk's public bravado, X ultimately complied with all of de Moraes' demands. They included blocking certain accounts from the platform, paying outstanding fines and naming a legal representative in the country. Failure to do the latter had triggered the suspension. \"The resumption of (X)'s activities on national territory was conditioned, solely, on full compliance with Brazilian laws and absolute observance of the Judiciary's decisions, out of respect for national sovereignty,\" de Moraes said in the court document. X did not immediately respond to a request for comment.","cleaned_content":"the brazilian supreme courts justice alexandre de moraes on tuesday authorized the restoration of social media platform xs service in brazil over a month after its nationwide shutdown according to a court document that was made public elon musks x was blocked on aug \u003cTHREE_TEN\u003e in the highly online country of \u003cTWO_HUNDRED\u003e million people and one of xs biggest markets with estimates of its user base ranging from \u003cTWO_TEN\u003e to \u003cFOUR_TEN\u003e million de moraes ordered the shutdown after a monthslong dispute with musk over free speech far right accounts and misinformation musk had disparaged de moraes calling him an authoritarian and a censor even though his rulings including xs suspension were repeatedly upheld by his peers despite musks public bravado x ultimately complied with all of de moraes demands they included blocking certain accounts from the platform paying outstanding fines and naming a legal representative in the country failure to do the latter had triggered the suspension the resumption of x s activities on national territory was conditioned solely on full compliance with brazilian laws and absolute observance of the judiciarys decisions out of respect for national sovereignty de moraes said in the court document x did not immediately respond to a request for comment","timestamp":"2024-10-09T07:34:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}