{"url":"https://economictimes.indiatimes.com/tech/technology/indonesia-asks-apple-google-to-block-chinas-temu-to-protect-small-merchants/articleshow/114189976.cms","title":"Indonesia asks Apple, Google to block China's Temu to protect small merchants","description":"The move was intended to pre-emptively protect the country's small and medium-sized businesses against cheap products being offered by PDD Holdings' Temu, communications minister Budi Arie Setiadi told Reuters, even though authorities have not found any transactions yet by its residents on the platform.","content":"Indonesia has asked Alphabet's Google and Apple to block Chinese fast fashion e-commerce firm Temu in their application stores in the country so it cannot be downloaded, a minister said on Friday. The move was intended to pre-emptively protect the country's small and medium-sized businesses against cheap products being offered by PDD Holdings' Temu, communications minister Budi Arie Setiadi told Reuters, even though authorities have not found any transactions yet by its residents on the platform. Temu's rapid growth has triggered scrutiny over its low-cost business model of sending parcels to customers from China by several countries. Temu's business model, which connects consumers directly with factories in China in order to significantly reduce prices, is \"unhealthy competition,\" Budi said. \"We're not here to protect e-commerce, but we protect small and medium enterprises. There are millions we must protect,\" the minister said.","cleaned_content":"indonesia has asked alphabets google and apple to block chinese fast fashion e commerce firm temu in their application stores in the country so it cannot be downloaded a minister said on friday the move was intended to pre emptively protect the countrys small and medium sized businesses against cheap products being offered by pdd holdings temu communications minister budi arie setiadi told reuters even though authorities have not found any transactions yet by its residents on the platform temus rapid growth has triggered scrutiny over its low cost business model of sending parcels to customers from china by several countries temus business model which connects consumers directly with factories in china in order to significantly reduce prices is unhealthy competition budi said were not here to protect e commerce but we protect small and medium enterprises there are millions we must protect the minister said","timestamp":"2024-10-13T17:04:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}