{"url":"https://economictimes.indiatimes.com/tech/technology/teslas-robotaxi-event-was-long-on-musk-promises-investors-wanted-more-details-/articleshow/114167002.cms","title":"Tesla's robotaxi event was long on Musk promises. Investors wanted more details.","description":"Elon Musk said the company would start building the fully autonomous Cybercab by 2026 at a price of less than $30,000, and showed off a robovan capable of transporting 20 people around town - which he said would reshape cities by \"turning parking lots into parks.\"","content":"For a businessman who perpetually struggles with broken promises, Elon Musk gave himself quite a to-do list Thursday night at Tesla's long-awaited Hollywood unveiling of its driverless robotaxis. His slew of announcements during a 20-minute presentation were short on practical details, which pushed the stock to close nearly 9% lower at $217.80 on Friday. After traversing the fake streets of the Warner Bros movie studio set in a sleek, silver two-door \"Cybercab\" prototype, he promised that the company's popular Model 3 and Model Y vehicles would be able to operate without driver supervision in California and Texas by next year. Musk said the company would start building the fully autonomous Cybercab by 2026 at a price of less than $30,000, and showed off a robovan capable of transporting 20 people around town - which he said would reshape cities by \"turning parking lots into parks.\" Later came the dancing humanoid robots that also mixed drinks at the bar, which Musk said Tesla will also eventually sell for $20,000 to $30,000 a piece. \"I think this will be the biggest product ever, of any kind,\" he declared.","cleaned_content":"for a businessman who perpetually struggles with broken promises elon musk gave himself quite a to do list thursday night at teslas long awaited hollywood unveiling of its driverless robotaxis his slew of announcements during a \u003cTWO_TEN\u003e minute presentation were short on practical details which pushed the stock to close nearly \u003cNINE_PERCENT\u003e lower at \u003cTWO_HUNDRED\u003e on friday after traversing the fake streets of the warner bros movie studio set in a sleek silver two door cybercab prototype he promised that the companys popular model \u003cTHREE_\u003e and model y vehicles would be able to operate without driver supervision in california and texas by next year musk said the company would start building the fully autonomous cybercab by \u003cTWO_THOUSAND\u003e at a price of less than \u003cTHREE_TEN_THOUSAND\u003e and showed off a robovan capable of transporting \u003cTWO_TEN\u003e people around town which he said would reshape cities by turning parking lots into parks later came the dancing humanoid robots that also mixed drinks at the bar which musk said tesla will also eventually sell for \u003cTWO_TEN_THOUSAND\u003e to \u003cTHREE_TEN_THOUSAND\u003e a piece i think this will be the biggest product ever of any kind he declared","timestamp":"2024-10-12T13:04:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}