{"url":"https://economictimes.indiatimes.com/tech/technology/taiwanese-employees-of-apple-supplier-detained-in-china/articleshow/114162251.cms","title":"Taiwanese employees of Apple supplier detained in China","description":"The police in Zhengzhou, China, had accused each of the four Taiwanese workers of an offense comparable to Taiwan's \"crime of breach of trust,\" according to a statement Thursday from Taiwan's Mainland Affairs Council.","content":"Chinese authorities have detained four employees of Foxconn, the Taiwanese manufacturer that makes Apple iPhones, Taiwan said, in the latest incident involving government scrutiny of the private sector in mainland China. The police in Zhengzhou, China, had accused each of the four Taiwanese workers of an offense comparable to Taiwan's \"crime of breach of trust,\" according to a statement Thursday from Taiwan's Mainland Affairs Council. The council described Foxconn as saying that \"the company did not suffer any losses, and the four employees also did not harm the company's interests.\" The statement from the Taiwan government added that the detentions could have been the result of \"corruption and abuse of power\" by law enforcement officers. It was not clear what jobs the Foxconn employees performed. Foxconn, one of the world's largest manufacturers of consumer electronics, plays a central role in making iPhones and other products for Apple. Foxconn declined to comment.","cleaned_content":"chinese authorities have detained four employees of foxconn the taiwanese manufacturer that makes apple iphones taiwan said in the latest incident involving government scrutiny of the private sector in mainland china the police in zhengzhou china had accused each of the four taiwanese workers of an offense comparable to taiwans crime of breach of trust according to a statement thursday from taiwans mainland affairs council the council described foxconn as saying that the company did not suffer any losses and the four employees also did not harm the companys interests the statement from the taiwan government added that the detentions could have been the result of corruption and abuse of power by law enforcement officers it was not clear what jobs the foxconn employees performed foxconn one of the worlds largest manufacturers of consumer electronics plays a central role in making iphones and other products for apple foxconn declined to comment","timestamp":"2024-10-12T08:02:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}