{"url":"https://economictimes.indiatimes.com/tech/technology/decoding-promise-of-new-direct-to-cell-satcom-technology/articleshow/114142769.cms","title":"Decoding promise of new direct-to-cell satcom technology","description":"Earlier this week, the US FCC allowed Musk's Starlink to provide emergency direct-to-cell satellite connectivity in North Carolina, showcasing a significant advancement in telecom technology. This service operates via satellites and aims to connect remote or disaster-affected regions. It's yet to be available in India due to pending regulations.","content":"Earlier this week, the US Federal Communications Commission (FCC) allowed Elon Musk’s Starlink to provide emergency direct-to-cell satellite connectivity to restore fast broadband coverage in parts of North Carolina devastated by Hurricane Helene. This latest technology advancement has been creating ripples in the global telecoms space. But how exactly does direct-to-cell satcom technology work? Can it be offered in India? Do rules around satellite connectivity allow this? ET looks at the next steps and possible regulatory challenges in implementing this breakthrough technology in emergency scenarios. How does direct-to-cell satcom tech work?The technology operates via satellites that beam signals to mobile phones on earth, enabling connectivity in remote locations with inadequate ground towers, or where on-ground telecom infrastructure has been damaged by natural disasters. The satellites operate as cell towers in space and connect with smartphones trying to communicate with them. The satellites, in turn, are plugged on to each other via a laser backhaul technology.The Global ScenarioElon Musk’s Starlink has satellites in space that can directly beam phone signals to smartphones. Apple Inc., too, has announced a 'direct-to-handset emergency SOS via satellite’ feature using US satellite player Globalstar’s mobile satellite services network. The feature has been available to users of the iPhone 14 and 15 family of devices in some countries. Apple has also expanded the satellite connectivity option on iPhones with the latest operating system and users in some countries will be able to send and receive messages via satellite in case there is no terrestrial or Wi-Fi coverage.San Diego-based smartphone chip maker Qualcomm Inc. has been exploring the feasibility of potential technology solutions like narrow-band NTN (non-terrestrial networks) that can make it possible for mobile devices to talk to satellite systems, and in turn, offer fast wireless broadband connectivity to people outside the coverage area of terrestrial networks.","cleaned_content":"earlier this week the us federal communications commission fcc allowed elon musk s starlink to provide emergency direct to cell satellite connectivity to restore fast broadband coverage in parts of north carolina devastated by hurricane helene this latest technology advancement has been creating ripples in the global telecoms space but how exactly does direct to cell satcom technology work can it be offered in india do rules around satellite connectivity allow this et looks at the next steps and possible regulatory challenges in implementing this breakthrough technology in emergency scenarios how does direct to cell satcom tech work the technology operates via satellites that beam signals to mobile phones on earth enabling connectivity in remote locations with inadequate ground towers or where on ground telecom infrastructure has been damaged by natural disasters the satellites operate as cell towers in space and connect with smartphones trying to communicate with them the satellites in turn are plugged on to each other via a laser backhaul technology the global scenarioelon musk s starlink has satellites in space that can directly beam phone signals to smartphones apple inc too has announced a direct to handset emergency sos via satellite feature using us satellite player globalstar s mobile satellite services network the feature has been available to users of the iphone \u003cONE_TEN\u003e and \u003cONE_TEN\u003e family of devices in some countries apple has also expanded the satellite connectivity option on iphones with the latest operating system and users in some countries will be able to send and receive messages via satellite in case there is no terrestrial or wi fi coverage san diego based smartphone chip maker qualcomm inc has been exploring the feasibility of potential technology solutions like narrow band ntn non terrestrial networks that can make it possible for mobile devices to talk to satellite systems and in turn offer fast wireless broadband connectivity to people outside the coverage area of terrestrial networks","timestamp":"2024-10-11T08:52:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}