{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-gains-market-share-amid-festive-season-sale/articleshow/114246720.cms","title":"Ola Electric gains market share amid festive season sale","description":"The Bengaluru-based company, in an exchange filing, attributed the gain in market share to the popularity of its S1 scooter portfolio and its expanding service network. Ola aims to maintain this momentum through the festive season leading up to Diwali.","content":"Electric two-wheeler maker Ola Electric said its market share increased in the electric two-wheeler segment in the ongoing festive season.According to data from government-owned vehicle registration platform Vahan, as of October 15, Ola sold 17,417 electric two-wheelers this month, capturing a 34.9% market share, up from 28.7% the entire last month.The Bengaluru-based company, in an exchange filing, attributed the gain in market share to the popularity of its S1 scooter portfolio and its expanding service network. Ola aims to maintain this momentum through the festive season leading up to Diwali.As of 3 PM, the shares of Ola Electric were trading at Rs 89.5 on the BSE.Ola's premium S1 offerings, the S1 Pro and S1 Air, are priced at Rs 1,34,999 and Rs 1,07,499, respectively. Its mass-market S1 X portfolio, which includes models with 2 kilowatt-hour (kWh), 3 kWh, and 4 kWh battery options, is priced at Rs 74,999, Rs 87,999, and Rs 1,01,999, respectively.","cleaned_content":"electric two wheeler maker ola electric said its market share increased in the electric two wheeler segment in the ongoing festive season according to data from government owned vehicle registration platform vahan as of october \u003cONE_TEN\u003e ola sold \u003cONE_TEN_THOUSAND\u003e electric two wheelers this month capturing a \u003cTHREE_TEN_PERCENT\u003e market share up from \u003cTWO_TEN_PERCENT\u003e the entire last month the bengaluru based company in an exchange filing attributed the gain in market share to the popularity of its s1 scooter portfolio and its expanding service network ola aims to maintain this momentum through the festive season leading up to diwali as of \u003cTHREE_\u003e pm the shares of ola electric were trading at rs \u003cEIGHT_TEN\u003e on the bse olas premium s1 offerings the s1 pro and s1 air are priced at rs \u003cONE_HUNDRED_THOUSAND\u003e and rs \u003cONE_HUNDRED_THOUSAND\u003e respectively its mass market s1 x portfolio which includes models with \u003cTWO_\u003e kilowatt hour kwh \u003cTHREE_\u003e kwh and \u003cFOUR_\u003e kwh battery options is priced at rs \u003cSEVEN_TEN_THOUSAND\u003e rs \u003cEIGHT_TEN_THOUSAND\u003e and rs \u003cONE_HUNDRED_THOUSAND\u003e respectively","timestamp":"2024-10-15T15:36:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}