{"url":"https://economictimes.indiatimes.com/tech/technology/gcc-consultant-ansr-buys-majority-stake-in-summit-consulting-services/articleshow/114235300.cms","title":"GCC consultant ANSR buys majority stake in Summit Consulting Services","description":"ANSR acquires a majority stake in Summit Consulting Services for Rs 45-65 crore ($5-8 million). This acquisition aims to expand its solutions for mid-sized global capability centres (GCCs) in India. Summit will continue independent operations while its founder joins ANSR's leadership team.","content":"ANSR, a consultancy that helps multinational companies set up global capability centres (GCCs) in India, has acquired a majority stake in Bengaluru-based Summit Consulting Services for Rs 45-65 crore ($5-8 million) in a cash and stock deal.The acquisition will help ANSR expand its solutions to mid-sized GCCs as they scale operations, ANSR cofounder Vikram Ahuja said.Summit Consulting will continue to maintain independent operations and serve its customers with its 45-50 employees in the company, according to people associated with the firm. Sandeep Sharma, founder and chief executive of Summit Consulting, will join the leadership team of ANSR.Founded in 2020, Summit Consulting specialises in building global centres for growth-stage, mid-sized and private equity-backed organisations. It has various models of operations including Basecamp, India's first GCC incubator at T-Hub, Hyderabad.Mid-sized firms are driving a post-Covid GCC boom in India, launching more than 240 such facilities, comprising 60% of all new GCCs today, ANSR data show. “This rapid expansion underscores the strong confidence business leaders and investors have in the strategic value these centres offer,” Ahuja said.","cleaned_content":"ansr a consultancy that helps multinational companies set up global capability centres gccs in india has acquired a majority stake in bengaluru based summit consulting services for rs \u003cFOUR_TEN\u003e \u003cSIX_TEN\u003e crore \u003cFIVE_\u003e \u003cEIGHT_\u003e million in a cash and stock deal the acquisition will help ansr expand its solutions to mid sized gccs as they scale operations ansr cofounder vikram ahuja said summit consulting will continue to maintain independent operations and serve its customers with its \u003cFOUR_TEN\u003e \u003cFIVE_TEN\u003e employees in the company according to people associated with the firm sandeep sharma founder and chief executive of summit consulting will join the leadership team of ansr founded in \u003cTWO_THOUSAND\u003e summit consulting specialises in building global centres for growth stage mid sized and private equity backed organisations it has various models of operations including basecamp indias first gcc incubator at t hub hyderabad mid sized firms are driving a post covid gcc boom in india launching more than \u003cTWO_HUNDRED\u003e such facilities comprising \u003cSIX_TEN_PERCENT\u003e of all new gccs today ansr data show this rapid expansion underscores the strong confidence business leaders and investors have in the strategic value these centres offer ahuja said","timestamp":"2024-10-15T09:32:00+05:30","market_timestamp":"2024-10-15T09:32:00+05:30","off_market_hours":false}