{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-adds-30-more-days-for-employees-to-work-remotely/articleshow/114240969.cms","title":"Wipro allows extra 30 days of remote work","description":"Wipro has introduced a new hybrid work policy, allowing employees to work remotely for an additional 30 days per year starting October 1. This extension accommodates employees with health issues or caregiving responsibilities, emphasizing a balanced approach between well-being and high performance.","content":"Months after mandating a hybrid work culture for its employees to work from office thrice a week, Wipro now has expanded its hybrid work culture to allow employees to work for an extra 30 days remotely in a year. Sources told ET that effective October 1, Wipro brought in a new hybrid work rule wherein employees can work for 30 days remotely in a year, subject to approval of superiors. The expanded scope for remote working can be availed by employees in case they are not well or in the case of they providing care to their loved ones. Fifteen days of remote working option can be availed by employees if they are not well, and an additional 15 days can be taken by Wipro employees who are giving care to family . On Monday, Wipro chief human resources officer, Saurabh Govil also wrote on LinkedIn, “I am proud to share with you the new hybrid work policy we have recently introduced. At Wipro, we have taken a modern approach to the future of work – one that focuses equally on well-being of our associates while being a high performing culture, driven by collaboration”.While not being explicit, he added, “Life's unpredictability may need additional support. We commit to accommodate special needs of our associates, as they tide over moments that matter or require reasonable accommodation.”","cleaned_content":"months after mandating a hybrid work culture for its employees to work from office thrice a week wipro now has expanded its hybrid work culture to allow employees to work for an extra \u003cTHREE_TEN\u003e days remotely in a year sources told et that effective october \u003cONE_\u003e wipro brought in a new hybrid work rule wherein employees can work for \u003cTHREE_TEN\u003e days remotely in a year subject to approval of superiors the expanded scope for remote working can be availed by employees in case they are not well or in the case of they providing care to their loved ones fifteen days of remote working option can be availed by employees if they are not well and an additional \u003cONE_TEN\u003e days can be taken by wipro employees who are giving care to family on monday wipro chief human resources officer saurabh govil also wrote on linkedin i am proud to share with you the new hybrid work policy we have recently introduced at wipro we have taken a modern approach to the future of work one that focuses equally on well being of our associates while being a high performing culture driven by collaboration while not being explicit he added lifes unpredictability may need additional support we commit to accommodate special needs of our associates as they tide over moments that matter or require reasonable accommodation","timestamp":"2024-10-15T16:08:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}