{"url":"https://economictimes.indiatimes.com/tech/technology/google-introduces-new-anti-theft-features-for-android-devices/articleshow/114014058.cms","title":"Google introduces new anti-theft features for Android devices","description":"Google is enhancing security for Android users by introducing new anti-theft features aimed at protecting personal data in the event of a stolen device.","content":"Google is enhancing security for Android users by introducing new anti-theft features aimed at protecting personal data in the event of a stolen device.According to GSM Arena, the updates include the Theft Detection Lock, Offline Device Lock, and an improved Remote Lock function, with the first two being new functionalities announced earlier this year.The Theft Detection Lock utilizes artificial intelligence along with the device's sensors to identify common theft-related motions.For instance, if someone snatches the phone from a user's hand and attempts to flee, the feature will automatically lock the device, restricting access to all applications and data. Additionally, it can recognize movements typically associated with theft while riding a bike or in a car, as per GSM Arena.","cleaned_content":"google is enhancing security for android users by introducing new anti theft features aimed at protecting personal data in the event of a stolen device according to gsm arena the updates include the theft detection lock offline device lock and an improved remote lock function with the first two being new functionalities announced earlier this year the theft detection lock utilizes artificial intelligence along with the devices sensors to identify common theft related motions for instance if someone snatches the phone from a users hand and attempts to flee the feature will automatically lock the device restricting access to all applications and data additionally it can recognize movements typically associated with theft while riding a bike or in a car as per gsm arena","timestamp":"2024-10-07T16:53:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}