{"url":"https://economictimes.indiatimes.com/tech/technology/us-sec-gives-green-light-for-options-listing-for-spot-bitcoin-etfs-to-nyse/articleshow/114369200.cms","title":"US SEC gives green light for options listing for spot bitcoin ETFs to NYSE","description":"The Securities and Exchange Commission (SEC) had in January approved the bitcoin ETFs to track bitcoin, in what was a watershed for the world's largest cryptocurrency and the broader crypto industry.","content":"The US securities regulator has granted \"accelerated approval\" to 11 exchange-traded funds to list and trade options tied to spot bitcoin prices on the New York Stock Exchange, according to a regulatory filing.  The Securities and Exchange Commission (SEC) had in January approved the bitcoin ETFs to track bitcoin, in what was a watershed for the world's largest cryptocurrency and the broader crypto industry. Fidelity Wise Origin Bitcoin Fund, the ARK21Shares Bitcoin ETF, the Invesco Galaxy Bitcoin ETF, the Grayscale Bitcoin Trust BTC and the iShares Bitcoin Trust ETF are among funds that received the approval on Friday.  The index options - listed derivatives offering a quick and inexpensive way to amplify exposure to bitcoin - on a bitcoin index would give institutional investors and traders an alternative way to hedge their exposure to the world's largest cryptocurrency.  Options are listed derivatives that give the holder the right to buy or sell an asset, such as a stock or exchange-traded product, at a predetermined price by a set date. ","cleaned_content":"the us securities regulator has granted accelerated approval to \u003cONE_TEN\u003e exchange traded funds to list and trade options tied to spot bitcoin prices on the new york stock exchange according to a regulatory filing the securities and exchange commission sec had in january approved the bitcoin etfs to track bitcoin in what was a watershed for the worlds largest cryptocurrency and the broader crypto industry fidelity wise origin bitcoin fund the ark21shares bitcoin etf the invesco galaxy bitcoin etf the grayscale bitcoin trust btc and the ishares bitcoin trust etf are among funds that received the approval on friday the index options listed derivatives offering a quick and inexpensive way to amplify exposure to bitcoin on a bitcoin index would give institutional investors and traders an alternative way to hedge their exposure to the worlds largest cryptocurrency options are listed derivatives that give the holder the right to buy or sell an asset such as a stock or exchange traded product at a predetermined price by a set date","timestamp":"2024-10-19T12:24:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}