{"url":"https://economictimes.indiatimes.com/tech/technology/samsung-workers-call-off-strike-tn-labour-dept/articleshow/114260868.cms","title":"Samsung workers call off strike: TN labour dept","description":"Under the agreements among the parties, workers would not be victimised for participating in the strike, the department said. Workers said they would cooperate with the management fully and would not do any such acts \"prejudicial to the interest of the management\".","content":"The Tamil Nadu Labour Welfare Department on Tuesday said the striking workers at Samsung’s factory at Sriperumbudur have agreed to end their strike following conciliation talks held between the company’s management and the workers.\"Both the parties have accepted this advice (to end the strike),\" the department said in a statement. \"The workers informed that they would call off the strike immediately and return to work. Thus, the strike at the Samsung factory has come to an end and all the workers are resuming work.\"Under the agreements among the parties, workers would not be victimised for participating in the strike, the department said. Workers said they would cooperate with the management fully and would not do any such acts \"prejudicial to the interest of the management\".The management would file a written reply to the charter of demands filed by the workers before the conciliation officer, the department said.Samsung workers have been holding a strike since September 9. The matter had escalated to the point where Tamil Nadu chief minister MK Stalin himself had instructed to resolve the strike amicably at the earliest.","cleaned_content":"the tamil nadu labour welfare department on tuesday said the striking workers at samsung s factory at sriperumbudur have agreed to end their strike following conciliation talks held between the company s management and the workers both the parties have accepted this advice to end the strike the department said in a statement the workers informed that they would call off the strike immediately and return to work thus the strike at the samsung factory has come to an end and all the workers are resuming work under the agreements among the parties workers would not be victimised for participating in the strike the department said workers said they would cooperate with the management fully and would not do any such acts prejudicial to the interest of the management the management would file a written reply to the charter of demands filed by the workers before the conciliation officer the department said samsung workers have been holding a strike since september \u003cNINE_\u003e the matter had escalated to the point where tamil nadu chief minister mk stalin himself had instructed to resolve the strike amicably at the earliest","timestamp":"2024-10-15T23:53:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}