{"url":"https://economictimes.indiatimes.com/tech/technology/indian-origin-executives-drive-ubers-global-tech-leadership-shakeup/articleshow/114309680.cms","title":"Indian origin executives drive Uber's global tech leadership shakeup","description":"Uber's  head of engineering for delivery Anirban Kundu will join its grocery delivery rival Instacart as chief technology officer, he announced in a LinkedIn post. Separately, Uber’s chief product officer and senior vice president of engineering Sundeep Jain – a former Google executive – has also stepped down after six years at the company.","content":"Ride-hailing and delivery platform Uber saw two top-level engineering executives move on from the San Francisco-based company on Wednesday. Interestingly, this top-level churn involves multiple Indian-origin executives.The company’s head of engineering for delivery Anirban Kundu will join its grocery delivery rival Instacart as chief technology officer, he announced in a LinkedIn post.   Separately, Uber’s chief product officer and senior vice president of engineering Sundeep Jain – a former Google executive – has also stepped down after six years at the company.“Sundeep has been a driving force behind so much of our growth. He is an outstanding technical leader, a brilliant thinker, and a rigorous analyst who has been key to scaling Uber into the global multi-product platform it has become,” Uber’s chief executive officer Dara Khosrowshahi said in a LinkedIn post announcing Jain’s departure and his replacement.","cleaned_content":"ride hailing and delivery platform uber saw two top level engineering executives move on from the san francisco based company on wednesday interestingly this top level churn involves multiple indian origin executives the company s head of engineering for delivery anirban kundu will join its grocery delivery rival instacart as chief technology officer he announced in a linkedin post separately uber s chief product officer and senior vice president of engineering sundeep jain a former google executive has also stepped down after six years at the company sundeep has been a driving force behind so much of our growth he is an outstanding technical leader a brilliant thinker and a rigorous analyst who has been key to scaling uber into the global multi product platform it has become uber s chief executive officer dara khosrowshahi said in a linkedin post announcing jain s departure and his replacement","timestamp":"2024-10-17T23:34:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}