{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-net-profit-rises-4-7-in-q2-misses-street-estimates/articleshow/114326215.cms","title":"Infosys net profit rises 4.7% in Q2, misses Street estimates","description":"Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh. “We see that continuing.”","content":"Infosys, India’s second-largest IT company, posted a 4.7% increase in September quarter net profit to Rs 6,506 crore, slightly below market estimates, from the year earlier. Some deal ramp-ups and an uptick in the key vertical of financial services lifted profit and revenue, which rose 5.1% from the year earlier and 4.2% from the preceding quarter, to Rs 40,986 crore.This also led the Bengaluru-based firm to marginally revise upward its full-year revenue guidance to 3.75%-4.50% in constant currency terms from 3-4% in July on the back of a market environment that has improved slightly. This follows a prolonged slowdown in demand due to macroeconomic uncertainty and geopolitical tensions. Net profit rose 2.2% sequentially. The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters.An ET poll of analysts had pegged net profit at Rs 6,170 crore and revenue at Rs 38,350 crore.Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh. “We see that continuing.”Financial services (FS) is the largest spender on technology and also the biggest contributor to the industry’s revenue. Parekh warned that other sectors are yet to start spending on discretionary or non-critical projects and said that most deals remain centred around driving cost efficiencies, a key indicator of stress in the economies of the developed world. His views were echoed by Srinivas Pallia, CEO of cross-town rival Wipro, which also announced September quarter earnings on Thursday.","cleaned_content":"infosys india s second largest it company posted a \u003cFOUR_PERCENT\u003e increase in september quarter net profit to rs \u003cSIX_THOUSAND\u003e crore slightly below market estimates from the year earlier some deal ramp ups and an uptick in the key vertical of financial services lifted profit and revenue which rose \u003cFIVE_PERCENT\u003e from the year earlier and \u003cFOUR_PERCENT\u003e from the preceding quarter to rs \u003cFOUR_TEN_THOUSAND\u003e crore this also led the bengaluru based firm to marginally revise upward its full year revenue guidance to \u003cTHREE_PERCENT\u003e \u003cFOUR_PERCENT\u003e in constant currency terms from \u003cTHREE_\u003e \u003cFOUR_PERCENT\u003e in july on the back of a market environment that has improved slightly this follows a prolonged slowdown in demand due to macroeconomic uncertainty and geopolitical tensions net profit rose \u003cTWO_PERCENT\u003e sequentially the guidance change is the sixth consecutive quarterly revision and seventh in eight quarters an et poll of analysts had pegged net profit at rs \u003cSIX_THOUSAND\u003e crore and revenue at rs \u003cTHREE_TEN_THOUSAND\u003e crore infosys is seeing a lot of traction in financial services which has given us good growth last quarter and this quarter said chief executive officer salil parekh we see that continuing financial services fs is the largest spender on technology and also the biggest contributor to the industry s revenue parekh warned that other sectors are yet to start spending on discretionary or non critical projects and said that most deals remain centred around driving cost efficiencies a key indicator of stress in the economies of the developed world his views were echoed by srinivas pallia ceo of cross town rival wipro which also announced september quarter earnings on thursday","timestamp":"2024-10-18T06:00:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}