{"url":"https://economictimes.indiatimes.com/tech/technology/retail-group-seeks-antitrust-probe-of-quick-commerce-companies-swiggy-blinkit-zepto/articleshow/114402097.cms","title":"Retail group seeks antitrust probe of quick commerce companies Swiggy, Blinkit, Zepto","description":"In a letter dated Oct. 18, All India Consumer Products Distributors Federation (AICPDF), which represents 400,000 retail distributors of major companies including Nestle and Hindustan Unilever, told the antitrust body quick commerce firms were practising predatory pricing - or offering deep discounts and selling below cost to lure customers.","content":"India's biggest group of retail distributors has asked the antitrust authority to investigate three quick commerce companies - Zomato's Blinkit, Swiggy and Zepto - for alleged predatory pricing, a letter showed on Sunday. Quick commerce is a new shopping rage in India, with companies promising deliveries of anything from groceries to electronics within 10 minutes, reshaping how Indians shop and challenging ecommerce giants such as Amazon. In a letter dated Oct. 18, All India Consumer Products Distributors Federation (AICPDF), which represents 400,000 retail distributors of major companies including Nestle and Hindustan Unilever, told the antitrust body quick commerce firms were practising predatory pricing - or offering deep discounts and selling below cost to lure customers.  Zomato's Blinkit, Zepto, and Swiggy, which runs the Instamart delivery service and is backed by SoftBank, did not respond to Reuters queries. The letter said several consumer goods companies were dealing directly with quick commerce firms to increase their reach, sidelining the traditional salespeople who for decades went from one shop to another to deliver orders.","cleaned_content":"indias biggest group of retail distributors has asked the antitrust authority to investigate three quick commerce companies zomatos blinkit swiggy and zepto for alleged predatory pricing a letter showed on sunday quick commerce is a new shopping rage in india with companies promising deliveries of anything from groceries to electronics within \u003cONE_TEN\u003e minutes reshaping how indians shop and challenging ecommerce giants such as amazon in a letter dated oct \u003cONE_TEN\u003e all india consumer products distributors federation aicpdf which represents \u003cFOUR_HUNDRED_THOUSAND\u003e retail distributors of major companies including nestle and hindustan unilever told the antitrust body quick commerce firms were practising predatory pricing or offering deep discounts and selling below cost to lure customers zomatos blinkit zepto and swiggy which runs the instamart delivery service and is backed by softbank did not respond to reuters queries the letter said several consumer goods companies were dealing directly with quick commerce firms to increase their reach sidelining the traditional salespeople who for decades went from one shop to another to deliver orders","timestamp":"2024-10-20T21:08:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}