{"url":"https://economictimes.indiatimes.com/tech/technology/licious-narrows-fy24-net-loss-by-44-revenue-down-8-to-rs-685-crore/articleshow/114285030.cms","title":"Licious narrows FY24 net loss by 44%, revenue down 8% to Rs 685 crore","description":"Bengaluru-based Licious attributed the revenue drop to the closure of distribution channels, especially Dunzo, along with a reduction in exposure to modern trade and local stores as the company started focusing more on owned channels.","content":"Meat and seafood home-delivery service Licious' parent company, Delightful Gourmet, said its losses narrowed 44% on year to Rs 294 crore in FY24, while revenue fell 8% to Rs 685 crore from Rs 748 crore a year earlier.The Bengaluru-based firm attributed the revenue drop to the closure of distribution channels, especially Dunzo, along with a reduction in exposure to modern trade and local stores as the company started focusing more on owned channels. The losses resulting from the shutdown of Dunzo and Swiggy Meatstore were balanced out by a 35% year-on-year growth in quick commerce deliveries, the company said on Wednesday. Temasek-backed Licious expects to reach earnings before interest, taxes, depreciation and amortisation (Ebitda) breakeven, or achieve profitability in FY25, as it is actively expanding its offline store presence.Licious is now doubling down on building an omnichannel network and plans to open 500 offline stores in key markets over the next few years.","cleaned_content":"meat and seafood home delivery service licious parent company delightful gourmet said its losses narrowed \u003cFOUR_TEN_PERCENT\u003e on year to rs \u003cTWO_HUNDRED\u003e crore in fy24 while revenue fell \u003cEIGHT_PERCENT\u003e to rs \u003cSIX_HUNDRED\u003e crore from rs \u003cSEVEN_HUNDRED\u003e crore a year earlier the bengaluru based firm attributed the revenue drop to the closure of distribution channels especially dunzo along with a reduction in exposure to modern trade and local stores as the company started focusing more on owned channels the losses resulting from the shutdown of dunzo and swiggy meatstore were balanced out by a \u003cTHREE_TEN_PERCENT\u003e year on year growth in quick commerce deliveries the company said on wednesday temasek backed licious expects to reach earnings before interest taxes depreciation and amortisation ebitda breakeven or achieve profitability in fy25 as it is actively expanding its offline store presence licious is now doubling down on building an omnichannel network and plans to open \u003cFIVE_HUNDRED\u003e offline stores in key markets over the next few years","timestamp":"2024-10-16T19:42:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}