{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firm-zensars-profits-slide-11-5-yoy-revenue-up-5-4/articleshow/114468062.cms","title":"IT firm Zensar's profits slide 11.5% YoY, revenue up 5.4%","description":"Zensar Technologies reported a mixed bag of results for the second quarter. While revenue increased, profits declined due to a slump in the TMT vertical and US region. Despite this, the company's order book and margins improved.","content":"Mid-tier technology services firm Zensar Technologies reported a decline in net profit by 11.5% year-on-year (YoY) and 1.3% quarter-on-quarter (QoQ) at Rs 155.7 crore for the second quarter ending September of fiscal year 2025 (Q2FY25). The profit was impacted by a dent in the Telecommunication, Media and Technology (TMT) vertical and US region due to non-seasonal furloughs.The Pune-based company’s revenue increased 5.4% YoY to Rs 1,308 crore in Q2FY25, which was up 1.6% on a sequential basis.In dollar terms, the company’s revenue rose 4% YoY and 3.3% in constant currency terms to $156.2 million in Q2FY25.“We delivered a rounded positive performance in Q2FY25, with sequential growth in majority of our portfolio. Our highest ever order book this quarter reflects the continued focus on client-centricity and commitment of our employees to drive value and innovations,” said Manish Tandon, CEO and managing director at Zensar Technologies.","cleaned_content":"mid tier technology services firm zensar technologies reported a decline in net profit by \u003cONE_TEN_PERCENT\u003e year on year yoy and \u003cONE_PERCENT\u003e quarter on quarter qoq at rs \u003cONE_HUNDRED\u003e crore for the second quarter ending september of fiscal year \u003cTWO_THOUSAND\u003e q2fy25 the profit was impacted by a dent in the telecommunication media and technology tmt vertical and us region due to non seasonal furloughs the pune based company s revenue increased \u003cFIVE_PERCENT\u003e yoy to rs \u003cONE_THOUSAND\u003e crore in q2fy25 which was up \u003cONE_PERCENT\u003e on a sequential basis in dollar terms the company s revenue rose \u003cFOUR_PERCENT\u003e yoy and \u003cTHREE_PERCENT\u003e in constant currency terms to \u003cONE_HUNDRED\u003e million in q2fy25 we delivered a rounded positive performance in q2fy25 with sequential growth in majority of our portfolio our highest ever order book this quarter reflects the continued focus on client centricity and commitment of our employees to drive value and innovations said manish tandon ceo and managing director at zensar technologies","timestamp":"2024-10-22T18:56:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}