{"url":"https://economictimes.indiatimes.com/tech/technology/karnataka-to-create-deep-tech-innovation-cluster-in-bengaluru-it-bt-minister-kharge/articleshow/114333793.cms","title":"Karnataka to create deep-tech innovation cluster in Bengaluru: IT-BT minister Kharge","description":"Aiming to address the gaps in core deep-tech areas in the country, such as artificial intelligence and machine learning, robotics and automation, quantum computing, and biotechnology, the IT-BT minister emphasized that the acceleration India needs in deep tech will take place from Karnataka.","content":"Karnataka's IT–BT minister, Priyank Kharge, plans to propose a deep-tech innovation cluster in Bengaluru which will create a conducive environment for deep-tech startups to thrive. With the 2025 state budget slated to be announced in March, Kharge has sought the ecosystem’s help to come up with a framework next month.“The Karnataka Digital Economy Mission and NASSCOM should collaborate and establish a deep-tech innovation cluster in Bengaluru,” the minister said, adding that they should find the right institutional partners and think tanks to formulate a framework by the Bengaluru Tech Summit. “It is my job to ensure that when the Chief Minister announces the budget in March 2025, the cluster will be on top of the list,” Kharge said at NASSCOM’s Future Forge 2024 event held on Wednesday.He also highlighted Karnataka’s thriving deep-tech ecosystem, with over 250 startups that attracted more than USD 1.5 billion in investment during 2023, creating close to 10,000 jobs. ","cleaned_content":"karnatakas it bt minister priyank kharge plans to propose a deep tech innovation cluster in bengaluru which will create a conducive environment for deep tech startups to thrive with the \u003cTWO_THOUSAND\u003e state budget slated to be announced in march kharge has sought the ecosystem s help to come up with a framework next month the karnataka digital economy mission and nasscom should collaborate and establish a deep tech innovation cluster in bengaluru the minister said adding that they should find the right institutional partners and think tanks to formulate a framework by the bengaluru tech summit it is my job to ensure that when the chief minister announces the budget in march \u003cTWO_THOUSAND\u003e the cluster will be on top of the list kharge said at nasscom s future forge \u003cTWO_THOUSAND\u003e event held on wednesday he also highlighted karnataka s thriving deep tech ecosystem with over \u003cTWO_HUNDRED\u003e startups that attracted more than usd \u003cONE_\u003e billion in investment during \u003cTWO_THOUSAND\u003e creating close to \u003cONE_TEN_THOUSAND\u003e jobs","timestamp":"2024-10-18T08:47:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}