{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firm-persistent-systems-q2-profit-up-23-4-to-rs-325-crore/articleshow/114468623.cms","title":"IT firm Persistent Systems Q2 profit up 23.4% to Rs 325 crore","description":"The company's revenue from its core businesses remained stable, while sectors like healthcare and life sciences saw significant growth. Despite a slight decline in employee count, the company's deal momentum picked up, with total contract value reaching $529 million.","content":"Pune-based mid-tier IT firm Persistent Systems on Tuesday reported a 23.4% jump in net profit for the second quarter of ongoing fiscal year ending September at Rs 325 crore. The profit was at Rs 263.27 crore in the September quarter last year.Revenue for the three-month period increased 20.1% to Rs 2,897.15 crore from Rs 2,411.6 crore in the same quarter a year ago.Sequentially, the July to September quarter profit grew 6.1% from Rs 306.41 crore, while revenue rose 5.8% from Rs 2,737.17 crore in the June quarter.In dollar terms, revenue was up 18.4% YoY and 5.3% quarter-on-quarter (QoQ) to $345.5 million. The company said it reported an 18th sequential quarter of revenue growth.“We are proud to announce the 18th sequential quarter of revenue growth... This quarter, we continued to strengthen our capabilities and advance our AI-led, platform driven services strategy. We brought on Starfish Associates to elevate our AI-powered contact center modernization; the addition of Arrka expands our comprehensive offerings in digital governance, including data privacy, AI governance, and cybersecurity,” said Sandeep Kalra, chief executive officer and executive director of the company.","cleaned_content":"pune based mid tier it firm persistent systems on tuesday reported a \u003cTWO_TEN_PERCENT\u003e jump in net profit for the second quarter of ongoing fiscal year ending september at rs \u003cTHREE_HUNDRED\u003e crore the profit was at rs \u003cTWO_HUNDRED\u003e crore in the september quarter last year revenue for the three month period increased \u003cTWO_TEN_PERCENT\u003e to rs \u003cTWO_THOUSAND\u003e crore from rs \u003cTWO_THOUSAND\u003e crore in the same quarter a year ago sequentially the july to september quarter profit grew \u003cSIX_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore while revenue rose \u003cFIVE_PERCENT\u003e from rs \u003cTWO_THOUSAND\u003e crore in the june quarter in dollar terms revenue was up \u003cONE_TEN_PERCENT\u003e yoy and \u003cFIVE_PERCENT\u003e quarter on quarter qoq to \u003cTHREE_HUNDRED\u003e million the company said it reported an \u003cONE_TEN\u003e th sequential quarter of revenue growth we are proud to announce the \u003cONE_TEN\u003e th sequential quarter of revenue growth this quarter we continued to strengthen our capabilities and advance our ai led platform driven services strategy we brought on starfish associates to elevate our ai powered contact center modernization the addition of arrka expands our comprehensive offerings in digital governance including data privacy ai governance and cybersecurity said sandeep kalra chief executive officer and executive director of the company","timestamp":"2024-10-22T19:12:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}