{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-reports-7-7-rise-in-profit/articleshow/114326562.cms","title":"LTIMindtree reports 7.7% rise in profit","description":"The Mumbai-headquartered IT services company reported a 5.9% growth in consolidated revenues at Rs 9,432.9 crore in Q2FY25 as compared with Rs 8905.4 crore in Q2FY24 and 3.2% rise from Rs 9142.6 crore in Q1FY25.","content":"LTIMindtree, sixth largest Indian IT services company reported a 7.7% year-on-year (YoY) rise in net profit at Rs 1251.6 crore. The profit compares with Rs 1,162 crore in September last year. Sequentially, profit grew 10.3% from Rs 1,135 crore.The Mumbai-headquartered IT services company reported a 5.9% growth in consolidated revenues at Rs 9,432.9 crore in Q2FY25 as compared with Rs 8905.4 crore in Q2FY24 and 3.2% rise from Rs 9142.6 crore in Q1FY25.In dollar terms, the revenue was up by 4.7% YoY at $1.13 billion, and on a quarter-on-quarter basis rose by 2.8%.\"Q2 was a good quarter marked by broad-based sequential growth experienced across all our verticals and geographies... We had several multi-year deal closures, including a $200 million plus deal. Continued deal momentum in key verticals and significant Q2 hiring, including freshers, positions us well as we enter into the latter half of the fiscal year,\" said Debashis Chatterjee, chief executive officer and managing director.","cleaned_content":"ltimindtree sixth largest indian it services company reported a \u003cSEVEN_PERCENT\u003e year on year yoy rise in net profit at rs \u003cONE_THOUSAND\u003e crore the profit compares with rs \u003cONE_THOUSAND\u003e crore in september last year sequentially profit grew \u003cONE_TEN_PERCENT\u003e from rs \u003cONE_THOUSAND\u003e crore the mumbai headquartered it services company reported a \u003cFIVE_PERCENT\u003e growth in consolidated revenues at rs \u003cNINE_THOUSAND\u003e crore in q2fy25 as compared with rs \u003cEIGHT_THOUSAND\u003e crore in q2fy24 and \u003cTHREE_PERCENT\u003e rise from rs \u003cNINE_THOUSAND\u003e crore in q1fy25 in dollar terms the revenue was up by \u003cFOUR_PERCENT\u003e yoy at \u003cONE_\u003e billion and on a quarter on quarter basis rose by \u003cTWO_PERCENT\u003e q2 was a good quarter marked by broad based sequential growth experienced across all our verticals and geographies we had several multi year deal closures including a \u003cTWO_HUNDRED\u003e million plus deal continued deal momentum in key verticals and significant q2 hiring including freshers positions us well as we enter into the latter half of the fiscal year said debashis chatterjee chief executive officer and managing director","timestamp":"2024-10-18T06:05:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}