{"url":"https://economictimes.indiatimes.com/tech/technology/karnataka-to-use-tech-solutions-to-address-water-sanitation/articleshow/114334127.cms","title":"Karnataka to use tech solutions to address water \u0026 sanitation","description":"IT-BT and RDPR minister Priyank Kharge said, “I intend to make Karnataka a water-secure state in the country. If I can solve this using deep tech in biotechnology or IT that ensures we get better portability, the government itself can become your (companies') first client.” He added that the government can help startups pilot these solutions within a sandbox environment and provide capital.","content":"The Karnataka government is looking to address water and sanitation issues in rural areas through the adoption of innovative ideas and relevant technologies. The IT-BT and Rural Development and Panchayat Raj (RDPR) departments will host a ‘Karnataka Rural Water and Sanitation Sustainability Summit’ on October 29 and have invited startups to provide solutions. The event will feature a pitching session where selected startups can present their ideas, with winners receiving a minimum funding of Rs 25 lakhs.These budding startups will also have the opportunity to pilot their projects with the government, the department announced in a release. Entrepreneurs, academia, startups, and researchers can submit their potential pitch decks by October 23.IT-BT and RDPR minister Priyank Kharge said, “I intend to make Karnataka a water-secure state in the country. If I can solve this using deep tech in biotechnology or IT that ensures we get better portability, the government itself can become your (companies') first client.” He added that the government can help startups pilot these solutions within a sandbox environment and provide capital.“Organisations that have existing products or prototypes that tackle specific problems like water purification, waste management, or sanitation infrastructure are eligible. Companies able to demonstrate a viable business model, sustainability plan, and measurable impact on rural communities are also welcome,” the guidelines read.The problem statement for the summit includes inconsistent water availability, over-reliance on groundwater, and water contamination, which pose serious health risks. The North Karnataka region also struggles with inadequate waste segregation, ineffective dry waste management, and insufficient infrastructure for menstrual waste disposal.","cleaned_content":"the karnataka government is looking to address water and sanitation issues in rural areas through the adoption of innovative ideas and relevant technologies the it bt and rural development and panchayat raj rdpr departments will host a karnataka rural water and sanitation sustainability summit on october \u003cTWO_TEN\u003e and have invited startups to provide solutions the event will feature a pitching session where selected startups can present their ideas with winners receiving a minimum funding of rs \u003cTWO_TEN\u003e lakhs these budding startups will also have the opportunity to pilot their projects with the government the department announced in a release entrepreneurs academia startups and researchers can submit their potential pitch decks by october \u003cTWO_TEN\u003e it bt and rdpr minister priyank kharge said i intend to make karnataka a water secure state in the country if i can solve this using deep tech in biotechnology or it that ensures we get better portability the government itself can become your companies first client he added that the government can help startups pilot these solutions within a sandbox environment and provide capital organisations that have existing products or prototypes that tackle specific problems like water purification waste management or sanitation infrastructure are eligible companies able to demonstrate a viable business model sustainability plan and measurable impact on rural communities are also welcome the guidelines read the problem statement for the summit includes inconsistent water availability over reliance on groundwater and water contamination which pose serious health risks the north karnataka region also struggles with inadequate waste segregation ineffective dry waste management and insufficient infrastructure for menstrual waste disposal","timestamp":"2024-10-18T08:55:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}