{"url":"https://economictimes.indiatimes.com/tech/information-tech/newgen-software-aspires-to-reach-500-million-in-4-years/articleshow/114285889.cms","title":"Newgen Software aspires to reach $500 million in revenue in 4 years","description":"The New Delhi-headquartered firm, currently generating $150 million in revenue, expects the US and Europe regions to drive long-term growth.","content":"Mid-tier technology services provider Newgen Software Technologies (Newgen) aims to capture market share in the mature markets of the United States and Europe as it targets $500 million in revenue over the next 3-4 years, its top executive told ET.“We aspire to reach $500 million in the next 3-4 years. We've drawn the roadmap and are investing seriously. But yes, the market has to reward you, and the returns and timing have to be right. We hope this plan works for us,” said Virender Jeet, CEO, Newgen Software.Jeet expects the company to maintain its historical growth rate of around 20% in FY25. “I don’t see the potential of the company as a problem, but our ability to execute can sometimes be a constraint. However, we are moving in the right direction,” he added.As of FY24, ending in March, the New Delhi-headquartered firm, with around 4,400 employees, reported annual revenue of $148 million (Rs 12,438 crore), growing at a compound annual growth rate (CAGR) of 26%.On Tuesday, Newgen reported a 23% year-on-year (YoY) revenue growth for the second quarter of FY25, ending in September, to Rs 361 crore, driven by license sales predominantly in the Asia Pacific (APAC), Europe, Middle East and Africa (EMEA), and India regions.","cleaned_content":"mid tier technology services provider newgen software technologies newgen aims to capture market share in the mature markets of the united states and europe as it targets \u003cFIVE_HUNDRED\u003e million in revenue over the next \u003cTHREE_\u003e \u003cFOUR_\u003e years its top executive told et we aspire to reach \u003cFIVE_HUNDRED\u003e million in the next \u003cTHREE_\u003e \u003cFOUR_\u003e years weve drawn the roadmap and are investing seriously but yes the market has to reward you and the returns and timing have to be right we hope this plan works for us said virender jeet ceo newgen software jeet expects the company to maintain its historical growth rate of around \u003cTWO_TEN_PERCENT\u003e in fy25 i don t see the potential of the company as a problem but our ability to execute can sometimes be a constraint however we are moving in the right direction he added as of fy24 ending in march the new delhi headquartered firm with around \u003cFOUR_THOUSAND\u003e employees reported annual revenue of \u003cONE_HUNDRED\u003e million rs \u003cONE_TEN_THOUSAND\u003e crore growing at a compound annual growth rate cagr of \u003cTWO_TEN_PERCENT\u003e on tuesday newgen reported a \u003cTWO_TEN_PERCENT\u003e year on year yoy revenue growth for the second quarter of fy25 ending in september to rs \u003cTHREE_HUNDRED\u003e crore driven by license sales predominantly in the asia pacific apac europe middle east and africa emea and india regions","timestamp":"2024-10-16T18:00:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}