{"url":"https://economictimes.indiatimes.com/tech/technology/ashneer-grover-withdraws-oppression-and-mismanagement-plea-against-bharatpe-management/articleshow/114342015.cms","title":"Ashneer Grover withdraws oppression and mismanagement plea against BharatPe management","description":"The withdrawal of the plea from the NCLT's Delhi bench came after Grover reached a settlement with the company on September 30, 2024. Besides, on October 17, Grover also withdrew a plea from the National Company Law Appellate Tribunal (NCLAT), where he had sought an early hearing of the case in NCLT.","content":"Ashneer Grover, cofounder and former managing director of BharatPe, withdrew his plea from the National Company Law Tribunal (NCLT), in which he had alleged oppressive conduct and mismanagement by the board of the fintech firm. The withdrawal of the plea from the NCLT's Delhi bench came after Grover reached a settlement with the company on September 30, 2024.  A copy of the settlement agreement was also placed before the NCLT by the counsel appearing for Grover, who had filed an application for withdrawal of the petition.  \"... during the pendency of the said petition, parties have arrived with settlement and also executed the settlement agreement dated September 30, 2024, a copy of which is placed on record and in view of the settlement applicant (who is petitioner in the main company petition) has sought liberty to withdraw the company petition,\" the NCLT order dated October 14, 2024, noted.  It further said: \"Liberty is granted to the applicant to withdraw the company petition... and the same is dismissed as withdrawn. The present IA is disposed of.\"  Besides, on October 17, Grover also withdrew a plea from the National Company Law Appellate Tribunal (NCLAT), where he had sought an early hearing of the case in NCLT. ","cleaned_content":"ashneer grover cofounder and former managing director of bharatpe withdrew his plea from the national company law tribunal nclt in which he had alleged oppressive conduct and mismanagement by the board of the fintech firm the withdrawal of the plea from the nclts delhi bench came after grover reached a settlement with the company on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e a copy of the settlement agreement was also placed before the nclt by the counsel appearing for grover who had filed an application for withdrawal of the petition during the pendency of the said petition parties have arrived with settlement and also executed the settlement agreement dated september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e a copy of which is placed on record and in view of the settlement applicant who is petitioner in the main company petition has sought liberty to withdraw the company petition the nclt order dated october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e noted it further said liberty is granted to the applicant to withdraw the company petition and the same is dismissed as withdrawn the present ia is disposed of besides on october \u003cONE_TEN\u003e grover also withdrew a plea from the national company law appellate tribunal nclat where he had sought an early hearing of the case in nclt","timestamp":"2024-10-18T13:02:00+05:30","market_timestamp":"2024-10-18T13:02:00+05:30","off_market_hours":false}