{"url":"https://economictimes.indiatimes.com/tech/information-tech/india-inc-too-riding-gcc-wave/articleshow/114261034.cms","title":"India Inc too riding GCC wave","description":"Legacy companies are also recognising the need for a robust, centralised tech strategy and talent in a world where rapid evaluation of technology is disrupting and transforming businesses, say experts.","content":"Foreign companies are not the only ones setting up global capability centres (GCCs) in India to provide centralised support to their businesses. Large Indian corporations are also building such facilities, often to beef up their technology capabilities.Reliance Industries, Adani Group, Dr Reddy’s Laboratories (DRL) and Bank of Baroda are among Indian entities that have set up such centres locally in the past two to four years.Indian firms are estimated to have set up around 50 GCCs in the last couple of years in sectors like telecom, financial services and automotive, said Arindam Sen, GCC leader and partner for media, entertainment and telecommunications practice at EY India.“Companies are growing in terms of size and scale, and the businesses they operate in are pushing them to think along these lines; otherwise, they start duplicating resources,” he said. “To get things more streamlined and adopt a leaner model across the sectors and geographies in which they operate, they have taken a page from multinationals. That’s the primary driver,” said Sen.","cleaned_content":"foreign companies are not the only ones setting up global capability centres gccs in india to provide centralised support to their businesses large indian corporations are also building such facilities often to beef up their technology capabilities reliance industries adani group dr reddy s laboratories drl and bank of baroda are among indian entities that have set up such centres locally in the past two to four years indian firms are estimated to have set up around \u003cFIVE_TEN\u003e gccs in the last couple of years in sectors like telecom financial services and automotive said arindam sen gcc leader and partner for media entertainment and telecommunications practice at ey india companies are growing in terms of size and scale and the businesses they operate in are pushing them to think along these lines otherwise they start duplicating resources he said to get things more streamlined and adopt a leaner model across the sectors and geographies in which they operate they have taken a page from multinationals that s the primary driver said sen","timestamp":"2024-10-16T06:01:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}