{"url":"https://economictimes.indiatimes.com/tech/technology/meta-must-face-massachusetts-social-media-addiction-lawsuit-judge-rules/articleshow/114367180.cms","title":"Meta must face Massachusetts social media addiction lawsuit, judge rules","description":"Suffolk County Superior Court Judge Peter Krupp in Boston, in a decision made public on Friday, rejected Meta's request to dismiss claims by Massachusetts Attorney General Andrea Joy Campbell that it violated state consumer protection law and created a public nuisance.","content":"A Massachusetts judge rejected Meta Platforms' bid to dismiss a lawsuit by the state alleging the social media company purposely deployed features on its Instagram platform to addict young users and deceived the public about the dangers its product posed to the mental health of teenagers. Suffolk County Superior Court Judge Peter Krupp in Boston, in a decision made public on Friday, rejected Meta's request to dismiss claims by Massachusetts Attorney General Andrea Joy Campbell that it violated state consumer protection law and created a public nuisance. Meta and a spokesperson for Campbell had no immediate comment. The ruling came days after a federal judge in California on Tuesday rejected a request by the Facebook and Instagram operator to dismiss lawsuits by more than 30 states accusing it of fueling mental health problems among teens by making its social media platforms addictive. Massachusetts was one of a handful of states that pursued separate claims in state court, rather than federal, when it sued in October 2023.","cleaned_content":"a massachusetts judge rejected meta platforms bid to dismiss a lawsuit by the state alleging the social media company purposely deployed features on its instagram platform to addict young users and deceived the public about the dangers its product posed to the mental health of teenagers suffolk county superior court judge peter krupp in boston in a decision made public on friday rejected metas request to dismiss claims by massachusetts attorney general andrea joy campbell that it violated state consumer protection law and created a public nuisance meta and a spokesperson for campbell had no immediate comment the ruling came days after a federal judge in california on tuesday rejected a request by the facebook and instagram operator to dismiss lawsuits by more than \u003cTHREE_TEN\u003e states accusing it of fueling mental health problems among teens by making its social media platforms addictive massachusetts was one of a handful of states that pursued separate claims in state court rather than federal when it sued in october \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-19T10:42:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}