{"url":"https://economictimes.indiatimes.com/tech/technology/wisetech-globals-board-to-examine-payments-to-ceos-former-partner/articleshow/114412122.cms","title":"WiseTech Global's board to examine payments to CEO's former partner","description":"The Australian Financial Review and other media outlets reported that a woman who had a sexual relationship with the billionaire chief made a raft of claims against Richard White in late 2020, including allegations that he had engaged in inappropriate behaviour.","content":"Australian tech firm WiseTech Global said on Monday it was reviewing a \"full range of matters\" concerning its billionaire CEO after media reports made allegations about his personal life including payments to a past sexual partner. The Australian Financial Review and other media outlets reported that a woman who had a sexual relationship with the billionaire chief made a raft of claims against Richard White in late 2020, including allegations that he had engaged in inappropriate behaviour.  White, WiseTech's billionaire founder and major shareholder, could not immediately be reached for a comment while WiseTech did not immediately respond.  The reports said White, 69, had approached numerous female entrepreneurs through text messages and social media with offers of professional support that could shift into crude or suggestive language.  The growing media attention on White's private life, with media reports continuing to emerge, has now begun to impact the firm's reputation with its shares falling over 11% since the beginning of the month. ","cleaned_content":"australian tech firm wisetech global said on monday it was reviewing a full range of matters concerning its billionaire ceo after media reports made allegations about his personal life including payments to a past sexual partner the australian financial review and other media outlets reported that a woman who had a sexual relationship with the billionaire chief made a raft of claims against richard white in late \u003cTWO_THOUSAND\u003e including allegations that he had engaged in inappropriate behaviour white wisetechs billionaire founder and major shareholder could not immediately be reached for a comment while wisetech did not immediately respond the reports said white \u003cSIX_TEN\u003e had approached numerous female entrepreneurs through text messages and social media with offers of professional support that could shift into crude or suggestive language the growing media attention on whites private life with media reports continuing to emerge has now begun to impact the firms reputation with its shares falling over \u003cONE_TEN_PERCENT\u003e since the beginning of the month","timestamp":"2024-10-21T09:18:00+05:30","market_timestamp":"2024-10-21T09:18:00+05:30","off_market_hours":false}