{"url":"https://economictimes.indiatimes.com/tech/technology/meta-must-face-us-state-lawsuits-over-teen-social-media-addiction/articleshow/114269746.cms","title":"Meta must face US state lawsuits over teen social media addiction","description":"Oakland-based US District Judge Yvonne Gonzalez Rogers rejected Meta's bid to toss the claims made by the states in two separate lawsuits filed last year, one including more than 30 states and the other including only Florida.","content":"Facebook parent company Meta must face lawsuits by U.S. states accusing it of encouraging social media addiction among teens, a federal judge in California ruled on Tuesday. Oakland-based US District Judge Yvonne Gonzalez Rogers rejected Meta's bid to toss the claims made by the states in two separate lawsuits filed last year, one including more than 30 states and the other including only Florida.  The company had argued that federal law blocked some of the claims and that the states failed to point to misleading statements that it had made. The judge put some limits on the claims that the states - numbering more than 30 in all - could pursue, but allowed the case to go forward largely intact. The judge also rejected the social media company's motion to dismiss some claims over social media addiction brought by individual plaintiffs. The states are asking the court for injunctions against Meta's allegedly illegal business practices and are seeking unspecified monetary damages.","cleaned_content":"facebook parent company meta must face lawsuits by u s states accusing it of encouraging social media addiction among teens a federal judge in california ruled on tuesday oakland based us district judge yvonne gonzalez rogers rejected metas bid to toss the claims made by the states in two separate lawsuits filed last year one including more than \u003cTHREE_TEN\u003e states and the other including only florida the company had argued that federal law blocked some of the claims and that the states failed to point to misleading statements that it had made the judge put some limits on the claims that the states numbering more than \u003cTHREE_TEN\u003e in all could pursue but allowed the case to go forward largely intact the judge also rejected the social media companys motion to dismiss some claims over social media addiction brought by individual plaintiffs the states are asking the court for injunctions against metas allegedly illegal business practices and are seeking unspecified monetary damages","timestamp":"2024-10-16T09:43:00+05:30","market_timestamp":"2024-10-16T09:43:00+05:30","off_market_hours":false}