{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipros-q2-net-profit-rises-6-3-qoq-to-rs-3227-crore/articleshow/114326545.cms","title":"Wipro’s Q2 net profit rises 6.3% QoQ to Rs 3,227 crore","description":"The fourth largest Indian IT services firm posted a net profit of Rs 3,227 crore for the quarter ended September 30. Revenue rose 1.5% sequentially to Rs 22,301 crore, helped by increased momentum in banking, financial services and insurance (BFSI) and consulting. It, however, fell 1% from a year earlier.","content":"Wipro on Thursday posted a 21% year-on-year and 6.3% sequential increase in net profit for the second quarter, when three of its four strategic market units (SMUs) reported better performance and the company also saw improved execution levels and an expansion in margins.The fourth largest Indian IT services firm posted a net profit of Rs 3,227 crore for the quarter ended September 30.Revenue rose 1.5% sequentially to Rs 22,301 crore, helped by increased momentum in banking, financial services and insurance (BFSI) and consulting. It, however, fell 1% from a year earlier.The IT major expects Q3 revenue from its IT services business segment to be in the range of $2.61-$2.66 billion. This guidance indicates the revenue would be flat or up to 2% lower sequentially in constant currency terms, as the company expects fewer working days and furloughs in the current quarter.Operating margin at 16.8% in Q2 improved by 70 basis points on-year and 30 basis points sequentially. Total bookings were $3.56 billion, including large deal bookings of $1.49 billion, an increase of 28.8% QoQ and 16.8% YoY in constant currency.","cleaned_content":"wipro on thursday posted a \u003cTWO_TEN_PERCENT\u003e year on year and \u003cSIX_PERCENT\u003e sequential increase in net profit for the second quarter when three of its four strategic market units smus reported better performance and the company also saw improved execution levels and an expansion in margins the fourth largest indian it services firm posted a net profit of rs \u003cTHREE_THOUSAND\u003e crore for the quarter ended september \u003cTHREE_TEN\u003e revenue rose \u003cONE_PERCENT\u003e sequentially to rs \u003cTWO_TEN_THOUSAND\u003e crore helped by increased momentum in banking financial services and insurance bfsi and consulting it however fell \u003cONE_PERCENT\u003e from a year earlier the it major expects q3 revenue from its it services business segment to be in the range of \u003cTWO_\u003e \u003cTWO_\u003e billion this guidance indicates the revenue would be flat or up to \u003cTWO_PERCENT\u003e lower sequentially in constant currency terms as the company expects fewer working days and furloughs in the current quarter operating margin at \u003cONE_TEN_PERCENT\u003e in q2 improved by \u003cSEVEN_TEN\u003e basis points on year and \u003cTHREE_TEN\u003e basis points sequentially total bookings were \u003cTHREE_\u003e billion including large deal bookings of \u003cONE_\u003e billion an increase of \u003cTWO_TEN_PERCENT\u003e qoq and \u003cONE_TEN_PERCENT\u003e yoy in constant currency","timestamp":"2024-10-18T06:00:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}