{"url":"https://economictimes.indiatimes.com/tech/technology/temasek-owned-fullerton-to-take-majority-control-in-cash-strapped-lendingkart-with-rs-252-crore-commitment/articleshow/114348701.cms","title":"Temasek-owned Fullerton to take majority control in cash-strapped Lendingkart for Rs 252 crore","description":"This comes after RBI’s action against NBFC and microfinance firms like Navi and DMI Finance being banned from sanctioning loans. The funding round will see Lendingkart's valuation get slashed to around $100 million from $350 million in 2020, as reported first by ET on October 17.","content":"MSME- focused digital lending platform Lendingkart has secured a commitment of Rs 252 crore from its existing investor Temasek-owned Fullerton Financial Holdings (FFH), the company said on Friday. The investment comes amid Lendingkart facing a severe cash crisis and a larger stress in the unsecured loan market. The funding round will see Lendingkart's valuation get slashed to around $100 million from $350 million in 2020, as reported first by ET on October 17.The development after RBI’s action on Thursday against non-banking finance companies and microfinance firms like Navi and DMI Finance being banned from sanctioning loans. Details of investment In a statement, the Ahmedabad-based Lendingkart said the capital infusion from FFH will enable it to deepen its reach in underserved markets and enhance its technology to cater to the financial needs of small businesses. ","cleaned_content":"msme focused digital lending platform lendingkart has secured a commitment of rs \u003cTWO_HUNDRED\u003e crore from its existing investor temasek owned fullerton financial holdings ffh the company said on friday the investment comes amid lendingkart facing a severe cash crisis and a larger stress in the unsecured loan market the funding round will see lendingkarts valuation get slashed to around \u003cONE_HUNDRED\u003e million from \u003cTHREE_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e as reported first by et on october \u003cONE_TEN\u003e the development after rbi s action on thursday against non banking finance companies and microfinance firms like navi and dmi finance being banned from sanctioning loans details of investment in a statement the ahmedabad based lendingkart said the capital infusion from ffh will enable it to deepen its reach in underserved markets and enhance its technology to cater to the financial needs of small businesses","timestamp":"2024-10-19T08:58:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}