{"url":"https://economictimes.indiatimes.com/tech/technology/survey-software-seller-surveymonkey-opens-gcc-in-bengaluru-plans-to-have-25-of-its-rd-team/articleshow/114285219.cms","title":"Survey software seller SurveyMonkey opens GCC in Bengaluru; plans to have 25% of its R\u0026D team","description":"The San Mateo-based company helps organisations conduct surveys and gather feedback, particularly from employees and clients. It has also recently collaborated with media organisations in the US to conduct surveys for the upcoming elections.","content":"Cloud-based survey software provider SurveyMonkey, which counts Tata Consultancy Services, Swiggy, Adidas, and several large multinational banks among its clients, opened its Global Capability Centre (GCC) in Bengaluru on Wednesday. The firm plans to have 25% of its total 450 R\u0026D employees based in India by the middle of next year.The San Mateo-based company helps organisations conduct surveys and gather feedback, particularly from employees and clients. It has also recently collaborated with media organisations in the U.S. to conduct surveys for the upcoming U.S. elections.Speaking about the Indian market, Eric Johnson, chief executive at SurveyMonkey, told ET that India currently has around 2,000 clients out of the company's total of 800,000 globally. \"While that is less than 1% at the moment, India is adding about 200 new clients every month,\" he said. He also explained that all of SurveyMonkey’s current Indian customers became clients without the company having a dedicated sales team in the country.Johnson stated that they are targeting companies across various industries, particularly helping human resources and customer relations management teams conduct surveys and gather feedback. He added that because India is home to many large technology companies, SurveyMonkey expects a significant number of IT and tech firms to become clients.He further explained, \"The primary use of our product is feedback, and the two biggest use cases are employee feedback and customer feedback. The third, which is a big one for us, is market research. It helps companies understand people’s perceptions of a new name, color, or product idea before launching it.\"","cleaned_content":"cloud based survey software provider surveymonkey which counts tata consultancy services swiggy adidas and several large multinational banks among its clients opened its global capability centre gcc in bengaluru on wednesday the firm plans to have \u003cTWO_TEN_PERCENT\u003e of its total \u003cFOUR_HUNDRED\u003e r d employees based in india by the middle of next year the san mateo based company helps organisations conduct surveys and gather feedback particularly from employees and clients it has also recently collaborated with media organisations in the u s to conduct surveys for the upcoming u s elections speaking about the indian market eric johnson chief executive at surveymonkey told et that india currently has around \u003cTWO_THOUSAND\u003e clients out of the companys total of \u003cEIGHT_HUNDRED_THOUSAND\u003e globally while that is less than \u003cONE_PERCENT\u003e at the moment india is adding about \u003cTWO_HUNDRED\u003e new clients every month he said he also explained that all of surveymonkey s current indian customers became clients without the company having a dedicated sales team in the country johnson stated that they are targeting companies across various industries particularly helping human resources and customer relations management teams conduct surveys and gather feedback he added that because india is home to many large technology companies surveymonkey expects a significant number of it and tech firms to become clients he further explained the primary use of our product is feedback and the two biggest use cases are employee feedback and customer feedback the third which is a big one for us is market research it helps companies understand people s perceptions of a new name color or product idea before launching it","timestamp":"2024-10-16T17:30:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}