{"url":"https://economictimes.indiatimes.com/tech/technology/us-agencies-fund-and-fight-with-elon-musk-a-trump-presidency-could-give-him-power-over-them/articleshow/114413411.cms","title":"US agencies fund, and fight with, Elon Musk, a Trump presidency could give him power over them","description":"Elon Musk's rocket company, SpaceX, effectively dictates NASA's rocket launch schedule. The Defense Department relies on him to get most of its satellites to orbit. His companies were promised $3 billion across nearly 100 different contracts last year with 17 federal agencies.","content":"Elon Musk's influence over the federal government is extraordinary, and extraordinarily lucrative. Musk's rocket company, SpaceX, effectively dictates NASA's rocket launch schedule. The Defense Department relies on him to get most of its satellites to orbit. His companies were promised $3 billion across nearly 100 different contracts last year with 17 federal agencies. His entanglements with federal regulators are also numerous and adversarial, and his companies have been targeted in at least 20 recent investigations or reviews. Given Musk's immense business footprint, he will be a major player no matter who wins the election. But he has thrown his fortune behind former President Donald Trump and, in return, Trump has vowed to make Musk head of a new \"government efficiency commission\" with the power to recommend wide-ranging cuts at federal agencies and changes to federal rules.","cleaned_content":"elon musks influence over the federal government is extraordinary and extraordinarily lucrative musks rocket company spacex effectively dictates nasas rocket launch schedule the defense department relies on him to get most of its satellites to orbit his companies were promised \u003cTHREE_\u003e billion across nearly \u003cONE_HUNDRED\u003e different contracts last year with \u003cONE_TEN\u003e federal agencies his entanglements with federal regulators are also numerous and adversarial and his companies have been targeted in at least \u003cTWO_TEN\u003e recent investigations or reviews given musks immense business footprint he will be a major player no matter who wins the election but he has thrown his fortune behind former president donald trump and in return trump has vowed to make musk head of a new government efficiency commission with the power to recommend wide ranging cuts at federal agencies and changes to federal rules","timestamp":"2024-10-21T10:09:00+05:30","market_timestamp":"2024-10-21T10:09:00+05:30","off_market_hours":false}