{"url":"https://economictimes.indiatimes.com/tech/technology/google-granted-request-to-pause-order-on-play-store-overhaul/articleshow/114364414.cms","title":"Google granted request to pause order on Play store overhaul","description":"San Francisco-based US District Judge James Donato made the decision on Friday as part of an antitrust lawsuit against Google brought by \"Fortnite\" maker Epic Games. Google argued that Donato's October 7 injunction would harm the company and introduce \"serious safety, security and privacy risks into the Android ecosystem.\"","content":"A federal judge in California has granted Google's request to temporarily pause his order directing the Alphabet unit to overhaul its Android app store Play by Nov. 1 to give consumers more choice over how they download software. San Francisco-based US District Judge James Donato made the decision on Friday as part of an antitrust lawsuit against Google brought by \"Fortnite\" maker Epic Games. Google argued that Donato's October 7 injunction would harm the company and introduce \"serious safety, security and privacy risks into the Android ecosystem.\" Donato delayed the injunction to allow the San Francisco-based 9th U.S. Circuit Court of Appeals to consider Google's separate request to pause the judge's order. Donato denied Google's separate request to pause the order for the duration of its broader appeal in the case. \"We're pleased with the District Court's decision to temporarily pause the implementation of dangerous remedies demanded by Epic, as the Court of Appeal considers our request to further pause the remedies while we appeal,\" Google said in a statement.","cleaned_content":"a federal judge in california has granted googles request to temporarily pause his order directing the alphabet unit to overhaul its android app store play by nov \u003cONE_\u003e to give consumers more choice over how they download software san francisco based us district judge james donato made the decision on friday as part of an antitrust lawsuit against google brought by fortnite maker epic games google argued that donatos october \u003cSEVEN_\u003e injunction would harm the company and introduce serious safety security and privacy risks into the android ecosystem donato delayed the injunction to allow the san francisco based \u003cNINE_\u003e th u s circuit court of appeals to consider googles separate request to pause the judges order donato denied googles separate request to pause the order for the duration of its broader appeal in the case were pleased with the district courts decision to temporarily pause the implementation of dangerous remedies demanded by epic as the court of appeal considers our request to further pause the remedies while we appeal google said in a statement","timestamp":"2024-10-19T07:25:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}