{"url":"https://economictimes.indiatimes.com/tech/technology/mamaearths-chief-product-and-technology-officer-jayant-chauhan-quits/articleshow/114252477.cms","title":"Mamaearth's chief product and technology officer Jayant Chauhan quits","description":"Chauhan has been with the beauty and personal care company since November 2020, before which he was chief product officer at Policybazaar. Prior to Policybazaar he has had stints at firms such as Paytm, Airtel and Zomato.","content":"Jayant Chauhan, chief product and technology officer of Mamaearth-parent Honasa Consumer has resigned from his position, the company said in a stock exchange filing.\"Due to personal reasons, I would like to tender my resignation from the post of chief product and technology officer of the company. My last working day with the organisation would be 30th November 2024,\" Chauhan wrote in his resignation letter to Honasa Consumer's founder and CEO Varun Alagh.Chauhan has been with the beauty and personal care company since November 2020, before which he was chief product officer at Policybazaar. Prior to Policybazaar, he had stints at Paytm, Airtel and Zomato.According to a person in the know, at Mamaearth, Chauhan, an alumnus of Indian Institute of Technology-Delhi, is responsible for overall product strategy and engineering. He leads the product development and infrastructure teams at the Gurugram-based company.Shares of Honasa Consumer ended 0.9% higher on Tuesday at Rs 428.90 on the BSE. The announcement of Chauhan’s resignation was made post-market hours.","cleaned_content":"jayant chauhan chief product and technology officer of mamaearth parent honasa consumer has resigned from his position the company said in a stock exchange filing due to personal reasons i would like to tender my resignation from the post of chief product and technology officer of the company my last working day with the organisation would be \u003cTHREE_TEN\u003e th november \u003cTWO_THOUSAND\u003e chauhan wrote in his resignation letter to honasa consumers founder and ceo varun alagh chauhan has been with the beauty and personal care company since november \u003cTWO_THOUSAND\u003e before which he was chief product officer at policybazaar prior to policybazaar he had stints at paytm airtel and zomato according to a person in the know at mamaearth chauhan an alumnus of indian institute of technology delhi is responsible for overall product strategy and engineering he leads the product development and infrastructure teams at the gurugram based company shares of honasa consumer ended \u003cZERO_PERCENT\u003e higher on tuesday at rs \u003cFOUR_HUNDRED\u003e on the bse the announcement of chauhan s resignation was made post market hours","timestamp":"2024-10-15T19:36:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}