{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-says-resolved-99-1-of-customer-complaints/articleshow/114435632.cms","title":"Ola Electric says resolved 99% of customer complaints","description":"The CCPA issued a show cause notice to Ola Electric last month for alleged violations of consumer rights, misleading advertisements, and unfair trade practices. The notice came amid increased customer complaints against Ola’s after-sales service, software glitches, and hardware issues with its two-wheelers.","content":"Electric two-wheeler maker Ola Electric has informed the Central Consumer Protection Authority (CCPA) that it has resolved 99.1% of the 10,644 consumer complaints received so far.\"We wish to reiterate that Ola Electric has a robust mechanism to address complaints raised with respect to our vehicles. In fact, we wish to emphasise that out of 10,644 complaints that we received from the CCPA, 99.1% of the complaints were resolved to the complete satisfaction of the customer as per Ola Electric’s robust redressal mechanism,\" the Bengaluru-based firm said in a regulatory filing on Monday.The CCPA issued a show cause notice to Ola Electric last month for alleged violations of consumer rights, misleading advertisements, and unfair trade practices. The notice came amid increased customer complaints against Ola’s after-sales service, software glitches, and hardware issues with its two-wheelers.In a separate development, the Bhavish Aggarwal-led company also responded to a notice from the Automotive Research Association of India (ARAI) recently, which questioned the pricing strategy of its S1 X 2 kilowatt-hour (kWh) scooters ahead of its flagship sale. The notice flagged discounts on the S1 X 2kWh model, claiming the company did not inform the agency of a price reduction, which could impact the subsidy eligibility for this model.Ola Electric clarified that it had not altered the prices during its flagship BOSS sale and provided an invoice dated October 6 showing a Rs 5,000 discount to customers. It also submitted a screenshot from its app, confirming that the scooter’s price remained unchanged.","cleaned_content":"electric two wheeler maker ola electric has informed the central consumer protection authority ccpa that it has resolved \u003cNINE_TEN_PERCENT\u003e of the \u003cONE_TEN_THOUSAND\u003e consumer complaints received so far we wish to reiterate that ola electric has a robust mechanism to address complaints raised with respect to our vehicles in fact we wish to emphasise that out of \u003cONE_TEN_THOUSAND\u003e complaints that we received from the ccpa \u003cNINE_TEN_PERCENT\u003e of the complaints were resolved to the complete satisfaction of the customer as per ola electric s robust redressal mechanism the bengaluru based firm said in a regulatory filing on monday the ccpa issued a show cause notice to ola electric last month for alleged violations of consumer rights misleading advertisements and unfair trade practices the notice came amid increased customer complaints against ola s after sales service software glitches and hardware issues with its two wheelers in a separate development the bhavish aggarwal led company also responded to a notice from the automotive research association of india arai recently which questioned the pricing strategy of its s1 x \u003cTWO_\u003e kilowatt hour kwh scooters ahead of its flagship sale the notice flagged discounts on the s1 x \u003cTWO_\u003e kwh model claiming the company did not inform the agency of a price reduction which could impact the subsidy eligibility for this model ola electric clarified that it had not altered the prices during its flagship boss sale and provided an invoice dated october \u003cSIX_\u003e showing a rs \u003cFIVE_THOUSAND\u003e discount to customers it also submitted a screenshot from its app confirming that the scooter s price remained unchanged","timestamp":"2024-10-21T23:05:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}