{"url":"https://economictimes.indiatimes.com/tech/information-tech/focusing-on-converting-tcv-to-revenue-bfs-and-tmt-led-the-revenue-growth-mphasis-ceo/articleshow/114307449.cms","title":"Focusing on converting TCV to revenue; BFS and TMT led the revenue growth: Mphasis CEO","description":"Mphasis revenue for the same period grew 3.3% quarter-on-quarter (QoQ) and 7.9% YoY to ₹3,536.1 crore. The Bengaluru-headquartered firm also saw an improvement in operating margins, which rose by 40 basis points (bps) QoQ but declined by 10 bps YoY to 15.4%.","content":"Despite multiple macroeconomic challenges—from interest rates and the election cycle to geopolitical tensions—the company’s key focus remains on converting total contract value (TCV) into revenue, said Nitin Rakesh, CEO and MD of Mphasis, in an exclusive interaction with ET following its Q2 earnings.Driven by a recovery in revenue growth, Mphasis reported a 4.6% sequential rise in net profit to ₹423.3 crore for the September quarter. On a year-on-year (YoY) basis, net profit was up by 8%.The company’s revenue for the same period grew 3.3% quarter-on-quarter (QoQ) and 7.9% YoY to ₹3,536.1 crore. The Bengaluru-headquartered firm also saw an improvement in operating margins, which rose by 40 basis points (bps) QoQ but declined by 10 bps YoY to 15.4%.“Overall, the trend has been as expected. BFS (Banking and Financial Services) and TMT (Technology, Media, and Telecom) were the two leaders in sequential growth. Almost all verticals showed growth, barring a small decline in one vertical, which is minor (around $1 million),” said Rakesh.He added that while growth is gradually becoming more visible, the macroeconomic environment remains fluid. “Though the interest rate cycle seems to have peaked, and the election cycle is in full swing, there’s still a lot happening. Our focus, however, has been on execution—converting TCV to revenue. This quarter was all about execution.”","cleaned_content":"despite multiple macroeconomic challenges from interest rates and the election cycle to geopolitical tensions the company s key focus remains on converting total contract value tcv into revenue said nitin rakesh ceo and md of mphasis in an exclusive interaction with et following its q2 earnings driven by a recovery in revenue growth mphasis reported a \u003cFOUR_PERCENT\u003e sequential rise in net profit to \u003cFOUR_HUNDRED\u003e crore for the september quarter on a year on year yoy basis net profit was up by \u003cEIGHT_PERCENT\u003e the company s revenue for the same period grew \u003cTHREE_PERCENT\u003e quarter on quarter qoq and \u003cSEVEN_PERCENT\u003e yoy to \u003cTHREE_THOUSAND\u003e crore the bengaluru headquartered firm also saw an improvement in operating margins which rose by \u003cFOUR_TEN\u003e basis points bps qoq but declined by \u003cONE_TEN\u003e bps yoy to \u003cONE_TEN_PERCENT\u003e overall the trend has been as expected bfs banking and financial services and tmt technology media and telecom were the two leaders in sequential growth almost all verticals showed growth barring a small decline in one vertical which is minor around \u003cONE_\u003e million said rakesh he added that while growth is gradually becoming more visible the macroeconomic environment remains fluid though the interest rate cycle seems to have peaked and the election cycle is in full swing there s still a lot happening our focus however has been on execution converting tcv to revenue this quarter was all about execution","timestamp":"2024-10-17T12:54:00+05:30","market_timestamp":"2024-10-17T12:54:00+05:30","off_market_hours":false}