{"url":"https://economictimes.indiatimes.com/tech/technology/paisabazaar-chases-home-loans-and-loans-against-property-through-offline-channels/articleshow/114259587.cms","title":"Paisabazaar expands into brick-and-mortar to boost secured lending","description":"Following its sister firm Policybazaar’s playbook, digital credit marketplace Paisabazaar, a part of listed PB Fintech, is building its own offline distribution channel. Naveen Kukreja, chief executive officer of Paisabazaar, told us that the company has set up a field team of around 100 people in Delhi, Mumbai, and Bengaluru.","content":"Digital credit marketplace Paisabazaar, a part of listed PB Fintech, is taking a leaf out of sister concern Policybazaar’s playbook and building its own offline distribution channel.Paisabazaar is one of the largest credit marketplaces in India. It allows consumers to access unsecured personal loans, credit cards and similar products from banks and non-bank lenders through online channels. As it builds out its secured credit distribution play, Paisabazaar wants to create a physical presence to help in fulfilment of such loan delivery.Speaking with ET, Naveen Kukreja, chief executive officer of Paisabazaar, said it has set up a field team of around 100 people in Delhi, Mumbai and Bengaluru, targeting secured credit products like home loans and loans against property. It is also testing other products like loans against cars and securities, but those are still in the beta stages. By the end of this fiscal, it intends to scale up this team to 500.Paisabazaar wants to increase the share of secured credit in its overall disbursals from around 15% last fiscal year to 50% in the near term. In the last few months, it has already expanded it to 33% of the total disbursals.“We had home loans in the past too, but consumers would check on our platform and typically would close the deal through their builders or bank branch or through the property dealer. Now with a physical presence, we hope to plug that gap in our service delivery,” Kukreja said.","cleaned_content":"digital credit marketplace paisabazaar a part of listed pb fintech is taking a leaf out of sister concern policybazaar s playbook and building its own offline distribution channel paisabazaar is one of the largest credit marketplaces in india it allows consumers to access unsecured personal loans credit cards and similar products from banks and non bank lenders through online channels as it builds out its secured credit distribution play paisabazaar wants to create a physical presence to help in fulfilment of such loan delivery speaking with et naveen kukreja chief executive officer of paisabazaar said it has set up a field team of around \u003cONE_HUNDRED\u003e people in delhi mumbai and bengaluru targeting secured credit products like home loans and loans against property it is also testing other products like loans against cars and securities but those are still in the beta stages by the end of this fiscal it intends to scale up this team to \u003cFIVE_HUNDRED\u003e paisabazaar wants to increase the share of secured credit in its overall disbursals from around \u003cONE_TEN_PERCENT\u003e last fiscal year to \u003cFIVE_TEN_PERCENT\u003e in the near term in the last few months it has already expanded it to \u003cTHREE_TEN_PERCENT\u003e of the total disbursals we had home loans in the past too but consumers would check on our platform and typically would close the deal through their builders or bank branch or through the property dealer now with a physical presence we hope to plug that gap in our service delivery kukreja said","timestamp":"2024-10-16T07:51:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}