{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-explainer-how-did-the-strike-at-samsungs-chennai-factory-unfold/articleshow/114282944.cms","title":"ETtech Explainer: How did the strike at Samsung's Chennai factory unfold?","description":"The Tamil Nadu Labour Welfare Department on Tuesday said the striking workers at Samsung’s factory at Sriperumbudur have agreed to end their strike following conciliation talks held between the company’s management and the workers.","content":"About two-thirds of the 1,800 employees at Samsung's flagship factory in Chennai have been on strike for over a month, demanding better wages, an eight-hour workday, better working conditions, and recognition of their newly-formed labour union, the Samsung India Workers Union (SIWU). What was the state government’s role?Initially, the state government did not step in to help resolve the dispute after workers at the Sriperumbudur plant struck work on September 9. It was only a few weeks later when chief minister M.K. Stalin returned from a trip to the US that the government decided to engage in talks with the workers. How did the Samsung management respond?The Samsung India management outlined several measures aimed at enhancing worker welfare, according to a statement from the state labour department. These steps were intended to address employees' concerns and foster a better working environment.How was the matter resolved?","cleaned_content":"about two thirds of the \u003cONE_THOUSAND\u003e employees at samsungs flagship factory in chennai have been on strike for over a month demanding better wages an eight hour workday better working conditions and recognition of their newly formed labour union the samsung india workers union siwu what was the state government s role initially the state government did not step in to help resolve the dispute after workers at the sriperumbudur plant struck work on september \u003cNINE_\u003e it was only a few weeks later when chief minister m k stalin returned from a trip to the us that the government decided to engage in talks with the workers how did the samsung management respond the samsung india management outlined several measures aimed at enhancing worker welfare according to a statement from the state labour department these steps were intended to address employees concerns and foster a better working environment how was the matter resolved","timestamp":"2024-10-16T16:19:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}