{"url":"https://economictimes.indiatimes.com/tech/technology/investors-leaving-board-was-biggest-setback-byjus-now-worth-zero-founder-raveendran-our-bureau/articleshow/114320123.cms","title":"Investors leaving board was biggest setback; Byju's now worth zero: founder Raveendran","description":"The founder of the once-most-valued Indian startup said investors threw Byju’s under the bus at the first sign of crisis. While sounding optimistic about a turnaround, Raveendran said the edtech had taken the best decision in the world when it took the Term Loan B (TLB), which was the easiest capital. However, it turned out to be the most expensive one, he rued.","content":"Three of Byju’s key investors—Prosus, Peak XV Partners, and the Chan Zuckerberg Initiative—resigning from the board at the same time in 2023 was one of the biggest setbacks for the troubled edtech firm, making it impossible for the company to raise funds, founder Byju Raveendran said Thursday. During a virtual press conference, while sounding optimistic of a turnaround, he said Byju’s worth today is zero. Investors like Prosus have written off their investment in the once-the-most-valued Indian startup. “When the US lenders called a default and filed in the Delaware court, within two weeks, all three directors resigned. Those three board members resigning together..is what made it almost impossible for us to do any more fundraising or equity raising. Even if they wanted to resign, if a transition or a vote for reconstitution had been planned, the company wouldn’t be in the situation it is today,” Raveendran told reporters at a press conference. “Some of them (board members) got worried about the liabilities that would come with that kind of filing,” he said, adding investors are always focused on financial outcomes and that they ‘threw Byju’s under the bus’ at the first sign of crisis. In June 2023, ET first reported that early backer GV Ravishankar, managing director at Peak XV Partners (formerly Sequoia Capital India), along with Russell Dreisenstock of Prosus (previously Naspers) and Vivian Wu of Chan Zuckerberg Initiative, had stepped down from Byju’s board.","cleaned_content":"three of byju s key investors prosus peak xv partners and the chan zuckerberg initiative resigning from the board at the same time in \u003cTWO_THOUSAND\u003e was one of the biggest setbacks for the troubled edtech firm making it impossible for the company to raise funds founder byju raveendran said thursday during a virtual press conference while sounding optimistic of a turnaround he said byju s worth today is zero investors like prosus have written off their investment in the once the most valued indian startup when the us lenders called a default and filed in the delaware court within two weeks all three directors resigned those three board members resigning together is what made it almost impossible for us to do any more fundraising or equity raising even if they wanted to resign if a transition or a vote for reconstitution had been planned the company wouldn t be in the situation it is today raveendran told reporters at a press conference some of them board members got worried about the liabilities that would come with that kind of filing he said adding investors are always focused on financial outcomes and that they threw byju s under the bus at the first sign of crisis in june \u003cTWO_THOUSAND\u003e et first reported that early backer gv ravishankar managing director at peak xv partners formerly sequoia capital india along with russell dreisenstock of prosus previously naspers and vivian wu of chan zuckerberg initiative had stepped down from byju s board","timestamp":"2024-10-17T20:45:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}