{"url":"https://economictimes.indiatimes.com/tech/technology/sterling-wilson-hives-off-data-centre-business-raises-rs-1000-crore/articleshow/114427034.cms","title":"Sterling \u0026 Wilson hives off data centre business, raises Rs 1,000 crore","description":"Promoter Khurshed Daruvala and his family will own a 30% stake in the new data centre entity, Sterling \u0026 Wilson Data Center Pvt Ltd, while the rest will be held by investors.","content":"Sterling \u0026 Wilson has hived off its data centre engineering and construction business into a separate entity and raised Rs 1,000 crore from promoter Khurshed Daruvala and other investors to execute its order book and fund overseas expansion.Daruvala and his family will own a 30% stake in the new data centre entity, Sterling \u0026 Wilson Data Center Pvt Ltd, while the rest will be held by investors including Ashish Kacholia, Lashit Sanghvi, Madhu Kela and Mukul Agarwal, people involved in the matter told ET. Sterling \u0026 Wilson, a Shapoorji Pallonji Group company, will not have any ownership of the new entity.“With the global data centre market expanding rapidly, it was essential to carve out this business into a dedicated entity, fully capitalised and singularly focused on growing our leadership position in this very exciting industry,” Sterling \u0026 Wilson chairman Daruvala said, confirming the creation of the new company.After a sale of the data centre business was announced in March 2024, the first six months of this year witnessed an order inflow of more than what was won in the past five years, he said. “What is extremely gratifying is that most of the orders have come from our repeat clients,” he told ET over email.The data centre EPC (engineering, procurement, construction) division was a 100% business unit of Sterling \u0026 Wilson. It was debt-free and profitable with revenue of Rs 460 crore. The new company was instituted last week after receiving all the approvals.","cleaned_content":"sterling wilson has hived off its data centre engineering and construction business into a separate entity and raised rs \u003cONE_THOUSAND\u003e crore from promoter khurshed daruvala and other investors to execute its order book and fund overseas expansion daruvala and his family will own a \u003cTHREE_TEN_PERCENT\u003e stake in the new data centre entity sterling wilson data center pvt ltd while the rest will be held by investors including ashish kacholia lashit sanghvi madhu kela and mukul agarwal people involved in the matter told et sterling wilson a shapoorji pallonji group company will not have any ownership of the new entity with the global data centre market expanding rapidly it was essential to carve out this business into a dedicated entity fully capitalised and singularly focused on growing our leadership position in this very exciting industry sterling wilson chairman daruvala said confirming the creation of the new company after a sale of the data centre business was announced in march \u003cTWO_THOUSAND\u003e the first six months of this year witnessed an order inflow of more than what was won in the past five years he said what is extremely gratifying is that most of the orders have come from our repeat clients he told et over email the data centre epc engineering procurement construction division was a \u003cONE_HUNDRED_PERCENT\u003e business unit of sterling wilson it was debt free and profitable with revenue of rs \u003cFOUR_HUNDRED\u003e crore the new company was instituted last week after receiving all the approvals","timestamp":"2024-10-21T16:47:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}