{"url":"https://economictimes.indiatimes.com/tech/technology/tsmc-told-us-of-chip-in-huawei-product-after-techinsights-finding-source-says/articleshow/114485563.cms","title":"TSMC told US of chip in Huawei product after TechInsights finding, source says","description":"TSMC said in a statement on Monday that it had proactively reached out to the Commerce Department regarding the matter. It said it had not supplied chips to Huawei since mid-September 2020.","content":"Taiwan Semiconductor Manufacturing Company notified the US that one of its chips had been found in a Huawei product after tech research firm TechInsights took apart the product, a person familiar with the matter said, revealing a possible violation of export restrictions on the Chinese company. The teardown was of Huawei's Ascend 910B, another source said. The 910B is viewed as most advanced AI chip available from a Chinese company. The first source would not identify the item, but said the TSMC chip was one within a multi-chip system. TechInsights informed TSMC of the chip before publishing its findings in a report, the person said, prompting the Taiwanese firm to notify the U.S. Commerce Department a couple of weeks ago. The revelation could show how difficult enforcing export controls can be for both companies making highly desired products and regulators. At the same time, it also shows Huawei's sustained need for the most sophisticated chips. TSMC said in a statement on Monday that it had proactively reached out to the Commerce Department regarding the matter. It said it had not supplied chips to Huawei since mid-September 2020.","cleaned_content":"taiwan semiconductor manufacturing company notified the us that one of its chips had been found in a huawei product after tech research firm techinsights took apart the product a person familiar with the matter said revealing a possible violation of export restrictions on the chinese company the teardown was of huaweis ascend \u003cNINE_HUNDRED\u003e b another source said the \u003cNINE_HUNDRED\u003e b is viewed as most advanced ai chip available from a chinese company the first source would not identify the item but said the tsmc chip was one within a multi chip system techinsights informed tsmc of the chip before publishing its findings in a report the person said prompting the taiwanese firm to notify the u s commerce department a couple of weeks ago the revelation could show how difficult enforcing export controls can be for both companies making highly desired products and regulators at the same time it also shows huaweis sustained need for the most sophisticated chips tsmc said in a statement on monday that it had proactively reached out to the commerce department regarding the matter it said it had not supplied chips to huawei since mid september \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-23T08:06:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}