{"url":"https://economictimes.indiatimes.com/tech/technology/samsung-delays-taking-deliveries-of-asmls-chip-gear-for-its-new-us-factory-sources-say/articleshow/114342329.cms","title":"Samsung delays taking deliveries of ASML's chip gear for its new US factory, sources say","description":"The delay in equipment deliveries is a fresh setback to the Taylor project, which is at the heart of Samsung chairman Jay Y. Lee's ambition to expand beyond its bread-and-butter memory chips into contract chip manufacturing, which Taiwan's TSMC dominates.","content":"Samsung Electronics has postponed taking deliveries of ASML chipmaking equipment for its upcoming factory in Texas as it has yet to win any major customers for the project, three people familiar with the matter said.  Samsung has been also holding off on placing orders to some other suppliers for the $17 billion factory in Taylor city, prompting them to look for other customers and send staff deployed on site back home, three other people familiar with the matter said. The delay in equipment deliveries is a fresh setback to the Taylor project, which is at the heart of Samsung chairman Jay Y. Lee's ambition to expand beyond its bread-and-butter memory chips into contract chip manufacturing, which Taiwan's TSMC dominates. It underscores the widening gulf between Samsung and rivals such as TSMC and SK Hynix which are ramping up production of high-end chips to cater to booming demand from artificial intelligence applications. ASML, the world's biggest chipmaking equipment supplier, cut its 2025 sales forecast on Tuesday, citing weakness in markets other than AI, and delayed fabs. ","cleaned_content":"samsung electronics has postponed taking deliveries of asml chipmaking equipment for its upcoming factory in texas as it has yet to win any major customers for the project three people familiar with the matter said samsung has been also holding off on placing orders to some other suppliers for the \u003cONE_TEN\u003e billion factory in taylor city prompting them to look for other customers and send staff deployed on site back home three other people familiar with the matter said the delay in equipment deliveries is a fresh setback to the taylor project which is at the heart of samsung chairman jay y lees ambition to expand beyond its bread and butter memory chips into contract chip manufacturing which taiwans tsmc dominates it underscores the widening gulf between samsung and rivals such as tsmc and sk hynix which are ramping up production of high end chips to cater to booming demand from artificial intelligence applications asml the worlds biggest chipmaking equipment supplier cut its \u003cTWO_THOUSAND\u003e sales forecast on tuesday citing weakness in markets other than ai and delayed fabs","timestamp":"2024-10-18T12:58:00+05:30","market_timestamp":"2024-10-18T12:58:00+05:30","off_market_hours":false}