{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-aws-ceo-quit-if-you-dont-want-to-return-to-office/articleshow/114332893.cms","title":"Amazon AWS CEO: Quit if you don't want to return to office","description":"\"If there are people who just don't work well in that environment and don't want to, that's okay, there are other companies around,\" said Garman. \"When we want to really, really innovate on interesting products, I have not seen an ability for us to do that when we're not in-person.\"","content":"One of Amazon's top executives defended the new, controversial 5-day-per-week in-office policy on Thursday, saying those who don't support it can leave for another company. Speaking at an all-hands meeting for AWS, unit CEO Matt Garman said nine out of 10 workers he has spoken with support the new policy, which takes effect in January, according to a transcript reviewed by Reuters.  Those who do not wish to comply can quit, he indicated. \"If there are people who just don't work well in that environment and don't want to, that's okay, there are other companies around,\" said Garman. \"When we want to really, really innovate on interesting products, I have not seen an ability for us to do that when we're not in-person.\"  The policy has upset many of Amazon's employees who say it wastes time with commuting and the benefits of working from the office are not supported by independent data.  Amazon has been enforcing a three-day in-office policy, but CEO Andy Jassy said last month the retailer would move to five days to \"invent, collaborate and be connected.\" ","cleaned_content":"one of amazons top executives defended the new controversial \u003cFIVE_\u003e day per week in office policy on thursday saying those who dont support it can leave for another company speaking at an all hands meeting for aws unit ceo matt garman said nine out of \u003cONE_TEN\u003e workers he has spoken with support the new policy which takes effect in january according to a transcript reviewed by reuters those who do not wish to comply can quit he indicated if there are people who just dont work well in that environment and dont want to thats okay there are other companies around said garman when we want to really really innovate on interesting products i have not seen an ability for us to do that when were not in person the policy has upset many of amazons employees who say it wastes time with commuting and the benefits of working from the office are not supported by independent data amazon has been enforcing a three day in office policy but ceo andy jassy said last month the retailer would move to five days to invent collaborate and be connected","timestamp":"2024-10-18T08:12:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}