{"url":"https://economictimes.indiatimes.com/tech/technology/iisc-alumnus-endows-chair-professorships-in-medical-research-hopes-for-solutions-for-type-1-diabetes-and-kidney-diseases/articleshow/114344741.cms","title":"IISc alumnus endows chair professorships in medical research, hopes for solutions for Type-1 diabetes and kidney diseases","description":"“We are extremely grateful to the Venkatramanan family for their generous contribution, which will foster cutting-edge medical research at the Institute. The endowment will enable us to host and encourage exceptional young researchers driving advances in medical research,” IISc Director, G Rangarajan said.","content":"Indian Institute of Science (IISc) on Thursday announced that its alumnus, SR Venkatramanan and his wife, Usha Venkatramanan, made a generous contribution to establish two chair professorships in the upcoming postgraduate medical school in memory of his parents, SS Ramaswamy and M Seethalakshmi. This contribution aims to advance research in critical areas of endocrinology and nephrology.“We are extremely grateful to the Venkatramanan family for their generous contribution, which will foster cutting-edge medical research at the Institute. The endowment will enable us to host and encourage exceptional young researchers driving advances in medical research,” IISc Director, G Rangarajan said. The director added that the institute is rapidly moving forward with plans to establish a postgraduate medical school along with the Bagchi-Parthasarathy Hospital on campus. “Such contributions will greatly strengthen our efforts and reinforce our commitment to training the next generation of physician-scientists,” Rangarajan expressed.Venkatramanan currently based in California, and Founder of NetCracker Systems which provides professional solutions related to performance and scalability in computer systems had completed his BE in Electrical Technology and MTech in Physical Engineering from IISc in 1975 and 1977 respectively. ““I believe that IISc renowned for its excellence in science and technology, can attract top researchers and ensure the translation of groundbreaking medical research into practical solutions,” he expressed.The alumnus has also worked at ISRO on the Rohini/SLV-3 project which laid the foundation for India’s Chandrayaan missions and held senior engineering and leadership roles in diverse organisations, including AT\u0026T Bell Labs, Sun Microsystems, Dell Technologies, Yahoo, eBay, and PayPal. ","cleaned_content":"indian institute of science iisc on thursday announced that its alumnus sr venkatramanan and his wife usha venkatramanan made a generous contribution to establish two chair professorships in the upcoming postgraduate medical school in memory of his parents ss ramaswamy and m seethalakshmi this contribution aims to advance research in critical areas of endocrinology and nephrology we are extremely grateful to the venkatramanan family for their generous contribution which will foster cutting edge medical research at the institute the endowment will enable us to host and encourage exceptional young researchers driving advances in medical research iisc director g rangarajan said the director added that the institute is rapidly moving forward with plans to establish a postgraduate medical school along with the bagchi parthasarathy hospital on campus such contributions will greatly strengthen our efforts and reinforce our commitment to training the next generation of physician scientists rangarajan expressed venkatramanan currently based in california and founder of netcracker systems which provides professional solutions related to performance and scalability in computer systems had completed his be in electrical technology and mtech in physical engineering from iisc in \u003cONE_THOUSAND\u003e and \u003cONE_THOUSAND\u003e respectively i believe that iisc renowned for its excellence in science and technology can attract top researchers and ensure the translation of groundbreaking medical research into practical solutions he expressed the alumnus has also worked at isro on the rohini slv \u003cTHREE_\u003e project which laid the foundation for india s chandrayaan missions and held senior engineering and leadership roles in diverse organisations including at t bell labs sun microsystems dell technologies yahoo ebay and paypal","timestamp":"2024-10-18T14:07:00+05:30","market_timestamp":"2024-10-18T14:07:00+05:30","off_market_hours":false}