{"url":"https://economictimes.indiatimes.com/tech/technology/zomatos-going-out-business-clocks-rs-1849-crore-in-gross-sales-in-q2/articleshow/114463284.cms","title":"Zomato's going-out business clocks Rs 1,849 crore in gross sales in Q2","description":"Food delivery company Zomato on Tuesday reported 389% growth in its consolidated net profit at Rs 176 crore in the second quarter, compared with Rs 36 crore a year ago. However, the PAT missed the Street estimate of Rs 260 crore.","content":"Zomato clocked a 171% year-on-year jump in gross order value (GOV) for its going-out business at Rs 1,849 crore for July-September -- reporting the first financials for this segment since its August acquisition of Paytm's entertainment and ticketing business for Rs 2,041 crore.However, on a like-for-like basis, Zomato's going-out business, which includes live events, ticketing and dining out, saw a GOV growth are 139% on-year. The company plans to launch a separate app 'District' for its going-out business - it had announced on August 1.In the shareholders letter published on Tuesday, Zomato's founder and CEO Deepinder Goyal said that the District app is expected to go live in the next four weeks. At this point, we are focused on making sure we do a good job at migrating the business from Zomato and Paytm platforms to the new District app,\" he said.On October 5, speaking at The ET Startup Awards 2024, Goyal had pointed out that Zomato is planning to move its dining out offering from the company's main app to the upcoming District app. With this, food delivery, which is Zomato's largest business, will have a standalone app.","cleaned_content":"zomato clocked a \u003cONE_HUNDRED_PERCENT\u003e year on year jump in gross order value gov for its going out business at rs \u003cONE_THOUSAND\u003e crore for july september reporting the first financials for this segment since its august acquisition of paytms entertainment and ticketing business for rs \u003cTWO_THOUSAND\u003e crore however on a like for like basis zomatos going out business which includes live events ticketing and dining out saw a gov growth are \u003cONE_HUNDRED_PERCENT\u003e on year the company plans to launch a separate app district for its going out business it had announced on august \u003cONE_\u003e in the shareholders letter published on tuesday zomatos founder and ceo deepinder goyal said that the district app is expected to go live in the next four weeks at this point we are focused on making sure we do a good job at migrating the business from zomato and paytm platforms to the new district app he said on october \u003cFIVE_\u003e speaking at the et startup awards \u003cTWO_THOUSAND\u003e goyal had pointed out that zomato is planning to move its dining out offering from the companys main app to the upcoming district app with this food delivery which is zomatos largest business will have a standalone app","timestamp":"2024-10-22T17:38:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}