{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-offers-to-jointly-develop-chip-with-india/articleshow/114438014.cms","title":"Nvidia offers to jointly develop chip with India","description":"Nvidia has proposed developing a chip jointly with India as the company seeks to leverage India’s strong semiconductor design talent and tap this growing market, sources told ET. Jensen Huang, Nvidia CEO, made the proposal to Prime Minister Narendra Modi in the US earlier this year. Union minister Ashwini Vaishnaw confirmed the same to ET.","content":"Nvidia has proposed developing a chip jointly with India, said people familiar with the matter, as the company seeks to leverage India’s strong semiconductor design talent and also tap this growing market.The proposal was made by Jensen Huang, founder CEO of the world’s second most valuable company, to Prime Minister Narendra Modi when the two met in the US earlier this year. Nvidia’s valuation has surged as its graphics processing unit (GPU) chips have become integral to the artificial intelligence (AI) surge that’s driving the tech industry. Confirming the development, Ashwini Vaishnaw, union minister for electronics and IT, told ET, “Yes, we are discussing with Nvidia the development of an AI chip; discussions are at a preliminary stage.”Officials said Nvidia wants to use India's huge chip designing base and develop an India specific chip. “The government is currently thrashing out the details such as costing, benefits, use cases of such a co-developed chip,” one of them said.  ","cleaned_content":"nvidia has proposed developing a chip jointly with india said people familiar with the matter as the company seeks to leverage india s strong semiconductor design talent and also tap this growing market the proposal was made by jensen huang founder ceo of the world s second most valuable company to prime minister narendra modi when the two met in the us earlier this year nvidia s valuation has surged as its graphics processing unit gpu chips have become integral to the artificial intelligence ai surge that s driving the tech industry confirming the development ashwini vaishnaw union minister for electronics and it told et yes we are discussing with nvidia the development of an ai chip discussions are at a preliminary stage officials said nvidia wants to use indias huge chip designing base and develop an india specific chip the government is currently thrashing out the details such as costing benefits use cases of such a co developed chip one of them said","timestamp":"2024-10-22T07:13:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}