{"url":"https://economictimes.indiatimes.com/tech/technology/bharatpe-posts-39-rise-in-fy24-operating-revenue-loss-before-taxes-narrows-50/articleshow/114282201.cms","title":"BharatPe posts 39% rise in FY24 operating revenue, loss before taxes narrows 50%","description":"At the group level, its consolidated ebitda (earnings before interest, tax, depreciation and amortisation) loss before share-based payment expense reduced 75% to Rs 209 crore in FY24 from Rs 826 crore in the last fiscal.","content":"Fintech firm BharatPe reported a 39% jump in operating revenue to Rs 1,426 crore in FY24 from Rs 1,029 crore a year earlier. It also narrowed its consolidated loss before taxes by 50% to Rs 474 crore from Rs 941 crore in the year-ago period, the company said in a release today.At the group level, its consolidated ebitda (earnings before interest, tax, depreciation and amortisation) loss before share-based payment expense reduced 75% to Rs 209 crore in FY24 from Rs 826 crore in the last fiscal.The Peak XV Partners-backed startup runs a platform which supports QR code-based UPI payments for its merchants, and offers them credit. It recently rebranded PostPe as BharatPe to offer UPI payment services to consumers. On September 30, BharatPe entered into an agreement to settle all its disputes with cofounder Ashneer Grover and his family. As a part of the settlement, Grover has severed all ties with BharatPe.Commenting on the company’s financials,chief executive officer Nalin Negi said: “FY24 was a milestone year for us as BharatPe turned ebitda positive in October 2024. Also, we considerably slashed our cash burn in FY24 and are on track to build a sustainable and profitable business.”","cleaned_content":"fintech firm bharatpe reported a \u003cTHREE_TEN_PERCENT\u003e jump in operating revenue to rs \u003cONE_THOUSAND\u003e crore in fy24 from rs \u003cONE_THOUSAND\u003e crore a year earlier it also narrowed its consolidated loss before taxes by \u003cFIVE_TEN_PERCENT\u003e to rs \u003cFOUR_HUNDRED\u003e crore from rs \u003cNINE_HUNDRED\u003e crore in the year ago period the company said in a release today at the group level its consolidated ebitda earnings before interest tax depreciation and amortisation loss before share based payment expense reduced \u003cSEVEN_TEN_PERCENT\u003e to rs \u003cTWO_HUNDRED\u003e crore in fy24 from rs \u003cEIGHT_HUNDRED\u003e crore in the last fiscal the peak xv partners backed startup runs a platform which supports qr code based upi payments for its merchants and offers them credit it recently rebranded postpe as bharatpe to offer upi payment services to consumers on september \u003cTHREE_TEN\u003e bharatpe entered into an agreement to settle all its disputes with cofounder ashneer grover and his family as a part of the settlement grover has severed all ties with bharatpe commenting on the company s financials chief executive officer nalin negi said fy24 was a milestone year for us as bharatpe turned ebitda positive in october \u003cTWO_THOUSAND\u003e also we considerably slashed our cash burn in fy24 and are on track to build a sustainable and profitable business","timestamp":"2024-10-16T15:59:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}