{"url":"https://economictimes.indiatimes.com/tech/technology/sam-altmans-rebranded-worldcoin-ramps-up-iris-scanning-crypto-project/articleshow/114336863.cms","title":"Sam Altman's rebranded Worldcoin ramps up iris-scanning crypto project","description":"World Network, which is facing scrutiny over its data collection, introduced a new version of its orb iris-scanning device at an event in San Francisco on Thursday, which it said features 5G connectivity and enhanced privacy and security features.","content":"Worldcoin, a cryptocurrency project founded by OpenAI CEO Sam Altman, said on Thursday it was rebranding to World Network and was ramping up efforts to scan every human's iris using its \"orb\" devices. Its core offering is its World ID, which the company describes as a \"digital passport\" to prove that its holder is a real human and tell the difference with AI chatbots online.  World Network, which is facing scrutiny over its data collection, introduced a new version of its orb iris-scanning device at an event in San Francisco on Thursday, which it said features 5G connectivity and enhanced privacy and security features. It also unveiled a slew of new ways to make it easier to access the orb, such as purpose-built retail locations and a partnership with Latin American delivery service Rappi to bring orbs to people. To get a World ID, a customer signs up to do an in-person iris scan using World Network's \"orb\", a silver ball approximately the size of a bowling ball. ","cleaned_content":"worldcoin a cryptocurrency project founded by openai ceo sam altman said on thursday it was rebranding to world network and was ramping up efforts to scan every humans iris using its orb devices its core offering is its world id which the company describes as a digital passport to prove that its holder is a real human and tell the difference with ai chatbots online world network which is facing scrutiny over its data collection introduced a new version of its orb iris scanning device at an event in san francisco on thursday which it said features \u003cFIVE_\u003e g connectivity and enhanced privacy and security features it also unveiled a slew of new ways to make it easier to access the orb such as purpose built retail locations and a partnership with latin american delivery service rappi to bring orbs to people to get a world id a customer signs up to do an in person iris scan using world networks orb a silver ball approximately the size of a bowling ball","timestamp":"2024-10-18T10:14:00+05:30","market_timestamp":"2024-10-18T10:14:00+05:30","off_market_hours":false}