{"url":"https://economictimes.indiatimes.com/tech/technology/meta-lays-off-employees-at-whatsapp-and-instagram-the-verge-reports/articleshow/114303727.cms","title":"Meta lays off employees at WhatsApp and Instagram, the Verge reports","description":"Meta is executing layoffs across multiple units such as Instagram, WhatsApp, and Reality Labs, aiming to realign with strategic goals. Additionally, around two dozen employees in Los Angeles were terminated for misuse of meal credits. This forms part of broader cost-cutting measures initiated by CEO Mark Zuckerberg.","content":"Meta is laying off employees across units including Instagram, WhatsApp and Reality Labs, the Verge reported on Wednesday, citing people familiar with the matter. A Meta spokesperson told Reuters in a statement that a few of its teams were making changes to align with their long-term strategic goals and location strategy. \"This includes moving some teams to different locations, and moving some employees to different roles. In situations like these when a role is eliminated, we work hard to find other opportunities for impacted employees,\" the spokesperson said. The Verge report did not specify the exact number of job cuts but mentioned that they were small. Meta also did not comment on the numbers. Separately, the Financial Times reported that Meta fired another two dozen staff in Los Angeles for allegedly using their daily $25 meal credits to instead buy household items including acne pads, wine glasses and laundry detergent. ","cleaned_content":"meta is laying off employees across units including instagram whatsapp and reality labs the verge reported on wednesday citing people familiar with the matter a meta spokesperson told reuters in a statement that a few of its teams were making changes to align with their long term strategic goals and location strategy this includes moving some teams to different locations and moving some employees to different roles in situations like these when a role is eliminated we work hard to find other opportunities for impacted employees the spokesperson said the verge report did not specify the exact number of job cuts but mentioned that they were small meta also did not comment on the numbers separately the financial times reported that meta fired another two dozen staff in los angeles for allegedly using their daily \u003cTWO_TEN\u003e meal credits to instead buy household items including acne pads wine glasses and laundry detergent","timestamp":"2024-10-17T08:43:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}