{"url":"https://economictimes.indiatimes.com/tech/technology/south-korea-vows-to-prevent-technology-leaks-with-heavier-penalties/articleshow/114303873.cms","title":"South Korea vows to prevent technology leaks with heavier penalties","description":"The South Korea government will set up a \"big data\" system aimed at preventing technology leaks at the patent agency and introduce new regulations to ensure stronger punishment for culprits, Choi said. He did not specify what the stronger penalties would be under the new regulations.","content":"South Korea will prepare stronger measures in a bid to prevent overseas leaks of business secrets amid intensifying competition for advanced technologies, the finance minister said on Thursday.  \"We will prevent illegal leaks of advanced technologies to raise the global competitiveness of our companies and strengthen technology leadership,\" Minister Choi Sang-mok said.  The government will set up a \"big data\" system aimed at preventing technology leaks at the patent agency and introduce new regulations to ensure stronger punishment for culprits, Choi said. He did not specify what the stronger penalties would be under the new regulations.  In the past five years, there have been 97 attempts to leak business secrets to a foreign country, with 40 of them in the semiconductor industry, according to the National Intelligence Service.  If successful, they would have resulted in a total loss to the country of around 23 trillion won ($16.85 billion), the spy agency estimates. ","cleaned_content":"south korea will prepare stronger measures in a bid to prevent overseas leaks of business secrets amid intensifying competition for advanced technologies the finance minister said on thursday we will prevent illegal leaks of advanced technologies to raise the global competitiveness of our companies and strengthen technology leadership minister choi sang mok said the government will set up a big data system aimed at preventing technology leaks at the patent agency and introduce new regulations to ensure stronger punishment for culprits choi said he did not specify what the stronger penalties would be under the new regulations in the past five years there have been \u003cNINE_TEN\u003e attempts to leak business secrets to a foreign country with \u003cFOUR_TEN\u003e of them in the semiconductor industry according to the national intelligence service if successful they would have resulted in a total loss to the country of around \u003cTWO_TEN\u003e trillion won \u003cONE_TEN\u003e billion the spy agency estimates","timestamp":"2024-10-17T11:12:00+05:30","market_timestamp":"2024-10-17T11:12:00+05:30","off_market_hours":false}