{"url":"https://economictimes.indiatimes.com/tech/technology/fbi-arrests-man-over-sec-hack-alleging-bitcoin-manipulation/articleshow/114339234.cms","title":"FBI arrests man over SEC hack, alleging bitcoin manipulation","description":"In January, a hacker posted false news on the SEC's @SECGov X social media account announcing the agency had approved bitcoin exchange-traded funds, causing the price of the cryptocurrency to spike. The agency quickly disavowed and deleted the post.","content":"A 25-year-old Alabama man was arrested on Thursday for hacking the U.S. Securities and Exchange Commission's X account this year as part of an alleged conspiracy to manipulate bitcoin prices, U.S. prosecutors said. In January, a hacker posted false news on the SEC's @SECGov X social media account announcing the agency had approved bitcoin exchange-traded funds, causing the price of the cryptocurrency to spike. The agency quickly disavowed and deleted the post. The incident sparked criticism of the SEC, the top U.S. markets regulator, and renewed concerns over security on X since it was acquired by billionaire Elon Musk in October 2022. Eric Council Jr. of Athens, Alabama, was arrested in connection with the \"SIM-swapping\" hack, the U.S. Attorney's office for the District of Columbia said in a statement. A lawyer for Council did not immediately respond to requests for comment.","cleaned_content":"a \u003cTWO_TEN\u003e year old alabama man was arrested on thursday for hacking the u s securities and exchange commissions x account this year as part of an alleged conspiracy to manipulate bitcoin prices u s prosecutors said in january a hacker posted false news on the secs secgov x social media account announcing the agency had approved bitcoin exchange traded funds causing the price of the cryptocurrency to spike the agency quickly disavowed and deleted the post the incident sparked criticism of the sec the top u s markets regulator and renewed concerns over security on x since it was acquired by billionaire elon musk in october \u003cTWO_THOUSAND\u003e eric council jr of athens alabama was arrested in connection with the sim swapping hack the u s attorneys office for the district of columbia said in a statement a lawyer for council did not immediately respond to requests for comment","timestamp":"2024-10-18T11:41:00+05:30","market_timestamp":"2024-10-18T11:41:00+05:30","off_market_hours":false}