{"url":"https://economictimes.indiatimes.com/tech/technology/google-leadership-shuffle-ad-and-search-head-prabhakar-raghavan-steps-down-to-take-new-role/articleshow/114338029.cms","title":"Google leadership shuffle: ad and search head Prabhakar Raghavan steps down to take new role","description":"Raghavan used to oversee ads and several other critical business areas for the world’s largest online search company. Raghavan’s new role will focus on driving strategic technical direction and nurturing Google’s culture of technological excellence. He will collaborate closely with Pichai and other executives to ensure Google stays at the forefront of innovation, the memo said.","content":"Google has announced a major leadership reshuffle. In a memo to employees, Alphabet and Google CEO Sundar Pichai revealed that Prabhakar Raghavan, who has been the company's long-time head of advertising and search, will transition to a new role of chief technologist.Replacing Raghavan will be Nick Fox, a long-standing executive in the search and ads division of Google. Fox will head search, ads, geo, and commerce operations. He has played a crucial role in developing products like Google Fi and RCS messaging.Raghavan used to oversee ads and several other critical business areas for the world’s largest online search company. Raghavan’s new role will focus on driving strategic technical direction and nurturing Google’s culture of technological excellence. He will collaborate closely with Pichai and other executives to ensure Google stays at the forefront of innovation, the memo said.“Prabhakar has decided it’s time to make a big leap in his own career,” Pichai wrote. “After 12 years leading teams across Google, he’ll return to his computer science roots and take on the role of Chief Technologist at Google. In this role, he’ll partner closely with me and Google leads to provide technical direction and leadership and grow our culture of tech excellence.”Additionally, the company is reorganising parts of its research and development efforts. The Gemini app team, led by Sissie Hsaio, will now be integrated into Google DeepMind, Google’s AI research subsidiary. Meanwhile, the Google Assistant team will merge with the platforms and devices division.","cleaned_content":"google has announced a major leadership reshuffle in a memo to employees alphabet and google ceo sundar pichai revealed that prabhakar raghavan who has been the companys long time head of advertising and search will transition to a new role of chief technologist replacing raghavan will be nick fox a long standing executive in the search and ads division of google fox will head search ads geo and commerce operations he has played a crucial role in developing products like google fi and rcs messaging raghavan used to oversee ads and several other critical business areas for the world s largest online search company raghavan s new role will focus on driving strategic technical direction and nurturing google s culture of technological excellence he will collaborate closely with pichai and other executives to ensure google stays at the forefront of innovation the memo said prabhakar has decided it s time to make a big leap in his own career pichai wrote after \u003cONE_TEN\u003e years leading teams across google he ll return to his computer science roots and take on the role of chief technologist at google in this role he ll partner closely with me and google leads to provide technical direction and leadership and grow our culture of tech excellence additionally the company is reorganising parts of its research and development efforts the gemini app team led by sissie hsaio will now be integrated into google deepmind google s ai research subsidiary meanwhile the google assistant team will merge with the platforms and devices division","timestamp":"2024-10-18T10:58:00+05:30","market_timestamp":"2024-10-18T10:58:00+05:30","off_market_hours":false}