{"url":"https://economictimes.indiatimes.com/tech/technology/indias-chip-industry-from-stalled-to-successful/articleshow/114381536.cms","title":"India's chip industry: From stalled to successful","description":"Despite a slow start, India’s semiconductor ambitions have seen major milestones. Now more widespread initiatives are needed for this momentum to continue.","content":"India’s semiconductor journey, long stalled on the silicon highway, has finally crossed a significant milestone. The government has found success in its first phase of the `76,000 crore incentive fund under the India Semiconductor Mission (ISM), initiated in December 2021. In less than 36 months, five semiconductor projects have been approved for central and state government incentives. These include four chip packaging plants and one chip fabrication unit, all in various stages of construction, expected to be operational between 2025 and 2027.As the first phase of ISM concludes, experts are urging the second phase of the project which is expected to be launched soon to focus on forging partnerships with global semiconductor leaders, expanding the ecosystem for raw materials like chemicals and gases, and intensifying efforts to develop skilled talent for the growing industry.Also Read: Five approved semiconductor units across India and projects in pipelineFollowing the greenlight for a $2.75 billion assembly, testing, marking, and packaging (ATMP) unit by Micron, domestic heavyweights like the Tata Group, Murugappa Group, and Kaynes Semicon have stepped into the semiconductor arena with proposals for manufacturing and assembly units.","cleaned_content":"india s semiconductor journey long stalled on the silicon highway has finally crossed a significant milestone the government has found success in its first phase of the \u003cSEVEN_TEN_THOUSAND\u003e crore incentive fund under the india semiconductor mission ism initiated in december \u003cTWO_THOUSAND\u003e in less than \u003cTHREE_TEN\u003e months five semiconductor projects have been approved for central and state government incentives these include four chip packaging plants and one chip fabrication unit all in various stages of construction expected to be operational between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e as the first phase of ism concludes experts are urging the second phase of the project which is expected to be launched soon to focus on forging partnerships with global semiconductor leaders expanding the ecosystem for raw materials like chemicals and gases and intensifying efforts to develop skilled talent for the growing industry also read five approved semiconductor units across india and projects in pipelinefollowing the greenlight for a \u003cTWO_\u003e billion assembly testing marking and packaging atmp unit by micron domestic heavyweights like the tata group murugappa group and kaynes semicon have stepped into the semiconductor arena with proposals for manufacturing and assembly units","timestamp":"2024-10-20T17:31:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}