{"url":"https://economictimes.indiatimes.com/tech/technology/fintech-firms-nbfc-co-lending-biz-under-stress-after-rbi-action/articleshow/114325715.cms","title":"Fintech firms’ NBFC co-lending biz under stress after RBI action","description":"There could be a direct impact on co-lending arrangements after the Reserve Bank of India’s (RBI) action on Navi and DMI Finance, two major new-age lending companies, said industry insiders.","content":"Fintech firms which rely on co-lending partnerships with large non-banking finance companies (NBFCs) could be in for more stress, after the Reserve Bank of India’s action on Navi and DMI Finance on Thursday, industry executives told ET.Fintechs typically charge higher interest rates given they cater to the sub-prime category of customers, offering them unsecured credit. With the RBI raising this issue of usurious interest rates, platforms might need to tweak their models.In the fintech world, interest rates can climb up to 35%-40% per annum, depending on the borrower profile. While banks and NBFCs partnered with such fintechs given the demand in the market, this might come to a grinding halt now.“Co-lending is a key business growth driver for fintechs. Now large NBFCs will relook into these arrangements after the recent RBI action,” said the founder of a fintech lending startup.On Thursday, the RBI asked Navi and DMI Finance, two major new-age NBFCs, to stop offering credit products from October 21. The regulator cited reasons like very high interest rates, not adhering to regulatory principles and guidelines on assessment of customers as the reasons for the action.","cleaned_content":"fintech firms which rely on co lending partnerships with large non banking finance companies nbfcs could be in for more stress after the reserve bank of india s action on navi and dmi finance on thursday industry executives told et fintechs typically charge higher interest rates given they cater to the sub prime category of customers offering them unsecured credit with the rbi raising this issue of usurious interest rates platforms might need to tweak their models in the fintech world interest rates can climb up to \u003cTHREE_TEN_PERCENT\u003e \u003cFOUR_TEN_PERCENT\u003e per annum depending on the borrower profile while banks and nbfcs partnered with such fintechs given the demand in the market this might come to a grinding halt now co lending is a key business growth driver for fintechs now large nbfcs will relook into these arrangements after the recent rbi action said the founder of a fintech lending startup on thursday the rbi asked navi and dmi finance two major new age nbfcs to stop offering credit products from october \u003cTWO_TEN\u003e the regulator cited reasons like very high interest rates not adhering to regulatory principles and guidelines on assessment of customers as the reasons for the action","timestamp":"2024-10-18T06:01:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}