{"url":"https://economictimes.indiatimes.com/tech/technology/iimb-to-establish-centre-of-excellence-for-fintech-backed-by-govt/articleshow/114432232.cms","title":"IIMB to establish ‘Centre of Excellence for fintech’ backed by govt","description":"The government has allocated Rs 13.24 crores for the centre’s operations over a five-year period. ​​The CoE aims to accelerate the growth of fintech in the state by leveraging its thriving entrepreneurial ecosystem, facilitating innovation, and providing extensive support for startups in the financial technology sector.","content":"The Karnataka government will establish a Centre of Excellence (CoE) in fintech in partnership with NSRCEL (Nadathur S Raghavan Centre for Entrepreneurial Learning)-- IIMB’s incubation centre on Monday. The CoE aims to accelerate the growth of fintech in the state by leveraging its thriving entrepreneurial ecosystem, facilitating innovation, and providing extensive support for startups in the financial technology sector.The government has allocated Rs 13.24 crores for the centre’s operations over a five-year period. The incubation and acceleration program costs are estimated at Rs 8.19 crores, while Rs 5.04 crores have been allocated for the skilling and training programmes, stated a government release.The CoE will run a 12-month programme for 20 startups, offering mentorship, industry insights, infrastructure, office space, and networking opportunities to help them grow. NSRCEL will lead the CoE as the implementing agency and drive innovation through startup incubation, acceleration, skill development programmes, and sandbox environments for the startups.","cleaned_content":"the karnataka government will establish a centre of excellence coe in fintech in partnership with nsrcel nadathur s raghavan centre for entrepreneurial learning iimb s incubation centre on monday the coe aims to accelerate the growth of fintech in the state by leveraging its thriving entrepreneurial ecosystem facilitating innovation and providing extensive support for startups in the financial technology sector the government has allocated rs \u003cONE_TEN\u003e crores for the centre s operations over a five year period the incubation and acceleration program costs are estimated at rs \u003cEIGHT_\u003e crores while rs \u003cFIVE_\u003e crores have been allocated for the skilling and training programmes stated a government release the coe will run a \u003cONE_TEN\u003e month programme for \u003cTWO_TEN\u003e startups offering mentorship industry insights infrastructure office space and networking opportunities to help them grow nsrcel will lead the coe as the implementing agency and drive innovation through startup incubation acceleration skill development programmes and sandbox environments for the startups","timestamp":"2024-10-21T19:36:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}