{"url":"https://economictimes.indiatimes.com/tech/technology/groww-fy24-revenue-more-than-doubles-co-pays-rs-1340-cr-for-domicile-shift/articleshow/114422498.cms","title":"Groww pays $160 million tax for domicile shift; losses rise","description":"Groww's Operational profit rose to Rs 535 crore from Rs 458 crore in FY23, according to the company. Groww relocated its domicile to India earlier this year, joining the wave of Indian startups engaging in \"reverse-flipping\" to capitalise on the country’s evolving startup ecosystem.","content":"Stock broking platform Groww paid Rs 1,340 crore ($160 million) in taxes, as it flipped its parent entity from the US to India in May this year. The tax payout resulted in Groww clocking a net loss of Rs 805 crore for the financial year ending March 31, 2024. At an operational level the fintech reported a profit of Rs 535 crore up from Rs 458 crore in FY23.The Bengaluru-based startup joins Walmart-owned PhonePe which flipped to India from Singapore in October 2022 and paid a billion dollars in taxes to the Indian governmentUnlike PhonePe which executed a share swap deal between its Indian and Singapore units, Groww merged its US parent with its Indian entity, thereby paying taxes in the US. The Peak XV Partners-backed startup was last valued at $3 billion in 2021. The company has not raised any major institutional equity round since then.  ","cleaned_content":"stock broking platform groww paid rs \u003cONE_THOUSAND\u003e crore \u003cONE_HUNDRED\u003e million in taxes as it flipped its parent entity from the us to india in may this year the tax payout resulted in groww clocking a net loss of rs \u003cEIGHT_HUNDRED\u003e crore for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e at an operational level the fintech reported a profit of rs \u003cFIVE_HUNDRED\u003e crore up from rs \u003cFOUR_HUNDRED\u003e crore in fy23 the bengaluru based startup joins walmart owned phonepe which flipped to india from singapore in october \u003cTWO_THOUSAND\u003e and paid a billion dollars in taxes to the indian governmentunlike phonepe which executed a share swap deal between its indian and singapore units groww merged its us parent with its indian entity thereby paying taxes in the us the peak xv partners backed startup was last valued at \u003cTHREE_\u003e billion in \u003cTWO_THOUSAND\u003e the company has not raised any major institutional equity round since then","timestamp":"2024-10-22T12:02:00+05:30","market_timestamp":"2024-10-22T12:02:00+05:30","off_market_hours":false}