{"url":"https://economictimes.indiatimes.com/tech/technology/blackberry-exploring-options-for-cylance-business/articleshow/114301128.cms","title":"BlackBerry exploring options for Cylance business","description":"BlackBerry - once a dominant force in the smartphone market - has transitioned into selling software for devices and autonomous vehicles and bought Cylance in 2019 for $1.4 billion. The Canadian firm said it plans to increase capital allocation to its secure communications and internet of things (IoT) businesses, as both of them are profitable and key growth drivers.","content":"BlackBerry forecast profit for its next fiscal year above market estimates and said it was exploring options for its Cylance business, sending shares of the Canadian company more than 4% higher on Wednesday. In an investor day presentation, the company said it was looking to redirect spending to high-growth areas from Cylance, which requires significant levels of investment and faces strong competition.  It expects Cylance, which uses machine learning to preempt security breaches, to post an adjusted core loss of $51 million for the current fiscal year.  BlackBerry - once a dominant force in the smartphone market - has transitioned into selling software for devices and autonomous vehicles and bought Cylance in 2019 for $1.4 billion. The Canadian firm said it plans to increase capital allocation to its secure communications and internet of things (IoT) businesses, as both of them are profitable and key growth drivers.","cleaned_content":"blackberry forecast profit for its next fiscal year above market estimates and said it was exploring options for its cylance business sending shares of the canadian company more than \u003cFOUR_PERCENT\u003e higher on wednesday in an investor day presentation the company said it was looking to redirect spending to high growth areas from cylance which requires significant levels of investment and faces strong competition it expects cylance which uses machine learning to preempt security breaches to post an adjusted core loss of \u003cFIVE_TEN\u003e million for the current fiscal year blackberry once a dominant force in the smartphone market has transitioned into selling software for devices and autonomous vehicles and bought cylance in \u003cTWO_THOUSAND\u003e for \u003cONE_\u003e billion the canadian firm said it plans to increase capital allocation to its secure communications and internet of things iot businesses as both of them are profitable and key growth drivers","timestamp":"2024-10-17T09:46:00+05:30","market_timestamp":"2024-10-17T09:46:00+05:30","off_market_hours":false}