{"url":"https://economictimes.indiatimes.com/tech/technology/australias-planned-social-media-ban-raises-teen-isolation-fears/articleshow/114270020.cms","title":"Australia's planned social media ban raises teen isolation fears","description":"\"It's the only way I've ever connected to my grandma before, over socials,\" said Hussein, who was born in the Democratic Republic of Congo but lived in a refugee camp in Malawi before settling in Australia when she was nine. While Hussein rarely posts on social media, she uses Meta's Instagram and Snapchat primarily to view and discuss photos and videos from family and friends. Some 97% of Australian teenagers use social media across an average of four platforms, surveys show, making them among the world's most connected youth.","content":"For Tereza Hussein, a 14-year-old refugee who lives in Darwin, Australia's planned social media ban would mean losing a direct line to the most important person to her: a grandmother she has never physically met. \"It's the only way I've ever connected to my grandma before, over socials,\" said Hussein, who was born in the Democratic Republic of Congo but lived in a refugee camp in Malawi before settling in Australia when she was nine. \"It's going to have a very big change in my life because it's going to be hard for me to talk to the people that I've left behind,\" she said. While Hussein rarely posts on social media, she uses Meta's Instagram and Snapchat primarily to view and discuss photos and videos from family and friends. She represents what experts say is a blind spot in a plan by Australia's government to put an age minimum on social media in response to concerns about bullying, predatory grooming and physical and mental health.","cleaned_content":"for tereza hussein a \u003cONE_TEN\u003e year old refugee who lives in darwin australias planned social media ban would mean losing a direct line to the most important person to her a grandmother she has never physically met its the only way ive ever connected to my grandma before over socials said hussein who was born in the democratic republic of congo but lived in a refugee camp in malawi before settling in australia when she was nine its going to have a very big change in my life because its going to be hard for me to talk to the people that ive left behind she said while hussein rarely posts on social media she uses metas instagram and snapchat primarily to view and discuss photos and videos from family and friends she represents what experts say is a blind spot in a plan by australias government to put an age minimum on social media in response to concerns about bullying predatory grooming and physical and mental health","timestamp":"2024-10-16T09:53:00+05:30","market_timestamp":"2024-10-16T09:53:00+05:30","off_market_hours":false}