{"url":"https://economictimes.indiatimes.com/tech/technology/temasek-seeks-cci-nod-for-investment-in-rebel-foods/articleshow/114285566.cms","title":"Temasek seeks CCI nod for investment in Rebel Foods","description":"On August 26, ET had reported that Temasek is in advanced discussions to lead an investment of $100-150 million in Rebel Foods. The deal will be a mix of both primary and secondary share sales, with a nearly flat valuation compared to its previous round nearly three years ago.","content":"Singaporean sovereign fund Temasek is seeking the Competition Commission of India’s (CCI) approval for a significant investment in Rebel Foods, the parent company of Faasos and Behrouz Biryani. On August 26, ET had reported that Temasek is in advanced discussions to lead an investment of $100-150 million in Rebel Foods. The deal will be a mix of both primary and secondary share sales, with a nearly flat valuation compared to its previous round nearly three years ago.The secondary sale is likely to be at a lower valuation of around $700 million. US-based Coatue and homegrown fund Lightbox are expected to partially divest their stakes in this funding round.In October 2021, the Mumbai-based firm turned unicorn following a $175-million round led by sovereign wealth fund Qatar Investment Authority (QIA), valuing it at $1.4 billion.","cleaned_content":"singaporean sovereign fund temasek is seeking the competition commission of india s cci approval for a significant investment in rebel foods the parent company of faasos and behrouz biryani on august \u003cTWO_TEN\u003e et had reported that temasek is in advanced discussions to lead an investment of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e million in rebel foods the deal will be a mix of both primary and secondary share sales with a nearly flat valuation compared to its previous round nearly three years ago the secondary sale is likely to be at a lower valuation of around \u003cSEVEN_HUNDRED\u003e million us based coatue and homegrown fund lightbox are expected to partially divest their stakes in this funding round in october \u003cTWO_THOUSAND\u003e the mumbai based firm turned unicorn following a \u003cONE_HUNDRED\u003e million round led by sovereign wealth fund qatar investment authority qia valuing it at \u003cONE_\u003e billion","timestamp":"2024-10-16T17:57:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}