{"url":"https://economictimes.indiatimes.com/tech/technology/apples-new-iphone-sales-in-china-jump-20-in-first-3-weeks-counterpoint-says/articleshow/114371656.cms","title":"Apple's new iPhone sales in China jump 20% in first 3 weeks, Counterpoint says","description":"Both Apple and Huawei's latest smartphones went on sale in China on Sept. 20, underscoring intensifying competition in the world's biggest smartphone market where the US firm has been losing market share in recent quarters to domestic rivals.","content":"Apple Inc's new iPhones got off to a strong start in China, with their sales rising 20% in their first three weeks since their launch compared with its 2023 model, according to data from research firm Counterpoint. Both Apple and Huawei's latest smartphones went on sale in China on Sept. 20, underscoring intensifying competition in the world's biggest smartphone market where the US firm has been losing market share in recent quarters to domestic rivals. \"We're seeing strong iPhone 16 series unit sales in China,\" Counterpoint said, adding the iPhone 16 Pro and Pro Max models were doing particularly well, with their combined sales rising 44% compared with their equivalent 2023 versions. Overall iPhone unit sales in China, however, dropped 2% year on year during the three-week period because of decreased sales of older models and increased competition with Huawei's Mate and Pura series, it said. ","cleaned_content":"apple incs new iphones got off to a strong start in china with their sales rising \u003cTWO_TEN_PERCENT\u003e in their first three weeks since their launch compared with its \u003cTWO_THOUSAND\u003e model according to data from research firm counterpoint both apple and huaweis latest smartphones went on sale in china on sept \u003cTWO_TEN\u003e underscoring intensifying competition in the worlds biggest smartphone market where the us firm has been losing market share in recent quarters to domestic rivals were seeing strong iphone \u003cONE_TEN\u003e series unit sales in china counterpoint said adding the iphone \u003cONE_TEN\u003e pro and pro max models were doing particularly well with their combined sales rising \u003cFOUR_TEN_PERCENT\u003e compared with their equivalent \u003cTWO_THOUSAND\u003e versions overall iphone unit sales in china however dropped \u003cTWO_PERCENT\u003e year on year during the three week period because of decreased sales of older models and increased competition with huaweis mate and pura series it said","timestamp":"2024-10-19T14:26:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}