{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-issues-bonus-shares-at-11-adds-978-headcount-in-september-quarter/articleshow/114317411.cms","title":"Wipro issues bonus shares at 1:1; adds 978 headcount in September quarter","description":"This is Wipro’s first bonus share issue since 2019, when it offered one bonus share for every three shares held. In total, Wipro has issued bonus shares 13 times in its history.","content":"Wipro on Thursday announced a bonus share issue in the ratio of 1:1 to its shareholders. The company’s board of directors met to approve the issuance of one bonus share for every fully paid-up equity share held.This is Wipro’s first bonus share issue since 2019, when it offered one bonus share for every three shares held. In total, Wipro has issued bonus shares 13 times in its history.In its BSE filing, Wipro stated that eligible shareholders, including holders of American Depositary Shares (ADS), will receive one bonus equity share of ₹2 each for every one equity share held as of the record date.Continuing its headcount growth for the second consecutive quarter, Wipro, India’s fourth-largest IT company, added 978 employees during Q2FY25. The total headcount at the end of September stood at 233,889, up from 232,911 in the previous quarter.In comparison, Infosys, the second-largest Indian IT services firm, added 2,456 employees during the same period, bringing its total headcount to 317,788, up from 315,332 in the prior quarter.","cleaned_content":"wipro on thursday announced a bonus share issue in the ratio of \u003cONE_\u003e \u003cONE_\u003e to its shareholders the company s board of directors met to approve the issuance of one bonus share for every fully paid up equity share held this is wipro s first bonus share issue since \u003cTWO_THOUSAND\u003e when it offered one bonus share for every three shares held in total wipro has issued bonus shares \u003cONE_TEN\u003e times in its history in its bse filing wipro stated that eligible shareholders including holders of american depositary shares ads will receive one bonus equity share of \u003cTWO_\u003e each for every one equity share held as of the record date continuing its headcount growth for the second consecutive quarter wipro india s fourth largest it company added \u003cNINE_HUNDRED\u003e employees during q2fy25 the total headcount at the end of september stood at \u003cTWO_HUNDRED_THOUSAND\u003e up from \u003cTWO_HUNDRED_THOUSAND\u003e in the previous quarter in comparison infosys the second largest indian it services firm added \u003cTWO_THOUSAND\u003e employees during the same period bringing its total headcount to \u003cTHREE_HUNDRED_THOUSAND\u003e up from \u003cTHREE_HUNDRED_THOUSAND\u003e in the prior quarter","timestamp":"2024-10-17T17:16:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}