{"url":"https://economictimes.indiatimes.com/tech/technology/75-consumers-unaware-of-masked-aadhaar-as-identity-proof-survey/articleshow/114469899.cms","title":"75% consumers unaware of masked Aadhaar as identity proof: survey","description":"A PwC report reveals a significant lack of awareness about the Digital Personal Data Protection (DPDP) Act among Indian consumers and businesses. The report highlights the need for increased awareness and trust-building efforts to address these gaps.","content":"Over 75% of surveyed individuals are not aware that a masked Aadhaar, wherein only the last four digits are visible, is an accepted proof of identity. 72% are also uninformed about the rules of handling a minor's data and the requirement of needing the consent of parents or guardians—these are findings revealed in a PwC report.The report noted that out of the surveyed individuals, only 16% of consumers are aware of the Digital Personal Data Protection (DPDP) Act across diverse geographies, age groups, occupational backgrounds, and urban-rural divides. Of these, 56% of consumers lack awareness of their rights related to personal data, and 69% of consumers are not aware of their rights to withdraw their consent.“The survey underpins the need for greater awareness about the rights and duties of individuals concerning their personal information. Currently, consumers are significantly unaware of the privileges given to them by the DPDP Act,” read the report titled ‘How Aware and Prepared Are Indian Consumers and Businesses to Navigate the New Era of Digital Privacy? A Survey of India’s Data Privacy Landscape.’","cleaned_content":"over \u003cSEVEN_TEN_PERCENT\u003e of surveyed individuals are not aware that a masked aadhaar wherein only the last four digits are visible is an accepted proof of identity \u003cSEVEN_TEN_PERCENT\u003e are also uninformed about the rules of handling a minors data and the requirement of needing the consent of parents or guardians these are findings revealed in a pwc report the report noted that out of the surveyed individuals only \u003cONE_TEN_PERCENT\u003e of consumers are aware of the digital personal data protection dpdp act across diverse geographies age groups occupational backgrounds and urban rural divides of these \u003cFIVE_TEN_PERCENT\u003e of consumers lack awareness of their rights related to personal data and \u003cSIX_TEN_PERCENT\u003e of consumers are not aware of their rights to withdraw their consent the survey underpins the need for greater awareness about the rights and duties of individuals concerning their personal information currently consumers are significantly unaware of the privileges given to them by the dpdp act read the report titled how aware and prepared are indian consumers and businesses to navigate the new era of digital privacy a survey of india s data privacy landscape","timestamp":"2024-10-22T19:54:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}