{"url":"https://economictimes.indiatimes.com/tech/technology/karnataka-announces-cess-on-transactions-conducted-through-aggregator-platforms-to-support-gig-workers/articleshow/114368055.cms","title":"Karnataka announces cess on transactions conducted through aggregator platforms to support gig workers","description":"Addressing a press conference, Karnataka Labour Minister Santosh Lad said, \"The Labour Department of Karnataka has decided to impose cess on every transaction on aggregator platforms like Zomato, Dunzo, Swiggy, Zepto, Ola and others such.\"","content":"The government of Karnataka has announced to impose new cess on transactions conducted through aggregator platforms such as Zomato, Swiggy, Ola, Uber and others to provide social security to gig workers. Addressing a press conference, Karnataka Labour Minister Santosh Lad said, \"The Labour Department of Karnataka has decided to impose cess on every transaction on aggregator platforms like Zomato, Dunzo, Swiggy, Zepto, Ola and others such.\"\"The money that will be collected will be used for the welfare fund for gig workers. We are not charging for products or goods that consumers purchase; they will be charged only on transport,\" he added. The state government has already drafted a bill to protect the rights of platform-based gig workers.In the draft, the state government says that the bill intends \"to place obligations on the aggregators in relation to social security, occupational health and safety, and transparency.\"","cleaned_content":"the government of karnataka has announced to impose new cess on transactions conducted through aggregator platforms such as zomato swiggy ola uber and others to provide social security to gig workers addressing a press conference karnataka labour minister santosh lad said the labour department of karnataka has decided to impose cess on every transaction on aggregator platforms like zomato dunzo swiggy zepto ola and others such the money that will be collected will be used for the welfare fund for gig workers we are not charging for products or goods that consumers purchase they will be charged only on transport he added the state government has already drafted a bill to protect the rights of platform based gig workers in the draft the state government says that the bill intends to place obligations on the aggregators in relation to social security occupational health and safety and transparency","timestamp":"2024-10-19T11:33:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}