{"url":"https://economictimes.indiatimes.com/tech/technology/tata-electronics-served-show-cause-notice-over-fire-mishap/articleshow/114289264.cms","title":"Tata Electronics served show cause notice over fire mishap","description":"The Directorate of Industrial Health and Safety (DISH) has demanded an explanation from the company’s occupier and factory manager regarding the incident. Tata Electronics has one week to respond, unless an extension is requested.","content":"The Tamil Nadu government has served a show-cause notice to Tata Electronics under the Directorate of Industrial Health and Safety (DISH), demanding an explanation for the massive fire that engulfed one of its units last month, people aware of the developments told ET.“The show cause notice was sent earlier this week and was addressed to the 'occupier' and the factory manager - as is customary in such cases,” one of them said, adding that the company “will have to respond to the notice within a week, unless they seek an extension.”“It is a procedural measure that is done in such instances so as to give the company a chance to explain what went wrong,” the person said.Under the Factories Act, an occupier is someone who has the ultimate authority over a factory’s affairs and is responsible for ensuring the health, safety and welfare of its workers. In the case of a company, the Act deems that any one of the directors can be deemed the occupier.“The show-cause notice also mentions that the fire broke out because of the failure of the thermostat control at the anodising plant and asks Tata Electronics to share their findings,” a second person cited above said. “In some cases, companies agree with the government’s reasoning. In others, they provide a different explanation based on their independent investigation.” The person added.","cleaned_content":"the tamil nadu government has served a show cause notice to tata electronics under the directorate of industrial health and safety dish demanding an explanation for the massive fire that engulfed one of its units last month people aware of the developments told et the show cause notice was sent earlier this week and was addressed to the occupier and the factory manager as is customary in such cases one of them said adding that the company will have to respond to the notice within a week unless they seek an extension it is a procedural measure that is done in such instances so as to give the company a chance to explain what went wrong the person said under the factories act an occupier is someone who has the ultimate authority over a factory s affairs and is responsible for ensuring the health safety and welfare of its workers in the case of a company the act deems that any one of the directors can be deemed the occupier the show cause notice also mentions that the fire broke out because of the failure of the thermostat control at the anodising plant and asks tata electronics to share their findings a second person cited above said in some cases companies agree with the government s reasoning in others they provide a different explanation based on their independent investigation the person added","timestamp":"2024-10-17T06:00:00+05:30","market_timestamp":"2024-10-17T09:15:00+05:30","off_market_hours":true}