{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-sectors-top-firms-reverse-headcount-fall-after-7-quarters/articleshow/114383175.cms","title":"IT sector’s top firms reverse headcount fall after 7 quarters","description":"After a period of declining headcount, India's leading IT companies have reversed the trend, collectively hiring over 17,500 employees in the September quarter. This surge in hiring comes amid a recovery in demand and increased deal wins.","content":"Five out of India's top six IT companies—Tata Consultancy Services (TCS), Infosys, Wipro, Tech Mahindra and LTIMindtree hired more than 17,500 employees in total in the September quarter. This marked a reversal of declining headcount trend in the over $250-billion Indian IT industry after nearly seven quarters.HCLTech was the only company from the top tier to see its workforce reduce by 780 people last quarter largely due to its divestment of a joint venture with US-based State Street.India’s IT industry had shed a record more than 70,000 employees in FY24. The first quarter of this fiscal year saw a cumulative decline of 1,750 employees.The turnaround in employee addition tracks healthy deal wins in the first two quarters of FY25 amid a recovery in demand. Companies temporarily halted fresh hirings or trimmed headcount amid tepid business growth for four to five quarters after the pandemic-induced runaway peak growth momentum.The top four firms bagged around 33 deals in July and August, ET reported last month. ","cleaned_content":"five out of indias top six it companies tata consultancy services tcs infosys wipro tech mahindra and ltimindtree hired more than \u003cONE_TEN_THOUSAND\u003e employees in total in the september quarter this marked a reversal of declining headcount trend in the over \u003cTWO_HUNDRED\u003e billion indian it industry after nearly seven quarters hcltech was the only company from the top tier to see its workforce reduce by \u003cSEVEN_HUNDRED\u003e people last quarter largely due to its divestment of a joint venture with us based state street india s it industry had shed a record more than \u003cSEVEN_TEN_THOUSAND\u003e employees in fy24 the first quarter of this fiscal year saw a cumulative decline of \u003cONE_THOUSAND\u003e employees the turnaround in employee addition tracks healthy deal wins in the first two quarters of fy25 amid a recovery in demand companies temporarily halted fresh hirings or trimmed headcount amid tepid business growth for four to five quarters after the pandemic induced runaway peak growth momentum the top four firms bagged around \u003cTHREE_TEN\u003e deals in july and august et reported last month","timestamp":"2024-10-20T16:09:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}