{"url":"https://economictimes.indiatimes.com/tech/technology/in-2025-gen-zs-direct-spends-will-amount-to-250-billion-snap-inc-and-bcgs-latest-report/articleshow/114270548.cms","title":"In 2025, Gen Z’s direct spends will amount to $250 billion: Snap Inc. and BCG's latest report","description":"Currently, out of Gen Z’s total spending power of $860 billion, approximately $200 billion comes from direct spending—money they earn and spend themselves—while $660 billion comes from influenced spending, which includes purchases influenced by their recommendations or preferences.","content":"Collective spending power of Gen Z has reached $860 billion and is expected to surge to $2 trillion by 2035 with this cohort's direct spends amounting to $250 billion in 2025, a new report has shown. The report titled, \"The $2 trillion opportunity: how Gen Z is shaping the new India\" by Snap Inc in partnership with the Boston Consulting Group (BCG) finds that Gen Z is far from a homogeneous group and should be at the top of the agenda for businesses and marketers alike. Currently, out of Gen Z’s total spending power of $860 billion, approximately $200 billion comes from direct spending—money they earn and spend themselves—while $660 billion comes from influenced spending, which includes purchases influenced by their recommendations or preferences. By 2035, these figures are expected to change dramatically, with direct spending projected to reach $1.8 trillion, implying that every second rupee of consumer spend in 2035, will be driven by Gen Z, the report stated.","cleaned_content":"collective spending power of gen z has reached \u003cEIGHT_HUNDRED\u003e billion and is expected to surge to \u003cTWO_\u003e trillion by \u003cTWO_THOUSAND\u003e with this cohorts direct spends amounting to \u003cTWO_HUNDRED\u003e billion in \u003cTWO_THOUSAND\u003e a new report has shown the report titled the \u003cTWO_\u003e trillion opportunity how gen z is shaping the new india by snap inc in partnership with the boston consulting group bcg finds that gen z is far from a homogeneous group and should be at the top of the agenda for businesses and marketers alike currently out of gen z s total spending power of \u003cEIGHT_HUNDRED\u003e billion approximately \u003cTWO_HUNDRED\u003e billion comes from direct spending money they earn and spend themselves while \u003cSIX_HUNDRED\u003e billion comes from influenced spending which includes purchases influenced by their recommendations or preferences by \u003cTWO_THOUSAND\u003e these figures are expected to change dramatically with direct spending projected to reach \u003cONE_\u003e trillion implying that every second rupee of consumer spend in \u003cTWO_THOUSAND\u003e will be driven by gen z the report stated","timestamp":"2024-10-16T10:11:00+05:30","market_timestamp":"2024-10-16T10:11:00+05:30","off_market_hours":false}