{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-adds-6653-employees-in-q2-leading-the-pack/articleshow/114366368.cms","title":"Tech Mahindra adds 6,653 employees in Q2, leading the pack","description":"This is the second consecutive quarter of headcount growth for the company, following a dip of nearly 800 employees in Q4 of FY24. Tech Mahindra’s Q2 headcount addition was the highest among the top five IT services firms, which include Tata Consultancy Services (TCS), Infosys, HCLTech, and Wipro.","content":"Tech Mahindra (TechM), India's fifth-largest IT services provider, recorded a substantial uptick in headcount in the second quarter (Q2) of FY25, adding 6,653 employees. This marks an increase of 3,669 employees year-on-year.\"We hired over 2,000 freshers this quarter and are on track to meet our previously stated plan of hiring more than 6,000 freshers,\" said Rohit Anand, chief financial officer, Tech Mahindra.This is the second consecutive quarter of headcount growth for the company, following a dip of nearly 800 employees in Q4 of FY24.Tech Mahindra’s Q2 headcount addition was the highest among the top five IT services firms, which include Tata Consultancy Services (TCS), Infosys, HCLTech, and Wipro.During the same period, industry leader TCS added 5,726 employees, while Infosys, the second-largest player, hired 2,456 employees, marking an end to six consecutive quarters of headcount decline.","cleaned_content":"tech mahindra techm indias fifth largest it services provider recorded a substantial uptick in headcount in the second quarter q2 of fy25 adding \u003cSIX_THOUSAND\u003e employees this marks an increase of \u003cTHREE_THOUSAND\u003e employees year on year we hired over \u003cTWO_THOUSAND\u003e freshers this quarter and are on track to meet our previously stated plan of hiring more than \u003cSIX_THOUSAND\u003e freshers said rohit anand chief financial officer tech mahindra this is the second consecutive quarter of headcount growth for the company following a dip of nearly \u003cEIGHT_HUNDRED\u003e employees in q4 of fy24 tech mahindra s q2 headcount addition was the highest among the top five it services firms which include tata consultancy services tcs infosys hcltech and wipro during the same period industry leader tcs added \u003cFIVE_THOUSAND\u003e employees while infosys the second largest player hired \u003cTWO_THOUSAND\u003e employees marking an end to six consecutive quarters of headcount decline","timestamp":"2024-10-19T09:43:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}