{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-exclusive-inside-the-cash-crisis-big-valuation-cut-at-lendingkart/articleshow/114292316.cms","title":"ETtech Exclusive: Inside the cash crisis, big valuation cut at Lendingkart","description":"Lendingkart is in talks with Fullerton Financial Holdings, its largest shareholder, for an internal funding round at a major valuation cut. Ahmedabad-based small business-focused lending startup Lendingkart has been in the market for an equity funding round for a year now. But none of its deals have materialised yet.","content":"Lendingkart is staring at a massive valuation cut amid a cash crisis that has hit the MSME-focused lending platform over the past few months due to stress in the unsecured loan market, people familiar with the development said.The ten-year-old company is negotiating a new funding deal with existing investor Fullerton Financial Holdings (FFH), a wholly owned subsidiary of Temasek, at a valuation of $100 million, down from $350 million it commanded during its last equity fundraise four years ago, one of the persons privy to the details told ET.FFH owns around 38% stake in Lendingkart, as per data from Tracxn, and has infused Rs 722 crore into the company over the past five years, public filings showed.“Fullerton is now looking at taking its stake up to more than 60% in the company and become a majority shareholder ,” said another person privy to the deal talks.    ","cleaned_content":"lendingkart is staring at a massive valuation cut amid a cash crisis that has hit the msme focused lending platform over the past few months due to stress in the unsecured loan market people familiar with the development said the ten year old company is negotiating a new funding deal with existing investor fullerton financial holdings ffh a wholly owned subsidiary of temasek at a valuation of \u003cONE_HUNDRED\u003e million down from \u003cTHREE_HUNDRED\u003e million it commanded during its last equity fundraise four years ago one of the persons privy to the details told et ffh owns around \u003cTHREE_TEN_PERCENT\u003e stake in lendingkart as per data from tracxn and has infused rs \u003cSEVEN_HUNDRED\u003e crore into the company over the past five years public filings showed fullerton is now looking at taking its stake up to more than \u003cSIX_TEN_PERCENT\u003e in the company and become a majority shareholder said another person privy to the deal talks","timestamp":"2024-10-18T17:09:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}