{"url":"https://economictimes.indiatimes.com/tech/technology/eutelsat-uses-spacex-rocket-to-launch-first-satellites-after-merger/articleshow/114410023.cms","title":"Eutelsat uses SpaceX rocket to launch first satellites after merger","description":"A SpaceX Falcon 9 rocket took off with Eutelsat satellites from California's Vandenberg Space Force Base at 0513 GMT. \"This is the first OneWeb launch of the satellites since the merger,\" CEO Eva Berneke told Reuters in an interview. \"We will be launching more satellites over the coming years.\"","content":"Eutelsat, the world's third-biggest satellite operator by revenue, launched 20 satellites for its communications network on Sunday, using Elon Musk's SpaceX in its first move since the merger of two European companies last year. A SpaceX Falcon 9 rocket took off with Eutelsat satellites from California's Vandenberg Space Force Base at 0513 GMT. \"This is the first OneWeb launch of the satellites since the merger,\" CEO Eva Berneke told Reuters in an interview. \"We will be launching more satellites over the coming years.\" The Paris-based group formed by the merger in September last year of France's Eutelsat and Britain's OneWeb has a constellation of over 600 low earth orbit satellites that cater to broadcasters, telecom companies and radio stations. \"We really want to integrate into the telco ecosystem,\" Berneke said. \"Satellites are an interesting niche in the overall connectivity ecosystems where telcos are the big boys in the class and satellite will always be a smaller part.\"","cleaned_content":"eutelsat the worlds third biggest satellite operator by revenue launched \u003cTWO_TEN\u003e satellites for its communications network on sunday using elon musks spacex in its first move since the merger of two european companies last year a spacex falcon \u003cNINE_\u003e rocket took off with eutelsat satellites from californias vandenberg space force base at \u003cFIVE_HUNDRED\u003e gmt this is the first oneweb launch of the satellites since the merger ceo eva berneke told reuters in an interview we will be launching more satellites over the coming years the paris based group formed by the merger in september last year of frances eutelsat and britains oneweb has a constellation of over \u003cSIX_HUNDRED\u003e low earth orbit satellites that cater to broadcasters telecom companies and radio stations we really want to integrate into the telco ecosystem berneke said satellites are an interesting niche in the overall connectivity ecosystems where telcos are the big boys in the class and satellite will always be a smaller part","timestamp":"2024-10-21T08:06:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}