{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firms-upbeat-on-bfsi-discretionary-spends-takeoff/articleshow/114403370.cms","title":"IT firms upbeat on BFSI discretionary spends takeoff","description":"The BFSI (banking, financial services and insurance) sector, the largest revenue generator for the Indian IT industry, is the biggest technology spender. While some experts point to an increase in discretionary spending linked to regulatory compliance, others highlight that projects previously on hold are resuming.","content":"India’s IT industry appears to be staging a recovery from a deep slowdown, driven by an increase in discretionary spending, particularly in the financial services vertical and the North America market.The optimism expressed by leading Indian IT firms is mirrored by analysts, who see an uptick in hiring and upward guidance revisions as indicators of a brighter outlook ahead.The BFSI (banking, financial services and insurance) sector, the largest revenue generator for the Indian IT industry, is the biggest technology spender. While some experts point to an increase in discretionary spending linked to regulatory compliance, others highlight that projects previously on hold are resuming. Also, there is a push from enterprises to invest in artificial intelligence, with a focus on driving productivity and gaining competitive advantages. ","cleaned_content":"india s it industry appears to be staging a recovery from a deep slowdown driven by an increase in discretionary spending particularly in the financial services vertical and the north america market the optimism expressed by leading indian it firms is mirrored by analysts who see an uptick in hiring and upward guidance revisions as indicators of a brighter outlook ahead the bfsi banking financial services and insurance sector the largest revenue generator for the indian it industry is the biggest technology spender while some experts point to an increase in discretionary spending linked to regulatory compliance others highlight that projects previously on hold are resuming also there is a push from enterprises to invest in artificial intelligence with a focus on driving productivity and gaining competitive advantages","timestamp":"2024-10-21T06:00:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}