{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-to-seek-board-approval-for-fundraise-via-qip-route/articleshow/114318420.cms","title":"Zomato board to decide on funding via QIP on October 22","description":"The food and grocery delivery major will put up the proposal to the board on October 22, on which day it will also declare its financial results for the July-September quarter.","content":"Zomato will seek approval from its board on October 22 to raise additional funds through a public sale of shares to institutional investors, the food and grocery delivery company said in a filing with the stock exchanges Thursday.This qualified institutional placement (QIP) will be the first fundraising by Zomato since its initial public offering in July 2021. The filing did not say how much money it plans to raise.The company had raised Rs 9,000 crore by selling fresh shares in its IPO, the first public offering by a large consumer internet startup in India. Since then Zomato’s market capitalisation has grown to nearly Rs 2.4 lakh crore based on its closing share price of Rs 270.65 on the BSE Thursday.Zomato’s plan to raise capital comes at a time when its key rival, Bengaluru-based Swiggy, is preparing to launch an IPO to raise up to Rs 5,000 crore. The two companies have been arch rivals for the past decade slugging it out for private capital while raising funds in a cash-guzzling sector. Zomato has been profitable since the April-June 2023 quarter, and generated Rs 351 crore in profit after tax for the fiscal year 2023-24. The Deepinder Goyal-led company’s largest business segment, food delivery, is also the chief contributor to its profit and cash flows.","cleaned_content":"zomato will seek approval from its board on october \u003cTWO_TEN\u003e to raise additional funds through a public sale of shares to institutional investors the food and grocery delivery company said in a filing with the stock exchanges thursday this qualified institutional placement qip will be the first fundraising by zomato since its initial public offering in july \u003cTWO_THOUSAND\u003e the filing did not say how much money it plans to raise the company had raised rs \u003cNINE_THOUSAND\u003e crore by selling fresh shares in its ipo the first public offering by a large consumer internet startup in india since then zomato s market capitalisation has grown to nearly rs \u003cTWO_\u003e lakh crore based on its closing share price of rs \u003cTWO_HUNDRED\u003e on the bse thursday zomato s plan to raise capital comes at a time when its key rival bengaluru based swiggy is preparing to launch an ipo to raise up to rs \u003cFIVE_THOUSAND\u003e crore the two companies have been arch rivals for the past decade slugging it out for private capital while raising funds in a cash guzzling sector zomato has been profitable since the april june \u003cTWO_THOUSAND\u003e quarter and generated rs \u003cTHREE_HUNDRED\u003e crore in profit after tax for the fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the deepinder goyal led company s largest business segment food delivery is also the chief contributor to its profit and cash flows","timestamp":"2024-10-18T07:34:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}