{"url":"https://economictimes.indiatimes.com/tech/information-tech/amid-turnaround-tech-mahindra-net-profit-rises-46-8-at-rs-1250-crore/articleshow/114383064.cms","title":"Amid turnaround, Tech Mahindra net profit rises 46.8% at Rs 1,250 crore","description":"The company's net profit surged 46.8% sequentially, driven by a sharp focus on operational excellence and a one-time gain. Revenue growth, while modest, was supported by strong performance in key verticals like communication and hi-tech.","content":"Tech Mahindra posted a 46.8% sequential rise in net profit at Rs 1,250 crore in the fiscal second quarter propelled by a sharp focus on margins and a one-time gain from the sale of land. Profit surged 153% from a year earlier.India’s fifth largest software services company recorded a 2.4% sequential rise in revenue from operations at Rs 13,313 crore in the three months ended September. Revenue rose 3.5% year-on-year, rebounding after four straight quarters of decline.Revenue growth was led by the largest vertical of communication, as well as hi-tech and media verticals, according to the company.Operating margin increased by 1.1 percentage points sequentially to 9.6% in the September quarter. Margin also rose sharply from 4.7% a year ago.During the quarter, the company posted other income of Rs 521 crore, lifted by a one-time gain of about Rs 450 crore from sale of land.","cleaned_content":"tech mahindra posted a \u003cFOUR_TEN_PERCENT\u003e sequential rise in net profit at rs \u003cONE_THOUSAND\u003e crore in the fiscal second quarter propelled by a sharp focus on margins and a one time gain from the sale of land profit surged \u003cONE_HUNDRED_PERCENT\u003e from a year earlier india s fifth largest software services company recorded a \u003cTWO_PERCENT\u003e sequential rise in revenue from operations at rs \u003cONE_TEN_THOUSAND\u003e crore in the three months ended september revenue rose \u003cTHREE_PERCENT\u003e year on year rebounding after four straight quarters of decline revenue growth was led by the largest vertical of communication as well as hi tech and media verticals according to the company operating margin increased by \u003cONE_PERCENT\u003e age points sequentially to \u003cNINE_PERCENT\u003e in the september quarter margin also rose sharply from \u003cFOUR_PERCENT\u003e a year ago during the quarter the company posted other income of rs \u003cFIVE_HUNDRED\u003e crore lifted by a one time gain of about rs \u003cFOUR_HUNDRED\u003e crore from sale of land","timestamp":"2024-10-20T06:01:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}