{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-let-through-disinformation-in-political-ads-despite-its-own-ban-global-witness-finds/articleshow/114334978.cms","title":"TikTok let through disinformation in political ads despite its own ban, Global Witness finds","description":"The group, which did a similar investigation two years ago, did find that the companies - especially Facebook - have improved their content-moderation systems since then. But it called out TikTok for approving four of the eight ads submitted for review that contained falsehoods about the election. That's despite the platform's ban on all political ads in place since 2019.","content":"Just weeks before the U.S. presidential election, TikTok approved advertisements that contained election disinformation even though it has a ban on political ads, according to a report published Thursday by the nonprofit Global Witness.  The technology and environmental watchdog group submitted ads that it designed to test how well systems at social media companies work in detecting different types of election misinformation. The group, which did a similar investigation two years ago, did find that the companies - especially Facebook - have improved their content-moderation systems since then. But it called out TikTok for approving four of the eight ads submitted for review that contained falsehoods about the election. That's despite the platform's ban on all political ads in place since 2019. The ads never appeared on TikTok because Global Witness pulled them before they went online. ","cleaned_content":"just weeks before the u s presidential election tiktok approved advertisements that contained election disinformation even though it has a ban on political ads according to a report published thursday by the nonprofit global witness the technology and environmental watchdog group submitted ads that it designed to test how well systems at social media companies work in detecting different types of election misinformation the group which did a similar investigation two years ago did find that the companies especially facebook have improved their content moderation systems since then but it called out tiktok for approving four of the eight ads submitted for review that contained falsehoods about the election thats despite the platforms ban on all political ads in place since \u003cTWO_THOUSAND\u003e the ads never appeared on tiktok because global witness pulled them before they went online","timestamp":"2024-10-18T09:10:00+05:30","market_timestamp":"2024-10-18T09:15:00+05:30","off_market_hours":true}