{"url":"https://economictimes.indiatimes.com/tech/technology/us-plans-up-to-1-6-billion-towards-chip-packaging-tech/articleshow/114365998.cms","title":"US plans up to $1.6 billion towards chip packaging tech","description":"The funding comes under the CHIPS and Science Act, a package of incentives to boost research and US semiconductor production. \"Securing domestic packaging capabilities is a key part of our mission to expand domestic semiconductor manufacturing,\" said US Secretary of Commerce Gina Raimondo in a statement.","content":"Washington, Oct 18, 2024 -The United States expects to direct up to $1.6 billion in funding to boost semiconductor packaging, the Commerce Department said Friday, as Washington seeks to stay ahead in tech while competition with China intensifies.The funding comes under the CHIPS and Science Act, a package of incentives to boost research and US semiconductor production.\"Securing domestic packaging capabilities is a key part of our mission to expand domestic semiconductor manufacturing,\" said US Secretary of Commerce Gina Raimondo in a statement.Semiconductor packaging allows components to be combined as a single electronic device, and the latest investment seeks to drive innovation in this process.The aim, said the Commerce Department, is to help develop a \"self-sustaining, and profitable, domestic advanced packaging industry.\"","cleaned_content":"washington oct \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the united states expects to direct up to \u003cONE_\u003e billion in funding to boost semiconductor packaging the commerce department said friday as washington seeks to stay ahead in tech while competition with china intensifies the funding comes under the chips and science act a package of incentives to boost research and us semiconductor production securing domestic packaging capabilities is a key part of our mission to expand domestic semiconductor manufacturing said us secretary of commerce gina raimondo in a statement semiconductor packaging allows components to be combined as a single electronic device and the latest investment seeks to drive innovation in this process the aim said the commerce department is to help develop a self sustaining and profitable domestic advanced packaging industry","timestamp":"2024-10-19T09:14:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}