{"url":"https://economictimes.indiatimes.com/tech/technology/bits-bytes-metas-oversight-board-seeks-public-comments-on-hate-speech-moderation/articleshow/114381451.cms","title":"Bits \u0026 Bytes: Meta’s oversight board seeks public comments on hate speech moderation","description":"Meta is seeking public input on its handling of immigration-related content that might harm immigrants while Apple CEO Tim Cook expressed concerns to Donald Trump about EU-imposed financial penalties on the company. Additionally, the US has relaxed export restrictions for certain satellite and spacecraft-related items to allies.  Finally, Britain's media regulator will outline specific actions social media companies must take to address illegal content.","content":"Facebook and WhatsApp parent Meta has invited comments from the public on the posting of immigration-related content that may be harmful to immigrants and shared two cases that Facebook moderators decided to keep on the platform.The board plans to assess whether Meta’s decision to only protect refugees, migrants, immigrants, and asylum seekers from the most severe attacks on its social media platforms under its hate speech policy is adequate.The board is funded by the social media giant but operates independently. After gathering public comments, it can issue non-binding policy recommendations to Meta.Trump says Apple CEO Cook called him with concerns about EU penaltiesUS presidential candidate Donald Trump said he received a call from Apple CEO Tim Cook over concerns about the financial penalties that have been imposed by the European Union on the iPhone maker.European regulators have launched a series of investigations into Big Tech firms in recent years, with the aim of curbing their power and ensuring a level playing field for smaller rivals.","cleaned_content":"facebook and whatsapp parent meta has invited comments from the public on the posting of immigration related content that may be harmful to immigrants and shared two cases that facebook moderators decided to keep on the platform the board plans to assess whether meta s decision to only protect refugees migrants immigrants and asylum seekers from the most severe attacks on its social media platforms under its hate speech policy is adequate the board is funded by the social media giant but operates independently after gathering public comments it can issue non binding policy recommendations to meta trump says apple ceo cook called him with concerns about eu penaltiesus presidential candidate donald trump said he received a call from apple ceo tim cook over concerns about the financial penalties that have been imposed by the european union on the iphone maker european regulators have launched a series of investigations into big tech firms in recent years with the aim of curbing their power and ensuring a level playing field for smaller rivals","timestamp":"2024-10-20T06:01:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}