{"url":"https://economictimes.indiatimes.com/tech/technology/south-korea-team-showcases-drone-that-serves-as-flying-shopping-cart/articleshow/114454052.cms","title":"South Korea team showcases drone that serves as 'flying shopping cart'","description":"Members of the team demonstrated the hovering platform with a handle bar much like one on a push shopping cart moving objects up and down stairs and loading boxes on top as it hovered mid-air and maintained its balance by using a centre of mass estimation algorithm.","content":"South Korean researchers have developed a transport drone flying on multiple flexible rotors that self-correct to stay level in flight and can be used as a \"flying shopping cart\" to carry goods over uneven terrain such as stairs. The prototype developed by a Seoul National University of Science and Technology team has a cargo platform mounted on top of a multi-rotor drone and is handled by a person using gentle force to guide the hovering aircraft. Members of the team demonstrated the hovering platform with a handle bar much like one on a push shopping cart moving objects up and down stairs and loading boxes on top as it hovered mid-air and maintained its balance by using a centre of mass estimation algorithm. To move objects over uneven terrain or stairs when a wheeled cart cannot, the drone responds to human control with what the developers call a physical human-robot interaction technique that anticipates human intentions for smooth flight, said Lee Seung-jae, professor of mechanical system design engineering. But the broader focus of Lee's team is not on developing a shopping cart to be used over steps, but instead on applications that would use a drone with reliable horizontal stability without pitching and rolling. ","cleaned_content":"south korean researchers have developed a transport drone flying on multiple flexible rotors that self correct to stay level in flight and can be used as a flying shopping cart to carry goods over uneven terrain such as stairs the prototype developed by a seoul national university of science and technology team has a cargo platform mounted on top of a multi rotor drone and is handled by a person using gentle force to guide the hovering aircraft members of the team demonstrated the hovering platform with a handle bar much like one on a push shopping cart moving objects up and down stairs and loading boxes on top as it hovered mid air and maintained its balance by using a centre of mass estimation algorithm to move objects over uneven terrain or stairs when a wheeled cart cannot the drone responds to human control with what the developers call a physical human robot interaction technique that anticipates human intentions for smooth flight said lee seung jae professor of mechanical system design engineering but the broader focus of lees team is not on developing a shopping cart to be used over steps but instead on applications that would use a drone with reliable horizontal stability without pitching and rolling","timestamp":"2024-10-22T13:00:00+05:30","market_timestamp":"2024-10-22T13:00:00+05:30","off_market_hours":false}