{"url":"https://economictimes.indiatimes.com/tech/technology/prosus-to-boost-ecommerce-profit-to-400-million-for-2025-year/articleshow/114417842.cms","title":"Prosus to boost ecommerce profit to $400 million for 2025 year","description":"“In fiscal year 2024, the group improved its ecommerce adjusted EBIT by more than $400 million, and our intent is to keep that pace up this year and deliver $400 million in adjusted EBIT from our ecommerce operations,” chief executive Officer Fabricio Bloisi said in a letter about his first 100 days as CEO of the South African-Dutch tech group.","content":"Prosus NV plans to deliver $400 million in adjusted earnings before interest and tax from its ecommerce operations in the year to end-March, and sees this improving in future, chief executive officer Fabricio Bloisi said. “In fiscal year 2024, the group improved its ecommerce adjusted EBIT by more than $400 million, and our intent is to keep that pace up this year and deliver $400 million in adjusted EBIT from our ecommerce operations,” he said in a letter about his first 100 days as CEO of the South African-Dutch tech group. “I do not expect this pace of improvement to slow down next year either.”In the first half of the year, ecommerce revenue growth accelerated from fiscal 2024, generating about three times the adjusted EBIT than it did in the entire year last year, he said. “It is critical that our core ecommerce business becomes a bigger source of profitability and free cash flow for the group,” Bloisi said. Cape Town-headquartered Naspers Ltd. is one of the biggest technology investors globally and listed its internet unit, Prosus, in Amsterdam about five years ago, but kept a single CEO across both entities. Bloisi is contending with the legacy of a complicated business structure that stumped his predecessor, Bob van Dijk, including the group’s investment in Chinese tech giant Tencent Holdings Ltd., and a market environment that’s been tough on some of the group’s dozens of internet businesses.","cleaned_content":"prosus nv plans to deliver \u003cFOUR_HUNDRED\u003e million in adjusted earnings before interest and tax from its ecommerce operations in the year to end march and sees this improving in future chief executive officer fabricio bloisi said in fiscal year \u003cTWO_THOUSAND\u003e the group improved its ecommerce adjusted ebit by more than \u003cFOUR_HUNDRED\u003e million and our intent is to keep that pace up this year and deliver \u003cFOUR_HUNDRED\u003e million in adjusted ebit from our ecommerce operations he said in a letter about his first \u003cONE_HUNDRED\u003e days as ceo of the south african dutch tech group i do not expect this pace of improvement to slow down next year either in the first half of the year ecommerce revenue growth accelerated from fiscal \u003cTWO_THOUSAND\u003e generating about three times the adjusted ebit than it did in the entire year last year he said it is critical that our core ecommerce business becomes a bigger source of profitability and free cash flow for the group bloisi said cape town headquartered naspers ltd is one of the biggest technology investors globally and listed its internet unit prosus in amsterdam about five years ago but kept a single ceo across both entities bloisi is contending with the legacy of a complicated business structure that stumped his predecessor bob van dijk including the group s investment in chinese tech giant tencent holdings ltd and a market environment that s been tough on some of the group s dozens of internet businesses","timestamp":"2024-10-21T15:40:00+05:30","market_timestamp":"2024-10-22T09:15:00+05:30","off_market_hours":true}