{"url":"https://economictimes.indiatimes.com/tech/technology/delhi-hc-orders-wikipedia-page-removal-within-36-hours-amid-defamation-case/articleshow/114307683.cms","title":"Delhi HC orders Wikipedia page removal within 36 hours amid defamation case","description":"The ruling by Chief Justice Manmohan and Justice Tushar Rao Gedela, emphasises the importance of judicial integrity. The court stated, \"We are of the view that the description of the order and the judge is prima facie contemptuous and amounts to interference in proceedings.\"","content":"The Delhi High Court has mandated the removal of a Wikipedia page deemed \"prima facie contemptuous\" within 36 hours, as reported by the Times of India on Thursday. The contentious page condemned a prior directive requiring Wikipedia to disclose the identities of users who allegedly posted defamatory content regarding a news agency.The ruling by Chief Justice Manmohan and Justice Tushar Rao Gedela, emphasises the importance of judicial integrity. The court stated, \"We are of the view that the description of the order and the judge is prima facie contemptuous and amounts to interference in proceedings.\"Senior advocate Akhil Sibal, representing Wikipedia, clarified that the platform did not create either the critical page or the discussion section. Previously, on September 6, the court had cautioned the open-source platform that it would block the website in India if it failed to adhere to local laws.ANI defamation caseAsian News Agency (ANI) accused Wikipedia of permitting edits that referred to it as a \"propaganda tool\" for the government, demanding Rs 2 crore in damages. The court expressed strong disapproval of Wikipedia's failure to provide details on users who edited ANI's page.","cleaned_content":"the delhi high court has mandated the removal of a wikipedia page deemed prima facie contemptuous within \u003cTHREE_TEN\u003e hours as reported by the times of india on thursday the contentious page condemned a prior directive requiring wikipedia to disclose the identities of users who allegedly posted defamatory content regarding a news agency the ruling by chief justice manmohan and justice tushar rao gedela emphasises the importance of judicial integrity the court stated we are of the view that the description of the order and the judge is prima facie contemptuous and amounts to interference in proceedings senior advocate akhil sibal representing wikipedia clarified that the platform did not create either the critical page or the discussion section previously on september \u003cSIX_\u003e the court had cautioned the open source platform that it would block the website in india if it failed to adhere to local laws ani defamation caseasian news agency ani accused wikipedia of permitting edits that referred to it as a propaganda tool for the government demanding rs \u003cTWO_\u003e crore in damages the court expressed strong disapproval of wikipedias failure to provide details on users who edited anis page","timestamp":"2024-10-17T13:00:00+05:30","market_timestamp":"2024-10-17T13:00:00+05:30","off_market_hours":false}