{"url":"https://economictimes.indiatimes.com/tech/technology/civil-servants-need-to-keep-themselves-abreast-with-latest-technological-developments-pm-modi/articleshow/114379161.cms","title":"Civil servants need to keep themselves abreast with latest technological developments: PM Modi","description":"Speaking about two AIs - Artificial Intelligence and \"Aspirational India\" PM Narendra Modi stressed the importance of balancing both.","content":"Prime Minister Narendra Modi asked civil servants on Saturday to keep themselves abreast with latest technological developments so as to meet the rising standards and stressed the need for following a citizen-centric approach. Addressing an event here, the prime minister also suggested seeking help from startups, research agencies and youngsters for getting new ideas. With artificial intelligence, information processing is also becoming equally easy, making the citizenry informed and empowering them to keep a tab on all the activities of the government, he said. \"So the civil servants need to keep themselves abreast with latest technological developments so as to meet the rising standards, wherein Mission Karmayogi can prove to be of help,\" Modi said after launching the \"Karmayogi Saptah\" - National Learning Week at the Dr Ambedkar International Centre.The National Programme for Civil Services Capacity Building or Mission Karmayogi was launched in September 2020 to foster civil servants' capacity building. It also envisions a future-ready civil service rooted in Indian ethos, with a global perspective. ","cleaned_content":"prime minister narendra modi asked civil servants on saturday to keep themselves abreast with latest technological developments so as to meet the rising standards and stressed the need for following a citizen centric approach addressing an event here the prime minister also suggested seeking help from startups research agencies and youngsters for getting new ideas with artificial intelligence information processing is also becoming equally easy making the citizenry informed and empowering them to keep a tab on all the activities of the government he said so the civil servants need to keep themselves abreast with latest technological developments so as to meet the rising standards wherein mission karmayogi can prove to be of help modi said after launching the karmayogi saptah national learning week at the dr ambedkar international centre the national programme for civil services capacity building or mission karmayogi was launched in september \u003cTWO_THOUSAND\u003e to foster civil servants capacity building it also envisions a future ready civil service rooted in indian ethos with a global perspective","timestamp":"2024-10-19T20:54:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}