{"url":"https://economictimes.indiatimes.com/tech/information-tech/as-north-america-gains-traction-it-companies-note-softness-in-europe/articleshow/114475927.cms","title":"As North America gains traction, IT companies note softness in Europe","description":"Experts also say Europe is facing a decelerating economy which is unlikely to improve in the near future and, hence, clients are pulling back hard on discretionary spends and looking to delay large projects.","content":"Europe was a bright spot for the Indian IT industry's growth when its chips were down. But as North America has started gaining traction for the IT services industry, the other side of the pond has begun to show signs of softness for many of the top IT companies. Experts also say Europe is facing a decelerating economy which is unlikely to improve in the near future and hence clients are pulling back hard on discretionary spend and looking to delay large projects.While IT leaders commentaries on Europe didn't reflect on their Q2 numbers, analysts say they are largely reflective of deal pipelines and will show in coming quarters. Infosys in its Q2 earnings call said that in Europe, the automotive sector was challenged recently while discretionary spend remains under pressure. Similarly, C Vijayakumar, chief executive at HCLTech, said in the company’s earnings call that there is pressure in automotive, especially in Europe. “And that is definitely reflected in our numbers this quarter as well. Some of it would be reflecting in the next quarter as well.”In the case of Wipro, Europe registered a sequential decline of 0.1% due to overall weak demand and client-specific issues in a few accounts. Srini Pallia, chief executive at Wipro, said in the earnings call, “Coming specific to Europe and client-specific need, I would say a couple of clients where we have been working with them have actually changed the direction because of which there have been some ramp downs. So, it's very, very specific to the combination of some of the industries and Europe which is actually contributing to that slowdown for us.” IT bellwether Tata Consultancy Services (TCS) also indicated there is a softness in the UK and Europe because of client-specific situations.Peter Bendor-Samuel, chief executive of consulting and research firm Everest Group, said Europe is facing a decelerating economy which does not look like it's going to improve in the near future. “Hence firms are pulling back hard on discretionary spend and looking to delay large projects. One complicating factor is that Europe did not have as much of a post-Covid pull back and they are now in the stage the North America was in for the last 18 months where they were digesting the Covid investments and delaying investments.\" Pareekh Jain, chief executive of EIIRTrend, an engineering insight platform, said, “Unlike interest rate cuts which is a growth driver in the US, Europe doesn't have any immediate growth driver. Manufacturing led by automobile sector is a concern for IT companies. Already, Indian ER\u0026D (engineering, research and development) firms which are heavily exposed to Europe are seeing some softness, and this has now spread to IT services firms. ER\u0026D firms saw North America growing 4.3℅ year on year (yoy), while Europe growing 2.6℅ yoy, during Q1.”","cleaned_content":"europe was a bright spot for the indian it industrys growth when its chips were down but as north america has started gaining traction for the it services industry the other side of the pond has begun to show signs of softness for many of the top it companies experts also say europe is facing a decelerating economy which is unlikely to improve in the near future and hence clients are pulling back hard on discretionary spend and looking to delay large projects while it leaders commentaries on europe didnt reflect on their q2 numbers analysts say they are largely reflective of deal pipelines and will show in coming quarters infosys in its q2 earnings call said that in europe the automotive sector was challenged recently while discretionary spend remains under pressure similarly c vijayakumar chief executive at hcltech said in the company s earnings call that there is pressure in automotive especially in europe and that is definitely reflected in our numbers this quarter as well some of it would be reflecting in the next quarter as well in the case of wipro europe registered a sequential decline of \u003cZERO_PERCENT\u003e due to overall weak demand and client specific issues in a few accounts srini pallia chief executive at wipro said in the earnings call coming specific to europe and client specific need i would say a couple of clients where we have been working with them have actually changed the direction because of which there have been some ramp downs so its very very specific to the combination of some of the industries and europe which is actually contributing to that slowdown for us it bellwether tata consultancy services tcs also indicated there is a softness in the uk and europe because of client specific situations peter bendor samuel chief executive of consulting and research firm everest group said europe is facing a decelerating economy which does not look like its going to improve in the near future hence firms are pulling back hard on discretionary spend and looking to delay large projects one complicating factor is that europe did not have as much of a post covid pull back and they are now in the stage the north america was in for the last \u003cONE_TEN\u003e months where they were digesting the covid investments and delaying investments pareekh jain chief executive of eiirtrend an engineering insight platform said unlike interest rate cuts which is a growth driver in the us europe doesnt have any immediate growth driver manufacturing led by automobile sector is a concern for it companies already indian er d engineering research and development firms which are heavily exposed to europe are seeing some softness and this has now spread to it services firms er d firms saw north america growing \u003cFOUR_\u003e year on year yoy while europe growing \u003cTWO_\u003e yoy during q1","timestamp":"2024-10-23T07:48:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}