{"url":"https://economictimes.indiatimes.com/tech/technology/meta-platforms-defeats-shareholder-lawsuit-over-child-safety-claims/articleshow/114486303.cms","title":"Meta Platforms defeats shareholder lawsuit over child safety claims","description":"In a decision on Tuesday, US District Judge Charles Breyer in San Francisco said the plaintiff Matt Eisner failed to show that shareholders suffered economic losses from Meta's alleged inadequate disclosures. He also said federal securities law did not require Meta to detail the severity of sexually explicit content and sexual exploitation of children on its platforms, or all the child protection strategies it decided not to adopt.","content":"Meta Platforms and Chief Executive Mark Zuckerberg won the dismissal of a lawsuit claiming they misled shareholders in Meta's proxy statement about their ability to ensure the safety of children who use Facebook and Instagram. In a decision on Tuesday, US District Judge Charles Breyer in San Francisco said the plaintiff Matt Eisner failed to show that shareholders suffered economic losses from Meta's alleged inadequate disclosures. He also said federal securities law did not require Meta to detail the severity of sexually explicit content and sexual exploitation of children on its platforms, or all the child protection strategies it decided not to adopt. \"In essence, Eisner would have had Meta argue against its own recommendations, tout the benefits of tools it ultimately rejected, highlight its own failures, and devalue its own successes,\" Breyer wrote. \"That is not necessary.\" Eisner's lawyers did not immediately respond to requests for comment. Lawyers for Meta and Zuckerberg did not immediately respond to similar requests.","cleaned_content":"meta platforms and chief executive mark zuckerberg won the dismissal of a lawsuit claiming they misled shareholders in metas proxy statement about their ability to ensure the safety of children who use facebook and instagram in a decision on tuesday us district judge charles breyer in san francisco said the plaintiff matt eisner failed to show that shareholders suffered economic losses from metas alleged inadequate disclosures he also said federal securities law did not require meta to detail the severity of sexually explicit content and sexual exploitation of children on its platforms or all the child protection strategies it decided not to adopt in essence eisner would have had meta argue against its own recommendations tout the benefits of tools it ultimately rejected highlight its own failures and devalue its own successes breyer wrote that is not necessary eisners lawyers did not immediately respond to requests for comment lawyers for meta and zuckerberg did not immediately respond to similar requests","timestamp":"2024-10-23T08:37:00+05:30","market_timestamp":"2024-10-23T09:15:00+05:30","off_market_hours":true}