{"url":"https://economictimes.indiatimes.com/tech/information-tech/narayana-murthy-moots-sops-to-fuel-flow-of-domestic-capital-to-startups/articleshow/105238576.cms","title":"Narayana Murthy moots sops to fuel flow of domestic capital to startups","description":"In an interview with ET, the Infosys founder hailed the Modi government for drafting the National Education Policy (NEP), and said tech firms should use the current downturn to innovate and expand their market share to emerge winners when the market is up.","content":"Infosys founder NR Narayana Murthy suggested incentives for private and public funds to set aside a portion of their capital for boosting domestic investment in Indian startups in an interview with ET. The Infosys founder also hailed the Narendra Modi government for drafting the National Education Policy (NEP). On the sidelines of the Infosys Prize announcement, Murthy said tech firms should use the current downturn to innovate and expand their market share to emerge winners when the market is up. Edited excerpts: How do you see the Infosys Science Foundation’s journey? It has been a very positive experiment. The number of winners is now sizable at around 90 winners now. A few of them have gone on to win bigger prizes. However, our desire is that we should see a few Fields Medal winners and Nobel laureates who have worked in India. Looking around, I believe that will happen as we move forward.How do you think research and innovation can be pushed within education for better job opportunities? Almost every developed nation has used the power of a few inventions and continuous innovations to improve the lives of citizens. We must focus on creating a mindset that is conducive to invention and innovation. Every developed nation has very low unemployment. ","cleaned_content":"infosys founder nr narayana murthy suggested incentives for private and public funds to set aside a portion of their capital for boosting domestic investment in indian startups in an interview with et the infosys founder also hailed the narendra modi government for drafting the national education policy nep on the sidelines of the infosys prize announcement murthy said tech firms should use the current downturn to innovate and expand their market share to emerge winners when the market is up edited excerpts how do you see the infosys science foundation s journey it has been a very positive experiment the number of winners is now sizable at around \u003cNINE_TEN\u003e winners now a few of them have gone on to win bigger prizes however our desire is that we should see a few fields medal winners and nobel laureates who have worked in india looking around i believe that will happen as we move forward how do you think research and innovation can be pushed within education for better job opportunities almost every developed nation has used the power of a few inventions and continuous innovations to improve the lives of citizens we must focus on creating a mindset that is conducive to invention and innovation every developed nation has very low unemployment","timestamp":"2023-11-15T22:09:00+05:30","market_timestamp":"2023-11-16T09:15:00+05:30","off_market_hours":true}