{"url":"https://economictimes.indiatimes.com/tech/information-tech/rajesh-chaurasia-joins-infosys-as-avp-from-accenture-industry-x/articleshow/105453362.cms","title":"Rajesh Chaurasia joins Infosys as AVP from Accenture Industry X","description":"Chaurasia is moving in from Accenture Industry X, where he led the aerospace \u0026 defence domain, along with important clients across automotive \u0026 discrete manufacturing domains.","content":"Rajesh Prasad Chaurasia has joined Infosys as an associate vice president and will be leading the engineering services for aerospace, automotive, discrete \u0026 turbo machinery domains in Europe. He is based in Germany.Chaurasia is moving in from Accenture Industry X, where he led the aerospace \u0026 defence domain, along with important clients across automotive \u0026 discrete manufacturing domains. He incubated and led the setup of the end-to-end demonstration for digital thread and digital twin at the Accenture Innovation hub. Since early this year, he was leading the Accenture-Umlaut integration for consolidated offerings, according to an internal mail.This is Chaurasia's second stint with Infosys. During his earlier 12-year stint from 2006, he played a role in setting up the TMP practice and growing the company's PLM (product lifecycle management) portfolio.Chaurasia, a post-graduate in Applied Mechanics from IIT, Delhi and RWTH Aachen University in Germany, has been involved with digital thread and digital twin initiatives, the mail said. ","cleaned_content":"rajesh prasad chaurasia has joined infosys as an associate vice president and will be leading the engineering services for aerospace automotive discrete turbo machinery domains in europe he is based in germany chaurasia is moving in from accenture industry x where he led the aerospace defence domain along with important clients across automotive discrete manufacturing domains he incubated and led the setup of the end to end demonstration for digital thread and digital twin at the accenture innovation hub since early this year he was leading the accenture umlaut integration for consolidated offerings according to an internal mail this is chaurasias second stint with infosys during his earlier \u003cONE_TEN\u003e year stint from \u003cTWO_THOUSAND\u003e he played a role in setting up the tmp practice and growing the companys plm product lifecycle management portfolio chaurasia a post graduate in applied mechanics from iit delhi and rwth aachen university in germany has been involved with digital thread and digital twin initiatives the mail said","timestamp":"2023-11-23T22:16:00+05:30","market_timestamp":"2023-11-24T09:15:00+05:30","off_market_hours":true}