{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-industry-expected-to-grow-to-350-billion-by-2030-infosys-cofounder-kris-gopalakrishnan/articleshow/105588051.cms","title":"IT industry expected to grow to $350 billion by 2030: Infosys cofounder Kris Gopalakrishnan","description":"Gopalakrishnan, who is also the chairman of the vision group for IT in Karnataka, was speaking at the inauguration of the three-day Bengaluru Tech Summit 2023.","content":"The information technology industry is expected to grow to $350 billion by 2030, from $200 billion at present, Infosys cofounder Kris Gopalakrishnan said on Wednesday.Gopalakrishnan, who is also the chairman of the vision group for IT in Karnataka, was speaking at the inauguration of the three-day Bengaluru Tech Summit 2023.“Technology plays a horizontal role in increasing productivity, customer benefits and the user interface. Information technology cuts across everything. Last year, the IT industry grew by 9%. It is now a $200 billion industry, which is expected to grow to $350 billion by 2030,” he said, adding that it is a high growth industry and has continuously grown every year over the past several years.Technology changes continuously and it was only in November last year that ChatGPT, GPT4 and Generative AI were introduced and became the fastest growing application technologies in the world, he said.“There are multiple interventions required when something like this happens and new technologies that have widespread applicability are introduced,” said Gopalakrishnan. “Every sector, industry and application changes. Even how we interact with technology, information and intelligent systems changes. What is unique about this round is the ability to interact with AI (artificial intelligence) systems using a chat interface. So it democratises artificial intelligence.”","cleaned_content":"the information technology industry is expected to grow to \u003cTHREE_HUNDRED\u003e billion by \u003cTWO_THOUSAND\u003e from \u003cTWO_HUNDRED\u003e billion at present infosys cofounder kris gopalakrishnan said on wednesday gopalakrishnan who is also the chairman of the vision group for it in karnataka was speaking at the inauguration of the three day bengaluru tech summit \u003cTWO_THOUSAND\u003e technology plays a horizontal role in increasing productivity customer benefits and the user interface information technology cuts across everything last year the it industry grew by \u003cNINE_PERCENT\u003e it is now a \u003cTWO_HUNDRED\u003e billion industry which is expected to grow to \u003cTHREE_HUNDRED\u003e billion by \u003cTWO_THOUSAND\u003e he said adding that it is a high growth industry and has continuously grown every year over the past several years technology changes continuously and it was only in november last year that chatgpt gpt4 and generative ai were introduced and became the fastest growing application technologies in the world he said there are multiple interventions required when something like this happens and new technologies that have widespread applicability are introduced said gopalakrishnan every sector industry and application changes even how we interact with technology information and intelligent systems changes what is unique about this round is the ability to interact with ai artificial intelligence systems using a chat interface so it democratises artificial intelligence","timestamp":"2023-11-29T14:03:00+05:30","market_timestamp":"2023-11-29T14:03:00+05:30","off_market_hours":false}