{"url":"https://economictimes.indiatimes.com/tech/information-tech/after-bcg-advisory-role-ex-tcs-ceo-gopinathan-joins-iit-bombay-as-head-of-entrepreneurship/articleshow/105653805.cms","title":"After BCG advisory role, ex-TCS CEO Gopinathan joins IIT Bombay as head of entrepreneurship","description":"A translational research centre to support transition of IP from lab to industry was created recently. The new position of head, translational research and entrepreneurship has been created to further accelerate these initiatives, said the institute.","content":"Indian Institute of Technology (IIT) Bombay has appointed former Tata Consultancy Services (TCS) CEO Rajesh Gopinathan as head- translational research and entrepreneurship and professor of practice, the premier institute said on Friday. A translational research centre to support transition of IP from lab to industry was created recently. The new position of head, translational research and entrepreneurship has been created to further accelerate these initiatives, said the institute.\"I am very excited and happy with the opportunity to contribute to the growth of such an iconic national institution. IIT Bombay's research infrastructure and globally-respected faculty and talent pool position it uniquely to play a leadership role in shaping the innovation agenda in India and globally,” Gopinathan said.Earlier this week, it was reported that Gopinathan, who left TCS in September, is joining Boston Consulting Group as a senior advisor to the technology, media and telecom (TMT) practice. Gopinathan will be advising in the capacity of an external consultant. BCG did not respond to ET's queries. “We have a tradition of active involvement of industry leaders in shaping our plans. As we look to advance our ambitious agenda of applied research and entrepreneurship, we are delighted to welcome Rajesh Gopinathan. His global exposure and experience in the rapid scaling up at TCS will play a pivotal role in taking our agenda to the next level,” said IIT Bombay director, Prof Subhasis Chaudhuri.","cleaned_content":"indian institute of technology iit bombay has appointed former tata consultancy services tcs ceo rajesh gopinathan as head translational research and entrepreneurship and professor of practice the premier institute said on friday a translational research centre to support transition of ip from lab to industry was created recently the new position of head translational research and entrepreneurship has been created to further accelerate these initiatives said the institute i am very excited and happy with the opportunity to contribute to the growth of such an iconic national institution iit bombays research infrastructure and globally respected faculty and talent pool position it uniquely to play a leadership role in shaping the innovation agenda in india and globally gopinathan said earlier this week it was reported that gopinathan who left tcs in september is joining boston consulting group as a senior advisor to the technology media and telecom tmt practice gopinathan will be advising in the capacity of an external consultant bcg did not respond to ets queries we have a tradition of active involvement of industry leaders in shaping our plans as we look to advance our ambitious agenda of applied research and entrepreneurship we are delighted to welcome rajesh gopinathan his global exposure and experience in the rapid scaling up at tcs will play a pivotal role in taking our agenda to the next level said iit bombay director prof subhasis chaudhuri","timestamp":"2023-12-01T15:12:00+05:30","market_timestamp":"2023-12-01T15:12:00+05:30","off_market_hours":false}