{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-shell-uk-tie-up-to-adopt-immersion-cooling-services-for-data-centers/articleshow/105629040.cms","title":"Infosys, Shell UK tie-up to adopt immersion cooling services for data centers","description":"The latest partnership will leverage the AI-first offering Infosys Topaz and Shell Immersion Cooling Fluid, designed to maximise the energy efficiency and performance of data servers and IT components.","content":"India's second largest IT services provider Infosys on Thursday announced partnership with global energy firm Shell New Energies UK to accelerate adoption of immersion cooling services for data centers, the company said in a statement. \"Through this strategic engagement, Infosys and Shell will bring together their capabilities in Digital and Energy, respectively, and an ecosystem of partners, to create an integrated offering for green data centers,\" the statement said. The financials of the deal were not reported.  The latest partnership will leverage the AI-first offering Infosys Topaz and Shell Immersion Cooling Fluid, designed to maximise the energy efficiency and performance of data servers and IT components. Shell and Infosys will test this, leveraging both Shell’s immersion cooling and Infosys’ digital solutions. Following the pilot at Shell’s and Infosys' data centers, the companies intend to extend the offer to other customers globally.\"This collaboration will leverage AI based digital solutions that will create environmentally responsible data centers that can manage high computing loads with optimized hardware. It is also critical that future digital and physical solutions are created with a view to make AI more sustainable and scalable,” said Ashiss Kumar Dash, EVP \u0026 Global Head – Sustainability, Services, Utilities, Resources and Energy, Infosys.","cleaned_content":"indias second largest it services provider infosys on thursday announced partnership with global energy firm shell new energies uk to accelerate adoption of immersion cooling services for data centers the company said in a statement through this strategic engagement infosys and shell will bring together their capabilities in digital and energy respectively and an ecosystem of partners to create an integrated offering for green data centers the statement said the financials of the deal were not reported the latest partnership will leverage the ai first offering infosys topaz and shell immersion cooling fluid designed to maximise the energy efficiency and performance of data servers and it components shell and infosys will test this leveraging both shell s immersion cooling and infosys digital solutions following the pilot at shell s and infosys data centers the companies intend to extend the offer to other customers globally this collaboration will leverage ai based digital solutions that will create environmentally responsible data centers that can manage high computing loads with optimized hardware it is also critical that future digital and physical solutions are created with a view to make ai more sustainable and scalable said ashiss kumar dash evp global head sustainability services utilities resources and energy infosys","timestamp":"2023-11-30T18:08:00+05:30","market_timestamp":"2023-12-01T09:15:00+05:30","off_market_hours":true}