{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-wins-five-year-deal-with-swedish-manufacturer-husqvarna/articleshow/105785273.cms","title":"HCLTech wins five-year deal with Swedish manufacturer Husqvarna","description":"Under the new five-year agreement, HCLTech will offer its AI, digital, engineering and support services to Husqvarna Groups’ IT environments through hyper-personalized, adaptive, AI-based solutions and a collaborative governance framework.","content":"HCLTech said on Wednesday that it has won a five year extension to a strategic IT and digital transformation deal from Swedish manufacturer Husqvarna Group. Deal financials were not disclosed.Under the new five-year agreement, HCLTech will offer its AI, digital, engineering and support services to Husqvarna Groups’ IT environments through hyper-personalized, adaptive, AI-based solutions and a collaborative governance framework.In a major milestone for HCLTech, this is the first time a large global IT contract by an India- headquartered technology company has been Vested certified, the company said. Vested contracts focus on creating an environment conducive for highly collaborative business relationships.“We have co-created a unique governance model that will improve and accelerate technology development and a unified operating model that would further IT’s cause of creating value for our customers,” said Robert Hafredal, group CIO, Husqvarna Group.","cleaned_content":"hcltech said on wednesday that it has won a five year extension to a strategic it and digital transformation deal from swedish manufacturer husqvarna group deal financials were not disclosed under the new five year agreement hcltech will offer its ai digital engineering and support services to husqvarna groups it environments through hyper personalized adaptive ai based solutions and a collaborative governance framework in a major milestone for hcltech this is the first time a large global it contract by an india headquartered technology company has been vested certified the company said vested contracts focus on creating an environment conducive for highly collaborative business relationships we have co created a unique governance model that will improve and accelerate technology development and a unified operating model that would further it s cause of creating value for our customers said robert hafredal group cio husqvarna group","timestamp":"2023-12-06T17:12:00+05:30","market_timestamp":"2023-12-07T09:15:00+05:30","off_market_hours":true}