{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltts-wins-multi-year-engineering-services-deal-from-bp/articleshow/105922635.cms","title":"LTTS wins multi-year engineering services deal from BP","description":"The deal will leverage over two decades of LTTS’ experience in engineering, manufacturing services, digital and enterprise data management and address some of the most significant challenges for BP globally.","content":"On Tuesday, L\u0026T Technology Services Limited (LTTS) said it has secured a multi-year engineering services deal with global energy company BP. Deal financials were not disclosed.The deal will leverage over two decades of LTTS’ experience in engineering, manufacturing services, digital and enterprise data management and address some of the most significant challenges for BP globally.Together, both companies intend to focus on improving operational excellence. The engagement areas are expected to include engineering for projects, turnarounds, maintenance improvements, technical writing, engineering data management, and services for sustainability initiatives.“We are thrilled to forge this strategic partnership with BP,” said Amit Chadha, CEO and managing director of L\u0026T Technology Services. “This long-term relationship allows us to provide services for their global assets, emphasising top-tier operational efficiency through digital enablement. Our proven track record in high-quality engineering services and digital transformation solutions underscores our position as a trusted partner for BP.”","cleaned_content":"on tuesday l t technology services limited ltts said it has secured a multi year engineering services deal with global energy company bp deal financials were not disclosed the deal will leverage over two decades of ltts experience in engineering manufacturing services digital and enterprise data management and address some of the most significant challenges for bp globally together both companies intend to focus on improving operational excellence the engagement areas are expected to include engineering for projects turnarounds maintenance improvements technical writing engineering data management and services for sustainability initiatives we are thrilled to forge this strategic partnership with bp said amit chadha ceo and managing director of l t technology services this long term relationship allows us to provide services for their global assets emphasising top tier operational efficiency through digital enablement our proven track record in high quality engineering services and digital transformation solutions underscores our position as a trusted partner for bp","timestamp":"2023-12-12T11:15:00+05:30","market_timestamp":"2023-12-12T11:15:00+05:30","off_market_hours":false}