{"url":"https://economictimes.indiatimes.com/tech/information-tech/bengaluru-techies-follow-traffic-rules-or-your-firm-will-be-notified-about-your-violations/articleshow/106043268.cms","title":"Bengaluru techies, follow traffic rules or your firm will be notified about your violations","description":"According to traffic police, in a bid to raise awareness about road safety and traffic rules, the east division of Bengaluru Traffic Police this week started a unique drive on a pilot basis along the city's Information Technology corridor covering the Outer Ring Road and Whitefield.","content":"Think twice before you jump traffic signals or exceed speed limits on the roads, because if you techies are caught violating any of the traffic rules, the Bengaluru Traffic Police will directly notify your company about it. According to traffic police, in a bid to raise awareness about road safety and traffic rules, the east division of Bengaluru Traffic Police this week started a unique drive on a pilot basis along the city's Information Technology corridor covering the Outer Ring Road and Whitefield. As of now, the drive is limited to the east division of traffic police, but if there is a significant reduction in violations along the route, then it would also be extended to other major parts of Bengaluru, police said. The initiative was started in the particular jurisdiction after traffic police noticed a significant number of traffic violations, especially by techies who, in an attempt to reach to their destinations faster either end up jumping traffic signals or exceeding speed limits, thus violating traffic rules, a senior traffic official said. \"We started this drive on a pilot basis in the east division of Bengaluru. So, if any of the IT company employees are caught violating traffic rules, information about the specific violation will be sent to their respective companies through email or Whatsapp. This is just to make them more aware and conscious of traffic rules and road safety while riding,\" Kuldeep Kumar Jain, Deputy Commissioner of Police (East division - Traffic) said. This initiative is just to ensure that people follow the law of the land, he said. ","cleaned_content":"think twice before you jump traffic signals or exceed speed limits on the roads because if you techies are caught violating any of the traffic rules the bengaluru traffic police will directly notify your company about it according to traffic police in a bid to raise awareness about road safety and traffic rules the east division of bengaluru traffic police this week started a unique drive on a pilot basis along the citys information technology corridor covering the outer ring road and whitefield as of now the drive is limited to the east division of traffic police but if there is a significant reduction in violations along the route then it would also be extended to other major parts of bengaluru police said the initiative was started in the particular jurisdiction after traffic police noticed a significant number of traffic violations especially by techies who in an attempt to reach to their destinations faster either end up jumping traffic signals or exceeding speed limits thus violating traffic rules a senior traffic official said we started this drive on a pilot basis in the east division of bengaluru so if any of the it company employees are caught violating traffic rules information about the specific violation will be sent to their respective companies through email or whatsapp this is just to make them more aware and conscious of traffic rules and road safety while riding kuldeep kumar jain deputy commissioner of police east division traffic said this initiative is just to ensure that people follow the law of the land he said","timestamp":"2023-12-16T20:26:00+05:30","market_timestamp":"2023-12-18T09:15:00+05:30","off_market_hours":true}