{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-unveils-shakti-to-boost-women-leadership-in-technology/articleshow/105992137.cms","title":"Cognizant unveils Shakti to boost women leadership in technology","description":"The IT services company has partnered with industry body Nasscom to establish and prioritise best practices with a shared goal of making diversity and inclusion (D\u0026I) a key differentiator of India's tech sector.","content":"Cognizant Technology has unveiled Shakti, a unified framework of women-centric programmes and policies aimed at accelerating careers and driving women leadership in technology.Additionally, the IT services company has partnered with industry body Nasscom to establish and prioritise best practices with a shared goal of making diversity and inclusion (D\u0026I) a key differentiator of India's tech sector.“In keeping with our priority to become an employer of choice in our industry, Cognizant is committed to weaving diversity and inclusion into everything we do—how we recruit and hire, develop, promote, engage and retain our talent,” said Ravi Kumar S, CEO, Cognizant, in a statement. “Shakti will catalyse our efforts to enable more women to advance their careers and reach their full potential. Growth, innovation, and client-centricity all require a diverse and inclusive workforce, doubly so as generative AI permeates the workplace. We will see the most essential human skill shift from problem-solving to problem-finding, putting a premium on cognitive diversity.”In India, nearly 40% of Cognizant’s associates are women as compared to the IT industry gender diversity average of 36%. More than half of 13 Cognizant centres in the country have crossed more than 40% women participation in their workforce, with two of the largest centres being currently led by women leaders.","cleaned_content":"cognizant technology has unveiled shakti a unified framework of women centric programmes and policies aimed at accelerating careers and driving women leadership in technology additionally the it services company has partnered with industry body nasscom to establish and prioritise best practices with a shared goal of making diversity and inclusion d i a key differentiator of indias tech sector in keeping with our priority to become an employer of choice in our industry cognizant is committed to weaving diversity and inclusion into everything we do how we recruit and hire develop promote engage and retain our talent said ravi kumar s ceo cognizant in a statement shakti will catalyse our efforts to enable more women to advance their careers and reach their full potential growth innovation and client centricity all require a diverse and inclusive workforce doubly so as generative ai permeates the workplace we will see the most essential human skill shift from problem solving to problem finding putting a premium on cognitive diversity in india nearly \u003cFOUR_TEN_PERCENT\u003e of cognizant s associates are women as compared to the it industry gender diversity average of \u003cTHREE_TEN_PERCENT\u003e more than half of \u003cONE_TEN\u003e cognizant centres in the country have crossed more than \u003cFOUR_TEN_PERCENT\u003e women participation in their workforce with two of the largest centres being currently led by women leaders","timestamp":"2023-12-14T16:15:00+05:30","market_timestamp":"2023-12-15T09:15:00+05:30","off_market_hours":true}