{"url":"https://economictimes.indiatimes.com/tech/information-tech/indias-245-billion-it-sector-swallows-tougher-terms-amid-scramble-for-contracts/articleshow/106118592.cms","title":"Indian $245 billion IT sector swallows tougher terms amid scramble for contracts","description":"That is forcing companies including Tata Consultancy Services, Infosys and HCLTech to accept contract conditions such as guaranteeing minimum cost savings, billing the client only if certain goals are achieved and reviewing cost overruns.","content":"India's information technology firms are accepting tougher contract terms to win large deals from clients as they compete for fewer orders in an uncertain global economy, industry insiders and analysts say. The $245-billion sector, which gained immensely from the pandemic-induced boom in digital services, has struggled in recent quarters as clients slashed spending on discretionary projects amid inflationary pressures and recession fears. That is forcing companies including Tata Consultancy Services, Infosys and HCLTech to accept contract conditions such as guaranteeing minimum cost savings, billing the client only if certain goals are achieved and reviewing cost overruns. \"Whenever economic challenges appear and demand recedes, it becomes a buyer's market. The clients try to push more clauses including capping the pricing and asking for outcome-based deals,\" said former Infosys CFO V Balakrishnan. \"It was witnessed during 2008 when the global financial crisis happened, and in 2001 during the dot-com crash,\" he said.","cleaned_content":"indias information technology firms are accepting tougher contract terms to win large deals from clients as they compete for fewer orders in an uncertain global economy industry insiders and analysts say the \u003cTWO_HUNDRED\u003e billion sector which gained immensely from the pandemic induced boom in digital services has struggled in recent quarters as clients slashed spending on discretionary projects amid inflationary pressures and recession fears that is forcing companies including tata consultancy services infosys and hcltech to accept contract conditions such as guaranteeing minimum cost savings billing the client only if certain goals are achieved and reviewing cost overruns whenever economic challenges appear and demand recedes it becomes a buyers market the clients try to push more clauses including capping the pricing and asking for outcome based deals said former infosys cfo v balakrishnan it was witnessed during \u003cTWO_THOUSAND\u003e when the global financial crisis happened and in \u003cTWO_THOUSAND\u003e during the dot com crash he said","timestamp":"2023-12-19T13:53:00+05:30","market_timestamp":"2023-12-19T13:53:00+05:30","off_market_hours":false}