{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-firm-sourcefuse-expects-to-cross-rs-200-crore-this-fiscal-hire-140-people/articleshow/105859792.cms","title":"IT firm SourceFuse expects to cross Rs 200 crore in revenue this fiscal, hire 140 people","description":"SourceFuse co-CEO and cofounder Gautam Ghai said that the company plans to increase headcount by about 25% to 700 people next year from around 560 at present as it looks to broaden customer base and diversify offerings.","content":"IT services firm SourceFuse expects to cross Rs 200 crore revenue mark this fiscal driven by its machine learning solution segment, a senior company official said. SourceFuse co-CEO and cofounder Gautam Ghai told PTI that the company plans to increase headcount by about 25% to 700 people next year from around 560 at present as it looks to broaden customer base and diversify offerings. \"In a year marked by widespread sluggish growth, companies globally have faced various challenges. At SourceFuse, we have proactively addressed this trend by intensifying efforts to broaden our customer base and diversify offerings. We are making a strategic bet on Gen AI to drive revenue growth and expand its footprint in the market,\" Ghai said. He said SourceFuse has prioritised talent development and upskilling initiatives to equip workforce with the skills required to navigate the complexities of AI technology. \"This dual approach, focusing on both technology integration and human capital, ensures that we are well-positioned to capitalize on the opportunities presented by Gen AI,\" Ghai said. Amazon Web Services (AWS) partner SourceFuse gets 45% of the company's total revenue from the US, 30-35% from India and 20-25% of the business comes from the rest of the world. ","cleaned_content":"it services firm sourcefuse expects to cross rs \u003cTWO_HUNDRED\u003e crore revenue mark this fiscal driven by its machine learning solution segment a senior company official said sourcefuse co ceo and cofounder gautam ghai told pti that the company plans to increase headcount by about \u003cTWO_TEN_PERCENT\u003e to \u003cSEVEN_HUNDRED\u003e people next year from around \u003cFIVE_HUNDRED\u003e at present as it looks to broaden customer base and diversify offerings in a year marked by widespread sluggish growth companies globally have faced various challenges at sourcefuse we have proactively addressed this trend by intensifying efforts to broaden our customer base and diversify offerings we are making a strategic bet on gen ai to drive revenue growth and expand its footprint in the market ghai said he said sourcefuse has prioritised talent development and upskilling initiatives to equip workforce with the skills required to navigate the complexities of ai technology this dual approach focusing on both technology integration and human capital ensures that we are well positioned to capitalize on the opportunities presented by gen ai ghai said amazon web services aws partner sourcefuse gets \u003cFOUR_TEN_PERCENT\u003e of the companys total revenue from the us \u003cTHREE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e from india and \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e of the business comes from the rest of the world","timestamp":"2023-12-09T14:38:00+05:30","market_timestamp":"2023-12-11T09:15:00+05:30","off_market_hours":true}