{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-kicks-off-holiday-season-with-long-awaited-pay-hike/articleshow/106031923.cms","title":"Infosys kicks off holiday season with long-awaited pay hike","description":"The hikes, which typically are effective from April 1, have now been announced from November 1, 2023, ET has learnt. It does not include reviews for entry level workers of the IT services major, according to people aware of the matter.","content":"Infosys has kicked off the holiday season by handing out salary revision letters to a large number of its employees on Friday, buoying sentiment at a time when the information technology sector has been battling sluggish demand for technology services worldwide. The hikes, which typically are effective from April 1, have now been announced from November 1, 2023, ET has learnt. It does not include reviews for entry level workers of the IT services major, according to people aware of the matter.\"We are pleased to revise your compensation in acknowledgement of your commitment and performance with effect from November 1, 2023,\" said the Friday communication sent to employees, which has been reviewed by ET. ","cleaned_content":"infosys has kicked off the holiday season by handing out salary revision letters to a large number of its employees on friday buoying sentiment at a time when the information technology sector has been battling sluggish demand for technology services worldwide the hikes which typically are effective from april \u003cONE_\u003e have now been announced from november \u003cONE_\u003e \u003cTWO_THOUSAND\u003e et has learnt it does not include reviews for entry level workers of the it services major according to people aware of the matter we are pleased to revise your compensation in acknowledgement of your commitment and performance with effect from november \u003cONE_\u003e \u003cTWO_THOUSAND\u003e said the friday communication sent to employees which has been reviewed by et","timestamp":"2023-12-15T23:18:00+05:30","market_timestamp":"2023-12-18T09:15:00+05:30","off_market_hours":true}