{"url":"https://economictimes.indiatimes.com/tech/information-tech/worked-70-hours-a-week-for-over-40-yearsit-wasnt-a-waste-says-infosys-narayana-murthy/articleshow/105853766.cms","title":"Worked 70+ hours a week for over 40 years,it wasn't a waste, says Infosys' Narayana Murthy","description":"\"I used to be in the office at 6:20 am and leave office at 8:30 pm and worked six days a week,\" he told ET in an interview. \"I know every nation that became prosperous did so through hard work,\" the Infosys co-founder explains.","content":"Infosys cofounder NR Narayana Murthy doesn't seem perturbed by the kerfuffle he sparked by suggesting recently that youngsters ought to work 70 hours a week to boost productivity and enhance India's competitiveness.He himself had put in the hours when setting up Infosys in 1981, said Murthy, 77.\"I used to be in the office at 6:20 am and leave office at 8:30 pm and worked six days a week,\" he told ET in an interview. \"I know every nation that became prosperous did so through hard work.\"This work ethic was instilled in him early on. \"My parents taught me very early in life that the only way we could hope to escape poverty was to work very, very hard - of course, assuming that one gets the best productivity from each hour of work,\" he said.","cleaned_content":"infosys cofounder nr narayana murthy doesnt seem perturbed by the kerfuffle he sparked by suggesting recently that youngsters ought to work \u003cSEVEN_TEN\u003e hours a week to boost productivity and enhance indias competitiveness he himself had put in the hours when setting up infosys in \u003cONE_THOUSAND\u003e said murthy \u003cSEVEN_TEN\u003e i used to be in the office at \u003cSIX_\u003e \u003cTWO_TEN\u003e am and leave office at \u003cEIGHT_\u003e \u003cTHREE_TEN\u003e pm and worked six days a week he told et in an interview i know every nation that became prosperous did so through hard work this work ethic was instilled in him early on my parents taught me very early in life that the only way we could hope to escape poverty was to work very very hard of course assuming that one gets the best productivity from each hour of work he said","timestamp":"2023-12-09T08:58:00+05:30","market_timestamp":"2023-12-11T09:15:00+05:30","off_market_hours":true}