{"url":"https://economictimes.indiatimes.com/tech/information-tech/salesforce-acquires-automated-commission-management-platform-spiff/articleshow/106144066.cms","title":"Salesforce acquires automated commission management platform Spiff","description":"Enterprise software major Salesforce has announced plans to acquire Spiff, a provider of a new class of incentive compensation management (ICM) software, for an undisclosed sum.","content":"Enterprise software major Salesforce has announced plans to acquire Spiff, a provider of a new class of incentive compensation management (ICM) software, for an undisclosed sum. Once the acquisition closes, the Spiff organisation will join Sales Cloud, working to enhance Salesforce's Sales Performance Management solutions by providing customers with a trusted platform to increase visibility, supercharge selling and unlock growth. \"Spiff connects what sellers want - transparent compensation - with what sales leaders want - compensation planning built into CRM that aligns behaviours to strategic outcomes,\" said Ketan Karkhanis, EVP \u0026 GM, Sales Cloud. The addition of Spiff to Salesforce will empower CROs to better align with financial and sales operations teams to easily self-manage complex incentive compensation plans and understand the factors propelling revenue performance to drive top-line growth. \"I'm excited about the future of Spiff and about what this means for the world of SPM and ICM in general,\" says Jeron Paul, CEO of Spiff. ","cleaned_content":"enterprise software major salesforce has announced plans to acquire spiff a provider of a new class of incentive compensation management icm software for an undisclosed sum once the acquisition closes the spiff organisation will join sales cloud working to enhance salesforces sales performance management solutions by providing customers with a trusted platform to increase visibility supercharge selling and unlock growth spiff connects what sellers want transparent compensation with what sales leaders want compensation planning built into crm that aligns behaviours to strategic outcomes said ketan karkhanis evp gm sales cloud the addition of spiff to salesforce will empower cros to better align with financial and sales operations teams to easily self manage complex incentive compensation plans and understand the factors propelling revenue performance to drive top line growth im excited about the future of spiff and about what this means for the world of spm and icm in general says jeron paul ceo of spiff","timestamp":"2023-12-20T11:21:00+05:30","market_timestamp":"2023-12-20T11:21:00+05:30","off_market_hours":false}