{"url":"https://economictimes.indiatimes.com/tech/information-tech/india-home-to-cutting-edge-work-not-a-labour-arbitrage-story-netapp/articleshow/106181808.cms","title":"India home to cutting-edge work, not a labour arbitrage story: Netapp","description":"Bengaluru is the single-largest facility housing engineering talent anywhere in the world for Netapp globally, Bhela, who grew up in Mumbai and has also worked with Microsoft, said.","content":"Global software company Netapp feels that India is not a labour arbitrage story and its presence in the country is driven by talent delivering cutting-edge, innovative work. \\Stating that the country is home to its largest engineer base in a single site anywhere in the world, the company's India-born Chief Technology Officer Harvinder (Harv) Bhela said multinationals have travelled a long distance and a lot of critical work happens in the country now.  \"We don't see India that way (for labour arbitrage) anymore. People don't see that. India development centres have gone past that way many many years ago,\" Bhela told PTI recently.  Bengaluru is the single-largest facility housing engineering talent anywhere in the world for Netapp globally, Bhela, who grew up in Mumbai and has also worked with Microsoft, said.  It can be noted that in the past, a lot of companies came to India because of the low cost of talent, which led to a frequent refrain that the low-key work like maintenance comes to India because of the opportunity for a company to maximise profits courtesy the low salaries paid here. ","cleaned_content":"global software company netapp feels that india is not a labour arbitrage story and its presence in the country is driven by talent delivering cutting edge innovative work stating that the country is home to its largest engineer base in a single site anywhere in the world the companys india born chief technology officer harvinder harv bhela said multinationals have travelled a long distance and a lot of critical work happens in the country now we dont see india that way for labour arbitrage anymore people dont see that india development centres have gone past that way many many years ago bhela told pti recently bengaluru is the single largest facility housing engineering talent anywhere in the world for netapp globally bhela who grew up in mumbai and has also worked with microsoft said it can be noted that in the past a lot of companies came to india because of the low cost of talent which led to a frequent refrain that the low key work like maintenance comes to india because of the opportunity for a company to maximise profits courtesy the low salaries paid here","timestamp":"2023-12-21T15:44:00+05:30","market_timestamp":"2023-12-22T09:15:00+05:30","off_market_hours":true}