{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-gets-hc-relief-in-rs-9403-crore-dividend-distribution-tax-case/articleshow/106369543.cms","title":"Cognizant gets HC relief in Rs 9,403 crore dividend distribution tax case","description":"The bench said that in the event of default on the part of the company in complying with the conditions, the order shall stand vacated automatically, without any further reference to the court.","content":"Madras High Court has stayed the tax demand of Rs 9,403.09 crore against tech giant Cognizant Technology in case of its share buy buyback of Rs 19,000 crore, subject to payment of Rs 1,500 crore.A bench of Justices Mohammed Shaffiq and R Mahadevan has directed Cognizant Technology to pay Rs 1,500 crore within a period of four weeks and directed tax department to release title deeds pertaining to the property and remaining fixed deposits lying in the banks on the payment and deposit.The bench said that the outstanding demand raised against Cognizant needs to be secured in the interest of the revenue. It also added that the financial difficulty cited on the part of the appellant has no merit, as their current assets as of March 31, 2022, are around Rs 21,644 crore.The bench said that in the event of default on the part of the company in complying with the conditions, the order shall stand vacated automatically, without any further reference to the court.\"It is also open to the department to recover the tax liability from the appellant in the manner known to law,\" the court said in its order. ","cleaned_content":"madras high court has stayed the tax demand of rs \u003cNINE_THOUSAND\u003e crore against tech giant cognizant technology in case of its share buy buyback of rs \u003cONE_TEN_THOUSAND\u003e crore subject to payment of rs \u003cONE_THOUSAND\u003e crore a bench of justices mohammed shaffiq and r mahadevan has directed cognizant technology to pay rs \u003cONE_THOUSAND\u003e crore within a period of four weeks and directed tax department to release title deeds pertaining to the property and remaining fixed deposits lying in the banks on the payment and deposit the bench said that the outstanding demand raised against cognizant needs to be secured in the interest of the revenue it also added that the financial difficulty cited on the part of the appellant has no merit as their current assets as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e are around rs \u003cTWO_TEN_THOUSAND\u003e crore the bench said that in the event of default on the part of the company in complying with the conditions the order shall stand vacated automatically without any further reference to the court it is also open to the department to recover the tax liability from the appellant in the manner known to law the court said in its order","timestamp":"2023-12-29T11:44:00+05:30","market_timestamp":"2023-12-29T11:44:00+05:30","off_market_hours":false}