{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-executive-exodus-a-primer-on-breach-of-contract-lawsuits/articleshow/106387697.cms","title":"IT executive exodus: a primer on breach of contract, lawsuits","description":"IT major Wipro has filed at least two legal complaints against its former senior executives including former senior vice president Mohd Haque and ex CFO Jatin Dalal for breach of his employment contract with Wipro. What does this mean?","content":"Senior C-suite executives moving to rival companies is common. As are non-compete clauses as part of employment contracts by employers while making top management employee appointments. Yet lawsuits against employees for contract violations are not a frequent phenomenon in India.What happened?IT major Wipro has filed at least two legal complaints against its former senior executives including former senior vice president Mohd Haque and former CFO Jatin Dalal, who has already joined Cognizant this month, for breach of his employment contract with Wipro and violation of rules. Meanwhile, Infosys sent an official communication to Cognizant accusing the company of unethical poaching tactics. The US-based Cognizant has been hiring several top executives from its competitors, especially Wipro and Infosys.What do experts say?Four legal experts told ET that while several companies have sued even lower-level employees, the enforceability of non-compete agreements is not very strong in India. Such an agreement violates Section 27 of the Indian Contract Act due to the possibility of depriving someone of their fundamental right to earn a living. Further, an employee's fundamental right to life and personal freedom guaranteed by Article 21 of the Indian Constitution are frequently upheld above the terms of the employment agreement. “Typically, judgements in non-compete clauses are largely in favour of employees. In general, individuals win 70% of the time while employers win about 30%,” said Hyderabad-based lawyer Dishit Bhattacharjee. While in Dalal's case, it is an alleged breach of non-compete clause that bars him from joining a rival within 12 months of resignation, “Wipro may need to prove the basis for making the employee sign the agreement if it violates the employee contract”, he added.","cleaned_content":"senior c suite executives moving to rival companies is common as are non compete clauses as part of employment contracts by employers while making top management employee appointments yet lawsuits against employees for contract violations are not a frequent phenomenon in india what happened it major wipro has filed at least two legal complaints against its former senior executives including former senior vice president mohd haque and former cfo jatin dalal who has already joined cognizant this month for breach of his employment contract with wipro and violation of rules meanwhile infosys sent an official communication to cognizant accusing the company of unethical poaching tactics the us based cognizant has been hiring several top executives from its competitors especially wipro and infosys what do experts say four legal experts told et that while several companies have sued even lower level employees the enforceability of non compete agreements is not very strong in india such an agreement violates section \u003cTWO_TEN\u003e of the indian contract act due to the possibility of depriving someone of their fundamental right to earn a living further an employees fundamental right to life and personal freedom guaranteed by article \u003cTWO_TEN\u003e of the indian constitution are frequently upheld above the terms of the employment agreement typically judgements in non compete clauses are largely in favour of employees in general individuals win \u003cSEVEN_TEN_PERCENT\u003e of the time while employers win about \u003cTHREE_TEN_PERCENT\u003e said hyderabad based lawyer dishit bhattacharjee while in dalals case it is an alleged breach of non compete clause that bars him from joining a rival within \u003cONE_TEN\u003e months of resignation wipro may need to prove the basis for making the employee sign the agreement if it violates the employee contract he added","timestamp":"2023-12-30T06:01:00+05:30","market_timestamp":"2024-01-01T09:15:00+05:30","off_market_hours":true}