{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-it-firms-fight-it-out-to-foil-plans-of-talent-fishing-companies/articleshow/106329965.cms","title":"Indian IT firms fight it out to foil plans of talent-fishing companies","description":"Plagued by a slew of senior-level management exodus, Wipro has filed lawsuits against at least two of them. In another instance, Infosys, the country’s second largest IT services firm, is reported to have accused Cognizant of using “unethical poaching tactics”.","content":"IT majors in India are reacting strongly, including taking legal route in some cases, to stop rivals from poaching their top talent at a time when there is pressure on growth amid a slowdown in global client spends.Plagued by a slew of senior-level management exodus, Wipro has filed lawsuits against at least two of them, including its former chief financial officer (CFO) Jatin Dalal who joined global rival Cognizant on December 1, for allegedly violating employment contracts and other clauses.In another instance, Infosys, the country’s second largest IT services firm, is reported to have accused Cognizant of using “unethical poaching tactics” after several of its executives quit to join the Nasdaq-listed firm.  ","cleaned_content":"it majors in india are reacting strongly including taking legal route in some cases to stop rivals from poaching their top talent at a time when there is pressure on growth amid a slowdown in global client spends plagued by a slew of senior level management exodus wipro has filed lawsuits against at least two of them including its former chief financial officer cfo jatin dalal who joined global rival cognizant on december \u003cONE_\u003e for allegedly violating employment contracts and other clauses in another instance infosys the country s second largest it services firm is reported to have accused cognizant of using unethical poaching tactics after several of its executives quit to join the nasdaq listed firm","timestamp":"2023-12-28T06:00:00+05:30","market_timestamp":"2023-12-28T09:15:00+05:30","off_market_hours":true}