{"url":"https://economictimes.indiatimes.com/tech/information-tech/us-client-once-made-infosys-cofounder-narayana-murthy-sleep-on-a-box-in-store-room-new-book-says/articleshow/106609556.cms","title":"US client once made Infosys cofounder Narayana Murthy sleep on a box in store room, new book says","description":"Published by Juggernaut Books, \"An Uncommon Love: The Early Life of Sudha and Narayana Murthy\" is the story of the Murthys' early years - from their courtship to Infosys' founding years and from their marriage to parenthood.","content":"When Narayana Murthy once visited the US for client work during the initial days of Infosys, a temperamental American businessman made him sleep on a large box in a windowless storeroom surrounded by cartons though his own home had four bedrooms. Indian-American author Chitra Banerjee Divakaruni has come out with a biography covering the early years of Sudha Murty's and Narayana Murthy's lives that is replete with many such nuggets about the iconic couple. Published by Juggernaut Books, “An Uncommon Love: The Early Life of Sudha and Narayana Murthy” is the story of the Murthys' early years - from their courtship to Infosys' founding years and from their marriage to parenthood. Donn Liles, who headed the New York-based company Data Basics Corporation, was a temperamental client and was especially unpleasant to Murthy at times. \"He would often delay payments when he could, and Murthy would then be the target of his ire because he would hold his ground, refusing to budge on timely payment for services. Or Donn would not provide timely authorization for Murthy and his Infosys colleagues to book hotels when they had to visit him in Manhattan. \"Once when Murthy visited the US for client work, Donn made him sleep on a large box in the storeroom, surrounded by cartons, though his home had four bedrooms. Additionally, Murthy had to manage Donn's many last-minute demands for resources,\" the book says. ","cleaned_content":"when narayana murthy once visited the us for client work during the initial days of infosys a temperamental american businessman made him sleep on a large box in a windowless storeroom surrounded by cartons though his own home had four bedrooms indian american author chitra banerjee divakaruni has come out with a biography covering the early years of sudha murtys and narayana murthys lives that is replete with many such nuggets about the iconic couple published by juggernaut books an uncommon love the early life of sudha and narayana murthy is the story of the murthys early years from their courtship to infosys founding years and from their marriage to parenthood donn liles who headed the new york based company data basics corporation was a temperamental client and was especially unpleasant to murthy at times he would often delay payments when he could and murthy would then be the target of his ire because he would hold his ground refusing to budge on timely payment for services or donn would not provide timely authorization for murthy and his infosys colleagues to book hotels when they had to visit him in manhattan once when murthy visited the us for client work donn made him sleep on a large box in the storeroom surrounded by cartons though his home had four bedrooms additionally murthy had to manage donns many last minute demands for resources the book says","timestamp":"2024-01-09T11:01:00+05:30","market_timestamp":"2024-01-09T11:01:00+05:30","off_market_hours":false}