{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-companies-expected-to-report-soft-q3-as-higher-furloughs-to-weigh-on-revenue-growth/articleshow/106612445.cms","title":"IT companies expected to report soft Q3 as higher furloughs to weigh on revenue growth","description":"Tata Consultancy Services (TCS) and Infosys will declare their Q3FY24 report card on January 11 (Thursday) and Wipro and HCL Technologies on January 12 (Friday).","content":"Indian IT companies are expected to report a \"soft\" third quarter with higher-than-usual furloughs weighing on revenue growth, industry watchers said cautioning that demand outlook commentary is likely to be unchanged as clients continue to scrutinise discretionary spends and prioritise cost optimisation. The big earnings week for tech heavyweights is up ahead, with the top tier IT companies slated to announce their December quarter numbers this week.  Tata Consultancy Services (TCS) and Infosys will declare their Q3FY24 report card on January 11 (Thursday) and Wipro and HCL Technologies on January 12 (Friday).  All eyes will be on management commentary from the IT pack on prevailing customer sentiments across BFSI, and technology services, as well as demand scenario panning out in key markets of the US and Europe.  \"We expect IT companies to report soft quarter-on-quarter constant currency revenue growth in Q3FY24 due to higher-than-usual furloughs for most companies in our coverage universe. We expect margins to be impacted due to furloughs and wage hikes (rolled out by Infy, Wipro, HCLT),\" ICICI Securities said in its Q3FY24 results preview.  The signs of improvement in IT spending in the near term remains elusive, with continued scrutiny over discretionary spends and focus on cost optimisation, ICICI Securities further said. ","cleaned_content":"indian it companies are expected to report a soft third quarter with higher than usual furloughs weighing on revenue growth industry watchers said cautioning that demand outlook commentary is likely to be unchanged as clients continue to scrutinise discretionary spends and prioritise cost optimisation the big earnings week for tech heavyweights is up ahead with the top tier it companies slated to announce their december quarter numbers this week tata consultancy services tcs and infosys will declare their q3fy24 report card on january \u003cONE_TEN\u003e thursday and wipro and hcl technologies on january \u003cONE_TEN\u003e friday all eyes will be on management commentary from the it pack on prevailing customer sentiments across bfsi and technology services as well as demand scenario panning out in key markets of the us and europe we expect it companies to report soft quarter on quarter constant currency revenue growth in q3fy24 due to higher than usual furloughs for most companies in our coverage universe we expect margins to be impacted due to furloughs and wage hikes rolled out by infy wipro hclt icici securities said in its q3fy24 results preview the signs of improvement in it spending in the near term remains elusive with continued scrutiny over discretionary spends and focus on cost optimisation icici securities further said","timestamp":"2024-01-07T15:35:00+05:30","market_timestamp":"2024-01-08T09:15:00+05:30","off_market_hours":true}