{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-gets-its-mojo-back-under-new-ceos-watch/articleshow/106646376.cms","title":"Cognizant gets its mojo back under new CEO’s watch","description":"Experts say ‘people's person’ Ravi Kumar wins back competitiveness on large deals. He is also getting major talent back to Cognizant, and has rationalised the company with real estate as well as headcount consolidation.","content":"As former Infosys President Ravi Kumar S completes one year as CEO of IT services and consulting major Cognizant Technology Solutions Corp this month, experts and insiders ET gave a thumbs up to the new chief of the $19.4 billion dollar company has steered Cognizant into getting back its old “mojo”.Kumar, 49, is a \"people's person\" who is winning back competitiveness on large deals, is getting major talent back to CTS, has rationalised the company with real-estate as well as headcount consolidation. However, results in terms of actual revenue growth and profits are yet to show in a tough market situation where tech spending has dwindled. It is also yet to be seen how CTS under Kumar navigates lawsuits and warnings by Wipro and Infosys over poaching of senior leadership. Four of the experts ET spoke to, unanimously agreed that Kumar’s working style is much closer to the old Cognizant way and his management approach is different from his predecessor Brian Humphries, who led the firm for four years after being coming from outside of the traditional IT services space.Kumar, joined the US-headquartered firm as its fifth CEO since it was founded in Chennai in 1994 as a unit of Dun \u0026 Bradstreet. Taking the hotseat at Cognizant on 16 January, 2023, Kumar came in at a time when Cognizant was struggling to remain relevant as a key services partner, unable to close large deals, facing high attrition amid unfavourable macro factors that have impacted the IT industry.","cleaned_content":"as former infosys president ravi kumar s completes one year as ceo of it services and consulting major cognizant technology solutions corp this month experts and insiders et gave a thumbs up to the new chief of the \u003cONE_TEN\u003e billion dollar company has steered cognizant into getting back its old mojo kumar \u003cFOUR_TEN\u003e is a peoples person who is winning back competitiveness on large deals is getting major talent back to cts has rationalised the company with real estate as well as headcount consolidation however results in terms of actual revenue growth and profits are yet to show in a tough market situation where tech spending has dwindled it is also yet to be seen how cts under kumar navigates lawsuits and warnings by wipro and infosys over poaching of senior leadership four of the experts et spoke to unanimously agreed that kumar s working style is much closer to the old cognizant way and his management approach is different from his predecessor brian humphries who led the firm for four years after being coming from outside of the traditional it services space kumar joined the us headquartered firm as its fifth ceo since it was founded in chennai in \u003cONE_THOUSAND\u003e as a unit of dun bradstreet taking the hotseat at cognizant on \u003cONE_TEN\u003e january \u003cTWO_THOUSAND\u003e kumar came in at a time when cognizant was struggling to remain relevant as a key services partner unable to close large deals facing high attrition amid unfavourable macro factors that have impacted the it industry","timestamp":"2024-01-10T09:52:00+05:30","market_timestamp":"2024-01-10T09:52:00+05:30","off_market_hours":false}