{"url":"https://economictimes.indiatimes.com/tech/information-tech/nr-narayana-murthys-big-regret-is-refusing-wife-from-joining-infosys/articleshow/106552314.cms","title":"NR Narayana Murthy’s big regret is refusing wife from joining Infosys","description":"Calling himself “wrongly idealistic”, NR Narayana Murthy said in a TV interview that his wife was “more qualified than all seven” engineers including himself who established Infosys together.","content":"Infosys co-founder NR Narayana Murthy has expressed regret that he did not let his family members, especially wife Sudha Murty, join the IT giant he helped set up more than four decades ago.Calling himself “wrongly idealistic”, Murthy said in an interview with CNBC-TV18 that his wife was “more, or as qualified as” the seven engineers (including himself) who helped establish Infosys, creating one of the earliest successful startups in India after liberalisation.Meanwhile, Murthy also said that Rohan Murty, his second child, is stricter than him and he would “never say that” he wants to join Infosys.“First of all, I am just a shareholder and I have not been consulted on any issue in Infosys since August 4-5, 2017, when Nandan took over. Not once. It’s the right thing, he’s doing the way we all did. Apart from being the largest family shareholders of Infosys, we have nothing to do with Infosys…that’s the reality,” he said.In December 2022, Murthy had said in response to an ET query that he was “completely wrong” in not allowing the next generation of the promoter-founder families to take up active roles in the now Bengaluru-headquartered tech giant.","cleaned_content":"infosys co founder nr narayana murthy has expressed regret that he did not let his family members especially wife sudha murty join the it giant he helped set up more than four decades ago calling himself wrongly idealistic murthy said in an interview with cnbc tv18 that his wife was more or as qualified as the seven engineers including himself who helped establish infosys creating one of the earliest successful startups in india after liberalisation meanwhile murthy also said that rohan murty his second child is stricter than him and he would never say that he wants to join infosys first of all i am just a shareholder and i have not been consulted on any issue in infosys since august \u003cFOUR_\u003e \u003cFIVE_\u003e \u003cTWO_THOUSAND\u003e when nandan took over not once it s the right thing he s doing the way we all did apart from being the largest family shareholders of infosys we have nothing to do with infosys that s the reality he said in december \u003cTWO_THOUSAND\u003e murthy had said in response to an et query that he was completely wrong in not allowing the next generation of the promoter founder families to take up active roles in the now bengaluru headquartered tech giant","timestamp":"2024-01-05T11:38:00+05:30","market_timestamp":"2024-01-05T11:38:00+05:30","off_market_hours":false}