{"url":"https://economictimes.indiatimes.com/tech/information-tech/top-four-it-firms-report-50000-fall-in-headcount-over-last-year/articleshow/106784610.cms","title":"Top four IT firms report 50,000 fall in headcount over last year","description":"Over the year, the headcount at India’s largest software services firm, TCS, dropped by 10,669. Infosys reported a 24,182 reduction, while Wipro posted a 18,510 fall. At HCLTech, the number increased by 2,486","content":"India’s top four IT companies have reported a combined headcount drop of 50,875 at the end of the fiscal third quarter from a year earlier.Over the year, the headcount at India’s largest software services firm, TCS, dropped by 10,669. Infosys reported a 24,182 reduction, while Wipro posted a 18,510 fall. At HCLTech, the number increased by 2,486.Senior-level churnThe sector has also been embroiled in a poaching row, with Infosys and Wipro accusing Cognizant of poaching employees. Wipro sued two people – former chief financial Officer Jatin Dalal and executive Mohd Haque – after they joined Cognizant. Infosys, not long after, sent a notice to the US-listed rival.Infosys, Wipro and Tech Mahindra have seen a spate of top-level exits over the past year. While TCS and HCLTech also saw exits, they were fewer in number.","cleaned_content":"india s top four it companies have reported a combined headcount drop of \u003cFIVE_TEN_THOUSAND\u003e at the end of the fiscal third quarter from a year earlier over the year the headcount at india s largest software services firm tcs dropped by \u003cONE_TEN_THOUSAND\u003e infosys reported a \u003cTWO_TEN_THOUSAND\u003e reduction while wipro posted a \u003cONE_TEN_THOUSAND\u003e fall at hcltech the number increased by \u003cTWO_THOUSAND\u003e senior level churnthe sector has also been embroiled in a poaching row with infosys and wipro accusing cognizant of poaching employees wipro sued two people former chief financial officer jatin dalal and executive mohd haque after they joined cognizant infosys not long after sent a notice to the us listed rival infosys wipro and tech mahindra have seen a spate of top level exits over the past year while tcs and hcltech also saw exits they were fewer in number","timestamp":"2024-01-13T06:01:00+05:30","market_timestamp":"2024-01-15T09:15:00+05:30","off_market_hours":true}