{"url":"https://economictimes.indiatimes.com/tech/information-tech/sap-labs-india-elevates-milesh-j-as-strategy-operations-head/articleshow/106898927.cms","title":"SAP Labs India elevates Milesh J as strategy and operations head","description":"With over 23 years at SAP, Milesh has worked across critical domains, including product engineering, product management, business development, customer engagement, and consulting. He took up the VP role in April 2022.","content":"SAP Labs India has promoted Milesh J as the head of strategy \u0026 operations effective February 1 after an almost two-year stint as the vice president and head of cloudERP engineering at data transformation \u0026 enterprise content management.“Milesh will be responsible for overall location strategy and operational efficiency of SAP Labs India and also manage strategic cross organisational projects synergising across all lines of business in SAP Labs India and liaising externally with industry, government, and ecosystem,” SAP Labs said in a statement.With over 23 years at SAP, Milesh has worked across critical domains, including product engineering, product management, business development, customer engagement, and consulting. He took up the VP role in April 2022.“Over the years, SAP Labs India has grown to become a cornerstone of SAP's global innovation ecosystem. As we enter the next phase of transformation journey, we recognise the need for strategic agility and a forward-thinking approach to capitalise on our location advantage. In this regard, I am delighted to welcome Milesh J as head of strategy \u0026 operations, SAP Labs India,” said Sindhu Gangadharan, SVP \u0026 MD, SAP Labs India, and head, SAP User Enablement. In his previous roles, he also served as the vice president and head of the S/4HANA Data Transformation \u0026 Enterprise Content Management Unit at SAP Labs India. Milesh oversaw product engineering teams, with a specific focus on cloud and successfully delivering the business results for the product portfolio. He started his career with a short one-year stint at Tata Infotech.","cleaned_content":"sap labs india has promoted milesh j as the head of strategy operations effective february \u003cONE_\u003e after an almost two year stint as the vice president and head of clouderp engineering at data transformation enterprise content management milesh will be responsible for overall location strategy and operational efficiency of sap labs india and also manage strategic cross organisational projects synergising across all lines of business in sap labs india and liaising externally with industry government and ecosystem sap labs said in a statement with over \u003cTWO_TEN\u003e years at sap milesh has worked across critical domains including product engineering product management business development customer engagement and consulting he took up the vp role in april \u003cTWO_THOUSAND\u003e over the years sap labs india has grown to become a cornerstone of saps global innovation ecosystem as we enter the next phase of transformation journey we recognise the need for strategic agility and a forward thinking approach to capitalise on our location advantage in this regard i am delighted to welcome milesh j as head of strategy operations sap labs india said sindhu gangadharan svp md sap labs india and head sap user enablement in his previous roles he also served as the vice president and head of the s \u003cFOUR_\u003e hana data transformation enterprise content management unit at sap labs india milesh oversaw product engineering teams with a specific focus on cloud and successfully delivering the business results for the product portfolio he started his career with a short one year stint at tata infotech","timestamp":"2024-01-16T17:13:00+05:30","market_timestamp":"2024-01-17T09:15:00+05:30","off_market_hours":true}