{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-giants-add-22-billion-to-market-cap-in-just-2-days/articleshow/106865271.cms","title":"IT giants add $22 billion to market cap in just 2 days","description":"Led by industry heavyweights TCS Infosys, the four key software companies, have added about $22 billion in market value in just two trading sessions since Thursday, when the Q3 earnings season kicked off. A potential revenue rebound and easing global macroeconomic worries have boosted sentiment.","content":"Shares of Indian software giants started the new year on a roaring note after higher-than-expected sales last quarter surprised investors and helped burnish the outlook for the sector.Led by industry bellwether Tata Consultancy Services Ltd. and Infosys Ltd., the four key software companies, have added about $22 billion in market value in just two trading sessions since Thursday, when the earnings season kicked off. A potential revenue rebound and easing global macroeconomic worries have boosted sentiment.Shares of Wipro Ltd. rallied as much as 14% on Monday, their biggest intraday gain since July 2020 before paring gains, as the surprise revenue beat triggered rating upgrades from some brokerages. HCL Technologies Ltd. surged to a new all-time high, boosted by its forecast for improved revenue growth.“A change in sentiment is being reflected in management commentary,” said Siddarth Bhamre, head of research at Religare Broking Ltd. Companies such as Infosys, which have so far been fairly conservative in their commentary, are now beginning to express optimism, he added.   ","cleaned_content":"shares of indian software giants started the new year on a roaring note after higher than expected sales last quarter surprised investors and helped burnish the outlook for the sector led by industry bellwether tata consultancy services ltd and infosys ltd the four key software companies have added about \u003cTWO_TEN\u003e billion in market value in just two trading sessions since thursday when the earnings season kicked off a potential revenue rebound and easing global macroeconomic worries have boosted sentiment shares of wipro ltd rallied as much as \u003cONE_TEN_PERCENT\u003e on monday their biggest intraday gain since july \u003cTWO_THOUSAND\u003e before paring gains as the surprise revenue beat triggered rating upgrades from some brokerages hcl technologies ltd surged to a new all time high boosted by its forecast for improved revenue growth a change in sentiment is being reflected in management commentary said siddarth bhamre head of research at religare broking ltd companies such as infosys which have so far been fairly conservative in their commentary are now beginning to express optimism he added","timestamp":"2024-01-15T17:31:00+05:30","market_timestamp":"2024-01-16T09:15:00+05:30","off_market_hours":true}