{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-may-see-a-muted-q4-rebound-likely-in-fy25-experts/articleshow/106843002.cms","title":"IT may see a muted Q4; rebound likely in FY25: experts","description":"The third-quarter performance of Indian IT majors such as TCS, Infosys, HCLTech and Wipro did not inspire much confidence. In Q3, Tata Consultancy Services posted a 4% increase in revenue and a 2% expansion in profit, while Infosys reported a 7.3% drop in profit. Meanwhile, Wipro’s profit fell 12% and HCLTech’s grew 6.2%.","content":"Growth in the information technology sector may rebound from next fiscal year, experts said, though the third-quarter performance of India's top four IT majors did not inspire much confidence.While companies indicated little uptick in confidence in the market after the US Federal Reserve last month signalled multiple interest rate cuts in 2024, analysts expect a turnaround after this and the next quarters based on management commentary on the demand environment.For the fiscal third quarter ended in December, India's largest IT firm, Tata Consultancy Services, posted a 4% increase in revenue and 2% expansion in profit over the year-earlier period. Its smaller rival, Infosys, tightened its revenue growth guidance for FY24 to 1.5-2.0% in the third revision of the estimate after reporting a 7.3% fall in profit and a 1% increase in revenue. ","cleaned_content":"growth in the information technology sector may rebound from next fiscal year experts said though the third quarter performance of indias top four it majors did not inspire much confidence while companies indicated little uptick in confidence in the market after the us federal reserve last month signalled multiple interest rate cuts in \u003cTWO_THOUSAND\u003e analysts expect a turnaround after this and the next quarters based on management commentary on the demand environment for the fiscal third quarter ended in december indias largest it firm tata consultancy services posted a \u003cFOUR_PERCENT\u003e increase in revenue and \u003cTWO_PERCENT\u003e expansion in profit over the year earlier period its smaller rival infosys tightened its revenue growth guidance for fy24 to \u003cONE_\u003e \u003cTWO_PERCENT\u003e in the third revision of the estimate after reporting a \u003cSEVEN_PERCENT\u003e fall in profit and a \u003cONE_PERCENT\u003e increase in revenue","timestamp":"2024-01-15T06:00:00+05:30","market_timestamp":"2024-01-15T09:15:00+05:30","off_market_hours":true}