{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-aims-to-train-entire-staff-with-genai-skills/articleshow/106888569.cms","title":"TCS aims to train entire staff with GenAI skills","description":"TCS, the largest IT services exporter in the country, plans to train its entire staff of over 5 lakh software engineers on Generative Artificial Intelligence (AI). The company's 'AI.Cloud' unit is engaged in 250 Gen AI projects and using the intelligence for faster client work.","content":"Country's largest IT services exporter TCS will train its entire staff of over 5 lakh software engineers on the upcoming Generative Artificial Intelligence (AI) opportunity, as per a senior official. As a business opportunity, Gen AI is in its \"early days\" right now and the use cases are smaller right now, head of the company's recently created 'AI.Cloud' unit Siva Ganesan told PTI.  The company, which had disclosed a few months ago about being engaged in 250 generative AI powered projects, is also using the intelligence gleaned from Gen AI for making its ongoing work for clients faster, he added.  \"So it's probably smaller use cases right now. It is a matter of time before the huge transformation that we also talk about that supplements assets and augment come by. Is there a timeline to that, I think for right now it is wait and watch, we have to see in the coming quarters right of the game unfolds,\" he said.  As it gears up for the future which will witness higher demand for AI offerings, TCS is in investment mode, primarily getting the staff ready with the skills and also partnering with the right entities, officials said.  \"The workforce is getting geared and getting primed and it's a matter of time when all the organization itself is (Gen) AI ready,\" he said. ","cleaned_content":"countrys largest it services exporter tcs will train its entire staff of over \u003cFIVE_\u003e lakh software engineers on the upcoming generative artificial intelligence ai opportunity as per a senior official as a business opportunity gen ai is in its early days right now and the use cases are smaller right now head of the companys recently created ai cloud unit siva ganesan told pti the company which had disclosed a few months ago about being engaged in \u003cTWO_HUNDRED\u003e generative ai powered projects is also using the intelligence gleaned from gen ai for making its ongoing work for clients faster he added so its probably smaller use cases right now it is a matter of time before the huge transformation that we also talk about that supplements assets and augment come by is there a timeline to that i think for right now it is wait and watch we have to see in the coming quarters right of the game unfolds he said as it gears up for the future which will witness higher demand for ai offerings tcs is in investment mode primarily getting the staff ready with the skills and also partnering with the right entities officials said the workforce is getting geared and getting primed and its a matter of time when all the organization itself is gen ai ready he said","timestamp":"2024-01-16T12:10:00+05:30","market_timestamp":"2024-01-16T12:10:00+05:30","off_market_hours":false}