{"url":"https://economictimes.indiatimes.com/tech/information-tech/varanium-cloud-set-to-open-second-office-and-bpo-centre-in-maharashtras-sawantwadi/articleshow/106981548.cms","title":"Varanium Cloud set to open second office and BPO centre in Maharashtra's Sawantwadi","description":"Varanium Cloud also plans to expand its presence in the Konkan region, establishing multiple edge data centres and ed-tech centres.","content":"Varanium Cloud Limited, a digital technology company, is setting up its second office and business process outsourcing (BPO) centre at Sawantwadi in Maharashtra.The BPO centre will focus on data accounting, background verification and debt recovery, among other activities. It is expected to create 200 IT jobs in Sindhudurg district, according to a press release issued by the company on Friday.\"Varanium leverages its innovative phy-gital infrastructure, utilising technologies such as Hydra, to establish high-compute, cost-effective BPO operations in non-urban areas,\" the statement said.“Varanium Cloud wants to break the trend of individuals from small towns migrating to cities in pursuit of employment,\" managing director Harshawardhan Sabale said. \"We want to invest in local talent and infrastructure and contribute to the growth and prosperity in Sindhudurg.\"Varanium Cloud also plans to expand its presence in the Konkan region, establishing multiple edge data centres and ed-tech centres.","cleaned_content":"varanium cloud limited a digital technology company is setting up its second office and business process outsourcing bpo centre at sawantwadi in maharashtra the bpo centre will focus on data accounting background verification and debt recovery among other activities it is expected to create \u003cTWO_HUNDRED\u003e it jobs in sindhudurg district according to a press release issued by the company on friday varanium leverages its innovative phy gital infrastructure utilising technologies such as hydra to establish high compute cost effective bpo operations in non urban areas the statement said varanium cloud wants to break the trend of individuals from small towns migrating to cities in pursuit of employment managing director harshawardhan sabale said we want to invest in local talent and infrastructure and contribute to the growth and prosperity in sindhudurg varanium cloud also plans to expand its presence in the konkan region establishing multiple edge data centres and ed tech centres","timestamp":"2024-01-19T13:12:00+05:30","market_timestamp":"2024-01-19T13:12:00+05:30","off_market_hours":false}