{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-it-majors-see-more-positive-attitude-from-us-federal-clients/articleshow/107033318.cms","title":"Tech boost? several US federal contracts up for renewal in next two quarters","description":"Experts are of the view that while it's still hard for Indian companies to crack large US federal deals that are up for renewals over the next two quarters, there is a more positive attitude towards Indian-heritage suppliers.","content":"Several large US federal deals from the likes of General Services Administration, US Cyber Command, Department of Energy, NASA, Federal Aviation Administration, and Department of Education are up for renewals over the next two quarters, data sourced by ET shows.Several of these deals are in the vicinity of a billion dollars, while a few are significantly above that threshold. Almost a third of the roughly $16 billion worth of large deal renewals in the market in the next two quarters are federal contracts, data from Omdia Research showed. Most of these contracts are multi-year cloud modernisation, application development, and maintenance deals, which American IT majors like Accenture, Perspecta, CACI International, SAIC, Noblis, and Maximus currently service. Barring Accenture, the remaining companies earn a majorty of their revenues through federal contracts. Experts say that while it's still hard territory for Indian companies to crack into, there is a more positive attitude from US federal clients toward Indian-heritage suppliers with India being widely accepted as the major talent location for technology these days. There has been a significant change over the last few years with strengthening India-US ties, they added. HfS Research chief executive Phil Fersht said things are changing for sure. However, they face stiffer competition from US tech services firms, such as Deloitte and KPMG, which offer managed services in direct competition with the leading Indian suppliers.","cleaned_content":"several large us federal deals from the likes of general services administration us cyber command department of energy nasa federal aviation administration and department of education are up for renewals over the next two quarters data sourced by et shows several of these deals are in the vicinity of a billion dollars while a few are significantly above that threshold almost a third of the roughly \u003cONE_TEN\u003e billion worth of large deal renewals in the market in the next two quarters are federal contracts data from omdia research showed most of these contracts are multi year cloud modernisation application development and maintenance deals which american it majors like accenture perspecta caci international saic noblis and maximus currently service barring accenture the remaining companies earn a majorty of their revenues through federal contracts experts say that while its still hard territory for indian companies to crack into there is a more positive attitude from us federal clients toward indian heritage suppliers with india being widely accepted as the major talent location for technology these days there has been a significant change over the last few years with strengthening india us ties they added hfs research chief executive phil fersht said things are changing for sure however they face stiffer competition from us tech services firms such as deloitte and kpmg which offer managed services in direct competition with the leading indian suppliers","timestamp":"2024-01-22T06:00:00+05:30","market_timestamp":"2024-01-22T09:15:00+05:30","off_market_hours":true}