{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-wins-15-year-deal-with-uk-insurer-aviva/articleshow/107266916.cms","title":"TCS wins 15-year deal with UK insurer Aviva","description":"TCS has won the deal expanding its existing engagement with UK-based insurance provider Aviva. As part of the deal, the end-to-end policy administration and servicing will expand to cover over 5.5 million policies, and will be managed by TCS’ UK subsidiary Diligenta.","content":"Tata Consultancy Services (TCS) has won a 15-year deal expanding its existing engagement with UK-based insurance provider Aviva, the company said on Tuesday. TCS will transform Aviva’s UK life business and enhance customer experience utilising the TCS BaNCS-based platform. As part of this, the end-to-end policy administration and servicing will expand to cover over 5.5 million policies. It will be managed by TCS’s UK subsidiary Diligenta which is regulated by the Financial Conduct Authority (FCA). “Extending this strategic partnership will improve how we serve our customers, further simplify our operations and support our growth ambitions. It will allow us to rationalise our systems and improve efficiency, bringing significant benefits for our customers and the business,” said Doug Brown, CEO insurance, wealth and retirement, Aviva. TCS will extend the platform and offer self-service capabilities for customers, digitally powered service delivery centers and a simplified technology landscape. ","cleaned_content":"tata consultancy services tcs has won a \u003cONE_TEN\u003e year deal expanding its existing engagement with uk based insurance provider aviva the company said on tuesday tcs will transform aviva s uk life business and enhance customer experience utilising the tcs bancs based platform as part of this the end to end policy administration and servicing will expand to cover over \u003cFIVE_\u003e million policies it will be managed by tcs s uk subsidiary diligenta which is regulated by the financial conduct authority fca extending this strategic partnership will improve how we serve our customers further simplify our operations and support our growth ambitions it will allow us to rationalise our systems and improve efficiency bringing significant benefits for our customers and the business said doug brown ceo insurance wealth and retirement aviva tcs will extend the platform and offer self service capabilities for customers digitally powered service delivery centers and a simplified technology landscape","timestamp":"2024-01-30T19:10:00+05:30","market_timestamp":"2024-01-31T09:15:00+05:30","off_market_hours":true}