{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-midcap-firms-find-a-seat-at-larger-deal-tables-in-slump/articleshow/107209282.cms","title":"IT midcap firms find a seat at larger deal tables in slump","description":"IT midcap companies such as LTIMindtree and Persistent Systems said they are increasingly getting an opportunity to bid for bigger deals due to their strong execution. This was only open to large caps in the past. Experts said that while sectors like BFSI and hitech are down currently, there is good demand from healthcare and life sciences, manufacturing, and ER\u0026D where the mid-tier companies have a good play.","content":"IT midcaps are finally getting a look-in for large deals earlier earmarked for the megacaps in a still-soft demand environment, reflecting the steady ascent of these companies up the complexity gradient to be considered for projects that previously had limited competitive intensity.Companies such as LTIMindtree and Persistent noted that they are increasingly getting an opportunity to bid for bigger deals due to their strong execution that was only open to large caps in the past. “We would never get a seat on the table when we were operating as different organisations (LTI and Mindtree) but now people acknowledge the fact that we can be an agile and nimble organisation that can be competing with anybody else (for large deals and renewals),” Debashis Chatterjee, chief executive of LTIMindtree told ET. Pareekh Jain, founder of EIIRTrend, said that while the larger IT majors are chasing deals above the $100 million range, it has opened up a window for mid tier companies to bid and qualify for an increasing number of deals in the less than $100 million range. “These are still very large deals for midcaps and in the current ecosystem, large caps are focused on bigger deals. These clients also tend to be relatively small for the bigger peers,” said Jain. ","cleaned_content":"it midcaps are finally getting a look in for large deals earlier earmarked for the megacaps in a still soft demand environment reflecting the steady ascent of these companies up the complexity gradient to be considered for projects that previously had limited competitive intensity companies such as ltimindtree and persistent noted that they are increasingly getting an opportunity to bid for bigger deals due to their strong execution that was only open to large caps in the past we would never get a seat on the table when we were operating as different organisations lti and mindtree but now people acknowledge the fact that we can be an agile and nimble organisation that can be competing with anybody else for large deals and renewals debashis chatterjee chief executive of ltimindtree told et pareekh jain founder of eiirtrend said that while the larger it majors are chasing deals above the \u003cONE_HUNDRED\u003e million range it has opened up a window for mid tier companies to bid and qualify for an increasing number of deals in the less than \u003cONE_HUNDRED\u003e million range these are still very large deals for midcaps and in the current ecosystem large caps are focused on bigger deals these clients also tend to be relatively small for the bigger peers said jain","timestamp":"2024-01-29T06:00:00+05:30","market_timestamp":"2024-01-29T09:15:00+05:30","off_market_hours":true}