{"url":"https://economictimes.indiatimes.com/tech/information-tech/exclusive-wipro-to-lay-off-hundreds-of-mid-level-employees-to-improve-margins/articleshow/107281960.cms","title":"Exclusive: Wipro to lay off hundreds of mid-level employees to improve margins","description":"Wipro is cutting mid-level roles to improve margins. It bought Capco for $1.45 billion, Delaporte's biggest bet. Job cuts are part of the 'Left-Shift' strategy. Wipro underperforms and faces conflicting goals.","content":"Wipro is in the process of cutting ‘hundreds’ of mid-level roles onsite as it attempts to improve its margins, two sources with knowledge of the matter told ET Prime. Wipro has the lowest margins amongst the four largest India-listed IT services companies. For the December quarter, its margin came in at 16%. Tata Consultancy Services, Infosys and HCL Technologies reported margins of 25%, 20.5% and 19.8% respectively. “The intimations started being sent earlier this month. Hundreds of mid-level executives onsite are being let go,” said a source informed of the job cuts. “They have very expensive resources onsite in Capco, and even though the growth is coming back, it is not enough. Aparna (Iyer - Wipro Chief Financial Officer) has been tasked with showing better margins this quarter,” the source added. Wipro had acquired consulting firm Capco for $1.45 billion in 2021, making this CEO Thierry Delaporte’s biggest bet. However, as post-Covid growth fell and world economies cooled, the consulting business slowed down as customers curbed spending.","cleaned_content":"wipro is in the process of cutting hundreds of mid level roles onsite as it attempts to improve its margins two sources with knowledge of the matter told et prime wipro has the lowest margins amongst the four largest india listed it services companies for the december quarter its margin came in at \u003cONE_TEN_PERCENT\u003e tata consultancy services infosys and hcl technologies reported margins of \u003cTWO_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively the intimations started being sent earlier this month hundreds of mid level executives onsite are being let go said a source informed of the job cuts they have very expensive resources onsite in capco and even though the growth is coming back it is not enough aparna iyer wipro chief financial officer has been tasked with showing better margins this quarter the source added wipro had acquired consulting firm capco for \u003cONE_\u003e billion in \u003cTWO_THOUSAND\u003e making this ceo thierry delaporte s biggest bet however as post covid growth fell and world economies cooled the consulting business slowed down as customers curbed spending","timestamp":"2024-01-31T11:51:00+05:30","market_timestamp":"2024-01-31T11:51:00+05:30","off_market_hours":false}