{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-services-hiring-shows-signs-of-traction-intent-up-10-in-january/articleshow/107209155.cms","title":"IT services hiring shows signs of traction, intent up 10% in January","description":"The uptick in IT services hiring comes after the macroeconomic slump in 2023 led to a massive headcount correction last year. However, experts caution that current requirements are only filling vacant roles not replaced over the past few quarters and that the numbers are still small.","content":"The Indian IT services sector is showing some green shoots with a 10% increase in hiring intent as of January end, recruitment experts told ET. This comes after the macroeconomic slump in 2023 led to a massive headcount correction last year.Last quarter, the top five companies together reported a 61,000-plus drop in headcount year-on-year. Most IT firms, however, are optimistic about the growth prospects starting FY25 in April this year given the volume of deal pipeline in the quarters ahead even as they are not optimistic about demand reviving immediately. Hiring mandates are usually given out a quarter in advance and signify uptick in demand. Experts, however, caution that current requirements are only filling vacant roles not replaced over the past few quarters and that the numbers are still small.Sunil C, CEO of TeamLease Digital said that there has been a 10% uptick in hiring intent from the IT sector post January 15. This is an improvement considering IT services had frozen both permanent and contracted hiring for some time. Until Q3, the requirement flow has been pretty slow. ","cleaned_content":"the indian it services sector is showing some green shoots with a \u003cONE_TEN_PERCENT\u003e increase in hiring intent as of january end recruitment experts told et this comes after the macroeconomic slump in \u003cTWO_THOUSAND\u003e led to a massive headcount correction last year last quarter the top five companies together reported a \u003cSIX_TEN_THOUSAND\u003e plus drop in headcount year on year most it firms however are optimistic about the growth prospects starting fy25 in april this year given the volume of deal pipeline in the quarters ahead even as they are not optimistic about demand reviving immediately hiring mandates are usually given out a quarter in advance and signify uptick in demand experts however caution that current requirements are only filling vacant roles not replaced over the past few quarters and that the numbers are still small sunil c ceo of teamlease digital said that there has been a \u003cONE_TEN_PERCENT\u003e uptick in hiring intent from the it sector post january \u003cONE_TEN\u003e this is an improvement considering it services had frozen both permanent and contracted hiring for some time until q3 the requirement flow has been pretty slow","timestamp":"2024-01-29T09:51:00+05:30","market_timestamp":"2024-01-29T09:51:00+05:30","off_market_hours":false}