{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-looks-to-double-staff-in-france-over-next-three-years/articleshow/107163238.cms","title":"TCS looks to double staff in France over next three years","description":"TCS plans to double staff in France over the next three years due to business growth. France is a fast-growing market for TCS, with 1,600 employees across four major centers. TCS has been in France for over 30 years and expects accelerated growth in the future. It works with 80 French clients and has an innovation center in Paris.","content":"TCS is aiming to double staff in France over the next three years as it sees handsome business growth in the European country, a senior official said on Thursday. At present, the largest Indian IT services company employs 1,600 people in France across four major centres in the country.  France is among the fastest growing markets in Europe for TCS, growing much faster than the numbers it reports for the continent, its head of European business, Sapthagiri Chapalapalli, told PTI.  Chapalapalli said TCS has been present in France for over three decades now and right now, it feels that the bulk of the groundwork is ready for a faster growth of the business going ahead.  The business in France will \"multiply\" from here on by growing at an accelerated pace courtesy building blocks which have been put in place, he said.  It has been working with 80 French clients across all major sectors which are key to the local economy and also runs an innovation centre in Paris. ","cleaned_content":"tcs is aiming to double staff in france over the next three years as it sees handsome business growth in the european country a senior official said on thursday at present the largest indian it services company employs \u003cONE_THOUSAND\u003e people in france across four major centres in the country france is among the fastest growing markets in europe for tcs growing much faster than the numbers it reports for the continent its head of european business sapthagiri chapalapalli told pti chapalapalli said tcs has been present in france for over three decades now and right now it feels that the bulk of the groundwork is ready for a faster growth of the business going ahead the business in france will multiply from here on by growing at an accelerated pace courtesy building blocks which have been put in place he said it has been working with \u003cEIGHT_TEN\u003e french clients across all major sectors which are key to the local economy and also runs an innovation centre in paris","timestamp":"2024-01-26T11:50:00+05:30","market_timestamp":"2024-01-29T09:15:00+05:30","off_market_hours":true}