{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-inks-seven-year-deal-with-irish-food-company-musgrave/articleshow/107298028.cms","title":"Infosys inks seven-year deal with Irish food company Musgrave","description":"As part of the collaboration, Infosys will automate Musgrave’s IT operations by utilising AI and cloud offerings. It will use Infosys Topaz - an AI-first set of services, solutions, and platforms - and Infosys Cobalt - a set of services, solutions, and platforms for enterprises to accelerate their cloud journey to help Musgrave transform its IT operations.","content":"Infosys said on Wednesday that it has signed a seven-year strategic collaboration with Musgrave, an Irish food retail, wholesale, and food service company. As part of this collaboration, Infosys will automate Musgrave’s IT operations by utilising AI and cloud offerings through Infosys Topaz - an AI-first set of services, solutions, and platforms - and Infosys Cobalt - a set of services, solutions, and platforms for enterprises to accelerate their cloud journey. Deal financials were not disclosed. These Infosys offerings will enable Musgrave to transform its IT operations, build technical expertise, and help accelerate towards its goals of enhancing the experiences of its customers and retail partners.Musgrave will also leverage Infosys’ expertise and resources to deliver innovative solutions to customers and retail partners, said Stephen Mckenna, chief technology officer, Musgrave.","cleaned_content":"infosys said on wednesday that it has signed a seven year strategic collaboration with musgrave an irish food retail wholesale and food service company as part of this collaboration infosys will automate musgrave s it operations by utilising ai and cloud offerings through infosys topaz an ai first set of services solutions and platforms and infosys cobalt a set of services solutions and platforms for enterprises to accelerate their cloud journey deal financials were not disclosed these infosys offerings will enable musgrave to transform its it operations build technical expertise and help accelerate towards its goals of enhancing the experiences of its customers and retail partners musgrave will also leverage infosys expertise and resources to deliver innovative solutions to customers and retail partners said stephen mckenna chief technology officer musgrave","timestamp":"2024-01-31T19:29:00+05:30","market_timestamp":"2024-02-01T09:15:00+05:30","off_market_hours":true}