{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-wins-multi-year-deal-from-europ-assistance/articleshow/107429154.cms","title":"TCS wins multi-year deal from Europ Assistance","description":"As the strategic partner, TCS will step up its delivery centers in Europe and across geographies to provide Europ Assistance end-to-end enterprise IT application services. The partnership will also see TCS leveraging its proprietary solution, ignio AIOps from its Digitate suite of offerings to enhance operational resilience and business agility.","content":"Tata Consultancy Services said on Monday that it has won a multi-year deal from Europ Assistance, a global assistance and travel insurance company, to help reimagine its global IT operating model. Deal financials were not disclosed. As the strategic partner, TCS will step up its delivery centers in Europe and across geographies to provide Europ Assistance end-to-end enterprise IT application services.The partnership will also see TCS leveraging its proprietary solution, ignio AIOps from its Digitate suite of offerings to enhance operational resilience and business agility. The solution will provide Europ Assistance with actionable insights into its technology stack, improving productivity and availability. The partnership will help Europ Assistance scale its business capabilities, support its expanding partnership ecosystem, and enhance its speed to market.In addition, the partnership will focus on co-innovation, with TCS and Europ Assistance working together on novel use cases leveraging generative AI and other advanced technologies.“We are very happy to partner with TCS in what we see as a very exciting period in our organization's evolution,” said Fabien Azavant, group chief information officer and member f group management committee, Europ Assistance. ","cleaned_content":"tata consultancy services said on monday that it has won a multi year deal from europ assistance a global assistance and travel insurance company to help reimagine its global it operating model deal financials were not disclosed as the strategic partner tcs will step up its delivery centers in europe and across geographies to provide europ assistance end to end enterprise it application services the partnership will also see tcs leveraging its proprietary solution ignio aiops from its digitate suite of offerings to enhance operational resilience and business agility the solution will provide europ assistance with actionable insights into its technology stack improving productivity and availability the partnership will help europ assistance scale its business capabilities support its expanding partnership ecosystem and enhance its speed to market in addition the partnership will focus on co innovation with tcs and europ assistance working together on novel use cases leveraging generative ai and other advanced technologies we are very happy to partner with tcs in what we see as a very exciting period in our organizations evolution said fabien azavant group chief information officer and member f group management committee europ assistance","timestamp":"2024-02-05T16:45:00+05:30","market_timestamp":"2024-02-06T09:15:00+05:30","off_market_hours":true}