{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-platform-ninjaone-valued-at-nearly-2-billion-after-latest-funding-round/articleshow/107462754.cms","title":"IT platform NinjaOne valued at nearly $2 billion after latest funding round","description":"Texas-based NinjaOne operates in more than 80 countries and counts chipmaker Nvidia, the State of California and University of Oxford among its customers.","content":"NinjaOne raised fresh capital in a Series C funding round that valued the IT platform at about $1.9 billion, the company said on Tuesday. Texas-based NinjaOne operates in more than 80 countries and counts chipmaker Nvidia, the State of California and University of Oxford among its customers. The company, which automates IT processes, plans to use the proceeds to improve customer support and for scaling up the business. The latest funding round that raised $231.5 million was led by new investor ICONIQ Growth and also drew investments from data cloud company Snowflake CEO Frank Slootman, among others. The funding marks a rare bright spot for the start-up investment market in the United States, which has seen subdued activity despite the frenzy around artificial intelligence.","cleaned_content":"ninjaone raised fresh capital in a series c funding round that valued the it platform at about \u003cONE_\u003e billion the company said on tuesday texas based ninjaone operates in more than \u003cEIGHT_TEN\u003e countries and counts chipmaker nvidia the state of california and university of oxford among its customers the company which automates it processes plans to use the proceeds to improve customer support and for scaling up the business the latest funding round that raised \u003cTWO_HUNDRED\u003e million was led by new investor iconiq growth and also drew investments from data cloud company snowflake ceo frank slootman among others the funding marks a rare bright spot for the start up investment market in the united states which has seen subdued activity despite the frenzy around artificial intelligence","timestamp":"2024-02-06T18:03:00+05:30","market_timestamp":"2024-02-07T09:15:00+05:30","off_market_hours":true}