{"url":"https://economictimes.indiatimes.com/tech/information-tech/semiconductor-laboratory-revamp-tata-texas-tower-among-nine-bidders/articleshow/107270493.cms","title":"Semiconductor Laboratory revamp: Tata, Tower among nine bidders","description":"The state-owned Semiconductor Laboratory in Mohali is the only chip manufacturing unit in India that produces semiconductors for strategic and defence purposes, including for space exploration such as the Chandrayaan mission. However, the facility that was founded in 1976, has lagged behind private companies in terms of production as well as technology over the years.","content":"The government has received nine bids, from companies including the Tata Group and Tower Semiconductor, for the overhaul of its Semiconductor Laboratory (SCL) in Mohali, said people with knowledge of the development.The government has earmarked about $1 billion for the modernisation of the 48-year-old facility.The state-owned plant is the only chip manufacturing unit in India which produces semiconductors for strategic and defence purposes, including for space exploration such as the Chandrayaan mission. “The need for modernisation of SCL is for a strategic purpose,” a senior government official said, adding that it is keen that a local firm gets the mandate since a lot of the work is of national importance.The Tata Group has been preparing to enter the chip manufacturing segment in India for the past few years.Its chairman N Chandrasekaran said earlier this month that it will set up a chip manufacturing unit at Dholera soon.","cleaned_content":"the government has received nine bids from companies including the tata group and tower semiconductor for the overhaul of its semiconductor laboratory scl in mohali said people with knowledge of the development the government has earmarked about \u003cONE_\u003e billion for the modernisation of the \u003cFOUR_TEN\u003e year old facility the state owned plant is the only chip manufacturing unit in india which produces semiconductors for strategic and defence purposes including for space exploration such as the chandrayaan mission the need for modernisation of scl is for a strategic purpose a senior government official said adding that it is keen that a local firm gets the mandate since a lot of the work is of national importance the tata group has been preparing to enter the chip manufacturing segment in india for the past few years its chairman n chandrasekaran said earlier this month that it will set up a chip manufacturing unit at dholera soon","timestamp":"2024-02-05T21:37:00+05:30","market_timestamp":"2024-02-06T09:15:00+05:30","off_market_hours":true}