{"url":"https://economictimes.indiatimes.com/tech/information-tech/fat-tech-pay-cheques-shedup-to-40-as-slowdown-bites/articleshow/107808704.cms","title":"Fat tech pay cheques shed up to 40% as slowdown bites","description":"Salary offers for IT professionals have dropped 30-40% due to global macroeconomic headwinds and IT sector slowdown. Big tech companies rationalized their workforce, leading to lower pay packets. Early-stage startups are hiring CXOs and senior tech talent at realistic salaries, including variables in the compensation. Michael Page India is helping startups, including an edtech firm, with tech hiring.","content":"Salary offers for India’s information technology professionals have plummeted 30-40%, from about Rs 1 crore per annum they commanded a year ago, owing to the global macroeconomic headwinds and IT sector slowdown, said industry executives.The trend kicked off a few months ago with some of the big tech companies seeking to rationalise their workforce, they said.Venture capitalists, recruitment services and executive search executives told ET that the lower pay packets are becoming the new normal after the Covid-19 pandemic-induced hiring frenzy during 2021-22. Most of the hiring is currently being done by early-stage startups after their series A funding, they said.“These are mostly CXOs and senior tech talent who have been laid off in the last few months and have worked with large technology organisations as well as startups,” said Ratna Gupta, senior partner, ABC Consultants, an executive search and talent advisory firm.In the past year or so, there have been large-scale layoffs by big tech companies such as Microsoft, Google, Amazon and Meta. ","cleaned_content":"salary offers for india s information technology professionals have plummeted \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e from about rs \u003cONE_\u003e crore per annum they commanded a year ago owing to the global macroeconomic headwinds and it sector slowdown said industry executives the trend kicked off a few months ago with some of the big tech companies seeking to rationalise their workforce they said venture capitalists recruitment services and executive search executives told et that the lower pay packets are becoming the new normal after the covid \u003cONE_TEN\u003e pandemic induced hiring frenzy during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e most of the hiring is currently being done by early stage startups after their series a funding they said these are mostly cxos and senior tech talent who have been laid off in the last few months and have worked with large technology organisations as well as startups said ratna gupta senior partner abc consultants an executive search and talent advisory firm in the past year or so there have been large scale layoffs by big tech companies such as microsoft google amazon and meta","timestamp":"2024-02-19T10:01:00+05:30","market_timestamp":"2024-02-19T10:01:00+05:30","off_market_hours":false}