{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-companies-eye-specialised-talent-in-small-drives-to-future-proof-business/articleshow/108245378.cms","title":"IT companies eye specialised talent in small drives to future-proof business","description":"IT majors such as TCS and Infosys are rolling out programmes to hire junior and mid-level talent with a focus on specific technology skills. In addition, some top IT firms are planning to enter the job market in anticipation of a growth pickup in the second half of the next fiscal year that starts in April.","content":"Top-tier IT companies are looking to induct specialists in new technologies through small-scale recruitment drives in a bid to future-proof business.Tata Consultancy Services and Infosys are rolling out programmes to hire junior and mid-level talent with a focus on specific technology skills. Industry experts see this as an effort to get a lead with good talent ahead of their peers.Though they have shunned mass campus recruitments, some top IT firms are planning to enter the job market in anticipation of a growth pickup in the second half of the next fiscal year that starts in April. The early starters will have an advantage with access and cost of top-quality talent, especially in areas such as cybersecurity, artificial intelligence and cloud computing, where there is a huge skill gap currently, staffing firm experts and recruiters said.“These hiring drives, lasting weeks to months, depend on the volume and urgency of positions. This could signify targeted growth in specific sectors or with clients amid an overall demand decline,” said Krishna Vij, business head - IT staffing at Teamlease Digital. “Alternatively, certain tech firms are also on the verge of futureproofing, proactively acquiring talent in anticipation of an eventual market upswing or in the process of securing new orders,” she said.Such drives, however, may not necessarily see the massive hiring akin to the campus recruitments that IT companies have done previously. Last month, ET reported that Indian software exporters are likely to end FY24 with one of the lowest intakes of fresh engineers in over two decades at between 70,000 and 80,000.","cleaned_content":"top tier it companies are looking to induct specialists in new technologies through small scale recruitment drives in a bid to future proof business tata consultancy services and infosys are rolling out programmes to hire junior and mid level talent with a focus on specific technology skills industry experts see this as an effort to get a lead with good talent ahead of their peers though they have shunned mass campus recruitments some top it firms are planning to enter the job market in anticipation of a growth pickup in the second half of the next fiscal year that starts in april the early starters will have an advantage with access and cost of top quality talent especially in areas such as cybersecurity artificial intelligence and cloud computing where there is a huge skill gap currently staffing firm experts and recruiters said these hiring drives lasting weeks to months depend on the volume and urgency of positions this could signify targeted growth in specific sectors or with clients amid an overall demand decline said krishna vij business head it staffing at teamlease digital alternatively certain tech firms are also on the verge of futureproofing proactively acquiring talent in anticipation of an eventual market upswing or in the process of securing new orders she said such drives however may not necessarily see the massive hiring akin to the campus recruitments that it companies have done previously last month et reported that indian software exporters are likely to end fy24 with one of the lowest intakes of fresh engineers in over two decades at between \u003cSEVEN_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e","timestamp":"2024-03-06T06:00:00+05:30","market_timestamp":"2024-03-06T09:15:00+05:30","off_market_hours":true}