{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-services-companies-may-roll-out-8-4-9-salary-hikes-this-year/articleshow/108568156.cms","title":"IT services companies may roll out 8.4-9% salary hikes this year","description":"In 2024, IT majors are expected to give average salary appraisals of 8.4-9%, similar to the 8.5-9.1% average increases recorded in 2023, according to data sourced by ET from Teamlease Digital.","content":"India’s $250 billion information technology (IT) sector is expected to see flat salaries in 2024 underscoring the impact of global headwinds on companies’ operations. Hirings in the sector — considered one of the biggest employers in the country — will also likely stay subdued.This year, IT companies are expected to give average salary appraisals of 8.4-9%, similar to the 8.5-9.1% average increases recorded in 2023, according to data sourced by ET from a top hiring firm.The increments will, however, likely be deferred by most companies to the end of the fiscal first quarter, Munira Loliwala, AVP - strategy and growth, Teamlease Digital, told ET. In normal times, salary hikes tend to happen from April.“The focus in the IT sector now is on stabilising headcount,” she said, noting that the sector will possibly register flat or negative growth in headcount this year as well.The sector saw salary increments rise from 8.8% in 2021 to 9.7% in 2022, before dipping to 8.5-9.1% in 2023, the data showed.","cleaned_content":"india s \u003cTWO_HUNDRED\u003e billion information technology it sector is expected to see flat salaries in \u003cTWO_THOUSAND\u003e underscoring the impact of global headwinds on companies operations hirings in the sector considered one of the biggest employers in the country will also likely stay subdued this year it companies are expected to give average salary appraisals of \u003cEIGHT_\u003e \u003cNINE_PERCENT\u003e similar to the \u003cEIGHT_\u003e \u003cNINE_PERCENT\u003e average increases recorded in \u003cTWO_THOUSAND\u003e according to data sourced by et from a top hiring firm the increments will however likely be deferred by most companies to the end of the fiscal first quarter munira loliwala avp strategy and growth teamlease digital told et in normal times salary hikes tend to happen from april the focus in the it sector now is on stabilising headcount she said noting that the sector will possibly register flat or negative growth in headcount this year as well the sector saw salary increments rise from \u003cEIGHT_PERCENT\u003e in \u003cTWO_THOUSAND\u003e to \u003cNINE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e before dipping to \u003cEIGHT_\u003e \u003cNINE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the data showed","timestamp":"2024-03-18T06:00:00+05:30","market_timestamp":"2024-03-18T09:15:00+05:30","off_market_hours":true}