{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltts-bags-100-million-cyber-security-project-from-maharashtra-government/articleshow/108515601.cms","title":"LTTS bags $100 million cybersecurity project from Maharashtra government","description":"Mid-sized IT firm L\u0026T Technology Services (LTTS) will establish an AI, ML-driven cybersecurity \u0026 digital threat analytics centre for Maharashtra Cyber, a nodal agency for the state's cyber security and investigation, to enhance citizen cyber safety and awareness.","content":"Mid-sized engineering and technology services firm L\u0026T Technology Services (LTTS) on Friday said it has won a $100 million (around Rs 800 crore) cyber security project from the Maharashtra State Cyber Department.Mumbai-headquartered LTTS, a listed subsidiary of Larsen \u0026 Toubro (L\u0026T), said it will establish an AI, ML-driven cybersecurity \u0026 digital threat analytics centre for Maharashtra Cyber, a nodal agency for the state's cyber security and investigation, to enhance citizen cyber safety and awareness.LTTS, in consortium with KPMG Assurance and Consulting Services LLP as a forensics partner, will provide advanced cyber security solutions, LTTS said in a statement.The project entails designing a sophisticated cybersecurity system and establishing a state-of-the-art, fully equipped, cyber security and cybercrime prevention centre to address cybercrime incidents and investigations by leveraging AI and digital forensic tools.\"This first-of-its-kind deal is more than just a business achievement for us. It’s an opportunity to leverage our experience in setting up over 25 command centres and recognising the growing criticality of cybersecurity and the need to invest in advanced digital safeguard platforms and tools. This deal will set the stage for LTTS to scale its offerings for our global clientele,” said Amit Chadha, CEO and managing director, LTTS.","cleaned_content":"mid sized engineering and technology services firm l t technology services ltts on friday said it has won a \u003cONE_HUNDRED\u003e million around rs \u003cEIGHT_HUNDRED\u003e crore cyber security project from the maharashtra state cyber department mumbai headquartered ltts a listed subsidiary of larsen toubro l t said it will establish an ai ml driven cybersecurity digital threat analytics centre for maharashtra cyber a nodal agency for the states cyber security and investigation to enhance citizen cyber safety and awareness ltts in consortium with kpmg assurance and consulting services llp as a forensics partner will provide advanced cyber security solutions ltts said in a statement the project entails designing a sophisticated cybersecurity system and establishing a state of the art fully equipped cyber security and cybercrime prevention centre to address cybercrime incidents and investigations by leveraging ai and digital forensic tools this first of its kind deal is more than just a business achievement for us it s an opportunity to leverage our experience in setting up over \u003cTWO_TEN\u003e command centres and recognising the growing criticality of cybersecurity and the need to invest in advanced digital safeguard platforms and tools this deal will set the stage for ltts to scale its offerings for our global clientele said amit chadha ceo and managing director ltts","timestamp":"2024-03-15T12:25:00+05:30","market_timestamp":"2024-03-15T12:25:00+05:30","off_market_hours":false}