{"url":"https://economictimes.indiatimes.com/tech/information-tech/ibm-bullish-on-new-ahmedabad-kochi-labs-looks-to-double-hiring-this-year/articleshow/108373548.cms","title":"IBM bullish on new Ahmedabad, Kochi labs, looks to double hiring this year","description":"IBM's India network spans five labs, including its Bengaluru HQ and facilities in Pune and Hyderabad. Notably, the recent additions in Kochi and Ahmedabad are fueling advancements in WatsonX, IBM's AI platform.","content":"IBM is planning to expand product development in India beyond the country’s top-tier cities and double hiring largely at its two new labs and client innovation centres in Kochi and Ahmedabad, a senior executive said.“Kochi is the fastest growing lab for us. In two years, we have doubled our capacity there. And these are highly paid jobs … so we are seeing good success both in Ahmedabad and Kochi,” said Dinesh Nirmal, senior vice president (products) at IBM Software.IBM has five labs in India including a central facility in Bengaluru, two smaller facilities in Pune and Hyderabad and the new centres in Kochi and Ahmedabad that are driving a lot of the solutions used on IBM’s flagship artificial intelligence platform Watsonx.Speaking to ET, without giving out specific numbers, the California-based executive said the new hiring will be in thousands. “By the end of this year, we will double the hiring through mostly campuses because that's where we are getting the good talent,” Nirmal said, adding that “we have tie-ups with universities and once they (new recruits) come in, we will also put them through rigorous training”.Also read | IBM chairman endorses India's demand for data localisation of personal data","cleaned_content":"ibm is planning to expand product development in india beyond the country s top tier cities and double hiring largely at its two new labs and client innovation centres in kochi and ahmedabad a senior executive said kochi is the fastest growing lab for us in two years we have doubled our capacity there and these are highly paid jobs so we are seeing good success both in ahmedabad and kochi said dinesh nirmal senior vice president products at ibm software ibm has five labs in india including a central facility in bengaluru two smaller facilities in pune and hyderabad and the new centres in kochi and ahmedabad that are driving a lot of the solutions used on ibm s flagship artificial intelligence platform watsonx speaking to et without giving out specific numbers the california based executive said the new hiring will be in thousands by the end of this year we will double the hiring through mostly campuses because thats where we are getting the good talent nirmal said adding that we have tie ups with universities and once they new recruits come in we will also put them through rigorous training also read ibm chairman endorses indias demand for data localisation of personal data","timestamp":"2024-03-11T09:00:00+05:30","market_timestamp":"2024-03-11T09:15:00+05:30","off_market_hours":true}