{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-signs-multi-million-cloud-transformation-deal-with-denmarks-nuuday/articleshow/108495815.cms","title":"TCS signs multi-million cloud transformation deal with Denmark’s Nuuday","description":"TCS, the IT services arm of the Tata group, will host and manage all IT domain services of Nuuday during the transformation. This cloud transformation will enable faster and easier adoption of next-gen technologies.","content":"IT bellwether Tata Consultancy Services (TCS) has signed a multi-million-dollar deal with Denmark’s digital connectivity and communications provider Nuuday in cloud transformation to build Nuuday’s IT infrastructure and migrate it to the TCS hybrid cloud. The financial details of the deal were not disclosed.“Nuuday’s move to TCS’ Enterprise Cloud Platform, a next-gen hybrid cloud architecture with built-in tools and accelerators, will reduce time to market for new products and services,” said TCS said in a statement.TCS, the IT services arm of the Tata group, will host and manage all IT domain services of Nuuday during the transformation. This cloud transformation will enable faster and easier adoption of next-gen technologies, it added.Mumbai-based TCS, India’s largest software services exporter, will take responsibility for Nuuday’s IT infrastructure to carry out a complex cloud transformation strategy that will reduce time-to-market and enhance experiences for employees and customers for Nuuday.Nuuday delivers connectivity products and digital services to over 4.1 million Danish homes and 1.8 million businesses.","cleaned_content":"it bellwether tata consultancy services tcs has signed a multi million dollar deal with denmark s digital connectivity and communications provider nuuday in cloud transformation to build nuuday s it infrastructure and migrate it to the tcs hybrid cloud the financial details of the deal were not disclosed nuuday s move to tcs enterprise cloud platform a next gen hybrid cloud architecture with built in tools and accelerators will reduce time to market for new products and services said tcs said in a statement tcs the it services arm of the tata group will host and manage all it domain services of nuuday during the transformation this cloud transformation will enable faster and easier adoption of next gen technologies it added mumbai based tcs india s largest software services exporter will take responsibility for nuuday s it infrastructure to carry out a complex cloud transformation strategy that will reduce time to market and enhance experiences for employees and customers for nuuday nuuday delivers connectivity products and digital services to over \u003cFOUR_\u003e million danish homes and \u003cONE_\u003e million businesses","timestamp":"2024-03-14T17:13:00+05:30","market_timestamp":"2024-03-15T09:15:00+05:30","off_market_hours":true}