{"url":"https://economictimes.indiatimes.com/tech/information-tech/innovators-start-up-and-scale-with-sap/articleshow/108300947.cms","title":"Innovators start-up and scale with SAP","description":"In conversation with Sanket Deodhar of SAP India, on how startups considering listing or going public can achieve taxation and geographical regulatory compliance through SAP’s solutions. Deodhar discusses SAP’s unique strategy of incorporating AI, including Gen AI, into its applications and making this technology accessible to its customers. He also outlines SAP India’s blueprint for advancing Digital India.","content":"Today, software giant SAP operates in over 25 industries globally to operate profitably, adapt continuously, and make an impact on the communities in which they exist.Its legacy spans a prolific and powerful 51 years, making meaningful contributions to sectors, legacy institutions, and now new-age startups across fintech, edutech, agritech, Software as a Service (SaaS), and more. As businesses rapidly evolve in a fast-paced environment driven by artificial intelligence (AI) and automation, Sanket Deodhar, Vice President - Digital Natives and Startups, SAP India, highlights the importance of hyper-growth startups considering listing or going public to adopt SAP as a crucial first step towards compliance. Emphasising the significance of early adoption of technology in the context of India's digital transformation, he underscores SAP's philosophy of integrating AI directly into its solutions to facilitate seamless adoption. Read on to learn about SAP India's initiatives in empowering startups, fueling growth, ensuring operational efficiency, and aiding in product development.EconomicTimes.com: A 2023 SAP India-Zinnov digital study said that 37% of startups plan to increase their spending on enterprise applications by more than 15% in 2023. Given this context, could you map how SAP has been actively contributing to the growth of startups that are aiming to leverage enterprise tech to scale up? What is the role of data and analytics in powering this journey?Sanket Deodhar: From an SAP India standpoint, our association with startups has been both fruitful and humbling. Over the last four years, we’ve recognized the huge potential the start-up world offers, especially in a country like India, which has the world’s 3rd largest start-up ecosystem.When we initiate discussions with startups, many of them face similar challenges. To begin with, most startups today require adequate tech infrastructure to help them diversify business, scale up operations and acquisition and retention of the right talent. In fact, as per the study, we found that 81% of the start-ups reported customer sentiment as one of the biggest business concerns.Another important challenge revolves around compliance and financial transparency and adherence to the law of the land. Another challenge lies in balancing customer acquisition costs with sustainable, profitable growth during their hyper-growth phase. ","cleaned_content":"today software giant sap operates in over \u003cTWO_TEN\u003e industries globally to operate profitably adapt continuously and make an impact on the communities in which they exist its legacy spans a prolific and powerful \u003cFIVE_TEN\u003e years making meaningful contributions to sectors legacy institutions and now new age startups across fintech edutech agritech software as a service saas and more as businesses rapidly evolve in a fast paced environment driven by artificial intelligence ai and automation sanket deodhar vice president digital natives and startups sap india highlights the importance of hyper growth startups considering listing or going public to adopt sap as a crucial first step towards compliance emphasising the significance of early adoption of technology in the context of indias digital transformation he underscores saps philosophy of integrating ai directly into its solutions to facilitate seamless adoption read on to learn about sap indias initiatives in empowering startups fueling growth ensuring operational efficiency and aiding in product development economictimes com a \u003cTWO_THOUSAND\u003e sap india zinnov digital study said that \u003cTHREE_TEN_PERCENT\u003e of startups plan to increase their spending on enterprise applications by more than \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e given this context could you map how sap has been actively contributing to the growth of startups that are aiming to leverage enterprise tech to scale up what is the role of data and analytics in powering this journey sanket deodhar from an sap india standpoint our association with startups has been both fruitful and humbling over the last four years we ve recognized the huge potential the start up world offers especially in a country like india which has the world s \u003cTHREE_\u003e rd largest start up ecosystem when we initiate discussions with startups many of them face similar challenges to begin with most startups today require adequate tech infrastructure to help them diversify business scale up operations and acquisition and retention of the right talent in fact as per the study we found that \u003cEIGHT_TEN_PERCENT\u003e of the start ups reported customer sentiment as one of the biggest business concerns another important challenge revolves around compliance and financial transparency and adherence to the law of the land another challenge lies in balancing customer acquisition costs with sustainable profitable growth during their hyper growth phase","timestamp":"2024-03-11T11:45:00+05:30","market_timestamp":"2024-03-11T11:45:00+05:30","off_market_hours":false}