{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-to-merge-two-us-based-subsidiaries/articleshow/108747567.cms","title":"Tech Mahindra to merge two US-based subsidiaries","description":"Tech Mahindra to merge Born Group and Tech Mahindra (Americas) for efficiency and risk reduction. Pending approvals. Effective April 1, 2024, no cash or new shares. Synergy in operations, USD 55.08M and USD 1,201.37M turnovers.","content":"IT services and consultation company Tech Mahindra said it plans to merge its two wholly-owned subsidiaries, Born Group and Tech Mahindra (Americas), to synergise business operations, optimise operational cost, and reduce compliance risks. The merger is subject to regulatory approvals in the country of incorporation. According to a regulatory filing, the appointed date of the plan of merger is April 1, 2024. \"A Plan of Merger of Born Group, Inc., a wholly-owned step-down subsidiary of the Company with its parent company viz. Tech Mahindra (Americas) Inc., a wholly-owned material subsidiary of the Company, has been approved by the respective companies on Friday, 22nd March 2024,\" the company said. While BORN specializes in providing Brand strategy, visual design, brand identity exploration, and more for digital products, mobile apps, and physical products in the US, TMA provides computer consulting, programming support services and IT Management \u0026 Consulting Services. Tech Mahindra (Americas) (TMA) is a wholly owned material subsidiary of the company. BORN is a wholly owned subsidiary of TMA and a step-down wholly owned subsidiary of the company. According to the filing, the turnover of BORN and TMA for the financial year ended 31st March 2023 is USD 55.08 million and USD 1,201.37 million respectively. ","cleaned_content":"it services and consultation company tech mahindra said it plans to merge its two wholly owned subsidiaries born group and tech mahindra americas to synergise business operations optimise operational cost and reduce compliance risks the merger is subject to regulatory approvals in the country of incorporation according to a regulatory filing the appointed date of the plan of merger is april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e a plan of merger of born group inc a wholly owned step down subsidiary of the company with its parent company viz tech mahindra americas inc a wholly owned material subsidiary of the company has been approved by the respective companies on friday \u003cTWO_TEN\u003e nd march \u003cTWO_THOUSAND\u003e the company said while born specializes in providing brand strategy visual design brand identity exploration and more for digital products mobile apps and physical products in the us tma provides computer consulting programming support services and it management consulting services tech mahindra americas tma is a wholly owned material subsidiary of the company born is a wholly owned subsidiary of tma and a step down wholly owned subsidiary of the company according to the filing the turnover of born and tma for the financial year ended \u003cTHREE_TEN\u003e st march \u003cTWO_THOUSAND\u003e is usd \u003cFIVE_TEN\u003e million and usd \u003cONE_THOUSAND\u003e million respectively","timestamp":"2024-03-24T14:04:00+05:30","market_timestamp":"2024-03-26T09:15:00+05:30","off_market_hours":true}