{"url":"https://economictimes.indiatimes.com/tech/information-tech/experienced-hunger-for-120-hours-non-stop-while-hitchhiking-in-europe-50-years-ago-infosys-founder-narayana-murthy/articleshow/109012010.cms","title":"Experienced hunger for 120 hours while hitchhiking in Europe 50 years ago: Infosys founder Narayana Murthy","description":"N R Narayana Murthy shared his 120-hour hunger experience while hitchhiking in Europe at a UN event focusing on food security, India's achievements, and Akshaya Patra's innovative strategies for aligning with Sustainable Development Goals.","content":"Infosys Founder N R Narayana Murthy has said he \"experienced hunger\" for 120 hours non-stop when he was hitchhiking in Europe 50 years ago. Murthy, 77, was addressing a special event 'Achievements in Food Security: India's Strides Towards Sustainable Development Goals', hosted by the Permanent Mission of India to the UN on Tuesday at the UN headquarters here.  Commemorating the milestone four billionth meal served by Indian NGO -- The Akshaya Patra Foundation --, the event showcased India's innovative strategies, policies and achievements in food security and nutrition and their alignment with SDGs, particularly the target of zero hunger.  \"Most of you have not experienced hunger. I have,\" Murthy said while addressing an audience of UN diplomats, officials, academia, civil society organisations and members of the Indian diaspora during the event.  He said that 50 years ago, \"I experienced hunger for 120 hours non-stop when I was hitchhiking in Europe and at a place called Nish, a border town between Bulgaria and what was then Yugoslavia and today Serbia,\" Murthy said.  \"Most Indians here and I have received good quality and highly subsidised education from the Indian government. Therefore, as civilised people, we must show gratitude to our nation and help the future generation of these helpless, poor children to get (a) good education,\" he said. ","cleaned_content":"infosys founder n r narayana murthy has said he experienced hunger for \u003cONE_HUNDRED\u003e hours non stop when he was hitchhiking in europe \u003cFIVE_TEN\u003e years ago murthy \u003cSEVEN_TEN\u003e was addressing a special event achievements in food security indias strides towards sustainable development goals hosted by the permanent mission of india to the un on tuesday at the un headquarters here commemorating the milestone four billionth meal served by indian ngo the akshaya patra foundation the event showcased indias innovative strategies policies and achievements in food security and nutrition and their alignment with sdgs particularly the target of zero hunger most of you have not experienced hunger i have murthy said while addressing an audience of un diplomats officials academia civil society organisations and members of the indian diaspora during the event he said that \u003cFIVE_TEN\u003e years ago i experienced hunger for \u003cONE_HUNDRED\u003e hours non stop when i was hitchhiking in europe and at a place called nish a border town between bulgaria and what was then yugoslavia and today serbia murthy said most indians here and i have received good quality and highly subsidised education from the indian government therefore as civilised people we must show gratitude to our nation and help the future generation of these helpless poor children to get a good education he said","timestamp":"2024-04-03T21:09:00+05:30","market_timestamp":"2024-04-04T09:15:00+05:30","off_market_hours":true}