{"url":"https://economictimes.indiatimes.com/tech/information-tech/who-is-srini-pallia-wipros-new-ceo-and-md/articleshow/109092840.cms","title":"Who is Srini Pallia, Wipro's new CEO and MD?","description":"Pallia succeeds Thierry Delaporte, who is stepping down to \"pursue passions outside the workplace\", the company said in a statement.","content":"Wipro on Saturday announced the appointment of Srini Pallia as the next chief executive officer (CEO) of the company effective immediately. Pallia, who was until now the head of the Americas-1 unit of the consulting and services multi-national, has been with Wipro for 32 years.He was preceded by Thierry Delaporte, who left the company on Saturday after four years at the helm.Pallia has worked in multiple roles at Wipro during his ongoing three-decade-and-counting stint at the company. Before being appointed as the Americas-1 CEO, he also served as the president of the company’s consumer business unit and the global head of business application services.Also read | Wipro CEO Thierry Delaporte quits, to be replaced by Americas chief Srini Pallia“Srini is an ideal leader to lead Wipro at this pivotal moment for our company and industry. His client-centric approach, growth mindset, strong execution focus, and his commitment to Wipro's values, make him the perfect fit as we enter the next chapter of growth and profitability,” Wipro chairman Rishad Premji was quoted as saying in a notification to the exchanges.","cleaned_content":"wipro on saturday announced the appointment of srini pallia as the next chief executive officer ceo of the company effective immediately pallia who was until now the head of the americas \u003cONE_\u003e unit of the consulting and services multi national has been with wipro for \u003cTHREE_TEN\u003e years he was preceded by thierry delaporte who left the company on saturday after four years at the helm pallia has worked in multiple roles at wipro during his ongoing three decade and counting stint at the company before being appointed as the americas \u003cONE_\u003e ceo he also served as the president of the company s consumer business unit and the global head of business application services also read wipro ceo thierry delaporte quits to be replaced by americas chief srini pallia srini is an ideal leader to lead wipro at this pivotal moment for our company and industry his client centric approach growth mindset strong execution focus and his commitment to wipros values make him the perfect fit as we enter the next chapter of growth and profitability wipro chairman rishad premji was quoted as saying in a notification to the exchanges","timestamp":"2024-04-06T20:59:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}