{"url":"https://economictimes.indiatimes.com/tech/information-tech/35-revenue-growth-to-diversity-thierry-delaporte-lists-wipro-feats-during-4-year-stint/articleshow/109137542.cms","title":"Former Wipro CEO Thierry Delaporte recaps his four-year stint in email to staff","description":"Justifying his work in an email to employees at Wipro, Thierry Delaporte said that the IT services major is seen as a “transformation partner” by its clients and is set for future growth. This even as Wipro has come under fire in the last few years for underperformance compared to its larger rivals. There has also been multiple senior level exits from the company.","content":"In a four-page email to employees, the outgoing Wipro CEO Thierry Delaporte said that his task — bringing about a deep structural transformation at the fourth largest IT company — has been accomplished and he's handing over the baton to Srini Pallia. During his four-year stint, the firm has seen a 35% revenue growth and a 25% increase in profits, apart from making 12 acquisitions, he highlighted in an email, which has been seen by ET. Over the last few years, Wipro has been criticised for its underperformance compared to larger peers and there has been an exodus of senior leadership from the company.  Justifying his work, Thierry said that Wipro is seen as a “transformation partner” by its clients and is set for future growth. In the past four years, it has also witnessed enrichment in diversity inclusion – the number of women directly reporting to him has shot up from 5% to 35%.\"I'm handing this over to my successor, who will drive excellence on the back of this transformation, and move towards execution all the investments we’ve made,\" he went on to say, adding that Pallia, who was one of his \"strongest leaders in the executive team\" and who knows Wipro better than most others, was the \"natural choice\" for the top job.  \"Together with the leadership team, we initiated an ambitious and radical transformation like no other company in our industry has undertaken in the last two decades. We have made bold changes, and big improvements, since. From defining a new market strategy to resetting the operating model for client centricity and agility; from simplifying processes for faster-decision making to doubling down on delivery and account excellence - Wipro's position today is one of strength, respect and confidence,\" Thierry elaborated in the email.","cleaned_content":"in a four page email to employees the outgoing wipro ceo thierry delaporte said that his task bringing about a deep structural transformation at the fourth largest it company has been accomplished and hes handing over the baton to srini pallia during his four year stint the firm has seen a \u003cTHREE_TEN_PERCENT\u003e revenue growth and a \u003cTWO_TEN_PERCENT\u003e increase in profits apart from making \u003cONE_TEN\u003e acquisitions he highlighted in an email which has been seen by et over the last few years wipro has been criticised for its underperformance compared to larger peers and there has been an exodus of senior leadership from the company justifying his work thierry said that wipro is seen as a transformation partner by its clients and is set for future growth in the past four years it has also witnessed enrichment in diversity inclusion the number of women directly reporting to him has shot up from \u003cFIVE_PERCENT\u003e to \u003cTHREE_TEN_PERCENT\u003e im handing this over to my successor who will drive excellence on the back of this transformation and move towards execution all the investments we ve made he went on to say adding that pallia who was one of his strongest leaders in the executive team and who knows wipro better than most others was the natural choice for the top job together with the leadership team we initiated an ambitious and radical transformation like no other company in our industry has undertaken in the last two decades we have made bold changes and big improvements since from defining a new market strategy to resetting the operating model for client centricity and agility from simplifying processes for faster decision making to doubling down on delivery and account excellence wipros position today is one of strength respect and confidence thierry elaborated in the email","timestamp":"2024-04-08T21:15:00+05:30","market_timestamp":"2024-04-09T09:15:00+05:30","off_market_hours":true}