{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-calls-employees-to-work-from-office-for-in-person-collab-weeks/articleshow/108952779.cms","title":"Infosys calls employees to work from office for In-Person Collab Weeks","description":"Infosys enforces In-Person Collab Weeks for ENG-IoT employees, urging them to work from office for a minimum of 10 days per month. The company aims to enhance collaboration and ideation through Gen AI programs and strategic partnerships.","content":"As part of its work from office mandates, IT services major Infosys is rolling out “In-Person Collab Weeks” for its employees in ENG-IoT (engineering- Internet of Things) projects calling them to be present in their respective campuses in those designated weeks.The Bengaluru-headquartered company will declare a few important weeks in every quarter as In-Person Collab Weeks. “All of us are required to be in office during these weeks,” according to an internal email sent to employees, reviewed by ET.The In-Person Collab week comes in continuation to the guidance on return to office (RTO), the mail further stated while urging employees to embrace the change and plan their work in a hybrid mode. “I urge you all to start working from our office campuses for a minimum of 10 days in a month if not started already,” Gupta’s mail said.As part of its hybrid work policy, in November last year, Infosys employees are required to work a minimum of 10 days in a month or 30 days in a quarter.The company has also urged the employees working away from base locations to plan their return and be present at the base development centres during these weeks. The total number of employees to be part of the In-Person Collab Week could not be immediately ascertained.","cleaned_content":"as part of its work from office mandates it services major infosys is rolling out in person collab weeks for its employees in eng iot engineering internet of things projects calling them to be present in their respective campuses in those designated weeks the bengaluru headquartered company will declare a few important weeks in every quarter as in person collab weeks all of us are required to be in office during these weeks according to an internal email sent to employees reviewed by et the in person collab week comes in continuation to the guidance on return to office rto the mail further stated while urging employees to embrace the change and plan their work in a hybrid mode i urge you all to start working from our office campuses for a minimum of \u003cONE_TEN\u003e days in a month if not started already gupta s mail said as part of its hybrid work policy in november last year infosys employees are required to work a minimum of \u003cONE_TEN\u003e days in a month or \u003cTHREE_TEN\u003e days in a quarter the company has also urged the employees working away from base locations to plan their return and be present at the base development centres during these weeks the total number of employees to be part of the in person collab week could not be immediately ascertained","timestamp":"2024-04-02T06:11:00+05:30","market_timestamp":"2024-04-02T09:15:00+05:30","off_market_hours":true}