{"url":"https://economictimes.indiatimes.com/tech/information-tech/azim-premji-rishad-reappointed-to-wipro-board-for-5-years/articleshow/109442081.cms","title":"Azim Premji, Rishad reappointed to Wipro board for 5 years","description":"IT services company Wipro on Friday reported an 8% year-on-year (YoY) fall in consolidated net profit to Rs 2,835 crore for the quarter ended March 2024. It was Rs 3,074 crore in the last year quarter.","content":"The board of directors of Wipro Limited has reappointed Azim H Premji as non-executive, non-independent director and his son Rishad A Premji as executive chairman for a period of five years with effect from July 31, 2024, subject to the approval of stakeholders.The Premji family members together own 4.43% shares in Wipro, including Premji’s wife Yasmeen (0.05%). The promoter group together holds about 72.9% in the IT firm.Wipro has been underperforming its rivals in the IT sector on several counts for the past few years. This, combined with the exodus of senior management, is likely to have triggered the surprise exit of chief executive Theirry Delaporte earlier this month, 15 months before his tenure was to end. Azim Premji took over Wipro in the late 1960s and went on to build a $11-billion revenue IT services organisation, which now has a presence in 65 countries. He relinquished executive duties in July 2019. Rishad joined the company in 2007 and held various positions; he took up the role of executive chairman in 2019. As Wipro’s chief strategy officer, Rishad conceptualised Wipro Ventures, a $250-million fund, to invest in startups developing technologies that complement Wipro's businesses with next-generation services. He also oversaw investor and government relations for the IT major.","cleaned_content":"the board of directors of wipro limited has reappointed azim h premji as non executive non independent director and his son rishad a premji as executive chairman for a period of five years with effect from july \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e subject to the approval of stakeholders the premji family members together own \u003cFOUR_PERCENT\u003e shares in wipro including premji s wife yasmeen \u003cZERO_PERCENT\u003e the promoter group together holds about \u003cSEVEN_TEN_PERCENT\u003e in the it firm wipro has been underperforming its rivals in the it sector on several counts for the past few years this combined with the exodus of senior management is likely to have triggered the surprise exit of chief executive theirry delaporte earlier this month \u003cONE_TEN\u003e months before his tenure was to end azim premji took over wipro in the late \u003cONE_THOUSAND\u003e s and went on to build a \u003cONE_TEN\u003e billion revenue it services organisation which now has a presence in \u003cSIX_TEN\u003e countries he relinquished executive duties in july \u003cTWO_THOUSAND\u003e rishad joined the company in \u003cTWO_THOUSAND\u003e and held various positions he took up the role of executive chairman in \u003cTWO_THOUSAND\u003e as wipro s chief strategy officer rishad conceptualised wipro ventures a \u003cTWO_HUNDRED\u003e million fund to invest in startups developing technologies that complement wipros businesses with next generation services he also oversaw investor and government relations for the it major","timestamp":"2024-04-19T22:31:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}