{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-q4-net-profit-jumps-30-company-buys-german-tech-firm-for-450-million/articleshow/109412111.cms","title":"Infosys Q4 net profit jumps 30%; company buys German tech firm for €450 million","description":"Revenue guidance for FY25, a key monitorable for investors, remained conspicuously circumspect, although India’s outsourcing bellwether announced its biggest M\u0026A deal in history, committing nearly about half a billion dollars.","content":"Infosys, which has the highest Nifty weighting among locally listed technology companies, Thursday said fourth-quarter net profit climbed 30% on gains in non-core income, beating DStreet estimates. Revenue guidance for FY25, a key monitorable for investors, remained conspicuously circumspect, although India’s outsourcing bellwether announced its biggest M\u0026A deal in history, committing nearly about half a billion dollars.Profit climbed to Rs 7,969 crore in the March quarter, beating ET’s poll of Rs 6,103 crore. Other income buttressed the bottom-line through what turned out to be a tough year for revenue expansion, which hit the lowest pace in a decade. Headcount shrank by about 26,000, again a rarity for India’s technology bellwether.Revenue at Rs 37,923 crore in the fourth quarter declined 2.3% sequentially and was up by merely a percentage point (1.2%) on a year-on-year basis. The company’s operating margin came at 20.1%, a decline of 40 bps (1.9%) sequentially and decline of 90 bps (4.2%) y–o-y.","cleaned_content":"infosys which has the highest nifty weighting among locally listed technology companies thursday said fourth quarter net profit climbed \u003cTHREE_TEN_PERCENT\u003e on gains in non core income beating dstreet estimates revenue guidance for fy25 a key monitorable for investors remained conspicuously circumspect although india s outsourcing bellwether announced its biggest m a deal in history committing nearly about half a billion dollars profit climbed to rs \u003cSEVEN_THOUSAND\u003e crore in the march quarter beating et s poll of rs \u003cSIX_THOUSAND\u003e crore other income buttressed the bottom line through what turned out to be a tough year for revenue expansion which hit the lowest pace in a decade headcount shrank by about \u003cTWO_TEN_THOUSAND\u003e again a rarity for india s technology bellwether revenue at rs \u003cTHREE_TEN_THOUSAND\u003e crore in the fourth quarter declined \u003cTWO_PERCENT\u003e sequentially and was up by merely a percentage point \u003cONE_PERCENT\u003e on a year on year basis the company s operating margin came at \u003cTWO_TEN_PERCENT\u003e a decline of \u003cFOUR_TEN\u003e bps \u003cONE_PERCENT\u003e sequentially and decline of \u003cNINE_TEN\u003e bps \u003cFOUR_PERCENT\u003e y o y","timestamp":"2024-04-19T06:00:00+05:30","market_timestamp":"2024-04-19T09:15:00+05:30","off_market_hours":true}