{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-q4-profit-falls-1-2-revenue-edges-up/articleshow/109569564.cms","title":"LTIMindtree Q4 profit falls 1.2%, revenue edges up","description":"IT services company LTIMindtree reported a consolidated net profit of Rs 1,100 crore for the March quarter, down 1% year-on-year (YoY). The profit was less than the Street estimate of Rs 1,150 crore.","content":"India's sixth-largest IT services firm LTIMindtree on Wednesday reported a 1.2% year-on-year (YoY) decline in net profit at Rs 1,100 crore for the March quarter of the financial year 2024 missing street estimate of Rs 1,150 crore. The profit stood at Rs 1,114 crore a year ago.Sequentially, the Mumbai-headquartered company's net profit fell by 5.9% from Rs 1,169 crore.During the quarter, its consolidated revenue came in at Rs 8,892.9 crore, up 2.3% YoY from Rs 8,691 crore in the year-ago quarter. Revenue dipped 1.4% QoQ from Rs 9,016 crore in Q3FY23.“This quarter was a one off, we will return to growth in Q1 (FY25)… we still see the level of caution that we have seen. The macro is playing very heavily as far as FY25 is concerned… though the market is still cautionary, our execution will be better in FY25,” said Debashis Chatterjee, chief executive officer and managing director of LTIMindtree in a post results conference call.Full year","cleaned_content":"indias sixth largest it services firm ltimindtree on wednesday reported a \u003cONE_PERCENT\u003e year on year yoy decline in net profit at rs \u003cONE_THOUSAND\u003e crore for the march quarter of the financial year \u003cTWO_THOUSAND\u003e missing street estimate of rs \u003cONE_THOUSAND\u003e crore the profit stood at rs \u003cONE_THOUSAND\u003e crore a year ago sequentially the mumbai headquartered companys net profit fell by \u003cFIVE_PERCENT\u003e from rs \u003cONE_THOUSAND\u003e crore during the quarter its consolidated revenue came in at rs \u003cEIGHT_THOUSAND\u003e crore up \u003cTWO_PERCENT\u003e yoy from rs \u003cEIGHT_THOUSAND\u003e crore in the year ago quarter revenue dipped \u003cONE_PERCENT\u003e qoq from rs \u003cNINE_THOUSAND\u003e crore in q3fy23 this quarter was a one off we will return to growth in q1 fy25 we still see the level of caution that we have seen the macro is playing very heavily as far as fy25 is concerned though the market is still cautionary our execution will be better in fy25 said debashis chatterjee chief executive officer and managing director of ltimindtree in a post results conference call full year","timestamp":"2024-04-24T20:27:00+05:30","market_timestamp":"2024-04-25T09:15:00+05:30","off_market_hours":true}