{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-elxsis-net-profit-down-4-5-qoq-added-1500-employees-in-fy24/articleshow/109539243.cms","title":"Tata Elxsi’s net profit down 4.5% QoQ; added 1,500 employees in FY24","description":"The engineering service provider also saw its Q4 revenue at Rs. 905.9 crore, down by 0.9% QoQ. This the first time after Q1 of FY21, where the company saw a sequential revenue decline.","content":"Bengaluru-based engineering service provider Tata Elxsi’s net profit declined by 4.5% sequentially at Rs 197 croreore, in the final quarter of FY24. Dragged down by its falling margin that dropped by 100 basis points (bps) on-year and a one-time ramp-down, the tech firm’s net profit was also down by 2.3% on-year. The engineering service provider also saw its Q4 revenue at Rs. 905.9 crore, down by 0.9% QoQ. This the first time after Q1 of FY21, where the company saw a sequential revenue decline. For the full fiscal its revenue grew by 13% on-year at Rs 3,552 croreore. Tata Elxsi said that it was impacted by its media and communication vertical which declined by 4.6% in constant currency terms in Q4 and also saw a one-time ramp-down by a customer.Manoj Raghavan, CEO and MD, Tata Elxsi, said, “Financial year 2024 has been a year of consistent operational performance with a revenue growth of 13% despite global macroreoeconomic uncertainties and volatility in the media and communications industry over the last few quarters. We have done well to maintain industry leading EBITDA margins at 29.5% for the year, even while we continued to invest in expanding our talent base through all four quarters, with a net addition of 1,535 Elxsians through the year.”He added, “We are entering the new financial year with a strong commitment for growth, and continued confidence in our differentiated design-led engineering capabilities. This is backed by strong customer relationships, addition of marquee logos, large deal wins, especially in SDV (Software Development Services), investments in AI and GenAI, and a strong deal pipeline for the year ahead.”While attrition fell by 50 bps to 12.4% in Q4 of FY24 from 12.9% in Q3, the company’s headcount incroreeased by 178 to end the year at 13,399. It said that 25% of its entire talent base to be AI ready by Q3 FY25. It has already partnered with Nvidia, AWS, Microreosoft, Google, Intel, and Brainchip. Tata Elxsi’s AI Lab at Indian Institute of Science (IISc) is also equipped with Nvidia GPU infrastructure for advanced research in AI/ML. ","cleaned_content":"bengaluru based engineering service provider tata elxsi s net profit declined by \u003cFOUR_PERCENT\u003e sequentially at rs \u003cONE_HUNDRED\u003e croreore in the final quarter of fy24 dragged down by its falling margin that dropped by \u003cONE_HUNDRED\u003e basis points bps on year and a one time ramp down the tech firm s net profit was also down by \u003cTWO_PERCENT\u003e on year the engineering service provider also saw its q4 revenue at rs \u003cNINE_HUNDRED\u003e crore down by \u003cZERO_PERCENT\u003e qoq this the first time after q1 of fy21 where the company saw a sequential revenue decline for the full fiscal its revenue grew by \u003cONE_TEN_PERCENT\u003e on year at rs \u003cTHREE_THOUSAND\u003e croreore tata elxsi said that it was impacted by its media and communication vertical which declined by \u003cFOUR_PERCENT\u003e in constant currency terms in q4 and also saw a one time ramp down by a customer manoj raghavan ceo and md tata elxsi said financial year \u003cTWO_THOUSAND\u003e has been a year of consistent operational performance with a revenue growth of \u003cONE_TEN_PERCENT\u003e despite global macroreoeconomic uncertainties and volatility in the media and communications industry over the last few quarters we have done well to maintain industry leading ebitda margins at \u003cTWO_TEN_PERCENT\u003e for the year even while we continued to invest in expanding our talent base through all four quarters with a net addition of \u003cONE_THOUSAND\u003e elxsians through the year he added we are entering the new financial year with a strong commitment for growth and continued confidence in our differentiated design led engineering capabilities this is backed by strong customer relationships addition of marquee logos large deal wins especially in sdv software development services investments in ai and genai and a strong deal pipeline for the year ahead while attrition fell by \u003cFIVE_TEN\u003e bps to \u003cONE_TEN_PERCENT\u003e in q4 of fy24 from \u003cONE_TEN_PERCENT\u003e in q3 the company s headcount incroreeased by \u003cONE_HUNDRED\u003e to end the year at \u003cONE_TEN_THOUSAND\u003e it said that \u003cTWO_TEN_PERCENT\u003e of its entire talent base to be ai ready by q3 fy25 it has already partnered with nvidia aws microreosoft google intel and brainchip tata elxsi s ai lab at indian institute of science iisc is also equipped with nvidia gpu infrastructure for advanced research in ai ml","timestamp":"2024-04-23T21:10:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}