{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-setting-up-four-large-bsnl-data-centres-in-rs-15000-crore-4g-deal/articleshow/109541152.cms","title":"TCS setting up four large BSNL data centres in Rs 15,000 crore 4G deal","description":"Tata's IT arm and C-DOT, a government agency, will deploy India's first locally developed 4G network solution for BSNL across its entire service area. This involves installing equipment at 38 locations.","content":"Tata Consultancy Services is setting up large data centres in the four regions of the country as part of its Rs 15,000-crore deal with state-owned telco Bharat Sanchar Nigam Ltd, COO N GanapathySubramaniam told ET.The Tata Group’s IT services arm, along with the government’s Centre for Development of Telematics (C-DOT), will make 38 deployments, in total, of varying capacities in BSNL premises across all telecom circles of the telco as part of its 4G network deployment, making it the first indigenous network solutions provider.“This is going to be the most complex deployment with two large data centres in each of the four zones—PR (for primary server) and DR (for disaster recovery server),” Subramaniam said. “Beyond this, in each telecom circle, we will deploy 30 data centres depending on load requirements of that circle. So, it's 38 deployments in total and we are working with hardware supply partners to complete the implementation by June.”BSNL did not respond to ET’s query till press time.In May last year, TCS informed the exchanges that it had, along with ITI Ltd, secured an advance purchase order of Rs 19,000 crore from BSNL to set up 100,000 4G sites. Nearly 20% of this order is to be fulfilled by ITI while the remaining larger chunk lies with TCS, ET had reported.","cleaned_content":"tata consultancy services is setting up large data centres in the four regions of the country as part of its rs \u003cONE_TEN_THOUSAND\u003e crore deal with state owned telco bharat sanchar nigam ltd coo n ganapathysubramaniam told et the tata group s it services arm along with the government s centre for development of telematics c dot will make \u003cTHREE_TEN\u003e deployments in total of varying capacities in bsnl premises across all telecom circles of the telco as part of its \u003cFOUR_\u003e g network deployment making it the first indigenous network solutions provider this is going to be the most complex deployment with two large data centres in each of the four zones pr for primary server and dr for disaster recovery server subramaniam said beyond this in each telecom circle we will deploy \u003cTHREE_TEN\u003e data centres depending on load requirements of that circle so its \u003cTHREE_TEN\u003e deployments in total and we are working with hardware supply partners to complete the implementation by june bsnl did not respond to et s query till press time in may last year tcs informed the exchanges that it had along with iti ltd secured an advance purchase order of rs \u003cONE_TEN_THOUSAND\u003e crore from bsnl to set up \u003cONE_HUNDRED_THOUSAND\u003e \u003cFOUR_\u003e g sites nearly \u003cTWO_TEN_PERCENT\u003e of this order is to be fulfilled by iti while the remaining larger chunk lies with tcs et had reported","timestamp":"2024-04-24T06:00:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}