{"url":"https://economictimes.indiatimes.com/tech/information-tech/not-participating-in-india-would-be-a-big-miss-tcs-ceo-k-krithivasan/articleshow/109293774.cms","title":"Not participating in India would be a big miss: TCS CEO K Krithivasan","description":"TCS anticipates growth in India with a recent BSNL deal. CEO Krithivasan focuses on new markets and expresses optimism about future IT industry demand. The company's strategic deal approach and high margins drive continued success amid market challenges.","content":"Tata Consultancy Services (TCS) is excited about opportunities in its home market, buoyed by the `15,000-crore mega deal win from BSNL, which boosted the showing for India’s largest software services exporter in the previous quarter. “We believe India’s expected growth to be 7-8%; (it) has so many opportunities. If you don't participate in India, then you will be missing out in a big way over a period of time,” K Krithivasan, chief executive at TCS, told ET. In contrast, some of its peers have chosen not to focus on India, arguing that it’s a tough market to crack. Krithivasan said the acute downturn in global technology spending since the pandemic, specifically in the US, could ease slightly after this year’s presidential elections — offering a glimmer of hope for India’s $250-billion IT services industry.The US accounts for nearly half of TCS’ revenue and any recovery there augurs well for the Mumbai-headquartered company, which snagged a record $13.2 billion of deals in the previous quarter. A confident-sounding Krithivasan — who will complete a year at the helm of TCS in June — said his agenda now is to bring back growth for the $29- billion company. In addition to India, where TCS’ business grew by over 37% in the fourth quarter of FY24, the company is increasing its focus on new markets such as the Middle East, Africa and Latin America. Demand in these regions acts as a cushion for growth during tough times. ","cleaned_content":"tata consultancy services tcs is excited about opportunities in its home market buoyed by the \u003cONE_TEN_THOUSAND\u003e crore mega deal win from bsnl which boosted the showing for india s largest software services exporter in the previous quarter we believe india s expected growth to be \u003cSEVEN_\u003e \u003cEIGHT_PERCENT\u003e it has so many opportunities if you dont participate in india then you will be missing out in a big way over a period of time k krithivasan chief executive at tcs told et in contrast some of its peers have chosen not to focus on india arguing that it s a tough market to crack krithivasan said the acute downturn in global technology spending since the pandemic specifically in the us could ease slightly after this year s presidential elections offering a glimmer of hope for india s \u003cTWO_HUNDRED\u003e billion it services industry the us accounts for nearly half of tcs revenue and any recovery there augurs well for the mumbai headquartered company which snagged a record \u003cONE_TEN\u003e billion of deals in the previous quarter a confident sounding krithivasan who will complete a year at the helm of tcs in june said his agenda now is to bring back growth for the \u003cTWO_TEN\u003e billion company in addition to india where tcs business grew by over \u003cTHREE_TEN_PERCENT\u003e in the fourth quarter of fy24 the company is increasing its focus on new markets such as the middle east africa and latin america demand in these regions acts as a cushion for growth during tough times","timestamp":"2024-04-15T06:01:00+05:30","market_timestamp":"2024-04-15T09:15:00+05:30","off_market_hours":true}