{"url":"https://economictimes.indiatimes.com/tech/information-tech/nagarro-hits-1-billion-revenue-mark-in-fy23/articleshow/109336256.cms","title":"Nagarro hits $1 billion revenue mark in FY23","description":"Nagarro's revenue hit $1 billion in 2023, targeting $10 billion. Growing beyond Europe and North America, focusing on AI, India, and sector transformations. Major clients include Lufthansa and New York City.","content":"Munich-based digital products engineering company Nagarro crossed the $1 billion revenue mark in financial year 2023 based on year-end currency rates, growing 9.4% year-on-year on a constant currency basis.Revenue increased from about $908 million in 2022. The company follows a January to December financial year.Listed independently on the Frankfurt Stock Exchange in 2020, when its revenue was $516 million at year-end exchange rates, Nagarro has more than doubled its revenue in the past three years, chief executive Manas Human told ET. He said the company’s larger aim now is to reach $10 billion in ten years.“For now, our focus is on moving up and across for the next couple of years,” Human said.The company seeks to move up in terms of value addition to clients, advisory, boardroom conversations and strategic impact beyond building software. It also sees an opportunity for bigger impact across the pond by taking its successes in Europe across industries such as airlines, automobile, life sciences and travel to the US.","cleaned_content":"munich based digital products engineering company nagarro crossed the \u003cONE_\u003e billion revenue mark in financial year \u003cTWO_THOUSAND\u003e based on year end currency rates growing \u003cNINE_PERCENT\u003e year on year on a constant currency basis revenue increased from about \u003cNINE_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e the company follows a january to december financial year listed independently on the frankfurt stock exchange in \u003cTWO_THOUSAND\u003e when its revenue was \u003cFIVE_HUNDRED\u003e million at year end exchange rates nagarro has more than doubled its revenue in the past three years chief executive manas human told et he said the company s larger aim now is to reach \u003cONE_TEN\u003e billion in ten years for now our focus is on moving up and across for the next couple of years human said the company seeks to move up in terms of value addition to clients advisory boardroom conversations and strategic impact beyond building software it also sees an opportunity for bigger impact across the pond by taking its successes in europe across industries such as airlines automobile life sciences and travel to the us","timestamp":"2024-04-16T13:46:00+05:30","market_timestamp":"2024-04-16T13:46:00+05:30","off_market_hours":false}