{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-firms-tcs-accenture-cognizant-lead-linkedins-top-large-companies-list/articleshow/109333555.cms","title":"Tech firms TCS, Accenture, Cognizant lead LinkedIn's top large companies list","description":"LinkedIn's 2024 Top Companies list in India features Tata Consultancy Services, Accenture, Cognizant, and others. Insights include in-demand skills like investor relations, capital markets, and job opportunities in diverse industries across locations like Bengaluru and Hyderabad.","content":"Tata Consultancy Services has topped the LinkedIn's latest list of top companies to work for in India, followed by Accenture and Cognizant in the second and third place respectively. Professional networking platform LinkedIn on Tuesday released the 2024 Top Companies list for India wherein IT companies bagged the top three ranks, while financial services firms dominated the list with 9 out of 25 companies from this sector.  The 8th edition has derived insights from LinkedIn data, and lists the top 25 large companies, 15 best mid-size companies, and provides insights on in-demand skills, top locations, and the largest job functions within these companies.  Amongst large companies (500+ employees in India), Tata Consultancy Services retained its top spot this year, followed by Accenture and Cognizant.  Continuing the trend from last year, financial services dominated the 2024 list with 9 out of 25 companies from this sector including Macquarie Group (4th place), Morgan Stanley (5th), and JPMorgan Chase and Co (6th), LinkedIn said.  Software-as-a-service (SaaS) platform Lentra ranked first on the list of top mid-size companies list (250-500 employees), followed by Indian online travel platform MakeMyTrip. ","cleaned_content":"tata consultancy services has topped the linkedins latest list of top companies to work for in india followed by accenture and cognizant in the second and third place respectively professional networking platform linkedin on tuesday released the \u003cTWO_THOUSAND\u003e top companies list for india wherein it companies bagged the top three ranks while financial services firms dominated the list with \u003cNINE_\u003e out of \u003cTWO_TEN\u003e companies from this sector the \u003cEIGHT_\u003e th edition has derived insights from linkedin data and lists the top \u003cTWO_TEN\u003e large companies \u003cONE_TEN\u003e best mid size companies and provides insights on in demand skills top locations and the largest job functions within these companies amongst large companies \u003cFIVE_HUNDRED\u003e employees in india tata consultancy services retained its top spot this year followed by accenture and cognizant continuing the trend from last year financial services dominated the \u003cTWO_THOUSAND\u003e list with \u003cNINE_\u003e out of \u003cTWO_TEN\u003e companies from this sector including macquarie group \u003cFOUR_\u003e th place morgan stanley \u003cFIVE_\u003e th and jpmorgan chase and co \u003cSIX_\u003e th linkedin said software as a service saas platform lentra ranked first on the list of top mid size companies list \u003cTWO_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e employees followed by indian online travel platform makemytrip","timestamp":"2024-04-16T10:38:00+05:30","market_timestamp":"2024-04-16T10:38:00+05:30","off_market_hours":false}