{"url":"https://economictimes.indiatimes.com/tech/information-tech/salesforce-abandons-pursuit-of-informatica/articleshow/109486751.cms","title":"Salesforce abandons pursuit of Informatica","description":"Salesforce ends Informatica acquisition talks over terms disagreement. Deal could've been significant. Informatica's stock price at $35.19. Salesforce known for strategic acquisitions like Tableau and Slack.","content":"Business software maker Salesforce has backed away from its talks to acquire data-management software firm Informatica after the two companies could not agree on terms, a person familiar with the matter told Reuters on Sunday. The talks between the two companies were at an advanced stage earlier in April, Reuters reported. If the two sides had agreed on a deal, it would've ranked as one of Salesforce's biggest acquisitions.  Salesforce and Informatica did not immediately respond to requests for comment from Reuters. Salesforce had been discussing a price for Informatica in the mid-$30s a share, according to the Wall Street Journal, which reported earlier on Sunday that the talks between the two sides had fizzled. When news of the deal talks first broke on April 12, Informatica's shares were trading at $38.48.  Informatica's shares closed at $35.19 on Friday, valuing the Redwood City, California-based company at about $11.2 billion, including debt.","cleaned_content":"business software maker salesforce has backed away from its talks to acquire data management software firm informatica after the two companies could not agree on terms a person familiar with the matter told reuters on sunday the talks between the two companies were at an advanced stage earlier in april reuters reported if the two sides had agreed on a deal it wouldve ranked as one of salesforces biggest acquisitions salesforce and informatica did not immediately respond to requests for comment from reuters salesforce had been discussing a price for informatica in the mid \u003cTHREE_TEN\u003e s a share according to the wall street journal which reported earlier on sunday that the talks between the two sides had fizzled when news of the deal talks first broke on april \u003cONE_TEN\u003e informaticas shares were trading at \u003cTHREE_TEN\u003e informaticas shares closed at \u003cTHREE_TEN\u003e on friday valuing the redwood city california based company at about \u003cONE_TEN\u003e billion including debt","timestamp":"2024-04-22T08:37:00+05:30","market_timestamp":"2024-04-22T09:15:00+05:30","off_market_hours":true}