{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltts-net-profit-grew-0-2-to-rs-341-crore/articleshow/109597232.cms","title":"LTTS’ net profit grew 0.2% to Rs 341 crore","description":"The muted growth in profit comes on the back of the company seeing a marginal decline in its operating margin which fell from 17.2% in Q3 to 16.9% in Q4, a fall of 30 basis points (1.7%). A year ago, the company’s operating margin was at 17.9%.","content":"L\u0026T Technology Services (LTTS) reported a net profit of Rs 341 crore in the March quarter of FY24, up 1.4% quarter on quarter (QoQ). The profit for the company grew by just 0.2% on-year.The muted growth in profit comes on the back of the company seeing a marginal decline in its operating margin which fell from 17.2% in Q3 to 16.9% in Q4, a fall of 30 basis points (1.7%). A year ago, the company’s operating margin was at 17.9%.The revenue for the Vadodara-based company in Q4 stood at Rs 2,537 crore, up 5% sequentially. In December quarter, the engineering service provider posted a revenue of Rs 2,422 crore.During the quarter, LTTS signed one $100 million, one $30 million and two deals each of $20 million and $10 million. Amit Chadha, CEO and MD, LTTS, said, “With a strong 5.1% sequential growth in Q4, our revenue run-rate has now crossed the $1.2Bn run-rate, a year after we moved past the $1Bn mark. We won a landmark $100 million deal in cybersecurity where we will architect and operate a sophisticated cyber intelligence centre by leveraging AI and Digital Forensic solutions.”He added, “We are now embarking on the next stage of growth with a ‘Go Deeper to Scale’ strategy under which we will streamline our organization into 3 segments – Mobility, Sustainability and HiTech. This cohesive structure will enhance our agility and domain specialization to unlock higher value for customers and employees.”","cleaned_content":"l t technology services ltts reported a net profit of rs \u003cTHREE_HUNDRED\u003e crore in the march quarter of fy24 up \u003cONE_PERCENT\u003e quarter on quarter qoq the profit for the company grew by just \u003cZERO_PERCENT\u003e on year the muted growth in profit comes on the back of the company seeing a marginal decline in its operating margin which fell from \u003cONE_TEN_PERCENT\u003e in q3 to \u003cONE_TEN_PERCENT\u003e in q4 a fall of \u003cTHREE_TEN\u003e basis points \u003cONE_PERCENT\u003e a year ago the company s operating margin was at \u003cONE_TEN_PERCENT\u003e the revenue for the vadodara based company in q4 stood at rs \u003cTWO_THOUSAND\u003e crore up \u003cFIVE_PERCENT\u003e sequentially in december quarter the engineering service provider posted a revenue of rs \u003cTWO_THOUSAND\u003e crore during the quarter ltts signed one \u003cONE_HUNDRED\u003e million one \u003cTHREE_TEN\u003e million and two deals each of \u003cTWO_TEN\u003e million and \u003cONE_TEN\u003e million amit chadha ceo and md ltts said with a strong \u003cFIVE_PERCENT\u003e sequential growth in q4 our revenue run rate has now crossed the \u003cONE_\u003e bn run rate a year after we moved past the \u003cONE_\u003e bn mark we won a landmark \u003cONE_HUNDRED\u003e million deal in cybersecurity where we will architect and operate a sophisticated cyber intelligence centre by leveraging ai and digital forensic solutions he added we are now embarking on the next stage of growth with a go deeper to scale strategy under which we will streamline our organization into \u003cTHREE_\u003e segments mobility sustainability and hitech this cohesive structure will enhance our agility and domain specialization to unlock higher value for customers and employees","timestamp":"2024-04-25T17:57:00+05:30","market_timestamp":"2024-04-26T09:15:00+05:30","off_market_hours":true}