{"url":"https://economictimes.indiatimes.com/tech/information-tech/cyients-profit-grew-22-to-rs-196-crore-in-q4/articleshow/109601670.cms","title":"Cyient’s profit grew 22% to Rs 196 crore in Q4","description":"Riding on deal wins in the fourth quarter from Airbus and Deutsche Aircraft, the ER\u0026D (engineering and research and development) firm saw its Q4 revenue growing by 2.1% to Rs 1,860 crore. On a YoY basis, the Q4 revenue grew by 6.2%.","content":"Engineering service provider, Cyient’s net profit grew to Rs 196 crore in the final quarter of FY24, up by 22% sequentially. On a year-on-year basis, the profit for the Hyderabad-based firm grew by 20%.Riding on deal wins in the fourth quarter from Airbus and Deutsche Aircraft, the ER\u0026D (engineering and research and development) firm saw its Q4 revenue growing by 2.1% to Rs 1,860 crore. On a YoY basis, the Q4 revenue grew by 6.2%.The DET (Digital, Engineering and Technology) segment of the company degrew by 0.1% sequentially to Rs 1,489 crores. The company's digital, engineering and technology segment accounted for 80% of its overall revenue. It maintained its operating margin similar to what was in Q3 at 16%.DET segment saw its attrition declining to 17.1% in Q4 from 18.4% in Q3. The segment’s headcount saw a slight dip by 217 to end at 15,461 at the end of the fiscal 24.Krishna Bodanapu, executive vice chairman and MD, Cyient, said, “This year has been a very exciting and a momentous one for the Cyient Group in terms of delivering a balanced performance around growth and profitability, executing key initiatives such as DLM divestiture and margin expansion, and building a balanced portfolio of offerings to drive sustainable future growth.”","cleaned_content":"engineering service provider cyient s net profit grew to rs \u003cONE_HUNDRED\u003e crore in the final quarter of fy24 up by \u003cTWO_TEN_PERCENT\u003e sequentially on a year on year basis the profit for the hyderabad based firm grew by \u003cTWO_TEN_PERCENT\u003e riding on deal wins in the fourth quarter from airbus and deutsche aircraft the er d engineering and research and development firm saw its q4 revenue growing by \u003cTWO_PERCENT\u003e to rs \u003cONE_THOUSAND\u003e crore on a yoy basis the q4 revenue grew by \u003cSIX_PERCENT\u003e the det digital engineering and technology segment of the company degrew by \u003cZERO_PERCENT\u003e sequentially to rs \u003cONE_THOUSAND\u003e crores the companys digital engineering and technology segment accounted for \u003cEIGHT_TEN_PERCENT\u003e of its overall revenue it maintained its operating margin similar to what was in q3 at \u003cONE_TEN_PERCENT\u003e det segment saw its attrition declining to \u003cONE_TEN_PERCENT\u003e in q4 from \u003cONE_TEN_PERCENT\u003e in q3 the segment s headcount saw a slight dip by \u003cTWO_HUNDRED\u003e to end at \u003cONE_TEN_THOUSAND\u003e at the end of the fiscal \u003cTWO_TEN\u003e krishna bodanapu executive vice chairman and md cyient said this year has been a very exciting and a momentous one for the cyient group in terms of delivering a balanced performance around growth and profitability executing key initiatives such as dlm divestiture and margin expansion and building a balanced portfolio of offerings to drive sustainable future growth","timestamp":"2024-04-25T22:32:00+05:30","market_timestamp":"2024-04-26T09:15:00+05:30","off_market_hours":true}