{"url":"https://economictimes.indiatimes.com/tech/information-tech/a-gruelling-it-marathon-fy24-was-a-turbulent-year-for-the-indian-it-sector-what-lies-in-store-for-the-next-12-months/articleshow/109652494.cms","title":"A gruelling IT marathon: FY24 was a turbulent year for the Indian IT sector. What lies in store for the next 12 months?","description":"In the past two weeks of the final quarter and full fiscal 2024 earnings announcements, most IT majors failed to meet their revenue growth guidance. Many downward revisions for the year ahead were seen despite most firms bagging large deals and sitting on an arsenal of historic total contract value (TCV) wins.","content":"Over the past two years, growth has been a rather precious commodity for India’s $254-billion technology outsourcing industry — the country’s most globalised business and the largest export earner. As interest rates rose in the US, and Europe faced geopolitical uncertainty, business growth in the main revenuegenerating markets for Indian IT seemed elusive.And the start to FY25 hasn’t deviated much from the script, barring only pockets of resilience demonstrated by some of the biggest players, including Tata Consultancy Services (TCS). Mat ters have been fu r t her complicated as the onslaught of generative artificial intelligence (gen AI) further clouds the revenue picture for an industry initially modelled after cost arbitrage in solutions delivery.In the past two weeks of the final quarter and full fiscal 2024 earnings announcements, most IT majors failed to meet their revenue growth guidance. Many downward revisions for the year ahead were seen despite most firms bagging large deals and sitting on an arsenal of historic total contract value (TCV) wins.In this uncertain environment, while companies are seeing green shoots and signs of bottoming out, g uidance and forecast remain hazy and growth is at best anyone’s guess.Analysts and other industry experts see more deal wins to continue with a focus on execution, yet revenues seem to be muted as digital transformation continues to remain a key focus area of large global businesses.","cleaned_content":"over the past two years growth has been a rather precious commodity for india s \u003cTWO_HUNDRED\u003e billion technology outsourcing industry the country s most globalised business and the largest export earner as interest rates rose in the us and europe faced geopolitical uncertainty business growth in the main revenuegenerating markets for indian it seemed elusive and the start to fy25 hasn t deviated much from the script barring only pockets of resilience demonstrated by some of the biggest players including tata consultancy services tcs mat ters have been fu r t her complicated as the onslaught of generative artificial intelligence gen ai further clouds the revenue picture for an industry initially modelled after cost arbitrage in solutions delivery in the past two weeks of the final quarter and full fiscal \u003cTWO_THOUSAND\u003e earnings announcements most it majors failed to meet their revenue growth guidance many downward revisions for the year ahead were seen despite most firms bagging large deals and sitting on an arsenal of historic total contract value tcv wins in this uncertain environment while companies are seeing green shoots and signs of bottoming out g uidance and forecast remain hazy and growth is at best anyone s guess analysts and other industry experts see more deal wins to continue with a focus on execution yet revenues seem to be muted as digital transformation continues to remain a key focus area of large global businesses","timestamp":"2024-04-28T06:00:00+05:30","market_timestamp":"2024-04-29T09:15:00+05:30","off_market_hours":true}