{"url":"https://economictimes.indiatimes.com/tech/information-tech/top-it-companies-cut-over-72000-jobs-in-fy24/articleshow/109653893.cms","title":"Top IT companies cut over 72,000 jobs in FY24","description":"The top six information technology services companies in India reported a reduction in their total headcount in the last fiscal year, with only HCLTech adding employees. Factors contributing to this reduction include the economic slowdown, automation, restructuring, and decreased discretionary spending. The drop in headcount reflects the aftermath of excessive hiring during the Covid boom and ongoing industry contraction in demand. However, experts believe that this trend may have bottomed out, and companies could resume hiring, given the strong deal wins announced by most of them, which could push a gradual pickup in growth.","content":"Once known for hiring hundreds of thousands every year, five of India’s top six information technology services companies reported a reduction of 73,600 in their total headcount in the last fiscal yearHCLTech, the third largest, was the only exception among the top six, as it added 1,537 employees in the year ended March 31, even as Tata Consultancy Services, Infosys, Wipro, Tech Mahindra and LTIMindtree reported a fall in their headcount. After accounting for the addition at HCLTech, the workforce of the top six firms fell by 72,063 . A global slowdown in tech spending and uncertainty in the demand environment had hit India’s $254 billion IT services industry in FY24, leading to muted business growth and forcing companies to cut jobs and reduce hiring. In comparison, the top six IT companies had added more than 86,500 employees in FY23, driven by strong demand for their services immediately after the pandemic.   ","cleaned_content":"once known for hiring hundreds of thousands every year five of india s top six information technology services companies reported a reduction of \u003cSEVEN_TEN_THOUSAND\u003e in their total headcount in the last fiscal yearhcltech the third largest was the only exception among the top six as it added \u003cONE_THOUSAND\u003e employees in the year ended march \u003cTHREE_TEN\u003e even as tata consultancy services infosys wipro tech mahindra and ltimindtree reported a fall in their headcount after accounting for the addition at hcltech the workforce of the top six firms fell by \u003cSEVEN_TEN_THOUSAND\u003e a global slowdown in tech spending and uncertainty in the demand environment had hit india s \u003cTWO_HUNDRED\u003e billion it services industry in fy24 leading to muted business growth and forcing companies to cut jobs and reduce hiring in comparison the top six it companies had added more than \u003cEIGHT_TEN_THOUSAND\u003e employees in fy23 driven by strong demand for their services immediately after the pandemic","timestamp":"2024-04-28T06:00:00+05:30","market_timestamp":"2024-04-29T09:15:00+05:30","off_market_hours":true}