{"url":"https://economictimes.indiatimes.com/tech/information-tech/midcap-it-companies-buck-the-trend-to-add-more-employees/articleshow/109792418.cms","title":"Midcap IT companies buck the trend to add more employees","description":"Mid-sized IT firms showed workforce growth in fiscal 2024, contrasting major Indian IT firms' decline. Demand rose for tech services from domestic and global sectors. Automation may impact headcount. Mid-tier firms excel in engineering services with strong growth.","content":"A few mid-sized information technology providers registered a net increase in workforce in fiscal 2024 offering a sharp contrast to the steep decline in headcount at India’s top tier IT firms in a year marked by tapering demand for technology services due to macroeconomic and geopolitical uncertainty.At least six mid-sized IT firms, including the likes of L\u0026T Technology Services (LTTS) and Birlasoft, posted net additions of nearly 7,000 employees for the full year ending March 2024.“The primary driver for the positive headcount movement of the mid-tier firms is what we call \"the pond they fish in,” said Deepti S, business head for tech staff augmentation at recruitment firm Xpheno.Despite the slowdown last year, calendar year 2024 opened with a notable uptick in tech and engineering services, research, and development (ER\u0026D) demand from domestic businesses and global capability centres (GCCs). This prompted mid-tier firms to continue hiring cautiously with a focus on utilisation and margins, according to recruitment experts.","cleaned_content":"a few mid sized information technology providers registered a net increase in workforce in fiscal \u003cTWO_THOUSAND\u003e offering a sharp contrast to the steep decline in headcount at india s top tier it firms in a year marked by tapering demand for technology services due to macroeconomic and geopolitical uncertainty at least six mid sized it firms including the likes of l t technology services ltts and birlasoft posted net additions of nearly \u003cSEVEN_THOUSAND\u003e employees for the full year ending march \u003cTWO_THOUSAND\u003e the primary driver for the positive headcount movement of the mid tier firms is what we call the pond they fish in said deepti s business head for tech staff augmentation at recruitment firm xpheno despite the slowdown last year calendar year \u003cTWO_THOUSAND\u003e opened with a notable uptick in tech and engineering services research and development er d demand from domestic businesses and global capability centres gccs this prompted mid tier firms to continue hiring cautiously with a focus on utilisation and margins according to recruitment experts","timestamp":"2024-05-03T06:00:00+05:30","market_timestamp":"2024-05-03T09:15:00+05:30","off_market_hours":true}