{"url":"https://economictimes.indiatimes.com/tech/information-tech/who-is-freshworks-new-ceo-dennis-woodside/articleshow/109785137.cms","title":"Who is Freshworks’ new CEO Dennis Woodside?","description":"Dennis Woodside replaces Girish Mathrubootham as Freshworks CEO amid market concerns. Woodside faces the challenge of steering the company in the CRM sector, focusing on small and midsize businesses, following Mathrubootham's exit.","content":"With Freshworks CEO Girish Mathrubootham stepping down on Wednesday following a rejig, the board of the Chennai and San Mateo-based software major handed over the reins to Dennis Woodside.The 55-year-old, who until yesterday was the company’s president, will have his work cut out to steer the customer relationship management software provider at a time of stalling growth in the small and midsize business segment -- its primary revenue generator.Woodside also has big shoes to fill, for founder Mathrubootham’s exit was not received well by the markets. The stock fell nearly 28% to $13.15 a piece following the news at 6:25 AM eastern time on Nasdaq after-markets, a far cry from the $50 in 2021, when it first listed on the bourses.Turnaround specialist?The CEO position is not Woodside’s first rodeo. From 2012 to 2014, he served as chief executive of Motorola Mobility under Google’s ownership, where he quickly made his mark. He recruited a new management team, reset product and go-to-market strategy and re-established growth in the mobile device business, before selling it to Lenovo.Woodside joined Freshworks in September 2022 as president and serves on the board too. The firm has seen a few top-deck changes under his leadership. Last year, Mika Yamamoto was appointed as chief customer and marketing officer, replacing Stacey Epstein, while Johanna Jackman was named chief people officer in place of Suman Gopalan.","cleaned_content":"with freshworks ceo girish mathrubootham stepping down on wednesday following a rejig the board of the chennai and san mateo based software major handed over the reins to dennis woodside the \u003cFIVE_TEN\u003e year old who until yesterday was the company s president will have his work cut out to steer the customer relationship management software provider at a time of stalling growth in the small and midsize business segment its primary revenue generator woodside also has big shoes to fill for founder mathrubootham s exit was not received well by the markets the stock fell nearly \u003cTWO_TEN_PERCENT\u003e to \u003cONE_TEN\u003e a piece following the news at \u003cSIX_\u003e \u003cTWO_TEN\u003e am eastern time on nasdaq after markets a far cry from the \u003cFIVE_TEN\u003e in \u003cTWO_THOUSAND\u003e when it first listed on the bourses turnaround specialist the ceo position is not woodside s first rodeo from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e he served as chief executive of motorola mobility under google s ownership where he quickly made his mark he recruited a new management team reset product and go to market strategy and re established growth in the mobile device business before selling it to lenovo woodside joined freshworks in september \u003cTWO_THOUSAND\u003e as president and serves on the board too the firm has seen a few top deck changes under his leadership last year mika yamamoto was appointed as chief customer and marketing officer replacing stacey epstein while johanna jackman was named chief people officer in place of suman gopalan","timestamp":"2024-05-02T16:10:00+05:30","market_timestamp":"2024-05-03T09:15:00+05:30","off_market_hours":true}