{"url":"https://economictimes.indiatimes.com/tech/information-tech/no-financial-impropriety-found-in-whistleblower-allegations-birlasoft-ceo/articleshow/109736068.cms","title":"No financial impropriety found in whistleblower allegations: Birlasoft CEO","description":"Birlasoft faces whistle-blower complaints alleging financial impropriety, with ongoing investigations. CEO Guha aims to diversify revenue sources, track clients' performance, and mitigate risks due to market uncertainties.","content":"The CK Birla group’s information technology firm, Birlasoft, received two whistle-blower complaints in the last seven months alleging improper conduct of some employees, the company said in its financial statements.Investigation into the complaints is ongoing and till now no instance of financial impropriety has been found, chief executive and managing director Angan Guha said.Guha, in an interaction with ET, said: “Since the investigation is on, I can't talk too much about it. Once the investigation completes, then we can give you an update. But I can only tell you that we have not found any financial impropriety as of now.”The two complaints came one after the other, but they were pretty much the same and against the same set of people, Guha said. The company received the complaints in September 2023 and February 2024, alleging improper conduct of certain employees. The investigation has been ongoing for at least 60 days.Speaking about diversifying the company’s revenue, Guha said it has appointed a new CEO for non-US markets. One of the mandates that has been given to him is bringing at least 25% of the revenue from outside the US. This would happen over the next three years, he said.","cleaned_content":"the ck birla group s information technology firm birlasoft received two whistle blower complaints in the last seven months alleging improper conduct of some employees the company said in its financial statements investigation into the complaints is ongoing and till now no instance of financial impropriety has been found chief executive and managing director angan guha said guha in an interaction with et said since the investigation is on i cant talk too much about it once the investigation completes then we can give you an update but i can only tell you that we have not found any financial impropriety as of now the two complaints came one after the other but they were pretty much the same and against the same set of people guha said the company received the complaints in september \u003cTWO_THOUSAND\u003e and february \u003cTWO_THOUSAND\u003e alleging improper conduct of certain employees the investigation has been ongoing for at least \u003cSIX_TEN\u003e days speaking about diversifying the company s revenue guha said it has appointed a new ceo for non us markets one of the mandates that has been given to him is bringing at least \u003cTWO_TEN_PERCENT\u003e of the revenue from outside the us this would happen over the next three years he said","timestamp":"2024-05-01T06:01:00+05:30","market_timestamp":"2024-05-01T09:15:00+05:30","off_market_hours":true}