{"url":"https://economictimes.indiatimes.com/tech/information-tech/birlasofts-net-profit-grew-11-8-to-rs-180-crore/articleshow/109701707.cms","title":"Birlasoft’s net profit grew 11.8% to Rs 180 crore","description":"Birlasoft's Q4 saw a net profit of Rs 180 crore, 11.8% QoQ growth. Revenue stood at Rs 1,363 crore, up 1.5%. Operating margin ended at 14.7%. The firm recommended a dividend of Rs 4/share.","content":"C K Birla group’s IT firm, Birlasoft reported a net profit of Rs 180 crore in the March quarter of FY24, up 11.8% quarter on quarter (QoQ). The profit for the company grew by a whopping 60.5% on-year.The growth in profit in Q4 comes on the back of surge in non-core income, slight increase in operating margin and a decline in employee expenses. Operating margin jacked up by 33 bps (3.8% QoQ) to end at 14.7% in the final quarter of FY24.The revenue for the Pune-based company in Q4 stood at Rs 1,363 crore, up 1.5% sequentially. In December quarter the IT service provider posted a revenue of Rs 1,343 crore. For the full fiscal 24, the company's revenue came at Rs 5,278 crore, up by 10.1% on-year. The IT company’s board has recommended a final dividend of Rs 4 per share. Angan Guha, CEO and MD, Birlasoft, said, “On a constant currency basis, our revenues have grown 9.1% ex Invacare during FY 24 and revenues during the fourth quarter are up 1.6% sequentially.\" Invacare was the US based client of Birlasoft that filed for bankruptcy last year. ","cleaned_content":"c k birla group s it firm birlasoft reported a net profit of rs \u003cONE_HUNDRED\u003e crore in the march quarter of fy24 up \u003cONE_TEN_PERCENT\u003e quarter on quarter qoq the profit for the company grew by a whopping \u003cSIX_TEN_PERCENT\u003e on year the growth in profit in q4 comes on the back of surge in non core income slight increase in operating margin and a decline in employee expenses operating margin jacked up by \u003cTHREE_TEN\u003e bps \u003cTHREE_PERCENT\u003e qoq to end at \u003cONE_TEN_PERCENT\u003e in the final quarter of fy24 the revenue for the pune based company in q4 stood at rs \u003cONE_THOUSAND\u003e crore up \u003cONE_PERCENT\u003e sequentially in december quarter the it service provider posted a revenue of rs \u003cONE_THOUSAND\u003e crore for the full fiscal \u003cTWO_TEN\u003e the companys revenue came at rs \u003cFIVE_THOUSAND\u003e crore up by \u003cONE_TEN_PERCENT\u003e on year the it company s board has recommended a final dividend of rs \u003cFOUR_\u003e per share angan guha ceo and md birlasoft said on a constant currency basis our revenues have grown \u003cNINE_PERCENT\u003e ex invacare during fy \u003cTWO_TEN\u003e and revenues during the fourth quarter are up \u003cONE_PERCENT\u003e sequentially invacare was the us based client of birlasoft that filed for bankruptcy last year","timestamp":"2024-04-29T23:06:00+05:30","market_timestamp":"2024-04-30T09:15:00+05:30","off_market_hours":true}