{"url":"https://economictimes.indiatimes.com/tech/information-tech/ibm-to-buy-hashicorp-in-6-4-billion-deal-to-expand-in-cloud/articleshow/109582818.cms","title":"IBM to buy HashiCorp in $6.4 billion deal to expand in cloud","description":"IBM's $6.4B acquisition of HashiCorp bolsters its AI presence through cloud expansion, despite Q1 revenue missing estimates. The deal, funded by cash, aligns with IBM's strategic focus on AI and cloud technologies.","content":"International Business Machines will buy HashiCorp in a deal valued at $6.4 billion, the company said on Wednesday, expanding its cloud-based software products to tap into an AI-powered boom in demand. Software has been a bright spot for IBM as its consulting business grapples with more cautious spending by enterprises navigating higher interest rates.  IBM will pay $35 per share for HashiCorp, a 42.6% premium to Monday's closing price. HashiCorp's shares had surged on Tuesday following media reports of the deal talks.  HashiCorp's shares rose more than 4% in extended trading on Wednesday while IBM fell 7% as the company separately reported first-quarter revenue marginally below estimates. Total revenue of $14.46 billion compared with LSEG estimates of $14.55 billion. Consulting segment sales were flat in the quarter.","cleaned_content":"international business machines will buy hashicorp in a deal valued at \u003cSIX_\u003e billion the company said on wednesday expanding its cloud based software products to tap into an ai powered boom in demand software has been a bright spot for ibm as its consulting business grapples with more cautious spending by enterprises navigating higher interest rates ibm will pay \u003cTHREE_TEN\u003e per share for hashicorp a \u003cFOUR_TEN_PERCENT\u003e premium to mondays closing price hashicorps shares had surged on tuesday following media reports of the deal talks hashicorps shares rose more than \u003cFOUR_PERCENT\u003e in extended trading on wednesday while ibm fell \u003cSEVEN_PERCENT\u003e as the company separately reported first quarter revenue marginally below estimates total revenue of \u003cONE_TEN\u003e billion compared with lseg estimates of \u003cONE_TEN\u003e billion consulting segment sales were flat in the quarter","timestamp":"2024-04-25T11:01:00+05:30","market_timestamp":"2024-04-25T11:01:00+05:30","off_market_hours":false}