{"url":"https://economictimes.indiatimes.com/tech/information-tech/financial-services-revenue-could-be-impacted-in-q1-hcltech-ceo-vijayakumar/articleshow/109670067.cms","title":"HCLTech CEO C Vijayakumar sees headwinds affecting Q1 financial services revenue","description":"We have a good mix of programs and rely on broad base growth, says HCLTech CEO Vijayakumar. The firm saw strong growth in its financial services vertical in a difficult environment, said Vijayakumar.","content":"Financial services that led the growth for the third largest Indian IT services firm HCLTech is set to see some revenue impact in the first quarter of FY25, said C Vijayakumar, CEO and MD, HCLTech, in an interaction with ET. Led by a 12.1% YoY growth in the financial services vertical, HCLTech delivered the highest on-year growth in the Indian IT industry at 8.3% in FY24.While being upbeat about HCLTech’s industry leading growth, he also called out headwinds in the current fiscal in the financial services vertical and the slowdown in discretionary spending. Other large India IT services companies have reported a slower growth rate than HCLTech in FY24. Within BFSI, larger rivals TCS and Infosys reported a 3.2% YoY decline in growth for the quarter with a 32% market share while Infosys, with over 26% share, posted a 8.4% YoY degrowth in Q4FY24. Younger peer Wipro's BFSI growth also dipped by 8.9%.The firm saw strong growth in its financial services vertical in a difficult environment, said Vijayakumar. The vertical contributes about 22% of the topline. But he added there would be certain headwinds in the first quarter. “We also had divested the joint venture with State Street. So, that will have some impact on financial services.” These headwinds will moderate in the later quarters, he said.Global financial institution State Street Corporation last year announced that it would acquire HCL’s 49% equity stake held by Investments UK Ltd in their JV State Street HCL Services. The joint venture, established in 2012, provided business operations services. The transaction was completed effective April 1, 2024.","cleaned_content":"financial services that led the growth for the third largest indian it services firm hcltech is set to see some revenue impact in the first quarter of fy25 said c vijayakumar ceo and md hcltech in an interaction with et led by a \u003cONE_TEN_PERCENT\u003e yoy growth in the financial services vertical hcltech delivered the highest on year growth in the indian it industry at \u003cEIGHT_PERCENT\u003e in fy24 while being upbeat about hcltech s industry leading growth he also called out headwinds in the current fiscal in the financial services vertical and the slowdown in discretionary spending other large india it services companies have reported a slower growth rate than hcltech in fy24 within bfsi larger rivals tcs and infosys reported a \u003cTHREE_PERCENT\u003e yoy decline in growth for the quarter with a \u003cTHREE_TEN_PERCENT\u003e market share while infosys with over \u003cTWO_TEN_PERCENT\u003e share posted a \u003cEIGHT_PERCENT\u003e yoy degrowth in q4fy24 younger peer wipros bfsi growth also dipped by \u003cEIGHT_PERCENT\u003e the firm saw strong growth in its financial services vertical in a difficult environment said vijayakumar the vertical contributes about \u003cTWO_TEN_PERCENT\u003e of the topline but he added there would be certain headwinds in the first quarter we also had divested the joint venture with state street so that will have some impact on financial services these headwinds will moderate in the later quarters he said global financial institution state street corporation last year announced that it would acquire hcl s \u003cFOUR_TEN_PERCENT\u003e equity stake held by investments uk ltd in their jv state street hcl services the joint venture established in \u003cTWO_THOUSAND\u003e provided business operations services the transaction was completed effective april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-04-29T06:01:00+05:30","market_timestamp":"2024-04-29T09:15:00+05:30","off_market_hours":true}