{"url":"https://economictimes.indiatimes.com/tech/information-tech/coforges-220-m-cigniti-acquisition-biggest-but-not-disproportionately-bigger-ceo-sudhir-singh/articleshow/109820779.cms","title":"Coforge’s $220-m Cigniti acquisition biggest, but not disproportionately bigger: CEO Sudhir Singh","description":"Coforge's $220 million acquisition of Cigniti under CEO Singh's leadership aims to expand into new verticals, add fortune-500 clients, and strengthen North America market. Past acquisitions and focus on organic growth indicate a strategic approach to growth.","content":"Coforge chief executive Sudhi Singh on Friday said it will shell out $220 million, or about Rs 1,826 crore, to acquire 54% stake in Hyderabad-based Cigniti Technologies even as the Noida-based IT firm launched an open offer to acquire an additional 26% stake in Cigniti.Coforge had on Thursday said it is acquiring 54% share in Cigniti from promoters and other shareholders at Rs 1,415 per share.The acquisition process is expected to be completed by the second quarter of FY25, Singh told ET in an interaction.While this is Coforge’s biggest acquisition yet, Singh said, “Three years back when we were $628 million, we acquired a $73-million asset, which was SLK. Now at $1.17 billion, we are acquiring a $220 million asset. So, it’s slightly bigger, but not disproportionately bigger than what we’ve done in the past.”He said Cigniti will open many new opportunities for Coforge, particularly in North America, and prove to be yet another successful acquisition for the company.","cleaned_content":"coforge chief executive sudhi singh on friday said it will shell out \u003cTWO_HUNDRED\u003e million or about rs \u003cONE_THOUSAND\u003e crore to acquire \u003cFIVE_TEN_PERCENT\u003e stake in hyderabad based cigniti technologies even as the noida based it firm launched an open offer to acquire an additional \u003cTWO_TEN_PERCENT\u003e stake in cigniti coforge had on thursday said it is acquiring \u003cFIVE_TEN_PERCENT\u003e share in cigniti from promoters and other shareholders at rs \u003cONE_THOUSAND\u003e per share the acquisition process is expected to be completed by the second quarter of fy25 singh told et in an interaction while this is coforge s biggest acquisition yet singh said three years back when we were \u003cSIX_HUNDRED\u003e million we acquired a \u003cSEVEN_TEN\u003e million asset which was slk now at \u003cONE_\u003e billion we are acquiring a \u003cTWO_HUNDRED\u003e million asset so it s slightly bigger but not disproportionately bigger than what we ve done in the past he said cigniti will open many new opportunities for coforge particularly in north america and prove to be yet another successful acquisition for the company","timestamp":"2024-05-04T06:00:00+05:30","market_timestamp":"2024-05-06T09:15:00+05:30","off_market_hours":true}