{"url":"https://economictimes.indiatimes.com/tech/information-tech/inflation-wary-fed-may-put-it-revival-on-hold/articleshow/109957952.cms","title":"Inflation-wary Fed may put IT revival on hold","description":"Indian outsourcing leaders face delayed business revival until FY26 due to US Federal Reserve's high interest rates. The impact on revenue growth and IT firms' strategies could persist, affecting deals and revenue projections in the sector.","content":"Indian outsourcing leaders will likely have to wait longer, perhaps until the start of FY26, for a revival in business as the US Federal Reserve could keep interest rates elevated in the world’s largest economy to ensure a lasting victory over politically uncomfortable inflation. High real rates could elevate hurdle rates for companies, potentially crimping growth in discretionary technology spends.“The Fed's hawkish approach is a double-edged sword. Higher interest rates could lead US clients to curtail discretionary IT spending, impacting revenue growth for Indian firms,” said Hansa Iyengar, senior lead analyst for UK-based IT research firm Omdia.Even as FY24 earnings showed subdued revenue growth across Indian IT majors, strong deal wins and expectations of technology services demand coming back had renewed business revival hopes in the second half of fiscal 2025 that ends in March next year. Most IT majors however have continued to be cautiously optimistic given the prolonged uncertainty in the industry.Last week, the US Federal Reserve said the rates will remain ‘high for long’ amid elevated inflation (3.5% in March against target of 2%) dashing the optimism that could have been supported by a rate cut. An interest rate reduction pushes clients to loosen their purse strings and increase tech capital expenditure. Given an election year in the US coupled with ongoing geopolitical uncertainty in the western regions, India’s software exporters may have to bank on the next fiscal year for return of growth.Global IT giant Cognizant CEO Ravi Kumar S sees the times for IT companies as an “unusual situation”. To an ET query on Fed’s rate decision impact during the post results conference call, Kumar said he sees high interest rates as the reason behind smaller deals and discretionary spends not happening. Without clearly stating the impact, he said, “Our clients are continuing to watch this because signalling any of this (change in rates) will also lead to change in the discretionary spend.”","cleaned_content":"indian outsourcing leaders will likely have to wait longer perhaps until the start of fy26 for a revival in business as the us federal reserve could keep interest rates elevated in the world s largest economy to ensure a lasting victory over politically uncomfortable inflation high real rates could elevate hurdle rates for companies potentially crimping growth in discretionary technology spends the feds hawkish approach is a double edged sword higher interest rates could lead us clients to curtail discretionary it spending impacting revenue growth for indian firms said hansa iyengar senior lead analyst for uk based it research firm omdia even as fy24 earnings showed subdued revenue growth across indian it majors strong deal wins and expectations of technology services demand coming back had renewed business revival hopes in the second half of fiscal \u003cTWO_THOUSAND\u003e that ends in march next year most it majors however have continued to be cautiously optimistic given the prolonged uncertainty in the industry last week the us federal reserve said the rates will remain high for long amid elevated inflation \u003cTHREE_PERCENT\u003e in march against target of \u003cTWO_PERCENT\u003e dashing the optimism that could have been supported by a rate cut an interest rate reduction pushes clients to loosen their purse strings and increase tech capital expenditure given an election year in the us coupled with ongoing geopolitical uncertainty in the western regions india s software exporters may have to bank on the next fiscal year for return of growth global it giant cognizant ceo ravi kumar s sees the times for it companies as an unusual situation to an et query on fed s rate decision impact during the post results conference call kumar said he sees high interest rates as the reason behind smaller deals and discretionary spends not happening without clearly stating the impact he said our clients are continuing to watch this because signalling any of this change in rates will also lead to change in the discretionary spend","timestamp":"2024-05-09T06:01:00+05:30","market_timestamp":"2024-05-09T09:15:00+05:30","off_market_hours":true}