{"url":"https://economictimes.indiatimes.com/tech/information-tech/midcaps-up-ma-game-with-winds-of-tech-spends-revival/articleshow/109986610.cms","title":"Midcaps up M\u0026A game with winds of tech spends revival","description":"Indian IT sector witnesses a surge in acquisitions by firms of all sizes, driven by the need to pivot to new technologies and business models. Smaller players innovate and acquire to become key innovation partners in digital areas.","content":"India’s IT services sector is witnessing a flurry of merger and acquisition activities, with several small and midsize firms announcing deals in the past four months in segments ranging from consulting and startups to engineering services, data and analytics.Most of them are making acquisitions to strengthen their capabilities so that they do not miss out when the demand for technology spending, especially in discretionary projects, returns, say analysts. Big IT firms such as Infosys, HCLTech, Wipro and Cognizant too have announced M\u0026A deals in recent months, but the numbers were fewer compared with their smaller rivals.This week, two IT firms backed by private equity major Carlyle Group – Hexaware Technologies and Quest Global – announced acquisitions. While Hexaware acquired Softcrylic, a Minneapolis-based data consulting firm, Quest Global purchased a majority stake in People Tech Group, an ERP solution provider. Last week Coforge shelled out $220 million, or about Rs 1,826 crore, to acquire a 54% stake in Hyderabad-based Cigniti Technologies.","cleaned_content":"india s it services sector is witnessing a flurry of merger and acquisition activities with several small and midsize firms announcing deals in the past four months in segments ranging from consulting and startups to engineering services data and analytics most of them are making acquisitions to strengthen their capabilities so that they do not miss out when the demand for technology spending especially in discretionary projects returns say analysts big it firms such as infosys hcltech wipro and cognizant too have announced m a deals in recent months but the numbers were fewer compared with their smaller rivals this week two it firms backed by private equity major carlyle group hexaware technologies and quest global announced acquisitions while hexaware acquired softcrylic a minneapolis based data consulting firm quest global purchased a majority stake in people tech group an erp solution provider last week coforge shelled out \u003cTWO_HUNDRED\u003e million or about rs \u003cONE_THOUSAND\u003e crore to acquire a \u003cFIVE_TEN_PERCENT\u003e stake in hyderabad based cigniti technologies","timestamp":"2024-05-10T06:11:00+05:30","market_timestamp":"2024-05-10T09:15:00+05:30","off_market_hours":true}