{"url":"https://economictimes.indiatimes.com/tech/information-tech/freshworks-stock-value-drop-not-due-to-top-deck-rejig-girish-mathrubootham/articleshow/109988194.cms","title":"Freshworks stock value drop not due to top deck rejig: Girish Mathrubootham","description":"Freshworks' stock decline attributed to AI impact concerns. Mathrubootham plans to release AI adoption stats later. Woodside appointed new CEO, Device42 acquired. Clear path to billion-dollar revenue. Transition details and Silicon Valley experience emphasized.","content":"Freshworks founder Girish Mathrubootham attributed a recent slide in the Nasdaq-listed company’s stock price to market anxiety regarding the impact of the artificial intelligence (AI) wave, dismissing the leadership transition or acquisition announcements that the company made last week as the possible reasons.“The reaction was quite surprising for us. We did not expect it to be so drastic. We understood from investors and analysts that the whole SMB (small and medium-sized businesses) pressure in the customer service market actually got our investors thinking if Freshworks is going to be disrupted by AI,” Mathrubootham said.He said the company had not released numbers on how its AI adoption was faring. “And that's on us. It is a responsibility for us as a leadership team and we'll probably do it sometime in the second half of the year,” he said.Last week, Freshworks appointed Dennis Woodside as the company’s new CEO, succeeding Mathrubootham, who moved into the newly created executive chairman role. The company also announced a $230 million acquisition of Device42, an enterprise grade IT asset management software provider.Shares in the company tanked 25% after the news.","cleaned_content":"freshworks founder girish mathrubootham attributed a recent slide in the nasdaq listed company s stock price to market anxiety regarding the impact of the artificial intelligence ai wave dismissing the leadership transition or acquisition announcements that the company made last week as the possible reasons the reaction was quite surprising for us we did not expect it to be so drastic we understood from investors and analysts that the whole smb small and medium sized businesses pressure in the customer service market actually got our investors thinking if freshworks is going to be disrupted by ai mathrubootham said he said the company had not released numbers on how its ai adoption was faring and thats on us it is a responsibility for us as a leadership team and well probably do it sometime in the second half of the year he said last week freshworks appointed dennis woodside as the company s new ceo succeeding mathrubootham who moved into the newly created executive chairman role the company also announced a \u003cTWO_HUNDRED\u003e million acquisition of device42 an enterprise grade it asset management software provider shares in the company tanked \u003cTWO_TEN_PERCENT\u003e after the news","timestamp":"2024-05-10T20:38:00+05:30","market_timestamp":"2024-05-13T09:15:00+05:30","off_market_hours":true}