{"url":"https://economictimes.indiatimes.com/tech/information-tech/reddit-user-alleges-tcs-suspended-him-for-reporting-security-incident/articleshow/109986504.cms","title":"Reddit user alleges TCS suspended him for reporting security incident","description":"TCS employee on Reddit suspended for whistleblowing security incident involving personal laptops and shared login credentials. Allegations include preferential treatment in recruitment and employment discrimination in the US.","content":"A user of social network forum Reddit claiming to be employee of India’s largest IT services company Tata Consultancy Services (TCS) said that he had been suspended after reporting a security incident to the company.Narrating his grievance social network forum Reddit, the employee said, “I reported a security incident in TCS where my manager was making employees use their personal laptops and sharing login credentials.”The employee further claimed that his suspension was against the company policy, which said that no action can be taken against a whistleblower. He also pointed out that he did not receive any help from either his manager or human resources citing he wasn't on good terms with them.\"According to the TCS whistleblower policy no action can be taken against whistleblower but today I received a suspension notice. Some background: my HR and managers will not help me because of poor relations,\" the employee wrote.In a comment later, he noted that a everyone including the manager was suspended.","cleaned_content":"a user of social network forum reddit claiming to be employee of india s largest it services company tata consultancy services tcs said that he had been suspended after reporting a security incident to the company narrating his grievance social network forum reddit the employee said i reported a security incident in tcs where my manager was making employees use their personal laptops and sharing login credentials the employee further claimed that his suspension was against the company policy which said that no action can be taken against a whistleblower he also pointed out that he did not receive any help from either his manager or human resources citing he wasnt on good terms with them according to the tcs whistleblower policy no action can be taken against whistleblower but today i received a suspension notice some background my hr and managers will not help me because of poor relations the employee wrote in a comment later he noted that a everyone including the manager was suspended","timestamp":"2024-05-09T20:27:00+05:30","market_timestamp":"2024-05-10T09:15:00+05:30","off_market_hours":true}