{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-its-reliance-on-h-1b-dropped-56-over-past-8-years/articleshow/110092466.cms","title":"Indian IT’s reliance on H-1B dropped 56% over past 8 years","description":"Indian IT companies’ reliance on H-1B visas has fallen over the years as they have ramped up local hiring in the US. High denial rates during the Trump administration along with tightening of the immigration regime have also decreased visa usage, experts said.","content":"India’s top seven IT services companies saw a 56% decline in their usage of the premier US work visa programme – H-1B – over the last eight years, data accessed by ET show.The trend has reversed for American technology majors such as Amazon and Google. Experts said Indian IT companies’ reliance on H-1B visas has been declining over the years as they have been increasing local hiring in the US. Factors such as high denial rates during the Trump administration along with tightening of the immigration regime have also played a part, they added.According to data from the National Foundation for American Policy (NFAP), approved H-1B visa petitions for initial employment in the US from the seven companies fell from 15,166 in fiscal 2015 to 6,732 in 2023.While the number for Tata Consultancy Services, which recorded the highest approvals in FY15, declined 75% in eight years, the count fell 21% for Infosys, 69% for Wipro and 46% for HCL America, the US unit of HCLTech. The remaining three — LTIMindtree, Tech Mahindra and Hexaware Technologies — too posted a fall in approvals, NFAP data showed.Also read | Trump 2.0 to threaten H-1B plans of tech companies","cleaned_content":"india s top seven it services companies saw a \u003cFIVE_TEN_PERCENT\u003e decline in their usage of the premier us work visa programme h \u003cONE_\u003e b over the last eight years data accessed by et show the trend has reversed for american technology majors such as amazon and google experts said indian it companies reliance on h \u003cONE_\u003e b visas has been declining over the years as they have been increasing local hiring in the us factors such as high denial rates during the trump administration along with tightening of the immigration regime have also played a part they added according to data from the national foundation for american policy nfap approved h \u003cONE_\u003e b visa petitions for initial employment in the us from the seven companies fell from \u003cONE_TEN_THOUSAND\u003e in fiscal \u003cTWO_THOUSAND\u003e to \u003cSIX_THOUSAND\u003e in \u003cTWO_THOUSAND\u003e while the number for tata consultancy services which recorded the highest approvals in fy15 declined \u003cSEVEN_TEN_PERCENT\u003e in eight years the count fell \u003cTWO_TEN_PERCENT\u003e for infosys \u003cSIX_TEN_PERCENT\u003e for wipro and \u003cFOUR_TEN_PERCENT\u003e for hcl america the us unit of hcltech the remaining three ltimindtree tech mahindra and hexaware technologies too posted a fall in approvals nfap data showed also read trump \u003cTWO_\u003e to threaten h \u003cONE_\u003e b plans of tech companies","timestamp":"2024-05-14T06:01:00+05:30","market_timestamp":"2024-05-14T09:15:00+05:30","off_market_hours":true}