{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-ibm-collaborate-to-set-up-genai-centre-of-excellence-for-india/articleshow/109923932.cms","title":"LTIMindtree, IBM collaborate to set up GenAI Centre of Excellence for India","description":"LTIMindtree and IBM launch a Generative AI Center of Excellence in India to develop AI solutions, combining data expertise and watsonx technology, to tackle business challenges and drive AI adoption.","content":"IT company LTIMindtree on Tuesday said it has collaborated with American technology company IBM to establish a global, joint Generative AI Center of Excellence (CoE) for India. The centre will focus on building point solutions to accelerate clients' generative AI adoption journeys.  According to a company statement, the CoE plans to offer a comprehensive suite of services, combining LTIMindtree's expertise in data and machine learning model customisation and full-stack engineering with IBM watsonx technology, including watsonx.ai, watsonx.data, and watsonx.governance, and AI assistants.  \"Our collaboration, distinguished by the Center of Excellence, is an opportunity for our companies to work closely together to help funnel the latest AI research and innovations into technologies solving real-world business challenges,\" Kate Woolley, General Manager at IBM Ecosystem, said.","cleaned_content":"it company ltimindtree on tuesday said it has collaborated with american technology company ibm to establish a global joint generative ai center of excellence coe for india the centre will focus on building point solutions to accelerate clients generative ai adoption journeys according to a company statement the coe plans to offer a comprehensive suite of services combining ltimindtrees expertise in data and machine learning model customisation and full stack engineering with ibm watsonx technology including watsonx ai watsonx data and watsonx governance and ai assistants our collaboration distinguished by the center of excellence is an opportunity for our companies to work closely together to help funnel the latest ai research and innovations into technologies solving real world business challenges kate woolley general manager at ibm ecosystem said","timestamp":"2024-05-07T19:25:00+05:30","market_timestamp":"2024-05-08T09:15:00+05:30","off_market_hours":true}