{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-elevates-vinay-firake-to-head-apac-india-middle-east-and-africa/articleshow/110011857.cms","title":"Wipro elevates Vinay Firake to head APAC, India, Middle East and Africa","description":"Vinay Firake appointed CEO APMEA at Wipro, succeeding Anis Chenchah. Srini Pallia leads. Delaporte resigned, Hari Shetty elevated. Chenchah supports till May 31, 2024. Firake's educational background includes Wharton and Harvard Business School.","content":"Wipro Friday named a company veteran of three decades as the head of its Asia pacific business, weeks after cutting short the tenure of its first expat chief executive and replacing him with internal talent to oversee a tortuous turnaround. Vinay Firake, who has been with Wipro for 26 years, will be the new chief executive officer, APMEA (Asia Pacific, India, Middle East \u0026 Africa) strategic market Unit (SMU), effective immediately.“Vinay will report to (CEO) Srini Pallia and will also join the Wipro Executive Board,” Wipro said in an exchange filing.Firake was the senior vice president and managing director of Wipro Nordics business unit based at Stockholm in Sweden, where he led Operations across all industries and services.This is the second senior leadership appointment under new chief executive officer and managing director Srini Pallia who took charge in April after Thierry Delaporte, a CapGemini veteran of nearly three decades, exited Wipro well before his scheduled tenure were to end.","cleaned_content":"wipro friday named a company veteran of three decades as the head of its asia pacific business weeks after cutting short the tenure of its first expat chief executive and replacing him with internal talent to oversee a tortuous turnaround vinay firake who has been with wipro for \u003cTWO_TEN\u003e years will be the new chief executive officer apmea asia pacific india middle east africa strategic market unit smu effective immediately vinay will report to ceo srini pallia and will also join the wipro executive board wipro said in an exchange filing firake was the senior vice president and managing director of wipro nordics business unit based at stockholm in sweden where he led operations across all industries and services this is the second senior leadership appointment under new chief executive officer and managing director srini pallia who took charge in april after thierry delaporte a capgemini veteran of nearly three decades exited wipro well before his scheduled tenure were to end","timestamp":"2024-05-10T18:52:00+05:30","market_timestamp":"2024-05-13T09:15:00+05:30","off_market_hours":true}