{"url":"https://economictimes.indiatimes.com/tech/information-tech/murthy-kris-want-next-govt-to-ease-way-for-entrepreneurs/articleshow/110155331.cms","title":"Murthy \u0026 Kris want next govt to ease way for entrepreneurs","description":"Infosys founder NR Narayana Murthy said no country has solved the problem of its poverty without encouraging its entrepreneurs. Gopalakrishnan said the new government at the centre must push for more public and private spending on research.","content":"With less than a month to go for a new regime to assume reins in New Delhi, Infosys founder NR Narayana Murthy and cofounder S 'Kris' Gopalakrishnan have called for policies that will encourage entrepreneurs to add jobs, create wealth, and pay more taxes.Murthy said he had not seen any country that has solved the problem of its poverty without encouraging entrepreneurs. “They (entrepreneurs) convert an idea into jobs for people, into wealth for themselves and their investors, and into taxes for the country. Therefore, it is desirable that all public governance systems completely remove any hassle for entrepreneurs so that they can accelerate creation of jobs and wealth, and payment of taxes to the government. That is the ideal thing for a developing country,” he said.Gopalakrishnan said the new regime in Delhi must push for more public and private spending on research. “We need to make things easier for startups,” he said, adding, “Ease of business and ease of life for ordinary people should be among the top priorities of the new government.”Both spoke to ET exclusively on Wednesday on a range of topics.Murthy urged the upcoming government to “fully embrace compassionate capitalism” and provide free play for entrepreneurs “as neither socialist nor communist systems led to a satisfactory outcome in the past”.","cleaned_content":"with less than a month to go for a new regime to assume reins in new delhi infosys founder nr narayana murthy and cofounder s kris gopalakrishnan have called for policies that will encourage entrepreneurs to add jobs create wealth and pay more taxes murthy said he had not seen any country that has solved the problem of its poverty without encouraging entrepreneurs they entrepreneurs convert an idea into jobs for people into wealth for themselves and their investors and into taxes for the country therefore it is desirable that all public governance systems completely remove any hassle for entrepreneurs so that they can accelerate creation of jobs and wealth and payment of taxes to the government that is the ideal thing for a developing country he said gopalakrishnan said the new regime in delhi must push for more public and private spending on research we need to make things easier for startups he said adding ease of business and ease of life for ordinary people should be among the top priorities of the new government both spoke to et exclusively on wednesday on a range of topics murthy urged the upcoming government to fully embrace compassionate capitalism and provide free play for entrepreneurs as neither socialist nor communist systems led to a satisfactory outcome in the past","timestamp":"2024-05-15T22:14:00+05:30","market_timestamp":"2024-05-16T09:15:00+05:30","off_market_hours":true}