{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-midcaps-weather-market-storm-to-enter-billion-dollar-club/articleshow/110131152.cms","title":"IT midcaps weather market storm to enter billion-dollar club","description":"Many other mid-cap IT firms are also eyeing an entry into the billion-dollar club in the coming quarters while the above-mentioned four are chasing the next target of $2 billion, industry observers said. Firms such as Happiest Minds Technologies, Cyient, ITC Infotech and Birlasoft announced their billion-dollar revenue target recently.","content":"Despite a challenging environment with slowing demand in the $250-billion Indian IT industry, four smaller IT firms in the country have entered the billion-dollar revenue group over the last five quarters. They are L\u0026T group's LTTS, Coforge, Persistent Systems, and Sonata Software. Many other mid-cap IT firms are also eyeing an entry into the billion-dollar club in the coming quarters while the above-mentioned four are chasing the next target of $2 billion, industry observers said. Firms such as Happiest Minds Technologies, Cyient, ITC Infotech and Birlasoft announced their billion-dollar revenue target recently.Experts said some small and mid-cap firms have managed to buck the overall industry trend and outperform their larger peers in terms of higher growth and profitability mainly due to their specialisation in certain niche segments and sectors.LTTS and Sonata Software crossed the billion-dollar milestone in FY24.\"We doubled down our strategic relationship with Microsoft and that helped us to be here,\" Sonata Software CFO Jagannathan CN said. The firm harvested hi-tech and retail verticals while its acquisition of Quant helped increase its BFSI and healthcare business, he said, adding that the firms also announced 14 large deals last year. \"Large deals for us are those that are above $5 million TCV (total contract value),\" Jagannathan said.","cleaned_content":"despite a challenging environment with slowing demand in the \u003cTWO_HUNDRED\u003e billion indian it industry four smaller it firms in the country have entered the billion dollar revenue group over the last five quarters they are l t groups ltts coforge persistent systems and sonata software many other mid cap it firms are also eyeing an entry into the billion dollar club in the coming quarters while the above mentioned four are chasing the next target of \u003cTWO_\u003e billion industry observers said firms such as happiest minds technologies cyient itc infotech and birlasoft announced their billion dollar revenue target recently experts said some small and mid cap firms have managed to buck the overall industry trend and outperform their larger peers in terms of higher growth and profitability mainly due to their specialisation in certain niche segments and sectors ltts and sonata software crossed the billion dollar milestone in fy24 we doubled down our strategic relationship with microsoft and that helped us to be here sonata software cfo jagannathan cn said the firm harvested hi tech and retail verticals while its acquisition of quant helped increase its bfsi and healthcare business he said adding that the firms also announced \u003cONE_TEN\u003e large deals last year large deals for us are those that are above \u003cFIVE_\u003e million tcv total contract value jagannathan said","timestamp":"2024-05-15T06:43:00+05:30","market_timestamp":"2024-05-15T09:15:00+05:30","off_market_hours":true}