{"url":"https://economictimes.indiatimes.com/tech/information-tech/hexaware-acquires-softcrylic-boosts-its-data-and-analytics-capabilities/articleshow/109894172.cms","title":"Hexaware acquires Softcrylic; boosts its data and analytics capabilities","description":"While Hexaware didn’t disclose the financials of the deal, the acquisition would boost the mid-tier IT firm’s data and analytics capabilities, said the company in a statement. Global investment bank, Canaccord Genuity, advised Softcrylic on the transaction.","content":"Carlyle Group backed Hexaware Technologies has acquired Softcrylic, a Minneapolis based data consulting firm. While Hexaware didn’t disclose the financials of the deal, the acquisition would boost the mid-tier IT firm’s data and analytics capabilities, said the company in a statement. Global investment bank, Canaccord Genuity, advised Softcrylic on the transaction. The development comes close on the heels of Carlyle Group reportedly planning for an $1 billion initial public offer (IPO) for Hexaware three years after the US based PE firm bought Baring Private Equity Asia stake in the IT firm for close to $3 billion in 2021. Before Carlyle acquisition, the then promoter Baring de-listed Hexaware from Indian stock exchanges in November 2020.“The acquisition of Softcrylic aligns perfectly with our vision of becoming a dominant preferred partner for our clients’ needs around customer and marketing analytics,\" said Girish Pai, global head, data and AI at Hexaware. “Softcrylic’s deep data capability combined with their marketing analytics expertise will enable us to help our clients unlock the power of their data and drive tangible business outcomes.”Last year, the mid-tier IT company appointed former Infosys and Tredence executive Girish Pai as the global head of its data and AI service line as a means to boost its AI capabilities. Hexaware’s FY23 revenue was at Rs 10,380 crore, up 12.8% on-year. Its net profit for the same period was at Rs 997 crore, up 12.7% on-year. The IT firm has over 30,000 employees currently.John Flavin, CEO, Softcrylic. “We are confident that our combined expertise will create a powerhouse in the data consulting space.” Softcrylic specialises in tackling complex data challenges, from data capture and validation to data modeling and activation.","cleaned_content":"carlyle group backed hexaware technologies has acquired softcrylic a minneapolis based data consulting firm while hexaware didn t disclose the financials of the deal the acquisition would boost the mid tier it firm s data and analytics capabilities said the company in a statement global investment bank canaccord genuity advised softcrylic on the transaction the development comes close on the heels of carlyle group reportedly planning for an \u003cONE_\u003e billion initial public offer ipo for hexaware three years after the us based pe firm bought baring private equity asia stake in the it firm for close to \u003cTHREE_\u003e billion in \u003cTWO_THOUSAND\u003e before carlyle acquisition the then promoter baring de listed hexaware from indian stock exchanges in november \u003cTWO_THOUSAND\u003e the acquisition of softcrylic aligns perfectly with our vision of becoming a dominant preferred partner for our clients needs around customer and marketing analytics said girish pai global head data and ai at hexaware softcrylic s deep data capability combined with their marketing analytics expertise will enable us to help our clients unlock the power of their data and drive tangible business outcomes last year the mid tier it company appointed former infosys and tredence executive girish pai as the global head of its data and ai service line as a means to boost its ai capabilities hexaware s fy23 revenue was at rs \u003cONE_TEN_THOUSAND\u003e crore up \u003cONE_TEN_PERCENT\u003e on year its net profit for the same period was at rs \u003cNINE_HUNDRED\u003e crore up \u003cONE_TEN_PERCENT\u003e on year the it firm has over \u003cTHREE_TEN_THOUSAND\u003e employees currently john flavin ceo softcrylic we are confident that our combined expertise will create a powerhouse in the data consulting space softcrylic specialises in tackling complex data challenges from data capture and validation to data modeling and activation","timestamp":"2024-05-06T23:24:00+05:30","market_timestamp":"2024-05-07T09:15:00+05:30","off_market_hours":true}