{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-it-sees-deal-tenures-shrinking-in-rich-neighbourhoods/articleshow/110506262.cms","title":"Indian IT sees deal tenures shrinking in rich neighbourhoods","description":"At least two companies – HCLTech and Birlasoft – have gone on record to say that from the usual 10-12 year deals earlier, long-term arrangements are now ending in four years. Earlier, the tenures ranged between 10-12 years.","content":"Rapid obsolescence of specific technologies and uncertain macroeconomics in the world's richer neighbourhoods have shortened the deal tenures for India’s over $250-billion outsourcing industry.At least two companies – HCLTech and Birlasoft – have gone on record to say that from the usual 10-12 year deals earlier, long-term arrangements are now ending in four years. Earlier, the tenures ranged between 10-12 years. Experts said while clients prefer tenured deals to one-off large discretionary spending, the time window is shorter or the arrangements are coming with stage-gated tenures.For instance, among large deals (publicly announced in the last fiscal) of Infosys - Liberty Global, Danske Bank and BP -- have tenures of five to six years. The Liberty Global deal with Infosys is for an initial 5-year agreement, with an option to extend another three years and more. Even the Danske deal has a period of five years, with an option to be renewed for up to another three years. Hansa Iyengar, UK-based research firm Omdia’s senior principal analyst for enterprise IT, said: “A quick look shows that more than two-thirds of all contracts over $150mn in TCV that were signed in the past 2 years have a tenure of 5 years or less.”","cleaned_content":"rapid obsolescence of specific technologies and uncertain macroeconomics in the worlds richer neighbourhoods have shortened the deal tenures for india s over \u003cTWO_HUNDRED\u003e billion outsourcing industry at least two companies hcltech and birlasoft have gone on record to say that from the usual \u003cONE_TEN\u003e \u003cONE_TEN\u003e year deals earlier long term arrangements are now ending in four years earlier the tenures ranged between \u003cONE_TEN\u003e \u003cONE_TEN\u003e years experts said while clients prefer tenured deals to one off large discretionary spending the time window is shorter or the arrangements are coming with stage gated tenures for instance among large deals publicly announced in the last fiscal of infosys liberty global danske bank and bp have tenures of five to six years the liberty global deal with infosys is for an initial \u003cFIVE_\u003e year agreement with an option to extend another three years and more even the danske deal has a period of five years with an option to be renewed for up to another three years hansa iyengar uk based research firm omdia s senior principal analyst for enterprise it said a quick look shows that more than two thirds of all contracts over \u003cONE_HUNDRED\u003e mn in tcv that were signed in the past \u003cTWO_\u003e years have a tenure of \u003cFIVE_\u003e years or less","timestamp":"2024-05-29T06:00:00+05:30","market_timestamp":"2024-05-29T09:15:00+05:30","off_market_hours":true}