{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-appoints-sarat-chand-as-md-for-northern-europe/articleshow/110371943.cms","title":"Wipro appoints Sarat Chand as MD for Northern Europe","description":"Effecting a management rejig after the appointment of new chief executive Srinivas Pallia, the company had announced some incremental organisational changes last week, as reported by ET earlier. The firm had said Sarat, the current Wipro-Benelux MD, would lead Northern Europe.","content":"Wipro on Thursday announced the appointment of Sarat Chand as regional head and managing director of its Northern Europe region. He will report to the IT firm’s Europe CEO Pierre Bruno.Last week, the company had said in an email to employees, following a management rejig after the appointment of new chief executive Srinivas Pallia, that Chand, the Wipro Benelux MD, would lead northern Europe.“Sarat's client-centricity, focus on execution excellence and ability to build high-performing teams will be instrumental in expanding our presence in the Northern Europe region. Sarat will build on the foundation set by Vinay (Firake) in the Nordics and lead our combined Northern Europe region to new heights,” said Bruno.Chand has served in a variety of leadership positions at Wipro, where he has worked for more than two decades, including solutions lead, account management and EMEA utilities business head. As the head of the Benelux region, he significantly strengthened Wipro’s position in the market. Under his leadership, the company’s Netherlands business has consistently been ranked among the top IT providers in the region by analyst firms.In his new role, Chand will lead Wipro’s Benelux and Nordics region, which includes seven strategic growth markets – Belgium, Denmark, Finland, Luxemburg, the Netherlands, Norway and Sweden. The Nordics region was earlier led by Firake, who was recently appointed as CEO of the APMEA strategic market unit. After Firake's appointment to the new role, Wipro decided to combine Nordics and Benelux operations to form a single Northern Europe region.","cleaned_content":"wipro on thursday announced the appointment of sarat chand as regional head and managing director of its northern europe region he will report to the it firm s europe ceo pierre bruno last week the company had said in an email to employees following a management rejig after the appointment of new chief executive srinivas pallia that chand the wipro benelux md would lead northern europe sarats client centricity focus on execution excellence and ability to build high performing teams will be instrumental in expanding our presence in the northern europe region sarat will build on the foundation set by vinay firake in the nordics and lead our combined northern europe region to new heights said bruno chand has served in a variety of leadership positions at wipro where he has worked for more than two decades including solutions lead account management and emea utilities business head as the head of the benelux region he significantly strengthened wipro s position in the market under his leadership the company s netherlands business has consistently been ranked among the top it providers in the region by analyst firms in his new role chand will lead wipro s benelux and nordics region which includes seven strategic growth markets belgium denmark finland luxemburg the netherlands norway and sweden the nordics region was earlier led by firake who was recently appointed as ceo of the apmea strategic market unit after firakes appointment to the new role wipro decided to combine nordics and benelux operations to form a single northern europe region","timestamp":"2024-05-23T22:10:00+05:30","market_timestamp":"2024-05-24T09:15:00+05:30","off_market_hours":true}