{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-ceo-banks-on-internal-talent-promotes-veterans/articleshow/110347118.cms","title":"Wipro CEO banks on internal talent, promotes veterans","description":"Focusing on inside talent comes at a time when it has been dealing with exodus of senior leaders. This also comes after a period when Delaporte hired a lot of foreign citizens and expats at high salaries.","content":"Signalling confidence in the depth of its existing senior leadership who have been with Wipro for many years and as measure to stem the exit of internal talent which had plagued the company during previous CEO Theirry Delaporte's tenure, new CEO Srini Pallia has promoted at least five Wipro insiders, including three veterans, in the last one and half month. Days after Pallia took charge of the top office, Wipro appointed Malay Joshi, a Wipro veteran for 28 years, as CEO of Americas 1, the company's largest market. Early this month, Wipro appointed Hari Shetty, a Wipro veteran for 31 years, as chief strategist and sales excellence officer of the company. Again, this month, Wipro saw the exit of two former Capgemini executives and Delaporte's hires - chief operating officer, Amit Choudhary and Anis Chenchah, CEO of APMEA. While Chenchah was succeeded by Vinay Firake, who is a Wipro veteran for about 26 years, Choudhary was succeeded by Sanjeev Jain who joined the IT major in April last year - still signalling its confidence on its bench by relying on internal talent. Mail to Wipro didn't elicit any response till the time of going to press. Last week, Wipro also appointed Shreyas Bhosale as Wipro Engagement Leader for Private Wireless joint GTM with Nokia. The company also gave additional charge of Nordic region to Sarat Chand, the current Wipro-Benelux's managing director, by merging Nordics and Benelux into a new Northern Europe region. Chand is also an old Wipro hand working with the IT firm for the last 15 years. Analysts have applauded the move and said that it sends the correct signals to all stakeholders such as employees and clients to strengthen sticky relationships between them. They also expect more emphasis on home grown Indian leaders, unlike Thierry's strong pivot to outsiders in the last few years. ","cleaned_content":"signalling confidence in the depth of its existing senior leadership who have been with wipro for many years and as measure to stem the exit of internal talent which had plagued the company during previous ceo theirry delaportes tenure new ceo srini pallia has promoted at least five wipro insiders including three veterans in the last one and half month days after pallia took charge of the top office wipro appointed malay joshi a wipro veteran for \u003cTWO_TEN\u003e years as ceo of americas \u003cONE_\u003e the companys largest market early this month wipro appointed hari shetty a wipro veteran for \u003cTHREE_TEN\u003e years as chief strategist and sales excellence officer of the company again this month wipro saw the exit of two former capgemini executives and delaportes hires chief operating officer amit choudhary and anis chenchah ceo of apmea while chenchah was succeeded by vinay firake who is a wipro veteran for about \u003cTWO_TEN\u003e years choudhary was succeeded by sanjeev jain who joined the it major in april last year still signalling its confidence on its bench by relying on internal talent mail to wipro didnt elicit any response till the time of going to press last week wipro also appointed shreyas bhosale as wipro engagement leader for private wireless joint gtm with nokia the company also gave additional charge of nordic region to sarat chand the current wipro beneluxs managing director by merging nordics and benelux into a new northern europe region chand is also an old wipro hand working with the it firm for the last \u003cONE_TEN\u003e years analysts have applauded the move and said that it sends the correct signals to all stakeholders such as employees and clients to strengthen sticky relationships between them they also expect more emphasis on home grown indian leaders unlike thierrys strong pivot to outsiders in the last few years","timestamp":"2024-05-23T07:01:00+05:30","market_timestamp":"2024-05-23T09:15:00+05:30","off_market_hours":true}