{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-sees-more-top-deck-changes-under-ceo-pallias-watch/articleshow/110285809.cms","title":"Wipro sees more top deck changes under CEO Pallia's watch","description":"New chief executive Srinivas Pallia is undertaking changes in the senior management of IT major Wipro. This is part of multiple changes Pallia is bringing about since he took the helm earlier this year, after the abrupt exit of Thierry Delaporte.","content":"Wipro, which has recently undertaken a management rejig after the appointment of new chief executive Srinivas Pallia, announced some more incremental organisational changes last week, according to an email to employees that ET has seen.Jason Eichenholz, who is senior vice president and global head of Ecosystems \u0026 Partnerships, will now report to Jo Debecker, head of Wipro's FullStride Cloud business line. While Eichenholz joined Wipro in August 2021, Debecker has been with Wipro since January 2022. Before joining Wipro, Debecker was chief delivery officer and head of group operations at Atos.In the email Wipro said: \"To further accelerate profitable growth through partnerships and improve internal collaboration, the ecosystems and partnerships (E\u0026P) organisation will shift closer to the global business lines (GBLs). Effective immediately, the E\u0026P organisation, led by Jason Eichenholz, will be part of the FullStride Cloud GBL reporting to Jo Debecker. The E\u0026P team will continue to be closely aligned with all the other GBLs.\"Wipro has four strategic global business lines - FullStride Cloud, Enterprise Futuring, Engineering Edge and Consulting. FullStride Cloud accounts for more than a third of the company's revenue.After Vinay Firake, the former MD of Wipro-Nordics region, was appointed as chief executive for the APMEA Strategic Market Unit, Wipro has decided to combine Nordics and Benelux operations to form a single Northern Europe region. ","cleaned_content":"wipro which has recently undertaken a management rejig after the appointment of new chief executive srinivas pallia announced some more incremental organisational changes last week according to an email to employees that et has seen jason eichenholz who is senior vice president and global head of ecosystems partnerships will now report to jo debecker head of wipros fullstride cloud business line while eichenholz joined wipro in august \u003cTWO_THOUSAND\u003e debecker has been with wipro since january \u003cTWO_THOUSAND\u003e before joining wipro debecker was chief delivery officer and head of group operations at atos in the email wipro said to further accelerate profitable growth through partnerships and improve internal collaboration the ecosystems and partnerships e p organisation will shift closer to the global business lines gbls effective immediately the e p organisation led by jason eichenholz will be part of the fullstride cloud gbl reporting to jo debecker the e p team will continue to be closely aligned with all the other gbls wipro has four strategic global business lines fullstride cloud enterprise futuring engineering edge and consulting fullstride cloud accounts for more than a third of the companys revenue after vinay firake the former md of wipro nordics region was appointed as chief executive for the apmea strategic market unit wipro has decided to combine nordics and benelux operations to form a single northern europe region","timestamp":"2024-05-21T06:59:00+05:30","market_timestamp":"2024-05-21T09:15:00+05:30","off_market_hours":true}