{"url":"https://economictimes.indiatimes.com/tech/information-tech/as-macro-climate-changes-genai-will-also-scale-up-infosys-ceo-salil-parekh/articleshow/110473860.cms","title":"As macro climate changes, GenAI will also scale up: Infosys CEO Salil Parekh","description":"In a wide-ranging interview with Sameer Ranjan Bakshi, Beena Parmar and Surabhi Agarwal, Salil Parekh, chief executive and managing director of Infosys, spoke of his plans to prepare the $18.6 billion software services giant — through its Topaz platform — for the GenAI-led transformation that will take root as global macro-economic concerns ease.","content":"Infosys is pivoting to a GenAI first company, Salil Parekh, chief executive and managing director of India’s second-largest software services firm told ET. In a wide-ranging interview with Sameer Ranjan Bakshi, Beena Parmar and Surabhi Agarwal, he spoke of his plans to prepare the $18.6 billion software services giant — through its Topaz platform — for the GenAI-led transformation that will take root as global macro-economic concerns ease. For now, as clients postpone large digital transformation projects amid uncertain demand for technology services, Infosys will choose profitability over growth. The 59-year-old — whose second tenure as Infosys CEO extends until 2027—said his spare time these days is devoted to experimenting with different AI tools. Edited Excerpts The current financial year was supposed to be one of recovery, how has it been so far?We are not seeing discretionary spends and the (return) of large digital programs. Financial services was looking a little better at the end of fourth quarter (FY24), that continues. While GenAI is currently very small in terms of revenue, the good part is that there is a lot of activity. It’s a way to manufacture new intelligence – whether it is through tokens or assistants or agents. And we are using them in different places – software engineering or in customer service or in sales and marketing. And we are seeing new elements coming from generative AI, as well as some cost efficiency and productivity. As the inflation, interest rate, macro-economic environment changes, we will start to see some of the digital programs start to come back. And then GenAI will also start to scale up. It is a multi-year project.Also read | After tennis, Infosys Topaz to drive AI-led innovation of Formula E racingAre clients taking big bets on GenAI projects yet?","cleaned_content":"infosys is pivoting to a genai first company salil parekh chief executive and managing director of india s second largest software services firm told et in a wide ranging interview with sameer ranjan bakshi beena parmar and surabhi agarwal he spoke of his plans to prepare the \u003cONE_TEN\u003e billion software services giant through its topaz platform for the genai led transformation that will take root as global macro economic concerns ease for now as clients postpone large digital transformation projects amid uncertain demand for technology services infosys will choose profitability over growth the \u003cFIVE_TEN\u003e year old whose second tenure as infosys ceo extends until \u003cTWO_THOUSAND\u003e said his spare time these days is devoted to experimenting with different ai tools edited excerpts the current financial year was supposed to be one of recovery how has it been so far we are not seeing discretionary spends and the return of large digital programs financial services was looking a little better at the end of fourth quarter fy24 that continues while genai is currently very small in terms of revenue the good part is that there is a lot of activity it s a way to manufacture new intelligence whether it is through tokens or assistants or agents and we are using them in different places software engineering or in customer service or in sales and marketing and we are seeing new elements coming from generative ai as well as some cost efficiency and productivity as the inflation interest rate macro economic environment changes we will start to see some of the digital programs start to come back and then genai will also start to scale up it is a multi year project also read after tennis infosys topaz to drive ai led innovation of formula e racingare clients taking big bets on genai projects yet","timestamp":"2024-05-28T06:00:00+05:30","market_timestamp":"2024-05-28T09:15:00+05:30","off_market_hours":true}