{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-recruits-76-lesser-college-graduates-in-fy24/articleshow/110666489.cms","title":"Infosys recruits 76% lesser college graduates in FY24","description":"IT major Infosys hired 11,900 college graduates in FY24. This is against over 50,000 graduates hired a year ago, as per data from its annual reports.","content":"Infosys, India’s second-largest IT services company, witnessed a 76% drop in hiring college graduates at nearly 11,900 in fiscal year 2023-24 ending March. This compares to over 50,000 hired a year ago, data from its annual reports showed.“We recruited nearly 11,900 college graduates in the year and ended the year with over 3,17,000 employees,” said Salil Parekh, CEO and managing director of Infosys, in its latest annual report for FY24.In FY23, Infosys had recruited over 50,000 college graduates and ended the financial year with 343,234 employees.In line with industry trends, during the financial period – April 2023 to March 2024, the IT giant’s total headcount dropped by 25,994 with its total employee base down by 7.5% to 317,240.Infosys’ attrition also declined to 12.6% from 12.9% last year.","cleaned_content":"infosys india s second largest it services company witnessed a \u003cSEVEN_TEN_PERCENT\u003e drop in hiring college graduates at nearly \u003cONE_TEN_THOUSAND\u003e in fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e ending march this compares to over \u003cFIVE_TEN_THOUSAND\u003e hired a year ago data from its annual reports showed we recruited nearly \u003cONE_TEN_THOUSAND\u003e college graduates in the year and ended the year with over \u003cTHREE_HUNDRED_THOUSAND\u003e employees said salil parekh ceo and managing director of infosys in its latest annual report for fy24 in fy23 infosys had recruited over \u003cFIVE_TEN_THOUSAND\u003e college graduates and ended the financial year with \u003cTHREE_HUNDRED_THOUSAND\u003e employees in line with industry trends during the financial period april \u003cTWO_THOUSAND\u003e to march \u003cTWO_THOUSAND\u003e the it giant s total headcount dropped by \u003cTWO_TEN_THOUSAND\u003e with its total employee base down by \u003cSEVEN_PERCENT\u003e to \u003cTHREE_HUNDRED_THOUSAND\u003e infosys attrition also declined to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e last year","timestamp":"2024-06-03T17:13:00+05:30","market_timestamp":"2024-06-04T09:15:00+05:30","off_market_hours":true}