{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-flexi-stance-helps-staffers-avail-more-remote-work-options/articleshow/111119024.cms","title":"Infosys’ flexi stance helps staffers avail more remote work options","description":"Infosys, India's second largest IT company, has embraced a flexible approach to returning to office post-pandemic. Employees leveraged remote working options in FY24, as per the ESG report. In FY24, 84% of Infosys employees worked remotely, compared to 75% in FY23 and 97% in 2022 during the pandemic.","content":"India's second largest IT company, Infosys, has taken a softer and more flexible approach when it comes to returning to the “work from office” mode after the pandemic.Employees at the Bengaluru-based company have leveraged more remote working options in FY24 than in FY23, shows its ESG (environmental, social, and governance) report that ET has seen. This comes at a time when other tech companies are bringing in stricter mandates for employees to work from office.In FY24, about 84% of Infosys employees leveraged remote working options, compared with 75% in FY23. The figure was 97% in fiscal 2022, when the world was gripped by the Covid pandemic.Questions mailed to Infosys didn’t elicit any response till the time of going to press Wednesday. ","cleaned_content":"indias second largest it company infosys has taken a softer and more flexible approach when it comes to returning to the work from office mode after the pandemic employees at the bengaluru based company have leveraged more remote working options in fy24 than in fy23 shows its esg environmental social and governance report that et has seen this comes at a time when other tech companies are bringing in stricter mandates for employees to work from office in fy24 about \u003cEIGHT_TEN_PERCENT\u003e of infosys employees leveraged remote working options compared with \u003cSEVEN_TEN_PERCENT\u003e in fy23 the figure was \u003cNINE_TEN_PERCENT\u003e in fiscal \u003cTWO_THOUSAND\u003e when the world was gripped by the covid pandemic questions mailed to infosys didn t elicit any response till the time of going to press wednesday","timestamp":"2024-06-21T09:21:00+05:30","market_timestamp":"2024-06-21T09:21:00+05:30","off_market_hours":false}