{"url":"https://economictimes.indiatimes.com/tech/information-tech/meity-policy-momentum-to-continue-with-ashwini-vaishnaw-retaining-electronics-it-portfolio/articleshow/110882099.cms","title":"Meity policy momentum to continue with Ashwini Vaishnaw retaining Electronics, IT portfolio","description":"Union minister Ashwini Vaishnaw retains electronics and IT portfolio, spearheading success in electronics and semiconductor manufacturing. He also oversees the enactment of the Digital Personal Data Protection Act and holds the railway ministry along with the Information and Broadcasting ministry.","content":"Union minister Ashwini Vaishnaw has retained electronics and IT portfolio where he has scripted success stories around electronics and semiconductor manufacturing and also spearheaded the enactment of crucial Digital Personal Data Protection Act. Vaishnaw has also retained the railway ministry and got the additional charge of the Information and Broadcasting ministry.  An IIT Kanpur alumni, the bureaucrat-turned-politician has had an action-packed stint in the Modi 2.0 government and will need to build on the past momentum which are crucial to make India's electronic and IT sector 'Atmanirbhar' (self-reliant) .  Mobile phone manufacturing during Vaishnaw's tenure crossed Rs 4.1 lakh crore worth of production mark, which is a 21-fold jump in production level compared to that in 2014-15, when 98 per cent of local demand was met through imports. The country now meets 97 per cent of its total mobile phone demand locally.  Among the pending issues Vaishnaw would have to work out the enabling rules to implement Digital Personal Data Protection (DPDP) Act and also give shape to the proposed Digital India Act, which will supersede the over two decades old IT Act.  The DPDP Act was approved by Parliament in August last year after six years of the Supreme Court declaring 'Right to Privacy' as a fundamental right, and has provisions to curb the misuse of individuals' data by online platforms. ","cleaned_content":"union minister ashwini vaishnaw has retained electronics and it portfolio where he has scripted success stories around electronics and semiconductor manufacturing and also spearheaded the enactment of crucial digital personal data protection act vaishnaw has also retained the railway ministry and got the additional charge of the information and broadcasting ministry an iit kanpur alumni the bureaucrat turned politician has had an action packed stint in the modi \u003cTWO_\u003e government and will need to build on the past momentum which are crucial to make indias electronic and it sector atmanirbhar self reliant mobile phone manufacturing during vaishnaws tenure crossed rs \u003cFOUR_\u003e lakh crore worth of production mark which is a \u003cTWO_TEN\u003e fold jump in production level compared to that in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e when \u003cNINE_TEN_PERCENT\u003e of local demand was met through imports the country now meets \u003cNINE_TEN_PERCENT\u003e of its total mobile phone demand locally among the pending issues vaishnaw would have to work out the enabling rules to implement digital personal data protection dpdp act and also give shape to the proposed digital india act which will supersede the over two decades old it act the dpdp act was approved by parliament in august last year after six years of the supreme court declaring right to privacy as a fundamental right and has provisions to curb the misuse of individuals data by online platforms","timestamp":"2024-06-10T22:44:00+05:30","market_timestamp":"2024-06-11T09:15:00+05:30","off_market_hours":true}