{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-to-ring-opening-bell-at-nyse-to-mark-25th-anniversary/articleshow/111146700.cms","title":"Infosys to ring opening bell at NYSE to mark 25th anniversary","description":"Salil Parekh and Jayesh Sanghrajka, along with other key leaders from Infosys, will ring The Opening Bell at the NYSE on June 21, 2024, marking 25 years of successful US listing and growth.","content":"Infosys has been invited to ring the opening bell at the New York Stock Exchange (NYSE) on Friday - June 21, 2024. The honour commemorates Infosys’ 25 years of being listed in the US, the company said in a statement.Salil Parekh, CEO, Infosys along with Jayesh Sanghrajka, CFO, and other key leaders from Infosys, will ring The Opening Bell at the NYSE.“We are delighted to be invited to ring The Opening Bell at the NYSE and to celebrate 25 years of listing in the U.S. For over 4 decades we have partnered with American businesses as they digitally transform to navigate their next. Today, we are enabling new pathways to move them forward – with expanded growth opportunities and enhanced productivity – into an AI-first future,” said Parekh.Sanghrajka, said, “We have delivered 25 years of strong performance since our US listing in 1999 with 22% revenue CAGR and 15% market cap CAGR. Today, we are thrilled to celebrate the achievements of our work in the United States and would like to thank all clients, employees, investors, and other stakeholders who have contributed to company’s success over the years”.","cleaned_content":"infosys has been invited to ring the opening bell at the new york stock exchange nyse on friday june \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the honour commemorates infosys \u003cTWO_TEN\u003e years of being listed in the us the company said in a statement salil parekh ceo infosys along with jayesh sanghrajka cfo and other key leaders from infosys will ring the opening bell at the nyse we are delighted to be invited to ring the opening bell at the nyse and to celebrate \u003cTWO_TEN\u003e years of listing in the u s for over \u003cFOUR_\u003e decades we have partnered with american businesses as they digitally transform to navigate their next today we are enabling new pathways to move them forward with expanded growth opportunities and enhanced productivity into an ai first future said parekh sanghrajka said we have delivered \u003cTWO_TEN\u003e years of strong performance since our us listing in \u003cONE_THOUSAND\u003e with \u003cTWO_TEN_PERCENT\u003e revenue cagr and \u003cONE_TEN_PERCENT\u003e market cap cagr today we are thrilled to celebrate the achievements of our work in the united states and would like to thank all clients employees investors and other stakeholders who have contributed to company s success over the years","timestamp":"2024-06-20T22:17:00+05:30","market_timestamp":"2024-06-21T09:15:00+05:30","off_market_hours":true}