{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-ministers-back-policy-honchos-hope-data-rules-will-allay-sectors-concerns/articleshow/110918223.cms","title":"IT Minister’s back, policy honchos hope data rules will allay sector’s concerns","description":"The re-appointment of Ashwini Vaishnaw as the minister of electronics and information technology has sparked hopes for continued dialogue between the industry, technology policy groups, and the government before the Digital Personal Data Protection (DPDP) Rules are enforced. The government aims to build on the policy work done so far, including drafts for the Digital India Bill and safeguards for AI.","content":"The re-appointment of Ashwini Vaishnaw as the minister of electronics and information technology has kindled hopes of continued dialogue between the industry, technology policy groups and the government to alleviate stakeholder concerns before the Digital Personal Data Protection (DPDP) Rules are notified. The technology policy ecosystem is also hoping that the DPDP Rules will be fast tracked and also reviewed to allay some industry concerns before they are notified.The Act was notified in August last year but it has not been operationalised since the Rules are pending. On Tuesday, Vaishnaw said that the government would look to create a strong foundation to make India not only “stand shoulder-to-shoulder with the world but also to take the lead in emerging technologies such as semiconductors, telecommunications, and manufacturing among others”.Sources in the IT ministry, where Vaishnaw took charge on Tuesday morning, said that the government would look to build on the policy work already done so far in the earlier term.“Our consultative approach will continue. A lot of groundwork and policy feedback has gone into the initial internal drafts, whether for the Digital India Bill or the DPDP Act, the safeguards for AI, among others. We hope to build on that,” a senior government official said.","cleaned_content":"the re appointment of ashwini vaishnaw as the minister of electronics and information technology has kindled hopes of continued dialogue between the industry technology policy groups and the government to alleviate stakeholder concerns before the digital personal data protection dpdp rules are notified the technology policy ecosystem is also hoping that the dpdp rules will be fast tracked and also reviewed to allay some industry concerns before they are notified the act was notified in august last year but it has not been operationalised since the rules are pending on tuesday vaishnaw said that the government would look to create a strong foundation to make india not only stand shoulder to shoulder with the world but also to take the lead in emerging technologies such as semiconductors telecommunications and manufacturing among others sources in the it ministry where vaishnaw took charge on tuesday morning said that the government would look to build on the policy work already done so far in the earlier term our consultative approach will continue a lot of groundwork and policy feedback has gone into the initial internal drafts whether for the digital india bill or the dpdp act the safeguards for ai among others we hope to build on that a senior government official said","timestamp":"2024-06-12T06:11:00+05:30","market_timestamp":"2024-06-12T09:15:00+05:30","off_market_hours":true}