{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-ceo-says-fy25-will-be-turnaround-year/articleshow/111344055.cms","title":"Tech Mahindra CEO Mohit Joshi says FY25 will be turnaround year","description":"As per Tech Mahindra chairman Anand Mahindra, as organisations strive to stay ahead in the digital race, IT services will play a key role in enhancing technology by integrating AI seamlessly into the core business functions. “The race does not necessarily belong to the large or the most specialised. The winners will be companies that are agile, well-prepared and can scale at speed,” he said.","content":"In the ongoing digital race, IT services will play a pivotal role in enhancing technology by integrating AI seamlessly into the core business functions, according to Tech Mahindra (TechM) chairman Anand Mahindra.“Technology is the golden thread that is central to businesses and industries throughout the world…The future undoubtedly belongs to IT services that can increase the value of that golden thread from 18 carat to 24 carat with the power of AI,” Mahindra said in TechM’s annual report for 2023-24.According to him, as organisations strive to stay ahead in the digital race, IT services will play a pivotal role in enhancing technology by integrating AI seamlessly into the core business functions. “The race does not necessarily belong to the large or the most specialised. The winners will be companies that are agile, well-prepared and can scale at speed,” Mahindra said.Amid a challenging macro environment, TechM's revenue from operations in FY24 fell 2.42% to Rs 51,996 crore ($6.3 billion) compared to Rs 53,290 crore ($6.4 billion) in FY23. In June last year, the firm also appointed Mohit Joshi as the new CEO and MD, taking over from former chief CP Gurnani who retired on December 19, 2023.In his inaugural message to stakeholders, Joshi said, “FY25, will be the turnaround year for us, marked by new investments in our key accounts and service lines. We will drive the integration of our portfolio companies, focus on our largest clients, and prioritise cost optimisation.”","cleaned_content":"in the ongoing digital race it services will play a pivotal role in enhancing technology by integrating ai seamlessly into the core business functions according to tech mahindra techm chairman anand mahindra technology is the golden thread that is central to businesses and industries throughout the world the future undoubtedly belongs to it services that can increase the value of that golden thread from \u003cONE_TEN\u003e carat to \u003cTWO_TEN\u003e carat with the power of ai mahindra said in techm s annual report for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e according to him as organisations strive to stay ahead in the digital race it services will play a pivotal role in enhancing technology by integrating ai seamlessly into the core business functions the race does not necessarily belong to the large or the most specialised the winners will be companies that are agile well prepared and can scale at speed mahindra said amid a challenging macro environment techms revenue from operations in fy24 fell \u003cTWO_PERCENT\u003e to rs \u003cFIVE_TEN_THOUSAND\u003e crore \u003cSIX_\u003e billion compared to rs \u003cFIVE_TEN_THOUSAND\u003e crore \u003cSIX_\u003e billion in fy23 in june last year the firm also appointed mohit joshi as the new ceo and md taking over from former chief cp gurnani who retired on december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e in his inaugural message to stakeholders joshi said fy25 will be the turnaround year for us marked by new investments in our key accounts and service lines we will drive the integration of our portfolio companies focus on our largest clients and prioritise cost optimisation","timestamp":"2024-06-28T18:05:00+05:30","market_timestamp":"2024-07-01T09:15:00+05:30","off_market_hours":true}