{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-merges-two-north-american-subsidiaries-liquidates-australian-unit/articleshow/111321807.cms","title":"Wipro merges two North American subsidiaries, liquidates Australian unit","description":"Wipro merged its subsidiaries Designit North America and Wipro Designit Services, effective July 1st. In a separate move, they deregistered another step-down subsidiary Attune Australia Pty Ltd on June 26.","content":"Indian IT major Wipro on Thursday announced the merger of its step-down subsidiary Designit North America, Inc., with Wipro Designit Services, Inc. The merger is completed and effective from July 1, Wipro said in a regulatory filing.The Bengaluru-headquartered firm also deregistered another step-down subsidiary Attune Australia Pty Ltd with effect from June 26, 2024.The reasons for merging the two North American subsidiaries, Wipro said, is \"to rationalise and consolidate the group structure of the company.\"While Wipro Designit Services' turnover is $48 million, Designit North America's turnover stood at $1.6 million as of March 31, 2024.The Australian subsidiary’s revenue from operations was AUD 269,554 (Australian dollars) as on March end. “The completion of the aforesaid liquidation reflected in the Commercial registry records on June 27, 2024,” it added.","cleaned_content":"indian it major wipro on thursday announced the merger of its step down subsidiary designit north america inc with wipro designit services inc the merger is completed and effective from july \u003cONE_\u003e wipro said in a regulatory filing the bengaluru headquartered firm also deregistered another step down subsidiary attune australia pty ltd with effect from june \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the reasons for merging the two north american subsidiaries wipro said is to rationalise and consolidate the group structure of the company while wipro designit services turnover is \u003cFOUR_TEN\u003e million designit north americas turnover stood at \u003cONE_\u003e million as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the australian subsidiary s revenue from operations was aud \u003cTWO_HUNDRED_THOUSAND\u003e australian dollars as on march end the completion of the aforesaid liquidation reflected in the commercial registry records on june \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e it added","timestamp":"2024-06-27T22:51:00+05:30","market_timestamp":"2024-06-28T09:15:00+05:30","off_market_hours":true}