{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-settles-insider-trading-charges-with-sebi-agrees-to-pay-rs-25-lakh-fine/articleshow/111302975.cms","title":"Infosys settles insider trading charges with Sebi, agrees to pay Rs 25 lakh fine","description":"Parekh agreed to pay Rs 25 lakh (around $30,000) for failing to have adequate controls to prevent insider trading, the Securities and Exchange Board of India said. The regulator did not provide details on this information but held Parekh responsible for what it saw as a failure in internal controls to prevent insider trading in that transaction.","content":"Infosys CEO Salil Parekh settled charges for failing to place adequate internal controls to prevent insider trading at India's no 2 IT services exporter during a 2020 contract, the country's markets regulator said on Thursday.Parekh agreed to pay Rs 25 lakhs (around $30,000) to settle the markets regulator's charge, which related to a contract for Infosys to provide U.S. financial firm Vanguard with a cloud-based record-keeping platform.Infosys publicly disclosed the deal in 2020, but the Securities and Exchange Board of India said \"certain information which was unpublished price sensitive information (UPSI) had not been considered as such by Infosys\".The regulator did not elaborate on what this information was but held Parekh accountable for what it considered a lapse in internal controls to prevent insider trading on that deal.Since then, Infosys has drafted an internal policy to identify unpublished price-sensitive information and seek approval from its board and audit committee.","cleaned_content":"infosys ceo salil parekh settled charges for failing to place adequate internal controls to prevent insider trading at indias no \u003cTWO_\u003e it services exporter during a \u003cTWO_THOUSAND\u003e contract the countrys markets regulator said on thursday parekh agreed to pay rs \u003cTWO_TEN\u003e lakhs around \u003cTHREE_TEN_THOUSAND\u003e to settle the markets regulators charge which related to a contract for infosys to provide u s financial firm vanguard with a cloud based record keeping platform infosys publicly disclosed the deal in \u003cTWO_THOUSAND\u003e but the securities and exchange board of india said certain information which was unpublished price sensitive information upsi had not been considered as such by infosys the regulator did not elaborate on what this information was but held parekh accountable for what it considered a lapse in internal controls to prevent insider trading on that deal since then infosys has drafted an internal policy to identify unpublished price sensitive information and seek approval from its board and audit committee","timestamp":"2024-06-27T09:45:00+05:30","market_timestamp":"2024-06-27T09:45:00+05:30","off_market_hours":false}