{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-to-set-up-two-delivery-centers-in-north-america/articleshow/111172791.cms","title":"HCLTech to set up two offices in North America","description":"HCLTech announced setting up two new offices in North America with delivery centers, focusing on encouraging employees to return to the office. The offices will feature HCLTech’s Customer Experience Center (CEC) showcasing AI and Cloud Native Labs. Other key locations in North America include Dallas, Seattle, Raleigh-Durham, Toronto, and Vancouver.","content":"In a bid to encourage employees to return to office, HCLTech has announced setting up of two new offices in North America expanding its footprint with delivery centers in the region, which holds the largest revenue share for the IT major.The new offices will be opened in East Brunswick in New Jersey and Santa Clara in California, HCLTech said in a statement.“The offices will offer all of the post-COVID features of modern workspaces that will encourage our people to want to work from the office. Both locations will feature HCLTech’s Customer Experience Center (CEC) showcasing the best of company’s innovations and capabilities, including our immensely popular AI and Cloud Native Labs,” said Jill Kouri, global chief marketing officer at HCLTech.With the addition of the two new offices, HCLTech now has ten offices, 26 delivery centers and seven labs across North America. The company has over 23,000 people in North America. Its other key locations in North America include Dallas, Seattle, Raleigh-Durham, Toronto, and Vancouver.“The company celebrated the office launch in New Jersey with a traditional Indian ceremony, a community service activity with employees and a grand opening party with clients and partners. The Santa Clara office will officially open in mid-August,” HCLTech said in the statement.","cleaned_content":"in a bid to encourage employees to return to office hcltech has announced setting up of two new offices in north america expanding its footprint with delivery centers in the region which holds the largest revenue share for the it major the new offices will be opened in east brunswick in new jersey and santa clara in california hcltech said in a statement the offices will offer all of the post covid features of modern workspaces that will encourage our people to want to work from the office both locations will feature hcltech s customer experience center cec showcasing the best of company s innovations and capabilities including our immensely popular ai and cloud native labs said jill kouri global chief marketing officer at hcltech with the addition of the two new offices hcltech now has ten offices \u003cTWO_TEN\u003e delivery centers and seven labs across north america the company has over \u003cTWO_TEN_THOUSAND\u003e people in north america its other key locations in north america include dallas seattle raleigh durham toronto and vancouver the company celebrated the office launch in new jersey with a traditional indian ceremony a community service activity with employees and a grand opening party with clients and partners the santa clara office will officially open in mid august hcltech said in the statement","timestamp":"2024-06-22T07:20:00+05:30","market_timestamp":"2024-06-24T09:15:00+05:30","off_market_hours":true}