{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-hunts-for-talent-from-among-women-professionals-out-on-a-career-break/articleshow/111311414.cms","title":"Infosys hunts for talent among women professionals out on a career break","description":"The women should meet two criteria, they should have work experience of at least two years before taking the break and should have had a break of six months. Shaji Mathew, group head of HR at Infosys, said the company has crafted a strategic approach to support women in managing the diverse personal and professional challenges they encounter throughout their careers.","content":"Software major Infosys has rolled out the latest edition of Restart With Infosys, an initiative to hire women professionals who are away on a career break as the company seeks to increase the proportion of women in its workforce.They should, however, meet two criteria: They should have worked for at least two years before taking the break and, should have had a break for a minimum of six months. The company has publicised positions it seeks to fill and is encouraging employees to come up with references while offering attractive rewards for each successful referral. The rewards range from Rs 10,000 to Rs 50,000 for referrals from job level three to six. Referrals at job levels 4, 5 and 6 get higher rewards of Rs 25,000, Rs 35,000 and Rs 50,000 in that order. The company is seeking to fill a wide range of jobs including automation testing, software development (azure, python and spark) and SAP consultancy.Shaji Mathew, group head of HR at Infosys, said the company has developed a thoughtful approach to address various personal and professional milestones that women navigate while pursuing a career. \"The 'Restart with Infosys' program aims to provide women professionals, who are currently on a break, with an opportunity to rejoin the corporate workforce and move their careers forward. We have hired over 500 women as part of the ‘Restart with Infosys’ program, which has components of skilling, mentoring, and live-project experiences to enhance their readiness to resume and scale their careers effectively.”It is a passive talent poll companies would be tapping that one would not see on job sites, according to Vijay Sivaram, CEO at Quess IT Staffing. “Companies would be ready to retrain them, if necessary, to align them to the present job requirement. Many women professionals would be open to return to work as most companies now have hybrid work policy unlike the pre-Covid era. The companies may also have a small cost advantage,” he added.","cleaned_content":"software major infosys has rolled out the latest edition of restart with infosys an initiative to hire women professionals who are away on a career break as the company seeks to increase the proportion of women in its workforce they should however meet two criteria they should have worked for at least two years before taking the break and should have had a break for a minimum of six months the company has publicised positions it seeks to fill and is encouraging employees to come up with references while offering attractive rewards for each successful referral the rewards range from rs \u003cONE_TEN_THOUSAND\u003e to rs \u003cFIVE_TEN_THOUSAND\u003e for referrals from job level three to six referrals at job levels \u003cFOUR_\u003e \u003cFIVE_\u003e and \u003cSIX_\u003e get higher rewards of rs \u003cTWO_TEN_THOUSAND\u003e rs \u003cTHREE_TEN_THOUSAND\u003e and rs \u003cFIVE_TEN_THOUSAND\u003e in that order the company is seeking to fill a wide range of jobs including automation testing software development azure python and spark and sap consultancy shaji mathew group head of hr at infosys said the company has developed a thoughtful approach to address various personal and professional milestones that women navigate while pursuing a career the restart with infosys program aims to provide women professionals who are currently on a break with an opportunity to rejoin the corporate workforce and move their careers forward we have hired over \u003cFIVE_HUNDRED\u003e women as part of the restart with infosys program which has components of skilling mentoring and live project experiences to enhance their readiness to resume and scale their careers effectively it is a passive talent poll companies would be tapping that one would not see on job sites according to vijay sivaram ceo at quess it staffing companies would be ready to retrain them if necessary to align them to the present job requirement many women professionals would be open to return to work as most companies now have hybrid work policy unlike the pre covid era the companies may also have a small cost advantage he added","timestamp":"2024-06-27T15:35:00+05:30","market_timestamp":"2024-06-28T09:15:00+05:30","off_market_hours":true}