{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-signs-five-year-partnership-with-sydney-marathon/articleshow/111432223.cms","title":"TCS signs five-year partnership with Sydney Marathon","description":"TCS did not disclose the financials of the partnership. This is the latest marathon to be added to TCS's portfolio. The TCS Sydney Marathon is part of the larger running events including four World Marathon Major races in New York, London, Chicago and Boston, alongside marathons in Amsterdam, Mumbai, Singapore and Toronto.","content":"Tata Consultancy Services (TCS), India’s largest IT services provider, has added another marathon to its portfolio with the announcement of a five-year title partnership with the Sydney Marathon, Australia’s largest marathon.“In a five-year partnership, TCS will aid the newly rebranded TCS Sydney Marathon to adopt advanced technologies, become more sustainable and support its candidature as an Abbott World Marathon Major,” the Tata subsidiary said in a statement.The financials of the partnership were not undisclosed.The TCS Sydney Marathon is part of the larger running events including four World Marathon Major races in New York, London, Chicago and Boston, alongside marathons in Amsterdam, Mumbai, Singapore and Toronto. In total, TCS now sponsors 14 global running events with participation from over 600,000 runners.The Sydney Marathon, first held on April 30, 2000 as The Host City Marathon, was a test event for the Sydney 2000 Olympic Games. Since then, it is being held in September every year, attracting over 40,000 runners from more than 100 countries.","cleaned_content":"tata consultancy services tcs india s largest it services provider has added another marathon to its portfolio with the announcement of a five year title partnership with the sydney marathon australia s largest marathon in a five year partnership tcs will aid the newly rebranded tcs sydney marathon to adopt advanced technologies become more sustainable and support its candidature as an abbott world marathon major the tata subsidiary said in a statement the financials of the partnership were not undisclosed the tcs sydney marathon is part of the larger running events including four world marathon major races in new york london chicago and boston alongside marathons in amsterdam mumbai singapore and toronto in total tcs now sponsors \u003cONE_TEN\u003e global running events with participation from over \u003cSIX_HUNDRED_THOUSAND\u003e runners the sydney marathon first held on april \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as the host city marathon was a test event for the sydney \u003cTWO_THOUSAND\u003e olympic games since then it is being held in september every year attracting over \u003cFOUR_TEN_THOUSAND\u003e runners from more than \u003cONE_HUNDRED\u003e countries","timestamp":"2024-07-02T16:32:00+05:30","market_timestamp":"2024-07-03T09:15:00+05:30","off_market_hours":true}