{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-q1-net-profit-up-6-8-qoq-at-rs-4257crore-beats-estimates/articleshow/111695530.cms","title":"HCLTech Q1 net profit up 6.8% at Rs 4,257 crore; beats estimates","description":"HCLTech's profit rose 6.8% to Rs 4,257 crore, driven by $70 million non-core income. EBIT, revenue declined. TCS earnings boosted stocks. CEO Vijayakumar noted Q2 State Street impact, steady FY25 guidance. Dividend declared. Headcount fell by 8,080, Q3 margins to improve. $1.96 billion bookings, 200 GenAI concepts. CFO Prateek Aggarwal cited robust cash flow. Shares closed at Rs 1560.40.","content":"HCLTech, India’s third largest software exporter, reported a 6.8% sequential growth in net profit at Rs 4,257 crore, beating ET’s analyst poll estimates of Rs 3,745 crore. A fatter bottom-line came largely on the back of a spike in non-core income in the June quarter otherwise marked by sluggish demand.Revenues and margins declined sequentially. The company’s EBIT came at Rs. 4,795 crore, down 4.4% QoQ \u0026 up 7.5% YoY. Following the Tata Consultancy Services (TCS) earnings Thursday, several technology stocks surged to lifetime highs Friday, and were at the forefront of the stellar showing of the broader stock indices. TCS led the pack of five technology companies, including HCLTech, that were the top five Nifty gainers.HCLTech’s consolidated revenue stood at Rs 28,057 crore, rising 6.7% from a year earlier and down 1.6% sequentially. The Noida-based firm attributed it to a “seasonally weak quarter” and just like its larger peer Tata Consultancy Services (TCS), the company signalled that discretionary spend is unlikely to be very different from the last fiscal.","cleaned_content":"hcltech india s third largest software exporter reported a \u003cSIX_PERCENT\u003e sequential growth in net profit at rs \u003cFOUR_THOUSAND\u003e crore beating et s analyst poll estimates of rs \u003cTHREE_THOUSAND\u003e crore a fatter bottom line came largely on the back of a spike in non core income in the june quarter otherwise marked by sluggish demand revenues and margins declined sequentially the company s ebit came at rs \u003cFOUR_THOUSAND\u003e crore down \u003cFOUR_PERCENT\u003e qoq up \u003cSEVEN_PERCENT\u003e yoy following the tata consultancy services tcs earnings thursday several technology stocks surged to lifetime highs friday and were at the forefront of the stellar showing of the broader stock indices tcs led the pack of five technology companies including hcltech that were the top five nifty gainers hcltech s consolidated revenue stood at rs \u003cTWO_TEN_THOUSAND\u003e crore rising \u003cSIX_PERCENT\u003e from a year earlier and down \u003cONE_PERCENT\u003e sequentially the noida based firm attributed it to a seasonally weak quarter and just like its larger peer tata consultancy services tcs the company signalled that discretionary spend is unlikely to be very different from the last fiscal","timestamp":"2024-07-13T06:01:00+05:30","market_timestamp":"2024-07-15T09:15:00+05:30","off_market_hours":true}