{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-q1-profit-rises-8-7-wage-hikes-demand-slump-drag-sequential-numbers/articleshow/111668616.cms","title":"TCS Q1 profit rises 8.7%; wage hikes, demand slump drag sequential numbers","description":"TCS's June quarter net profit decreased 3.16% to Rs 12,040 crore due to wage hikes for its 600,000-plus workforce; net profit increased 8.7% YoY. Revenue rose 5.4% to Rs 62,613 crore. BSNL deal drove 61.8% India growth. The deal pipeline is $8.3 billion, AI projects at $1.5 billion. Operating margin is 24.7%. Interim dividend Rs 10 per share.","content":"India’s largest software services firm, Tata Consultancy Services (TCS), reported a sequential 3.16% drop in net profit in the June quarter due to the impact of wage hikes for many of its 600,000-plus workforce and an unabated slowdown in demand.TCS posted a net profit of Rs 12,040 crore, below analyst expectations but 8.7% up from the year earlier. It reported revenue of Rs 62,613 crore, up 5.4% from the year earlier and 2.25% sequentially. The company didn’t signal any significant uptick in technology services demand, which has hit an all-time low due to macroeconomic uncertainties and geopolitical strife that’s impacted the key markets of the US, the UK and Europe. Much of the incremental growth came from the Rs 15,000 crore deal with state-owned telco Bharat Sanchar Nigam Ltd (BSNL) signed last year that led to its India business showing a jump of 61.8% from the year earlier.While chief executive K Krithivasan continues to believe that FY25 will be better than FY24, it is “too early” to say whether the growth momentum is sustainable, he said.“The market conditions continue to remain the same as it was last quarter. There is nothing new to add in terms of market sentiment,” Krithivasan said.TCS has a deal pipeline of $8.3 billion although some of these are taking time to be finally sealed.","cleaned_content":"india s largest software services firm tata consultancy services tcs reported a sequential \u003cTHREE_PERCENT\u003e drop in net profit in the june quarter due to the impact of wage hikes for many of its \u003cSIX_HUNDRED_THOUSAND\u003e plus workforce and an unabated slowdown in demand tcs posted a net profit of rs \u003cONE_TEN_THOUSAND\u003e crore below analyst expectations but \u003cEIGHT_PERCENT\u003e up from the year earlier it reported revenue of rs \u003cSIX_TEN_THOUSAND\u003e crore up \u003cFIVE_PERCENT\u003e from the year earlier and \u003cTWO_PERCENT\u003e sequentially the company didn t signal any significant uptick in technology services demand which has hit an all time low due to macroeconomic uncertainties and geopolitical strife that s impacted the key markets of the us the uk and europe much of the incremental growth came from the rs \u003cONE_TEN_THOUSAND\u003e crore deal with state owned telco bharat sanchar nigam ltd bsnl signed last year that led to its india business showing a jump of \u003cSIX_TEN_PERCENT\u003e from the year earlier while chief executive k krithivasan continues to believe that fy25 will be better than fy24 it is too early to say whether the growth momentum is sustainable he said the market conditions continue to remain the same as it was last quarter there is nothing new to add in terms of market sentiment krithivasan said tcs has a deal pipeline of \u003cEIGHT_\u003e billion although some of these are taking time to be finally sealed","timestamp":"2024-07-12T08:58:00+05:30","market_timestamp":"2024-07-12T09:15:00+05:30","off_market_hours":true}