{"url":"https://economictimes.indiatimes.com/tech/information-tech/cg-power-appoints-amar-kaul-as-managing-director-ceo/articleshow/111585142.cms","title":"CG Power appoints Amar Kaul as managing director \u0026 CEO","description":"Amar Kaul joined CG Power on July 9, 2024 initially as Managing Director \u0026 CEO – designate and will take over as the managing director \u0026 CEO effective July 25, 2024. He was in the executive leadership position leading EMEIA (Europe, Middle East, India and Africa) region for compression systems \u0026 services in Ingersoll Rand.","content":"CG Power on Monday said that the company's Board of Directors has selected Amar Kaul as next Managing Director \u0026 CEO for a period of five years beginning July 25, 2024. CG Power has recently got approval from the ministry of electronics and IT to set up a chip assembly plant in Gujarat. \"The Board of Directors of CG Power has been engaged for the last several months in finding a successor for the incumbent Managing Director N Srinivasan,\" the company said in a statement. \"N Srinivasan has built a very high-quality senior management team and who will provide continuity to the management team and thereby support both the smooth transition of leadership and ensuring continuity in business momentum.\"The company said Srinivasan has led the company since the date of takeover by Tube Investments of India on November 26, 2020. Kaul joins the company on July 9, 2024 initially as managing director \u0026 CEO – designate and will take over as the managing director \u0026 CEO effective July 25, 2024. The company said Vellayan Subbiah, as the Chairman of CG Power, will continue to provide strategic guidance and oversight over the governance process.","cleaned_content":"cg power on monday said that the companys board of directors has selected amar kaul as next managing director ceo for a period of five years beginning july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e cg power has recently got approval from the ministry of electronics and it to set up a chip assembly plant in gujarat the board of directors of cg power has been engaged for the last several months in finding a successor for the incumbent managing director n srinivasan the company said in a statement n srinivasan has built a very high quality senior management team and who will provide continuity to the management team and thereby support both the smooth transition of leadership and ensuring continuity in business momentum the company said srinivasan has led the company since the date of takeover by tube investments of india on november \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e kaul joins the company on july \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e initially as managing director ceo designate and will take over as the managing director ceo effective july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company said vellayan subbiah as the chairman of cg power will continue to provide strategic guidance and oversight over the governance process","timestamp":"2024-07-08T21:05:00+05:30","market_timestamp":"2024-07-09T09:15:00+05:30","off_market_hours":true}