{"url":"https://economictimes.indiatimes.com/tech/information-tech/accenture-acquires-excelmax-technologies-to-expand-semiconductor-design-services/articleshow/111583991.cms","title":"Accenture acquires Excelmax Technologies to expand semiconductor design services","description":"Accenture acquired semiconductor firm Excelmax, adding 450 professionals and expanding into AI, automotive, and consumer devices. Following the XtremeEDA acquisition and $2.3 billion in investments in Q3 FY24, CEO Patil cited new innovation opportunities. Group Chief Narain highlighted generative AI. Excelmax excels in design-to-layout execution, crucial for Accenture's comprehensive silicon solutions. Financial terms remain undisclosed.","content":"Global IT services firm Accenture acquired Bengaluru-based Excelmax Technologies, a semiconductor design services firm, to bolster its growing silicon design and engineering capabilities. Financial details of the transaction were not disclosed.“Excelmax provides custom silicon solutions used in consumer devices, data centres, artificial intelligence (AI) and computational platforms that enable edge AI deployments, to clients in the automotive, telecommunications and high-tech industries,” Accenture said in a statement on Monday.Mahesh Zurale, global lead - Advanced Technology Centers Global Network, Accenture said that the acquisition will add about 450 highly skilled silicon professionals to the company's Advanced Technology Centers in India. The additional workforce will be in key areas of emulation, automotive, physical design, analog, logic design and verification, expanding its ability to help global clients accelerate edge computing innovation. The company currently employs around 750,200 people worldwide.\"With the global demand for silicon solutions on the rise, India is becoming a hotbed for chip design. Growing our skilled talent in the country across physical and RTL design, verification, emulation, and firmware engineering will help us expand our capabilities in the silicon design space and accelerate innovation for our world-wide clients,\" Zurale said.","cleaned_content":"global it services firm accenture acquired bengaluru based excelmax technologies a semiconductor design services firm to bolster its growing silicon design and engineering capabilities financial details of the transaction were not disclosed excelmax provides custom silicon solutions used in consumer devices data centres artificial intelligence ai and computational platforms that enable edge ai deployments to clients in the automotive telecommunications and high tech industries accenture said in a statement on monday mahesh zurale global lead advanced technology centers global network accenture said that the acquisition will add about \u003cFOUR_HUNDRED\u003e highly skilled silicon professionals to the companys advanced technology centers in india the additional workforce will be in key areas of emulation automotive physical design analog logic design and verification expanding its ability to help global clients accelerate edge computing innovation the company currently employs around \u003cSEVEN_HUNDRED_THOUSAND\u003e people worldwide with the global demand for silicon solutions on the rise india is becoming a hotbed for chip design growing our skilled talent in the country across physical and rtl design verification emulation and firmware engineering will help us expand our capabilities in the silicon design space and accelerate innovation for our world wide clients zurale said","timestamp":"2024-07-09T16:03:00+05:30","market_timestamp":"2024-07-10T09:15:00+05:30","off_market_hours":true}