{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-adds-8080-employees-to-headcount-in-q1fy25/articleshow/111691823.cms","title":"HCLTech headcount dips by 8,080 in Q1FY25","description":"HCLTech experiences a notable increase in employee count by 8,080 for the quarter ending June, reaching a total of 219,401 employees. Meanwhile, TCS adds 5,452 employees, reversing headcount reduction trend. HCLTech reports a 20.4% YoY increase in net profit for Q1FY25.","content":"In another reversal of headcount trend, HCLTech, India’s third largest IT services player, witnessed a substantial drop in its employee count by 8,080 for the three-month period ending June. The headcount had increased in the previous quarter by 2,725. The Noida-headquartered IT major’s total headcount as on June end stood at 219,401. The number compares with the previous quarter’s total employees at 227,481. A year ago in April to June, the number was at 223,438. In contrast, on Thursday, its bigger peer and country’s largest IT major Tata Consultancy Services (TCS) saw net addition of 5,452 employees for the April to June quarter ending its total employee count at 606,998. In the fourth quarter of FY24 ended March, HCLTech was the only large player to buck the industry’s employee reduction trends with a headcount increase of 2,725 employees for the final quarter of FY24.For the full year in FY24, top-tier IT majors TCS, Infosys, Wipro and Tech Mahindra announced a cumulative headcount drop of 70,704 employees. In Q1FY25, HCLTech added lower freshers at 1,078 as compared to 3,096 in the previous quarter. ","cleaned_content":"in another reversal of headcount trend hcltech india s third largest it services player witnessed a substantial drop in its employee count by \u003cEIGHT_THOUSAND\u003e for the three month period ending june the headcount had increased in the previous quarter by \u003cTWO_THOUSAND\u003e the noida headquartered it major s total headcount as on june end stood at \u003cTWO_HUNDRED_THOUSAND\u003e the number compares with the previous quarter s total employees at \u003cTWO_HUNDRED_THOUSAND\u003e a year ago in april to june the number was at \u003cTWO_HUNDRED_THOUSAND\u003e in contrast on thursday its bigger peer and country s largest it major tata consultancy services tcs saw net addition of \u003cFIVE_THOUSAND\u003e employees for the april to june quarter ending its total employee count at \u003cSIX_HUNDRED_THOUSAND\u003e in the fourth quarter of fy24 ended march hcltech was the only large player to buck the industry s employee reduction trends with a headcount increase of \u003cTWO_THOUSAND\u003e employees for the final quarter of fy24 for the full year in fy24 top tier it majors tcs infosys wipro and tech mahindra announced a cumulative headcount drop of \u003cSEVEN_TEN_THOUSAND\u003e employees in q1fy25 hcltech added lower freshers at \u003cONE_THOUSAND\u003e as compared to \u003cTHREE_THOUSAND\u003e in the previous quarter","timestamp":"2024-07-13T12:36:00+05:30","market_timestamp":"2024-07-15T09:15:00+05:30","off_market_hours":true}