{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-infy-power-sensex-100-points-higher-nifty-above-24350/articleshow/111678763.cms","title":"TCS, Infy power Sensex 300 points higher; Nifty above 24,400","description":"Indian markets rose Friday, led by TCS's strong June quarter. Sensex climbed 281 points, Nifty50 up 93 points. Stocks like TCS, Infosys, and Adani Ports surged. Maruti fell. US inflation data raised September Fed rate cut chances, noted by CME FedWatch. RBI's Das predicted 5% retail inflation. Powell's testimony hinted at possible rate cuts.","content":"Indian benchmark equities hit a fresh all-time high on Friday, driven by IT stocks after heavyweight Tata Consultancy Services (TCS) surpassed revenue estimates for the June quarter.The BSE Sensex was trading over 900 points higher at 80,797. The Nifty50 was up 236 points, surpassing the 24,550 level for the first time.Shares of TCS, India's top IT services company, rose 4% after the firm reported a quarterly revenue beat on Thursday, despite warning about demand uncertainty. Tech Mahindra, Infosys, and HCL Tech also advanced 3% each.Other top Sensex gainers included Axis Bank, IndusInd Bank, M\u0026M, L\u0026T, Tata Steel, Adani Ports, and SBI. Meanwhile, Maruti, Asian Paints, Sun Pharma, NTPC, and ITC were trading with cuts.Oil India rose7% after Morgan Stanley raised the target price to a street-high of Rs 663, an implied upside of 20% over its last close, estimating the company's earnings will double over five years.","cleaned_content":"indian benchmark equities hit a fresh all time high on friday driven by it stocks after heavyweight tata consultancy services tcs surpassed revenue estimates for the june quarter the bse sensex was trading over \u003cNINE_HUNDRED\u003e points higher at \u003cEIGHT_TEN_THOUSAND\u003e the nifty50 was up \u003cTWO_HUNDRED\u003e points surpassing the \u003cTWO_TEN_THOUSAND\u003e level for the first time shares of tcs indias top it services company rose \u003cFOUR_PERCENT\u003e after the firm reported a quarterly revenue beat on thursday despite warning about demand uncertainty tech mahindra infosys and hcl tech also advanced \u003cTHREE_PERCENT\u003e each other top sensex gainers included axis bank indusind bank m m l t tata steel adani ports and sbi meanwhile maruti asian paints sun pharma ntpc and itc were trading with cuts oil india rose7% after morgan stanley raised the target price to a street high of rs \u003cSIX_HUNDRED\u003e an implied upside of \u003cTWO_TEN_PERCENT\u003e over its last close estimating the companys earnings will double over five years","timestamp":"2024-07-12T11:12:00+05:30","market_timestamp":"2024-07-12T11:12:00+05:30","off_market_hours":false}