{"url":"https://economictimes.indiatimes.com/tech/information-tech/tata-elxsi-inaugurates-mobility-innovation-centre-in-bengaluru/articleshow/111663114.cms","title":"Tata Elxsi inaugurates mobility innovation centre in Bengaluru","description":"Tata Elxsi and Emerson's TENMIC in Bengaluru focuses on automotive innovation, emphasizing electrical/electronic architecture, electrification, and connectivity. Shaju S mentions its connection to India's R\u0026D ecosystem and global OEMs. The centre advances software-defined vehicles, EV systems, and autonomous driving. Shitendra Bhattacharya from Emerson highlights comprehensive automated solutions and testing in India \u0026 ASEAN.","content":"Technology services provider for the automotive and transportation industry Tata Elxsi has inaugurated a mobility innovation centre in Bengaluru. Set up in collaboration with global automation firm Emerson, the Tata Elxsi + NI Mobility Innovation Centre (TENMIC), aims to accelerate automotive innovation, software solutions, and global automotive expertise, a company statement said.  TENMIC brings together advanced technologies and systems from Emerson's Test \u0026 Measurement business (formerly NI), combined with Tata Elxsi's deep automotive engineering, data analytics, and digitalisation expertise and solutions, the company said.  \"The shift in vehicle E/E (electrical/electronic) architecture, electrification, and connectivity is driving the need for advanced software development and testing capabilities.  \"Bengaluru offers the combined global expertise of the two companies to the entire world, while enabling proximity to the thriving R\u0026D ecosystem of global OEMs, suppliers, and technology companies in India,\" said Shaju S, Vice President and Head of Transportation Business Unit at Tata Elxsi.  Shaju further added that \"our partnership with Emerson aims to drive innovation, design, and development, leveraging global expertise to create immense value for our clients.\" ","cleaned_content":"technology services provider for the automotive and transportation industry tata elxsi has inaugurated a mobility innovation centre in bengaluru set up in collaboration with global automation firm emerson the tata elxsi ni mobility innovation centre tenmic aims to accelerate automotive innovation software solutions and global automotive expertise a company statement said tenmic brings together advanced technologies and systems from emersons test measurement business formerly ni combined with tata elxsis deep automotive engineering data analytics and digitalisation expertise and solutions the company said the shift in vehicle e e electrical electronic architecture electrification and connectivity is driving the need for advanced software development and testing capabilities bengaluru offers the combined global expertise of the two companies to the entire world while enabling proximity to the thriving r d ecosystem of global oems suppliers and technology companies in india said shaju s vice president and head of transportation business unit at tata elxsi shaju further added that our partnership with emerson aims to drive innovation design and development leveraging global expertise to create immense value for our clients","timestamp":"2024-07-11T17:25:00+05:30","market_timestamp":"2024-07-12T09:15:00+05:30","off_market_hours":true}