{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-reverses-headcount-trend-adds-5452-employees-in-q1-fy25/articleshow/111661482.cms","title":"TCS reverses headcount trend, adds 5,452 employees in Q1 FY25","description":"TCS's Q1 FY25 net employee count grew by 5,452 to 606,998, as per stock exchanges. Post a 13,249 reduction in FY24 (first annual drop in 19 years) and a Q4FY24 staff cut. Consolidated net profit declined 3.16% QoQ to Rs 12,040 crore but increased YoY from Rs 11,074 crore. March and previous quarter noted 12.1% attrition.","content":"After a drop of three consecutive quarters, the net employee count of India’s largest IT services giant Tata Consultancy Services (TCS) grew by 5,452 during the first quarter of the current fiscal year 2025.The total headcount as on June end stood at 606,998, up from 601,546 employees as on March end, TCS filing on the stock exchanges showed.During FY24 results announcement, for the first time in 19 years, TCS had reported an annual drop in its employee base. For the full fiscal year ending March, the Tata subsidiary had reduced its employees by 13,249 from a year ago. In January to March Q4FY24, its employees were reduced by 1,759 from the third quarter, marking the third consecutive quarterly decline in its headcount.Its attrition further improved to 12.1% from 12.5% in the previous quarter ending March.TCS reported a 3.16% drop quarter-on-quarter and an increase of 8.7% year-on-year in consolidated net profit at Rs 12,040 crore in the June quarter of fiscal 2025. Its net profit in the preceding quarter was at Rs 12,434 crore and Rs 11,074 crore in the year-ago quarter.","cleaned_content":"after a drop of three consecutive quarters the net employee count of india s largest it services giant tata consultancy services tcs grew by \u003cFIVE_THOUSAND\u003e during the first quarter of the current fiscal year \u003cTWO_THOUSAND\u003e the total headcount as on june end stood at \u003cSIX_HUNDRED_THOUSAND\u003e up from \u003cSIX_HUNDRED_THOUSAND\u003e employees as on march end tcs filing on the stock exchanges showed during fy24 results announcement for the first time in \u003cONE_TEN\u003e years tcs had reported an annual drop in its employee base for the full fiscal year ending march the tata subsidiary had reduced its employees by \u003cONE_TEN_THOUSAND\u003e from a year ago in january to march q4fy24 its employees were reduced by \u003cONE_THOUSAND\u003e from the third quarter marking the third consecutive quarterly decline in its headcount its attrition further improved to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in the previous quarter ending march tcs reported a \u003cTHREE_PERCENT\u003e drop quarter on quarter and an increase of \u003cEIGHT_PERCENT\u003e year on year in consolidated net profit at rs \u003cONE_TEN_THOUSAND\u003e crore in the june quarter of fiscal \u003cTWO_THOUSAND\u003e its net profit in the preceding quarter was at rs \u003cONE_TEN_THOUSAND\u003e crore and rs \u003cONE_TEN_THOUSAND\u003e crore in the year ago quarter","timestamp":"2024-07-11T20:33:00+05:30","market_timestamp":"2024-07-12T09:15:00+05:30","off_market_hours":true}