{"url":"https://economictimes.indiatimes.com/tech/information-tech/ltimindtree-q1-net-profit-up-3-1-at-rs-1135-crore/articleshow/111814735.cms","title":"LTIMindtree Q1 net profit up 3.1% at Rs 1,135 crore","description":"LTIMindtree's Q1 FY25 results show a 3.1% net profit growth but missed estimates.  North America revenue contribution grew to 75.1% in the first quarter of this fiscal – highest since the official merger between the erstwhile IT firms, LTI and Mindtree. On a sequential basis, revenue grew 2.8%.","content":"LTIMindtree’s net profit grew 3.1% sequentially to Rs 1,135 crore, but missed ET’s estimate at Rs 1,150 crore. Lower margins compared to corresponding quarter of last fiscal also impacted its net profit which was 1.5% down on a Y-o-Y basis.Spotting a rare growth opportunities in North American business, LTIMindtree posted a 5.1% year-on-year (Y-o-Y) increase in its revenue at Rs 9,143 crore for the first quarter of FY25. It exceeded ET’s estimate at Rs 9,080 crore. North America revenue contribution grew to 75.1% in the first quarter of this fiscal – highest since the official merger between the erstwhile IT firms, LTI and Mindtree. On a sequential basis, revenue grew 2.8%.Margins at the sixth largest Indian IT service firm grew by just 30 bps (100 bps is 1%) to 15% but still remains lower from a Y-o-Y perspective. In Q1 of FY24, the firm’s margins were at 16.7%. The company added that some of the operating efficiency that led margin improvement has also been offset by higher travel related costs vis-à-vis last quarter.Bucking trend, LTIMindtree added a little above 280 employees to its headcount in the just concluded quarter. The company also said that wage cycle review for employees will be done in Q3 of this fiscal.Largest vertical, Banking, Financial Services and Insurance grew by 2.9% Q-o-Q. Similarly, the second and third largest vertical – Technology, Media \u0026 Communications and Manufacturing \u0026 Resources also grew sequentially by 7.9% and 1.8%, respectively.","cleaned_content":"ltimindtree s net profit grew \u003cTHREE_PERCENT\u003e sequentially to rs \u003cONE_THOUSAND\u003e crore but missed et s estimate at rs \u003cONE_THOUSAND\u003e crore lower margins compared to corresponding quarter of last fiscal also impacted its net profit which was \u003cONE_PERCENT\u003e down on a y o y basis spotting a rare growth opportunities in north american business ltimindtree posted a \u003cFIVE_PERCENT\u003e year on year y o y increase in its revenue at rs \u003cNINE_THOUSAND\u003e crore for the first quarter of fy25 it exceeded et s estimate at rs \u003cNINE_THOUSAND\u003e crore north america revenue contribution grew to \u003cSEVEN_TEN_PERCENT\u003e in the first quarter of this fiscal highest since the official merger between the erstwhile it firms lti and mindtree on a sequential basis revenue grew \u003cTWO_PERCENT\u003e margins at the sixth largest indian it service firm grew by just \u003cTHREE_TEN\u003e bps \u003cONE_HUNDRED\u003e bps is \u003cONE_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e but still remains lower from a y o y perspective in q1 of fy24 the firm s margins were at \u003cONE_TEN_PERCENT\u003e the company added that some of the operating efficiency that led margin improvement has also been offset by higher travel related costs vis vis last quarter bucking trend ltimindtree added a little above \u003cTWO_HUNDRED\u003e employees to its headcount in the just concluded quarter the company also said that wage cycle review for employees will be done in q3 of this fiscal largest vertical banking financial services and insurance grew by \u003cTWO_PERCENT\u003e q o q similarly the second and third largest vertical technology media communications and manufacturing resources also grew sequentially by \u003cSEVEN_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively","timestamp":"2024-07-18T06:01:00+05:30","market_timestamp":"2024-07-18T09:15:00+05:30","off_market_hours":true}