{"url":"https://economictimes.indiatimes.com/tech/information-tech/zensar-technologies-to-buy-us-firm-bridgeview-life-sciences/articleshow/111814825.cms","title":"Zensar Technologies to buy US firm BridgeView Life Sciences","description":"Pune-based Zensar Technologies said in a statement, “This strategic move strengthens Zensar's Healthcare and Life Sciences (HLS) vertical and expands its pharma commercial and product launch expertise.\" The company is part of the $4.8 billion conglomerate RPG Group, has a total services revenue at $591.3 million as on FY24 with the US contributing to 67.2% of the revenue share.","content":"Zensar Technologies, has agreed to acquire a 100% membership interest in three-year old US-based BridgeView Life Sciences, through its wholly owned subsidiary Zensar Technologies Inc, USA, for a total consideration of $25 million.Under the terms, Zensar said will make an aggregate upfront payment of $14.0 million subject to customary adjustments for working capital, debt and cash on closing and additional payment upto $11.0 million by 31 December, 2027 contingent on achievement of performance and employment continuity thresholds.“This strategic move strengthens Zensar's Healthcare and Life Sciences (HLS) vertical and expands its pharma commercial and product launch expertise. The acquisition positions Zensar to offer a more comprehensive suite of solutions to pharmaceutical, biotechnology, and medical device companies,” Zensar said in a statement.Pune-based Zensar Technologies, part of the $4.8 billion conglomerate RPG Group, has a total services revenue at $591.3 million as on FY24 with the US contributing to 67.2% of the revenue share. In FY24, its HLS vertical’s share had declined to 9.6% from 10% in FY23. For the fourth quarter ending March, the HLS vertical had degrown by 6.4%.“BridgeView Life Sciences brings a team of seasoned professionals with deep life sciences knowledge and a successful track record. This aligns perfectly with our vision to be a leader in the HLS space. BridgeView's expertise in biopharma cloud CRM, information management, analytics, and program management combined with their established client base will significantly enhance our HLS offerings and accelerate our go‐to‐market strategy,” said Manish Tandon, CEO and managing director of Zensar Technologies.","cleaned_content":"zensar technologies has agreed to acquire a \u003cONE_HUNDRED_PERCENT\u003e membership interest in three year old us based bridgeview life sciences through its wholly owned subsidiary zensar technologies inc usa for a total consideration of \u003cTWO_TEN\u003e million under the terms zensar said will make an aggregate upfront payment of \u003cONE_TEN\u003e million subject to customary adjustments for working capital debt and cash on closing and additional payment upto \u003cONE_TEN\u003e million by \u003cTHREE_TEN\u003e december \u003cTWO_THOUSAND\u003e contingent on achievement of performance and employment continuity thresholds this strategic move strengthens zensars healthcare and life sciences hls vertical and expands its pharma commercial and product launch expertise the acquisition positions zensar to offer a more comprehensive suite of solutions to pharmaceutical biotechnology and medical device companies zensar said in a statement pune based zensar technologies part of the \u003cFOUR_\u003e billion conglomerate rpg group has a total services revenue at \u003cFIVE_HUNDRED\u003e million as on fy24 with the us contributing to \u003cSIX_TEN_PERCENT\u003e of the revenue share in fy24 its hls vertical s share had declined to \u003cNINE_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in fy23 for the fourth quarter ending march the hls vertical had degrown by \u003cSIX_PERCENT\u003e bridgeview life sciences brings a team of seasoned professionals with deep life sciences knowledge and a successful track record this aligns perfectly with our vision to be a leader in the hls space bridgeviews expertise in biopharma cloud crm information management analytics and program management combined with their established client base will significantly enhance our hls offerings and accelerate our go to market strategy said manish tandon ceo and managing director of zensar technologies","timestamp":"2024-07-17T21:01:00+05:30","market_timestamp":"2024-07-18T09:15:00+05:30","off_market_hours":true}