{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-has-bred-many-ceos-who-have-left-to-build-organisations-premji/articleshow/111829322.cms","title":"Wipro has bred many CEOs who have left to build organisations: Rishad Premji","description":"Rishad A. Premji, Wipro's chairman speaking to shareholders in the virtual meeting said,  “We pride ourselves that we have been an entrepreneurial company through our history. We have bred many many CEOs who have gone out to build organisations.\" He added that the company believes in empowering young people and giving them opportunities as well.","content":"Wipro has bred many CEOs who have gone out to build organisations and it prides itself for being an entrepreneurial company, chairman Rishad A Premji said at the IT major’s annual general meeting Thursday, responding to shareholders’ questions about high churn at its leadership level.“The reality is, sometimes people have opportunities that give them a bigger leap in their career. So, people leave for those opportunities,” Premji said at Wipro’s 78th AGM, held virtually.“We empower people when they are young, we give opportunities to grow when they are young, and we think we have created enough opportunities to be highly decentralised and highly empowered leaders joining their businesses,” he said, adding: “Entrepreneurial spirit is the secret sauce of Wipro and that continues.”Joining ranks, independent director Deepak Satwalekar said the leadership and strategic processes are done not just at the board level but through various board committees.“One of the more important areas we focus, and cover, is succession planning. We are happy to say this year, the processes have gone smoothly because we have had a smooth transition at the CEO and the CFO level. The other focus is on which lines of businesses, which geographies in the world is what we would look at. All of this is keeping in mind the risks involved in all of these areas. The risk factors are taken in detail,” he said.","cleaned_content":"wipro has bred many ceos who have gone out to build organisations and it prides itself for being an entrepreneurial company chairman rishad a premji said at the it major s annual general meeting thursday responding to shareholders questions about high churn at its leadership level the reality is sometimes people have opportunities that give them a bigger leap in their career so people leave for those opportunities premji said at wipro s \u003cSEVEN_TEN\u003e th agm held virtually we empower people when they are young we give opportunities to grow when they are young and we think we have created enough opportunities to be highly decentralised and highly empowered leaders joining their businesses he said adding entrepreneurial spirit is the secret sauce of wipro and that continues joining ranks independent director deepak satwalekar said the leadership and strategic processes are done not just at the board level but through various board committees one of the more important areas we focus and cover is succession planning we are happy to say this year the processes have gone smoothly because we have had a smooth transition at the ceo and the cfo level the other focus is on which lines of businesses which geographies in the world is what we would look at all of this is keeping in mind the risks involved in all of these areas the risk factors are taken in detail he said","timestamp":"2024-07-18T23:00:00+05:30","market_timestamp":"2024-07-19T09:15:00+05:30","off_market_hours":true}