{"url":"https://economictimes.indiatimes.com/tech/information-tech/india-could-be-a-credible-third-pillar-of-growth-after-north-america-and-uk-tcs-ceo-k-krithivasan/articleshow/111733958.cms","title":"India can be third pillar of growth with US, UK: TCS CEO K Krithivasan","description":"Tata Consultancy Services CEO emphasizes the importance of emerging markets like India for future growth. Discusses revenue trends, technology spends post-US elections, and interest rate cuts. Highlights deepening engagement with Tata Group firms and employee work from office policies.","content":"Emerging markets like India will be very important for the future growth of Tata Consultancy Services and not operating in these markets will be a lost opportunity, chief executive officer K Krithivasan said. India’s largest software exporter, which reported better than expected revenue growth in the first quarter of this fiscal, is expecting greater clarity on technology spends once the US completes its presidential elections in November and the much-anticipated interest rate cuts by its Federal Reserve kicks in by year end. In an interview with Sameer Ranjan Bakshi and Surabhi Agarwal, the 59-year-old CEO pointed to his company’s deepening engagement with other Tata Group firms. The company recently inked a $ 1 billion partnership with Tata subsidiary - JLR (Jaguar Land Rover). Edited excerptsThere has been criticism over the BSNL deal having contributed much of the incremental growth for TCS in the just concluded quarter?I don't know what is wrong in doing priced programs in India ( where) we are also delivering margins. India is a good market, and we must be present here as it is one of the few emerging markets that is growing. Future growth will come from emerging markets and if companies like ours don’t invest ( here) it will be a huge, missed opportunity.How do you see the macro environment and what does FY 25 look like?","cleaned_content":"emerging markets like india will be very important for the future growth of tata consultancy services and not operating in these markets will be a lost opportunity chief executive officer k krithivasan said india s largest software exporter which reported better than expected revenue growth in the first quarter of this fiscal is expecting greater clarity on technology spends once the us completes its presidential elections in november and the much anticipated interest rate cuts by its federal reserve kicks in by year end in an interview with sameer ranjan bakshi and surabhi agarwal the \u003cFIVE_TEN\u003e year old ceo pointed to his company s deepening engagement with other tata group firms the company recently inked a \u003cONE_\u003e billion partnership with tata subsidiary jlr jaguar land rover edited excerptsthere has been criticism over the bsnl deal having contributed much of the incremental growth for tcs in the just concluded quarter i dont know what is wrong in doing priced programs in india where we are also delivering margins india is a good market and we must be present here as it is one of the few emerging markets that is growing future growth will come from emerging markets and if companies like ours don t invest here it will be a huge missed opportunity how do you see the macro environment and what does fy \u003cTWO_TEN\u003e look like","timestamp":"2024-07-15T06:11:00+05:30","market_timestamp":"2024-07-15T09:15:00+05:30","off_market_hours":true}