{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-ceo-c-vijayakumar-sees-gcc-opportunities-despite-divestment-impact/articleshow/111735319.cms","title":"HCLTech CEO C Vijayakumar sees GCC opportunities despite divestment impact","description":"HCLTech, located in Noida, foresees GCC opportunities despite State Street's insourcing lowering Q1 revenue. CEO Vijayakumar predicts Q3 recovery, growth in ER\u0026D, and AI efficiency. The State Street buyout cut financial services revenue by 0.8%. 200 GenAI proofs of concept are expected to raise FY26 discretionary spending. FY24 remains subdued, with a 3-5% revenue guidance range.","content":"India’s third-largest IT services firm HCLTech sees continued opportunities to build global capability centers (GCCs) for multinational clients, despite the revenue dent made by joint venture partner State Street Corp.’s exit.HCLTech’s chief executive and managing director C Vijayakumar told ET that even as global firms are insourcing technology services, it is restricted to large companies. For the IT major, the third quarter will see the adverse impact witnessed in the first of the current fiscal year fade out.In December 2023, US-based financial services firm State Street Corp. decided to buyout HCLTech’s 49% stake in the UK joint venture Statestreet HCL Services, shrinking the IT major’s first-quarter revenues, especially in the financial services segment, by 1.55% sequentially to Rs 28,057 crore. The transaction impacted HCLTech’s financial services revenues by 0.8%, which shrank overall by 1.3%.Vijayakumar reasoned that State Street has now decided to insource and consolidate joint ventures in India into its own centres.“It’s been a long relationship for us, 12-plus years. State Street continues to be a large client for us, even after this divestment. Only their BPO business, they have insourced and consolidated with their organisation,” he said.","cleaned_content":"india s third largest it services firm hcltech sees continued opportunities to build global capability centers gccs for multinational clients despite the revenue dent made by joint venture partner state street corp s exit hcltech s chief executive and managing director c vijayakumar told et that even as global firms are insourcing technology services it is restricted to large companies for the it major the third quarter will see the adverse impact witnessed in the first of the current fiscal year fade out in december \u003cTWO_THOUSAND\u003e us based financial services firm state street corp decided to buyout hcltech s \u003cFOUR_TEN_PERCENT\u003e stake in the uk joint venture statestreet hcl services shrinking the it major s first quarter revenues especially in the financial services segment by \u003cONE_PERCENT\u003e sequentially to rs \u003cTWO_TEN_THOUSAND\u003e crore the transaction impacted hcltech s financial services revenues by \u003cZERO_PERCENT\u003e which shrank overall by \u003cONE_PERCENT\u003e vijayakumar reasoned that state street has now decided to insource and consolidate joint ventures in india into its own centres it s been a long relationship for us \u003cONE_TEN\u003e plus years state street continues to be a large client for us even after this divestment only their bpo business they have insourced and consolidated with their organisation he said","timestamp":"2024-07-15T06:00:00+05:30","market_timestamp":"2024-07-15T09:15:00+05:30","off_market_hours":true}