{"url":"https://economictimes.indiatimes.com/tech/information-tech/tech-mahindra-q1-profit-up-23-to-rs-851-crore-revenue-down/articleshow/112023682.cms","title":"Tech Mahindra Q1 profit up 23% to Rs 851 crore, revenue down","description":"IT services company Tech Mahindra on Thursday reported 23% year-on-year (YoY) growth in its consolidated net profit at Rs 851 crore in the June quarter. The profit was slightly below the Street estimate of Rs 870 crore.","content":"Tech Mahindra, the country's fifth largest IT services firm, posted a 23% year-on-year increase in first-quarter net profit, driven by healthy margins and segmental growth.Net profit for the quarter ended June 30 rose to Rs 851.5 crore from Rs 692.5 crore a year earlier. Sequentially, profit grew 28.8% from Rs 661 crore in the three months ended March 31. The Pune-headquartered firm's consolidated revenue from operations declined 1.2% on year to Rs 13,005.5 crore. Sequentially, revenue increased 1%.TechM's operating margin expanded to 8.5% from 7.4% in the previous quarter and 6.8% a year earlier. \"For TechM, we are more stable and more settled to a new organisation structure. That allows us to take better opportunities (from the market). Market is more or less the same, maybe it has improved from a year ago,\" managing director and chief executive Mohit Joshi said. Three business segments - manufacturing (6.4%), retail, transport \u0026 logistics (4.9%) and healthcare \u0026 life sciences (6.1%) - posted growth. But in its largest vertical, communications, revenue fell 9.9% on year and 1.9% sequentially. Also, the segment's market share declined to 33.1% from 34% the previous quarter. In the Banking, financial services \u0026 insurance vertical, revenue fell 1.2% year-on-year but was marginally up at 0.7% from the previous quarter.BFSI is not only seeing some new opportunities in existing accounts but also has won new clients, Joshi said.In dollar terms, TechM's revenue grew 2.6% YoY and 0.7% QoQ to $1.56 billion. In constant currency terms, revenue declined 1.2% YoY and increased 0.7% from the fourth quarter of last fiscal year.","cleaned_content":"tech mahindra the countrys fifth largest it services firm posted a \u003cTWO_TEN_PERCENT\u003e year on year increase in first quarter net profit driven by healthy margins and segmental growth net profit for the quarter ended june \u003cTHREE_TEN\u003e rose to rs \u003cEIGHT_HUNDRED\u003e crore from rs \u003cSIX_HUNDRED\u003e crore a year earlier sequentially profit grew \u003cTWO_TEN_PERCENT\u003e from rs \u003cSIX_HUNDRED\u003e crore in the three months ended march \u003cTHREE_TEN\u003e the pune headquartered firms consolidated revenue from operations declined \u003cONE_PERCENT\u003e on year to rs \u003cONE_TEN_THOUSAND\u003e crore sequentially revenue increased \u003cONE_PERCENT\u003e techms operating margin expanded to \u003cEIGHT_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e in the previous quarter and \u003cSIX_PERCENT\u003e a year earlier for techm we are more stable and more settled to a new organisation structure that allows us to take better opportunities from the market market is more or less the same maybe it has improved from a year ago managing director and chief executive mohit joshi said three business segments manufacturing \u003cSIX_PERCENT\u003e retail transport logistics \u003cFOUR_PERCENT\u003e and healthcare life sciences \u003cSIX_PERCENT\u003e posted growth but in its largest vertical communications revenue fell \u003cNINE_PERCENT\u003e on year and \u003cONE_PERCENT\u003e sequentially also the segments market share declined to \u003cTHREE_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e the previous quarter in the banking financial services insurance vertical revenue fell \u003cONE_PERCENT\u003e year on year but was marginally up at \u003cZERO_PERCENT\u003e from the previous quarter bfsi is not only seeing some new opportunities in existing accounts but also has won new clients joshi said in dollar terms techms revenue grew \u003cTWO_PERCENT\u003e yoy and \u003cZERO_PERCENT\u003e qoq to \u003cONE_\u003e billion in constant currency terms revenue declined \u003cONE_PERCENT\u003e yoy and increased \u003cZERO_PERCENT\u003e from the fourth quarter of last fiscal year","timestamp":"2024-07-25T23:34:00+05:30","market_timestamp":"2024-07-26T09:15:00+05:30","off_market_hours":true}