{"url":"https://economictimes.indiatimes.com/tech/information-tech/sonata-software-pushes-1-5-billion-revenue-goal-to-fy27/articleshow/112232313.cms","title":"Sonata Software pushes $1.5 billion revenue goal to FY27","description":"Bengaluru-headquartered IT services firm Sonata Software surpassed $1 billion in consolidated revenue in the last fiscal year ended March 31. In its June quarter investor presentation, the company said it expects to add $500 million to the revenue in three-four years.","content":"Mid-tier IT firm Sonata Software has pushed its $1.5 billion revenue target by a year to fiscal 2027, its top executive told ET.This indicates the slowdown in technology demand is also impacting mid-sized outsourcing firms which have been growing faster than their larger rivals like Tata Consultancy Services, Infosys, HCLTech and Wipro.“We have called out that we want to be $1.5 billion revenue by FY27. That's our long-term goal. Given the market condition, we diluted it (from earlier target of achieving it by FY26 ending March 2026) by 2-4 quarters now,” managing director and chief executive Samir Dhir said.The Bengaluru-headquartered IT services firm surpassed $1 billion in consolidated revenue in the last fiscal year ended March 31. In its June quarter investor presentation, the company said it expects to add $500 million to the revenue in three-four years.For Q1, Sonata Software reported a 12% year-on-year and 4.3% sequential increase in net profit to Rs 105.6 crore. Revenue rose 25% YoY and 15.3% QoQ to Rs 2,527.4 crore. The performance was primarily driven by its domestic business.","cleaned_content":"mid tier it firm sonata software has pushed its \u003cONE_\u003e billion revenue target by a year to fiscal \u003cTWO_THOUSAND\u003e its top executive told et this indicates the slowdown in technology demand is also impacting mid sized outsourcing firms which have been growing faster than their larger rivals like tata consultancy services infosys hcltech and wipro we have called out that we want to be \u003cONE_\u003e billion revenue by fy27 thats our long term goal given the market condition we diluted it from earlier target of achieving it by fy26 ending march \u003cTWO_THOUSAND\u003e by \u003cTWO_\u003e \u003cFOUR_\u003e quarters now managing director and chief executive samir dhir said the bengaluru headquartered it services firm surpassed \u003cONE_\u003e billion in consolidated revenue in the last fiscal year ended march \u003cTHREE_TEN\u003e in its june quarter investor presentation the company said it expects to add \u003cFIVE_HUNDRED\u003e million to the revenue in three four years for q1 sonata software reported a \u003cONE_TEN_PERCENT\u003e year on year and \u003cFOUR_PERCENT\u003e sequential increase in net profit to rs \u003cONE_HUNDRED\u003e crore revenue rose \u003cTWO_TEN_PERCENT\u003e yoy and \u003cONE_TEN_PERCENT\u003e qoq to rs \u003cTWO_THOUSAND\u003e crore the performance was primarily driven by its domestic business","timestamp":"2024-08-03T06:00:00+05:30","market_timestamp":"2024-08-05T09:15:00+05:30","off_market_hours":true}