{"url":"https://economictimes.indiatimes.com/tech/information-tech/chennai-based-it-firm-prodapt-appoints-manish-vyas-as-md-ceo/articleshow/112158607.cms","title":"Chennai-based IT firm Prodapt appoints Manish Vyas as MD \u0026 CEO","description":"Prodapt said Manish Vyas joined the company as executive director earlier this year, bringing with him over 23 years of experience at Tech Mahindra as well as a deep understanding of building scaled businesses in the CMT industry, having led multiple lines of global businesses.","content":"Telecom and technology consulting, engineering and transformation services provider Prodapt on Wednesday said it has appointed Manish Vyas as MD and chief executive officer (CEO).  The company said Vyas joined Prodapt as executive director earlier this year, bringing with him over 23 years of experience at Tech Mahindra as well as a deep understanding of building scaled businesses in the CMT industry, having led multiple lines of global businesses. \"Manish steps into a strong Prodapt platform and a recognized leader in the CMT space. I have worked closely with Manish over the past few months and witnessed his strategic thinking, focus on talent development, and customer-centric mindset. I am sure Manish will drive our business to achieve scale and further propel Prodapt's offerings and capabilities to becoming AI-first and AI-at-core,\" Vedant Jhaver, founder and chairman of Prodapt said in a statement.  Jhaver thanked Harsha Kumar for his leadership and contributions over the past eight years while adding that Kumar would be transitioning to an advisory role at Prodapt, continuing to support the Board. \"Along with Prodapt's brilliant leadership teams, we are committed to becoming the most customer-centric and innovative company powered by an AI-first approach. I also want to extend my appreciation to the Prodapt ecosystem partners as we continue our mission to build disruptive solutions for our esteemed customers,\" Vyas said.","cleaned_content":"telecom and technology consulting engineering and transformation services provider prodapt on wednesday said it has appointed manish vyas as md and chief executive officer ceo the company said vyas joined prodapt as executive director earlier this year bringing with him over \u003cTWO_TEN\u003e years of experience at tech mahindra as well as a deep understanding of building scaled businesses in the cmt industry having led multiple lines of global businesses manish steps into a strong prodapt platform and a recognized leader in the cmt space i have worked closely with manish over the past few months and witnessed his strategic thinking focus on talent development and customer centric mindset i am sure manish will drive our business to achieve scale and further propel prodapts offerings and capabilities to becoming ai first and ai at core vedant jhaver founder and chairman of prodapt said in a statement jhaver thanked harsha kumar for his leadership and contributions over the past eight years while adding that kumar would be transitioning to an advisory role at prodapt continuing to support the board along with prodapts brilliant leadership teams we are committed to becoming the most customer centric and innovative company powered by an ai first approach i also want to extend my appreciation to the prodapt ecosystem partners as we continue our mission to build disruptive solutions for our esteemed customers vyas said","timestamp":"2024-07-31T12:16:00+05:30","market_timestamp":"2024-07-31T12:16:00+05:30","off_market_hours":false}