{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-signs-three-year-deal-with-north-americas-college-store-operator-follett/articleshow/112138511.cms","title":"TCS signs three-year deal with North America’s college store operator Follett","description":"TCS has signed a contract with North America's college store operator Follet Higher Education. The IT major will strengthen the IT infrastructure and cybersecurity framework for the company. Follet runs 1,000 outlets across the continent, TCS said in a filing.","content":"Tata Consultancy Services (TCS) has signed a three-year contract to strengthen information technology infrastructure and cybersecurity services for one of North America’s leading college store operators, Follett Higher Education. TCS will create enhanced IT infrastructure to better support Follett’s academic and retail experiences for colleges and universities across the US and Canada, by deploying trademark platforms and solutions, such as TCS Cognix and Cloud Exponence.Follett runs more than 1,000 college stores across North America and works towards supporting students' academic journey by offering them the course materials, technology, supplies and school-branded merchandise they need to succeed, said TCS in a filing with BSE.As part of the deal, TCS will strengthen Follett’s technology operations by adopting its signature Machine First delivery approach, coupled with its proprietary accelerators like TCS Cognix, an AI-driven human-machine collaboration suite that provides pre-built, cloud-based modules. This will automate manual processes for the company and provide enterprise infrastructure management platform with built-in security and regulatory compliances that will predict, prescribe and remediate performance issues that can impact business operations. TCS’ Cloud Exponence platform, which helps services management in hybrid cloud environments, will help Follett’s operations across cloud platforms.Prasad Keshava, vice-president of enterprise infrastructure for Follett, said, “At Follett, we believe every interaction a student has with us contributes to their potential for success. That’s why our partnership with TCS is crucial, along with a well-structured governance and accountability matrix.”","cleaned_content":"tata consultancy services tcs has signed a three year contract to strengthen information technology infrastructure and cybersecurity services for one of north america s leading college store operators follett higher education tcs will create enhanced it infrastructure to better support follett s academic and retail experiences for colleges and universities across the us and canada by deploying trademark platforms and solutions such as tcs cognix and cloud exponence follett runs more than \u003cONE_THOUSAND\u003e college stores across north america and works towards supporting students academic journey by offering them the course materials technology supplies and school branded merchandise they need to succeed said tcs in a filing with bse as part of the deal tcs will strengthen follett s technology operations by adopting its signature machine first delivery approach coupled with its proprietary accelerators like tcs cognix an ai driven human machine collaboration suite that provides pre built cloud based modules this will automate manual processes for the company and provide enterprise infrastructure management platform with built in security and regulatory compliances that will predict prescribe and remediate performance issues that can impact business operations tcs cloud exponence platform which helps services management in hybrid cloud environments will help follett s operations across cloud platforms prasad keshava vice president of enterprise infrastructure for follett said at follett we believe every interaction a student has with us contributes to their potential for success that s why our partnership with tcs is crucial along with a well structured governance and accountability matrix","timestamp":"2024-07-30T17:06:00+05:30","market_timestamp":"2024-07-31T09:15:00+05:30","off_market_hours":true}