{"url":"https://economictimes.indiatimes.com/tech/information-tech/after-4-billion-infosys-demand-india-may-target-other-it-majors-source-says/articleshow/112193182.cms","title":"After $4 billion Infosys demand, India may target other IT majors, source says","description":"The government accused Infosys of evading taxes and sought Rs 32,000 crore ($3.8 billion), or almost all its revenue for the quarter ended June 30. In the last year, India's goods and services tax department has sent more than 1,000 notices to companies, including Life Insurance Corporation of India, Dr Reddy's Laboratories and Ultratech Cement.","content":"Indian authorities may issue notices soon to more major IT services firms in an investigation of alleged tax evasion related to work down by their overseas offices, a government source said on Thursday, a day after Infosys was slapped with a $4 billion tax demand. In serving its highest-ever tax demand on Infosys, the government accused India's second-largest tech services company of evading taxes and sought Rs 32,000 crore ($3.8 billion), or almost all its revenue for the quarter ended June 30. Infosys said late on Wednesday it had received \"pre-show cause\" notices from the tax authorities but believed the relevant taxes had been paid. The company said in a statement it had paid its dues and is in compliance with central and state regulations. Yet tax authorities are not confining their investigations to Infosys. \"This is an industry-wide issue,\" a senior tax official with knowledge of the matter told Reuters, adding that notices were likely to be sent to some other IT companies.  The source spoke on condition of anonymity as he was not authorised to speak to media.","cleaned_content":"indian authorities may issue notices soon to more major it services firms in an investigation of alleged tax evasion related to work down by their overseas offices a government source said on thursday a day after infosys was slapped with a \u003cFOUR_\u003e billion tax demand in serving its highest ever tax demand on infosys the government accused indias second largest tech services company of evading taxes and sought rs \u003cTHREE_TEN_THOUSAND\u003e crore \u003cTHREE_\u003e billion or almost all its revenue for the quarter ended june \u003cTHREE_TEN\u003e infosys said late on wednesday it had received pre show cause notices from the tax authorities but believed the relevant taxes had been paid the company said in a statement it had paid its dues and is in compliance with central and state regulations yet tax authorities are not confining their investigations to infosys this is an industry wide issue a senior tax official with knowledge of the matter told reuters adding that notices were likely to be sent to some other it companies the source spoke on condition of anonymity as he was not authorised to speak to media","timestamp":"2024-08-01T15:07:00+05:30","market_timestamp":"2024-08-01T15:07:00+05:30","off_market_hours":false}