{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-elevates-three-company-veterans/articleshow/112411241.cms","title":"Wipro elevates three company veterans","description":"Dilip Dialani has been with Wipro for almost 20 years. He will take over from Nanda Kishore as COO of Americas One in Q3. Before he succeeded Delaporte as Wipro CEO, Srini had helmed Americas One as CEO.","content":"Continuing its restructuring spree under new CEO Srini Pallia, IT major Wipro has elevated three veterans, as per an internal email seen by ET. Meanwhile, a senior executive who joined under ex-CEO Thierry Delaporte's watch has decided to exit the firm. Wipro has appointed Nanda Kishore, who has served the company for 30 years, as chief of delivery and operational excellence. He is currently the chief operating officer (COO) of Americas One. Dilip Dialani, who has been with Wipro for almost two decades, will take over from Nanda as COO of Americas One in Q3. Before he succeeded Delaporte as Wipro CEO, Srini had helmed Americas One as CEO. The firm is elevating the role of its chief information security officer Aathir Ahad, a Wipro veteran for over 21 years. Effective immediately, he will report to the company's COO Sanjeev Jain. Ahad will continue to shape the company's security strategy, ensuring compliance and safeguarding data, read the mail. Also read | Wipro Enterprises’ hydraulics business acquires US rival ColumbusQuestions mailed to Wipro remained unanswered till the time of going to press. Nanda succeeds Ajit Mahale, who came on board when Delaporte was CEO. The email also mentioned that Mahale, who has been instrumental in building a strong foundation in delivery excellence, has decided to pursue opportunities outside the firm. According to his LinkedIn profile, Mahale had been chief delivery officer at Wipro for more than 1.5 years. He has formerly been employed with IT firms Capgemini and GlobalLogic.","cleaned_content":"continuing its restructuring spree under new ceo srini pallia it major wipro has elevated three veterans as per an internal email seen by et meanwhile a senior executive who joined under ex ceo thierry delaportes watch has decided to exit the firm wipro has appointed nanda kishore who has served the company for \u003cTHREE_TEN\u003e years as chief of delivery and operational excellence he is currently the chief operating officer coo of americas one dilip dialani who has been with wipro for almost two decades will take over from nanda as coo of americas one in q3 before he succeeded delaporte as wipro ceo srini had helmed americas one as ceo the firm is elevating the role of its chief information security officer aathir ahad a wipro veteran for over \u003cTWO_TEN\u003e years effective immediately he will report to the companys coo sanjeev jain ahad will continue to shape the companys security strategy ensuring compliance and safeguarding data read the mail also read wipro enterprises hydraulics business acquires us rival columbusquestions mailed to wipro remained unanswered till the time of going to press nanda succeeds ajit mahale who came on board when delaporte was ceo the email also mentioned that mahale who has been instrumental in building a strong foundation in delivery excellence has decided to pursue opportunities outside the firm according to his linkedin profile mahale had been chief delivery officer at wipro for more than \u003cONE_\u003e years he has formerly been employed with it firms capgemini and globallogic","timestamp":"2024-08-10T16:43:00+05:30","market_timestamp":"2024-08-12T09:15:00+05:30","off_market_hours":true}