{"url":"https://economictimes.indiatimes.com/tech/technology/fortnite-returns-on-iphones-in-eu-globally-on-android/articleshow/112567922.cms","title":"Fortnite returns on iPhones in EU, globally on Android","description":"Fortnite is back on iPhones in the EU and Android devices globally after a four-year hiatus. Epic Games re-launched the game following the EU's Digital Markets Act, overcoming legal hurdles with Apple and Google over commission fees. The law enabled Epic to introduce its store, though Apple's restrictions remain outside Europe.","content":"Multiplayer shooter game Fortnite is available again on iPhones in the European Union and worldwide on Google's Android devices after a gap of four years, following legal measures by the EU, developer Epic Games said on Friday. Fortnite, created by Epic, a U.S.-based studio, and backed by China's Tencent, the world's largest game studio, launched in 2017 and its last-player-standing, \"battle royale\" format became an instant hit, drawing in millions of dedicated players. But in August 2020, Apple and Alphabet's Google removed Fortnite from their app stores for violating their guidelines by launching a payment feature, prompting several lawsuits challenging their rules of charging up to 30% commissions on payments. At the time of the ban, Epic had 116 million users just on Apple's platform. The EU's Digital Markets Act (DMA) law is allowing Epic to launch its game store in the bloc, though Apple is still blocking users outside Europe from accessing Fortnite and its games store, the company said.","cleaned_content":"multiplayer shooter game fortnite is available again on iphones in the european union and worldwide on googles android devices after a gap of four years following legal measures by the eu developer epic games said on friday fortnite created by epic a u s based studio and backed by chinas tencent the worlds largest game studio launched in \u003cTWO_THOUSAND\u003e and its last player standing battle royale format became an instant hit drawing in millions of dedicated players but in august \u003cTWO_THOUSAND\u003e apple and alphabets google removed fortnite from their app stores for violating their guidelines by launching a payment feature prompting several lawsuits challenging their rules of charging up to \u003cTHREE_TEN_PERCENT\u003e commissions on payments at the time of the ban epic had \u003cONE_HUNDRED\u003e million users just on apples platform the eus digital markets act dma law is allowing epic to launch its game store in the bloc though apple is still blocking users outside europe from accessing fortnite and its games store the company said","timestamp":"2024-08-16T16:32:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}