{"url":"https://economictimes.indiatimes.com/tech/information-tech/digital-transformation-deals-back-in-play-with-a-cost-twist/articleshow/112354807.cms","title":"Digital transformation deals back in play for IT industry with a cost twist","description":"Digital transformation projects are making a comeback in India’s IT services industry after a lull of about two years, albeit with some cost-saving provisions. Several transformation deals announced by homegrown IT firms in the past four to five months have originated from the Nordic region, all of which involve a large amount of transformation work.","content":"India’s software services industry is seeing green shoots of recovery in digital transformation deals after about two years. The new contracts, however, contain cost-saving provisions.Several transformation deals announced by homegrown IT firms in the last 4-5 months have originated from the Nordic region. These include Infosys’ deal with Denmark’s TDC Net, a digital infrastructure and connectivity provider; HCLTech’s deal with Finland’s Oriola Corporation, a health and wellbeing company; and TCS’ multi-million-dollar contracts with digital connectivity and communications provider Nuuday and Ramboll—both from Denmark.Infosys and Wipro also secured deals from Sweden’s Ikea and Finland’s Nokia.All the deals involve a large amount of transformation work.To be sure, digital transformation deals also originated from other regions in the last 4-5 months. This includes a $355-million deal between TCS and US-based Xerox. Also, Cognizant secured three deals in the last two months from UK-based Hays and Whitbread and US-based Victory Capital. Adding to the non-Nordic count, LTIMindtree and Wipro won transformation deals from Absa Bank of South Africa and Hanesbrands from US, respectively.","cleaned_content":"india s software services industry is seeing green shoots of recovery in digital transformation deals after about two years the new contracts however contain cost saving provisions several transformation deals announced by homegrown it firms in the last \u003cFOUR_\u003e \u003cFIVE_\u003e months have originated from the nordic region these include infosys deal with denmark s tdc net a digital infrastructure and connectivity provider hcltech s deal with finland s oriola corporation a health and wellbeing company and tcs multi million dollar contracts with digital connectivity and communications provider nuuday and ramboll both from denmark infosys and wipro also secured deals from sweden s ikea and finland s nokia all the deals involve a large amount of transformation work to be sure digital transformation deals also originated from other regions in the last \u003cFOUR_\u003e \u003cFIVE_\u003e months this includes a \u003cTHREE_HUNDRED\u003e million deal between tcs and us based xerox also cognizant secured three deals in the last two months from uk based hays and whitbread and us based victory capital adding to the non nordic count ltimindtree and wipro won transformation deals from absa bank of south africa and hanesbrands from us respectively","timestamp":"2024-08-08T07:31:00+05:30","market_timestamp":"2024-08-08T09:15:00+05:30","off_market_hours":true}