{"url":"https://economictimes.indiatimes.com/tech/technology/gen-z-users-oppose-social-media-limits-poll/articleshow/112592309.cms","title":"Gen Z users oppose social media limits: poll","description":"According to a study designed by the Stanford Deliberative Democracy Lab, more than 60% of newly registered voters in the US oppose requiring kids under age 16 to seek parental consent to use social media. More than 85% of young people think there should be no time limits on when they can receive social media notifications.","content":"American teens are against the idea of regulations that would place restrictions on their use of social media platforms, despite knowing the potential harms to mental and physical health.According to a study designed by the Stanford Deliberative Democracy Lab, more than 60% of newly registered voters in the US oppose requiring kids under age 16 to seek parental consent to use social media. More than 85% of young people think there should be no time limits on when they can receive social media notifications.Parents, lawmakers, regulators and child safety advocates have spent years pushing for rules they say will ease the risks posed by heavy use of these services. But those just reaching voting age are starting to have more influence over who represents them.Judge tells Google to brace for shakeup of app storeA US judge has indicated that he will order major changes to Google’s Android app store to punish the company for engineering a system that was declared an illegal monopoly hurting millions of consumers and app developers.","cleaned_content":"american teens are against the idea of regulations that would place restrictions on their use of social media platforms despite knowing the potential harms to mental and physical health according to a study designed by the stanford deliberative democracy lab more than \u003cSIX_TEN_PERCENT\u003e of newly registered voters in the us oppose requiring kids under age \u003cONE_TEN\u003e to seek parental consent to use social media more than \u003cEIGHT_TEN_PERCENT\u003e of young people think there should be no time limits on when they can receive social media notifications parents lawmakers regulators and child safety advocates have spent years pushing for rules they say will ease the risks posed by heavy use of these services but those just reaching voting age are starting to have more influence over who represents them judge tells google to brace for shakeup of app storea us judge has indicated that he will order major changes to google s android app store to punish the company for engineering a system that was declared an illegal monopoly hurting millions of consumers and app developers","timestamp":"2024-08-18T06:00:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}