{"url":"https://economictimes.indiatimes.com/tech/technology/us-lawmakers-urge-probe-of-wifi-router-maker-tp-link-over-fears-of-chinese-cyber-attacks/articleshow/112555564.cms","title":"US lawmakers urge probe of WiFi router maker TP-Link over fears of Chinese cyber attacks","description":"In calling for an investigation, the US legislators cited known vulnerabilities in TP-Link firmware and instances of its routers being exploited to target government officials in European countries. The US, its allies and Microsoft last year disclosed a Chinese government-linked hacking campaign dubbed Volt Typhoon. By taking control of privately owned routers, the attackers sought to hide subsequent attacks on American critical infrastructure.","content":"Two US lawmakers want the Biden administration to probe China's TP-Link Technology Co and its affiliates for potential national security risks from their widely used WiFi routers over fears they could be used in cyber attacks against the U.S. Republican Representative John Moolenaar and Democratic Representative Raja Krishnamoorthi, who lead the House Select Committee on China, requested a Commerce Department probe in a Tuesday letter seen by Reuters. According to research firm IDC, TP-Link, which focuses on the consumer market, is the top seller of WiFi routers internationally by unit volume. In calling for an investigation, the US legislators cited known vulnerabilities in TP-Link firmware and instances of its routers being exploited to target government officials in European countries.  \"...We request that Commerce verify the threat posed by (China-affiliated small office/home office) routers -particularly those offered by the world's largest manufacturer, TP-Link,\" according to the letter to Commerce Secretary Gina Raimondo.","cleaned_content":"two us lawmakers want the biden administration to probe chinas tp link technology co and its affiliates for potential national security risks from their widely used wifi routers over fears they could be used in cyber attacks against the u s republican representative john moolenaar and democratic representative raja krishnamoorthi who lead the house select committee on china requested a commerce department probe in a tuesday letter seen by reuters according to research firm idc tp link which focuses on the consumer market is the top seller of wifi routers internationally by unit volume in calling for an investigation the us legislators cited known vulnerabilities in tp link firmware and instances of its routers being exploited to target government officials in european countries we request that commerce verify the threat posed by china affiliated small office home office routers particularly those offered by the worlds largest manufacturer tp link according to the letter to commerce secretary gina raimondo","timestamp":"2024-08-16T08:43:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}