{"url":"https://economictimes.indiatimes.com/tech/technology/only-indian-companies-can-bid-for-gpu-procurement-centre/articleshow/112572557.cms","title":"Only Indian companies can bid for GPU procurement: centre","description":"As per the bid documents seen by ET, the IT ministry will also propose that the prospective bidders for the tender form a three-member consortium with one data centre provider, one cloud service provider and a systems integrator as partners. Of these three companies, one will act as the primary service provider, while the other two will be designated secondary partners, a source said.","content":"The government will allow only India-incorporated companies to participate in the tender process to procure graphic processing units (GPUs) and provide services to users under the India Artificial Intelligence (IndiaAI) Mission, sources told ET.The ministry of electronics and information technology is likely to float the tender to procure 1000 GPUs or equivalent AI compute capacity for now, a source said. The winning bidder will provide services for three years for now, which may be extended on mutually agreeable terms by the government.On July 5, ET had exclusively reported that the IT ministry was likely to allow only Indian companies to run and manage the operations of GPUs to be procured under the Rs 10,372 crore India AI Mission.As per the bid documents seen by ET, the IT ministry will also propose that the prospective bidders for the tender form a three-member consortium with one data centre provider, one cloud service provider and a systems integrator as partners. Of these three companies, one will act as the primary service provider, while the other two will be designated secondary partners, a source said.All three members of the consortium will have to meet the criteria of being incorporated as a legal entity in India. The cloud services provided by the winner of the bid will also have to be delivered from a data centre based in India, a senior government official said.","cleaned_content":"the government will allow only india incorporated companies to participate in the tender process to procure graphic processing units gpus and provide services to users under the india artificial intelligence indiaai mission sources told et the ministry of electronics and information technology is likely to float the tender to procure \u003cONE_THOUSAND\u003e gpus or equivalent ai compute capacity for now a source said the winning bidder will provide services for three years for now which may be extended on mutually agreeable terms by the government on july \u003cFIVE_\u003e et had exclusively reported that the it ministry was likely to allow only indian companies to run and manage the operations of gpus to be procured under the rs \u003cONE_TEN_THOUSAND\u003e crore india ai mission as per the bid documents seen by et the it ministry will also propose that the prospective bidders for the tender form a three member consortium with one data centre provider one cloud service provider and a systems integrator as partners of these three companies one will act as the primary service provider while the other two will be designated secondary partners a source said all three members of the consortium will have to meet the criteria of being incorporated as a legal entity in india the cloud services provided by the winner of the bid will also have to be delivered from a data centre based in india a senior government official said","timestamp":"2024-08-17T06:10:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}