{"url":"https://economictimes.indiatimes.com/tech/technology/indian-businesses-need-to-align-cyber-security-budgets-with-growth-objectives-kaspersky/articleshow/112608279.cms","title":"Indian businesses need to align cyber security budgets with growth objectives: Kaspersky","description":"In India, malware attacks climbed 11 per cent to 13,44,566 in 2024 against 12,13,528 a year ago, a report by SonicWall said earlier this month. The number of brute force or targeted attacks is escalating in India, with every third cyber incident reported due to ransomware in 2023, cyber security firm Kaspersky has noted.","content":"Indian businesses need to align cyber security budgets with their growth objectives to ensure sustainable expansion in the face of increasing digitalisation and associated risks, a top official of Kaspersky has said. The emergence of new-age technologies, including artificial intelligence and GenAI, is critical for companies to boost their businesses. \"In order to grow businesses, you need to digitise. If you don't digitise, you are not going to have that business growth value,\" Adrian Hia, Managing Director for the APAC region at Kaspersky, told PTI. At the same time, the digitalisation of businesses increases the attack surface area, opening avenues for risks like sophisticated cyberattacks. If Indian businesses aim to grow by 20 per cent, they also need to boost their cyber security budget by 20 per cent in the course of preparedness against these attacks, Hia noted. Further, he said that organisations need to upkeep their systems and data while moving towards digital transformation. ","cleaned_content":"indian businesses need to align cyber security budgets with their growth objectives to ensure sustainable expansion in the face of increasing digitalisation and associated risks a top official of kaspersky has said the emergence of new age technologies including artificial intelligence and genai is critical for companies to boost their businesses in order to grow businesses you need to digitise if you dont digitise you are not going to have that business growth value adrian hia managing director for the apac region at kaspersky told pti at the same time the digitalisation of businesses increases the attack surface area opening avenues for risks like sophisticated cyberattacks if indian businesses aim to grow by \u003cTWO_TEN_PERCENT\u003e they also need to boost their cyber security budget by \u003cTWO_TEN_PERCENT\u003e in the course of preparedness against these attacks hia noted further he said that organisations need to upkeep their systems and data while moving towards digital transformation","timestamp":"2024-08-18T18:12:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}