{"url":"https://economictimes.indiatimes.com/tech/technology/chinas-chip-maker-amec-sues-u-s-defence-department-over-military-company-label/articleshow/112564471.cms","title":"China's chip maker AMEC sues US defence department over 'military company' label","description":"AMEC has played a key role in China's push to develop the domestic semiconductor industry and cut reliance on foreign technology, with major chip foundries, such as Semiconductor Manufacturing International Corp, among its clients. In a statement, AMEC called the designation \"erroneous, factually incorrect, without legal basis, and in violation of due process.\"","content":"One of China's leading chip equipment makers, Advanced Micro-Fabrication Equipment (AMEC), said on Friday it had filed a federal lawsuit against the U.S. defence department, challenging its designation as a \"Chinese Military Company\". AMEC has played a key role in China's push to develop the domestic semiconductor industry and cut reliance on foreign technology, with major chip foundries, such as Semiconductor Manufacturing International Corp, among its clients. In a statement, AMEC called the designation \"erroneous, factually incorrect, without legal basis, and in violation of due process.\"  It was one of a group of companies added to the list of Chinese Military Companies by the Department of Defense (DoD) in January.  \"We are deeply shocked by the designation of AMEC again on the military-related list by the DoD,\" Chairman and CEO Gerald Yin said in the statement. \"Such designation was wrong and groundless.\"","cleaned_content":"one of chinas leading chip equipment makers advanced micro fabrication equipment amec said on friday it had filed a federal lawsuit against the u s defence department challenging its designation as a chinese military company amec has played a key role in chinas push to develop the domestic semiconductor industry and cut reliance on foreign technology with major chip foundries such as semiconductor manufacturing international corp among its clients in a statement amec called the designation erroneous factually incorrect without legal basis and in violation of due process it was one of a group of companies added to the list of chinese military companies by the department of defense dod in january we are deeply shocked by the designation of amec again on the military related list by the dod chairman and ceo gerald yin said in the statement such designation was wrong and groundless","timestamp":"2024-08-16T14:47:00+05:30","market_timestamp":"2024-08-16T14:47:00+05:30","off_market_hours":false}