{"url":"https://economictimes.indiatimes.com/tech/information-tech/fpi-buying-in-indian-it-rises-to-highest-since-july-2022-nsdl-data/articleshow/112371273.cms","title":"FPI buying in Indian IT rises to highest since July 2022: NSDL data","description":"Foreign portfolio investors purchased $1.40 billion worth of Indian IT stocks in July, marking the highest since the April 2022 reclassification. The buying spree was fueled by anticipated U.S. rate cuts and positive earnings from major IT firms like TCS and Infosys. FPIs also showed interest in automobile and metal stocks, although financials faced outflows.","content":"Foreign portfolio investors (FPIs) net bought Indian IT stocks worth 117.63 billion rupees ($1.40 billion) in July, data from National Securities Depository (NSDL) showed, the highest since a new sectoral classification was implemented in 2022. The NSDL had re-classified sectors in April 2022, trimming the total number of sectors from 35 to 22 after India's stock exchange NSE and BSE adopted a common industry classification system. Prior to this, the IT sector was divided into software, services and hardware technology. The buying interest was driven by U.S. Federal Reserve's comments signalling the likelihood of a rate cut starting from September along with largely upbeat earnings, analysts said. \"We expect the start of the interest rate-cut cycle in the U.S. to be a signal for clients to garner confidence on the inflation trajectory, which may drive demand recovery and uptick in discretionary spending,\" said analysts led by Dipesh Mehta of Emkay Global.","cleaned_content":"foreign portfolio investors fpis net bought indian it stocks worth \u003cONE_HUNDRED\u003e billion rupees \u003cONE_\u003e billion in july data from national securities depository nsdl showed the highest since a new sectoral classification was implemented in \u003cTWO_THOUSAND\u003e the nsdl had re classified sectors in april \u003cTWO_THOUSAND\u003e trimming the total number of sectors from \u003cTHREE_TEN\u003e to \u003cTWO_TEN\u003e after indias stock exchange nse and bse adopted a common industry classification system prior to this the it sector was divided into software services and hardware technology the buying interest was driven by u s federal reserves comments signalling the likelihood of a rate cut starting from september along with largely upbeat earnings analysts said we expect the start of the interest rate cut cycle in the u s to be a signal for clients to garner confidence on the inflation trajectory which may drive demand recovery and uptick in discretionary spending said analysts led by dipesh mehta of emkay global","timestamp":"2024-08-08T14:22:00+05:30","market_timestamp":"2024-08-08T14:22:00+05:30","off_market_hours":false}