{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-shares-surge-16-after-revenue-jumps-32-yoy-motorcycle-launch/articleshow/112558407.cms","title":"Ola Electric shares surge 16% after revenue jumps 32% YoY, motorcycle launch","description":"Ola Electric's shares surged 15.8% to Rs 128 on the BSE after reporting a 32% YoY revenue increase for Q1 FY25, reaching Rs 1,644 crore. The company also launched its Roadster electric motorcycle on August 15. Despite the revenue growth, the quarterly loss widened to Rs 347 crore from Rs 267 crore a year earlier.","content":"Shares of electric scooter maker Ola Electric surged 15.8% to a day’s high of Rs 128 on the BSE after the company announced a 32% YoY increase in revenue for the first quarter of FY25, reaching Rs 1,644 crore. The company also launched its electric motorcycle, the Roadster, on August 15.Quarterly resultsThe company reported a year-on-year (YoY) revenue increase, but the quarterly loss widened to Rs 347 crore, up from Rs 267 crore in the same quarter of the previous year.The firm's automotive division saw total income increase by 34% to Rs 1,722 crore, though the loss after tax widened to Rs 233 crore from Rs 189 crore a year ago. The battery division reported an income of Rs 5 crore for the quarter, with a loss after tax of Rs 37 crore.Ola Electric's revenue increased from Rs 1,671 crore in the last quarter of FY24, and its net loss narrowed from Rs 416 crore reported for the quarter ended March 31, 2024.","cleaned_content":"shares of electric scooter maker ola electric surged \u003cONE_TEN_PERCENT\u003e to a day s high of rs \u003cONE_HUNDRED\u003e on the bse after the company announced a \u003cTHREE_TEN_PERCENT\u003e yoy increase in revenue for the first quarter of fy25 reaching rs \u003cONE_THOUSAND\u003e crore the company also launched its electric motorcycle the roadster on august \u003cONE_TEN\u003e quarterly resultsthe company reported a year on year yoy revenue increase but the quarterly loss widened to rs \u003cTHREE_HUNDRED\u003e crore up from rs \u003cTWO_HUNDRED\u003e crore in the same quarter of the previous year the firms automotive division saw total income increase by \u003cTHREE_TEN_PERCENT\u003e to rs \u003cONE_THOUSAND\u003e crore though the loss after tax widened to rs \u003cTWO_HUNDRED\u003e crore from rs \u003cONE_HUNDRED\u003e crore a year ago the battery division reported an income of rs \u003cFIVE_\u003e crore for the quarter with a loss after tax of rs \u003cTHREE_TEN\u003e crore ola electrics revenue increased from rs \u003cONE_THOUSAND\u003e crore in the last quarter of fy24 and its net loss narrowed from rs \u003cFOUR_HUNDRED\u003e crore reported for the quarter ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-16T11:01:00+05:30","market_timestamp":"2024-08-16T11:01:00+05:30","off_market_hours":false}