{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-cto-quits-a-look-at-other-exits-from-the-delaporte-camp/articleshow/112494983.cms","title":"Wipro CTO quits: a look at other exits from the ‘Delaporte camp’","description":"Wipro has seen major restructuring under new CEO Srini Pallia, who wants to use internal talent to strengthen the organisation. This comes after former CEO Delaporte hired a lot of foreign citizens and expats at high salaries. Many from this camp are now leaving.","content":"IT major Wipro on Monday said its chief technology officer (CTO) Subha Tatavarti has resigned, effective August 16. This is the latest in a series of senior-level exits from the company, especially those who joined under former chief executive Theirry Delaporte. Srini Pallia replaced Delaporte as the chief executive of the firm in April.Exits from Delaporte campTatavarti is the fourth big departure from the ‘Delaporte camp’ since then.In May, then chief operating officer (COO) Amit Choudhary and Anis Chenchah, the chief executive of APMEA (Asia Pacific, India, Middle East \u0026 Africa) Strategic Market Unit (SMU) resigned to pursue opportunities outside the organisation.ET reported on August 10 that another senior executive who joined under Delaporte, Ajit Mahale, left the firm. He will be succeeded by Nanda Kishore, who has served the company for 30 years, as chief of delivery and operational excellence.","cleaned_content":"it major wipro on monday said its chief technology officer cto subha tatavarti has resigned effective august \u003cONE_TEN\u003e this is the latest in a series of senior level exits from the company especially those who joined under former chief executive theirry delaporte srini pallia replaced delaporte as the chief executive of the firm in april exits from delaporte camptatavarti is the fourth big departure from the delaporte camp since then in may then chief operating officer coo amit choudhary and anis chenchah the chief executive of apmea asia pacific india middle east africa strategic market unit smu resigned to pursue opportunities outside the organisation et reported on august \u003cONE_TEN\u003e that another senior executive who joined under delaporte ajit mahale left the firm he will be succeeded by nanda kishore who has served the company for \u003cTHREE_TEN\u003e years as chief of delivery and operational excellence","timestamp":"2024-08-13T16:34:00+05:30","market_timestamp":"2024-08-14T09:15:00+05:30","off_market_hours":true}