{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-enterprises-hydraulics-business-acquires-us-rival-columbus/articleshow/112376347.cms","title":"Wipro Enterprises’ hydraulics business acquires US rival Columbus","description":"Wipro Hydraulics completed the acquisition of Columbus Hydraulics to enhance North American manufacturing capabilities. This follows the recent purchase of Mailhot Industries and aims to broaden Wipro's range of hydraulic solutions. Columbus Hydraulics, established in 1952, provides customized hydraulic solutions and brings 150 employees into the fold.","content":"In its second acquisition in four months, Wipro Hydraulics, the hydraulic cylinder manufacturing business of Wipro Infrastructure Engineering (WIN), has announced the purchase of US rival Columbus Hydraulics. The deal is aimed at strengthening manufacturing capabilities in North America, the company said in a statement. The cost of acquisition was not disclosed.The move follows the previous acquisition of private equity-backed Canadian firm Mailhot Industries announced in May.\"The acquisition of Columbus Hydraulics, following our recently acquired Mailhot Industries, is a strategic move to accelerate growth in North America. This acquisition complements our product and customer portfolio, allowing us to offer a broader range of hydraulic solutions for varied applications. Our combined skilled workforce will enable us to innovate for the current and future needs of our customers,” said Sitaram Ganeshan, president, Wipro Hydraulics.Established in 1952, Columbus Hydraulics delivers custom hydraulic solutions for a variety of applications in the agriculture, construction, turf maintenance and marine space.“As a leading independent hydraulic cylinder manufacturer, Wipro Hydraulics has established a significant presence in all growth markets. This acquisition strengthens our position and enhances our manufacturing capabilities in North America. By integrating Columbus Hydraulics’ expertise in customized hydraulic solutions, we aim to provide even more comprehensive offerings to our customers,” said Pratik Kumar, chief executive officer at WIN.","cleaned_content":"in its second acquisition in four months wipro hydraulics the hydraulic cylinder manufacturing business of wipro infrastructure engineering win has announced the purchase of us rival columbus hydraulics the deal is aimed at strengthening manufacturing capabilities in north america the company said in a statement the cost of acquisition was not disclosed the move follows the previous acquisition of private equity backed canadian firm mailhot industries announced in may the acquisition of columbus hydraulics following our recently acquired mailhot industries is a strategic move to accelerate growth in north america this acquisition complements our product and customer portfolio allowing us to offer a broader range of hydraulic solutions for varied applications our combined skilled workforce will enable us to innovate for the current and future needs of our customers said sitaram ganeshan president wipro hydraulics established in \u003cONE_THOUSAND\u003e columbus hydraulics delivers custom hydraulic solutions for a variety of applications in the agriculture construction turf maintenance and marine space as a leading independent hydraulic cylinder manufacturer wipro hydraulics has established a significant presence in all growth markets this acquisition strengthens our position and enhances our manufacturing capabilities in north america by integrating columbus hydraulics expertise in customized hydraulic solutions we aim to provide even more comprehensive offerings to our customers said pratik kumar chief executive officer at win","timestamp":"2024-08-08T17:03:00+05:30","market_timestamp":"2024-08-09T09:15:00+05:30","off_market_hours":true}