{"url":"https://economictimes.indiatimes.com/tech/information-tech/competition-commission-approves-hp-enterprise-juniper-networks-deal/articleshow/112531698.cms","title":"CCI approves HP Enterprise-Juniper Networks deal","description":"\"The proposed combination is to be carried out by way of a reverse triangular merger through which Jasmine Acquisition Sub, Inc. (a wholly-owned subsidiary of HPE) will merge with and into Juniper, such that Juniper will be the surviving entity and will become a wholly-owned subsidiary of HPE,\" CCI said in a release.","content":"Fair trade regulator CCI on Wednesday approved the US-based Hewlett Packard Enterprise Company's proposal to acquire Juniper Networks, Inc. HPE specialises in business information technology, offering infrastructure products to support the IT systems of customers, related software to automate and simplify IT operations, and cloud solutions as a service.  \"The proposed combination pertains to the acquisition by Hewlett Packard Enterprise Company (HPE) of 100 per cent of the outstanding shares of, and sole control over, Juniper Networks, Inc.  \"The proposed combination is to be carried out by way of a reverse triangular merger through which Jasmine Acquisition Sub, Inc. (a wholly-owned subsidiary of HPE) will merge with and into Juniper, such that Juniper will be the surviving entity and will become a wholly-owned subsidiary of HPE,\" CCI said in a release.  Juniper is a multinational networking technology company which provides networking, infrastructure, security, and other related solutions (hardware and software) to customers in multiple industries.  It designs, develops and sells networking products and services including routing, switching, wireless, network security and associated services. ","cleaned_content":"fair trade regulator cci on wednesday approved the us based hewlett packard enterprise companys proposal to acquire juniper networks inc hpe specialises in business information technology offering infrastructure products to support the it systems of customers related software to automate and simplify it operations and cloud solutions as a service the proposed combination pertains to the acquisition by hewlett packard enterprise company hpe of \u003cONE_HUNDRED_PERCENT\u003e of the outstanding shares of and sole control over juniper networks inc the proposed combination is to be carried out by way of a reverse triangular merger through which jasmine acquisition sub inc a wholly owned subsidiary of hpe will merge with and into juniper such that juniper will be the surviving entity and will become a wholly owned subsidiary of hpe cci said in a release juniper is a multinational networking technology company which provides networking infrastructure security and other related solutions hardware and software to customers in multiple industries it designs develops and sells networking products and services including routing switching wireless network security and associated services","timestamp":"2024-08-14T22:10:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}