{"url":"https://economictimes.indiatimes.com/tech/technology/eu-presses-meta-on-plans-after-disinformation-tracker-axed/articleshow/112581521.cms","title":"EU presses Meta on plans after disinformation tracker axed","description":"Meta has been criticised on both sides of the Atlantic over the decision to shut down CrowdTangle -- a feature considered vital by researchers tracking viral falsehoods -- in a year of major election contests in the United States and elsewhere. The European Commission's request to Meta was sent under the bloc's Digital Services Act, a landmark new law that cracks down on illegal content online.","content":"The EU on Friday formally requested that Meta detail steps it is taking on transparency after the Facebook and Instagram owner scrapped a widely-used tool for tracking disinformation online. Meta has been criticised on both sides of the Atlantic over the decision to shut down CrowdTangle -- a feature considered vital by researchers tracking viral falsehoods -- in a year of major election contests in the United States and elsewhere.Unavailable since August 14, CrowdTangle is to be replaced with Meta's Content Library -- a technology researchers say offers nowhere near the same functionality. The European Commission's request to Meta was sent under the bloc's Digital Services Act, a landmark new law that cracks down on illegal content online. Brussels launched a formal investigation into Meta's Facebook and Instagram in late April, five weeks before bloc-wide elections in June, over concerns the platforms were failing to counter disinformation.","cleaned_content":"the eu on friday formally requested that meta detail steps it is taking on transparency after the facebook and instagram owner scrapped a widely used tool for tracking disinformation online meta has been criticised on both sides of the atlantic over the decision to shut down crowdtangle a feature considered vital by researchers tracking viral falsehoods in a year of major election contests in the united states and elsewhere unavailable since august \u003cONE_TEN\u003e crowdtangle is to be replaced with metas content library a technology researchers say offers nowhere near the same functionality the european commissions request to meta was sent under the blocs digital services act a landmark new law that cracks down on illegal content online brussels launched a formal investigation into metas facebook and instagram in late april five weeks before bloc wide elections in june over concerns the platforms were failing to counter disinformation","timestamp":"2024-08-17T10:03:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}