{"url":"https://economictimes.indiatimes.com/tech/technology/ev-maker-rivian-halts-production-of-amazon-delivery-vans-amid-parts-shortage-shares-down-5/articleshow/112580072.cms","title":"EV maker Rivian halts production of Amazon delivery vans amid parts shortage, shares down 5%","description":"Rivian suspended the production of its commercial delivery vans due to parts shortages, impacting their output for Amazon. A spokesperson indicated the company aims to recover the missed production. The shortage did not affect Rivian's other models. Amazon holds a 16% stake in Rivian, ordering 100,000 vans to be deployed by 2030.","content":"Rivian has temporarily suspended production of its commercial delivery vans used by retail giant Amazon.com due to a shortage of parts, a spokesperson for the electric vehicle manufacturer said on Friday. Shares of the Irvine, California-based company were down 5%. The production halt is the latest in a series of supply chain challenges for Rivian, which, like other EV makers, has grappled with significant production issues over the past two years due to supplier shortages. \"A part shortage has temporarily impacted our Electric Delivery Van (EDV) production. We expect to recover all missed production,\" the spokesperson said in an emailed statement. The company did not disclose any information about the specific part and supplier in question and also declined to comment on when the production stoppage began and if it has resumed.","cleaned_content":"rivian has temporarily suspended production of its commercial delivery vans used by retail giant amazon com due to a shortage of parts a spokesperson for the electric vehicle manufacturer said on friday shares of the irvine california based company were down \u003cFIVE_PERCENT\u003e the production halt is the latest in a series of supply chain challenges for rivian which like other ev makers has grappled with significant production issues over the past two years due to supplier shortages a part shortage has temporarily impacted our electric delivery van edv production we expect to recover all missed production the spokesperson said in an emailed statement the company did not disclose any information about the specific part and supplier in question and also declined to comment on when the production stoppage began and if it has resumed","timestamp":"2024-08-16T22:22:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}