{"url":"https://economictimes.indiatimes.com/tech/technology/how-burgeoning-presence-of-tata-group-is-transforming-tamil-nadus-industrial-hub-hosur/articleshow/112550015.cms","title":"How the burgeoning presence of Tata Group is transforming Tamil Nadu's industrial hub Hosur","description":"Tata Electronics, which has been making enclosures for Apple iPhones, has stepped up hiring and is rapidly expanding operations at the Hosur facility. Two new units are being set up as part of its expansion and a project to build dormitories for workers is coming up quickly.  ​​Apple has been looking to diversify away from China and is ramping up its manufacturing presence in India through partners such as Foxconn and Tata Electronics.","content":"Separated by almost 2,000 kilometres, Tatanagar in Jamshedpur and Hosur’s Thimjepalli may not have much in common. But the two places—in Jharkhand and Tamil Nadu, respectively—are tied by a common thread: the Tata Group. While Jamshedpur is arguably one of the first planned industrial cities in India, Thimjepalli—the once sleepy forest village known for frequent elephant crossings—is seeing a similar overhaul with Tata Electronics establishing extensive operations here.“Jamshedpur is a great story but I am sure Hosur will be Jamshedpur Plus,” Tamil Nadu industries minister TRB Rajaa told ET. “There is so much infrastructure work underway near the Tata plant itself that it is natural for the comparison but we are not looking at one particular manufacturing sector like steel, but rather multiple sectors.”The state envisages an IT services hub in proximity to Bengaluru, which is 40 km away, given the talent already available in Tamil Nadu.“Once the infrastructure is ready and once companies move and see the value in Hosur, it will probably be a twin electronic city,” the minister said.Tata Electronics, which has been making enclosures for Apple iPhones, has stepped up hiring and is rapidly expanding operations at the Hosur facility. Two new units are being set up as part of its expansion and a project to build dormitories for workers is coming up quickly.","cleaned_content":"separated by almost \u003cTWO_THOUSAND\u003e kilometres tatanagar in jamshedpur and hosur s thimjepalli may not have much in common but the two places in jharkhand and tamil nadu respectively are tied by a common thread the tata group while jamshedpur is arguably one of the first planned industrial cities in india thimjepalli the once sleepy forest village known for frequent elephant crossings is seeing a similar overhaul with tata electronics establishing extensive operations here jamshedpur is a great story but i am sure hosur will be jamshedpur plus tamil nadu industries minister trb rajaa told et there is so much infrastructure work underway near the tata plant itself that it is natural for the comparison but we are not looking at one particular manufacturing sector like steel but rather multiple sectors the state envisages an it services hub in proximity to bengaluru which is \u003cFOUR_TEN\u003e km away given the talent already available in tamil nadu once the infrastructure is ready and once companies move and see the value in hosur it will probably be a twin electronic city the minister said tata electronics which has been making enclosures for apple iphones has stepped up hiring and is rapidly expanding operations at the hosur facility two new units are being set up as part of its expansion and a project to build dormitories for workers is coming up quickly","timestamp":"2024-08-17T11:46:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}