{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-ecommerce-giant-jd-beats-estimates-for-quarterly-profit/articleshow/112551040.cms","title":"Chinese ecommerce giant JD beats estimates for quarterly profit","description":"The Chinese e-commerce giant saw a significant rise in quarterly profit, fueled by a mid-year sales festival and aggressive price cuts. Its second-quarter profit increased by 73.7% to 9.36 yuan per share, beating expectations. General and administrative costs decreased by 9.6%. Revenues rose marginally amid intensified competition in the market.","content":"Chinese e-commerce giant JD.com beat estimates for quarterly profit on Thursday, helped by a mid-year sales festival and aggressive price cuts that drove more cost-sensitive consumers to its platform.  U.S.-listed shares of the company rose 2.6% in premarket trading. Major Chinese vendors like JD.com and Alibaba have increased focus on discounting and lower-priced goods as the world's second largest economy sees a pullback from customers that as conscious about spending.  Excluding items, JD.com's second-quarter profit rose 73.7% to 9.36 yuan per share, compared with estimates of 6.07 yuan, according to LSEG data. JD.com's general and administrative costs reduced by 9.6% in the quarter.","cleaned_content":"chinese e commerce giant jd com beat estimates for quarterly profit on thursday helped by a mid year sales festival and aggressive price cuts that drove more cost sensitive consumers to its platform u s listed shares of the company rose \u003cTWO_PERCENT\u003e in premarket trading major chinese vendors like jd com and alibaba have increased focus on discounting and lower priced goods as the worlds second largest economy sees a pullback from customers that as conscious about spending excluding items jd coms second quarter profit rose \u003cSEVEN_TEN_PERCENT\u003e to \u003cNINE_\u003e yuan per share compared with estimates of \u003cSIX_\u003e yuan according to lseg data jd coms general and administrative costs reduced by \u003cNINE_PERCENT\u003e in the quarter","timestamp":"2024-08-15T22:43:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}