{"url":"https://economictimes.indiatimes.com/tech/technology/tamil-nadu-cm-mk-stalin-foxconn-chief-set-to-open-industrial-housing-hub-on-saturday/articleshow/112550040.cms","title":"Tamil Nadu CM MK Stalin, Foxconn chief set to open industrial housing hub on Saturday","description":"In 2020, the Tamil Nadu government sanctioned the establishment of the industrial housing facility at a cost of around Rs 706.5 crore at SIPCOT (State Industries Promotion Corporation of Tamil Nadu) Industrial Park, Vallam Vadagal, Sriperumbudur taluk, Kancheepuram district.","content":"Foxconn chairman Young Liu is expected to visit Tamil Nadu on Saturday to inaugurate a housing facility for industrial workers along with chief minister MK Stalin.The Vallam Vadagal Industrial Housing Project for accommodating workers of Foxconn and other companies is a step towards building large-scale infrastructure in the state to fuel India's electronics manufacturing dreams. Foxconn's facilities in China have entire cities that come up around them.In 2020, the Tamil Nadu government sanctioned the establishment of the industrial housing facility at a cost of Rs 706.5 crore. The project, with 3,120 units across a little over 30 acres at Sriperumbudur taluk in Kancheepuram district, is expected to accommodate around 18,720 workers.ET had reported in June that there were multiple industrial housing projects in various stages that were being spearheaded by the Tamil Nadu government. The Sriperumbudur project is the largest, but there are smaller projects. For instance, there is an industrial housing project in Shoolagiri in Krishnagiri district which is going to be tendered, a person in the know said. This is about 30 km from Tata Electronics’ facility.On Thursday, union minister of commerce \u0026 industry Piyush Goyal posted on microblogging site X that he met Liu and discussed the Taiwanese group's expansion and investment plans in India. \"Discussed Modi Government’s focus on leveraging India’s unique mix of talent \u0026 resources to boost domestic value addition and helping penetrate global supply chains,\" Goyal wrote.","cleaned_content":"foxconn chairman young liu is expected to visit tamil nadu on saturday to inaugurate a housing facility for industrial workers along with chief minister mk stalin the vallam vadagal industrial housing project for accommodating workers of foxconn and other companies is a step towards building large scale infrastructure in the state to fuel indias electronics manufacturing dreams foxconns facilities in china have entire cities that come up around them in \u003cTWO_THOUSAND\u003e the tamil nadu government sanctioned the establishment of the industrial housing facility at a cost of rs \u003cSEVEN_HUNDRED\u003e crore the project with \u003cTHREE_THOUSAND\u003e units across a little over \u003cTHREE_TEN\u003e acres at sriperumbudur taluk in kancheepuram district is expected to accommodate around \u003cONE_TEN_THOUSAND\u003e workers et had reported in june that there were multiple industrial housing projects in various stages that were being spearheaded by the tamil nadu government the sriperumbudur project is the largest but there are smaller projects for instance there is an industrial housing project in shoolagiri in krishnagiri district which is going to be tendered a person in the know said this is about \u003cTHREE_TEN\u003e km from tata electronics facility on thursday union minister of commerce industry piyush goyal posted on microblogging site x that he met liu and discussed the taiwanese groups expansion and investment plans in india discussed modi government s focus on leveraging india s unique mix of talent resources to boost domestic value addition and helping penetrate global supply chains goyal wrote","timestamp":"2024-08-16T06:00:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}