{"url":"https://economictimes.indiatimes.com/tech/information-tech/amid-criticism-cognizant-says-entry-level-salaries-not-rs-2-5-lakh-per-annum/articleshow/112606644.cms","title":"Amid criticism, Cognizant says entry-level salaries not Rs 2.5 lakh per annum","description":"The company also continuously invests in training and upskilling its associates in advanced digital technologies, sponsors higher education and leadership development programs with top institutions, to equip employees to work with global clients and accelerate their career growth, Gummadi clarified.","content":"Amid heavy criticism and trolling on social media regarding its freshers’ salary at as low as Rs 2.5 lakh per annum, IT major Cognizant on Sunday clarified that its recent job posting was grossly misrepresented. It said that the job posting, with compensation of Rs 2.52 lakhs annually was only for candidates with a 3-year undergraduate degree and not for engineering graduates.In a statement, Surya Gummadi, EVP and President, Cognizant Americas, said, “Our annual compensation for fresh engineering graduates ranges from Rs 4 lakhs to Rs 12 lakhs annually, depending on the category of hiring, skill set, and advanced industry accredited certifications. The compensation we offer for engineering graduates is highly competitive within the IT services peer group.”He further said that the US-headquartered IT major also invests approximately Rs 2 to 3 lakhs per associate in the initial years to train, mentor and upskill employees at entry level in advanced technologies. “This is for both engineering and non-engineering associates. Hundreds of our associates who joined us with a 3-year undergraduate degree, today hold key positions from Manager to Assistant Vice President across the company,” Gummadi said.Cognizant has been recruiting and upskilling freshers from engineering institutions as well as colleges offering degrees in science, arts, and commerce. Today, as AI increasingly powers modern businesses, Cognizant is creating new pathways for talent to thrive in India’s technology industry, Gummadi explained.","cleaned_content":"amid heavy criticism and trolling on social media regarding its freshers salary at as low as rs \u003cTWO_\u003e lakh per annum it major cognizant on sunday clarified that its recent job posting was grossly misrepresented it said that the job posting with compensation of rs \u003cTWO_\u003e lakhs annually was only for candidates with a \u003cTHREE_\u003e year undergraduate degree and not for engineering graduates in a statement surya gummadi evp and president cognizant americas said our annual compensation for fresh engineering graduates ranges from rs \u003cFOUR_\u003e lakhs to rs \u003cONE_TEN\u003e lakhs annually depending on the category of hiring skill set and advanced industry accredited certifications the compensation we offer for engineering graduates is highly competitive within the it services peer group he further said that the us headquartered it major also invests approximately rs \u003cTWO_\u003e to \u003cTHREE_\u003e lakhs per associate in the initial years to train mentor and upskill employees at entry level in advanced technologies this is for both engineering and non engineering associates hundreds of our associates who joined us with a \u003cTHREE_\u003e year undergraduate degree today hold key positions from manager to assistant vice president across the company gummadi said cognizant has been recruiting and upskilling freshers from engineering institutions as well as colleges offering degrees in science arts and commerce today as ai increasingly powers modern businesses cognizant is creating new pathways for talent to thrive in india s technology industry gummadi explained","timestamp":"2024-08-18T16:11:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}