{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-disputes-us-claims-on-china-ties-in-court-appeal/articleshow/112555255.cms","title":"TikTok disputes US claims on China ties in court appeal","description":"TikTok said on Thursday it is undisputed that the app's content recommendation engine and user data are stored in the US on cloud servers operated by Oracle and that content moderation decisions that affect US users are made in the US. Republican presidential candidate Donald Trump has joined TikTok and said in June he would never support a TikTok ban.","content":"TikTok told a federal appeals court on Thursday that the U.S. Department of Justice has misstated the social media app's ties to China, urging the court to overturn a law requiring China-based ByteDance to sell TikTok's U.S. assets or face a ban.  TikTok, which has sued to overturn the law, said the Justice Department has made factual errors in the case. The department's lawyers said last month that the app poses a national security risk by allowing the Chinese government to collect the data of Americans and covertly manipulate what content they see. TikTok said on Thursday it is undisputed that the app's content recommendation engine and user data are stored in the US on cloud servers operated by Oracle and that content moderation decisions that affect US users are made in the US.  Signed by President Joe Biden on April 24, the law gives ByteDance until January 19 to sell TikTok or face a ban. The White House says it wants to see Chinese-based ownership ended on national security grounds, but not a ban on TikTok.  The appeals court will hold oral arguments on the legal challenge on Sept. 16, putting the issue of TikTok's fate into the final weeks of the November 5 presidential election. ","cleaned_content":"tiktok told a federal appeals court on thursday that the u s department of justice has misstated the social media apps ties to china urging the court to overturn a law requiring china based bytedance to sell tiktoks u s assets or face a ban tiktok which has sued to overturn the law said the justice department has made factual errors in the case the departments lawyers said last month that the app poses a national security risk by allowing the chinese government to collect the data of americans and covertly manipulate what content they see tiktok said on thursday it is undisputed that the apps content recommendation engine and user data are stored in the us on cloud servers operated by oracle and that content moderation decisions that affect us users are made in the us signed by president joe biden on april \u003cTWO_TEN\u003e the law gives bytedance until january \u003cONE_TEN\u003e to sell tiktok or face a ban the white house says it wants to see chinese based ownership ended on national security grounds but not a ban on tiktok the appeals court will hold oral arguments on the legal challenge on sept \u003cONE_TEN\u003e putting the issue of tiktoks fate into the final weeks of the november \u003cFIVE_\u003e presidential election","timestamp":"2024-08-16T08:22:00+05:30","market_timestamp":"2024-08-16T09:15:00+05:30","off_market_hours":true}