{"url":"https://economictimes.indiatimes.com/tech/technology/isro-successfully-launches-earth-observation-satellite-aboard-sslv-d3/articleshow/112557818.cms","title":"Isro successfully launches earth observation satellite aboard SSLV-D3","description":"Isro said in a statement on X, \"The third developmental flight of SSLV is successful. The SSLV-D3 placed EOS-08 precisely into the orbit. This marks the successful completion of ISRO/DOS's SSLV Development Project.\" The smallest SSLV rocket, which measures about 34 metre in height, was launched from the first launch pad at 9:19 am with a one-hour window period.","content":"The Indian Space Research Organisation (Isro) on Friday successfully launched an earth observation satellite (EOS) carrying payloads featuring new technology developments in satellite mainframe systems on board a Small Satellite Launch Vehicle (SSLV) from the Satish Dhawan Space Centre in Sriharikota, Andhra Pradesh. The SSLV will be transferred to private industry eventually.“The third developmental flight of SSLV is successful,” Isro said in a post on X. “The SSLV-D3 placed EOS-08 precisely into the orbit. This marks the successful completion of ISRO/DOS's SSLV Development Project. With technology transfer, the Indian industry and NSIL will now produce SSLV for commercial missions.”","cleaned_content":"the indian space research organisation isro on friday successfully launched an earth observation satellite eos carrying payloads featuring new technology developments in satellite mainframe systems on board a small satellite launch vehicle sslv from the satish dhawan space centre in sriharikota andhra pradesh the sslv will be transferred to private industry eventually the third developmental flight of sslv is successful isro said in a post on x the sslv d3 placed eos \u003cEIGHT_\u003e precisely into the orbit this marks the successful completion of isro doss sslv development project with technology transfer the indian industry and nsil will now produce sslv for commercial missions","timestamp":"2024-08-16T10:52:00+05:30","market_timestamp":"2024-08-16T10:52:00+05:30","off_market_hours":false}