{"url":"https://economictimes.indiatimes.com/tech/technology/zappfresh-acquires-mumbai-based-bonsaro-to-expand-its-online-meat-delivery-business/articleshow/112652164.cms","title":"Zappfresh acquires Mumbai-based Bonsaro to expand its online meat delivery business","description":"Zappfresh acquired Mumbai's Bonsaro to bolster its presence in West India. This acquisition covers Bonsaro's operations and assets, with expectations of Rs 160 crore revenue by FY25. ZappFresh as a D2C brand has got funding from investors, including SIDBI VC, Dabur Family Office, Letsventure, Keritsu Forum, HT and several prominent angels from the food and tech sectors.","content":"Startup Zappfresh, which sells meat through its online platform, has acquired Mumbai-based Bonsaro to expand its business in West India. In a statement on Tuesday, Zappfresh said it has acquired Bonsaro (Majestic Aliments India Pvt Ltd), which specialises in poultry, goat, and seafood online delivery.  Zappfresh has taken over the entire operations and business of Bonsaro, including all assets, to expand its presence in the western region.  With this acquisition, the company is expecting a revenue of Rs 160 crore in FY 25 with a significant jump in profit.  Deepanshu Manchanda, the founder of Zappfresh, said, \"By integrating Bonsaro into our portfolio, we are poised to build a pan-India brand that operates in key markets. Mumbai, being a critical market, will contribute significantly to our footprint in the west.\"  \"Our expansion strategy remains disciplined - we expand one city at a time, ensuring profitability without compromising our bottom line. We only venture into new markets once we achieve break-even,\" he added. ","cleaned_content":"startup zappfresh which sells meat through its online platform has acquired mumbai based bonsaro to expand its business in west india in a statement on tuesday zappfresh said it has acquired bonsaro majestic aliments india pvt ltd which specialises in poultry goat and seafood online delivery zappfresh has taken over the entire operations and business of bonsaro including all assets to expand its presence in the western region with this acquisition the company is expecting a revenue of rs \u003cONE_HUNDRED\u003e crore in fy \u003cTWO_TEN\u003e with a significant jump in profit deepanshu manchanda the founder of zappfresh said by integrating bonsaro into our portfolio we are poised to build a pan india brand that operates in key markets mumbai being a critical market will contribute significantly to our footprint in the west our expansion strategy remains disciplined we expand one city at a time ensuring profitability without compromising our bottom line we only venture into new markets once we achieve break even he added","timestamp":"2024-08-20T15:53:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}