{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-shares-fall-2-after-antfin-singapore-likely-offloads-2-stake-via-block-deal/articleshow/112648632.cms","title":"Zomato shares fall 2% after Antfin Singapore likely offloads 2% stake via block deal","description":"Zomato Share Price: Shares of food aggregator Zomato dropped 2% to a day's low of Rs 257.10 on the BSE in the early trading session following reports that Antfin Singapore sold a 2.4% stake in the company through a block deal. Approximately 21 crore shares, equating to a 2.4% stake, were traded in this deal. The identities of the official parties involved in the transaction have not yet been revealed.","content":"Shares of the food aggregator Zomato fell by 2% to a day’s low of Rs 257.10 on the BSE in the early trading session after Antfin Singapore reportedly sold a 2.4% stake in the company via a block deal.According to reports, approximately 21 crore shares, representing a 2.4% stake in the online food delivery platform, were traded in the block deal.However, the official parties involved in the transaction have not yet been disclosed.Earlier, ET reported that Antfin Singapore was likely to sell shares in Zomato worth $408 million at a floor price of Rs 251.68 per share.Before today's block deal, Antfin Singapore held a 4.3% stake in the food delivery platform. At the floor price of Rs 251.68, the shares were offered at a 4.6% discount compared to Monday’s closing price of Rs 263.24 on the NSE.","cleaned_content":"shares of the food aggregator zomato fell by \u003cTWO_PERCENT\u003e to a day s low of rs \u003cTWO_HUNDRED\u003e on the bse in the early trading session after antfin singapore reportedly sold a \u003cTWO_PERCENT\u003e stake in the company via a block deal according to reports approximately \u003cTWO_TEN\u003e crore shares representing a \u003cTWO_PERCENT\u003e stake in the online food delivery platform were traded in the block deal however the official parties involved in the transaction have not yet been disclosed earlier et reported that antfin singapore was likely to sell shares in zomato worth \u003cFOUR_HUNDRED\u003e million at a floor price of rs \u003cTWO_HUNDRED\u003e per share before todays block deal antfin singapore held a \u003cFOUR_PERCENT\u003e stake in the food delivery platform at the floor price of rs \u003cTWO_HUNDRED\u003e the shares were offered at a \u003cFOUR_PERCENT\u003e discount compared to monday s closing price of rs \u003cTWO_HUNDRED\u003e on the nse","timestamp":"2024-08-20T12:57:00+05:30","market_timestamp":"2024-08-20T12:57:00+05:30","off_market_hours":false}