{"url":"https://economictimes.indiatimes.com/tech/technology/govt-likely-to-release-draft-data-protection-rules-within-a-month-ashwini-vaishnaw/articleshow/112630873.cms","title":"Centre to release draft data protection rules soon: IT minister Ashwini Vaishnaw","description":"The government is likely to release draft rules under the Digital Personal Data Protection Act within a month, union minister Ashwini Vaishnaw said on Monday. The minister said the government has first worked on digital implementation of the Act and framed rules accordingly.","content":"The government will soon come out with draft rules for implementing the Digital Personal Data Protection (DPDP) Act, union electronics and information technology minister Ashwini Vaishnaw said on Monday.The government has created the framework and structure that will be used to implement the Act, he told reporters. All of it will be done digitally, he added.“The simplicity of language approach, which we have adopted for all Bills, will be seen (in the rules),” the minister said.Following the release of the draft rules, the government is likely to give stakeholders 45-60 days to submit their feedback. The period may be extended if the need arises, a senior government official told ET.Last month, the government held extensive consultations with stakeholders from the industry on various aspects of the bill, including on the age-gating issue.","cleaned_content":"the government will soon come out with draft rules for implementing the digital personal data protection dpdp act union electronics and information technology minister ashwini vaishnaw said on monday the government has created the framework and structure that will be used to implement the act he told reporters all of it will be done digitally he added the simplicity of language approach which we have adopted for all bills will be seen in the rules the minister said following the release of the draft rules the government is likely to give stakeholders \u003cFOUR_TEN\u003e \u003cSIX_TEN\u003e days to submit their feedback the period may be extended if the need arises a senior government official told et last month the government held extensive consultations with stakeholders from the industry on various aspects of the bill including on the age gating issue","timestamp":"2024-08-19T21:35:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}