{"url":"https://economictimes.indiatimes.com/tech/technology/telegram-becomes-free-speech-flashpoint-after-founder-pavel-durovs-arrest/articleshow/112796740.cms","title":"Telegram becomes free speech flashpoint after founder Pavel Durov's arrest","description":"The company's growth -- it now has more than 900 million users -- has been driven partly by a commitment to free speech. Telegram's light oversight of what people say or do on the platform has helped people living under authoritarian governments communicate and organize. But it has also made the app a haven for disinformation, far-right extremism and other harmful content.","content":"Telegram, founded in 2013 by Russian entrepreneur Pavel Durov, has grown into one of the world's largest online communication tools and is central to everyday life in countries including Russia, Ukraine and India for messaging, getting independent news and exchanging views. The company's growth -- it now has more than 900 million users -- has been driven partly by a commitment to free speech. Telegram's light oversight of what people say or do on the platform has helped people living under authoritarian governments communicate and organize. But it has also made the app a haven for disinformation, far-right extremism and other harmful content. Many were shocked when reports emerged Saturday across French news media that Durov had been arrested in France on charges related to the spread of illicit material on the service. A French judicial official, speaking on condition of anonymity to discuss an ongoing investigation, confirmed Sunday evening that Durov was in police custody. As word spread online over the weekend, news of his detention became a flashpoint in a continuing debate about free speech on the internet. Elon Musk, the owner of X, which has adopted a similarly hands-off approach to content moderation, posted \"#FreePavel\" on his X account. \"It's 2030 in Europe and you're being executed for liking a meme,\" he also said. Leonid Volkov, formerly a top adviser to Alexei Navalny, the Russian opposition leader who died in prison last year, wrote on Telegram that although the platform had become a useful tool for criminals, Durov should be released. \"Durov is not an 'accomplice' to the crimes committed by Telegram users,\" he said.","cleaned_content":"telegram founded in \u003cTWO_THOUSAND\u003e by russian entrepreneur pavel durov has grown into one of the worlds largest online communication tools and is central to everyday life in countries including russia ukraine and india for messaging getting independent news and exchanging views the companys growth it now has more than \u003cNINE_HUNDRED\u003e million users has been driven partly by a commitment to free speech telegrams light oversight of what people say or do on the platform has helped people living under authoritarian governments communicate and organize but it has also made the app a haven for disinformation far right extremism and other harmful content many were shocked when reports emerged saturday across french news media that durov had been arrested in france on charges related to the spread of illicit material on the service a french judicial official speaking on condition of anonymity to discuss an ongoing investigation confirmed sunday evening that durov was in police custody as word spread online over the weekend news of his detention became a flashpoint in a continuing debate about free speech on the internet elon musk the owner of x which has adopted a similarly hands off approach to content moderation posted freepavel on his x account its \u003cTWO_THOUSAND\u003e in europe and youre being executed for liking a meme he also said leonid volkov formerly a top adviser to alexei navalny the russian opposition leader who died in prison last year wrote on telegram that although the platform had become a useful tool for criminals durov should be released durov is not an accomplice to the crimes committed by telegram users he said","timestamp":"2024-08-26T11:26:00+05:30","market_timestamp":"2024-08-26T11:26:00+05:30","off_market_hours":false}