{"url":"https://economictimes.indiatimes.com/tech/technology/festive-season-begins-with-a-bang-quick-commerce-sees-jump-in-sales/articleshow/112611967.cms","title":"Festive season begins with a bang: quick commerce sees jump in sales","description":"Blinkit and Zepto saw increased sales and expanded their product ranges for the festive season, targeting doubled SKUs for Diwali. With significant sales spikes for Rakshabandhan, the platforms also emphasised discounts and international orders. Mumbai-based rival Zepto said it aimed to deliver 3.5 million orders in the three days leading up to Rakshabandhan.","content":"In a sign of quick commerce platforms increasingly operating like horizontal online marketplaces, Blinkit, Swiggy Instamart, and Zepto are seeing higher sales and carrying a wider assortment at the onset of festive season with Rakshabandhan, top executives, brands and sellers told ET.Flipkart, Amazon India and others are in the middle of preparing for the upcoming festive season and quick commerce firms are bulking up for an action-packed Diwali this year, aiming to corner a greater market share. These platforms are also doubling the number of stock keeping units (SKUs) to be able to deliver a wider set of goods to consumers during the festive season. Zepto is working to roughly double its SKUs from the 10,000 on offer currently, people in the know told ET. A spokesperson for Zepto confirmed the development.In its June quarter report, Blinkit said it was selling up to 25,000 different SKUs in some locations.Ahead of Rakshabandhan on Monday, quick commerce platforms had seen a significant sales volume spike for products like rakhis, sweets, snacks, gifts and other festive items. At 9:45 pm on Sunday, Blinkit CEO Albinder Dhindsa said on X that it was selling 693 rakhis per minute.","cleaned_content":"in a sign of quick commerce platforms increasingly operating like horizontal online marketplaces blinkit swiggy instamart and zepto are seeing higher sales and carrying a wider assortment at the onset of festive season with rakshabandhan top executives brands and sellers told et flipkart amazon india and others are in the middle of preparing for the upcoming festive season and quick commerce firms are bulking up for an action packed diwali this year aiming to corner a greater market share these platforms are also doubling the number of stock keeping units skus to be able to deliver a wider set of goods to consumers during the festive season zepto is working to roughly double its skus from the \u003cONE_TEN_THOUSAND\u003e on offer currently people in the know told et a spokesperson for zepto confirmed the development in its june quarter report blinkit said it was selling up to \u003cTWO_TEN_THOUSAND\u003e different skus in some locations ahead of rakshabandhan on monday quick commerce platforms had seen a significant sales volume spike for products like rakhis sweets snacks gifts and other festive items at \u003cNINE_\u003e \u003cFOUR_TEN\u003e pm on sunday blinkit ceo albinder dhindsa said on x that it was selling \u003cSIX_HUNDRED\u003e rakhis per minute","timestamp":"2024-08-19T09:16:00+05:30","market_timestamp":"2024-08-19T09:16:00+05:30","off_market_hours":false}