{"url":"https://economictimes.indiatimes.com/tech/technology/aussie-logistics-software-maker-wisetech-hits-all-time-high-on-stellar-outlook/articleshow/112671528.cms","title":"Aussie logistics software maker WiseTech hits all-time high on stellar outlook","description":"WiseTech Global's shares soared as much as 21.8% to their all-time high of A$114.990, and was among the top three gainers in the ASX 200 benchmark index. The company expects 2025 revenue to be between A$1.30 billion and A$1.35 billion, the mid-point of which is in-line with consensus.","content":"Shares of WiseTech Global hit a record high on Wednesday, after the Australian logistics software maker forecast strong results for the current financial year and its 2024 underlying profit beat market expectations. WiseTech Global's shares soared as much as 21.8% to their all-time high of A$114.990, and was among the top three gainers in the ASX 200 benchmark index. It forecast operating earnings between A$660 million ($445.50 million) and A$700 million for the year ending June 30, 2025, ahead of Visible Alpha consensus of A$654.8 million and sharply above A$495.6 million in fiscal 2024. It expects 2025 revenue to be between A$1.30 billion and A$1.35 billion, the mid-point of which is in-line with consensus. WiseTech's 2024 underlying profit jumped 15% to A$283.5 million, 6% ahead of consensus. It declared a final dividend of 9.2 Australian cents per share.","cleaned_content":"shares of wisetech global hit a record high on wednesday after the australian logistics software maker forecast strong results for the current financial year and its \u003cTWO_THOUSAND\u003e underlying profit beat market expectations wisetech globals shares soared as much as \u003cTWO_TEN_PERCENT\u003e to their all time high of a \u003cONE_HUNDRED\u003e and was among the top three gainers in the asx \u003cTWO_HUNDRED\u003e benchmark index it forecast operating earnings between a \u003cSIX_HUNDRED\u003e million \u003cFOUR_HUNDRED\u003e million and a \u003cSEVEN_HUNDRED\u003e million for the year ending june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e ahead of visible alpha consensus of a \u003cSIX_HUNDRED\u003e million and sharply above a \u003cFOUR_HUNDRED\u003e million in fiscal \u003cTWO_THOUSAND\u003e it expects \u003cTWO_THOUSAND\u003e revenue to be between a \u003cONE_\u003e billion and a \u003cONE_\u003e billion the mid point of which is in line with consensus wisetechs \u003cTWO_THOUSAND\u003e underlying profit jumped \u003cONE_TEN_PERCENT\u003e to a \u003cTWO_HUNDRED\u003e million \u003cSIX_PERCENT\u003e ahead of consensus it declared a final dividend of \u003cNINE_\u003e australian cents per share","timestamp":"2024-08-21T11:14:00+05:30","market_timestamp":"2024-08-21T11:14:00+05:30","off_market_hours":false}