{"url":"https://economictimes.indiatimes.com/tech/technology/applied-materials-to-sign-mou-with-tn-government-to-establish-center-of-excellence/articleshow/112904693.cms","title":"Applied Materials to sign MoU with TN government to establish Center of Excellence","description":"The MoU is to be signed in San Francisco in the presence of the Tamil Nadu Chief Minister, MK Stalin and President of the Semiconductor Products Group at Applied Materials, Dr. Prabu Raja.","content":"Applied Materials will be signing a Memorandum of Understanding (MoU) with the Tamil Nadu government on Friday to establish an advanced AI-enabled technology development Center of Excellence focused on semiconductor manufacturing and equipment in Taramani, Chennai.The MoU is to be signed in San Francisco in the presence of the Tamil Nadu Chief Minister, MK Stalin and President of the Semiconductor Products Group at Applied Materials, Dr. Prabu Raja.“Investment in key sectors such as advanced electronics and semiconductors will help us achieve the $1 trillion economy goal by 2030. We want to make Tamil Nadu the most advanced knowledge and innovation hub in South Asia,” Tamil Nadu Chief Minister MK Stalin said in a statement.Stalin is on a 17-day trip to the United States to garner fresh investments.The state government said this Center will aim to work with local universities and industry partners to strengthen the semiconductor ecosystem in Tamil Nadu and help develop a future-ready talent pool to support chip industry growth. As part of this effort, the government said that Applied Materials plans to grow its workforce in the state to more than 500 technical jobs over the next few years.","cleaned_content":"applied materials will be signing a memorandum of understanding mou with the tamil nadu government on friday to establish an advanced ai enabled technology development center of excellence focused on semiconductor manufacturing and equipment in taramani chennai the mou is to be signed in san francisco in the presence of the tamil nadu chief minister mk stalin and president of the semiconductor products group at applied materials dr prabu raja investment in key sectors such as advanced electronics and semiconductors will help us achieve the \u003cONE_\u003e trillion economy goal by \u003cTWO_THOUSAND\u003e we want to make tamil nadu the most advanced knowledge and innovation hub in south asia tamil nadu chief minister mk stalin said in a statement stalin is on a \u003cONE_TEN\u003e day trip to the united states to garner fresh investments the state government said this center will aim to work with local universities and industry partners to strengthen the semiconductor ecosystem in tamil nadu and help develop a future ready talent pool to support chip industry growth as part of this effort the government said that applied materials plans to grow its workforce in the state to more than \u003cFIVE_HUNDRED\u003e technical jobs over the next few years","timestamp":"2024-08-30T02:30:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}