{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musks-x-is-leaving-san-francisco-city-officials-say-good-riddance/articleshow/112785378.cms","title":"Elon Musk's X is leaving San Francisco; city officials say 'good riddance'","description":"Elon Musk is shuttering his social media company's headquarters in the coming weeks and will move its last employees based there south to offices in Palo Alto and San Jose, California. New headquarters will be set up in Texas.","content":"San Francisco's long relationship with X is nearly over -- and city officials are far from heartbroken. Elon Musk is shuttering his social media company's headquarters in the coming weeks and will move its last employees based there south to offices in Palo Alto and San Jose, California. New headquarters will be set up in Texas. But city officials are not lamenting the exit. X bears little resemblance to the company that San Francisco wooed with a tax break more than a decade ago, when it was Twitter, to help anchor a budding tech hub in a downtown neighborhood known as Mid-Market. The pandemic, and Musk's 2022 acquisition of the company and subsequent gutting of its workforce, reduced the headquarters to a ghost town. \"I share the perspective that most San Franciscans have, which is good riddance,\" said City Attorney David Chiu, who as a member of the city's Board of Supervisors backed the tax break that lured Twitter to Mid-Market in 2012. Musk and X did not respond to requests for comment.","cleaned_content":"san franciscos long relationship with x is nearly over and city officials are far from heartbroken elon musk is shuttering his social media companys headquarters in the coming weeks and will move its last employees based there south to offices in palo alto and san jose california new headquarters will be set up in texas but city officials are not lamenting the exit x bears little resemblance to the company that san francisco wooed with a tax break more than a decade ago when it was twitter to help anchor a budding tech hub in a downtown neighborhood known as mid market the pandemic and musks \u003cTWO_THOUSAND\u003e acquisition of the company and subsequent gutting of its workforce reduced the headquarters to a ghost town i share the perspective that most san franciscans have which is good riddance said city attorney david chiu who as a member of the citys board of supervisors backed the tax break that lured twitter to mid market in \u003cTWO_THOUSAND\u003e musk and x did not respond to requests for comment","timestamp":"2024-08-25T21:18:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}