{"url":"https://economictimes.indiatimes.com/tech/technology/intel-board-member-quit-after-differences-over-chipmakers-revival-plan/articleshow/112843092.cms","title":"Intel board member quit after differences over chipmaker's revival plan","description":"Lip-Bu Tan, a semiconductor industry veteran, had said he was leaving the board because of a personal decision to \"reprioritize various commitments\" and that he remained \"supportive of the company and its important work,\" in a regulatory filing on Thursday.","content":"The sudden resignation of a high-profile Intel board member came after differences with CEO Pat Gelsinger and other directors over what the director considered the U.S. company's bloated workforce, risk-averse culture and lagging artificial intelligence strategy, according to three sources familiar with the matter.  Lip-Bu Tan, a semiconductor industry veteran, had said he was leaving the board because of a personal decision to \"reprioritize various commitments\" and that he remained \"supportive of the company and its important work,\" in a regulatory filing on Thursday. The former CEO of chip-software company Cadence Design joined Intel's board two years ago as part of a plan to restore Intel's place as the leading global chipmaker. The board expanded Tan's responsibilities in October 2023, authorizing him to oversee manufacturing operations. Over time, Tan grew frustrated by the company's large workforce, its approach to contract manufacturing and Intel's risk-averse and bureaucratic culture, according to the sources, who were not authorized to speak publicly. The circumstances around Tan's exit have not previously been reported. The departure of the industry veteran, who is well-regarded by investors, over Intel's strategy illustrates the uncertainty of its turnaround efforts. ","cleaned_content":"the sudden resignation of a high profile intel board member came after differences with ceo pat gelsinger and other directors over what the director considered the u s companys bloated workforce risk averse culture and lagging artificial intelligence strategy according to three sources familiar with the matter lip bu tan a semiconductor industry veteran had said he was leaving the board because of a personal decision to reprioritize various commitments and that he remained supportive of the company and its important work in a regulatory filing on thursday the former ceo of chip software company cadence design joined intels board two years ago as part of a plan to restore intels place as the leading global chipmaker the board expanded tans responsibilities in october \u003cTWO_THOUSAND\u003e authorizing him to oversee manufacturing operations over time tan grew frustrated by the companys large workforce its approach to contract manufacturing and intels risk averse and bureaucratic culture according to the sources who were not authorized to speak publicly the circumstances around tans exit have not previously been reported the departure of the industry veteran who is well regarded by investors over intels strategy illustrates the uncertainty of its turnaround efforts","timestamp":"2024-08-27T20:17:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}