{"url":"https://economictimes.indiatimes.com/tech/technology/apple-eyes-bigger-slice-of-indias-streaming-market-with-airtel-deal/articleshow/112858730.cms","title":"Apple eyes bigger slice of India's streaming market with Airtel deal","description":"Apple is collaborating with India's Airtel to offer free access to Apple TV+ and Apple Music for Airtel's premium customers. This strategic move aims to expand Apple's presence in India's competitive entertainment market, as it competes with Netflix, Amazon Prime Video, and Disney+ Hotstar. Airtel's Wynk music app will be discontinued as part of this arrangement.","content":"Apple is tying up with India's Bharti Airtel to offer the telecom firm's premium customers its music and video streaming services for free, giving the U.S. giant access to thousands of consumers in the world's most populous nation.With mostly English-language content, Apple TV+ is a small player in India's $28 billion media and entertainment market, where its rivals include Netflix, Amazon Prime Video , Disney+ Hotstar and billionaire Mukesh Ambani's JioCinema.The move comes as competition tightens in India and an $8.5-billion merger of the Indian media assets of Reliance and Walt Disney - which have a streaming service each - faces close scrutiny from antitrust regulators.\"Apple TV+ will come bundled with premium Airtel WiFi and Postpaid plans,\" Airtel said in a statement on Tuesday, though the companies did not disclose a deal value for the partnership or information on costs.Apple Music will also be available for current premium users of Airtel's Wynk music app, which will be shut down. Its employees are being subsumed by the company, Airtel said.","cleaned_content":"apple is tying up with indias bharti airtel to offer the telecom firms premium customers its music and video streaming services for free giving the u s giant access to thousands of consumers in the worlds most populous nation with mostly english language content apple tv is a small player in indias \u003cTWO_TEN\u003e billion media and entertainment market where its rivals include netflix amazon prime video disney hotstar and billionaire mukesh ambanis jiocinema the move comes as competition tightens in india and an \u003cEIGHT_\u003e billion merger of the indian media assets of reliance and walt disney which have a streaming service each faces close scrutiny from antitrust regulators apple tv will come bundled with premium airtel wifi and postpaid plans airtel said in a statement on tuesday though the companies did not disclose a deal value for the partnership or information on costs apple music will also be available for current premium users of airtels wynk music app which will be shut down its employees are being subsumed by the company airtel said","timestamp":"2024-08-28T12:32:00+05:30","market_timestamp":"2024-08-28T12:32:00+05:30","off_market_hours":false}