{"url":"https://economictimes.indiatimes.com/tech/technology/kenyas-safaricom-urges-new-requirements-for-satellite-providers-like-starlink/articleshow/112754552.cms","title":"Kenya's Safaricom urges new requirements for satellite providers like Starlink","description":"Safaricom, which the Kenyan government owns, Britain's Vodafone and South Africa's Vodacom wrote to the Communications Authority of Kenya's director-general last month to express concerns about the granting of independent licenses to satellite internet providers.","content":"Kenya's biggest telecoms company Safaricom has urged regulators to consider requiring satellite internet providers such as Elon Musk's Starlink to partner with local mobile network operators. Starlink, a unit of SpaceX, operates in several African countries but has faced regulatory challenges registering in others. It launched in Kenya in July last year.  The company has since rolled out increasingly competitive pricing options and plans that allow Kenyans to rent the required hardware rather than having to purchase it for more than $350.  Safaricom, which is owned by the Kenyan government, Britain's Vodafone and South Africa's Vodacom wrote to the Communications Authority of Kenya's director-general last month to express concerns about the granting of independent licenses to satellite internet providers.  The letter was shared with Reuters by Safaricom after part of it began to circulate on social media. ","cleaned_content":"kenyas biggest telecoms company safaricom has urged regulators to consider requiring satellite internet providers such as elon musks starlink to partner with local mobile network operators starlink a unit of spacex operates in several african countries but has faced regulatory challenges registering in others it launched in kenya in july last year the company has since rolled out increasingly competitive pricing options and plans that allow kenyans to rent the required hardware rather than having to purchase it for more than \u003cTHREE_HUNDRED\u003e safaricom which is owned by the kenyan government britains vodafone and south africas vodacom wrote to the communications authority of kenyas director general last month to express concerns about the granting of independent licenses to satellite internet providers the letter was shared with reuters by safaricom after part of it began to circulate on social media","timestamp":"2024-08-24T09:33:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}