{"url":"https://economictimes.indiatimes.com/tech/technology/shopify-notifies-merchants-it-will-discontinue-its-advanced-cash-on-delivery-app-by-month-end/articleshow/112728736.cms","title":"Shopify notifies merchants it will discontinue its advanced cash-on-delivery app by month end","description":"Shopify has not given a reason for discontinuing the COD app in India, which is still largely a cash-driven market where several small and medium merchants rely on cash on delivery for their online orders. The company helps small and medium businesses build and sell online stores, has recommended a few alternative apps, including Indian e-commerce enabler GoKwik’s Kwik COD app and COD King.","content":"Canadian e-commerce enabler Shopify has notified all its ecommerce merchants in India that it will discontinue its advanced cash-on-delivery (COD) app by the end of the month, which could potentially impact over nearly 50,000 e-commerce and direct-to-consumer merchants in India, whose large portion of business comes through cash on delivery.The company has not given a reason for discontinuing the COD app in India, which is still largely a cash-driven market where several small and medium merchants rely on cash on delivery for their online orders. Shopify, which helps small and medium businesses build and sell online stores, has recommended a few alternative apps, including Indian e-commerce enabler GoKwik’s Kwik COD app and COD King.“The Indian eCommerce market is unique. It’s still primarily cash-driven. If we go deeper into the tier 3 tier 4 cities, COD becomes high, with a high risk of returns (RTO). In some cases, brands cater to over 90% of COD orders, with 60% being RTOed. With Shopify’s ACOD app phasing out, brands can potentially incur RTO losses in just a few weeks if they don’t port to an alternative app,” said Said Chirag Taneja, co-founder and CEO, GoKwik whose Kwik COD is being recommended by Shopify currently as the alternative to ACOD app.Offering COD as a payment option is crucial for eCommerce businesses just beginning their journey in the Indian market. Shoppers often face a significant challenge in trusting relatively new brands. Cash-on-delivery serves as a safe payment option and encourages them to make purchases. This, in turn, helps new eCommerce businesses increase their conversion rates and expand their customer base more effectively.The chances of RTO are significantly higher in COD orders than in prepaid orders. GoKwik offers a range of solutions that can predict customer behaviour and help sellers prevent RTOs, while ensuring an expansive COD serviceability across regions. RTO is when undelivered orders are returned before delivery causing a major setback to operations for ecommmerce brands as they add to logistics costs, inventory blockage, loss of true conversions and leaking profitability.","cleaned_content":"canadian e commerce enabler shopify has notified all its ecommerce merchants in india that it will discontinue its advanced cash on delivery cod app by the end of the month which could potentially impact over nearly \u003cFIVE_TEN_THOUSAND\u003e e commerce and direct to consumer merchants in india whose large portion of business comes through cash on delivery the company has not given a reason for discontinuing the cod app in india which is still largely a cash driven market where several small and medium merchants rely on cash on delivery for their online orders shopify which helps small and medium businesses build and sell online stores has recommended a few alternative apps including indian e commerce enabler gokwik s kwik cod app and cod king the indian ecommerce market is unique it s still primarily cash driven if we go deeper into the tier \u003cTHREE_\u003e tier \u003cFOUR_\u003e cities cod becomes high with a high risk of returns rto in some cases brands cater to over \u003cNINE_TEN_PERCENT\u003e of cod orders with \u003cSIX_TEN_PERCENT\u003e being rtoed with shopify s acod app phasing out brands can potentially incur rto losses in just a few weeks if they don t port to an alternative app said said chirag taneja co founder and ceo gokwik whose kwik cod is being recommended by shopify currently as the alternative to acod app offering cod as a payment option is crucial for ecommerce businesses just beginning their journey in the indian market shoppers often face a significant challenge in trusting relatively new brands cash on delivery serves as a safe payment option and encourages them to make purchases this in turn helps new ecommerce businesses increase their conversion rates and expand their customer base more effectively the chances of rto are significantly higher in cod orders than in prepaid orders gokwik offers a range of solutions that can predict customer behaviour and help sellers prevent rtos while ensuring an expansive cod serviceability across regions rto is when undelivered orders are returned before delivery causing a major setback to operations for ecommmerce brands as they add to logistics costs inventory blockage loss of true conversions and leaking profitability","timestamp":"2024-08-23T11:00:00+05:30","market_timestamp":"2024-08-23T11:00:00+05:30","off_market_hours":false}