{"url":"https://economictimes.indiatimes.com/tech/technology/partnership-between-banks-and-fintechs-a-win-win-proposition-ex-rbi-deputy-governor/articleshow/112747530.cms","title":"Partnership between banks and fintechs a win-win proposition: ex-RBI deputy governor","description":"At Bandhan Bank's foundation day, ex-RBI deputy governor S S Mundra highlighted the symbiotic relationship between banks and fintech firms. He underlined data security, advocating against outsourcing core functions. Mundra pointed out the challenges in harnessing data for inclusion and innovation while stressing early risk management and cautioning about digital currency.","content":"Former deputy governor of Reserve Bank of India (RBI) S S Mundra on Friday said that partnership between banks and fintech companies is a win-win proposition. Speaking at the foundation day lecture of private lender Bandhan Bank, Mundra said that data security and privacy is important and thus no core activity should be outsourced. \"Partnership between banks and fintechs is a good and win-win proposition. Given the importance of data security and privacy, no core activity should be outsourced. The relation is akin to that of the crocodile and the plover bird\", he said. The large animal and the small bird share a mutually beneficial relationship. The plover picks tiny bits of meat from between the crocodile's teeth. The reptile needs the bird to keep its mouth free from infection, while the plover requires the crocodile to get its food. Mundra said regarding innovation and inclusion, an integrated network to harness data is a challenge to the bankers. Banks need to promote inclusion, he said, adding that there is a huge data assymetry between banks and customers. ","cleaned_content":"former deputy governor of reserve bank of india rbi s s mundra on friday said that partnership between banks and fintech companies is a win win proposition speaking at the foundation day lecture of private lender bandhan bank mundra said that data security and privacy is important and thus no core activity should be outsourced partnership between banks and fintechs is a good and win win proposition given the importance of data security and privacy no core activity should be outsourced the relation is akin to that of the crocodile and the plover bird he said the large animal and the small bird share a mutually beneficial relationship the plover picks tiny bits of meat from between the crocodiles teeth the reptile needs the bird to keep its mouth free from infection while the plover requires the crocodile to get its food mundra said regarding innovation and inclusion an integrated network to harness data is a challenge to the bankers banks need to promote inclusion he said adding that there is a huge data assymetry between banks and customers","timestamp":"2024-08-23T23:05:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}