{"url":"https://economictimes.indiatimes.com/tech/technology/meta-faces-3-6-million-fine-in-brazil-for-allowing-bogus-havan-ads/articleshow/112874802.cms","title":"Meta faces $3.6 million fine in Brazil for allowing bogus Havan ads","description":"A Santa Catarina state judge ruled on Monday that Meta had 48 hours to block ads that Havan did not contract and which mention it or its owner, billionaire Luciano Hang. If Meta does not comply, fines can go up to 20 million reais.","content":"Meta Platforms faces a fine of up to $3.62 million after losing a lawsuit by Brazilian department store chain Havan that accused the social media company of accepting paid advertisements that fraudulently use the retailer's name to deceive consumers. A Santa Catarina state judge ruled on Monday that Meta had 48 hours to block ads that Havan did not contract and which mention it or its owner, billionaire Luciano Hang. If Meta does not comply, fines can go up to 20 million reais. In her ruling, Judge Joana Ribeiro said it was unacceptable for Meta to sell ads in an insecure way to sustain its business model.  In a statement on Monday, Havan called the decision \"a landmark\" in protecting the company's and Hang's rights.  Meta declined to comment. The company can appeal the decision.","cleaned_content":"meta platforms faces a fine of up to \u003cTHREE_\u003e million after losing a lawsuit by brazilian department store chain havan that accused the social media company of accepting paid advertisements that fraudulently use the retailers name to deceive consumers a santa catarina state judge ruled on monday that meta had \u003cFOUR_TEN\u003e hours to block ads that havan did not contract and which mention it or its owner billionaire luciano hang if meta does not comply fines can go up to \u003cTWO_TEN\u003e million reais in her ruling judge joana ribeiro said it was unacceptable for meta to sell ads in an insecure way to sustain its business model in a statement on monday havan called the decision a landmark in protecting the companys and hangs rights meta declined to comment the company can appeal the decision","timestamp":"2024-08-28T22:59:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}