{"url":"https://economictimes.indiatimes.com/tech/technology/dutch-data-protection-watchdog-hits-uber-with-324-million-fine-over-driver-data/articleshow/112802970.cms","title":"Dutch data protection watchdog hits Uber with $324 million fine over driver data","description":"The Dutch data protection watchdog said Monday it hit ride-hailing app Uber with a 290-million-euro ($324 million) fine over the transfer of personal data of European drivers to US servers. It is the DPA's third fine against Uber following fines of 600,000 euros in 2018 and 10 million euros last year.","content":"The Dutch data protection watchdog said Monday it hit ride-hailing app Uber with a 290-million-euro ($324 million) fine over the transfer of personal data of European drivers to US servers.The regulator said the transfers were a \"serious violation\" of the European Union's General Data Protection Regulation (GDPR), as they failed to appropriately protect driver information.\"Uber did not meet the requirements of the GDPR to ensure the level of protection to the data with regard to transfers to the US. That is very serious,\" Dutch Data Protection Authority (DPA) chairman Aleid Wolfsen said in a statement.The DPA said Uber collected sensitive information of European drivers, including taxi licences, location data, photos, payment details, identity documents, \"and in some cases even criminal and medical data of drivers\".Over a two-year period, the DPA said, the information was transferred to Uber's US headquarters without using transfer tools.","cleaned_content":"the dutch data protection watchdog said monday it hit ride hailing app uber with a \u003cTWO_HUNDRED\u003e million euro \u003cTHREE_HUNDRED\u003e million fine over the transfer of personal data of european drivers to us servers the regulator said the transfers were a serious violation of the european unions general data protection regulation gdpr as they failed to appropriately protect driver information uber did not meet the requirements of the gdpr to ensure the level of protection to the data with regard to transfers to the us that is very serious dutch data protection authority dpa chairman aleid wolfsen said in a statement the dpa said uber collected sensitive information of european drivers including taxi licences location data photos payment details identity documents and in some cases even criminal and medical data of drivers over a two year period the dpa said the information was transferred to ubers us headquarters without using transfer tools","timestamp":"2024-08-26T14:43:00+05:30","market_timestamp":"2024-08-26T14:43:00+05:30","off_market_hours":false}