{"url":"https://economictimes.indiatimes.com/tech/information-tech/tencent-likely-to-sell-2-1-stake-in-pb-fintech-via-block-deal-for-rs-1610-crore-report/articleshow/112871333.cms","title":"Tencent likely to sell 2.1% stake in PB Fintech via block deal for Rs 1,610 crore: Report","description":"The floor price for the issue is set at Rs 1,660.2 per share, a 4.4% discount to Wednesday's closing price. Tencent, which held a 4.6% stake in the Policybazaar parent company as of June 30, 2024, is reportedly selling its stake.","content":"Chinese multinational technology conglomerate Tencent is likely to sell a 2.1% stake in PB Fintech via block deal at an estimated price of Rs 1,610 crore. The floor price for the issue is expected at Rs 1,660.2 per share, which is at a discount of 4.4% over Wednesday’s closing price of Rs 1737.10.The news was reported by ET Now. Tencent held a 4.6% stake representing over 1.94 crore shares in the Policybazaar parent through Tencent Cloud Europe B.V. as of June 30, 2024.The multibagger stock has delivered 129% returns over the past one-year period while its returns in 2024 so far have been to the tune of 115%. This is a significant outperformance over Nifty, which has yielded 30% in the last one year while returning 15% on a year-to-date basis.The company had reported a consolidated net profit of Rs 60 crore for the quarter ended June 30, 2024, against a loss of Rs 12 crore reported in the year-ago period. The revenue grew 52% YoY to Rs 1,010 crore.","cleaned_content":"chinese multinational technology conglomerate tencent is likely to sell a \u003cTWO_PERCENT\u003e stake in pb fintech via block deal at an estimated price of rs \u003cONE_THOUSAND\u003e crore the floor price for the issue is expected at rs \u003cONE_THOUSAND\u003e per share which is at a discount of \u003cFOUR_PERCENT\u003e over wednesday s closing price of rs \u003cONE_THOUSAND\u003e the news was reported by et now tencent held a \u003cFOUR_PERCENT\u003e stake representing over \u003cONE_\u003e crore shares in the policybazaar parent through tencent cloud europe b v as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the multibagger stock has delivered \u003cONE_HUNDRED_PERCENT\u003e returns over the past one year period while its returns in \u003cTWO_THOUSAND\u003e so far have been to the tune of \u003cONE_HUNDRED_PERCENT\u003e this is a significant outperformance over nifty which has yielded \u003cTHREE_TEN_PERCENT\u003e in the last one year while returning \u003cONE_TEN_PERCENT\u003e on a year to date basis the company had reported a consolidated net profit of rs \u003cSIX_TEN\u003e crore for the quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e against a loss of rs \u003cONE_TEN\u003e crore reported in the year ago period the revenue grew \u003cFIVE_TEN_PERCENT\u003e yoy to rs \u003cONE_THOUSAND\u003e crore","timestamp":"2024-08-28T19:23:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}