{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-cfo-prateek-aggarwal-resigns-shiv-walia-announced-successor/articleshow/112631381.cms","title":"HCLTech CFO Prateek Aggarwal resigns, Shiv Walia announced successor","description":"Prateek, who has served the company for over a decade and has been in this role since Oct 1, 2018, will continue to be with HCLTech till September 6, the firm said in a BSE filing. Shiv Walia worked in HCL subsidiaries between April 1993 and March 1998, and has been with HCLTech since April 1998.","content":"In yet another top leadership churn in the IT industry, HCLTech’s Chief Financial Officer (CFO) Prateek Aggarwal stepped down to pursue opportunities outside the firm. The company immediately announced his successor, Shiv Walia, who will take over on September 6.Prateek, who has served the company for over a decade and has been in this role since Oct 1, 2018, will continue to be with HCLTech till September 6, the firm said in a BSE filing.Walia is currently Corporate Vice President \u0026 Global Head of FP\u0026A and Business Finance Operations. He began his professional career with HCL in 1993 and served across several finance leadership roles over the last many years. “As a seasoned finance leader, Shiv Walia has played key roles across our various geographies and businesses through multiple business cycles and has extensive knowledge of HCLTech’ s businesses and clients,\" said C Vijayakumar, CEO and MD, HCLTech.“His financial acumen, international experience and pragmatic approach will be invaluable as we respond to technology shifts with speed and continue our profitable growth journey. I also want to thank Prateek for his contributions to HCLTech over the last 12 years and wish him the best for his future endeavours.”Walia previously worked in HCL subsidiaries between April 1993 and March 1998, and has been with HCLTech since April 1998. ","cleaned_content":"in yet another top leadership churn in the it industry hcltech s chief financial officer cfo prateek aggarwal stepped down to pursue opportunities outside the firm the company immediately announced his successor shiv walia who will take over on september \u003cSIX_\u003e prateek who has served the company for over a decade and has been in this role since oct \u003cONE_\u003e \u003cTWO_THOUSAND\u003e will continue to be with hcltech till september \u003cSIX_\u003e the firm said in a bse filing walia is currently corporate vice president global head of fp a and business finance operations he began his professional career with hcl in \u003cONE_THOUSAND\u003e and served across several finance leadership roles over the last many years as a seasoned finance leader shiv walia has played key roles across our various geographies and businesses through multiple business cycles and has extensive knowledge of hcltech s businesses and clients said c vijayakumar ceo and md hcltech his financial acumen international experience and pragmatic approach will be invaluable as we respond to technology shifts with speed and continue our profitable growth journey i also want to thank prateek for his contributions to hcltech over the last \u003cONE_TEN\u003e years and wish him the best for his future endeavours walia previously worked in hcl subsidiaries between april \u003cONE_THOUSAND\u003e and march \u003cONE_THOUSAND\u003e and has been with hcltech since april \u003cONE_THOUSAND\u003e","timestamp":"2024-08-20T08:13:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}