{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-singapore-unit-acquires-1-2-billion-shares-of-india-subsidiary-to-aid-expansion/articleshow/112702961.cms","title":"Foxconn Singapore unit acquires 1.2 billion shares of India subsidiary to aid expansion","description":"Foxconn's announcement comes soon after chairman Young Liu met PM Narendra Modi and heads of state in the country. This move is meant to strengthen the capital of the India subsidiary. The contract manufacturer has been betting big on India and wants to move up the value chain beyond smartphones.","content":"Foxconn Singapore, a subsidiary of the Taiwanese contract manufacturer, on Wednesday said it has acquired 1.203 billion ordinary shares of its India unit Foxconn Hon Hai Technology India Mega Development, valued at approximately $144 million.The announcement comes right after chairman Young Liu met Prime Minister Narendra Modi in New Delhi, and several heads of state. It is being viewed as a move to boost the capital of the Indian subsidiary. The Singapore entity has basically subscribed to or purchased more shares in the Indian company, thus pumping in more cash into the Indian subsidiary. Foxconn also made larger investments of a similar kind on the same day in the US, Mexico and Europe as well. India seems to be part of that push.Liu told ET last week that Foxconn is looking to move up the value chain beyond smartphones and make products for sectors like information and communication technology (ICT), electric vehicles (EV), energy and digital health in its next growth phase in India.“Foxconn is very well known for its vertical integration capabilities. Definitely, we want to move up on the value chain as much as we can in India. That’s what we will be doing in the ICT sector,” Liu said on the sidelines of the inauguration of the company’s massive industrial housing project in Sriperumbudur.","cleaned_content":"foxconn singapore a subsidiary of the taiwanese contract manufacturer on wednesday said it has acquired \u003cONE_\u003e billion ordinary shares of its india unit foxconn hon hai technology india mega development valued at approximately \u003cONE_HUNDRED\u003e million the announcement comes right after chairman young liu met prime minister narendra modi in new delhi and several heads of state it is being viewed as a move to boost the capital of the indian subsidiary the singapore entity has basically subscribed to or purchased more shares in the indian company thus pumping in more cash into the indian subsidiary foxconn also made larger investments of a similar kind on the same day in the us mexico and europe as well india seems to be part of that push liu told et last week that foxconn is looking to move up the value chain beyond smartphones and make products for sectors like information and communication technology ict electric vehicles ev energy and digital health in its next growth phase in india foxconn is very well known for its vertical integration capabilities definitely we want to move up on the value chain as much as we can in india that s what we will be doing in the ict sector liu said on the sidelines of the inauguration of the company s massive industrial housing project in sriperumbudur","timestamp":"2024-08-22T12:28:00+05:30","market_timestamp":"2024-08-22T12:28:00+05:30","off_market_hours":false}