{"url":"https://economictimes.indiatimes.com/tech/technology/social-media-platform-x-back-up-after-brief-outage-downdetector-shows/articleshow/112854310.cms","title":"Social media platform X back up after brief outage, Downdetector shows","description":"Social media platform X experienced an outage lasting less than an hour on Tuesday night, with peak reports of more than 36,500 outages. Downdetector indicated the issues affected users in the U.S., Canada, and the UK. By 11:46 p.m. ET, reports had dropped significantly, but the cause remains unknown.","content":"Social media platform X was back up on Tuesday night after an outage that lasted less than an hour, according to outage tracking website Downdetector.com. Downdetector, which tracks outages by collating status reports from several sources including users, showed less than 500 reports of outages in the U.S. as of 11:46 p.m. ET. There were more than 36,500 reports at the peak of the outage at 11:18 p.m. ET. The reports of outages in Canada and the UK dropped to under 100, from over 3,300 in Canada and 1,600 in the UK as of 11:20 p.m. ET. The cause of the outage is not yet known.","cleaned_content":"social media platform x was back up on tuesday night after an outage that lasted less than an hour according to outage tracking website downdetector com downdetector which tracks outages by collating status reports from several sources including users showed less than \u003cFIVE_HUNDRED\u003e reports of outages in the u s as of \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e p m et there were more than \u003cTHREE_TEN_THOUSAND\u003e reports at the peak of the outage at \u003cONE_TEN\u003e \u003cONE_TEN\u003e p m et the reports of outages in canada and the uk dropped to under \u003cONE_HUNDRED\u003e from over \u003cTHREE_THOUSAND\u003e in canada and \u003cONE_THOUSAND\u003e in the uk as of \u003cONE_TEN\u003e \u003cTWO_TEN\u003e p m et the cause of the outage is not yet known","timestamp":"2024-08-28T10:12:00+05:30","market_timestamp":"2024-08-28T10:12:00+05:30","off_market_hours":false}