{"url":"https://economictimes.indiatimes.com/tech/technology/silicon-valley-backers-want-harris-to-prioritise-abortion-rights-pro-tech-policies/articleshow/112866522.cms","title":"Silicon Valley backers want Harris to prioritise abortion rights, pro-tech policies","description":"Of about 800 venture capitalists who signed an open letter of support, 225 chose to detail their reasons for endorsing the Democratic candidate and the policies they favor in a survey being reported first by Reuters.","content":"Venture capitalists pledging support for Kamala Harris' White House campaign listed priorities in a survey released on Wednesday that include women's reproductive rights, climate change and a friendlier stance toward startups. Of about 800 venture capitalists who signed an open letter of support, 225 chose to detail their reasons for endorsing the Democratic candidate and the policies they favor in a survey being reported first by Reuters. Nearly all of the 225 thought it was a mistake for the Supreme Court to overturn Roe v. Wade, which recognized abortion rights. Some felt this hurt women at work. \"These are not social issues. These are actually business issues,\" said Leslie Feinzaig, CEO of Graham \u0026 Walker who started the pledge. Investors and executives said they viewed Vice President Harris, a Californian with ties to Silicon Valley, as a tech-savvy candidate open to engaging with industry. They voiced nostalgia for the Obama White House, which a decade ago recruited from and lauded the technology sector. Politicians in Washington have since taken a more critical tone. The open letter, called \"VCs for Kamala\" and disclosed in July, includes such venture capitalists as Reid Hoffman from Greylock and Vinod Khosla from Khosla Ventures. The 225 who filled out the survey did so anonymously. They were 62% men, 66% white, largely aged 35 to 64. Although no one was asked to provide party affiliation, among those who self-disclosed, 70% were Democrats and 30% were Republicans or independents, the poll organizers said.","cleaned_content":"venture capitalists pledging support for kamala harris white house campaign listed priorities in a survey released on wednesday that include womens reproductive rights climate change and a friendlier stance toward startups of about \u003cEIGHT_HUNDRED\u003e venture capitalists who signed an open letter of support \u003cTWO_HUNDRED\u003e chose to detail their reasons for endorsing the democratic candidate and the policies they favor in a survey being reported first by reuters nearly all of the \u003cTWO_HUNDRED\u003e thought it was a mistake for the supreme court to overturn roe v wade which recognized abortion rights some felt this hurt women at work these are not social issues these are actually business issues said leslie feinzaig ceo of graham walker who started the pledge investors and executives said they viewed vice president harris a californian with ties to silicon valley as a tech savvy candidate open to engaging with industry they voiced nostalgia for the obama white house which a decade ago recruited from and lauded the technology sector politicians in washington have since taken a more critical tone the open letter called vcs for kamala and disclosed in july includes such venture capitalists as reid hoffman from greylock and vinod khosla from khosla ventures the \u003cTWO_HUNDRED\u003e who filled out the survey did so anonymously they were \u003cSIX_TEN_PERCENT\u003e men \u003cSIX_TEN_PERCENT\u003e white largely aged \u003cTHREE_TEN\u003e to \u003cSIX_TEN\u003e although no one was asked to provide party affiliation among those who self disclosed \u003cSEVEN_TEN_PERCENT\u003e were democrats and \u003cTHREE_TEN_PERCENT\u003e were republicans or independents the poll organizers said","timestamp":"2024-08-28T16:45:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}