{"url":"https://economictimes.indiatimes.com/tech/technology/microsoft-to-host-cybersecurity-summit-after-crowdstrike-induced-it-outage/articleshow/112746082.cms","title":"Microsoft to host cybersecurity summit after CrowdStrike-induced IT outage","description":"Microsoft will host a cybersecurity summit in September after a faulty update from CrowdStrike led to a global IT outage in July. This event, scheduled for September 10 at Microsoft's Redmond HQ, aims to address issues affecting 8.5 million Windows devices across multiple industries, including airlines, banks, and healthcare.","content":"Microsoft said on Friday it would hold a summit in September on improving cybersecurity systems, after a faulty update from CrowdStrike caused a global IT outage last month. The conference marks the first big step by Microsoft to address the issues that affected nearly 8.5 million Windows devices on July 19, disrupting operations across industries ranging from major airlines to banks and healthcare. The event will be held on Sept. 10 at the company's headquarters in Redmond, Washington. Microsoft will invite government representatives to the gathering, it said. \"The CrowdStrike outage in July presents important lessons for us to apply as an ecosystem,\" Microsoft said. The outage raised concerns that many organizations are not well prepared to implement contingency plans when a single point of failure such as an IT system, or a piece of software within it, goes down.","cleaned_content":"microsoft said on friday it would hold a summit in september on improving cybersecurity systems after a faulty update from crowdstrike caused a global it outage last month the conference marks the first big step by microsoft to address the issues that affected nearly \u003cEIGHT_\u003e million windows devices on july \u003cONE_TEN\u003e disrupting operations across industries ranging from major airlines to banks and healthcare the event will be held on sept \u003cONE_TEN\u003e at the companys headquarters in redmond washington microsoft will invite government representatives to the gathering it said the crowdstrike outage in july presents important lessons for us to apply as an ecosystem microsoft said the outage raised concerns that many organizations are not well prepared to implement contingency plans when a single point of failure such as an it system or a piece of software within it goes down","timestamp":"2024-08-23T21:25:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}