{"url":"https://economictimes.indiatimes.com/tech/technology/apple-taps-insider-kevan-parekh-as-cfo-replacing-luca-maestri/articleshow/112821389.cms","title":"Apple taps insider Kevan Parekh as CFO, replacing Luca Maestri","description":"\"It appears that the transition to the new CFO is planned and orderly, which is the most important question. Maestri staying on with Apple is also very important, as it removes the risk of financial questions,\" D.A. Davidson analyst Gil Luria said.","content":"Tech giant Apple on Monday named insider Kevan Parekh as its chief financial officer, replacing company veteran Luca Maestri who will transition from the role on Jan. 1, 2025.  The leadership change comes ahead of Apple's multiple product launch this fall season, which analysts have called the biggest software upgrade for the iPhone.  It includes artificial intelligence features, which are crucial for Apple as it looks to reverse a slowdown in global sales, particularly in China, and better compete with rivals who have rolled out AI upgrades.  Parekh, who has been with Apple for more than a decade and will join the company's executive committee, most recently served as vice president of financial planning and analysis.  \"It appears that the transition to the new CFO is planned and orderly, which is the most important question. Maestri staying on with Apple is also very important, as it removes the risk of financial questions,\" D.A. Davidson analyst Gil Luria said. ","cleaned_content":"tech giant apple on monday named insider kevan parekh as its chief financial officer replacing company veteran luca maestri who will transition from the role on jan \u003cONE_\u003e \u003cTWO_THOUSAND\u003e the leadership change comes ahead of apples multiple product launch this fall season which analysts have called the biggest software upgrade for the iphone it includes artificial intelligence features which are crucial for apple as it looks to reverse a slowdown in global sales particularly in china and better compete with rivals who have rolled out ai upgrades parekh who has been with apple for more than a decade and will join the companys executive committee most recently served as vice president of financial planning and analysis it appears that the transition to the new cfo is planned and orderly which is the most important question maestri staying on with apple is also very important as it removes the risk of financial questions d a davidson analyst gil luria said","timestamp":"2024-08-27T08:25:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}