{"url":"https://economictimes.indiatimes.com/tech/technology/tech-firms-must-comply-with-malaysias-laws-minister-says-amid-backlash-over-social-media-licensing-plan/articleshow/112836543.cms","title":"Tech firms must comply with Malaysia's laws, minister says amid backlash over social media licensing plan","description":"The Asia Internet Coalition (AIC) - whose members include Google, Meta and X - had made the call in an open letter to Prime Minister Anwar Ibrahim, citing a lack of clarity over the proposed regulations.","content":"Tech companies must comply with local laws to continue operating in Malaysia, a minister said on Tuesday, after an industry group urged the government to pause a plan to require social media platforms to apply for a regulatory licence.  The Asia Internet Coalition (AIC) - whose members include Google, Meta and X - had made the call in an open letter to Prime Minister Anwar Ibrahim, citing a lack of clarity over the proposed regulations.  Communications Minister Fahmi Fadzil said the government was ready to discuss the proposed regulations with the AIC and other industry groups but had no plans to delay their implementation, aimed at tackling rising cybercrime.  Under the plan, social media platforms and messaging services with more than eight million users would be required to obtain a licence and could face legal action if they failed to do so by Jan. 1, 2025.  \"Big tech companies are big but our laws are bigger. If they want to operate in Malaysia, they must respect and comply with our laws,\" Fahmi told reporters, adding earlier talks with representatives of social media firms on the plan had been positive.","cleaned_content":"tech companies must comply with local laws to continue operating in malaysia a minister said on tuesday after an industry group urged the government to pause a plan to require social media platforms to apply for a regulatory licence the asia internet coalition aic whose members include google meta and x had made the call in an open letter to prime minister anwar ibrahim citing a lack of clarity over the proposed regulations communications minister fahmi fadzil said the government was ready to discuss the proposed regulations with the aic and other industry groups but had no plans to delay their implementation aimed at tackling rising cybercrime under the plan social media platforms and messaging services with more than eight million users would be required to obtain a licence and could face legal action if they failed to do so by jan \u003cONE_\u003e \u003cTWO_THOUSAND\u003e big tech companies are big but our laws are bigger if they want to operate in malaysia they must respect and comply with our laws fahmi told reporters adding earlier talks with representatives of social media firms on the plan had been positive","timestamp":"2024-08-27T16:15:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}