{"url":"https://economictimes.indiatimes.com/tech/technology/custody-giant-state-street-expands-crypto-services-in-new-partnership/articleshow/112653448.cms","title":"Custody giant State Street expands crypto services in new partnership","description":"State Street has joined forces with Swiss firm Taurus to introduce new digital asset services. These services include converting real-world assets into tradeable tokens to cater to rising institutional demand. The service aims to assist clients in tokenizing assets and securely holding crypto assets, enhancing trading transparency and security.","content":"State Street is partnering with Swiss crypto company Taurus to offer new digital asset services, including turning real-world assets into tradeable tokens, to tap growing institutional demand for such investments, the U.S. financial services provider told Reuters. As cryptocurrencies have spread in the financial system through regulated products including futures and exchange-traded funds, they are drawing more interest from institutions seeking ways to hedge inflation and diversify portfolios. Through the partnership, State Street, which provides crypto fund administration and accounting services, will hold clients' crypto assets and help them create tokenized assets, such as funds and other securities. Reuters is the first to report on the partnership. Tokenizing involves converting ownership rights to traditional assets into digital tokens on a blockchain, a decentralized database controlled by all its users. Proponents say the consensus mechanism, which enhances transparency and security, makes the assets easier to trade.","cleaned_content":"state street is partnering with swiss crypto company taurus to offer new digital asset services including turning real world assets into tradeable tokens to tap growing institutional demand for such investments the u s financial services provider told reuters as cryptocurrencies have spread in the financial system through regulated products including futures and exchange traded funds they are drawing more interest from institutions seeking ways to hedge inflation and diversify portfolios through the partnership state street which provides crypto fund administration and accounting services will hold clients crypto assets and help them create tokenized assets such as funds and other securities reuters is the first to report on the partnership tokenizing involves converting ownership rights to traditional assets into digital tokens on a blockchain a decentralized database controlled by all its users proponents say the consensus mechanism which enhances transparency and security makes the assets easier to trade","timestamp":"2024-08-20T16:32:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}