{"url":"https://economictimes.indiatimes.com/tech/technology/x-to-close-operations-in-brazil-effective-immediately/articleshow/112594982.cms","title":"Elon Musk shuts X operations in Brazil ‘effective immediately’","description":"X claims Moraes secretly threatened one of its legal representatives in Brazil with arrest if it did not comply with legal orders to take down some content from its platform. Brazil's Supreme Court, where Moraes has a seat, did not immediately respond to a request for comment.","content":"Media platform X said on Saturday it would close its operations in Brazil \"effective immediately\" due to what it called \"censorship orders\" by Brazilian judge Alexandre de Moraes.X, owned by billionaire Elon Musk, claims Moraes secretly threatened one of the company's legal representatives in the South American country with arrest if it did not comply with legal orders to take down some content from its platform.The social media giant published pictures of a document allegedly signed by Moraes which says a daily fine of 20,000 reais ($3,653) and an arrest decree would be imposed against X representative Rachel Nova Conceicao if the platform did not fully comply to Moraes' orders.\"To protect the safety of our staff, we have made the decision to close our operation in Brazil, effective immediately,\" X said.Brazil's Supreme Court, where Moraes has a seat, told Reuters it would not speak on the matter and would not confirm nor deny the authenticity of the document shared by X.","cleaned_content":"media platform x said on saturday it would close its operations in brazil effective immediately due to what it called censorship orders by brazilian judge alexandre de moraes x owned by billionaire elon musk claims moraes secretly threatened one of the companys legal representatives in the south american country with arrest if it did not comply with legal orders to take down some content from its platform the social media giant published pictures of a document allegedly signed by moraes which says a daily fine of \u003cTWO_TEN_THOUSAND\u003e reais \u003cTHREE_THOUSAND\u003e and an arrest decree would be imposed against x representative rachel nova conceicao if the platform did not fully comply to moraes orders to protect the safety of our staff we have made the decision to close our operation in brazil effective immediately x said brazils supreme court where moraes has a seat told reuters it would not speak on the matter and would not confirm nor deny the authenticity of the document shared by x","timestamp":"2024-08-19T14:34:00+05:30","market_timestamp":"2024-08-19T14:34:00+05:30","off_market_hours":false}