{"url":"https://economictimes.indiatimes.com/tech/technology/x-braces-for-brazil-shutdown-as-legal-spat-between-elon-musk-judge-intensifies/articleshow/112911317.cms","title":"X braces for Brazil shutdown as legal spat between Elon Musk, judge intensifies","description":"Social media platform X, owned by Elon Musk, faces impending shutdown in Brazil after failing to comply with a Supreme Court order. The court also blocked Musk's Starlink’s local bank accounts. The dispute centers around compliance with local laws and Musk's allegations of censorship.","content":"Social media giant X said it expected Brazil's top court to order it to shut down late Thursday, as a pitched legal battle played out over compliance with local laws and owner Elon Musk's insistence the platform is being punished for resisting censorship. The popular social media platform posted the announcement from its global affairs account, saying it expected Supreme Court Judge Alexandre de Moraes to order the shutdown \"soon,\" moments after a court-imposed deadline passed.  Earlier on Thursday, the Supreme Court blocked the local bank accounts of billionaire Musk's Starlink satellite internet firm, in which he owns a 40% stake, while the underlying feud over X put it on the brink of being shuttered in one of its top markets. The two firms are part of Musk's sprawling business empire which also includes rocket company SpaceX and electric car giant Tesla. The billionaire is the owner of X and the CEO of Tesla. Starlink had previously confirmed it received an order from the judge that prevents the company from conducting financial transactions in Brazil.","cleaned_content":"social media giant x said it expected brazils top court to order it to shut down late thursday as a pitched legal battle played out over compliance with local laws and owner elon musks insistence the platform is being punished for resisting censorship the popular social media platform posted the announcement from its global affairs account saying it expected supreme court judge alexandre de moraes to order the shutdown soon moments after a court imposed deadline passed earlier on thursday the supreme court blocked the local bank accounts of billionaire musks starlink satellite internet firm in which he owns a \u003cFOUR_TEN_PERCENT\u003e stake while the underlying feud over x put it on the brink of being shuttered in one of its top markets the two firms are part of musks sprawling business empire which also includes rocket company spacex and electric car giant tesla the billionaire is the owner of x and the ceo of tesla starlink had previously confirmed it received an order from the judge that prevents the company from conducting financial transactions in brazil","timestamp":"2024-08-30T08:27:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}