{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-extends-partnership-to-transform-primarks-tech-ops-in-5-years/articleshow/112890867.cms","title":"TCS extends partnership, to transform Primark's tech ops in 5 years","description":"TCS has been working with Primark since 2016. Apart from driving business-critical integration programmes and stabilising core platforms for the retailer, TCS has also improved cybersecurity capabilities, improving stability and reliability of processes and systems.","content":"Continuing its deal-win momentum in the UK, IT behemoth Tata Consultancy Services (TCS) on Thursday extended its partnership with international fashion retailer, Primark. Under the leadership of K Krithivasan, TCS has sealed at least three billion-dollar deals in the UK market.Over the next five years, TCS will facilitate transformation of Primark’s technology operations to support its ambitious plans for global growth, the IT major said in a filing with BSE. UK gives around 17% of the company’s revenue.TCS has been working with Primark since 2016. Apart from driving business-critical integration programmes and stabilising core platforms for the retailer, TCS has also improved cybersecurity capabilities, improving stability and reliability of processes and systems. As part of this expanded partnership, TCS will help reduce time-to-market for the retailer, along with helping Primark adopt a more agile and product-based operating model by enabling automation through intelligent automation and DevOps technologies. This new operating model will integrate and optimise application development, testing and maintenance processes.Andrew Brothers, chief information officer, Primark, said, “We’re expanding our partnership with TCS to build a robust, resilient and reliable IT operating environment to become a more efficient, technology-led global organization with the agility to quickly adapt to changing demands in a fast-paced industry. Working with TCS will provide us with the ongoing operational stability and accountability needed to support our business to scale. This will allow us to respond to market trends and customer preferences in a timely manner.”","cleaned_content":"continuing its deal win momentum in the uk it behemoth tata consultancy services tcs on thursday extended its partnership with international fashion retailer primark under the leadership of k krithivasan tcs has sealed at least three billion dollar deals in the uk market over the next five years tcs will facilitate transformation of primark s technology operations to support its ambitious plans for global growth the it major said in a filing with bse uk gives around \u003cONE_TEN_PERCENT\u003e of the company s revenue tcs has been working with primark since \u003cTWO_THOUSAND\u003e apart from driving business critical integration programmes and stabilising core platforms for the retailer tcs has also improved cybersecurity capabilities improving stability and reliability of processes and systems as part of this expanded partnership tcs will help reduce time to market for the retailer along with helping primark adopt a more agile and product based operating model by enabling automation through intelligent automation and devops technologies this new operating model will integrate and optimise application development testing and maintenance processes andrew brothers chief information officer primark said we re expanding our partnership with tcs to build a robust resilient and reliable it operating environment to become a more efficient technology led global organization with the agility to quickly adapt to changing demands in a fast paced industry working with tcs will provide us with the ongoing operational stability and accountability needed to support our business to scale this will allow us to respond to market trends and customer preferences in a timely manner","timestamp":"2024-08-29T13:53:00+05:30","market_timestamp":"2024-08-29T13:53:00+05:30","off_market_hours":false}