{"url":"https://economictimes.indiatimes.com/tech/technology/meity-directs-social-media-sites-to-remove-content-identifying-deceased-from-rg-kar-hospital/articleshow/112689866.cms","title":"MeitY directs social media sites to remove content identifying deceased from RG Kar Hospital","description":"\"We direct that all references to the name of the deceased in the above incident, photographs and video clips shall forthwith be removed from all social media platforms and electronic media in compliance with this order,\" MeitY said in a statement.","content":"The Ministry of Electronics and Information Technology (MeitY) on Wednesday asked social media platforms operating in India to remove all references to the name of the deceased in the RG Kar Medical college incident in accordance with a recent Supreme Court order dated August 20.\"We direct that all references to the name of the deceased in the above incident, photographs and video clips shall forthwith be removed from all social media platforms and electronic media in compliance with this order,\" MeitY said in a statement. It also urged all social media companies to ensure that such sensitive information is not further disseminated. \"Failure to comply with the Supreme Court’s order may result in legal consequences and further regulatory action,\" the Ministry further stated.It also directed all the social media platforms to inform the Ministry about the action taken in response to the compliance of Supreme Court order.","cleaned_content":"the ministry of electronics and information technology meity on wednesday asked social media platforms operating in india to remove all references to the name of the deceased in the rg kar medical college incident in accordance with a recent supreme court order dated august \u003cTWO_TEN\u003e we direct that all references to the name of the deceased in the above incident photographs and video clips shall forthwith be removed from all social media platforms and electronic media in compliance with this order meity said in a statement it also urged all social media companies to ensure that such sensitive information is not further disseminated failure to comply with the supreme court s order may result in legal consequences and further regulatory action the ministry further stated it also directed all the social media platforms to inform the ministry about the action taken in response to the compliance of supreme court order","timestamp":"2024-08-21T22:40:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}