{"url":"https://economictimes.indiatimes.com/tech/technology/kerala-to-set-up-first-robotics-park-in-thrissur-says-minister-p-rajeeve/articleshow/112767961.cms","title":"Kerala to set up first robotics park in Thrissur: minister P Rajeeve","description":"Kerala unveiled its inaugural robotics park in Thrissur, designed to enhance AI advancement and partnerships. The park comprises sections for public education, robotic courses, production, and startup incubation. This initiative, introduced at a Robotics Roundtable, will also receive government support through investments and loans. The Global Investors Meet is set for February next year.","content":"Kerala will set up its first robotics park in Thrissur, heralding a new chapter that will boost innovation, collaboration and growth in the field of artificial intelligence, Minister for Industries P Rajeeve said on Friday. At a Robotics Roundtable organised here, Rajeeve said the project will have four sections. It is to be built on a 10-acre plot in the central Kerala town with the help of district panchayat. Rajeeve also informed that the state government will conduct the Global Investors Meet on February 21 and 22 next year in the city. The roundtable was organised at the Grand Hyatt hotel in Bolgatty Island by Kerala State Industrial Development Corporation (KSIDC) in association with the Department of Industry and Commerce. Noting that the Robotics Roundtable was the beginning of the journey of the state to transform the society into a hub of hi-tech manufacturing technology industries, the minister said the Global Investors Meet will be the culmination of the precursor events, including roundtable series focusing on 12 sectors, road shows and the publishing of more documents on 22 priority sectors. \"KSIDC is ready to give equity investments in five robotic startups this financial year. After scrutinising applications, KSIDC will give equity investments as a fund of funds. Besides, KSIDC will increase scale-up loan for robotic startups from of Rs one crore to Rs two crore,\" Rajeeve said. The minister also gave away awards to the top exhibitors at the expo held on the sidelines of the event. The awardees included Fuselage Innovations, Genrobotics, Benditta Bionics, Xalten Systems, Estro Tech and Asimov Robotics. Principal Secretary (Industries and Commerce) APM Mohammed Hanish was also present. Earlier in the day, Inker Robotics CEO Rahul Balachandran, while addressing a session, said the proposed robotic park will have RoboLand as its first section, facilitating the public to get first-hand knowledge about the world of robotics. ","cleaned_content":"kerala will set up its first robotics park in thrissur heralding a new chapter that will boost innovation collaboration and growth in the field of artificial intelligence minister for industries p rajeeve said on friday at a robotics roundtable organised here rajeeve said the project will have four sections it is to be built on a \u003cONE_TEN\u003e acre plot in the central kerala town with the help of district panchayat rajeeve also informed that the state government will conduct the global investors meet on february \u003cTWO_TEN\u003e and \u003cTWO_TEN\u003e next year in the city the roundtable was organised at the grand hyatt hotel in bolgatty island by kerala state industrial development corporation ksidc in association with the department of industry and commerce noting that the robotics roundtable was the beginning of the journey of the state to transform the society into a hub of hi tech manufacturing technology industries the minister said the global investors meet will be the culmination of the precursor events including roundtable series focusing on \u003cONE_TEN\u003e sectors road shows and the publishing of more documents on \u003cTWO_TEN\u003e priority sectors ksidc is ready to give equity investments in five robotic startups this financial year after scrutinising applications ksidc will give equity investments as a fund of funds besides ksidc will increase scale up loan for robotic startups from of rs one crore to rs two crore rajeeve said the minister also gave away awards to the top exhibitors at the expo held on the sidelines of the event the awardees included fuselage innovations genrobotics benditta bionics xalten systems estro tech and asimov robotics principal secretary industries and commerce apm mohammed hanish was also present earlier in the day inker robotics ceo rahul balachandran while addressing a session said the proposed robotic park will have roboland as its first section facilitating the public to get first hand knowledge about the world of robotics","timestamp":"2024-08-24T21:16:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}