{"url":"https://economictimes.indiatimes.com/tech/technology/pavel-durov-detained-in-france-has-nothing-to-hide-telegram-says/articleshow/112806359.cms","title":"Pavel Durov, detained in France, has nothing to hide, Telegram says","description":"Durov, a 39-year-old billionaire cast as \"Russia's Mark Zuckerberg\", was arrested at Le Bourget airport outside Paris shortly after landing on a private jet late on Saturday from Azerbaijan.","content":"Pavel Durov, the Russian-born founder of Telegram who was arrested in Paris, has nothing to hide it is absurd to hold an owner responsible for abuse of the messaging and social media platform, Telegram said in a statement. Durov, a 39-year-old billionaire cast as \"Russia's Mark Zuckerberg\", was arrested at Le Bourget airport outside Paris shortly after landing on a private jet late on Saturday from Azerbaijan. The arrest of the Telegram CEO prompted a warning from Moscow to Paris that he should be accorded his rights, and criticism from X owner Elon Musk who said that free speech in Europe was under attack. Though there has been no official French comment on the arrest, French news channel franceinfo said that Durov was still in custody on Monday and that he could remain in custody for up to four days. Telegram, in a short statement released after midnight Paris time, gave no details of the arrest but said the Dubai-based company abided by European Union laws and its moderation was \"within industry standards and constantly improving\".","cleaned_content":"pavel durov the russian born founder of telegram who was arrested in paris has nothing to hide it is absurd to hold an owner responsible for abuse of the messaging and social media platform telegram said in a statement durov a \u003cTHREE_TEN\u003e year old billionaire cast as russias mark zuckerberg was arrested at le bourget airport outside paris shortly after landing on a private jet late on saturday from azerbaijan the arrest of the telegram ceo prompted a warning from moscow to paris that he should be accorded his rights and criticism from x owner elon musk who said that free speech in europe was under attack though there has been no official french comment on the arrest french news channel franceinfo said that durov was still in custody on monday and that he could remain in custody for up to four days telegram in a short statement released after midnight paris time gave no details of the arrest but said the dubai based company abided by european union laws and its moderation was within industry standards and constantly improving","timestamp":"2024-08-26T16:21:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}