{"url":"https://economictimes.indiatimes.com/tech/technology/energy-company-chevron-to-set-up-1-billion-bengaluru-tech-centre/articleshow/112660029.cms","title":"Energy company Chevron to set up $1 billion Bengaluru tech centre","description":"Chevron Engineering and Innovation Excellence Center (ENGINE), to be located near Bellandur in Bengaluru, will also recruit approximately 600 professionals by 2025-end and plans to add more positions over time, Sahni added. The company already has three tech centres in Houston in Texas, Richmond in California and Aberdeen in Scotland.","content":"Energy giant Chevron has earmarked $1 billion to set up a global capability centre (GCC) in Bengaluru. The firm plans to make the Bengaluru facility the largest innovation centre outside of the US, said Akshay Sahni, incoming country head, Chevron India, in an interaction with ET.The earmarked amount will be invested over 5-6 years and in hiring not only lateral talent and freshers, but also in partnership with vendors in India who will help setting up the centre, as well as developing technology solutions.Chevron Engineering and Innovation Excellence Center (ENGINE), to be located near Bellandur in Bengaluru, will also recruit approximately 600 professionals by 2025-end and plans to add more positions over time, Sahni added. The company already has three tech centres in Houston in Texas, Richmond in California and Aberdeen in Scotland.Explaining the intent behind the India centre, he said, “Our strategic intent is not just cost savings. What we plan to achieve here is that when you bring work from different parts of the world in one location and especially one that is talent rich like India and especially a city like Bangalore, we can standardize and centralize and streamline a lot of the work that is happening in different parts of the world.”“You can remove inefficiencies. You can remove repetitive work which has a much larger impact than just cost savings, because now you are able to apply standard solutions across multiple things that are happening. You can scale your technology solutions faster, so if work is happening in different locations, it’s very difficult to apply digital solutions,” he further explained.","cleaned_content":"energy giant chevron has earmarked \u003cONE_\u003e billion to set up a global capability centre gcc in bengaluru the firm plans to make the bengaluru facility the largest innovation centre outside of the us said akshay sahni incoming country head chevron india in an interaction with et the earmarked amount will be invested over \u003cFIVE_\u003e \u003cSIX_\u003e years and in hiring not only lateral talent and freshers but also in partnership with vendors in india who will help setting up the centre as well as developing technology solutions chevron engineering and innovation excellence center engine to be located near bellandur in bengaluru will also recruit approximately \u003cSIX_HUNDRED\u003e professionals by \u003cTWO_THOUSAND\u003e end and plans to add more positions over time sahni added the company already has three tech centres in houston in texas richmond in california and aberdeen in scotland explaining the intent behind the india centre he said our strategic intent is not just cost savings what we plan to achieve here is that when you bring work from different parts of the world in one location and especially one that is talent rich like india and especially a city like bangalore we can standardize and centralize and streamline a lot of the work that is happening in different parts of the world you can remove inefficiencies you can remove repetitive work which has a much larger impact than just cost savings because now you are able to apply standard solutions across multiple things that are happening you can scale your technology solutions faster so if work is happening in different locations it s very difficult to apply digital solutions he further explained","timestamp":"2024-08-21T07:30:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}