{"url":"https://economictimes.indiatimes.com/tech/technology/fintech-firm-pop-hits-monthly-run-rate-of-1-million-upi-transactions-in-two-months/articleshow/112809815.cms","title":"Fintech firm Pop hits monthly run rate of 1 million UPI transactions in two months","description":"​​Pop has reached more than 1.5 million transactions since its launch. The app's UPI rewards, via Popcoins, are merchant-funded and can be redeemed to buy products from direct-to-consumer (D2C) brands in categories such as beauty, personal care, electronics, fashion, and home goods - all housed within the Pop app.","content":"Fintech firm Pop, founded by a team of former Flipkart employees, has achieved a monthly run rate of one million transactions in the second month since launch and aims to be among the top ten UPI apps by the end of this year.Pop has reached more than 1.5 million transactions since its launch. The app's UPI rewards, via Popcoins, are merchant-funded and can be redeemed to buy products from direct-to-consumer (D2C) brands in categories such as beauty, personal care, electronics, fashion, and home goods - all housed within the Pop app. With this approach, the company is leveraging daily usage phenomena like UPI to help unlock a larger and relevant user base which is interested in buying new-age brands with minimal marketing spend.“At Pop, we have always focused on sustainable business growth. With UPI transactions soaring, we saw the need for a business model innovation. We are offering credit card-style rewards on UPI, funded primarily by merchants. Pop rewards customers with 2% Popcoins on every UPI transaction, which can be redeemed for competitive discounts across over 500 new-age brands on our app,” Bhargav Errangi, founder of Pop, said.","cleaned_content":"fintech firm pop founded by a team of former flipkart employees has achieved a monthly run rate of one million transactions in the second month since launch and aims to be among the top ten upi apps by the end of this year pop has reached more than \u003cONE_\u003e million transactions since its launch the apps upi rewards via popcoins are merchant funded and can be redeemed to buy products from direct to consumer d2c brands in categories such as beauty personal care electronics fashion and home goods all housed within the pop app with this approach the company is leveraging daily usage phenomena like upi to help unlock a larger and relevant user base which is interested in buying new age brands with minimal marketing spend at pop we have always focused on sustainable business growth with upi transactions soaring we saw the need for a business model innovation we are offering credit card style rewards on upi funded primarily by merchants pop rewards customers with \u003cTWO_PERCENT\u003e popcoins on every upi transaction which can be redeemed for competitive discounts across over \u003cFIVE_HUNDRED\u003e new age brands on our app bhargav errangi founder of pop said","timestamp":"2024-08-26T17:28:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}