{"url":"https://economictimes.indiatimes.com/tech/technology/brazils-top-court-threatens-to-suspend-x-in-the-country/articleshow/112896859.cms","title":"Brazil's top court threatens to suspend X in the country","description":"​Earlier this month, X announced it would close its operations and fire its staff in Brazil due to what it called \"censorship orders\" from Moraes, while adding the firm's service would remain available for users in Brazil.","content":"Brazilian Supreme Court Justice Alexandre de Moraes ordered billionaire Elon Musk on Wednesday to name a legal representative for his messaging platform X in Brazil within 24 hours or face the site's suspension in the country, a court decision showed on Wednesday evening. Earlier this month, X announced it would close its operations and fire its staff in Brazil due to what it called \"censorship orders\" from Moraes, while adding the firm's service would remain available for users in Brazil. The Supreme Court posted a screenshot of Wednesday's court decision on its X account, tagging Musk's and X's Global Government Affairs accounts. In the document, Moraes says that under the country's law regulating internet issues, companies that do not respect Brazilian legislation or the confidentiality of private information could have their activities temporarily suspended. Hours after the judge's decision, Musk said on X that Moraes \"has repeatedly broken the laws he has sworn to uphold.\" ","cleaned_content":"brazilian supreme court justice alexandre de moraes ordered billionaire elon musk on wednesday to name a legal representative for his messaging platform x in brazil within \u003cTWO_TEN\u003e hours or face the sites suspension in the country a court decision showed on wednesday evening earlier this month x announced it would close its operations and fire its staff in brazil due to what it called censorship orders from moraes while adding the firms service would remain available for users in brazil the supreme court posted a screenshot of wednesdays court decision on its x account tagging musks and xs global government affairs accounts in the document moraes says that under the countrys law regulating internet issues companies that do not respect brazilian legislation or the confidentiality of private information could have their activities temporarily suspended hours after the judges decision musk said on x that moraes has repeatedly broken the laws he has sworn to uphold","timestamp":"2024-08-29T16:46:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}