{"url":"https://economictimes.indiatimes.com/tech/information-tech/hcltech-eyes-new-revenue-streams-to-diversify-risks/articleshow/112904597.cms","title":"HCLTech eyes new revenue streams to diversify risks","description":"To capitalise on new growth avenues, Shiv Nadar-founded IT services company HCLTech is looking to strategically expand its presence in markets like India, Africa, and the Middle East. HCLTech outlined its growth strategies to more than 100 analysts who attended an ‘Investor Day 2024’ meet in Mumbai.","content":"Billionaire Shiv Nadar-founded IT services firm HCLTech is looking to diversify risks and unlock new revenue streams, by expanding its presence in markets such as India, Africa and the Middle East.HCLTech outlined its growth strategies to more than 100 analysts who attended an ‘Investor Day 2024’ meet hosted by the company in Mumbai on Wednesday. The company also highlighted its strength in engineering, research \u0026 development (ER\u0026D), and plans to leverage increasing semiconductor demand, expand market participation in focus areas and new frontier markets, and grow within its top current and potential clients, some of the analysts who attended the event said.“The company wants to tap high-potential regions and expand, amid the ongoing slowdown in the core American markets denting business over the past five-six quarters,” one of the analysts said on the condition of anonymity. “HCLTech spoke of improving the mix of verticals and geographies, gaining of market share, organic development of digital skills, its clients’ cloud migration activities and inorganic augmentation of capabilities.”The management showcased its chip-to-cloud offerings and growth areas of financial services; telecom, media \u0026 entertainment (TMT); and automotive sectors, alongside capabilities around artificial intelligence, data and cybersecurity to compete with larger rivals Tata Consultancy Services and Infosys. It has set up an AI research team besides its AI and generative AI offerings — AI foundry, AI force and AI labs — and plans to train around 50,000 people in GenAI.Among the challenges, a Nuvama report pointed out that the deal booking run-rate should be $2.3–2.5 billion. “Currently, it is low due to relatively less participation in G2000 (Global 2000) clients. While HCLTech is strong with many clients in G2000, it has no presence in one-third of them. HCLTech is opportunistic with the remaining clients but lacks strong relationships,” it said.","cleaned_content":"billionaire shiv nadar founded it services firm hcltech is looking to diversify risks and unlock new revenue streams by expanding its presence in markets such as india africa and the middle east hcltech outlined its growth strategies to more than \u003cONE_HUNDRED\u003e analysts who attended an investor day \u003cTWO_THOUSAND\u003e meet hosted by the company in mumbai on wednesday the company also highlighted its strength in engineering research development er d and plans to leverage increasing semiconductor demand expand market participation in focus areas and new frontier markets and grow within its top current and potential clients some of the analysts who attended the event said the company wants to tap high potential regions and expand amid the ongoing slowdown in the core american markets denting business over the past five six quarters one of the analysts said on the condition of anonymity hcltech spoke of improving the mix of verticals and geographies gaining of market share organic development of digital skills its clients cloud migration activities and inorganic augmentation of capabilities the management showcased its chip to cloud offerings and growth areas of financial services telecom media entertainment tmt and automotive sectors alongside capabilities around artificial intelligence data and cybersecurity to compete with larger rivals tata consultancy services and infosys it has set up an ai research team besides its ai and generative ai offerings ai foundry ai force and ai labs and plans to train around \u003cFIVE_TEN_THOUSAND\u003e people in genai among the challenges a nuvama report pointed out that the deal booking run rate should be \u003cTWO_\u003e \u003cTWO_\u003e billion currently it is low due to relatively less participation in g2000 global \u003cTWO_THOUSAND\u003e clients while hcltech is strong with many clients in g2000 it has no presence in one third of them hcltech is opportunistic with the remaining clients but lacks strong relationships it said","timestamp":"2024-08-30T06:00:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}