{"url":"https://economictimes.indiatimes.com/tech/technology/apple-defense-bolstered-by-google-monopoly-ruling-in-us-case/articleshow/112793646.cms","title":"Apple defense bolstered by Google monopoly ruling in US case","description":"A recent ruling against Google's search business as an illegal monopoly may bolster Apple's defense in its own antitrust case. The court's decision supports the idea that companies generally have no obligation to assist competitors, which could help Apple argue that its limitations on third-party developers are reasonable and not anti-competitive.","content":"Apple could be the winner after Alphabet's Google lost its fight with the U.S. antitrust enforcers earlier this week, with a ruling that supports the iPhone maker's defense in its own antitrust court battle with U.S. prosecutors, legal experts said. A federal judge mostly sided with state and federal antitrust enforcers in the blockbuster case on Monday that ruled Google's search business was an illegal monopoly, but threw out a claim by several U.S. states that one of Google's ad tools was designed to give the company an advantage over Microsoft's Bing. That piece could help Apple's defense in its own anti-monopoly case, experts said. The ruling underscored Supreme Court precedent that companies almost never have a \"duty to deal\" with their rivals, said Herbert Hovenkamp, who teaches antitrust at the University of Pennsylvania Carey Law School. \"Any case, including Apple, in which a duty to deal is a major portion, is going to get a close look,\" he said. The states had claimed Google thwarted competition by failing to offer key features for rivals' ads through Search Ads 360, a tool for managing marketing campaigns across multiple search engines. U.S. District Judge Amit Mehta agreed with Google that it was not required to spur competition by accommodating its rival. \"Their claim requires grappling with a host of questions that the court is ill-equipped to handle,\" the judge said. That part of the ruling is good for defendants, said William Kovacic, a professor at George Washington University Law School and former commissioner of the U.S. Federal Trade Commission. ","cleaned_content":"apple could be the winner after alphabets google lost its fight with the u s antitrust enforcers earlier this week with a ruling that supports the iphone makers defense in its own antitrust court battle with u s prosecutors legal experts said a federal judge mostly sided with state and federal antitrust enforcers in the blockbuster case on monday that ruled googles search business was an illegal monopoly but threw out a claim by several u s states that one of googles ad tools was designed to give the company an advantage over microsofts bing that piece could help apples defense in its own anti monopoly case experts said the ruling underscored supreme court precedent that companies almost never have a duty to deal with their rivals said herbert hovenkamp who teaches antitrust at the university of pennsylvania carey law school any case including apple in which a duty to deal is a major portion is going to get a close look he said the states had claimed google thwarted competition by failing to offer key features for rivals ads through search ads \u003cTHREE_HUNDRED\u003e a tool for managing marketing campaigns across multiple search engines u s district judge amit mehta agreed with google that it was not required to spur competition by accommodating its rival their claim requires grappling with a host of questions that the court is ill equipped to handle the judge said that part of the ruling is good for defendants said william kovacic a professor at george washington university law school and former commissioner of the u s federal trade commission","timestamp":"2024-08-26T09:18:00+05:30","market_timestamp":"2024-08-26T09:18:00+05:30","off_market_hours":false}