{"url":"https://economictimes.indiatimes.com/tech/technology/french-judge-extends-police-custody-for-telegram-ceo-pavel-durov/articleshow/112836714.cms","title":"French judge extends police custody for Telegram CEO Pavel Durov","description":"Durov was detained Saturday at Le Bourget airport as part of a judicial inquiry opened last month involving 12 alleged criminal violations.","content":"A French investigative judge extended police custody for the CEO of the popular messaging app Telegram, Pavel Durov, prosecutors said on Tuesday.  Durov was detained Saturday at Le Bourget airport as part of a judicial inquiry opened last month involving 12 alleged criminal violations. They include complicity in selling child sexual abuse material and in drug trafficking, fraud, abetting organized crime transactions and refusing to share information or documents with investigators when required by law.  A statement from the Paris prosecutor's office said Durov's police custody order was extended on Monday evening for up to 48 hours. After that, authorities must release or charge him, the prosecutor's office said in an earlier statement.  Durov is a citizen of Russia, France, the United Arab Emirates and the Caribbean island nation of St. Kitts and Nevis. Russian government officials have expressed outrage at his detention, with some calling it politically motivated and proof of the West's double standard on freedom of speech. The outcry has raised eyebrows among Kremlin critics because in 2018, Russian authorities themselves tried to block Telegram but failed, withdrawing the ban in 2020.","cleaned_content":"a french investigative judge extended police custody for the ceo of the popular messaging app telegram pavel durov prosecutors said on tuesday durov was detained saturday at le bourget airport as part of a judicial inquiry opened last month involving \u003cONE_TEN\u003e alleged criminal violations they include complicity in selling child sexual abuse material and in drug trafficking fraud abetting organized crime transactions and refusing to share information or documents with investigators when required by law a statement from the paris prosecutors office said durovs police custody order was extended on monday evening for up to \u003cFOUR_TEN\u003e hours after that authorities must release or charge him the prosecutors office said in an earlier statement durov is a citizen of russia france the united arab emirates and the caribbean island nation of st kitts and nevis russian government officials have expressed outrage at his detention with some calling it politically motivated and proof of the wests double standard on freedom of speech the outcry has raised eyebrows among kremlin critics because in \u003cTWO_THOUSAND\u003e russian authorities themselves tried to block telegram but failed withdrawing the ban in \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-27T16:18:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}