{"url":"https://economictimes.indiatimes.com/tech/technology/walmart-seeks-to-raise-up-to-3-74-billion-in-sale-of-jd-com-stake-report/articleshow/112670655.cms","title":"Walmart seeks to raise up to $3.74 billion in sale of JD. com stake: report","description":"Walmart is offering 144.5 million shares in the price range of $24.85 to $25.85, the report said, adding that Morgan Stanley is the broker-dealer of the offering. Walmart is the largest shareholder of JD. com and owns a 5.19% stake in the e-commerce company, according to LSEG data.","content":"US retailer Walmart is seeking to raise up to $3.74 billion by selling its stake in Chinese e-commerce firm JD.com, Bloomberg News reported on Tuesday, citing people familiar with the matter. Walmart is offering 144.5 million shares in the price range of $24.85 to $25.85, the report said, adding that Morgan Stanley is the broker-dealer of the offering. Walmart, JD. com and Morgan Stanley did not immediately respond to Reuters' requests for comment. Walmart is the largest shareholder of JD. com and owns a 5.19% stake in the e-commerce company, according to LSEG data. The partnership between the two companies started in 2016, when Walmart sold its Chinese online grocery store, Yihaodian, in return for a 5% stake in JD. com.","cleaned_content":"us retailer walmart is seeking to raise up to \u003cTHREE_\u003e billion by selling its stake in chinese e commerce firm jd com bloomberg news reported on tuesday citing people familiar with the matter walmart is offering \u003cONE_HUNDRED\u003e million shares in the price range of \u003cTWO_TEN\u003e to \u003cTWO_TEN\u003e the report said adding that morgan stanley is the broker dealer of the offering walmart jd com and morgan stanley did not immediately respond to reuters requests for comment walmart is the largest shareholder of jd com and owns a \u003cFIVE_PERCENT\u003e stake in the e commerce company according to lseg data the partnership between the two companies started in \u003cTWO_THOUSAND\u003e when walmart sold its chinese online grocery store yihaodian in return for a \u003cFIVE_PERCENT\u003e stake in jd com","timestamp":"2024-08-21T10:29:00+05:30","market_timestamp":"2024-08-21T10:29:00+05:30","off_market_hours":false}