{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musk-tesla-win-dismissal-of-lawsuit-claiming-they-rigged-dogecoin/articleshow/112910979.cms","title":"Elon Musk, Tesla win dismissal of lawsuit claiming they rigged dogecoin","description":"Elon Musk and Tesla have won the dismissal of a federal lawsuit alleging they defrauded investors by promoting dogecoin and engaging in insider trading. Investors claimed Musk used social media and public appearances to manipulate dogecoin's price, leading to significant losses. The decision was delivered by a U.S. District Judge in Manhattan.","content":"Elon Musk and his electric vehicle company Tesla won the dismissal of a federal lawsuit accusing them of defrauding investors by hyping the cryptocurrency dogecoin and conducting insider trading, causing billions of dollars of losses. The decision was issued on Thursday night by U.S. District Judge Alvin Hellerstein in Manhattan. Investors accused Musk of using Twitter posts, a 2021 appearance on NBC's \"Saturday Night Live\" and other publicity stunts to trade profitably at their expense through several dogecoin wallets that he or Tesla controlled. According to the investors, Musk deliberately drove up dogecoin's price more than 36,000% over two years and then let it crash, with he and Tesla often timing trades to Musk's public statements and activities concerning dogecoin. Investors said this included when Musk sold dogecoin in April 2023 after he replaced the blue bird logo of Twitter, now known as X, with dogecoin's Shiba Inu dog logo, causing dogecoin's price to rise 30%.","cleaned_content":"elon musk and his electric vehicle company tesla won the dismissal of a federal lawsuit accusing them of defrauding investors by hyping the cryptocurrency dogecoin and conducting insider trading causing billions of dollars of losses the decision was issued on thursday night by u s district judge alvin hellerstein in manhattan investors accused musk of using twitter posts a \u003cTWO_THOUSAND\u003e appearance on nbcs saturday night live and other publicity stunts to trade profitably at their expense through several dogecoin wallets that he or tesla controlled according to the investors musk deliberately drove up dogecoins price more than \u003cTHREE_TEN_THOUSAND_PERCENT\u003e over two years and then let it crash with he and tesla often timing trades to musks public statements and activities concerning dogecoin investors said this included when musk sold dogecoin in april \u003cTWO_THOUSAND\u003e after he replaced the blue bird logo of twitter now known as x with dogecoins shiba inu dog logo causing dogecoins price to rise \u003cTHREE_TEN_PERCENT\u003e","timestamp":"2024-08-30T08:06:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}