{"url":"https://economictimes.indiatimes.com/tech/technology/apple-appoints-kevan-parekh-as-cfo-10-things-to-know/articleshow/112824644.cms","title":"Apple appoints Indian-origin Kevan Parekh as CFO: 10 things to know","description":"Kevan Parekh, with over ten years at Apple, was named the new CFO, succeeding Luca Maestri. Parekh, who brings previous experience from Thomson Reuters and General Motors, will take over on January 1, 2025. The change comes ahead of Apple's fall event, where it is expected to reveal new iPhone models with AI features.","content":"Technology major Apple named Kevan Parekh, its vice president of financial planning and analysis, as chief financial officer on Monday. Parekh will replace company veteran Luca Maestri who will be transitioning to a different role.Here are key things to know about the leadership change at Apple:Parekh, who has been with Apple for over a decade, will join the company's executive committee and take over as its CFO on January 1, 2025.Before joining Apple, Parekh held senior leadership roles at Thomson Reuters and General Motors.Indian-origin Parekh holds an electrical engineer with a Bachelor’s of Science from the University of Michigan and an MBA from the University of Chicago.“For more than a decade, Kevan has been an indispensable member of Apple’s finance leadership team, and he understands the company inside and out. His sharp intellect, wise judgment, and financial brilliance make him the perfect choice to be Apple’s next CFO,” said Apple CEO Tim Cook.Maestri will continue to lead the corporate services teams, including information systems and technology, information security and real estate and development. He will report to Cook.Notably, the announcement comes just ahead of Apple’s fall event, which will be held on September 9 in Cupertino, California. The tech major is expected to launch its new iPhone series with much-awaited AI features.Apple’s June quarter revenue came in at $85.8 billion, up 5% from a year back, and also an all-time revenue record in services which grew 14%. China - Apple's third-largest market - remained a drag as sales there declined 6.5%.ET reported on August 2 that the iPhone maker logged yet another quarterly revenue record in India for the third quarter, continuing the high pace of growth. Apart from the iPhones, robust sales of Mac computers is driving the Apple business in India.As per Counterpoint, Samsung and Vivo led the Indian smartphone market in value or sales revenue market share in the June quarter followed by Apple in the third spot.Apple led the super-premium segment, which are smartphones priced above Rs 67,000 apiece, with an 83% share followed by Samsung with a 16% share, as per data from market research firm International Data Corporation.","cleaned_content":"technology major apple named kevan parekh its vice president of financial planning and analysis as chief financial officer on monday parekh will replace company veteran luca maestri who will be transitioning to a different role here are key things to know about the leadership change at apple parekh who has been with apple for over a decade will join the companys executive committee and take over as its cfo on january \u003cONE_\u003e \u003cTWO_THOUSAND\u003e before joining apple parekh held senior leadership roles at thomson reuters and general motors indian origin parekh holds an electrical engineer with a bachelor s of science from the university of michigan and an mba from the university of chicago for more than a decade kevan has been an indispensable member of apple s finance leadership team and he understands the company inside and out his sharp intellect wise judgment and financial brilliance make him the perfect choice to be apple s next cfo said apple ceo tim cook maestri will continue to lead the corporate services teams including information systems and technology information security and real estate and development he will report to cook notably the announcement comes just ahead of apple s fall event which will be held on september \u003cNINE_\u003e in cupertino california the tech major is expected to launch its new iphone series with much awaited ai features apple s june quarter revenue came in at \u003cEIGHT_TEN\u003e billion up \u003cFIVE_PERCENT\u003e from a year back and also an all time revenue record in services which grew \u003cONE_TEN_PERCENT\u003e china apples third largest market remained a drag as sales there declined \u003cSIX_PERCENT\u003e et reported on august \u003cTWO_\u003e that the iphone maker logged yet another quarterly revenue record in india for the third quarter continuing the high pace of growth apart from the iphones robust sales of mac computers is driving the apple business in india as per counterpoint samsung and vivo led the indian smartphone market in value or sales revenue market share in the june quarter followed by apple in the third spot apple led the super premium segment which are smartphones priced above rs \u003cSIX_TEN_THOUSAND\u003e apiece with an \u003cEIGHT_TEN_PERCENT\u003e share followed by samsung with a \u003cONE_TEN_PERCENT\u003e share as per data from market research firm international data corporation","timestamp":"2024-08-27T10:24:00+05:30","market_timestamp":"2024-08-27T10:24:00+05:30","off_market_hours":false}