{"url":"https://economictimes.indiatimes.com/tech/technology/frances-macron-says-no-political-motive-behind-telegram-ceos-arrest/articleshow/112813260.cms","title":"France's Macron says no political motive behind Telegram CEO's arrest","description":"Macron's statement on X amounted to the first official confirmation of Durov's arrest, nearly two days since he was detained at Le Bourget airport outside Paris shortly after landing on a private jet from Azerbaijan.","content":"Pavel Durov, the Russian-born founder of messaging app Telegram, was arrested in France as part of an ongoing judicial investigation, and there was no political motive, French President Macron said on Monday. Macron's statement on X amounted to the first official confirmation of Durov's arrest, nearly two days since he was detained at Le Bourget airport outside Paris shortly after landing on a private jet from Azerbaijan. The lack of official confirmation had led to speculation about the reasons behind his detention. Macron said he had read \"false information here regarding France following the arrest of Pavel Durov.\"  \"The arrest of the Telegram president on French territory took place as part of an ongoing judicial investigation,\" he wrote. \"This is in no way a political decision. It is up to the judges to decide.\" A police spokesman told Reuters that Durov is under investigation by the national cyber crime and fraud offices for failing to cooperate over cyber and financial crimes on Telegram, a messaging app and social media. He is still in custody, the spokesman said.","cleaned_content":"pavel durov the russian born founder of messaging app telegram was arrested in france as part of an ongoing judicial investigation and there was no political motive french president macron said on monday macrons statement on x amounted to the first official confirmation of durovs arrest nearly two days since he was detained at le bourget airport outside paris shortly after landing on a private jet from azerbaijan the lack of official confirmation had led to speculation about the reasons behind his detention macron said he had read false information here regarding france following the arrest of pavel durov the arrest of the telegram president on french territory took place as part of an ongoing judicial investigation he wrote this is in no way a political decision it is up to the judges to decide a police spokesman told reuters that durov is under investigation by the national cyber crime and fraud offices for failing to cooperate over cyber and financial crimes on telegram a messaging app and social media he is still in custody the spokesman said","timestamp":"2024-08-26T20:21:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}