{"url":"https://economictimes.indiatimes.com/tech/technology/apple-cuts-jobs-in-digital-services-groups-as-priorities-shift/articleshow/112852889.cms","title":"Apple cuts 100 jobs in digital services groups as priorities shift","description":"The layoffs included some engineering roles, and the biggest cuts were made to the team responsible for the Apple Books app and Apple Bookstore. There were also layoffs in other services teams, including the one that runs Apple News.","content":"Apple Inc. took the rare step of cutting about 100 jobs in its services group, part of a shift in priorities for the critical division, according to people with knowledge of the matter. The company informed the affected employees, who worked across several different teams in Senior Vice President Eddy Cue’s services group, on Tuesday, said the people, who asked not to be identified because the move isn’t public.The layoffs included some engineering roles, and the biggest cuts were made to the team responsible for the Apple Books app and Apple Bookstore. There were also layoffs in other services teams, including the one that runs Apple News. Apple Books has become less of a priority for the company, which doesn’t see it as a major part of its services lineup. The Books app is still expected to get new features over time, according to the people. As for Apple News, the layoffs aren’t a sign that it’s becoming less of a focus, they said.Layoffs are unusual at Apple, though the company has made other recent cuts. Earlier this year, it laid off hundreds of workers when it shuttered its self-driving car project as well as an effort to make microLED displays.","cleaned_content":"apple inc took the rare step of cutting about \u003cONE_HUNDRED\u003e jobs in its services group part of a shift in priorities for the critical division according to people with knowledge of the matter the company informed the affected employees who worked across several different teams in senior vice president eddy cue s services group on tuesday said the people who asked not to be identified because the move isn t public the layoffs included some engineering roles and the biggest cuts were made to the team responsible for the apple books app and apple bookstore there were also layoffs in other services teams including the one that runs apple news apple books has become less of a priority for the company which doesn t see it as a major part of its services lineup the books app is still expected to get new features over time according to the people as for apple news the layoffs aren t a sign that it s becoming less of a focus they said layoffs are unusual at apple though the company has made other recent cuts earlier this year it laid off hundreds of workers when it shuttered its self driving car project as well as an effort to make microled displays","timestamp":"2024-08-28T09:53:00+05:30","market_timestamp":"2024-08-28T09:53:00+05:30","off_market_hours":false}