{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-shares-surge-90-post-debut-to-hit-7-billion-value/articleshow/112673409.cms","title":"Ola Electric shares surge 90% post-debut to hit $7 billion value","description":"The jump has helped founder Bhavish Aggarwal achieve his target valuation much sooner than expected, buoyed by strong investor demand in India’s hot IPO market. The country’s biggest e-scooter maker went ahead with the offering at a lower value after facing investor pushback amid concerns over its profitability.","content":"The rapid rise in Ola Electric Mobility Ltd. shares is vindicating the founder’s push to list the company despite initial skepticism over valuation. The stock has surged nearly 90% in less than two weeks, bringing its market capitalisation to over $7 billion. The company’s initial public offering was India’s biggest in two years and saw participation from across investor segments.The jump has helped founder Bhavish Aggarwal achieve his target valuation much sooner than expected, buoyed by strong investor demand in India’s hot IPO market. The country’s biggest e-scooter maker went ahead with the offering at a lower value after facing investor pushback amid concerns over its profitability.Also Read: Ola Electric IPO: All you need to know before subscribing“There is a serious belief among investors in India’s electric vehicle story,” said Aishvarya Dadheech, chief investment officer at Mumbai-based Fident Asset Management Pvt. “The gush of domestic liquidity is driving investors to seek exposure to newer themes and investment ideas and the EV sector is one of the biggest beneficiaries.”","cleaned_content":"the rapid rise in ola electric mobility ltd shares is vindicating the founder s push to list the company despite initial skepticism over valuation the stock has surged nearly \u003cNINE_TEN_PERCENT\u003e in less than two weeks bringing its market capitalisation to over \u003cSEVEN_\u003e billion the company s initial public offering was india s biggest in two years and saw participation from across investor segments the jump has helped founder bhavish aggarwal achieve his target valuation much sooner than expected buoyed by strong investor demand in india s hot ipo market the country s biggest e scooter maker went ahead with the offering at a lower value after facing investor pushback amid concerns over its profitability also read ola electric ipo all you need to know before subscribing there is a serious belief among investors in india s electric vehicle story said aishvarya dadheech chief investment officer at mumbai based fident asset management pvt the gush of domestic liquidity is driving investors to seek exposure to newer themes and investment ideas and the ev sector is one of the biggest beneficiaries","timestamp":"2024-08-21T12:17:00+05:30","market_timestamp":"2024-08-21T12:17:00+05:30","off_market_hours":false}