{"url":"https://economictimes.indiatimes.com/tech/technology/ant-group-nets-4x-return-on-investment-in-zomato-after-latest-part-stake-sale/articleshow/112661054.cms","title":"Ant Group nets 4X return on investment in Zomato after latest part stake sale","description":"On an investment of Rs 3,246 crore in the Gurugram-based food delivery firm, the Chinese ecommerce giant Alibaba’s affiliate has pocketed Rs 12,521 crore till now, with another Rs 4,955 crore worth of shares still being held by it.","content":"Chinese ecommerce giant Alibaba’s affiliate, Ant Group, sold Zomato shares worth more than Rs 4,772 crore in two block deals Tuesday, taking the total proceeds it has made from selling stake in the food and grocery delivery company till date to Rs 12,521 crore.Ant Group, which held its stake in Zomato through two entities, had invested Rs 3,246 crore in the company through several tranches between 2018 and 2020.The latest stake sale marks a return of almost fourfold for Ant Group on its investment in Zomato. It still holds another 2.1% stake in the Gurugram-based firm.Zomato’s stock price has been scaling new highs, primarily driven by quick-commerce unit Blinkit’s growing value. Brokerage firm UBS has pegged Blinkit’s value at $15.4 billion — more than Zomato’s mainstay food delivery business. It has a price target of Rs 320 on the Zomato stock.On Tuesday, Zomato’s share ended trading 0.3% up at Rs 263 on the BSE.","cleaned_content":"chinese ecommerce giant alibaba s affiliate ant group sold zomato shares worth more than rs \u003cFOUR_THOUSAND\u003e crore in two block deals tuesday taking the total proceeds it has made from selling stake in the food and grocery delivery company till date to rs \u003cONE_TEN_THOUSAND\u003e crore ant group which held its stake in zomato through two entities had invested rs \u003cTHREE_THOUSAND\u003e crore in the company through several tranches between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e the latest stake sale marks a return of almost fourfold for ant group on its investment in zomato it still holds another \u003cTWO_PERCENT\u003e stake in the gurugram based firm zomato s stock price has been scaling new highs primarily driven by quick commerce unit blinkit s growing value brokerage firm ubs has pegged blinkit s value at \u003cONE_TEN\u003e billion more than zomato s mainstay food delivery business it has a price target of rs \u003cTHREE_HUNDRED\u003e on the zomato stock on tuesday zomato s share ended trading \u003cZERO_PERCENT\u003e up at rs \u003cTWO_HUNDRED\u003e on the bse","timestamp":"2024-08-20T23:27:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}