{"url":"https://economictimes.indiatimes.com/tech/technology/open-cloud-compute-network-hopes-to-onboard-three-compute-providers-for-october-pilot/articleshow/112838220.cms","title":"Open Cloud Compute looks to onboard 3 providers for October pilot","description":"The Open Cloud Compute network was unveiled by Infosys non-executive chairman Nandan Nilekani earlier this year. It is an open interface for providers and customers of computing infrastructure. The network is hoping to onboard at least three compute providers to pilot in October.","content":"The Open Cloud Compute (OCC) network unveiled by Infosys non-executive chairman Nandan Nilekani earlier this year hopes to onboard at least three compute providers for a pilot by October.OCC, unveiled in May, is an open interface for providers and customers of computing infrastructure, and a network of interoperable micro data centres in the country. According to this model, India needs 10,000 micro data centres to build its compute power. This network would bring compute power closer to users, enabling faster processing, lower latency, and strengthening data sovereignty.“We hope to have at least three compute providers onboarded to the network for a pilot by October,” Tanvi Lall, director of strategy, people+ai, who is the brain behind OCC, told ET. “The pilot will likely be powering a hackathon at a university for undergraduate students via OCC.”The technical work on OCC is on and people+ai has been defining the technical architecture as well as application programming interfaces (APIs) that will enable the discoverability interface, she said.The technical team is 100% volunteer-led and is working with a good group of senior and junior engineers to build this, said Lall.","cleaned_content":"the open cloud compute occ network unveiled by infosys non executive chairman nandan nilekani earlier this year hopes to onboard at least three compute providers for a pilot by october occ unveiled in may is an open interface for providers and customers of computing infrastructure and a network of interoperable micro data centres in the country according to this model india needs \u003cONE_TEN_THOUSAND\u003e micro data centres to build its compute power this network would bring compute power closer to users enabling faster processing lower latency and strengthening data sovereignty we hope to have at least three compute providers onboarded to the network for a pilot by october tanvi lall director of strategy people ai who is the brain behind occ told et the pilot will likely be powering a hackathon at a university for undergraduate students via occ the technical work on occ is on and people ai has been defining the technical architecture as well as application programming interfaces apis that will enable the discoverability interface she said the technical team is \u003cONE_HUNDRED_PERCENT\u003e volunteer led and is working with a good group of senior and junior engineers to build this said lall","timestamp":"2024-08-28T08:11:00+05:30","market_timestamp":"2024-08-28T09:15:00+05:30","off_market_hours":true}