{"url":"https://economictimes.indiatimes.com/tech/technology/justice-department-accuses-software-company-realpage-of-violating-antitrust-laws-through-scheme-to-hike-rents/articleshow/112760845.cms","title":"Justice Department accuses software company RealPage of violating antitrust laws through scheme to hike rents","description":"The lawsuit, filed alongside attorneys general in states including North Carolina and California, alleges that RealPage is violating antitrust laws through its algorithm that landlords use to get recommended rental prices for apartments. In a statement, RealPage said the Justice Department's claims were \"devoid of merit and will do nothing to make housing more affordable.\"","content":"The Justice Department filed an antitrust lawsuit Friday against real estate software company RealPage Inc., accusing it of an illegal scheme that allows landlords to coordinate to hike rental prices.  The lawsuit, filed alongside attorneys general in states including North Carolina and California, alleges the company is violating antitrust laws through its algorithm that landlords use to get recommended rental prices for apartments.  The algorithm allows landlords to align their prices and avoid competition that would otherwise keep rents down, Justice Department officials said. The complaint quotes one RealPage executive as saying \"there is greater good in everybody succeeding versus essentially trying to compete against one another in a way that actually keeps the entire industry down.\" In a statement, Attorney General Merrick Garland said, \"Americans should not have to pay more in rent because a company has found a new way to scheme with landlords to break the law.\"  Attorneys general in several states have separately sued RealPage alleging an illegal price-fixing scheme over its algorithmic pricing software. ","cleaned_content":"the justice department filed an antitrust lawsuit friday against real estate software company realpage inc accusing it of an illegal scheme that allows landlords to coordinate to hike rental prices the lawsuit filed alongside attorneys general in states including north carolina and california alleges the company is violating antitrust laws through its algorithm that landlords use to get recommended rental prices for apartments the algorithm allows landlords to align their prices and avoid competition that would otherwise keep rents down justice department officials said the complaint quotes one realpage executive as saying there is greater good in everybody succeeding versus essentially trying to compete against one another in a way that actually keeps the entire industry down in a statement attorney general merrick garland said americans should not have to pay more in rent because a company has found a new way to scheme with landlords to break the law attorneys general in several states have separately sued realpage alleging an illegal price fixing scheme over its algorithmic pricing software","timestamp":"2024-08-24T14:58:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}