{"url":"https://economictimes.indiatimes.com/tech/technology/how-a-law-that-shields-big-tech-is-now-being-used-against-it/articleshow/112669974.cms","title":"How a law that shields big tech is now being used against it","description":"The lawsuit, filed by Ethan Zuckerman, a public policy professor at the University of Massachusetts Amherst, is the first to use Section 230 against a tech giant in this way, his lawyers said. It is an unusual legal maneuver that could turn a law that typically protects companies like Meta on its head. And if Zuckerman succeeds, it could mean more power for consumers to control what they see online.","content":"Facebook, X, YouTube and other social media platforms rely on a 1996 law to insulate themselves from legal liability for user posts. The protection from this law, Section 230 of the Communications Decency Act, is so significant that it has allowed tech companies to flourish. But what if the same law could be used to rein in the power of those social media giants? That idea is at the heart of a lawsuit filed in May against Meta, the owner of Facebook, Instagram and WhatsApp. The plaintiff has asked a federal court to declare that a little-used part of Section 230 makes it permissible for him to release his own software that lets users automatically unfollow everyone on Facebook. The lawsuit, filed by Ethan Zuckerman, a public policy professor at the University of Massachusetts Amherst, is the first to use Section 230 against a tech giant in this way, his lawyers said. It is an unusual legal maneuver that could turn a law that typically protects companies like Meta on its head. And if Zuckerman succeeds, it could mean more power for consumers to control what they see online. \"I see and appreciate the elegance of trying to use a piece of law that has made user generated content possible, to now give users more control over those experiences and services,\" he said.","cleaned_content":"facebook x youtube and other social media platforms rely on a \u003cONE_THOUSAND\u003e law to insulate themselves from legal liability for user posts the protection from this law section \u003cTWO_HUNDRED\u003e of the communications decency act is so significant that it has allowed tech companies to flourish but what if the same law could be used to rein in the power of those social media giants that idea is at the heart of a lawsuit filed in may against meta the owner of facebook instagram and whatsapp the plaintiff has asked a federal court to declare that a little used part of section \u003cTWO_HUNDRED\u003e makes it permissible for him to release his own software that lets users automatically unfollow everyone on facebook the lawsuit filed by ethan zuckerman a public policy professor at the university of massachusetts amherst is the first to use section \u003cTWO_HUNDRED\u003e against a tech giant in this way his lawyers said it is an unusual legal maneuver that could turn a law that typically protects companies like meta on its head and if zuckerman succeeds it could mean more power for consumers to control what they see online i see and appreciate the elegance of trying to use a piece of law that has made user generated content possible to now give users more control over those experiences and services he said","timestamp":"2024-08-21T10:02:00+05:30","market_timestamp":"2024-08-21T10:02:00+05:30","off_market_hours":false}