{"url":"https://economictimes.indiatimes.com/tech/technology/not-against-ecommerce-firms-want-them-to-be-fair-and-honest-piyush-goyal/articleshow/112713635.cms","title":"Not against ecommerce firms, want them to be fair and honest: Piyush Goyal","description":"\"What the country always desires is fair play, is honesty'¦ for the customer, honesty to the supplier of goods and services and to ensure that other people also have a fair chance to compete against such online business,\" the Union minister, a member of Parliament from the Mumbai North constituency, said.","content":"Union Commerce Minister Piyush Goyal on Thursday said that India is not against e-commerce companies but wants them to be fair and honest. In remarks that came a day after he flagged concerns about e-commerce firms, Goyal said online businesses need to ensure a \"fair chance\" of competing.  Goyal on Wednesday voiced concerns about predatory pricing by e-commerce firms and feared about the impact their operations have on small retailers in the country. He also went public with his fears, warning of the \"huge social disruption\" with the massive growth of the e-commerce sector.  \"We are very clear that we want to invite FDI (foreign direct investment), we want to invite technology, we want to have the best of the world, and we are not against online at all,\" Goyal said at an event here.  \"What the country always desires is fair play, is honesty'¦ for the customer, honesty to the supplier of goods and services and to ensure that other people also have a fair chance to compete against such online business,\" the Union minister, a member of Parliament from the Mumbai North constituency, said. ","cleaned_content":"union commerce minister piyush goyal on thursday said that india is not against e commerce companies but wants them to be fair and honest in remarks that came a day after he flagged concerns about e commerce firms goyal said online businesses need to ensure a fair chance of competing goyal on wednesday voiced concerns about predatory pricing by e commerce firms and feared about the impact their operations have on small retailers in the country he also went public with his fears warning of the huge social disruption with the massive growth of the e commerce sector we are very clear that we want to invite fdi foreign direct investment we want to invite technology we want to have the best of the world and we are not against online at all goyal said at an event here what the country always desires is fair play is honesty for the customer honesty to the supplier of goods and services and to ensure that other people also have a fair chance to compete against such online business the union minister a member of parliament from the mumbai north constituency said","timestamp":"2024-08-22T21:14:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}