{"url":"https://economictimes.indiatimes.com/tech/technology/chinese-smartphone-maker-honor-gets-investment-from-china-mobile/articleshow/112756274.cms","title":"Chinese smartphone maker Honor gets investment from China Mobile","description":"China Mobile's investment aims to leverage \"synergistic advantages\" in innovation across personal and home device markets, Honor said in a statement. The collaboration is set to capitalise on Honor's product portfolio and China Mobile's channel resources and user base, it said.","content":"Chinese smartphone maker Honor said on Friday it has received an undisclosed amount of investment from China Mobile's parent company, as the former Huawei unit gears up towards an initial public offering (IPO). Honor has been receiving an \"unusually\" high level of support from southern China's Shenzhen government, including funding for research and development and tax breaks, Reuters reported earlier in August. The handset maker announced last November it was pursuing an IPO, without disclosing a location or a time frame for the listing. China Mobile's investment aims to leverage \"synergistic advantages\" in innovation across personal and home device markets, Honor said in a statement. \"Honor has always adhered to the principle of open and transparent development and will continue to diversify its shareholding structure,\" it added. ","cleaned_content":"chinese smartphone maker honor said on friday it has received an undisclosed amount of investment from china mobiles parent company as the former huawei unit gears up towards an initial public offering ipo honor has been receiving an unusually high level of support from southern chinas shenzhen government including funding for research and development and tax breaks reuters reported earlier in august the handset maker announced last november it was pursuing an ipo without disclosing a location or a time frame for the listing china mobiles investment aims to leverage synergistic advantages in innovation across personal and home device markets honor said in a statement honor has always adhered to the principle of open and transparent development and will continue to diversify its shareholding structure it added","timestamp":"2024-08-24T11:14:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}