{"url":"https://economictimes.indiatimes.com/tech/technology/uber-to-bring-black-back-in-big-premiumisation-push/articleshow/112785851.cms","title":"Uber to bring ‘Black’ back in big premiumisation push","description":"Uber is reviving its high-end Uber Black service in India, starting with a phased rollout in Mumbai, as the company focuses on upgrading its services to cater to the premium segment. The launch is anticipated to take place within the next few weeks.","content":"Ride-hailing platform Uber is bringing back its flagship top-of-the-line product Uber Black to the country at a time when Indian consumers across segments are spending more for premium experiences.The service is expected to be rolled out in the next few weeks, starting with some localities in Mumbai, people close to the development said.The company had started its India operations in 2013 with Uber Black, under which C-suite cars such as Mercedes, BMW and Audi were available on demand. It later replaced the luxury cars with the likes of Toyota Innova, Honda City and Toyota Corolla. The service was halted a year later.The revamped version of Uber Black will be a “far more sustainable model” where customers will be provided with a white glove cab service in bigger cars than currently available commercial sedans, one of the persons cited above said. Sport-utility vehicles (SUVs) and multi-utility vehicles (MUVs) of Toyota, MG and others will be used for the service, the person added.Uber Black will be priced 30-40% higher than the platform’s existing top product Uber Premier, and the company expects it to have “huge traction with corporate travel use cases,” the person said.","cleaned_content":"ride hailing platform uber is bringing back its flagship top of the line product uber black to the country at a time when indian consumers across segments are spending more for premium experiences the service is expected to be rolled out in the next few weeks starting with some localities in mumbai people close to the development said the company had started its india operations in \u003cTWO_THOUSAND\u003e with uber black under which c suite cars such as mercedes bmw and audi were available on demand it later replaced the luxury cars with the likes of toyota innova honda city and toyota corolla the service was halted a year later the revamped version of uber black will be a far more sustainable model where customers will be provided with a white glove cab service in bigger cars than currently available commercial sedans one of the persons cited above said sport utility vehicles suvs and multi utility vehicles muvs of toyota mg and others will be used for the service the person added uber black will be priced \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e higher than the platform s existing top product uber premier and the company expects it to have huge traction with corporate travel use cases the person said","timestamp":"2024-08-26T06:00:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}