{"url":"https://economictimes.indiatimes.com/tech/technology/us-appeals-court-revives-google-privacy-class-action/articleshow/112668007.cms","title":"US appeals court revives Google privacy class action","description":"Google said in a statement: \"We disagree with this ruling and are confident the facts of the case are on our side. Chrome Sync helps people use Chrome seamlessly across their different devices and has clear privacy controls.\" The appeals court returned the case to US District Judge Yvonne Gonzalez Rogers in Oakland, California, who had dismissed it in December 2022.","content":"A US appeals court said Google must face a revived lawsuit by Google Chrome users who said the company collected their personal information without permission, after they chose not to synchronize their browsers with their Google accounts. The 9th US Circuit Court of Appeals in San Francisco said the lower court judge who dismissed the proposed class action should have assessed whether reasonable Chrome users consented to letting Google collect their data when they browsed online. Tuesday's 3-0 decision followed Google's agreement last year to destroy billions of records to settle a lawsuit claiming the Alphabet unit tracked people who thought they were browsing privately, including in Chrome's \"Incognito\" mode. Google said in a statement: \"We disagree with this ruling and are confident the facts of the case are on our side. Chrome Sync helps people use Chrome seamlessly across their different devices and has clear privacy controls.\" Matthew Wessler, a lawyer for the plaintiffs, said he was pleased with Tuesday's decision and looked forward to a trial.","cleaned_content":"a us appeals court said google must face a revived lawsuit by google chrome users who said the company collected their personal information without permission after they chose not to synchronize their browsers with their google accounts the \u003cNINE_\u003e th us circuit court of appeals in san francisco said the lower court judge who dismissed the proposed class action should have assessed whether reasonable chrome users consented to letting google collect their data when they browsed online tuesdays \u003cTHREE_\u003e \u003cZERO_\u003e decision followed googles agreement last year to destroy billions of records to settle a lawsuit claiming the alphabet unit tracked people who thought they were browsing privately including in chromes incognito mode google said in a statement we disagree with this ruling and are confident the facts of the case are on our side chrome sync helps people use chrome seamlessly across their different devices and has clear privacy controls matthew wessler a lawyer for the plaintiffs said he was pleased with tuesdays decision and looked forward to a trial","timestamp":"2024-08-21T08:31:00+05:30","market_timestamp":"2024-08-21T09:15:00+05:30","off_market_hours":true}