{"url":"https://economictimes.indiatimes.com/tech/technology/googles-antitrust-defeat-opens-the-door-to-lawsuit-from-yelp/articleshow/112890367.cms","title":"Google's antitrust defeat opens the door to lawsuit from Yelp","description":"On Wednesday, Yelp, the popular online service that lets people find and review local businesses, sued Google in federal court in San Francisco. Yelp claims that Google used its dominance as a general, or all-purpose, search engine to gain an unfair advantage in local search services. Yelp is seeking unspecified monetary damages and an order for Google to stop its anticompetitive practices in a jury trial.","content":"When a federal judge declared Google an illegal monopoly in a landmark ruling this month, it was not immediately clear what consequences the world's largest search engine provider would face. But one result is coming into focus: Google's antitrust defeat opened the door to more lawsuits. On Wednesday, Yelp, the popular online service that lets people find and review local businesses, sued Google in federal court in San Francisco. Yelp claims that Google used its dominance as a general, or all-purpose, search engine to gain an unfair advantage in local search services. Yelp is seeking unspecified monetary damages and an order for Google to stop its anticompetitive practices in a jury trial. A longtime critic of Google, Yelp has frequently complained about how the search giant treats other companies in its results. But it is the first time the San Francisco company has sued Google, despite years of protests to regulators around the world. \"This is a watershed moment,\" Jeremy Stoppelman, Yelp's co-founder and CEO, said in an interview. \"This is the time to have the conversation, this is the time to correct past wrongs.\"","cleaned_content":"when a federal judge declared google an illegal monopoly in a landmark ruling this month it was not immediately clear what consequences the worlds largest search engine provider would face but one result is coming into focus googles antitrust defeat opened the door to more lawsuits on wednesday yelp the popular online service that lets people find and review local businesses sued google in federal court in san francisco yelp claims that google used its dominance as a general or all purpose search engine to gain an unfair advantage in local search services yelp is seeking unspecified monetary damages and an order for google to stop its anticompetitive practices in a jury trial a longtime critic of google yelp has frequently complained about how the search giant treats other companies in its results but it is the first time the san francisco company has sued google despite years of protests to regulators around the world this is a watershed moment jeremy stoppelman yelps co founder and ceo said in an interview this is the time to have the conversation this is the time to correct past wrongs","timestamp":"2024-08-29T13:37:00+05:30","market_timestamp":"2024-08-29T13:37:00+05:30","off_market_hours":false}