{"url":"https://economictimes.indiatimes.com/tech/technology/update-1-us-auto-safety-regulator-closes-probe-into-gms-cruise-robotaxis/articleshow/112709720.cms","title":"US auto safety regulator closes probe into GM's Cruise robotaxis","description":"The National Highway Traffic Safety Administration announced it is closing a preliminary evaluation into hard braking issues in General Motors' autonomous Cruise vehicles. This decision follows Cruise's recall actions and software updates that reduced braking incidents. However, Cruise still faces investigations by the Justice Department and SEC after a robotaxi accident last October involving a pedestrian.","content":"The National Highway Traffic Safety Administration said on Thursday it was closing its preliminary evaluation into hard braking and immobilization in autonomous ride-hailing vehicles operated by General Motors' Cruise unit. \"In view of the recall action taken by Cruise and ODI's analysis of the available data, including data presented by Cruise demonstrating a reduced occurrence of hard braking incidents after the software updates, ODI (Office of Defects Investigation) is closing this Preliminary Evaluation,\" NHTSA said in a letter. Cruise still faces investigations by the Justice Department and Securities and Exchange Commission following an accident last October in which one of its robotaxis struck a pedestrian and dragged her 20 feet (six meters).","cleaned_content":"the national highway traffic safety administration said on thursday it was closing its preliminary evaluation into hard braking and immobilization in autonomous ride hailing vehicles operated by general motors cruise unit in view of the recall action taken by cruise and odis analysis of the available data including data presented by cruise demonstrating a reduced occurrence of hard braking incidents after the software updates odi office of defects investigation is closing this preliminary evaluation nhtsa said in a letter cruise still faces investigations by the justice department and securities and exchange commission following an accident last october in which one of its robotaxis struck a pedestrian and dragged her \u003cTWO_TEN\u003e feet six meters","timestamp":"2024-08-22T15:47:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}