{"url":"https://economictimes.indiatimes.com/tech/technology/meta-says-iranian-group-tried-to-target-trump-biden-officials-whatsapp-accounts/articleshow/112754045.cms","title":"Meta says Iranian group tried to target Trump, Biden officials' WhatsApp accounts","description":"Meta reported on Friday that it identified possible hacking attempts on the WhatsApp accounts of U.S. officials from both the Biden and Trump administrations. The company attributed these attempts to the same Iranian hacker group previously known to have compromised the Trump campaign earlier this month.","content":"Meta said on Friday it had identified possible hacking attempts on the WhatsApp accounts of U.S. officials from the administrations of both President Joe Biden and former President Donald Trump, blaming the same Iranian hacker group revealed earlier this month to have compromised the Trump campaign. In a blog post, the parent company of Facebook, Instagram and WhatsApp described the attempt as a \"small cluster of likely social engineering activity on WhatsApp\" involving accounts posing as technical support for AOL, Google, Yahoo and Microsoft. It blocked the accounts after users reported the activity as suspicious and had not seen any evidence suggesting the targeted WhatsApp accounts had been compromised, it said. Meta attributed the activity to APT42, a hacking group widely believed to be associated with an intelligence division inside Iran's military that is known for placing surveillance software on the mobile phones of its victims. The software enables the team to record calls, steal text messages and silently turn on cameras and microphones, according to researchers who follow the group. It linked the group's activity to efforts to breach U.S. presidential campaigns reported by Microsoft and Google earlier this month, ahead of the U.S. presidential election in November.","cleaned_content":"meta said on friday it had identified possible hacking attempts on the whatsapp accounts of u s officials from the administrations of both president joe biden and former president donald trump blaming the same iranian hacker group revealed earlier this month to have compromised the trump campaign in a blog post the parent company of facebook instagram and whatsapp described the attempt as a small cluster of likely social engineering activity on whatsapp involving accounts posing as technical support for aol google yahoo and microsoft it blocked the accounts after users reported the activity as suspicious and had not seen any evidence suggesting the targeted whatsapp accounts had been compromised it said meta attributed the activity to apt42 a hacking group widely believed to be associated with an intelligence division inside irans military that is known for placing surveillance software on the mobile phones of its victims the software enables the team to record calls steal text messages and silently turn on cameras and microphones according to researchers who follow the group it linked the groups activity to efforts to breach u s presidential campaigns reported by microsoft and google earlier this month ahead of the u s presidential election in november","timestamp":"2024-08-24T07:15:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}