{"url":"https://economictimes.indiatimes.com/tech/technology/only-25-of-yottas-gpus-used-by-indian-firms-ceo-sunil-gupta/articleshow/112609924.cms","title":"Only 25% of Yotta’s GPUs used by Indian firms: CEO Sunil Gupta","description":"On the government’s India AI Mission, chief executive Sunil Gupta said Yotta Data Services is unlikely to subsidise prices further for the government as the government plans to facilitate the availability of 10,000 GPUs-time for startups, researchers and academia. Yotta’s GPU time on an hourly basis is aggressively priced but the company would be open to negotiations once the government’s tender is out, he said.","content":"About 75% of the H100 graphic processing units (GPUs) procured by Hiranandani Group’s Mumbai-headquartered Yotta Data Services from American chip maker Nvidia are used by companies abroad and only the rest are used by Indian companies, said Yotta Data Services chief executive Sunil Gupta.He told ET that this was because of a more advanced artificial intelligence (AI) ecosystem in the West that leads to heightened demand for GPUs. By November the company plans to deploy an additional 8,000 GPUs, he said.“Last November we placed an order for 16,384 H100 GPUs. From a medium to long-term scale, 16,384 may not be enough for India. We deployed the first phase of 4,096 chips. By March-April, we had got all the chips. Around seven to eight weeks back, we commissioned all of them,” Gupta told ET in an interview on August 13.About 4,096 chips have been implemented, commissioned and delivered to customers in India and abroad, he said.“Broadly 75% of the GPU consumption (around 3,000 GPUs) is from foreign operators, simply because the AI ecosystem there is very big and they’re making large language models. The Indian ecosystem is still being built,” Gupta said. “We weren’t expecting this much demand. We were expecting to deploy the rest of the 12,000 GPUs in phases. But now we are advancing the delivery timelines. The next 8,000 GPUs are being implemented and delivered to customers by November in the next three months.”","cleaned_content":"about \u003cSEVEN_TEN_PERCENT\u003e of the h100 graphic processing units gpus procured by hiranandani group s mumbai headquartered yotta data services from american chip maker nvidia are used by companies abroad and only the rest are used by indian companies said yotta data services chief executive sunil gupta he told et that this was because of a more advanced artificial intelligence ai ecosystem in the west that leads to heightened demand for gpus by november the company plans to deploy an additional \u003cEIGHT_THOUSAND\u003e gpus he said last november we placed an order for \u003cONE_TEN_THOUSAND\u003e h100 gpus from a medium to long term scale \u003cONE_TEN_THOUSAND\u003e may not be enough for india we deployed the first phase of \u003cFOUR_THOUSAND\u003e chips by march april we had got all the chips around seven to eight weeks back we commissioned all of them gupta told et in an interview on august \u003cONE_TEN\u003e about \u003cFOUR_THOUSAND\u003e chips have been implemented commissioned and delivered to customers in india and abroad he said broadly \u003cSEVEN_TEN_PERCENT\u003e of the gpu consumption around \u003cTHREE_THOUSAND\u003e gpus is from foreign operators simply because the ai ecosystem there is very big and they re making large language models the indian ecosystem is still being built gupta said we weren t expecting this much demand we were expecting to deploy the rest of the \u003cONE_TEN_THOUSAND\u003e gpus in phases but now we are advancing the delivery timelines the next \u003cEIGHT_THOUSAND\u003e gpus are being implemented and delivered to customers by november in the next three months","timestamp":"2024-08-19T06:00:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}