{"url":"https://economictimes.indiatimes.com/tech/technology/indias-data-centres-a-25-billion-market-opportunity-over-the-next-decade-avendus/articleshow/112885818.cms","title":"India's data centres a $25 billion market opportunity over the next decade: Avendus","description":"The Indian data centre sector is experiencing unprecedented growth driven by AI-led demand. Currently, India hosts approximately 1,300 AI companies, with AI expected to significantly increase the need for high-density server racks, ranging from 5 to 50 kW.","content":"The data centre industry in India is on the cusp of a transformation driven by advancements in Artificial Intelligence (AI) and the rollout of 5G technologies, according to a report by Avendus, a leading financial service provider firm.This shift is being fuelled by a surge in demand for high-performance computing infrastructure, including the deployment of high-end GPU servers and AI-centric cloud solutions.The Indian data centre sector is experiencing unprecedented growth driven by AI-led demand. Currently, India hosts approximately 1,300 AI companies, with AI expected to significantly increase the need for high-density server racks, ranging from 5 to 50 kW.The demand for data centres is accelerating because of companies adopting cloud services, higher uses of AI services, requirements for data localization, roll out of 5G and increased bandwidth services, an explosion in data creation and consumption, and business continuity and backup plans of enterprises.This increase in server density will also drive higher cooling requirements. The generative AI market in India is projected to grow at a compound annual growth rate (CAGR) of 28 per cent from 2023 to 2030, translating into strong demand for data centres.","cleaned_content":"the data centre industry in india is on the cusp of a transformation driven by advancements in artificial intelligence ai and the rollout of \u003cFIVE_\u003e g technologies according to a report by avendus a leading financial service provider firm this shift is being fuelled by a surge in demand for high performance computing infrastructure including the deployment of high end gpu servers and ai centric cloud solutions the indian data centre sector is experiencing unprecedented growth driven by ai led demand currently india hosts approximately \u003cONE_THOUSAND\u003e ai companies with ai expected to significantly increase the need for high density server racks ranging from \u003cFIVE_\u003e to \u003cFIVE_TEN\u003e kw the demand for data centres is accelerating because of companies adopting cloud services higher uses of ai services requirements for data localization roll out of \u003cFIVE_\u003e g and increased bandwidth services an explosion in data creation and consumption and business continuity and backup plans of enterprises this increase in server density will also drive higher cooling requirements the generative ai market in india is projected to grow at a compound annual growth rate cagr of \u003cTWO_TEN_PERCENT\u003e from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e translating into strong demand for data centres","timestamp":"2024-08-29T11:05:00+05:30","market_timestamp":"2024-08-29T11:05:00+05:30","off_market_hours":false}