{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-exclusive-amazon-set-to-roll-out-its-quick-commerce-service-next-year-sources/articleshow/112846439.cms","title":"ETtech Exclusive: Amazon India set to launch quick commerce as competition swells","description":"Amazon has put together a plan to take on the quick commerce challenge in India, with its own offering which is slated to launch by early next year. The India unit of the etailer has handed over the responsibility of building its quick commerce strategy to senior executive Nishant Sardana as part of a rejig of the top leadership.","content":"Amazon has set the ball rolling to launch its quick commerce offering in India, likely in the first quarter of the next year, people briefed on the plan said.The US etailer’s local unit has entrusted the responsibility of developing its quick commerce strategy to a senior executive as part of a leadership rejig, as it heads for a fast-growing segment that rival Flipkart recently entered with ‘Minutes.’“The action in quick commerce just can’t be ignored any more,” said a person aware of the matter.Meanwhile, Amazon’s talks continue for buying stake in Swiggy, especially in the food delivery company’s quick service platform, Instamart, the people said. ET first reported about the deal talks on July 22.“The work (on a quick commerce vertical) has been in motion for some time, but now, there is clarity and a timeline,” said the executive cited above. Another person confirmed the plan, saying Amazon has been working on the project internally.","cleaned_content":"amazon has set the ball rolling to launch its quick commerce offering in india likely in the first quarter of the next year people briefed on the plan said the us etailer s local unit has entrusted the responsibility of developing its quick commerce strategy to a senior executive as part of a leadership rejig as it heads for a fast growing segment that rival flipkart recently entered with minutes the action in quick commerce just can t be ignored any more said a person aware of the matter meanwhile amazon s talks continue for buying stake in swiggy especially in the food delivery company s quick service platform instamart the people said et first reported about the deal talks on july \u003cTWO_TEN\u003e the work on a quick commerce vertical has been in motion for some time but now there is clarity and a timeline said the executive cited above another person confirmed the plan saying amazon has been working on the project internally","timestamp":"2024-08-28T11:16:00+05:30","market_timestamp":"2024-08-28T11:16:00+05:30","off_market_hours":false}