{"url":"https://economictimes.indiatimes.com/tech/technology/ettech-explainer-all-you-need-to-know-about-unified-lending-interface-uli/articleshow/112814717.cms","title":"ETtech Explainer: All you need to know about Unified Lending Interface","description":"The data needed for credit appraisal currently lies scattered across governments, banks, account aggregators, and credit information companies. ULI will simplify digital access to information from these different sources, thus reducing the time needed for credit appraisal, particularly for small and rural borrowers.","content":"Following the revolutionary success of the Unified Payments Interface (UPI) in the retail payments space, Reserve Bank of India (RBI) Governor Shaktikanta Das on Monday announced the upcoming launch of the Unified Lending Interface (ULI) in 'due course' to transform the lending ecosystem of the country.What is ULI?ULI, the credit digital public infrastructure (DPI) platform, designed and developed by the Reserve Bank Innovation Hub (RBIH), aims to enable a seamless and consent-based flow of digital information, including land records from various states, from multiple data service providers to lenders. Last year, the central bank launched the pilot of a technology platform which enables frictionless credit. This will now be called ULI.How does ULI help?","cleaned_content":"following the revolutionary success of the unified payments interface upi in the retail payments space reserve bank of india rbi governor shaktikanta das on monday announced the upcoming launch of the unified lending interface uli in due course to transform the lending ecosystem of the country what is uli uli the credit digital public infrastructure dpi platform designed and developed by the reserve bank innovation hub rbih aims to enable a seamless and consent based flow of digital information including land records from various states from multiple data service providers to lenders last year the central bank launched the pilot of a technology platform which enables frictionless credit this will now be called uli how does uli help","timestamp":"2024-08-27T11:02:00+05:30","market_timestamp":"2024-08-27T11:02:00+05:30","off_market_hours":false}