{"url":"https://economictimes.indiatimes.com/tech/technology/apples-first-made-in-india-iphone-pro-models-coming-this-year/articleshow/112642879.cms","title":"Apple’s first made-in-India iPhone pro models coming this year","description":"Plan shows Apple making further progress with India assembly Company is shifting output to India to diversify beyond China. The production of Apple’s entire iPhone range in India is a major landmark for the US tech giant’s local push that started gathering steam in 2021, helped by Prime Minister Narendra Modi’s financial incentives to attract high-end manufacturing.","content":"Apple Inc. will make the most expensive iPhone Pro and Pro Max models in India for the first time this year, a milestone for the US company and the Asian country’s manufacturing sector.Key partner Foxconn Technology Group will begin assembling the new marquee devices within weeks of their global launch this fall, people familiar with the matter said. It’s begun training thousands of workers at its factory in southern Tamil Nadu state as it rushes to produce the iPhone 16 Pro and Pro Max as close to the global debut as possible, they said, asking not to be named as the information is private.The production of Apple’s entire iPhone range in India is a major landmark for the US tech giant’s local push that started gathering steam in 2021, helped by Prime Minister Narendra Modi’s financial incentives to attract high-end manufacturing. Apple still makes the vast majority of iPhones in China, but it’s gradually diversifying beyond the country to lessen risks related to tensions between Beijing and Washington.The effort resulted in Apple assembling $14 billion of iPhones in India in the fiscal year through March 2024, accounting for as much as 14% of its global output. Like last year, Apple is expected to make the India-made standard iPhone 16 available on the same day the latest generation begins selling across the world, the people said.Its other partners in the country — Pegatron Corp.’s India unit and the Tata Group — could also soon begin making the Pro versions, the people said. The higher-end models typically have bigger batteries, better cameras and titanium bodies, and they require more specialized production lines.","cleaned_content":"apple inc will make the most expensive iphone pro and pro max models in india for the first time this year a milestone for the us company and the asian country s manufacturing sector key partner foxconn technology group will begin assembling the new marquee devices within weeks of their global launch this fall people familiar with the matter said it s begun training thousands of workers at its factory in southern tamil nadu state as it rushes to produce the iphone \u003cONE_TEN\u003e pro and pro max as close to the global debut as possible they said asking not to be named as the information is private the production of apple s entire iphone range in india is a major landmark for the us tech giant s local push that started gathering steam in \u003cTWO_THOUSAND\u003e helped by prime minister narendra modi s financial incentives to attract high end manufacturing apple still makes the vast majority of iphones in china but it s gradually diversifying beyond the country to lessen risks related to tensions between beijing and washington the effort resulted in apple assembling \u003cONE_TEN\u003e billion of iphones in india in the fiscal year through march \u003cTWO_THOUSAND\u003e accounting for as much as \u003cONE_TEN_PERCENT\u003e of its global output like last year apple is expected to make the india made standard iphone \u003cONE_TEN\u003e available on the same day the latest generation begins selling across the world the people said its other partners in the country pegatron corp s india unit and the tata group could also soon begin making the pro versions the people said the higher end models typically have bigger batteries better cameras and titanium bodies and they require more specialized production lines","timestamp":"2024-08-20T10:39:00+05:30","market_timestamp":"2024-08-20T10:39:00+05:30","off_market_hours":false}