{"url":"https://economictimes.indiatimes.com/tech/technology/teslas-rivals-still-cant-use-its-superchargers/articleshow/112857726.cms","title":"Tesla's rivals still can't use its superchargers","description":"More than 12 months later, Tesla's network, with nearly 30,000 fast-charging plugs in the United States and Canada, remains largely inaccessible to most people who don't drive Teslas because of software delays and hardware shortages. Tesla built the Supercharger network to encourage sales of its vehicles. Tesla built the Supercharger network to promote sales of its cars. By opening up the network, Tesla can make money from drivers of other car brands, who pay per kilowatt-hour to charge.","content":"Scarce and finicky public chargers are among the biggest reasons people hesitate to buy electric cars. So when Elon Musk, the CEO of Tesla, agreed last year to open the company's well-regarded Supercharger network to vehicles from other carmakers, many drivers and industry experts celebrated the decision. But more than 12 months later, Tesla's network, with nearly 30,000 fast-charging plugs in the United States and Canada, remains largely inaccessible to most people who don't drive Teslas because of software delays and hardware shortages. The delays have fueled speculation that Musk was having second thoughts about opening up Tesla's network, possibly because he was worried that access would help other automakers sell battery-powered models and lure customers from Tesla, which has suffered from declining sales. Tesla eased those fears a bit Friday when the company's charging unit posted on the social platform X that it had stepped up production of a crucial piece of hardware: adapters that drivers of Ford, Rivian and other car brands need to connect to Tesla chargers. A Tesla factory in Buffalo, New York, is producing 8,000 of the adapters per week, the company said, noting that outside suppliers are also producing the part. Still, it is unclear how fast those adapters would reach electric vehicle owners.","cleaned_content":"scarce and finicky public chargers are among the biggest reasons people hesitate to buy electric cars so when elon musk the ceo of tesla agreed last year to open the companys well regarded supercharger network to vehicles from other carmakers many drivers and industry experts celebrated the decision but more than \u003cONE_TEN\u003e months later teslas network with nearly \u003cTHREE_TEN_THOUSAND\u003e fast charging plugs in the united states and canada remains largely inaccessible to most people who dont drive teslas because of software delays and hardware shortages the delays have fueled speculation that musk was having second thoughts about opening up teslas network possibly because he was worried that access would help other automakers sell battery powered models and lure customers from tesla which has suffered from declining sales tesla eased those fears a bit friday when the companys charging unit posted on the social platform x that it had stepped up production of a crucial piece of hardware adapters that drivers of ford rivian and other car brands need to connect to tesla chargers a tesla factory in buffalo new york is producing \u003cEIGHT_THOUSAND\u003e of the adapters per week the company said noting that outside suppliers are also producing the part still it is unclear how fast those adapters would reach electric vehicle owners","timestamp":"2024-08-28T12:11:00+05:30","market_timestamp":"2024-08-28T12:11:00+05:30","off_market_hours":false}