{"url":"https://economictimes.indiatimes.com/tech/technology/paytm-money-appoints-ex-amfi-ceo-nv-srinivasan-on-its-board/articleshow/112827691.cms","title":"Paytm Money appoints former AMFI CEO NV Srinivasan on its board","description":"Paytm Money added Narasinganallore Venkatesh Srinivasan to its board as a non-executive independent director. Formerly CEO of the Association of Mutual Funds in India, Srinivasan brings valuable regulatory expertise. The appointment is part of Paytm Money's broader initiative to bolster governance and compliance standards within the company.","content":"Paytm Money, the wholly owned subsidiary entity of One 97 Communications which runs fintech platform Paytm, has appointed Narasinganallore Venkatesh Srinivasan as a non-executive independent director to the company’s board, it said in a statement today.Srinivasan was previously the chief executive officer of the Association of Mutual Funds in India (AMFI). Prior to AMFI, he served as chief financial officer and executive director at Lakshmi Vilas Bank and before that held senior positions at IDBI Bank for close to two decades.This appointment comes at a time when Paytm Money’s parent entity OCL has also been appointing senior industry executives on its board of directors in a bid to strengthen its compliance and governance standards. Last week the company sought shareholder nod for the appointment of Indian Revenue Service officer Rajeev Agarwal on its board.“We have built a strong consumer-centric platform over the past few years, keeping governance at the forefront of our efforts. With Srinivasan’s strong understanding of regulations and extensive experience across financial markets, we are committed to further enhancing these aspects,” said Rakesh Singh, CEO and Whole Time Director, Paytm Money.Cyrus Khambata who has held several leadership positions at the Central Depository Services (India) Ltd (CDSL), is the other independent non executive board member at Paytm Money.","cleaned_content":"paytm money the wholly owned subsidiary entity of one \u003cNINE_TEN\u003e communications which runs fintech platform paytm has appointed narasinganallore venkatesh srinivasan as a non executive independent director to the company s board it said in a statement today srinivasan was previously the chief executive officer of the association of mutual funds in india amfi prior to amfi he served as chief financial officer and executive director at lakshmi vilas bank and before that held senior positions at idbi bank for close to two decades this appointment comes at a time when paytm money s parent entity ocl has also been appointing senior industry executives on its board of directors in a bid to strengthen its compliance and governance standards last week the company sought shareholder nod for the appointment of indian revenue service officer rajeev agarwal on its board we have built a strong consumer centric platform over the past few years keeping governance at the forefront of our efforts with srinivasan s strong understanding of regulations and extensive experience across financial markets we are committed to further enhancing these aspects said rakesh singh ceo and whole time director paytm money cyrus khambata who has held several leadership positions at the central depository services india ltd cdsl is the other independent non executive board member at paytm money","timestamp":"2024-08-27T11:59:00+05:30","market_timestamp":"2024-08-27T11:59:00+05:30","off_market_hours":false}