{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-cfo-jatin-dalal-sees-positive-signals-in-it-demand-scenario-after-long/articleshow/112610768.cms","title":"Cognizant CFO Jatin Dalal sees positive signals in IT demand scenario after long","description":"Speaking about the recent controversy on low salary at the entry levels, Dalal said that it was a “misunderstanding” and for engineers the company pays salaries in the range of “Rs. 4 lakh going up to Rs. 12 lakh” for different types of work and colleges. “This Rs. 2.5 lakh salary, I want to put it on record, is not reflective of an engineer's salary. That is for a three year undergraduate course at an entry level…. So these are two very different parallel streams of hiring.”","content":"US-headquartered Cognizant Technology Services is seeing some sense of “positivity” returning to the demand environment for technology services after several quarters of slowdown in spending, said chief financial officer Jatin Dalal.In an exclusive interview to ET, his first since assuming charge in December 2023, he said the company’s last quarter performance, when it closed five large deals greater than $100 million each, indicates that there is larger business, especially high-value contracts, to be won.“We are able to gain share in the market and in customer accounts that we are playing in, it's too early probably to call it tide turning because the (US economic) data set is mixed, but overall, if you see performance, the numbers are certainly coming better. This was the second quarter in a row that we beat the upper end of our guidance,” Dalal said.He joined Cognizant from Wipro, where he served for 21 years.Speaking about the recent controversy on low salary at the entry levels, Dalal said that it was a “misunderstanding” and that the company pays engineers salaries in the range of “Rs 4 lakh going up to Rs 12 lakh” for different types of work and colleges. “This Rs 2.5 lakh salary, I want to put it on record, is not reflective of an engineer’s salary. That is for a three-year undergraduate course at an entry level…. So, these are two very different parallel streams of hiring” he said.","cleaned_content":"us headquartered cognizant technology services is seeing some sense of positivity returning to the demand environment for technology services after several quarters of slowdown in spending said chief financial officer jatin dalal in an exclusive interview to et his first since assuming charge in december \u003cTWO_THOUSAND\u003e he said the company s last quarter performance when it closed five large deals greater than \u003cONE_HUNDRED\u003e million each indicates that there is larger business especially high value contracts to be won we are able to gain share in the market and in customer accounts that we are playing in its too early probably to call it tide turning because the us economic data set is mixed but overall if you see performance the numbers are certainly coming better this was the second quarter in a row that we beat the upper end of our guidance dalal said he joined cognizant from wipro where he served for \u003cTWO_TEN\u003e years speaking about the recent controversy on low salary at the entry levels dalal said that it was a misunderstanding and that the company pays engineers salaries in the range of rs \u003cFOUR_\u003e lakh going up to rs \u003cONE_TEN\u003e lakh for different types of work and colleges this rs \u003cTWO_\u003e lakh salary i want to put it on record is not reflective of an engineer s salary that is for a three year undergraduate course at an entry level so these are two very different parallel streams of hiring he said","timestamp":"2024-08-19T06:11:00+05:30","market_timestamp":"2024-08-19T09:15:00+05:30","off_market_hours":true}