{"url":"https://economictimes.indiatimes.com/tech/technology/bigbasket-set-to-fully-play-in-quick-commerce-league/articleshow/112816099.cms","title":"Exclusive: BigBasket set to fully pivot to quick commerce amid rising competition","description":"Once the largest online grocery player in the country, Tata-owned BigBasket fell behind the young quick commerce upstarts as the new model of rapid deliveries caught customer fancy. The 13-year-old firm is now charting a comeback in this space. As much as $1 billion of BigBasket’s target of $1.5 billion in sales for this financial year will come from quick commerce through BB Now","content":"Tata-owned BigBasket, the largest e-grocer known for slotted deliveries, is set to become a full-scale quick commerce platform as the burgeoning sector sees rising demand for rapid deliveries, blurring the divide with horizontal ecommerce platforms.The move marks a key shift in strategy for the firm that started in 2011 and has seen several cycles of hyperfunded grocery models emerge during the past decade.Though a relatively late entrant, BigBasket’s BB Now is seeing over 50% sales from the quick vertical. In the coming weeks, it will only offer the 10-30-minute delivery service, founders Hari Menon and Vipul Parekh told ET, confirming the complete shift to the so-called quick model.BB Now has been in operation for about 2.5 years but the Bengaluru-based firm has sharpened its focus on the quick vertical over the past year amid a surge in demand and a rush of capital into Zomato-owned Blinkit, Zepto and Swiggy Instamart — the top three in the segment. ","cleaned_content":"tata owned bigbasket the largest e grocer known for slotted deliveries is set to become a full scale quick commerce platform as the burgeoning sector sees rising demand for rapid deliveries blurring the divide with horizontal ecommerce platforms the move marks a key shift in strategy for the firm that started in \u003cTWO_THOUSAND\u003e and has seen several cycles of hyperfunded grocery models emerge during the past decade though a relatively late entrant bigbasket s bb now is seeing over \u003cFIVE_TEN_PERCENT\u003e sales from the quick vertical in the coming weeks it will only offer the \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e minute delivery service founders hari menon and vipul parekh told et confirming the complete shift to the so called quick model bb now has been in operation for about \u003cTWO_\u003e years but the bengaluru based firm has sharpened its focus on the quick vertical over the past year amid a surge in demand and a rush of capital into zomato owned blinkit zepto and swiggy instamart the top three in the segment","timestamp":"2024-08-27T08:16:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}