{"url":"https://economictimes.indiatimes.com/tech/technology/swiggy-appoints-amitesh-jha-as-instamart-ceo/articleshow/112888712.cms","title":"Flipkart's Amitesh Jha is Swiggy Instamart CEO, founder Phani Kishan to move to chief of staff role","description":"In an internal email, Swiggy cofounder and group chief executive Sriharsha Majety announced Jha’s appointment. Swiggy cofounder Phani Kishan Addepalli, who was previously heading Instamart, will now lead the firm's central growth team that looks after initiatives like the subscription service Swiggy One.","content":"Public markets-bound Swiggy has appointed former Flipkart senior vice president of category and marketplace Amitesh Jha as chief executive of its quick-commerce business, Instamart, cofounder and group CEO Sriharsha Majety said in an email to employees.Another Swiggy cofounder, Phani Kishan Addepalli, who was previously heading Instamart, will now lead the firm's central growth team that looks after initiatives like the subscription service Swiggy One, Majety said in the email that ET has seen. Phani will also take on the role of chief of staff to Majety.Addepalli, who took the top role at Instamart last year, has steered the business from strength to strength by significantly improving the consumer experience and profitability, Majety said.Meanwhile, Swiggy’s chief growth and marketing officer Ashwath Swaminathan has left the firm, Majety said in the same email.Swaminathan had joined Swiggy from consumer goods major Hindustan Unilever in February this year. The brands and consumer insights team previously under Swaminathan will now report directly to Majety.","cleaned_content":"public markets bound swiggy has appointed former flipkart senior vice president of category and marketplace amitesh jha as chief executive of its quick commerce business instamart cofounder and group ceo sriharsha majety said in an email to employees another swiggy cofounder phani kishan addepalli who was previously heading instamart will now lead the firms central growth team that looks after initiatives like the subscription service swiggy one majety said in the email that et has seen phani will also take on the role of chief of staff to majety addepalli who took the top role at instamart last year has steered the business from strength to strength by significantly improving the consumer experience and profitability majety said meanwhile swiggy s chief growth and marketing officer ashwath swaminathan has left the firm majety said in the same email swaminathan had joined swiggy from consumer goods major hindustan unilever in february this year the brands and consumer insights team previously under swaminathan will now report directly to majety","timestamp":"2024-08-30T00:07:00+05:30","market_timestamp":"2024-08-30T09:15:00+05:30","off_market_hours":true}