{"url":"https://economictimes.indiatimes.com/tech/technology/aussie-regulator-wins-case-against-kraken-crypto-exchange-operator-on-distribution-flaws/articleshow/112730510.cms","title":"Aussie regulator wins case against Kraken crypto exchange operator on distribution flaws","description":"In September 2023, the Australian Securities and Investments Commission (ASIC) initiated civil proceedings against Bit Trade alleging that Bit Trade, a subsidiary of U.S. Payward Incorporated, failed to make a target market determination for the product before offering it to customers, despite being notified of concerns.","content":"Australia's Federal Court ruled on Friday that the operator of the Kraken crypto exchange failed to comply with the design and distribution obligations for its margin trading product, Australia's corporate regulator said. Bit Trade Pty is the operator of the Kraken crypto exchange, one of world's largest cryptocurrency exchanges, in Australia.  In September 2023, the Australian Securities and Investments Commission (ASIC) initiated civil proceedings against Bit Trade alleging that Bit Trade, a subsidiary of U.S. Payward Incorporated, failed to make a target market determination for the product before offering it to customers, despite being notified of concerns. \"Today's outcome sends a salient reminder to the crypto industry about the importance of compliance with the design and distribution obligations.\", ASIC Deputy Chair Sarah Court said in a statement. ASIC's case alleged that the obligation to repay a digital asset or national currency was a deferred debt and accordingly, that the product was a credit facility.","cleaned_content":"australias federal court ruled on friday that the operator of the kraken crypto exchange failed to comply with the design and distribution obligations for its margin trading product australias corporate regulator said bit trade pty is the operator of the kraken crypto exchange one of worlds largest cryptocurrency exchanges in australia in september \u003cTWO_THOUSAND\u003e the australian securities and investments commission asic initiated civil proceedings against bit trade alleging that bit trade a subsidiary of u s payward incorporated failed to make a target market determination for the product before offering it to customers despite being notified of concerns todays outcome sends a salient reminder to the crypto industry about the importance of compliance with the design and distribution obligations asic deputy chair sarah court said in a statement asics case alleged that the obligation to repay a digital asset or national currency was a deferred debt and accordingly that the product was a credit facility","timestamp":"2024-08-23T11:53:00+05:30","market_timestamp":"2024-08-23T11:53:00+05:30","off_market_hours":false}