{"url":"https://economictimes.indiatimes.com/tech/technology/sweden-and-denmark-to-pressure-tech-platforms-over-gang-crime-ads/articleshow/112700438.cms","title":"Sweden and Denmark to pressure tech platforms over gang crime ads","description":"Since April, there have been 25 instances in which Swedish gang members have been hired by Danish gangs for violent attacks on rivals in Denmark, many times through ads on messaging platforms such as Telegram. Danish Minister of Justice Peter Hummelgaard said encrypted services and social media - naming Telegram and TikTok - were widely used to facilitate crime and that if it was up to him alone, some communication platforms would be geo-blocked and shut down.","content":"Sweden and Denmark will summon tech companies over ads on their platforms that are posted by gangs to recruit young Swedes to commit violent crimes in the Nordics, the justice ministers of the two countries said on Wednesday. Sweden has been having a decade-long problem with gang violence and youth crime and the other Nordic countries are worried that it is starting to spill over the borders. Since April, there have been 25 instances in which Swedish gang members have been hired by Danish gangs for violent attacks on rivals in Denmark, many times through ads on messaging platforms such as Telegram.  Swedish Minister of Justice Gunnar Strommer told a joint news conference with his Danish counterpart that the gangs were innovative and had started recruiting youngsters online.  \"We will summon these platforms and hold them accountable for what is happening in our common Nordic sphere. It is about asking the very legitimate question: What are you doing? Are you doing enough?,\" he said without naming any specific company. ","cleaned_content":"sweden and denmark will summon tech companies over ads on their platforms that are posted by gangs to recruit young swedes to commit violent crimes in the nordics the justice ministers of the two countries said on wednesday sweden has been having a decade long problem with gang violence and youth crime and the other nordic countries are worried that it is starting to spill over the borders since april there have been \u003cTWO_TEN\u003e instances in which swedish gang members have been hired by danish gangs for violent attacks on rivals in denmark many times through ads on messaging platforms such as telegram swedish minister of justice gunnar strommer told a joint news conference with his danish counterpart that the gangs were innovative and had started recruiting youngsters online we will summon these platforms and hold them accountable for what is happening in our common nordic sphere it is about asking the very legitimate question what are you doing are you doing enough he said without naming any specific company","timestamp":"2024-08-22T11:31:00+05:30","market_timestamp":"2024-08-22T11:31:00+05:30","off_market_hours":false}