{"url":"https://economictimes.indiatimes.com/tech/technology/d2c-meat-delivery-startup-zappfresh-files-draft-papers-with-sebi-to-list-on-bse-sme/articleshow/112856068.cms","title":"D2C meat delivery startup Zappfresh files draft papers with Sebi to list on BSE SME","description":"Zappfresh, an online meat seller, has filed with SEBI for an IPO to list on the BSE SME platform. The IPO will include a fresh issue of 59.06 lakh equity shares. The raised funds will drive growth initiatives such as acquisitions, marketing, and capital expenditures, among others. Zappfresh aims for significant revenue growth in the next three years.","content":"Zappfresh, which sells meat online, has filed preliminary documents with capital markets regulator SEBI to launch its initial public offering (IPO). In a statement on Wednesday, Zappfresh said it has filed the Draft Red Herring Prospectus (DRHP) with SEBI to list on the BSE SME platform.  The Initial Public Offering (IPO) will consist of a fresh issue of 59.06 lakh equity shares, with a face value of Rs 10, and will not include an offer-for-sale (OFS) component.  \"The proceeds will be strategically allocated to drive growth initiatives, including unidentified acquisitions, marketing and capital expenditure enhancements, working capital optimization, and general corporate purposes,\" it said.  Zappfresh said it is the first direct-to-consumer (D2C) food startup to embark on this listing journey.  Deepanshu Manchanda, founder of Zappfresh, said, \"We are proud to take this monumental step towards listing on the BSE SME platform, which testifies to our unwavering dedication to transparency, accountability, and growth.\" ","cleaned_content":"zappfresh which sells meat online has filed preliminary documents with capital markets regulator sebi to launch its initial public offering ipo in a statement on wednesday zappfresh said it has filed the draft red herring prospectus drhp with sebi to list on the bse sme platform the initial public offering ipo will consist of a fresh issue of \u003cFIVE_TEN\u003e lakh equity shares with a face value of rs \u003cONE_TEN\u003e and will not include an offer for sale ofs component the proceeds will be strategically allocated to drive growth initiatives including unidentified acquisitions marketing and capital expenditure enhancements working capital optimization and general corporate purposes it said zappfresh said it is the first direct to consumer d2c food startup to embark on this listing journey deepanshu manchanda founder of zappfresh said we are proud to take this monumental step towards listing on the bse sme platform which testifies to our unwavering dedication to transparency accountability and growth","timestamp":"2024-08-28T11:17:00+05:30","market_timestamp":"2024-08-28T11:17:00+05:30","off_market_hours":false}