{"url":"https://economictimes.indiatimes.com/tech/technology/apple-rethinks-its-movie-strategy-after-a-string-of-misses/articleshow/112786644.cms","title":"Apple rethinks its movie strategy after a string of misses","description":"Apple is not alone in its box office struggles. This year has seen some really big hits (\"Inside Out 2,\" \"Deadpool \u0026 Wolverine\") and some notable misfires (\"The Fall Guy,\" \"Furiosa: A Mad Max Saga\"). And Apple has seen some of its films perform well in streaming.","content":"When Apple won a bidding war in 2021 for the rights to make the action comedy \"Wolfs\" with George Clooney and Brad Pitt, it did so in part because it promised the stars it would put the movie into a large number of movie theaters. \"Brad and I made the deal to do that movie where we gave money back to make sure that we had a theatrical release,\" Clooney said last year in an interview with the Hollywood trade publication Deadline. But this month, just six weeks before the film was set to show up in thousands of theaters around the United States, Apple announced a significant change in plans. \"Wolfs\" will now be shown on a limited number of movie screens for one week before becoming available on the company's streaming service Sept. 27. (Internationally, it won't appear in theaters at all with the exception of the Venice Film Festival, where it will premiere Sept. 1.) \"'Wolfs' is the kind of big event movie that makes Apple TV+ such an exceptional home for the best in entertainment,\" Matt Dentler, the head of features for Apple Original Films, said in a statement. \"Releasing the movie to theaters before making it widely available to Apple TV+ customers brings the best of both worlds to audiences.\" The film's director, Jon Watts, told Vanity Fair that he had found out about the change in plans only days before the announcement. \"The theatrical experience has really made an impression on me, of how valuable this thing is and how important it is,\" Watts said. \"I always thought of this as a theatrical movie. We made it to be seen in theaters, and I think that's the best way to see it.\"","cleaned_content":"when apple won a bidding war in \u003cTWO_THOUSAND\u003e for the rights to make the action comedy wolfs with george clooney and brad pitt it did so in part because it promised the stars it would put the movie into a large number of movie theaters brad and i made the deal to do that movie where we gave money back to make sure that we had a theatrical release clooney said last year in an interview with the hollywood trade publication deadline but this month just six weeks before the film was set to show up in thousands of theaters around the united states apple announced a significant change in plans wolfs will now be shown on a limited number of movie screens for one week before becoming available on the companys streaming service sept \u003cTWO_TEN\u003e internationally it wont appear in theaters at all with the exception of the venice film festival where it will premiere sept \u003cONE_\u003e wolfs is the kind of big event movie that makes apple tv such an exceptional home for the best in entertainment matt dentler the head of features for apple original films said in a statement releasing the movie to theaters before making it widely available to apple tv customers brings the best of both worlds to audiences the films director jon watts told vanity fair that he had found out about the change in plans only days before the announcement the theatrical experience has really made an impression on me of how valuable this thing is and how important it is watts said i always thought of this as a theatrical movie we made it to be seen in theaters and i think thats the best way to see it","timestamp":"2024-08-25T23:47:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}