{"url":"https://economictimes.indiatimes.com/tech/technology/eight-of-10-users-increasing-their-time-on-open-internet-report/articleshow/112690263.cms","title":"Eight of 10 users increasing their time on open internet: report","description":"“The shift to the open internet represents a pivotal moment for marketers,\" said Tejinder Gill, General Manager, India, The Trade Desk. \"As more consumers engage with premium content on the open internet, marketers can now reach highly attentive audiences at scale. The notable levels of engagement, ad trust, and recall compared to traditional walled gardens mark a new era of ad receptiveness. This transition is poised to boost ad spend on the open internet.”","content":"The Trade Desk's research indicates that young Indian consumers are increasingly using the open internet, with 8 out of 10 users increasing their time on it and 76% expecting this trend to persist.These insights are part of the new research study, \"India’s Engaged Audience: Why the Open Internet is the New Premium,\" highlighting opportunities to connect with the highly coveted consumer group aged 18 to 34.India's open internet, including OTT and connected TV, music streaming, online gaming, and news and websites, now has 640 million users. \"Open internet\" refers to companies and platforms that operate outside traditional walled gardens, such as Google and Facebook.“The shift to the open internet represents a pivotal moment for marketers,\" said Tejinder Gill, General Manager, India, The Trade Desk. \"As more consumers engage with premium content on the open internet, marketers can now reach highly attentive audiences at scale. The notable levels of engagement, ad trust, and recall compared to traditional walled gardens mark a new era of ad receptiveness. This transition is poised to boost ad spend on the open internet.”Consumers clearly prefer the open internet for content consumption, as more young adults are engaged when consuming content on the open internet compared to walled gardens. Findings reveal that platforms on the open internet excel in engagement, with a greater proportion of young adults being most attentive in online games (35 percent), OTT/CTV, and news/websites (34 percent), all of which outperform social media platforms (30 percent).","cleaned_content":"the trade desks research indicates that young indian consumers are increasingly using the open internet with \u003cEIGHT_\u003e out of \u003cONE_TEN\u003e users increasing their time on it and \u003cSEVEN_TEN_PERCENT\u003e expecting this trend to persist these insights are part of the new research study india s engaged audience why the open internet is the new premium highlighting opportunities to connect with the highly coveted consumer group aged \u003cONE_TEN\u003e to \u003cTHREE_TEN\u003e indias open internet including ott and connected tv music streaming online gaming and news and websites now has \u003cSIX_HUNDRED\u003e million users open internet refers to companies and platforms that operate outside traditional walled gardens such as google and facebook the shift to the open internet represents a pivotal moment for marketers said tejinder gill general manager india the trade desk as more consumers engage with premium content on the open internet marketers can now reach highly attentive audiences at scale the notable levels of engagement ad trust and recall compared to traditional walled gardens mark a new era of ad receptiveness this transition is poised to boost ad spend on the open internet consumers clearly prefer the open internet for content consumption as more young adults are engaged when consuming content on the open internet compared to walled gardens findings reveal that platforms on the open internet excel in engagement with a greater proportion of young adults being most attentive in online games \u003cTHREE_TEN_PERCENT\u003e ott ctv and news websites \u003cTHREE_TEN_PERCENT\u003e all of which outperform social media platforms \u003cTHREE_TEN_PERCENT\u003e","timestamp":"2024-08-21T23:01:00+05:30","market_timestamp":"2024-08-22T09:15:00+05:30","off_market_hours":true}