{"url":"https://economictimes.indiatimes.com/tech/technology/nepal-lifts-tiktok-ban-after-app-addresses-cyber-crime-concerns/articleshow/112720041.cms","title":"Nepal lifts TikTok ban after app addresses cyber crime concerns","description":"Nepal has lifted a nine-month ban on TikTok after the company agreed to assist law enforcement with crime-related and inappropriate content issues. Previously banned for disturbing social harmony, TikTok now aims to support Nepal's police in addressing cyber crimes and moderating content. Nepal had seen over 1,600 TikTok-related crimes before the ban.","content":"Nepal lifted a ban on Chinese-owned TikTok on Thursday, more than nine months after outlawing the popular video sharing app for disturbing \"social harmony and goodwill.\" The decision was taken at a cabinet meeting after the company agreed to cooperate with Nepal's law enforcers to address TikTok-related crime and regulate its content, a government source said on condition of anonymity. ByteDance, TikTok's holding company based in Beijing, said it was pleased with the decision. Nepal's previous government banned the app in November, citing concerns around its misuse. More than 1,600 TikTok-related cyber crime cases were registered over four years in the Himalayan nation before that. Sporadic street protests erupted, with users saying the ban cut off a source of income and shut down a forum for free speech. TikTok had 2.2 million users in Nepal at the time, according to the Internet Service Providers' Association of Nepal.","cleaned_content":"nepal lifted a ban on chinese owned tiktok on thursday more than nine months after outlawing the popular video sharing app for disturbing social harmony and goodwill the decision was taken at a cabinet meeting after the company agreed to cooperate with nepals law enforcers to address tiktok related crime and regulate its content a government source said on condition of anonymity bytedance tiktoks holding company based in beijing said it was pleased with the decision nepals previous government banned the app in november citing concerns around its misuse more than \u003cONE_THOUSAND\u003e tiktok related cyber crime cases were registered over four years in the himalayan nation before that sporadic street protests erupted with users saying the ban cut off a source of income and shut down a forum for free speech tiktok had \u003cTWO_\u003e million users in nepal at the time according to the internet service providers association of nepal","timestamp":"2024-08-22T23:54:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}