{"url":"https://economictimes.indiatimes.com/tech/technology/taxi-auto-rickshaw-disruption-in-delhi-as-drivers-go-on-two-day-strike/articleshow/112702069.cms","title":"Auto, cab services hit in Delhi as drivers go on a two-day strike","description":"A two-day disruption in Delhi could have a significant impact on the business of platforms such as Ola and Uber, for whom the national capital is an important market in terms of customer base. The 15 unions on strike represent over 400,000 taxi and auto rickshaw drivers in the national capital.","content":"Cab and autorickshaw services were disrupted in New Delhi on Thursday with around 15 drivers’ unions, representing over 400,000 taxi and autorickshaw drivers, launching a two-day strike in protest against a fall in their earnings from Ola, Uber and other ride-hailing platforms.The protests have caused an impact of 40-50% on daily business of these companies, people aware of the matter said.“Earnings have reduced after the platforms increased their commissions and decreased driver incentives,” said Kishan Verma, president of Delhi Auto Taxi Transport Union Congress. “We have approached the central and state governments to protect our livelihood, but there has been no relief,” he added.Verma also flagged the introduction of bike taxis and e-rickshaws on these platforms, saying it is hurting the business of autorickshaws and taxis.“The strikes have also hit airport trips, which comprise a huge chunk of rides for aggregator platforms in the city,” a senior executive at one of the aggregator platforms said on condition of anonymity. “Even though the strike is happening in Delhi, it is impacting supplies in the entire National Capital Region (that includes Gurgaon, Noida, Ghaziabad and Faridabad),” he added.","cleaned_content":"cab and autorickshaw services were disrupted in new delhi on thursday with around \u003cONE_TEN\u003e drivers unions representing over \u003cFOUR_HUNDRED_THOUSAND\u003e taxi and autorickshaw drivers launching a two day strike in protest against a fall in their earnings from ola uber and other ride hailing platforms the protests have caused an impact of \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e on daily business of these companies people aware of the matter said earnings have reduced after the platforms increased their commissions and decreased driver incentives said kishan verma president of delhi auto taxi transport union congress we have approached the central and state governments to protect our livelihood but there has been no relief he added verma also flagged the introduction of bike taxis and e rickshaws on these platforms saying it is hurting the business of autorickshaws and taxis the strikes have also hit airport trips which comprise a huge chunk of rides for aggregator platforms in the city a senior executive at one of the aggregator platforms said on condition of anonymity even though the strike is happening in delhi it is impacting supplies in the entire national capital region that includes gurgaon noida ghaziabad and faridabad he added","timestamp":"2024-08-22T19:24:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}