{"url":"https://economictimes.indiatimes.com/tech/technology/crowdstrike-cuts-forecasts-as-windows-outage-weighs-on-new-deals/articleshow/112884153.cms","title":"CrowdStrike cuts forecasts as Windows outage weighs on new deals","description":"CrowdStrike revised its revenue and profit forecasts following a global outage caused by a faulty software update in July. The outage affected 8.5 million devices and led to flight cancellations. The company expects a challenging year ahead but aims to rebuild trust with customer support packages.","content":"Cybersecurity firm CrowdStrike cut its revenue and profit forecasts on Wednesday in the aftermath of a July global outage due to its faulty software update, and said the environment would remain challenging for about a year. The outage disrupted internet services, affecting 8.5 million Microsoft Windows devices and causing mass flight cancellations.  CEO George Kurtz said the incident delayed some of the company's deals into subsequent quarters, but the majority remain \"in the pipeline\".  Analysts expected the reputational hit could hurt CrowdStrike's dominant position, but the cost of switching providers could stave off a larger effect. Its shares fell more than 3% in extended trading. CFO Burt Podbere said the company's challenges would remain for about a year, with reacceleration in growth expected in the back half of next year.","cleaned_content":"cybersecurity firm crowdstrike cut its revenue and profit forecasts on wednesday in the aftermath of a july global outage due to its faulty software update and said the environment would remain challenging for about a year the outage disrupted internet services affecting \u003cEIGHT_\u003e million microsoft windows devices and causing mass flight cancellations ceo george kurtz said the incident delayed some of the companys deals into subsequent quarters but the majority remain in the pipeline analysts expected the reputational hit could hurt crowdstrikes dominant position but the cost of switching providers could stave off a larger effect its shares fell more than \u003cTHREE_PERCENT\u003e in extended trading cfo burt podbere said the companys challenges would remain for about a year with reacceleration in growth expected in the back half of next year","timestamp":"2024-08-29T09:53:00+05:30","market_timestamp":"2024-08-29T09:53:00+05:30","off_market_hours":false}