{"url":"https://economictimes.indiatimes.com/tech/information-tech/banks-up-tech-hiring-with-rbi-pushing-for-enhanced-risk-management/articleshow/112786182.cms","title":"Banks up tech hiring with RBI pushing for enhanced risk management","description":"In response to the RBI's increasing focus on financial sector stability, banks are bulking up their technology capabilities by expanding their tech teams and increasing IT investments. This comes amid the growing importance of cybersecurity and the need to adopt AI-driven services, which are becoming essential components of the banking industry.","content":"As India’s central bank steps up the emphasis on financial sector stability, banks are beefing up their technology teams and enhancing IT spending, as cybersecurity concerns and the need for AI-led services are increasingly becoming core to the sector.Even as overall hiring remains tepid, demand for technology professionals is on the rise in the sector as banking and investment firms significantly increase their IT spending. With projections indicating 12.2% growth in their IT spending in 2024, the focus is on adopting advanced analytics, artificial intelligence and machine learning-driven solutions, and automation technologies, data from multiple staffing firms showed.“The BFSI (banking, financial services and insurance) sector has seen a surge in hiring demand but in niche areas. We have seen an urgency by the clients to move to cloud, and this will go up in coming quarters. Cybersecurity has also seen huge demand,” said Kapil Joshi, deputy chief executive at Quess IT staffing.  ","cleaned_content":"as india s central bank steps up the emphasis on financial sector stability banks are beefing up their technology teams and enhancing it spending as cybersecurity concerns and the need for ai led services are increasingly becoming core to the sector even as overall hiring remains tepid demand for technology professionals is on the rise in the sector as banking and investment firms significantly increase their it spending with projections indicating \u003cONE_TEN_PERCENT\u003e growth in their it spending in \u003cTWO_THOUSAND\u003e the focus is on adopting advanced analytics artificial intelligence and machine learning driven solutions and automation technologies data from multiple staffing firms showed the bfsi banking financial services and insurance sector has seen a surge in hiring demand but in niche areas we have seen an urgency by the clients to move to cloud and this will go up in coming quarters cybersecurity has also seen huge demand said kapil joshi deputy chief executive at quess it staffing","timestamp":"2024-08-26T06:00:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}