{"url":"https://economictimes.indiatimes.com/tech/technology/google-agreed-to-pay-millions-for-california-news-journalists-call-it-a-bad-deal/articleshow/112746369.cms","title":"Google agreed to pay millions for California news. Journalists call it a bad deal","description":"Google will provide millions to fund California journalism jobs in a landmark deal while also supporting an AI research program. This comes after lawmakers dropped a bill requiring tech firms to pay publishers for linking to their content. Critics argued the deal largely benefits Google and offers less funding than anticipated.","content":"Google will soon give California millions of dollars to help pay for local journalism jobs in a first-in-the-nation deal, but journalists and other media industry experts are calling it a disappointing agreement that mostly benefits the tech giant. The agreement, which was hashed out behind closed doors and announced this week, will direct tens of millions of public and private dollars to keep local news organisations afloat. Critics say it's a textbook political maneuver by tech giants to avoid a fee under what could have been groundbreaking legislation. California lawmakers agreed to kill a bill requiring tech to support news outlets they profit from in exchange for Google's financial commitment. By shelving the bill, the state effectively gave up on an avenue that could have required Google and social media platforms to make ongoing payments to publishers for linking news content, said Victor Pickard, professor of media policy and political economy at the University of Pennsylvania. California also left behind a much bigger amount of funding that could have been secured under the legislation, he said. \"Google got off easy,\" Pickard said. Google said the deal will help both journalism and the artificial intelligence sector in California. ","cleaned_content":"google will soon give california millions of dollars to help pay for local journalism jobs in a first in the nation deal but journalists and other media industry experts are calling it a disappointing agreement that mostly benefits the tech giant the agreement which was hashed out behind closed doors and announced this week will direct tens of millions of public and private dollars to keep local news organisations afloat critics say its a textbook political maneuver by tech giants to avoid a fee under what could have been groundbreaking legislation california lawmakers agreed to kill a bill requiring tech to support news outlets they profit from in exchange for googles financial commitment by shelving the bill the state effectively gave up on an avenue that could have required google and social media platforms to make ongoing payments to publishers for linking news content said victor pickard professor of media policy and political economy at the university of pennsylvania california also left behind a much bigger amount of funding that could have been secured under the legislation he said google got off easy pickard said google said the deal will help both journalism and the artificial intelligence sector in california","timestamp":"2024-08-23T21:49:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}