{"url":"https://economictimes.indiatimes.com/tech/technology/apple-to-let-iphone-users-in-europe-delete-its-app-store/articleshow/112725490.cms","title":"Apple to let iPhone users in Europe delete its App Store","description":"Apple had long fiercely protected the App Store as the lone gateway for digital content to get onto its popular mobile devices. The change comes as the company loosens its grip on devices in the EU due to the bloc's landmark new digital rules. Apple last month promised changes to comply with the DMA and address the findings of the European Commission, the EU's powerful antitrust regulator.","content":"Apple will allow iPhone and iPad users in the European Union delete the App Store or its Safari browser, the tech giant told developers on Thursday.Apple had long fiercely protected the App Store as the lone gateway for digital content to get onto its popular mobile devices. The change comes as the company loosens its grip on devices in the EU due to the bloc's landmark new digital rules.\"The App Store, Messages, Camera, Photos, and Safari apps will be deletable for users in the EU,\" Apple said on a support page for developers.\"Only Settings and Phone will not be deletable.\"Also being added is a special section where iPhone or iPad users will be able to manage default settings for browsers, messaging, phone calls and other features, according to Apple.","cleaned_content":"apple will allow iphone and ipad users in the european union delete the app store or its safari browser the tech giant told developers on thursday apple had long fiercely protected the app store as the lone gateway for digital content to get onto its popular mobile devices the change comes as the company loosens its grip on devices in the eu due to the blocs landmark new digital rules the app store messages camera photos and safari apps will be deletable for users in the eu apple said on a support page for developers only settings and phone will not be deletable also being added is a special section where iphone or ipad users will be able to manage default settings for browsers messaging phone calls and other features according to apple","timestamp":"2024-08-23T08:06:00+05:30","market_timestamp":"2024-08-23T09:15:00+05:30","off_market_hours":true}