{"url":"https://economictimes.indiatimes.com/tech/technology/donald-trump-says-he-may-end-ev-tax-credit-is-open-to-naming-elon-musk-as-an-adviser/articleshow/112640012.cms","title":"Donald Trump says open to naming Tesla CEO Elon Musk as an adviser; hints at ending EV tax credit","description":"Republican presidential candidate Donald Trump stated on Monday that he would consider terminating a $7,500 tax credit for electric vehicle (EV) purchases if elected. He also mentioned being open to appointing Tesla CEO Elon Musk to a cabinet or advisory role, calling Musk a \"very smart guy.\"","content":"Republican presidential candidate Donald Trump said on Monday that if elected he would consider ending a $7,500 tax credit for electric-vehicle purchases and that he would be open to naming Tesla CEO Elon Musk to a cabinet or advisory role. \"Tax credits and tax incentives are not generally a very good thing,\" Trump told Reuters in an interview after a campaign event in York, Pennsylvania, when asked about the EV credit. Asked if he would consider naming Musk to an advisory role or cabinet job, Trump said he would. \"He's a very smart guy. I certainly would, if he would do it, I certainly would. He's a brilliant guy,\" Trump said. Musk last month publicly endorsed Trump in the U.S. presidential race. Tesla did not immediately respond to a request for comment. If elected, Trump could take steps to reverse Treasury Department rules that have made it easier for automakers to take advantage of the $7,500 credit or could ask the U.S. Congress to repeal it entirely. While president, Trump sought to repeal the EV tax credit which was later expanded by President Joe Biden in 2022. ","cleaned_content":"republican presidential candidate donald trump said on monday that if elected he would consider ending a \u003cSEVEN_THOUSAND\u003e tax credit for electric vehicle purchases and that he would be open to naming tesla ceo elon musk to a cabinet or advisory role tax credits and tax incentives are not generally a very good thing trump told reuters in an interview after a campaign event in york pennsylvania when asked about the ev credit asked if he would consider naming musk to an advisory role or cabinet job trump said he would hes a very smart guy i certainly would if he would do it i certainly would hes a brilliant guy trump said musk last month publicly endorsed trump in the u s presidential race tesla did not immediately respond to a request for comment if elected trump could take steps to reverse treasury department rules that have made it easier for automakers to take advantage of the \u003cSEVEN_THOUSAND\u003e credit or could ask the u s congress to repeal it entirely while president trump sought to repeal the ev tax credit which was later expanded by president joe biden in \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-20T08:18:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}