{"url":"https://economictimes.indiatimes.com/tech/technology/unicommerce-esolutions-stock-scales-fresh-high/articleshow/112644542.cms","title":"Unicommerce Esolutions stock scales fresh high","description":"Unicommerce shares surge 16% in early trading, after a 20% jump in the previous session. The company’s Rs 277-crore initial public offering (IPO) was subscribed nearly 170 times, making it one of the most subscribed issues this year. The IPO was entirely an offer for sale, with no primary capital raised by the company.","content":"Shares of Unicommerce Esolutions Ltd jumped 16% in early trading on Tuesday, scaling a fresh high of Rs 264 per share.It came after a 20% surge in the previous trading session.The e-commerce software company listed on the bourses on August 13 at a hefty premium on the National Stock Exchange (NSE), it listed at Rs 235 per share, more than double its issue price of Rs 108.On August 13, ET reported that the company’s Rs 277-crore initial public offering (IPO) was subscribed nearly 170 times, making it one of the most subscribed issues this year. The IPO was entirely an offer for sale, with no primary capital raised by the company.As of 11 am on Tuesday, the shares were trading 10.35% higher at Rs 251 on the BSE.","cleaned_content":"shares of unicommerce esolutions ltd jumped \u003cONE_TEN_PERCENT\u003e in early trading on tuesday scaling a fresh high of rs \u003cTWO_HUNDRED\u003e per share it came after a \u003cTWO_TEN_PERCENT\u003e surge in the previous trading session the e commerce software company listed on the bourses on august \u003cONE_TEN\u003e at a hefty premium on the national stock exchange nse it listed at rs \u003cTWO_HUNDRED\u003e per share more than double its issue price of rs \u003cONE_HUNDRED\u003e on august \u003cONE_TEN\u003e et reported that the company s rs \u003cTWO_HUNDRED\u003e crore initial public offering ipo was subscribed nearly \u003cONE_HUNDRED\u003e times making it one of the most subscribed issues this year the ipo was entirely an offer for sale with no primary capital raised by the company as of \u003cONE_TEN\u003e am on tuesday the shares were trading \u003cONE_TEN_PERCENT\u003e higher at rs \u003cTWO_HUNDRED\u003e on the bse","timestamp":"2024-08-20T11:50:00+05:30","market_timestamp":"2024-08-20T11:50:00+05:30","off_market_hours":false}