{"url":"https://economictimes.indiatimes.com/tech/information-tech/strong-client-interest-on-genai-dont-foresee-layoffs-within-infosys-from-new-age-tech-ceo-salil-parekh/articleshow/112780762.cms","title":"Strong client interest on GenAI; don't foresee layoffs within Infosys from new-age tech: CEO Salil Parekh","description":"Infosys CEO Salil Parekh revealed substantial interest from clients in Generative AI technology, comparable to previous digital and cloud adoption. The company has trained over 250,000 employees in GenAI without expecting layoffs. Despite a significant GST tax demand, Infosys continues to see positive growth due to ongoing client projects and benefits from GenAI technologies.","content":"Generative AI is evoking strong interest from clients and there is a huge mobilisation of GenAI within Infosys as well, CEO Salil Parekh has said, asserting that he does not foresee any layoffs in his company on account of these new-age technologies. On the USD 3.9-billion GST tax demand, Parekh said Infosys has already given out updates and made disclosures in the market (through BSE filing) and has no further update to share.  \"We have no new update. The status is as it was in terms of what we shared externally a few days ago,\" Parekh said when asked if the company will be making provisions for the same, given the demand in back taxes dating back several years.  In an interview to PTI, Parekh said there is a huge reception from clients on Generative AI and likened it to the adoption curve seen for digital and cloud technologies in the past.  Parekh believes GenAI adoption will increase with time as enterprises experience the benefits and business outcomes arising from it.  \"So we think this will accelerate as time goes on but we will wait-and-watch how it develops. It is a bit like, some years ago we started with digital or with cloud... these things start-off in a certain way... and then we see what benefits clients are getting. If they see benefits are substantial, more and more adoption will happen,\" he said. ","cleaned_content":"generative ai is evoking strong interest from clients and there is a huge mobilisation of genai within infosys as well ceo salil parekh has said asserting that he does not foresee any layoffs in his company on account of these new age technologies on the usd \u003cTHREE_\u003e billion gst tax demand parekh said infosys has already given out updates and made disclosures in the market through bse filing and has no further update to share we have no new update the status is as it was in terms of what we shared externally a few days ago parekh said when asked if the company will be making provisions for the same given the demand in back taxes dating back several years in an interview to pti parekh said there is a huge reception from clients on generative ai and likened it to the adoption curve seen for digital and cloud technologies in the past parekh believes genai adoption will increase with time as enterprises experience the benefits and business outcomes arising from it so we think this will accelerate as time goes on but we will wait and watch how it develops it is a bit like some years ago we started with digital or with cloud these things start off in a certain way and then we see what benefits clients are getting if they see benefits are substantial more and more adoption will happen he said","timestamp":"2024-08-25T15:45:00+05:30","market_timestamp":"2024-08-26T09:15:00+05:30","off_market_hours":true}