{"url":"https://economictimes.indiatimes.com/tech/technology/upi-market-share-cap-delay-likely-to-keep-pay-pie-unchanged/articleshow/112633889.cms","title":"UPI market share cap delay likely to keep online payments pie unchanged","description":"The 30% market share cap in the UPI segment was considered improbable with only a few months left until the deadline. Newcomers revised their plans as PhonePe and Google Pay retained dominance. The government had not yet provided an official stance to the NPCI on this matter. On the other hand, NPCI has been allowing multiple consumer internet platforms with a large user base to become third-party application providers and launch their own UPI offerings.","content":"A proposed 30% market share cap in the Unified Payments Interface (UPI) segment is looking unlikely, said industry executives, with only a little over four months to the deadline. Several UPI newcomers have been told informally that the limit is unlikely to be put into effect and, accordingly, have started redrawing growth and investment plans, people briefed on the matter said. At least four recent entrants confirmed this to ET.ET reported on April 17 that new entrants have been withholding major investments in UPI, waiting to get a sense of the market share rule. PhonePe and Google Pay dominate UPI payments.The government, though, is yet to indicate its official stand to the National Payments Corporation of India (NPCI), which manages the UPI railroad.Users’ preferencePeople cited earlier said the regulator is also of the view that newer players haven’t made a dent on the concentration of UPI users with the leading duo, leaving it with few options on implementing the December 31 deadline.","cleaned_content":"a proposed \u003cTHREE_TEN_PERCENT\u003e market share cap in the unified payments interface upi segment is looking unlikely said industry executives with only a little over four months to the deadline several upi newcomers have been told informally that the limit is unlikely to be put into effect and accordingly have started redrawing growth and investment plans people briefed on the matter said at least four recent entrants confirmed this to et et reported on april \u003cONE_TEN\u003e that new entrants have been withholding major investments in upi waiting to get a sense of the market share rule phonepe and google pay dominate upi payments the government though is yet to indicate its official stand to the national payments corporation of india npci which manages the upi railroad users preferencepeople cited earlier said the regulator is also of the view that newer players haven t made a dent on the concentration of upi users with the leading duo leaving it with few options on implementing the december \u003cTHREE_TEN\u003e deadline","timestamp":"2024-08-20T11:27:00+05:30","market_timestamp":"2024-08-20T11:27:00+05:30","off_market_hours":false}