{"url":"https://economictimes.indiatimes.com/tech/technology/french-prosecutors-say-telegram-messaging-app-ceo-has-been-freed-from-custody-will-appear-in-court/articleshow/112871165.cms","title":"French prosecutors say Telegram CEO has been freed from custody, will appear in court","description":"Durov was detained on Saturday at Le Bourget airport outside Paris as part of a judicial inquiry opened last month involving 12 alleged criminal violations.","content":"French prosecutors on Wednesday freed Telegram CEO Pavel Durov from police custody after four days of questioning over allegations that the platform is being used for illegal activities. Durov was detained on Saturday at Le Bourget airport outside Paris as part of a judicial inquiry opened last month involving 12 alleged criminal violations. \"An investigating judge has ended Pavel Durov's police custody and will have him brought to court for a first appearance and a possible indictment,\" a statement from the Paris prosecutor's office said. Other allegations against Durov, who is a French citizen, include that his platform is being used for child sexual abuse material and drug trafficking, fraud and abetting organized crime transactions, and that Telegram refused to share information or documents with investigators when required by law.","cleaned_content":"french prosecutors on wednesday freed telegram ceo pavel durov from police custody after four days of questioning over allegations that the platform is being used for illegal activities durov was detained on saturday at le bourget airport outside paris as part of a judicial inquiry opened last month involving \u003cONE_TEN\u003e alleged criminal violations an investigating judge has ended pavel durovs police custody and will have him brought to court for a first appearance and a possible indictment a statement from the paris prosecutors office said other allegations against durov who is a french citizen include that his platform is being used for child sexual abuse material and drug trafficking fraud and abetting organized crime transactions and that telegram refused to share information or documents with investigators when required by law","timestamp":"2024-08-28T19:29:00+05:30","market_timestamp":"2024-08-29T09:15:00+05:30","off_market_hours":true}