{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musk-ban-on-remote-work-at-x-beats-disability-bias-claim-for-now/articleshow/112698214.cms","title":"Elon Musk ban on remote work at X beats disability bias claim for now","description":"The lawsuit claims X violated a federal law requiring employers to accommodate workers' disabilities. Elon Musk said in a memo to the company's staff in November 2022 that employees should be prepared to work \"long hours at high intensity\" or quit, and later tweeted that it was \"morally wrong\" to work from home.","content":"A federal judge in California on Wednesday dismissed a lawsuit accusing social media platform X of forcing out workers with disabilities after Elon Musk took over the company and barred employees from working remotely. U.S. District Judge Araceli Martinez-Olguin in San Francisco said the plaintiff in the 2022 proposed class action, Dmitry Borodaenko, failed to show how Musk's mandate to return to the office specifically impacted employees with disabilities. The judge gave him four weeks to file an amended lawsuit including more detailed claims.  Borodaenko, a former engineering manager and cancer survivor, claims he was fired shortly after Musk acquired X, then called Twitter, for refusing to report to the office during the COVID-19 pandemic. The lawsuit claims X violated a federal law requiring employers to accommodate workers' disabilities.  Musk said in a memo to the company's staff in November 2022 that employees should be prepared to work \"long hours at high intensity\" or quit, and later tweeted that it was \"morally wrong\" to work from home.  Martinez-Olguin on Wednesday said the ban on remote work did not amount to disability discrimination. ","cleaned_content":"a federal judge in california on wednesday dismissed a lawsuit accusing social media platform x of forcing out workers with disabilities after elon musk took over the company and barred employees from working remotely u s district judge araceli martinez olguin in san francisco said the plaintiff in the \u003cTWO_THOUSAND\u003e proposed class action dmitry borodaenko failed to show how musks mandate to return to the office specifically impacted employees with disabilities the judge gave him four weeks to file an amended lawsuit including more detailed claims borodaenko a former engineering manager and cancer survivor claims he was fired shortly after musk acquired x then called twitter for refusing to report to the office during the covid \u003cONE_TEN\u003e pandemic the lawsuit claims x violated a federal law requiring employers to accommodate workers disabilities musk said in a memo to the companys staff in november \u003cTWO_THOUSAND\u003e that employees should be prepared to work long hours at high intensity or quit and later tweeted that it was morally wrong to work from home martinez olguin on wednesday said the ban on remote work did not amount to disability discrimination","timestamp":"2024-08-22T09:48:00+05:30","market_timestamp":"2024-08-22T09:48:00+05:30","off_market_hours":false}