{"url":"https://economictimes.indiatimes.com/tech/technology/tata-electronics-partners-with-asmpt-singapore-for-semicon-solutions/articleshow/113216114.cms","title":"Tata Electronics partners with ASMPT Singapore for semicon solutions","description":"Robin Ng, Group CEO, ASMPT, said, \"By leveraging our collective expertise and resources, we are well-positioned to drive significant progress in the semiconductor industry. This collaboration will not only propel technological innovation but also cultivate the talent required for sustained future growth.\"","content":"In order to ready semiconductor assembly and test facilities in Vemagal, Karnataka and Jagiroad, Assam, Tata Electronics has signed a Memorandum of Understanding (MOU) with ASMPT Singapore to collaborate on establishing semiconductor assembly equipment infrastructure and solutions.Through this partnership, Tata Electronics (a wholly owned subsidiary of Tata Sons Pvt. Ltd.) and ASMPT, a global supplier of hardware and software solutions for the manufacture of semiconductors and electronics, will collaborate for workforce training, advancing service engineering infrastructure, automation, spare supports and boosting R\u0026D initiatives in the area of wirebond, flip chip, advanced packaging and, integrated system packaging. This partnership shall also focus on energy and material efficiency to promote sustainable growth and strengthen the semiconductor supply chain ecosystem.Randhir Thakur, managing director and chief executive, Tata Electronics, said, \"We have a bold vision to establish India as a leading electronics manufacturing hub by offering integrated solutions across the electronics manufacturing value chain to global customers seeking a resilient supply chain. This partnership will emphasise the development of essential training programmes and advanced research and development, while also nurturing a vibrant ecosystem within the country.\"Robin Ng, Group CEO, ASMPT, said, \"By leveraging our collective expertise and resources, we are well-positioned to drive significant progress in the semiconductor industry. This collaboration will not only propel technological innovation but also cultivate the talent required for sustained future growth.\"","cleaned_content":"in order to ready semiconductor assembly and test facilities in vemagal karnataka and jagiroad assam tata electronics has signed a memorandum of understanding mou with asmpt singapore to collaborate on establishing semiconductor assembly equipment infrastructure and solutions through this partnership tata electronics a wholly owned subsidiary of tata sons pvt ltd and asmpt a global supplier of hardware and software solutions for the manufacture of semiconductors and electronics will collaborate for workforce training advancing service engineering infrastructure automation spare supports and boosting r d initiatives in the area of wirebond flip chip advanced packaging and integrated system packaging this partnership shall also focus on energy and material efficiency to promote sustainable growth and strengthen the semiconductor supply chain ecosystem randhir thakur managing director and chief executive tata electronics said we have a bold vision to establish india as a leading electronics manufacturing hub by offering integrated solutions across the electronics manufacturing value chain to global customers seeking a resilient supply chain this partnership will emphasise the development of essential training programmes and advanced research and development while also nurturing a vibrant ecosystem within the country robin ng group ceo asmpt said by leveraging our collective expertise and resources we are well positioned to drive significant progress in the semiconductor industry this collaboration will not only propel technological innovation but also cultivate the talent required for sustained future growth","timestamp":"2024-09-10T11:33:00+05:30","market_timestamp":"2024-09-10T11:33:00+05:30","off_market_hours":false}