{"url":"https://economictimes.indiatimes.com/tech/technology/tata-digital-logs-rs-37355-crore-aggregate-gmv-in-fy24-as-turnover-rises-loss-narrows/articleshow/113135157.cms","title":"Tata Digital logs Rs 37,355 crore aggregate GMV in FY24, as turnover rises, loss narrows","description":"While total turnover more than doubled to Rs 420.5 crore from Rs 204.3 crore in FY23, standalone losses narrowed to Rs 1,201 crore from Rs 1,370 crore YoY. The business, which operates the super app Tata Neu, saw 20.76 million transacting customers during the fiscal year.","content":"Tata Digital, the ecommerce arm of the Tata Group has reported an aggregate gross merchandise value (GMV) of Rs 37,355 crore in FY24, according to Tata Son’s latest annual report.The business, which operates the super app Tata Neu, includes a portfolio of brands such as omnichannel electronic retailer Croma, e-grocery platform BigBasket, online pharmacy 1mg, and fashion and lifestyle marketplace Tata Cliq. Tata Neu recorded 20.76 million transacting customers during the fiscal year, the report noted.On the ecommerce front, the conglomerate expanded its offerings this year by launching food delivery as a new category through the Open Network for Digital Commerce (ONDC). Furthermore, its co-branded credit card, launched in 2022 in partnership with HDFC Bank, has reached 1.18 million issued cards. Also, Tata NeuPass, the rewards program of Tata Neu, has amassed 116.4 million members by FY24.For FY24, Tata Digital’s total turnover more than doubled to Rs 420.5 crore from Rs 204.3 crore in FY23. The company also narrowed its standalone losses to Rs 1,201 crore from Rs 1,370 crore in the previous year.","cleaned_content":"tata digital the ecommerce arm of the tata group has reported an aggregate gross merchandise value gmv of rs \u003cTHREE_TEN_THOUSAND\u003e crore in fy24 according to tata son s latest annual report the business which operates the super app tata neu includes a portfolio of brands such as omnichannel electronic retailer croma e grocery platform bigbasket online pharmacy \u003cONE_\u003e mg and fashion and lifestyle marketplace tata cliq tata neu recorded \u003cTWO_TEN\u003e million transacting customers during the fiscal year the report noted on the ecommerce front the conglomerate expanded its offerings this year by launching food delivery as a new category through the open network for digital commerce ondc furthermore its co branded credit card launched in \u003cTWO_THOUSAND\u003e in partnership with hdfc bank has reached \u003cONE_\u003e million issued cards also tata neupass the rewards program of tata neu has amassed \u003cONE_HUNDRED\u003e million members by fy24 for fy24 tata digital s total turnover more than doubled to rs \u003cFOUR_HUNDRED\u003e crore from rs \u003cTWO_HUNDRED\u003e crore in fy23 the company also narrowed its standalone losses to rs \u003cONE_THOUSAND\u003e crore from rs \u003cONE_THOUSAND\u003e crore in the previous year","timestamp":"2024-09-06T22:40:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}