{"url":"https://economictimes.indiatimes.com/tech/technology/westbridge-backed-adda247-cofounder-chandan-singh-quits-to-build-new-venture/articleshow/113131468.cms","title":"WestBridge-backed Adda247 cofounder Chandan Singh quits to build new venture","description":"Chandan Singh joined Adda247 in 2019 as VP - product and was promoted to chief product officer in 2020. Before joining Adda247, Singh worked with Coverfox, Infoedge and Oracle. Adda247 provides courses in 12 regional languages and plans to extend its reach to two or three more states and languages this year.","content":"Chandan Singh, cofounder of the Google-backed edtech startup Adda247, has departed from the company.Last year on January 9, Singh, who was serving as the chief product officer of the edtech company, was promoted to the position of cofounder.“Looking back on the past five years, I feel incredibly grateful for the journey I’ve had here. Working with such talented and dedicated people has been an absolute privilege, and the memories we’ve made will always be special to me,” Singh said in a LinkedIn post on Thursday. According to his LinkedIn, he is currently building a new venture in stealth mode.Singh joined Adda247 in 2019 as VP - product and was promoted to chief product officer in 2020. Before joining Adda247, Singh worked with Coverfox, Infoedge and Oracle.","cleaned_content":"chandan singh cofounder of the google backed edtech startup adda247 has departed from the company last year on january \u003cNINE_\u003e singh who was serving as the chief product officer of the edtech company was promoted to the position of cofounder looking back on the past five years i feel incredibly grateful for the journey i ve had here working with such talented and dedicated people has been an absolute privilege and the memories we ve made will always be special to me singh said in a linkedin post on thursday according to his linkedin he is currently building a new venture in stealth mode singh joined adda247 in \u003cTWO_THOUSAND\u003e as vp product and was promoted to chief product officer in \u003cTWO_THOUSAND\u003e before joining adda247 singh worked with coverfox infoedge and oracle","timestamp":"2024-09-06T19:37:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}