{"url":"https://economictimes.indiatimes.com/tech/technology/how-brazils-experiment-fighting-fake-news-led-to-a-ban-on-x/articleshow/112969327.cms","title":"How Brazil's experiment fighting fake news led to a ban on X","description":"Brazil's yearslong fight against the internet's destructive effect on politics, culminating in the current blackout of X, shows the pitfalls of a nation deciding what can be said online. Do too little and allow online chatter to undermine democracy; do too much and restrict citizens' legitimate speech.","content":"As Brazil grappled with a flood of online disinformation around its 2022 presidential election, the nation's Supreme Court made an unusual and fateful decision: It gave one justice sweeping powers to order social networks to take down content he believed threatened democracy. That justice, Alexandre de Moraes, has since carried out an aggressive campaign to clean up his country's internet, forcing social networks to pull down thousands of posts, often giving them a deadline of just hours to comply. It has been one of the most comprehensive -- and, in some ways, most effective -- efforts to combat the scourge of internet falsehoods. When his online crackdown helped stifle far-right efforts to overturn Brazil's election, academics and commentators wondered whether the nation had found a possible solution to one of the most vexing problems of modern democracy. Then, on Friday, de Moraes blocked the social network X across Brazil because its owner, Elon Musk, had ignored his court orders to remove accounts and then closed X's office in Brazil. As part of the blackout order, the judge said internet users who tried to circumvent his measure in order to keep using X could be fined nearly $9,000 a day, or more than what the average Brazilian makes a year. It was the judge's boldest measure yet, and it left even many of his defenders worried that Brazil's experiment had gone too far.","cleaned_content":"as brazil grappled with a flood of online disinformation around its \u003cTWO_THOUSAND\u003e presidential election the nations supreme court made an unusual and fateful decision it gave one justice sweeping powers to order social networks to take down content he believed threatened democracy that justice alexandre de moraes has since carried out an aggressive campaign to clean up his countrys internet forcing social networks to pull down thousands of posts often giving them a deadline of just hours to comply it has been one of the most comprehensive and in some ways most effective efforts to combat the scourge of internet falsehoods when his online crackdown helped stifle far right efforts to overturn brazils election academics and commentators wondered whether the nation had found a possible solution to one of the most vexing problems of modern democracy then on friday de moraes blocked the social network x across brazil because its owner elon musk had ignored his court orders to remove accounts and then closed xs office in brazil as part of the blackout order the judge said internet users who tried to circumvent his measure in order to keep using x could be fined nearly \u003cNINE_THOUSAND\u003e a day or more than what the average brazilian makes a year it was the judges boldest measure yet and it left even many of his defenders worried that brazils experiment had gone too far","timestamp":"2024-09-01T17:26:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}