{"url":"https://economictimes.indiatimes.com/tech/technology/rebel-foods-posts-rise-in-fy24-revenue-to-rs-1420-crore-trims-losses/articleshow/112924120.cms","title":"Rebel Foods posts rise in FY24 revenue to Rs 1,420 crore, trims losses","description":"Rebel Foods cut its losses by 42%, bringing it to Rs 378 crore in fiscal year 2024, down from Rs 656 crore a year ago. This comes days after ET reported about Singapore's Temasek mulling a $100-150 million investment in the company, in a mix of primary and secondary share sale.","content":"Rebel Foods — the parent of Faasos, Behrouz Biryani and other cloud kitchen brands — posted operating revenue of Rs 1,420 crore for the financial year ended March 31, 2024, up 19% from Rs 1,195 crore in FY23. Its loss reduced 42% to Rs 378 crore in FY24 from Rs 656 crore the previous fiscal year.The company kept its total expenses in check at Rs 1,857 crore, compared with Rs 1,827 crore in FY23. A significant amount of the expenditure was attributed to the cost of materials consumed, which rose to Rs 613 crore from Rs 577 crore.Employee benefit expenses reduced to Rs 394 crore from Rs 405 crore, while other expenses fell to Rs 637 crore from Rs 657 crore. The brand had laid off 2% of its workforce in January 2023. Its advertising and sales promotion cost reduced to Rs 133 crore from Rs 197 crore.\"We are able to address large food categories from a single infrastructure through strong brands. Also, during the year, we further strengthened our portfolio on the back of strong customer insights and culinary innovations,\" the company said in a statement on Friday.On August 26, ET reported that Singaporean sovereign fund Temasek is in advanced discussions to lead an investment of $100-150 million in the company. The deal will be a mix of primary and secondary share sales and is likely at a lower valuation of around $700 million, said the people.","cleaned_content":"rebel foods the parent of faasos behrouz biryani and other cloud kitchen brands posted operating revenue of rs \u003cONE_THOUSAND\u003e crore for the financial year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e up \u003cONE_TEN_PERCENT\u003e from rs \u003cONE_THOUSAND\u003e crore in fy23 its loss reduced \u003cFOUR_TEN_PERCENT\u003e to rs \u003cTHREE_HUNDRED\u003e crore in fy24 from rs \u003cSIX_HUNDRED\u003e crore the previous fiscal year the company kept its total expenses in check at rs \u003cONE_THOUSAND\u003e crore compared with rs \u003cONE_THOUSAND\u003e crore in fy23 a significant amount of the expenditure was attributed to the cost of materials consumed which rose to rs \u003cSIX_HUNDRED\u003e crore from rs \u003cFIVE_HUNDRED\u003e crore employee benefit expenses reduced to rs \u003cTHREE_HUNDRED\u003e crore from rs \u003cFOUR_HUNDRED\u003e crore while other expenses fell to rs \u003cSIX_HUNDRED\u003e crore from rs \u003cSIX_HUNDRED\u003e crore the brand had laid off \u003cTWO_PERCENT\u003e of its workforce in january \u003cTWO_THOUSAND\u003e its advertising and sales promotion cost reduced to rs \u003cONE_HUNDRED\u003e crore from rs \u003cONE_HUNDRED\u003e crore we are able to address large food categories from a single infrastructure through strong brands also during the year we further strengthened our portfolio on the back of strong customer insights and culinary innovations the company said in a statement on friday on august \u003cTWO_TEN\u003e et reported that singaporean sovereign fund temasek is in advanced discussions to lead an investment of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e million in the company the deal will be a mix of primary and secondary share sales and is likely at a lower valuation of around \u003cSEVEN_HUNDRED\u003e million said the people","timestamp":"2024-08-30T21:30:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}