{"url":"https://economictimes.indiatimes.com/tech/technology/bescom-launches-revamped-app-for-ease-of-ev-charging/articleshow/113232999.cms","title":"Bescom launches revamped app for ease of EV charging","description":"The EV Mitra allows users to personalise their experience, provides information about charging stations, including location, availability and amenities, ensures secure access via OTP or RFID and enables users to reserve chargers and view their booking history. It offers multiple payment options too.","content":"The Bangalore Electricity Supply Company Limited (Bescom) has launched a new interface for its \"EV Mitra\" app, which helps electric vehicle (EV) users charge their vehicles. The app, available for both Android and iOS devices, is designed to make EV charging easier, accessible, and efficient, Bescom said in a press statement.The EV Mitra allows users to personalise their experience, provides information about charging stations, including location, availability and amenities, ensures secure access via OTP or RFID and enables users to reserve chargers and view their booking history. It offers multiple payment options too.Bescom has asked consumers to uninstall the old EV Mithra app and install the revamped app. The wallet balance in the old app will reflect in the new app. Once logged in, the user can explore the various features tailored for private and fleet users.Retail users can easily top up their in-app wallets or make payments through UPI or Bill Desk. In case of any technical issues that interrupt charging, users are assured a refund for the amount paid. Fleet operators can also benefit from special access codes and privileges tailored to their needs, the statement added.Energy Minister KJ George said Karnataka was embracing the future of technology. \"The introduction of the new EV Mitra app, with its user-friendly interface and support for multiple languages, shows the commitment of our government to making eco-friendly travel affordable and convenient for everyone.\"","cleaned_content":"the bangalore electricity supply company limited bescom has launched a new interface for its ev mitra app which helps electric vehicle ev users charge their vehicles the app available for both android and ios devices is designed to make ev charging easier accessible and efficient bescom said in a press statement the ev mitra allows users to personalise their experience provides information about charging stations including location availability and amenities ensures secure access via otp or rfid and enables users to reserve chargers and view their booking history it offers multiple payment options too bescom has asked consumers to uninstall the old ev mithra app and install the revamped app the wallet balance in the old app will reflect in the new app once logged in the user can explore the various features tailored for private and fleet users retail users can easily top up their in app wallets or make payments through upi or bill desk in case of any technical issues that interrupt charging users are assured a refund for the amount paid fleet operators can also benefit from special access codes and privileges tailored to their needs the statement added energy minister kj george said karnataka was embracing the future of technology the introduction of the new ev mitra app with its user friendly interface and support for multiple languages shows the commitment of our government to making eco friendly travel affordable and convenient for everyone","timestamp":"2024-09-10T19:23:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}