{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-judge-orders-shutdown-of-x-social-network-elon-musk-furious/articleshow/112938406.cms","title":"Brazil judge orders shutdown of X social network; Elon Musk furious","description":"A Supreme Court judge on Friday ordered the suspension of Elon Musk's X social media network in Brazil after the billionaire failed to comply with an order to name a new legal representative for the company. On Wednesday, Moraes told Musk \"to appoint the company's new legal representative in Brazil within 24 hours\" or face suspension.","content":"A Supreme Court judge on Friday ordered the suspension of Elon Musk's X social media network in Brazil after the billionaire failed to comply with an order to name a new legal representative for the company.Musk has been locked in a months-long feud with the judge, Alexandre de Moraes, who is leading a battle against disinformation in South America's largest nation.Moraes ordered the \"immediate, complete and comprehensive suspension of the operation of 'X Brasil Internet LTDA' in the national territory.\"He ordered the National Telecommunications Agency (Anatel) to \"adopt all necessary measures to implement\" the order within 24 hours. He also asked Google, Apple, and internet providers to \"introduce technological obstacles capable of preventing the use of the X application\" and access to the website.","cleaned_content":"a supreme court judge on friday ordered the suspension of elon musks x social media network in brazil after the billionaire failed to comply with an order to name a new legal representative for the company musk has been locked in a months long feud with the judge alexandre de moraes who is leading a battle against disinformation in south americas largest nation moraes ordered the immediate complete and comprehensive suspension of the operation of x brasil internet ltda in the national territory he ordered the national telecommunications agency anatel to adopt all necessary measures to implement the order within \u003cTWO_TEN\u003e hours he also asked google apple and internet providers to introduce technological obstacles capable of preventing the use of the x application and access to the website","timestamp":"2024-09-02T13:57:00+05:30","market_timestamp":"2024-09-02T13:57:00+05:30","off_market_hours":false}