{"url":"https://economictimes.indiatimes.com/tech/technology/for-boat-q-com-is-third-largest-sales-channel-says-cofounder-aman-gupta/articleshow/113099405.cms","title":"For Boat, q-com is third-largest sales channel, says cofounder Aman Gupta","description":"Brands are growing much faster on q-com than on traditional ecommerce channels, says Gupta of the wearable and audio products firm. “People like us were born on marketplaces. Now, there are brands being built on quick commerce,\" Gupta said at the Razorpay D2C and Retail Summit held in New Delhi.","content":"Homegrown wearable and audio products brand Boat’s third-biggest channel for sales is quick commerce, said cofounder Aman Gupta on Thursday.“There are brands that are doing much better on quick commerce than on Amazon, Flipkart, or any other traditional ecommerce channels. I think it's a good time for quick commerce,” Gupta said, highlighting that things are evolving and quick commerce is here to stay.New-age brands have been expanding at a faster pace than expected, driven by the quick-commerce channel. ET had earlier reported that the ultra-fast delivery segment has significantly boosted certain categories and SKUs on platforms, such as Blinkit, Zepto, and Instamart.“People like us were born on marketplaces. Now, there are brands being built on quick commerce,\" Gupta said at the Razorpay D2C and Retail Summit held in New Delhi.On August 7, ET reported that the rapid growth of quick commerce and strong demand for emerging D2C brands on platforms like Blinkit, Zepto, and Instamart, is driving dealmaking among early-to-mid-stage brands.","cleaned_content":"homegrown wearable and audio products brand boat s third biggest channel for sales is quick commerce said cofounder aman gupta on thursday there are brands that are doing much better on quick commerce than on amazon flipkart or any other traditional ecommerce channels i think its a good time for quick commerce gupta said highlighting that things are evolving and quick commerce is here to stay new age brands have been expanding at a faster pace than expected driven by the quick commerce channel et had earlier reported that the ultra fast delivery segment has significantly boosted certain categories and skus on platforms such as blinkit zepto and instamart people like us were born on marketplaces now there are brands being built on quick commerce gupta said at the razorpay d2c and retail summit held in new delhi on august \u003cSEVEN_\u003e et reported that the rapid growth of quick commerce and strong demand for emerging d2c brands on platforms like blinkit zepto and instamart is driving dealmaking among early to mid stage brands","timestamp":"2024-09-05T19:13:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}