{"url":"https://economictimes.indiatimes.com/tech/information-tech/mphasis-to-double-presence-in-uk-with-innovation-hub-for-quantum-expertise/articleshow/113233224.cms","title":"Mphasis to double presence in UK with innovation hub for quantum expertise","description":"Mphasis said in a regulatory filing that it has expanded its UK presence over the past years and looks to double the headcount over the next three years through the London innovation hub. While the exact headcount in UK was uncertain, Mphasis employed a total workforce at 31,645 as of June end, down by 1,019 employees from the March quarter.","content":"Mid-tier software services provider on Tuesday announced plans to double its presence in the UK as it established a London innovation hub to leverage the transformative power of Quantum technologies.“The facility will serve as a Centre of Excellence (CoE) for developing cutting-edge Quantum Computing, Quantum Cryptography and Artificial Intelligence (AI) solutions. These solutions will address critical industry challenges such as algorithmic underwriting, catastrophic risk modelling, and fraud detection. Mphasis' expertise will empower businesses in the UK and worldwide to leverage the transformative power of Quantum technologies,” Mphasis said in a regulatory filing.It added, “Mphasis has steadily expanded its UK presence over the past years and aims to double the headcount over the next three years through the London innovation hub which marks the next chapter in this commitment. The centre will be a magnet for top local and international tech talent, fostering collaboration and driving innovation across diverse industries including banking, financial services, and insurance. This strategic move positions Mphasis to leverage the UK's rich talent pool, address evolving client needs and thrive within a supportive technological ecosystem.”While the exact headcount in UK was uncertain, Mphasis employed a total workforce at 31,645 as of June end, down by 1,019 employees from the March quarter. The innovation hub is situated in London's iconic Tower 42 and focuses on developing next-gen solutions in quantum, AI and cryptography.","cleaned_content":"mid tier software services provider on tuesday announced plans to double its presence in the uk as it established a london innovation hub to leverage the transformative power of quantum technologies the facility will serve as a centre of excellence coe for developing cutting edge quantum computing quantum cryptography and artificial intelligence ai solutions these solutions will address critical industry challenges such as algorithmic underwriting catastrophic risk modelling and fraud detection mphasis expertise will empower businesses in the uk and worldwide to leverage the transformative power of quantum technologies mphasis said in a regulatory filing it added mphasis has steadily expanded its uk presence over the past years and aims to double the headcount over the next three years through the london innovation hub which marks the next chapter in this commitment the centre will be a magnet for top local and international tech talent fostering collaboration and driving innovation across diverse industries including banking financial services and insurance this strategic move positions mphasis to leverage the uks rich talent pool address evolving client needs and thrive within a supportive technological ecosystem while the exact headcount in uk was uncertain mphasis employed a total workforce at \u003cTHREE_TEN_THOUSAND\u003e as of june end down by \u003cONE_THOUSAND\u003e employees from the march quarter the innovation hub is situated in londons iconic tower \u003cFOUR_TEN\u003e and focuses on developing next gen solutions in quantum ai and cryptography","timestamp":"2024-09-10T19:33:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}