{"url":"https://economictimes.indiatimes.com/tech/technology/iisc-team-develops-super-capacitor-that-can-be-charged-by-shining-light-on-it/articleshow/113095155.cms","title":"IISc team develops super-capacitor that can be charged by shining light on it","description":"Capacitors are electrostatic devices that store energy as charges on two metal plates called electrodes. Supercapacitors are upgraded versions of capacitors – they exploit electrochemical phenomena to store more energy, explains Abha Misra, Professor at IAP and corresponding author of the study published in the Journal of Materials Chemistry A, IISc said in a statement.","content":"Researchers at the Department of Instrumentation and Applied Physics (IAP), Indian Institute of Science (IISc) and their collaborators have designed a new supercapacitor that can be charged by shining light on it. Such supercapacitors can be used in various devices, including streetlights and self-powered electronic devices such as sensors.Capacitors are electrostatic devices that store energy as charges on two metal plates called electrodes. Supercapacitors are upgraded versions of capacitors – they exploit electrochemical phenomena to store more energy, explains Abha Misra, Professor at IAP and corresponding author of the study published in the Journal of Materials Chemistry A, IISc said in a statement.The electrodes of the new supercapacitor were made of Zinc Oxide (ZnO) nanorods grown directly on Fluorine-doped Tin Oxide (FTO), which is transparent. It was synthesised by Pankaj Singh Chauhan, first author and CV Raman postdoctoral fellow in Misra’s group at IISc. Both ZnO and FTO are semiconductors with appropriately aligned energy levels, enabling superior performance of the photo-rechargeable supercapacitor. FTO, being transparent, allows light to fall on the optically active ZnO nanorods, which charges the supercapacitor. Chauhan said that two electrolytes – a liquid and a semi-solid gel – were used as the conducting medium between the electrodes, the statement added.The capacity for storing charges (capacitance) is inversely proportional to the distance between the electrodes. \"As the distance becomes very small, the capacitance shoots up,\" Misra said. In electrostatic capacitors, maintaining a small distance between electrodes is difficult. However, in a supercapacitor, the electrodes' charges attract the electrolyte's oppositely charged ions, forming a charge layer just atoms away from each other – called an electric double layer or EDL. This results in the high capacitance of supercapacitors.When the researchers shined ultraviolet (UV) light on their supercapacitor, they noticed a huge increase in the capacitance, several times higher than previously reported supercapacitors. They also noticed two unusual properties. First, while capacitance generally decreases as the voltage increases, they found the reverse – their supercapacitor's capacitance under light illumination increased with increasing voltage. ","cleaned_content":"researchers at the department of instrumentation and applied physics iap indian institute of science iisc and their collaborators have designed a new supercapacitor that can be charged by shining light on it such supercapacitors can be used in various devices including streetlights and self powered electronic devices such as sensors capacitors are electrostatic devices that store energy as charges on two metal plates called electrodes supercapacitors are upgraded versions of capacitors they exploit electrochemical phenomena to store more energy explains abha misra professor at iap and corresponding author of the study published in the journal of materials chemistry a iisc said in a statement the electrodes of the new supercapacitor were made of zinc oxide zno nanorods grown directly on fluorine doped tin oxide fto which is transparent it was synthesised by pankaj singh chauhan first author and cv raman postdoctoral fellow in misra s group at iisc both zno and fto are semiconductors with appropriately aligned energy levels enabling superior performance of the photo rechargeable supercapacitor fto being transparent allows light to fall on the optically active zno nanorods which charges the supercapacitor chauhan said that two electrolytes a liquid and a semi solid gel were used as the conducting medium between the electrodes the statement added the capacity for storing charges capacitance is inversely proportional to the distance between the electrodes as the distance becomes very small the capacitance shoots up misra said in electrostatic capacitors maintaining a small distance between electrodes is difficult however in a supercapacitor the electrodes charges attract the electrolytes oppositely charged ions forming a charge layer just atoms away from each other called an electric double layer or edl this results in the high capacitance of supercapacitors when the researchers shined ultraviolet uv light on their supercapacitor they noticed a huge increase in the capacitance several times higher than previously reported supercapacitors they also noticed two unusual properties first while capacitance generally decreases as the voltage increases they found the reverse their supercapacitors capacitance under light illumination increased with increasing voltage","timestamp":"2024-09-05T16:33:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}