{"url":"https://economictimes.indiatimes.com/tech/technology/tata-electronics-tokyo-electron-partner-to-bolster-semicon-equipment-infra/articleshow/113199242.cms","title":"Tata Electronics, Tokyo Electron partner to bolster semicon equipment infra","description":"As the construction of these facilities progresses, the company said it was critical to grow partnerships across the entire semiconductor ecosystem, spanning process and design technology, as well as equipment suppliers. With this announcement of the partnership with TEL, Tata Electronics said it has \"solidified a critical pillar to achieve its execution targets.\"","content":"Tata Electronics on Monday said it had signed a Memorandum of Understanding with semiconductor equipment and services supplier Tokyo Electron (TEL) to accelerate semiconductor equipment infrastructure for both Tata's projects - India's first fab in Dholera, Gujarat and for its assembly and test facility in Jagiroad, Assam. Through this partnership, the company said that Tokyo Electron will also focus on training Tata Electronics' workforce on the company's equipment and support ongoing improvement and R\u0026D initiatives.\"TEL has a history of working closely with its customers, and its expertise in the semiconductor equipment space will help build a dynamic ecosystem to support the timely execution of bringing up our Fab and advanced packaging factories. We are excited about the customer centricity that TEL brings to this partnership,\" Dr Randhir Thakur, Managing Director \u0026 CEO, Tata Electronics, said in a statement.Tata Electronics is building India's first fab in Gujarat with a total investment of Rs 91,000 crores. In addition, the company is investing another Rs 27,000 crores in a greenfield facility in Assam, for the assembly and testing of semiconductor chips. Together, the company said these facilities will produce semiconductor chips for applications across automotive, mobile devices, artificial intelligence (AI), and other key segments to serve customers globally.As the construction of these facilities progresses, the company said it was critical to grow partnerships across the entire semiconductor ecosystem, spanning process and design technology, as well as equipment suppliers. With this announcement of the partnership with TEL, Tata Electronics said it has \"solidified a critical pillar to achieve its execution targets.\"\"This strategic collaboration spans both front-end fabrication and back-end packaging technologies, highlighting our commitment to delivering exceptional support and value to Tata Electronics,\" Toshiki Kawai, President ＆ CEO of Tokyo Electron said. \"By leveraging our collective strengths, we aim to accelerate development and drive innovation across multiple technology nodes. Together, we are poised to set new benchmarks in the industry, fostering a robust and dynamic semiconductor landscape that will benefit all stakeholders.\"","cleaned_content":"tata electronics on monday said it had signed a memorandum of understanding with semiconductor equipment and services supplier tokyo electron tel to accelerate semiconductor equipment infrastructure for both tatas projects indias first fab in dholera gujarat and for its assembly and test facility in jagiroad assam through this partnership the company said that tokyo electron will also focus on training tata electronics workforce on the companys equipment and support ongoing improvement and r d initiatives tel has a history of working closely with its customers and its expertise in the semiconductor equipment space will help build a dynamic ecosystem to support the timely execution of bringing up our fab and advanced packaging factories we are excited about the customer centricity that tel brings to this partnership dr randhir thakur managing director ceo tata electronics said in a statement tata electronics is building indias first fab in gujarat with a total investment of rs \u003cNINE_TEN_THOUSAND\u003e crores in addition the company is investing another rs \u003cTWO_TEN_THOUSAND\u003e crores in a greenfield facility in assam for the assembly and testing of semiconductor chips together the company said these facilities will produce semiconductor chips for applications across automotive mobile devices artificial intelligence ai and other key segments to serve customers globally as the construction of these facilities progresses the company said it was critical to grow partnerships across the entire semiconductor ecosystem spanning process and design technology as well as equipment suppliers with this announcement of the partnership with tel tata electronics said it has solidified a critical pillar to achieve its execution targets this strategic collaboration spans both front end fabrication and back end packaging technologies highlighting our commitment to delivering exceptional support and value to tata electronics toshiki kawai president ceo of tokyo electron said by leveraging our collective strengths we aim to accelerate development and drive innovation across multiple technology nodes together we are poised to set new benchmarks in the industry fostering a robust and dynamic semiconductor landscape that will benefit all stakeholders","timestamp":"2024-09-09T20:01:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}