{"url":"https://economictimes.indiatimes.com/tech/technology/union-cabinet-approves-kaynes-semicons-gujarat-chip-unit/articleshow/112995363.cms","title":"Union Cabinet approves OSAT proposal of Kaynes Semicon to set up in Sanand","description":"The proposed unit in Sanand, Gujarat, will be set up with an investment of Rs 3,307 crore. The chips produced in this unit will cater to a wide variety of applications which include segments such as industrial, automotive, electric vehicles, consumer electronics, telecom, mobile phones, etc.","content":"Mysuru-based Kaynes Semicon became the fourth company in the country to receive an approval from the Union Cabinet for setting up an Outsourced Semiconductor Assembly and Test (OSAT) facility in Sanand, Gujarat with a Rs. 3,307 crore investment. The capacity of this unit will be 63 lakh chips per day. Fifty percent of the investment, which is Rs. 1,653.5 crore, will come from the Centre, 20% from the Gujarat government, which is Rs. 661.4 crore, and the rest 30% of the investment, which is Rs. 992.1 crore will be made by the company. Kaynes raised funds in December last year for the same.ET was the first to report in March this year that Kaynes will be shelving its plans to set up an OSAT facility in Telangana and that it will be moving to Gujarat instead.Speaking at a press conference in New Delhi, Ashwini Vaishnaw, union electronics and IT minister said, \"Today, the Cabinet has approved Kaynes' plant, with a capacity of 6.3 million chips per day. The plant will come up in 46 acres.\"\"The entire ecosystem of materials required like gases and raw materials is emerging. It will have a multiplier effect on the electronics, automobile, appliances and many other industries,\" Vaishnaw said. ","cleaned_content":"mysuru based kaynes semicon became the fourth company in the country to receive an approval from the union cabinet for setting up an outsourced semiconductor assembly and test osat facility in sanand gujarat with a rs \u003cTHREE_THOUSAND\u003e crore investment the capacity of this unit will be \u003cSIX_TEN\u003e lakh chips per day fifty percent of the investment which is rs \u003cONE_THOUSAND\u003e crore will come from the centre \u003cTWO_TEN_PERCENT\u003e from the gujarat government which is rs \u003cSIX_HUNDRED\u003e crore and the rest \u003cTHREE_TEN_PERCENT\u003e of the investment which is rs \u003cNINE_HUNDRED\u003e crore will be made by the company kaynes raised funds in december last year for the same et was the first to report in march this year that kaynes will be shelving its plans to set up an osat facility in telangana and that it will be moving to gujarat instead speaking at a press conference in new delhi ashwini vaishnaw union electronics and it minister said today the cabinet has approved kaynes plant with a capacity of \u003cSIX_\u003e million chips per day the plant will come up in \u003cFOUR_TEN\u003e acres the entire ecosystem of materials required like gases and raw materials is emerging it will have a multiplier effect on the electronics automobile appliances and many other industries vaishnaw said","timestamp":"2024-09-03T10:04:00+05:30","market_timestamp":"2024-09-03T10:04:00+05:30","off_market_hours":false}