{"url":"https://economictimes.indiatimes.com/tech/technology/cybersecurity-firm-zscalers-shares-fall-on-dour-annual-forecasts/articleshow/113063288.cms","title":"Cybersecurity firm Zscaler's shares fall on dour annual forecasts","description":"The forecast comes after peers Palo Alto Networks and SentinelOne boosted expectations with strong annual revenue forecasts as CrowdStrike's customers reevaluated their options in the aftermath of a global IT outage. Zscaler was on track to shed more than $4 billion from its market valuation of $29.2 billion if premarket losses hold.","content":"Zscaler shares tumbled 15.2% in premarket trading on Wednesday following the cybersecurity firm's downbeat annual forecasts. The forecast comes after peers Palo Alto Networks and SentinelOne boosted expectations with strong annual revenue forecasts as CrowdStrike's customers reevaluated their options in the aftermath of a global IT outage. Zscaler was on track to shed more than $4 billion from its market valuation of $29.2 billion, if premarket losses hold.  The company expects full-year revenue in the range of $2.60 billion to $2.62 billion, while analysts' estimated $2.63 billion, according to LSEG data. \"Contracted billings, a significant and growing portion of total billings, are projected to grow 7% in 1H2025, reflecting the impact of past macro challenges that have led to a historically lower growth rate in the first half,\" Rosenblatt Securities analyst Catharine Trebnick said in a note.","cleaned_content":"zscaler shares tumbled \u003cONE_TEN_PERCENT\u003e in premarket trading on wednesday following the cybersecurity firms downbeat annual forecasts the forecast comes after peers palo alto networks and sentinelone boosted expectations with strong annual revenue forecasts as crowdstrikes customers reevaluated their options in the aftermath of a global it outage zscaler was on track to shed more than \u003cFOUR_\u003e billion from its market valuation of \u003cTWO_TEN\u003e billion if premarket losses hold the company expects full year revenue in the range of \u003cTWO_\u003e billion to \u003cTWO_\u003e billion while analysts estimated \u003cTWO_\u003e billion according to lseg data contracted billings a significant and growing portion of total billings are projected to grow \u003cSEVEN_PERCENT\u003e in \u003cONE_\u003e h2025 reflecting the impact of past macro challenges that have led to a historically lower growth rate in the first half rosenblatt securities analyst catharine trebnick said in a note","timestamp":"2024-09-04T16:40:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}