{"url":"https://economictimes.indiatimes.com/tech/technology/extreme-customer-convenience-focused-approach-redefining-banking-business-says-sbis-new-chairman/articleshow/112930956.cms","title":"‘Extreme customer convenience-focused approach’ redefining banking business, says SBI’s new chairman","description":"According to C S Setty, SBI has already started using some of the offerings of fintech startups such as SaaS. The bank is also working towards a November launch of its new platform, Yono 2.0, the chairman-designate added.","content":"Fintech startups are reshaping how large banks conduct business, prompting traditional financial institutions to adapt their offerings to the evolving fintech landscape, according to C S Setty, the newly appointed chairman of the State Bank of India (SBI).“The good thing about fintechs is that they are reshaping the way we do business. An extreme customer convenience-focused approach is something which made the conventional players reimagine the customer journey. Yono itself is an example. I keep saying that we are the largest fintech company and we align our business looking at the fintech environment,” Setty said on Friday at the Global Fintech Fest held in Mumbai.Setty added that SBI is actively seeking deeper integrations with fintech companies.“Some of the services which banks are providing on their own, we may use their (fintech’s) services. We have already started using several offerings like software-as-a-service (SaaS).”SBI has been developing a new version of its mobile application, Yono. Setty said that the pilot launch of this new platform, named Yono 2.0 is planned for November 2024 within a closed user group.","cleaned_content":"fintech startups are reshaping how large banks conduct business prompting traditional financial institutions to adapt their offerings to the evolving fintech landscape according to c s setty the newly appointed chairman of the state bank of india sbi the good thing about fintechs is that they are reshaping the way we do business an extreme customer convenience focused approach is something which made the conventional players reimagine the customer journey yono itself is an example i keep saying that we are the largest fintech company and we align our business looking at the fintech environment setty said on friday at the global fintech fest held in mumbai setty added that sbi is actively seeking deeper integrations with fintech companies some of the services which banks are providing on their own we may use their fintech s services we have already started using several offerings like software as a service saas sbi has been developing a new version of its mobile application yono setty said that the pilot launch of this new platform named yono \u003cTWO_\u003e is planned for november \u003cTWO_THOUSAND\u003e within a closed user group","timestamp":"2024-08-30T20:51:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}