{"url":"https://economictimes.indiatimes.com/tech/technology/airbnb-asks-new-york-city-to-reconsider-regulations-on-short-term-rentals/articleshow/113053970.cms","title":"Airbnb asks New York City to reconsider regulations on short-term rentals","description":"Airbnb has urged New York City to reconsider new short-term rental regulations, arguing that they have led to higher travel costs and have not impacted the housing market. The company highlighted a significant drop in listings and stable apartment vacancy rates since the law's implementation in September 2023.","content":"Airbnb on Tuesday asked New York City to reconsider regulations on short-term rentals that went into effect in September 2023, citing higher prices for travelers and zero impact on the housing market. In a blog post, Airbnb said Local Law LL18, which states hosts must be permanent occupants of the units being rented and must register with the city before posting rentals, has \"failed to combat the housing crisis\". After the implementation of the law, the number of Airbnb listings allowing stays under 30 nights has fallen 83%, according to an August report by data analytics firm Airdna.  Airbnb, citing data from Apartment List, said vacancy rates for apartments in New York City have remained virtually unchanged at 3.4% since the law took effect.  The company also said the cost of travel has increased. Hotel rates in New York City were up 7.4% year-over-year in July, compared with 2.1% across the U.S., according to data from Co-Star, Airbnb said. ","cleaned_content":"airbnb on tuesday asked new york city to reconsider regulations on short term rentals that went into effect in september \u003cTWO_THOUSAND\u003e citing higher prices for travelers and zero impact on the housing market in a blog post airbnb said local law ll18 which states hosts must be permanent occupants of the units being rented and must register with the city before posting rentals has failed to combat the housing crisis after the implementation of the law the number of airbnb listings allowing stays under \u003cTHREE_TEN\u003e nights has fallen \u003cEIGHT_TEN_PERCENT\u003e according to an august report by data analytics firm airdna airbnb citing data from apartment list said vacancy rates for apartments in new york city have remained virtually unchanged at \u003cTHREE_PERCENT\u003e since the law took effect the company also said the cost of travel has increased hotel rates in new york city were up \u003cSEVEN_PERCENT\u003e year over year in july compared with \u003cTWO_PERCENT\u003e across the u s according to data from co star airbnb said","timestamp":"2024-09-04T12:19:00+05:30","market_timestamp":"2024-09-04T12:19:00+05:30","off_market_hours":false}