{"url":"https://economictimes.indiatimes.com/tech/technology/saas-firm-freshworks-appoints-murali-swaminathan-as-cto/articleshow/113032813.cms","title":"SaaS firm Freshworks appoints Murali Swaminathan as CTO","description":"Swaminathan will spearhead the Nasdaq-listed firm’s global engineering and architecture teams. He will join the executive management team of the Chennai and San Mateo, California-headquartered company, and report directly to chief executive and president Dennis Woodside.","content":"Nasdaq-listed software-as-a-service (SaaS) major Freshworks has appointed Murali Swaminathan as its chief technology officer (CTO), the firm said in a statement on Tuesday. Swaminathan will oversee Freshwork’s technology roadmap and strategy, spearheading the company's global engineering and architecture teams. He joins from ServiceNow, where, as vice president of engineering, he developed the modern application architecture for the company's IT service management and strategic portfolio management products. Before ServiceNow, Swaminathan was vice president of engineering at Recommind, now part of OpenText.\"It’s an incredible time to be joining this team as we grow to become a multi-billion-dollar software company,\" he said. \"Our talented global engineering and architecture teams are pivotal to meeting this goal and I look forward to working with them to continue driving innovation and delivering exceptional products that meet the evolving needs of our customers.\"This role aligns with the company’s commitment to investing in talent and resources to enhance employee and customer experience solutions. Swaminathan will join the executive management team and report directly to chief executive and president Dennis Woodside.","cleaned_content":"nasdaq listed software as a service saas major freshworks has appointed murali swaminathan as its chief technology officer cto the firm said in a statement on tuesday swaminathan will oversee freshwork s technology roadmap and strategy spearheading the companys global engineering and architecture teams he joins from servicenow where as vice president of engineering he developed the modern application architecture for the companys it service management and strategic portfolio management products before servicenow swaminathan was vice president of engineering at recommind now part of opentext it s an incredible time to be joining this team as we grow to become a multi billion dollar software company he said our talented global engineering and architecture teams are pivotal to meeting this goal and i look forward to working with them to continue driving innovation and delivering exceptional products that meet the evolving needs of our customers this role aligns with the company s commitment to investing in talent and resources to enhance employee and customer experience solutions swaminathan will join the executive management team and report directly to chief executive and president dennis woodside","timestamp":"2024-09-03T20:16:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}