{"url":"https://economictimes.indiatimes.com/tech/information-tech/country-roads-take-top-tech-companies-to-labyrinths-of-gst-notices/articleshow/113200603.cms","title":"Top IT firms TCS, Infosys, TechM face flurry of GST notices","description":"Tax experts say unlike Income Tax, IT companies have to do their GST registration for every state where they have opened their offices and branches. These orders are all related to cases of FY20, whose due date was on August 31, 2024, and thus the reasons for a flurry of notices before the due date. In some cases, IT firms also delayed their filings with BSE because of the coincidence of weekend falling on last month’s end.","content":"Over the past six to seven weeks, top IT companies, such as Tata Consultancy Services, Infosys, Tech Mahindra and LTIMindtree, have seen a raft of penalty and tax orders from GST departments across the country.These companies and their peers have got at least 21 penalty notices from GST offices in Punjab, Uttar Pradesh, Delhi, Visakhapatnam, Rajasthan, Bhubaneswar, Chennai, Bengaluru, and Mumbai.While the penalties and tax amount might not be significant and range between few thousands to some crores of rupees, which are very small amounts for these cash rich firms, in almost all these cases, IT firms have declared the intent to contest the notices. IT and tax experts say that the spate of notices is also a fallout of expansion of Indian IT services firms into smaller cities.The development also comes a month after India’s second largest IT major was flagged by tax authorities for GST evasion of Rs 32,403 crore over services provided by its overseas branches. ","cleaned_content":"over the past six to seven weeks top it companies such as tata consultancy services infosys tech mahindra and ltimindtree have seen a raft of penalty and tax orders from gst departments across the country these companies and their peers have got at least \u003cTWO_TEN\u003e penalty notices from gst offices in punjab uttar pradesh delhi visakhapatnam rajasthan bhubaneswar chennai bengaluru and mumbai while the penalties and tax amount might not be significant and range between few thousands to some crores of rupees which are very small amounts for these cash rich firms in almost all these cases it firms have declared the intent to contest the notices it and tax experts say that the spate of notices is also a fallout of expansion of indian it services firms into smaller cities the development also comes a month after india s second largest it major was flagged by tax authorities for gst evasion of rs \u003cTHREE_TEN_THOUSAND\u003e crore over services provided by its overseas branches","timestamp":"2024-09-10T08:55:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}