{"url":"https://economictimes.indiatimes.com/tech/technology/eus-vestager-triumphs-in-crackdown-on-apples-tax-deal-googles-practices/articleshow/113227723.cms","title":"EU's Vestager triumphs in crackdown on Apple's tax deal, Google's practices","description":"Vestager, who ends her term in November, has made a name for herself going after Big Tech's tax arrangements with some EU countries and attempts to stifle smaller rivals. The court victories could embolden her successor to take a similar tack.","content":"EU antitrust chief Margrethe Vestager scored two major wins on Tuesday as Europe's top court backed her crackdown against Apple's Irish tax deal and Google's anti-competitive practices in two landmark cases. Vestager, who ends her term in November, has made a name for herself going after Big Tech's tax arrangements with some EU countries and attempts to stifle smaller rivals. The court victories could embolden her successor to take a similar tack. The EU antitrust chief cheered the judgments. \"Today is a huge win for European citizens and tax justice,\" she said on X of the Apple ruling, also praising the Google judgment as a big win for digital fairness. The European Commission in 2016 ordered Apple to pay 13 billion euros ($14.4 billion) in back taxes to Ireland, saying that the iPhone maker benefited from two Irish tax rulings for over two decades that artificially reduced its tax burden to as low as 0.005% in 2014. The Luxembourg-based Court of Justice of the European Union sided with Vestager.","cleaned_content":"eu antitrust chief margrethe vestager scored two major wins on tuesday as europes top court backed her crackdown against apples irish tax deal and googles anti competitive practices in two landmark cases vestager who ends her term in november has made a name for herself going after big techs tax arrangements with some eu countries and attempts to stifle smaller rivals the court victories could embolden her successor to take a similar tack the eu antitrust chief cheered the judgments today is a huge win for european citizens and tax justice she said on x of the apple ruling also praising the google judgment as a big win for digital fairness the european commission in \u003cTWO_THOUSAND\u003e ordered apple to pay \u003cONE_TEN\u003e billion euros \u003cONE_TEN\u003e billion in back taxes to ireland saying that the iphone maker benefited from two irish tax rulings for over two decades that artificially reduced its tax burden to as low as \u003cZERO_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the luxembourg based court of justice of the european union sided with vestager","timestamp":"2024-09-10T16:34:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}