{"url":"https://economictimes.indiatimes.com/tech/technology/behind-the-arrest-of-telegram-boss-a-small-paris-cybercrime-unit-with-big-ambitions/articleshow/112933158.cms","title":"Behind the arrest of Telegram boss, a small Paris cybercrime unit with big ambitions","description":"In an unprecedented move against a major tech CEO, prosecutors argued Durov bears responsibility for the alleged illegality on his platform, placing him under formal investigation on organized crime charges. He is suspected of complicity in running an online platform that allows the posting of child sex abuse images, drug trafficking and fraud.","content":"The investigation into Telegram boss Pavel Durov that has fired a warning shot to global tech titans was started by a small cybercrime unit within the Paris prosecutor's office, led by 38-year-old Johanna Brousse. The arrest of Durov, 39, last Saturday marks a significant shift in how some global authorities may seek to deal with tech chiefs reluctant to police illegal content on their platforms. The arrest signalled the mettle of the J3 cybercrime unit, but the true test of its ambitions will be whether Brousse can secure a conviction based on a largely untested legal argument, lawyers said. In an unprecedented move against a major tech CEO, prosecutors argued Durov bears responsibility for the alleged illegality on his platform, placing him under formal investigation on organized crime charges. He is suspected of complicity in running an online platform that allows the posting of child sex abuse images, drug trafficking and fraud. Durov's lawyer said on Thursday it was \"absurd\" for him to be held responsible and that the app abided by European laws, echoing an earlier statement by Telegram itself. Being placed under formal investigation in France does not imply guilt or necessarily lead to trial, but indicates judges consider there is enough evidence to proceed with the probe. Investigations can last years before being sent to trial or dropped. Durov is out on bail, but barred from leaving France. Brousse's unit began investigating Durov earlier this year after seeing his app being used for countless alleged crimes, and growing frustrated by the \"almost total lack of response from Telegram to judicial requests\", Paris Prosecutor Laure Beccuau said on Wednesday.","cleaned_content":"the investigation into telegram boss pavel durov that has fired a warning shot to global tech titans was started by a small cybercrime unit within the paris prosecutors office led by \u003cTHREE_TEN\u003e year old johanna brousse the arrest of durov \u003cTHREE_TEN\u003e last saturday marks a significant shift in how some global authorities may seek to deal with tech chiefs reluctant to police illegal content on their platforms the arrest signalled the mettle of the j3 cybercrime unit but the true test of its ambitions will be whether brousse can secure a conviction based on a largely untested legal argument lawyers said in an unprecedented move against a major tech ceo prosecutors argued durov bears responsibility for the alleged illegality on his platform placing him under formal investigation on organized crime charges he is suspected of complicity in running an online platform that allows the posting of child sex abuse images drug trafficking and fraud durovs lawyer said on thursday it was absurd for him to be held responsible and that the app abided by european laws echoing an earlier statement by telegram itself being placed under formal investigation in france does not imply guilt or necessarily lead to trial but indicates judges consider there is enough evidence to proceed with the probe investigations can last years before being sent to trial or dropped durov is out on bail but barred from leaving france brousses unit began investigating durov earlier this year after seeing his app being used for countless alleged crimes and growing frustrated by the almost total lack of response from telegram to judicial requests paris prosecutor laure beccuau said on wednesday","timestamp":"2024-08-30T23:06:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}