{"url":"https://economictimes.indiatimes.com/tech/technology/former-jio-top-boss-sets-up-growth-stage-startup-fund-playbook-partners/articleshow/113200280.cms","title":"Former Jio top boss sets up growth-stage startup fund Playbook Partners","description":"The fund has made its first close at $130 million, but eventually intends to be $250 million in size. The average ticket size of its investments would be between $10 million and $20 million, Choudhury said. The firm can lead an investment round or would like to be a co-lead in the round, he added.","content":"Former Reliance Jio top executive Vikas Choudhury has launched a new fund – Playbook Partners, which has reached its first close at $130 million. Choudhury said he may eventually expand the fund to $250 million in size.Playbook has raised the money from large institutional investors from Europe, the US, West Asia and India.The fund will be focused on growth-stage companies that have already established a viable business model but need funds to grow into multimillion dollar revenue businesses.“We are going to invest in tech-first growth-stage companies which have shown a strong business potential and are operating at a revenue base of between Rs 100 crore to Rs 200 crore… We will also look for a positive contribution margin in the businesses,” Choudhury told ET.Playbook is already in talks with some startups for a potential investment, he said.","cleaned_content":"former reliance jio top executive vikas choudhury has launched a new fund playbook partners which has reached its first close at \u003cONE_HUNDRED\u003e million choudhury said he may eventually expand the fund to \u003cTWO_HUNDRED\u003e million in size playbook has raised the money from large institutional investors from europe the us west asia and india the fund will be focused on growth stage companies that have already established a viable business model but need funds to grow into multimillion dollar revenue businesses we are going to invest in tech first growth stage companies which have shown a strong business potential and are operating at a revenue base of between rs \u003cONE_HUNDRED\u003e crore to rs \u003cTWO_HUNDRED\u003e crore we will also look for a positive contribution margin in the businesses choudhury told et playbook is already in talks with some startups for a potential investment he said","timestamp":"2024-09-10T07:36:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}