{"url":"https://economictimes.indiatimes.com/tech/technology/how-a-taxi-driver-in-el-salvador-got-rich-with-bitcoin/articleshow/113151987.cms","title":"How a taxi driver in El Salvador got rich with Bitcoin","description":"El Salvador. Osorio credited the US founder of the NGO My First Bitcoin, John Dennehy, with encouraging him to accept payment in the cryptocurrency. He invested hundreds of millions of dollars of taxpayer money in the cryptocurrency, despite warnings about volatility risks from global institutions.","content":"Napoleon Osorio is proud of being the first taxi driver to have accepted payment in bitcoin in the first country in the world to make the cryptocurrency legal tender: El Salvador.He credits President Nayib Bukele's decision to bank on bitcoin three years ago with changing his life.\"Before I was unemployed... and now I have my own business,\" said the 39-year-old businessman, who uses an app to charge for rides in bitcoin and now runs his own car rental company.Three years ago the leader of the Central American nation took a huge gamble when he put bitcoin into legal circulation in a bid to revitalize El Salvador's dollarized, remittance-reliant economy.He invested hundreds of millions of dollars of taxpayer money in the cryptocurrency, despite warnings about volatility risks from global institutions.","cleaned_content":"napoleon osorio is proud of being the first taxi driver to have accepted payment in bitcoin in the first country in the world to make the cryptocurrency legal tender el salvador he credits president nayib bukeles decision to bank on bitcoin three years ago with changing his life before i was unemployed and now i have my own business said the \u003cTHREE_TEN\u003e year old businessman who uses an app to charge for rides in bitcoin and now runs his own car rental company three years ago the leader of the central american nation took a huge gamble when he put bitcoin into legal circulation in a bid to revitalize el salvadors dollarized remittance reliant economy he invested hundreds of millions of dollars of taxpayer money in the cryptocurrency despite warnings about volatility risks from global institutions","timestamp":"2024-09-07T17:48:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}