{"url":"https://economictimes.indiatimes.com/tech/technology/firstcry-logs-17-rise-in-revenue-lower-loss-in-q1-fy25/articleshow/112929421.cms","title":"FirstCry logs 17% rise in revenue, lower loss in Q1 FY25","description":"Floods in the UAE and early Eid, which saw festival season purchases being advanced to early April, hit order volumes for Brainbees Solutions, the parent firm of the baby and mother care product retailer. However, order volumes are now back on track, said CEO Supam Maheshwari.","content":"Brainbees Solutions Ltd, the parent firm of baby- and mother-care product retailer FirstCry, on Friday reported a 17% increase in operating revenue to Rs 1,652 crore for the quarter ended June 30.Net loss for the first quarter of fiscal year 2025 narrowed to Rs 75 crore from Rs 110 crore a year earlier. Gross merchandise value (GMV), a proxy for net sales, grew 17% from a year ago to Rs 2,318 crore.\"It’s only the international business that is a loss-making business for us while the rest of the segments are making good profits, and year on year the losses for the international business are going down as a percentage of the net revenue,\" cofounder and chief executive Supam Maheshwari said in a post-earnings call.Also Read | We were at it for 14 years: FirstCry CEO Supam Maheshwari on stellar market debutIn India, the omnichannel retailer had 9.5 million annual unique transacting customers as of June 2024, a 15% increase from June 2023. It added 20 offline stores in India in the first quarter of FY25.","cleaned_content":"brainbees solutions ltd the parent firm of baby and mother care product retailer firstcry on friday reported a \u003cONE_TEN_PERCENT\u003e increase in operating revenue to rs \u003cONE_THOUSAND\u003e crore for the quarter ended june \u003cTHREE_TEN\u003e net loss for the first quarter of fiscal year \u003cTWO_THOUSAND\u003e narrowed to rs \u003cSEVEN_TEN\u003e crore from rs \u003cONE_HUNDRED\u003e crore a year earlier gross merchandise value gmv a proxy for net sales grew \u003cONE_TEN_PERCENT\u003e from a year ago to rs \u003cTWO_THOUSAND\u003e crore it s only the international business that is a loss making business for us while the rest of the segments are making good profits and year on year the losses for the international business are going down as a percentage of the net revenue cofounder and chief executive supam maheshwari said in a post earnings call also read we were at it for \u003cONE_TEN\u003e years firstcry ceo supam maheshwari on stellar market debutin india the omnichannel retailer had \u003cNINE_\u003e million annual unique transacting customers as of june \u003cTWO_THOUSAND\u003e a \u003cONE_TEN_PERCENT\u003e increase from june \u003cTWO_THOUSAND\u003e it added \u003cTWO_TEN\u003e offline stores in india in the first quarter of fy25","timestamp":"2024-08-30T21:36:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}