{"url":"https://economictimes.indiatimes.com/tech/technology/payments-cos-handed-gst-bill-for-transactions-below-rs-2000/articleshow/113136856.cms","title":"Payments companies BillDesk, CCAvenue handed GST bill for transactions below Rs 2,000","description":"More than 80% of the total digital payments in India are of less than Rs 2,000 in value. The payments aggregators have not been charging tax on the service they provided to merchants on such transactions, following a government notification issued during demonetisation in 2016.","content":"Large payment aggregators like BillDesk and CCAvenue have received notices from the goods and services tax authorities, demanding GST on the fee they charged merchants for processing digital transactions of under Rs 2,000, three people in the know told ET.“Yes, we have received a show-cause-cum-demand notice,” said Vishwas Patel, joint managing director of Infibeam Avenues which runs payments processor CCAvenue, responding to ET’s queries. “Our teams have responded to the notice,” he said.BillDesk did not respond to an email seeking comment.More than 80% of the total digital payments in India are of less than Rs 2,000 in value. The payments aggregators have not been charging tax on the service they provided to merchants on such transactions, following a government notification issued during demonetisation in 2016. The authorities are now seeking tax from fiscal 2017-18, when the GST regime was introduced. This also comes at a time when there is a buzz around the GST Council likely issuing a clarification on taxing such transactions after its meeting next week.","cleaned_content":"large payment aggregators like billdesk and ccavenue have received notices from the goods and services tax authorities demanding gst on the fee they charged merchants for processing digital transactions of under rs \u003cTWO_THOUSAND\u003e three people in the know told et yes we have received a show cause cum demand notice said vishwas patel joint managing director of infibeam avenues which runs payments processor ccavenue responding to et s queries our teams have responded to the notice he said billdesk did not respond to an email seeking comment more than \u003cEIGHT_TEN_PERCENT\u003e of the total digital payments in india are of less than rs \u003cTWO_THOUSAND\u003e in value the payments aggregators have not been charging tax on the service they provided to merchants on such transactions following a government notification issued during demonetisation in \u003cTWO_THOUSAND\u003e the authorities are now seeking tax from fiscal \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e when the gst regime was introduced this also comes at a time when there is a buzz around the gst council likely issuing a clarification on taxing such transactions after its meeting next week","timestamp":"2024-09-07T08:55:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}