{"url":"https://economictimes.indiatimes.com/tech/technology/semiconductor-mission-may-get-10billion-booster-shot/articleshow/113136722.cms","title":"Semiconductor mission may get $10-billion booster shot","description":"ISM, a division within the Digital India Corporation tasked with furthering the country’s semiconductor manufacturing, packaging, and design capabilities was first established in 2022 with a budgetary allocation of $ 10 billion. “The second phase of ISM will be launched soon; the allocation will be around the previous phase. Two more proposals are expected to get approvals,” said an official.","content":"The Indian Semiconductor Mission is likely to receive a second budgetary allocation of up to $ 10 billion, a senior official said. The mission may require this funding if the Centre approves a mega chip fabrication unit by Israeli firm Tower Semiconductor and the Adani Group along with a host of other proposals which are being currently evaluated, top officials aware said.The government will have to seek fresh funding under the ISM as it has almost exhausted the funds in the first phase which saw approvals of $11 billion, they added.This includes the chip fabrication unit announced by the Tata Group as well as four other proposals for chip assembly.On Thursday, the Maharashtra state government approved a $ 10 bn semiconductor fab unit by the Adani group and Tower to come up at Panvel, it is estimated to have a capacity to produce 80,000 wafers monthly.An official cited above said that New Delhi is awaiting a formal proposal from Tower with Adani Group as a partner. While ( we) were informally told about the possible alliance, a formal proposal is yet to follow, the person added.","cleaned_content":"the indian semiconductor mission is likely to receive a second budgetary allocation of up to \u003cONE_TEN\u003e billion a senior official said the mission may require this funding if the centre approves a mega chip fabrication unit by israeli firm tower semiconductor and the adani group along with a host of other proposals which are being currently evaluated top officials aware said the government will have to seek fresh funding under the ism as it has almost exhausted the funds in the first phase which saw approvals of \u003cONE_TEN\u003e billion they added this includes the chip fabrication unit announced by the tata group as well as four other proposals for chip assembly on thursday the maharashtra state government approved a \u003cONE_TEN\u003e bn semiconductor fab unit by the adani group and tower to come up at panvel it is estimated to have a capacity to produce \u003cEIGHT_TEN_THOUSAND\u003e wafers monthly an official cited above said that new delhi is awaiting a formal proposal from tower with adani group as a partner while we were informally told about the possible alliance a formal proposal is yet to follow the person added","timestamp":"2024-09-07T10:18:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}