{"url":"https://economictimes.indiatimes.com/tech/technology/et-world-leaders-forum-govt-to-launch-new-scheme-for-domestic-electronics-component-manufacturing-says-vaishnaw/articleshow/112949251.cms","title":"ET World Leaders Forum | Govt to launch new scheme for domestic electronics component manufacturing says Vaishnaw","description":"Speaking at the inaugural session of the World Leader Forum 2024, Vaishnaw said that more than 99% of all mobile phones used in India were being manufactured domestically. “This year Apple will be manufacturing their latest model in India. The value of electronics manufacturing in India had increased to $105 billion as of 2022-23, up from $29 billion in 2013-14. We are preparing a program where the component ecosystem can now come in the way electronics and mobile manufacturing has come in,” he said.","content":"The government will launch a new scheme to help set up a sustainable electronics component ecosystem in India, union minister for electronics and Information Technology, Railways, and Information Broadcasting Ashwini Vaishnaw said. Speaking at the inaugural session of the World Leader Forum 2024, Vaishnaw said that more than 99% of all mobile phones used in India were being manufactured domestically. “This year Apple will be manufacturing their latest model in India. The value of electronics manufacturing in India had increased to $105 billion as of 2022-23, up from $29 billion in 2013-14. We are preparing a program where the component ecosystem can now come in the way electronics and mobile manufacturing has come in,” he said.Also Read: ET World Leaders Forum | UPI market large enough; there is scope for multiple players: Google Pay VPThe government is likely to allocate up to Rs 40,000 crore for an electronics component manufacturing scheme, likely to be rolled out later this year. The government expects successful applicants under the scheme to invest around Rs 82,000 crore in total while the total value of components produced by these companies could be between Rs 1.95-2 lakh crore during the duration of the scheme.","cleaned_content":"the government will launch a new scheme to help set up a sustainable electronics component ecosystem in india union minister for electronics and information technology railways and information broadcasting ashwini vaishnaw said speaking at the inaugural session of the world leader forum \u003cTWO_THOUSAND\u003e vaishnaw said that more than \u003cNINE_TEN_PERCENT\u003e of all mobile phones used in india were being manufactured domestically this year apple will be manufacturing their latest model in india the value of electronics manufacturing in india had increased to \u003cONE_HUNDRED\u003e billion as of \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e up from \u003cTWO_TEN\u003e billion in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e we are preparing a program where the component ecosystem can now come in the way electronics and mobile manufacturing has come in he said also read et world leaders forum upi market large enough there is scope for multiple players google pay vpthe government is likely to allocate up to rs \u003cFOUR_TEN_THOUSAND\u003e crore for an electronics component manufacturing scheme likely to be rolled out later this year the government expects successful applicants under the scheme to invest around rs \u003cEIGHT_TEN_THOUSAND\u003e crore in total while the total value of components produced by these companies could be between rs \u003cONE_\u003e \u003cTWO_\u003e lakh crore during the duration of the scheme","timestamp":"2024-08-31T16:20:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}