{"url":"https://economictimes.indiatimes.com/tech/technology/gokwik-acquires-shopify-app-return-prime-forays-into-global-market/articleshow/113217966.cms","title":"GoKwik acquires Shopify app Return Prime, forays into global market","description":"The acquisition marks GoKwik’s entry into the international markets of UK, Europe and the US. As online shopping continues to grow, particularly in the wake of the COVID-19 pandemic, the ability to efficiently manage returns has become a key differentiator for merchants.","content":"GoKwik, an eCommerce enabler has acquired Return Prime, a global returns management app in the Shopify ecosystem.Founded in 2021, Bengaluru-based Return Prime by Sashwat Swaroop provides a customer return platform for managing returns and converting them into revenue opportunities. Brands use the platform for automating return logistics, refunds, replacements, and more.The acquisition marks GoKwik’s entry into the international markets of UK, Europe and the US. As online shopping continues to grow, particularly in the wake of the COVID-19 pandemic, the ability to efficiently manage returns has become a key differentiator for merchants. With this acquisition, GoKwik is positioning itself at the forefront of this trend, offering a solution that not only improves the customer experience but also boosts the revenue of the merchants globally, while also helping them increase the customer lifetime value (CLTV).“Our DNA is instilled with building in India for the world. With D2C booming, payments systems top-notch, digital infrastructure evolving, and more people shopping online than ever before, we’ve gained an incredible advantage. Operating in such a heterogeneous market where every day there's a unique perspective on how shoppers function and what they want, the learning curve we’ve experienced has prepared us to not only help brands in India but also scale that knowledge for creating solutions globally,” said Chirag Taneja, co-founder and CEO, GoKwik.With millions of merchants, Shopify is one of the largest eCommerce platforms in the world processing over $1 trillion lifetime GMV, with a strong presence in the US, UK, Australia and 170 countries. By acquiring Return Prime, GoKwik aims to add another layer of capability to its suite of solutions tailor-made for eCommerce brands.","cleaned_content":"gokwik an ecommerce enabler has acquired return prime a global returns management app in the shopify ecosystem founded in \u003cTWO_THOUSAND\u003e bengaluru based return prime by sashwat swaroop provides a customer return platform for managing returns and converting them into revenue opportunities brands use the platform for automating return logistics refunds replacements and more the acquisition marks gokwik s entry into the international markets of uk europe and the us as online shopping continues to grow particularly in the wake of the covid \u003cONE_TEN\u003e pandemic the ability to efficiently manage returns has become a key differentiator for merchants with this acquisition gokwik is positioning itself at the forefront of this trend offering a solution that not only improves the customer experience but also boosts the revenue of the merchants globally while also helping them increase the customer lifetime value cltv our dna is instilled with building in india for the world with d2c booming payments systems top notch digital infrastructure evolving and more people shopping online than ever before we ve gained an incredible advantage operating in such a heterogeneous market where every day theres a unique perspective on how shoppers function and what they want the learning curve we ve experienced has prepared us to not only help brands in india but also scale that knowledge for creating solutions globally said chirag taneja co founder and ceo gokwik with millions of merchants shopify is one of the largest ecommerce platforms in the world processing over \u003cONE_\u003e trillion lifetime gmv with a strong presence in the us uk australia and \u003cONE_HUNDRED\u003e countries by acquiring return prime gokwik aims to add another layer of capability to its suite of solutions tailor made for ecommerce brands","timestamp":"2024-09-10T12:22:00+05:30","market_timestamp":"2024-09-10T12:22:00+05:30","off_market_hours":false}