{"url":"https://economictimes.indiatimes.com/tech/technology/byjus-insolvency-proceedings-glas-trust-dropped-from-committee-of-creditors/articleshow/113035670.cms","title":"Byju’s US term-loan lenders get no seat in creditors’ committee","description":"Insolvency resolution professional Pankaj Srivastava took this decision after concluding that Glas Trust does not represent the minimum 51% of lenders required to be part of the CoC. Glas has moved court for Srivastava’s removal. According to a report by The Times of India, the US lenders today moved the Bengaluru bench of the National Company Law Tribunal (NCLT) to seek the removal of Srivastava as the IRP. The matter will be heard on September 4.","content":"The insolvency resolution professional (IRP) for Think \u0026 Learn Pvt Ltd, the parent company of Byju’s, has removed Glas Trust Co that represents a group of the edtech firm’s US lenders from its committee of creditors (CoC).IRP Pankaj Srivastava removed Glas Trust after concluding that it does not represent the minimum 51% of lenders in the consortium that provided a $1.2 billion term loan to Byju’s, sources aware of the matter said. According to a Times of India report, Glas Trust on Tuesday moved the Bengaluru bench of the National Company Law Tribunal, seeking to remove Srivastava as the IRP. The matter will be heard on Wednesday.Meanwhile, the CoC held its first meeting on Tuesday.The US lenders had accused Byju’s founder Byju Raveendran of diverting more than $500 million from the $1.2 billion they had lent. They had filed a bankruptcy case against the company’s American subsidiary, Byju’s Alpha, in the US.Byju’s disqualified most of the lenders represented by Glas Trust, citing its right under the credit agreement to exclude predatory lenders focused on distressed debt, the sources said.","cleaned_content":"the insolvency resolution professional irp for think learn pvt ltd the parent company of byju s has removed glas trust co that represents a group of the edtech firm s us lenders from its committee of creditors coc irp pankaj srivastava removed glas trust after concluding that it does not represent the minimum \u003cFIVE_TEN_PERCENT\u003e of lenders in the consortium that provided a \u003cONE_\u003e billion term loan to byju s sources aware of the matter said according to a times of india report glas trust on tuesday moved the bengaluru bench of the national company law tribunal seeking to remove srivastava as the irp the matter will be heard on wednesday meanwhile the coc held its first meeting on tuesday the us lenders had accused byju s founder byju raveendran of diverting more than \u003cFIVE_HUNDRED\u003e million from the \u003cONE_\u003e billion they had lent they had filed a bankruptcy case against the company s american subsidiary byju s alpha in the us byju s disqualified most of the lenders represented by glas trust citing its right under the credit agreement to exclude predatory lenders focused on distressed debt the sources said","timestamp":"2024-09-03T23:15:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}