{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musks-starlink-defies-order-to-block-x-in-brazil/articleshow/112983800.cms","title":"Elon Musk's Starlink defies order to block X in Brazil","description":"Elon Musk is engaged in a conflict with Brazilian authorities over his refusal to suspend accounts on his social network, X, despite court orders. His company Starlink is also defying orders to block X, risking fines and asset freezes. The dispute impacts millions of Brazilians and Musk's businesses.","content":"Elon Musk is doubling down on his fight with Brazilian authorities. For weeks, the billionaire has refused to comply with Brazilian court orders to suspend certain accounts on his social network, X. He ignored fines and then fired X employees in Brazil so courts couldn't hold them accountable. And then, after Brazil's Supreme Court ordered X blocked in the country, he suggested that Brazilians use software to circumvent the ban, despite the risk of large fines that a judge has threatened to impose for doing so. Now he is defying the Brazilian government again. Starlink -- the satellite-internet service controlled by Musk that has 250,000 customers in Brazil -- told the country's telecom agency Sunday that it would not comply with orders to block X, the agency's president said. The retort further escalated a dispute that has already had consequences for millions of Brazilians and for Musk's business -- and it suggested that Musk is not prepared to back down anytime soon. The move also illustrated the sheer power of Musk and his business empire. Having built or bought leading companies with increasing control over how people connect and communicate, Musk is trying to leverage that influence to confront authorities and challenge laws he does not like.","cleaned_content":"elon musk is doubling down on his fight with brazilian authorities for weeks the billionaire has refused to comply with brazilian court orders to suspend certain accounts on his social network x he ignored fines and then fired x employees in brazil so courts couldnt hold them accountable and then after brazils supreme court ordered x blocked in the country he suggested that brazilians use software to circumvent the ban despite the risk of large fines that a judge has threatened to impose for doing so now he is defying the brazilian government again starlink the satellite internet service controlled by musk that has \u003cTWO_HUNDRED_THOUSAND\u003e customers in brazil told the countrys telecom agency sunday that it would not comply with orders to block x the agencys president said the retort further escalated a dispute that has already had consequences for millions of brazilians and for musks business and it suggested that musk is not prepared to back down anytime soon the move also illustrated the sheer power of musk and his business empire having built or bought leading companies with increasing control over how people connect and communicate musk is trying to leverage that influence to confront authorities and challenge laws he does not like","timestamp":"2024-09-02T11:25:00+05:30","market_timestamp":"2024-09-02T11:25:00+05:30","off_market_hours":false}