{"url":"https://economictimes.indiatimes.com/tech/technology/brazilians-flock-to-bluesky-and-threads-after-x-suspension/articleshow/113113777.cms","title":"Brazilians flock to Bluesky and Threads after X suspension","description":"Millions of Brazilians, including the president, have flocked to social media platforms such as Threads or Bluesky, where Portuguese has become the most spoken language in the few days since Elon Musk's X was shut down in the country. Bluesky, a social media network created by Twitter co-founder Jack Dorsey, now counts 7.6 million users since the X suspension in Brazil.","content":"Millions of Brazilians, including the president, have flocked to social media platforms such as Threads or Bluesky, where Portuguese has become the most spoken language in the few days since Elon Musk's X was shut down in the country.\"Is anyone there?\" asked numerous Brazilian netizens as they made their first tentative forays onto Bluesky, which said it had added more than two million new users since South America's largest nation banned X.Access to the social network formerly known as Twitter was blocked on Saturday amid a standoff between Musk and Brazilian Supreme Court judge Alexandre de Moraes, who has made it his mission to crack down on disinformation.The powerful and controversial judge took the measure after Musk, who calls himself a \"free-speech absolutist,\" ignored a series of court decisions.Bluesky, a social media network created by Twitter co-founder Jack Dorsey, now counts 7.6 million users since the X suspension in Brazil.","cleaned_content":"millions of brazilians including the president have flocked to social media platforms such as threads or bluesky where portuguese has become the most spoken language in the few days since elon musks x was shut down in the country is anyone there asked numerous brazilian netizens as they made their first tentative forays onto bluesky which said it had added more than two million new users since south americas largest nation banned x access to the social network formerly known as twitter was blocked on saturday amid a standoff between musk and brazilian supreme court judge alexandre de moraes who has made it his mission to crack down on disinformation the powerful and controversial judge took the measure after musk who calls himself a free speech absolutist ignored a series of court decisions bluesky a social media network created by twitter co founder jack dorsey now counts \u003cSEVEN_\u003e million users since the x suspension in brazil","timestamp":"2024-09-06T10:32:00+05:30","market_timestamp":"2024-09-06T10:32:00+05:30","off_market_hours":false}