{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-gets-subpoena-from-us-doj/articleshow/113047800.cms","title":"Nvidia gets subpoena from US DoJ","description":"The company said last week it has received requests for information from regulators in the U.S. and South Korea, regarding its investments, partnerships and agreements with other companies. It has also received inquiries from the EU, UK and China.","content":"The U.S. Department of Justice has sent a subpoena to Nvidia as it deepens its probe into the AI heavyweight's antitrust practices, Bloomberg News reported on Tuesday, citing people familiar with the investigation.  The antitrust watchdog had previously delivered questionnaires, and has now sent legally binding requests to Nvidia, the report said, adding that other companies had also received subpoenas.  Officials are concerned that the chipmaker is making it harder to switch to other suppliers and penalizes buyers that do not exclusively use its artificial intelligence chips, the report said. \"Nvidia wins on merit, as reflected in our benchmark results and value to customers, who can choose whatever solution is best for them,\" a spokesperson for the company said. Last month, the Information reported the Department of Justice had launched an investigation into the company after complaints from competitors that it had abused its market dominance. ","cleaned_content":"the u s department of justice has sent a subpoena to nvidia as it deepens its probe into the ai heavyweights antitrust practices bloomberg news reported on tuesday citing people familiar with the investigation the antitrust watchdog had previously delivered questionnaires and has now sent legally binding requests to nvidia the report said adding that other companies had also received subpoenas officials are concerned that the chipmaker is making it harder to switch to other suppliers and penalizes buyers that do not exclusively use its artificial intelligence chips the report said nvidia wins on merit as reflected in our benchmark results and value to customers who can choose whatever solution is best for them a spokesperson for the company said last month the information reported the department of justice had launched an investigation into the company after complaints from competitors that it had abused its market dominance","timestamp":"2024-09-04T08:11:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}