{"url":"https://economictimes.indiatimes.com/tech/technology/ic814-the-kandahar-hijack-webseries-govt-reportedly-summons-netflix-amid-row-over-hindu-names-of-terrorists/articleshow/112985159.cms","title":"IC814-The Kandahar Hijack web series: Netflix head to appear before Govt today amid row over Hindu names of terrorists","description":"Netflix's content head has been summoned by the Ministry of Information \u0026 Broadcasting amid controversy over the IC814: The Kandahar Hijack web series. Directed by Anubhav Sinha, the series has been criticized for using Hindu names for terrorists. BJP leaders Amit Malviya and Kangana Ranaut condemned the portrayal as distorting historical facts.","content":"Amid a controversy stirring around the \"IC814: The Kandahar Hijack\" web series for the use of Hindu names of terrorists, Netflix Content Head has been summoned today by the Ministry of Information \u0026 Broadcasting.The government is seeking an explanation on the allegedly contentious aspects of the OTT series. The Anubhav Sinha directed series has drawn criticism from the BJP-led centre for using Hindu names of two terrorists, 'Bhola' and 'Shankar', while the other three are referred to as Chief, Doctor, and Burger.IC814, the webseries starring Vijay Varma, is an account of experience of hundreds of passengers as the flight was diverted to multiple locations before ending up in Taliban-controlled Kandahar, Afghanistan.Also Read: Why Boycott Bollywood is trending and what's the link with Anubhav Sinha's IC 814 the Kandahar Hijack Netflix webseries?","cleaned_content":"amid a controversy stirring around the ic814 the kandahar hijack web series for the use of hindu names of terrorists netflix content head has been summoned today by the ministry of information broadcasting the government is seeking an explanation on the allegedly contentious aspects of the ott series the anubhav sinha directed series has drawn criticism from the bjp led centre for using hindu names of two terrorists bhola and shankar while the other three are referred to as chief doctor and burger ic814 the webseries starring vijay varma is an account of experience of hundreds of passengers as the flight was diverted to multiple locations before ending up in taliban controlled kandahar afghanistan also read why boycott bollywood is trending and whats the link with anubhav sinhas ic \u003cEIGHT_HUNDRED\u003e the kandahar hijack netflix webseries","timestamp":"2024-09-03T08:19:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}