{"url":"https://economictimes.indiatimes.com/tech/technology/x-global-affairs-head-nick-pickles-resigns/articleshow/113114168.cms","title":"X global affairs head Nick Pickles resigns","description":"Pickles had started at X as a senior manager in their London office and was appointed the Vice President of Global Affairs for X in 2023 after serving in multiple roles, his LinkedIn profile showed. The Financial Times reported that he was the company's spokesperson in battles with multiple governments, including in Brazil, which said last week it was suspending access to the social network in the country.","content":"X's global affairs head Nick Pickles said on Thursday he is quitting after a decade with the social media company formerly called Twitter.  Pickles, who joined the company in 2014, said he had decided to leave X several months ago and was working with the Chief Executive Linda Yaccarino through the transition. \"After more than ten years, tomorrow will be my last day at X. It's been an incredible journey,\" he said.  It was not immediately clear what his next plans were, or why he made the decision to quit. Elon Musk-owned X and Nick Pickles did not immediately respond to Reuters requests for comment outside of regular business hours.","cleaned_content":"xs global affairs head nick pickles said on thursday he is quitting after a decade with the social media company formerly called twitter pickles who joined the company in \u003cTWO_THOUSAND\u003e said he had decided to leave x several months ago and was working with the chief executive linda yaccarino through the transition after more than ten years tomorrow will be my last day at x its been an incredible journey he said it was not immediately clear what his next plans were or why he made the decision to quit elon musk owned x and nick pickles did not immediately respond to reuters requests for comment outside of regular business hours","timestamp":"2024-09-06T10:49:00+05:30","market_timestamp":"2024-09-06T10:49:00+05:30","off_market_hours":false}