{"url":"https://economictimes.indiatimes.com/tech/technology/newer-systems-being-added-to-astronaut-training-facility-in-bengaluru-vssc-director/articleshow/113103681.cms","title":"Newer systems being added to astronaut training facility in Bengaluru: VSSC director","description":"Unnikrishnan Nair, director of Vikram Sarabhai Space Centre (VSSC) told ET, “The building near UR Rao Satellite Centre on Old Airport Road is in place and certain systems are already in place. But we are adding more simulators. The four astronauts selected for the Gaganyaan Mission received generic Space training in Russia. The training they receive at this facility is specific to Gaganyaan.”","content":"India needs its own astronaut training centre and newer systems are being added to the astronaut training facility in Bengaluru, said Unnikrishnan Nair, director of Vikram Sarabhai Space Centre (VSSC) who is also the founding director of the Human Space Flight Centre in Bengaluru.The Indian Space Research Organisation (Isro) had operationalised the basic or ad hoc astronaut training facility in 2022.Nair was talking at the India Innovation Summit of the Confederation of Indian Industry in Bengaluru on Thursday. He also led the team working on the Gaganyaan Mission, which aims to send Indian astronauts to space.He told ET on the sidelines of the event, “The building near UR Rao Satellite Centre on Old Airport Road is in place and certain systems are already in place. But we are adding more simulators. The four astronauts selected for the Gaganyaan Mission received generic Space training in Russia. The training they receive at this facility is specific to Gaganyaan.”The training includes the specifics of the crew module. “How it looks, where is the control, how to interact with the systems, is the kind of training being given at this facility. All the health-related aspects of the astronauts, training classes, etc are being taken care of here,” he said.","cleaned_content":"india needs its own astronaut training centre and newer systems are being added to the astronaut training facility in bengaluru said unnikrishnan nair director of vikram sarabhai space centre vssc who is also the founding director of the human space flight centre in bengaluru the indian space research organisation isro had operationalised the basic or ad hoc astronaut training facility in \u003cTWO_THOUSAND\u003e nair was talking at the india innovation summit of the confederation of indian industry in bengaluru on thursday he also led the team working on the gaganyaan mission which aims to send indian astronauts to space he told et on the sidelines of the event the building near ur rao satellite centre on old airport road is in place and certain systems are already in place but we are adding more simulators the four astronauts selected for the gaganyaan mission received generic space training in russia the training they receive at this facility is specific to gaganyaan the training includes the specifics of the crew module how it looks where is the control how to interact with the systems is the kind of training being given at this facility all the health related aspects of the astronauts training classes etc are being taken care of here he said","timestamp":"2024-09-05T23:21:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}