{"url":"https://economictimes.indiatimes.com/tech/technology/they-had-thriving-lives-on-x-until-brazil-banned-it-overnight/articleshow/113168110.cms","title":"They had thriving lives on X, until Brazil banned it overnight","description":"Rodrigues had come to rely on X as she built her career. It was where she connected with artists, found gigs and promoted her work. So she was crestfallen when, with just hours of warning, Brazil's Supreme Court blocked the platform last weekend after its owner, Elon Musk, refused to comply with court orders to suspend certain accounts.","content":"Just hours before X went dark in Brazil, Adrienni Rodrigues, a music producer, rushed onto the social network to share the biggest news of her career: the launch of her first album. She had spent nearly three years making the record with a team of other artists. Now, Rodrigues feared she would be cut off from her 4,000 followers before she could urge them to tune in. \"I had just enough time to post about it,\" said Rodrigues, 30, a beat maker and DJ known by her stage name, Gau Beats. \"An hour or two later, X was already down and I couldn't see anything anymore.\" Rodrigues had come to rely on X as she built her career. It was where she connected with artists, found gigs and promoted her work. So she was crestfallen when, with just hours of warning, Brazil's Supreme Court blocked the platform last weekend after its owner, Elon Musk, refused to comply with court orders to suspend certain accounts. \"It was a critical moment for us,\" Rodrigues said. \"And we lost this place where we already had a relationship with an audience that likes our music.\"","cleaned_content":"just hours before x went dark in brazil adrienni rodrigues a music producer rushed onto the social network to share the biggest news of her career the launch of her first album she had spent nearly three years making the record with a team of other artists now rodrigues feared she would be cut off from her \u003cFOUR_THOUSAND\u003e followers before she could urge them to tune in i had just enough time to post about it said rodrigues \u003cTHREE_TEN\u003e a beat maker and dj known by her stage name gau beats an hour or two later x was already down and i couldnt see anything anymore rodrigues had come to rely on x as she built her career it was where she connected with artists found gigs and promoted her work so she was crestfallen when with just hours of warning brazils supreme court blocked the platform last weekend after its owner elon musk refused to comply with court orders to suspend certain accounts it was a critical moment for us rodrigues said and we lost this place where we already had a relationship with an audience that likes our music","timestamp":"2024-09-08T16:51:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}