{"url":"https://economictimes.indiatimes.com/tech/technology/p2p-investors-grapple-with-amended-rbi-rules-vent-ire-on-social-media/articleshow/113068953.cms","title":"P2P investors take to social media to vent against new RBI rules","description":"Some of Mobikwik’s investors have taken to social media channels like ‘X’ and Reddit to flag their concerns around changes in their investment terms and conditions. “Received an email today from MobiKwik regarding certain changes they have (made) to their P2P programme named ‘Xtra’ due to recent guidelines from the RBI. Now I can only see the principal amount and no option to withdraw it,\"  wrote a user on Reddit on Tuesday.","content":"The regulatory update on peer-to-peer lending guidelines issued by the Reserve Bank of India in August has started to show its impact on the fintech sector. Multiple applications that were using the P2P route for investments and lending to their customers are either stopping these services or restructuring the product.Gurugram-based fintech firm MobiKwik has stopped instant withdrawal facilities for investors on its P2P investment platform ‘Xtra’. It works as a customer-sourcing channel for Lendbox, an RBI-registered P2P platform.Two people in the know said Bengaluru-based Cred, which runs the Mint P2P investment platform in partnership with Liquiloans, has stopped taking fresh deposits.Fresh deposits had stopped on Cred sometime back, after regulatory scrutiny went up on P2P investments earlier this year, one of the people said.Also Read | P2P companies balk at RBI’s new rules, fear business disruption","cleaned_content":"the regulatory update on peer to peer lending guidelines issued by the reserve bank of india in august has started to show its impact on the fintech sector multiple applications that were using the p2p route for investments and lending to their customers are either stopping these services or restructuring the product gurugram based fintech firm mobikwik has stopped instant withdrawal facilities for investors on its p2p investment platform xtra it works as a customer sourcing channel for lendbox an rbi registered p2p platform two people in the know said bengaluru based cred which runs the mint p2p investment platform in partnership with liquiloans has stopped taking fresh deposits fresh deposits had stopped on cred sometime back after regulatory scrutiny went up on p2p investments earlier this year one of the people said also read p2p companies balk at rbi s new rules fear business disruption","timestamp":"2024-09-05T06:00:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}