{"url":"https://economictimes.indiatimes.com/tech/technology/google-pay-introduces-upi-circle-other-features-at-global-fintech-fest/articleshow/112930573.cms","title":"Google Pay introduces UPI Circle, other features at Global Fintech Fest","description":"Google Pay's new  UPI Circle will allow users to add family members and friends as secondary users, to make digital payments without linking their bank account. Google Pay has partnered with NPCI for UPI Circle, which allows both partial and full delegation.","content":"Google Pay on Friday introduced UPI Circle, a feature allowing users to add family members and friends as secondary users, to make digital payments without linking their bank account. During the three-day Global Fintech Fest (GFF) 2024 held in Mumbai, Google Pay made a slew of announcements about its new features, including UPI Circle.  Google Pay has partnered with NPCI for UPI Circle, which allows both partial and full delegation.  During the event, which concluded on Friday, Google Pay also launched eRupi (UPI Vouchers), which can be issued by existing UPI users, as well as government and corporate organisations.  Further, it rolled out Tap \u0026 Pay payments for RuPay cards, enabling RuPay cardholders to use their mobile phone for payments. ","cleaned_content":"google pay on friday introduced upi circle a feature allowing users to add family members and friends as secondary users to make digital payments without linking their bank account during the three day global fintech fest gff \u003cTWO_THOUSAND\u003e held in mumbai google pay made a slew of announcements about its new features including upi circle google pay has partnered with npci for upi circle which allows both partial and full delegation during the event which concluded on friday google pay also launched erupi upi vouchers which can be issued by existing upi users as well as government and corporate organisations further it rolled out tap pay payments for rupay cards enabling rupay cardholders to use their mobile phone for payments","timestamp":"2024-08-30T20:22:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}