{"url":"https://economictimes.indiatimes.com/tech/technology/tesla-shares-gain-on-plans-to-launch-full-self-driving-in-europe-china/articleshow/113095400.cms","title":"Tesla shares gain on plans to launch full self-driving in Europe, China","description":"This comes about a month ahead of the company's unveiling of its robotaxi product, \"Cybercab\", underpinned by the technology that helps drivers accelerate, brake and steer in cities and highways with human supervision.","content":"Tesla shares rose 2.5% on Thursday after the electric automaker stuck to its plans to roll out the full self-driving (FSD) advanced driver assistance software in China and Europe pending approval from regulators in the regions. This comes about a month ahead of the company's unveiling of its robotaxi product, \"Cybercab\", underpinned by the technology that helps drivers accelerate, brake and steer in cities and highways with human supervision. CEO Elon Musk said in July Tesla was likely to get regulatory approval for FSD in both the regions by the end of the year. The billionaire said on Thursday FSD could be launched in right-hand drive markets in late first quarter or early in the April-June period. Musk's tendency to set aggressive deadlines has led to doubts among investors and analysts, especially after missing several optimistic targets for FSD, Semi and Cybertruck. It also announced other features like Actually Smart Summon, FSD for the Cybertruck electric pick up truck this month and version 13 of the software requiring fewer interventions next month.","cleaned_content":"tesla shares rose \u003cTWO_PERCENT\u003e on thursday after the electric automaker stuck to its plans to roll out the full self driving fsd advanced driver assistance software in china and europe pending approval from regulators in the regions this comes about a month ahead of the companys unveiling of its robotaxi product cybercab underpinned by the technology that helps drivers accelerate brake and steer in cities and highways with human supervision ceo elon musk said in july tesla was likely to get regulatory approval for fsd in both the regions by the end of the year the billionaire said on thursday fsd could be launched in right hand drive markets in late first quarter or early in the april june period musks tendency to set aggressive deadlines has led to doubts among investors and analysts especially after missing several optimistic targets for fsd semi and cybertruck it also announced other features like actually smart summon fsd for the cybertruck electric pick up truck this month and version \u003cONE_TEN\u003e of the software requiring fewer interventions next month","timestamp":"2024-09-05T16:44:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}