{"url":"https://economictimes.indiatimes.com/tech/technology/us-based-financial-software-firm-planful-expands-its-rd-centre-in-hyderabad-to-invest-120-million/articleshow/113233145.cms","title":"US based financial software firm Planful expands its R\u0026D centre in Hyderabad; To invest $120 million","description":"In addition to R\u0026D, the new Hyderabad office will also play a pivotal role in supporting Planful's global back-office operations, the company said. By the end of 2025, the company plans to have more than doubled the annual investment since 2020 and will continue to add employees across multiple departments including R\u0026D, the customer support team, marketing, and G\u0026A (general and administrative), added the firm.","content":"US based financial performance management cloud software provider, Planful expanded its research and development (R\u0026D) centre in India by opening a new office in Hyderabad on Tuesday.The San Francisco headquartered firm has already invested $50 million in India over the past few years. As part of its expansion, the software vendor plans to invest an additional $120 million over the next five years. Planful also plans to double its headcount in the region, said a statement from the company.Grant Halloran, chief executive at Planful, said, \"Planful has a long history in Hyderabad, and we are proud to continue to invest in the region. Our new office as our global R\u0026D center reaffirms our long-term commitment to Hyderabad, with its thriving IT ecosystem, and world-class talent pool. This expansion enables us to continue to innovate on our best-in-class financial performance solutions for our global customers”.By the end of 2025, the company plans to have more than doubled the annual investment since 2020 and will continue to add employees across multiple departments including R\u0026D, the customer support team, marketing, and G\u0026A (general and administrative), added the firm.In addition to R\u0026D, the new Hyderabad office will also play a pivotal role in supporting Planful's global back-office operations, the company said. ","cleaned_content":"us based financial performance management cloud software provider planful expanded its research and development r d centre in india by opening a new office in hyderabad on tuesday the san francisco headquartered firm has already invested \u003cFIVE_TEN\u003e million in india over the past few years as part of its expansion the software vendor plans to invest an additional \u003cONE_HUNDRED\u003e million over the next five years planful also plans to double its headcount in the region said a statement from the company grant halloran chief executive at planful said planful has a long history in hyderabad and we are proud to continue to invest in the region our new office as our global r d center reaffirms our long term commitment to hyderabad with its thriving it ecosystem and world class talent pool this expansion enables us to continue to innovate on our best in class financial performance solutions for our global customers by the end of \u003cTWO_THOUSAND\u003e the company plans to have more than doubled the annual investment since \u003cTWO_THOUSAND\u003e and will continue to add employees across multiple departments including r d the customer support team marketing and g a general and administrative added the firm in addition to r d the new hyderabad office will also play a pivotal role in supporting planfuls global back office operations the company said","timestamp":"2024-09-10T19:29:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}