{"url":"https://economictimes.indiatimes.com/tech/technology/community-management-app-mygate-enters-consumer-space-with-smart-door-locks/articleshow/113012857.cms","title":"Community management app MyGate enters consumer space with smart door locks","description":"The Mygate Locks will enable users to go keyless and manage home access remotely. It includes features such as remote unlocking using OTP, end-to-end data encryption, simple user management, real-time notifications, and integration with the existing app for gated communities.","content":"Housing society management app Mygate announced its foray into consumer devices on Tuesday with the introduction of Mygate Locks, a range of smart door locks to offer home security with digital convenience. The Mygate Locks will enable users to go keyless and manage home access remotely. It includes features such as remote unlocking using OTP, end-to-end data encryption, simple user management, real-time notifications, and integration with the existing app for gated communities.This entry into the consumer electronic segment, available to users across India, marks an expansion of its product offerings beyond its core software solutions.According to cofounder and chief executive Abhishek Kumar, the company expects its consumer device business to reach a few hundred crore in revenue within the next two to three years.“We studied the space and found an opportunity. There is a market where people are looking for smarter and better solutions. Hence, Mygate forayed into consumer devices with the launch of Mygate locks, and now, with this, we are also going beyond gated communities,” Kumar told ET in an interaction.","cleaned_content":"housing society management app mygate announced its foray into consumer devices on tuesday with the introduction of mygate locks a range of smart door locks to offer home security with digital convenience the mygate locks will enable users to go keyless and manage home access remotely it includes features such as remote unlocking using otp end to end data encryption simple user management real time notifications and integration with the existing app for gated communities this entry into the consumer electronic segment available to users across india marks an expansion of its product offerings beyond its core software solutions according to cofounder and chief executive abhishek kumar the company expects its consumer device business to reach a few hundred crore in revenue within the next two to three years we studied the space and found an opportunity there is a market where people are looking for smarter and better solutions hence mygate forayed into consumer devices with the launch of mygate locks and now with this we are also going beyond gated communities kumar told et in an interaction","timestamp":"2024-09-03T15:38:00+05:30","market_timestamp":"2024-09-04T09:15:00+05:30","off_market_hours":true}