{"url":"https://economictimes.indiatimes.com/tech/technology/japan-tries-to-reclaim-its-clout-as-a-global-tech-leader/articleshow/113125356.cms","title":"Japan tries to reclaim its clout as a global tech leader","description":"Tokyo's industrial policy focus today is on advanced forms of technologies ranging from batteries to solar panels, but the priority is reclaiming a bigger share of the global semiconductor industry, for which the Japanese government earmarked more than $27 billion over the past three years.","content":"China's envy-inducing success in using industrial policy to expand its economy and finance green manufacturing has helped kick off a fevered scrimmage among nations to develop and protect their own hometown businesses. It has been 40 years since such competitive anxieties about a rising Asian power prompted this kind of embrace of government intervention among the biggest free-market economies. Only then it was Japan, not China, that was the source of unease. Michael Crichton's 1992 thriller, \"Rising Sun,\" with its dark depiction of Japan's ruthless economic warriors, ruled the bestseller lists, alongside nonfiction titles that warned of the financial and technology juggernaut created by Japan's powerful government trade ministry. In a 1990 survey, nearly two-thirds of Americans said Japanese investment in the United States posed a threat to American economic independence.","cleaned_content":"chinas envy inducing success in using industrial policy to expand its economy and finance green manufacturing has helped kick off a fevered scrimmage among nations to develop and protect their own hometown businesses it has been \u003cFOUR_TEN\u003e years since such competitive anxieties about a rising asian power prompted this kind of embrace of government intervention among the biggest free market economies only then it was japan not china that was the source of unease michael crichtons \u003cONE_THOUSAND\u003e thriller rising sun with its dark depiction of japans ruthless economic warriors ruled the bestseller lists alongside nonfiction titles that warned of the financial and technology juggernaut created by japans powerful government trade ministry in a \u003cONE_THOUSAND\u003e survey nearly two thirds of americans said japanese investment in the united states posed a threat to american economic independence","timestamp":"2024-09-06T16:09:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}