{"url":"https://economictimes.indiatimes.com/tech/technology/the-long-wait-as-it-firms-delay-onboarding-fresh-graduates-face-financial-uncertainties/articleshow/113152672.cms","title":"The Long Wait: As IT firms delay onboarding, fresh graduates face financial uncertainties","description":"Many of India’s top IT firms have delayed onboarding of freshers for more than two years. Those fresh graduates waiting with offer letters in hand are now struggling to pay off their educational loans. ET decodes how the crisis is unfolding.","content":"Kartik Kumar (name changed), who graduated from Lakshmi Narain College of Technology in Jabalpur, is grappling with a Rs 5.3-lakh education loan, for which an EMI of Rs 12,131 started in January. After paying for two months, Kumar sought an extension from the bank since he is unemployed. But that’s not by choice. Kumar has been waiting for a joining date from Infosys since receiving an offer letter in April 2022.Kumar’s situation is far from unique. Many students like him have been left in limbo after consistent delays in onboarding by IT majors despite receiving offer letters two or even three years ago.After more than two years of waiting, Infosys recently conducted pre-training rounds in July and August, and issued joining dates for October and November to more than 1,000 graduates. These roles, primarily system engineering positions, will begin at the Mysore campus. “It’s a huge relief,” said Ankit Jha from Jharkhand, who had nearly lost hope after months of waiting.According to Harpreet Singh Saluja, president of IT employee union NITES, as of June, approximately 10,000 students selected by IT majors — including DXC Technology, Wipro, TCS, Virtusa Consulting, Infosys, LTIMindtree, Zensar and Hexaware Technologies — were left waiting. That number has since decreased to around 5,000, as TCS, Infosys and LTIMindtree have onboarded many pending freshers.      ","cleaned_content":"kartik kumar name changed who graduated from lakshmi narain college of technology in jabalpur is grappling with a rs \u003cFIVE_\u003e lakh education loan for which an emi of rs \u003cONE_TEN_THOUSAND\u003e started in january after paying for two months kumar sought an extension from the bank since he is unemployed but that s not by choice kumar has been waiting for a joining date from infosys since receiving an offer letter in april \u003cTWO_THOUSAND\u003e kumar s situation is far from unique many students like him have been left in limbo after consistent delays in onboarding by it majors despite receiving offer letters two or even three years ago after more than two years of waiting infosys recently conducted pre training rounds in july and august and issued joining dates for october and november to more than \u003cONE_THOUSAND\u003e graduates these roles primarily system engineering positions will begin at the mysore campus it s a huge relief said ankit jha from jharkhand who had nearly lost hope after months of waiting according to harpreet singh saluja president of it employee union nites as of june approximately \u003cONE_TEN_THOUSAND\u003e students selected by it majors including dxc technology wipro tcs virtusa consulting infosys ltimindtree zensar and hexaware technologies were left waiting that number has since decreased to around \u003cFIVE_THOUSAND\u003e as tcs infosys and ltimindtree have onboarded many pending freshers","timestamp":"2024-09-08T11:45:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}