{"url":"https://economictimes.indiatimes.com/tech/technology/infosys-partners-with-proximus-group-to-drive-new-biz-opportunities/articleshow/113221089.cms","title":"Infosys partners with Proximus Group to drive new biz opportunities","description":"Infosys and Proximus Group have announced a strategic collaboration to explore new business opportunities. The partnership will leverage Proximus' international affiliates' products, including Route Mobile's CPaaS and Telesign's Digital Identity solutions, combined with Infosys' digital services. This aims to drive innovation in customer engagement and enhance digital security for customers in Belgium and abroad.","content":"IT services firm Infosys and Belgium-headquartered digital services and communication solutions provider Proximus Group on Tuesday announced a strategic collaboration aimed at unlocking new business opportunities, according to a release. The strategic collaboration will focus on a joint go-to-market approach that will leverage products of Proximus' International affiliates, including Route Mobile's Communications Platform as a Service (CPaaS) and Telesign's Digital Identity (DI) solutions.  \"This combined with Infosys digital services will drive innovation in omnichannel customer engagement and AI-driven digital assistants for their customers,\" a release said, adding that the collaboration aims to enhance digital security by providing digital identity and fraud protection solutions, that drive trusted communication online.  The collaboration between Infosys and Proximus enables the two sides to further strengthen their digital offerings and drive their innovative solutions to business and residential customers in Belgium and abroad, it said.","cleaned_content":"it services firm infosys and belgium headquartered digital services and communication solutions provider proximus group on tuesday announced a strategic collaboration aimed at unlocking new business opportunities according to a release the strategic collaboration will focus on a joint go to market approach that will leverage products of proximus international affiliates including route mobiles communications platform as a service cpaas and telesigns digital identity di solutions this combined with infosys digital services will drive innovation in omnichannel customer engagement and ai driven digital assistants for their customers a release said adding that the collaboration aims to enhance digital security by providing digital identity and fraud protection solutions that drive trusted communication online the collaboration between infosys and proximus enables the two sides to further strengthen their digital offerings and drive their innovative solutions to business and residential customers in belgium and abroad it said","timestamp":"2024-09-10T14:02:00+05:30","market_timestamp":"2024-09-10T14:02:00+05:30","off_market_hours":false}