{"url":"https://economictimes.indiatimes.com/tech/technology/with-x-blocked-brazilians-find-new-homes-for-their-thoughts-in-threads-bluesky/articleshow/112981024.cms","title":"With X blocked, Brazilians find new homes for their thoughts in Threads, Bluesky","description":"Brazil's social network X, formerly known as Twitter, was blocked after a Supreme Court justice ordered its shutdown following a conflict with X's owner, Elon Musk. Users have turned to alternatives like Bluesky and Threads, as the shutdown affects millions. The suspension highlights Brazil's significant role in global social media usage.","content":"As the clock struck midnight in Brazil, the tweets stopped refreshing. Social network X, formerly Twitter, began to go dark Saturday across Latin America's largest nation after a Brazilian Supreme Court justice ordered its blackout just hours earlier. It was the culmination of a monthslong battle between that justice, Alexandre de Moraes, and X's owner, Elon Musk, over what can be said online in Brazil. In recent weeks, Musk said X would stop complying with Moraes' court orders to suspend certain accounts. After Moraes threatened arrests of X employees, Musk pulled X's team from Brazil. Moraes responded by blocking X on Friday. Hours later, millions of Brazilians woke up to a social network that would not load. Users on the app still saw a timeline, but the posts were frozen from Friday night. Those who tried to open the website were met with a blank screen. Some customers of the few internet providers that had not yet complied with the ban as of Saturday morning posted excitedly on X that they could still use the service. (One of those providers was Starlink, the satellite internet service run by SpaceX, Musk's space company.)","cleaned_content":"as the clock struck midnight in brazil the tweets stopped refreshing social network x formerly twitter began to go dark saturday across latin americas largest nation after a brazilian supreme court justice ordered its blackout just hours earlier it was the culmination of a monthslong battle between that justice alexandre de moraes and xs owner elon musk over what can be said online in brazil in recent weeks musk said x would stop complying with moraes court orders to suspend certain accounts after moraes threatened arrests of x employees musk pulled xs team from brazil moraes responded by blocking x on friday hours later millions of brazilians woke up to a social network that would not load users on the app still saw a timeline but the posts were frozen from friday night those who tried to open the website were met with a blank screen some customers of the few internet providers that had not yet complied with the ban as of saturday morning posted excitedly on x that they could still use the service one of those providers was starlink the satellite internet service run by spacex musks space company","timestamp":"2024-09-02T10:15:00+05:30","market_timestamp":"2024-09-02T10:15:00+05:30","off_market_hours":false}