{"url":"https://economictimes.indiatimes.com/tech/technology/mska-quits-as-byjus-auditor-two-years-after-deloitte-exit/articleshow/113141198.cms","title":"MSKA quits as Byju's auditor, two years after Deloitte exit","description":"Audit firm MSKA \u0026 Associates has resigned as Byju's statutory auditor, citing uncooperative management and suspicious transactions involving a Dubai-based reseller. This resignation affects the audit for FY23 accounts and follows Deloitte Haskins \u0026 Sells' exit in 2022. The firm reported difficulties in obtaining necessary information and raised concerns over Byju's financial stability.","content":"Mumbai: MSKA \u0026 Associates, the audit firm of embattled edtech startup Byju's, has informed the company's board of its resignation as statutory auditor with immediate effect, said two people aware of the development.This will affect the firm's audit for FY23 accounts. It had been appointed for a five-year term ending FY27.In the resignation letter, the auditor also cited a suspicious transaction related to Dubai-based reseller More Ideas General Trading LLC that had been reported to the ministry of corporate affairs (MCA) on September 2, said the people quoted above. This involves recovery of about ₹1,400 crore from the reseller. ET had reported February 19 that investors in Byju's had raised red flags over the management's failure to recover dues in this particular transaction.Byju's and MSKA \u0026 Associates hadn't responded to queries as of press time.MSKA reportedly took the decision to quit due to management's uncooperative attitude, difficulty in getting numbers and details required to conduct a proper probe, and a matter coming to light that had to be reported to MCA as per Companies Act.","cleaned_content":"mumbai mska associates the audit firm of embattled edtech startup byjus has informed the companys board of its resignation as statutory auditor with immediate effect said two people aware of the development this will affect the firms audit for fy23 accounts it had been appointed for a five year term ending fy27 in the resignation letter the auditor also cited a suspicious transaction related to dubai based reseller more ideas general trading llc that had been reported to the ministry of corporate affairs mca on september \u003cTWO_\u003e said the people quoted above this involves recovery of about \u003cONE_THOUSAND\u003e crore from the reseller et had reported february \u003cONE_TEN\u003e that investors in byjus had raised red flags over the managements failure to recover dues in this particular transaction byjus and mska associates hadnt responded to queries as of press time mska reportedly took the decision to quit due to managements uncooperative attitude difficulty in getting numbers and details required to conduct a proper probe and a matter coming to light that had to be reported to mca as per companies act","timestamp":"2024-09-07T12:01:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}