{"url":"https://economictimes.indiatimes.com/tech/technology/apple-supplier-jabil-to-set-up-manufacturing-facility-in-trichy-for-rs-2000-crore/articleshow/113209207.cms","title":"Apple supplier Jabil to set up manufacturing facility in Trichy for Rs 2,000 crore","description":"A Memorandum of Understanding (MoU) was exchanged between Jabil officials and the Tamil Nadu state delegation on Tuesday in the presence of Tamil Nadu CM MK Stalin who has been in the US on a 17-day trip to garner fresh investments.","content":"Apple supplier Jabil will set up an electronics manufacturing facility in Trichy with an investment of Rs. 2000 crore, Tamil Nadu CM MK Stalin said on Tuesday. The CM listed it as part of three 'key' announcements that the state government had secured on Tuesday. \"A significant investment of Rs 2000 crores at Tiruchirapalli by Jabil, a global leader in EMS. This will create 5000 jobs and create a new cluster for electronics manufacturing,\" he said in a post on X (formerly Twitter). Sources said a Memorandum of Understanding (MoU) was exchanged between Jabil officials and the Tamil Nadu state delegation on Tuesday in the presence of Tamil Nadu CM MK Stalin who has been in the US on a 17-day trip to garner fresh investments. With Jabil's manufacturing foray in the state, Tamil Nadu now boasts several major Apple suppliers like Foxconn , Pegatron, Tata Electronics and Corning. ","cleaned_content":"apple supplier jabil will set up an electronics manufacturing facility in trichy with an investment of rs \u003cTWO_THOUSAND\u003e crore tamil nadu cm mk stalin said on tuesday the cm listed it as part of three key announcements that the state government had secured on tuesday a significant investment of rs \u003cTWO_THOUSAND\u003e crores at tiruchirapalli by jabil a global leader in ems this will create \u003cFIVE_THOUSAND\u003e jobs and create a new cluster for electronics manufacturing he said in a post on x formerly twitter sources said a memorandum of understanding mou was exchanged between jabil officials and the tamil nadu state delegation on tuesday in the presence of tamil nadu cm mk stalin who has been in the us on a \u003cONE_TEN\u003e day trip to garner fresh investments with jabils manufacturing foray in the state tamil nadu now boasts several major apple suppliers like foxconn pegatron tata electronics and corning","timestamp":"2024-09-10T08:13:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}