{"url":"https://economictimes.indiatimes.com/tech/technology/online-gaming-turnover-has-gone-up-no-case-for-relook-at-gst-levy-karnataka-revenue-minister/articleshow/113173291.cms","title":"Online gaming turnover has gone up, no case for relook at GST levy: Karnataka revenue minister","description":"Earlier, an 18% GST was levied only on the platform fee. The GST Council, at its meeting on July 11, 2023, decided to tax online gaming, casinos and racecourse at 28% on the full-face value of bets. The new tax rates took effect on October 1, 2023.","content":"Karnataka revenue minister Krishna Byre Gowda has expressed himself against any change to the GST levy on the online gaming sector, arguing that there has not been any disruption after the new rate kicked in and that the concerns expressed earlier have turned out to be “imaginary”.There have also not been any compliance issues, Gowda, who represents Karnataka on the GST Council, told ET ahead of the council’s meeting scheduled in New Delhi on Monday.All online gaming companies, the minister said, were declaring a higher turnover. Revenue has gone up by three to four times in the case of some states, he said.Maharashtra, Karnataka and the National Capital Region of Delhi are home to many gaming firms.Earlier, an 18% GST was levied only on the platform fee. The GST Council, at its meeting on July 11, 2023, decided to tax online gaming, casinos and racecourse at 28% on the full-face value of bets. The new tax rates took effect on October 1, 2023.","cleaned_content":"karnataka revenue minister krishna byre gowda has expressed himself against any change to the gst levy on the online gaming sector arguing that there has not been any disruption after the new rate kicked in and that the concerns expressed earlier have turned out to be imaginary there have also not been any compliance issues gowda who represents karnataka on the gst council told et ahead of the council s meeting scheduled in new delhi on monday all online gaming companies the minister said were declaring a higher turnover revenue has gone up by three to four times in the case of some states he said maharashtra karnataka and the national capital region of delhi are home to many gaming firms earlier an \u003cONE_TEN_PERCENT\u003e gst was levied only on the platform fee the gst council at its meeting on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e decided to tax online gaming casinos and racecourse at \u003cTWO_TEN_PERCENT\u003e on the full face value of bets the new tax rates took effect on october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-09T06:00:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}