{"url":"https://economictimes.indiatimes.com/tech/technology/us-safety-commissioners-call-for-investigation-into-shein-temu/articleshow/113049345.cms","title":"US safety commissioners call for investigation into Shein, Temu","description":"U.S. Consumer Products Safety Commission leaders are urging an investigation into e-commerce giants Shein and Temu for selling hazardous baby and toddler products. They seek to evaluate compliance with safety rules, third-party seller relationships, and product representation. Both companies face scrutiny over low prices attributed to the de minimis rule exempting certain imports from tariffs.","content":"Two leaders of the U.S. Consumer Products Safety Commission are calling for the agency to investigate e-commerce retailers Shein and Temu after \"deadly baby and toddler products\" were sold on both websites, according to a letter posted on the U.S. CPSC website on Tuesday.  U.S. CPSC Commissioners Peter Feldman and Douglas Dziak want the agency to evaluate how Singapore's Shein, China's Temu and other foreign-owned e-commerce platforms comply with its rules, handle relationships with third-party sellers and represent imported products.  Shein and PDD Group's Temu, which both ship cheap merchandise into the U.S. from China, are raising \"specific concerns\" for the Commission for their use of de minimis, a rule exempting packages valued at $800 or less from tariffs if they are sent directly to shoppers.  Critics of Shein and Temu attribute low prices and de minimis to Shein and Temu's success in the U.S. Both companies have also come under scrutiny for the quality of their products. A bipartisan group of U.S. lawmakers last year planned to introduce a bill to eliminate the de minimis, which is widely used by e-commerce platforms including third-party sellers on Amazon.com and Walmart.com.","cleaned_content":"two leaders of the u s consumer products safety commission are calling for the agency to investigate e commerce retailers shein and temu after deadly baby and toddler products were sold on both websites according to a letter posted on the u s cpsc website on tuesday u s cpsc commissioners peter feldman and douglas dziak want the agency to evaluate how singapores shein chinas temu and other foreign owned e commerce platforms comply with its rules handle relationships with third party sellers and represent imported products shein and pdd groups temu which both ship cheap merchandise into the u s from china are raising specific concerns for the commission for their use of de minimis a rule exempting packages valued at \u003cEIGHT_HUNDRED\u003e or less from tariffs if they are sent directly to shoppers critics of shein and temu attribute low prices and de minimis to shein and temus success in the u s both companies have also come under scrutiny for the quality of their products a bipartisan group of u s lawmakers last year planned to introduce a bill to eliminate the de minimis which is widely used by e commerce platforms including third party sellers on amazon com and walmart com","timestamp":"2024-09-04T10:37:00+05:30","market_timestamp":"2024-09-04T10:37:00+05:30","off_market_hours":false}