{"url":"https://economictimes.indiatimes.com/tech/technology/pavel-durov-says-telegram-will-take-new-approach-towards-moderation/articleshow/113132491.cms","title":"Pavel Durov says Telegram will take new approach towards moderation","description":"Durov was last week placed under formal investigation in France in connection with the use of Telegram, which he founded, for fraud, moneylaundering, child pornography and other crimes.","content":"Telegram boss Pavel Durov said on Friday that the messaging app would take a new approach towards moderating content and remove some features that had been abused for illegal activity. \"While 99.999% of Telegram users have nothing to do with crime, the 0.001% involved in illicit activities create a bad image for the entire platform, putting the interests of our almost billion users at risk,\" Durov wrote on Telegram. \"That's why this year we are committed to turn moderation on Telegram from an area of criticism into one of praise.\" Durov was last week placed under formal investigation in France in connection with the use of Telegram, which he founded, for fraud, moneylaundering, child pornography and other crimes.","cleaned_content":"telegram boss pavel durov said on friday that the messaging app would take a new approach towards moderating content and remove some features that had been abused for illegal activity while \u003cNINE_TEN_PERCENT\u003e of telegram users have nothing to do with crime the \u003cZERO_PERCENT\u003e involved in illicit activities create a bad image for the entire platform putting the interests of our almost billion users at risk durov wrote on telegram thats why this year we are committed to turn moderation on telegram from an area of criticism into one of praise durov was last week placed under formal investigation in france in connection with the use of telegram which he founded for fraud moneylaundering child pornography and other crimes","timestamp":"2024-09-06T19:47:00+05:30","market_timestamp":"2024-09-09T09:15:00+05:30","off_market_hours":true}