{"url":"https://economictimes.indiatimes.com/tech/technology/us-calls-on-big-tech-to-help-evade-online-censors-in-russia-iran/articleshow/113118023.cms","title":"US calls on Big Tech to help evade online censors in Russia, Iran","description":"The tools, supported by the U.S.-backed Open Technology Fund (OTF), have seen a surge of usage in Russia, Iran, Myanmar and authoritarian states that heavily censor the internet.","content":"The White House convened a meeting with representatives of Amazon.com, Alphabet's Google, Microsoft, Cloudflare and civil society activists on Thursday in a bid to encourage U.S. tech giants to offer more digital bandwidth for government-funded internet censorship evasion tools. The tools, supported by the U.S.-backed Open Technology Fund (OTF), have seen a surge of usage in Russia, Iran, Myanmar and authoritarian states that heavily censor the internet. OTF's pitch to tech companies at the meeting was to help offer discounted or subsidized server bandwidth to meet the fast-growing demand for virtual private network (VPN) applications that OTF funds, the organisation's president, Laura Cunningham, told Reuters. \"Over the last few years, we have seen an explosion in demand for VPNs, largely driven by users in Russia and Iran,\" Cunningham said. \"For a decade, we routinely supported around nine million VPN users each month, and now that number has more than quadrupled.\" VPNs help users hide their identity and change their online location, often to bypass geographic restrictions on content or to evade government censorship technology, by routing internet traffic through external servers outside of that government's control.","cleaned_content":"the white house convened a meeting with representatives of amazon com alphabets google microsoft cloudflare and civil society activists on thursday in a bid to encourage u s tech giants to offer more digital bandwidth for government funded internet censorship evasion tools the tools supported by the u s backed open technology fund otf have seen a surge of usage in russia iran myanmar and authoritarian states that heavily censor the internet otfs pitch to tech companies at the meeting was to help offer discounted or subsidized server bandwidth to meet the fast growing demand for virtual private network vpn applications that otf funds the organisations president laura cunningham told reuters over the last few years we have seen an explosion in demand for vpns largely driven by users in russia and iran cunningham said for a decade we routinely supported around nine million vpn users each month and now that number has more than quadrupled vpns help users hide their identity and change their online location often to bypass geographic restrictions on content or to evade government censorship technology by routing internet traffic through external servers outside of that governments control","timestamp":"2024-09-06T12:45:00+05:30","market_timestamp":"2024-09-06T12:45:00+05:30","off_market_hours":false}