{"url":"https://economictimes.indiatimes.com/tech/technology/why-does-apple-have-to-pay-ireland-14-4-billion/articleshow/113227255.cms","title":"Why does Apple have to pay Ireland $14.4 billion?","description":"The European Court of Justice has said that Apple had unduly benefited from unfair loopholes in Ireland's tax regime, and that the company must now hand Ireland 13 billion euros in back payments.","content":"Apple lost a long-running court battle with the European Union on Tuesday, resulting in the company being forced to pay 13 billion euros ($14.4 billion) in back taxes to Ireland, as part of a wider crackdown on so-called \"sweetheart deals\".  What happened? In 2016, the European Commission's competition chief Margrethe Vestager accused Ireland of having granted Apple illegal tax benefits, unfairly diverting investment away from other countries.  Both Apple and Ireland, whose low tax rates helped it attract Big Tech companies to set up their European headquarters, successfully challenged the EU ruling. But the European Court of Justice has now sided with Vestager, agreeing Apple had unduly benefited from unfair loopholes in Ireland's tax regime, and that the company must now hand Ireland 13 billion euros in back payments. ","cleaned_content":"apple lost a long running court battle with the european union on tuesday resulting in the company being forced to pay \u003cONE_TEN\u003e billion euros \u003cONE_TEN\u003e billion in back taxes to ireland as part of a wider crackdown on so called sweetheart deals what happened in \u003cTWO_THOUSAND\u003e the european commissions competition chief margrethe vestager accused ireland of having granted apple illegal tax benefits unfairly diverting investment away from other countries both apple and ireland whose low tax rates helped it attract big tech companies to set up their european headquarters successfully challenged the eu ruling but the european court of justice has now sided with vestager agreeing apple had unduly benefited from unfair loopholes in irelands tax regime and that the company must now hand ireland \u003cONE_TEN\u003e billion euros in back payments","timestamp":"2024-09-10T16:26:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}