{"url":"https://economictimes.indiatimes.com/tech/technology/payu-wants-to-get-into-consumer-payments-next-with-lazypay/articleshow/112973166.cms","title":"PayU eyes full stack digital commerce play","description":"Digital payments company PayU is looking to expand its consumer fintech offerings through LazyPay, while maintaining its core focus on merchant payments. The Naspers-owned fintech firm plans to leverage LazyPay to develop a consumer payments and credit platform. CEO Anirban Mukherjee said PayU is hopeful about regulations on allowing nonbank lenders on Unified Payments Interface (UPI) for tapping credit opportunities.","content":"Naspers-backed fintech firm PayU is looking to grow its consumer vertical by leveraging the LazyPay mobile application. While merchant payments will remain the core of its business, PayU will use LazyPay to build a full stack consumer payments and credit business, said Anirban Mukherjee, chief executive at PayU.“LazyPay is growing fast right now, but we will build a consumer brand around LazyPay. (So PayU will) not only be B2B in the long run, thereby extending its model to build a B2B2C platform. We will serve enterprise merchants, financial institutions and consumers,” Mukherjee said in an interview.PayU, which started as an online merchant payments business, has expanded its services to become a full stack fintech firm in India through the credit business by acquiring Paysense, building LazyPay, and a tech stack for financial firms through Wibmo, which it acquired in 2019.  ","cleaned_content":"naspers backed fintech firm payu is looking to grow its consumer vertical by leveraging the lazypay mobile application while merchant payments will remain the core of its business payu will use lazypay to build a full stack consumer payments and credit business said anirban mukherjee chief executive at payu lazypay is growing fast right now but we will build a consumer brand around lazypay so payu will not only be b2b in the long run thereby extending its model to build a b2b2c platform we will serve enterprise merchants financial institutions and consumers mukherjee said in an interview payu which started as an online merchant payments business has expanded its services to become a full stack fintech firm in india through the credit business by acquiring paysense building lazypay and a tech stack for financial firms through wibmo which it acquired in \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-02T14:47:00+05:30","market_timestamp":"2024-09-02T14:47:00+05:30","off_market_hours":false}