{"url":"https://economictimes.indiatimes.com/tech/technology/qualcomm-has-explored-acquiring-pieces-of-intel-chip-design-business/articleshow/113113305.cms","title":"Qualcomm has explored acquiring pieces of Intel chip design business","description":"The $184 billion Qualcomm, which is known for chips found in smartphones and counts Apple as a customer, has been working on plans to buy pieces of Intel for months. Qualcomm's interest and plans have not been finalized and could change, according to the sources.","content":"Qualcomm has explored the possibility of acquiring portions of Intel's design business to boost the company's product portfolio, according to two sources familiar with the matter. The mobile chipmaker has examined acquiring different pieces of Intel, which is struggling to generate cash and looking to shed business units and sell off other assets, the people said. Intel's client PC design business is of significant interest to Qualcomm executives, one of the sources said, but they are looking at all of the company's design units. Other pieces of Intel such as the server segment would make less sense for Qualcomm to acquire, another source with knowledge of Qualcomm's operations said. Qualcomm has not approached Intel about a potential acquisition and declined to comment on its plans, an Intel spokesperson said. Intel is \"deeply committed to our PC business,\" the spokesperson said.","cleaned_content":"qualcomm has explored the possibility of acquiring portions of intels design business to boost the companys product portfolio according to two sources familiar with the matter the mobile chipmaker has examined acquiring different pieces of intel which is struggling to generate cash and looking to shed business units and sell off other assets the people said intels client pc design business is of significant interest to qualcomm executives one of the sources said but they are looking at all of the companys design units other pieces of intel such as the server segment would make less sense for qualcomm to acquire another source with knowledge of qualcomms operations said qualcomm has not approached intel about a potential acquisition and declined to comment on its plans an intel spokesperson said intel is deeply committed to our pc business the spokesperson said","timestamp":"2024-09-06T10:18:00+05:30","market_timestamp":"2024-09-06T10:18:00+05:30","off_market_hours":false}