{"url":"https://economictimes.indiatimes.com/tech/technology/etail-logistics-companies-prepare-package-for-non-metro-boom/articleshow/112939754.cms","title":"Etail, logistics companies prepare package for non-metro boom","description":"\"Ekart is building the supply chain for India and carries the mission of democratising ecommerce for all brands,\" said Mani Bhushan, chief business officer at Ekart. \"Ekart is well-established and will continue to deepen presence in tier II-III supply chains and beyond.\" These include last-mile delivery and bulk cargo pickups from brands and manufacturers.","content":"NEW DELHI: Ecommerce and logistics companies have stepped up expansion into smaller cities this festive season, with increased hiring and focused marketing programmes, as these markets grow faster than metros, said industry executives.Driven by rapid urbanisation, mushrooming of shopping malls and surge in spending, tier II-III towns have seen a significant increase in manpower demand, said Yeshab Giri, chief commercial officer, operational talent solutions, at Randstad India, a talent management company. Cities such as Jaipur, Indore, Ahmedabad, Coimbatore, Lucknow, Vadodara, Surat, Bhubaneswar, Bhopal, Chandigarh and Vizag are witnessing 25-30% more demand than the previous festive season, he said.\"Currently, ecommerce and logistics firms in tier II-III cities are hiring approximately 65% of the overall talent,\" said Lohit Bhatia, president, workforce management, at Quess Corp. Metros and other tier I cities traditionally see a greater spurt in festive demand, he said.Some companies are also running apprenticeship programmes ranging between six to 36 months in certain smaller cities, Bhatia said. \"These 'Learn and Earn' programmes are also doing extremely well. Employees also learn on the job at the ecommerce and logistics companies, especially warehouse executives,\" he said.Companies are mainly hiring pickers and packers, warehouse inventory staff who manage stock levels and delivery personnel, according to industry executives.","cleaned_content":"new delhi ecommerce and logistics companies have stepped up expansion into smaller cities this festive season with increased hiring and focused marketing programmes as these markets grow faster than metros said industry executives driven by rapid urbanisation mushrooming of shopping malls and surge in spending tier ii iii towns have seen a significant increase in manpower demand said yeshab giri chief commercial officer operational talent solutions at randstad india a talent management company cities such as jaipur indore ahmedabad coimbatore lucknow vadodara surat bhubaneswar bhopal chandigarh and vizag are witnessing \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e more demand than the previous festive season he said currently ecommerce and logistics firms in tier ii iii cities are hiring approximately \u003cSIX_TEN_PERCENT\u003e of the overall talent said lohit bhatia president workforce management at quess corp metros and other tier i cities traditionally see a greater spurt in festive demand he said some companies are also running apprenticeship programmes ranging between six to \u003cTHREE_TEN\u003e months in certain smaller cities bhatia said these learn and earn programmes are also doing extremely well employees also learn on the job at the ecommerce and logistics companies especially warehouse executives he said companies are mainly hiring pickers and packers warehouse inventory staff who manage stock levels and delivery personnel according to industry executives","timestamp":"2024-08-31T05:30:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}