{"url":"https://economictimes.indiatimes.com/tech/technology/eu-regulators-to-seek-feedback-on-googles-compliance-proposals-to-avert-charges/articleshow/113088233.cms","title":"EU regulators to seek feedback on Google's compliance proposals to avert charges","description":"The European Commission launched an investigation in March into Google to see if it favours its vertical search engines such as Google Shopping, Google Flights and Google Hotels over rivals, and whether it discriminates against third-party services on Google search results.","content":"European Union antitrust regulators will seek feedback next week on Google's proposals to comply with tech rules aimed at promoting fair competition, people with direct knowledge of the matter said on Wednesday, which could decide whether it faces formal charges. The European Commission launched an investigation in March into Google to see if it favours its vertical search engines such as Google Shopping, Google Flights and Google Hotels over rivals, and whether it discriminates against third-party services on Google search results. The move came after rivals, which include comparison shopping sites, said Alphabet's Google had not complied fully with the EU's Digital Markets Act (DMA) aimed at reining in the power of Big Tech and to create a level playing field for smaller competitors. Google's latest proposals aim to create a separate box for rivals below its own product listing ads box in Google search results to address criticism from comparison shopping sites, the people said. The company also offered to create two different boxes next to each other, with one showing intermediaries and the other for direct suppliers such as airlines, hotels and retailers, they said.","cleaned_content":"european union antitrust regulators will seek feedback next week on googles proposals to comply with tech rules aimed at promoting fair competition people with direct knowledge of the matter said on wednesday which could decide whether it faces formal charges the european commission launched an investigation in march into google to see if it favours its vertical search engines such as google shopping google flights and google hotels over rivals and whether it discriminates against third party services on google search results the move came after rivals which include comparison shopping sites said alphabets google had not complied fully with the eus digital markets act dma aimed at reining in the power of big tech and to create a level playing field for smaller competitors googles latest proposals aim to create a separate box for rivals below its own product listing ads box in google search results to address criticism from comparison shopping sites the people said the company also offered to create two different boxes next to each other with one showing intermediaries and the other for direct suppliers such as airlines hotels and retailers they said","timestamp":"2024-09-05T13:23:00+05:30","market_timestamp":"2024-09-05T13:23:00+05:30","off_market_hours":false}