{"url":"https://economictimes.indiatimes.com/tech/technology/honouring-previously-made-offers-priority-plan-to-hire-12000-staff-in-fy25-wipro/articleshow/112933161.cms","title":"Honouring previously made offers priority; plan to hire 12,000 staff in FY25: Wipro","description":"Wipro foresees an overall intake of 10,000-12,000 NGAs and, will hire in the areas of GenAI, cybersecurity and cloud, it said.","content":"New Delhi, IT firm Wipro on Friday said onboarding freshers who were previously offered jobs is a \"priority\" for the company and added that it onboarded about 3,000 such 'next-gen associates' in Q1 FY25. The Bengaluru-based firm sees an overall intake of 10,000-12,000 NGAs in FY25. The comments assume significance as the technology industry undergoes continual rounds of job cuts. \"At Wipro, our first priority is to onboard Next Gen Associates (NGAs), who had previously been made offers. In Q1 FY25, we onboarded approximately 3,000 such NGAs,\" it said in a statement to PTI. Wipro foresees an overall intake of 10,000-12,000 NGAs and, will hire in the areas of GenAI, cybersecurity and cloud, it said. ","cleaned_content":"new delhi it firm wipro on friday said onboarding freshers who were previously offered jobs is a priority for the company and added that it onboarded about \u003cTHREE_THOUSAND\u003e such next gen associates in q1 fy25 the bengaluru based firm sees an overall intake of \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e ngas in fy25 the comments assume significance as the technology industry undergoes continual rounds of job cuts at wipro our first priority is to onboard next gen associates ngas who had previously been made offers in q1 fy25 we onboarded approximately \u003cTHREE_THOUSAND\u003e such ngas it said in a statement to pti wipro foresees an overall intake of \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e ngas and will hire in the areas of genai cybersecurity and cloud it said","timestamp":"2024-08-30T23:13:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}