{"url":"https://economictimes.indiatimes.com/tech/technology/coaching-classes-wrong-way-to-help-children-narayana-murthy/articleshow/113202814.cms","title":"Coaching classes wrong way to help children: Narayana Murthy","description":"The Infosys founder called for rigorous training of teachers to improve the standards of teaching in India. The teachers, he said, needed training by highly competent retired teachers from both India and the developed countries on how to teach STEM subjects to students.","content":"Infosys founder NR Narayana Murthy on Monday said coaching classes are the wrong way to help children to learn better or pass exams. “Kota is the wrong way…I don’t believe in coaching classes. I don’t believe in that because at the end of the day, the only thing you can say is they introduce a certain discipline which parents themselves can provide at home,” he said in response to a query on the reports of student suicides at Kota in Rajasthan, while interacting with the media.“I think coaching centers are not the solution to help our children learn better. It is the responsibility of parents to create an environment of discipline and learning at home. If a student uses the time properly and listens to teachers carefully, I think that is sufficient,” he said.The Infosys founder called for rigorous training of teachers to improve the standards of teaching in India. The teachers, he said, needed training by highly competent retired teachers from both India and the developed countries on how to teach STEM subjects to students.The government must invite 10,000 retired teachers and if each can handle about 25 teachers, they can train 250,000 a year. In a matter of five years, a million teachers can be trained this way. “This is something that may be looked at by our political leaders if these children must fulfil the wishes of our Prime Minister to establish a Viksit Bharat by 2047. “This noble responsibility will be primarily shouldered by our today’s children who are 12 to 16 years old and are in their high school…Our job is to equip them to fulfil the dream and vision of our Prime Minister,” Murthy said.The PM has laid out a very aspirational and ambitious target to achieve Viksit Bharat (a Developed India with harmony and peace) by 2047, he said, speaking earlier at the Infosys Science Foundation after unveiling the Indian edition of the textbook Conceptual Physics, first published more than 50 years ago.","cleaned_content":"infosys founder nr narayana murthy on monday said coaching classes are the wrong way to help children to learn better or pass exams kota is the wrong way i don t believe in coaching classes i don t believe in that because at the end of the day the only thing you can say is they introduce a certain discipline which parents themselves can provide at home he said in response to a query on the reports of student suicides at kota in rajasthan while interacting with the media i think coaching centers are not the solution to help our children learn better it is the responsibility of parents to create an environment of discipline and learning at home if a student uses the time properly and listens to teachers carefully i think that is sufficient he said the infosys founder called for rigorous training of teachers to improve the standards of teaching in india the teachers he said needed training by highly competent retired teachers from both india and the developed countries on how to teach stem subjects to students the government must invite \u003cONE_TEN_THOUSAND\u003e retired teachers and if each can handle about \u003cTWO_TEN\u003e teachers they can train \u003cTWO_HUNDRED_THOUSAND\u003e a year in a matter of five years a million teachers can be trained this way this is something that may be looked at by our political leaders if these children must fulfil the wishes of our prime minister to establish a viksit bharat by \u003cTWO_THOUSAND\u003e this noble responsibility will be primarily shouldered by our today s children who are \u003cONE_TEN\u003e to \u003cONE_TEN\u003e years old and are in their high school our job is to equip them to fulfil the dream and vision of our prime minister murthy said the pm has laid out a very aspirational and ambitious target to achieve viksit bharat a developed india with harmony and peace by \u003cTWO_THOUSAND\u003e he said speaking earlier at the infosys science foundation after unveiling the indian edition of the textbook conceptual physics first published more than \u003cFIVE_TEN\u003e years ago","timestamp":"2024-09-09T22:45:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}