{"url":"https://economictimes.indiatimes.com/tech/technology/cash-rich-quick-commerce-firms-rush-to-grab-dark-store-sites-personnel-amid-rapid-growth/articleshow/113002415.cms","title":"Cash-rich quick commerce firms rush to grab dark store sites, personnel amid rapid growth","description":"Quick commerce in India: There is fierce competition for the right sites — now increasingly expensive and difficult to find in large cities — to set up these micro warehouses for servicing localities in the vicinity. Meanwhile, the likes of BigBasket, Zepto, Flipkart Minutes and Swiggy Instamart are recruiting aggressively, as well as poaching, people in the know told ET.","content":"Quick commerce is red-hot, and a new battle is unfolding on two fronts as companies flush from recent fundraises at rich valuations go all out to expand operations. There is a rush to open dark stores, and an accompanying scramble to find the personnel to manage expanding infrastructure and supply chain.There’s fierce competition for the right sites — now increasingly expensive and difficult to find in large cities — to set up these micro warehouses for servicing localities in the vicinity. Meanwhile, the likes of BigBasket, Zepto, Flipkart Minutes and Swiggy Instamart are recruiting aggressively, as well as poaching, people in the know told ET.Acquiring dark stores and managing daily operations are critical aspects of delivering orders within 15-30 minutes.“All platforms are in a land-grab mode as they look to almost double their dark store count in the coming years,” BofA Securities said in a report dated August 30. Rents for such commercial spaces in central locations are higher than for warehouses operated outside city limits by ecommerce companies such as Amazon and Flipkart.    ","cleaned_content":"quick commerce is red hot and a new battle is unfolding on two fronts as companies flush from recent fundraises at rich valuations go all out to expand operations there is a rush to open dark stores and an accompanying scramble to find the personnel to manage expanding infrastructure and supply chain there s fierce competition for the right sites now increasingly expensive and difficult to find in large cities to set up these micro warehouses for servicing localities in the vicinity meanwhile the likes of bigbasket zepto flipkart minutes and swiggy instamart are recruiting aggressively as well as poaching people in the know told et acquiring dark stores and managing daily operations are critical aspects of delivering orders within \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e minutes all platforms are in a land grab mode as they look to almost double their dark store count in the coming years bofa securities said in a report dated august \u003cTHREE_TEN\u003e rents for such commercial spaces in central locations are higher than for warehouses operated outside city limits by ecommerce companies such as amazon and flipkart","timestamp":"2024-09-03T12:11:00+05:30","market_timestamp":"2024-09-03T12:11:00+05:30","off_market_hours":false}