{"url":"https://economictimes.indiatimes.com/tech/technology/natwest-group-appoints-former-amex-exec-ruchika-panesar-as-india-head/articleshow/113195476.cms","title":"NatWest Group appoints former Amex exec Ruchika Panesar as India country head","description":"As country head of India, Panesar will be based in Gurugram and will spearhead the design and execution of strategic initiatives in collaboration with senior leaders across the Bank, with an emphasis on delivering world class experiences for our customers. Ruchika will be Chair of the India Management Committee and will report directly to the group chief information officer, Scott Marcar, the statement added.","content":"The UK’s NatWest Group has appointed former American Express executive Ruchika Panesar as the new country head for India effective September 26.She succeeds Punit Sood who will retire from the bank at the end of September, NatWest group said in a statement.Based in New York at American Express, Panesar was the vice president and global head of enterprise communications and marketing technology. She has over two decades of global experience across fintech and payment disciplines with deep expertise in global technology transformation, building enterprise scale products and technology and leveraging emerging technologies such as AI and Gen AI to drive innovation across digital customer experiences, NatWest said in a statement.As head of India, Panesar will be based in Gurugram and will spearhead the design and execution of strategic initiatives in collaboration with senior leaders across the Bank, with an emphasis on delivering world class experiences for our customers. Ruchika will be Chair of the India Management Committee and will report directly to the group chief information officer, Scott Marcar, the statement added.In August, the UK’s retail banking NatWest Group had announced plans to hire around 4000 engineers in Bengaluru over the next two years following its latest expansion in the southern city with its capability centre. The company leased an office in the country’s Silicon Valley city’s Bagmane Constellation Business Park, with facility spanning across 370,000 square feet over 11 floors, to expand its engineering and innovation hub.","cleaned_content":"the uk s natwest group has appointed former american express executive ruchika panesar as the new country head for india effective september \u003cTWO_TEN\u003e she succeeds punit sood who will retire from the bank at the end of september natwest group said in a statement based in new york at american express panesar was the vice president and global head of enterprise communications and marketing technology she has over two decades of global experience across fintech and payment disciplines with deep expertise in global technology transformation building enterprise scale products and technology and leveraging emerging technologies such as ai and gen ai to drive innovation across digital customer experiences natwest said in a statement as head of india panesar will be based in gurugram and will spearhead the design and execution of strategic initiatives in collaboration with senior leaders across the bank with an emphasis on delivering world class experiences for our customers ruchika will be chair of the india management committee and will report directly to the group chief information officer scott marcar the statement added in august the uk s retail banking natwest group had announced plans to hire around \u003cFOUR_THOUSAND\u003e engineers in bengaluru over the next two years following its latest expansion in the southern city with its capability centre the company leased an office in the country s silicon valley city s bagmane constellation business park with facility spanning across \u003cTHREE_HUNDRED_THOUSAND\u003e square feet over \u003cONE_TEN\u003e floors to expand its engineering and innovation hub","timestamp":"2024-09-10T16:16:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}