{"url":"https://economictimes.indiatimes.com/tech/technology/sa-technologies-launches-global-capability-center-gcc-in-pune-for-healthcare-industry-clients-to-drive-product-development-and-customer-support/articleshow/113188249.cms","title":"SA Technologies launches Global Capability Center (GCC) in Pune for healthcare industry clients to drive product development and customer support","description":"SA Technologies has proudly opened its Global Capability Center (GCC) in Pune, India, marking a significant milestone in the company’s pursuit of global operational excellence. This strategic expansion is designed to support their global client Tendable, which fosters innovation in healthcare solutions and continues to grow its international reach. SA Technologies' leadership as a premier IT consulting, offshore, and GCC service provider reinforces their commitment to delivering innovative and cutting-edge solutions.","content":"SA Technologies, headquartered in San Jose, California, is pleased to announce the launch of its state-of-the-art Global Capability Center (GCC) in Pune, India, effective August 21, 2024. This facility is specifically designed to cater to Tendable, providing a robust and scalable service delivery model from one of the world’s fastest-growing technology hubs. The Pune GCC is set to enhance Tendable’s global operations with advanced QA automation, application development and customer support. By harnessing India’s rich tech talent and dynamic ecosystem, the centre aims to drive operational efficiency and support digital transformation for global enterprises.Inaugural ceremony celebrates a visionary partnershipThe grand opening of SA Technologies' Pune Global Capability Center (GCC) was a landmark event, attended by notable leaders including Poonam Gupta, Engineering Head of Tendable; Ritesh Sharma, India Head of SA Technologies; Bhavin Goda, CFO; and Abhay Bhan, Director of Sales GCC; Deepali Kadam, Head Client Engagement. Their presence highlighted the shared vision and collaborative energy propelling this ambitious initiative.Strategic expansion for global reachManoj Joshi, CEO of SA Technologies, emphasised the strategic significance of the Pune Global Capability Center. He said, “The launch of Pune Global Capability Center represents a pivotal advancement in our global expansion strategy. This state-of-the-art facility is central to our mission, driving innovation, operational excellence, and superior service quality. Our extensive experience in setting up GCCs for international enterprises in India demonstrates our dedication to harnessing local talent and cutting-edge technology to deliver world-class solutions.”","cleaned_content":"sa technologies headquartered in san jose california is pleased to announce the launch of its state of the art global capability center gcc in pune india effective august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e this facility is specifically designed to cater to tendable providing a robust and scalable service delivery model from one of the world s fastest growing technology hubs the pune gcc is set to enhance tendable s global operations with advanced qa automation application development and customer support by harnessing india s rich tech talent and dynamic ecosystem the centre aims to drive operational efficiency and support digital transformation for global enterprises inaugural ceremony celebrates a visionary partnershipthe grand opening of sa technologies pune global capability center gcc was a landmark event attended by notable leaders including poonam gupta engineering head of tendable ritesh sharma india head of sa technologies bhavin goda cfo and abhay bhan director of sales gcc deepali kadam head client engagement their presence highlighted the shared vision and collaborative energy propelling this ambitious initiative strategic expansion for global reachmanoj joshi ceo of sa technologies emphasised the strategic significance of the pune global capability center he said the launch of pune global capability center represents a pivotal advancement in our global expansion strategy this state of the art facility is central to our mission driving innovation operational excellence and superior service quality our extensive experience in setting up gccs for international enterprises in india demonstrates our dedication to harnessing local talent and cutting edge technology to deliver world class solutions","timestamp":"2024-09-09T14:04:00+05:30","market_timestamp":"2024-09-09T14:04:00+05:30","off_market_hours":false}