{"url":"https://economictimes.indiatimes.com/tech/information-tech/rd-in-services-firms-different-from-that-in-product-firms-infosys-cofounder-kris-gopalakrishnan/articleshow/113065563.cms","title":"R\u0026D in services firms different from that in product firms: Infosys cofounder Kris Gopalakrishnan","description":"In the services industry, the R\u0026D focus is on tools, techniques, technology, and the business model. “For products, it is very different -- you invest in abstract, you take huge risk, you don't have any product, you're supposed to succeed, and there's a marketing process which is significantly higher.”","content":"An academic institution that wants to create an ecosystem of innovation must have space to co-locate the industry’s R\u0026D (research and development), Senapathy ‘Kris’ Gopalakrishnan, chairman of Axilor Ventures and co-founder of Infosys said at Nasscom’s Design and Engineering Summit 2024, in Bengaluru Wednesday.Explaining what can be achieved through this, Gopalakrishnan said: “You can now bring two entities together, industry and academia, and they can walk to their lab. Students can walk in, apprenticeships are possible, internships are possible. So, we need to engineer these things.” Giving examples of such ecosystems in Stanford, Boston, he suggested they be created in Indian academia as well.He said the role of R\u0026D in services firms is very different from that in product organisations. “The role of R\u0026D in services firms is to create tools for in-house use. The role of R\u0026D is to come up with new services. For example, tools for training, tools for data modernisation, and preparing data for training a model, and tools for testing that training model. So, R\u0026D does happen in services organizations, but then it gets embedded within the service. You don't separately price that. You price the services, and these allow you to increase the productivity in the services business.”In the services industry, the R\u0026D focus is on tools, techniques, technology, and the business model. “For products, it is very different -- you invest in abstract, you take huge risk, you don't have any product, you're supposed to succeed, and there's a marketing process which is significantly higher.”He explained that the primary source of funding for educational institutions is the government, but the funding is insufficient for high-value research in India. “Why do you assume that every single R\u0026D project will succeed, when you know that every startup is not going to succeed? In India, unfortunately, the freedom to fail in research is not there.”","cleaned_content":"an academic institution that wants to create an ecosystem of innovation must have space to co locate the industry s r d research and development senapathy kris gopalakrishnan chairman of axilor ventures and co founder of infosys said at nasscom s design and engineering summit \u003cTWO_THOUSAND\u003e in bengaluru wednesday explaining what can be achieved through this gopalakrishnan said you can now bring two entities together industry and academia and they can walk to their lab students can walk in apprenticeships are possible internships are possible so we need to engineer these things giving examples of such ecosystems in stanford boston he suggested they be created in indian academia as well he said the role of r d in services firms is very different from that in product organisations the role of r d in services firms is to create tools for in house use the role of r d is to come up with new services for example tools for training tools for data modernisation and preparing data for training a model and tools for testing that training model so r d does happen in services organizations but then it gets embedded within the service you dont separately price that you price the services and these allow you to increase the productivity in the services business in the services industry the r d focus is on tools techniques technology and the business model for products it is very different you invest in abstract you take huge risk you dont have any product youre supposed to succeed and theres a marketing process which is significantly higher he explained that the primary source of funding for educational institutions is the government but the funding is insufficient for high value research in india why do you assume that every single r d project will succeed when you know that every startup is not going to succeed in india unfortunately the freedom to fail in research is not there","timestamp":"2024-09-04T17:47:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}