{"url":"https://economictimes.indiatimes.com/tech/information-tech/a-fresh-start-how-outsourcing-firms-are-attracting-skilled-freshers-with-higher-pay-packets/articleshow/112766318.cms","title":"A fresh start: how outsourcing firms are attracting skilled freshers with higher pay packets","description":"​​Software service providers are eyeing skilled talent in the space of cloud computing, AI/ML and cybersecurity, citing ongoing changes in projects and technology disruption due to Gen AI. Homegrown IT major TCS has a similar program, titled ‘Prime’, that does specialised hiring for software development profiles with pay packages of around Rs 9 lakh per annum.","content":"The average starting salary a fresher at an IT firm can expect to earn has remained around Rs 3 to 4 lakh per annum for over a decade now. The issue was in the spotlight recently when Cognizant made headlines for offering a salary of Rs 2.5 lakh, although it was later clarified that this was for a non-engineering graduate. At the same time, however, top IT firms like TCS, Cognizant and Infosys are rolling out specialised hiring programs which offer significantly higher salaries (up to triple the average) for skilled engineers. According to Xpheno data, specialised skill-based offers for engineering g raduates have increased from Rs 5-10 lakh in 2020-21 to Rs 6-12 lakh in 2023-24, compared to Rs 3.3-3.5 lakh for freshers. The factors influencing this trend are changes in employability due to business and technology disruption, training spends and shorter duration of project pricing.“Changes in the employability narrative of fresh talent, a drop in per capita training spend and faster time to billable status will all be critical to positively impact fresher compensation in IT,” said Prasadh MS, head of workforce research, Xpheno.    ","cleaned_content":"the average starting salary a fresher at an it firm can expect to earn has remained around rs \u003cTHREE_\u003e to \u003cFOUR_\u003e lakh per annum for over a decade now the issue was in the spotlight recently when cognizant made headlines for offering a salary of rs \u003cTWO_\u003e lakh although it was later clarified that this was for a non engineering graduate at the same time however top it firms like tcs cognizant and infosys are rolling out specialised hiring programs which offer significantly higher salaries up to triple the average for skilled engineers according to xpheno data specialised skill based offers for engineering g raduates have increased from rs \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e to rs \u003cSIX_\u003e \u003cONE_TEN\u003e lakh in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e compared to rs \u003cTHREE_\u003e \u003cTHREE_\u003e lakh for freshers the factors influencing this trend are changes in employability due to business and technology disruption training spends and shorter duration of project pricing changes in the employability narrative of fresh talent a drop in per capita training spend and faster time to billable status will all be critical to positively impact fresher compensation in it said prasadh ms head of workforce research xpheno","timestamp":"2024-09-03T10:26:00+05:30","market_timestamp":"2024-09-03T10:26:00+05:30","off_market_hours":false}