{"url":"https://economictimes.indiatimes.com/tech/information-tech/frances-atos-cuts-financial-targets-but-says-restructuring-still-on-track/articleshow/112992489.cms","title":"France's Atos cuts financial targets but says restructuring still on track","description":"Atos - once seen as one of Europe's champions in the software and technology sector - has been teetering on the brink of financial collapse in recent months. However, it secured a crucial restructuring deal with banks and bondholders in June. The company's leverage ratio is also now expected to come below a multiple of 2.0 during 2027, later than a previous end-2026 deadline, and Atos also lowered its 2027 revenue and operating margin targets.","content":"French IT firm Atos on Monday said it would have less cash at hand over the next few years as sales are being dragged down by a weaker business environment, but added this would not impact the key terms of its financial restructuring plan. Atos - once seen as one of Europe's champions in the software and technology sector - has been teetering on the brink of financial collapse in recent months, although it secured a crucial restructuring deal with banks and bondholders in June.  Atos said it now forecast a full-year 2024 group revenue of 9.7 billion euros ($10.72 billion), down from 9.8 billion euros previously estimated. The company added it still saw positive, but somewhat lower, cash generation in 2026.  The group's operating margin will come in at 2.4% of revenue this year, down from 2.9% previously targeted. The company's leverage ratio is also now expected to come below a multiple of 2.0 during 2027, later than a previous end-2026 deadline, and Atos also lowered its 2027 revenue and operating margin targets.","cleaned_content":"french it firm atos on monday said it would have less cash at hand over the next few years as sales are being dragged down by a weaker business environment but added this would not impact the key terms of its financial restructuring plan atos once seen as one of europes champions in the software and technology sector has been teetering on the brink of financial collapse in recent months although it secured a crucial restructuring deal with banks and bondholders in june atos said it now forecast a full year \u003cTWO_THOUSAND\u003e group revenue of \u003cNINE_\u003e billion euros \u003cONE_TEN\u003e billion down from \u003cNINE_\u003e billion euros previously estimated the company added it still saw positive but somewhat lower cash generation in \u003cTWO_THOUSAND\u003e the groups operating margin will come in at \u003cTWO_PERCENT\u003e of revenue this year down from \u003cTWO_PERCENT\u003e previously targeted the companys leverage ratio is also now expected to come below a multiple of \u003cTWO_\u003e during \u003cTWO_THOUSAND\u003e later than a previous end \u003cTWO_THOUSAND\u003e deadline and atos also lowered its \u003cTWO_THOUSAND\u003e revenue and operating margin targets","timestamp":"2024-09-02T15:55:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}