{"url":"https://economictimes.indiatimes.com/tech/technology/explained-why-south-korea-is-on-high-alert-over-deepfake-sex-crimes/articleshow/112924497.cms","title":"Explained: Why South Korea is on high alert over deepfake sex crimes","description":"Several domestic media outlets reported recently that sexually explicit deepfake images and videos of South Korean women were often found in Telegram chatrooms.","content":"South Korean regulators and police this week vowed to combat sexually exploitative deepfakes, urging Telegram and other social media companies to cooperate with them as they crack down on the practice.What has caused the recent uproar in South Korea? Several domestic media outlets reported recently that sexually explicit deepfake images and videos of South Korean women were often found in Telegram chatrooms. Around the same time, South Korean feminist groups and international K-pop fans became more active on social media, calling for action and sharing tips on how to expose such chatrooms. The outcry also follows the sentencing this month of a man for his involvement in a deepfake pornography case that targeted female students at Seoul National University.","cleaned_content":"south korean regulators and police this week vowed to combat sexually exploitative deepfakes urging telegram and other social media companies to cooperate with them as they crack down on the practice what has caused the recent uproar in south korea several domestic media outlets reported recently that sexually explicit deepfake images and videos of south korean women were often found in telegram chatrooms around the same time south korean feminist groups and international k pop fans became more active on social media calling for action and sharing tips on how to expose such chatrooms the outcry also follows the sentencing this month of a man for his involvement in a deepfake pornography case that targeted female students at seoul national university","timestamp":"2024-08-30T16:19:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}