{"url":"https://economictimes.indiatimes.com/tech/information-tech/wipro-appoints-srikumar-rao-as-global-head-of-engineering-business-line/articleshow/112931375.cms","title":"Wipro appoints Srikumar Rao as global head of engineering business line","description":"Srikumar has been with Wipro for 26 years and will report to chief executive Srini Pallia in his new role. Before this, he was the chief operating officer (COO) of Wipro engineering edge (WEE) and global practice head of embedded systems.","content":"In yet another internal promotion, Wipro on Friday appointed Srikumar Rao as global head of its engineering edge business line, effective October 5. He succeeds Harmeet Chauhan, who is stepping down to pursue opportunities outside the organisation. Srikumar has been with Wipro for 26 years and will report to chief executive Srini Pallia in his new role. He was the chief operating officer (COO) of Wipro engineering edge (WEE) and global practice head of embedded systems. In his new role, Srikumar will continue to scale and strengthen Wipro’s engineering prowess, said the company in a filing with BSE. He will also be responsible for defining the vision and growth strategy for Wipro’s ER\u0026D Services business.Pallia, said, “Srikumar’s journey, from a campus recruit to multiple leadership roles within Wipro, makes him the ideal fit for this role and is testament to his exceptional dedication, technological expertise, and unparalleled client-centric approach. He has significantly contributed to how Wipro Engineering Edge operates and delivers projects, resulting in industry-leading customer satisfaction (NPS) scores. He has also been instrumental in securing marquee deals across various industries due to his tech-centric delivery and strategic insights.”The development is in line with the firm's restructuring exercise under Pallia. Earlier this month, Wipro had elevated veteran Nanda Kishore, COO of America's One, as chief of delivery and operational excellence. The firm had announced that Dilip Dialani, who has been with Wipro for almost two decades, would take over from Nanda as COO of Americas One in Q3. The firm had also elevated the role of its chief information security officer, Aathir Ahad, a Wipro veteran for over 21 years.","cleaned_content":"in yet another internal promotion wipro on friday appointed srikumar rao as global head of its engineering edge business line effective october \u003cFIVE_\u003e he succeeds harmeet chauhan who is stepping down to pursue opportunities outside the organisation srikumar has been with wipro for \u003cTWO_TEN\u003e years and will report to chief executive srini pallia in his new role he was the chief operating officer coo of wipro engineering edge wee and global practice head of embedded systems in his new role srikumar will continue to scale and strengthen wipro s engineering prowess said the company in a filing with bse he will also be responsible for defining the vision and growth strategy for wipro s er d services business pallia said srikumar s journey from a campus recruit to multiple leadership roles within wipro makes him the ideal fit for this role and is testament to his exceptional dedication technological expertise and unparalleled client centric approach he has significantly contributed to how wipro engineering edge operates and delivers projects resulting in industry leading customer satisfaction nps scores he has also been instrumental in securing marquee deals across various industries due to his tech centric delivery and strategic insights the development is in line with the firms restructuring exercise under pallia earlier this month wipro had elevated veteran nanda kishore coo of americas one as chief of delivery and operational excellence the firm had announced that dilip dialani who has been with wipro for almost two decades would take over from nanda as coo of americas one in q3 the firm had also elevated the role of its chief information security officer aathir ahad a wipro veteran for over \u003cTWO_TEN\u003e years","timestamp":"2024-08-30T21:04:00+05:30","market_timestamp":"2024-09-02T09:15:00+05:30","off_market_hours":true}