{"url":"https://economictimes.indiatimes.com/tech/technology/maharashtra-says-tower-adani-to-set-up-10-billion-semiconductor-unit/articleshow/113104805.cms","title":"Maharashtra says Tower-Adani to set up $10 billion semiconductor unit","description":"The Maharashtra cabinet has approved a $10-billion investment by a Tower Semiconductor-Adani Group joint venture to establish a semiconductor chip manufacturing unit in Taloja, Panvel. The project will have an initial capacity of 40,000 wafer starts per month, expanding to 80,000 WSPM in the second phase.","content":"Maharashtra cabinet panel Thursday approved a $10-billion (₹83,947 crore) investment proposal by a Tower Semiconductor-Adani Group joint venture to set up a semiconductor chip manufacturing unit at Taloja in Panvel, the state's deputy chief minister, Devendra Fadnavis, wrote on X. The semiconductor manufacturing unit, in the Navi Mumbai suburbs in Raigad district, will have a total capacity of 40,000 wafer starts per month (WSPM) in the first phase and an overall capacity of 80,000 WPSM. Of the total investment in the project, ₹58,763 crore will be infused in the first phase and the remaining ₹25,184 crore in the second phase, Fadnavis said.Emails sent to Tower and Adani Group did not elicit a response till press time.Sources in the ministry of electronics and information technology said that while the project might have been approved at the state level, a joint application submitted by Israel's Tower Semiconductor and Adani Group was still under consideration by the India Semiconductor Mission (ISM) and the IT ministry. India's Second Chip Unit \"The states are free to set up their own (semiconductor) units,\" a senior government official said. \"All applicants expecting incentives under the central government's plan must, however, get approvals from the ISM.\"","cleaned_content":"maharashtra cabinet panel thursday approved a \u003cONE_TEN\u003e billion \u003cEIGHT_TEN_THOUSAND\u003e crore investment proposal by a tower semiconductor adani group joint venture to set up a semiconductor chip manufacturing unit at taloja in panvel the states deputy chief minister devendra fadnavis wrote on x the semiconductor manufacturing unit in the navi mumbai suburbs in raigad district will have a total capacity of \u003cFOUR_TEN_THOUSAND\u003e wafer starts per month wspm in the first phase and an overall capacity of \u003cEIGHT_TEN_THOUSAND\u003e wpsm of the total investment in the project \u003cFIVE_TEN_THOUSAND\u003e crore will be infused in the first phase and the remaining \u003cTWO_TEN_THOUSAND\u003e crore in the second phase fadnavis said emails sent to tower and adani group did not elicit a response till press time sources in the ministry of electronics and information technology said that while the project might have been approved at the state level a joint application submitted by israels tower semiconductor and adani group was still under consideration by the india semiconductor mission ism and the it ministry indias second chip unit the states are free to set up their own semiconductor units a senior government official said all applicants expecting incentives under the central governments plan must however get approvals from the ism","timestamp":"2024-09-06T05:30:00+05:30","market_timestamp":"2024-09-06T09:15:00+05:30","off_market_hours":true}