{"url":"https://economictimes.indiatimes.com/tech/technology/best-buy-reports-another-drop-in-quarterly-sales-as-shoppers-remain-cautious-about-gadget-spending/articleshow/112918687.cms","title":"Best Buy reports another drop in quarterly sales as shoppers remain cautious about gadget spending","description":"Consumers have been wrestling with high prices and elevated interest rates. The US government reported earlier this month that hiring was much weaker than expected in July and the unemployment rate rose for a fourth straight month. Best Buy reported earnings of $291 million, or $1.34 per share for the three months ended August 3.","content":"Best Buy, the US largest consumer electronics chain, reported another quarterly drop in sales as Americans pull back on purchases of appliances and other consumer electronics gadgets to focus on essentials. The company's results, announced Thursday, beat Wall Street estimates, however. The Richfield, Minnesota-based retailer downgraded its sales outlook but raised its earnings view for the current fiscal year. Shares rose more than 7% in pre-market trading Thursday. Best Buy reported earnings of $291 million, or $1.34 per share for the three-month period ended Aug. 3. That compares with $274 million, or $1.25 per share, in the year-go period. Sales slipped 3% to $9.29 billion from $9.58 billion in the quarter. Analysts were expecting $1.16 per share on sales of $9.23 billion, according to FactSet.","cleaned_content":"best buy the us largest consumer electronics chain reported another quarterly drop in sales as americans pull back on purchases of appliances and other consumer electronics gadgets to focus on essentials the companys results announced thursday beat wall street estimates however the richfield minnesota based retailer downgraded its sales outlook but raised its earnings view for the current fiscal year shares rose more than \u003cSEVEN_PERCENT\u003e in pre market trading thursday best buy reported earnings of \u003cTWO_HUNDRED\u003e million or \u003cONE_\u003e per share for the three month period ended aug \u003cTHREE_\u003e that compares with \u003cTWO_HUNDRED\u003e million or \u003cONE_\u003e per share in the year go period sales slipped \u003cTHREE_PERCENT\u003e to \u003cNINE_\u003e billion from \u003cNINE_\u003e billion in the quarter analysts were expecting \u003cONE_\u003e per share on sales of \u003cNINE_\u003e billion according to factset","timestamp":"2024-08-30T13:09:00+05:30","market_timestamp":"2024-08-30T13:09:00+05:30","off_market_hours":false}