{"url":"https://economictimes.indiatimes.com/tech/technology/meity-approves-mindgrove-proposal-to-develop-second-chip-under-dli-scheme/articleshow/113196707.cms","title":"MeitY approves Mindgrove's proposal to develop second chip under DLI scheme","description":"The design-linked incentive scheme of the Ministry of Electronics and Information Technology offers financial incentives and design infrastructure support for 100 domestic companies, startups and MSMEs across the development and deployment of semiconductor design for ICS, Chipsets, SoCs, and other devices for 5 years.","content":"The government has approved Chennai-based Mindgrove Technologies' proposal to develop its second chip “Vision SoC” under the design-linked incentive scheme, the Indian Institute of Technology Madras-incubated startup said on Monday. The Vision system-on-chip is aimed at high-performance edge computing and video processing applications and will be used by companies that build and sell close-circuit television cameras, dashcams, video recorders, automotive advanced driver assistance systems, smart televisions, and other devices with video processing functions, the company said. The Chennai-based fabless semiconductor startup, also backed by Peak XV Partners, had in May this year launched India’s first commercial high-performance system-on-chip. The Chennai-based startup had said the chip would allow domestic companies to use an Indian SoC in their products and help reduce the cost of their devices, without compromising on high-end features. Mindgrove was founded by Shashwath and Sharan Srinivas J and is backed by Peak XV Partners, Speciale Invest and Whiteboard Capital.","cleaned_content":"the government has approved chennai based mindgrove technologies proposal to develop its second chip vision soc under the design linked incentive scheme the indian institute of technology madras incubated startup said on monday the vision system on chip is aimed at high performance edge computing and video processing applications and will be used by companies that build and sell close circuit television cameras dashcams video recorders automotive advanced driver assistance systems smart televisions and other devices with video processing functions the company said the chennai based fabless semiconductor startup also backed by peak xv partners had in may this year launched india s first commercial high performance system on chip the chennai based startup had said the chip would allow domestic companies to use an indian soc in their products and help reduce the cost of their devices without compromising on high end features mindgrove was founded by shashwath and sharan srinivas j and is backed by peak xv partners speciale invest and whiteboard capital","timestamp":"2024-09-09T17:56:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}