{"url":"https://economictimes.indiatimes.com/tech/technology/karnataka-wants-to-create-4-5-more-bengalurus-state-it-minister/articleshow/113072502.cms","title":"Karnataka wants to create 4-5 more Bengalurus: state IT minister","description":"In a recent post on microblogging portal X, Kharge said Karnataka is the fourth largest technology cluster in the world and the leader in the country in many verticals. The southern state has over one-third of India’s tech talent and close to 25,000 startups, 52 unicorns (startups with valuation of $1 billion or more) and 47 soon to be unicorns.","content":"Karnataka wants to create 4-5 more regions like Bengaluru, India's Silicon Valley, in the state, minister for electronics and information technology and biotechnology Priyank Kharge said. Speaking at an event organised by IT industry body Nasscom, Kharge said he wants to position Karnataka not just as an investment destination, but also a space for knowledge and skills.In a fireside chat with Nasscom president Debjani Ghosh at its Design and Engineering Summit 2024 on Wednesday, Kharge said this will bring in more innovation in the country and in the next 4-5 years, Karnataka will not just be innovating for India but for the world.In a recent post on microblogging portal X, Kharge said Karnataka is the fourth largest technology cluster in the world and the leader in the country in many verticals. The southern state has over one-third of India’s tech talent and close to 25,000 startups, 52 unicorns (startups with valuation of $1 billion or more) and 47 soon to be unicorns.India ranks third in artificial intelligence skill penetration, only behind the US and Germany, and AI plays a big role in the engineering and research \u0026 development (ER\u0026D), he said, while pitching Karnataka to be a supplier of the best trained talent in this sector.“We will ensure the best trained talent is supplied from Karnataka…We are talking to several partners including services companies, GCCs (global capability centres) in the industry. We are ready to train them,” Kharge said.","cleaned_content":"karnataka wants to create \u003cFOUR_\u003e \u003cFIVE_\u003e more regions like bengaluru indias silicon valley in the state minister for electronics and information technology and biotechnology priyank kharge said speaking at an event organised by it industry body nasscom kharge said he wants to position karnataka not just as an investment destination but also a space for knowledge and skills in a fireside chat with nasscom president debjani ghosh at its design and engineering summit \u003cTWO_THOUSAND\u003e on wednesday kharge said this will bring in more innovation in the country and in the next \u003cFOUR_\u003e \u003cFIVE_\u003e years karnataka will not just be innovating for india but for the world in a recent post on microblogging portal x kharge said karnataka is the fourth largest technology cluster in the world and the leader in the country in many verticals the southern state has over one third of india s tech talent and close to \u003cTWO_TEN_THOUSAND\u003e startups \u003cFIVE_TEN\u003e unicorns startups with valuation of \u003cONE_\u003e billion or more and \u003cFOUR_TEN\u003e soon to be unicorns india ranks third in artificial intelligence skill penetration only behind the us and germany and ai plays a big role in the engineering and research development er d he said while pitching karnataka to be a supplier of the best trained talent in this sector we will ensure the best trained talent is supplied from karnataka we are talking to several partners including services companies gccs global capability centres in the industry we are ready to train them kharge said","timestamp":"2024-09-05T06:00:00+05:30","market_timestamp":"2024-09-05T09:15:00+05:30","off_market_hours":true}