{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-mandates-five-days-a-week-in-office-starting-next-year/articleshow/113409170.cms","title":"Amazon mandates five days a week in office starting next year","description":"Amazon will require employees to return to office five days a week starting next year, toughening its previous three-day mandate. CEO Andy Jassy cited the need for better collaboration and connection. The move has been unpopular among employees, some of whom have protested against it.","content":"Amazon.com will require employees to return to working at company offices five days per week beginning next year, toughening a prior three-day mandate. The change is necessary to \"invent, collaborate and be connected\" wrote CEO Andy Jassy in a letter to employees on Monday posted to its website. He said the experience of a three-day mandate \"strengthened our conviction about the benefits\" of in-office work. Companies have been allowing many employees to work from home since the pandemic, leaving downtown offices nearly empty in a number of cities such as San Francisco and Seattle. However, some tech firms are beginning to mandate employees to return to their offices two or three days per week. Amazon has taken a tougher stance than many of its rivals as COVID-19 has become less of a daily threat. Employees have described to Reuters how Amazon has required them to report to, in some cases, distant offices or move to Seattle to keep their jobs. And some employees who were consistently out of compliance with the existing three-day mandate were told they were \"voluntarily resigning,\" and were locked out of Amazon's systems. A spokesperson for Amazon did not immediately respond to say whether the new mandate will be as stringent, nor did an employee Q\u0026A shared with Reuters on Monday make it clear.","cleaned_content":"amazon com will require employees to return to working at company offices five days per week beginning next year toughening a prior three day mandate the change is necessary to invent collaborate and be connected wrote ceo andy jassy in a letter to employees on monday posted to its website he said the experience of a three day mandate strengthened our conviction about the benefits of in office work companies have been allowing many employees to work from home since the pandemic leaving downtown offices nearly empty in a number of cities such as san francisco and seattle however some tech firms are beginning to mandate employees to return to their offices two or three days per week amazon has taken a tougher stance than many of its rivals as covid \u003cONE_TEN\u003e has become less of a daily threat employees have described to reuters how amazon has required them to report to in some cases distant offices or move to seattle to keep their jobs and some employees who were consistently out of compliance with the existing three day mandate were told they were voluntarily resigning and were locked out of amazons systems a spokesperson for amazon did not immediately respond to say whether the new mandate will be as stringent nor did an employee q a shared with reuters on monday make it clear","timestamp":"2024-09-17T08:37:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}