{"url":"https://economictimes.indiatimes.com/tech/technology/no-merger-scrutiny-of-microsofts-hiring-of-inflection-staff-eu-says/articleshow/113475119.cms","title":"No merger scrutiny of Microsoft's hiring of Inflection staff, EU says","description":"Microsoft's hiring of staff from AI startup Inflection, including its co-founders, will not be scrutinised under EU merger rules. The European Commission stated that seven EU countries had withdrawn their requests for examination. This follows a court ruling limiting the EU's ability to review mergers below certain revenue thresholds.","content":"Microsoft's hiring of artificial intelligence startup Inflection's staff including its co-founders will not be scrutinised under European Union merger rules, EU antitrust regulators said on Wednesday. The European Commission said seven EU countries had dropped their requests asking it to examine the deal. The move followed a ruling from Europe's top court earlier this month prohibiting the EU enforcer from examining merger cases which fall below the EU's merger revenue threshold. Judges said the EU antitrust watchdog was also not allowed to encourage its national peers to ask it to take up such cases. Critics said these merger powers were regulatory over-reach while the Commission said such deals could be killer acquisitions in which big companies acquire startups to shut them down. \"All seven member states that submitted an initial referral have decided to withdraw their requests. Therefore, the Commission will take no decision in this matter,\" the EU executive said.","cleaned_content":"microsofts hiring of artificial intelligence startup inflections staff including its co founders will not be scrutinised under european union merger rules eu antitrust regulators said on wednesday the european commission said seven eu countries had dropped their requests asking it to examine the deal the move followed a ruling from europes top court earlier this month prohibiting the eu enforcer from examining merger cases which fall below the eus merger revenue threshold judges said the eu antitrust watchdog was also not allowed to encourage its national peers to ask it to take up such cases critics said these merger powers were regulatory over reach while the commission said such deals could be killer acquisitions in which big companies acquire startups to shut them down all seven member states that submitted an initial referral have decided to withdraw their requests therefore the commission will take no decision in this matter the eu executive said","timestamp":"2024-09-19T08:54:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}