{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-faces-tough-questions-from-court-over-challenge-to-us-law/articleshow/113411284.cms","title":"TikTok faces tough questions from court over challenge to US law","description":"The law gives ByteDance until Jan. 19 to sell or divest TikTok's U.S. assets or face a ban in the United States. Driven by worries that China could access data on Americans or spy on them with the app, the U.S. Congress passed the measure with overwhelming support and President Joe Biden signed it into law in April.","content":"A lawyer for TikTok and Chinese parent company ByteDance sought on Monday to convince a federal appeals court to block a U.S. law that would ban the short video app used by 170 million Americans as soon as Jan. 19, arguing that it violates free speech protections, but faced tough questions from the judges. A three-judge panel of the U.S. Court of Appeals for the District of Columbia heard two hours of arguments in the lawsuit filed by TikTok and ByteDance in May seeking an injunction to prevent the law from taking effect. Justice Department lawyer Daniel Tenny pressed the U.S. government's stance that TikTok, under Chinese ownership, poses a national security threat because of its access to vast amounts of personal data on Americans, asserting that China can covertly manipulate information that Americans consume via the popular app. Andrew Pincus, the lawyer arguing for TikTok and ByteDance, told Judges Sri Srinivasan, Neomi Rao and Douglas Ginsburg that the U.S. government had not demonstrated that TikTok actually poses national security risks. Pincus also argued that the law violates the U.S. Constitution on a number of grounds including running afoul of the First Amendment protections against government abridgment of speech. \"The law before this court is unprecedented, and its effect would be staggering,\" Pincus told the judges, saying \"for the first time in history, Congress has expressly targeted a specific U.S. speaker banning its speech and the speech of 170 million Americans.\"","cleaned_content":"a lawyer for tiktok and chinese parent company bytedance sought on monday to convince a federal appeals court to block a u s law that would ban the short video app used by \u003cONE_HUNDRED\u003e million americans as soon as jan \u003cONE_TEN\u003e arguing that it violates free speech protections but faced tough questions from the judges a three judge panel of the u s court of appeals for the district of columbia heard two hours of arguments in the lawsuit filed by tiktok and bytedance in may seeking an injunction to prevent the law from taking effect justice department lawyer daniel tenny pressed the u s governments stance that tiktok under chinese ownership poses a national security threat because of its access to vast amounts of personal data on americans asserting that china can covertly manipulate information that americans consume via the popular app andrew pincus the lawyer arguing for tiktok and bytedance told judges sri srinivasan neomi rao and douglas ginsburg that the u s government had not demonstrated that tiktok actually poses national security risks pincus also argued that the law violates the u s constitution on a number of grounds including running afoul of the first amendment protections against government abridgment of speech the law before this court is unprecedented and its effect would be staggering pincus told the judges saying for the first time in history congress has expressly targeted a specific u s speaker banning its speech and the speech of \u003cONE_HUNDRED\u003e million americans","timestamp":"2024-09-17T09:37:00+05:30","market_timestamp":"2024-09-17T09:37:00+05:30","off_market_hours":false}