{"url":"https://economictimes.indiatimes.com/tech/technology/us-lenders-counter-byjus-claim-on-debt-says-edtech-obligated-to-repay-full-1-2-billion-tlb/articleshow/113370761.cms","title":"Byju’s obligated to repay $1.2 billion with interest, says US lenders","description":"The lenders say the troubled edtech company has not made any contractually due payments in over 17 months and neither founder Byju Raveendran nor the Insolvency Resolution Professional has the authority to disqualify any term loan lender.","content":"The US lenders of Byju’s parent company Think \u0026 Learn have said that the troubled edtech firm must repay the borrowed $1.2 billion along with interest. According to these lenders, Byju’s has not made any contractually due payment in more than 17 months. “Neither Byju Raveendran (founder) nor the Insolvency Resolution Professional (IRP) has the authority to disqualify any term loan lender – and even if they did, Byju’s would still be obligated to repay the full amount of the loan plus interest. Any argument otherwise is illegitimate, and Byju knows it,” the steering committee of the ad hoc group of term loan lenders to Byju’s Alpha Inc said in a statement. The lenders have issued this statement in response to a PTI report in which Raveendran claimed that Think \u0026 Learn may not be required to repay any amount of the disputed $1.2 billion Term Loan B (TLB) due to the current \"behaviour\" of Glas Trust, which represents the US-based lenders. Raveendran said that the insolvency resolution professional (IRP) has verified Byju's debt claim, which now stands at Rs 20 crore.“Majority lenders today hold more than 64% of the TLB…Byju’s claim that he either does not know who the lenders are or intends to pay primary lenders is illogical and false. He has not paid any principal or interest – be it to majority lenders or those who purchased the loans in the secondary market,” they added.","cleaned_content":"the us lenders of byju s parent company think learn have said that the troubled edtech firm must repay the borrowed \u003cONE_\u003e billion along with interest according to these lenders byju s has not made any contractually due payment in more than \u003cONE_TEN\u003e months neither byju raveendran founder nor the insolvency resolution professional irp has the authority to disqualify any term loan lender and even if they did byju s would still be obligated to repay the full amount of the loan plus interest any argument otherwise is illegitimate and byju knows it the steering committee of the ad hoc group of term loan lenders to byju s alpha inc said in a statement the lenders have issued this statement in response to a pti report in which raveendran claimed that think learn may not be required to repay any amount of the disputed \u003cONE_\u003e billion term loan b tlb due to the current behaviour of glas trust which represents the us based lenders raveendran said that the insolvency resolution professional irp has verified byjus debt claim which now stands at rs \u003cTWO_TEN\u003e crore majority lenders today hold more than \u003cSIX_TEN_PERCENT\u003e of the tlb byju s claim that he either does not know who the lenders are or intends to pay primary lenders is illogical and false he has not paid any principal or interest be it to majority lenders or those who purchased the loans in the secondary market they added","timestamp":"2024-09-15T23:30:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}