{"url":"https://economictimes.indiatimes.com/tech/technology/uks-playtech-sees-2024-profit-slightly-ahead-of-market-view/articleshow/113386177.cms","title":"UK's Playtech sees 2024 profit slightly ahead of market view","description":"Playtech also said it has entered into an agreement with Mexican sports betting firm Caliente Interactive's unit Caliplay, and will hold a 30.8% equity interest in Caliente.","content":"British gambling technology firm Playtech Plc said on Monday it expects 2024 adjusted core profit to be slightly ahead of market expectations, mainly due to strong performance in its business-to-business (B2B) division. The London-listed company said its B2B division saw revenue growth in the Americas for the six months ended June 30 amid tighter cost controls. Playtech also said it has entered into an agreement with Mexican sports betting firm Caliente Interactive's unit Caliplay, and will hold a 30.8% equity interest in Caliente. Under the terms of the agreement, Playtech will have the right to appoint a director to Caliente's board. It has also entered into a revised eight-year B2B software licence and services agreement.","cleaned_content":"british gambling technology firm playtech plc said on monday it expects \u003cTWO_THOUSAND\u003e adjusted core profit to be slightly ahead of market expectations mainly due to strong performance in its business to business b2b division the london listed company said its b2b division saw revenue growth in the americas for the six months ended june \u003cTHREE_TEN\u003e amid tighter cost controls playtech also said it has entered into an agreement with mexican sports betting firm caliente interactives unit caliplay and will hold a \u003cTHREE_TEN_PERCENT\u003e equity interest in caliente under the terms of the agreement playtech will have the right to appoint a director to calientes board it has also entered into a revised eight year b2b software licence and services agreement","timestamp":"2024-09-16T12:41:00+05:30","market_timestamp":"2024-09-16T12:41:00+05:30","off_market_hours":false}