{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-to-invest-rs-17-crore-in-iit-m-incubated-spacetech-startup-galaxeye/articleshow/113496669.cms","title":"Infosys to invest Rs 17 crore in IIT M-incubated spacetech startup GalaxEye","description":"The cash investment will involve Infosys picking up a minority stake, less than 20%, as part of the series A round to pick up equity and compulsory convertible preference shares.","content":"Infosys on Thursday said it has agreed to invest in space-tech startup, GalaxEye Space Solutions Pvt Ltd up to Rs 17 crore (approximately $2 million) as part of Infosys Innovation Fund. The cash investment will involve Infosys picking up a minority stake, less than 20%, as part of the series A round to pick up equity and compulsory convertible preference shares.The funding round is expected to be completed on or before September 30, 2024, Infosys said in a regulatory filing.Bengaluru-based GalaxEye is a space-tech startup for Earth Observation that builds multi-sensor satellites and synchronization platform. GalaxEye generates comprehensive all-weather, high-resolution and intuitive datasets. The downstream applications of space technology and the datasets powered by AI and Analytics presents a potential of data-driven decisions spanning multiple industries, the statement said.In August, GalaxEye had announced a fund raise of $6.5mn as part of the Series A funding led by venture capital (VC) funds Mela Ventures and Speciale Invest. The round also saw participation from drone manufacturer ideaForge, with additional investments from other VCs including Rainmatter, Navam Capital, Faad Capital, and Anicut Capital.In 2022, the startup received seed capital from angel investors including Prashant Pitti - cofounders of EaseMyTrip, Abhishek Goyal – cofounder of data platform Tracxn, Nithin Kamath – founder and CEO of broking platform Zerodha and Celesta Capital partner Ganpathy Subramaniam.","cleaned_content":"infosys on thursday said it has agreed to invest in space tech startup galaxeye space solutions pvt ltd up to rs \u003cONE_TEN\u003e crore approximately \u003cTWO_\u003e million as part of infosys innovation fund the cash investment will involve infosys picking up a minority stake less than \u003cTWO_TEN_PERCENT\u003e as part of the series a round to pick up equity and compulsory convertible preference shares the funding round is expected to be completed on or before september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e infosys said in a regulatory filing bengaluru based galaxeye is a space tech startup for earth observation that builds multi sensor satellites and synchronization platform galaxeye generates comprehensive all weather high resolution and intuitive datasets the downstream applications of space technology and the datasets powered by ai and analytics presents a potential of data driven decisions spanning multiple industries the statement said in august galaxeye had announced a fund raise of \u003cSIX_\u003e mn as part of the series a funding led by venture capital vc funds mela ventures and speciale invest the round also saw participation from drone manufacturer ideaforge with additional investments from other vcs including rainmatter navam capital faad capital and anicut capital in \u003cTWO_THOUSAND\u003e the startup received seed capital from angel investors including prashant pitti cofounders of easemytrip abhishek goyal cofounder of data platform tracxn nithin kamath founder and ceo of broking platform zerodha and celesta capital partner ganpathy subramaniam","timestamp":"2024-09-19T19:28:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}