{"url":"https://economictimes.indiatimes.com/tech/information-tech/nasscom-announces-cohort-of-37-genai-startups-for-its-foundry-programme/articleshow/113495431.cms","title":"Nasscom announces cohort of 37 GenAI startups for its foundry programme","description":"On average, startups in the cohort are two years old and have already raised $750,000 from institutional investors, Nasscom said.","content":"Technology industry association Nasscom on Thursday announced the selection of 37 Generative AI startups for the second cohort of its Generative AI Foundry programme.On average, startups in the cohort are two years old and have already raised $750,000 from institutional investors, Nasscom said. They offer solutions that generate text, audio, code, video/image, and multimodal output with strong use cases for retail, banking and financial services, healthcare and life sciences, and for various enterprise functions.The selected startups include Fluid AI, Sivi, DaveAI, and OnFinance and 30% of them have women in their founding teams, it said.\"Homegrown Generative AI startups are revolutionizing industries not only in India but for the world, showcasing India's rapidly growing expertise in AI on the global stage,” said Ankit Bose, head of AI, Nasscom. “Nasscom is firmly committed to supporting AI and Generative AI startups in all the ways possible in close collaboration with industry, government, academia and investors.\"Launched in October 2023, the programme has supported 26 GenAI startups by facilitating paid PoCs (proofs-of-concept) from enterprises, funding opportunities from investors, affordable access to state-of-the-art GPUs (graphics processing units), bootcamps, mentoring and knowledge sessions from subject matter experts.","cleaned_content":"technology industry association nasscom on thursday announced the selection of \u003cTHREE_TEN\u003e generative ai startups for the second cohort of its generative ai foundry programme on average startups in the cohort are two years old and have already raised \u003cSEVEN_HUNDRED_THOUSAND\u003e from institutional investors nasscom said they offer solutions that generate text audio code video image and multimodal output with strong use cases for retail banking and financial services healthcare and life sciences and for various enterprise functions the selected startups include fluid ai sivi daveai and onfinance and \u003cTHREE_TEN_PERCENT\u003e of them have women in their founding teams it said homegrown generative ai startups are revolutionizing industries not only in india but for the world showcasing indias rapidly growing expertise in ai on the global stage said ankit bose head of ai nasscom nasscom is firmly committed to supporting ai and generative ai startups in all the ways possible in close collaboration with industry government academia and investors launched in october \u003cTWO_THOUSAND\u003e the programme has supported \u003cTWO_TEN\u003e genai startups by facilitating paid pocs proofs of concept from enterprises funding opportunities from investors affordable access to state of the art gpus graphics processing units bootcamps mentoring and knowledge sessions from subject matter experts","timestamp":"2024-09-19T18:45:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}