{"url":"https://economictimes.indiatimes.com/tech/technology/abu-dhabi-based-g42-to-build-ai-ready-data-centres-in-india/articleshow/113238259.cms","title":"Abu Dhabi-based G42 to double data centre capacity in India","description":"G42 will invest in the project which was part of the Memorandum-of-Understanding (MoU) signed between the two government back in February 2024, Manu Kumar Jain, CEO, G42 India told ET. “G42 is proud to be the executing partner of the MoU initiatives,” he said.","content":"Abu Dhabi-based advanced technologies group G42 shall build upto 2 Gigawatt AI-ready data centres in India - double of total existing capacity - as part of pact signed between the UAE and Indian governments aimed at co-developing sovereign AI, a top executive said.G42 will invest in the project which was part of the Memorandum-of-Understanding (MoU) signed between the two government back in February 2024, Manu Kumar Jain, CEO, G42 India told ET. “G42 is proud to be the executing partner of the MoU initiatives,” he said.Earlier this month, Mukesh Ambani-led Reliance Industries announced its plan to build a Gigawatt scale AI-ready data centre in Jamnagar, Gujarat.Backed by Emirati sovereign wealth fund Mubadala, G42, on Tuesday, unveiled NANDA, a 13-billion parameter AI model trained on 2.13 trillion tokens in Hindi and English. The company was the first to launch JAIS, an open-source Arabic LLM series ranging from 590 million to 70 billion parameters in size, in August 2023.Tuesday’s announcement was made in the presence of Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi, during his state visit to India. Union Minister of Commerce, Mr. Piyush Goyal was also present in Mumbai.","cleaned_content":"abu dhabi based advanced technologies group g42 shall build upto \u003cTWO_\u003e gigawatt ai ready data centres in india double of total existing capacity as part of pact signed between the uae and indian governments aimed at co developing sovereign ai a top executive said g42 will invest in the project which was part of the memorandum of understanding mou signed between the two government back in february \u003cTWO_THOUSAND\u003e manu kumar jain ceo g42 india told et g42 is proud to be the executing partner of the mou initiatives he said earlier this month mukesh ambani led reliance industries announced its plan to build a gigawatt scale ai ready data centre in jamnagar gujarat backed by emirati sovereign wealth fund mubadala g42 on tuesday unveiled nanda a \u003cONE_TEN\u003e billion parameter ai model trained on \u003cTWO_\u003e trillion tokens in hindi and english the company was the first to launch jais an open source arabic llm series ranging from \u003cFIVE_HUNDRED\u003e million to \u003cSEVEN_TEN\u003e billion parameters in size in august \u003cTWO_THOUSAND\u003e tuesday s announcement was made in the presence of sheikh khaled bin mohamed bin zayed al nahyan crown prince of abu dhabi during his state visit to india union minister of commerce mr piyush goyal was also present in mumbai","timestamp":"2024-09-11T06:00:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}