{"url":"https://economictimes.indiatimes.com/tech/technology/uber-relaunches-flagship-product-black-in-india/articleshow/113244154.cms","title":"Uber relaunches flagship product Black in India starting with Mumbai","description":"Uber is set to launch its premium service, Uber Black, in Mumbai next week. The service will feature high-end cars and top-rated drivers, offering amenities like quiet mode and temperature control. This move aims to cater to Indian consumers' growing demand for premium experiences.","content":"Ride-hailing platform Uber on Wednesday announced the launch of its flagship top-of-the-line product Uber Black, starting with Mumbai next week. The move targets the rising demand among Indian customers for premium services, reflecting a trend where consumers across various segments are increasingly spending on high-end experiences.ET had exclusively reported on August 26 about the cab aggregator’s plan to reintroduce Uber Black, which will be priced 30-40% higher than the platform’s existing top product Uber Premier. The company expects it to have a “huge traction with corporate travel use cases.”Uber Black will offer a range of features, such as higher-end cars and top-rated drivers, providing a personalised ride experience with options like quiet mode, temperature control, and luggage assistance. Riders will also enjoy extended wait times, including an extra five-minute pickup window without a waiting fee, the firm said.The company had started its India operations in 2013 with Uber Black, under which C-suite cars such as Mercedes, BMW and Audi were available on demand. It later replaced the luxury cars with the likes of Toyota Innova, Honda City and Toyota Corolla. The service was halted a year later.“We are thrilled to bring Uber Black back in an all-new avatar to meet the evolving aspirations of Indian customers and introduce the business class of back seats on Indian roads,” said Prabhjeet Singh, president of Uber India and South Asia.","cleaned_content":"ride hailing platform uber on wednesday announced the launch of its flagship top of the line product uber black starting with mumbai next week the move targets the rising demand among indian customers for premium services reflecting a trend where consumers across various segments are increasingly spending on high end experiences et had exclusively reported on august \u003cTWO_TEN\u003e about the cab aggregator s plan to reintroduce uber black which will be priced \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e higher than the platform s existing top product uber premier the company expects it to have a huge traction with corporate travel use cases uber black will offer a range of features such as higher end cars and top rated drivers providing a personalised ride experience with options like quiet mode temperature control and luggage assistance riders will also enjoy extended wait times including an extra five minute pickup window without a waiting fee the firm said the company had started its india operations in \u003cTWO_THOUSAND\u003e with uber black under which c suite cars such as mercedes bmw and audi were available on demand it later replaced the luxury cars with the likes of toyota innova honda city and toyota corolla the service was halted a year later we are thrilled to bring uber black back in an all new avatar to meet the evolving aspirations of indian customers and introduce the business class of back seats on indian roads said prabhjeet singh president of uber india and south asia","timestamp":"2024-09-11T11:03:00+05:30","market_timestamp":"2024-09-11T11:03:00+05:30","off_market_hours":false}