{"url":"https://economictimes.indiatimes.com/tech/technology/chip-infra-company-jacobs-sees-role-in-four-plans-with-govt-approval/articleshow/113269564.cms","title":"Chip infra company Jacobs sees role in four plans with govt approval","description":"Bob Pragada, Jacobs Global CEO, told ET in an interview that the company was in active consultation with four of the five chip projects that had received approval from the government. With CG Power and the Tata group, however, he said Jacobs was \"in a full engagement role\".","content":"Engineering services company Jacobs is seeing huge opportunities in India which includes sharpening its focus on the semiconductor sector as more downstream industries of the supply chain are beginning to set up shop in India along with emergence of large chip fabrication units and chip assembly facilities in the country. It is also gung-ho on its data center business as hyperscalers are rapidly expanding in the country. Bob Pragada, Jacobs Global CEO told ET in an interview that the company was in active consultation with four of the five chip projects that had received approval from the government. With CG Power and the Tata group, however, he said Jacobs was \"in a full engagement role.\"Jacobs in itself is partnering with CG Power for its OSAT facility in Sanand. Pragada said the facility is a critical packaging test and assembly partner to Renesas and said the pilot plant is in the field in construction and that the company was \"still in design for the main facility\" while adding that the project was progressing 'very fast.'In August, ET was the first to report that the Murugappa Group firm had onboarded the leading global facilities management firm to build its upcoming chip assembly plant in Sanand, Gujarat. Getting Jacobs, as a turnkey contractor, which is dubbed as the world's best in building fabs since all leading fabs globally by top chipmakers such as Intel and TSMC are done by them meant that CG Power may be \"the fastest chip assembly plant to start production,\" an official had told ET at the time.Pragada said that the company is now also working with Kaynes Semicon, which recently received approval for an OSAT facility in Gujarat. Mysuru-based Kaynes Semicon is investing in an OSAT facility in Sanand, Gujarat too.","cleaned_content":"engineering services company jacobs is seeing huge opportunities in india which includes sharpening its focus on the semiconductor sector as more downstream industries of the supply chain are beginning to set up shop in india along with emergence of large chip fabrication units and chip assembly facilities in the country it is also gung ho on its data center business as hyperscalers are rapidly expanding in the country bob pragada jacobs global ceo told et in an interview that the company was in active consultation with four of the five chip projects that had received approval from the government with cg power and the tata group however he said jacobs was in a full engagement role jacobs in itself is partnering with cg power for its osat facility in sanand pragada said the facility is a critical packaging test and assembly partner to renesas and said the pilot plant is in the field in construction and that the company was still in design for the main facility while adding that the project was progressing very fast in august et was the first to report that the murugappa group firm had onboarded the leading global facilities management firm to build its upcoming chip assembly plant in sanand gujarat getting jacobs as a turnkey contractor which is dubbed as the worlds best in building fabs since all leading fabs globally by top chipmakers such as intel and tsmc are done by them meant that cg power may be the fastest chip assembly plant to start production an official had told et at the time pragada said that the company is now also working with kaynes semicon which recently received approval for an osat facility in gujarat mysuru based kaynes semicon is investing in an osat facility in sanand gujarat too","timestamp":"2024-09-12T13:39:00+05:30","market_timestamp":"2024-09-12T13:39:00+05:30","off_market_hours":false}