{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-boosts-warehouse-worker-pay-by-at-least-1-50-an-hour/articleshow/113465008.cms","title":"Amazon boosts warehouse worker pay by at least $1.50 an hour","description":"Employees will start receiving Prime, Amazon’s speedy shipping and video subscription service, as part of their compensation beginning early next year, the company said. The additional investment in pay and benefits, $2.2 billion, is the company’s largest, logistics chief Udit Madan said in the blog.","content":"Amazon.com Inc. is raising the pay of its hourly warehouse workers by at least $1.50 an hour and adding Prime memberships to their benefits. The raises will take effect this month for the hundreds of thousands of employees working for Amazon’s sprawling US logistics operation, boosting the average base wage to more than $22 an hour, the company said in a blog post on Wednesday. The pay bump comes as inflation, though well below its post-pandemic highs, continues to eat away at the value of workers’ paychecks. Employees will start receiving Prime, Amazon’s speedy shipping and video subscription service, as part of their compensation beginning early next year, the company said. The additional investment in pay and benefits, $2.2 billion, is the company’s largest, logistics chief Udit Madan said in the blog. The Seattle-based company tends to announce pay tweaks and seasonal hiring goals ahead of the holiday shopping rush. Last year, Amazon said it would spend $1.3 billion boosting worker wages and benefits. Amazon’s pay rates tend to fall between those of physical retailers — the source of many Amazon recruits — and higher-skilled work in the logistics industry. Walmart Inc.-owned Sam’s Club this week said starting wages would increase by $1, to $16 an hour. Costco Wholesale Corp. raised its starting wage for US workers to $19.50 in July. ","cleaned_content":"amazon com inc is raising the pay of its hourly warehouse workers by at least \u003cONE_\u003e an hour and adding prime memberships to their benefits the raises will take effect this month for the hundreds of thousands of employees working for amazon s sprawling us logistics operation boosting the average base wage to more than \u003cTWO_TEN\u003e an hour the company said in a blog post on wednesday the pay bump comes as inflation though well below its post pandemic highs continues to eat away at the value of workers paychecks employees will start receiving prime amazon s speedy shipping and video subscription service as part of their compensation beginning early next year the company said the additional investment in pay and benefits \u003cTWO_\u003e billion is the company s largest logistics chief udit madan said in the blog the seattle based company tends to announce pay tweaks and seasonal hiring goals ahead of the holiday shopping rush last year amazon said it would spend \u003cONE_\u003e billion boosting worker wages and benefits amazon s pay rates tend to fall between those of physical retailers the source of many amazon recruits and higher skilled work in the logistics industry walmart inc owned sam s club this week said starting wages would increase by \u003cONE_\u003e to \u003cONE_TEN\u003e an hour costco wholesale corp raised its starting wage for us workers to \u003cONE_TEN\u003e in july","timestamp":"2024-09-18T20:58:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}