{"url":"https://economictimes.indiatimes.com/tech/technology/india-a-key-priority-market-reels-biz-messaging-supercharging-growth-metas-devanathan/articleshow/113367890.cms","title":"India a key priority market; Reels, biz messaging supercharging growth: Meta's Sandhya Devanathan","description":"In an interview with PTI, Meta India vice president Sandhya Devanathan said India is the leading market for short-form video Reels' watch-time on Instagram. The Facebook and Instagram parent Meta is upbeat about the pace and extent to which Reels has caught on with creators and brands alike.","content":"Social media giant Meta counts India among its key priority markets globally, as the rising popularity of its offerings - from Reels to business messaging - and increased engagement on AI tools is supercharging growth, according to Meta India vice president Sandhya Devanathan. In an interview with PTI, Devanathan said India is the leading market for short-form video Reels' watch-time on Instagram. The Facebook and Instagram parent Meta is upbeat about the pace and extent to which Reels has caught on with creators and brands alike. \"Reels is big for Meta globally, but Reels is certainly huge for Meta in India,\" Devanathan said. Having recognised the power of Reels in influencing buying decisions, brands are including it early in their campaign blueprint and customer outreach plans, Devanathan said. According to her, Reels is now in the consideration set for brands as they conceptualise their campaigns, marking a big shift in the way campaigns are being designed. \"Not only are we seeing the medium exploding in terms of consumption on our platform, but we are seeing brands and creators make use of that to get outcomes they want with their businesses and audiences,\" she said. ","cleaned_content":"social media giant meta counts india among its key priority markets globally as the rising popularity of its offerings from reels to business messaging and increased engagement on ai tools is supercharging growth according to meta india vice president sandhya devanathan in an interview with pti devanathan said india is the leading market for short form video reels watch time on instagram the facebook and instagram parent meta is upbeat about the pace and extent to which reels has caught on with creators and brands alike reels is big for meta globally but reels is certainly huge for meta in india devanathan said having recognised the power of reels in influencing buying decisions brands are including it early in their campaign blueprint and customer outreach plans devanathan said according to her reels is now in the consideration set for brands as they conceptualise their campaigns marking a big shift in the way campaigns are being designed not only are we seeing the medium exploding in terms of consumption on our platform but we are seeing brands and creators make use of that to get outcomes they want with their businesses and audiences she said","timestamp":"2024-09-15T16:41:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}