{"url":"https://economictimes.indiatimes.com/tech/technology/fda-authorizes-first-otc-hearing-aid-software-to-be-used-in-apples-airpods-pro/articleshow/113310974.cms","title":"FDA authorizes first OTC hearing aid software to be used in Apple's AirPods Pro","description":"The U.S. FDA has authorized the first over-the-counter hearing aid software for Apple AirPods Pro headphones. This new feature, available this fall, will allow users to customize their AirPods Pro 2 into personalized hearing aids, enhancing specific sounds for those with mild-to-moderate hearing impairment.","content":"The U.S. Food and Drug Administration on Thursday authorized the first over-the-counter hearing aid software that is intended to be used with compatible versions of the Apple AirPods Pro headphones. Earlier this week, Apple said its AirPods Pro 2 could now be \"transformed\" into a personalized hearing aid via an upcoming software update that would boost specific sounds in real time, including parts of speech or elements within a user's environment. New hearing health features will be available this fall for AirPods Pro 2 users in more than 100 countries and regions, Apple had said. Once installed and customized to the user's hearing needs, the software enables versions of the AirPods Pro to serve as an OTC hearing aid, that is intended to amplify sounds for 18 years or older people with perceived mild-to-moderate hearing impairment, the health regulator said. \"Hearing loss is a significant public health issue impacting millions of Americans,\" said Michelle Tarver, acting director of the FDA's Center for Devices and Radiological Health.","cleaned_content":"the u s food and drug administration on thursday authorized the first over the counter hearing aid software that is intended to be used with compatible versions of the apple airpods pro headphones earlier this week apple said its airpods pro \u003cTWO_\u003e could now be transformed into a personalized hearing aid via an upcoming software update that would boost specific sounds in real time including parts of speech or elements within a users environment new hearing health features will be available this fall for airpods pro \u003cTWO_\u003e users in more than \u003cONE_HUNDRED\u003e countries and regions apple had said once installed and customized to the users hearing needs the software enables versions of the airpods pro to serve as an otc hearing aid that is intended to amplify sounds for \u003cONE_TEN\u003e years or older people with perceived mild to moderate hearing impairment the health regulator said hearing loss is a significant public health issue impacting millions of americans said michelle tarver acting director of the fdas center for devices and radiological health","timestamp":"2024-09-13T10:09:00+05:30","market_timestamp":"2024-09-13T10:09:00+05:30","off_market_hours":false}