{"url":"https://economictimes.indiatimes.com/tech/technology/flipkarts-big-billion-day-amazons-annual-sale-to-kick-off-from-september-27/articleshow/113396574.cms","title":"Flipkart's Big Billion Days, Amazon's annual festive sale to kick off from September 27","description":"Flipkart's flagship sale, The Big Billion Days, is an important event for the company, and brings in a substantial portion of the its annual sales, much like it does for its competitors and other businesses in general. This year, quick commerce platforms like Zepto-owned Blinkit, Instamart and Mumbai-based Zepto are also preparing for an action-packed Diwali.","content":"Ecommerce majors Amazon India and Walmart-owned Flipkart are set to kick off their annual festival season sales from September 27.Flipkart's flagship sale, The Big Billion Days, is a key event, contributing a substantial portion of the company's annual sales, much like it does for its competitors and other businesses in general.Flipkart Plus and VIP members who are part of the loyalty programme which offers extra benefits to its members, will get early access to the sale a day before others, as in the past. Similarly, Amazon Prime customers, who get benefits like free deliveries through paid subscription, will also benefit from early access. Ahead of the festive season, Flipkart has expanded its nationwide supply chain network by launching 11 new fulfilment centers across India, covering more than 1.3 million square feet, to accommodate the rising demand, the platform said in a statement.“As India’s festive season begins, we remain committed to creating value for the entire nation - from customers seeking affordability to sellers and local manufacturers scaling their reach. This year’s ‘The Big Billion Days’ will once again redefine the possibilities of e-commerce by driving inclusivity, innovation and sustainable growth across the board,” Flipkart group chief executive Kalyan Krishnamurthy said.","cleaned_content":"ecommerce majors amazon india and walmart owned flipkart are set to kick off their annual festival season sales from september \u003cTWO_TEN\u003e flipkarts flagship sale the big billion days is a key event contributing a substantial portion of the companys annual sales much like it does for its competitors and other businesses in general flipkart plus and vip members who are part of the loyalty programme which offers extra benefits to its members will get early access to the sale a day before others as in the past similarly amazon prime customers who get benefits like free deliveries through paid subscription will also benefit from early access ahead of the festive season flipkart has expanded its nationwide supply chain network by launching \u003cONE_TEN\u003e new fulfilment centers across india covering more than \u003cONE_\u003e million square feet to accommodate the rising demand the platform said in a statement as india s festive season begins we remain committed to creating value for the entire nation from customers seeking affordability to sellers and local manufacturers scaling their reach this year s the big billion days will once again redefine the possibilities of e commerce by driving inclusivity innovation and sustainable growth across the board flipkart group chief executive kalyan krishnamurthy said","timestamp":"2024-09-16T18:45:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}