{"url":"https://economictimes.indiatimes.com/tech/technology/kiranas-are-here-to-stay-despite-growing-quick-commerce-adoption-bigbaskets-hari-menon/articleshow/113518528.cms","title":"Kiranas are here to stay despite growing quick commerce adoption: BigBasket’s Hari Menon","description":"BigBasket CEO Hari Menon stated that kirana stores will remain relevant despite the rise of quick commerce. Speaking at the ET Soonicorns Summit, he highlighted that customers now prefer speed over price in grocery shopping. BigBasket has shifted to a quick commerce model, meeting the growing demand for rapid deliveries.","content":"BigBasket cofounder and chief executive Hari Menon said that kirana stories won’t go away even as people embrace the convenience of quick commerce. Speaking at the ET Soonicorns Summit in Bengaluru on Friday, Menon said, “Kiranas are here to stay. They give you convenience and credit. Kirana stores will start becoming more efficient and will start delivering to homes. They won’t have an app but for now, they’ll deliver efficiently.”Menon said he was “in complete denial” about the quick commerce model. “Gladly, I have been proven wrong… Customers are lapping it up - speed is something that the customers are absolutely loving, specifically talking about grocery,” he said.BigBasket, the largest e-grocer known for slotted deliveries, has pivoted to a full-scale quick commerce platform as the sector sees rising demand for rapid deliveries, ET reported on August 27.On the changing landscape in the quick commerce sector, Menon said that consumers now prefer speed over price.","cleaned_content":"bigbasket cofounder and chief executive hari menon said that kirana stories won t go away even as people embrace the convenience of quick commerce speaking at the et soonicorns summit in bengaluru on friday menon said kiranas are here to stay they give you convenience and credit kirana stores will start becoming more efficient and will start delivering to homes they won t have an app but for now they ll deliver efficiently menon said he was in complete denial about the quick commerce model gladly i have been proven wrong customers are lapping it up speed is something that the customers are absolutely loving specifically talking about grocery he said bigbasket the largest e grocer known for slotted deliveries has pivoted to a full scale quick commerce platform as the sector sees rising demand for rapid deliveries et reported on august \u003cTWO_TEN\u003e on the changing landscape in the quick commerce sector menon said that consumers now prefer speed over price","timestamp":"2024-09-21T14:19:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}