{"url":"https://economictimes.indiatimes.com/tech/technology/malaysian-fintech-major-tng-digital-eyes-ipo-in-next-2-3-years/articleshow/113545579.cms","title":"Malaysian fintech major TNG Digital eyes IPO in next 2-3 years","description":"TNG Digital could potentially fetch the valuation of a unicorn - a startup with a market value of $1 billion or more - before the potential IPO, the sources added.","content":"Malaysia's largest fintech company TNG Digital is looking at a potential domestic initial public offering over the next two to three years that could raise over $300 million, two sources with knowledge of the matter said. TNG Digital could potentially fetch the valuation of a unicorn - a startup with a market value of $1 billion or more - before the potential IPO, the sources added. The current valuation of TNG Digital was not immediately certain. The Kuala Lumpur-headquartered company raised 750 million ringgit ($179.30 million) from an equity funding round in 2022 led by investors Lazada and parent Touch 'n Go, according to press release at that time.  Lazada is part of Chinese technology giant Alibaba Group, while Touch 'n Go in turn is an indirect unit of Malaysia's second largest bank CIMB Group. Other investors include AIA and Ant Financial. TNG Digital was established via a strategic partnership between Touch 'n Go and Ant Financial in 2017, according to its website. ","cleaned_content":"malaysias largest fintech company tng digital is looking at a potential domestic initial public offering over the next two to three years that could raise over \u003cTHREE_HUNDRED\u003e million two sources with knowledge of the matter said tng digital could potentially fetch the valuation of a unicorn a startup with a market value of \u003cONE_\u003e billion or more before the potential ipo the sources added the current valuation of tng digital was not immediately certain the kuala lumpur headquartered company raised \u003cSEVEN_HUNDRED\u003e million ringgit \u003cONE_HUNDRED\u003e million from an equity funding round in \u003cTWO_THOUSAND\u003e led by investors lazada and parent touch n go according to press release at that time lazada is part of chinese technology giant alibaba group while touch n go in turn is an indirect unit of malaysias second largest bank cimb group other investors include aia and ant financial tng digital was established via a strategic partnership between touch n go and ant financial in \u003cTWO_THOUSAND\u003e according to its website","timestamp":"2024-09-21T13:16:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}