{"url":"https://economictimes.indiatimes.com/tech/technology/india-presents-exciting-opportunity-world-moving-into-an-indian-era-salesforce-chairman/articleshow/113447889.cms","title":"India presents exciting opportunity, world moving into an Indian era: Salesforce chairman","description":"Salesforce CEO Marc Benioff highlighted India's growing significance, calling it an 'Indian era' at the Dreamforce event. The company has over 11,000 employees in India and is investing aggressively. Salesforce launched 'Agentforce,' an autonomous AI solution, aiming to revolutionize customer service and other functions.","content":"Customer relationship management-focused Salesforce's chairman and chief executive Marc Benioff has said the world is moving into an \"Indian era\".  Speaking to reporters on the sidelines of the annual \"Dreamforce\" event here, Benioff said the opportunities in India are \"exciting\" and the company has invested in the country aggressively.  \"You can see that the world is moving into the Indian era. There is no question that we are going to move into an incredible moment in India,\" he said.  The city-headquartered global company which is aiming to close FY25 with a revenue of USD 38 billion has over 11,000 employees in the country. A bulk of the employee base serves the global client base, while the increasing adoption of digital technologies has made India business also grow.  \"We do all kinds of things in India including engineering and support but also we go to market in India,\" Benioff said, adding that it serves large customers like the auto major Bajaj group. ","cleaned_content":"customer relationship management focused salesforces chairman and chief executive marc benioff has said the world is moving into an indian era speaking to reporters on the sidelines of the annual dreamforce event here benioff said the opportunities in india are exciting and the company has invested in the country aggressively you can see that the world is moving into the indian era there is no question that we are going to move into an incredible moment in india he said the city headquartered global company which is aiming to close fy25 with a revenue of usd \u003cTHREE_TEN\u003e billion has over \u003cONE_TEN_THOUSAND\u003e employees in the country a bulk of the employee base serves the global client base while the increasing adoption of digital technologies has made india business also grow we do all kinds of things in india including engineering and support but also we go to market in india benioff said adding that it serves large customers like the auto major bajaj group","timestamp":"2024-09-18T12:06:00+05:30","market_timestamp":"2024-09-18T12:06:00+05:30","off_market_hours":false}