{"url":"https://economictimes.indiatimes.com/tech/technology/videogame-firms-hit-with-eu-complaint-over-tricking-consumers/articleshow/113275628.cms","title":"Videogame firms hit with EU complaint over 'tricking consumers'","description":"Videogame companies Epic Games, Electronic Arts, Roblox, and others face an EU consumer complaint for allegedly misleading gamers into spending money. The European Consumer Organisation and its members claim that these companies exploit children's vulnerability to encourage excessive spending on in-game currencies. The complaint was filed with the European Commission and the European Network of Consumer Authorities.","content":"Videogame companies Epic Games, Electronic Arts, Roblox and four others were hit with an EU consumer complaint on Thursday accusing them of misleading gamers into spending money. The move came amid rising concerns about children turning into gaming addicts, with some parents claiming videogame makers intentionally designed products that caused them to become addicted to games. The European Consumer Organisation (BEUC) and 22 of its members across Europe including in France, Germany, Italy and Spain filed a complaint on Thursday with the European Commission and the European Network of Consumer Authorities. \"BEUC's members have identified numerous cases where gamers are misled into spending money. Regulators must act, making it clear that even though the gaming world is virtual, it still needs to abide by real-world rules,\" BEUC Director General Agustin Reyna said in a statement. \"Today, premium in-game currencies are purposefully tricking consumers and take a big toll on children. Companies are well aware of children's vulnerability and use tricks to lure younger consumers into spending more,\" he said.","cleaned_content":"videogame companies epic games electronic arts roblox and four others were hit with an eu consumer complaint on thursday accusing them of misleading gamers into spending money the move came amid rising concerns about children turning into gaming addicts with some parents claiming videogame makers intentionally designed products that caused them to become addicted to games the european consumer organisation beuc and \u003cTWO_TEN\u003e of its members across europe including in france germany italy and spain filed a complaint on thursday with the european commission and the european network of consumer authorities beucs members have identified numerous cases where gamers are misled into spending money regulators must act making it clear that even though the gaming world is virtual it still needs to abide by real world rules beuc director general agustin reyna said in a statement today premium in game currencies are purposefully tricking consumers and take a big toll on children companies are well aware of childrens vulnerability and use tricks to lure younger consumers into spending more he said","timestamp":"2024-09-12T09:01:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}