{"url":"https://economictimes.indiatimes.com/tech/technology/the-chinese-chipmaker-at-the-heart-of-the-us-china-tech-war/articleshow/113418484.cms","title":"The Chinese chipmaker at the heart of the US-China tech war","description":"Whether China can advance and outrace the United States technologically now hinges on SMIC, a partly state-backed company that is the sole maker of advanced chips in the country and has become its de facto national semiconductor champion. SMIC pumps out millions of chips a month for other companies that design them, such as Huawei, the Chinese tech firm under U.S. sanctions, as well as U.S. firms such as Qualcomm.","content":"In a sprawling factory in eastern Shanghai, where marshy plains have long since been converted into industrial parks, China's most advanced chipmaker has been hard at work testing the limits of U.S. authority. Semiconductor Manufacturing International Corp., or SMIC, is manufacturing chips with features less than one-15,000th of the thickness of a sheet of paper. The chips pack together enough computing power to create advancements such as artificial intelligence and 5G networks. It's a feat that has been achieved by just a few companies globally -- and one that has landed SMIC in the middle of a crucial geopolitical rivalry. U.S. officials say such advanced chip technology is central not just to commercial businesses but also to military superiority. They have been fighting to keep it out of Chinese hands, by barring China from buying both the world's most cutting-edge chips and the machinery to make them. Whether China can advance and outrace the United States technologically now hinges on SMIC, a partly state-backed company that is the sole maker of advanced chips in the country and has become its de facto national semiconductor champion. SMIC pumps out millions of chips a month for other companies that design them, such as Huawei, the Chinese technology firm under U.S. sanctions, as well as U.S. firms such as Qualcomm. So far, SMIC hasn't been able to produce chips as advanced as those of rivals such as Taiwan Semiconductor Manufacturing Co. in Taiwan, or others in South Korea and the United States. But it is racing forward with a new AI chip for Huawei called the Ascend 910C, which is expected to be released this year.","cleaned_content":"in a sprawling factory in eastern shanghai where marshy plains have long since been converted into industrial parks chinas most advanced chipmaker has been hard at work testing the limits of u s authority semiconductor manufacturing international corp or smic is manufacturing chips with features less than one \u003cONE_TEN_THOUSAND\u003e th of the thickness of a sheet of paper the chips pack together enough computing power to create advancements such as artificial intelligence and \u003cFIVE_\u003e g networks its a feat that has been achieved by just a few companies globally and one that has landed smic in the middle of a crucial geopolitical rivalry u s officials say such advanced chip technology is central not just to commercial businesses but also to military superiority they have been fighting to keep it out of chinese hands by barring china from buying both the worlds most cutting edge chips and the machinery to make them whether china can advance and outrace the united states technologically now hinges on smic a partly state backed company that is the sole maker of advanced chips in the country and has become its de facto national semiconductor champion smic pumps out millions of chips a month for other companies that design them such as huawei the chinese technology firm under u s sanctions as well as u s firms such as qualcomm so far smic hasnt been able to produce chips as advanced as those of rivals such as taiwan semiconductor manufacturing co in taiwan or others in south korea and the united states but it is racing forward with a new ai chip for huawei called the ascend \u003cNINE_HUNDRED\u003e c which is expected to be released this year","timestamp":"2024-09-17T20:47:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}