{"url":"https://economictimes.indiatimes.com/tech/technology/crypto-firm-circle-to-move-headquarters-to-new-york-city-ahead-of-planned-ipo/articleshow/113329821.cms","title":"Crypto firm Circle to move headquarters to New York City ahead of planned IPO","description":"Circle's move to New York City is another sign that the cryptocurrency industry is looking to become more enmeshed with traditional finance. Companies like Goldman Sachs and BlackRock are also headquartered in the Big Apple.","content":"Circle Internet Financial, the company behind stablecoin USDC, is moving its global corporate headquarters from Boston to New York City, after filing confidentially earlier this year for a U.S. initial public offering.  Circle plans to open its new headquarters in One World Trade Center in early 2025, the company said Friday. Why it's important Circle's move to New York City is another sign that the cryptocurrency industry is looking to become more enmeshed with traditional finance. Companies like Goldman Sachs and BlackRock are also headquartered in the Big Apple.  Cryptocurrencies like bitcoin have become more popular as token prices have soared to new highs and as exchange-traded funds tracking their prices have hit the U.S. market this year.","cleaned_content":"circle internet financial the company behind stablecoin usdc is moving its global corporate headquarters from boston to new york city after filing confidentially earlier this year for a u s initial public offering circle plans to open its new headquarters in one world trade center in early \u003cTWO_THOUSAND\u003e the company said friday why its important circles move to new york city is another sign that the cryptocurrency industry is looking to become more enmeshed with traditional finance companies like goldman sachs and blackrock are also headquartered in the big apple cryptocurrencies like bitcoin have become more popular as token prices have soared to new highs and as exchange traded funds tracking their prices have hit the u s market this year","timestamp":"2024-09-13T20:18:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}