{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-faces-crucial-court-hearing-that-could-decide-fate-in-us/articleshow/113323849.cms","title":"TikTok faces crucial court hearing that could decide fate in US","description":"The US Court of Appeals for the District of Columbia will hold oral arguments on the legal challenge, putting the fate of Chinese-owned TikTok in the middle of the final weeks of the 2024 presidential election.","content":"TikTok and parent company ByteDance face a key court hearing on Monday in a legal battle seeking to block a law that could ban the app used by 170 million Americans as soon as Jan. 19. The US Court of Appeals for the District of Columbia will hold oral arguments on the legal challenge, putting the fate of Chinese-owned TikTok in the middle of the final weeks of the 2024 presidential election. Both Republican presidential candidate Donald Trump and Vice President Kamala Harris are active on TikTok seeking to court younger voters. TikTok and ByteDance argue the law is unconstitutional and violates Americans' free speech rights saying it is \"a radical departure from this country's tradition of championing an open Internet.\" Driven by worries among US lawmakers that China could access data on Americans or spy on them with the app, the measure was passed overwhelmingly in the US Congress in April just weeks after being introduced.","cleaned_content":"tiktok and parent company bytedance face a key court hearing on monday in a legal battle seeking to block a law that could ban the app used by \u003cONE_HUNDRED\u003e million americans as soon as jan \u003cONE_TEN\u003e the us court of appeals for the district of columbia will hold oral arguments on the legal challenge putting the fate of chinese owned tiktok in the middle of the final weeks of the \u003cTWO_THOUSAND\u003e presidential election both republican presidential candidate donald trump and vice president kamala harris are active on tiktok seeking to court younger voters tiktok and bytedance argue the law is unconstitutional and violates americans free speech rights saying it is a radical departure from this countrys tradition of championing an open internet driven by worries among us lawmakers that china could access data on americans or spy on them with the app the measure was passed overwhelmingly in the us congress in april just weeks after being introduced","timestamp":"2024-09-13T16:19:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}