{"url":"https://economictimes.indiatimes.com/tech/technology/finnish-politician-tapped-as-eu-digital-chief-to-oversee-big-tech/articleshow/113449192.cms","title":"Finnish politician tapped as EU digital chief to oversee big tech","description":"Finnish Prime Minister Petteri Orpo said Virkkunen's nomination as the executive vice-president for tech sovereignty, security and democracy was perfect for Finland, home to Nokia and Angry Birds maker Rovio, which was acquired by Japan's Sega Sammy Holdings last year.","content":"Finnish centre-right politician Henna Virkkunen was nominated on Tuesday as the new EU digital chief to ensure that Big Tech abides by European Union rules and that the bloc can catch up with the United States and China in key technologies. Virkkunen, 52, a marathon runner and triathlon athlete, has been a member of the European Parliament since 2014. Prior to that, she was a minister in Finland, holding portfolios ranging from education to public administration to transport. Finnish Prime Minister Petteri Orpo said Virkkunen's nomination as the executive vice-president for tech sovereignty, security and democracy was perfect for Finland, home to Nokia and Angry Birds maker Rovio, which was acquired by Japan's Sega Sammy Holdings last year. The portfolio has great potential to influence Finland's two most important priorities, namely security and competitiveness, Orpo told reporters during a visit in Stockholm. \"In the coming years Europe needs to focus on strengthening our security and prosperity. As Executive Vice-President I will contribute to these very goals,\" Virkkunen said in a statement.","cleaned_content":"finnish centre right politician henna virkkunen was nominated on tuesday as the new eu digital chief to ensure that big tech abides by european union rules and that the bloc can catch up with the united states and china in key technologies virkkunen \u003cFIVE_TEN\u003e a marathon runner and triathlon athlete has been a member of the european parliament since \u003cTWO_THOUSAND\u003e prior to that she was a minister in finland holding portfolios ranging from education to public administration to transport finnish prime minister petteri orpo said virkkunens nomination as the executive vice president for tech sovereignty security and democracy was perfect for finland home to nokia and angry birds maker rovio which was acquired by japans sega sammy holdings last year the portfolio has great potential to influence finlands two most important priorities namely security and competitiveness orpo told reporters during a visit in stockholm in the coming years europe needs to focus on strengthening our security and prosperity as executive vice president i will contribute to these very goals virkkunen said in a statement","timestamp":"2024-09-18T12:39:00+05:30","market_timestamp":"2024-09-18T12:39:00+05:30","off_market_hours":false}