{"url":"https://economictimes.indiatimes.com/tech/technology/india-will-play-a-major-role-in-driving-the-global-semiconductor-industry-pm-modi/articleshow/113257790.cms","title":"India will play a major role in driving the global semiconductor industry: PM Modi","description":"“In 21st century Bharat, the chips are never down. Today’s Bharat assures the world that when the chips are down, you can bet on India,” Modi said. India is only the eighth country in the world to host a gathering of the global semiconductor industry, he said, adding that it is the right time to be in India.","content":"It is now the age of silicon diplomacy, prime minister Narendra Modi said at the Semicon India industry conference in Greater Noida on Wednesday adding that India will play a major role in driving the global semiconductor industry and the mission to create a resilient global supply chain amid disruptions. He highlighted India’s growing partnerships with countries like the US, Japan and Singapore in the semiconductor sector.“In 21st century Bharat, the chips are never down. Today’s Bharat assures the world that when the chips are down, you can bet on India,” Modi said.India aims to expand the $150 billion electronics sector to reach over $500 billion by the end of the decade, creating more than six million jobs, he noted.India is only the eighth country in the world to host a gathering of the global semiconductor industry, he said, adding that it is the right time to be in India.Energy flows both ways in the diodes of India’s semiconductor industry, he added. “You invest and create value, the government will provide stable policies and ease of doing business.”","cleaned_content":"it is now the age of silicon diplomacy prime minister narendra modi said at the semicon india industry conference in greater noida on wednesday adding that india will play a major role in driving the global semiconductor industry and the mission to create a resilient global supply chain amid disruptions he highlighted india s growing partnerships with countries like the us japan and singapore in the semiconductor sector in \u003cTWO_TEN\u003e st century bharat the chips are never down today s bharat assures the world that when the chips are down you can bet on india modi said india aims to expand the \u003cONE_HUNDRED\u003e billion electronics sector to reach over \u003cFIVE_HUNDRED\u003e billion by the end of the decade creating more than six million jobs he noted india is only the eighth country in the world to host a gathering of the global semiconductor industry he said adding that it is the right time to be in india energy flows both ways in the diodes of india s semiconductor industry he added you invest and create value the government will provide stable policies and ease of doing business","timestamp":"2024-09-11T15:35:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}