{"url":"https://economictimes.indiatimes.com/tech/technology/uber-reintroduces-black-a-look-at-its-ten-year-product-journey-in-india/articleshow/113247949.cms","title":"Uber reintroduces Black: A look at its ten-year product journey in India","description":"Uber is reintroducing its premium service Uber Black in India after nearly a decade. This move aligns with the rising demand for luxury services among Indian consumers. Uber's journey in India includes various expansions and adaptations, such as cash payments, ride-sharing, bike taxis, food delivery, and electric vehicle services.","content":"Ride-hailing platform Uber has announced it is bringing back its flagship premium service Uber Black to India after a hiatus of almost ten years. Reintroduction of Uber Black in the Indian market aligns with the growing demand for luxury and high-end services among consumers.Uber's ten-year journey in India has been marked by expansion into products beyond its core on-demand ride-hailing and adaptation to local needs. Here's how Uber’s product journey has been in what is among its biggest market globally.2013: Uber starts operations in India. Launches first product in Bengaluru targeted at premium consumer with only credit card payment options.2014: Expands service to Delhi, Mumbai, Hyderabad and Chennai with entry level product Uber Go. Uber Black operations suspended.","cleaned_content":"ride hailing platform uber has announced it is bringing back its flagship premium service uber black to india after a hiatus of almost ten years reintroduction of uber black in the indian market aligns with the growing demand for luxury and high end services among consumers ubers ten year journey in india has been marked by expansion into products beyond its core on demand ride hailing and adaptation to local needs heres how uber s product journey has been in what is among its biggest market globally 2013 uber starts operations in india launches first product in bengaluru targeted at premium consumer with only credit card payment options 2014 expands service to delhi mumbai hyderabad and chennai with entry level product uber go uber black operations suspended","timestamp":"2024-09-11T11:19:00+05:30","market_timestamp":"2024-09-11T11:19:00+05:30","off_market_hours":false}