{"url":"https://economictimes.indiatimes.com/tech/technology/update-makes-x-available-again-to-many-in-brazil/articleshow/113478848.cms","title":"Update makes X available again to many in Brazil","description":"Social-media platform X became accessible to many users in Brazil after an update circumvented a Supreme Court block order. The update used third-party cloud services, allowing access without a VPN. The number of users accessing X is unknown. Anatel is working to notify providers to block access again.","content":"Social-media platform X became accessible to many users in Brazil on Wednesday as an update to its communications network circumvented a block order by the country's Supreme Court. The X update used cloud services offered by third parties, allowing some Brazilian users to take a route outside of the country to reach X, even without a virtual private network, according to Abrint, the Brazilian Association of Internet and Telecommunications Providers. The number of Brazilians accessing X is unknown, according to Abrint. X did not immediately reply to a request for comment.  \"I believe the change was probably intentional. Why would X use a third-party service that ends up being slower than its own?\" Basilio Perez, a board member at Abrint, told Reuters.","cleaned_content":"social media platform x became accessible to many users in brazil on wednesday as an update to its communications network circumvented a block order by the countrys supreme court the x update used cloud services offered by third parties allowing some brazilian users to take a route outside of the country to reach x even without a virtual private network according to abrint the brazilian association of internet and telecommunications providers the number of brazilians accessing x is unknown according to abrint x did not immediately reply to a request for comment i believe the change was probably intentional why would x use a third party service that ends up being slower than its own basilio perez a board member at abrint told reuters","timestamp":"2024-09-19T10:49:00+05:30","market_timestamp":"2024-09-19T10:49:00+05:30","off_market_hours":false}