{"url":"https://economictimes.indiatimes.com/tech/technology/india-probe-finds-amazon-walmarts-flipkart-breached-antitrust-laws/articleshow/113299330.cms","title":"India probe finds Amazon, Walmart's Flipkart breached antitrust laws","description":"In a 1027-page report on Amazon and a separate 1,696-page report on Flipkart, both dated Aug. 9, the CCI investigators said the two companies were found to have created an ecosystem where preferred sellers appeared higher in search results, elbowing out other sellers.","content":"An Indian antitrust investigation has found U.S. e-commerce giant Amazon and Walmart's Flipkart violated local competition laws by giving preference to select sellers on their shopping websites, according to confidential reports seen by Reuters. The Competition Commission of India (CCI) in 2020 ordered an investigation into Amazon and Flipkart for allegedly promoting certain sellers with which they had business arrangements and giving priority to certain listings. In a 1027-page report on Amazon and a separate 1,696-page report on Flipkart, both dated Aug. 9, the CCI investigators said the two companies were found to have created an ecosystem where preferred sellers appeared higher in search results, elbowing out other sellers. \"Each of the anti-competitive practices alleged ... were investigated and found to be true,\" said both reports, which are not public and are being reported by Reuters for the first time. \"Ordinary sellers remained as mere database entries,\" the two reports said in identical conclusions on both companies.","cleaned_content":"an indian antitrust investigation has found u s e commerce giant amazon and walmarts flipkart violated local competition laws by giving preference to select sellers on their shopping websites according to confidential reports seen by reuters the competition commission of india cci in \u003cTWO_THOUSAND\u003e ordered an investigation into amazon and flipkart for allegedly promoting certain sellers with which they had business arrangements and giving priority to certain listings in a \u003cONE_THOUSAND\u003e page report on amazon and a separate \u003cONE_THOUSAND\u003e page report on flipkart both dated aug \u003cNINE_\u003e the cci investigators said the two companies were found to have created an ecosystem where preferred sellers appeared higher in search results elbowing out other sellers each of the anti competitive practices alleged were investigated and found to be true said both reports which are not public and are being reported by reuters for the first time ordinary sellers remained as mere database entries the two reports said in identical conclusions on both companies","timestamp":"2024-09-12T21:26:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}