{"url":"https://economictimes.indiatimes.com/tech/technology/every-flight-you-take-every-call-you-make-theyre-tracking-you/articleshow/113236852.cms","title":"Every flight you take, every call you make... they’re tracking you","description":"Your data can be exchanged for as little as Rs 150-Rs 300 by informants who sell \"datasets\" to employees at call centres, BPOs, or telemarketers, as per an investigation by ET. Digital privacy experts point to multiple sources of data leaks that feed this proliferating industry.","content":"The flight you took recently, the broadband connection you requested, the car insurance that is expiring soon, the apartment you sold, or even the mutual fund you invested in, are all turning into a fair game for data collectors.Such information can be exchanged for as little as Rs 150-Rs 300 by informants who sell such “datasets” to employees at call centres, BPOs, or telemarketers, an investigation by ET revealed.Take the case of 22 year-old Rishabh Shukla, (name changed) who reports at his desk at a telemarketing company at 9 a.m every morning. He is given a sheet of 70-100 phone numbers of people who have recently sold, purchased or rented an apartment in one of Noida’s residential complexes.The diligent Shukla calls these numbers day in and day out. Within a month, he identified 13 leads of customers who bought, sold or rented property through brokers. Shukla received an incentive of Rs. 5,000 in addition to his fixed salary of Rs. 8,000 per month for his efforts.“But soon, this list started drying up, and I got used to the incentives,” said Shukla, adding that “I started going to every new apartment complex in Noida, tipped off the security guards, and took pictures of visitors' registers to generate new leads.”","cleaned_content":"the flight you took recently the broadband connection you requested the car insurance that is expiring soon the apartment you sold or even the mutual fund you invested in are all turning into a fair game for data collectors such information can be exchanged for as little as rs \u003cONE_HUNDRED\u003e rs \u003cTHREE_HUNDRED\u003e by informants who sell such datasets to employees at call centres bpos or telemarketers an investigation by et revealed take the case of \u003cTWO_TEN\u003e year old rishabh shukla name changed who reports at his desk at a telemarketing company at \u003cNINE_\u003e a m every morning he is given a sheet of \u003cSEVEN_TEN\u003e \u003cONE_HUNDRED\u003e phone numbers of people who have recently sold purchased or rented an apartment in one of noida s residential complexes the diligent shukla calls these numbers day in and day out within a month he identified \u003cONE_TEN\u003e leads of customers who bought sold or rented property through brokers shukla received an incentive of rs \u003cFIVE_THOUSAND\u003e in addition to his fixed salary of rs \u003cEIGHT_THOUSAND\u003e per month for his efforts but soon this list started drying up and i got used to the incentives said shukla adding that i started going to every new apartment complex in noida tipped off the security guards and took pictures of visitors registers to generate new leads","timestamp":"2024-09-12T16:46:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}