{"url":"https://economictimes.indiatimes.com/tech/technology/paytm-aims-for-profitability-with-compliance-first-approach-vijay-shekhar-sharma-at-agm/articleshow/113281533.cms","title":"Paytm aims for profitability with 'compliance-first' approach: Vijay Shekhar Sharma at AGM","description":"Paytm founder Vijay Shekhar Sharma announced at the company's 24th annual general meeting that they aim to achieve profitability soon. The company will strictly adhere to regulatory guidelines and adopt a compliance-first approach. Paytm plans to expand its merchant network and build cross-sell capabilities around financial services like loans, mutual funds, and insurance products.","content":"Paytm will try to achieve profitability soon, founder Vijay Shekhar Sharma said at the company’s 24th annual general meeting. While Sharma has been committed to turning Paytm towards the path of profitability for sometime now, he did not commit to any timeline during the meeting.Sharma further said that the digital payments company will adhere to regulatory guidelines strictly, and adopt a ‘compliance-first approach’.Paytm’s associate entity Paytm Payments Bank lost its ability to offer basic banking services to its customers on March 15, after the Reserve Bank of India highlighted major regulatory lapses in its compliance process earlier this year.Sharma said that the company would like to apply for the payment aggregator licence, now that the requisite approvals from the Union government has come in. The central government cleared the foreign direct investment (FDI) into its merchant payments business in July, thereby making it eligible to apply for a payment aggregator licence.Paytm is currently serving around 40 million merchants and has set a target of bringing 100 million small merchants within its network. It will target rickshaw drivers, plumbers and such offering them payment acceptance capabilities, the company said.","cleaned_content":"paytm will try to achieve profitability soon founder vijay shekhar sharma said at the company s \u003cTWO_TEN\u003e th annual general meeting while sharma has been committed to turning paytm towards the path of profitability for sometime now he did not commit to any timeline during the meeting sharma further said that the digital payments company will adhere to regulatory guidelines strictly and adopt a compliance first approach paytm s associate entity paytm payments bank lost its ability to offer basic banking services to its customers on march \u003cONE_TEN\u003e after the reserve bank of india highlighted major regulatory lapses in its compliance process earlier this year sharma said that the company would like to apply for the payment aggregator licence now that the requisite approvals from the union government has come in the central government cleared the foreign direct investment fdi into its merchant payments business in july thereby making it eligible to apply for a payment aggregator licence paytm is currently serving around \u003cFOUR_TEN\u003e million merchants and has set a target of bringing \u003cONE_HUNDRED\u003e million small merchants within its network it will target rickshaw drivers plumbers and such offering them payment acceptance capabilities the company said","timestamp":"2024-09-12T12:00:00+05:30","market_timestamp":"2024-09-12T12:00:00+05:30","off_market_hours":false}