{"url":"https://economictimes.indiatimes.com/tech/technology/meta-faces-hefty-eu-antitrust-fine-over-classified-ads-practices-report/articleshow/113444025.cms","title":"Meta faces hefty EU antitrust fine over classified ads practices: report","description":"Meta Platforms Inc is set to face a significant fine from the EU over allegations of trying to dominate the classified advertising market. The EU claims Meta links its free Marketplace services with Facebook to undermine competitors. A decision could be announced next month, marking one of the last investigations by competition chief Margrethe Vestager.","content":"Meta Platforms Inc is facing a hefty fine in the EU over its alleged efforts to dominate the classified advertising market, the Financial Times reported on Wednesday, citing people familiar with the matter. EU regulators will claim Facebook's parent company links its free Marketplace services with the social network in an effort to undermine its rivals, the newspaper said. The bloc's decision could come as early as next month and would mark one of the final investigations overseen by the EU's outgoing competition chief Margrethe Vestager, the report said. Meta and the bloc did not immediately respond to Reuters requests for comments.","cleaned_content":"meta platforms inc is facing a hefty fine in the eu over its alleged efforts to dominate the classified advertising market the financial times reported on wednesday citing people familiar with the matter eu regulators will claim facebooks parent company links its free marketplace services with the social network in an effort to undermine its rivals the newspaper said the blocs decision could come as early as next month and would mark one of the final investigations overseen by the eus outgoing competition chief margrethe vestager the report said meta and the bloc did not immediately respond to reuters requests for comments","timestamp":"2024-09-18T10:01:00+05:30","market_timestamp":"2024-09-18T10:01:00+05:30","off_market_hours":false}