{"url":"https://economictimes.indiatimes.com/tech/technology/google-meta-microsoft-other-tech-executives-to-testify-before-us-senate-about-election-threats/articleshow/113243508.cms","title":"Google, Meta, Microsoft, other tech executives to testify before US Senate about election threats","description":"Executives from Google, Adobe, Microsoft, and Meta Platforms will testify at a U.S. Senate Intelligence Committee hearing on election threats. The hearing aims to address efforts to combat disinformation and misinformation online related to the upcoming Nov. 5 election between Vice President Kamala Harris and former President Donald Trump.","content":"Executives from major tech firms like Google, Adobe, Microsoft and Meta Platforms will testify next week at a U.S. Senate Intelligence Committee hearing on election threats. Google parent Alphabet's global affairs president Kent Walker, Meta's global affairs president Nick Clegg, Microsoft President Brad Smith and a representative from Adobe will testify at the Sept. 18 hearing, a spokesperson from the office of Senator Mark Warner, who chairs the panel, confirmed. U.S. officials have been attempting to crack down on efforts to spread disinformation and misinformation online surrounding the Nov. 5 election in which Democratic Vice President Kamala Harris and Republican former President Donald Trump will face off. Polls show a tight contest. Previous U.S. intelligence assessments have said that Russia, Iran and China have tried to meddle in American elections, allegations which those nations deny. Those nations have alleged that Washington interferes in their domestic affairs, claims that the U.S. denies. Tech executives have testified previously before the U.S. Congress over election-related hearings in recent years.","cleaned_content":"executives from major tech firms like google adobe microsoft and meta platforms will testify next week at a u s senate intelligence committee hearing on election threats google parent alphabets global affairs president kent walker metas global affairs president nick clegg microsoft president brad smith and a representative from adobe will testify at the sept \u003cONE_TEN\u003e hearing a spokesperson from the office of senator mark warner who chairs the panel confirmed u s officials have been attempting to crack down on efforts to spread disinformation and misinformation online surrounding the nov \u003cFIVE_\u003e election in which democratic vice president kamala harris and republican former president donald trump will face off polls show a tight contest previous u s intelligence assessments have said that russia iran and china have tried to meddle in american elections allegations which those nations deny those nations have alleged that washington interferes in their domestic affairs claims that the u s denies tech executives have testified previously before the u s congress over election related hearings in recent years","timestamp":"2024-09-11T08:14:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}