{"url":"https://economictimes.indiatimes.com/tech/technology/nvidia-holds-the-key-to-the-market-but-is-it-worth-this-much/articleshow/113345315.cms","title":"Nvidia holds the key to the market. But is it worth this much?","description":"Nvidia, a leading designer of advanced AI chips, has seen its stock rise nearly 150% in the past year, significantly boosting the S\u0026P 500 index. Despite impressive earnings, recent market reactions suggest investors' expectations have grown too high. The future of AI and Nvidia's role in it remain crucial questions for the market.","content":"Nvidia designs most of the advanced chips that power artificial intelligence, and that has made it an earnings machine, producing astonishing profits that have buoyed the entire stock market. In the last year, Nvidia shares have returned nearly 150%, helping to fuel the nearly 25% gain in the S\u0026P 500 stock index. Yet starting in late August, as the bedazzling aura surrounding Nvidia ebbed, the market stumbled. \"The magic spell has broken,\" Aswath Damodaran, a New York University finance professor, said in an interview. For a year or so, he said, Nvidia could have reported virtually anything at all \"and investors and traders would have found a way to convert that into good news.\" What changed? Nvidia hasn't faltered. Its latest earnings report was awesome. Of all the companies associated with AI, Nvidia has reaped the most benefits. Giants like Meta (Facebook), Alphabet (Google), Microsoft, Amazon and Oracle are voracious buyers of Nvidia's technology. The problem seems to be that, like a child who has eaten too many extravagant sundaes, the stock market didn't find Nvidia's latest rich offering of profits to be quite as phenomenal as it had come to expect.","cleaned_content":"nvidia designs most of the advanced chips that power artificial intelligence and that has made it an earnings machine producing astonishing profits that have buoyed the entire stock market in the last year nvidia shares have returned nearly \u003cONE_HUNDRED_PERCENT\u003e helping to fuel the nearly \u003cTWO_TEN_PERCENT\u003e gain in the s p \u003cFIVE_HUNDRED\u003e stock index yet starting in late august as the bedazzling aura surrounding nvidia ebbed the market stumbled the magic spell has broken aswath damodaran a new york university finance professor said in an interview for a year or so he said nvidia could have reported virtually anything at all and investors and traders would have found a way to convert that into good news what changed nvidia hasnt faltered its latest earnings report was awesome of all the companies associated with ai nvidia has reaped the most benefits giants like meta facebook alphabet google microsoft amazon and oracle are voracious buyers of nvidias technology the problem seems to be that like a child who has eaten too many extravagant sundaes the stock market didnt find nvidias latest rich offering of profits to be quite as phenomenal as it had come to expect","timestamp":"2024-09-14T13:53:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}