{"url":"https://economictimes.indiatimes.com/tech/technology/what-are-indias-antitrust-findings-against-amazon-flipkart/articleshow/113348023.cms","title":"What are India's antitrust findings against Amazon, Flipkart","description":"Indian antitrust investigations have revealed that Amazon and Flipkart violated competition laws by favoring certain sellers, prioritizing specific listings, and offering steep discounts. These practices have negatively impacted other companies. The Competition Commission of India (CCI) detailed these findings in two reports reviewed by Reuters.","content":"Indian antitrust investigations have found that Amazon and Walmart's Flipkart violated local competition laws by giving preference to some sellers, prioritising certain listings, and steeply discounting products, hurting other companies. Here are the key findings of the Competition Commission of India (CCI), which are detailed in two reports that are not public but have been reviewed by Reuters.  Amazon, Flipkart and the CCI have not responded to requests for comment about the reports. * PREFERRED SELLERS: Amazon had six preferred sellers, while Flipkart had 33, who got preferential treatment on their platforms in breach of antitrust laws. The sellers received marketing, warehousing and other services at a \"miniscule cost\". The CCI also said Amazon and Flipkart used their foreign investments to provide such subsidised rates.","cleaned_content":"indian antitrust investigations have found that amazon and walmarts flipkart violated local competition laws by giving preference to some sellers prioritising certain listings and steeply discounting products hurting other companies here are the key findings of the competition commission of india cci which are detailed in two reports that are not public but have been reviewed by reuters amazon flipkart and the cci have not responded to requests for comment about the reports preferred sellers amazon had six preferred sellers while flipkart had \u003cTHREE_TEN\u003e who got preferential treatment on their platforms in breach of antitrust laws the sellers received marketing warehousing and other services at a miniscule cost the cci also said amazon and flipkart used their foreign investments to provide such subsidised rates","timestamp":"2024-09-14T18:08:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}