{"url":"https://economictimes.indiatimes.com/tech/technology/capital-a-launches-rs-400-cr-fund-for-investments-in-manufacturing-climate-startups/articleshow/113543635.cms","title":"Capital A launches Rs 400-crore fund for investments in manufacturing, climate startups","description":"With plans to invest in 17-20 companies, Capital-A will cut cheques of $2-3 million over the lifecycle of the startup, with the first cheque ranging from $750,000- $1 million, the company said in a statement.","content":"Venture capital firm Capital A on Friday announced the launch of its second fund that will focus on high-potential sectors such as manufacturing, deep-tech, climate and fintech startups with a target corpus of Rs 400 crore. Capital A founder and lead investor Ankit Kedia said the company has sought approval of market regulator SEBI and expects the approval to come by end of the year.  \"Our target for Fund II is Rs 300 crore, with a green shoe option of Rs 100 crore, and we anticipate closing by December 2025, following SEBI approval expected by the end of this year. Through Fund II, we aim to bridge this gap by concentrating on long-term value creation in these segments,\" Kedia said.  With plans to invest in 17-20 companies, Capital-A will cut cheques of $2-3 million over the lifecycle of the startup, with the first cheque ranging from $750,000- $1 million, the company said in a statement.  The investor base for Fund II will be primarily domestic, with backing from family offices, industry leaders, HNIs and like minded LPs and returning partners from previous funds, like Manjushree Ventures.  \"Many high-potential sectors, especially manufacturing businesses are highly undervalued assets, with great potential to scale quickly and become an important contributor in the startup ecosystem. ","cleaned_content":"venture capital firm capital a on friday announced the launch of its second fund that will focus on high potential sectors such as manufacturing deep tech climate and fintech startups with a target corpus of rs \u003cFOUR_HUNDRED\u003e crore capital a founder and lead investor ankit kedia said the company has sought approval of market regulator sebi and expects the approval to come by end of the year our target for fund ii is rs \u003cTHREE_HUNDRED\u003e crore with a green shoe option of rs \u003cONE_HUNDRED\u003e crore and we anticipate closing by december \u003cTWO_THOUSAND\u003e following sebi approval expected by the end of this year through fund ii we aim to bridge this gap by concentrating on long term value creation in these segments kedia said with plans to invest in \u003cONE_TEN\u003e \u003cTWO_TEN\u003e companies capital a will cut cheques of \u003cTWO_\u003e \u003cTHREE_\u003e million over the lifecycle of the startup with the first cheque ranging from \u003cSEVEN_HUNDRED_THOUSAND\u003e \u003cONE_\u003e million the company said in a statement the investor base for fund ii will be primarily domestic with backing from family offices industry leaders hnis and like minded lps and returning partners from previous funds like manjushree ventures many high potential sectors especially manufacturing businesses are highly undervalued assets with great potential to scale quickly and become an important contributor in the startup ecosystem","timestamp":"2024-09-21T12:47:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}