{"url":"https://economictimes.indiatimes.com/tech/technology/lenovo-eyes-pc-designing-in-india-to-complete-manufacturing-stack-says-md-shailendra-katyal/articleshow/113454915.cms","title":"Lenovo eyes PC designing in India to complete manufacturing stack, says MD Shailendra Katyal","description":"At present, Lenovo manufactures desktops and PCs locally, alongside all Motorola smartphones sold in India. The company has around 1,700 employees in India across three manufacturing sites.","content":"Chinese technology major Lenovo could explore designing personal computers in India to complete the entire manufacturing stack in the country and capitalise on local talent, its top India executive told ET.“The design-to-delivery is already there for phones, an end-to-end ecosystem. If you look at servers, the design capability is for 80% of the addressable portfolio. We brought in the mainstream and the GPU practices. I think the only thing which could be pending is, maybe, the PC design part. Because everything else we are doing. We can always raise that topic to move some of the PC design here, to leverage the Indian talent for that as well,” said Shailendra Katyal, managing director of Lenovo India.At present, Lenovo manufactures desktops and PCs locally, alongside all Motorola smartphones sold in India. The company has around 1,700 employees in India across three manufacturing sites.Speaking of India as an attractive destination, Katyal said the country has a big revenue opportunity along with a talent pool. “The strong talent hub started with manufacturing and now it’s going into the engineering and the designing part as well. So, it is a train which is in motion. It will only gather speed,” Katyal said in an interview after announcing Lenovo’s plans to manufacture artificial intelligence (AI) servers in India.The $57-billion hardware-focused technology firm on Tuesday said it has started building AI servers from India to complete its full stack portfolio to be now made in India. The firm said it will begin making AI servers in its Puducherry facility and has launched its AI-focused R\u0026D lab in Bengaluru.","cleaned_content":"chinese technology major lenovo could explore designing personal computers in india to complete the entire manufacturing stack in the country and capitalise on local talent its top india executive told et the design to delivery is already there for phones an end to end ecosystem if you look at servers the design capability is for \u003cEIGHT_TEN_PERCENT\u003e of the addressable portfolio we brought in the mainstream and the gpu practices i think the only thing which could be pending is maybe the pc design part because everything else we are doing we can always raise that topic to move some of the pc design here to leverage the indian talent for that as well said shailendra katyal managing director of lenovo india at present lenovo manufactures desktops and pcs locally alongside all motorola smartphones sold in india the company has around \u003cONE_THOUSAND\u003e employees in india across three manufacturing sites speaking of india as an attractive destination katyal said the country has a big revenue opportunity along with a talent pool the strong talent hub started with manufacturing and now it s going into the engineering and the designing part as well so it is a train which is in motion it will only gather speed katyal said in an interview after announcing lenovo s plans to manufacture artificial intelligence ai servers in india the \u003cFIVE_TEN\u003e billion hardware focused technology firm on tuesday said it has started building ai servers from india to complete its full stack portfolio to be now made in india the firm said it will begin making ai servers in its puducherry facility and has launched its ai focused r d lab in bengaluru","timestamp":"2024-09-18T15:10:00+05:30","market_timestamp":"2024-09-18T15:10:00+05:30","off_market_hours":false}