{"url":"https://economictimes.indiatimes.com/tech/technology/apple-back-taxes-hand-ireland-infrastructure-opportunities-pm-harris-says/articleshow/113291479.cms","title":"Apple back taxes hand Ireland infrastructure opportunities, PM Harris says","description":"Ireland had fought the European Union back-tax bill alongside Apple since 2016, seeking to defend its position as the location of choice for US multinationals in Europe but accepted that it can now use the cash, which has since grown to 13.8 billion euros in an escrow fund.","content":"An EU court order this week that Apple pay Ireland 13 billion euros ($14.4 billion) presents the government with opportunities to address pressing infrastructure, housebuilding and capital project needs, Prime Minister Simon Harris said on Thursday. Ireland had fought the European Union back-tax bill alongside Apple since 2016, seeking to defend its position as the location of choice for US multinationals in Europe but accepted that it can now use the cash, which has since grown to 13.8 billion euros in an escrow fund. Ministers have pledged to decide in the coming weeks how to invest the funds - equivalent to around half of Ireland's annual corporate tax take - and Harris' comments suggested the funds would not simply be added to a new sovereign wealth fund. \"It cannot be spent on day-to-day (expenditure) because you only get this money once but there are options and opportunities as to what we can do with it... How we can address some of the pressing infrastructural challenges, capital challenges and housing challenges,\" Harris told national broadcaster RTE. \"I've said this consistently over the summer before the Apple judgment, when it comes to things like housing, water and energy, we've real constraints in this country and we need to invest.\"","cleaned_content":"an eu court order this week that apple pay ireland \u003cONE_TEN\u003e billion euros \u003cONE_TEN\u003e billion presents the government with opportunities to address pressing infrastructure housebuilding and capital project needs prime minister simon harris said on thursday ireland had fought the european union back tax bill alongside apple since \u003cTWO_THOUSAND\u003e seeking to defend its position as the location of choice for us multinationals in europe but accepted that it can now use the cash which has since grown to \u003cONE_TEN\u003e billion euros in an escrow fund ministers have pledged to decide in the coming weeks how to invest the funds equivalent to around half of irelands annual corporate tax take and harris comments suggested the funds would not simply be added to a new sovereign wealth fund it cannot be spent on day to day expenditure because you only get this money once but there are options and opportunities as to what we can do with it how we can address some of the pressing infrastructural challenges capital challenges and housing challenges harris told national broadcaster rte ive said this consistently over the summer before the apple judgment when it comes to things like housing water and energy weve real constraints in this country and we need to invest","timestamp":"2024-09-12T16:11:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}