{"url":"https://economictimes.indiatimes.com/tech/technology/will-tiktok-be-banned-in-january-that-question-is-headed-to-court/articleshow/113381390.cms","title":"Will US ban TikTok in January? That question is headed to court","description":"For years, TikTok and its Chinese parent company, ByteDance, have been under scrutiny from U.S. lawmakers and intelligence officials for the app's ties to China. They have argued in congressional hearings and in court filings that the app poses national security concerns because the Chinese government could use it to access sensitive information about Americans or to spread propaganda. They pushed a law, signed in April, that requires ByteDance to either sell the app to a non-Chinese owner or face a ban.","content":"TikTok could be banned in the United States in mere months. Its lawyers head to court Monday to fight that outcome, the latest stage in an ongoing clash between the short-form video app and the U.S. government. For years, TikTok and its Chinese parent company, ByteDance, have been under scrutiny from U.S. lawmakers and intelligence officials for the app's ties to China. They have argued in congressional hearings and in court filings that the app poses national security concerns because the Chinese government could use it to access sensitive information about Americans or to spread propaganda. They pushed a law, signed in April, that requires ByteDance to either sell the app to a non-Chinese owner or face a ban. ByteDance and TikTok sued to block the law in May, and have said a ban would violate Americans' free speech rights. They argue there are other less restrictive ways to address those security concerns. Federal judges will hear arguments from the two sides Monday, in a hearing that could give a sense of which way the judges are leaning. The ruling is unlikely to be the final word on TikTok's future, or that of its 170 million U.S. users. Legal experts expect the case to reach the Supreme Court this fall, before a ban takes effect in mid-January.","cleaned_content":"tiktok could be banned in the united states in mere months its lawyers head to court monday to fight that outcome the latest stage in an ongoing clash between the short form video app and the u s government for years tiktok and its chinese parent company bytedance have been under scrutiny from u s lawmakers and intelligence officials for the apps ties to china they have argued in congressional hearings and in court filings that the app poses national security concerns because the chinese government could use it to access sensitive information about americans or to spread propaganda they pushed a law signed in april that requires bytedance to either sell the app to a non chinese owner or face a ban bytedance and tiktok sued to block the law in may and have said a ban would violate americans free speech rights they argue there are other less restrictive ways to address those security concerns federal judges will hear arguments from the two sides monday in a hearing that could give a sense of which way the judges are leaning the ruling is unlikely to be the final word on tiktoks future or that of its \u003cONE_HUNDRED\u003e million u s users legal experts expect the case to reach the supreme court this fall before a ban takes effect in mid january","timestamp":"2024-09-16T10:18:00+05:30","market_timestamp":"2024-09-16T10:18:00+05:30","off_market_hours":false}