{"url":"https://economictimes.indiatimes.com/tech/technology/tech-firms-halve-business-travel-in-2023-but-alphabet-apple-lag-study-shows/articleshow/113254881.cms","title":"Tech firms halve business travel in 2023 but Alphabet, Apple lag, study shows","description":"Global tech giants reduced their business flight emissions by 49% in 2023 compared to 2019, but companies like Apple and Alphabet are lagging, risking a return to pre-pandemic levels. Only seven out of 26 major tech firms have set specific reduction targets, according to a report by Transport \u0026 Environment.","content":"Global tech giants halved their business flight emissions in 2023 compared to 2019, but companies like Apple and Google's parent Alphabet are falling behind, risking a return to pre-pandemic levels, a Brussels-based NGO said in a report. Business travel last year approached pre-pandemic levels but trailed behind leisure trips, as geopolitical conflicts and a slower rebound in key markets hindered full recovery.  Emissions from corporate flights by 26 major tech companies analysed by Travel Smart, a campaign led by Transport \u0026 Environment (T\u0026E) dropped by an average of 49% in 2023, it found.  While this shows that many tech firms are on the right path, only seven have set specific reduction targets that are essential to keeping business flight numbers in check, T\u0026E said.  Alphabet, which has not set a goal to cut emissions, and Apple, which set a broader target, are slowly creeping back toward 2019 levels, T\u0026E said. ","cleaned_content":"global tech giants halved their business flight emissions in \u003cTWO_THOUSAND\u003e compared to \u003cTWO_THOUSAND\u003e but companies like apple and googles parent alphabet are falling behind risking a return to pre pandemic levels a brussels based ngo said in a report business travel last year approached pre pandemic levels but trailed behind leisure trips as geopolitical conflicts and a slower rebound in key markets hindered full recovery emissions from corporate flights by \u003cTWO_TEN\u003e major tech companies analysed by travel smart a campaign led by transport environment t e dropped by an average of \u003cFOUR_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e it found while this shows that many tech firms are on the right path only seven have set specific reduction targets that are essential to keeping business flight numbers in check t e said alphabet which has not set a goal to cut emissions and apple which set a broader target are slowly creeping back toward \u003cTWO_THOUSAND\u003e levels t e said","timestamp":"2024-09-11T14:13:00+05:30","market_timestamp":"2024-09-11T14:13:00+05:30","off_market_hours":false}