{"url":"https://economictimes.indiatimes.com/tech/technology/ondc-appoints-rs-sharma-as-the-non-executive-chairperson/articleshow/113285125.cms","title":"ONDC appoints RS Sharma as non-executive chairperson","description":"RS Sharma is widely recognised as one of the foremost experts globally in the development and implementation of Digital Public Infrastructure projects. He was instrumental in laying the foundations of Aadhaar, which has been pivotal in India’s digital revolution.","content":"Open Network for Digital Commerce (ONDC), the government-backed open network for ecommerce, has appointed RS Sharma as its non-executive chairperson.An Indian Administrative Service (IAS) officer, Sharma has served as the first director general and mission director of Aadhaar, chairman of the Telecom Regulator Authority of India (TRAI), CEO of the National Health Authority, and chief secretary for the Jharkhand government.“Today, as we’re at the cusp of the next phase of acceleration and exponential adoption, Sharma has agreed to join us as the chairperson to help shape the next digital revolution in India,” ONDC chief executive Thampy Koshy said in a statement on Thursday. “His long experience in digital initiatives will embolden ONDC adoption nationally and internationally,” he said.Sharma said, “ONDC is an unprecedented mission, which will fundamentally change how not just India but the entire world looks at digital commerce. We, as the ONDC team, are now gearing up for the next phase of growth to redefine digital commerce.”During his tenure as Trai chairman and later as CEO of NHA, Sharma enabled India to emerge as a global leader in using technology to address population-scale challenges, particularly during the Covid-19 pandemic.","cleaned_content":"open network for digital commerce ondc the government backed open network for ecommerce has appointed rs sharma as its non executive chairperson an indian administrative service ias officer sharma has served as the first director general and mission director of aadhaar chairman of the telecom regulator authority of india trai ceo of the national health authority and chief secretary for the jharkhand government today as we re at the cusp of the next phase of acceleration and exponential adoption sharma has agreed to join us as the chairperson to help shape the next digital revolution in india ondc chief executive thampy koshy said in a statement on thursday his long experience in digital initiatives will embolden ondc adoption nationally and internationally he said sharma said ondc is an unprecedented mission which will fundamentally change how not just india but the entire world looks at digital commerce we as the ondc team are now gearing up for the next phase of growth to redefine digital commerce during his tenure as trai chairman and later as ceo of nha sharma enabled india to emerge as a global leader in using technology to address population scale challenges particularly during the covid \u003cONE_TEN\u003e pandemic","timestamp":"2024-09-12T16:09:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}