{"url":"https://economictimes.indiatimes.com/tech/technology/googles-plea-against-cci-order-in-android-mobile-device-case-mentioned-in-sc/articleshow/113491949.cms","title":"Google's plea against CCI order in android mobile device case mentioned in SC","description":"On March 29 last year, the National Company Law Appellate Tribunal (NCLAT) had handed out a mixed verdict on Google's alleged anti-competitive practices in the case -- upholding a fine of Rs 1,338 crore but scrapping conditions like allowing hosting of third-party app stores on its Play Store.","content":"Google LLC on Thursday told the Supreme Court that the arguments in the case related to the tech giant's alleged anti-competitive practices in the Android mobile device matter may take five-six days. On March 29 last year, the National Company Law Appellate Tribunal (NCLAT) had handed out a mixed verdict on Google's alleged anti-competitive practices in the case -- upholding a fine of Rs 1,338 crore but scrapping conditions like allowing hosting of third-party app stores on its Play Store.  The top court is seized of cross-pleas of Google and the Competition Commission of India (CCI) challenging a verdict of an appellate tribunal in a case related to the tech giant's alleged anti-competitive practices in the Android mobile device matter.  A bench comprising Chief Justice D Y Chandrachud and justices JB Pardiwala and Manoj Misra has already listed the cross-pleas for hearing on Thursday.  The pleas, however, are unlikely to reach for hearing during the day as the bench is seized of part-heard matters.  At the outset of day's proceedings, senior advocate Harish Salve, appearing for the tech giant, mentioned the plea and said the hearing in the case may take five-six days. ","cleaned_content":"google llc on thursday told the supreme court that the arguments in the case related to the tech giants alleged anti competitive practices in the android mobile device matter may take five six days on march \u003cTWO_TEN\u003e last year the national company law appellate tribunal nclat had handed out a mixed verdict on googles alleged anti competitive practices in the case upholding a fine of rs \u003cONE_THOUSAND\u003e crore but scrapping conditions like allowing hosting of third party app stores on its play store the top court is seized of cross pleas of google and the competition commission of india cci challenging a verdict of an appellate tribunal in a case related to the tech giants alleged anti competitive practices in the android mobile device matter a bench comprising chief justice d y chandrachud and justices jb pardiwala and manoj misra has already listed the cross pleas for hearing on thursday the pleas however are unlikely to reach for hearing during the day as the bench is seized of part heard matters at the outset of days proceedings senior advocate harish salve appearing for the tech giant mentioned the plea and said the hearing in the case may take five six days","timestamp":"2024-09-19T16:38:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}