{"url":"https://economictimes.indiatimes.com/tech/technology/bengaluru-suffering-says-piyush-goyal-comment-unwarranted-retorts-patil/articleshow/113502136.cms","title":"Bengaluru suffering, says Piyush Goyal; comment unwarranted, retorts Patil","description":"The union minister’s comments were “unwarranted,” as Bengaluru is globally renowned for its technology and startup ecosystem, MB Patil told ET. The two ministers sparred on the microblogging site after Goyal’s comments at an event in Delhi on Monday went viral.","content":"Industries \u0026 Infrastructure Minister MB Patil has taken exception to Union Commerce \u0026 Industries Minister Piyush Goyal’s comment that “we should aspire to have our own Silicon Valley” wondering if Bengaluru was no longer one.The union minister’s comments were “unwarranted,” as Bengaluru is globally renowned for its technology and startup ecosystem, he told ET. The two ministers sparred on the microblogging site after Goyal’s comments at an event in Delhi on Monday went viral.The union minister put out a clarificatory post on Thursday in response to Patil’s comments. “Silicon Valley in Bengaluru is suffering from the apathy of the State Govt to provide logistics support, quality infrastructure, good roads whereas the Central Govt. continues to support the State even in developing an industrial township in Tumakuru under the Chennai-Bengaluru Industrial Corridor.“In fact, minister MB Patil and his Congress Govt should try to make Tumakuru industrial township into a Silicon Valley rather than deriding India’s progress. Tumakuru township has been left into a limbo by a State Govt. which does not even resolve their land issues. In fact, the delays and lack of support from the State Govt. has led to many investors shifting from Karnataka due to which thousands of jobs and crores of rupees in investments have moved from Karnataka to other States,” Goyal said.The trigger for social media posts came after the Union Minsiter said at an event in Delhi on Monday that, “We should aspire to go beyond. We should aspire to have our own Silicon Valley… I know Bengaluru is the Silicon Valley of India, but it's time we started thinking about tying up with NICDC and creating a whole new township dedicated to entrepreneurs, startups, innovators, and disruptors.”","cleaned_content":"industries infrastructure minister mb patil has taken exception to union commerce industries minister piyush goyal s comment that we should aspire to have our own silicon valley wondering if bengaluru was no longer one the union minister s comments were unwarranted as bengaluru is globally renowned for its technology and startup ecosystem he told et the two ministers sparred on the microblogging site after goyal s comments at an event in delhi on monday went viral the union minister put out a clarificatory post on thursday in response to patil s comments silicon valley in bengaluru is suffering from the apathy of the state govt to provide logistics support quality infrastructure good roads whereas the central govt continues to support the state even in developing an industrial township in tumakuru under the chennai bengaluru industrial corridor in fact minister mb patil and his congress govt should try to make tumakuru industrial township into a silicon valley rather than deriding india s progress tumakuru township has been left into a limbo by a state govt which does not even resolve their land issues in fact the delays and lack of support from the state govt has led to many investors shifting from karnataka due to which thousands of jobs and crores of rupees in investments have moved from karnataka to other states goyal said the trigger for social media posts came after the union minsiter said at an event in delhi on monday that we should aspire to go beyond we should aspire to have our own silicon valley i know bengaluru is the silicon valley of india but its time we started thinking about tying up with nicdc and creating a whole new township dedicated to entrepreneurs startups innovators and disruptors","timestamp":"2024-09-20T00:36:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}