{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-gets-fresh-gst-demand-penalty-order-of-rs-17-7-crore/articleshow/113466079.cms","title":"Zomato gets fresh GST demand, penalty order of Rs 17.7 crore","description":"The demand order, received by the company on Tuesday, is with respect to non- payment of GST on delivery charges and interest, penalty thereon.","content":"Online food delivery aggregator Zomato on Wednesday said it has received a GST demand order along with interest and penalty amounting to Rs 17.7 crore from the Assistant Commissioner of Revenue, West Bengal. The demand order, received by the company on Tuesday, is with respect to non- payment of GST on delivery charges and interest, penalty thereon. \"We believe that we have a strong case on merits and the Company will be filing an appeal against the order before the appropriate authority,\" Zomato said in a regulatory filing. The order is for the period April 2021 to March 2022 passed by Assistant Commissioner of Revenue, Government of West Bengal confirming demand of GST of Rs 11,12,79,712 with interest of Rs 5,46,81,021 and penalty of Rs 1,11,27,971.  \"The Company in its response to the show cause notice had clarified on the issue along with relevant documents and judicial precedents, which appears to not have been appreciated by the authorities while passing the order,\" Zomato said.  The Company believes that it has a strong case to defend the matter before the relevant appellate authority and does not expect any financial impact on the Company, it added. ","cleaned_content":"online food delivery aggregator zomato on wednesday said it has received a gst demand order along with interest and penalty amounting to rs \u003cONE_TEN\u003e crore from the assistant commissioner of revenue west bengal the demand order received by the company on tuesday is with respect to non payment of gst on delivery charges and interest penalty thereon we believe that we have a strong case on merits and the company will be filing an appeal against the order before the appropriate authority zomato said in a regulatory filing the order is for the period april \u003cTWO_THOUSAND\u003e to march \u003cTWO_THOUSAND\u003e passed by assistant commissioner of revenue government of west bengal confirming demand of gst of rs \u003cONE_HUNDRED_MILLION\u003e with interest of rs \u003cFIVE_TEN_MILLION\u003e and penalty of rs \u003cONE_TEN_MILLION\u003e the company in its response to the show cause notice had clarified on the issue along with relevant documents and judicial precedents which appears to not have been appreciated by the authorities while passing the order zomato said the company believes that it has a strong case to defend the matter before the relevant appellate authority and does not expect any financial impact on the company it added","timestamp":"2024-09-18T22:00:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}