{"url":"https://economictimes.indiatimes.com/tech/information-tech/tcs-opens-delivery-centre-in-poland-to-double-headcount-to-1200/articleshow/113525482.cms","title":"TCS opens delivery centre in Poland, to double headcount to 1200","description":"Poland is home to one of the largest European technology talent pools and the centre will tap into the growing Polish Information and Communication Technology (ICT) talent pool to support the needs of customers in niche technology skills and cognitive business and domain processes, the statement added.","content":"Indian IT giant Tata Consultancy Services (TCS) on Friday announced the launch of its new delivery centre in Warsaw, Poland, expanding its operations in the country.“With the new delivery centre, TCS expects to double its workforce to 1200-plus in a year to support its further growth in the region. Located in the heart of the city, the new delivery centre showcases TCS’ capabilities across industries and technologies,” the Tata subsidiary said in a statement.Poland is home to one of the largest European technology talent pools and the centre will tap into the growing Polish Information and Communication Technology (ICT) talent pool to support the needs of customers in niche technology skills and cognitive business and domain processes, the statement added.It forms a part of TCS’ European delivery network, which facilitates the delivery of hyper-connected services to its customers across Europe. This ensures that all TCS customers globally benefit from consistent, near-shore experiences tailored to their unique cultural, compliance, language, and technological requirements. TCS derives over 30% of its revenue from Continental Europe and the United Kingdom (UK).The company set up operations in Poland in 2006 and its presence in the region has continued to strengthen since then.","cleaned_content":"indian it giant tata consultancy services tcs on friday announced the launch of its new delivery centre in warsaw poland expanding its operations in the country with the new delivery centre tcs expects to double its workforce to \u003cONE_THOUSAND\u003e plus in a year to support its further growth in the region located in the heart of the city the new delivery centre showcases tcs capabilities across industries and technologies the tata subsidiary said in a statement poland is home to one of the largest european technology talent pools and the centre will tap into the growing polish information and communication technology ict talent pool to support the needs of customers in niche technology skills and cognitive business and domain processes the statement added it forms a part of tcs european delivery network which facilitates the delivery of hyper connected services to its customers across europe this ensures that all tcs customers globally benefit from consistent near shore experiences tailored to their unique cultural compliance language and technological requirements tcs derives over \u003cTHREE_TEN_PERCENT\u003e of its revenue from continental europe and the united kingdom uk the company set up operations in poland in \u003cTWO_THOUSAND\u003e and its presence in the region has continued to strengthen since then","timestamp":"2024-09-20T17:03:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}