{"url":"https://economictimes.indiatimes.com/tech/technology/x-names-brazil-legal-representative-as-it-fights-ban-in-the-country/articleshow/113539285.cms","title":"X names Brazil legal representative as it fights ban in the country","description":"Andre Zonaro and Sergio Rosenthal, who were recently appointed as X's lawyers in Brazil, told Reuters that colleague Rachel de Oliveira Conceicao was chosen as the firm's legal representative, and that they had submitted her name to the Supreme Court.","content":"Elon Musk-owned social media platform X has named a legal representative in Brazil, the firm's lawyers said on Friday, in a move that would address one of the demands imposed by Brazil's top court to allow the company to operate in the country. Andre Zonaro and Sergio Rosenthal, who were recently appointed as X's lawyers in Brazil, told Reuters that colleague Rachel de Oliveira Conceicao was chosen as the firm's legal representative, and that they had submitted her name to the Supreme Court. Brazilian law requires foreign companies to name a legal representative to operate in the country. The representative would assume the legal responsibilities for the firm locally. X had a legal representative in Brazil until mid-August, when it decided to close its offices in the country. In late August, Brazil's top court ordered mobile and internet service providers to block X in the nation, and users were cut off within hours after X did not name a new legal representative.","cleaned_content":"elon musk owned social media platform x has named a legal representative in brazil the firms lawyers said on friday in a move that would address one of the demands imposed by brazils top court to allow the company to operate in the country andre zonaro and sergio rosenthal who were recently appointed as xs lawyers in brazil told reuters that colleague rachel de oliveira conceicao was chosen as the firms legal representative and that they had submitted her name to the supreme court brazilian law requires foreign companies to name a legal representative to operate in the country the representative would assume the legal responsibilities for the firm locally x had a legal representative in brazil until mid august when it decided to close its offices in the country in late august brazils top court ordered mobile and internet service providers to block x in the nation and users were cut off within hours after x did not name a new legal representative","timestamp":"2024-09-21T07:17:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}