{"url":"https://economictimes.indiatimes.com/tech/technology/us-closer-to-greenlighting-nvidia-chips-for-saudi-arabia/articleshow/113278127.cms","title":"US closer to greenlighting Nvidia chips for Saudi Arabia","description":"The U.S. government is considering allowing Nvidia to export advanced AI chips to Saudi Arabia, potentially aiding the country in training and running powerful AI models. The topic was discussed at Saudi Arabia's global AI summit, with efforts being made to comply with U.S. security requirements to expedite the acquisition of these chips.","content":"The U.S. government is considering allowing Nvidia to export advanced chips to Saudi Arabia, potentially helping the country train and run the most powerful AI models, Semafor reported on Wednesday, citing people familiar with the matter. The sales of the chips were a main but unofficial topic at GAIN, Saudi Arabia's global AI summit, on Thursday, the report said. Attendees of the summit, including some who work for the Saudi Data and AI Authority, told Semafor that the country is making efforts to comply with U.S. security requirements to expedite the acquisition of the chips. The Biden administration imposed sweeping new curbs on AI chip exports last year in a bid to cut off more avenues for China to obtain them, imposing a licensing requirement on their shipment to the UAE and other Middle Eastern countries. The Saudi government is expecting shipments of the company's most advanced chips, Nvidia H200s, the report added. The H200 was first used in OpenAI's GPT-4o, a multimodal platform capable of realistic voice conversation with the ability to interact across text and image.","cleaned_content":"the u s government is considering allowing nvidia to export advanced chips to saudi arabia potentially helping the country train and run the most powerful ai models semafor reported on wednesday citing people familiar with the matter the sales of the chips were a main but unofficial topic at gain saudi arabias global ai summit on thursday the report said attendees of the summit including some who work for the saudi data and ai authority told semafor that the country is making efforts to comply with u s security requirements to expedite the acquisition of the chips the biden administration imposed sweeping new curbs on ai chip exports last year in a bid to cut off more avenues for china to obtain them imposing a licensing requirement on their shipment to the uae and other middle eastern countries the saudi government is expecting shipments of the companys most advanced chips nvidia h200s the report added the h200 was first used in openais gpt \u003cFOUR_\u003e o a multimodal platform capable of realistic voice conversation with the ability to interact across text and image","timestamp":"2024-09-12T10:21:00+05:30","market_timestamp":"2024-09-12T10:21:00+05:30","off_market_hours":false}