{"url":"https://economictimes.indiatimes.com/tech/technology/intel-foundry-business-to-make-custom-chip-for-amazon-chipmakers-shares-jump/articleshow/113408897.cms","title":"Intel foundry business to make custom chip for Amazon, chipmaker's shares jump","description":"Intel's foundry business has secured Amazon's AWS as a customer for custom AI chips, boosting Intel's shares by 8%. The deal involves Intel producing an 'artificial intelligence fabric chip' using its advanced 18A process. Intel is also planning cost cuts and restructuring to improve efficiency and profitability.","content":"Intel's foundry, or contract manufacturing business, has signed up Amazon's cloud services unit as a customer for making custom artificial intelligence chips, the companies said on Monday, a deal that gives the chip maker a vote of confidence. Intel's shares rose roughly 8% in extended trading after CEO Pat Gelsinger released a memo to employees announcing Intel had secured the Amazon unit as be a multibillion-dollar customer, paying Santa Clara, California-based Intel for design services and manufacturing. The memo also outlined Intel's planned cost cuts. Amazon's AWS cloud computing division already designs several chips for use in its data centers and has hired Intel to package at least one version. Intel will produce an \"artificial intelligence fabric chip\" for AWS and use the chip maker's 18A process, the most advanced version available for outside customers, the companies said. Intel said it expects to make additional designs from Amazon on the company's forthcoming 18AP and 14A manufacturing processes. The memo also outlined a number of steps Intel would take to revive itself. Last month, it reported disastrous second quarter earnings.","cleaned_content":"intels foundry or contract manufacturing business has signed up amazons cloud services unit as a customer for making custom artificial intelligence chips the companies said on monday a deal that gives the chip maker a vote of confidence intels shares rose roughly \u003cEIGHT_PERCENT\u003e in extended trading after ceo pat gelsinger released a memo to employees announcing intel had secured the amazon unit as be a multibillion dollar customer paying santa clara california based intel for design services and manufacturing the memo also outlined intels planned cost cuts amazons aws cloud computing division already designs several chips for use in its data centers and has hired intel to package at least one version intel will produce an artificial intelligence fabric chip for aws and use the chip makers \u003cONE_TEN\u003e a process the most advanced version available for outside customers the companies said intel said it expects to make additional designs from amazon on the companys forthcoming \u003cONE_TEN\u003e ap and \u003cONE_TEN\u003e a manufacturing processes the memo also outlined a number of steps intel would take to revive itself last month it reported disastrous second quarter earnings","timestamp":"2024-09-17T07:43:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}