{"url":"https://economictimes.indiatimes.com/tech/technology/zupee-partners-with-ondc-to-expand-online-gaming-user-base/articleshow/113393131.cms","title":"Zupee partners with ONDC to expand online gaming user base","description":"\"We are delighted to partner with ONDC and be listed on the platform. This collaboration strengthens our efforts to bring the joy of playing culturally relevant Indian games, responsibly, to a larger audience,\" said Dilsher Singh Malhi, founder and CEO of Zupee.","content":"Online gaming platform Zupee has partnered with the government-backed Open Network for Digital Commerce (ONDC) to broaden the reach of its skill-based games to a larger audience.As part of the agreement, Zupee is listed as a seller application on ONDC, offering its popular Ludo game through the platform, according to a statement on Monday.\"We are delighted to partner with ONDC and be listed on the platform. This collaboration strengthens our efforts to bring the joy of playing culturally relevant Indian games, responsibly, to a larger audience,\" said Dilsher Singh Malhi, founder and CEO of Zupee.This partnership will empower ONDC and Zupee to expand their reach, accelerate customer acquisition and provide even greater value to their growing user base, the statement added.Founded in 2018 by Malhi and Siddhant Saurabh, Zupee offers skill-based games where players' success depends on their skill, knowledge, attention and experience. The company is backed by investors such as WestCap Group, Tomales Bay Capital, Nepean Capital, AJ Capital, Matrix Partners India (Now Z47), and Orios Venture Partners.","cleaned_content":"online gaming platform zupee has partnered with the government backed open network for digital commerce ondc to broaden the reach of its skill based games to a larger audience as part of the agreement zupee is listed as a seller application on ondc offering its popular ludo game through the platform according to a statement on monday we are delighted to partner with ondc and be listed on the platform this collaboration strengthens our efforts to bring the joy of playing culturally relevant indian games responsibly to a larger audience said dilsher singh malhi founder and ceo of zupee this partnership will empower ondc and zupee to expand their reach accelerate customer acquisition and provide even greater value to their growing user base the statement added founded in \u003cTWO_THOUSAND\u003e by malhi and siddhant saurabh zupee offers skill based games where players success depends on their skill knowledge attention and experience the company is backed by investors such as westcap group tomales bay capital nepean capital aj capital matrix partners india now z47 and orios venture partners","timestamp":"2024-09-16T15:57:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}