{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musks-neuralink-gets-fda-breakthrough-device-tag-for-blindsight-implant/articleshow/113445523.cms","title":"Elon Musk's Neuralink gets FDA breakthrough device tag for 'Blindsight' implant","description":"Elon Musk's Neuralink has received the FDA's breakthrough device designation for its experimental brain-chip implant, Blindsight, aimed at restoring vision. The device could help even those who have lost both eyes and their optic nerve. Neuralink is also testing another implant to aid paralyzed patients in using digital devices by thought alone.","content":"Elon Musk's brain-chip startup Neuralink said on Tuesday its experimental implant aimed at restoring vision received the U.S. Food and Drug Administration's \"breakthrough device\" designation. The FDA's breakthrough tag is given to certain medical devices that provide treatment or diagnosis of life-threatening conditions. It is aimed at speeding up development and review of devices currently under development. The experimental device, known as Blindsight, \"will enable even those who have lost both eyes and their optic nerve to see,\" Musk said in a post on X. Neuralink did not immediately respond to a request seeking details about when it expects the Blindsight device to move into human trials. The FDA also did not immediately respond to a request for comment. Founded in 2016 by Musk and a group of engineers, Neuralink is building a brain chip interface that can be implanted within the skull, which it says could eventually help disabled patients to move and communicate again, and also restore vision.","cleaned_content":"elon musks brain chip startup neuralink said on tuesday its experimental implant aimed at restoring vision received the u s food and drug administrations breakthrough device designation the fdas breakthrough tag is given to certain medical devices that provide treatment or diagnosis of life threatening conditions it is aimed at speeding up development and review of devices currently under development the experimental device known as blindsight will enable even those who have lost both eyes and their optic nerve to see musk said in a post on x neuralink did not immediately respond to a request seeking details about when it expects the blindsight device to move into human trials the fda also did not immediately respond to a request for comment founded in \u003cTWO_THOUSAND\u003e by musk and a group of engineers neuralink is building a brain chip interface that can be implanted within the skull which it says could eventually help disabled patients to move and communicate again and also restore vision","timestamp":"2024-09-18T10:52:00+05:30","market_timestamp":"2024-09-18T10:52:00+05:30","off_market_hours":false}