{"url":"https://economictimes.indiatimes.com/tech/technology/google-knew-publishers-would-dislike-ad-tech-change-that-helped-it-profit/articleshow/113348904.cms","title":"Google knew publishers would dislike ad tech change that helped it profit","description":"The Justice Department showed emails and documents where Google employees discussed the company losing revenue because publishers were using their ability to set a higher minimum for bids from Google's AdX than for other exchanges.","content":"Google knew publishers would balk when it took measures in 2019 to keep them from diverting ad sales to competitors, prompting it to try to make the change look more palatable, according to internal documents shown at the tech titan's antitrust trial on Thursday.  Google's removal of the feature that publishers used to reduce their dependence on Google is a key piece of the case in which the U.S. Department of Justice and a coalition of states are seeking to show the company unfairly dominated markets for the technology that facilitates online advertising. The Justice Department showed emails and documents where Google employees discussed the company losing revenue because publishers were using their ability to set a higher minimum for bids from Google's AdX than for other exchanges. The result was that when ads were offered through multiple exchanges, publishers often sold to exchanges other than Google's. The company knew publishers were willing to accept making less money on some ad sales in exchange for the ability to preference other ad tech companies, such as those who charged a lower fee, according to the documents.","cleaned_content":"google knew publishers would balk when it took measures in \u003cTWO_THOUSAND\u003e to keep them from diverting ad sales to competitors prompting it to try to make the change look more palatable according to internal documents shown at the tech titans antitrust trial on thursday googles removal of the feature that publishers used to reduce their dependence on google is a key piece of the case in which the u s department of justice and a coalition of states are seeking to show the company unfairly dominated markets for the technology that facilitates online advertising the justice department showed emails and documents where google employees discussed the company losing revenue because publishers were using their ability to set a higher minimum for bids from googles adx than for other exchanges the result was that when ads were offered through multiple exchanges publishers often sold to exchanges other than googles the company knew publishers were willing to accept making less money on some ad sales in exchange for the ability to preference other ad tech companies such as those who charged a lower fee according to the documents","timestamp":"2024-09-14T16:31:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}