{"url":"https://economictimes.indiatimes.com/tech/technology/ex-google-exec-said-goal-was-to-crush-competition-trial-evidence-shows/articleshow/113269279.cms","title":"Ex-Google executive said goal was to 'crush' competition, trial evidence shows","description":"The statements underscored the US Department of Justice's claim that Google has sought to monopolize markets for publisher ad servers and advertiser ad networks, and tried to dominate the market for ad exchanges which sit in the middle.","content":"A Google executive told colleagues the goal for the company's then-nascent online advertising business in 2009 was to \"crush\" rival advertising networks, according to evidence prosecutors presented at the tech titan's antitrust trial on Wednesday. The statements underscored the US Department of Justice's claim that Google has sought to monopolize markets for publisher ad servers and advertiser ad networks, and tried to dominate the market for ad exchanges which sit in the middle. On the third day of the trial, prosecutors began to introduce evidence of how Google employees thought about the company's products at the time when the government alleges it set out to dominate the ad tech market. \"We'll be able to crush the other networks and that's our goal,\" David Rosenblatt, Google's former president of display advertising, said of the company's strategy in late 2008 or early 2009, according to notes shown in court. Google denies the allegations, saying it faces fierce competition from rival digital advertising companies.","cleaned_content":"a google executive told colleagues the goal for the companys then nascent online advertising business in \u003cTWO_THOUSAND\u003e was to crush rival advertising networks according to evidence prosecutors presented at the tech titans antitrust trial on wednesday the statements underscored the us department of justices claim that google has sought to monopolize markets for publisher ad servers and advertiser ad networks and tried to dominate the market for ad exchanges which sit in the middle on the third day of the trial prosecutors began to introduce evidence of how google employees thought about the companys products at the time when the government alleges it set out to dominate the ad tech market well be able to crush the other networks and thats our goal david rosenblatt googles former president of display advertising said of the companys strategy in late \u003cTWO_THOUSAND\u003e or early \u003cTWO_THOUSAND\u003e according to notes shown in court google denies the allegations saying it faces fierce competition from rival digital advertising companies","timestamp":"2024-09-11T23:40:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}