{"url":"https://economictimes.indiatimes.com/tech/technology/kenya-court-rules-meta-can-be-sued-over-layoffs-by-contractor/articleshow/113532106.cms","title":"Kenya court rules Meta can be sued over layoffs by contractor","description":"Last year the content moderators sued Meta and two local contractors, saying they lost their jobs with Sama, a Kenya-based firm contracted to moderate Facebook content, for organising a union.","content":"A Kenyan court ruled on Friday that Facebook's parent company Meta could be sued in the East African nation over the dismissal of dozens of content moderators by a contractor. Last year the content moderators sued Meta and two local contractors, saying they lost their jobs with Sama, a Kenya-based firm contracted to moderate Facebook content, for organising a union. They said they were then blacklisted from applying for the same roles at another firm, Majorel, after Facebook changed contractors. Out-of-court settlement talks collapsed in October last year. Friday's decision by the Court of Appeal upheld an earlier ruling by a Kenyan labour court in April 2023 that Meta could face trial over the moderators' dismissals, which Meta appealed. It also upheld a separate ruling in February 2023 that Meta could be sued in Kenya over alleged poor working conditions, which Meta also appealed.","cleaned_content":"a kenyan court ruled on friday that facebooks parent company meta could be sued in the east african nation over the dismissal of dozens of content moderators by a contractor last year the content moderators sued meta and two local contractors saying they lost their jobs with sama a kenya based firm contracted to moderate facebook content for organising a union they said they were then blacklisted from applying for the same roles at another firm majorel after facebook changed contractors out of court settlement talks collapsed in october last year fridays decision by the court of appeal upheld an earlier ruling by a kenyan labour court in april \u003cTWO_THOUSAND\u003e that meta could face trial over the moderators dismissals which meta appealed it also upheld a separate ruling in february \u003cTWO_THOUSAND\u003e that meta could be sued in kenya over alleged poor working conditions which meta also appealed","timestamp":"2024-09-20T21:53:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}