{"url":"https://economictimes.indiatimes.com/tech/technology/union-cabinet-approves-chandrayaan-4-venus-orbiter-mission/articleshow/113459995.cms","title":"Union Cabinet approves Chandrayaan-4, Venus Orbiter Mission","description":"The project is estimated to cost Rs 2,104 crore. The Indian government has also approved the construction of the first unit of the Bharatiya Antariksh Station, extending the scope of the Gaganyaan programme.","content":"The Union cabinet on Wednesday approved a mission to build the country’s first space station module, the Chandrayaan-4 that aims to return to the earth with lunar samples, and the country’s first mission to Venus.“Great news for the space sector! The Union cabinet has approved the first step towards the Bharatiya Antariksh Station (BAS), expanding the Gaganyaan programme! This landmark decision brings us closer to a self-sustained space station by 2035 and a crewed lunar mission by 2040!” Prime Minister Narendra Modi posted on X.The programme aims to develop the first module of the space station and conduct missions to validate various technologies for building and operating the station, IT minister Ashwini Vaishnaw said at a press briefing in Delhi.Indian Space Research Organisation (Isro) chairman S Somanath who also attended the press meet said Isro is working under a definite timeline. “The goal given to us is to have a full-fledged (space) station by 2035. Our plan is to launch the first module of the station called BAS-1 by 2028. For doing that, we have limitations on launch vehicle capabilities,” he said.Somanath also said the highlight of the fourth lunar mission is that it will come back from the moon.","cleaned_content":"the union cabinet on wednesday approved a mission to build the country s first space station module the chandrayaan \u003cFOUR_\u003e that aims to return to the earth with lunar samples and the country s first mission to venus great news for the space sector the union cabinet has approved the first step towards the bharatiya antariksh station bas expanding the gaganyaan programme this landmark decision brings us closer to a self sustained space station by \u003cTWO_THOUSAND\u003e and a crewed lunar mission by \u003cTWO_THOUSAND\u003e prime minister narendra modi posted on x the programme aims to develop the first module of the space station and conduct missions to validate various technologies for building and operating the station it minister ashwini vaishnaw said at a press briefing in delhi indian space research organisation isro chairman s somanath who also attended the press meet said isro is working under a definite timeline the goal given to us is to have a full fledged space station by \u003cTWO_THOUSAND\u003e our plan is to launch the first module of the station called bas \u003cONE_\u003e by \u003cTWO_THOUSAND\u003e for doing that we have limitations on launch vehicle capabilities he said somanath also said the highlight of the fourth lunar mission is that it will come back from the moon","timestamp":"2024-09-18T21:57:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}