{"url":"https://economictimes.indiatimes.com/tech/technology/qualcomm-loses-court-appeal-against-european-union-antitrust-penalty-in-chipset-case-from-2019/articleshow/113461040.cms","title":"Qualcomm loses court appeal against European Union antitrust penalty in chipset case from 2019","description":"The European Union's General Court said it was rejecting most of Qualcomm's appeal against the 242 million euro ($269 million) fine that the bloc's regulators issued in 2019, accusing the company of \"predatory pricing\" to drive a competitor out of the market.","content":"Qualcomm lost its bid on Wednesday to get a European Union antitrust penalty thrown out after a top court largely rebuffed the technology company's arguments in the case involving cellphone chipsets.  The European Union's General Court said it was rejecting most of Qualcomm's appeal against the 242 million euro ($269 million) fine that the bloc's regulators issued in 2019, accusing the company of \"predatory pricing\" to drive a competitor out of the market. The European Commission, the 27-nation bloc's executive branch and top antitrust enforcer, said five years ago that Qualcomm abused its market dominance in 3G baseband chipsets, selling them below the cost of production to force startup Icera out of the market a decade prior. The court said in a press release that after examining Qualcomm's arguments, it was \"rejecting them all in their entirety,\" except for the company's plea that the commission didn't follow guidelines in calculating the fine. Therefore the court trimmed the fine to 238.7 million euros.  In a separate case the European Commission fined Qualcomm $1.23 billion after concluding it bribed Apple to stifle competition, but the General Court overturned that decision in 2022 after the company appealed.","cleaned_content":"qualcomm lost its bid on wednesday to get a european union antitrust penalty thrown out after a top court largely rebuffed the technology companys arguments in the case involving cellphone chipsets the european unions general court said it was rejecting most of qualcomms appeal against the \u003cTWO_HUNDRED\u003e million euro \u003cTWO_HUNDRED\u003e million fine that the blocs regulators issued in \u003cTWO_THOUSAND\u003e accusing the company of predatory pricing to drive a competitor out of the market the european commission the \u003cTWO_TEN\u003e nation blocs executive branch and top antitrust enforcer said five years ago that qualcomm abused its market dominance in \u003cTHREE_\u003e g baseband chipsets selling them below the cost of production to force startup icera out of the market a decade prior the court said in a press release that after examining qualcomms arguments it was rejecting them all in their entirety except for the companys plea that the commission didnt follow guidelines in calculating the fine therefore the court trimmed the fine to \u003cTWO_HUNDRED\u003e million euros in a separate case the european commission fined qualcomm \u003cONE_\u003e billion after concluding it bribed apple to stifle competition but the general court overturned that decision in \u003cTWO_THOUSAND\u003e after the company appealed","timestamp":"2024-09-18T18:02:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}