{"url":"https://economictimes.indiatimes.com/tech/information-tech/valuation-boost-for-indian-it-firms-as-analysts-predict-turnaround-in-tech-spending/articleshow/113556474.cms","title":"Hopes of earnings revival lift Indian tech firms’ valuations","description":"Analysts say despite subdued revenue growth across the $250 bn Indian IT industry, valuations are getting a heft from an anticipated revival in demand in key clientele regions – the US and Europe. Expected business revival, deal wins and focus on margin improvement in the past 2-3 quarters has further pushed up the momentum.","content":"Valuations of Indian IT companies have swelled nearly 20% in the past three months with the top three firms Tata Consultancy Services, Infosys and HCLTech giving returns of 13%, 26% and 22%, respectively.If returns for the past 12 months are considered, the three firms saw their stock prices rise by 19%, 28% and 36%, respectively. Even the fourth largest software services firm, Wipro, a laggard in terms of earnings compared to the other three, saw shares rise about 10% in the past three months, and 25% over the past 12 months till Friday.In comparison, the sectoral BSE IT index climbed over 29% in the 12-month period while the Nifty IT index soared over 27%.Analysts say despite subdued revenue growth across the $250 billion Indian IT industry, valuations are getting a heft from an anticipated revival in demand in key clientele regions – the US and Europe. Expected business revival, deal wins and focus on margin improvement in the past 2-3 quarters has further pushed up the momentum.The first leg of the sector’s outperformance is largely driving valuation re-rating, says Kumar Rakesh, associate director at BNP Paribas. “As discretionary demand starts recovering in the coming quarters, we expect earnings upgrades to also follow. This could drive the second leg of the sector’s outperformance,” Kumar said.","cleaned_content":"valuations of indian it companies have swelled nearly \u003cTWO_TEN_PERCENT\u003e in the past three months with the top three firms tata consultancy services infosys and hcltech giving returns of \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively if returns for the past \u003cONE_TEN\u003e months are considered the three firms saw their stock prices rise by \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e respectively even the fourth largest software services firm wipro a laggard in terms of earnings compared to the other three saw shares rise about \u003cONE_TEN_PERCENT\u003e in the past three months and \u003cTWO_TEN_PERCENT\u003e over the past \u003cONE_TEN\u003e months till friday in comparison the sectoral bse it index climbed over \u003cTWO_TEN_PERCENT\u003e in the \u003cONE_TEN\u003e month period while the nifty it index soared over \u003cTWO_TEN_PERCENT\u003e analysts say despite subdued revenue growth across the \u003cTWO_HUNDRED\u003e billion indian it industry valuations are getting a heft from an anticipated revival in demand in key clientele regions the us and europe expected business revival deal wins and focus on margin improvement in the past \u003cTWO_\u003e \u003cTHREE_\u003e quarters has further pushed up the momentum the first leg of the sector s outperformance is largely driving valuation re rating says kumar rakesh associate director at bnp paribas as discretionary demand starts recovering in the coming quarters we expect earnings upgrades to also follow this could drive the second leg of the sector s outperformance kumar said","timestamp":"2024-09-22T15:08:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}