{"url":"https://economictimes.indiatimes.com/tech/technology/tata-analog-devices-announce-alliance-to-explore-indias-semiconductor-ecosystem/articleshow/113458693.cms","title":"Tata, Analog Devices announce alliance to explore India's semiconductor ecosystem","description":"The companies have also agreed to have strategic roadmap alignment discussions, the Tata Group said.","content":"Tata Electronics, Tata Motors, and Tejas Networks on Wednesday signed a Memorandum of Understanding (MoU) with Analog Devices Inc (ADI) to enhance strategic and business cooperation, explore opportunities for semiconductor manufacturing in India, and use ADI's products in Tata applications like electric vehicles and network infrastructure. The companies have also agreed to have strategic roadmap alignment discussions, the Tata Group said. \"The Tata Group is deeply committed to pioneering a thriving semiconductor industry in India. We are excited to partner with ADI across the semiconductor value chain and explore collaboration between ADI and Tata Group companies to design and offer advanced products to serve our customers,\" N Chandrasekaran, Chairman of Tata Sons said in a statement. Tata Electronics is investing in its own facilities by building India's first fab in Dholera, Gujarat with a total investment of $11 billion. In addition, Tata Electronics will be investing another $3 billion in a greenfield facility in Jagiroad, Assam for the assembly and testing of semiconductor chips. \"At ADI, we are thrilled to join efforts with the Tata Group in advancing India's semiconductor ecosystem. This joint effort aligns with our commitment to innovation and sustainable growth in the region. By combining our real-world semiconductor solutions and software expertise with Tata's vision and capabilities, we can accelerate the development of cutting-edge technologies, from electric vehicles to next-generation network infrastructure. Together, we are not only building a stronger semiconductor ecosystem but also shaping the future of global electronics manufacturing,\" Vincent Roche, CEO and Chair at ADI said. ","cleaned_content":"tata electronics tata motors and tejas networks on wednesday signed a memorandum of understanding mou with analog devices inc adi to enhance strategic and business cooperation explore opportunities for semiconductor manufacturing in india and use adis products in tata applications like electric vehicles and network infrastructure the companies have also agreed to have strategic roadmap alignment discussions the tata group said the tata group is deeply committed to pioneering a thriving semiconductor industry in india we are excited to partner with adi across the semiconductor value chain and explore collaboration between adi and tata group companies to design and offer advanced products to serve our customers n chandrasekaran chairman of tata sons said in a statement tata electronics is investing in its own facilities by building indias first fab in dholera gujarat with a total investment of \u003cONE_TEN\u003e billion in addition tata electronics will be investing another \u003cTHREE_\u003e billion in a greenfield facility in jagiroad assam for the assembly and testing of semiconductor chips at adi we are thrilled to join efforts with the tata group in advancing indias semiconductor ecosystem this joint effort aligns with our commitment to innovation and sustainable growth in the region by combining our real world semiconductor solutions and software expertise with tatas vision and capabilities we can accelerate the development of cutting edge technologies from electric vehicles to next generation network infrastructure together we are not only building a stronger semiconductor ecosystem but also shaping the future of global electronics manufacturing vincent roche ceo and chair at adi said","timestamp":"2024-09-18T16:59:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}