{"url":"https://economictimes.indiatimes.com/tech/technology/which-candidate-is-better-for-tech-innovation-venture-capitalists-divided-on-harris-or-trump/articleshow/113380411.cms","title":"Which candidate is better for tech innovation? VCs divided on Harris or Trump","description":"Silicon Valley venture capitalists are divided over support for presidential candidates, with some backing Trump and others endorsing Kamala Harris. This public split highlights differing views on policies affecting tech innovation and startup conditions. The debate has moved from private discussions to public platforms, reflecting the industry's political diversity.","content":"Being a venture capitalist carries a lot of prestige in Silicon Valley. Those who choose which startups to fund see themselves as fostering the next big waves of technology. So when some of the industry's biggest names endorsed former President Donald Trump and the onetime VC he picked for a running mate, JD Vance, people took notice.  Then hundreds of other VCs -- some high profile, others lesser-known -- threw their weight behind Vice President Kamala Harris, drawing battle lines over which presidential candidate will be better for tech innovation and the conditions startups need to thrive. For years, many of Silicon Valley's political discussions took place behind closed doors. Now, those casual debates have gone public - on podcasts, social media and online manifestos.  Venture capitalist and Harris backer Stephen DeBerry says some of his best friends support Trump. Though centered in a part of Northern California known for liberal politics, the investors who help finance the tech industry have long been a more politically divided bunch. \"We ski together. Our families are together. We're super tight,\" said DeBerry, who runs the Bronze Venture Fund. \"This is not about not being able to talk to each other. I love these guys -- they're almost all guys. They're dear friends. We just have a difference of perspective on policy issues.\"","cleaned_content":"being a venture capitalist carries a lot of prestige in silicon valley those who choose which startups to fund see themselves as fostering the next big waves of technology so when some of the industrys biggest names endorsed former president donald trump and the onetime vc he picked for a running mate jd vance people took notice then hundreds of other vcs some high profile others lesser known threw their weight behind vice president kamala harris drawing battle lines over which presidential candidate will be better for tech innovation and the conditions startups need to thrive for years many of silicon valleys political discussions took place behind closed doors now those casual debates have gone public on podcasts social media and online manifestos venture capitalist and harris backer stephen deberry says some of his best friends support trump though centered in a part of northern california known for liberal politics the investors who help finance the tech industry have long been a more politically divided bunch we ski together our families are together were super tight said deberry who runs the bronze venture fund this is not about not being able to talk to each other i love these guys theyre almost all guys theyre dear friends we just have a difference of perspective on policy issues","timestamp":"2024-09-16T09:33:00+05:30","market_timestamp":"2024-09-16T09:33:00+05:30","off_market_hours":false}