{"url":"https://economictimes.indiatimes.com/tech/technology/nokia-says-german-court-rules-in-its-favour-in-amazon-patent-dispute/articleshow/113554571.cms","title":"Nokia says German court rules in its favour in Amazon patent dispute","description":"In a statement, Nokia's Chief Licensing Officer Arvin Patel said the Munich Regional Court ruled Amazon was using \"Nokia's patented video-related technologies in its end-user streaming devices and is selling them illegally without a licence\".","content":"A German court has ruled that Amazon is using Nokia's patented video technologies without a licence, the Finnish network equipment maker and telecommunications patent holder said on Friday. In a statement, Nokia's Chief Licensing Officer Arvin Patel said the Munich Regional Court ruled Amazon was using \"Nokia's patented video-related technologies in its end-user streaming devices and is selling them illegally without a licence\". Amazon said it disagreed with the court's decision and expected the situation to be resolved soon, without being specific. \"This ruling will not affect any existing customers and a wide selection of Fire TV devices will continue to be available on Amazon,\" Amazon said in an emailed statement to Reuters, adding it was disappointed by Nokia's actions. Amazon said it had worked with a number of companies to license video patents.","cleaned_content":"a german court has ruled that amazon is using nokias patented video technologies without a licence the finnish network equipment maker and telecommunications patent holder said on friday in a statement nokias chief licensing officer arvin patel said the munich regional court ruled amazon was using nokias patented video related technologies in its end user streaming devices and is selling them illegally without a licence amazon said it disagreed with the courts decision and expected the situation to be resolved soon without being specific this ruling will not affect any existing customers and a wide selection of fire tv devices will continue to be available on amazon amazon said in an emailed statement to reuters adding it was disappointed by nokias actions amazon said it had worked with a number of companies to license video patents","timestamp":"2024-09-21T20:00:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}