{"url":"https://economictimes.indiatimes.com/tech/technology/harris-with-an-online-avalanche-outspends-trump-by-tens-of-millions/articleshow/113546800.cms","title":"Kamala Harris, with an online avalanche, outspends Trump by tens of millions","description":"The lopsided spending -- $12.2 million to $611,228 on Meta's platforms, according to company records -- was hardly an outlier. Ever since Harris entered the race, her campaign has overwhelmed the Trump operation with an avalanche of digital advertising, outspending his by tens of millions of dollars.","content":"Vice President Kamala Harris outspent former President Donald Trump by 20-1 on Facebook and Instagram in the week surrounding their debate, capitalizing on the moment to plaster battleground states with ads and to hunt for new donors nationwide. The lopsided spending -- $12.2 million to $611,228 on Meta's platforms, according to company records -- was hardly an outlier. Ever since Harris entered the race, her campaign has overwhelmed the Trump operation with an avalanche of digital advertising, outspending his by tens of millions of dollars. Four years ago Trump, then holding the White House, drastically outspent Democrats online early in the election cycle in hopes of gaining an advantage. Now Trump, facing a cash shortfall, is making a very different bet that emphasizes the unique appeal of his online brand, the durability of a donor list built over nearly a decade and his belief in the power of television. The difference was especially stark across the most contested states in the week surrounding the debate. In Pennsylvania, Harris spent $1.3 million on Meta's platforms, compared with $22,465 by Trump. In Michigan, she laid out $1.5 million, while he spent only $34,790. \"We just can't afford to abandon a platform to Democrats,\" warned Eric Wilson, a Republican digital strategist.","cleaned_content":"vice president kamala harris outspent former president donald trump by \u003cTWO_TEN\u003e \u003cONE_\u003e on facebook and instagram in the week surrounding their debate capitalizing on the moment to plaster battleground states with ads and to hunt for new donors nationwide the lopsided spending \u003cONE_TEN\u003e million to \u003cSIX_HUNDRED_THOUSAND\u003e on metas platforms according to company records was hardly an outlier ever since harris entered the race her campaign has overwhelmed the trump operation with an avalanche of digital advertising outspending his by tens of millions of dollars four years ago trump then holding the white house drastically outspent democrats online early in the election cycle in hopes of gaining an advantage now trump facing a cash shortfall is making a very different bet that emphasizes the unique appeal of his online brand the durability of a donor list built over nearly a decade and his belief in the power of television the difference was especially stark across the most contested states in the week surrounding the debate in pennsylvania harris spent \u003cONE_\u003e million on metas platforms compared with \u003cTWO_TEN_THOUSAND\u003e by trump in michigan she laid out \u003cONE_\u003e million while he spent only \u003cTHREE_TEN_THOUSAND\u003e we just cant afford to abandon a platform to democrats warned eric wilson a republican digital strategist","timestamp":"2024-09-21T14:20:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}