{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-justice-department-face-off-in-court-over-potential-us-ban/articleshow/113393514.cms","title":"TikTok, Justice Department face off in court over potential US ban","description":"A three-judge panel of the U.S. Court of Appeals for the District of Columbia will hold oral arguments on a legal challenge filed by TikTok and Chinese-parent company ByteDance that seeks an injunction barring the law from taking effect.","content":"Lawyers for TikTok and parent company ByteDance will square off with the Justice Department in a Washington courtroom on Monday over the fate of a law that could ban the short video app used by 170 million Americans as soon as Jan. 19. A three-judge panel of the U.S. Court of Appeals for the District of Columbia will hold oral arguments on a legal challenge filed by TikTok and Chinese-parent company ByteDance that seeks an injunction barring the law from taking effect.  TikTok and ByteDance argue the law is unconstitutional and violates Americans' free speech rights, calling it \"a radical departure from this country's tradition of championing an open Internet.\" Circuit Judges Sri Srinivasan, Neomi Rao and Douglas Ginsburg will consider the legal challenges brought by TikTok and users against the law that gives ByteDance until Jan. 19 to sell or divest TikTok's U.S. assets or face a ban. Driven by worries among U.S. lawmakers that China could access data on Americans or spy on them with the app, the U.S. Congress passed the law overwhelmingly in April just weeks after it was introduced.","cleaned_content":"lawyers for tiktok and parent company bytedance will square off with the justice department in a washington courtroom on monday over the fate of a law that could ban the short video app used by \u003cONE_HUNDRED\u003e million americans as soon as jan \u003cONE_TEN\u003e a three judge panel of the u s court of appeals for the district of columbia will hold oral arguments on a legal challenge filed by tiktok and chinese parent company bytedance that seeks an injunction barring the law from taking effect tiktok and bytedance argue the law is unconstitutional and violates americans free speech rights calling it a radical departure from this countrys tradition of championing an open internet circuit judges sri srinivasan neomi rao and douglas ginsburg will consider the legal challenges brought by tiktok and users against the law that gives bytedance until jan \u003cONE_TEN\u003e to sell or divest tiktoks u s assets or face a ban driven by worries among u s lawmakers that china could access data on americans or spy on them with the app the u s congress passed the law overwhelmingly in april just weeks after it was introduced","timestamp":"2024-09-16T16:05:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}