{"url":"https://economictimes.indiatimes.com/tech/technology/fujifilms-chip-arm-eyes-jvs-tie-ups-in-india/articleshow/113373679.cms","title":"Fujifilm's chip arm eyes JVs, tie ups in India","description":"Speaking on the sidelines of the recently concluded Semicon 2024, Tetsuya Iwasaki, the general manager of Fujifilm's electronic materials business division said that the company was in advanced stages of exploring joint venture opportunities as well as the possibility of leasing their proprietary technology licences to Indian companies.","content":"Fujifilm Electronic Materials, the semiconductor solutions arm of the digital camera maker, plans to enter India soon, and is in talks with several companies to provide end-to-end chemicals and solutions used for the manufacturing and packaging of semiconductors, a senior company executive told ET. Speaking on the sidelines of the recently concluded Semicon 2024, Tetsuya Iwasaki, the general manager of Fujifilm's electronic materials business division said that the company was in advanced stages of exploring joint venture opportunities as well as the possibility of leasing their proprietary technology licences to Indian companies. Fujifilm Electronic Material, incorporated in 1983, is a 100% subsidiary of Fujifilm Corporation and is a supplier of semiconductor raw materials to companies such as Samsung, Intel, Micron, and Taiwan Semiconductor Manufacturing Company (TSMC), among others. The electronic material business division has 20 production sites and six research and development sites worldwide, including Japan, the US, Belgium, Taiwan, China, and Korea. It has also planned new production units in the UK, France, Italy, and Singapore over the next few years, Iwasaki said.","cleaned_content":"fujifilm electronic materials the semiconductor solutions arm of the digital camera maker plans to enter india soon and is in talks with several companies to provide end to end chemicals and solutions used for the manufacturing and packaging of semiconductors a senior company executive told et speaking on the sidelines of the recently concluded semicon \u003cTWO_THOUSAND\u003e tetsuya iwasaki the general manager of fujifilms electronic materials business division said that the company was in advanced stages of exploring joint venture opportunities as well as the possibility of leasing their proprietary technology licences to indian companies fujifilm electronic material incorporated in \u003cONE_THOUSAND\u003e is a \u003cONE_HUNDRED_PERCENT\u003e subsidiary of fujifilm corporation and is a supplier of semiconductor raw materials to companies such as samsung intel micron and taiwan semiconductor manufacturing company tsmc among others the electronic material business division has \u003cTWO_TEN\u003e production sites and six research and development sites worldwide including japan the us belgium taiwan china and korea it has also planned new production units in the uk france italy and singapore over the next few years iwasaki said","timestamp":"2024-09-16T06:00:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}