{"url":"https://economictimes.indiatimes.com/tech/technology/uber-to-dispatch-waymos-robotaxis-in-austin-and-atlanta-next-year/articleshow/113353269.cms","title":"Uber to dispatch Waymo's robotaxis in Austin and Atlanta next year","description":"Uber's increasing reliance on Waymo's robotaxis to supplement the fleet of cars driven by people responding to requests sent on a mobile app comes just a few weeks after it announced plans to deploy driverless cars from General Motors' beleaguered Cruise subsidiary.","content":"Ride-hailing leader Uber on Friday announced it will dispatch robotaxis built by driverless technology pioneer Waymo beginning next year in Austin, Texas, and Atlanta in a deal that deepens the bond between once-bitter rivals. The alliance expands upon a partnership the two companies forged in Phoenix last year, signaling they were ready to set aside their differences and work together following a bruising legal battle revolving around allegations that Uber had stolen Waymo's trade secrets.  Uber's increasing reliance on Waymo's robotaxis to supplement the fleet of cars driven by people responding to requests sent on a mobile app comes just a few weeks after it announced plans to deploy driverless cars from General Motors' beleaguered Cruise subsidiary.  It hasn't been revealed yet where Uber and Cruise will be working together next year, but it probably won't be in California, where Cruise's license remains suspended f ollowing a grisly October 2023 incident in San Francisco that seriously injured a pedestrian. Unlike Cruise, Waymo so far hasn't been involved in any major crashes or accidents that have sidelined its robotaxis, which are now giving more than 100,000 rides per week in San Francisco, Los Angeles and Phoenix, on its own ride-hailing app. ","cleaned_content":"ride hailing leader uber on friday announced it will dispatch robotaxis built by driverless technology pioneer waymo beginning next year in austin texas and atlanta in a deal that deepens the bond between once bitter rivals the alliance expands upon a partnership the two companies forged in phoenix last year signaling they were ready to set aside their differences and work together following a bruising legal battle revolving around allegations that uber had stolen waymos trade secrets ubers increasing reliance on waymos robotaxis to supplement the fleet of cars driven by people responding to requests sent on a mobile app comes just a few weeks after it announced plans to deploy driverless cars from general motors beleaguered cruise subsidiary it hasnt been revealed yet where uber and cruise will be working together next year but it probably wont be in california where cruises license remains suspended f ollowing a grisly october \u003cTWO_THOUSAND\u003e incident in san francisco that seriously injured a pedestrian unlike cruise waymo so far hasnt been involved in any major crashes or accidents that have sidelined its robotaxis which are now giving more than \u003cONE_HUNDRED_THOUSAND\u003e rides per week in san francisco los angeles and phoenix on its own ride hailing app","timestamp":"2024-09-14T20:10:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}