{"url":"https://economictimes.indiatimes.com/tech/technology/waymo-in-talks-with-hyundai-motor-to-produce-self-driving-taxis/articleshow/113476002.cms","title":"Waymo in talks with Hyundai Motor to produce self-driving taxis","description":"Alphabet's Waymo is in discussions with Hyundai Motor to potentially outsource the manufacturing of its self-driving vehicles. The talks involve using Hyundai's Ioniq 5 electric vehicles for Waymo's sixth-generation technology, possibly replacing current models from China's Zeekr. This comes amid new U.S. tariffs on Chinese imports, including electric vehicles.","content":"Alphabet's Waymo is in talks with South Korea's Hyundai Motor to outsource manufacturing of its self-driving vehicles, South Korean newspaper, Electronic Times, reported.  Officials at Waymo and Hyundai Motor have met more than three times to discuss a plan to use Hyundai's Ioniq 5 electric vehicles for Waymo's sixth-generation self-driving technology, the report said, adding that the vehicles would replace the offerings from China's Zeekr, which Waymo is currently testing.  The report came as President Joe Biden's administration last week locked in steep tariff hikes on Chinese imports, including a 100% duty on electric vehicles, which will take effect on Sept. 27. Regarding the media report, Waymo said in a statement to Reuters: \"We'll decline to comment on speculation, but I can share that we are hard at work validating the 6th-generation Waymo Driver on the Zeekr platform and intend to introduce it into our fleet when ready.\" Hyundai Motor Group said \"nothing is determined at this stage about new businesses,\" referring to its plan to sell its vehicle platform to self-driving technology companies.","cleaned_content":"alphabets waymo is in talks with south koreas hyundai motor to outsource manufacturing of its self driving vehicles south korean newspaper electronic times reported officials at waymo and hyundai motor have met more than three times to discuss a plan to use hyundais ioniq \u003cFIVE_\u003e electric vehicles for waymos sixth generation self driving technology the report said adding that the vehicles would replace the offerings from chinas zeekr which waymo is currently testing the report came as president joe bidens administration last week locked in steep tariff hikes on chinese imports including a \u003cONE_HUNDRED_PERCENT\u003e duty on electric vehicles which will take effect on sept \u003cTWO_TEN\u003e regarding the media report waymo said in a statement to reuters well decline to comment on speculation but i can share that we are hard at work validating the \u003cSIX_\u003e th generation waymo driver on the zeekr platform and intend to introduce it into our fleet when ready hyundai motor group said nothing is determined at this stage about new businesses referring to its plan to sell its vehicle platform to self driving technology companies","timestamp":"2024-09-19T09:38:00+05:30","market_timestamp":"2024-09-19T09:38:00+05:30","off_market_hours":false}