{"url":"https://economictimes.indiatimes.com/tech/technology/freshworks-appoints-shelton-rego-as-vice-president-sales/articleshow/113522158.cms","title":"Freshworks appoints Shelton Rego as vice president, sales","description":"Freshworks Inc has appointed Shelton Rego as Vice-President of Sales India operations. Rego will oversee regional business strategy, market expansion, customer relationships, and new partnerships. Previously, he worked at Jio Cloud, Google Cloud, SAP Concur, and Oracle. Freshworks aims to leverage his experience to strengthen its SaaS market share in India.","content":"Nasdaq-listed Freshworks Inc has appointed Shelton Rego as its new Vice-President of Sales India operations with immediate effect, the company said. In his new role, Rego would oversee the regional business strategy for India operations, focusing on expanding market share, fostering customer relationships, and identifying new partnership models for growth. Rego has earlier worked at Jio Cloud, the technology subsidiary of diversified conglomerate Reliance Group, as its country head. He had also served at Google Cloud, SAP Concur, and Oracle, Freshworks said in a company statement on Friday. Rego would take the AI-powered customer and employee experience solutions offered by Freshworks to Indian businesses and work closely with global go-to-market leaders. \"Shelton Rego has the experience and accomplishments to build exceptionally strong market share for SaaS (software-as-a-service) industry giants in India. We believe he can do the same for Freshworks,\" said Freshworks Chief of Global Field Operations, Abe Smith. ","cleaned_content":"nasdaq listed freshworks inc has appointed shelton rego as its new vice president of sales india operations with immediate effect the company said in his new role rego would oversee the regional business strategy for india operations focusing on expanding market share fostering customer relationships and identifying new partnership models for growth rego has earlier worked at jio cloud the technology subsidiary of diversified conglomerate reliance group as its country head he had also served at google cloud sap concur and oracle freshworks said in a company statement on friday rego would take the ai powered customer and employee experience solutions offered by freshworks to indian businesses and work closely with global go to market leaders shelton rego has the experience and accomplishments to build exceptionally strong market share for saas software as a service industry giants in india we believe he can do the same for freshworks said freshworks chief of global field operations abe smith","timestamp":"2024-09-20T15:42:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}