{"url":"https://economictimes.indiatimes.com/tech/technology/microsoft-to-cut-650-support-jobs-in-xbox-games-unit/articleshow/113291680.cms","title":"Microsoft to cut 650 support jobs in Xbox Games unit","description":"Microsoft layoffs: The roles to be eliminated are in “mostly corporate and supporting functions,” according to a memo sent to staff by Xbox chief Phil Spencer on Thursday. “No games, devices or experiences are being cancelled and no studios are being closed as part of these adjustments today.”","content":"Microsoft Corp. said it is cutting 650 jobs in its Xbox unit, the third such layoffs this year as the company tries to rein in costs and integrate its massive $69 billion acquisition of Activision Blizzard Inc.The roles to be eliminated are in “mostly corporate and supporting functions,” according to a memo sent to staff by Xbox chief Phil Spencer on Thursday. “No games, devices or experiences are being cancelled and no studios are being closed as part of these adjustments today.”Xbox employees had been bracing for further reductions after Microsoft cut 1,900 jobs, many from Activision units and studios, in January. In May, the company announced the shuttering of four studios acquired as part of its $7.5 billion purchase of ZeniMax — one of which was ultimately sold instead. These steps, along with the decision to release some Xbox games on rival consoles, have angered some of the platform’s fans and left them questioning Microsoft’s commitment to building compelling exclusive content.It has been a brutal year for the games industry more broadly, as it reckons with rising game development costs and tepid growth. Sony Group Corp., Take-Two Interactive Software Inc. and Electronic Arts Inc. are among the major global companies that have cut jobs and shut down marquee projects. Sony this month axed big-budget multiplayer shooter Concord only two weeks after its release, showing little patience for a game that got off to a slow start.Microsoft completed the Activision acquisition in October, 21 months after it was announced and following a bruising battle to obtain antitrust clearance. The purchase has given Xbox an infusion of new content and talent, but also a challenge in making the deal pay off over the long run.","cleaned_content":"microsoft corp said it is cutting \u003cSIX_HUNDRED\u003e jobs in its xbox unit the third such layoffs this year as the company tries to rein in costs and integrate its massive \u003cSIX_TEN\u003e billion acquisition of activision blizzard inc the roles to be eliminated are in mostly corporate and supporting functions according to a memo sent to staff by xbox chief phil spencer on thursday no games devices or experiences are being cancelled and no studios are being closed as part of these adjustments today xbox employees had been bracing for further reductions after microsoft cut \u003cONE_THOUSAND\u003e jobs many from activision units and studios in january in may the company announced the shuttering of four studios acquired as part of its \u003cSEVEN_\u003e billion purchase of zenimax one of which was ultimately sold instead these steps along with the decision to release some xbox games on rival consoles have angered some of the platform s fans and left them questioning microsoft s commitment to building compelling exclusive content it has been a brutal year for the games industry more broadly as it reckons with rising game development costs and tepid growth sony group corp take two interactive software inc and electronic arts inc are among the major global companies that have cut jobs and shut down marquee projects sony this month axed big budget multiplayer shooter concord only two weeks after its release showing little patience for a game that got off to a slow start microsoft completed the activision acquisition in october \u003cTWO_TEN\u003e months after it was announced and following a bruising battle to obtain antitrust clearance the purchase has given xbox an infusion of new content and talent but also a challenge in making the deal pay off over the long run","timestamp":"2024-09-12T16:21:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}