{"url":"https://economictimes.indiatimes.com/tech/technology/cisco-lets-go-thousands-in-second-major-layoffs-this-year/articleshow/113445868.cms","title":"Cisco lets go thousands of employees in second major layoff this year: report","description":"Cisco is planning to lay off around 7% of its workforce, marking its second major layoff this year. The company is facing declining demand and high costs as it invests in AI. The layoffs, expected to be announced next week, will affect over 6,300 jobs primarily in Silicon Valley.","content":"US tech conglomerate Cisco has laid off thousands of employees, after announcing a second major job cut earlier this year, as per a TechCrunch report. The decision comes as the company is grappling with declining demand and the need to reduce costs, particularly as it invests heavily in AI.Earlier in August, the company announced around 7% job cuts, or around 5,600 employees after its February layoff affecting 4,000 employees.\"Cisco is optimistic about rebounding demand for our networking equipment,\" Cisco CEO Chuck Robbins had said. As part of its strategy, Cisco is restructuring to focus on high-growth areas, having allocated $1 billion to AI startups and acquiring cybersecurity firm Splunk for $28 billion.Cisco is anticipating significant costs associated with a restructuring plan. These costs are estimated to reach up to $1 billion before taxes. A significant portion of these costs, between $700 million and $800 million, is expected to be recognized during the first quarter of the fiscal year.The company’s workforce at approximately 85,000 employees at the end of its last fiscal year. In August, the tech sector faced a wave of layoffs, affecting over 27,000 employees. Tech giants like Intel, IBM, and Cisco, along with numerous startups, announced substantial job cuts. This brings the total number of tech layoffs this year to over 136,000 across 422 companies.","cleaned_content":"us tech conglomerate cisco has laid off thousands of employees after announcing a second major job cut earlier this year as per a techcrunch report the decision comes as the company is grappling with declining demand and the need to reduce costs particularly as it invests heavily in ai earlier in august the company announced around \u003cSEVEN_PERCENT\u003e job cuts or around \u003cFIVE_THOUSAND\u003e employees after its february layoff affecting \u003cFOUR_THOUSAND\u003e employees cisco is optimistic about rebounding demand for our networking equipment cisco ceo chuck robbins had said as part of its strategy cisco is restructuring to focus on high growth areas having allocated \u003cONE_\u003e billion to ai startups and acquiring cybersecurity firm splunk for \u003cTWO_TEN\u003e billion cisco is anticipating significant costs associated with a restructuring plan these costs are estimated to reach up to \u003cONE_\u003e billion before taxes a significant portion of these costs between \u003cSEVEN_HUNDRED\u003e million and \u003cEIGHT_HUNDRED\u003e million is expected to be recognized during the first quarter of the fiscal year the company s workforce at approximately \u003cEIGHT_TEN_THOUSAND\u003e employees at the end of its last fiscal year in august the tech sector faced a wave of layoffs affecting over \u003cTWO_TEN_THOUSAND\u003e employees tech giants like intel ibm and cisco along with numerous startups announced substantial job cuts this brings the total number of tech layoffs this year to over \u003cONE_HUNDRED_THOUSAND\u003e across \u003cFOUR_HUNDRED\u003e companies","timestamp":"2024-09-18T18:56:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}