{"url":"https://economictimes.indiatimes.com/tech/technology/dont-register-outside-india-unless-you-have-a-very-strong-reason-livspace-cofounder-ramakant-sharma/articleshow/113519751.cms","title":"Don’t register startup outside India unless you have a very strong reason: Livspace's Ramakant Sharma","description":"Livspace cofounder Ramakant Sharma urges startups to register their domiciles in India unless there is a strong reason against it. He emphasizes the benefits of doing business in India, including attracting talent and capital. This advice comes as Livspace prepares to shift its domicile from Singapore to India.","content":"Livspace cofounder Ramakant Sharma called on startups to register their domiciles in India “until and unless there is a very strong reason” against it.Speaking at a panel titled Homecoming Heros at the ET Soonicorns Summit, Sharma said, “I couldn’t find a single advantage of registering outside of India, unless and until your business isn’t Indian. If you are running a tech company, and you have no customers in India, or no employee in India. But if someone is doing business in India, from the perspective of attracting talent and capital, my advice would be to register in India.”He also added that the Indian economy is thriving on consumption with consumer brands growing steadily, and recent IPOs also having done well.This comes days after ET reported that the home decor startup is preparing to file for a domicile shift from Singapore to India.Abhishek Dubey or Trilegal also spoke of companies flipping back to India. “If you asked a company why they incorporated overseas 10 years ago, the answer would be access to funds. And what is the reason now to reverse flip to India? Also access to funds, because in the past decade, India has emerged as a great economy. This, coupled with IPOs being a great exit route,” he said.","cleaned_content":"livspace cofounder ramakant sharma called on startups to register their domiciles in india until and unless there is a very strong reason against it speaking at a panel titled homecoming heros at the et soonicorns summit sharma said i couldn t find a single advantage of registering outside of india unless and until your business isn t indian if you are running a tech company and you have no customers in india or no employee in india but if someone is doing business in india from the perspective of attracting talent and capital my advice would be to register in india he also added that the indian economy is thriving on consumption with consumer brands growing steadily and recent ipos also having done well this comes days after et reported that the home decor startup is preparing to file for a domicile shift from singapore to india abhishek dubey or trilegal also spoke of companies flipping back to india if you asked a company why they incorporated overseas \u003cONE_TEN\u003e years ago the answer would be access to funds and what is the reason now to reverse flip to india also access to funds because in the past decade india has emerged as a great economy this coupled with ipos being a great exit route he said","timestamp":"2024-09-20T14:18:00+05:30","market_timestamp":"2024-09-20T14:18:00+05:30","off_market_hours":false}