{"url":"https://economictimes.indiatimes.com/tech/information-tech/mphasis-appoints-ajay-arya-to-head-ma/articleshow/113434647.cms","title":"Mphasis appoints Ajay Arya to head M\u0026A","description":"“Ajay will be based in New York and lead the entire process, including strategy, evaluation, deal sourcing, negotiation, diligence management and post-merger integration,” the company said.","content":"Mid-sized IT services firm Mphasis on Tuesday announced the appointment of Ajay Arya as the head of mergers \u0026 acquisitions (M\u0026A), the company said in a regulatory filing.“Ajay will be based in New York and lead the entire process, including strategy, evaluation, deal sourcing, negotiation, diligence management and post-merger integration,” the company said.Mphasis has completed nine acquisitions with an average acquisition amount of $71.8 million, accoridng to data and market research platform Tracxn. Its most active year was 2023, with two acquisitions, and it has averaged nearly one acquisition per year over the past three years.In October 2023, Mphasis acquired US-headquartered Sonnick Partners along with its subsidiaries for a deal price of $132.5 million. The acquired company conducts its business operations by the name Silverline that offers cloud-based solution development services based on hyperscaler Salesforce.“This appointment reinforces Mphasis’ commitment to investing in top level talent and further accelerating the strong momentum in our inorganic business. Ajay’s strategic thinking combined with his extensive transaction execution experience and proven leadership qualities, will be important assets in carrying out our strategic roadmap; making him a tremendous addition to the existing M\u0026A team,” said Nitin Rakesh, CEO and managing director, Mphasis.","cleaned_content":"mid sized it services firm mphasis on tuesday announced the appointment of ajay arya as the head of mergers acquisitions m a the company said in a regulatory filing ajay will be based in new york and lead the entire process including strategy evaluation deal sourcing negotiation diligence management and post merger integration the company said mphasis has completed nine acquisitions with an average acquisition amount of \u003cSEVEN_TEN\u003e million accoridng to data and market research platform tracxn its most active year was \u003cTWO_THOUSAND\u003e with two acquisitions and it has averaged nearly one acquisition per year over the past three years in october \u003cTWO_THOUSAND\u003e mphasis acquired us headquartered sonnick partners along with its subsidiaries for a deal price of \u003cONE_HUNDRED\u003e million the acquired company conducts its business operations by the name silverline that offers cloud based solution development services based on hyperscaler salesforce this appointment reinforces mphasis commitment to investing in top level talent and further accelerating the strong momentum in our inorganic business ajay s strategic thinking combined with his extensive transaction execution experience and proven leadership qualities will be important assets in carrying out our strategic roadmap making him a tremendous addition to the existing m a team said nitin rakesh ceo and managing director mphasis","timestamp":"2024-09-18T15:01:00+05:30","market_timestamp":"2024-09-18T15:01:00+05:30","off_market_hours":false}