{"url":"https://economictimes.indiatimes.com/tech/technology/hacker-uses-telegram-chatbots-to-leak-customer-medical-reports-from-star-health/articleshow/113511477.cms","title":"Hacker uses Telegram chatbots to leak customer medical reports from Star Health","description":"Stolen customer data from India's largest health insurer, Star Health, is accessible via Telegram chatbots. The data includes sensitive information such as medical reports and ID cards. Despite Star Health's claim of no widespread compromise, the incident raises concerns about data security. Authorities are investigating the breach.","content":"Stolen customer data including medical reports from India's biggest health insurer, Star Health, is publicly accessible via chatbots on Telegram, just weeks after Telegram's founder was accused of allowing the messenger app to facilitate crime. The purported creator of the chatbots told a security researcher, who alerted Reuters to the issue, that private details of millions of people were for sale and that samples could be viewed by asking the chatbots to divulge. Star Health and Allied Insurance, whose market capitalization exceeds $4 billion, in a statement to Reuters said it has reported alleged unauthorized data access to local authorities. It said an initial assessment showed \"no widespread compromise\" and that \"sensitive customer data remains secure\". Using the chatbots, Reuters was able to download policy and claims documents featuring names, phone numbers, addresses, tax details, copies of ID cards, test results and medical diagnoses. The ability for users to create chatbots is widely credited with helping Dubai-based Telegram become one of the world's biggest messenger apps with 900 million active monthly users.","cleaned_content":"stolen customer data including medical reports from indias biggest health insurer star health is publicly accessible via chatbots on telegram just weeks after telegrams founder was accused of allowing the messenger app to facilitate crime the purported creator of the chatbots told a security researcher who alerted reuters to the issue that private details of millions of people were for sale and that samples could be viewed by asking the chatbots to divulge star health and allied insurance whose market capitalization exceeds \u003cFOUR_\u003e billion in a statement to reuters said it has reported alleged unauthorized data access to local authorities it said an initial assessment showed no widespread compromise and that sensitive customer data remains secure using the chatbots reuters was able to download policy and claims documents featuring names phone numbers addresses tax details copies of id cards test results and medical diagnoses the ability for users to create chatbots is widely credited with helping dubai based telegram become one of the worlds biggest messenger apps with \u003cNINE_HUNDRED\u003e million active monthly users","timestamp":"2024-09-20T10:22:00+05:30","market_timestamp":"2024-09-20T10:22:00+05:30","off_market_hours":false}