{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-hcl-chip-jv-may-assemble-in-up/articleshow/113302575.cms","title":"Foxconn-HCL chip JV may assemble in UP","description":"Foxconn, which is likely to invest $37.2 million, holds a 40% equity stake in the venture. It has allowed the majority partner—HCL Group—to decide the location of the unit, sources said.","content":"The joint venture between Taiwan’s Foxconn and IT services major HCL Group has been allotted around thirty acres of land, near the upcoming Jewar airport in Uttar Pradesh’s Noida, to set up a semiconductor outsourced assembly and testing (OSAT) unit, said people aware of the matter.If the proposed unit, located in the Yamuna Expressway Industrial Development Authority (YEIDA) region, gains central government approval, it will be the first such project to come up in UP, they added.Foxconn, which is likely to invest $37.2 million, holds a 40% equity stake in the venture. It has allowed the majority partner—HCL Group—to decide the location of the unit, sources said.“HCL said it prefers UP as its headquarters is located in Noida and it will have a strong home base advantage. (It) emphasised that it has a strong footing in the state and the familiarity would make it smoother to manage,” said one person cited above.Queries sent to HCL and Foxconn remained unanswered as of press time Thursday.","cleaned_content":"the joint venture between taiwan s foxconn and it services major hcl group has been allotted around thirty acres of land near the upcoming jewar airport in uttar pradesh s noida to set up a semiconductor outsourced assembly and testing osat unit said people aware of the matter if the proposed unit located in the yamuna expressway industrial development authority yeida region gains central government approval it will be the first such project to come up in up they added foxconn which is likely to invest \u003cTHREE_TEN\u003e million holds a \u003cFOUR_TEN_PERCENT\u003e equity stake in the venture it has allowed the majority partner hcl group to decide the location of the unit sources said hcl said it prefers up as its headquarters is located in noida and it will have a strong home base advantage it emphasised that it has a strong footing in the state and the familiarity would make it smoother to manage said one person cited above queries sent to hcl and foxconn remained unanswered as of press time thursday","timestamp":"2024-09-13T18:44:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}