{"url":"https://economictimes.indiatimes.com/tech/technology/nazara-acquires-15-8-stake-in-esports-firm-stan-for-2-2-million/articleshow/113262167.cms","title":"Nazara acquires 15.8% stake in esports firm Stan for $2.2 million","description":"In recent months, Nazara has made several acquisitions, particularly through its esports and events arm, Nodwin, including events firm Comic Con India, West Asia and Turkey-focused marketing firm Publishme, Singapore-based events firm Branded and Turkish esports and gaming firm Ninja Global.","content":"Listed gaming and media firm Nazara Technologies acquired a 15.86% stake in esports community platform Stan for Rs 18.4 crore ($2.2 million) in cash from its existing investors.The investment was made through Nazara's wholly owned subsidiary, Nazara Dubai FZ, the company said in a news release Wednesday.Founded by Parth Chadha, Nauman Mulla and Rahul Singh, Stan is an esports fan engagement startup that enables gamers to connect and support content creators with various tools.As of July 2024, Stan had more than 12 million users, with over 80% of them coming through organic and referral-based channels, Nazara said. Currently, the platform has more than half a million paying users.“Nazara's investment in Stan strengthens our position in the rapidly growing gaming and esports landscape. Stan’s mobile-first approach and focus on community engagement align perfectly with our vision to become a leading player in the global esports ecosystem. This acquisition allows us to expand our reach while empowering content creators and fostering a stronger gaming community,” said Nitish Mittersain, founder and chief executive of Nazara Technologies.","cleaned_content":"listed gaming and media firm nazara technologies acquired a \u003cONE_TEN_PERCENT\u003e stake in esports community platform stan for rs \u003cONE_TEN\u003e crore \u003cTWO_\u003e million in cash from its existing investors the investment was made through nazaras wholly owned subsidiary nazara dubai fz the company said in a news release wednesday founded by parth chadha nauman mulla and rahul singh stan is an esports fan engagement startup that enables gamers to connect and support content creators with various tools as of july \u003cTWO_THOUSAND\u003e stan had more than \u003cONE_TEN\u003e million users with over \u003cEIGHT_TEN_PERCENT\u003e of them coming through organic and referral based channels nazara said currently the platform has more than half a million paying users nazaras investment in stan strengthens our position in the rapidly growing gaming and esports landscape stan s mobile first approach and focus on community engagement align perfectly with our vision to become a leading player in the global esports ecosystem this acquisition allows us to expand our reach while empowering content creators and fostering a stronger gaming community said nitish mittersain founder and chief executive of nazara technologies","timestamp":"2024-09-11T18:35:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}