{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-market-share-drops-to-27-in-september-from-31-last-month-as-rivals-gain-ground/articleshow/113854447.cms","title":"Ola Electric market share drops to 27% in September from 31% last month as rivals gain ground","description":"As per data, Ola Electric sold 23,965 units in September, compared to 26,928 units in August and 40,814 units in July. Competitors Bajaj Auto, TVS Motors, and Ather Energy, recorded market shares of 21.4%, 20.2%, and 14.8%, respectively.","content":"Listed electric two-wheeler maker Ola Electric has witnessed a drop in its market share in September, amid intense competition. The Bengaluru-based company’s market share fell to 27.9% in September, down from 31.3% in August and 39.2% in July, according to Vahan data.Ola Electric sold 23,965 units in September, compared to 26,928 units in August and 40,814 units in July, the data showed. In September 2023, the company held about 47% of the overall market.Other players in India’s two-wheeler market, including Bajaj Auto, TVS Motors, and Ather Energy, recorded market shares of 21.4%, 20.2%, and 14.8%, respectively.Last month, brokerage firm Goldman Sachs said that it expects Ola Electric's revenue to grow 2.5 times faster and its volumes to increase five times more rapidly than its peers over the next three years, allowing the company to achieve earnings before interest, taxes, depreciation, and amortisation (Ebitda) breakeven.In the April-June quarter, Ola Electric's consolidated net loss widened to Rs 347 crore, up from Rs 267 crore in the same period last year. However, its operating revenue grew by 32.3% to Rs 1,644 crore, compared to Rs 1,243 crore in the corresponding quarter of the previous financial year. ","cleaned_content":"listed electric two wheeler maker ola electric has witnessed a drop in its market share in september amid intense competition the bengaluru based company s market share fell to \u003cTWO_TEN_PERCENT\u003e in september down from \u003cTHREE_TEN_PERCENT\u003e in august and \u003cTHREE_TEN_PERCENT\u003e in july according to vahan data ola electric sold \u003cTWO_TEN_THOUSAND\u003e units in september compared to \u003cTWO_TEN_THOUSAND\u003e units in august and \u003cFOUR_TEN_THOUSAND\u003e units in july the data showed in september \u003cTWO_THOUSAND\u003e the company held about \u003cFOUR_TEN_PERCENT\u003e of the overall market other players in india s two wheeler market including bajaj auto tvs motors and ather energy recorded market shares of \u003cTWO_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively last month brokerage firm goldman sachs said that it expects ola electrics revenue to grow \u003cTWO_\u003e times faster and its volumes to increase five times more rapidly than its peers over the next three years allowing the company to achieve earnings before interest taxes depreciation and amortisation ebitda breakeven in the april june quarter ola electrics consolidated net loss widened to rs \u003cTHREE_HUNDRED\u003e crore up from rs \u003cTWO_HUNDRED\u003e crore in the same period last year however its operating revenue grew by \u003cTHREE_TEN_PERCENT\u003e to rs \u003cONE_THOUSAND\u003e crore compared to rs \u003cONE_THOUSAND\u003e crore in the corresponding quarter of the previous financial year","timestamp":"2024-10-01T18:23:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}