{"url":"https://economictimes.indiatimes.com/tech/technology/oracle-to-invest-6-5-billion-to-set-up-cloud-facilities-in-malaysia/articleshow/113869515.cms","title":"Oracle to invest $6.5 billion to set up cloud facilities in Malaysia","description":"Oracle plans to invest over $6.5 billion in establishing its first public cloud region in Malaysia, enhancing the country's cloud infrastructure. This marks one of the largest tech investments in Malaysia, aimed at supporting various sectors including government and finance. This new facility will be Oracle's third in Southeast Asia.","content":"Oracle plans to invest more than $6.5 billion to set up its first public cloud region in Malaysia, the company said on Wednesday, the latest major investment by a global tech firm into the Southeast Asian country. Technology giants including Microsoft, Nvidia, Alphabet unit Google and China's ByteDance have announced billions of dollars worth of digital investments into Malaysia since last year, mostly in cloud services and data centres, powering an infrastructure boom driven by growing demand for artificial intelligence (AI). A cloud region is the physical, geographic location where a company's public cloud facilities are located. Oracle's venture is set to be one of the largest single tech investments so far, outpacing the $6.2 billion planned spending by Amazon's cloud unit AWS announced last year.   The planned public cloud region will help organisations in Malaysia modernise their applications, migrate their workload to the cloud, and innovate with data, analytics and AI, the U.S. firm said in a statement. It would also allow the firm's Malaysian customers which include government agencies, financial institutions, and airline and hospitality companies, to use cloud services based in the country, rather than those based externally, said Oracle's Executive Vice President for Japan and Asia Pacific Garret Ilg. ","cleaned_content":"oracle plans to invest more than \u003cSIX_\u003e billion to set up its first public cloud region in malaysia the company said on wednesday the latest major investment by a global tech firm into the southeast asian country technology giants including microsoft nvidia alphabet unit google and chinas bytedance have announced billions of dollars worth of digital investments into malaysia since last year mostly in cloud services and data centres powering an infrastructure boom driven by growing demand for artificial intelligence ai a cloud region is the physical geographic location where a companys public cloud facilities are located oracles venture is set to be one of the largest single tech investments so far outpacing the \u003cSIX_\u003e billion planned spending by amazons cloud unit aws announced last year the planned public cloud region will help organisations in malaysia modernise their applications migrate their workload to the cloud and innovate with data analytics and ai the u s firm said in a statement it would also allow the firms malaysian customers which include government agencies financial institutions and airline and hospitality companies to use cloud services based in the country rather than those based externally said oracles executive vice president for japan and asia pacific garret ilg","timestamp":"2024-10-02T10:45:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}