{"url":"https://economictimes.indiatimes.com/tech/technology/eu-requests-info-from-youtube-snapchat-tiktok-on-content-algorithms/articleshow/113878248.cms","title":"EU requests info from YouTube, Snapchat, TikTok on content algorithms","description":"The commission said it had requested additional information from TikTok about measures the firm had adopted to keep bad actors from manipulating the application and to reduce risks related to elections and civic discourse. The tech firms must provide the requested information by November 15, the EU said, after which the commission will decide on next steps, which could include fines.","content":"The EU Commission requested information on Wednesday from YouTube, Snapchat and TikTok on the parameters used by their algorithms to recommend content to users and their role in amplifying some systemic risks, including those related to the electoral process, mental health and protection of minors. The requests, made under the Digital Services Act (DSA), \"also concern the platforms' measures to mitigate the potential influence of their recommender systems on the spread of illegal content, such as promoting illegal drugs and hate speech,\" the EU Commission said in a statement. The commission said it had requested additional information from TikTok about measures the firm had adopted to keep bad actors from manipulating the application and to reduce risks related to elections and civic discourse. The tech firms must provide the requested information by November 15, the EU said, after which the commission will decide on next steps, which could include fines. The EU has previously opened non-compliance proceedings under the DSA, which requires Big Tech companies to do more to tackle illegal and harmful content on their platforms, related to the recommendations offered by Meta's Facebook and Instagram, AliExpress and TikTok.","cleaned_content":"the eu commission requested information on wednesday from youtube snapchat and tiktok on the parameters used by their algorithms to recommend content to users and their role in amplifying some systemic risks including those related to the electoral process mental health and protection of minors the requests made under the digital services act dsa also concern the platforms measures to mitigate the potential influence of their recommender systems on the spread of illegal content such as promoting illegal drugs and hate speech the eu commission said in a statement the commission said it had requested additional information from tiktok about measures the firm had adopted to keep bad actors from manipulating the application and to reduce risks related to elections and civic discourse the tech firms must provide the requested information by november \u003cONE_TEN\u003e the eu said after which the commission will decide on next steps which could include fines the eu has previously opened non compliance proceedings under the dsa which requires big tech companies to do more to tackle illegal and harmful content on their platforms related to the recommendations offered by metas facebook and instagram aliexpress and tiktok","timestamp":"2024-10-02T17:38:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}