{"url":"https://economictimes.indiatimes.com/tech/technology/wcd-minister-stresses-capacity-building-to-combat-cyberbullying-online-crimes-involving-minors/articleshow/113781616.cms","title":"WCD minister stresses capacity building to combat cyberbullying, online crimes involving minors","description":"\"The budget allocation for child protection, which was around Rs 60 crore in 2009-10, has been increased to approximately Rs 1,500 crore for 2024-25,\" Women and Child Development Minister Annapurna Devi said.","content":"Women and Child Development Minister Annapurna Devi on Saturday stressed the importance of capacity building and addressing issues like cyberbullying, online fraud and the involvement of minors in cyber crimes. At the 9th Annual National Stakeholders' Consultation on \"Protecting the Rights of Children Living with Disabilities\", the minister highlighted the government's growing commitment to child protection, particularly for the children in need of care and protection (CNCP) and children in conflict with the law (CiCL) who are differently-abled. She said there has been a significant increase in the child-protection budget. \"The budget allocation for child protection, which was around Rs 60 crore in 2009-10, has been increased to approximately Rs 1,500 crore for 2024-25,\" she said. Addressing the vulnerabilities faced by differently-abled children, the minister said these children often become easy targets for perpetrators of social crimes. She stressed the importance of capacity building and addressing issues like cyberbullying, online fraud and the involvement of minors in cyber crimes. ","cleaned_content":"women and child development minister annapurna devi on saturday stressed the importance of capacity building and addressing issues like cyberbullying online fraud and the involvement of minors in cyber crimes at the \u003cNINE_\u003e th annual national stakeholders consultation on protecting the rights of children living with disabilities the minister highlighted the governments growing commitment to child protection particularly for the children in need of care and protection cncp and children in conflict with the law cicl who are differently abled she said there has been a significant increase in the child protection budget the budget allocation for child protection which was around rs \u003cSIX_TEN\u003e crore in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e has been increased to approximately rs \u003cONE_THOUSAND\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e she said addressing the vulnerabilities faced by differently abled children the minister said these children often become easy targets for perpetrators of social crimes she stressed the importance of capacity building and addressing issues like cyberbullying online fraud and the involvement of minors in cyber crimes","timestamp":"2024-09-29T12:09:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}