{"url":"https://economictimes.indiatimes.com/tech/technology/google-ad-tech-trial-outcome-no-death-blow-win-or-lose/articleshow/113817901.cms","title":"Google ad tech trial outcome no death blow, win or lose","description":"The US Department of Justice and a coalition of states accuse the Alphabet unit of illegally monopolizing markets for the technology that publishers and advertisers use to buy and sell ads on websites.","content":"As Google's trial on allegations of building an illegal monopoly in advertising technology nears its close, experts said the financial risk of losing the case is minimal for the tech giant best known for its search engine. The US Department of Justice and a coalition of states accuse the Alphabet unit of illegally monopolizing markets for the technology that publishers and advertisers use to buy and sell ads on websites. Google rested its case on Friday. Closing arguments are scheduled for Nov. 25 and a ruling is expected in the coming months. The trial began one month after a US judge ruled on Aug. 5 in the DOJ's favor that Google had illegally cornered the online search market. Remedies in that case could be proposed as soon as December, while Google has said it plans to appeal the ruling. On Sept. 15, Evercore ISI lowered its price target on Alphabet stock to $200 per share from $225, citing \"probable medium-term uncertainty\" around remedies to the search case, which could include breaking up pieces of business like Google's Android mobile device operating system. Compared with the potential business implications around the search case, the ad trial is a mere flesh wound, analysts said. \"The search case is the one that has the meat in terms of how much it could affect the business. This case is more headline,\" said Scott Devitt, an analyst at Wedbush.","cleaned_content":"as googles trial on allegations of building an illegal monopoly in advertising technology nears its close experts said the financial risk of losing the case is minimal for the tech giant best known for its search engine the us department of justice and a coalition of states accuse the alphabet unit of illegally monopolizing markets for the technology that publishers and advertisers use to buy and sell ads on websites google rested its case on friday closing arguments are scheduled for nov \u003cTWO_TEN\u003e and a ruling is expected in the coming months the trial began one month after a us judge ruled on aug \u003cFIVE_\u003e in the dojs favor that google had illegally cornered the online search market remedies in that case could be proposed as soon as december while google has said it plans to appeal the ruling on sept \u003cONE_TEN\u003e evercore isi lowered its price target on alphabet stock to \u003cTWO_HUNDRED\u003e per share from \u003cTWO_HUNDRED\u003e citing probable medium term uncertainty around remedies to the search case which could include breaking up pieces of business like googles android mobile device operating system compared with the potential business implications around the search case the ad trial is a mere flesh wound analysts said the search case is the one that has the meat in terms of how much it could affect the business this case is more headline said scott devitt an analyst at wedbush","timestamp":"2024-09-30T17:20:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}