{"url":"https://economictimes.indiatimes.com/tech/technology/google-excited-about-progress-with-pixel-phones-tn-industries-minister/articleshow/113649486.cms","title":"Google excited about progress with Pixel phones:  TN industries minister","description":"Tamil Nadu industries minister TRB Rajaa reiterated that only a few weeks ago, the state government had signed an MoU for the Google Tamil Nadu AI Labs.","content":"Tamil Nadu industries minister TRB Rajaa on Tuesday said he had met representatives from Google as a continuation of the meeting that took place with the search giant while the state's Chief Minister MK Stalin was on his 17-day visit to the United States. \"Happy to note that the team was excited about the progress with Google Pixel phone, now proudly Made in TamilNadu,\" Rajaa said in a post on X (formerly Twitter). He reiterated that only a few weeks ago, the state government had signed an MoU for the Google Tamil Nadu AI Labs. \"We’re already making great progress,\" he continued. \"The AI Lab will be open soon! We also had other exciting discussions! Lots in store for Tamil Nadu!\"On August 30, Google said it had exchanged a Memorandum of Understanding (MoU) with the Government of Tamil Nadu to drive technological advancement and foster innovation in the State. ","cleaned_content":"tamil nadu industries minister trb rajaa on tuesday said he had met representatives from google as a continuation of the meeting that took place with the search giant while the states chief minister mk stalin was on his \u003cONE_TEN\u003e day visit to the united states happy to note that the team was excited about the progress with google pixel phone now proudly made in tamilnadu rajaa said in a post on x formerly twitter he reiterated that only a few weeks ago the state government had signed an mou for the google tamil nadu ai labs we re already making great progress he continued the ai lab will be open soon we also had other exciting discussions lots in store for tamil nadu on august \u003cTHREE_TEN\u003e google said it had exchanged a memorandum of understanding mou with the government of tamil nadu to drive technological advancement and foster innovation in the state","timestamp":"2024-09-25T08:41:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}