{"url":"https://economictimes.indiatimes.com/tech/technology/x-releases-its-first-transparency-report-since-elon-musks-takeover/articleshow/113677353.cms","title":"X releases its first transparency report since Elon Musk's takeover","description":"Social media platform X, formerly Twitter, has published its first transparency report since Elon Musk's acquisition. The report reveals that nearly 5.3 million accounts were suspended and over 10.6 million posts were removed or labeled for violating platform rules in the first half of the year.","content":"Social media platform X on Wednesday published its first transparency report since the company was purchased by Elon Musk. The report, which details content moderation practices, shows the company has removed millions of posts and accounts from the site in the first half of the year. X, formerly Twitter, suspended nearly 5.3 million accounts in that time, compared with the 1.6 million accounts the company reported suspending in the first half of 2022. The social media company also \"removed or labeled\" more than 10.6 million posts for violating platform rules - about 5 million of which it categorized as violating its \"hateful conduct\" policy. Posts containing \"violent content\" - 2.2 million - or \"abuse and harassment\" - 2.6 million - also accounted for a large portion of content that was labeled or removed. The company does not distinguish between how many posts were removed and how many were labeled. In an April 2023 blog post published in lieu of a transparency report, by contrast, the company said it required users to remove 6.5 million pieces of content that violated the company's rules in the first six months of 2022, an increase of 29% from the second half of 2021.  Some have blamed Musk for turning a fun platform into one that's chaotic and toxic. Musk has previously posted conspiracy theories and feuded with world leaders and politicians. X is currently banned in Brazil amid a dustup between Musk and a Brazilian Supreme Court judge over free speech, far-right accounts and misinformation.","cleaned_content":"social media platform x on wednesday published its first transparency report since the company was purchased by elon musk the report which details content moderation practices shows the company has removed millions of posts and accounts from the site in the first half of the year x formerly twitter suspended nearly \u003cFIVE_\u003e million accounts in that time compared with the \u003cONE_\u003e million accounts the company reported suspending in the first half of \u003cTWO_THOUSAND\u003e the social media company also removed or labeled more than \u003cONE_TEN\u003e million posts for violating platform rules about \u003cFIVE_\u003e million of which it categorized as violating its hateful conduct policy posts containing violent content \u003cTWO_\u003e million or abuse and harassment \u003cTWO_\u003e million also accounted for a large portion of content that was labeled or removed the company does not distinguish between how many posts were removed and how many were labeled in an april \u003cTWO_THOUSAND\u003e blog post published in lieu of a transparency report by contrast the company said it required users to remove \u003cSIX_\u003e million pieces of content that violated the companys rules in the first six months of \u003cTWO_THOUSAND\u003e an increase of \u003cTWO_TEN_PERCENT\u003e from the second half of \u003cTWO_THOUSAND\u003e some have blamed musk for turning a fun platform into one thats chaotic and toxic musk has previously posted conspiracy theories and feuded with world leaders and politicians x is currently banned in brazil amid a dustup between musk and a brazilian supreme court judge over free speech far right accounts and misinformation","timestamp":"2024-09-26T00:07:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}