{"url":"https://economictimes.indiatimes.com/tech/technology/creds-fy24-revenue-surges-66-to-rs-2473-crore-overall-losses-up-22-to-rs-1644-crore/articleshow/113813924.cms","title":"Cred’s FY24 revenue surges 66% to Rs 2,473 crore; overall losses up 22% to Rs 1,644 crore","description":"Cred, a fintech unicorn, has generated revenue from payments, credit and insurance. The company reined in marketing expenses despite promotions during IPL in the financial year.","content":"Fintech unicorn Cred on Monday reported a 66% jump in revenue to Rs 2,473 crore for 2023-24 from Rs 1,484 crore in the previous financial year. Its operating losses fell to Rs 609 crore from about Rs 1,024 crore during this period.The company reported a net loss (after expenses on employee stock ownership plan and taxes) of Rs 1,644 crore, up about 22% year-on-year.The Bengaluru-based company attributed the increase in revenue to deeper engagement with its customers and multiple avenues of revenue generation that it has built.Its marketing expenses stood at Rs 453 crore for 2023-24 and employee costs at Rs 1,199 crore, including a one-time employee stock ownership plan cost incurred during the fiscal.Overall Cred’s total payments volume surged 55% year-on-year to Rs 6.8 lakh crore.","cleaned_content":"fintech unicorn cred on monday reported a \u003cSIX_TEN_PERCENT\u003e jump in revenue to rs \u003cTWO_THOUSAND\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e from rs \u003cONE_THOUSAND\u003e crore in the previous financial year its operating losses fell to rs \u003cSIX_HUNDRED\u003e crore from about rs \u003cONE_THOUSAND\u003e crore during this period the company reported a net loss after expenses on employee stock ownership plan and taxes of rs \u003cONE_THOUSAND\u003e crore up about \u003cTWO_TEN_PERCENT\u003e year on year the bengaluru based company attributed the increase in revenue to deeper engagement with its customers and multiple avenues of revenue generation that it has built its marketing expenses stood at rs \u003cFOUR_HUNDRED\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e and employee costs at rs \u003cONE_THOUSAND\u003e crore including a one time employee stock ownership plan cost incurred during the fiscal overall cred s total payments volume surged \u003cFIVE_TEN_PERCENT\u003e year on year to rs \u003cSIX_\u003e lakh crore","timestamp":"2024-09-30T16:12:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}