{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musk-hits-out-at-britain-after-reported-summit-snub/articleshow/113701614.cms","title":"Elon Musk hits out at Britain after reported summit snub","description":"Elon Musk criticized Britain after reports that he was not invited to an investment summit due to his social media posts about recent anti-immigration riots. Musk alleged the UK government was releasing convicted paedophiles while imprisoning people for social media posts. The Labour government aims to attract investors at the upcoming summit.","content":"Elon Musk hit back at Britain on Thursday after reports that he had not been invited to the country's upcoming investment summit, alleging the government was releasing convicted paedophiles while imprisoning people over social media posts. The BBC reported that the U.S. billionaire had not been invited to the summit next month after his posts on his X platform regarding the violent, racist anti-immigration riots in Britain last month. Britain's Department for Business and Trade and the Treasury did not respond to requests for comment on either the BBC report or Musk's response. \"I don't think anyone should go to the UK when they're releasing convicted pedophiles in order to imprison people for social media posts,\" Musk said on X in response to a post on the BBC report. More than 1,700 prisoners were released early this month in an effort by Prime Minister Keir Starmer's Labour government to tackle overcrowding in prisons in England and Wales. Those serving sentences for sex offences were not included in the scheme.","cleaned_content":"elon musk hit back at britain on thursday after reports that he had not been invited to the countrys upcoming investment summit alleging the government was releasing convicted paedophiles while imprisoning people over social media posts the bbc reported that the u s billionaire had not been invited to the summit next month after his posts on his x platform regarding the violent racist anti immigration riots in britain last month britains department for business and trade and the treasury did not respond to requests for comment on either the bbc report or musks response i dont think anyone should go to the uk when theyre releasing convicted pedophiles in order to imprison people for social media posts musk said on x in response to a post on the bbc report more than \u003cONE_THOUSAND\u003e prisoners were released early this month in an effort by prime minister keir starmers labour government to tackle overcrowding in prisons in england and wales those serving sentences for sex offences were not included in the scheme","timestamp":"2024-09-26T17:00:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}