{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-judge-says-will-lift-musks-x-ban-if-1-8-mn-fine-paid/articleshow/113754520.cms","title":"Brazil judge says will lift Musk's X ban if $1.8 million fine paid","description":"A Brazilian judge locked in a legal row with X owner Elon Musk on Friday said he would reinstate the social network in Brazil if a fine of around $1.8 million was paid. High-profile judge Moraes has been engaged in a long feud with Tesla and SpaceX owner Musk as part of his drive to crack down on disinformation in Brazil.","content":"A Brazilian judge locked in a legal row with X owner Elon Musk on Friday said he would reinstate the social network in Brazil if a fine of around $1.8 million was paid.Supreme Court Justice Alexandre de Moraes last month ordered X to be shut down in Brazil, after Musk refused to remove dozens of right-wing accounts and then failed to name a new legal representative in the country as ordered.Moraes said that for X to be reactivated it must pay a fine of 10 million reais ($1.84 million), after denying a request to lift the suspension.He also said Friday that the platform will be penalized for failing for two days to comply with an order to suspend the use of a server that allowed it to temporarily circumvent the nationwide ban. High-profile judge Moraes has been engaged in a long feud with Tesla and SpaceX owner Musk as part of his drive to crack down on disinformation in Brazil.","cleaned_content":"a brazilian judge locked in a legal row with x owner elon musk on friday said he would reinstate the social network in brazil if a fine of around \u003cONE_\u003e million was paid supreme court justice alexandre de moraes last month ordered x to be shut down in brazil after musk refused to remove dozens of right wing accounts and then failed to name a new legal representative in the country as ordered moraes said that for x to be reactivated it must pay a fine of \u003cONE_TEN\u003e million reais \u003cONE_\u003e million after denying a request to lift the suspension he also said friday that the platform will be penalized for failing for two days to comply with an order to suspend the use of a server that allowed it to temporarily circumvent the nationwide ban high profile judge moraes has been engaged in a long feud with tesla and spacex owner musk as part of his drive to crack down on disinformation in brazil","timestamp":"2024-09-28T07:52:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}