{"url":"https://economictimes.indiatimes.com/tech/technology/india-a-key-market-committed-to-playing-big-role-in-digital-revolution-here-google-india-md/articleshow/113912615.cms","title":"India a key market; committed to playing big role in digital revolution here: Google India MD","description":"India MD Roma Datta Chobey said that Google is closely working with Indian start up ecosystem, and asserted that India has been and will remain an important market for the company.","content":"Google sees India as \"a very important market\" both from users and research and development perspectives, India MD Roma Datta Chobey said on Thursday asserting that the global tech giant is geared up and fully committed to playing a significant role in India's digital revolution. In an interview with PTI, Chobey said Indians are adopting and adapting AI in a big way, and added that the company is sharply focused on leveraging Artificial Intelligence (AI) to democratise information and opportunities and keen to play a significant role in developing a thriving AI ecosystem here. The Google India top boss also outlined the company's big bets in the country in areas such as AI, payments and device manufacturing. To a question on regulatory structures that are taking shape in India, she said that Google believes that AI should be regulated, in a way that ensures user benefits and fosters innovation. \"Google believes in regulations...we believe that technology should be regulated and regulated well, because it is nuanced. We believe AI should be regulated in a way that takes care of the user benefit...At the same time innovation should thrive, so it is a balance that needs to be struck,\" she said. ","cleaned_content":"google sees india as a very important market both from users and research and development perspectives india md roma datta chobey said on thursday asserting that the global tech giant is geared up and fully committed to playing a significant role in indias digital revolution in an interview with pti chobey said indians are adopting and adapting ai in a big way and added that the company is sharply focused on leveraging artificial intelligence ai to democratise information and opportunities and keen to play a significant role in developing a thriving ai ecosystem here the google india top boss also outlined the companys big bets in the country in areas such as ai payments and device manufacturing to a question on regulatory structures that are taking shape in india she said that google believes that ai should be regulated in a way that ensures user benefits and fosters innovation google believes in regulations we believe that technology should be regulated and regulated well because it is nuanced we believe ai should be regulated in a way that takes care of the user benefit at the same time innovation should thrive so it is a balance that needs to be struck she said","timestamp":"2024-10-03T19:44:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}