{"url":"https://economictimes.indiatimes.com/tech/technology/sale-is-live-ecommerce-cos-see-robust-demand-this-season/articleshow/113793121.cms","title":"Sale is live! ecommerce companies on track to hit 20-25% growth this season","description":"The first week of festive sale where Flipkart and Amazon India run their flagship events Big Billion Days and the Great Indian Festival respectively, is the most crucial during the 45-50 day sale period. This also sets the tone for the rest of the festive season running up to Diwali.","content":"Online retailers like Flipkart and Amazon are poised to record 20-25% growth in festive season sales this year, gauging from response to the first three days of sale, according to estimates from Datum Intelligence and senior industry executives briefed on the sale trajectory.During September 26-28, online retailers clocked about 26% rise in sales compared to last year, at about Rs 26,500 crore ($3.2 billion), as per Datum Intelligence, which tracks ecommerce data. The market researcher estimates gross sales of $12 billion this festive season, a growth of about 23%, including discounts and returns.Etail major Flipkart is on track to hit its internal targets for this festive season based on the first three days of sale. The first day of sale was only open to paid VIP and Plus members, similar to Amazon Prime. “Day 1 is usually for the high frequency buyers and the next day it opens to all…Now, with three days of trends in, their (Flipkart) sales remain on target,” said one of the executives cited above.","cleaned_content":"online retailers like flipkart and amazon are poised to record \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e growth in festive season sales this year gauging from response to the first three days of sale according to estimates from datum intelligence and senior industry executives briefed on the sale trajectory during september \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e online retailers clocked about \u003cTWO_TEN_PERCENT\u003e rise in sales compared to last year at about rs \u003cTWO_TEN_THOUSAND\u003e crore \u003cTHREE_\u003e billion as per datum intelligence which tracks ecommerce data the market researcher estimates gross sales of \u003cONE_TEN\u003e billion this festive season a growth of about \u003cTWO_TEN_PERCENT\u003e including discounts and returns etail major flipkart is on track to hit its internal targets for this festive season based on the first three days of sale the first day of sale was only open to paid vip and plus members similar to amazon prime day \u003cONE_\u003e is usually for the high frequency buyers and the next day it opens to all now with three days of trends in their flipkart sales remain on target said one of the executives cited above","timestamp":"2024-09-30T09:23:00+05:30","market_timestamp":"2024-09-30T09:23:00+05:30","off_market_hours":false}