{"url":"https://economictimes.indiatimes.com/tech/technology/indias-cctv-crack-down-could-impact-chinese-players/articleshow/113749309.cms","title":"India's CCTV crackdown could impact Chinese players","description":"While the gazette notifications came out in March and April this year, sources said the government has accelerated its implementation and sharpened its focus on security after the Lebanon explosions. The government is set to fast-track the implementation of guidelines on CCTV cameras, which will allow players from \"trusted locations\" to sell in India.","content":"The Centre is looking to immediately operationalise its order that will likely weed out Chinese vendors from the supply chains of all forms of surveillance equipment in the aftermath of the recent coordinated pager explosions in Lebanon, multiple sources aware of the development told ET. The move is set to benefit local companies.\"In light of the pager explosions, critical sourcing of certain components or parts of the supply chain will be looked at in a big way by the government,\" one top industry source cited above told ET. \"The government's policy on surveillance cameras is likely to come into effect on October 8. Once it comes out, all the Chinese players will be out of the picture, and Indian companies are likely to gain.\"While the gazette notifications came out in March and April this year, sources said the government has accelerated its implementation and sharpened its focus on security after the Lebanon explosions. The government is set to fast-track the implementation of guidelines on CCTV cameras, which will allow players from \"trusted locations\" to sell in India.\"The emphasis on CCTVs predates the pager explosions,\" another person told ET. \"The guidelines on security certification were issued in March and will come into effect in October. It is less about explosions and more about leakage of data that includes sensitive data as CCTV cameras are also installed at sensitive locations and can be used to track movements of people. You do not want to be using cameras that are not made in trusted locations–and for that purpose.\"Visibility \u0026 controlThis person said a 'trusted location' would be one where New Delhi has visibility on the entire manufacturing chain and is convinced that the manufacturing chain is ‘okay’ and that there are ‘no backdoors’ in the equipment, which will either leak or take data out. While this person ruled out a \"rip and replace\" policy at this point, he said it was something that could be in the works eventually.","cleaned_content":"the centre is looking to immediately operationalise its order that will likely weed out chinese vendors from the supply chains of all forms of surveillance equipment in the aftermath of the recent coordinated pager explosions in lebanon multiple sources aware of the development told et the move is set to benefit local companies in light of the pager explosions critical sourcing of certain components or parts of the supply chain will be looked at in a big way by the government one top industry source cited above told et the governments policy on surveillance cameras is likely to come into effect on october \u003cEIGHT_\u003e once it comes out all the chinese players will be out of the picture and indian companies are likely to gain while the gazette notifications came out in march and april this year sources said the government has accelerated its implementation and sharpened its focus on security after the lebanon explosions the government is set to fast track the implementation of guidelines on cctv cameras which will allow players from trusted locations to sell in india the emphasis on cctvs predates the pager explosions another person told et the guidelines on security certification were issued in march and will come into effect in october it is less about explosions and more about leakage of data that includes sensitive data as cctv cameras are also installed at sensitive locations and can be used to track movements of people you do not want to be using cameras that are not made in trusted locations and for that purpose visibility controlthis person said a trusted location would be one where new delhi has visibility on the entire manufacturing chain and is convinced that the manufacturing chain is okay and that there are no backdoors in the equipment which will either leak or take data out while this person ruled out a rip and replace policy at this point he said it was something that could be in the works eventually","timestamp":"2024-09-28T16:20:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}