{"url":"https://economictimes.indiatimes.com/tech/technology/google-expert-at-antitrust-trial-says-government-underestimates-competition-for-online-ad-dollars/articleshow/113720932.cms","title":"Google expert at antitrust trial says government underestimates competition for online ad dollars","description":"Mark Israel, an economist who prepared an expert report on Google's behalf, said the government's claims that Google holds a monopoly over advertising technology are improperly focused on a narrow market the government defines as \"open web display advertising,\" essentially the rectangular ads that appear on the top and along the right hand side of a web page when a consumer browses the web on a desktop computer.","content":"Federal regulators who say Google holds an illegal monopoly over the technology that matches online advertisers to publishers are vastly underestimating the competition the tech giant faces, an expert hired by Google testified Thursday. Mark Israel, an economist who prepared an expert report on Google's behalf, said the government's claims that Google holds a monopoly over advertising technology are improperly focused on a narrow market the government defines as \"open web display advertising,\" essentially the rectangular ads that appear on the top and along the right hand side of a web page when a consumer browses the web on a desktop computer. But the government's case fails to account for a variety of competition that occurs beyond those rectangular boxes, Israel said. In the real world, advertisers have dramatically shifted where they spend money to social media companies like Facebook and TikTok, and online retailers like Amazon. When you account for all online display advertising, not just the narrow segment defined by the government's case, Google gets just 10% of the U.S. market share as of 2022, he said. That's down from roughly 15% a decade ago. In addition, advertisers have moved away from placing their ads on the screens of desktop and laptop computers where Google is alleged to control the market, with money migrating to ads placed on apps and mobile device screens. Israel cited marketing data showing display ad spending on desktop and laptop devices has decreased from 71% in 2013 to 17% in 2022. The government's case \"seems to miss where the competition is today,\" Israel said. ","cleaned_content":"federal regulators who say google holds an illegal monopoly over the technology that matches online advertisers to publishers are vastly underestimating the competition the tech giant faces an expert hired by google testified thursday mark israel an economist who prepared an expert report on googles behalf said the governments claims that google holds a monopoly over advertising technology are improperly focused on a narrow market the government defines as open web display advertising essentially the rectangular ads that appear on the top and along the right hand side of a web page when a consumer browses the web on a desktop computer but the governments case fails to account for a variety of competition that occurs beyond those rectangular boxes israel said in the real world advertisers have dramatically shifted where they spend money to social media companies like facebook and tiktok and online retailers like amazon when you account for all online display advertising not just the narrow segment defined by the governments case google gets just \u003cONE_TEN_PERCENT\u003e of the u s market share as of \u003cTWO_THOUSAND\u003e he said thats down from roughly \u003cONE_TEN_PERCENT\u003e a decade ago in addition advertisers have moved away from placing their ads on the screens of desktop and laptop computers where google is alleged to control the market with money migrating to ads placed on apps and mobile device screens israel cited marketing data showing display ad spending on desktop and laptop devices has decreased from \u003cSEVEN_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e to \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the governments case seems to miss where the competition is today israel said","timestamp":"2024-09-27T08:30:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}