{"url":"https://economictimes.indiatimes.com/tech/technology/epic-games-accuses-samsung-google-of-scheme-to-block-app-rivals/articleshow/113814844.cms","title":"Epic Games accuses Samsung, Google of scheme to block app rivals","description":"Epic said it would file a lawsuit in US federal court in California alleging that a Samsung mobile security feature called Auto Blocker was intended to deter users from downloading apps from sources other than the Play store or Samsung's Galaxy store, which the Korean company chose to put on the back burner.","content":"\"Fortnite\" video game maker Epic Games on Monday accused Alphabet's Google and Samsung , the world's largest Android phone manufacturer, of conspiring to protect Google's Play store from competition.Epic said it would file a lawsuit in US federal court in California alleging that a Samsung mobile security feature called Auto Blocker was intended to deter users from downloading apps from sources other than the Play store or Samsung's Galaxy store, which the Korean company chose to put on the back burner.Samsung and Google are violating US antitrust law by reducing consumer choice and preventing competition that would make apps less expensive, said US-based Epic, which is backed by China's Tencent said.\"It's about unfair competition by misleading users into thinking competitors' products are inferior to the company's products themselves,\" Epic Chief Executive Tim Sweeney told reporters.\"Google is pretending to keep the user safe saying you're not allowed to install apps from unknown sources. Well, Google knows what Fortnite is as they have distributed it in the past.\"","cleaned_content":"fortnite video game maker epic games on monday accused alphabets google and samsung the worlds largest android phone manufacturer of conspiring to protect googles play store from competition epic said it would file a lawsuit in us federal court in california alleging that a samsung mobile security feature called auto blocker was intended to deter users from downloading apps from sources other than the play store or samsungs galaxy store which the korean company chose to put on the back burner samsung and google are violating us antitrust law by reducing consumer choice and preventing competition that would make apps less expensive said us based epic which is backed by chinas tencent said its about unfair competition by misleading users into thinking competitors products are inferior to the companys products themselves epic chief executive tim sweeney told reporters google is pretending to keep the user safe saying youre not allowed to install apps from unknown sources well google knows what fortnite is as they have distributed it in the past","timestamp":"2024-09-30T16:45:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}