{"url":"https://economictimes.indiatimes.com/tech/technology/tesla-misses-estimates-for-third-quarter-deliveries-on-stiff-competition/articleshow/113880999.cms","title":"Tesla misses estimates for third-quarter deliveries on stiff competition","description":"Growing consumer interest in hybrids over EVs, a lack of European subsidies and strong competition in China were a drag on Tesla's deliveries, as Chinese automakers such as BYD and Xpeng aggressively expand their presence in the world's largest automotive market, with help from local government subsidies.","content":"Tesla handed over fewer vehicles than analysts expected in the third quarter as stiff competition in China and Europe hit demand for its aging models, putting the electric-vehicle maker at risk of its first-ever decline in annual deliveries. Shares of the world's most valuable automaker fell more than 6% in morning trading on Wednesday and were on track to erase nearly all their gains for the year. Growing consumer interest in hybrids over EVs, a lack of European subsidies and strong competition in China were a drag on Tesla's deliveries, as Chinese automakers such as BYD and Xpeng aggressively expand their presence in the world's largest automotive market, with help from local government subsidies. Tesla said deliveries rose 6.4% in the July-September period to 462,890 vehicles, marking its first quarter of growth this year. But the figure fell short of estimates of 469,828, according to 12 analysts polled by LSEG \"Falling short of expectations could indicate difficulty in meeting overall delivery targets for 2024 and prospects for sustainable growth beyond the current lineup,\" said Gadjo Sevilla, senior tech analyst at eMarketer.","cleaned_content":"tesla handed over fewer vehicles than analysts expected in the third quarter as stiff competition in china and europe hit demand for its aging models putting the electric vehicle maker at risk of its first ever decline in annual deliveries shares of the worlds most valuable automaker fell more than \u003cSIX_PERCENT\u003e in morning trading on wednesday and were on track to erase nearly all their gains for the year growing consumer interest in hybrids over evs a lack of european subsidies and strong competition in china were a drag on teslas deliveries as chinese automakers such as byd and xpeng aggressively expand their presence in the worlds largest automotive market with help from local government subsidies tesla said deliveries rose \u003cSIX_PERCENT\u003e in the july september period to \u003cFOUR_HUNDRED_THOUSAND\u003e vehicles marking its first quarter of growth this year but the figure fell short of estimates of \u003cFOUR_HUNDRED_THOUSAND\u003e according to \u003cONE_TEN\u003e analysts polled by lseg falling short of expectations could indicate difficulty in meeting overall delivery targets for \u003cTWO_THOUSAND\u003e and prospects for sustainable growth beyond the current lineup said gadjo sevilla senior tech analyst at emarketer","timestamp":"2024-10-02T20:03:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}