{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musk-x-seek-dismissal-of-don-lemons-lawsuit-over-canceled-partnership/articleshow/113658998.cms","title":"Elon Musk, X seek dismissal of Don Lemon's lawsuit over canceled partnership","description":"Musk called it unreasonable for Lemon to rely on a vague statement that a written contract was unnecessary for a multimillion-dollar partnership. The billionaire also blamed the collapse of the partnership in March on Lemon, saying he genuinely believed it would work before Lemon \"soured the relationship by conducting an invasive and inappropriate interview of him.\"","content":"Elon Musk and X asked a federal judge to dismiss former CNN anchor Don Lemon's lawsuit claiming they defrauded him by canceling a partnership on the social media platform following a contentious interview. In a Monday night filing in San Francisco federal court, Musk said he did nothing wrong by allegedly telling Lemon there was \"no need\" to sign a contract, and that he and X would give Lemon \"full authority and control\" over his work even if they did not like his views. Musk called it unreasonable for Lemon to rely on a vague statement that a written contract was unnecessary for a multimillion-dollar partnership. The billionaire also blamed the collapse of the partnership in March on Lemon, saying he genuinely believed it would work before Lemon \"soured the relationship by conducting an invasive and inappropriate interview of him.\" Lemon's interview addressed content moderation, hate speech and Musk's drug use, among other subjects.","cleaned_content":"elon musk and x asked a federal judge to dismiss former cnn anchor don lemons lawsuit claiming they defrauded him by canceling a partnership on the social media platform following a contentious interview in a monday night filing in san francisco federal court musk said he did nothing wrong by allegedly telling lemon there was no need to sign a contract and that he and x would give lemon full authority and control over his work even if they did not like his views musk called it unreasonable for lemon to rely on a vague statement that a written contract was unnecessary for a multimillion dollar partnership the billionaire also blamed the collapse of the partnership in march on lemon saying he genuinely believed it would work before lemon soured the relationship by conducting an invasive and inappropriate interview of him lemons interview addressed content moderation hate speech and musks drug use among other subjects","timestamp":"2024-09-25T13:01:00+05:30","market_timestamp":"2024-09-25T13:01:00+05:30","off_market_hours":false}