{"url":"https://economictimes.indiatimes.com/tech/technology/groww-reports-over-300-rise-in-net-profit-at-rs-297-crore-in-fy24-icra/articleshow/113859686.cms","title":"Groww reports over 300% rise in net profit at Rs 297 crore in FY24: ICRA","description":"India’s largest broking platform by active investors more than doubled its revenue during the fiscal to Rs 2,899 crore. Despite the Tiger Global-backed stock broking platform foraying into the margin trading facility business, which would result in higher dependence on borrowings, Groww’s financial leverage is expected to remain comfortable, said ICRA.","content":"Tiger Global-backed stock broking platform Groww has reported a net profit of Rs 297 crore in FY24, a 300% increase from Rs 73 crore in the previous year, according to filings made with credit rating agency ICRA. In FY24, its overall revenue more than doubled to Rs 2,899 crore, compared to Rs 1,294 crore in 2023.The continued growth in Groww’s client base has been supporting the scale-up in its broking volumes and earnings. Despite its foray into the margin trading facility (MTF) business, which will lead to higher dependence on borrowings, Groww’s financial leverage is expected to remain comfortable, the ICRA report noted.In FY23, the company’s revenue rose 252% from Rs 367.4 crore in the previous year. However, expenses during that period surged almost 3.5 times to Rs 1,197 crore.In August, Groww had around 11.5 million active clients as per the National Stock Exchange data.","cleaned_content":"tiger global backed stock broking platform groww has reported a net profit of rs \u003cTWO_HUNDRED\u003e crore in fy24 a \u003cTHREE_HUNDRED_PERCENT\u003e increase from rs \u003cSEVEN_TEN\u003e crore in the previous year according to filings made with credit rating agency icra in fy24 its overall revenue more than doubled to rs \u003cTWO_THOUSAND\u003e crore compared to rs \u003cONE_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e the continued growth in groww s client base has been supporting the scale up in its broking volumes and earnings despite its foray into the margin trading facility mtf business which will lead to higher dependence on borrowings groww s financial leverage is expected to remain comfortable the icra report noted in fy23 the company s revenue rose \u003cTWO_HUNDRED_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore in the previous year however expenses during that period surged almost \u003cTHREE_\u003e times to rs \u003cONE_THOUSAND\u003e crore in august groww had around \u003cONE_TEN\u003e million active clients as per the national stock exchange data","timestamp":"2024-10-01T22:18:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}