{"url":"https://economictimes.indiatimes.com/tech/technology/cloudflare-denies-hosting-sites-linked-to-data-leak-at-indias-star-health/articleshow/113784292.cms","title":"Cloudflare denies hosting sites linked to data leak at India's Star Health","description":"The company has received a temporary injunction from a court in its southern home state of Tamil Nadu ordering Telegram and the hacker to block any chatbots or websites in India that make the data available online.","content":"U.S. software firm Cloudflare has denied any role in hosting two websites run by a hacker offering for sale stolen personal data and medical records of customers of top Indian insurer Star Health. The statement comes after the company was made party to an Indian lawsuit filed by Star Health last week, in which the insurer alleged that Cloudflare hosted the websites in question. \"Cloudflare is not the host for the domains in question,\" the firm told Reuters, adding that it works as a pass-through service situated between a website host and an end-user, which is why one may see a Cloudflare IP address. Star has also sued Telegram and the self-styled hacker xenZen, after Reuters reported that sensitive personal data, from telephone numbers to copies of identity cards and blood reports of its customers, were publicly accessible via Telegram chatbots. The websites and Telegram bots were inaccessible on Sunday.","cleaned_content":"u s software firm cloudflare has denied any role in hosting two websites run by a hacker offering for sale stolen personal data and medical records of customers of top indian insurer star health the statement comes after the company was made party to an indian lawsuit filed by star health last week in which the insurer alleged that cloudflare hosted the websites in question cloudflare is not the host for the domains in question the firm told reuters adding that it works as a pass through service situated between a website host and an end user which is why one may see a cloudflare ip address star has also sued telegram and the self styled hacker xenzen after reuters reported that sensitive personal data from telephone numbers to copies of identity cards and blood reports of its customers were publicly accessible via telegram chatbots the websites and telegram bots were inaccessible on sunday","timestamp":"2024-09-29T14:37:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}