{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-tops-1-8-billion-ad-spending-commitment-target-for-video-streaming-services-reports/articleshow/113733307.cms","title":"Amazon tops $1.8 billion ad-spending commitment target for video-streaming services: reports","description":"The spending commitments include ads on Prime Video and Amazon's live sports telecasts, such as the National Football League's Thursday Night Football games, the report said. The ecommerce giant is betting it can keep its ad revenue growth going by investing in streaming TV and capturing a meaningful share of ad budgets, especially as they increasingly shift toward streaming-video services.","content":"Amazon has exceeded its goal of attracting $1.8 billion in ad-spending commitments on its video-streaming services for next year, The Information reported on Thursday citing a person with direct knowledge of the company's ad sales efforts. Advertisers negotiate large TV and streaming ad commitments for the coming 12 months in the upfront ad market, which recently concluded for 2024.  The spending commitments include ads on Prime Video and Amazon's live sports telecasts, such as the National Football League's Thursday Night Football games, the report said.  The ecommerce giant is betting it can keep its ad revenue growth going by investing in streaming TV and capturing a meaningful share of ad budgets, especially as they increasingly shift toward streaming-video services.  Amazon declined to comment on the report when contacted by Reuters.","cleaned_content":"amazon has exceeded its goal of attracting \u003cONE_\u003e billion in ad spending commitments on its video streaming services for next year the information reported on thursday citing a person with direct knowledge of the companys ad sales efforts advertisers negotiate large tv and streaming ad commitments for the coming \u003cONE_TEN\u003e months in the upfront ad market which recently concluded for \u003cTWO_THOUSAND\u003e the spending commitments include ads on prime video and amazons live sports telecasts such as the national football leagues thursday night football games the report said the ecommerce giant is betting it can keep its ad revenue growth going by investing in streaming tv and capturing a meaningful share of ad budgets especially as they increasingly shift toward streaming video services amazon declined to comment on the report when contacted by reuters","timestamp":"2024-09-27T13:57:00+05:30","market_timestamp":"2024-09-27T13:57:00+05:30","off_market_hours":false}