{"url":"https://economictimes.indiatimes.com/tech/technology/deep-discounts-and-cash-backs-during-festive-sales-by-e-commerce-companies-are-killing-small-retailers-cait/articleshow/113873720.cms","title":"Deep discounts and cash backs during festive sales by e-commerce companies are killing small retailers: CAIT","description":"Industry body Confederation of All India Traders (CAIT) has raised concerns on the deep discounts or cashbacks provided by the e-commerce festive sales by the companies, which tends to monopolise the retail market, hence reducing the abilities of the small offline retailers.","content":"Industry body Confederation of All India Traders (CAIT) has raised concerns on the deep discounts or cashbacks provided by the e-commerce festive sales by the companies, which tends to monopolise the retail market, hence reducing the abilities of the small offline retailers. The industry body recomended suspending the e-commerce festival sale along with several other recommendations to provide a level playing field to all the players in India's retail ecosystem.\"Exclusive cashbacks are anti-competitive and encourage grey market operations. A ban would help restore fairness in the market,\" the industry body stated in its whitepaper. It highlighted, citing the Competition Commission of India (CCI) findings, that the cash burn strategies and collusive partnerships of the e-commerce platform enable them to monopolise markets by forming exclusive alliances with OEMs and banks.\"This anti-competitive behaviour forced customers to rely on e-commerce platforms, sidelining the traditional retail sector,\" the CAIT added in its while paper. ","cleaned_content":"industry body confederation of all india traders cait has raised concerns on the deep discounts or cashbacks provided by the e commerce festive sales by the companies which tends to monopolise the retail market hence reducing the abilities of the small offline retailers the industry body recomended suspending the e commerce festival sale along with several other recommendations to provide a level playing field to all the players in indias retail ecosystem exclusive cashbacks are anti competitive and encourage grey market operations a ban would help restore fairness in the market the industry body stated in its whitepaper it highlighted citing the competition commission of india cci findings that the cash burn strategies and collusive partnerships of the e commerce platform enable them to monopolise markets by forming exclusive alliances with oems and banks this anti competitive behaviour forced customers to rely on e commerce platforms sidelining the traditional retail sector the cait added in its while paper","timestamp":"2024-10-02T14:00:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}