{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-looking-to-pump-in-about-1-billion-to-set-up-smartphone-assembly-unit/articleshow/113641511.cms","title":"Foxconn plans $1 billion display assembly unit in Tamil Nadu","description":"While the upcoming unit will primarily cater to Apple, it will also service other customers. Foxconn's model is going to be one wherein even other contract manufacturers can use the components from this unit, the sources said.","content":"Foxconn is evaluating an investment of about $1 billion to set up an assembling unit for smartphone display modules in Tamil Nadu, according to people aware of developments.This will be the first such facility to be set up by the Taiwanese contract manufacturer in India, from where it plans to primarily cater to Apple for the iconic iPhone.However, Foxconn's model is going to be one wherein even other contract manufacturers—Pegatron or Tata Electronics, for instance—can use components from this unit rather than import modules that are assembled in China, said those cited above.While there is no fixed timeline, people in the know told ET the company wanted the facility up and running “as soon as possible.”Queries sent to Foxconn remained unanswered as of press time on Tuesday.","cleaned_content":"foxconn is evaluating an investment of about \u003cONE_\u003e billion to set up an assembling unit for smartphone display modules in tamil nadu according to people aware of developments this will be the first such facility to be set up by the taiwanese contract manufacturer in india from where it plans to primarily cater to apple for the iconic iphone however foxconns model is going to be one wherein even other contract manufacturers pegatron or tata electronics for instance can use components from this unit rather than import modules that are assembled in china said those cited above while there is no fixed timeline people in the know told et the company wanted the facility up and running as soon as possible queries sent to foxconn remained unanswered as of press time on tuesday","timestamp":"2024-09-25T06:01:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}