{"url":"https://economictimes.indiatimes.com/tech/technology/california-passes-law-protecting-consumer-brain-data/articleshow/113805957.cms","title":"California passes law protecting consumer brain data","description":"The new law, which passed both the California Assembly and the Senate with no voter opposition, amends the state's current personal privacy law -- known as the California Consumer Privacy Act -- by including \"neural data\" under \"personal sensitive information.\" This includes data generated by a user's brain activity and the meshwork of nerves that extends to the rest of the body.","content":"On Saturday, California Gov. Gavin Newsom signed a new law that aims to protect people's brain data from being potentially misused by neurotechnology companies. A growing number of consumer technology products promise to help address cognitive issues: apps to meditate, to improve focus and to treat mental health conditions such as depression. These products monitor and record brain data, which encodes virtually everything that goes on in the mind, including thoughts, feelings and intentions. The new law, which passed both the California Assembly and the Senate with no voter opposition, amends the state's current personal privacy law -- known as the California Consumer Privacy Act -- by including \"neural data\" under \"personal sensitive information.\" This includes data generated by a user's brain activity and the meshwork of nerves that extends to the rest of the body. \"I'm very excited,\" said Sen. Josh Becker, a Democrat, who sponsored the bill. \"It's important that we be up front about protecting the privacy of neural data -- a very important set of data that belongs to people.\" With tens of thousands of tech startups, California is a hub for tech innovation. This includes smaller companies developing brain technologies, but Big Tech companies such as Meta and Apple are also developing devices that will probably involve collecting vast troves of brain data.","cleaned_content":"on saturday california gov gavin newsom signed a new law that aims to protect peoples brain data from being potentially misused by neurotechnology companies a growing number of consumer technology products promise to help address cognitive issues apps to meditate to improve focus and to treat mental health conditions such as depression these products monitor and record brain data which encodes virtually everything that goes on in the mind including thoughts feelings and intentions the new law which passed both the california assembly and the senate with no voter opposition amends the states current personal privacy law known as the california consumer privacy act by including neural data under personal sensitive information this includes data generated by a users brain activity and the meshwork of nerves that extends to the rest of the body im very excited said sen josh becker a democrat who sponsored the bill its important that we be up front about protecting the privacy of neural data a very important set of data that belongs to people with tens of thousands of tech startups california is a hub for tech innovation this includes smaller companies developing brain technologies but big tech companies such as meta and apple are also developing devices that will probably involve collecting vast troves of brain data","timestamp":"2024-09-30T12:20:00+05:30","market_timestamp":"2024-09-30T12:20:00+05:30","off_market_hours":false}