{"url":"https://economictimes.indiatimes.com/tech/technology/x-making-more-changes-to-block-button/articleshow/113635264.cms","title":"‘X’  making more changes to block button","description":"Musk clarified on X, following a tweet by former Tesla engineer and AI researcher Nima Owji that the platform's new policy will not allow blocked accounts to interact with users, but will still show up in their feeds.","content":"Elon Musk-owned ‘X’ has confirmed it is making changes to the block button that will allow all public posts to be visible even to blocked accounts.Musk clarified on X, following a tweet by former Tesla engineer and AI researcher Nima Owji that the platform's new policy will not allow blocked accounts to interact with users, but will still show up in their feeds. “The block function will block that account from engaging with, but not block seeing, public posts,” he said.This is not the first time that ‘X’ has tried to experiment with the platform. Earlier in May, it allowed tweet replies by a blocked account to be visible on feed. Musk suggested that the block feature is outdated, arguing that it “doesn't make sense” and should be replaced with a more effective \"mute\" function. ","cleaned_content":"elon musk owned x has confirmed it is making changes to the block button that will allow all public posts to be visible even to blocked accounts musk clarified on x following a tweet by former tesla engineer and ai researcher nima owji that the platforms new policy will not allow blocked accounts to interact with users but will still show up in their feeds the block function will block that account from engaging with but not block seeing public posts he said this is not the first time that x has tried to experiment with the platform earlier in may it allowed tweet replies by a blocked account to be visible on feed musk suggested that the block feature is outdated arguing that it doesnt make sense and should be replaced with a more effective mute function","timestamp":"2024-09-24T17:55:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}