{"url":"https://economictimes.indiatimes.com/tech/technology/the-tech-bro-style-in-american-politics/articleshow/113731004.cms","title":"The tech bro style in American politics","description":"Elon Musk's right-wing turn isn't universal or even typical, reporting suggests that even with the rightward turn of several boldface names, Silicon Valley remains heavily Democratic. In particular, political contributions from the internet industry remain strongly tilted toward Democrats. But right-wing tech bros are exerting a significant and, I'd argue, malign influence on the political landscape.","content":"It seems hard to believe now, but in 2021, Time named Elon Musk its Person of the Year. True, that designation doesn't necessarily equate to a stamp of approval. But the magazine's coverage of Musk at the time was very favorable, almost fawning, highlighting his assertion that \"my career is Mars and cars.\" A lot of people would disagree with that declaration now. Of course, Tesla and SpaceX remain big businesses. But Musk himself is largely defined in many minds by the way he changed X, the site formerly known as Twitter -- making more room for right-wing extremists, including a substantial number of pro-Nazi accounts, and his own embrace of antisemitic and racist conspiracy theories. Musk's right-wing turn isn't universal or even typical: Reporting suggests that even with the rightward turn of several boldface names, Silicon Valley remains heavily Democratic. Political contributions from the internet industry, in particular, remain strongly tilted toward Democrats. But right-wing tech bros are exerting a significant and, I'd argue, malign influence on the political landscape. Consider the case of JD Vance, the junior senator from Ohio and Donald Trump's running mate. How did Vance get to where he is? He's a remarkable campaigner -- remarkable, that is, in the sense that he seems incredibly bad at it. I won't rehash the \"cat ladies\" contretemps except to say that it contributed to what will probably go down as one of the worst running-mate rollouts of all time. So who picked this guy?","cleaned_content":"it seems hard to believe now but in \u003cTWO_THOUSAND\u003e time named elon musk its person of the year true that designation doesnt necessarily equate to a stamp of approval but the magazines coverage of musk at the time was very favorable almost fawning highlighting his assertion that my career is mars and cars a lot of people would disagree with that declaration now of course tesla and spacex remain big businesses but musk himself is largely defined in many minds by the way he changed x the site formerly known as twitter making more room for right wing extremists including a substantial number of pro nazi accounts and his own embrace of antisemitic and racist conspiracy theories musks right wing turn isnt universal or even typical reporting suggests that even with the rightward turn of several boldface names silicon valley remains heavily democratic political contributions from the internet industry in particular remain strongly tilted toward democrats but right wing tech bros are exerting a significant and id argue malign influence on the political landscape consider the case of jd vance the junior senator from ohio and donald trumps running mate how did vance get to where he is hes a remarkable campaigner remarkable that is in the sense that he seems incredibly bad at it i wont rehash the cat ladies contretemps except to say that it contributed to what will probably go down as one of the worst running mate rollouts of all time so who picked this guy","timestamp":"2024-09-27T13:11:00+05:30","market_timestamp":"2024-09-27T13:11:00+05:30","off_market_hours":false}