{"url":"https://economictimes.indiatimes.com/tech/technology/russia-orders-discord-to-remove-almost-1000-posts-it-says-contain-illegal-materials/articleshow/113873487.cms","title":"Russia orders Discord to remove almost 1,000 posts it says contain illegal materials","description":"Russia’s communications regulator, Roskomnadzor, has ordered Discord to remove nearly 1,000 posts deemed illegal, including content promoting child pornography, drug abuse, extremism, and suicide, as well as LGBT propaganda.","content":"Russia's communications regulator has ordered instant messaging platform Discord to delete almost 1,000 materials it deems illegal, including posts it says contain child pornography and promoting drug abuse, the TASS news agency reported on Tuesday. San Francisco-based Discord and the regulator, Roskomnadzor, did not immediately respond to requests for comment.  Roskomnadzor is demanding the removal of 947 illegal materials, TASS cited Roskomnadzor as saying, including posts \"containing child pornography, calls for extremism, the involvement of minors in illegal activity, calls for suicide, LGBT propaganda, and pro-drug content\".  Russia has for several years ordered foreign technology platforms to remove content it regards as illegal, issuing relatively small, but regular fines when it sees failures to comply. Moscow last year widened restrictions on the promotion of what it calls \"LGBT propaganda\" amid a broader crackdown on LGBT rights, amid a push by President Vladimir Putin to promote what he calls traditional values. ","cleaned_content":"russias communications regulator has ordered instant messaging platform discord to delete almost \u003cONE_THOUSAND\u003e materials it deems illegal including posts it says contain child pornography and promoting drug abuse the tass news agency reported on tuesday san francisco based discord and the regulator roskomnadzor did not immediately respond to requests for comment roskomnadzor is demanding the removal of \u003cNINE_HUNDRED\u003e illegal materials tass cited roskomnadzor as saying including posts containing child pornography calls for extremism the involvement of minors in illegal activity calls for suicide lgbt propaganda and pro drug content russia has for several years ordered foreign technology platforms to remove content it regards as illegal issuing relatively small but regular fines when it sees failures to comply moscow last year widened restrictions on the promotion of what it calls lgbt propaganda amid a broader crackdown on lgbt rights amid a push by president vladimir putin to promote what he calls traditional values","timestamp":"2024-10-02T13:47:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}