{"url":"https://economictimes.indiatimes.com/tech/technology/pm-modi-meets-top-tech-ceos-jensen-huang-sundar-pichai-others-in-the-us/articleshow/113596726.cms","title":"PM Modi meets top tech CEOs Jensen Huang, Sundar Pichai, others in the US","description":"The 15 technology CEOs who attended the roundtable included Julie Sweet, CEO, Accenture; Shantanu Narayen, CEO, Adobe; Lisa Su, CEO, AMD; Arvind Krishna, CEO, IBM and Jensen Huang, CEO, Nvidia among others. The tech-roundtable focused on artificial intelligence (AI) and quantum; biotechnology and life sciences; computing, IT and communication; and semiconductor technologies, as per a statement from the Ministry of External Affairs.","content":"This is India's moment and the country should seize it, Nvidia chief executive Jensen Huang said after a roundtable in New York between Prime Minister Narendra Modi and top technology industry CEOs. Sundar Pichai, the CEO of Google and its parent Alphabet, said the Prime Minister has a clear vision of the opportunity that artificial intelligence will create, and is challenging top companies to do more in India.Huang and Pichai were among 15 CEOs of companies specialising in artificial intelligence, quantum computing, semiconductors and biotechnology who attended the meeting organised by the Massachusetts Institute of Technology School of Engineering on Sunday. Others included Julie Sweet of Accenture, Shantanu Narayen of Adobe, Lisa Su of AMD and IBM’s Arvind Krishna.The Prime Minister stressed that India's policy is to promote “AI for All”, underpinned by the technology’s ethical and responsible use, the Ministry of External Affairs said in a news release. ","cleaned_content":"this is indias moment and the country should seize it nvidia chief executive jensen huang said after a roundtable in new york between prime minister narendra modi and top technology industry ceos sundar pichai the ceo of google and its parent alphabet said the prime minister has a clear vision of the opportunity that artificial intelligence will create and is challenging top companies to do more in india huang and pichai were among \u003cONE_TEN\u003e ceos of companies specialising in artificial intelligence quantum computing semiconductors and biotechnology who attended the meeting organised by the massachusetts institute of technology school of engineering on sunday others included julie sweet of accenture shantanu narayen of adobe lisa su of amd and ibm s arvind krishna the prime minister stressed that indias policy is to promote ai for all underpinned by the technology s ethical and responsible use the ministry of external affairs said in a news release","timestamp":"2024-09-23T20:39:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}