{"url":"https://economictimes.indiatimes.com/tech/information-tech/infosys-signs-deals-with-polestar-to-open-tech-hub-in-bengaluru/articleshow/113669338.cms","title":"Infosys signs deals with Polestar to open tech hub in Bengaluru","description":"Infosys in a filing with BSE, said it will also leverage in-tech, its latest acquisition in the R\u0026D space, to complement the engagement. The IT major in April this year acquired in-tech, an engineering R\u0026D services provider focused on German automotive industry. The company then had said that the strategic investment would strengthen Infosys’ engineering R\u0026D capabilities.","content":"Infosys on Wednesday signed a deal with Swedish electric car brand, Polestar to establish a global technology hub for the latter at its development center in Bengaluru. The second largest Indian IT service major will also create a base for Polestar’s development of in-car infotainment, software and electrical / electronics (SW\u0026EE) engineering, user experience (UX), and cloud-powered digital services.Infosys in a filing with BSE, said it will also leverage in-tech, its latest acquisition in the R\u0026D space, to complement the engagement. The IT major in April this year acquired in-tech, an engineering R\u0026D services provider focused on German automotive industry. The company then had said that the strategic investment would strengthen Infosys’ engineering R\u0026D capabilities.The global technology hub that Infosys will establish for Polestar will aim to deliver electric vehicle (EV) software development and validation across many domains including infotainment, Advanced Driver Assistance Systems (ADAS), and telematics, added the filing.Maria Lexe, head of digital at Polestar, said, “Polestar is excited to partner with Infosys to establish a tech hub in India. Infosys has a successful background with similar operations, and we are confident in their ability to lead this tech hub in order to generate IT efficiencies and empower innovation.”Sven Bauer, head of software at Polestar, said, “Polestar is starting a new chapter in the company’s global setup with our partner, Infosys in Bengaluru. We look forward to building automotive competence in the Polestar tech hub to support our growing vehicle portfolio and new model launches.”","cleaned_content":"infosys on wednesday signed a deal with swedish electric car brand polestar to establish a global technology hub for the latter at its development center in bengaluru the second largest indian it service major will also create a base for polestar s development of in car infotainment software and electrical electronics sw ee engineering user experience ux and cloud powered digital services infosys in a filing with bse said it will also leverage in tech its latest acquisition in the r d space to complement the engagement the it major in april this year acquired in tech an engineering r d services provider focused on german automotive industry the company then had said that the strategic investment would strengthen infosys engineering r d capabilities the global technology hub that infosys will establish for polestar will aim to deliver electric vehicle ev software development and validation across many domains including infotainment advanced driver assistance systems adas and telematics added the filing maria lexe head of digital at polestar said polestar is excited to partner with infosys to establish a tech hub in india infosys has a successful background with similar operations and we are confident in their ability to lead this tech hub in order to generate it efficiencies and empower innovation sven bauer head of software at polestar said polestar is starting a new chapter in the company s global setup with our partner infosys in bengaluru we look forward to building automotive competence in the polestar tech hub to support our growing vehicle portfolio and new model launches","timestamp":"2024-09-25T17:57:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}