{"url":"https://economictimes.indiatimes.com/tech/technology/bharatpe-ashneer-grover-end-long-drawn-courtroom-battle-the-story-so-far/articleshow/113808308.cms","title":"BharatPe, Ashneer Grover end long-drawn courtroom battle: the story so far","description":"Part of the shares held by Ashneer Grover will be transferred to the Resilient Growth Trust for the benefit of the company and remaining shares will be managed by his family trust. Confirming the development, Grover said in a statement, “I will no longer be associated with BharatPe in any capacity, nor be part of the capital table. My remaining shares will be managed by my Family Trust. Both parties have decided not to pursue the cases filed. I hope BharatPe continues to grow and succeed for the benefit of all its stakeholders.”","content":"Fintech company BharatPe on Monday said that it had settled the two-year-old legal dispute with cofounder Ashneer Grover.As part of the settlement, Grover will neither be associated with the company in any capacity nor be a part of its shareholding as part of a settlement agreement signed between them, BharatPe said in a statement.Part of the shares held by Grover will be transferred to the Resilient Growth Trust for the benefit of the company and remaining shares will be managed by his family trust.Confirming the development, Grover said in a statement, “I will no longer be associated with BharatPe in any capacity, nor be part of the capital table. My remaining shares will be managed by my Family Trust. Both parties have decided not to pursue the cases filed. I hope BharatPe continues to grow and succeed for the benefit of all its stakeholders.” Grover was removed from the position of managing director by the company's board in March 2022. Since then, both parties have been involved in ongoing legal disputes.","cleaned_content":"fintech company bharatpe on monday said that it had settled the two year old legal dispute with cofounder ashneer grover as part of the settlement grover will neither be associated with the company in any capacity nor be a part of its shareholding as part of a settlement agreement signed between them bharatpe said in a statement part of the shares held by grover will be transferred to the resilient growth trust for the benefit of the company and remaining shares will be managed by his family trust confirming the development grover said in a statement i will no longer be associated with bharatpe in any capacity nor be part of the capital table my remaining shares will be managed by my family trust both parties have decided not to pursue the cases filed i hope bharatpe continues to grow and succeed for the benefit of all its stakeholders grover was removed from the position of managing director by the companys board in march \u003cTWO_THOUSAND\u003e since then both parties have been involved in ongoing legal disputes","timestamp":"2024-09-30T16:18:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}