{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-sees-upbeat-consumer-sentiments-lighting-up-festive-demand-boosts-infra-delivery-network/articleshow/113631044.cms","title":"Amazon sees upbeat consumer sentiments lighting up festive demand; boosts infra, delivery network","description":"Amazon India is gearing up for a promising festive season, expecting higher demand than last year. The company is enhancing its logistics and fulfillment centers, creating over 110,000 seasonal jobs. Amazon emphasizes compliance with laws and focuses on customer experience amid rising competition from other ecommerce firms and quick commerce startups.","content":"Amazon India is rolling up its sleeves for what it hopes will be a bumper festive season ahead, and expects demand this year to surpass last year's levels on upbeat consumer sentiments, according to the ecommerce company's Vice President of Operations Abhinav Singh. In an interview with PTI, Singh talked about the \"long term\" India opportunity, how Amazon looks at competition from other ecommerce firms and quick commerce upstarts and also refuted allegations of 'deep discounts' saying Amazon as a marketplace does not control pricing, which is purely a prerogative of sellers on the platform.  Singh declined to comment specifically on anti-trust investigation by the Competition Commission of India (CCI) but asserted that Amazon adheres to a high bar on compliance of laws.  Singh said Amazon considers India a \"long term opportunity\" with \"huge\" potential and a place where it is committed to building a large business, digitising millions of sellers, serving vast swathes of customers and creating a big network of entrepreneurs.  \"It's a very long term opportunity, and it is a huge opportunity...Look at it from the perspective of a billion people, with an economy which is getting to be the third-largest very soon. So from that perspective, there's a lot going for India...that's very optimistic for me as an Indian, and that really excites me to work here, and help transform the digital infrastructure and contribute towards the government's Digital India mission,\" Singh said.  Ahead of the upcoming festive season, Amazon India is also sprucing up its logistics network and the network of fulfillment centres - the scaling of infrastructure and capacity building is aimed at accelerating delivery speeds and enabling sellers, by placing selection closer to customers. ","cleaned_content":"amazon india is rolling up its sleeves for what it hopes will be a bumper festive season ahead and expects demand this year to surpass last years levels on upbeat consumer sentiments according to the ecommerce companys vice president of operations abhinav singh in an interview with pti singh talked about the long term india opportunity how amazon looks at competition from other ecommerce firms and quick commerce upstarts and also refuted allegations of deep discounts saying amazon as a marketplace does not control pricing which is purely a prerogative of sellers on the platform singh declined to comment specifically on anti trust investigation by the competition commission of india cci but asserted that amazon adheres to a high bar on compliance of laws singh said amazon considers india a long term opportunity with huge potential and a place where it is committed to building a large business digitising millions of sellers serving vast swathes of customers and creating a big network of entrepreneurs its a very long term opportunity and it is a huge opportunity look at it from the perspective of a billion people with an economy which is getting to be the third largest very soon so from that perspective theres a lot going for india thats very optimistic for me as an indian and that really excites me to work here and help transform the digital infrastructure and contribute towards the governments digital india mission singh said ahead of the upcoming festive season amazon india is also sprucing up its logistics network and the network of fulfillment centres the scaling of infrastructure and capacity building is aimed at accelerating delivery speeds and enabling sellers by placing selection closer to customers","timestamp":"2024-09-24T15:48:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}