{"url":"https://economictimes.indiatimes.com/tech/technology/pm-modi-attends-fruitful-tech-ceos-roundtable-in-new-york/articleshow/113582703.cms","title":"PM Modi attends 'fruitful' tech CEOs roundtable in New York","description":"The meeting took place at the Lotte New York Palace Hotel on Sunday during the second leg of Modi's three-day US visit. It saw the participation of CEOs of 15 major US-based firms working on cutting-edge technologies such as AI, quantum computing and semiconductors.","content":"New York, Prime Minister Narendra Modi participated in a \"fruitful\" roundtable with the CEOs of leading American tech companies, where he emphasised India's growth prospects and discussed initiatives to foster bilateral collaborations across various sectors. The meeting took place at the Lotte New York Palace Hotel on Sunday during the second leg of Modi's three-day US visit. It saw the participation of CEOs of 15 major US-based firms working on cutting-edge technologies such as AI, quantum computing and semiconductors.  \"Had a fruitful roundtable with tech CEOs in New York, discussing aspects relating to technology, innovation and more. Also highlighted the strides made by India in this field. I am glad to see immense optimism towards India,\" Modi said in a post on X.  During the conference, Modi said technology collaboration and efforts such as the Initiative on Critical and Emerging Technologies (ICET) lie at the core of the India-US Comprehensive Global Strategic Partnership, according to a Ministry of External Affairs press release.  The prime minister stressed that in his third term, India will make every effort to become the third largest economy in the world, and encouraged the companies to take advantage of India's growth story for collaboration and innovation.  \"They can co-develop, co-design, and co-produce in India for the world, harnessing the opportunities from India's economic and technological growth,\" the press release said. ","cleaned_content":"new york prime minister narendra modi participated in a fruitful roundtable with the ceos of leading american tech companies where he emphasised indias growth prospects and discussed initiatives to foster bilateral collaborations across various sectors the meeting took place at the lotte new york palace hotel on sunday during the second leg of modis three day us visit it saw the participation of ceos of \u003cONE_TEN\u003e major us based firms working on cutting edge technologies such as ai quantum computing and semiconductors had a fruitful roundtable with tech ceos in new york discussing aspects relating to technology innovation and more also highlighted the strides made by india in this field i am glad to see immense optimism towards india modi said in a post on x during the conference modi said technology collaboration and efforts such as the initiative on critical and emerging technologies icet lie at the core of the india us comprehensive global strategic partnership according to a ministry of external affairs press release the prime minister stressed that in his third term india will make every effort to become the third largest economy in the world and encouraged the companies to take advantage of indias growth story for collaboration and innovation they can co develop co design and co produce in india for the world harnessing the opportunities from indias economic and technological growth the press release said","timestamp":"2024-09-23T08:19:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}