{"url":"https://economictimes.indiatimes.com/tech/technology/google-restricts-creation-of-new-accounts-in-russia-report/articleshow/113703696.cms","title":"Google restricts creation of new accounts in Russia: report","description":"\"The ministry confirms that Google has restricted the creation of new accounts,\" Interfax quoted the digital ministry as saying. \"Telecom operators have also recorded a significant reduction in the number of SMS messages sent by the company to Russian users.\"","content":"Alphabet's Google has restricted the creation of new accounts for Russian users, state news agencies cited Russia's digital ministry as saying on Thursday.  Google has been under pressure in Russia for several years, particularly for not taking down content Moscow considers illegal and for blocking the YouTube channels of Russian media and public figures since Moscow's invasion of Ukraine.  \"The ministry confirms that Google has restricted the creation of new accounts,\" Interfax quoted the digital ministry as saying. \"Telecom operators have also recorded a significant reduction in the number of SMS messages sent by the company to Russian users.\"  Google and the ministry did not immediately respond to comment requests.  The ministry said there was no certainty that SMS confirmations for two-factor authentication would continue working, Interfax reported. ","cleaned_content":"alphabets google has restricted the creation of new accounts for russian users state news agencies cited russias digital ministry as saying on thursday google has been under pressure in russia for several years particularly for not taking down content moscow considers illegal and for blocking the youtube channels of russian media and public figures since moscows invasion of ukraine the ministry confirms that google has restricted the creation of new accounts interfax quoted the digital ministry as saying telecom operators have also recorded a significant reduction in the number of sms messages sent by the company to russian users google and the ministry did not immediately respond to comment requests the ministry said there was no certainty that sms confirmations for two factor authentication would continue working interfax reported","timestamp":"2024-09-26T18:08:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}