{"url":"https://economictimes.indiatimes.com/tech/technology/nclat-adjourns-byjus-case-hearing-to-november-6/articleshow/113848191.cms","title":"NCLAT adjourns Byju’s case hearing to November 6","description":"On September 26, the Supreme Court temporarily halted all meetings concerning Byju's insolvency proceedings, as Glas Trust, the trustee for lenders to which Byju's owes $1.2 billion, moved the apex court challenging its removal from the committee of creditors (CoC) by interim resolution professional (IRP) Pankaj Srivastava.","content":"The Chennai bench of the National Company Law Appellate Tribunal (NCLAT) on Tuesday adjourned a case involving troubled edtech firm Byju’s and a group of its US lenders to November 6.Earlier, the US lenders asserted that Byju’s must repay the $1.2-billion loan along with interest. They claimed the edtech company has failed to make any contractually due payment in more than 17 months. On September 26, the Supreme Court temporarily halted all meetings concerning Byju's insolvency proceedings, as Glas Trust, the trustee for lenders to which Byju's owes $1.2 billion, moved the apex court challenging its removal from the committee of creditors (CoC) by interim resolution professional (IRP) Pankaj Srivastava.Srivastava’s decision was based on the fact that Glas Trust did not represent the minimum 51% of lenders in the consortium that provided the loan to Byju’s.The top court instructed Srivastava to maintain the status quo and not to hold any meeting of the lenders. However, it decided not to intervene in an appeal filed by Glas Trust, which sought to remove Srivastava.","cleaned_content":"the chennai bench of the national company law appellate tribunal nclat on tuesday adjourned a case involving troubled edtech firm byju s and a group of its us lenders to november \u003cSIX_\u003e earlier the us lenders asserted that byju s must repay the \u003cONE_\u003e billion loan along with interest they claimed the edtech company has failed to make any contractually due payment in more than \u003cONE_TEN\u003e months on september \u003cTWO_TEN\u003e the supreme court temporarily halted all meetings concerning byjus insolvency proceedings as glas trust the trustee for lenders to which byjus owes \u003cONE_\u003e billion moved the apex court challenging its removal from the committee of creditors coc by interim resolution professional irp pankaj srivastava srivastava s decision was based on the fact that glas trust did not represent the minimum \u003cFIVE_TEN_PERCENT\u003e of lenders in the consortium that provided the loan to byju s the top court instructed srivastava to maintain the status quo and not to hold any meeting of the lenders however it decided not to intervene in an appeal filed by glas trust which sought to remove srivastava","timestamp":"2024-10-01T15:39:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}