{"url":"https://economictimes.indiatimes.com/tech/technology/foxconn-says-execs-from-nvidia-google-bmw-will-speak-at-its-annual-forum/articleshow/113854475.cms","title":"Foxconn says execs from Nvidia, Google, BMW will speak at its annual forum","description":"Executives from Nvidia, Google, and BMW will be discussing AI, electric vehicles, and digital health at Foxconn's annual tech day. It's uncertain whether Nvidia CEO Jensen Huang will attend this year's event.","content":"Foxconn, the world's largest contract electronics maker, said on Tuesday that executives from companies including Nvidia, Google and BMW will speak at its annual tech day forum next week. Foxconn , the top assembler of Apple's iPhone, hosts the tech day every October to unveil new products and partnerships. Last year, Nvidia CEO Jensen Huang appeared at the event to announce the two companies would build \"AI factories\" together. The executives will speak on topics including artificial intelligence, electric vehicles and digital heath management, Foxconn spokesman James Wu told reporters. However, he declined to confirm if the Taiwan-born Huang would return for an encore performance this year. \"Please stay tuned,\" Wu said.","cleaned_content":"foxconn the worlds largest contract electronics maker said on tuesday that executives from companies including nvidia google and bmw will speak at its annual tech day forum next week foxconn the top assembler of apples iphone hosts the tech day every october to unveil new products and partnerships last year nvidia ceo jensen huang appeared at the event to announce the two companies would build ai factories together the executives will speak on topics including artificial intelligence electric vehicles and digital heath management foxconn spokesman james wu told reporters however he declined to confirm if the taiwan born huang would return for an encore performance this year please stay tuned wu said","timestamp":"2024-10-01T18:34:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}