{"url":"https://economictimes.indiatimes.com/tech/technology/non-skippable-anti-tobacco-ads-should-precede-content-on-ott-platforms-proposes-govt/articleshow/113571622.cms","title":"'Non-skippable' anti-tobacco ads should precede content on OTT platforms, proposes govt","description":"The draft rules issued on September 13 state, \"All content published in the online curated content platforms, shall display non-skippable and anti-tobacco health spots of minimum 30 seconds duration and non-skippable audio-visual disclaimer on the ill effects of tobacco use, of minimum 20 seconds upon opening the platforms of the publishers of the online curated content.\"","content":"The Union health ministry has proposed mandatory display of \"non-skippable\" anti-tobacco health spots of at least 30 seconds and audio-visual disclaimer on ill-effects of tobacco use for 20 seconds on OTT platforms as soon as one starts streaming them. The ministry recently released draft amendments for anti-tobacco rules for over-the-top (OTT) platforms. According to the draft norms, all films of Indian and foreign origin irrespective of their CBFC certification status published and released on or after September 1, 2023 will have to display anti-tobacco health spots of minimum 30 seconds duration each at the beginning and middle of the movie. It also proposed displaying anti-tobacco health warnings as prominent static messages at the bottom of the screen during the scenes that show use of tobacco products in all content. \"The Cigarette and other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply and Distribution) Amendment Rules 2024\" amend the anti-tobacco rules that the ministry had issued in May last year. The 2023 rules also mentioned that every publisher of online curated content displaying tobacco products will have to display anti-tobacco health spots of minimum 30 seconds duration each at the beginning and middle of the film and display anti-tobacco health warning as a prominent static message at the bottom of the screen during the period of the display of tobacco products or their use. ","cleaned_content":"the union health ministry has proposed mandatory display of non skippable anti tobacco health spots of at least \u003cTHREE_TEN\u003e seconds and audio visual disclaimer on ill effects of tobacco use for \u003cTWO_TEN\u003e seconds on ott platforms as soon as one starts streaming them the ministry recently released draft amendments for anti tobacco rules for over the top ott platforms according to the draft norms all films of indian and foreign origin irrespective of their cbfc certification status published and released on or after september \u003cONE_\u003e \u003cTWO_THOUSAND\u003e will have to display anti tobacco health spots of minimum \u003cTHREE_TEN\u003e seconds duration each at the beginning and middle of the movie it also proposed displaying anti tobacco health warnings as prominent static messages at the bottom of the screen during the scenes that show use of tobacco products in all content the cigarette and other tobacco products prohibition of advertisement and regulation of trade and commerce production supply and distribution amendment rules \u003cTWO_THOUSAND\u003e amend the anti tobacco rules that the ministry had issued in may last year the \u003cTWO_THOUSAND\u003e rules also mentioned that every publisher of online curated content displaying tobacco products will have to display anti tobacco health spots of minimum \u003cTHREE_TEN\u003e seconds duration each at the beginning and middle of the film and display anti tobacco health warning as a prominent static message at the bottom of the screen during the period of the display of tobacco products or their use","timestamp":"2024-09-22T17:20:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}