{"url":"https://economictimes.indiatimes.com/tech/technology/google-norways-wealth-fund-back-uk-real-time-bond-tape-bid/articleshow/113663752.cms","title":"Google, Norway's wealth fund back UK real-time bond tape bid","description":"British regulators last year unveiled proposals to build a \"consolidated tape\" that would collate market data across stock and bond markets, with a bond data feed launching first, to help investors spot the best deals and boost the appeal of UK capital markets.","content":"Google Cloud, Norway's sovereign wealth fund and Swiss bank UBS have joined forces to back a bid to run Britain's real-time record of transactions in bond markets, the fixed income technology firm leading the plan told Reuters. British regulators last year unveiled proposals to build a \"consolidated tape\" that would collate market data across stock and bond markets, with a bond data feed launching first, to help investors spot the best deals and boost the appeal of UK capital markets. Long a feature of Wall Street, the European Union has approved a law requiring trading platforms hand over price data for bonds and stocks, for a fee, to an operator. Bond trading is fragmented across multiple venues and often done bilaterally rather than via an exchange, limiting price transparency and arming some players with more information than others. Britain's Financial Conduct Authority said last month it expected to begin a tender to choose a firm to run a bond tape by end-2024, and the industry expects one to be running by late 2026.","cleaned_content":"google cloud norways sovereign wealth fund and swiss bank ubs have joined forces to back a bid to run britains real time record of transactions in bond markets the fixed income technology firm leading the plan told reuters british regulators last year unveiled proposals to build a consolidated tape that would collate market data across stock and bond markets with a bond data feed launching first to help investors spot the best deals and boost the appeal of uk capital markets long a feature of wall street the european union has approved a law requiring trading platforms hand over price data for bonds and stocks for a fee to an operator bond trading is fragmented across multiple venues and often done bilaterally rather than via an exchange limiting price transparency and arming some players with more information than others britains financial conduct authority said last month it expected to begin a tender to choose a firm to run a bond tape by end \u003cTWO_THOUSAND\u003e and the industry expects one to be running by late \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-25T15:12:00+05:30","market_timestamp":"2024-09-25T15:12:00+05:30","off_market_hours":false}