{"url":"https://economictimes.indiatimes.com/tech/technology/mobikwik-secures-sebi-nod-for-rs-700-crore-public-listing/articleshow/113602970.cms","title":"Mobikwik secures Sebi nod for Rs 700-crore public listing","description":"This is Mobikwik’s second attempt at a public listing, after it had filed its first draft prospectus back in 2021 when it planned to raise 1,900 crore.","content":"Gurugram-based fintech Mobikwik has secured the Securities and Exchange Board of India (Sebi)’s approval for its planned public listing. The company had filed its draft prospectus in January this year, looking to raise Rs 700 crore through a fresh issue of shares.The capital markets regulator sent back its final observations on September 19, according to the details published on Sebi’s website. Emailed queries to Mobikwik went unanswered.Mobikwik had then said that it will look to raise Rs 140 crore through a pre-IPO placement which, if conducted successfully, will further reduce the size of the public offering.This is Mobikwik’s second attempt at a public listing, after it had filed its first draft prospectus back in 2021 when it planned to raise 1,900 crore.In August, the Peak XV-backed startup had reported a net profit of Rs 14 crore on an operational revenue of Rs 875 crore. The payments-to-lending startup swung from losses in the previous year to a profit in FY24.","cleaned_content":"gurugram based fintech mobikwik has secured the securities and exchange board of india sebi s approval for its planned public listing the company had filed its draft prospectus in january this year looking to raise rs \u003cSEVEN_HUNDRED\u003e crore through a fresh issue of shares the capital markets regulator sent back its final observations on september \u003cONE_TEN\u003e according to the details published on sebi s website emailed queries to mobikwik went unanswered mobikwik had then said that it will look to raise rs \u003cONE_HUNDRED\u003e crore through a pre ipo placement which if conducted successfully will further reduce the size of the public offering this is mobikwik s second attempt at a public listing after it had filed its first draft prospectus back in \u003cTWO_THOUSAND\u003e when it planned to raise \u003cONE_THOUSAND\u003e crore in august the peak xv backed startup had reported a net profit of rs \u003cONE_TEN\u003e crore on an operational revenue of rs \u003cEIGHT_HUNDRED\u003e crore the payments to lending startup swung from losses in the previous year to a profit in fy24","timestamp":"2024-09-23T20:05:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}