{"url":"https://economictimes.indiatimes.com/tech/technology/pm-modi-showcases-indias-tech-prowess-during-us-visit-key-takeaways/articleshow/113598174.cms","title":"PM Modi showcases India’s tech prowess during US visit: key takeaways","description":"The prime minister also addressed the Indian American community about India’s Digital Public Infrastructure (DPI) and initiatives for domestic semiconductor production. The CEOs acknowledged India’s increasing prominence as a global technology hub, attributing this to its innovation-friendly policies and burgeoning market opportunities.","content":"Prime Minister Narendra Modi, on a three-day visit to the US, has been highlighting India’s growth potential in the technology sector. Modi met with leading Silicon Valley CEOs and government officials to attract investment in the country’s startups and semiconductor industry. The prime minister also addressed the Indian American community about India’s Digital Public Infrastructure (DPI) and initiatives for domestic semiconductor production.Here are key takeaways from the PM’s visit:Modi engaged in a roundtable discussion with the CEOs of leading American tech companies, highlighting India's growth prospects and exploring initiatives to enhance bilateral collaboration across various sectors.The meeting saw the participation of CEOs from 15 major US-based firms at the forefront of cutting-edge technologies, including artificial intelligence (AI), quantum computing and semiconductors.The CEOs acknowledged India’s increasing prominence as a global technology hub, attributing this to its innovation-friendly policies and burgeoning market opportunities. After the meeting, they expressed strong interest in investing and collaborating with India, recognising that investing in startups presents a synergistic opportunity for innovation and technological advancement.In New York, Modi also addressed a gathering of the Indian diaspora at the ‘Modi and US’ event in Nassau Coliseum. He appreciated their support in India’s growth, calling them \"strong brand ambassadors\" of the country globally.He emphasised the global appeal of India’s Unified Payments Interface (UPI), which is drawing attention and admiration from around the world. ","cleaned_content":"prime minister narendra modi on a three day visit to the us has been highlighting india s growth potential in the technology sector modi met with leading silicon valley ceos and government officials to attract investment in the country s startups and semiconductor industry the prime minister also addressed the indian american community about india s digital public infrastructure dpi and initiatives for domestic semiconductor production here are key takeaways from the pm s visit modi engaged in a roundtable discussion with the ceos of leading american tech companies highlighting indias growth prospects and exploring initiatives to enhance bilateral collaboration across various sectors the meeting saw the participation of ceos from \u003cONE_TEN\u003e major us based firms at the forefront of cutting edge technologies including artificial intelligence ai quantum computing and semiconductors the ceos acknowledged india s increasing prominence as a global technology hub attributing this to its innovation friendly policies and burgeoning market opportunities after the meeting they expressed strong interest in investing and collaborating with india recognising that investing in startups presents a synergistic opportunity for innovation and technological advancement in new york modi also addressed a gathering of the indian diaspora at the modi and us event in nassau coliseum he appreciated their support in india s growth calling them strong brand ambassadors of the country globally he emphasised the global appeal of india s unified payments interface upi which is drawing attention and admiration from around the world","timestamp":"2024-09-23T15:56:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}