{"url":"https://economictimes.indiatimes.com/tech/technology/online-sellers-on-walmarts-flipkart-sue-india-watchdog-over-antitrust-probe/articleshow/113785928.cms","title":"Online sellers on Walmart's Flipkart sue India watchdog over antitrust probe","description":"In an effort to quash the critical proceedings, the three sellers on the platform made submissions in the High Court of Karnataka to \"set aside\" the investigation report and put the process of the Competition Commission of India (CCI) on hold.","content":"Three online sellers operating on Walmart-owned Flipkart have sued the Indian antitrust watchdog over an investigation which found they, Flipkart and rival Amazon breached competition laws, according to court filings seen by Reuters. The filings come after antitrust investigations concluded in August found Amazon and Flipkart, some of their sellers and smartphone brands, violated local competition laws by giving undue preference to select online sellers and prioritizing certain listings, Reuters has reported. Flipkart is one of India's biggest ecommerce players and rivals Amazon. In an effort to quash the critical proceedings, the three sellers on the platform made submissions in the High Court of Karnataka to \"set aside\" the investigation report and put the process of the Competition Commission of India (CCI) on hold. Lawsuits from sellers of Amazon and Flipkart can potentially delay the investigation process which first started in 2020, and was triggered after brick-and-mortar retailers of the Confederation of All India Traders complained to the watchdog. Amazon and Flipkart deny any wrongdoing.","cleaned_content":"three online sellers operating on walmart owned flipkart have sued the indian antitrust watchdog over an investigation which found they flipkart and rival amazon breached competition laws according to court filings seen by reuters the filings come after antitrust investigations concluded in august found amazon and flipkart some of their sellers and smartphone brands violated local competition laws by giving undue preference to select online sellers and prioritizing certain listings reuters has reported flipkart is one of indias biggest ecommerce players and rivals amazon in an effort to quash the critical proceedings the three sellers on the platform made submissions in the high court of karnataka to set aside the investigation report and put the process of the competition commission of india cci on hold lawsuits from sellers of amazon and flipkart can potentially delay the investigation process which first started in \u003cTWO_THOUSAND\u003e and was triggered after brick and mortar retailers of the confederation of all india traders complained to the watchdog amazon and flipkart deny any wrongdoing","timestamp":"2024-09-29T16:05:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}