{"url":"https://economictimes.indiatimes.com/tech/information-tech/seeing-more-interest-in-outcome-based-deals-persistent-systems-ceo/articleshow/113790671.cms","title":"Seeing more interest in outcome-based deals: Persistent Systems CEO","description":"Though Persistent Systems had been doing outcome-based deals, GenAI has enabled such deals at a much higher scale, according to Kalra. “So, from our perspective, we are seeing more and more interest in outcome-based deals because it’s something where the customer gets more value, and we are able to capture a bit more from a value perspective using our own IP that we are building. That’s how we are differentiating ourselves in the market,” he said.","content":"Persistent Systems is seeing more interest in outcome-based (fixed price) deals than deals that are priced based on time and material, said its chief executive Sandeep Kalra.Kalra told ET that with the maturing of artificial intelligence (AI) firms like Persistent Systems are building more Intellectual Properties such as the SASVA platform, GenAI Hub and iAURA, and creating greater value for customers. More discussions on the outcome-based pricing model have led to an increase in deals on this model, he said.“For example, on the SASVA platform in the enterprise software space, we are now picking up deals which are outcome-based more and more,” he said. “Whether it is doing end-to-end sustaining engineering of a product, which is basically nothing but support of a product, we are picking it up and saying it is not a price into quantity. It is basically what is the outcome and service level. Here is where we are taking it on a fixed bid or an outcome kind of thing.”Though Persistent Systems had been doing outcome-based deals, GenAI has enabled such deals at a much higher scale, according to Kalra. “So, from our perspective, we are seeing more and more interest in outcome-based deals because it’s something where the customer gets more value, and we are able to capture a bit more from a value perspective using our own IP that we are building. That’s how we are differentiating ourselves in the market,” he said.In outcome-based deals, customers tell IT firms not to price the deals by the input, as to how many people and rate per head, said Kalra. “You tell us what is the outcome that you want, and based on the outcome, we'll sign up for the timeline, the outcome, the service levels that you want, and we'll charge you a fee for that, and we'll use our tools. So, essentially, we'll deliver clients more value, but underlying it is not about how many people, but how we are doing it. And we'll take an output-based pricing and we'll use our own technology,” he said.","cleaned_content":"persistent systems is seeing more interest in outcome based fixed price deals than deals that are priced based on time and material said its chief executive sandeep kalra kalra told et that with the maturing of artificial intelligence ai firms like persistent systems are building more intellectual properties such as the sasva platform genai hub and iaura and creating greater value for customers more discussions on the outcome based pricing model have led to an increase in deals on this model he said for example on the sasva platform in the enterprise software space we are now picking up deals which are outcome based more and more he said whether it is doing end to end sustaining engineering of a product which is basically nothing but support of a product we are picking it up and saying it is not a price into quantity it is basically what is the outcome and service level here is where we are taking it on a fixed bid or an outcome kind of thing though persistent systems had been doing outcome based deals genai has enabled such deals at a much higher scale according to kalra so from our perspective we are seeing more and more interest in outcome based deals because it s something where the customer gets more value and we are able to capture a bit more from a value perspective using our own ip that we are building that s how we are differentiating ourselves in the market he said in outcome based deals customers tell it firms not to price the deals by the input as to how many people and rate per head said kalra you tell us what is the outcome that you want and based on the outcome well sign up for the timeline the outcome the service levels that you want and well charge you a fee for that and well use our tools so essentially well deliver clients more value but underlying it is not about how many people but how we are doing it and well take an output based pricing and well use our own technology he said","timestamp":"2024-09-30T13:30:00+05:30","market_timestamp":"2024-09-30T13:30:00+05:30","off_market_hours":false}