{"url":"https://economictimes.indiatimes.com/tech/technology/tier-2-3-cities-make-a-small-dent-in-bengalurus-gcc-growth-story/articleshow/113793620.cms","title":"Tier-2, 3 cities make a small dent in Bengaluru's GCC growth story","description":"Bengaluru saw slower growth than the rest of the country, with the total number of GCC units across the country increasing 62.5% to 2,975 from 1,830 during the five-year period. According to Sangeeta Gupta, chief strategy officer, Nasscom, Bengaluru already houses the largest number of GCCs, which have also matured, and many of these companies could have opened their second or third centers in smaller cities.","content":"Even as Bengaluru continues to be the hub of global capabilities centres (GCCs) in India, it has seen a 4.4 percentage point fall in its share of GCC units over the past five financial years, according to an analysis by ET. While the number of GCC units in Bengaluru increased 41% to around 875 in 2023-24 from about 620 in 2018-19, the city's share fell to 29.4% from 33.8% during this period.Bengaluru saw slower growth than the rest of the country, with the total number of GCC units across the country increasing 62.5% to 2,975 from 1,830 during the five-year period. According to Sangeeta Gupta, chief strategy officer, Nasscom, Bengaluru already houses the largest number of GCCs, which have also matured, and many of these companies could have opened their second or third centers in smaller cities.The Zinnov-Nasscom India GCC Landscape Report said, \"India's tier II and tier III cities are becoming pivotal in scaling up GCCs; house about 7% of total GCC units in FY2024, up from about 5% in FY2019.\" Bengaluru and the National Capital Region (NCR) together account for 47% of the IT talent in India's GCC ecosystem, according to the report.","cleaned_content":"even as bengaluru continues to be the hub of global capabilities centres gccs in india it has seen a \u003cFOUR_PERCENT\u003e age point fall in its share of gcc units over the past five financial years according to an analysis by et while the number of gcc units in bengaluru increased \u003cFOUR_TEN_PERCENT\u003e to around \u003cEIGHT_HUNDRED\u003e in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e from about \u003cSIX_HUNDRED\u003e in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e the citys share fell to \u003cTWO_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e during this period bengaluru saw slower growth than the rest of the country with the total number of gcc units across the country increasing \u003cSIX_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e from \u003cONE_THOUSAND\u003e during the five year period according to sangeeta gupta chief strategy officer nasscom bengaluru already houses the largest number of gccs which have also matured and many of these companies could have opened their second or third centers in smaller cities the zinnov nasscom india gcc landscape report said indias tier ii and tier iii cities are becoming pivotal in scaling up gccs house about \u003cSEVEN_PERCENT\u003e of total gcc units in fy2024 up from about \u003cFIVE_PERCENT\u003e in fy2019 bengaluru and the national capital region ncr together account for \u003cFOUR_TEN_PERCENT\u003e of the it talent in indias gcc ecosystem according to the report","timestamp":"2024-09-30T06:00:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}