{"url":"https://economictimes.indiatimes.com/tech/technology/donald-trump-at-odds-with-google-accuses-tech-giant-of-posting-bad-stories-about-him/articleshow/113802867.cms","title":"Donald Trump at odds with Google, accuses tech giant of posting 'bad stories' about him","description":"Former U.S. President Donald Trump has accused Google of bias, claiming the search engine posts negative stories about him while favoring his Democratic rival Kamala Harris. Trump has threatened prosecution if he wins the upcoming presidential election, citing alleged election interference by Google. Google denies these claims, asserting its algorithms are impartial.","content":"Former US President Donald Trump has targeted Google, accusing the search engine of posting \"bad stories\" about him and affirming prosecution if he wins the presidential election on November 5. Trump claimed that Google only displays only positive articles about his Democratic rival Vice President Kamala Harris.He stated, \"This is an illegal activity and hopefully the Justice Department will criminally prosecute them for this blatant interference of elections.\"\"If not, and subject to the laws of our country, I will request their prosecution, at the maximum levels, when I win the elections,\" he added.This response was sparked by a conservative group's findings from searching \"Donald Trump presidential race 2024\" online, claiming Google's search results were biased against Trump.Google, however, maintains its algorithms do not favour any political candidate and that \"both campaign websites consistently appear at the top of search for relevant and common search queries.\" .","cleaned_content":"former us president donald trump has targeted google accusing the search engine of posting bad stories about him and affirming prosecution if he wins the presidential election on november \u003cFIVE_\u003e trump claimed that google only displays only positive articles about his democratic rival vice president kamala harris he stated this is an illegal activity and hopefully the justice department will criminally prosecute them for this blatant interference of elections if not and subject to the laws of our country i will request their prosecution at the maximum levels when i win the elections he added this response was sparked by a conservative groups findings from searching donald trump presidential race \u003cTWO_THOUSAND\u003e online claiming googles search results were biased against trump google however maintains its algorithms do not favour any political candidate and that both campaign websites consistently appear at the top of search for relevant and common search queries","timestamp":"2024-09-30T10:54:00+05:30","market_timestamp":"2024-09-30T10:54:00+05:30","off_market_hours":false}