{"url":"https://economictimes.indiatimes.com/tech/technology/meta-says-it-will-expand-production-of-mixed-reality-headsets-in-vietnam/articleshow/113843300.cms","title":"Meta says it will expand production of mixed reality headsets in Vietnam","description":"The announcement came during a visit to Vietnam by Meta's president for global affairs, Nick Clegg, just a week after he met Vietnamese President To Lam in New York. \"Beginning 2025, Meta will expand manufacturing of its latest Mixed Reality device Quest 3S to Vietnam,\" Clegg said in a statement.","content":"Meta Platforms said on Tuesday it will expand investment in artificial intelligence innovation in Vietnam, including production of its latest mixed reality headsets from 2025, its latest effort to boost its footprint in the country. The announcement came during a visit to Vietnam by Meta's president for global affairs, Nick Clegg, just a week after he met Vietnamese President To Lam in New York. \"Beginning 2025, Meta will expand manufacturing of its latest Mixed Reality device Quest 3S to Vietnam,\" Clegg said in a statement. Meta did not respond to Reuters' request for comment on the size of the investment and of its existing operation in Vietnam. It also did not clarify whether the manufacturing was done via suppliers.","cleaned_content":"meta platforms said on tuesday it will expand investment in artificial intelligence innovation in vietnam including production of its latest mixed reality headsets from \u003cTWO_THOUSAND\u003e its latest effort to boost its footprint in the country the announcement came during a visit to vietnam by metas president for global affairs nick clegg just a week after he met vietnamese president to lam in new york beginning \u003cTWO_THOUSAND\u003e meta will expand manufacturing of its latest mixed reality device quest \u003cTHREE_\u003e s to vietnam clegg said in a statement meta did not respond to reuters request for comment on the size of the investment and of its existing operation in vietnam it also did not clarify whether the manufacturing was done via suppliers","timestamp":"2024-10-01T13:32:00+05:30","market_timestamp":"2024-10-01T13:32:00+05:30","off_market_hours":false}