{"url":"https://economictimes.indiatimes.com/tech/technology/german-competition-watchdog-vows-closer-eye-on-microsoft/articleshow/113844596.cms","title":"German competition watchdog vows closer eye on Microsoft","description":"\"Microsoft's many products are ubiquitous and indispensable in companies, public authorities and private households,\" said Andreas Mundt, head of the Bundeskartellamt. \"The Microsoft ecosystem is now more interwoven and stronger than ever before.\"","content":"Germany's competition watchdog said on Monday that it had classified Microsoft as a \"company with paramount cross-market significance for competition\", meaning that it can take stronger action against the tech giant going forward. \"Microsoft's many products are ubiquitous and indispensable in companies, public authorities and private households,\" said Andreas Mundt, head of the Bundeskartellamt. \"The Microsoft ecosystem is now more interwoven and stronger than ever before.\" The cartel office said the new classification - also given to Apple, Google and Meta - meant that Microsoft would now come under more stringent supervision and could face bans on anti-competitive practices. \"We recognize our responsibility to support a healthy competitive environment and we will strive to be proactive, collaborative and responsible in working with the Bundeskartellamt,\" a Microsoft spokesperson said. In June, Microsoft was hit with an antitrust charge by the European Commission, which accused it of illegally linking its chat and video app Teams with its Office product, giving it an unfair advantage over rivals such as Slack.","cleaned_content":"germanys competition watchdog said on monday that it had classified microsoft as a company with paramount cross market significance for competition meaning that it can take stronger action against the tech giant going forward microsofts many products are ubiquitous and indispensable in companies public authorities and private households said andreas mundt head of the bundeskartellamt the microsoft ecosystem is now more interwoven and stronger than ever before the cartel office said the new classification also given to apple google and meta meant that microsoft would now come under more stringent supervision and could face bans on anti competitive practices we recognize our responsibility to support a healthy competitive environment and we will strive to be proactive collaborative and responsible in working with the bundeskartellamt a microsoft spokesperson said in june microsoft was hit with an antitrust charge by the european commission which accused it of illegally linking its chat and video app teams with its office product giving it an unfair advantage over rivals such as slack","timestamp":"2024-10-01T14:02:00+05:30","market_timestamp":"2024-10-01T14:02:00+05:30","off_market_hours":false}