{"url":"https://economictimes.indiatimes.com/tech/technology/amazon-hit-with-us-labor-board-complaint-over-joint-employment-of-drivers/articleshow/113900249.cms","title":"Amazon hit with US labor board complaint over 'joint employment' of drivers","description":"The complaint from the National Labor Relations Board (NLRB) claims that Amazon is a so-called \"joint employer\" of drivers employed by the contractor, Battle Tested Strategies (BTS), and used a series of illegal tactics to discourage union activities at a facility in Palmdale, California.","content":"Amazon.com has been accused by a U.S. labor board of illegally refusing to bargain with a union representing drivers employed by a contractor, the agency announced on Wednesday. The complaint from the National Labor Relations Board (NLRB) claims that Amazon is a so-called \"joint employer\" of drivers employed by the contractor, Battle Tested Strategies (BTS), and used a series of illegal tactics to discourage union activities at a facility in Palmdale, California. BTS drivers voted to join the International Brotherhood of Teamsters union last year, becoming the first Amazon delivery contractors to unionize. The NLRB in a complaint issued on Monday said Amazon broke the law by terminating its contract with BTS after the drivers unionized, without first bargaining with the Teamsters. The board had said in August that it had found merit to the union's claims that Amazon exerts control over BTS drivers and should be considered their employer under federal labor law. The NLRB at the time said it would issue a complaint unless Amazon settled the case.","cleaned_content":"amazon com has been accused by a u s labor board of illegally refusing to bargain with a union representing drivers employed by a contractor the agency announced on wednesday the complaint from the national labor relations board nlrb claims that amazon is a so called joint employer of drivers employed by the contractor battle tested strategies bts and used a series of illegal tactics to discourage union activities at a facility in palmdale california bts drivers voted to join the international brotherhood of teamsters union last year becoming the first amazon delivery contractors to unionize the nlrb in a complaint issued on monday said amazon broke the law by terminating its contract with bts after the drivers unionized without first bargaining with the teamsters the board had said in august that it had found merit to the unions claims that amazon exerts control over bts drivers and should be considered their employer under federal labor law the nlrb at the time said it would issue a complaint unless amazon settled the case","timestamp":"2024-10-03T13:08:00+05:30","market_timestamp":"2024-10-03T13:08:00+05:30","off_market_hours":false}