{"url":"https://economictimes.indiatimes.com/tech/technology/microsoft-may-pay-constellation-premium-in-three-mile-island-power-agreement-jefferies/articleshow/113617910.cms","title":"Microsoft may pay Constellation premium in Three Mile Island power agreement: Jefferies","description":"Rising demand for electricity from data centers to power AI technology has created a need for clean and sustainable sources of energy such as nuclear power.","content":"Microsoft is estimated to pay Constellation Energy a premium as part of a long-term power purchase agreement (PPA) related to the Three Mile Island nuclear plant in Pennsylvania, Jefferies analysts said on Monday. Rising demand for electricity from data centers to power AI technology has created a need for clean and sustainable sources of energy such as nuclear power. Microsoft signed a deal with Constellation to help it restart a unit of its Three Mile Island nuclear plant, the companies said on Friday, sending the utility firm's shares up 22%. The unit Constellation hopes to restart at the Three Mile Island power facility was shut down in 2019 due to operational issue. No U.S. nuclear power plant has been reopened after shutting. A separate unit of the plant was shut down in 1979 after experiencing a partial meltdown, in one of the biggest commercial nuclear accidents in U.S. history.","cleaned_content":"microsoft is estimated to pay constellation energy a premium as part of a long term power purchase agreement ppa related to the three mile island nuclear plant in pennsylvania jefferies analysts said on monday rising demand for electricity from data centers to power ai technology has created a need for clean and sustainable sources of energy such as nuclear power microsoft signed a deal with constellation to help it restart a unit of its three mile island nuclear plant the companies said on friday sending the utility firms shares up \u003cTWO_TEN_PERCENT\u003e the unit constellation hopes to restart at the three mile island power facility was shut down in \u003cTWO_THOUSAND\u003e due to operational issue no u s nuclear power plant has been reopened after shutting a separate unit of the plant was shut down in \u003cONE_THOUSAND\u003e after experiencing a partial meltdown in one of the biggest commercial nuclear accidents in u s history","timestamp":"2024-09-24T10:47:00+05:30","market_timestamp":"2024-09-24T10:47:00+05:30","off_market_hours":false}