{"url":"https://economictimes.indiatimes.com/tech/technology/singapore-among-key-stakeholders-in-bengalurus-development-as-tech-hub/articleshow/113873813.cms","title":"'Singapore among key stakeholders in Bengaluru's development as tech hub'","description":"Singapore's Capitaland  has been a key partner in Bengaluru's development as a global tech hub. The Karnataka government is working together to promote business growth in the city.","content":"Singapore has been one of the key stakeholders in the development of Bengaluru as a global tech hub over the past 30 years, a senior official of the Karnataka government has said.  \"We have a very deep association with Singapore right from the beginning of the tech revolution in Bengaluru, some 30 years ago,\" said Ekroop Caur, Secretary to Government of Karnataka, Department of Electronics, Information Technology, Biotechnology and Science \u0026 Technology.  Among Karnataka's biggest partners is Singapore's Capitaland under a public-private partnership, and it continues to be one of the leading tech infra partnerships, Caur said on Tuesday at a Bengaluru Tech Summit 2024 roadshow here.  \"We are natural allies and we can accelerate a lot of business growth in Bengaluru via Singapore,\" said the secretary who is working on getting one of the largest delegation-company participations from Singapore.  She noted Singapore, being a cluster of global companies, could further connect with corporations around the world. ","cleaned_content":"singapore has been one of the key stakeholders in the development of bengaluru as a global tech hub over the past \u003cTHREE_TEN\u003e years a senior official of the karnataka government has said we have a very deep association with singapore right from the beginning of the tech revolution in bengaluru some \u003cTHREE_TEN\u003e years ago said ekroop caur secretary to government of karnataka department of electronics information technology biotechnology and science technology among karnatakas biggest partners is singapores capitaland under a public private partnership and it continues to be one of the leading tech infra partnerships caur said on tuesday at a bengaluru tech summit \u003cTWO_THOUSAND\u003e roadshow here we are natural allies and we can accelerate a lot of business growth in bengaluru via singapore said the secretary who is working on getting one of the largest delegation company participations from singapore she noted singapore being a cluster of global companies could further connect with corporations around the world","timestamp":"2024-10-02T14:07:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}