{"url":"https://economictimes.indiatimes.com/tech/technology/ncpcr-asks-social-media-platforms-to-explore-ways-to-protect-children-online/articleshow/113573770.cms","title":"NCPCR asks social media platforms to explore ways to protect children online","description":"The National Commission for Protection of Child Rights (NCPCR) met with major social media platforms to discuss child safety online. They emphasized age verification, blocking harmful content, and supporting law enforcement. Recommendations included mandatory KYC procedures and reporting of child exploitation cases. Platforms must submit an Action Taken Report within seven days.","content":"The National Commission for Protection of Child Rights (NCPCR) met representatives from major social media platforms to address issues related to the safety of children online and explore ways to protect them. In a recent meeting with representatives from companies like Google, YouTube, Meta, X, Snapchat, Reddit, Sharechat, and Bumble, the Commission sought to explore ways to protect children from harmful content and online exploitation.  Key issues discussed included mechanisms for age verification, tools for identifying and blocking Child Sexual Abuse Material (CSAM), support for law enforcement agencies, and parameters for reporting cases to the National Center for Missing and Exploited Children (NCMEC).  The apex child rights body emphasised the need for enhanced safety features on social media platforms, with a focus on keeping children safe from predators and explicit content.  The letter, which followed the meeting, outlined several recommendations.  Notably, it called for mandatory Know Your Customer (KYC) procedures to verify user identity on platforms and mandatory reporting of CSAM under the Protection of Children from Sexual Offences (POCSO) Act, 2012. ","cleaned_content":"the national commission for protection of child rights ncpcr met representatives from major social media platforms to address issues related to the safety of children online and explore ways to protect them in a recent meeting with representatives from companies like google youtube meta x snapchat reddit sharechat and bumble the commission sought to explore ways to protect children from harmful content and online exploitation key issues discussed included mechanisms for age verification tools for identifying and blocking child sexual abuse material csam support for law enforcement agencies and parameters for reporting cases to the national center for missing and exploited children ncmec the apex child rights body emphasised the need for enhanced safety features on social media platforms with a focus on keeping children safe from predators and explicit content the letter which followed the meeting outlined several recommendations notably it called for mandatory know your customer kyc procedures to verify user identity on platforms and mandatory reporting of csam under the protection of children from sexual offences pocso act \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-22T19:28:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}