{"url":"https://economictimes.indiatimes.com/tech/technology/x-agrees-to-pay-brazil-fines-court-orders-finances-unblocked/articleshow/113866469.cms","title":"X agrees to pay Brazil fines, court orders finances unblocked","description":"A Brazilian judge on Tuesday ordered the unblocking of the bank accounts of Elon Musk's X in the country after the social media platform agreed to pay more than $5 million in fines.   In his latest decision, the judge ordered Brazil's central bank to unblock X's bank accounts so it can receive transfers and \"immediately make payment of the fines indicated.\"","content":"A Brazilian judge on Tuesday ordered the unblocking of the bank accounts of Elon Musk's X in the country after the social media platform agreed to pay more than $5 million in fines. The ruling by Supreme Court Justice Alexandre de Moraes paves the way for the suspension of X to be lifted in Brazil, where it has been off-limits to users since August 31 in a standoff over disinformation between the judge and Musk.Moraes ordered X shut down in Latin America's biggest country after Musk refused to remove dozens of right-wing accounts and then failed to name a new legal representative in the country as ordered.  In his latest decision, the judge ordered Brazil's central bank to unblock X's bank accounts so it can receive transfers and \"immediately make payment of the fines indicated.\" X had informed the court it would pay fines to the tune of some $5.2 million, according to the ruling. ","cleaned_content":"a brazilian judge on tuesday ordered the unblocking of the bank accounts of elon musks x in the country after the social media platform agreed to pay more than \u003cFIVE_\u003e million in fines the ruling by supreme court justice alexandre de moraes paves the way for the suspension of x to be lifted in brazil where it has been off limits to users since august \u003cTHREE_TEN\u003e in a standoff over disinformation between the judge and musk moraes ordered x shut down in latin americas biggest country after musk refused to remove dozens of right wing accounts and then failed to name a new legal representative in the country as ordered in his latest decision the judge ordered brazils central bank to unblock xs bank accounts so it can receive transfers and immediately make payment of the fines indicated x had informed the court it would pay fines to the tune of some \u003cFIVE_\u003e million according to the ruling","timestamp":"2024-10-02T07:54:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}