{"url":"https://economictimes.indiatimes.com/tech/information-tech/away-from-spotlight-healthcare-throws-big-lifeline-to-it-sector/articleshow/113860297.cms","title":"Away from spotlight, healthcare throws big lifeline to IT sector","description":"India's IT companies have found a resilient growth engine in healthcare. This contrasts with the sluggish performance of financial services, retail, and hi-tech, which have faced headwinds for nearly two years.","content":"The healthcare business of India’s IT companies has been silently spearheading the $250 billion industry's growth, being a bright spot at a time when key verticals such as financial services, retail and hi-tech have been under pressure for almost two years now.Digital transformation in the healthcare sector is driving this business for IT firms, analysts said. These are mostly small and medium deals, but the volume is high, and unlike in other verticals, the deal activity has not seen the post-Covid spike or the slowdown that followed.“The healthcare tech services market is disconnected from the commercial market like banking,” said Peter Bendor-Samuel, chief executive at consulting and research firm Everest Group. “It is more closely related to the government services market. Healthcare is significantly funded by government spending which has kept increasing.” ","cleaned_content":"the healthcare business of india s it companies has been silently spearheading the \u003cTWO_HUNDRED\u003e billion industrys growth being a bright spot at a time when key verticals such as financial services retail and hi tech have been under pressure for almost two years now digital transformation in the healthcare sector is driving this business for it firms analysts said these are mostly small and medium deals but the volume is high and unlike in other verticals the deal activity has not seen the post covid spike or the slowdown that followed the healthcare tech services market is disconnected from the commercial market like banking said peter bendor samuel chief executive at consulting and research firm everest group it is more closely related to the government services market healthcare is significantly funded by government spending which has kept increasing","timestamp":"2024-10-02T06:00:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}