{"url":"https://economictimes.indiatimes.com/tech/technology/us-finalises-123-million-chips-award-for-polar-semiconductor/articleshow/113629033.cms","title":"US finalises $123 million chips award for Polar Semiconductor","description":"Commerce Secretary Gina Raimondo said the award would help \"create a new U.S.-owned foundry for sensor and power semiconductors\" and boost Polar production from roughly 20,000 wafers per month to 40,000 serving aerospace, automotive, and defense needs. The state of Minnesota is contributing $75 million to the $525 million expansion at Polar.","content":"The U.S. Commerce Department said on Tuesday it had finalized a $123 million grant for Polar Semiconductor to expand its plant in Minnesota, which would allow the company to nearly double its U.S. production capacity of power and sensor chips. The award, part of the Biden administration's $52.7 billion semiconductor manufacturing and research subsidy program, is the first in the program to be finalized by the department. Commerce will distribute funds based on Polar's completion of project milestones. Commerce Secretary Gina Raimondo said the award would help \"create a new U.S.-owned foundry for sensor and power semiconductors\" and boost Polar production from roughly 20,000 wafers per month to 40,000 serving aerospace, automotive, and defense needs. The state of Minnesota is contributing $75 million to the $525 million expansion at Polar. In April, Polar -- 70% owned by Sanken Electric and 30% held by Allegro MicroSystems -- said Niobrara Capital and Prysm Capital planned to invest $175 million for around 59% of Polar.","cleaned_content":"the u s commerce department said on tuesday it had finalized a \u003cONE_HUNDRED\u003e million grant for polar semiconductor to expand its plant in minnesota which would allow the company to nearly double its u s production capacity of power and sensor chips the award part of the biden administrations \u003cFIVE_TEN\u003e billion semiconductor manufacturing and research subsidy program is the first in the program to be finalized by the department commerce will distribute funds based on polars completion of project milestones commerce secretary gina raimondo said the award would help create a new u s owned foundry for sensor and power semiconductors and boost polar production from roughly \u003cTWO_TEN_THOUSAND\u003e wafers per month to \u003cFOUR_TEN_THOUSAND\u003e serving aerospace automotive and defense needs the state of minnesota is contributing \u003cSEVEN_TEN\u003e million to the \u003cFIVE_HUNDRED\u003e million expansion at polar in april polar \u003cSEVEN_TEN_PERCENT\u003e owned by sanken electric and \u003cTHREE_TEN_PERCENT\u003e held by allegro microsystems said niobrara capital and prysm capital planned to invest \u003cONE_HUNDRED\u003e million for around \u003cFIVE_TEN_PERCENT\u003e of polar","timestamp":"2024-09-24T15:02:00+05:30","market_timestamp":"2024-09-24T15:02:00+05:30","off_market_hours":false}