{"url":"https://economictimes.indiatimes.com/tech/technology/tata-motors-holds-groundbreaking-for-tamil-nadu-factory/articleshow/113771581.cms","title":"Tata Motors holds groundbreaking ceremony for Tamil Nadu factory","description":"The Tata Group currently has more than 150,000 direct employees in Tamil Nadu across Tata Consultancy Services, Titan, Tata Chemicals, Tata Power, Indian Hotels Company, and its retail businesses, Tata Sons chairman N Chandrasekaran said at the ceremony attended by chief minister MK Stalin among others.","content":"Tata Motors on Saturday held the groundbreaking ceremony for a new Rs 9,000 crore facility in Tamil Nadu that will manufacture cars and SUVs and is projected to create 5,000 direct jobs.The factory at Panapakkam in Ranipet district will produce passenger vehicles for Tata Motors and its Jaguar Land Rover unit, and will cater to requirements of both Indian and international markets, the automaker said.The Tata Group currently has more than 150,000 direct employees in Tamil Nadu across Tata Consultancy Services, Titan, Tata Chemicals, Tata Power, Indian Hotels Company, and its retail businesses, Tata Sons chairman N Chandrasekaran said at the ceremony attended by chief minister MK Stalin among others.In the last three years, the group made investments in three major production units in Tamil Nadu — Tata Power, Tata Electronics and Tata Motors, he said. It also invested Rs 2,200 crore in Tamil Nadu’s industrial training institutes.\"This is not just another factory. This is a modern, state-of-the-art factory that will produce very high-end vehicles,\" Chandrasekaran said. “For the first time, this new modern platform will be developed by Tata Motors and JLR together. Once fully operational, it will create 5,000 direct jobs and will foster an entire ecosystem in this region, generating many more jobs.”","cleaned_content":"tata motors on saturday held the groundbreaking ceremony for a new rs \u003cNINE_THOUSAND\u003e crore facility in tamil nadu that will manufacture cars and suvs and is projected to create \u003cFIVE_THOUSAND\u003e direct jobs the factory at panapakkam in ranipet district will produce passenger vehicles for tata motors and its jaguar land rover unit and will cater to requirements of both indian and international markets the automaker said the tata group currently has more than \u003cONE_HUNDRED_THOUSAND\u003e direct employees in tamil nadu across tata consultancy services titan tata chemicals tata power indian hotels company and its retail businesses tata sons chairman n chandrasekaran said at the ceremony attended by chief minister mk stalin among others in the last three years the group made investments in three major production units in tamil nadu tata power tata electronics and tata motors he said it also invested rs \u003cTWO_THOUSAND\u003e crore in tamil nadu s industrial training institutes this is not just another factory this is a modern state of the art factory that will produce very high end vehicles chandrasekaran said for the first time this new modern platform will be developed by tata motors and jlr together once fully operational it will create \u003cFIVE_THOUSAND\u003e direct jobs and will foster an entire ecosystem in this region generating many more jobs","timestamp":"2024-09-28T22:38:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}