{"url":"https://economictimes.indiatimes.com/tech/technology/google-to-invest-1-billion-in-thai-data-centre-cloud-infrastructure/articleshow/113820476.cms","title":"Google to invest $1 billion in Thai data centre, cloud infrastructure","description":"The investment would create an average of 14,000 jobs annually until 2029, Google said, citing a study of the project by Deloitte.","content":"Alphabet Inc's Google said on Monday it would invest $1 billion in Thailand to build a data centre and cloud region to meet growing cloud demand and support artificial intelligence adoption in Southeast Asia. The investment would create an average of 14,000 jobs annually until 2029, Google said, citing a study of the project by Deloitte. In May, Microsoft said it would launch its first regional data centre in Thailand as part of its efforts to boost cloud services. \"Google's cloud and data centre infrastructure in Bangkok and Chonburi will help meet growing demand for Google Cloud capabilities and AI innovations, and the company's popular digital services - such as Search, Maps, and Google Workspace,\" the company said. Its data centre would be located in an industrial estate in Chonburi, while the Google cloud region, which consists of hardware and software dedicated to providing services to private and public sector entities, would be in the capital Bangkok.","cleaned_content":"alphabet incs google said on monday it would invest \u003cONE_\u003e billion in thailand to build a data centre and cloud region to meet growing cloud demand and support artificial intelligence adoption in southeast asia the investment would create an average of \u003cONE_TEN_THOUSAND\u003e jobs annually until \u003cTWO_THOUSAND\u003e google said citing a study of the project by deloitte in may microsoft said it would launch its first regional data centre in thailand as part of its efforts to boost cloud services googles cloud and data centre infrastructure in bangkok and chonburi will help meet growing demand for google cloud capabilities and ai innovations and the companys popular digital services such as search maps and google workspace the company said its data centre would be located in an industrial estate in chonburi while the google cloud region which consists of hardware and software dedicated to providing services to private and public sector entities would be in the capital bangkok","timestamp":"2024-09-30T18:37:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}