{"url":"https://economictimes.indiatimes.com/tech/technology/meta-readies-ar-glasses-reveal-at-connect-event/articleshow/113666209.cms","title":"Meta readies AR glasses reveal at Connect event","description":"Meta is set to unveil its first augmented reality glasses and announce updates to its virtual reality and AI products at its annual Connect conference. The AR glasses, initially for internal use, are expected to be commercially available by 2027. Meta's investment in these technologies has significantly increased its capital expenses.","content":"Facebook owner Meta prepared on Wednesday to kick off its annual Connect conference at its California headquarters, where it is expected to preview its first augmented reality glasses and announce updates to its existing virtual reality and artificial intelligence products. Among those AI updates is an audio upgrade offering users the option to select a voice for Meta's ChatGPT-like chatbot, including the ability to make it sound like celebrities including Judi Dench and John Cena, Reuters reported on Monday. The augmented reality reveal is a long time in the making for Meta Chief Executive Mark Zuckerberg, who positioned AR technology as a sort of magnum opus when he first pivoted the world's biggest social media company toward building immersive \"metaverse\" systems in 2021.  However, Meta has struggled to overcome technical challenges with its AR project since then, prompting the head of the company's metaverse-oriented Reality Labs division to acknowledge last year that a product it could viably bring to market was \"still a few years away - a few, to put it lightly.\" The company has been plowing tens of billions of dollars into its investments in artificial intelligence, augmented reality and other metaverse technologies, driving up its capital expense forecast for 2024 to a record high of between $37 billion and $40 billion.","cleaned_content":"facebook owner meta prepared on wednesday to kick off its annual connect conference at its california headquarters where it is expected to preview its first augmented reality glasses and announce updates to its existing virtual reality and artificial intelligence products among those ai updates is an audio upgrade offering users the option to select a voice for metas chatgpt like chatbot including the ability to make it sound like celebrities including judi dench and john cena reuters reported on monday the augmented reality reveal is a long time in the making for meta chief executive mark zuckerberg who positioned ar technology as a sort of magnum opus when he first pivoted the worlds biggest social media company toward building immersive metaverse systems in \u003cTWO_THOUSAND\u003e however meta has struggled to overcome technical challenges with its ar project since then prompting the head of the companys metaverse oriented reality labs division to acknowledge last year that a product it could viably bring to market was still a few years away a few to put it lightly the company has been plowing tens of billions of dollars into its investments in artificial intelligence augmented reality and other metaverse technologies driving up its capital expense forecast for \u003cTWO_THOUSAND\u003e to a record high of between \u003cTHREE_TEN\u003e billion and \u003cFOUR_TEN\u003e billion","timestamp":"2024-09-25T16:22:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}