{"url":"https://economictimes.indiatimes.com/tech/technology/venus-mission-to-take-off-in-march-2028-carry-19-payloads/articleshow/113857664.cms","title":"Venus Mission to take off in March 2028, carry 19 payloads","description":"Being developed at a cost of Rs 1,236 crore by the Indian Space Research Organisation (Isro), the VOM will explore the planet's atmosphere, surface, and its interaction with the Sun. Key scientific objectives include examining dust in the Venusian atmosphere, mapping its surface topography in high resolution, studying the solar X-ray spectrum near Venus, analyzing Venusian airglow, and investigating sub-surface characteristics, said the space agency on Tuesday.","content":"India’s ambitious Venus Orbiter Mission (VOM) is tentatively slated to take off on March 28, 2028, and will carry 19 payloads onboard. These will include two Indian and international collaborative scientific instruments, and one international payload that has been recommended by the Experts Review Committee. The mission will be for a period of five years.Being developed at a cost of Rs 1,236 crore by the Indian Space Research Organisation (Isro), the VOM will explore the planet's atmosphere, surface, and its interaction with the Sun. Key scientific objectives include examining dust in the Venusian atmosphere, mapping its surface topography in high resolution, studying the solar X-ray spectrum near Venus, analyzing Venusian airglow, and investigating sub-surface characteristics, said the space agency on Tuesday. Additionally, along similar lines to Chandrayaan-3, the mission will aid in technology demonstration for ISRO, testing aerobraking and thermal management techniques in the harsh Venusian environment.“So far, the missions (undertaken by other countries) to Venus had limited and narrow spatial coverage, either in the South Polar region or in the equatorial belt. Hence, it is difficult to build global maps of many phenomena, including winds, waves, and chemical abundances. VOM would provide uniform coverage of Venus, thus providing a unique global dataset for future science missions,” stated ISRO. The spacecraft is expected to reach Earth’s twin in over 112 days, and the tentative date of arrival, according to the space agency, will be July 19, 2028.The space agency revealed that its trusted Launch Vehicle Mark-3 (LVM-3) rocket will be used to place the spacecraft around Venus. “LVM-3 has been identified as the candidate launch vehicle, which will place the spacecraft in an Elliptical Parking Orbit (EPO) of 170 km x 36,000 km, with a 21.5° inclination and an Argument of Perigee (AOP) of 178°,” said ISRO in a statement.Post the cruise phase—spacecraft’s flight—aerobraking will be employed for over a period of 6 to 8 months to achieve the desired low altitude. During this period, several demonstrations will be undertaken to study Venus. Scientists believe these experiments will provide an excellent opportunity for the first time to probe the surface and atmosphere of Venus.","cleaned_content":"india s ambitious venus orbiter mission vom is tentatively slated to take off on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and will carry \u003cONE_TEN\u003e payloads onboard these will include two indian and international collaborative scientific instruments and one international payload that has been recommended by the experts review committee the mission will be for a period of five years being developed at a cost of rs \u003cONE_THOUSAND\u003e crore by the indian space research organisation isro the vom will explore the planets atmosphere surface and its interaction with the sun key scientific objectives include examining dust in the venusian atmosphere mapping its surface topography in high resolution studying the solar x ray spectrum near venus analyzing venusian airglow and investigating sub surface characteristics said the space agency on tuesday additionally along similar lines to chandrayaan \u003cTHREE_\u003e the mission will aid in technology demonstration for isro testing aerobraking and thermal management techniques in the harsh venusian environment so far the missions undertaken by other countries to venus had limited and narrow spatial coverage either in the south polar region or in the equatorial belt hence it is difficult to build global maps of many phenomena including winds waves and chemical abundances vom would provide uniform coverage of venus thus providing a unique global dataset for future science missions stated isro the spacecraft is expected to reach earth s twin in over \u003cONE_HUNDRED\u003e days and the tentative date of arrival according to the space agency will be july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the space agency revealed that its trusted launch vehicle mark \u003cTHREE_\u003e lvm \u003cTHREE_\u003e rocket will be used to place the spacecraft around venus lvm \u003cTHREE_\u003e has been identified as the candidate launch vehicle which will place the spacecraft in an elliptical parking orbit epo of \u003cONE_HUNDRED\u003e km x \u003cTHREE_TEN_THOUSAND\u003e km with a \u003cTWO_TEN\u003e inclination and an argument of perigee aop of \u003cONE_HUNDRED\u003e said isro in a statement post the cruise phase spacecraft s flight aerobraking will be employed for over a period of \u003cSIX_\u003e to \u003cEIGHT_\u003e months to achieve the desired low altitude during this period several demonstrations will be undertaken to study venus scientists believe these experiments will provide an excellent opportunity for the first time to probe the surface and atmosphere of venus","timestamp":"2024-10-01T20:50:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}