{"url":"https://economictimes.indiatimes.com/tech/technology/land-for-semiconductor-fabrication-plant-already-identified-mamata/articleshow/113741276.cms","title":"Land for semiconductor fabrication plant already identified: Mamata","description":"West Bengal Chief Minister Mamata Banerjee said that the state IT department and Webel were \"working on this for the last three years\".","content":"West Bengal Chief Minister Mamata Banerjee on Thursday said that her government has already identified the land on which the country's first-ever national security semiconductor fabrication plant under the transformative collaboration with the US will be set up. US Consul General Kathy Giles-Diaz called on Banerjee at the state secretariat on Thursday. \"We have already identified and readied the land. They (US) also have seen one land. Once this centre gets ready, it will be a global phenomenon. They will be able to use our talents here. The infrastructure will help in boosting our talents,\" she said. The chief minister said that during Thursday's meeting, where Chief Secretary Manoj Pant, and his predecessor Alapan Bandyopadhyay, among other officials, were present, a proposal was made to \"consider formulating a roadmap in the second week of January next year\". Stating that the project would be a big achievement for the state, Banerjee expressed hope that once in place, the project would generate a huge employment. \"It will be a big achievement for West Bengal. There will be a huge employment generation,\" she said. ","cleaned_content":"west bengal chief minister mamata banerjee on thursday said that her government has already identified the land on which the countrys first ever national security semiconductor fabrication plant under the transformative collaboration with the us will be set up us consul general kathy giles diaz called on banerjee at the state secretariat on thursday we have already identified and readied the land they us also have seen one land once this centre gets ready it will be a global phenomenon they will be able to use our talents here the infrastructure will help in boosting our talents she said the chief minister said that during thursdays meeting where chief secretary manoj pant and his predecessor alapan bandyopadhyay among other officials were present a proposal was made to consider formulating a roadmap in the second week of january next year stating that the project would be a big achievement for the state banerjee expressed hope that once in place the project would generate a huge employment it will be a big achievement for west bengal there will be a huge employment generation she said","timestamp":"2024-09-27T17:51:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}