{"url":"https://economictimes.indiatimes.com/tech/information-tech/firstsource-acquires-uk-based-ascensos-for-56-million/articleshow/113604886.cms","title":"Firstsource acquires UK-based Ascensos for $56 million","description":"Ascensos will operate as a separate business unit within Firstsource, keeping its existing brand and maintaining its Scottish headquarter while using the combined company’s technological capabilities and expert employees to serve the retail industry better.","content":"RP-Sanjiv Goenka group’s Firstsource solutions Monday acquired UK-based customer experience outsourcing partner for retail and eCommerce businesses, Ascensos for a consideration of £42 million ($55.9 million). The business process management (BPM) firm said in a filing with stock exchange that the acquisition will help the firm in strategic expansion into the retail vertical, strengthen nearshore, and multi-lingual capabilities.The UK subsidiary of Firstsource - Firstsource Solutions UK Limited has executed a share purchase agreement with the Shareholders of Ascensos Limited, UK for acquisition of 100% ownership in Ascensos, added the firm in the filing. Upon completion of the transaction, Ascensos will become a subsidiary of FSL UK and in turn a step- down subsidiary of the company.Ascensos will operate as a separate business unit within Firstsource, keeping its existing brand and maintaining its Scottish headquarter while using the combined company’s technological capabilities and expert employees to serve the retail industry better. ","cleaned_content":"rp sanjiv goenka group s firstsource solutions monday acquired uk based customer experience outsourcing partner for retail and ecommerce businesses ascensos for a consideration of \u003cFOUR_TEN\u003e million \u003cFIVE_TEN\u003e million the business process management bpm firm said in a filing with stock exchange that the acquisition will help the firm in strategic expansion into the retail vertical strengthen nearshore and multi lingual capabilities the uk subsidiary of firstsource firstsource solutions uk limited has executed a share purchase agreement with the shareholders of ascensos limited uk for acquisition of \u003cONE_HUNDRED_PERCENT\u003e ownership in ascensos added the firm in the filing upon completion of the transaction ascensos will become a subsidiary of fsl uk and in turn a step down subsidiary of the company ascensos will operate as a separate business unit within firstsource keeping its existing brand and maintaining its scottish headquarter while using the combined company s technological capabilities and expert employees to serve the retail industry better","timestamp":"2024-09-23T19:49:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}