{"url":"https://economictimes.indiatimes.com/tech/technology/tier-ii-saas-mafia-flips-the-script-to-shift-action-to-the-hinterlands/articleshow/113792265.cms","title":"Tier-II SaaS 'mafia' flips the script to shift action to the hinterlands","description":"With a strong focus on costs and profitability, many of these companies are bootstrapped and are focusing big time on business. While this may be at a nascent stage right now, with only a few employees from these firms starting up, it is expected to pick up pace as more people are bit by the entrepreneurial bug and venture out to build their own companies.","content":"There was a time where everyone was talking about the Freshworks and Zoho \"mafia\" that led to several employees of these companies branching out to start their own firms - some of which have become extremely successful. Chennai's success in SaaS is known but there's a silent movement happening across the smaller cities across the country that can be dubbed the early makings of a 'tier II mafia,' industry watchers said.SaaS startups like Responsive in Coimbatore, Supersourcing in Indore, Appointy in Bhopal, DreamCast in Jaipur, Dhiwise in Surat or CallHippo in Ahmedabad - these are all examples of companies that are slowly scaling and becoming the anchor companies in these regions. \"There are SaaS startups that are maturing and reaching a certain scale and size in a number of emerging cities,\" Avinash Raghava, CEO of the industry collective SaaSBoomi told ET. \"This is happening across the board where there are anchor companies emerging that are having their employees leave to start their own SaaS firms. It is still in the nascent stage but we are seeing it happen increasingly now wherein I believe the next Freshworks or Zoho will not come from Chennai or Bangalore but will be from one of these emerging cities.”With a strong focus on costs and profitability, many of these companies are bootstrapped and are focusing big time on business. While this may be at a nascent stage right now, with only a few employees from these firms starting up, it is expected to pick up pace as more people are bit by the entrepreneurial bug and venture out to build their own companies. \"There is no other way than to have this happen,\" Ganesh Shankar, CEO and co-founder of Responsive said. \"Those who have the entrepreneurial spirit, it is the most natural thing to happen. I can confidently say that for the size of the city, Coimbatore is definitely seeing this trend.\"","cleaned_content":"there was a time where everyone was talking about the freshworks and zoho mafia that led to several employees of these companies branching out to start their own firms some of which have become extremely successful chennais success in saas is known but theres a silent movement happening across the smaller cities across the country that can be dubbed the early makings of a tier ii mafia industry watchers said saas startups like responsive in coimbatore supersourcing in indore appointy in bhopal dreamcast in jaipur dhiwise in surat or callhippo in ahmedabad these are all examples of companies that are slowly scaling and becoming the anchor companies in these regions there are saas startups that are maturing and reaching a certain scale and size in a number of emerging cities avinash raghava ceo of the industry collective saasboomi told et this is happening across the board where there are anchor companies emerging that are having their employees leave to start their own saas firms it is still in the nascent stage but we are seeing it happen increasingly now wherein i believe the next freshworks or zoho will not come from chennai or bangalore but will be from one of these emerging cities with a strong focus on costs and profitability many of these companies are bootstrapped and are focusing big time on business while this may be at a nascent stage right now with only a few employees from these firms starting up it is expected to pick up pace as more people are bit by the entrepreneurial bug and venture out to build their own companies there is no other way than to have this happen ganesh shankar ceo and co founder of responsive said those who have the entrepreneurial spirit it is the most natural thing to happen i can confidently say that for the size of the city coimbatore is definitely seeing this trend","timestamp":"2024-09-30T06:00:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}