{"url":"https://economictimes.indiatimes.com/tech/technology/us-offers-evgo-conditional-1-05-billion-loan-for-ev-chargers/articleshow/113913425.cms","title":"US offers EVgo conditional $1.05 billion loan for EV chargers","description":"The EVgo chargers, meant to be built over five years, will complement a federal program created in 2021 that aims to put chargers every 50 miles (80 km) on highways, Shah said. That federal grant program has been criticized for slow progress.","content":"The United States on Thursday offered EVgo a conditional loan guarantee of up to $1.05 billion to expand public electric vehicle-charging infrastructure across the country, some of which in marginalized urban communities.  If finalised, the loan guarantee from the Loan Programs Office (LPO) at the Department of Energy will support EVgo's deployment of about 7,500 public stalls with high power chargers that can power two EVs simultaneously at nearly 1,100 stations.  The financing should help EVgo, which has a high cost of capital, compete with Tesla's network of chargers, Jigar Shah, the head of the LPO, told Reuters.  \"The key is helping the company really achieve far higher customer service scores, (which) will mean that more people want to charge there, and it'll mean that they'll be able to pay back our loan faster,\" Shah said. EVgo, which is not yet profitable, currently has more than 3,500 fast charging stalls.  It was the first financial aid for an EV charger company from the LPO and comes from the office's innovative clean energy program, which has about another $70 billion of loan authority. ","cleaned_content":"the united states on thursday offered evgo a conditional loan guarantee of up to \u003cONE_\u003e billion to expand public electric vehicle charging infrastructure across the country some of which in marginalized urban communities if finalised the loan guarantee from the loan programs office lpo at the department of energy will support evgos deployment of about \u003cSEVEN_THOUSAND\u003e public stalls with high power chargers that can power two evs simultaneously at nearly \u003cONE_THOUSAND\u003e stations the financing should help evgo which has a high cost of capital compete with teslas network of chargers jigar shah the head of the lpo told reuters the key is helping the company really achieve far higher customer service scores which will mean that more people want to charge there and itll mean that theyll be able to pay back our loan faster shah said evgo which is not yet profitable currently has more than \u003cTHREE_THOUSAND\u003e fast charging stalls it was the first financial aid for an ev charger company from the lpo and comes from the offices innovative clean energy program which has about another \u003cSEVEN_TEN\u003e billion of loan authority","timestamp":"2024-10-03T20:23:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}