{"url":"https://economictimes.indiatimes.com/tech/technology/cbre-to-bolster-digital-technology-workforce-in-india/articleshow/113640477.cms","title":"CBRE to bolster digital, technology workforce in India","description":"Dave highlighted the pivotal role India plays in CBRE's global technology strategy, with the Hyderabad centre, the company's second largest outside the United States, serving as the primary software development hub for the Asia Pacific region. The India team has been instrumental in developing innovative solutions leveraging mapping, augmented reality, and data analytics.","content":"Global commercial real estate services firm CBRE plans to significantly bolster its digital and technology (D\u0026T) workforce in India over the next two to three years. According to Sandeep Dave, chief digital and technology officer, the company aims to increase its D\u0026T employee count in the country by nearly 30% from the current 1,500.Dave highlighted the pivotal role India plays in CBRE's global technology strategy, with the Hyderabad centre, the company's second largest outside the United States, serving as the primary software development hub for the Asia Pacific region. The India team has been instrumental in developing innovative solutions leveraging mapping, augmented reality, and data analytics.\"I absolutely see Indian tech talent as a game changer,\" said Dave. \"We did not have a meaningful India presence four or five years ago. We are now 5x in size as far as the India presence is concerned.\"He was on an India visit, speaking to the media in New Delhi on Tuesday. Dave said CBRE's hiring strategy is inclusive, encompassing talent from tier two and tier three universities as well as IITs. \"We've had some amazing mobility as well, where Indian teams have moved on and joined our global teams,\" he added.","cleaned_content":"global commercial real estate services firm cbre plans to significantly bolster its digital and technology d t workforce in india over the next two to three years according to sandeep dave chief digital and technology officer the company aims to increase its d t employee count in the country by nearly \u003cTHREE_TEN_PERCENT\u003e from the current \u003cONE_THOUSAND\u003e dave highlighted the pivotal role india plays in cbres global technology strategy with the hyderabad centre the companys second largest outside the united states serving as the primary software development hub for the asia pacific region the india team has been instrumental in developing innovative solutions leveraging mapping augmented reality and data analytics i absolutely see indian tech talent as a game changer said dave we did not have a meaningful india presence four or five years ago we are now \u003cFIVE_\u003e x in size as far as the india presence is concerned he was on an india visit speaking to the media in new delhi on tuesday dave said cbres hiring strategy is inclusive encompassing talent from tier two and tier three universities as well as iits weve had some amazing mobility as well where indian teams have moved on and joined our global teams he added","timestamp":"2024-09-24T21:09:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}