{"url":"https://economictimes.indiatimes.com/tech/technology/eam-jaishankar-reaffirms-indias-commitment-to-boost-ties-with-bimstec/articleshow/113782176.cms","title":"EAM Jaishankar reaffirms India's commitment to boost ties with BIMSTEC","description":"\"Discussions around upgrading our partnership and deepening cooperation in health, IT, FinTech, capacity building, renewables and food security,\" External Affairs Minister S Jaishankar posted on X.","content":"External Affairs Minister S Jaishankar has reaffirmed India's commitment to wider engagement with the seven-nation grouping BIMSTEC in line with its Neighbourhood First and Act East policies. Jaishankar, who is in the US to attend the 79th session of the United Nations General Assembly, on Friday chaired the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation's informal Foreign Ministers' meeting in New York on the sidelines of the high-level session. The meeting was held to prepare for the BIMSTEC Leaders' Summit. \"Took stock of our close cooperation in health, food security, trade, investment, economy and energy. Focused on improving physical, maritime and digital connectivity across the region. Explored opportunities for capacity building, skill development and improving people-to-people ties,\" Jaishankar said in a post on X. \"The development of BIMSTEC Centres of Excellence is a collective resolve. Reaffirmed India's commitment to wider engagement with BIMSTEC in line with Neighbourhood First, Vision SAGAR and Act East Policy,\" he said. ","cleaned_content":"external affairs minister s jaishankar has reaffirmed indias commitment to wider engagement with the seven nation grouping bimstec in line with its neighbourhood first and act east policies jaishankar who is in the us to attend the \u003cSEVEN_TEN\u003e th session of the united nations general assembly on friday chaired the bay of bengal initiative for multi sectoral technical and economic cooperations informal foreign ministers meeting in new york on the sidelines of the high level session the meeting was held to prepare for the bimstec leaders summit took stock of our close cooperation in health food security trade investment economy and energy focused on improving physical maritime and digital connectivity across the region explored opportunities for capacity building skill development and improving people to people ties jaishankar said in a post on x the development of bimstec centres of excellence is a collective resolve reaffirmed indias commitment to wider engagement with bimstec in line with neighbourhood first vision sagar and act east policy he said","timestamp":"2024-09-29T12:45:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}