{"url":"https://economictimes.indiatimes.com/tech/technology/uk-govt-buys-semiconductor-facility-key-to-defence/articleshow/113769698.cms","title":"UK govt buys semiconductor facility key to defence","description":"The UK government announced on Friday that it had acquired a key semiconductor factory after fears its imminent closure would hamper a crucial supply chain to Britain's armed forces. The government has bought the factory from US company Coherent Inc and will be named Octric Semiconductors UK, the MoD said.","content":"The UK government announced on Friday that it had acquired a key semiconductor factory after fears its imminent closure would hamper a crucial supply chain to Britain's armed forces.The facility at Newton Aycliffe in northeast England is the only secure site in Britain with the capability to produce gallium arsenide chips, used in electronic devices.The semiconductors are used in a number of military platforms, including to boost fighter jet capabilities.\"Semiconductors are at the forefront of the technology we rely upon today, and will be crucial in securing our military's capabilities for tomorrow,\" said Defence Secretary John Healey.\"This acquisition is a clear signal that our government will back British defence production,\" he added in a statement released by the Ministry of Defence (MoD).","cleaned_content":"the uk government announced on friday that it had acquired a key semiconductor factory after fears its imminent closure would hamper a crucial supply chain to britains armed forces the facility at newton aycliffe in northeast england is the only secure site in britain with the capability to produce gallium arsenide chips used in electronic devices the semiconductors are used in a number of military platforms including to boost fighter jet capabilities semiconductors are at the forefront of the technology we rely upon today and will be crucial in securing our militarys capabilities for tomorrow said defence secretary john healey this acquisition is a clear signal that our government will back british defence production he added in a statement released by the ministry of defence mod","timestamp":"2024-09-28T20:24:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}