{"url":"https://economictimes.indiatimes.com/tech/technology/chinas-pc-shipments-nosedive-6-amid-weak-demand/articleshow/113788650.cms","title":"China's PC shipments nosedive 6% amid weak demand","description":"The country's PC shipments declined by 6%  in Q2, with the consumer and commercial sectors falling by 3 per cent and 9 per cent, respectively, as per a Canalys report. Analyst Emma Xu said that the competitive dynamics of China's PC market are rapidly increasing in complexity.","content":"China's PC shipments (including desktops, notebooks and workstations) fell by 6% (year-on-year) to 9.1 million in the April-June quarter as weak demand continued.The country's PC shipments declined by 6% in Q2, with the consumer and commercial sectors falling by 3 per cent and 9 per cent, respectively, as per a Canalys report.Analyst Emma Xu said that the competitive dynamics of China's PC market are rapidly increasing in complexity.\"Local AI regulations have constrained the full deployment of Microsoft's Copilot in Mainland China. This is pushing vendors toward localised strategies to develop AI PCs, either by integrating in-house AI assistants or by building their own AI application ecosystems through collaboration with developers,\" Xu explained.The forecast anticipates 13% penetration of AI-capable PCs in Greater China in 2024.","cleaned_content":"chinas pc shipments including desktops notebooks and workstations fell by \u003cSIX_PERCENT\u003e year on year to \u003cNINE_\u003e million in the april june quarter as weak demand continued the countrys pc shipments declined by \u003cSIX_PERCENT\u003e in q2 with the consumer and commercial sectors falling by \u003cTHREE_PERCENT\u003e and \u003cNINE_PERCENT\u003e respectively as per a canalys report analyst emma xu said that the competitive dynamics of chinas pc market are rapidly increasing in complexity local ai regulations have constrained the full deployment of microsofts copilot in mainland china this is pushing vendors toward localised strategies to develop ai pcs either by integrating in house ai assistants or by building their own ai application ecosystems through collaboration with developers xu explained the forecast anticipates \u003cONE_TEN_PERCENT\u003e penetration of ai capable pcs in greater china in \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-29T18:57:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}