{"url":"https://economictimes.indiatimes.com/tech/technology/partners-group-backed-kindercare-seeks-up-to-3-1-billion-valuation-in-long-sought-us-ipo/articleshow/113817376.cms","title":"Partners Group-backed KinderCare seeks up to $3.1 billion valuation in long-sought US IPO","description":"The 55-year-old company, backed by Swiss private equity firm Partners Group, is moving towards a listing after previously pursuing it in 2021.","content":"KinderCare Learning Companies, a provider of early childhood education, set a target of up to $3.09 billion valuation on Monday for its long-sought U.S. initial public offering. The 55-year-old company, backed by Swiss private equity firm Partners Group, is moving towards a listing after previously pursuing it in 2021. KinderCare is aiming to raise up to $648 million by offering 24 million shares at a price range of $23 and $27 each. The company, whose brands include KCLC, Creme School, and Champions, serves children ranging from six weeks to 12 years of age. The IPO would be among the first major moves under CEO Paul Thompson, who took over the mantle in June after Tom Wyatt's 12-year stint.","cleaned_content":"kindercare learning companies a provider of early childhood education set a target of up to \u003cTHREE_\u003e billion valuation on monday for its long sought u s initial public offering the \u003cFIVE_TEN\u003e year old company backed by swiss private equity firm partners group is moving towards a listing after previously pursuing it in \u003cTWO_THOUSAND\u003e kindercare is aiming to raise up to \u003cSIX_HUNDRED\u003e million by offering \u003cTWO_TEN\u003e million shares at a price range of \u003cTWO_TEN\u003e and \u003cTWO_TEN\u003e each the company whose brands include kclc creme school and champions serves children ranging from six weeks to \u003cONE_TEN\u003e years of age the ipo would be among the first major moves under ceo paul thompson who took over the mantle in june after tom wyatts \u003cONE_TEN\u003e year stint","timestamp":"2024-09-30T17:05:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}