{"url":"https://economictimes.indiatimes.com/tech/information-tech/it-companies-log-strong-deal-wins-in-q2-after-a-long-lull/articleshow/113576287.cms","title":"IT companies log strong deal wins in Q2 after a long lull","description":"Experts said demand is coming back even though at a slower pace with smaller-sized and tenured deals. There are also some transformative deals. \"The turnaround of the services industry has got delayed. Though there are not many tailwinds, some deals of meaningful sizes have got signed, which can influence revenue for 2025 for specific providers,\" said Yugal Joshi, partner at IT outsourcing consultancy Everest Group.","content":"Indian IT majors are signing more deals this quarter than earlier, indicating a good pickup in demand momentum after a deep lull, and many more strong deal wins are on the cards with the US Federal Reserve reducing interest rates. The country's key IT services providers globally signed at least 33 deals in July and August, data sourced by ET showed. Tata Consultancy Services alone has announced four deal wins including Ireland-headquartered fashion retailer Primark, Rolls-Royce, Sydney Marathon, and most recently McDonald's Philippines in the first two months of the second quarter. Its closest rival Infosys-which signed the second highest number (three) of deals in July after Cognizant-has closed agreements with Sector Alarm, Delaware Department of Labor, TDC Net, ServiceNow, Metro Bank, and Finnish Postal service provider Posti group.","cleaned_content":"indian it majors are signing more deals this quarter than earlier indicating a good pickup in demand momentum after a deep lull and many more strong deal wins are on the cards with the us federal reserve reducing interest rates the countrys key it services providers globally signed at least \u003cTHREE_TEN\u003e deals in july and august data sourced by et showed tata consultancy services alone has announced four deal wins including ireland headquartered fashion retailer primark rolls royce sydney marathon and most recently mcdonalds philippines in the first two months of the second quarter its closest rival infosys which signed the second highest number three of deals in july after cognizant has closed agreements with sector alarm delaware department of labor tdc net servicenow metro bank and finnish postal service provider posti group","timestamp":"2024-09-23T06:00:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}