{"url":"https://economictimes.indiatimes.com/tech/technology/hiring-for-operational-tech-roles-surges-as-india-embraces-industry-4-0-local-manufacturing/articleshow/113606916.cms","title":"Operational tech roles log 20% surge in demand","description":"Infrastructure projects, particularly the government's smart city initiative, have spurred an 11% rise in OT hiring, Sharma said. The focus on process automation and regulatory compliance in the chemical and pharmaceuticals sector resulted in an 8-10% growth in OT positions. Smart manufacturing and autonomous vehicle technologies in the automotive sector led to a 12% increase.","content":"Even as hiring in the IT sector remains muted, demand for roles in operational technology (OT) has grown by as much as 20% in some sectors over the past year. This comes amid India’s increasing focus on Industry 4.0 and local manufacturing.OT refers to the hardware and software deployed to monitor and control devices, processes and infrastructure in industrial settings.“OT roles are on the rise, though their growth is more niche, driven by sectors such as manufacturing, energy and infrastructure. OT roles have seen a 10-15% annual growth rate, highlighting a smaller but rapidly expanding segment compared to the broader IT industry,” said Neeti Sharma, CEO, TeamLease Digital.The roll out of 5G and rapid network expansions led to a 20% increase in OT roles in the telecom sector while the Industry 4.0 push has led to a 15-17% increase in OT roles between 2023 and 2024, data from Teamlease Digital showed.","cleaned_content":"even as hiring in the it sector remains muted demand for roles in operational technology ot has grown by as much as \u003cTWO_TEN_PERCENT\u003e in some sectors over the past year this comes amid india s increasing focus on industry \u003cFOUR_\u003e and local manufacturing ot refers to the hardware and software deployed to monitor and control devices processes and infrastructure in industrial settings ot roles are on the rise though their growth is more niche driven by sectors such as manufacturing energy and infrastructure ot roles have seen a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e annual growth rate highlighting a smaller but rapidly expanding segment compared to the broader it industry said neeti sharma ceo teamlease digital the roll out of \u003cFIVE_\u003e g and rapid network expansions led to a \u003cTWO_TEN_PERCENT\u003e increase in ot roles in the telecom sector while the industry \u003cFOUR_\u003e push has led to a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e increase in ot roles between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e data from teamlease digital showed","timestamp":"2024-09-24T06:00:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}