{"url":"https://economictimes.indiatimes.com/tech/technology/betting-app-fiewin-in-ed-crosshairs-attaches-assets-including-cryptocurrency-in-binance/articleshow/113675011.cms","title":"Betting app Fiewin in ED crosshairs; attaches assets including cryptocurrency in Binance","description":"The ED probe in Kolkata found Chinese nationals allegedly operating Fiewin with the help of Indian accomplices. Four Indian nationals linked to the case have been taken into custody. The scheme generated around Rs 400 crore that was moved to seven wallets linked to Chinese nationals. These accounts were being operated from China.","content":"In a major crackdown against illegal online applications (apps) linked to Chinese nationals, the Enforcement Directorate (ED) has attached assets, including those parked in wallets of cryptocurrency major Binance, sources in the know told ET. The probe by the ED in Kolkata has found that Chinese nationals allegedly operated the illegal betting/gaming application, Fiewin, with the assistance of their Indian accomplices. The ED has arrested four Indian nationals linked to the case, and they are currently in judicial custody.Fiewin was projected as an app to make fast and easy money and was marketed through YouTube, Facebook, and other digital modes. The app had simple games like Minesweeper and Colour Prediction, based totally on luck without any role of the skills of the player. “Funds from app users/gamers were funnelled into the bank accounts of Indian “recharge persons” like Arun Sahu and Alok Sahu, who then converted these into cryptocurrency and transferred them to wallets owned by Chinese nationals on Binance. Another accused, Chetan Prakash, helped with this conversion, while Joseph Stalin facilitated the Chinese national Pie Pengyun’s involvement in a local company used for payout services.,” sources said.The ED probe has revealed that around Rs 400 crore was generated from this scheme and moved to seven Binance wallets linked to Chinese nationals. These accounts were being operated from China, as seen from the access log IP addresses, the source added.","cleaned_content":"in a major crackdown against illegal online applications apps linked to chinese nationals the enforcement directorate ed has attached assets including those parked in wallets of cryptocurrency major binance sources in the know told et the probe by the ed in kolkata has found that chinese nationals allegedly operated the illegal betting gaming application fiewin with the assistance of their indian accomplices the ed has arrested four indian nationals linked to the case and they are currently in judicial custody fiewin was projected as an app to make fast and easy money and was marketed through youtube facebook and other digital modes the app had simple games like minesweeper and colour prediction based totally on luck without any role of the skills of the player funds from app users gamers were funnelled into the bank accounts of indian recharge persons like arun sahu and alok sahu who then converted these into cryptocurrency and transferred them to wallets owned by chinese nationals on binance another accused chetan prakash helped with this conversion while joseph stalin facilitated the chinese national pie pengyun s involvement in a local company used for payout services sources said the ed probe has revealed that around rs \u003cFOUR_HUNDRED\u003e crore was generated from this scheme and moved to seven binance wallets linked to chinese nationals these accounts were being operated from china as seen from the access log ip addresses the source added","timestamp":"2024-09-26T16:44:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}