{"url":"https://economictimes.indiatimes.com/tech/technology/inside-elon-musks-mushrooming-security-apparatus/articleshow/113661066.cms","title":"Inside Elon Musk's mushrooming security apparatus","description":"Elon Musk, 53, has long cultivated a devil-may-care persona, traveling the world; hanging out with moguls, world leaders and celebrities; and smoking weed in public. But in private, he has increasingly barricaded himself behind a growing phalanx of armed bodyguards as he has become more wealthy, more famous and more outspoken -- and as the threats against him have evolved.","content":"The day before Elon Musk spoke at a celebration for Tesla's futuristic Cybertruck pickup in November, a Florida man, Paul Overeem, was arrested near the company's Austin, Texas, factory and accused by authorities of planning a \"mass casualty event\" there. The incident later made headlines. What went less noticed is what happened at Tesla's event, which went ahead at the Austin factory. Security had been alerted to Overeem's threats and was fully activated, according to two people with knowledge of the arrangements and documents viewed by The New York Times. The list of invitees was carefully curated, with each person screened well ahead of time. More than three dozen Tesla security officials were then stationed throughout the room when Musk, who runs the carmaker, took the stage. He also had bodyguards from his private security firm, Foundation Security, on hand. Musk, 53, has long cultivated a devil-may-care persona, traveling the world; hanging out with moguls, world leaders and celebrities; and smoking weed in public. But in private, he has increasingly barricaded himself behind a growing phalanx of armed bodyguards as he has become more wealthy, more famous and more outspoken -- and as the threats against him have evolved. The world's richest man, with a net worth of more than $240 billion, he once fielded largely harmless calls and messages from ardent fans but now regularly deals with stalkers and death threats, according to police documents and internal Tesla records. While many high-profile people face threats, Musk has transformed his own protection in recent years to deal with the change, expanding an already robust personal security beyond that of other billionaires.","cleaned_content":"the day before elon musk spoke at a celebration for teslas futuristic cybertruck pickup in november a florida man paul overeem was arrested near the companys austin texas factory and accused by authorities of planning a mass casualty event there the incident later made headlines what went less noticed is what happened at teslas event which went ahead at the austin factory security had been alerted to overeems threats and was fully activated according to two people with knowledge of the arrangements and documents viewed by the new york times the list of invitees was carefully curated with each person screened well ahead of time more than three dozen tesla security officials were then stationed throughout the room when musk who runs the carmaker took the stage he also had bodyguards from his private security firm foundation security on hand musk \u003cFIVE_TEN\u003e has long cultivated a devil may care persona traveling the world hanging out with moguls world leaders and celebrities and smoking weed in public but in private he has increasingly barricaded himself behind a growing phalanx of armed bodyguards as he has become more wealthy more famous and more outspoken and as the threats against him have evolved the worlds richest man with a net worth of more than \u003cTWO_HUNDRED\u003e billion he once fielded largely harmless calls and messages from ardent fans but now regularly deals with stalkers and death threats according to police documents and internal tesla records while many high profile people face threats musk has transformed his own protection in recent years to deal with the change expanding an already robust personal security beyond that of other billionaires","timestamp":"2024-09-25T14:01:00+05:30","market_timestamp":"2024-09-25T14:01:00+05:30","off_market_hours":false}