{"url":"https://economictimes.indiatimes.com/tech/technology/bits-and-bytes-meta-unveils-glasses-pitched-as-smartphone-rival-and-more/articleshow/113767946.cms","title":"Bits and Bytes: Meta unveils glasses pitched as smartphone rival and more","description":"According to CEO Mark Zuckerberg, the bulky, black-framed prototype called ‘Orion’ is able to overlay holographic images on a wearer’s field of vision and is ultimately intended to rival the smartphone. “The right way to look at Orion is as a time machine,” Zuckerberg said.","content":"Meta unveils glasses pitched as smartphone rivalMeta has given a peek at augmented reality eyewear touted as the most advanced glasses in the world.According to CEO Mark Zuckerberg, the bulky, black-framed prototype called ‘Orion’ is able to overlay holographic images on a wearer’s field of vision and is ultimately intended to rival the smartphone. “The right way to look at Orion is as a time machine,” Zuckerberg said.People have been slow to embrace wearables in the form of headgear, but Meta is confident it can win them over by packing technology beefed up with AI into stylish Ray-Ban glasses that can do things like answer questions about what you are looking at or act as a translator for conversations.Study finds ‘vast surveillance’ of social media usersThe US Federal Trade Commission (FTC) said that it found several social media and streaming services engaging in a “vast surveillance” of consumers, including minors.","cleaned_content":"meta unveils glasses pitched as smartphone rivalmeta has given a peek at augmented reality eyewear touted as the most advanced glasses in the world according to ceo mark zuckerberg the bulky black framed prototype called orion is able to overlay holographic images on a wearer s field of vision and is ultimately intended to rival the smartphone the right way to look at orion is as a time machine zuckerberg said people have been slow to embrace wearables in the form of headgear but meta is confident it can win them over by packing technology beefed up with ai into stylish ray ban glasses that can do things like answer questions about what you are looking at or act as a translator for conversations study finds vast surveillance of social media usersthe us federal trade commission ftc said that it found several social media and streaming services engaging in a vast surveillance of consumers including minors","timestamp":"2024-09-29T06:01:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}