{"url":"https://economictimes.indiatimes.com/tech/technology/ireland-fines-meta-91-million-over-eu-data-breach/articleshow/113768009.cms","title":"Ireland fines Meta €91 million over EU data breach","description":"An Irish regulator helping to police European Union data privacy said Friday it had fined Facebook-owner Meta 91 million euros ($102 million) for password-security breaches. The Data Protection Commission criticised Meta for failing to put in place appropriate security measures to protect users' password data and for taking too long to alert the regulator over the issue.","content":"An Irish regulator helping to police European Union data privacy said Friday it had fined Facebook-owner Meta 91 million euros ($102 million) for password-security breaches.The Data Protection Commission criticised Meta for failing to put in place appropriate security measures to protect users' password data and for taking too long to alert the regulator over the issue.An inquiry was launched in April 2019 after Meta Ireland informed the regulator that it had \"inadvertently stored certain passwords of social media users\" in a readable format on its internal system, the DPC said in a statement.\"It is widely accepted that user passwords should not be stored in plaintext, considering the risks of abuse that arise from persons accessing such data,\" said Graham Doyle, the regulator's head of communications.Doyle told AFP that the breach, which took place in January 2019, affected 36 million Facebook and Instagram users across the European Economic Area, which comprises the EU plus Iceland, Liechtenstein and Norway.","cleaned_content":"an irish regulator helping to police european union data privacy said friday it had fined facebook owner meta \u003cNINE_TEN\u003e million euros \u003cONE_HUNDRED\u003e million for password security breaches the data protection commission criticised meta for failing to put in place appropriate security measures to protect users password data and for taking too long to alert the regulator over the issue an inquiry was launched in april \u003cTWO_THOUSAND\u003e after meta ireland informed the regulator that it had inadvertently stored certain passwords of social media users in a readable format on its internal system the dpc said in a statement it is widely accepted that user passwords should not be stored in plaintext considering the risks of abuse that arise from persons accessing such data said graham doyle the regulators head of communications doyle told afp that the breach which took place in january \u003cTWO_THOUSAND\u003e affected \u003cTHREE_TEN\u003e million facebook and instagram users across the european economic area which comprises the eu plus iceland liechtenstein and norway","timestamp":"2024-09-28T18:36:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}