{"url":"https://economictimes.indiatimes.com/tech/technology/sc-reserves-verdict-on-plea-against-nclat-order-stopping-insolvency-proceedings-against-byjus/articleshow/113693655.cms","title":"SC reserves verdict on plea against NCLAT order stopping insolvency proceedings against Byju's","description":"The bench, also comprising Justices JB Pardiwala and Manoj Misra, considered the plea of US firm Glas Trust Company LLC and asked the IRP not to proceed with the committee of creditor's meeting to deal with the Byju's case.","content":"The Supreme Court on Thursday reserved its verdict on a plea of a US firm against the NCLAT order stopping insolvency proceedings against ed-tech firm Byju's. A bench headed by Chief Justice D Y Chandrachud asked the insolvency resolution professional (IRP) to maintain status quo till the apex court delivers its judgement in the matter. The bench, also comprising Justices JB Pardiwala and Manoj Misra, considered the plea of US firm Glas Trust Company LLC and asked the IRP not to proceed with the committee of creditor's meeting to deal with the Byju's case. While hearing the matter on Wednesday, the top court had questioned the verdict of insolvency appellate tribunal NCLAT setting aside the insolvency proceedings against Byju's and approving its Rs 158.9 crore dues settlement with the BCCI. Observing that the National Company Law Appellate Tribunal (NCLAT) did not apply its mind while closing the insolvency proceedings against the ed-tech major, the bench had hinted that it may send back the dispute for fresh adjudication. The NCLAT, on August 2, granted relief to the embattled ed-tech firm by setting aside the insolvency proceedings against it after approving its Rs 158.9 crore dues settlement with the Board of Control for Cricket in India (BCCI). ","cleaned_content":"the supreme court on thursday reserved its verdict on a plea of a us firm against the nclat order stopping insolvency proceedings against ed tech firm byjus a bench headed by chief justice d y chandrachud asked the insolvency resolution professional irp to maintain status quo till the apex court delivers its judgement in the matter the bench also comprising justices jb pardiwala and manoj misra considered the plea of us firm glas trust company llc and asked the irp not to proceed with the committee of creditors meeting to deal with the byjus case while hearing the matter on wednesday the top court had questioned the verdict of insolvency appellate tribunal nclat setting aside the insolvency proceedings against byjus and approving its rs \u003cONE_HUNDRED\u003e crore dues settlement with the bcci observing that the national company law appellate tribunal nclat did not apply its mind while closing the insolvency proceedings against the ed tech major the bench had hinted that it may send back the dispute for fresh adjudication the nclat on august \u003cTWO_\u003e granted relief to the embattled ed tech firm by setting aside the insolvency proceedings against it after approving its rs \u003cONE_HUNDRED\u003e crore dues settlement with the board of control for cricket in india bcci","timestamp":"2024-09-26T13:19:00+05:30","market_timestamp":"2024-09-26T13:19:00+05:30","off_market_hours":false}