{"url":"https://economictimes.indiatimes.com/tech/technology/industries-minister-meets-tech-ceos-discusses-semiconductor-growth-in-state/articleshow/113857099.cms","title":"Industries minister meets tech CEOs, discusses semiconductor growth in state","description":"Lam Research, a global supplier of wafer fabrication equipment, that established its systems lab in Bengaluru in early September will further explore collaboration and innovation in the state’s semiconductor sector. The minister addressed key American companies at a roundtable hosted by the US-India Strategic Partnership Forum (USISPF).","content":"Karnataka's large and medium industries minister, MB Patil, met with global technology CEOs in New York on Tuesday to explore new opportunities for the growing semiconductor ecosystem in the state. His official visit included engagements with Eugenus Technology who is now eyeing expansion in the state. Eugenus provides advanced semiconductor manufacturing equipment that specializes in high-precision deposition, etching, and cleaning systems.Lam Research, a global supplier of wafer fabrication equipment, that established its systems lab in Bengaluru in early September will further explore collaboration and innovation in the state’s semiconductor sector. The minister addressed key American companies at a roundtable hosted by the US-India Strategic Partnership Forum (USISPF). Discussions focused on multi-faceted collaborations between the USA and Karnataka, exploring new avenues for potential growth and strengthening ties between both regions.During his visit, Patil also interacted with the CEO of Alphawave Semi, a company that provides connectivity solutions for data infrastructure. The CEO expressed keen interest in contributing to the burgeoning semiconductor landscape in Karnataka.The official visit aimed to position Karnataka as a global hub for the semiconductor industry, attracting investment and fostering innovation in the sector. The minister promoted the state’s proactive initiatives and state-of-the-art infrastructure, reinforcing its status as a top destination for semiconductor companies worldwide.","cleaned_content":"karnatakas large and medium industries minister mb patil met with global technology ceos in new york on tuesday to explore new opportunities for the growing semiconductor ecosystem in the state his official visit included engagements with eugenus technology who is now eyeing expansion in the state eugenus provides advanced semiconductor manufacturing equipment that specializes in high precision deposition etching and cleaning systems lam research a global supplier of wafer fabrication equipment that established its systems lab in bengaluru in early september will further explore collaboration and innovation in the state s semiconductor sector the minister addressed key american companies at a roundtable hosted by the us india strategic partnership forum usispf discussions focused on multi faceted collaborations between the usa and karnataka exploring new avenues for potential growth and strengthening ties between both regions during his visit patil also interacted with the ceo of alphawave semi a company that provides connectivity solutions for data infrastructure the ceo expressed keen interest in contributing to the burgeoning semiconductor landscape in karnataka the official visit aimed to position karnataka as a global hub for the semiconductor industry attracting investment and fostering innovation in the sector the minister promoted the state s proactive initiatives and state of the art infrastructure reinforcing its status as a top destination for semiconductor companies worldwide","timestamp":"2024-10-01T20:14:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}