{"url":"https://economictimes.indiatimes.com/tech/technology/ireland-unveils-bumper-budget-with-apple-tax-cash-boost/articleshow/113878774.cms","title":"Ireland unveils bumper budget with Apple tax cash boost","description":"Ireland is forecasting its fourth consecutive budget surplus in 2025, with 9.7 billion euros, faring much better than many other European countries thanks to its hefty corporate tax intake from multinational companies based in Dublin. The state's 2024 finances have been boosted by 14 billion euros in back-taxes from Apple, after the European Court of Justice ruled in September that the iPhone maker benefited from undue tax advantages in the country.","content":"Ireland on Tuesday unveiled a 2025 budget that includes tax cuts and increased social benefits, and announced a huge surplus in 2024 thanks to billions of euros in Apple back-taxes. Minister of Finance Jack Chambers announced a 10.5-billion-euro ($11.6-billion) 2025 budget package, which included higher public infrastructure investment and social welfare support.The moves come with a general election looming: Prime minister Simon Harris must go to the country before March 2025.But with poll ratings up for his coalition government, some suggest he could call the vote sooner. \"Budget 2025 puts the country on a firm footing for the future,\" Chambers told parliament.","cleaned_content":"ireland on tuesday unveiled a \u003cTWO_THOUSAND\u003e budget that includes tax cuts and increased social benefits and announced a huge surplus in \u003cTWO_THOUSAND\u003e thanks to billions of euros in apple back taxes minister of finance jack chambers announced a \u003cONE_TEN\u003e billion euro \u003cONE_TEN\u003e billion \u003cTWO_THOUSAND\u003e budget package which included higher public infrastructure investment and social welfare support the moves come with a general election looming prime minister simon harris must go to the country before march \u003cTWO_THOUSAND\u003e but with poll ratings up for his coalition government some suggest he could call the vote sooner budget \u003cTWO_THOUSAND\u003e puts the country on a firm footing for the future chambers told parliament","timestamp":"2024-10-02T18:15:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}