{"url":"https://economictimes.indiatimes.com/tech/technology/apollo-eyes-5-billion-investment-in-intel-reports/articleshow/113591037.cms","title":"Apollo eyes $5 billion investment in Intel: reports","description":"The news comes at a moment of weakness for Intel, which was once the most valuable chipmaker in the world, but whose shares have lost nearly 60% of their value since the start of the year. Intel executives have been weighing Apollo's proposal, Bloomberg reported, adding that talks regarding the deal are in a preliminary stage and have not been finalised.","content":"US-based asset management company Apollo Global Management has offered to make an investment of as much as $5 billion in Intel, Bloomberg News reported on Sunday. Apollo has indicated in recent days it would be willing to make an equity-like investment of billions of dollars in Intel, the report said, citing a person familiar with the matter. The news comes at a moment of weakness for Intel, which was once the most valuable chipmaker in the world, but whose shares have lost nearly 60% of their value since the start of the year. Intel executives have been weighing Apollo's proposal, Bloomberg reported, adding that talks regarding the deal are in a preliminary stage and have not been finalised. Bloomberg said that the size of the potential investment in Intel could change and discussions regarding a deal could also fall through.","cleaned_content":"us based asset management company apollo global management has offered to make an investment of as much as \u003cFIVE_\u003e billion in intel bloomberg news reported on sunday apollo has indicated in recent days it would be willing to make an equity like investment of billions of dollars in intel the report said citing a person familiar with the matter the news comes at a moment of weakness for intel which was once the most valuable chipmaker in the world but whose shares have lost nearly \u003cSIX_TEN_PERCENT\u003e of their value since the start of the year intel executives have been weighing apollos proposal bloomberg reported adding that talks regarding the deal are in a preliminary stage and have not been finalised bloomberg said that the size of the potential investment in intel could change and discussions regarding a deal could also fall through","timestamp":"2024-09-23T12:50:00+05:30","market_timestamp":"2024-09-23T12:50:00+05:30","off_market_hours":false}