{"url":"https://economictimes.indiatimes.com/tech/technology/why-trump-wants-to-make-america-the-crypto-capital-of-the-planet/articleshow/113900618.cms","title":"Why Trump wants to make America the 'crypto capital of the planet'","description":"In 2021, Trump was an outspoken critic of digital currencies, telling Newsmax, \"I'm not a fan of bitcoin and other cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air.\" At a June 27 Bitcoin conference in Nashville, Trump told attendees that if he is elected again to the presidency, he would make the United States \"the crypto capital of the planet.\" He also promised to fire government regulators who have been critical of the industry.","content":"The former president's views of virtual coins have shifted markedly in recognition of the emergence of this sector as a major player in campaign finance. Donald Trump's views of the cryptocurrency industry have shifted markedly in recognition of the emergence of this sector as a major player in the world of campaign finance. In 2021, Trump was an outspoken critic of digital currencies, telling Newsmax, \"I'm not a fan of bitcoin and other cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air.\" That same year, Trump told Fox Business that crypto was a \"disaster waiting to happen\" and that the United States should \"regulate very, very high.\" This year, he has done an about face. At a June 27 Bitcoin conference in Nashville, Trump told attendees that if he is elected again to the presidency, he would make the United States \"the crypto capital of the planet.\" He also promised to fire government regulators who have been critical of the industry.","cleaned_content":"the former presidents views of virtual coins have shifted markedly in recognition of the emergence of this sector as a major player in campaign finance donald trumps views of the cryptocurrency industry have shifted markedly in recognition of the emergence of this sector as a major player in the world of campaign finance in \u003cTWO_THOUSAND\u003e trump was an outspoken critic of digital currencies telling newsmax im not a fan of bitcoin and other cryptocurrencies which are not money and whose value is highly volatile and based on thin air that same year trump told fox business that crypto was a disaster waiting to happen and that the united states should regulate very very high this year he has done an about face at a june \u003cTWO_TEN\u003e bitcoin conference in nashville trump told attendees that if he is elected again to the presidency he would make the united states the crypto capital of the planet he also promised to fire government regulators who have been critical of the industry","timestamp":"2024-10-03T13:22:00+05:30","market_timestamp":"2024-10-03T13:22:00+05:30","off_market_hours":false}