{"url":"https://economictimes.indiatimes.com/tech/technology/npci-international-to-help-launch-upi-like-real-time-payments-in-trinidad-and-tobago/articleshow/113731159.cms","title":"NPCI International to help launch UPI-like payments platform in Trinidad and Tobago","description":"Trinidad and Tobago is the first Caribbean nation to adopt India’s popular instant payments platform UPI. Countries like Bhutan, Sri Lanka, Nepal, Singapore, France are either connecting to the UPI framework to make it interoperable with their payment systems or using the open source platform to build their own instant payment systems.","content":"NPCI International Payments (NIPL) has entered into a strategic partnership with the Ministry of Digital Transformation (MDT) of Trinidad and Tobago to develop an Unified Payments Interface (UPI)-like real-time payments platform for the country.Trinidad and Tobago is the first Caribbean nation to adopt India’s popular instant payments platform UPI.In a press release, NIPL said that this partnership aims to empower Trinidad and Tobago to establish a reliable and efficient real-time payments platform for both person-to-person (P2P) and person-to-merchant (P2M) transactions, expanding digital payments in the country and fostering financial inclusion. By leveraging technology and experiences from India’s UPI, this partnership will enhance accessibility, affordability, connectivity with domestic and international payment networks in the times to come and ensuring interoperability, per the statement.“Our experience with UPI in India has demonstrated how real-time payments can transform economies by improving access to essential financial services and reducing reliance on cash. We look forward to working closely with the Ministry of Digital Transformation and the Central Bank in Trinidad and Tobago,” said Ritesh Shukla, CEO, NPCI International.","cleaned_content":"npci international payments nipl has entered into a strategic partnership with the ministry of digital transformation mdt of trinidad and tobago to develop an unified payments interface upi like real time payments platform for the country trinidad and tobago is the first caribbean nation to adopt india s popular instant payments platform upi in a press release nipl said that this partnership aims to empower trinidad and tobago to establish a reliable and efficient real time payments platform for both person to person p2p and person to merchant p2m transactions expanding digital payments in the country and fostering financial inclusion by leveraging technology and experiences from india s upi this partnership will enhance accessibility affordability connectivity with domestic and international payment networks in the times to come and ensuring interoperability per the statement our experience with upi in india has demonstrated how real time payments can transform economies by improving access to essential financial services and reducing reliance on cash we look forward to working closely with the ministry of digital transformation and the central bank in trinidad and tobago said ritesh shukla ceo npci international","timestamp":"2024-09-27T13:15:00+05:30","market_timestamp":"2024-09-27T13:15:00+05:30","off_market_hours":false}