{"url":"https://economictimes.indiatimes.com/tech/information-tech/its-fresher-hiring-may-double-in-fy25-on-demand-rebound/articleshow/113826767.cms","title":"IT’s fresher hiring may double in FY25 on demand rebound","description":"After a sluggish period, the IT sector is set for a significant recovery in fresher hiring, with projections indicating a nearly 100% increase in entry-level hires this year compared to the last. Several big IT firms have already announced plans to resume campus hiring and expand their workforce.","content":"Fresher hiring in the IT services sector is expected to witness a substantial rebound this year, with projections indicating a nearly 100% increase in entry-level hires compared to last fiscal. According to data sourced by ET, the sector is set to surpass 150,000 fresher hires in FY25.This optimism is driven by increasing demand in business, particularly in the banking, financial services, and insurance (BFSI) segment—the largest vertical for most IT firms—as well as strong large deal wins and global expansion by IT majors, experts say.“FY2024 saw the lowest intake of freshers in the IT sector since 2000. However, FY2025 is expected to witness a significant rebound, with a potential 100% year-on-year (YoY) growth, surpassing 150,000 entry-level hires,” said Kapil Joshi, Deputy CEO at Quess IT Staffing. This is in contrast to the approximately 60,000 net hires recorded by the $250 billion technology services industry in FY24. ","cleaned_content":"fresher hiring in the it services sector is expected to witness a substantial rebound this year with projections indicating a nearly \u003cONE_HUNDRED_PERCENT\u003e increase in entry level hires compared to last fiscal according to data sourced by et the sector is set to surpass \u003cONE_HUNDRED_THOUSAND\u003e fresher hires in fy25 this optimism is driven by increasing demand in business particularly in the banking financial services and insurance bfsi segment the largest vertical for most it firms as well as strong large deal wins and global expansion by it majors experts say fy2024 saw the lowest intake of freshers in the it sector since \u003cTWO_THOUSAND\u003e however fy2025 is expected to witness a significant rebound with a potential \u003cONE_HUNDRED_PERCENT\u003e year on year yoy growth surpassing \u003cONE_HUNDRED_THOUSAND\u003e entry level hires said kapil joshi deputy ceo at quess it staffing this is in contrast to the approximately \u003cSIX_TEN_THOUSAND\u003e net hires recorded by the \u003cTWO_HUNDRED\u003e billion technology services industry in fy24","timestamp":"2024-10-01T06:00:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}