{"url":"https://economictimes.indiatimes.com/tech/technology/are-digital-tools-a-way-for-companies-to-retain-hourly-workers/articleshow/113820618.cms","title":"Are digital tools a way for companies to retain hourly workers?","description":"WorkJam, an online platform that was founded in 2014, provides clients such as Target, Ulta Beauty and Hilton with digital tools their non-salaried employees can use to swap shifts, complete trainings and get early access to wages.","content":"The Covid-19 pandemic and the resetting of the economy that followed it made hourly workers more aware of their value. Some experts think employers should expect to field demands for flexible hours and other workplace incentives even as the labor market weakens. WorkJam, an online platform that was founded in 2014, has tried to be at the forefront of this shift. It provides clients such as Target, Ulta Beauty and Hilton with digital tools their non-salaried employees can use to swap shifts, complete trainings and get early access to wages.Cofounder and CEO Steve Kramer recently spoke with The Associated Press about how companies can better retain hourly workers. The interview has been edited for length and clarity. Q. What was the environment like for hourly workers when you started the company? A. When we started the company in 2014, we set out to solve two issues to help with the socioeconomic issues that existed at the time. And they were large socioeconomic issues. In fact, President Obama, in his State of the Union speech in 2014, had hourly workers on stage with him because there was a lot of scheduling practices that were happening at the time that were creating unpredictability. So Obama actually put in a lot of new compliance rules to protect the hourly worker and to create more predictability in their schedules and their paychecks.","cleaned_content":"the covid \u003cONE_TEN\u003e pandemic and the resetting of the economy that followed it made hourly workers more aware of their value some experts think employers should expect to field demands for flexible hours and other workplace incentives even as the labor market weakens workjam an online platform that was founded in \u003cTWO_THOUSAND\u003e has tried to be at the forefront of this shift it provides clients such as target ulta beauty and hilton with digital tools their non salaried employees can use to swap shifts complete trainings and get early access to wages cofounder and ceo steve kramer recently spoke with the associated press about how companies can better retain hourly workers the interview has been edited for length and clarity q what was the environment like for hourly workers when you started the company a when we started the company in \u003cTWO_THOUSAND\u003e we set out to solve two issues to help with the socioeconomic issues that existed at the time and they were large socioeconomic issues in fact president obama in his state of the union speech in \u003cTWO_THOUSAND\u003e had hourly workers on stage with him because there was a lot of scheduling practices that were happening at the time that were creating unpredictability so obama actually put in a lot of new compliance rules to protect the hourly worker and to create more predictability in their schedules and their paychecks","timestamp":"2024-09-30T18:44:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}