{"url":"https://economictimes.indiatimes.com/tech/information-tech/indian-it-companies-may-earn-more-from-third-party-items-sale/articleshow/113882910.cms","title":"Indian IT companies may earn more from third party items sale","description":"India's top IT firms TCS, Infosys, and Birlasoft are likely to report a surge in pass-through revenue, driven by strategic partnerships with third-party sellers, when they announce quarterly earnings next week.","content":"IT firms in India are increasingly partnering with third-party sellers to boost their revenue. While most of them have a pass-through revenue component, analysts expect top companies like TCS, Infosys and Birlasoft to announce higher pass-through revenue in the quarterly earnings season that begins next week.Pass-through revenue is the revenue generated from third-party services and products, which are directly passed on to clients without any markup.For Infosys, Kotak institutional equities’ analysts said they expect marginally higher revenue in the second quarter from sale of third-party software. Their note said investors may focus on five items, of which one will be revenue from sale of third-party items.","cleaned_content":"it firms in india are increasingly partnering with third party sellers to boost their revenue while most of them have a pass through revenue component analysts expect top companies like tcs infosys and birlasoft to announce higher pass through revenue in the quarterly earnings season that begins next week pass through revenue is the revenue generated from third party services and products which are directly passed on to clients without any markup for infosys kotak institutional equities analysts said they expect marginally higher revenue in the second quarter from sale of third party software their note said investors may focus on five items of which one will be revenue from sale of third party items","timestamp":"2024-10-03T06:01:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}