{"url":"https://economictimes.indiatimes.com/tech/technology/brazil-supreme-court-allows-x-to-resume-services/articleshow/114084795.cms","title":"Brazil Supreme Court allows X to resume services","description":"Brazil's Supreme Court lifted the ban on the microblogging platform 'X' after the company complied with court orders to block certain accounts, pay fines, and appoint a local representative. The ban had been imposed due to non-compliance with court decisions regarding free speech, far-right accounts, and misinformation.","content":"Brazil's Supreme Court on Tuesday allowed microblogging platform ‘X’ to resume services in the country, securing back its estimated user base ranging from 20 to 40 million.Elon Musk’s ‘X’ was banned in Brazil on August 30 by the apex court due to non-compliance of the court orders. Brazilian Supreme Court Justice Alexandre de Moraes ordered the platform to continue its services, overcoming the month-long dispute over free speech, far-right accounts and misinformation.“The resumption of X’s activities on national territory was conditioned, solely, on full compliance with Brazilian laws and absolute observance of the judiciary’s decisions, out of respect for national sovereignty,” de Moraes said in the court document.The court ordered on Tuesday (October 8) ruling, the country’s telecommunications regulator, Anatel, to restore X’s online services within 24 hours. ","cleaned_content":"brazils supreme court on tuesday allowed microblogging platform x to resume services in the country securing back its estimated user base ranging from \u003cTWO_TEN\u003e to \u003cFOUR_TEN\u003e million elon musk s x was banned in brazil on august \u003cTHREE_TEN\u003e by the apex court due to non compliance of the court orders brazilian supreme court justice alexandre de moraes ordered the platform to continue its services overcoming the month long dispute over free speech far right accounts and misinformation the resumption of x s activities on national territory was conditioned solely on full compliance with brazilian laws and absolute observance of the judiciary s decisions out of respect for national sovereignty de moraes said in the court document the court ordered on tuesday october \u003cEIGHT_\u003e ruling the country s telecommunications regulator anatel to restore x s online services within \u003cTWO_TEN\u003e hours","timestamp":"2024-10-09T18:33:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}