{"url":"https://economictimes.indiatimes.com/tech/technology/criminal-networks-in-southeast-asia-flourish-in-telegrams-underground-markets-un/articleshow/114006670.cms","title":"Criminal networks in Southeast Asia flourish in Telegram's 'underground markets': UN","description":"Criminal networks in Southeast Asia are using Telegram for large-scale illicit activities, says a UN report. The app allows trading of hacked data and tools for cybercrime. Telegram's boss was charged in France for this. The report highlights how criminals have innovated with new technologies, including malware and deepfake software.","content":"Powerful criminal networks in Southeast Asia extensively use the messaging app Telegram which has enabled a fundamental change in the way organised crime can conduct large-scale illicit activity, the United Nations said in a report on Monday. The report represents the latest allegations to be levied against the controversial encrypted app since France, using a tough new law with no international equivalent, charged its boss Pavel Durov for allowing criminal activity on the platform. Hacked data including credit card details, passwords and browser history are openly traded on a vast scale on the app which has sprawling channels with little moderation, the report by the United Nations Office for Drugs and Crime (UNODC) said. Tools used for cybercrime, including so-called deepfake software designed for fraud, and data-stealing malware are also widely sold, while unlicensed cryptocurrency exchanges offer money laundering services, according to the report. \"We move 3 million USDT stolen from overseas per day,\" the report quoted one ad as saying in Chinese.","cleaned_content":"powerful criminal networks in southeast asia extensively use the messaging app telegram which has enabled a fundamental change in the way organised crime can conduct large scale illicit activity the united nations said in a report on monday the report represents the latest allegations to be levied against the controversial encrypted app since france using a tough new law with no international equivalent charged its boss pavel durov for allowing criminal activity on the platform hacked data including credit card details passwords and browser history are openly traded on a vast scale on the app which has sprawling channels with little moderation the report by the united nations office for drugs and crime unodc said tools used for cybercrime including so called deepfake software designed for fraud and data stealing malware are also widely sold while unlicensed cryptocurrency exchanges offer money laundering services according to the report we move \u003cTHREE_\u003e million usdt stolen from overseas per day the report quoted one ad as saying in chinese","timestamp":"2024-10-07T13:13:00+05:30","market_timestamp":"2024-10-07T13:13:00+05:30","off_market_hours":false}