{"url":"https://economictimes.indiatimes.com/tech/technology/meesho-claims-40-increase-in-total-orders-during-annual-festival-sales/articleshow/114018160.cms","title":"Meesho claims 40% increase in total orders during annual festival sales","description":"Meesho said that prepaid orders surged by 117% on its platform reflecting a significant shift in customer preferences towards digital payment options in tier-II and beyond.","content":"SoftBank-backed ecommerce firm Meesho on Monday said that it has recorded a 40% growth year-on-year in total orders during the latest annual festival sales. The ecommerce firm claims to have recorded 145 crore customer visits during the 10 days long 'Meesho Mega Blockbuster Sale 2024'.  \"During our Mega Blockbuster Sale this year, we achieved over 40% growth in orders, surpassing industry expectations. With around 3 crore app downloads and a 45% increase in new-to-ecommerce users, we are reinforcing our commitment to making ecommerce accessible and affordable for millions across the country,\" Milan Partani, general manager, user growth at Meesho said.  Meesho's flagship sale held from September 27 to October 6, 2024.  \"The company witnessed an impressive increase in demand this year, with total orders rising over 40% compared to last year,\" the statement said.  The company said that it observed around 45% of the total customer visits from tier-IV cities. ","cleaned_content":"softbank backed ecommerce firm meesho on monday said that it has recorded a \u003cFOUR_TEN_PERCENT\u003e growth year on year in total orders during the latest annual festival sales the ecommerce firm claims to have recorded \u003cONE_HUNDRED\u003e crore customer visits during the \u003cONE_TEN\u003e days long meesho mega blockbuster sale \u003cTWO_THOUSAND\u003e during our mega blockbuster sale this year we achieved over \u003cFOUR_TEN_PERCENT\u003e growth in orders surpassing industry expectations with around \u003cTHREE_\u003e crore app downloads and a \u003cFOUR_TEN_PERCENT\u003e increase in new to ecommerce users we are reinforcing our commitment to making ecommerce accessible and affordable for millions across the country milan partani general manager user growth at meesho said meeshos flagship sale held from september \u003cTWO_TEN\u003e to october \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e the company witnessed an impressive increase in demand this year with total orders rising over \u003cFOUR_TEN_PERCENT\u003e compared to last year the statement said the company said that it observed around \u003cFOUR_TEN_PERCENT\u003e of the total customer visits from tier iv cities","timestamp":"2024-10-07T19:49:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}