{"url":"https://economictimes.indiatimes.com/tech/technology/turkey-blocks-instant-messaging-platform-discord/articleshow/114073144.cms","title":"Turkey blocks instant messaging platform Discord","description":"Turkish Justice Minister Yilmaz Tunc said a court in the capital Ankara decided to remove access from Turkey to San Francisco-based Discord due to sufficient suspicion that the crimes of \"child sexual abuse and obscenity\" have been committed.","content":"Turkey has blocked access to instant messaging platform Discord following a court decision, the country's infotech regulator said on Wednesday. Turkey's Information Technologies and Communication Authority (BTK) published the access ban decision on its website. Turkish Justice Minister Yilmaz Tunc said a court in the capital Ankara decided to remove access from Turkey to San Francisco-based Discord due to sufficient suspicion that the crimes of \"child sexual abuse and obscenity\" have been committed. \"We are determined to protect our youth and children, from the harmful publications of social media and the internet that constitute crimes. We will never allow attempts to shake the foundations of our social structure,\" Tunc also said in a post on X. The access ban decision comes after public outrage caused by the murder of two women, perpetrated by a 19-year-old man earlier this month.","cleaned_content":"turkey has blocked access to instant messaging platform discord following a court decision the countrys infotech regulator said on wednesday turkeys information technologies and communication authority btk published the access ban decision on its website turkish justice minister yilmaz tunc said a court in the capital ankara decided to remove access from turkey to san francisco based discord due to sufficient suspicion that the crimes of child sexual abuse and obscenity have been committed we are determined to protect our youth and children from the harmful publications of social media and the internet that constitute crimes we will never allow attempts to shake the foundations of our social structure tunc also said in a post on x the access ban decision comes after public outrage caused by the murder of two women perpetrated by a \u003cONE_TEN\u003e year old man earlier this month","timestamp":"2024-10-09T13:45:00+05:30","market_timestamp":"2024-10-09T13:45:00+05:30","off_market_hours":false}