{"url":"https://economictimes.indiatimes.com/tech/technology/zomato-independent-director-gunjan-soni-steps-down-from-board/articleshow/114162088.cms","title":"Zomato independent director Gunjan Soni steps down from board","description":"Gunjan Soni, currently the chief executive of Southeast Asia focused fashion retailer Zalora Group, has formerly been a senior executive at Myntra, Jabong, Star India and McKinsey. She was appointed to Zomato's board prior to the company's July 2021 initial public offering.","content":"Gunjan Soni, an independent director serving on the board of Zomato, has resigned from her position effective Friday, citing “increased professional commitments”, the Gurgaon-based food delivery company said in an exchange filing.“This is to inform the board that due to my increased work commitments, I hereby tender my resignation as an independent director of the company with effect from close of business hours on October 11, 2024,” Soni wrote in her resignation email.“Consequently, I will also be stepping down as a member of the risk management committee and corporate social responsibility committee of the company. I have had a great partnership with the Zomato team and the other board members over the past three years. The need to step down stems from increased professional commitments and was a tough decision. I am grateful for the opportunity to have served on the board and am confident in Zomato’s management team and the company’s future direction,” she added.Soni, currently the chief executive of Southeast Asia-focused fashion retailer Zalora Group, has formerly been a senior executive at Myntra, Jabong, Star India and McKinsey. She was appointed to Zomato's board prior to the company’s July 2021 initial public offering.In the exchange filing, Zomato's founder and chief executive Deepinder Goyal said, “It was great to partner with Gunjan and a big thanks to her for helping us navigate through the ups and downs of the past few years. On behalf of Zomato, I want to thank Gunjan for her valuable insights and guidance that have been instrumental in our growth. While I will miss her on our board, we understand her constraints and wish her continued success.”","cleaned_content":"gunjan soni an independent director serving on the board of zomato has resigned from her position effective friday citing increased professional commitments the gurgaon based food delivery company said in an exchange filing this is to inform the board that due to my increased work commitments i hereby tender my resignation as an independent director of the company with effect from close of business hours on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e soni wrote in her resignation email consequently i will also be stepping down as a member of the risk management committee and corporate social responsibility committee of the company i have had a great partnership with the zomato team and the other board members over the past three years the need to step down stems from increased professional commitments and was a tough decision i am grateful for the opportunity to have served on the board and am confident in zomato s management team and the company s future direction she added soni currently the chief executive of southeast asia focused fashion retailer zalora group has formerly been a senior executive at myntra jabong star india and mckinsey she was appointed to zomatos board prior to the company s july \u003cTWO_THOUSAND\u003e initial public offering in the exchange filing zomatos founder and chief executive deepinder goyal said it was great to partner with gunjan and a big thanks to her for helping us navigate through the ups and downs of the past few years on behalf of zomato i want to thank gunjan for her valuable insights and guidance that have been instrumental in our growth while i will miss her on our board we understand her constraints and wish her continued success","timestamp":"2024-10-12T16:51:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}