{"url":"https://economictimes.indiatimes.com/tech/information-tech/accentures-consulting-biz-uptick-shows-sector-is-key-for-it-recovery/articleshow/114094139.cms","title":"Accenture’s consulting biz uptick shows sector is key for IT recovery","description":"Consulting enables technology services companies to build broader businesses and be a key growth driver in a sustainable manner, experts said. While outsourcing only aids participation in deals, consulting helps shape deals and stay ahead of the curve, especially with the GenAI adoption.","content":"A rebound in the consulting business of Accenture signals a plausible recovery in discretionary spends by international clients of major Indian IT services companies. But it also exposes a lacuna that makes Indian firms grow slower than those with robust consulting divisions.Consulting enables technology services companies to build broader businesses and be a key growth driver in a sustainable manner, experts said. While outsourcing only aids participation in deals, consulting helps shape deals and stay ahead of the curve, especially with the GenAI adoption, they said.Consulting is important to build growth during a structural shift in the $250-billion software services space, analysts added.“Increase in consulting revenue is a lead indicator of green shoots in discretionary spending or the ability to shape deals in newer areas such as cyber security, interactive, and IoT (internet of things), among others,” said Ramkumar Ramamoorthy, partner at growth advisory firm Catalincs. “It is important to note that Accenture is gaining an outsized share in these newer areas as reflected in its revenues of $19 billion from Accenture Song, $9 billion from Security, and $8 billion from Industry X.”Accenture reported a growth in its “consulting type of work for the first time in six quarters” for its fourth quarter ended August. It witnessed a strong rebound in consulting with a 3% year-on-year (YoY) growth in constant currency terms and 0.8% growth sequentially after five quarters of decline.","cleaned_content":"a rebound in the consulting business of accenture signals a plausible recovery in discretionary spends by international clients of major indian it services companies but it also exposes a lacuna that makes indian firms grow slower than those with robust consulting divisions consulting enables technology services companies to build broader businesses and be a key growth driver in a sustainable manner experts said while outsourcing only aids participation in deals consulting helps shape deals and stay ahead of the curve especially with the genai adoption they said consulting is important to build growth during a structural shift in the \u003cTWO_HUNDRED\u003e billion software services space analysts added increase in consulting revenue is a lead indicator of green shoots in discretionary spending or the ability to shape deals in newer areas such as cyber security interactive and iot internet of things among others said ramkumar ramamoorthy partner at growth advisory firm catalincs it is important to note that accenture is gaining an outsized share in these newer areas as reflected in its revenues of \u003cONE_TEN\u003e billion from accenture song \u003cNINE_\u003e billion from security and \u003cEIGHT_\u003e billion from industry x accenture reported a growth in its consulting type of work for the first time in six quarters for its fourth quarter ended august it witnessed a strong rebound in consulting with a \u003cTHREE_PERCENT\u003e year on year yoy growth in constant currency terms and \u003cZERO_PERCENT\u003e growth sequentially after five quarters of decline","timestamp":"2024-10-10T06:01:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}