{"url":"https://economictimes.indiatimes.com/tech/technology/brazils-top-court-says-x-paid-pending-fines-to-wrong-bank/articleshow/113954769.cms","title":"Brazil's top court says X paid pending fines to wrong bank","description":"Brazil's Supreme Court postponed its decision to allow social media platform X, owned by Elon Musk, to resume services in the country, as the company did not transfer pending fines to the correct bank. X has been suspended since August for failing to comply with court orders related to hate speech moderation and proper legal representation.","content":"Brazil's Supreme Court said on Friday that lawyers representing social media platform X did not pay pending fines to the proper bank, postponing its decision on whether to allow the tech firm to resume services in Brazil. The payment of the fines, which X lawyers argued that the company had paid correctly, is the only outstanding measure demanded by the court in order to authorize X to operate again in Brazil. X has been suspended since late August in Brazil, one of its largest and most coveted markets, after not complying with court orders related to hate speech moderation and failing to name a legal representative in the country, as required by law. Earlier on Friday, X, owned by billionaire Elon Musk, filed a fresh request to have its services restored in Brazil, saying it had paid all pending fines. In response to the request, Supreme Court Justice Alexandre de Moraes requested the payment to be transferred to the right bank.","cleaned_content":"brazils supreme court said on friday that lawyers representing social media platform x did not pay pending fines to the proper bank postponing its decision on whether to allow the tech firm to resume services in brazil the payment of the fines which x lawyers argued that the company had paid correctly is the only outstanding measure demanded by the court in order to authorize x to operate again in brazil x has been suspended since late august in brazil one of its largest and most coveted markets after not complying with court orders related to hate speech moderation and failing to name a legal representative in the country as required by law earlier on friday x owned by billionaire elon musk filed a fresh request to have its services restored in brazil saying it had paid all pending fines in response to the request supreme court justice alexandre de moraes requested the payment to be transferred to the right bank","timestamp":"2024-10-05T08:50:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}