{"url":"https://economictimes.indiatimes.com/tech/technology/samsung-signs-moa-with-some-workers-at-chennai-facility-agrees-to-a-slew-of-demands/articleshow/114022300.cms","title":"Samsung signs MoA with some workers at Chennai facility; agrees to a slew of demands","description":"The company has also agreed to expanding the operation of air conditioned buses by next year from only five routes currently to all 108 routes.","content":"Samsung India on Monday signed a Memorandum of Agreement (MoA) with a section of workers agreeing to a slew of demands stating that both parties will collaborate to \"mitigate the difficulties faced by workmen\" by resolving the ongoing strike which commenced on September 9, 2024. The company said it will prioritise the implementation of several measures to improve the working environment for the welfare of its workmen, and continuously consult with a workmen committee to implement measures to enhance the competitiveness of wages as well as provide an interim special incentive called the Productivity Stabilisation Incentive equivalent to Rs 5,000 per month, effective from October 2024 upto March 2025. Samsung said the modalities of the payment will be finalised in consultation with the workmen committee.\"This special incentive shall be considered with the annual increment in wages for the year 2025-26, that will be finalised in consultation with workmen committee during the wage negotiations,\" the company said in the MoA, signed by Samsung India Electronics Managing Director Yoon Sung-hyun, which has been reviewed by ET. The company has also agreed to expanding the operation of air conditioned buses by next year from only five routes currently to all 108 routes. It has also said it will increase the number of workmen family invitation events in a year for four to six times a year and will also present a gift worth Rs 2,000 to each family that participates at an event.\"In the unfortunate event of the death of an employee while in service, the Company shall provide an additional immediate assistance of Rs 1 lakh to the family to take care of their immediate needs,\" Samsung added.","cleaned_content":"samsung india on monday signed a memorandum of agreement moa with a section of workers agreeing to a slew of demands stating that both parties will collaborate to mitigate the difficulties faced by workmen by resolving the ongoing strike which commenced on september \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e the company said it will prioritise the implementation of several measures to improve the working environment for the welfare of its workmen and continuously consult with a workmen committee to implement measures to enhance the competitiveness of wages as well as provide an interim special incentive called the productivity stabilisation incentive equivalent to rs \u003cFIVE_THOUSAND\u003e per month effective from october \u003cTWO_THOUSAND\u003e upto march \u003cTWO_THOUSAND\u003e samsung said the modalities of the payment will be finalised in consultation with the workmen committee this special incentive shall be considered with the annual increment in wages for the year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e that will be finalised in consultation with workmen committee during the wage negotiations the company said in the moa signed by samsung india electronics managing director yoon sung hyun which has been reviewed by et the company has also agreed to expanding the operation of air conditioned buses by next year from only five routes currently to all \u003cONE_HUNDRED\u003e routes it has also said it will increase the number of workmen family invitation events in a year for four to six times a year and will also present a gift worth rs \u003cTWO_THOUSAND\u003e to each family that participates at an event in the unfortunate event of the death of an employee while in service the company shall provide an additional immediate assistance of rs \u003cONE_\u003e lakh to the family to take care of their immediate needs samsung added","timestamp":"2024-10-08T00:27:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}