{"url":"https://economictimes.indiatimes.com/tech/technology/crypto-com-sues-us-sec-after-receiving-legal-threat-from-regulator/articleshow/114064585.cms","title":"Crypto.com sues US SEC after receiving legal threat from regulator","description":"A cryptocurrency trading platform has filed a lawsuit against the SEC for allegedly overstepping its jurisdiction by regulating the crypto industry. The suit claims that the SEC unlawfully expanded its reach, declaring nearly all crypto assets as securities. The case also names SEC Chair Gary Gensler and other commissioners.","content":"Crypto.com filed a lawsuit against the U.S. Securities and Exchange Commission on Tuesday, alleging that the federal agency is overstepping its jurisdiction by regulating the cryptocurrency industry. The crypto trading platform said its move follows the receipt of a \"Wells notice\" from the top U.S. markets regulator on the grounds that tokens traded on its platform qualified as securities. A Wells notice is a formal declaration that the regulator's staff intend to recommend an enforcement action. The SEC declined to comment. Crypto companies have long accused the SEC of overreach and of violating its jurisdiction, while the agency has claimed that the industry is flouting securities laws intended to protect investors and other market participants. \"Our lawsuit contends that the SEC has unilaterally expanded its jurisdiction beyond statutory limits and separately that the SEC has established an unlawful rule that trades in nearly all crypto assets are securities transactions,\" Crypto.com said.","cleaned_content":"crypto com filed a lawsuit against the u s securities and exchange commission on tuesday alleging that the federal agency is overstepping its jurisdiction by regulating the cryptocurrency industry the crypto trading platform said its move follows the receipt of a wells notice from the top u s markets regulator on the grounds that tokens traded on its platform qualified as securities a wells notice is a formal declaration that the regulators staff intend to recommend an enforcement action the sec declined to comment crypto companies have long accused the sec of overreach and of violating its jurisdiction while the agency has claimed that the industry is flouting securities laws intended to protect investors and other market participants our lawsuit contends that the sec has unilaterally expanded its jurisdiction beyond statutory limits and separately that the sec has established an unlawful rule that trades in nearly all crypto assets are securities transactions crypto com said","timestamp":"2024-10-09T10:11:00+05:30","market_timestamp":"2024-10-09T10:11:00+05:30","off_market_hours":false}