{"url":"https://economictimes.indiatimes.com/tech/technology/jio-financial-services-rolls-out-upgraded-jiofinance-app-with-new-offerings/articleshow/114143504.cms","title":"Jio Financial Services rolls out upgraded JioFinance app with new offerings","description":"Jio Financial Services (JFS) promoted by Reliance Industries chairman Mukesh Ambani, had rolled out the beta version of the app on May 30. The upgraded app also provides 24 digital insurance plans, including life, health, two-wheeler and motor insurance. It is now available on the Google Play Store, Apple App Store and MyJio app.","content":"Jio Financial Services (JFS) said on Friday it has launched an upgraded version of its JioFinance mobile application, introducing new products and services such as loans on mutual funds, home loans and loans against property.JFS, promoted by Reliance Industries chairman Mukesh Ambani, had rolled out the beta version of the app on May 30. In an exchange filing, the company said more than 6 million users have been onboarded since then.The upgraded app also provides 24 digital insurance plans, including life, health, two-wheeler and motor insurance. It is now available on the Google Play Store, Apple App Store and MyJio app.On the savings front, the app has Jio Payments Bank offering digital savings accounts with biometric authentication and a physical debit card.According to JFS, Jio Payments Bank has more than 1.5 million users who manage their routine, recurring expenses through these accounts.","cleaned_content":"jio financial services jfs said on friday it has launched an upgraded version of its jiofinance mobile application introducing new products and services such as loans on mutual funds home loans and loans against property jfs promoted by reliance industries chairman mukesh ambani had rolled out the beta version of the app on may \u003cTHREE_TEN\u003e in an exchange filing the company said more than \u003cSIX_\u003e million users have been onboarded since then the upgraded app also provides \u003cTWO_TEN\u003e digital insurance plans including life health two wheeler and motor insurance it is now available on the google play store apple app store and myjio app on the savings front the app has jio payments bank offering digital savings accounts with biometric authentication and a physical debit card according to jfs jio payments bank has more than \u003cONE_\u003e million users who manage their routine recurring expenses through these accounts","timestamp":"2024-10-12T07:13:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}