{"url":"https://economictimes.indiatimes.com/tech/technology/et-startup-award-2024-stepping-up-the-startups-game-in-the-valley-of-sneakers/articleshow/113988441.cms","title":"ET Startup Award 2024 | Stepping up the startups game: in the valley of sneakers","description":"If sneakers belong to the Valley bro fashion code, then it was the standout star of The Economic Times Startup Awards 2024. Taking inspiration from the land where jeans, t-shirts and hoodies reign supreme, many founders turned up clad in the ultimate hipster status symbol.","content":"Sporting a T-shirt, denims and US Polo Assn. sneakers, Zepto co-founder Aadit Palicha joked on stage that he may have been the “only person” who took the ‘Silicon Valley’ dress code seriously.But if sneakers belong to the Valley bro fashion code, then it was the standout star of The Economic Times Startup Awards 2024. Taking inspiration from the land where jeans, t-shirts and hoodies reign supreme, many founders turned up clad in the ultimate hipster status symbol. It was a sea of sneakers – Onitsuka Tigers were the top choice, followed by the Roger Federer co-created On brand and a smattering of Nike Jordans and cleats.Power kicksThe sneaker might seem like a fashion afterthought, yet pick the right pair and it conveys power and nonchalance, belonging to everyman and yet an exclusive club.Lenskart’s Peyush Bansal sported a chic pair of the Singaporean brand Pedro, while Sushant Goel, co-founder of Third Wave Coffee, flaunted his Nike Jordans.","cleaned_content":"sporting a t shirt denims and us polo assn sneakers zepto co founder aadit palicha joked on stage that he may have been the only person who took the silicon valley dress code seriously but if sneakers belong to the valley bro fashion code then it was the standout star of the economic times startup awards \u003cTWO_THOUSAND\u003e taking inspiration from the land where jeans t shirts and hoodies reign supreme many founders turned up clad in the ultimate hipster status symbol it was a sea of sneakers onitsuka tigers were the top choice followed by the roger federer co created on brand and a smattering of nike jordans and cleats power kicksthe sneaker might seem like a fashion afterthought yet pick the right pair and it conveys power and nonchalance belonging to everyman and yet an exclusive club lenskart s peyush bansal sported a chic pair of the singaporean brand pedro while sushant goel co founder of third wave coffee flaunted his nike jordans","timestamp":"2024-10-07T06:00:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}