{"url":"https://economictimes.indiatimes.com/tech/technology/googles-triumph-on-the-nobel-stage-resolves-a-50-year-old-mystery/articleshow/114193455.cms","title":"Google’s triumph on the Nobel stage resolves a 50-year-old mystery","description":"AlphaFold 2, an AI model developed through Google’s DeepMind initiative, cracked the code for predicting complex protein structures from amino acid sequences. It resulted in the accurate prediction of nearly 200 million known proteins. AlphaFold has been used by over two million researchers globally, in areas such as antibiotic resistance and creating enzymes capable of breaking down plastics.","content":"Google DeepMind’s co-founder and chief executive Demis Hassabis, along with John Jumper, a researcher at DeepMind have been awarded the Nobel Prize in Chemistry for their breakthrough in protein structure prediction using artificial intelligence (AI). The duo was accompanied by the American biochemist David Baker.DeepMind’s AI tool, AlphaFold has cracked the code for predicting complex protein structures from amino acid sequences, resolving a five-decade scientific enigma.The 2024 Nobel Prize for chemistry was announced on Wednesday 9 October 2024 by the Royal Swedish Academy of Sciences.Background David Baker is the director of the Institute for Protein Design at the University of Washington School of Medicine. Baker’s research group develops innovative protein design software to tackle challenges in medicine, technology, and sustainability. The experiments make use of machine learning (ML) methods to generate functional proteins.","cleaned_content":"google deepmind s co founder and chief executive demis hassabis along with john jumper a researcher at deepmind have been awarded the nobel prize in chemistry for their breakthrough in protein structure prediction using artificial intelligence ai the duo was accompanied by the american biochemist david baker deepmind s ai tool alphafold has cracked the code for predicting complex protein structures from amino acid sequences resolving a five decade scientific enigma the \u003cTWO_THOUSAND\u003e nobel prize for chemistry was announced on wednesday \u003cNINE_\u003e october \u003cTWO_THOUSAND\u003e by the royal swedish academy of sciences background david baker is the director of the institute for protein design at the university of washington school of medicine baker s research group develops innovative protein design software to tackle challenges in medicine technology and sustainability the experiments make use of machine learning ml methods to generate functional proteins","timestamp":"2024-10-13T20:51:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}