{"url":"https://economictimes.indiatimes.com/tech/information-tech/atos-still-aiming-for-deal-with-french-state-on-strategic-assets-as-initial-offer-expires/articleshow/114006202.cms","title":"Atos still aiming for deal with French state on strategic assets as initial offer expires","description":"Atos, which is undergoing restructuring proceedings after it reached a deal with its main creditors earlier this year, secures communications for the French military and secret services and manufactures servers to make supercomputers.","content":"Cash-strapped IT firm Atos said on Monday it was still aiming to reach a deal with the French state on the sale of its most strategic activities such as cybersecurity and super-computing after the government's initial offer had expired. Why it is important  Atos, which is undergoing restructuring proceedings after it reached a deal with its main creditors earlier this year, secures communications for the French military and secret services and manufactures servers to make supercomputers. Key quotes  \"Atos has offered to continue discussions and has indicated that it has submitted a new proposal to the French State that is compatible with the financial restructuring plan,\" the company said. adding: \"The expiry of the offer has no impact on the ongoing financial restructuring\".","cleaned_content":"cash strapped it firm atos said on monday it was still aiming to reach a deal with the french state on the sale of its most strategic activities such as cybersecurity and super computing after the governments initial offer had expired why it is important atos which is undergoing restructuring proceedings after it reached a deal with its main creditors earlier this year secures communications for the french military and secret services and manufactures servers to make supercomputers key quotes atos has offered to continue discussions and has indicated that it has submitted a new proposal to the french state that is compatible with the financial restructuring plan the company said adding the expiry of the offer has no impact on the ongoing financial restructuring","timestamp":"2024-10-07T13:01:00+05:30","market_timestamp":"2024-10-07T13:01:00+05:30","off_market_hours":false}