{"url":"https://economictimes.indiatimes.com/tech/technology/collapse-of-national-security-elites-cyber-firm-leaves-bitter-wake/articleshow/113926464.cms","title":"Collapse of national security elites' cyber firm leaves bitter wake","description":"IronNet's rise and fall also raises questions about the judgment of its well-credentialed leaders, a who's who of the national security establishment. National security experts, former employees and analysts told The Associated Press that the firm collapsed, in part, because it engaged in questionable business practices, produced subpar products and services, and entered into associations that could have left the firm vulnerable to meddling by the Kremlin.","content":"Washington, Oct 4 (AP) The future was once dazzling for IronNet. Founded by a former director of the National Security Agency and stacked with elite members of the U.S. intelligence establishment, IronNet promised it was going to revolutionize the way governments and corporations combat cyberattacks. Its pitch - combining the prowess of ex-government hackers with cutting-edge software - was initially a hit. Shortly after going public in 2021, the company's value shot past $3 billion. Yet, as blazing as IronNet started, it burned out. Last September the never-profitable company announced it was shutting down and firing its employees after running out of money, providing yet another example of a tech firm that faltered after failing to deliver on overhyped promises. The firm's crash has left behind a trail of bitter investors and former employees who remain angry at the company and believe it misled them about its financial health. ","cleaned_content":"washington oct \u003cFOUR_\u003e ap the future was once dazzling for ironnet founded by a former director of the national security agency and stacked with elite members of the u s intelligence establishment ironnet promised it was going to revolutionize the way governments and corporations combat cyberattacks its pitch combining the prowess of ex government hackers with cutting edge software was initially a hit shortly after going public in \u003cTWO_THOUSAND\u003e the companys value shot past \u003cTHREE_\u003e billion yet as blazing as ironnet started it burned out last september the never profitable company announced it was shutting down and firing its employees after running out of money providing yet another example of a tech firm that faltered after failing to deliver on overhyped promises the firms crash has left behind a trail of bitter investors and former employees who remain angry at the company and believe it misled them about its financial health","timestamp":"2024-10-04T10:15:00+05:30","market_timestamp":"2024-10-04T10:15:00+05:30","off_market_hours":false}