{"url":"https://economictimes.indiatimes.com/tech/technology/tech-helps-singapore-economy-top-forecasts-in-third-quarter/articleshow/114202059.cms","title":"Tech helps Singapore economy top forecasts in third quarter","description":"Singapore's economy grew more than expected in the third quarter as a rush for all things linked to artificial intelligence drove up demand for computer chips, according to preliminary data Monday. Manufacturing, which includes computer chips, expanded 7.5 percent year-on-year, bouncing back from a 1.1 percent decline in the previous three months.","content":"Singapore's economy grew more than expected in the third quarter as a rush for all things linked to artificial intelligence drove up demand for computer chips, according to preliminary data Monday.The Asian city-state's economic performance is often seen as a barometer of the global environment because of its heavy reliance on international trade.The trade ministry said a healthy rebound in the key manufacturing sector powered the 4.1 percent year-on-year growth in the three months to September.Economists had projected growth of less than 4.0 percent.Manufacturing, which includes computer chips, expanded 7.5 percent year-on-year, bouncing back from a 1.1 percent decline in the previous three months.","cleaned_content":"singapores economy grew more than expected in the third quarter as a rush for all things linked to artificial intelligence drove up demand for computer chips according to preliminary data monday the asian city states economic performance is often seen as a barometer of the global environment because of its heavy reliance on international trade the trade ministry said a healthy rebound in the key manufacturing sector powered the \u003cFOUR_PERCENT\u003e year on year growth in the three months to september economists had projected growth of less than \u003cFOUR_PERCENT\u003e manufacturing which includes computer chips expanded \u003cSEVEN_PERCENT\u003e year on year bouncing back from a \u003cONE_PERCENT\u003e decline in the previous three months","timestamp":"2024-10-14T09:04:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}