{"url":"https://economictimes.indiatimes.com/tech/technology/will-teslas-robotaxi-reveal-live-up-to-hype/articleshow/114029329.cms","title":"Will Tesla's robotaxi reveal live up to hype?","description":"After years of talking up Tesla's prowess on autonomous driving, Elon Musk is set to host Thursday a much-hyped robotaxi event amid a mix of anticipation and skepticism. \"We believe widescale Tesla robotaxi deployment is unlikely within the coming years,\" said a note from UBS last month.","content":"After years of talking up Tesla's prowess on autonomous driving, Elon Musk is set to host Thursday a much-hyped robotaxi event amid a mix of anticipation and skepticism.The Tesla CEO has so far offered few details about exactly what will be unveiled at Thursday's event, dubbed \"We, Robot,\" which will take place at Warner Brothers studio in Los Angeles.Tesla watchers expect the company to reveal a prototype of its robotaxi, intended for autonomous transport. Other companies, such as Google's Waymo and General Motors Cruise, have operated heavily regulated pilot programs for a few years already.Musk, who has become a vocal supporter of Republican presidential candidate Donald Trump, has insisted Tesla's offering will be the best autonomous vehicle on the market even if it's not the first. ","cleaned_content":"after years of talking up teslas prowess on autonomous driving elon musk is set to host thursday a much hyped robotaxi event amid a mix of anticipation and skepticism the tesla ceo has so far offered few details about exactly what will be unveiled at thursdays event dubbed we robot which will take place at warner brothers studio in los angeles tesla watchers expect the company to reveal a prototype of its robotaxi intended for autonomous transport other companies such as googles waymo and general motors cruise have operated heavily regulated pilot programs for a few years already musk who has become a vocal supporter of republican presidential candidate donald trump has insisted teslas offering will be the best autonomous vehicle on the market even if its not the first","timestamp":"2024-10-08T08:03:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}