{"url":"https://economictimes.indiatimes.com/tech/technology/european-investment-bank-to-boost-funding-for-eu-tech-startups/articleshow/114035564.cms","title":"European Investment Bank to boost funding for EU tech startups","description":"The European Investment Bank proposed plans to fill funding gaps and retain innovative start-ups in Europe by supporting the EU venture capital and private equity markets. The initiative includes scaling up European unicorns and strengthening Europe's capital markets to compete globally, especially in climate-friendly technologies.","content":"The European Investment Bank proposed on Monday to help close the funding gap and retain the most innovative start-up companies looking to grow in Europe through support for the EU venture capital and private equity markets. The initiative, presented by the bank to finance ministers at a meeting in Luxembourg, is part of the EU's push to develop its capital markets and be attractive for innovative start-ups that now often relocate to the United States where finding financing is easier. The EIB said in a statement that it would finance the scale up of European unicorns -- companies with unique ideas and growth potential -- by expanding the European Tech Champions Initiative, a fund of funds launched last year that provides late-stage capital to European innovators.  The EIB, which is owned by the EU's 27 governments, also offered to boost equity and venture debt investments and create a new dedicated fund for financing acquisitions and listing of tech start-ups by European firms. \"We're talking about ensuring that European companies, technologies that are born in Europe, stay in Europe, and that we invest in Europe's champions, in Europe's unicorns, that we reinforce Europe's competitiveness through a stronger capital market,\" EIB president Nadia Calvino said.","cleaned_content":"the european investment bank proposed on monday to help close the funding gap and retain the most innovative start up companies looking to grow in europe through support for the eu venture capital and private equity markets the initiative presented by the bank to finance ministers at a meeting in luxembourg is part of the eus push to develop its capital markets and be attractive for innovative start ups that now often relocate to the united states where finding financing is easier the eib said in a statement that it would finance the scale up of european unicorns companies with unique ideas and growth potential by expanding the european tech champions initiative a fund of funds launched last year that provides late stage capital to european innovators the eib which is owned by the eus \u003cTWO_TEN\u003e governments also offered to boost equity and venture debt investments and create a new dedicated fund for financing acquisitions and listing of tech start ups by european firms were talking about ensuring that european companies technologies that are born in europe stay in europe and that we invest in europes champions in europes unicorns that we reinforce europes competitiveness through a stronger capital market eib president nadia calvino said","timestamp":"2024-10-08T11:20:00+05:30","market_timestamp":"2024-10-08T11:20:00+05:30","off_market_hours":false}