{"url":"https://economictimes.indiatimes.com/tech/technology/visionary-leader-startup-founders-tech-veterans-hail-industry-titan-ratan-tata/articleshow/114107120.cms","title":"‘Visionary leader’: startup founders, tech veterans hail industry titan Ratan Tata","description":"Indian industrialist Ratan Tata, aged 86, passed away at Mumbai’s Breach Candy hospital. His death, announced by N Chandrasekaran, chairman of Tata Sons, has led to nationwide tributes, highlighting Tata's immeasurable contributions to both the Tata Group and the broader Indian business landscape.","content":"Indian industrialist Ratan Tata, the chairman emeritus of Tata Group and Tata Sons, passed away at the age of 86, on Wednesday at Mumbai’s Breach Candy Hospital after being in critical condition and under intensive care. The news comes just two days after Tata had shared that he was undergoing routine medical checks due to his age-related concerns.N Chandrasekaran, the chairman of Tata Sons, announced the death, in a statement on Wednesday. “It is with a profound sense of loss that we bid farewell to Mr. Ratan Naval Tata, a truly uncommon leader whose immeasurable contributions have shaped not only the Tata Group but also the very fabric of our nation,\" said Mr Chandrasekaran.Tata’s passing has sent shockwaves across the nation, with tributes pouring in from all corners, including from startup founders and tech personalities. Business leaders and industry veterans, took to X, mourning at the loss.Google CEO Sundar Pichai hailed Tata as a mentor for India who developed the modern business leadership. “He leaves an extraordinary business and philanthropic legacy and was instrumental in mentoring and developing the modern business leadership in India. He deeply cared about making India better. Deep condolences to his loved ones and Rest in Peace Shri Ratan Tata Ji,\" Pichai posted on X.","cleaned_content":"indian industrialist ratan tata the chairman emeritus of tata group and tata sons passed away at the age of \u003cEIGHT_TEN\u003e on wednesday at mumbai s breach candy hospital after being in critical condition and under intensive care the news comes just two days after tata had shared that he was undergoing routine medical checks due to his age related concerns n chandrasekaran the chairman of tata sons announced the death in a statement on wednesday it is with a profound sense of loss that we bid farewell to mr ratan naval tata a truly uncommon leader whose immeasurable contributions have shaped not only the tata group but also the very fabric of our nation said mr chandrasekaran tata s passing has sent shockwaves across the nation with tributes pouring in from all corners including from startup founders and tech personalities business leaders and industry veterans took to x mourning at the loss google ceo sundar pichai hailed tata as a mentor for india who developed the modern business leadership he leaves an extraordinary business and philanthropic legacy and was instrumental in mentoring and developing the modern business leadership in india he deeply cared about making india better deep condolences to his loved ones and rest in peace shri ratan tata ji pichai posted on x","timestamp":"2024-10-10T13:20:00+05:30","market_timestamp":"2024-10-10T13:20:00+05:30","off_market_hours":false}