{"url":"https://economictimes.indiatimes.com/tech/technology/et-conversations-with-nvidia-ceo-jensen-huang-the-cult-figure-powering-a-genai-revolution/articleshow/114115975.cms","title":"ET Conversations with Nvidia CEO Jensen Huang, the cult figure powering a GenAI revolution","description":"The Economic Times is delighted to announce an exclusive evening—ET Conversations with Jensen Huang—on October 25 in Mumbai. This is the second edition of ET Conversations—the first featured Sam Altman of OpenAI in June 2023.​​ Nvidia’s meteoric rise has been a perfect storm. Some may call it providence. The company in 1999 invented the graphics processing unit (GPU), redefining the possibilities of computer graphics and boosting the growth of PC gaming.","content":"He’s the founder of the world’s second most valuable company—a company that was dreamed into life in 1993 at a Denny’s diner in California, that now has a market cap of $3.28 trillion, nipping at the heels of Apple. Jensen Huang, founder, president and CEO of Nvidia, is the iconic figurehead at the heart of the global AI revolution. He’s one of the wealthiest people in the world, and with his signature black leather jacket, is almost a cult figure. Yet, he has also underlined the fear of failure as a motivator—he still wakes up with this feeling, he says. The Economic Times is delighted to announce an exclusive evening—ET Conversations with Jensen Huang—on October 25 in Mumbai. This is the second edition of ET Conversations—the first featured Sam Altman of OpenAI in June 2023.Nvidia’s meteoric rise has been a perfect storm. Some may call it providence. The company in 1999 invented the graphics processing unit (GPU), redefining the possibilities of computer graphics and boosting the growth of PC gaming. Now, almost 30 years later, the GPU chip is at the centre of the AI story, critical for running generative AI models.On an India visit in September a year ago, Huang met Prime Minister Narendra Modi and discussed the rich potential India offers in the world of AI. “He (Modi) said to me, Jensen, India should not export flour to import bread. This makes perfect sense. Why export the raw material to import the value add? Why export the data of India, so that you can import AI?,” Huang said, recalling the meeting.","cleaned_content":"he s the founder of the world s second most valuable company a company that was dreamed into life in \u003cONE_THOUSAND\u003e at a denny s diner in california that now has a market cap of \u003cTHREE_\u003e trillion nipping at the heels of apple jensen huang founder president and ceo of nvidia is the iconic figurehead at the heart of the global ai revolution he s one of the wealthiest people in the world and with his signature black leather jacket is almost a cult figure yet he has also underlined the fear of failure as a motivator he still wakes up with this feeling he says the economic times is delighted to announce an exclusive evening et conversations with jensen huang on october \u003cTWO_TEN\u003e in mumbai this is the second edition of et conversations the first featured sam altman of openai in june \u003cTWO_THOUSAND\u003e nvidia s meteoric rise has been a perfect storm some may call it providence the company in \u003cONE_THOUSAND\u003e invented the graphics processing unit gpu redefining the possibilities of computer graphics and boosting the growth of pc gaming now almost \u003cTHREE_TEN\u003e years later the gpu chip is at the centre of the ai story critical for running generative ai models on an india visit in september a year ago huang met prime minister narendra modi and discussed the rich potential india offers in the world of ai he modi said to me jensen india should not export flour to import bread this makes perfect sense why export the raw material to import the value add why export the data of india so that you can import ai huang said recalling the meeting","timestamp":"2024-10-10T15:05:00+05:30","market_timestamp":"2024-10-10T15:05:00+05:30","off_market_hours":false}