{"url":"https://economictimes.indiatimes.com/tech/technology/the-us-and-microsoft-disrupt-a-russian-hacking-group-targeting-american-officials-and-nonprofits/articleshow/113929031.cms","title":"The US and Microsoft disrupt a Russian hacking group targeting American officials and nonprofits","description":"On Thursday, a U.S. court unsealed documents authorizing Microsoft and the Department of Justice to seize more than 100 website domain names associated with Star Blizzard. That action came after a lawsuit was filed against the network by Microsoft and the NGO-Information Sharing and Analysis Center, a nonprofit tech organization that investigated Star Blizzard.","content":"A hacking group tied to Russian intelligence tried to worm its way into the systems of dozens of Western think tanks, journalists and former military and intelligence officials, Microsoft and U.S. authorities said Thursday. The group, known as Star Blizzard to cyberespionage experts, targeted its victims with emails that appeared to come from a trusted source - a tactic known as spear phishing. In fact, the emails sought access to the victims' internal systems, as a way to steal information and disrupt their activities. Star Blizzard's actions were persistent and sophisticated, according to Microsoft, and the group often did detailed research on its targets before launching an attack. Star Blizzard also went after civil society groups, U.S. companies, American military contractors and the Department of Energy, which oversees many nuclear programs, the company said. On Thursday, a U.S. court unsealed documents authorizing Microsoft and the Department of Justice to seize more than 100 website domain names associated with Star Blizzard. That action came after a lawsuit was filed against the network by Microsoft and the NGO-Information Sharing and Analysis Center, a nonprofit tech organization that investigated Star Blizzard. Authorities haven't gone into details about Star Blizzard's effectiveness but said they expect Russia to keep deploying hacking and cyberattacks against the U.S. and its allies.","cleaned_content":"a hacking group tied to russian intelligence tried to worm its way into the systems of dozens of western think tanks journalists and former military and intelligence officials microsoft and u s authorities said thursday the group known as star blizzard to cyberespionage experts targeted its victims with emails that appeared to come from a trusted source a tactic known as spear phishing in fact the emails sought access to the victims internal systems as a way to steal information and disrupt their activities star blizzards actions were persistent and sophisticated according to microsoft and the group often did detailed research on its targets before launching an attack star blizzard also went after civil society groups u s companies american military contractors and the department of energy which oversees many nuclear programs the company said on thursday a u s court unsealed documents authorizing microsoft and the department of justice to seize more than \u003cONE_HUNDRED\u003e website domain names associated with star blizzard that action came after a lawsuit was filed against the network by microsoft and the ngo information sharing and analysis center a nonprofit tech organization that investigated star blizzard authorities havent gone into details about star blizzards effectiveness but said they expect russia to keep deploying hacking and cyberattacks against the u s and its allies","timestamp":"2024-10-04T11:40:00+05:30","market_timestamp":"2024-10-04T11:40:00+05:30","off_market_hours":false}