{"url":"https://economictimes.indiatimes.com/tech/technology/australian-court-upholds-order-for-musks-x-to-pay-418000-fine-over-anti-child-abuse-probe/articleshow/113932502.cms","title":"Australian court upholds order for Musk's X to pay $418,000 fine over anti-child abuse probe","description":"Elon Musk's X was fined by an Australian court for failing to cooperate with a regulator's request for information about its anti-child-abuse practices. Musk has previously criticized the regulator's actions, arguing that they are censorship.","content":"An Australian court upheld an order on Friday for Elon Musk's X to pay a fine of A$610,500 ($418,000) for failing to cooperate with a regulator's request for information about anti-child-abuse practices. X had challenged the fine but the Federal Court of Australia ruled it was obliged to respond to a notice from the eSafety Commissioner, an internet safety regulator, seeking information about steps to address child sexual exploitation material on the platform. Musk took X, then called Twitter, private in 2022. But the company had argued it was not bound to respond to the notice in early 2023 because it was folded into a new Musk-controlled corporate entity, removing liability. \"Had X Corp's argument been accepted by the Court it could have set the concerning precedent that a foreign company's merger with another foreign company might enable it to avoid regulatory obligations in Australia,\" eSafety Commissioner Julie Inman Grant said in a statement following the verdict. eSafety has also started civil proceedings against X because of its noncompliance.","cleaned_content":"an australian court upheld an order on friday for elon musks x to pay a fine of a \u003cSIX_HUNDRED_THOUSAND\u003e \u003cFOUR_HUNDRED_THOUSAND\u003e for failing to cooperate with a regulators request for information about anti child abuse practices x had challenged the fine but the federal court of australia ruled it was obliged to respond to a notice from the esafety commissioner an internet safety regulator seeking information about steps to address child sexual exploitation material on the platform musk took x then called twitter private in \u003cTWO_THOUSAND\u003e but the company had argued it was not bound to respond to the notice in early \u003cTWO_THOUSAND\u003e because it was folded into a new musk controlled corporate entity removing liability had x corps argument been accepted by the court it could have set the concerning precedent that a foreign companys merger with another foreign company might enable it to avoid regulatory obligations in australia esafety commissioner julie inman grant said in a statement following the verdict esafety has also started civil proceedings against x because of its noncompliance","timestamp":"2024-10-04T13:27:00+05:30","market_timestamp":"2024-10-04T13:27:00+05:30","off_market_hours":false}