{"url":"https://economictimes.indiatimes.com/tech/technology/tiktok-sued-by-13-us-states-and-dc-accused-of-harming-younger-users/articleshow/114062486.cms","title":"TikTok sued by 13 US states and DC, accused of harming younger users","description":"Thirteen U.S. states and Washington D.C. have sued TikTok, alleging the platform harms minors by fostering addiction through its content. The lawsuits seek financial penalties and criticize TikTok's content moderation, despite the company's claim of implementing safety features for young users.","content":"TikTok faces new lawsuits filed by 13 U.S. states and the District of Columbia on Tuesday, accusing the popular social media platform of harming and failing to protect young people. The lawsuits filed separately in New York, California, the District of Columbia and 11 other states, expand Chinese-owned TikTok's legal fight with U.S. regulators, and seek new financial penalties against the company. The states accuse TikTok of using intentionally addictive software designed to keep children watching as long and often as possible and misrepresenting its content moderation effectiveness. \"TikTok cultivates social media addiction to boost corporate profits,\" California Attorney General Rob Bonta said in a statement. \"TikTok intentionally targets children because they know kids do not yet have the defenses or capacity to create healthy boundaries around addictive content.\" TikTok seeks to maximize the amount of time users spend on the app in order to target them with ads, the states say.","cleaned_content":"tiktok faces new lawsuits filed by \u003cONE_TEN\u003e u s states and the district of columbia on tuesday accusing the popular social media platform of harming and failing to protect young people the lawsuits filed separately in new york california the district of columbia and \u003cONE_TEN\u003e other states expand chinese owned tiktoks legal fight with u s regulators and seek new financial penalties against the company the states accuse tiktok of using intentionally addictive software designed to keep children watching as long and often as possible and misrepresenting its content moderation effectiveness tiktok cultivates social media addiction to boost corporate profits california attorney general rob bonta said in a statement tiktok intentionally targets children because they know kids do not yet have the defenses or capacity to create healthy boundaries around addictive content tiktok seeks to maximize the amount of time users spend on the app in order to target them with ads the states say","timestamp":"2024-10-09T07:39:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}