{"url":"https://economictimes.indiatimes.com/tech/technology/60-of-unicorn-founders-achieved-1-billion-valuation-in-maiden-attempt-report/articleshow/114150164.cms","title":"60% of Indian unicorn founders achieved $1-billion valuation in maiden attempt: report","description":"In the last two years, companies such as quick commerce platform Zepto, non-banking lender InCred, Ola founder Bhavish Aggarwal’s artificial intelligence startup Krutrim, and software-as-a-service (SaaS) fintech startup Perfios have attained a value of over $1 billion. In 2024, five startups -- Krutrim, Perfios, Rapido, electric scooter maker Ather Energy, and fintech lending startup Moneyview -- achieved unicorn status.","content":"About 60% of the 261 unicorn founders in India built a startup valued at over $1 billion in their first attempt whereas 29% took two attempts to build their first unicorn, a report by private market intelligence platform PrivateCircle said.India’s startup ecosystem has grown rapidly, producing more than 100 unicorns in the last decade. However, the pace of unicorn creation in India slowed down in the last two years as a prolonged downturn hit the global technology and risk investment ecosystem.Startups that attained a value of over $1 billion in the last two years include quick-commerce platform Zepto, non-banking lender InCred, artificial intelligence firm Krutrim and software-as-a-service (SaaS) fintech Perfios among others.In 2024, five startups became unicorns. They are Krutrim, founded by Ola founder Bhavish Aggarwal, Perfios, ride-hailing platform Rapido, electric scooter maker Ather Energy and fintech lending startup Moneyview.ET reported on September 5 that Rapido raised $200 million in a financing round led by existing investor WestBridge Capital, becoming a unicorn with a $1.1 billion valuation.","cleaned_content":"about \u003cSIX_TEN_PERCENT\u003e of the \u003cTWO_HUNDRED\u003e unicorn founders in india built a startup valued at over \u003cONE_\u003e billion in their first attempt whereas \u003cTWO_TEN_PERCENT\u003e took two attempts to build their first unicorn a report by private market intelligence platform privatecircle said india s startup ecosystem has grown rapidly producing more than \u003cONE_HUNDRED\u003e unicorns in the last decade however the pace of unicorn creation in india slowed down in the last two years as a prolonged downturn hit the global technology and risk investment ecosystem startups that attained a value of over \u003cONE_\u003e billion in the last two years include quick commerce platform zepto non banking lender incred artificial intelligence firm krutrim and software as a service saas fintech perfios among others in \u003cTWO_THOUSAND\u003e five startups became unicorns they are krutrim founded by ola founder bhavish aggarwal perfios ride hailing platform rapido electric scooter maker ather energy and fintech lending startup moneyview et reported on september \u003cFIVE_\u003e that rapido raised \u003cTWO_HUNDRED\u003e million in a financing round led by existing investor westbridge capital becoming a unicorn with a \u003cONE_\u003e billion valuation","timestamp":"2024-10-12T09:19:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}