{"url":"https://economictimes.indiatimes.com/tech/technology/gemba-capital-ropes-in-ranjeet-pratap-singh-as-consumer-tech-venture-advisor/articleshow/114084074.cms","title":"Gemba Capital ropes in Ranjeet Pratap Singh as consumer tech venture advisor","description":"In his advisory role, Singh will guide Gemba Capital’s investment team in evaluating consumer tech deals and mentor portfolio companies with his invaluable insights and expertise.","content":"Gemba Capital, India’s leading micro-VC fund, has expanded its advisory team by adding Ranjeet Pratap Singh as a consumer tech venture advisor.In his advisory role, Singh will guide Gemba Capital’s investment team in evaluating consumer tech deals and mentor portfolio companies with his invaluable insights and expertise.An FMS Delhi alumnus, some of Ranjeet’s angel investments include startups such as Kutumb, Animall, Headout, and Newton School.“I have always believed that brainstorming with smart founders is a way to give back to the ecosystem and learn fresh perspectives that help me as an operator and a leader. Working with the fantastic Gemba Capital team and its portfolio companies is an endeavour that is going in the same direction. I am a big believer in the Indian consumer internet ecosystem and think dozens of large-scale consumer tech businesses will be built in India over the next decade,\" said Singh, co-founder and CEO of Pratilipi, India's largest storytelling platform across multiple formats and languages.Pratilipi was founded in 2015, and its online literature platform has over 1.5 million writers whose stories are read over 550 million times each month. The company also owns Pratilipi Comics, Pratilipi FM, IVM Podcasts, and Westland Books. Pratilipi has raised over $80 million from investors such as Krafton, Nexus, and Omidyar Network.","cleaned_content":"gemba capital india s leading micro vc fund has expanded its advisory team by adding ranjeet pratap singh as a consumer tech venture advisor in his advisory role singh will guide gemba capital s investment team in evaluating consumer tech deals and mentor portfolio companies with his invaluable insights and expertise an fms delhi alumnus some of ranjeet s angel investments include startups such as kutumb animall headout and newton school i have always believed that brainstorming with smart founders is a way to give back to the ecosystem and learn fresh perspectives that help me as an operator and a leader working with the fantastic gemba capital team and its portfolio companies is an endeavour that is going in the same direction i am a big believer in the indian consumer internet ecosystem and think dozens of large scale consumer tech businesses will be built in india over the next decade said singh co founder and ceo of pratilipi indias largest storytelling platform across multiple formats and languages pratilipi was founded in \u003cTWO_THOUSAND\u003e and its online literature platform has over \u003cONE_\u003e million writers whose stories are read over \u003cFIVE_HUNDRED\u003e million times each month the company also owns pratilipi comics pratilipi fm ivm podcasts and westland books pratilipi has raised over \u003cEIGHT_TEN\u003e million from investors such as krafton nexus and omidyar network","timestamp":"2024-10-09T18:14:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}