{"url":"https://economictimes.indiatimes.com/tech/technology/reddit-down-globally-users-face-access-issues-across-platforms/articleshow/114210426.cms","title":"Reddit Down: users face access issues across platforms","description":"Reddit Global Outage: Outage monitoring service Downdetector has recorded over 200 reports of Reddit being down. ​On desktop, users are getting error message “no healthy upstream,” while mobile users encounter “upstream connect error or disconnect/reset before headers. eeset reason: connection failure.”","content":"Reddit users worldwide are unable to access the platform on both desktop and mobile platforms. On desktop, users are greeted with the error message “no healthy upstream,” while mobile users encounter “upstream connect error or disconnect/reset before headers. Reset reason: connection failure.” As of now, Reddit has yet to issue an official statement regarding the cause of the outage.Outage monitoring service Downdetector has recorded over 200 reports of Reddit being down. Frustrated users have taken to social media platform X (formerly Twitter) to voice their concerns. Downdetector tracks outages by collating status reports from several sources, including user-submitted errors on its platform.One user humorously wrote on X, “Reddit is down. The system admin on tonight must've hit the wrong button”","cleaned_content":"reddit users worldwide are unable to access the platform on both desktop and mobile platforms on desktop users are greeted with the error message no healthy upstream while mobile users encounter upstream connect error or disconnect reset before headers reset reason connection failure as of now reddit has yet to issue an official statement regarding the cause of the outage outage monitoring service downdetector has recorded over \u003cTWO_HUNDRED\u003e reports of reddit being down frustrated users have taken to social media platform x formerly twitter to voice their concerns downdetector tracks outages by collating status reports from several sources including user submitted errors on its platform one user humorously wrote on x reddit is down the system admin on tonight mustve hit the wrong button","timestamp":"2024-10-14T14:18:00+05:30","market_timestamp":"2024-10-14T14:18:00+05:30","off_market_hours":false}