{"url":"https://economictimes.indiatimes.com/tech/technology/google-triumphs-on-the-nobel-stage-as-tough-antitrust-fight-looms/articleshow/114109828.cms","title":"Google triumphs on the Nobel stage as tough antitrust fight looms","description":"The two Google scientists won their Nobels a day after Geoffrey Hinton, a former Google vice president and researcher, was one of two winners of the Nobel Prize in physics for his pioneering work on artificial intelligence. But the triumphant moment for Google was tempered by concerns that the commercial success that has allowed the company to pursue these long-term projects is under threat by antitrust regulators.","content":"Google, thanks to the tens of billions of dollars it makes every year from its online search business, has long pursued giant research projects that could one day change the world. On Wednesday, the Nobel Prize committee conferred considerable prestige to Google's pursuit of big ideas. Demis Hassabis, the CEO of Google's primary artificial intelligence lab, and John Jumper, one of the lab's scientists, were among a trio of researchers who received the Nobel Prize in chemistry for their efforts to better understand the human body and fight disease through AI. The two Google scientists won their Nobels a day after Geoffrey Hinton, a former Google vice president and researcher, was one of two winners of the Nobel Prize in physics for his pioneering work on artificial intelligence. The Nobel wins were a demonstration of the growing role artificial intelligence is playing in areas far beyond the traditional world of the high-tech industry, and were a reminder of Silicon Valley's influence in nearly every corner of science and the economy. \"This is the year the Nobel committee got AI,\" said Oren Etzioni, a professor emeritus of computer science at the University of Washington. \"These prizes are a conscious recognition of how influential AI has become in the scientific world.\"","cleaned_content":"google thanks to the tens of billions of dollars it makes every year from its online search business has long pursued giant research projects that could one day change the world on wednesday the nobel prize committee conferred considerable prestige to googles pursuit of big ideas demis hassabis the ceo of googles primary artificial intelligence lab and john jumper one of the labs scientists were among a trio of researchers who received the nobel prize in chemistry for their efforts to better understand the human body and fight disease through ai the two google scientists won their nobels a day after geoffrey hinton a former google vice president and researcher was one of two winners of the nobel prize in physics for his pioneering work on artificial intelligence the nobel wins were a demonstration of the growing role artificial intelligence is playing in areas far beyond the traditional world of the high tech industry and were a reminder of silicon valleys influence in nearly every corner of science and the economy this is the year the nobel committee got ai said oren etzioni a professor emeritus of computer science at the university of washington these prizes are a conscious recognition of how influential ai has become in the scientific world","timestamp":"2024-10-10T12:23:00+05:30","market_timestamp":"2024-10-10T12:23:00+05:30","off_market_hours":false}