{"url":"https://economictimes.indiatimes.com/tech/technology/what-comes-next-in-googles-antitrust-case-over-search/articleshow/114047372.cms","title":"What comes next in Google's antitrust case over search?","description":"The U.S. Department of Justice is expected on Tuesday to tell a judge what actions Alphabet's Google should take after he ruled in August that it illegally monopolized online search in the United States, the latest step in a long legal process.","content":" Here is what has happened so far in the case and what comes next. Oct. 20, 2020 - The Justice Department sues Google alleging that it illegally monopolized the online search and related advertising markets, the first time in a generation that the U.S. government accused a Big Tech corporation of an illegal monopoly. Sept. 12, 2023 - Google defends its practices at a trial before U.S. District Judge Amit Mehta in Washington, saying it had won its market share by providing a high-quality service. Nov. 16, 2023 - The trial's evidence phase concludes, after Google CEO Sundar Pichai took the stand and acknowledged the importance of making its search engine the default on phones and other devices.","cleaned_content":"here is what has happened so far in the case and what comes next oct \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the justice department sues google alleging that it illegally monopolized the online search and related advertising markets the first time in a generation that the u s government accused a big tech corporation of an illegal monopoly sept \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e google defends its practices at a trial before u s district judge amit mehta in washington saying it had won its market share by providing a high quality service nov \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the trials evidence phase concludes after google ceo sundar pichai took the stand and acknowledged the importance of making its search engine the default on phones and other devices","timestamp":"2024-10-08T16:43:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}