{"url":"https://economictimes.indiatimes.com/tech/technology/germany-closes-meta-case-after-data-measures-agreed/articleshow/114121675.cms","title":"Germany closes Meta case after data measures agreed","description":"Germany's antitrust watchdog said on Thursday that Meta had taken measures that give users greater control over how their data get used on its platforms, ending a long-running dispute. \"Users now have much greater control over how their data are combined,\" cartel office president Andreas Mundt said in a statement.","content":"Germany's antitrust watchdog said on Thursday that Meta had taken measures that give users greater control over how their data get used on its platforms, ending a long-running dispute.The Federal Cartel Office in 2019 ordered the US tech giant, then still called Facebook, to stop merging user data collected through its subsidiaries and other websites unless users gave their consent.Meta lodged legal complaints against the decision but, after suffering setbacks in German and EU courts, moved to implement new measures to address the concerns.\"Users now have much greater control over how their data are combined,\" cartel office president Andreas Mundt said in a statement.Steps include the introduction of an \"accounts centre\" that allows users to keep data from Meta's different social networks, such as Facebook and Instagram, separate, and implementing cookie settings to separate Facebook data from other data.","cleaned_content":"germanys antitrust watchdog said on thursday that meta had taken measures that give users greater control over how their data get used on its platforms ending a long running dispute the federal cartel office in \u003cTWO_THOUSAND\u003e ordered the us tech giant then still called facebook to stop merging user data collected through its subsidiaries and other websites unless users gave their consent meta lodged legal complaints against the decision but after suffering setbacks in german and eu courts moved to implement new measures to address the concerns users now have much greater control over how their data are combined cartel office president andreas mundt said in a statement steps include the introduction of an accounts centre that allows users to keep data from metas different social networks such as facebook and instagram separate and implementing cookie settings to separate facebook data from other data","timestamp":"2024-10-10T17:26:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}