{"url":"https://economictimes.indiatimes.com/tech/technology/us-house-panel-probes-fcc-decision-to-deny-starlink-nearly-900-million/articleshow/114033851.cms","title":"US House panel probes FCC decision to deny Starlink nearly $900 million","description":"The U.S. House committee is investigating the FCC's decision to deny SpaceX's Starlink $885.5 million in rural broadband subsidies, citing Starlink's failure to meet program requirements. Elon Musk criticized the decision, but FCC Chair Jessica Rosenworcel defended it, highlighting competition and performance issues with Starlink.","content":"A U.S. House committee said on Monday it is investigating the Federal Communications Commission's decision to deny SpaceX satellite internet unit Starlink $885.5 million in rural broadband subsidies. The FCC said in December reaffirming its position that the decision impacting Elon Musk's space company was based on Starlink's failure to meet basic program requirements and that Starlink could not demonstrate it could deliver promised service after SpaceX had challenged the 2022 decision. House Oversight Committee Chair James Comer, a Republican, asked the FCC in a letter Monday to turn over documents by Oct. 21 on the decision. The committee seeks to ensure the FCC \"followed established processes and is not improperly using the regulatory process for political purposes.\" The FCC said it had received the letter and would respond. In December 2020, the FCC tentatively awarded $9.2 billion to over 300 bidders to deploy high-speed broadband with SpaceX's Starlink winning $885.5 million in a 2020 auction for rural service.","cleaned_content":"a u s house committee said on monday it is investigating the federal communications commissions decision to deny spacex satellite internet unit starlink \u003cEIGHT_HUNDRED\u003e million in rural broadband subsidies the fcc said in december reaffirming its position that the decision impacting elon musks space company was based on starlinks failure to meet basic program requirements and that starlink could not demonstrate it could deliver promised service after spacex had challenged the \u003cTWO_THOUSAND\u003e decision house oversight committee chair james comer a republican asked the fcc in a letter monday to turn over documents by oct \u003cTWO_TEN\u003e on the decision the committee seeks to ensure the fcc followed established processes and is not improperly using the regulatory process for political purposes the fcc said it had received the letter and would respond in december \u003cTWO_THOUSAND\u003e the fcc tentatively awarded \u003cNINE_\u003e billion to over \u003cTHREE_HUNDRED\u003e bidders to deploy high speed broadband with spacexs starlink winning \u003cEIGHT_HUNDRED\u003e million in a \u003cTWO_THOUSAND\u003e auction for rural service","timestamp":"2024-10-08T10:31:00+05:30","market_timestamp":"2024-10-08T10:31:00+05:30","off_market_hours":false}