{"url":"https://economictimes.indiatimes.com/tech/technology/paytm-ceo-vijay-shekhar-sharma-deletes-post-about-late-ratan-tata-after-backlash/articleshow/114125892.cms","title":"Paytm CEO Vijay Shekhar Sharma deletes post about late Ratan Tata after backlash","description":"Tata, the former Tata Group chairman, passed away late on Wednesday aged 86. Veterans and top businessmen in the technology industry paid tributes and expressed condolences to the astute businessman.​​​","content":"Paytm CEO Vijay Shekhar Sharma removed a social media tribute to the late Ratan Tata after facing online backlash. Sharma's post, intended to honour the industrialist who passed away at 86, was met with criticism amidst an outpouring of tributes from Indian startup founders and CEOs.In his now-deleted post, Sharma wrote, \"A legend who will inspire every generation. Entrepreneurs of the next generation will miss interacting with the most humble businessman of India. Salutes, Sir. Ok Tata Bye Bye.\" The closing phrase \"Ok Tata Bye Bye\" sparked outrage, leading to widespread criticism, prompting Sharma to remove the post.Tata, the former Tata Group chairman, passed away late on Wednesday aged 86.Veterans and top businessmen in the technology industry paid tributes and expressed condolences to the astute businessman.Tata, who put a staid and sprawling Indian conglomerate on the global stage with a string of high-profile acquisitions, also became a strong supporter of the startup ecosystem after his retirement. His journey in the startup world began with a significant investment in Snapdeal in 2014, during a time when India’s startup scene was still taking shape, and achieving a billion-dollar valuation was a rare feat.","cleaned_content":"paytm ceo vijay shekhar sharma removed a social media tribute to the late ratan tata after facing online backlash sharmas post intended to honour the industrialist who passed away at \u003cEIGHT_TEN\u003e was met with criticism amidst an outpouring of tributes from indian startup founders and ceos in his now deleted post sharma wrote a legend who will inspire every generation entrepreneurs of the next generation will miss interacting with the most humble businessman of india salutes sir ok tata bye bye the closing phrase ok tata bye bye sparked outrage leading to widespread criticism prompting sharma to remove the post tata the former tata group chairman passed away late on wednesday aged \u003cEIGHT_TEN\u003e veterans and top businessmen in the technology industry paid tributes and expressed condolences to the astute businessman tata who put a staid and sprawling indian conglomerate on the global stage with a string of high profile acquisitions also became a strong supporter of the startup ecosystem after his retirement his journey in the startup world began with a significant investment in snapdeal in \u003cTWO_THOUSAND\u003e during a time when india s startup scene was still taking shape and achieving a billion dollar valuation was a rare feat","timestamp":"2024-10-11T12:16:00+05:30","market_timestamp":"2024-10-11T12:16:00+05:30","off_market_hours":false}