{"url":"https://economictimes.indiatimes.com/tech/technology/soon-you-will-be-able-to-travel-from-bengaluru-airport-to-cantt-station-in-40-min-minister/articleshow/113988397.cms","title":"Soon, you will be able to travel from Bengaluru airport to Cantt Station in 40 min: minister","description":"Vaishnaw, who is minister for railways, information broadcasting and information technology, took the train ride from the airport to the Cantt station, where he reviewed the progress of ongoing projects and some planned ones. V Somanna, minister of state (railways) and Lok Sabha member from Tumakuru, will be leading the project that will take the railway line into the sprawling airport.","content":"People will soon be able to travel from Bengaluru’s KempeGowda International Airport to the Cantt station by train in about 40 minutes, Union minister Ashwini Vaishnaw said at the ET Startup Awards event on Saturday, promising a faster and environment-friendly alternative to road travel in the city.Vaishnaw, who is minister for railways, information broadcasting and information technology, took the train ride from the airport to the Cantt station, where he reviewed the progress of ongoing projects and some planned ones. The journey, he said, took 35 minutes to complete, and when commissioned in a few months’ time, may take five minutes more.The shortest route to the Bengaluru airport from the Cantt railway station is 32-km long, but the city’s notorious traffic jams make the travel time unpredictable.V Somanna, minister of state (railways) and Lok Sabha member from Tumakuru, will be leading the project that will take the railway line into the sprawling airport. Last year, he had inspected the airport line project and most of the work planned had been done, the Union minister said.He reviewed the redevelopment work that is under way at the Cantt and Yeshwantpur railway stations. The work on at the Cantt station, the minister said, would result in 18,000 sq m of additional developed area with facilities near the tracks.","cleaned_content":"people will soon be able to travel from bengaluru s kempegowda international airport to the cantt station by train in about \u003cFOUR_TEN\u003e minutes union minister ashwini vaishnaw said at the et startup awards event on saturday promising a faster and environment friendly alternative to road travel in the city vaishnaw who is minister for railways information broadcasting and information technology took the train ride from the airport to the cantt station where he reviewed the progress of ongoing projects and some planned ones the journey he said took \u003cTHREE_TEN\u003e minutes to complete and when commissioned in a few months time may take five minutes more the shortest route to the bengaluru airport from the cantt railway station is \u003cTHREE_TEN\u003e km long but the city s notorious traffic jams make the travel time unpredictable v somanna minister of state railways and lok sabha member from tumakuru will be leading the project that will take the railway line into the sprawling airport last year he had inspected the airport line project and most of the work planned had been done the union minister said he reviewed the redevelopment work that is under way at the cantt and yeshwantpur railway stations the work on at the cantt station the minister said would result in \u003cONE_TEN_THOUSAND\u003e sq m of additional developed area with facilities near the tracks","timestamp":"2024-10-07T06:00:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}