{"url":"https://economictimes.indiatimes.com/tech/technology/cost-integration-and-scalability-hurdles-for-open-ran-in-india/articleshow/114174918.cms","title":"Cost, integration and scalability: Hurdles for Open RAN in India","description":"While the technology could reshape the telecom landscape in the country, challenges related to cost, integration and scalability continue to present major near-term hurdles.","content":"Vodafone Idea (Vi) recently joined the ranks of major telecom players like Reliance Jio and Bharti Airtel by securing significant contracts with traditional network vendors such as Nokia, Ericsson and Samsung. This shift raises concerns about the future of the Open RAN technology in India’s telecom landscape.Open RAN is a vendor-agnostic technology, designed to allow the sharing of hardware, software and radio components, potentially leading to substantial cost reductions. It’s particularly appealing to a cash-strapped Vi, which has yet to roll out its 5G networks.However, industry experts note that the enthusiasm for Open RAN has fizzled out mainly due to challenges around cost effectiveness, scale, legacy infrastructure and standardisation of technologies. As a result, widespread adoption can now only be expected in 6G, which is at least four to five years away for India.Yet, not everyone has abandoned the vision to of a truly open network architecture.Japan’s Rakuten is one of a few global telcos that successfully runs its 4G and 5G commercial network on cloud-native Open RAN technology. Meanwhile, enterprise open-source solutions company Red Hat is also optimistic that the transition to “Open-RAN is a journey, not an overnight switch”.","cleaned_content":"vodafone idea vi recently joined the ranks of major telecom players like reliance jio and bharti airtel by securing significant contracts with traditional network vendors such as nokia ericsson and samsung this shift raises concerns about the future of the open ran technology in india s telecom landscape open ran is a vendor agnostic technology designed to allow the sharing of hardware software and radio components potentially leading to substantial cost reductions it s particularly appealing to a cash strapped vi which has yet to roll out its \u003cFIVE_\u003e g networks however industry experts note that the enthusiasm for open ran has fizzled out mainly due to challenges around cost effectiveness scale legacy infrastructure and standardisation of technologies as a result widespread adoption can now only be expected in \u003cSIX_\u003e g which is at least four to five years away for india yet not everyone has abandoned the vision to of a truly open network architecture japan s rakuten is one of a few global telcos that successfully runs its \u003cFOUR_\u003e g and \u003cFIVE_\u003e g commercial network on cloud native open ran technology meanwhile enterprise open source solutions company red hat is also optimistic that the transition to open ran is a journey not an overnight switch","timestamp":"2024-10-13T16:27:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}