{"url":"https://economictimes.indiatimes.com/tech/technology/tamil-nadu-cabinet-approves-foxconns-rs-13180-crore-display-module-assembly-unit/articleshow/114048860.cms","title":"Tamil Nadu cabinet approves Foxconn's Rs 13,180-crore display module assembly unit","description":"Foxconn's investment was the single largest investment among 13 others that were approved by the Cabinet on Tuesday. The cumulative investment of the 14 projects came up to Rs 38,698.80 crore. This marked the first meeting since the elevation of Udhayanidhi Stalin as deputy Chief Minister of the state.","content":"The Tamil Nadu cabinet on Tuesday cleared a Rs 13,180 crore investment by Yuzhan Technology (India), which is a unit of Taiwanese contract manufacturer Foxconn, that is expected to generate 14,000 jobs.ET was the first to report on September 25 that Foxconn was evaluating an investment of about $1 billion to set up an assembling unit for smartphone display modules in Tamil Nadu, making it the first such facility that would cater to Apple.People aware of the developments had said that Foxconn had picked up about 500,000 square feet at a plug and play facility at the ESR Oragadam Industrial \u0026 Logistics Park, which is right next to their smartphone assembly unit near Chennai. They added that the maker of the iconic iPhone is leaning in for a model wherein even other contract manufacturers — Pegatron or Tata Electronics, for instance — can use components from this unit rather than import modules that are assembled in China.Foxconn's investment was the single largest investment among 13 others that were approved by the Cabinet on Tuesday. The cumulative investment of the 14 projects came up to Rs 38,698.80 crore. This marked the first meeting since the elevation of Udhayanidhi Stalin as deputy Chief Minister of the state.The cabinet meeting was chaired by Chief Minister M K Stalin who approved the investment which is expected to generate jobs for 46,931 persons in the state. State finance minister Thangam Thennarasu said the investments would be made in production of PCB, low tension panels, mobile phone components and cases, manufacture of luxury cars and their spares, high end equipments and their software, defence equipment, medical equipment, non-leather footwear, production of renewable energy, including green hydrogen and green ammonia, e-vehicles and telecommunication related R\u0026D.","cleaned_content":"the tamil nadu cabinet on tuesday cleared a rs \u003cONE_TEN_THOUSAND\u003e crore investment by yuzhan technology india which is a unit of taiwanese contract manufacturer foxconn that is expected to generate \u003cONE_TEN_THOUSAND\u003e jobs et was the first to report on september \u003cTWO_TEN\u003e that foxconn was evaluating an investment of about \u003cONE_\u003e billion to set up an assembling unit for smartphone display modules in tamil nadu making it the first such facility that would cater to apple people aware of the developments had said that foxconn had picked up about \u003cFIVE_HUNDRED_THOUSAND\u003e square feet at a plug and play facility at the esr oragadam industrial logistics park which is right next to their smartphone assembly unit near chennai they added that the maker of the iconic iphone is leaning in for a model wherein even other contract manufacturers pegatron or tata electronics for instance can use components from this unit rather than import modules that are assembled in china foxconns investment was the single largest investment among \u003cONE_TEN\u003e others that were approved by the cabinet on tuesday the cumulative investment of the \u003cONE_TEN\u003e projects came up to rs \u003cTHREE_TEN_THOUSAND\u003e crore this marked the first meeting since the elevation of udhayanidhi stalin as deputy chief minister of the state the cabinet meeting was chaired by chief minister m k stalin who approved the investment which is expected to generate jobs for \u003cFOUR_TEN_THOUSAND\u003e persons in the state state finance minister thangam thennarasu said the investments would be made in production of pcb low tension panels mobile phone components and cases manufacture of luxury cars and their spares high end equipments and their software defence equipment medical equipment non leather footwear production of renewable energy including green hydrogen and green ammonia e vehicles and telecommunication related r d","timestamp":"2024-10-08T18:01:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}