{"url":"https://economictimes.indiatimes.com/tech/technology/ftx-cleared-to-repay-billions-to-customers-after-bankruptcy-plan-approval/articleshow/114029300.cms","title":"FTX cleared to repay billions to customers after bankruptcy plan approval","description":"FTX received court approval for its bankruptcy plan, enabling the repayment of up to $16.5 billion to customers. The plan includes settlements with customers, creditors, and U.S. government agencies. FTX aims to repay 98% of its customers within 60 days of the plan's effective date.","content":"FTX received court approval of its bankruptcy plan on Monday, which will allow it to fully repay customers using up to $16.5 billion in assets recovered since the once-leading crypto exchange collapsed. U.S. Bankruptcy Judge John Dorsey approved the wind-down plan at a court hearing in Wilmington, Delaware, saying FTX's success made it \"a model case for how to deal with a very complex Chapter 11 bankruptcy proceeding.\" The plan is built on a series of settlements with FTX customers and creditors, U.S. government agencies, and liquidators appointed to wind down FTX's operations outside the U.S. The settlements allow FTX to use its assets to repay customers of its crypto exchange first, before paying potentially competing claims filed by government regulators. FTX plans to repay 98% of its customers - those who held $50,000 or less on the exchange - within 60 days after the plan's effective date, which has not yet been determined. Once among the world's top crypto exchanges, FTX collapsed after news surfaced that founder Sam Bankman-Fried took customer money to pay off risky bets made by his hedge fund, Alameda Research. Bankman-Fried was sentenced in March to 25 years in prison for stealing from FTX customers, and he has appealed his conviction. FTX remains in talks with the U.S. Department of Justice over $1 billion that the government seized during the criminal prosecution of Bankman-Fried. FTX shareholders, who would normally receive nothing in a bankruptcy proceeding, could receive up to $230 million from the funds seized by the DOJ, according to court documents. customers at least 118% of the value in their accounts as of November 2022, the date that the company filed for bankruptcy. U.S. government agencies, including the Commodity Futures Trading Comission and Internal Revenue Service, agreed to let FTX prioritize customer repayment over fines and tax debts, and a liquidator appointed in the Bahamas agreed to work with FTX after previously challenging the company's authority to file for bankruptcy in the U.S. FTX said the result was a victory for creditors, made possible by its ability to recover cash and crypto assets that had gone missing during the company's chaotic collapse. The company also raised additional funds by selling off other assets, including its investments in tech companies like the artificial-intelligence startup Anthropic. \"Today's achievement is only possible because of the experience and tireless work of the team of professionals supporting this case, who have recovered billions of dollars by rebuilding FTX's books from the ground up and from there marshaling assets from around the globe,\" FTX CEO John Ray said in a statement on Monday.","cleaned_content":"ftx received court approval of its bankruptcy plan on monday which will allow it to fully repay customers using up to \u003cONE_TEN\u003e billion in assets recovered since the once leading crypto exchange collapsed u s bankruptcy judge john dorsey approved the wind down plan at a court hearing in wilmington delaware saying ftxs success made it a model case for how to deal with a very complex chapter \u003cONE_TEN\u003e bankruptcy proceeding the plan is built on a series of settlements with ftx customers and creditors u s government agencies and liquidators appointed to wind down ftxs operations outside the u s the settlements allow ftx to use its assets to repay customers of its crypto exchange first before paying potentially competing claims filed by government regulators ftx plans to repay \u003cNINE_TEN_PERCENT\u003e of its customers those who held \u003cFIVE_TEN_THOUSAND\u003e or less on the exchange within \u003cSIX_TEN\u003e days after the plans effective date which has not yet been determined once among the worlds top crypto exchanges ftx collapsed after news surfaced that founder sam bankman fried took customer money to pay off risky bets made by his hedge fund alameda research bankman fried was sentenced in march to \u003cTWO_TEN\u003e years in prison for stealing from ftx customers and he has appealed his conviction ftx remains in talks with the u s department of justice over \u003cONE_\u003e billion that the government seized during the criminal prosecution of bankman fried ftx shareholders who would normally receive nothing in a bankruptcy proceeding could receive up to \u003cTWO_HUNDRED\u003e million from the funds seized by the doj according to court documents customers at least \u003cONE_HUNDRED_PERCENT\u003e of the value in their accounts as of november \u003cTWO_THOUSAND\u003e the date that the company filed for bankruptcy u s government agencies including the commodity futures trading comission and internal revenue service agreed to let ftx prioritize customer repayment over fines and tax debts and a liquidator appointed in the bahamas agreed to work with ftx after previously challenging the companys authority to file for bankruptcy in the u s ftx said the result was a victory for creditors made possible by its ability to recover cash and crypto assets that had gone missing during the companys chaotic collapse the company also raised additional funds by selling off other assets including its investments in tech companies like the artificial intelligence startup anthropic todays achievement is only possible because of the experience and tireless work of the team of professionals supporting this case who have recovered billions of dollars by rebuilding ftxs books from the ground up and from there marshaling assets from around the globe ftx ceo john ray said in a statement on monday","timestamp":"2024-10-08T07:52:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}