{"url":"https://economictimes.indiatimes.com/tech/technology/us-judge-orders-google-to-open-up-app-store-to-competition/articleshow/114028831.cms","title":"US judge orders Google to open up app store to competition","description":"A U.S. judge mandated significant changes to Google's mobile app operations. This includes offering Android users more choices for downloading apps and making in-app transactions. The injunction follows Epic Games' successful lawsuit against Google for monopolizing app access and payments. Google plans to appeal the verdict and seek a pause on the order.","content":"A U.S. judge on Monday ordered Alphabet's Google to overhaul its mobile app business to give Android users more options to download apps and to pay for transactions within them, following a jury verdict last year for \"Fortnite\" maker Epic Games. The injunction by U.S. District Judge James Donato in San Francisco outlined the changes Google must undertake to open up its lucrative app store, Play, to greater competition, including making Android apps available from rival sources. Donato's order said that for three years Google cannot prohibit the use of in-app payment methods and must allow users to download competing third-party Android app platforms or stores. The order restricts Google from making payments to device makers to preinstall its app store and from sharing revenue generated from the Play store with other app distributors. Google in a statement said it will appeal the verdict that led to the injunction to the San Francisco-based 9th U.S. Circuit Court of Appeals, and will ask the U.S. courts to pause Donato's order pending appeal. \"Ultimately, while these changes presumably satisfy Epic, they will cause a range of unintended consequences that will harm American consumers, developers and device makers,\" Google said.","cleaned_content":"a u s judge on monday ordered alphabets google to overhaul its mobile app business to give android users more options to download apps and to pay for transactions within them following a jury verdict last year for fortnite maker epic games the injunction by u s district judge james donato in san francisco outlined the changes google must undertake to open up its lucrative app store play to greater competition including making android apps available from rival sources donatos order said that for three years google cannot prohibit the use of in app payment methods and must allow users to download competing third party android app platforms or stores the order restricts google from making payments to device makers to preinstall its app store and from sharing revenue generated from the play store with other app distributors google in a statement said it will appeal the verdict that led to the injunction to the san francisco based \u003cNINE_\u003e th u s circuit court of appeals and will ask the u s courts to pause donatos order pending appeal ultimately while these changes presumably satisfy epic they will cause a range of unintended consequences that will harm american consumers developers and device makers google said","timestamp":"2024-10-08T07:19:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}