{"url":"https://economictimes.indiatimes.com/tech/technology/blackbuck-gets-sebi-clearance-for-proposed-ipo/articleshow/114074412.cms","title":"BlackBuck gets Sebi clearance for proposed IPO","description":"BlackBuck’s cofounders and promoters Rajesh Yabaji, Chanakya Hridaya and Rama Subramaniam will sell 2.2 million shares, 1.1 million shares and 1.1 million shares, respectively. Accel, the largest shareholder in the firm with a 14% stake, will sell 4.3 million shares and 923,282 shares through its two units.","content":"The Securities and Exchange Board of India (Sebi) has granted clearance to Flipkart-backed truck aggregator platform BlackBuck for its proposed initial public offering (IPO), according to a notification on the regulator’s website.The Bengaluru-based company had filed its draft red herring prospectus (DRHP) with Sebi in July for its IPO through which it plans to raise Rs 550 crore in fresh capital. The company’s investors Accel, Tiger Global and Peak XV Partners will participate in the issue’s offer-for-sale (OFS) component of 21.6 million shares.BlackBuck’s cofounders and promoters Rajesh Yabaji, Chanakya Hridaya and Rama Subramaniam will sell 2.2 million shares, 1.1 million shares and 1.1 million shares, respectively.Accel, the largest shareholder in the firm with a 14% stake, will sell 4.3 million shares and 923,282 shares through its two units. Meanwhile, Tiger Global, Peak XV Partners and B Capital will sell 883,322 shares, 640,409 shares and 529,993 shares in the OFS component, respectively.Flipkart, through its Singapore-based entity Quickroutes International, will sell 3.9 million shares, while World Bank-backed International Finance Corporation will sell 1.7 million shares and 628,315 shares through two entities. US-based Sands Capital will sell 1.3 million shares, 514,745 shares and 302,328 shares, respectively, through its three entities participating in the OFS.","cleaned_content":"the securities and exchange board of india sebi has granted clearance to flipkart backed truck aggregator platform blackbuck for its proposed initial public offering ipo according to a notification on the regulator s website the bengaluru based company had filed its draft red herring prospectus drhp with sebi in july for its ipo through which it plans to raise rs \u003cFIVE_HUNDRED\u003e crore in fresh capital the company s investors accel tiger global and peak xv partners will participate in the issue s offer for sale ofs component of \u003cTWO_TEN\u003e million shares blackbuck s cofounders and promoters rajesh yabaji chanakya hridaya and rama subramaniam will sell \u003cTWO_\u003e million shares \u003cONE_\u003e million shares and \u003cONE_\u003e million shares respectively accel the largest shareholder in the firm with a \u003cONE_TEN_PERCENT\u003e stake will sell \u003cFOUR_\u003e million shares and \u003cNINE_HUNDRED_THOUSAND\u003e shares through its two units meanwhile tiger global peak xv partners and b capital will sell \u003cEIGHT_HUNDRED_THOUSAND\u003e shares \u003cSIX_HUNDRED_THOUSAND\u003e shares and \u003cFIVE_HUNDRED_THOUSAND\u003e shares in the ofs component respectively flipkart through its singapore based entity quickroutes international will sell \u003cTHREE_\u003e million shares while world bank backed international finance corporation will sell \u003cONE_\u003e million shares and \u003cSIX_HUNDRED_THOUSAND\u003e shares through two entities us based sands capital will sell \u003cONE_\u003e million shares \u003cFIVE_HUNDRED_THOUSAND\u003e shares and \u003cTHREE_HUNDRED_THOUSAND\u003e shares respectively through its three entities participating in the ofs","timestamp":"2024-10-09T14:59:00+05:30","market_timestamp":"2024-10-09T14:59:00+05:30","off_market_hours":false}