{"url":"https://economictimes.indiatimes.com/tech/technology/conservative-think-tank-targeting-nasa-employees-communications-about-elon-musk-donald-trump/articleshow/113956010.cms","title":"Conservative think tank targeting NASA employees' communications about Elon Musk, Donald Trump","description":"The Heritage Foundation has filed numerous Freedom of Information requests with NASA to uncover internal discussions about Elon Musk and Donald Trump. This effort aims to identify civil servants opposing Trump's agenda and assess whether NASA is hindering private companies like Musk's SpaceX.","content":"An influential conservative think tank has asked the National Aeronautics and Space Administration to disclose what employees are discussing internally about billionaire Elon Musk and former President Donald Trump, according to federal records reviewed by Reuters. The effort, involving scores of Freedom of Information requests filed by the Heritage Foundation, is part of that organization's ongoing push to help Trump weed out uncooperative civil servants if he is reelected to the White House in November, one of its executives told Reuters. It is also meant to determine, in the conservative group's view, whether agencies like NASA are thwarting progress for private companies like SpaceX, Musk's rocket and satellite venture. In an interview, Mike Howell, director of the Heritage Foundation's investigative unit, argued that NASA and other regulators obstruct innovation because they are distracted by cultural and identity politics. \"Instead of cool things in space,\" Howell said, NASA is \"doing all this woke stuff on the ground.\" Specialists in government administration said the requests are a partisan attempt to identify civil servants who oppose Trump's stated plan to appoint the business mogul, and frequent critic of regulatory bureaucracy, as a government efficiency czar. In that position, they added, Musk could help the former president reintroduce a plan from his first term to replace federal employees deemed ideologically contrary to his administration.","cleaned_content":"an influential conservative think tank has asked the national aeronautics and space administration to disclose what employees are discussing internally about billionaire elon musk and former president donald trump according to federal records reviewed by reuters the effort involving scores of freedom of information requests filed by the heritage foundation is part of that organizations ongoing push to help trump weed out uncooperative civil servants if he is reelected to the white house in november one of its executives told reuters it is also meant to determine in the conservative groups view whether agencies like nasa are thwarting progress for private companies like spacex musks rocket and satellite venture in an interview mike howell director of the heritage foundations investigative unit argued that nasa and other regulators obstruct innovation because they are distracted by cultural and identity politics instead of cool things in space howell said nasa is doing all this woke stuff on the ground specialists in government administration said the requests are a partisan attempt to identify civil servants who oppose trumps stated plan to appoint the business mogul and frequent critic of regulatory bureaucracy as a government efficiency czar in that position they added musk could help the former president reintroduce a plan from his first term to replace federal employees deemed ideologically contrary to his administration","timestamp":"2024-10-05T09:57:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}