{"url":"https://economictimes.indiatimes.com/tech/technology/bluestone-sees-64-revenue-growth-in-fy24-narrows-losses-amid-rising-expenses/articleshow/114074563.cms","title":"Bluestone sees 64% revenue growth in FY24, narrows losses amid rising expenses","description":"Jewellery retailer Bluestone increased its operating revenue by 64% in FY24, reaching Rs 1,265.8 crore, while narrowing its losses by 15% to Rs 142.2 crore. Total expenses also rose significantly. With backing from investors and a recent Rs 900-crore financing round, Bluestone is preparing for a nearly Rs 2,000-crore IPO.","content":"Jewellery retailer Bluestone has recorded a 64% increase in operating revenue for the year ended March 2024, according to data sourced from Tofler. Its losses for the full year narrowed by about 15% to Rs 142.2 crore.The Bengaluru-based company’s revenue from operations grew to Rs 1,265.8 crore in FY24 from Rs 770.7 crore in FY23. Its total revenue for FY24 stood at Rs 1,303.4 crore, up from Rs 787.8 crore in the previous year.However, Accel-backed Bluestone’s total expense ballooned, reaching Rs 1,445.7 crore at the end of March from Rs 955.1 crore a year ago. Material costs, including raw materials, accounted for more than 85% of the expenses. Employee benefit costs also increased, rising by more than 50% to Rs 138.4 crore in FY24.“Company has been successful in growing revenue in existing stores during the year, which has resulted in improved margins,” it noted. “The company thus expects further improvement in its cash flow from operations through increase in revenue from its existing as well as new customers.”On August 22, ET had reported that Bluestone closed a Rs 900-crore financing round, more than doubling its valuation to $970 million (about Rs 8,100 crore). Investors in this round included Peak XV Partners, Prosus, Steadview Capital, Think Investments, and Infosys cofounder Kris Gopalakrishnan’s family office, Pratithi Investments.","cleaned_content":"jewellery retailer bluestone has recorded a \u003cSIX_TEN_PERCENT\u003e increase in operating revenue for the year ended march \u003cTWO_THOUSAND\u003e according to data sourced from tofler its losses for the full year narrowed by about \u003cONE_TEN_PERCENT\u003e to rs \u003cONE_HUNDRED\u003e crore the bengaluru based company s revenue from operations grew to rs \u003cONE_THOUSAND\u003e crore in fy24 from rs \u003cSEVEN_HUNDRED\u003e crore in fy23 its total revenue for fy24 stood at rs \u003cONE_THOUSAND\u003e crore up from rs \u003cSEVEN_HUNDRED\u003e crore in the previous year however accel backed bluestone s total expense ballooned reaching rs \u003cONE_THOUSAND\u003e crore at the end of march from rs \u003cNINE_HUNDRED\u003e crore a year ago material costs including raw materials accounted for more than \u003cEIGHT_TEN_PERCENT\u003e of the expenses employee benefit costs also increased rising by more than \u003cFIVE_TEN_PERCENT\u003e to rs \u003cONE_HUNDRED\u003e crore in fy24 company has been successful in growing revenue in existing stores during the year which has resulted in improved margins it noted the company thus expects further improvement in its cash flow from operations through increase in revenue from its existing as well as new customers on august \u003cTWO_TEN\u003e et had reported that bluestone closed a rs \u003cNINE_HUNDRED\u003e crore financing round more than doubling its valuation to \u003cNINE_HUNDRED\u003e million about rs \u003cEIGHT_THOUSAND\u003e crore investors in this round included peak xv partners prosus steadview capital think investments and infosys cofounder kris gopalakrishnan s family office pratithi investments","timestamp":"2024-10-09T14:19:00+05:30","market_timestamp":"2024-10-09T14:19:00+05:30","off_market_hours":false}