{"url":"https://economictimes.indiatimes.com/tech/information-tech/ratan-tata-cared-about-making-india-better-tech-execs-pay-tributes/articleshow/114122340.cms","title":"Ratan Tata cared about making India better: Tech execs pay tributes","description":"His remarkable leadership, marked by a unique blend of humility and confidence, guided TCS through transformative global expansions, with a deep sense of service to the communities we operate in and the values we cherish, K Krithivasan, chief executive officer and managing director of TCS said.","content":"Veterans and top businessmen in the technology industry paid tributes and expressed condolences to the astute businessman Ratan Tata, who steered India’s largest IT giant Tata Consultancy Services (TCS) leaving behind a rich legacy.The Tata Sons' chairman emeritus Ratan Tata passed away on Wednesday late night, October 9, at the age of 86.“With deep sorrow, we mourn the passing of Mr. Ratan Naval Tata, an extraordinary individual whose life and legacy will always be a guiding light for Tata Consultancy Services. His wisdom, compassion, and commitment to uplifting the lives of millions, made him revered across the world,” said K Krithivasan, chief executive officer and managing director of TCS.His remarkable leadership, marked by a unique blend of humility and confidence, guided TCS through transformative global expansions, with a deep sense of service to the communities we operate in and the values we cherish, he added.Krithivasan added that Tata “had a rare gift for making those around him feel valued and heard, earning the admiration and respect of all who had the privilege of knowing him. His approach to leadership, paired with his genuine care for people, has left an indelible mark on every one of us. All my colleagues at TCS and I will remain forever inspired by him as we carry forward his vision.”","cleaned_content":"veterans and top businessmen in the technology industry paid tributes and expressed condolences to the astute businessman ratan tata who steered india s largest it giant tata consultancy services tcs leaving behind a rich legacy the tata sons chairman emeritus ratan tata passed away on wednesday late night october \u003cNINE_\u003e at the age of \u003cEIGHT_TEN\u003e with deep sorrow we mourn the passing of mr ratan naval tata an extraordinary individual whose life and legacy will always be a guiding light for tata consultancy services his wisdom compassion and commitment to uplifting the lives of millions made him revered across the world said k krithivasan chief executive officer and managing director of tcs his remarkable leadership marked by a unique blend of humility and confidence guided tcs through transformative global expansions with a deep sense of service to the communities we operate in and the values we cherish he added krithivasan added that tata had a rare gift for making those around him feel valued and heard earning the admiration and respect of all who had the privilege of knowing him his approach to leadership paired with his genuine care for people has left an indelible mark on every one of us all my colleagues at tcs and i will remain forever inspired by him as we carry forward his vision","timestamp":"2024-10-10T19:53:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}