{"url":"https://economictimes.indiatimes.com/tech/technology/us-to-propose-how-google-should-boost-online-search-competition/articleshow/114048786.cms","title":"US to propose how Google should boost online search competition","description":"After a federal court in August ruled Google controls an illegal monopoly in online search, smaller rivals want the court to force Google to spin off its Chrome browser, or at least prohibit it from continuing to pay billions of dollars to make its search engine the default on devices such as Apple's iPhone.","content":"The U.S. Department of Justice is expected to outline on Tuesday what kind of actions Alphabet's Google could be ordered to take to restore competition in online search, potentially including a breakup of the Big Tech company. After a federal court in August ruled Google controls an illegal monopoly in online search, smaller rivals want the court to force Google to spin off its Chrome browser, or at least prohibit it from continuing to pay billions of dollars to make its search engine the default on devices such as Apple's iPhone. The broad DOJ proposals are the next step in a landmark case that has the potential to reshape how Americans find information on the internet after a judge found Google, which processes 90% of U.S. internet searches, had built an illegal monopoly. U.S. District Judge Amit Mehta's ruling in Washington was a major win for antitrust enforcers who have brought an ambitious set of cases against Big Tech companies over the past four years. Google has said it plans to appeal, and that its search engine has won users through its quality. Google said it faces robust competition from Amazon and other sites where users go directly to search for goods or services, and that users can choose other search engines as their default.","cleaned_content":"the u s department of justice is expected to outline on tuesday what kind of actions alphabets google could be ordered to take to restore competition in online search potentially including a breakup of the big tech company after a federal court in august ruled google controls an illegal monopoly in online search smaller rivals want the court to force google to spin off its chrome browser or at least prohibit it from continuing to pay billions of dollars to make its search engine the default on devices such as apples iphone the broad doj proposals are the next step in a landmark case that has the potential to reshape how americans find information on the internet after a judge found google which processes \u003cNINE_TEN_PERCENT\u003e of u s internet searches had built an illegal monopoly u s district judge amit mehtas ruling in washington was a major win for antitrust enforcers who have brought an ambitious set of cases against big tech companies over the past four years google has said it plans to appeal and that its search engine has won users through its quality google said it faces robust competition from amazon and other sites where users go directly to search for goods or services and that users can choose other search engines as their default","timestamp":"2024-10-08T17:34:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}