{"url":"https://economictimes.indiatimes.com/tech/technology/infosys-microsoft-expand-partnership-to-boost-adoption-of-microsoft-cloud-genai/articleshow/114086877.cms","title":"Infosys, Microsoft expand partnership to boost adoption of Microsoft Cloud, GenAI","description":"Infosys and Microsoft have expanded their partnership to focus on generative AI and cloud solutions. Infosys will integrate Microsoft's generative AI tools into its existing solutions to offer clients better cost-efficiency, scalability, and agility.","content":"IT giant Infosys on Wednesday announced expansion of its partnership with Microsoft to help drive global customer adoption of generative AI and Microsoft's cloud platform Azure. Additionally, Infosys will also act as a strategic supplier to support cloud and AI workloads for Microsoft's enterprise customers.  It will infuse Microsoft's generative AI suite of offerings across its Solution IP portfolio to bring unique capabilities to market, helping clients achieve cost-efficiency, scalability, and agility, according to a regulatory filing.  \"Our expanded collaboration with Infosys will transform industries, enhance business operations, elevate employee experiences, and deliver new value for customers. Together, we will harness the power of generative AI to deliver innovative solutions, drive AI adoption and enable unprecedented innovation for customers,\" Nicole Dezen, Chief Partner Officer at Microsoft, said.  The collaboration aims to provide innovative solutions that enhance customer experiences and drive enterprise AI adoption. This includes integrating Microsoft's generative AI offerings with Infosys' existing solutions like Infosys Topaz, Cobalt, and Aster.  The alliance will also work on sharing best practices for Responsible AI. ","cleaned_content":"it giant infosys on wednesday announced expansion of its partnership with microsoft to help drive global customer adoption of generative ai and microsofts cloud platform azure additionally infosys will also act as a strategic supplier to support cloud and ai workloads for microsofts enterprise customers it will infuse microsofts generative ai suite of offerings across its solution ip portfolio to bring unique capabilities to market helping clients achieve cost efficiency scalability and agility according to a regulatory filing our expanded collaboration with infosys will transform industries enhance business operations elevate employee experiences and deliver new value for customers together we will harness the power of generative ai to deliver innovative solutions drive ai adoption and enable unprecedented innovation for customers nicole dezen chief partner officer at microsoft said the collaboration aims to provide innovative solutions that enhance customer experiences and drive enterprise ai adoption this includes integrating microsofts generative ai offerings with infosys existing solutions like infosys topaz cobalt and aster the alliance will also work on sharing best practices for responsible ai","timestamp":"2024-10-09T19:47:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}