{"url":"https://economictimes.indiatimes.com/tech/technology/probe-finds-anodising-plant-fire-likely-source-of-tata-electronics-blaze/articleshow/114056748.cms","title":"Probe finds anodising plant fire likely source of Tata Electronics blaze","description":"The Tamil Nadu state government has concluded that the fire that destroyed the Tata Electronics unit in Hosur was likely caused by a malfunctioning thermostat in the anodising plant. This finding has been shared with Tata Electronics’ executives, and a detailed investigation is ongoing.","content":"The Tamil Nadu government has determined the 'most probable cause' for the fire that engulfed the Tata Electronics unit in Hosur, people aware of the developments told ET. \"The fire broke out in the Anodising plant because of the failure of the thermostat control in one bath,\" one person cited above said. \"The fire spread through the air duct and destroyed the Anodising plant completely. These were the findings of the government probe that have been shared with Tata Electronics executives as well.\" Another person confirmed that prima facie, this is being viewed as the reason for the fire and added that a detailed investigation is underway. Queries sent to Tata Electronics remained unanswered as of press time on Tuesday.  ","cleaned_content":"the tamil nadu government has determined the most probable cause for the fire that engulfed the tata electronics unit in hosur people aware of the developments told et the fire broke out in the anodising plant because of the failure of the thermostat control in one bath one person cited above said the fire spread through the air duct and destroyed the anodising plant completely these were the findings of the government probe that have been shared with tata electronics executives as well another person confirmed that prima facie this is being viewed as the reason for the fire and added that a detailed investigation is underway queries sent to tata electronics remained unanswered as of press time on tuesday","timestamp":"2024-10-09T06:00:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}