{"url":"https://economictimes.indiatimes.com/tech/technology/6-5-billion-sales-in-a-week-party-begins-on-ecommerce-street/articleshow/114133759.cms","title":"Festive sales hit $6.5 billion in a week on ecommerce street: report","description":"Industry insiders said online shoppers–including a large chunk from smaller towns and cities–have been buying products with higher average selling price (ASP) with many opting for EMI payments. Some brands said they are worried about supply issues because the demand is higher than what they expected.","content":"Online marketplaces sold goods worth $6.5 billion, or almost Rs 55,000 crore, in one week of festive sales, marking a 26% increase from last year, with mobile phones, electronics, consumer durables, home and general merchandise accounting for three-fourths of the total sales.Sales in the week starting September 26 made up for about 55% of the total ecommerce sales expected in the festive period this year, ecommerce consultancy Datum Intelligence said.On September 19, ET had reported that ecommerce players and brands selling online are expected to clock $12 billion in gross merchandise value (GMV) this festive season, 23% higher than around $9.7 billion last year. In ecommerce parlance, GMV is the overall sales clocked on an online marketplace. Industry insiders said online shoppers–including a large chunk from smaller towns and cities–have been buying products with higher average selling price (ASP) with many opting for EMI payments. Some brands said they are worried about supply issues because the demand is higher than what they expected.Ecommerce majors Walmart-owned Flipkart and Amazon India started their annual festive season sales–Big BillionDays and Great Indian Festival, respectively–on September 27 with early access for subscribers of their loyalty programmes Amazon Prime and Flipkart Plus from September 26.","cleaned_content":"online marketplaces sold goods worth \u003cSIX_\u003e billion or almost rs \u003cFIVE_TEN_THOUSAND\u003e crore in one week of festive sales marking a \u003cTWO_TEN_PERCENT\u003e increase from last year with mobile phones electronics consumer durables home and general merchandise accounting for three fourths of the total sales sales in the week starting september \u003cTWO_TEN\u003e made up for about \u003cFIVE_TEN_PERCENT\u003e of the total ecommerce sales expected in the festive period this year ecommerce consultancy datum intelligence said on september \u003cONE_TEN\u003e et had reported that ecommerce players and brands selling online are expected to clock \u003cONE_TEN\u003e billion in gross merchandise value gmv this festive season \u003cTWO_TEN_PERCENT\u003e higher than around \u003cNINE_\u003e billion last year in ecommerce parlance gmv is the overall sales clocked on an online marketplace industry insiders said online shoppers including a large chunk from smaller towns and cities have been buying products with higher average selling price asp with many opting for emi payments some brands said they are worried about supply issues because the demand is higher than what they expected ecommerce majors walmart owned flipkart and amazon india started their annual festive season sales big billiondays and great indian festival respectively on september \u003cTWO_TEN\u003e with early access for subscribers of their loyalty programmes amazon prime and flipkart plus from september \u003cTWO_TEN\u003e","timestamp":"2024-10-12T10:45:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}