{"url":"https://economictimes.indiatimes.com/tech/information-tech/cognizant-faces-us-court-verdict-for-discriminatory-practices/articleshow/114046032.cms","title":"Cognizant faces US court verdict for discriminatory practices","description":"Cognizant plans to appeal against the verdict. The case Christy Palmer vs. Cognizant was initially filed in 2017 and addresses plaintiffs’ claims dating back to 2013. The charges have yet to be quantified, and sources close to the company have confirmed them.","content":"In yet another legal battle, a US court has found global IT giant Cognizant Technology Solutions guilty of engaging in discriminatory conduct towards non-Indian workers to prefer H1-B visa holders. The company should pay punitive damages to compensate employees who suffered harm, a US district court has said.The company plans to appeal against the verdict. The case Christy Palmer vs. Cognizant was initially filed in 2017 and addresses plaintiffs’ claims dating back to 2013. The charges have yet to be quantified, and sources close to the company have confirmed them.The case pertains to a complaint filed in 2017 by a Washington, DC-based litigation boutique addressing complaints from 2013 when employees said they were discriminated against non-Indian workers. Bloomberg, first reporting the development, stated that some of the employees said they were terminated after the company put them on the bench.Typically, outsourcing firms put employees “on the bench\" when they are temporarily not working on any project but continue to be on the company's payroll, waiting for next assignment.“Cognizant is disappointed with the verdict and plans to vigorously defend itself and appeal at the appropriate time. We provide equal employment opportunities for all employees and have built a diverse and inclusive workplace that promotes a culture of belonging in which all employees feel valued, are engaged and have the opportunity to develop and succeed. Cognizant does not tolerate discrimination and takes such claims seriously,” Cognizant said in an emailed statement to ET. Cognizant did not share the number of complaints by employees involved.","cleaned_content":"in yet another legal battle a us court has found global it giant cognizant technology solutions guilty of engaging in discriminatory conduct towards non indian workers to prefer h1 b visa holders the company should pay punitive damages to compensate employees who suffered harm a us district court has said the company plans to appeal against the verdict the case christy palmer vs cognizant was initially filed in \u003cTWO_THOUSAND\u003e and addresses plaintiffs claims dating back to \u003cTWO_THOUSAND\u003e the charges have yet to be quantified and sources close to the company have confirmed them the case pertains to a complaint filed in \u003cTWO_THOUSAND\u003e by a washington dc based litigation boutique addressing complaints from \u003cTWO_THOUSAND\u003e when employees said they were discriminated against non indian workers bloomberg first reporting the development stated that some of the employees said they were terminated after the company put them on the bench typically outsourcing firms put employees on the bench when they are temporarily not working on any project but continue to be on the companys payroll waiting for next assignment cognizant is disappointed with the verdict and plans to vigorously defend itself and appeal at the appropriate time we provide equal employment opportunities for all employees and have built a diverse and inclusive workplace that promotes a culture of belonging in which all employees feel valued are engaged and have the opportunity to develop and succeed cognizant does not tolerate discrimination and takes such claims seriously cognizant said in an emailed statement to et cognizant did not share the number of complaints by employees involved","timestamp":"2024-10-08T16:08:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}