{"url":"https://economictimes.indiatimes.com/tech/technology/apple-accused-of-restricting-workers-slack-social-media-use-by-us-labor-board/articleshow/114161948.cms","title":"Apple accused of restricting workers' slack, social media use by US labor board","description":"​​ This is the second time the NLRB has hit Apple with a complaint this month. Last week, the agency accused the company of requiring employees nationwide to sign illegal confidentiality, nondisclosure, and noncompete agreements and of imposing overly broad misconduct and social media policies.","content":"The U.S. National Labor Relations board accused Apple of interfering with workers' rights to collectively advocate for better working conditions by restricting their use of social media and workplace messaging app Slack, the agency said on Friday. The NLRB complaint, issued on Thursday, accuses the iPhone maker of maintaining unlawful work rules around the acceptable uses of Slack, illegally firing an employee who advocated for workplace changes on Slack, requiring another worker to delete a social media post, and creating the impression that employees were being surveilled via social media. This is the second time the NLRB has hit Apple with a complaint this month. Last week, the agency accused the company of requiring employees nationwide to sign illegal confidentiality, nondisclosure, and noncompete agreements and of imposing overly broad misconduct and social media policies. Apple in a statement provided by a spokesperson on Friday said it is committed to maintaining \"a positive and inclusive workplace\" and takes employee complaints seriously. \"We strongly disagree with these claims and will continue to share the facts at the hearing,\" the company said.","cleaned_content":"the u s national labor relations board accused apple of interfering with workers rights to collectively advocate for better working conditions by restricting their use of social media and workplace messaging app slack the agency said on friday the nlrb complaint issued on thursday accuses the iphone maker of maintaining unlawful work rules around the acceptable uses of slack illegally firing an employee who advocated for workplace changes on slack requiring another worker to delete a social media post and creating the impression that employees were being surveilled via social media this is the second time the nlrb has hit apple with a complaint this month last week the agency accused the company of requiring employees nationwide to sign illegal confidentiality nondisclosure and noncompete agreements and of imposing overly broad misconduct and social media policies apple in a statement provided by a spokesperson on friday said it is committed to maintaining a positive and inclusive workplace and takes employee complaints seriously we strongly disagree with these claims and will continue to share the facts at the hearing the company said","timestamp":"2024-10-12T07:20:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}