{"url":"https://economictimes.indiatimes.com/tech/technology/us-lets-starlink-provide-direct-to-cell-coverage-for-hurricane-hit-areas/articleshow/113998351.cms","title":"US lets Starlink provide direct-to-cell coverage for hurricane-hit areas","description":"The U.S. Federal Communications Commission granted emergency approval for SpaceX and T Mobile to use Starlink satellites to restore cellphone coverage in North Carolina after Hurricane Helene. This early deployment supports recovery efforts, emergency alerts, and basic texting as wireless infrastructure is being repaired.","content":"The U.S. Federal Communications Commission on Sunday allowed Elon Musk's SpaceX and T Mobile to enable Starlink satellites with direct-to-cell capability to provide coverage for cellphones in areas of North Carolina hard-hit by Hurricane Helene.  The FCC often grants such emergency temporary approvals during disasters to help restore wireless and internet services in badly impacted areas and to allow for testing.  An FCC spokesperson said on Sunday that the agency remains \"committed to helping with recovery efforts in states affected by Hurricane Helene. We stand ready to do all that is necessary to return connectivity to hard-hit areas and save lives.\" SpaceX said the satellites \"have already been enabled and started broadcasting emergency alerts to cellphones on all networks in North Carolina.\" The company said it may \"test basic texting (SMS) capabilities for most cell phones on the T-Mobile network in North Carolina.\" On Sept. 28, more than 74% of cell towers were out of service in disaster-impacted areas of North Carolina due to the devastation caused by Helene. The FCC said on Sunday that figure has fallen to 17% as crews work to restore service.","cleaned_content":"the u s federal communications commission on sunday allowed elon musks spacex and t mobile to enable starlink satellites with direct to cell capability to provide coverage for cellphones in areas of north carolina hard hit by hurricane helene the fcc often grants such emergency temporary approvals during disasters to help restore wireless and internet services in badly impacted areas and to allow for testing an fcc spokesperson said on sunday that the agency remains committed to helping with recovery efforts in states affected by hurricane helene we stand ready to do all that is necessary to return connectivity to hard hit areas and save lives spacex said the satellites have already been enabled and started broadcasting emergency alerts to cellphones on all networks in north carolina the company said it may test basic texting sms capabilities for most cell phones on the t mobile network in north carolina on sept \u003cTWO_TEN\u003e more than \u003cSEVEN_TEN_PERCENT\u003e of cell towers were out of service in disaster impacted areas of north carolina due to the devastation caused by helene the fcc said on sunday that figure has fallen to \u003cONE_TEN_PERCENT\u003e as crews work to restore service","timestamp":"2024-10-07T08:41:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}