{"url":"https://economictimes.indiatimes.com/tech/technology/ola-electric-slapped-with-show-cause-notice-over-consumer-complaints-and-service-deficiencies/articleshow/114023974.cms","title":"Ola Electric slapped with show cause notice over consumer complaints and service deficiencies","description":"The central government has issued a showc ause notice to Ola Electric for multiple consumer complaints. These complaints involve service delays, misleading ads, and unfair practices. Ola Electric has been asked to respond within 15 days. The company's stock fell nearly 9 per cent today. The company reported a significant net loss despite revenue growth.","content":"The central government has intervened to address consumer complaints about service deficiencies at e-scooter manufacturer Ola Electric. The Central Consumer Protection Authority (CCPA) issued a showcause notice to Ola Electric on October 3, citing potential violations of the Consumer Protection Act, 2019. Ola Electric is being called to respond within 15 days, a business daily reported.The National Consumer Helpline, managed by the Department of Consumer Affairs, has documented 10,644 complaints against Ola e-scooters from September 1, 2023, to August 30, 2024. Of these, 3,389 relate to service delays, 1,899 pertain to delays in the delivery of new vehicles, and 1,459 involve unfulfilled promised services. The showcause notice points to allegations such as manufacturing defects, sales of second-hand vehicles, incomplete refunds on cancellations, recurring issues post-servicing, overcharging, inaccurate billing, and multiple battery and component problems. Moreover, complaints also include accusations of unprofessional behavior and improper complaint resolutions.Nidhi Khare, Secretary of the Department of Consumer Affairs, confirmed the extent of complaints related to Ola Electric. \"The CCPA is looking into a large number of complaints about Ola Electric, mainly related to service inefficiencies. We hope the company addresses these concerns promptly and resolves the issues faced by consumers.\"","cleaned_content":"the central government has intervened to address consumer complaints about service deficiencies at e scooter manufacturer ola electric the central consumer protection authority ccpa issued a showcause notice to ola electric on october \u003cTHREE_\u003e citing potential violations of the consumer protection act \u003cTWO_THOUSAND\u003e ola electric is being called to respond within \u003cONE_TEN\u003e days a business daily reported the national consumer helpline managed by the department of consumer affairs has documented \u003cONE_TEN_THOUSAND\u003e complaints against ola e scooters from september \u003cONE_\u003e \u003cTWO_THOUSAND\u003e to august \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e of these \u003cTHREE_THOUSAND\u003e relate to service delays \u003cONE_THOUSAND\u003e pertain to delays in the delivery of new vehicles and \u003cONE_THOUSAND\u003e involve unfulfilled promised services the showcause notice points to allegations such as manufacturing defects sales of second hand vehicles incomplete refunds on cancellations recurring issues post servicing overcharging inaccurate billing and multiple battery and component problems moreover complaints also include accusations of unprofessional behavior and improper complaint resolutions nidhi khare secretary of the department of consumer affairs confirmed the extent of complaints related to ola electric the ccpa is looking into a large number of complaints about ola electric mainly related to service inefficiencies we hope the company addresses these concerns promptly and resolves the issues faced by consumers","timestamp":"2024-10-07T22:54:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}