{"url":"https://economictimes.indiatimes.com/tech/technology/nglv-ganganyaan-tech-to-help-indias-space-tourism-take-off/articleshow/114005438.cms","title":"NGLV, Ganganyaan tech to help India’s space tourism take off","description":"Explaining Isro’s frugal approach,  S. Sivakumar, project director for NGLV at the Vikram Sarabhai Space Centre (VSSC) said, “All the newer technology for NGLV will be tested in a small-scale vehicle, and all the learnings will be applied to the booster stage to achieve an economical advantage in development.”","content":"Vertical take-off and vertical landing (VTVL), which the Indian Space Research Organisation (Isro) is looking to incorporate into the Next Generation Launch Vehicle (NGLV), will be envisioned and developed through a small-scale vehicle. This rocket will have a spinoff, along with the upcoming Gaganyaan Mission technology, and will be used for an Indian Space Tourism project, said S. Sivakumar, project director for NGLV at the Vikram Sarabhai Space Centre (VSSC)---Isro’s design and development centre.Explaining Isro’s frugal approach, he said, “All the newer technology for NGLV will be tested in a small-scale vehicle, and all the learnings will be applied to the booster stage to achieve an economical advantage in development.” The NGLV director further added that once the tests on the rocket are successful, the number of tests on the booster stage will be limited, thereby reducing costs.“By leveraging all the knowledge we have gained through the crew module of the Gaganyaan Mission, we can use this rocket for an Indian Space Tourism project.” In line with international tourism initiatives such as Virgin Galactic, Blue Origin, and SpaceX, Sivakumar explained that this commercial project can be explored by Indian private industries.The director spoke about space transportation systems for planetary explorations, their present and future, on Sunday during an online session. NGLV will need to have an advanced navigation system along with deployable landing legs, steerable grid fins, and advanced avionics which VSSC is developing, he said.NGLV, a three-stage partially reusable heavy-lift launch vehicle, has been built with a modular architecture. Sivakumar believes that manufacturing will be a key area and a challenging one to penetrate if India wants to crack the reusable market. “We are talking about large-sized tanks and structures that will need to be lifted vertically and transported from one place to another. This is going to be an enormous challenge. Even when it (the rocket) lands on the platform at sea, the barge needs to be strong enough.”","cleaned_content":"vertical take off and vertical landing vtvl which the indian space research organisation isro is looking to incorporate into the next generation launch vehicle nglv will be envisioned and developed through a small scale vehicle this rocket will have a spinoff along with the upcoming gaganyaan mission technology and will be used for an indian space tourism project said s sivakumar project director for nglv at the vikram sarabhai space centre vssc isro s design and development centre explaining isro s frugal approach he said all the newer technology for nglv will be tested in a small scale vehicle and all the learnings will be applied to the booster stage to achieve an economical advantage in development the nglv director further added that once the tests on the rocket are successful the number of tests on the booster stage will be limited thereby reducing costs by leveraging all the knowledge we have gained through the crew module of the gaganyaan mission we can use this rocket for an indian space tourism project in line with international tourism initiatives such as virgin galactic blue origin and spacex sivakumar explained that this commercial project can be explored by indian private industries the director spoke about space transportation systems for planetary explorations their present and future on sunday during an online session nglv will need to have an advanced navigation system along with deployable landing legs steerable grid fins and advanced avionics which vssc is developing he said nglv a three stage partially reusable heavy lift launch vehicle has been built with a modular architecture sivakumar believes that manufacturing will be a key area and a challenging one to penetrate if india wants to crack the reusable market we are talking about large sized tanks and structures that will need to be lifted vertically and transported from one place to another this is going to be an enormous challenge even when it the rocket lands on the platform at sea the barge needs to be strong enough","timestamp":"2024-10-07T12:33:00+05:30","market_timestamp":"2024-10-07T12:33:00+05:30","off_market_hours":false}