{"url":"https://economictimes.indiatimes.com/tech/technology/tinder-parent-match-names-insider-steven-bailey-as-new-cfo/articleshow/114030978.cms","title":"Tinder-parent Match names insider Steven Bailey as new CFO","description":"Steven Bailey will replace incumbent Gary Swidler, who has been in the role for nearly a decade, on March 31. Swidler would, however, continue as the president of Match.","content":"Match Group said on Monday Steven Bailey will take over as its new finance chief early next year, adding that the move underscores the company's focus on driving long-term strategic growth and strong cost discipline. Bailey will replace incumbent Gary Swidler, who has been in the role for nearly a decade, on March 31. Swidler would, however, continue as the president of Match. Bailey joined Match in 2012 and is currently the senior vice president of financial planning and business operations. In its most recent results, Match forecast third-quarter revenue below Wall Street expectations as people dial back spending on dating apps, weighing on user growth. Paying Tinder users declined 8% to 9.6 million in the second quarter, compared with a 9% fall in the prior quarter.","cleaned_content":"match group said on monday steven bailey will take over as its new finance chief early next year adding that the move underscores the companys focus on driving long term strategic growth and strong cost discipline bailey will replace incumbent gary swidler who has been in the role for nearly a decade on march \u003cTHREE_TEN\u003e swidler would however continue as the president of match bailey joined match in \u003cTWO_THOUSAND\u003e and is currently the senior vice president of financial planning and business operations in its most recent results match forecast third quarter revenue below wall street expectations as people dial back spending on dating apps weighing on user growth paying tinder users declined \u003cEIGHT_PERCENT\u003e to \u003cNINE_\u003e million in the second quarter compared with a \u003cNINE_PERCENT\u003e fall in the prior quarter","timestamp":"2024-10-08T09:06:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}