{"url":"https://economictimes.indiatimes.com/tech/technology/a-finger-on-the-pulse-founders-stay-healthy-on-point-via-wearables/articleshow/113988946.cms","title":"ET Startup Awards | A finger on the pulse: founders stay healthy, on point via wearables","description":"Fitness bands are out, replaced by wearables to monitor sleep— not just the quantity but also the quality. For Social Enterprise winner, Aniket Doegar, cofounder \u0026 CEO of Haqdarshak Empowerment Solutions, sleep issues began during Covid when the pandemic brought with it a heightened level of anxiety.","content":"Burning the midnight oil is commonplace when you're looking to build a startup, but sleep-deprived schedules expectedly have founders turning to data and tech for solutions.Fitness bands are out, replaced by wearables to monitor sleep— not just the quantity but also the quality.\"My sleep was not doing well so I thought of putting a tracker on me,\" said Prashant Sachan, founder \u0026 CEO of AppsForBharat, who has been wearing a ring at night for the last four months.\"As a startup founder, if I put a metric somewhere, it would improve that.”For Social Enterprise winner, Aniket Doegar, cofounder \u0026 CEO of Haqdarshak Empowerment Solutions, sleep issues began during Covid when the pandemic brought with it a heightened level of anxiety.","cleaned_content":"burning the midnight oil is commonplace when youre looking to build a startup but sleep deprived schedules expectedly have founders turning to data and tech for solutions fitness bands are out replaced by wearables to monitor sleep not just the quantity but also the quality my sleep was not doing well so i thought of putting a tracker on me said prashant sachan founder ceo of appsforbharat who has been wearing a ring at night for the last four months as a startup founder if i put a metric somewhere it would improve that for social enterprise winner aniket doegar cofounder ceo of haqdarshak empowerment solutions sleep issues began during covid when the pandemic brought with it a heightened level of anxiety","timestamp":"2024-10-07T06:00:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}