{"url":"https://economictimes.indiatimes.com/tech/technology/elon-musks-x-drops-unilever-from-advertiser-boycott-lawsuit/articleshow/114163559.cms","title":"Elon Musk's X drops Unilever from advertiser boycott lawsuit","description":"London-based Unilever - whose products include Dove soaps, Hellmann's condiments and Pepsodent toothpaste - said in a statement it had \"reached an agreement with X, which has committed to meeting our responsibility standards to ensure the safety and performance of our brands on the platform.\"","content":"Elon Musk's X on Friday dropped Unilever from a lawsuit that claimed the consumer goods giant and others conspired with an advertising industry group to boycott the social media platform, causing it to lose revenue. In a filing in federal court in Wichita Falls, Texas, X said it was dismissing its claims against Unilever in the August antitrust lawsuit. London-based Unilever - whose products include Dove soaps, Hellmann's condiments and Pepsodent toothpaste - said in a statement it had \"reached an agreement with X, which has committed to meeting our responsibility standards to ensure the safety and performance of our brands on the platform.\" The company declined to comment on the terms of the settlement. In a statement, X said it had reached an agreement with Unilever and was pleased \"to continue our partnership with them on the platform.\"","cleaned_content":"elon musks x on friday dropped unilever from a lawsuit that claimed the consumer goods giant and others conspired with an advertising industry group to boycott the social media platform causing it to lose revenue in a filing in federal court in wichita falls texas x said it was dismissing its claims against unilever in the august antitrust lawsuit london based unilever whose products include dove soaps hellmanns condiments and pepsodent toothpaste said in a statement it had reached an agreement with x which has committed to meeting our responsibility standards to ensure the safety and performance of our brands on the platform the company declined to comment on the terms of the settlement in a statement x said it had reached an agreement with unilever and was pleased to continue our partnership with them on the platform","timestamp":"2024-10-12T09:42:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}