{"url":"https://economictimes.indiatimes.com/tech/information-tech/cyber-security-firm-artic-wolf-opens-first-india-gcc-in-bengaluru/articleshow/114046696.cms","title":"Cyber security firm Artic Wolf opens first India GCC in Bengaluru","description":"The US-based firm plans to recruit 150 employees by mid-2025, especially in roles related to core R\u0026D areas like threat intelligence and artificial intelligence (AI).","content":"US-based cyber security firm, Arctic Wolf Tuesday announced the launch of its first Indian Global Capability Centre (GCC) in Bengaluru. The US-based firm plans to recruit 150 employees by mid-2025, especially in roles related to core R\u0026D areas like threat intelligence and artificial intelligence (AI).With Bengaluru emerging as a global hub for technology and cybersecurity expertise, the centre will drive innovation and product development, and enhance the company’s security operations platform. With this expansion, the firm stands to benefit from around-the-clock development capabilities and closer proximity to clients in the Asia-Pacific (APAC) region, said the firm in a statement. Dan Schiappa, chief product and services officer, Arctic Wolf, said, “Our mission is to end cyber risk for organizations of all sizes, and the research and development work that will happen out of India will be a major enabler in furthering this goal.\" “By tapping into the highly skilled workforce in Bengaluru, we aim to further accelerate the development of advanced machine learning models and AI-driven cybersecurity detections within our platform,” added Schiappa.By creating numerous job opportunities, the GCC will attract top-tier talent from India’s IT and cybersecurity sectors.","cleaned_content":"us based cyber security firm arctic wolf tuesday announced the launch of its first indian global capability centre gcc in bengaluru the us based firm plans to recruit \u003cONE_HUNDRED\u003e employees by mid \u003cTWO_THOUSAND\u003e especially in roles related to core r d areas like threat intelligence and artificial intelligence ai with bengaluru emerging as a global hub for technology and cybersecurity expertise the centre will drive innovation and product development and enhance the company s security operations platform with this expansion the firm stands to benefit from around the clock development capabilities and closer proximity to clients in the asia pacific apac region said the firm in a statement dan schiappa chief product and services officer arctic wolf said our mission is to end cyber risk for organizations of all sizes and the research and development work that will happen out of india will be a major enabler in furthering this goal by tapping into the highly skilled workforce in bengaluru we aim to further accelerate the development of advanced machine learning models and ai driven cybersecurity detections within our platform added schiappa by creating numerous job opportunities the gcc will attract top tier talent from india s it and cybersecurity sectors","timestamp":"2024-10-08T16:25:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}