{"url":"https://economictimes.indiatimes.com/tech/technology/tsmcs-third-quarter-revenue-easily-beats-market-forecast/articleshow/114069876.cms","title":"TSMC's third-quarter revenue easily beats market forecast","description":"Taiwan Semiconductor Manufacturing Co, whose customers include Apple and Nvidia, has been at the forefront of the march towards AI that has helped it weather the tapering off of pandemic-led demand. Revenue in the July-September period of this year came in at T$759.69 billion ($23.62 billion), according to Reuters calculations, compared with an LSEG SmartEstimate of T$750.36 billion ($23.33 billion) drawn from 23 analysts.","content":"TSMC, the world's largest contract chipmaker, reported on Wednesday third-quarter revenue that easily beat both the market and company's own forecasts as it reaped the benefit from artificial intelligence (AI) demand. Taiwan Semiconductor Manufacturing Co, whose customers include Apple and Nvidia, has been at the forefront of the march towards AI that has helped it weather the tapering off of pandemic-led demand. Revenue in the July-September period of this year came in at T$759.69 billion ($23.62 billion), according to Reuters calculations, compared with an LSEG SmartEstimate of T$750.36 billion ($23.33 billion) drawn from 23 analysts. That represents growth of 36.5% on-year, compared with $17.3 billion in the year-ago period. It is not a direct comparison as TSMC provides monthly revenue data only in Taiwan dollars, but gives quarterly revenue figures and its outlook on its quarterly earnings calls both in U.S. dollars.","cleaned_content":"tsmc the worlds largest contract chipmaker reported on wednesday third quarter revenue that easily beat both the market and companys own forecasts as it reaped the benefit from artificial intelligence ai demand taiwan semiconductor manufacturing co whose customers include apple and nvidia has been at the forefront of the march towards ai that has helped it weather the tapering off of pandemic led demand revenue in the july september period of this year came in at t \u003cSEVEN_HUNDRED\u003e billion \u003cTWO_TEN\u003e billion according to reuters calculations compared with an lseg smartestimate of t \u003cSEVEN_HUNDRED\u003e billion \u003cTWO_TEN\u003e billion drawn from \u003cTWO_TEN\u003e analysts that represents growth of \u003cTHREE_TEN_PERCENT\u003e on year compared with \u003cONE_TEN\u003e billion in the year ago period it is not a direct comparison as tsmc provides monthly revenue data only in taiwan dollars but gives quarterly revenue figures and its outlook on its quarterly earnings calls both in u s dollars","timestamp":"2024-10-09T12:13:00+05:30","market_timestamp":"2024-10-09T12:13:00+05:30","off_market_hours":false}