{"url":"https://economictimes.indiatimes.com/tech/technology/indias-astrosat-and-nasas-space-observatories-capture-dramatic-eruptions-from-stellar-wreckage-around-a-massive-black-hole/articleshow/114128550.cms","title":"India's AstroSat and NASA's Space observatories capture dramatic eruptions from stellar wreckage around a massive black hole","description":"Indian and American astronomers have observed a rare event where a massive black hole is tearing apart a star and using the debris to pummel another star or black hole. This discovery, made using NASA's space observatories and ISRO's AstroSat, provides insights into the connection between two previously separate mysteries.","content":"India's AstroSat and the National Aeronautics and Space Administration (NASA)'s Space observatories have captured dramatic eruptions from stellar wreckage around a massive black hole, the Indian Space Research Organisation (Isro) said in a statement on Thursday. It provides astronomers with valuable insights, linking two mysteries where there had previously only been hints of a connection.A massive black hole has torn apart one star and is now using that stellar wreckage to pummel another star or smaller black hole that used to be in the clear. This discovery was made using NASA's space observatories—Chandra, HST, NICER, Swift—and Isro's AstroSat.In 2019, astronomers witnessed the signal of a star that got too close to a black hole and was destroyed by the black hole’s gravitational forces. Once shredded, the star’s remains began circling the black hole in a disk in a type of stellar graveyard.Over a few years, however, this disk has expanded outward and is now directly in the path of a star, or possibly a stellar mass black hole, orbiting the massive black hole at a previously safe distance. The orbiting star is now repeatedly crashing through the debris disk, about once every 48 hours, as it circles. When it does, the collision causes bursts of X-rays that astronomers captured with Chandra, Isro said.“Imagine a diver repeatedly going into a pool and creating a splash every time she enters the water,” said Matt Nicholl of Queen's University Belfast, United Kingdom, the lead author of the study that appears in the current issue of Nature. The paper describing these results was published by Nature in the October 9 issue of the journal.","cleaned_content":"indias astrosat and the national aeronautics and space administration nasa s space observatories have captured dramatic eruptions from stellar wreckage around a massive black hole the indian space research organisation isro said in a statement on thursday it provides astronomers with valuable insights linking two mysteries where there had previously only been hints of a connection a massive black hole has torn apart one star and is now using that stellar wreckage to pummel another star or smaller black hole that used to be in the clear this discovery was made using nasas space observatories chandra hst nicer swift and isros astrosat in \u003cTWO_THOUSAND\u003e astronomers witnessed the signal of a star that got too close to a black hole and was destroyed by the black hole s gravitational forces once shredded the star s remains began circling the black hole in a disk in a type of stellar graveyard over a few years however this disk has expanded outward and is now directly in the path of a star or possibly a stellar mass black hole orbiting the massive black hole at a previously safe distance the orbiting star is now repeatedly crashing through the debris disk about once every \u003cFOUR_TEN\u003e hours as it circles when it does the collision causes bursts of x rays that astronomers captured with chandra isro said imagine a diver repeatedly going into a pool and creating a splash every time she enters the water said matt nicholl of queens university belfast united kingdom the lead author of the study that appears in the current issue of nature the paper describing these results was published by nature in the october \u003cNINE_\u003e issue of the journal","timestamp":"2024-10-10T23:20:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}