{"url":"https://www.livemint.com/market/stock-market-news/iti-shares-surge-over-8-on-rs-300-crore-solar-street-light-systems-order-in-bihar-11725950742620.html","title":"ITI shares surge over 8% on  ₹300-crore solar street light systems order in Bihar","description":"Shares of ITI Limited rose over 8% after the company secured a  ₹300 crore order for 1,00,000 solar streetlight systems in Bihar. This order highlights ITI's commitment to renewable energy and sustainable infrastructure development.","content":"Shares of ITI Limited jumped over 8 percent in intra-day trading on Tuesday, September 10, following the company's announcement that it had secured a significant order worth  ₹300 crore for the supply and installation of solar streetlight systems in Bihar. This order is part of the ongoing efforts by the Bihar Renewable Energy Development Authority (BREDA) to enhance rural infrastructure using renewable energy.ITI Limited, a leading telecom manufacturing company and the country’s first PSU post-independence, confirmed that BREDA had awarded it the contract to supply and install 1,00,000 solar streetlight systems. This order adds to the 80,000 solar streetlights ITI is already delivering in Bihar under BREDA’s projects.The stock jumped as much as 8.4 percent, reaching an intra-day high of  ₹306.75, approaching its peak of  ₹384.35 recorded in January this year. ITI shares have climbed over 146 percent from their 52-week low of  ₹124.50 in September last year and have risen 127 percent in the past year. Despite this impressive growth, the stock has seen a relatively modest increase of just about 1 percent in 2024 year-to-date (YTD).According to ITI Limited, the solar streetlight systems will be installed in districts including Gopalganj, Siwan, Samastipur, Purnia, Araria, Gaya, Darbhanga, Patna, Katihar, and Khagaria. These systems, manufactured at ITI's Naini Plant, which has been producing solar panels for six years, include essential components such as Solar PV Modules, Solar Batteries, LED Luminaries, and Mounting Structures. BREDA will oversee the installations to ensure they meet the project’s quality and sustainability standards.Rajesh Rai, Chairman and Managing Director of ITI Limited, expressed his delight at continuing the collaboration with the Government of Bihar for solar streetlight systems.“With this additional order, we have established ITI as a reliable solar systems provider striving for a greener tomorrow,” Rai remarked, highlighting the company’s growing reputation in the renewable energy sector.Additionally, ITI recently secured its first order for Electronic Voting Machines (EVMs) from the State Election Commission of West Bengal, marking another milestone in the expansion of its company's product portfolio.ITI's diversification into renewable energy and electronic systems, alongside its telecom expertise, positions the company to capitalise on future growth opportunities in both public and private sectors.","cleaned_content":"shares of iti limited jumped over \u003cEIGHT_PERCENT\u003e in intra day trading on tuesday september \u003cONE_TEN\u003e following the companys announcement that it had secured a significant order worth \u003cTHREE_HUNDRED\u003e crore for the supply and installation of solar streetlight systems in bihar this order is part of the ongoing efforts by the bihar renewable energy development authority breda to enhance rural infrastructure using renewable energy iti limited a leading telecom manufacturing company and the country s first psu post independence confirmed that breda had awarded it the contract to supply and install \u003cONE_HUNDRED_THOUSAND\u003e solar streetlight systems this order adds to the \u003cEIGHT_TEN_THOUSAND\u003e solar streetlights iti is already delivering in bihar under breda s projects the stock jumped as much as \u003cEIGHT_PERCENT\u003e reaching an intra day high of \u003cTHREE_HUNDRED\u003e approaching its peak of \u003cTHREE_HUNDRED\u003e recorded in january this year iti shares have climbed over \u003cONE_HUNDRED_PERCENT\u003e from their \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e in september last year and have risen \u003cONE_HUNDRED_PERCENT\u003e in the past year despite this impressive growth the stock has seen a relatively modest increase of just about \u003cONE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e year to date ytd according to iti limited the solar streetlight systems will be installed in districts including gopalganj siwan samastipur purnia araria gaya darbhanga patna katihar and khagaria these systems manufactured at itis naini plant which has been producing solar panels for six years include essential components such as solar pv modules solar batteries led luminaries and mounting structures breda will oversee the installations to ensure they meet the project s quality and sustainability standards rajesh rai chairman and managing director of iti limited expressed his delight at continuing the collaboration with the government of bihar for solar streetlight systems with this additional order we have established iti as a reliable solar systems provider striving for a greener tomorrow rai remarked highlighting the company s growing reputation in the renewable energy sector additionally iti recently secured its first order for electronic voting machines evms from the state election commission of west bengal marking another milestone in the expansion of its companys product portfolio itis diversification into renewable energy and electronic systems alongside its telecom expertise positions the company to capitalise on future growth opportunities in both public and private sectors","timestamp":"2024-09-10T13:45:00+05:30","market_timestamp":"2024-09-10T13:45:00+05:30","off_market_hours":false}