{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-ends-above-25-000-sensex-nears-82-000-it-stocks-lead-gains-11725962571704.html","title":"Stock market today: Nifty 50 closes above 25,000, Sensex nears 82,000; IT stocks drive rally","description":"Nifty 50 ended the session with a gain of 0.42 percent, closing above the 25,000 mark at 25,041 points. Similarly, the S\u0026P BSE Sensex also closed higher, with a surge of 0.43 percent, reaching 81,912 points.","content":"The Indian stock market extended its gains for the second consecutive trading session on Tuesday, buoyed by a rally on Wall Street overnight amid hopes of a potential Fed rate cut next week.IT and pharma stocks led the surge, with the Nifty IT stocks rising 5 percent, fueled by optimism over rate cut and a positive outlook from domestic brokerage firm Motilal Oswal.Mid-cap and small-cap indices outperformed the benchmark, with the Nifty 50 gaining 0.42 percent, to close above the 25,000 mark at 25,041 points.Of the 50 stocks, 33 closed in positive territory, with Divi's Laboratories, LTIMindtree, Bharti Airtel, Wipro, and HCL Technologies all rising between 2 percent and 5 percent.Similarly, the S\u0026P BSE Sensex also closed higher, with a surge of 0.43 percent, reaching 81,912 points.The Nifty Midcap 100 index closed up 1.19 percent at 59,039 points. Renewable energy stocks SJVN and Suzlon Energy were among the top gainers, with SJVN increasing by 5.9 percent and Suzlon Energy rising by 5 percent. Coforge and Zee Entertainment Enterprises gained 5 percent and 4.4 percent, respectively.Similarly, the Nifty Smallcap 100 index rose 1.15 percent, led by a 6.5 percent increase in Piramal Pharma. Other top performers included Himadri Speciality Chemicals, ITI, Firstsource Solutions, and Century Textiles \u0026 Industries, which all gained over 5 percent.The Nifty IT index posted its largest intraday gain of September, closing up 1.73 percent at 42,664 points. All 10 stocks in the index closed in positive territory, supported by expectations of a US Federal Reserve rate cut and increased technology spending in the US.Foreign Portfolio Investors (FPIs) have increased their investments in IT stocks in anticipation of a possible Federal Reserve rate cut this month. In July, they poured  ₹117.63 billion ($1.40 billion) into IT stocks—the highest since the new sectoral classification in 2022. In August, FPIs purchased IT shares worth  ₹40.36 billion, alongside  ₹51.99 billion in healthcare stocks.Driven by these FPI inflows, the IT index gained 4.7 percent in August.Pharmaceutical stocks also contributed to the market's strength. The Nifty Pharma index ended today’s session 1.08 percent higher, at 23,256 points, with 14 out of 20 stocks in positive territory.Divi's Laboratories, Granules India, and Laurus Labs led the gains, up 4.9 percent, 4.1 percent, and 3.21 percent, respectively.The US House of Representatives' passage of the Biosecure Act, aimed at reducing US biopharmaceutical dependence on China, has provided a tailwind to Indian pharma stocks. This legislation bans collaborations with five major Chinese firms, likely benefitting Indian pharma companies as US firms look to shift their manufacturing away from China. Contract development and manufacturing players in India, such as Divi's Labs and Laurus Labs, are anticipated to see increased demand.Shares of snack companies like Bikaji Foods International, Gopal Snacks and Prataap Snacks rallied up to 10 percent on Tuesday following the 54th GST Council's decision to reduce Goods and Services Tax (GST) on extruded namkeen snacks from 18 percent to 12 percent.Bikaji Foods saw a 7.76 percent jump, Gopal Snacks surged 10 percent, and Prataap Snacks shares rose 8.05 per cent.“Nifty remained volatile throughout the day, unable to sustain levels above 25,100. The RSI remained in a bearish crossover on the daily timeframe, indicating continued weakness. Sentiment is expected to stay weak in the near term unless Nifty manages a close above 25,100. On the lower side, support is seen at 24900; if breached, the index may decline further towards 24750, said Rupak De,” Senior Technical Analyst at LKP Securities.","cleaned_content":"the indian stock market extended its gains for the second consecutive trading session on tuesday buoyed by a rally on wall street overnight amid hopes of a potential fed rate cut next week it and pharma stocks led the surge with the nifty it stocks rising \u003cFIVE_PERCENT\u003e fueled by optimism over rate cut and a positive outlook from domestic brokerage firm motilal oswal mid cap and small cap indices outperformed the benchmark with the nifty \u003cFIVE_TEN\u003e gaining \u003cZERO_PERCENT\u003e to close above the \u003cTWO_TEN_THOUSAND\u003e mark at \u003cTWO_TEN_THOUSAND\u003e points of the \u003cFIVE_TEN\u003e stocks \u003cTHREE_TEN\u003e closed in positive territory with divis laboratories ltimindtree bharti airtel wipro and hcl technologies all rising between \u003cTWO_PERCENT\u003e and \u003cFIVE_PERCENT\u003e similarly the s p bse sensex also closed higher with a surge of \u003cZERO_PERCENT\u003e reaching \u003cEIGHT_TEN_THOUSAND\u003e points the nifty midcap \u003cONE_HUNDRED\u003e index closed up \u003cONE_PERCENT\u003e at \u003cFIVE_TEN_THOUSAND\u003e points renewable energy stocks sjvn and suzlon energy were among the top gainers with sjvn increasing by \u003cFIVE_PERCENT\u003e and suzlon energy rising by \u003cFIVE_PERCENT\u003e coforge and zee entertainment enterprises gained \u003cFIVE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e respectively similarly the nifty smallcap \u003cONE_HUNDRED\u003e index rose \u003cONE_PERCENT\u003e led by a \u003cSIX_PERCENT\u003e increase in piramal pharma other top performers included himadri speciality chemicals iti firstsource solutions and century textiles industries which all gained over \u003cFIVE_PERCENT\u003e the nifty it index posted its largest intraday gain of september closing up \u003cONE_PERCENT\u003e at \u003cFOUR_TEN_THOUSAND\u003e points all \u003cONE_TEN\u003e stocks in the index closed in positive territory supported by expectations of a us federal reserve rate cut and increased technology spending in the us foreign portfolio investors fpis have increased their investments in it stocks in anticipation of a possible federal reserve rate cut this month in july they poured \u003cONE_HUNDRED\u003e billion \u003cONE_\u003e billion into it stocks the highest since the new sectoral classification in \u003cTWO_THOUSAND\u003e in august fpis purchased it shares worth \u003cFOUR_TEN\u003e billion alongside \u003cFIVE_TEN\u003e billion in healthcare stocks driven by these fpi inflows the it index gained \u003cFOUR_PERCENT\u003e in august pharmaceutical stocks also contributed to the markets strength the nifty pharma index ended today s session \u003cONE_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e points with \u003cONE_TEN\u003e out of \u003cTWO_TEN\u003e stocks in positive territory divis laboratories granules india and laurus labs led the gains up \u003cFOUR_PERCENT\u003e \u003cFOUR_PERCENT\u003e and \u003cTHREE_PERCENT\u003e respectively the us house of representatives passage of the biosecure act aimed at reducing us biopharmaceutical dependence on china has provided a tailwind to indian pharma stocks this legislation bans collaborations with five major chinese firms likely benefitting indian pharma companies as us firms look to shift their manufacturing away from china contract development and manufacturing players in india such as divis labs and laurus labs are anticipated to see increased demand shares of snack companies like bikaji foods international gopal snacks and prataap snacks rallied up to \u003cONE_TEN_PERCENT\u003e on tuesday following the \u003cFIVE_TEN\u003e th gst councils decision to reduce goods and services tax gst on extruded namkeen snacks from \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e bikaji foods saw a \u003cSEVEN_PERCENT\u003e jump gopal snacks surged \u003cONE_TEN_PERCENT\u003e and prataap snacks shares rose \u003cEIGHT_PERCENT\u003e nifty remained volatile throughout the day unable to sustain levels above \u003cTWO_TEN_THOUSAND\u003e the rsi remained in a bearish crossover on the daily timeframe indicating continued weakness sentiment is expected to stay weak in the near term unless nifty manages a close above \u003cTWO_TEN_THOUSAND\u003e on the lower side support is seen at \u003cTWO_TEN_THOUSAND\u003e if breached the index may decline further towards \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst at lkp securities","timestamp":"2024-09-10T15:41:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}