{"url":"https://www.livemint.com/market/stock-market-news/paytm-share-price-rallies-over-8-jumps-120-in-four-months-more-steam-left-11725941858180.html","title":"Paytm share price rallies over 8%; jumps 120% in four months. More steam left?","description":"Paytm share price has gained more than 13% in one week and over 33% in one month. In the past three months, Paytm stock price has jumped more than 74%.","content":"Paytm share price extended rally for the second day in a row, climbing over 8% on Tuesday amid heavy buying. Paytm shares rallied as much as 8.23% to  ₹679.70 apiece on the BSE.Shares of One 97 Communications, the parent company of fintech giant Paytm, has been on upward momentum. Paytm share price has gained more than 13% in one week and over 33% in one month. In the past three months, Paytm stock price has jumped more than 74%.Moreover, Paytm share price is now up nearly 120% from its 52-week low of  ₹310 apiece hit on May 9, 2024.On August 28, Paytm announced that it received approval from the Ministry of Finance to invest in its payment services business.With this approval in place, Paytm Payments Services Ltd (PPSL) will proceed to resubmit its payment aggregator application. In the meantime, PPSL will continue to provide online payment aggregation services to existing partners, Paytm said in a regulatory filing.Paytm shares are still looking strong on the technical chart, analysts said.“However, in the near term, it may face hurdles in the  ₹710 to  ₹730 zones. On breaching this resistance, Paytm’s share price may touch  ₹800 apiece. So, those who have a medium-term perspective can hold the scrip for the  ₹800 target, maintaining a stop loss below the previous day's close and maintaining buy-on-dips on every big dip in the Paytm shares,” said Ganesh Dongre, Senior Manager — Senior Manager at Anand Rathi.At 10:00 am, Paytm shares were trading 7.95% higher at  ₹677.90 apiece on the BSE.","cleaned_content":"paytm share price extended rally for the second day in a row climbing over \u003cEIGHT_PERCENT\u003e on tuesday amid heavy buying paytm shares rallied as much as \u003cEIGHT_PERCENT\u003e to \u003cSIX_HUNDRED\u003e apiece on the bse shares of one \u003cNINE_TEN\u003e communications the parent company of fintech giant paytm has been on upward momentum paytm share price has gained more than \u003cONE_TEN_PERCENT\u003e in one week and over \u003cTHREE_TEN_PERCENT\u003e in one month in the past three months paytm stock price has jumped more than \u003cSEVEN_TEN_PERCENT\u003e moreover paytm share price is now up nearly \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTHREE_HUNDRED\u003e apiece hit on may \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e on august \u003cTWO_TEN\u003e paytm announced that it received approval from the ministry of finance to invest in its payment services business with this approval in place paytm payments services ltd ppsl will proceed to resubmit its payment aggregator application in the meantime ppsl will continue to provide online payment aggregation services to existing partners paytm said in a regulatory filing paytm shares are still looking strong on the technical chart analysts said however in the near term it may face hurdles in the \u003cSEVEN_HUNDRED\u003e to \u003cSEVEN_HUNDRED\u003e zones on breaching this resistance paytm s share price may touch \u003cEIGHT_HUNDRED\u003e apiece so those who have a medium term perspective can hold the scrip for the \u003cEIGHT_HUNDRED\u003e target maintaining a stop loss below the previous days close and maintaining buy on dips on every big dip in the paytm shares said ganesh dongre senior manager senior manager at anand rathi at \u003cONE_TEN\u003e \u003cZERO_\u003e am paytm shares were trading \u003cSEVEN_PERCENT\u003e higher at \u003cSIX_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-10T10:04:00+05:30","market_timestamp":"2024-09-10T10:04:00+05:30","off_market_hours":false}