{"url":"https://www.livemint.com/market/stock-market-news/hg-infra-engineering-share-price-rises-5-5-on-rs-780-crore-order-stock-remains-pick-of-the-week-for-axis-securities-11725941969532.html","title":"H.G. Infra Engineering share price rises 5.5% on  ₹780 crore order. 4 key reasons why Axis Sec expects 8% more upside","description":"Stock Market Today: H.G. Infra Engineering share price gained 5.5% in the morning trades on Tuesday. The company announced receipt of  ₹780 crore order. Stock remains pick of the week for Axis Securities","content":"Stock Market Today: H.G. Infra Engineering Ltd share price gained 5.5% in the morning trades on Tuesday. The company announced receipt of  ₹780 crore order.H.G. Infra Engineering Ltd share price opened at  ₹1526.40 on the BSE on Tuesday, around 4% higher than previous close of  ₹1461.50. H.G. Infra Engineering share price thereafter gained further to intraday highs of  ₹1542 , marking gains of around 5.5%.H.G. Infra Engineering Limited announced having received the letter of award from the Ministry of Road Transport \u0026 Highways (MoRTH) for up-gradation of existing 6 lane road project including elevated corridor as per site requirements from km 0/00 to km 10/170 Mode of NH 47 (Narol Junction to Sarkhej Junction) in the State of Gujarat on Hybrid Annuity Mode.The bid project cost stands at  ₹781.11 crore while the project construction period is 2.5 Years.The Stock also remains pick of the week for Axis Securities. Axis Securities has given a target price of  ₹1645 for H.G. Infra Engineering share price indicating gains of more than 8% for the stock.1.The Healthy order book that as of 30th June’24, that stood at  ₹15,642 Crore, is equivalent to 3 times the FY24 revenue as per Axis Securities.2.Diversifying its portfolio. H.G. Infra Engineering Limited is exploring new horizons and the company is expanding its portfolio by exploring opportunities beyond road and railway projects. In March’24, it secured its first solar project worth  ₹1,307 Crore in Rajasthan from JDVVN (Jodhpur Vidhyut Vitran Nigam Limited).3. Strong order inflow expectations- H.G. Infra Engineering is expecting an order inflow of  ₹10,000-12,000 Crore along with segment diversification as per Axis Securities. It anticipates  ₹8,000 Cr from highway projects,  ₹2,000 Croe from railway projects, and ~ ₹1,000 Crore from solar and water projects to be added in FY254. Good Outlook \u0026 attractive Valuations: Axis Securities estimates H.G. Infra Engineering to post healthy revenue, Earnings before interest tax depreciation and amortisation and net profit growth of 16%, 14%, and 19% CAGR (compound annual growth rate), respectively, over FY24-26 .","cleaned_content":"stock market today h g infra engineering ltd share price gained \u003cFIVE_PERCENT\u003e in the morning trades on tuesday the company announced receipt of \u003cSEVEN_HUNDRED\u003e crore order h g infra engineering ltd share price opened at \u003cONE_THOUSAND\u003e on the bse on tuesday around \u003cFOUR_PERCENT\u003e higher than previous close of \u003cONE_THOUSAND\u003e h g infra engineering share price thereafter gained further to intraday highs of \u003cONE_THOUSAND\u003e marking gains of around \u003cFIVE_PERCENT\u003e h g infra engineering limited announced having received the letter of award from the ministry of road transport highways morth for up gradation of existing \u003cSIX_\u003e lane road project including elevated corridor as per site requirements from km \u003cZERO_\u003e \u003cZERO_\u003e to km \u003cONE_TEN\u003e \u003cONE_HUNDRED\u003e mode of nh \u003cFOUR_TEN\u003e narol junction to sarkhej junction in the state of gujarat on hybrid annuity mode the bid project cost stands at \u003cSEVEN_HUNDRED\u003e crore while the project construction period is \u003cTWO_\u003e years the stock also remains pick of the week for axis securities axis securities has given a target price of \u003cONE_THOUSAND\u003e for h g infra engineering share price indicating gains of more than \u003cEIGHT_PERCENT\u003e for the stock 1 the healthy order book that as of \u003cTHREE_TEN\u003e th june \u003cTWO_TEN\u003e that stood at \u003cONE_TEN_THOUSAND\u003e crore is equivalent to \u003cTHREE_\u003e times the fy24 revenue as per axis securities 2 diversifying its portfolio h g infra engineering limited is exploring new horizons and the company is expanding its portfolio by exploring opportunities beyond road and railway projects in march \u003cTWO_TEN\u003e it secured its first solar project worth \u003cONE_THOUSAND\u003e crore in rajasthan from jdvvn jodhpur vidhyut vitran nigam limited 3 strong order inflow expectations h g infra engineering is expecting an order inflow of \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e crore along with segment diversification as per axis securities it anticipates \u003cEIGHT_THOUSAND\u003e cr from highway projects \u003cTWO_THOUSAND\u003e croe from railway projects and \u003cONE_THOUSAND\u003e crore from solar and water projects to be added in fy254 good outlook attractive valuations axis securities estimates h g infra engineering to post healthy revenue earnings before interest tax depreciation and amortisation and net profit growth of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e cagr compound annual growth rate respectively over fy24 \u003cTWO_TEN\u003e","timestamp":"2024-09-10T10:04:00+05:30","market_timestamp":"2024-09-10T10:04:00+05:30","off_market_hours":false}