{"url":"https://www.livemint.com/market/stock-market-news/sarveshwar-foods-surges-10-up-37-in-4-days-whats-fueling-the-rally-in-this-penny-stock-11725952274082.html","title":"Sarveshwar Foods stock soars another 10%, up 37% in 4 days: What’s fueling this penny stock?","description":"The recent rally in Sarveshwar Foods stock is attributed to the company's announcement of new strategic partnerships with non-banking financial companies (NBFCs). This move is designed to enhance financial support for farmers, who are a crucial part of the company’s supply chain.","content":"Extending their bullish trend for the fourth consecutive trading session, shares of Sarveshwar Foods, an emerging player in the agri-food sector based in Jammu, surged another 10 percent in today's intra-day trade, reaching  ₹11.70 per share.This latest increase has propelled the stock to a cumulative gain of 37 percent over the past four sessions and a remarkable 114 percent year-to-date. The company processes and markets branded, and unbranded basmati and non-basmati rice in the domestic and international markets, with operations based out of Jammu.The recent rally in Sarveshwar Foods' stock is attributed to the company's announcement of new strategic partnerships with non-banking financial companies (NBFCs). This move is designed to enhance financial support for farmers, who are a crucial part of the company’s supply chain.These collaborations aim to provide essential financial resources, allowing farmers to invest in modern agricultural practices and infrastructure. By connecting NBFCs with farmers, Sarveshwar Foods seeks to strengthen the agricultural ecosystem and ensure a stable and growing supply chain.Under the new arrangement, Sarveshwar Foods will act as an intermediary, facilitating connections between NBFCs and farmers. The financing will be handled directly between the NBFCs and the farmers, with no financial obligation falling on Sarveshwar Foods.“These partnerships would be a vital part of Sarveshwar Foods Limited’s long-term strategy to strengthen its supply chain and ensure continuous and uninterrupted supplies. We are driven by the belief that the growth and well-being of all associated with Sarveshwar—including farmers, partners, and the broader community—are integral to our mission,” the company said in its Monday filing.Sarveshwar Foods reported revenue from operations of  ₹233.05 crore in Q1 FY25, marking a 24 percent year-on-year growth compared to  ₹187.68 crore in the same period last year. This growth was driven by an increased supply of rice and the expansion under the Bharat Rice Scheme by the Government of India.Additionally, the company secured a major export order worth approximately USD 6 million through NAFED during the quarter. Its EBITDA rose to  ₹13.31 crore, up from  ₹11.10 crore in Q1 FY24. Net profit improved by 6 percent, reaching  ₹3.09 crore, compared to  ₹2.90 crore in the same period last year.During the quarter, the company was awarded a prestigious contract by the Shri Mata Vaishno Devi Shrine Board in Jammu and Kashmir to supply premium steamed basmati rice to the renowned pilgrimage destination.The company also completed the acquisition of 100 percent of Green Point Pte Ltd, a wholesaler of groceries such as cereals, sugar, edible oils, sauces, and dairy products. This acquisition is expected to boost Sarveshwar's business and expand its international presence.","cleaned_content":"extending their bullish trend for the fourth consecutive trading session shares of sarveshwar foods an emerging player in the agri food sector based in jammu surged another \u003cONE_TEN_PERCENT\u003e in todays intra day trade reaching \u003cONE_TEN\u003e per share this latest increase has propelled the stock to a cumulative gain of \u003cTHREE_TEN_PERCENT\u003e over the past four sessions and a remarkable \u003cONE_HUNDRED_PERCENT\u003e year to date the company processes and markets branded and unbranded basmati and non basmati rice in the domestic and international markets with operations based out of jammu the recent rally in sarveshwar foods stock is attributed to the companys announcement of new strategic partnerships with non banking financial companies nbfcs this move is designed to enhance financial support for farmers who are a crucial part of the company s supply chain these collaborations aim to provide essential financial resources allowing farmers to invest in modern agricultural practices and infrastructure by connecting nbfcs with farmers sarveshwar foods seeks to strengthen the agricultural ecosystem and ensure a stable and growing supply chain under the new arrangement sarveshwar foods will act as an intermediary facilitating connections between nbfcs and farmers the financing will be handled directly between the nbfcs and the farmers with no financial obligation falling on sarveshwar foods these partnerships would be a vital part of sarveshwar foods limited s long term strategy to strengthen its supply chain and ensure continuous and uninterrupted supplies we are driven by the belief that the growth and well being of all associated with sarveshwar including farmers partners and the broader community are integral to our mission the company said in its monday filing sarveshwar foods reported revenue from operations of \u003cTWO_HUNDRED\u003e crore in q1 fy25 marking a \u003cTWO_TEN_PERCENT\u003e year on year growth compared to \u003cONE_HUNDRED\u003e crore in the same period last year this growth was driven by an increased supply of rice and the expansion under the bharat rice scheme by the government of india additionally the company secured a major export order worth approximately usd \u003cSIX_\u003e million through nafed during the quarter its ebitda rose to \u003cONE_TEN\u003e crore up from \u003cONE_TEN\u003e crore in q1 fy24 net profit improved by \u003cSIX_PERCENT\u003e reaching \u003cTHREE_\u003e crore compared to \u003cTWO_\u003e crore in the same period last year during the quarter the company was awarded a prestigious contract by the shri mata vaishno devi shrine board in jammu and kashmir to supply premium steamed basmati rice to the renowned pilgrimage destination the company also completed the acquisition of \u003cONE_HUNDRED_PERCENT\u003e of green point pte ltd a wholesaler of groceries such as cereals sugar edible oils sauces and dairy products this acquisition is expected to boost sarveshwars business and expand its international presence","timestamp":"2024-09-10T13:20:00+05:30","market_timestamp":"2024-09-10T13:20:00+05:30","off_market_hours":false}