{"url":"https://www.livemint.com/market/stock-market-news/it-services-sector-poised-for-recovery-mosl-report-highlights-key-drivers-and-top-stock-picks-11725953422004.html","title":"IT Services sector poised for recovery: MOSL report highlights key drivers and top stock picks","description":"A report by MOSL indicates the IT services sector may recover soon, with HCL Technologies, LTIMindtree, and Persistent Systems leading. Key recovery factors include U.S. interest rates and work division, with healthcare, manufacturing, and BFSI expected to drive growth as spending resurges.","content":"A Motilal Oswal Financial Services (MOSL) report has emphasized that the IT services sector may be on the verge of recovery following an extended period of cuts in discretionary spending. The report outlines a positive outlook for the next two to four years, signalling the end of a challenging phase and the beginning of sustained growth in smaller deals and business flow.With a recovery in focus, MOSL's top stock picks in the IT space include HCL Technologies, LTIMindtree, and Persistent Systems. HCL Technologies is expected to lead large-cap revenue growth over the next three years due to its resilient portfolio and strong engineering services. LTIMindtree’s best-in-class data and ERP modernization offerings are projected to drive its recovery, particularly with renewed discretionary spending by U.S. banks.Meanwhile, Persistent Systems is identified as the fastest-growing IT services company within MOSL's coverage, thanks to its strong product engineering background and its positioning to capitalize on long-term GenAI investments, the brokerage said.The report also upgraded Coforge to a BUY rating, with a target price of  ₹8,100, reflecting a 25 per cent upside. MOSL believes Coforge can capitalize on synergies with Cigniti, and its robust executable order book is expected to strengthen its core business further.As the sector begins its recovery, these companies are well-positioned to benefit from the resurgence in client spending, supported by their strong portfolios and strategic growth initiatives, noted the brokerage.Motilal Oswal Financial Services (MOSL) highlighted three key factors that will shape the recovery trajectory of the IT services sector, influencing client-spending behaviour and determining the pace of growth:US Interest Rate Regime: A potential reduction in US interest rates could accelerate recovery in sectors like capital markets and mortgage originations within the Banking, Financial Services, and Insurance (BFSI) industry. Lower interest rates would ease the burden on capital-intensive industries, enabling them to allocate more funds toward technology investments.Work Division Between GCCs and Service Integrators: The recovery path will also depend on how work is distributed between Global Capability Centers (GCCs) and service integrators. Verticals with mature GCC operations may experience a more gradual recovery, while industries with emerging GCC capabilities might see faster growth by leveraging service integrators for expertise and scaling.Inflection Point for \"Moonshot\" or \"Low-ROI\" Investments: Companies primarily focus on short-term, high-return projects, resulting in technological debt. The sector’s recovery will hinge on when industries reach a point where further delays in \"moonshot\" or long-term investments are unsustainable.Based on these factors, MOSL identifies healthcare, manufacturing, and BFSI as the key verticals poised to lead the recovery of the IT services sector.MOSL introduced the IMPACT Evaluation Framework to identify stocks well-positioned to benefit from both short-term and long-term trends in generative AI (GenAI) and other emerging technologies. The framework examines companies through various critical factors, providing a comprehensive view of their readiness for growth and ability to capitalize on technological advancements.One of the core elements of the framework is industry exposure. MOSL emphasizes companies with substantial revenue streams from high-growth sectors like healthcare, manufacturing, and BFSI, which are expected to experience rapid expansion. Additionally, margin expansion levers play a vital role in the evaluation. The brokerage notes that companies with opportunities to enhance margins, especially through offshoring, are seen as more attractive despite the general expectation of rangebound margins across the industry.Another key consideration is platform and ecosystem partnerships. It further said that in the increasingly competitive landscape of generative AI and data modernization, partnerships with top-tier ecosystems can provide a significant advantage. This is an essential factor for large-cap companies, while mid- and small-cap firms have the potential to stand out through strategic alliances that drive differentiation.Automation in service lines is also a critical factor. Companies that proactively integrate automation in business process outsourcing (BPO), testing, and low-level application development are better equipped to mitigate risks and maintain resilience. In addition, MOSL looks for a balanced client strategy, where companies focus on deepening relationships with existing clients (mining) while also seeking new client acquisitions (hunting), added the brokerage.Technological readiness, particularly in next-generation data engineering, is crucial for success. Firms well-prepared for technological inflection points are more likely to thrive as innovation progresses.While MOSL acknowledges the importance of valuations, the report emphasizes that the right mix of these factors plays a more decisive role in determining growth potential and long-term success for companies within the IT services sector, further stated the brokerage.As the IT services sector begins to recover, the companies identified by MOSL are well-positioned to capitalize on the resurgence of client spending. With strong portfolios, strategic partnerships, and readiness for future technological advancements, these firms are expected to drive the next wave of growth. MOSL's analysis, particularly through its IMPACT framework, provides valuable insights into the factors that will influence both short-term and long-term success in the evolving technology landscape.","cleaned_content":"a motilal oswal financial services mosl report has emphasized that the it services sector may be on the verge of recovery following an extended period of cuts in discretionary spending the report outlines a positive outlook for the next two to four years signalling the end of a challenging phase and the beginning of sustained growth in smaller deals and business flow with a recovery in focus mosls top stock picks in the it space include hcl technologies ltimindtree and persistent systems hcl technologies is expected to lead large cap revenue growth over the next three years due to its resilient portfolio and strong engineering services ltimindtree s best in class data and erp modernization offerings are projected to drive its recovery particularly with renewed discretionary spending by u s banks meanwhile persistent systems is identified as the fastest growing it services company within mosls coverage thanks to its strong product engineering background and its positioning to capitalize on long term genai investments the brokerage said the report also upgraded coforge to a buy rating with a target price of \u003cEIGHT_THOUSAND\u003e reflecting a \u003cTWO_TEN_PERCENT\u003e upside mosl believes coforge can capitalize on synergies with cigniti and its robust executable order book is expected to strengthen its core business further as the sector begins its recovery these companies are well positioned to benefit from the resurgence in client spending supported by their strong portfolios and strategic growth initiatives noted the brokerage motilal oswal financial services mosl highlighted three key factors that will shape the recovery trajectory of the it services sector influencing client spending behaviour and determining the pace of growth us interest rate regime a potential reduction in us interest rates could accelerate recovery in sectors like capital markets and mortgage originations within the banking financial services and insurance bfsi industry lower interest rates would ease the burden on capital intensive industries enabling them to allocate more funds toward technology investments work division between gccs and service integrators the recovery path will also depend on how work is distributed between global capability centers gccs and service integrators verticals with mature gcc operations may experience a more gradual recovery while industries with emerging gcc capabilities might see faster growth by leveraging service integrators for expertise and scaling inflection point for moonshot or low roi investments companies primarily focus on short term high return projects resulting in technological debt the sector s recovery will hinge on when industries reach a point where further delays in moonshot or long term investments are unsustainable based on these factors mosl identifies healthcare manufacturing and bfsi as the key verticals poised to lead the recovery of the it services sector mosl introduced the impact evaluation framework to identify stocks well positioned to benefit from both short term and long term trends in generative ai genai and other emerging technologies the framework examines companies through various critical factors providing a comprehensive view of their readiness for growth and ability to capitalize on technological advancements one of the core elements of the framework is industry exposure mosl emphasizes companies with substantial revenue streams from high growth sectors like healthcare manufacturing and bfsi which are expected to experience rapid expansion additionally margin expansion levers play a vital role in the evaluation the brokerage notes that companies with opportunities to enhance margins especially through offshoring are seen as more attractive despite the general expectation of rangebound margins across the industry another key consideration is platform and ecosystem partnerships it further said that in the increasingly competitive landscape of generative ai and data modernization partnerships with top tier ecosystems can provide a significant advantage this is an essential factor for large cap companies while mid and small cap firms have the potential to stand out through strategic alliances that drive differentiation automation in service lines is also a critical factor companies that proactively integrate automation in business process outsourcing bpo testing and low level application development are better equipped to mitigate risks and maintain resilience in addition mosl looks for a balanced client strategy where companies focus on deepening relationships with existing clients mining while also seeking new client acquisitions hunting added the brokerage technological readiness particularly in next generation data engineering is crucial for success firms well prepared for technological inflection points are more likely to thrive as innovation progresses while mosl acknowledges the importance of valuations the report emphasizes that the right mix of these factors plays a more decisive role in determining growth potential and long term success for companies within the it services sector further stated the brokerage as the it services sector begins to recover the companies identified by mosl are well positioned to capitalize on the resurgence of client spending with strong portfolios strategic partnerships and readiness for future technological advancements these firms are expected to drive the next wave of growth mosls analysis particularly through its impact framework provides valuable insights into the factors that will influence both short term and long term success in the evolving technology landscape","timestamp":"2024-09-10T14:30:00+05:30","market_timestamp":"2024-09-10T14:30:00+05:30","off_market_hours":false}