{"url":"https://www.livemint.com/market/stock-market-news/stocks-in-focus-ruchit-jain-of-5paisa-recommends-buying-dabur-india-and-avenue-supermarts-today-11725941447091.html","title":"Stocks in focus: Ruchit Jain of 5paisa recommends buying Dabur India, and Avenue Supermarts today","description":"Stocks in focus: Ruchit Jain of 5paisa has recommended two stocks today - Dabur India Ltd, and Avenue Supermarts Ltd (DMart).","content":"Stock Market News: Tuesday saw the opening of the domestic benchmark indices, Sensex and Nifty 50, with gains, indicating their resilience in the face of global headwinds. The Nifty 50 index kicked off at 25,007.90, showing an increase of 71.50 points or 0.29%, while the Sensex climbed 209 points or 0.26% to reach 81,768.72 points during the opening session. Analysts predict that despite the rebound in global markets following the decline last week and on Monday, volatility is anticipated as the Fed rate cut date of September 18th approaches.The market has seen several notable recent patterns, according to Dr. V K Vijayakumar, Chief Investment Strategist of Geojit Financial Services: First, the mid- and small-cap sectors are weak; second, the banking sector, which has historically underperformed, is showing indications of resiliency and is rising; and third, defensives like FMCG and pharmaceuticals are gradually rising and showing signals of accumulation. These patterns indicate that quality is becoming more and more preferred in the market. This stands in stark contrast to the completely unhealthy tendencies and reckless excitement that are connected to the SME exchange.The global markets had seen a sharp correction but since our markets had already seen a sharp fall on Friday, the global cues were factored in to a large extent and thus our markets recovered from the initial hour of correction. The FMCG stocks played a pivotal role as these defensive stocks witnessed buying interest, while the long time-underperforming banking index too rallied and outperformed. The daily RSI readings are negative, while the hourly readings have given a positive crossover and thus this should be read as a pullback move for now. The immediate hurdles in the index are seen around 25,050 and 25,110 which need to be surpassed for a sustainable upmove. On the other side, the immediate support for Nifty is placed around the 40 DEMA at 24,640.On stocks in focus on Tuesday, Ruchit Jain recommends Dabur India Ltd, and Avenue Supermarts Ltd (DMart).The stock has given a breakout above its previous swing high resistance indicating at a continuation of the uptrend. The volumes were good on breakout and the RSI oscillator is hinting at a positive momentum.Hence, short term traders are advised to buy the stock in the range of  ₹662-655 for potential targets of  ₹690 and  ₹710. The stoploss on long positions should be placed below  ₹634.The stock has recently gone through a corrective phase, but the prices have managed to form a support base between its 40 and 89 DEMA. The prices have given a breakout from this consolidation and the RSI oscillator on the daily chart has given a positive crossover. This indicates a resumption of the uptrend and hence, we advise short term traders to look for buying opportunities in the stock.Traders can buy the stock around current market price of  ₹5,350 and look to add on any dips towards Rs. 5250 for potential target of  ₹5,650-5,700 range. The stop loss on long positions should be placed below  ₹5,100.","cleaned_content":"stock market news tuesday saw the opening of the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e with gains indicating their resilience in the face of global headwinds the nifty \u003cFIVE_TEN\u003e index kicked off at \u003cTWO_TEN_THOUSAND\u003e showing an increase of \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e while the sensex climbed \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to reach \u003cEIGHT_TEN_THOUSAND\u003e points during the opening session analysts predict that despite the rebound in global markets following the decline last week and on monday volatility is anticipated as the fed rate cut date of september \u003cONE_TEN\u003e th approaches the market has seen several notable recent patterns according to dr v k vijayakumar chief investment strategist of geojit financial services first the mid and small cap sectors are weak second the banking sector which has historically underperformed is showing indications of resiliency and is rising and third defensives like fmcg and pharmaceuticals are gradually rising and showing signals of accumulation these patterns indicate that quality is becoming more and more preferred in the market this stands in stark contrast to the completely unhealthy tendencies and reckless excitement that are connected to the sme exchange the global markets had seen a sharp correction but since our markets had already seen a sharp fall on friday the global cues were factored in to a large extent and thus our markets recovered from the initial hour of correction the fmcg stocks played a pivotal role as these defensive stocks witnessed buying interest while the long time underperforming banking index too rallied and outperformed the daily rsi readings are negative while the hourly readings have given a positive crossover and thus this should be read as a pullback move for now the immediate hurdles in the index are seen around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e which need to be surpassed for a sustainable upmove on the other side the immediate support for nifty is placed around the \u003cFOUR_TEN\u003e dema at \u003cTWO_TEN_THOUSAND\u003e on stocks in focus on tuesday ruchit jain recommends dabur india ltd and avenue supermarts ltd dmart the stock has given a breakout above its previous swing high resistance indicating at a continuation of the uptrend the volumes were good on breakout and the rsi oscillator is hinting at a positive momentum hence short term traders are advised to buy the stock in the range of \u003cSIX_HUNDRED\u003e \u003cSIX_HUNDRED\u003e for potential targets of \u003cSIX_HUNDRED\u003e and \u003cSEVEN_HUNDRED\u003e the stoploss on long positions should be placed below \u003cSIX_HUNDRED\u003e the stock has recently gone through a corrective phase but the prices have managed to form a support base between its \u003cFOUR_TEN\u003e and \u003cEIGHT_TEN\u003e dema the prices have given a breakout from this consolidation and the rsi oscillator on the daily chart has given a positive crossover this indicates a resumption of the uptrend and hence we advise short term traders to look for buying opportunities in the stock traders can buy the stock around current market price of \u003cFIVE_THOUSAND\u003e and look to add on any dips towards rs \u003cFIVE_THOUSAND\u003e for potential target of \u003cFIVE_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e range the stop loss on long positions should be placed below \u003cFIVE_THOUSAND\u003e","timestamp":"2024-09-10T09:59:00+05:30","market_timestamp":"2024-09-10T09:59:00+05:30","off_market_hours":false}