{"url":"https://www.livemint.com/market/stock-market-news/multibagger-small-cap-stock-sepc-hits-52-week-high-after-receipt-of-fresh-order-worth-rs-182-crore-11725950611245.html","title":"Multibagger small-cap stock hits 52-week high after receipt of fresh order worth  ₹182 crore","description":"Multibagger stock: The small-cap stock has informed Indian exchanges about the receipt of a fresh order from the State Government of Bihar","content":"Multibagger stock: SEPC shares are one of the multibagger stocks the Indian stock market has delivered in recent years. This small-cap stock has risen more than 160 per cent since January 2023. However, multibagger stocks still possess some upside potential. SEPC share price today opened with an upside gap and touched an intraday high of  ₹31.65 apiece on the NSE. While climbing to this intraday high, the small-cap stock hit a new 52-week high of  ₹31.64 per share.SEPC's share price opened flat during early morning deals on Tuesday, but it generated huge buying interest after sharing its order book update. The company claimed in an exchange filing that it received a fresh order worth  ₹182 crore from the irrigation department in the State Government of Bihar.The multibagger small-cap stock informed about the receipt of fresh order saying, \"This is to inform you that we have been awarded a Work Order for  ₹182,56,76,000/- (Rupees One hundred and eighty-two crores fifty-six-lakhs seventy-six thousand only) from Irrigation Division, Govt. Of Bihar.\"The small-cap company said the contract's execution period would be “12 months for execution, three months for trial run, and 60 months for Operation and Maintenance.”As mentioned above, SEPC shares are one of the multibagger stocks the Indian stock market has produced from the small-cap segment. In one month, this multibagger stock has risen from  ₹18.96 to  ₹31.62 apiece on the BSE, logging a nearly 65 per cent rally in this time horizon. The small-cap multibagger stock has rallied over 70 per cent in the last six months. However, in the YTD time, this multibagger stock has surged from around  ₹20.54 to  ₹31.62 apiece on the BSE, logging around a 55 per cent rally in the current year. In the last year, the small-cap delivered a multibagger return to its positional shareholders by logging around a 150 per cent rise. This multibagger stock has rallied around 175 per cent in the last five years.The small-cap multibagger stock is available for trade on both BSE and NSE. The small-cap stock has attracted a trade volume of over 3.36 crore; its current market cap is  ₹4,892 crore. Its 52-week high is  ₹31.62 on the NSE, which it has climbed today. Its 52-week loss on the NSE is  ₹11.88 apiece.","cleaned_content":"multibagger stock sepc shares are one of the multibagger stocks the indian stock market has delivered in recent years this small cap stock has risen more than \u003cONE_HUNDRED_PERCENT\u003e since january \u003cTWO_THOUSAND\u003e however multibagger stocks still possess some upside potential sepc share price today opened with an upside gap and touched an intraday high of \u003cTHREE_TEN\u003e apiece on the nse while climbing to this intraday high the small cap stock hit a new \u003cFIVE_TEN\u003e week high of \u003cTHREE_TEN\u003e per share sepcs share price opened flat during early morning deals on tuesday but it generated huge buying interest after sharing its order book update the company claimed in an exchange filing that it received a fresh order worth \u003cONE_HUNDRED\u003e crore from the irrigation department in the state government of bihar the multibagger small cap stock informed about the receipt of fresh order saying this is to inform you that we have been awarded a work order for \u003cONE_BILLION\u003e rupees one hundred and eighty two crores fifty six lakhs seventy six thousand only from irrigation division govt of bihar the small cap company said the contracts execution period would be \u003cONE_TEN\u003e months for execution three months for trial run and \u003cSIX_TEN\u003e months for operation and maintenance as mentioned above sepc shares are one of the multibagger stocks the indian stock market has produced from the small cap segment in one month this multibagger stock has risen from \u003cONE_TEN\u003e to \u003cTHREE_TEN\u003e apiece on the bse logging a nearly \u003cSIX_TEN_PERCENT\u003e rally in this time horizon the small cap multibagger stock has rallied over \u003cSEVEN_TEN_PERCENT\u003e in the last six months however in the ytd time this multibagger stock has surged from around \u003cTWO_TEN\u003e to \u003cTHREE_TEN\u003e apiece on the bse logging around a \u003cFIVE_TEN_PERCENT\u003e rally in the current year in the last year the small cap delivered a multibagger return to its positional shareholders by logging around a \u003cONE_HUNDRED_PERCENT\u003e rise this multibagger stock has rallied around \u003cONE_HUNDRED_PERCENT\u003e in the last five years the small cap multibagger stock is available for trade on both bse and nse the small cap stock has attracted a trade volume of over \u003cTHREE_\u003e crore its current market cap is \u003cFOUR_THOUSAND\u003e crore its \u003cFIVE_TEN\u003e week high is \u003cTHREE_TEN\u003e on the nse which it has climbed today its \u003cFIVE_TEN\u003e week loss on the nse is \u003cONE_TEN\u003e apiece","timestamp":"2024-09-10T12:40:00+05:30","market_timestamp":"2024-09-10T12:40:00+05:30","off_market_hours":false}