{"url":"https://www.livemint.com/market/stock-market-news/ola-electrics-dominance-in-2w-electric-segment-faces-stiff-competition-as-major-players-enter-ev-fray-11725939052673.html","title":"OLA Electric’s dominance in 2W electric segment faces stiff competition as major players enter EV fray","description":"OLA Electric faces increasing competition in the electric two-wheeler market from major players like Bajaj, Hero, and TVS, as they plan to introduce new affordable models. Despite a drop in OLA's market share, it still leads with 41 percent, but upcoming launches could change the dynamics.","content":"The push for electric two-wheelers (2W) in India has been accelerating at an impressive rate, driven by a growing shift in consumer preferences from traditional internal combustion engine (ICE) vehicles to greener, more sustainable mobility options.This transition is driven by increasing environmental awareness, discounts on popular models, government incentives, and lower maintenance costs than fuel-powered vehicles. Globally, India is one of the top two-wheeler manufacturers, producing 2.1 crore two-wheelers in FY24, with electric two-wheeler sales reaching 9.42 lakh units.Although this figure seems modest, it has steadily grown, particularly in urban markets. OLA Electric, which recently debuted on the Indian stock exchanges, dominates the 2W electric market.However, with electric vehicle (EV) adoption anticipated to rise significantly in FY25, major players such as Bajaj Auto, Hero MotoCorp, and TVS Motors are gearing up to introduce new, competitively-priced models. Analysts predict that these new entries could seriously challenge OLA's current market dominance.In August, OLA's market share fell to 31 per cent from 39 per cent in July. Despite this drop, OLA remains ahead of its competitors, with cumulative sales of 297,695 units over eight months, marking an 81 per cent increase. This performance has boosted OLA's overall market share to 41 per cent, up from 30 per cent a year ago.Analysts believe competitors' upcoming launches could impact OLA's market position, intensifying competition in the rapidly growing EV sector.For instance, Hero MotoCorp, the world's top two-wheeler producer, is seeing a growing demand for its Vida electric scooters. The company is expanding its presence with 203 touchpoints, including 180 dealerships in 116 cities.Intending to double its electric vehicle sales, Hero is increasing the reach of its Vida brand and plans to release a more affordable model.Bajaj Auto, meanwhile, is aiming to boost its two-wheeler stores from 250 in the first quarter of FY25 to 500 by the second quarter. The company has grown its market share through competitive pricing, dealer network expansion, and the launch of affordable models. Its flagship electric scooter, the Chetak Urbane, has successfully challenged its competitors.TVS Motor is also progressing rapidly in the electric vehicle market. The company expects two-wheeler EV sales in India to hit 30 per cent market penetration by 2025 and is working toward significantly increasing EV sales over the next two years.Currently, TVS offers its iQube electric scooter through 750 dealerships across more than 450 cities. It has plans to roll out new electric two-wheelers (E2Ws), electric three-wheelers (E3Ws), and internal combustion engine two-wheelers (ICE 2Ws) in the second and third quarters of FY25.Ather Energy, backed by Hero MotoCorp, recently reached 10,000 retail sales between July and August. In June, Ather announced the construction of its third manufacturing facility in Aurangabad Industrial City (AURIC), Maharashtra.This new plant, requiring an investment of over  ₹2,000 crore, will be able to produce up to one million units of electric vehicles and battery packs annually.According to domestic brokerage firm Elara Capital, OLA Electric has lost its market leadership position in five of the top ten states, accounting for 80 per cent of the EV market. Notably, four of these losses occurred incrementally in August.In three of these states, OLA Electric is now the third-largest player. However, in Haryana, the company achieved an 81 per cent market share in August, marking a 2,800-basis point increase year over year and a 1,490-basis point rise month-over-month. The brokerage emphasized that sustaining this level of market share will require close monitoring.According to domestic brokerage firm Elara Capital, Hero, Bajaj, TVS, and Ather Energy were initially seen as the \"tortoises\" of the industry, as their growth was slow compared to the rapid strides made by Ola Electric in a short time.However, the brokerage expects these incumbents and Ather to increase their market share by launching more affordable scooters and expanding their distribution networks while maintaining a strong focus on quality.It notes that Hero, Bajaj, TVS, and Ather's combined market share reached an all-time high of 56.3 per cent in August, and it anticipates this share will grow further, especially with TVS Motor's increased distribution efforts and the introduction of lower-priced models.Additionally, the report highlights that Honda Motorcycle and Scooters India (HMSI), the market leader in internal combustion engine (ICE) vehicles, has yet to launch an electric scooter, which could further erode OLA Electric's market share.","cleaned_content":"the push for electric two wheelers \u003cTWO_\u003e w in india has been accelerating at an impressive rate driven by a growing shift in consumer preferences from traditional internal combustion engine ice vehicles to greener more sustainable mobility options this transition is driven by increasing environmental awareness discounts on popular models government incentives and lower maintenance costs than fuel powered vehicles globally india is one of the top two wheeler manufacturers producing \u003cTWO_\u003e crore two wheelers in fy24 with electric two wheeler sales reaching \u003cNINE_\u003e lakh units although this figure seems modest it has steadily grown particularly in urban markets ola electric which recently debuted on the indian stock exchanges dominates the \u003cTWO_\u003e w electric market however with electric vehicle ev adoption anticipated to rise significantly in fy25 major players such as bajaj auto hero motocorp and tvs motors are gearing up to introduce new competitively priced models analysts predict that these new entries could seriously challenge olas current market dominance in august olas market share fell to \u003cTHREE_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e in july despite this drop ola remains ahead of its competitors with cumulative sales of \u003cTWO_HUNDRED_THOUSAND\u003e units over eight months marking an \u003cEIGHT_TEN_PERCENT\u003e increase this performance has boosted olas overall market share to \u003cFOUR_TEN_PERCENT\u003e up from \u003cTHREE_TEN_PERCENT\u003e a year ago analysts believe competitors upcoming launches could impact olas market position intensifying competition in the rapidly growing ev sector for instance hero motocorp the worlds top two wheeler producer is seeing a growing demand for its vida electric scooters the company is expanding its presence with \u003cTWO_HUNDRED\u003e touchpoints including \u003cONE_HUNDRED\u003e dealerships in \u003cONE_HUNDRED\u003e cities intending to double its electric vehicle sales hero is increasing the reach of its vida brand and plans to release a more affordable model bajaj auto meanwhile is aiming to boost its two wheeler stores from \u003cTWO_HUNDRED\u003e in the first quarter of fy25 to \u003cFIVE_HUNDRED\u003e by the second quarter the company has grown its market share through competitive pricing dealer network expansion and the launch of affordable models its flagship electric scooter the chetak urbane has successfully challenged its competitors tvs motor is also progressing rapidly in the electric vehicle market the company expects two wheeler ev sales in india to hit \u003cTHREE_TEN_PERCENT\u003e market penetration by \u003cTWO_THOUSAND\u003e and is working toward significantly increasing ev sales over the next two years currently tvs offers its iqube electric scooter through \u003cSEVEN_HUNDRED\u003e dealerships across more than \u003cFOUR_HUNDRED\u003e cities it has plans to roll out new electric two wheelers e2ws electric three wheelers e3ws and internal combustion engine two wheelers ice \u003cTWO_\u003e ws in the second and third quarters of fy25 ather energy backed by hero motocorp recently reached \u003cONE_TEN_THOUSAND\u003e retail sales between july and august in june ather announced the construction of its third manufacturing facility in aurangabad industrial city auric maharashtra this new plant requiring an investment of over \u003cTWO_THOUSAND\u003e crore will be able to produce up to one million units of electric vehicles and battery packs annually according to domestic brokerage firm elara capital ola electric has lost its market leadership position in five of the top ten states accounting for \u003cEIGHT_TEN_PERCENT\u003e of the ev market notably four of these losses occurred incrementally in august in three of these states ola electric is now the third largest player however in haryana the company achieved an \u003cEIGHT_TEN_PERCENT\u003e market share in august marking a \u003cTWO_THOUSAND\u003e basis point increase year over year and a \u003cONE_THOUSAND\u003e basis point rise month over month the brokerage emphasized that sustaining this level of market share will require close monitoring according to domestic brokerage firm elara capital hero bajaj tvs and ather energy were initially seen as the tortoises of the industry as their growth was slow compared to the rapid strides made by ola electric in a short time however the brokerage expects these incumbents and ather to increase their market share by launching more affordable scooters and expanding their distribution networks while maintaining a strong focus on quality it notes that hero bajaj tvs and athers combined market share reached an all time high of \u003cFIVE_TEN_PERCENT\u003e in august and it anticipates this share will grow further especially with tvs motors increased distribution efforts and the introduction of lower priced models additionally the report highlights that honda motorcycle and scooters india hmsi the market leader in internal combustion engine ice vehicles has yet to launch an electric scooter which could further erode ola electrics market share","timestamp":"2024-09-10T17:56:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}