{"url":"https://www.livemint.com/market/stock-market-news/congress-accuses-sebis-madhabi-buch-of-making-crores-from-m-m-icici-dr-reddy-and-3-more-listed-companies-via-agora-11725954771221.html","title":"Congress accuses Sebi’s Madhabi Buch of making crores from M\u0026M, ICICI, Dr Reddy and 3 more listed companies via Agora","description":"Madhabi Puri Buch owns 99% of Agora Advisory which earned consultancy fees from regulated entities, placing the Sebi chair in a potential conflict of interest situation.","content":"Agora Advisory Pvt. Ltd, owned by Madhabi Puri Buch, earned consultancy fees from listed companies including Mahindra \u0026 Mahindra Ltd, Pidilite Ltd and Dr Reddy's Laboratories Ltd, the Congress party alleged on Tuesday, raising conflict-of-interest questions for the current chair of the Securities and Exchange Board of India (Sebi).Agora earned  ₹2.95 crore from these companies between 2016-17 and 2023-24, the opposition party claimed in its latest attack on Buch. Notably, 88% of the payments came from the Mahindra group, which the Congress claimed, had certain pending matters before the capital markets regulator. Compounding the issue, Dhaval Buch, Madhabi’s spouse, was also consulting for the Mahindra group during this time.Buch owns 99% of Agora Advisory. As per the Sebi (Employees' Service) Regulations, 2001, whole-time employees are prohibited from receiving benefits from external organizations. With regards to “private activities” outside the activities related to Sebi, a whole-time member cannot be related to any other “office of profit”; and cannot engage in any other “professional activity, which entails receipt of salary or professional fees”.The rules also require Sebi members to disclose any professional, personal, financial, or family relationships with entities under the regulator's purview.Mint couldn't verify if Madhabi Buch made these disclosures. Sebi did not respond to requests from comment.Read this | Full disclosure for Sebi chief: Key to preventing next Hindenburg-like scandalRefuting the Congress' charges of impropriety, a Mahindra group spokesperson said, “We categorically state that we have not at any point requested Sebi for any preferential treatment. We maintain the highest standards of corporate governance. We consider these allegations false and misleading in nature.”They clarified that the Mahindra Group hired Dhaval Buch in 2019  for his expertise in supply chain and sourcing, soon after he retired as Unilever's global chief procurement officer, and that he spent most of his time at Bristlecone, a supply chain consulting subsidiary of Mahindra, where he is currently on the board.Dhaval Buch “joined Mahindra Group almost three years before Ms. Madhabi Puri Buch was appointed as Sebi chairperson,” the spokesperson added.The Mahindra group spokesperson, however, did not specify whether it paid the advisory fees to Agora Advisory or Dhaval Buch directly.Apart from the advisory fees allegedly paid by Mahindra group to Buch’s firm Agora and her husband, Dhaval Buch has additionally earned  ₹4.78 crore in the form of salary from Mahindra group, according to the Congress.To be sure, three of the five Sebi orders referenced in the Congress allegations do not pertain to the Mahindra group but to Kotak Mahindra Bank-owned companies. Anand Mahindra, chairman of the Mahindra group, ceased to be a promoter of Kotak Mahindra Bank in 2009. Also, none of the orders have also been passed by Madhabi Buch but by other Sebi officials.In an emailed response to Mint, a Pidilite spokesperson said on Monday, “At Pidilite, we engage with multiple partners and consultants who are renowned professionals in their respective fields. As part of its routine requirements, the company had engaged Agora Advisory’s Dhaval Buch, a globally renowned supply chain and procurement professional, for his services in these areas. We further state that there have never been any cases from Sebi vis-à-vis Pidilite.”A Dr Reddy's spokesperson said the company had engaged Dhaval Buch for leadership coaching for a total remuneration of  ₹6,58,000 from October 2020 to April 2021. \"We routinely engage external coaches to enable significant role transitions of our leaders. Mr. Dhaval Buch’s work in India and globally for Unilever was well-suited to coach the identified leader in our company, and the remuneration paid to Mr. Buch was in line with that of other coaches. The assignment started and ended well before Ms Madhabi Buch’s term as Sebi chairperson. Any suggestion that the company was treated differently by Sebi as a result of this would be baseless and malafide. The company has and continues to operate in compliance with all applicable laws,\" the spokesperson added.These allegations against Madhabi Puri Buch are the latest in a series that started when US-based Hindenburg Research disclosed a show-cause notice sent by Sebi to the short-seller in connection with a Supreme Court-directed investigation into the Adani Group’s money trail.Hindenburg has also accused Buch and her husband Dhaval Buch of holding shares in an offshore fund, which in turn had seen investments from another offshore fund that is alleged to have been used by Vinod Adani, elder brother of billionaire Gautam Adani, as a vehicle to manipulate Adani Group firms’ share prices.The Buchs and the Adani group have strenuously denied these allegations.Read here | Hindenburg flux: Sebi has all information, no conflict, says chairperson BuchEarlier this week, the Congress accused Buch of drawing a ‘salary’ from her former employer ICICI Bank Ltd and its subsidiary ICICI Prudential Asset Management Co even after retiring from the private group in 2013 and joining Sebi. In an exchange notice, ICICI Bank denied paying a salary or granting stock options to Buch after her retirement, other than her retiral benefits.Also read | To whom is Madhabi Puri Buch really accountable?Later, Mint reported that Buch’s stint at ICICI Bank between 2011 and 2013 appeared to have coincided with a full-time job at Greater Pacific Capital, a revelation that raises questions about how she could have worked with two financial services firms at the same time.","cleaned_content":"agora advisory pvt ltd owned by madhabi puri buch earned consultancy fees from listed companies including mahindra mahindra ltd pidilite ltd and dr reddys laboratories ltd the congress party alleged on tuesday raising conflict of interest questions for the current chair of the securities and exchange board of india sebi agora earned \u003cTWO_\u003e crore from these companies between \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the opposition party claimed in its latest attack on buch notably \u003cEIGHT_TEN_PERCENT\u003e of the payments came from the mahindra group which the congress claimed had certain pending matters before the capital markets regulator compounding the issue dhaval buch madhabi s spouse was also consulting for the mahindra group during this time buch owns \u003cNINE_TEN_PERCENT\u003e of agora advisory as per the sebi employees service regulations \u003cTWO_THOUSAND\u003e whole time employees are prohibited from receiving benefits from external organizations with regards to private activities outside the activities related to sebi a whole time member cannot be related to any other office of profit and cannot engage in any other professional activity which entails receipt of salary or professional fees the rules also require sebi members to disclose any professional personal financial or family relationships with entities under the regulators purview mint couldnt verify if madhabi buch made these disclosures sebi did not respond to requests from comment read this full disclosure for sebi chief key to preventing next hindenburg like scandalrefuting the congress charges of impropriety a mahindra group spokesperson said we categorically state that we have not at any point requested sebi for any preferential treatment we maintain the highest standards of corporate governance we consider these allegations false and misleading in nature they clarified that the mahindra group hired dhaval buch in \u003cTWO_THOUSAND\u003e for his expertise in supply chain and sourcing soon after he retired as unilevers global chief procurement officer and that he spent most of his time at bristlecone a supply chain consulting subsidiary of mahindra where he is currently on the board dhaval buch joined mahindra group almost three years before ms madhabi puri buch was appointed as sebi chairperson the spokesperson added the mahindra group spokesperson however did not specify whether it paid the advisory fees to agora advisory or dhaval buch directly apart from the advisory fees allegedly paid by mahindra group to buch s firm agora and her husband dhaval buch has additionally earned \u003cFOUR_\u003e crore in the form of salary from mahindra group according to the congress to be sure three of the five sebi orders referenced in the congress allegations do not pertain to the mahindra group but to kotak mahindra bank owned companies anand mahindra chairman of the mahindra group ceased to be a promoter of kotak mahindra bank in \u003cTWO_THOUSAND\u003e also none of the orders have also been passed by madhabi buch but by other sebi officials in an emailed response to mint a pidilite spokesperson said on monday at pidilite we engage with multiple partners and consultants who are renowned professionals in their respective fields as part of its routine requirements the company had engaged agora advisory s dhaval buch a globally renowned supply chain and procurement professional for his services in these areas we further state that there have never been any cases from sebi vis vis pidilite a dr reddys spokesperson said the company had engaged dhaval buch for leadership coaching for a total remuneration of \u003cSIX_HUNDRED_THOUSAND\u003e from october \u003cTWO_THOUSAND\u003e to april \u003cTWO_THOUSAND\u003e we routinely engage external coaches to enable significant role transitions of our leaders mr dhaval buch s work in india and globally for unilever was well suited to coach the identified leader in our company and the remuneration paid to mr buch was in line with that of other coaches the assignment started and ended well before ms madhabi buch s term as sebi chairperson any suggestion that the company was treated differently by sebi as a result of this would be baseless and malafide the company has and continues to operate in compliance with all applicable laws the spokesperson added these allegations against madhabi puri buch are the latest in a series that started when us based hindenburg research disclosed a show cause notice sent by sebi to the short seller in connection with a supreme court directed investigation into the adani group s money trail hindenburg has also accused buch and her husband dhaval buch of holding shares in an offshore fund which in turn had seen investments from another offshore fund that is alleged to have been used by vinod adani elder brother of billionaire gautam adani as a vehicle to manipulate adani group firms share prices the buchs and the adani group have strenuously denied these allegations read here hindenburg flux sebi has all information no conflict says chairperson buchearlier this week the congress accused buch of drawing a salary from her former employer icici bank ltd and its subsidiary icici prudential asset management co even after retiring from the private group in \u003cTWO_THOUSAND\u003e and joining sebi in an exchange notice icici bank denied paying a salary or granting stock options to buch after her retirement other than her retiral benefits also read to whom is madhabi puri buch really accountable later mint reported that buch s stint at icici bank between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e appeared to have coincided with a full time job at greater pacific capital a revelation that raises questions about how she could have worked with two financial services firms at the same time","timestamp":"2024-09-10T13:25:00+05:30","market_timestamp":"2024-09-10T13:25:00+05:30","off_market_hours":false}