{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-markets-five-stocks-to-buy-or-sell-on-tuesday-sept-10-11725937902609.html","title":"Stock market today: Trade setup for Nifty 50 to global markets, five stocks to buy or sell on Tuesday — Sept 10","description":"Stocks to buy todaty: Experts have recommended five shares to buy today — Doms Industries, Glenmark Life Sciences, NCC, Reliance Industries, and Tata Power","content":"Stock market today: Following a partial recovery in the global markets, the Indian stock market snapped a three-day losing streak on Monday. The Nifty 50 index went up 84 points and closed at the 24,936 mark, the BSE Sensex surged 375 points and closed at 81,559, whereas the Bank Nifty index finished 540 points higher at 51,117. Cash market volumes on the NSE fell 17.5% compared to the previous session – the lowest since May 29. The broad market indices ended in the red even as the advance-decline ratio ended at 0.60:1.Speaking on the outlook for Nifty today, Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities, said, \"The short-term uptrend of Nifty seems to have reversed down, and the market is expected to shift into near-term downward correction ahead. Having broken below the immediate support at 25,000 levels, the next lower support is around 24,500. Immediate resistance for Nofty today is placed at 25,050.\"On the outlook for Bank Nifty today, Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C Mehta, said, \"Bank Nifty opened on a negative note on Monday but, after initial volatility, the index recovered and settled the day on a positive note at 51,118. Technically, the index formed a piercing line candle on the daily scale, indicating strength. If the index holds today's low of around 50,370, a pullback rally towards 51,500-51,800 could be possible in the short term.\"Asian stocks reversed early losses to rise marginally on Tuesday following Wall Street's overnight rally, though concerns about a still-struggling Chinese economy kept sentiment in check. MSCI's broadest index of Asia-Pacific shares outside Japan lasted up 0.2% after falling 1.11% in the previous session, hitting a one-month low. Japan's Nikkei last traded 0.4% higher, helped by gains in financial and consumer names.Regarding shares to buy today, stock market experts — Sumeet Bagadia, Executive Director at Choice Broking and Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi — recommended buying these five shares: Doms Industries, Glenmark Life Sciences, NCC, Reliance Industries, and Tata Power.1] Doms Industries: Buy at  ₹2732.05, target  ₹2888, stop loss  ₹2626.DOMS is exhibiting bullish solid momentum, trading at an all-time high of  ₹2774.60. The recent breakout above the crucial resistance at  ₹2666 levels is a significant technical development supported by robust trading volumes, reinforcing the strength of the stock. The breakthrough suggests a potential continuation of the upward trend, offering an optimistic outlook for investors.2] Glenmark Life Sciences: Buy at  ₹1204.95, target  ₹1270, stop loss  ₹1160.GLS daily chart analysis offers a favourable view for the following week, indicating a steady higher advance. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.3] NCC: Buy at  ₹310, target  ₹325, stop loss  ₹300.A notable bullish reversal pattern has emerged in the stock's recent short-term trend analysis. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around  ₹325. Currently, the stock is maintaining a crucial support level at  ₹300. Given the current market price of  ₹310, a buying opportunity is emerging. This suggests that investors consider purchasing the stock at its current price, anticipating a rise towards the identified target of  ₹325.4] Reliance Industries: Buy at  ₹2930, target  ₹3040, stop loss  ₹2870.On the daily chart of this stock, support at the  ₹2870 level has been observed, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at  ₹2870 is recommended. The target price for this strategy is  ₹3040 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.5] Tata Power: Buy at  ₹420, target  ₹445, stop loss  ₹410.On the short-term chart, this stock is forming an inherently bullish rounding bottom pattern. Currently priced at  ₹420, this formation signals a potential upward trend. To effectively manage risk, a stop loss of  ₹410 is recommended. The target price for this strategy is  ₹445 in the upcoming weeks. This suggests a potential gain as the stock continues its upward trajectory, backed by the bullish technical signals.","cleaned_content":"stock market today following a partial recovery in the global markets the indian stock market snapped a three day losing streak on monday the nifty \u003cFIVE_TEN\u003e index went up \u003cEIGHT_TEN\u003e points and closed at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex surged \u003cTHREE_HUNDRED\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index finished \u003cFIVE_HUNDRED\u003e points higher at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse fell \u003cONE_TEN_PERCENT\u003e compared to the previous session the lowest since may \u003cTWO_TEN\u003e the broad market indices ended in the red even as the advance decline ratio ended at \u003cZERO_\u003e \u003cONE_\u003e speaking on the outlook for nifty today nagaraj shetti senior technical research analyst at hdfc securities said the short term uptrend of nifty seems to have reversed down and the market is expected to shift into near term downward correction ahead having broken below the immediate support at \u003cTWO_TEN_THOUSAND\u003e levels the next lower support is around \u003cTWO_TEN_THOUSAND\u003e immediate resistance for nofty today is placed at \u003cTWO_TEN_THOUSAND\u003e on the outlook for bank nifty today hrishikesh yedve avp technical and derivatives research at asit c mehta said bank nifty opened on a negative note on monday but after initial volatility the index recovered and settled the day on a positive note at \u003cFIVE_TEN_THOUSAND\u003e technically the index formed a piercing line candle on the daily scale indicating strength if the index holds todays low of around \u003cFIVE_TEN_THOUSAND\u003e a pullback rally towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e could be possible in the short term asian stocks reversed early losses to rise marginally on tuesday following wall streets overnight rally though concerns about a still struggling chinese economy kept sentiment in check mscis broadest index of asia pacific shares outside japan lasted up \u003cZERO_PERCENT\u003e after falling \u003cONE_PERCENT\u003e in the previous session hitting a one month low japans nikkei last traded \u003cZERO_PERCENT\u003e higher helped by gains in financial and consumer names regarding shares to buy today stock market experts sumeet bagadia executive director at choice broking and ganesh dongre senior manager of technical research at anand rathi recommended buying these five shares doms industries glenmark life sciences ncc reliance industries and tata power 1 doms industries buy at \u003cTWO_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e doms is exhibiting bullish solid momentum trading at an all time high of \u003cTWO_THOUSAND\u003e the recent breakout above the crucial resistance at \u003cTWO_THOUSAND\u003e levels is a significant technical development supported by robust trading volumes reinforcing the strength of the stock the breakthrough suggests a potential continuation of the upward trend offering an optimistic outlook for investors 2 glenmark life sciences buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e gls daily chart analysis offers a favourable view for the following week indicating a steady higher advance notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 3 ncc buy at \u003cTHREE_HUNDRED\u003e target \u003cTHREE_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e a notable bullish reversal pattern has emerged in the stocks recent short term trend analysis this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around \u003cTHREE_HUNDRED\u003e currently the stock is maintaining a crucial support level at \u003cTHREE_HUNDRED\u003e given the current market price of \u003cTHREE_HUNDRED\u003e a buying opportunity is emerging this suggests that investors consider purchasing the stock at its current price anticipating a rise towards the identified target of \u003cTHREE_HUNDRED\u003e reliance industries buy at \u003cTWO_THOUSAND\u003e target \u003cTHREE_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e on the daily chart of this stock support at the \u003cTWO_THOUSAND\u003e level has been observed signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at \u003cTWO_THOUSAND\u003e is recommended the target price for this strategy is \u003cTHREE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory 5 tata power buy at \u003cFOUR_HUNDRED\u003e target \u003cFOUR_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e on the short term chart this stock is forming an inherently bullish rounding bottom pattern currently priced at \u003cFOUR_HUNDRED\u003e this formation signals a potential upward trend to effectively manage risk a stop loss of \u003cFOUR_HUNDRED\u003e is recommended the target price for this strategy is \u003cFOUR_HUNDRED\u003e in the upcoming weeks this suggests a potential gain as the stock continues its upward trajectory backed by the bullish technical signals","timestamp":"2024-09-10T09:17:00+05:30","market_timestamp":"2024-09-10T09:17:00+05:30","off_market_hours":false}