{"url":"https://www.livemint.com/market/stock-market-news/multibagger-servotech-power-systems-stock-rises-5-on-order-for-11-public-ev-charging-stations-11725957556662.html","title":"Multibagger Servotech Power Systems stock rises 5% on order for 11 public EV charging stations","description":"The company will manage the entire project execution, from planning and design to final installation. This includes developing a comprehensive plan for the installation of EV charging stations at each RTO location, ensuring optimal placement and capacity","content":"Shares of Servotech Power Systems, a prominent EV charger manufacturer in India, surged 5 percent today, reaching  ₹146.90 per share following news of a major contract win. The company announced that it has secured a significant order to set up 11 DC Fast EV charging stations for Bangalore Electricity Supply Company Limited (BESCOM).Under this contract, Servotech will install public EV charging stations at 11 Regional Transport Office (RTO) locations across Karnataka, the company said in today's regulatory filing. The project will significantly enhance the charging infrastructure for electric vehicles, making it more convenient for EV owners to charge their vehicles across various regions of Karnataka.Servotech will manage the entire project execution, from planning and design to final installation. This includes developing a comprehensive plan for the installation of EV charging stations at each RTO location, ensuring optimal placement and capacity. Additionally, the company said it will provide warranty support and handle all necessary electrical connections and power supply arrangements.Sarika Bhatia, Director of Servotech Power Systems Ltd., said, “We are glad to be working on this project for BESCOM. As a leading player in the EV sector, this initiative brings us closer to our collective goal of transforming India into an EV-powered nation.\"We are creating our green footprints, capturing every state and every region of India. Having recently collaborated with ANERT and now with BESCOM, our robust desire towards creating an EV charging framework is growing stronger day by day, and we plan to enhance our presence by collaborating with other nodal agencies and DISCOMs in the future as well,\" Sarika Bhatia added.Today's order win marks the company's second major order in less than two weeks. On August 21, Servotech secured a significant contract from the Agency for New and Renewable Energy Research and Technology (ANERT), Department of Power, Govt. of Kerala, to install 12 EV charging stations.Under the contract, Servotech will build 12 electric vehicle (EV) charging stations equipped with 30KW Fast DC EV chargers at various locations of Kerala's Motor Vehicle Department. The contract includes the supply, commissioning, and construction of these EV charging stations.Additionally, in late August, the company expanded its reach by partnering with 62 DISCOMs across India under the Pradhan Mantri Surya Ghar Muft Bijli Yojana. It also bagged an order of 1,800 DC fast EV chargers from Bharat Petroleum Corporation Limited (BPCL), valued at  ₹120 crore.Additionally, it secured another significant order for nearly 1,500 DC fast EV chargers from Hindustan Petroleum Corporation Limited (HPCL) and other EV charger OEMs, worth  ₹102 crore. It also won an order for 1,400 DC fast EV chargers from Indian Oil Corporation Limited (IOCL) and other OEMs, with a total value of  ₹111 crore.Further, the company signs a contract with Adani TotalEnergies E-Mobility for EV chargers.Since CY20, the stock has consistently delivered multibagger returns each year. In CY20, CY21, and CY22, it recorded gains of 194 percent, 247 percent, and 110.24 percent, respectively. In CY23, the stock surged by an impressive 382 percent.In the current year, the stock has already risen by 72 percent , climbing from  ₹79 to  ₹131. When compared to its CY19 low of  ₹0.70 per share, the stock has skyrocketed by 18,614 percent.Servotech Power Systems specializes in manufacturing and distributing a wide range of products, including solar solutions, LED lighting, and electric vehicle (EV) chargers. The company also offers energy-efficient solutions and power backup systems, serving sectors such as residential, commercial, and industrial markets.Positioned to take advantage of the rapid expansion in the EV industry, the company is poised to significantly boost its revenue through increased EV adoption. It is also diversifying its product portfolio to meet the growing market demand.","cleaned_content":"shares of servotech power systems a prominent ev charger manufacturer in india surged \u003cFIVE_PERCENT\u003e today reaching \u003cONE_HUNDRED\u003e per share following news of a major contract win the company announced that it has secured a significant order to set up \u003cONE_TEN\u003e dc fast ev charging stations for bangalore electricity supply company limited bescom under this contract servotech will install public ev charging stations at \u003cONE_TEN\u003e regional transport office rto locations across karnataka the company said in todays regulatory filing the project will significantly enhance the charging infrastructure for electric vehicles making it more convenient for ev owners to charge their vehicles across various regions of karnataka servotech will manage the entire project execution from planning and design to final installation this includes developing a comprehensive plan for the installation of ev charging stations at each rto location ensuring optimal placement and capacity additionally the company said it will provide warranty support and handle all necessary electrical connections and power supply arrangements sarika bhatia director of servotech power systems ltd said we are glad to be working on this project for bescom as a leading player in the ev sector this initiative brings us closer to our collective goal of transforming india into an ev powered nation we are creating our green footprints capturing every state and every region of india having recently collaborated with anert and now with bescom our robust desire towards creating an ev charging framework is growing stronger day by day and we plan to enhance our presence by collaborating with other nodal agencies and discoms in the future as well sarika bhatia added todays order win marks the companys second major order in less than two weeks on august \u003cTWO_TEN\u003e servotech secured a significant contract from the agency for new and renewable energy research and technology anert department of power govt of kerala to install \u003cONE_TEN\u003e ev charging stations under the contract servotech will build \u003cONE_TEN\u003e electric vehicle ev charging stations equipped with \u003cTHREE_TEN\u003e kw fast dc ev chargers at various locations of keralas motor vehicle department the contract includes the supply commissioning and construction of these ev charging stations additionally in late august the company expanded its reach by partnering with \u003cSIX_TEN\u003e discoms across india under the pradhan mantri surya ghar muft bijli yojana it also bagged an order of \u003cONE_THOUSAND\u003e dc fast ev chargers from bharat petroleum corporation limited bpcl valued at \u003cONE_HUNDRED\u003e crore additionally it secured another significant order for nearly \u003cONE_THOUSAND\u003e dc fast ev chargers from hindustan petroleum corporation limited hpcl and other ev charger oems worth \u003cONE_HUNDRED\u003e crore it also won an order for \u003cONE_THOUSAND\u003e dc fast ev chargers from indian oil corporation limited iocl and other oems with a total value of \u003cONE_HUNDRED\u003e crore further the company signs a contract with adani totalenergies e mobility for ev chargers since cy20 the stock has consistently delivered multibagger returns each year in cy20 cy21 and cy22 it recorded gains of \u003cONE_HUNDRED_PERCENT\u003e \u003cTWO_HUNDRED_PERCENT\u003e and \u003cONE_HUNDRED_PERCENT\u003e respectively in cy23 the stock surged by an impressive \u003cTHREE_HUNDRED_PERCENT\u003e in the current year the stock has already risen by \u003cSEVEN_TEN_PERCENT\u003e climbing from \u003cSEVEN_TEN\u003e to \u003cONE_HUNDRED\u003e when compared to its cy19 low of \u003cZERO_\u003e per share the stock has skyrocketed by \u003cONE_TEN_THOUSAND_PERCENT\u003e servotech power systems specializes in manufacturing and distributing a wide range of products including solar solutions led lighting and electric vehicle ev chargers the company also offers energy efficient solutions and power backup systems serving sectors such as residential commercial and industrial markets positioned to take advantage of the rapid expansion in the ev industry the company is poised to significantly boost its revenue through increased ev adoption it is also diversifying its product portfolio to meet the growing market demand","timestamp":"2024-09-10T14:45:00+05:30","market_timestamp":"2024-09-10T14:45:00+05:30","off_market_hours":false}