{"url":"https://www.livemint.com/market/stock-market-news/vodafone-idea-share-price-extends-losses-hits-52-week-low-11726806917467.html","title":"Vodafone Idea share price extends losses, slips below  ₹10 to hit 52-week low","description":"Vodafone Idea stock price has fallen more than 24% in the last two days after the Supreme Court of India's verdict in the Adjusted Gross Revenue (AGR) case which came as a big blow for the debt-ridden telecom company.","content":"Vodafone Idea share price plunged over 5% to hit a 52-week low on Friday, extending its losses from previous session’s fall to slip below the  ₹10 level. Vodafone Idea shares declined 5.68% to touch a 52-week low of  ₹9.79 apiece on NSE.Vodafone Idea stock price has fallen more than 24% in the last two days after the Supreme Court of India's verdict in the Adjusted Gross Revenue (AGR) case which came as a big blow for the debt-ridden telecom company.The apex court on Thursday upheld its decision on the AGR ruling and declined to hear curative petitions filed by Vodafone Idea and other telecom companies. The petitions by the telcos sought relief in the apex court’s 2019 ruling that added their non-telecom revenue to the AGR for calculating licence fees and spectrum usage charges payable to the government.“The unfavourable Supreme Court verdict comes as a big setback to Vodafone Idea. However, the sharp 20% correction in the stock price on Thursday, more or less captures the value of the incremental liability, over and above what the Street was expecting. Hereafter, the focus shall shift to VIL’s progress on key operational parameters – pace of subscriber loss, tariff hike impact and capex velocity,” Nuvama Institutional Equities said.The brokerage firm said it has long maintained that Vodafone Idea needs three events to play out to survive – capital infusion, tariff hikes and liabilities waiver. While the first two conditions have been met, liabilities waiver now appears to be off the table.“We are adjusting the target price for the entire liability ( ₹70,000 crore) of AGR dues (earlier 50%). We are maintaining estimates for now and continuing to value Vodafone Idea at 11x Sep-26 EV/EBITDA,” Nuvama said.It reiterated its ‘Hold’ rating on Vodafone Idea shares and cut the target price to  ₹11.5 apiece from  ₹16.5 earlier.At 10:15 am, Vodafone Idea shares were trading 3.95% lower at  ₹9.97 apiece on the NSE.","cleaned_content":"vodafone idea share price plunged over \u003cFIVE_PERCENT\u003e to hit a \u003cFIVE_TEN\u003e week low on friday extending its losses from previous session s fall to slip below the \u003cONE_TEN\u003e level vodafone idea shares declined \u003cFIVE_PERCENT\u003e to touch a \u003cFIVE_TEN\u003e week low of \u003cNINE_\u003e apiece on nse vodafone idea stock price has fallen more than \u003cTWO_TEN_PERCENT\u003e in the last two days after the supreme court of indias verdict in the adjusted gross revenue agr case which came as a big blow for the debt ridden telecom company the apex court on thursday upheld its decision on the agr ruling and declined to hear curative petitions filed by vodafone idea and other telecom companies the petitions by the telcos sought relief in the apex court s \u003cTWO_THOUSAND\u003e ruling that added their non telecom revenue to the agr for calculating licence fees and spectrum usage charges payable to the government the unfavourable supreme court verdict comes as a big setback to vodafone idea however the sharp \u003cTWO_TEN_PERCENT\u003e correction in the stock price on thursday more or less captures the value of the incremental liability over and above what the street was expecting hereafter the focus shall shift to vil s progress on key operational parameters pace of subscriber loss tariff hike impact and capex velocity nuvama institutional equities said the brokerage firm said it has long maintained that vodafone idea needs three events to play out to survive capital infusion tariff hikes and liabilities waiver while the first two conditions have been met liabilities waiver now appears to be off the table we are adjusting the target price for the entire liability \u003cSEVEN_TEN_THOUSAND\u003e crore of agr dues earlier \u003cFIVE_TEN_PERCENT\u003e we are maintaining estimates for now and continuing to value vodafone idea at \u003cONE_TEN\u003e x sep \u003cTWO_TEN\u003e ev ebitda nuvama said it reiterated its hold rating on vodafone idea shares and cut the target price to \u003cONE_TEN\u003e apiece from \u003cONE_TEN\u003e earlier at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am vodafone idea shares were trading \u003cTHREE_PERCENT\u003e lower at \u003cNINE_\u003e apiece on the nse","timestamp":"2024-09-20T10:16:00+05:30","market_timestamp":"2024-09-20T10:16:00+05:30","off_market_hours":false}