{"url":"https://www.livemint.com/market/stock-market-news/stocks-in-focus-from-asian-paints-to-titan-motilal-oswal-recommends-three-shares-to-buy-this-week-11726056865782.html","title":"Stocks in focus: From Asian Paints to Titan - Motilal Oswal recommends three shares to buy this week","description":"Brokerage firm Motilal Oswal has recommended three stocks - Asian Paints, PI Industries and Titan - to buy this week with decent upside move.","content":"Indian stock market: Indian shares experienced significant volatility in Wednesday's trading session. The Nifty 50 index dropped by 0.50%, falling below the 25,000 mark to end at 24,915 points. Similarly, the S\u0026P BSE Sensex decreased by 0.53%, closing at 81,485 points.“Volatility marked the trading session with intense profit-taking in late trades dragging key indices deeper in red and pulling down Nifty below the 25k mark at close. Slowdown fears in China coupled with falling crude oil prices has been causing jitters amongst the investors. All eyes will be on key US inflation data on Friday that will give some hint about the Federal Reserve’s likely move on interest rates in its policy meeting later this month. Technically, if Nifty slips below the 24753 mark, the downside risk is seen at 24441 mark, while the index could only face resistance above its all-time-high at 25333.65 mark,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd.Brokerage firm Motilal Oswal has recommended three stocks - Asian Paints, PI Industries and Titan - to buy this week with decent upside move.The stock is in uptrend and forming higher highs – higher lows structure on weekly scale from past three weeks. On daily scale the stock gave trend line breakout and formed a strong bullish candle with noticeable volumes. It is trading above its short term moving averages and base of the stock shifting higher. The ADX Line has turned up and the positive DI is well above the negative DI which suggests the up move has strength. Thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below 4950 levels on closing basis for a new life time high target towards 5600 zones.The stock is trading at life time high territory and strong set up on monthly time frame. On weekly scale the stock gave Pole \u0026 Pennant breakout with highest weekly close. The stock is holding well above its 20DEMA and MACD Indicator is on the verge of giving a bullish crossover which could confirm the upward momentum. Overall price structure is bullish which could take the stock to hit new fresh life time highs and we are recommending to buy the stock with keeping stop loss below 4480 levels on closing basis for a new life time high target towards 4900 zones.Titan gave range breakout on weekly scale after eleven weeks and formed a strong bullish candle. On daily scale as well the stock is moving higher with good surge in volumes. Good buying interest is visible across consumer stocks which may support the ongoing up move. Momentum indicator RSI also moving higher which suggest momentum to continue in coming sessions. Thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below 3600 levels on closing basis for a new life time high target towards 3900 zones.","cleaned_content":"indian stock market indian shares experienced significant volatility in wednesdays trading session the nifty \u003cFIVE_TEN\u003e index dropped by \u003cZERO_PERCENT\u003e falling below the \u003cTWO_TEN_THOUSAND\u003e mark to end at \u003cTWO_TEN_THOUSAND\u003e points similarly the s p bse sensex decreased by \u003cZERO_PERCENT\u003e closing at \u003cEIGHT_TEN_THOUSAND\u003e points volatility marked the trading session with intense profit taking in late trades dragging key indices deeper in red and pulling down nifty below the \u003cTWO_TEN\u003e k mark at close slowdown fears in china coupled with falling crude oil prices has been causing jitters amongst the investors all eyes will be on key us inflation data on friday that will give some hint about the federal reserve s likely move on interest rates in its policy meeting later this month technically if nifty slips below the \u003cTWO_TEN_THOUSAND\u003e mark the downside risk is seen at \u003cTWO_TEN_THOUSAND\u003e mark while the index could only face resistance above its all time high at \u003cTWO_TEN_THOUSAND\u003e mark said prashanth tapse senior vp research mehta equities ltd brokerage firm motilal oswal has recommended three stocks asian paints pi industries and titan to buy this week with decent upside move the stock is in uptrend and forming higher highs higher lows structure on weekly scale from past three weeks on daily scale the stock gave trend line breakout and formed a strong bullish candle with noticeable volumes it is trading above its short term moving averages and base of the stock shifting higher the adx line has turned up and the positive di is well above the negative di which suggests the up move has strength thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below \u003cFOUR_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cFIVE_THOUSAND\u003e zones the stock is trading at life time high territory and strong set up on monthly time frame on weekly scale the stock gave pole pennant breakout with highest weekly close the stock is holding well above its \u003cTWO_TEN\u003e dema and macd indicator is on the verge of giving a bullish crossover which could confirm the upward momentum overall price structure is bullish which could take the stock to hit new fresh life time highs and we are recommending to buy the stock with keeping stop loss below \u003cFOUR_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cFOUR_THOUSAND\u003e zones titan gave range breakout on weekly scale after eleven weeks and formed a strong bullish candle on daily scale as well the stock is moving higher with good surge in volumes good buying interest is visible across consumer stocks which may support the ongoing up move momentum indicator rsi also moving higher which suggest momentum to continue in coming sessions thus looking at the overall chart structure we are recommending to buy the stock with keeping stop loss below \u003cTHREE_THOUSAND\u003e levels on closing basis for a new life time high target towards \u003cTHREE_THOUSAND\u003e zones","timestamp":"2024-09-11T18:42:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}