{"url":"https://www.livemint.com/market/stock-market-news/multibagger-cochin-shipyards-garden-reach-other-defence-stocks-shares-rise-up-to-10-should-you-buy-sell-or-hold-11726819816437.html","title":"Multibagger Cochin Shipyards, Garden Reach other Defence stocks shares rise up to 10%. Should you Buy, Sell or Hold?","description":"Stock Markets Today: Multibagger Cochin Shipyards, Garden Reach Shipbuilders other Defence stocks shares gained up to 10%. The gains for the shipbuilder stocks are being driven by order flow for Garden Reach and such export orders lift earnings prospects. Buy, Sell or Hold?","content":"Stock Market Today: Cochin Shipyard Ltd ,Garden Reach Shipbuilders \u0026 Engineers Ltd, Mazagon Dock Shipbuilders Ltd share prices gained up to 10%. Other Defence stocks as Hindustan Aeronautics Ltd. Bharat Electronics and BEML Ltd share prices among others also gained upto 4%.The gains for the Defence companies as Cochin Shipyard ,Garden Reach Shipbuilders \u0026 Engineers, Mazagon Dock Shipbuilders, Bharat Electronics, BEML share prices comes after having remained under pressure in the recent past and correcting up to 30% from peaks in July.The correction in share prices was driven by higher valuations the stocks were trading at.The business outlook for defence manufacturers remains strong . Robust domestic demand and plans to increase Defence exports, all remain key earnings growth drivers, . However, the market was already factoring in much of the positive news, as was reflected in valuations, Sunil Damania, Chief Investment Officer, MojoPMS had said.After corrections the valuations have somewhat normalised , but investors need to follow stock specific approach, say analysts.Garden Reach Shipbuilders \u0026 Engineers has announced large order win recently and that has lifted sentiments towards shipbuilders said analysts leading to sharp gains in stock prices of all. Garden Reach Shipbuilders announced an order for the construction and delivery of Additional four (04) multipurpose vessels of 7,500 DWT each, totaling to eight (08) vessel. The order for Garden Reach Shipbuilders \u0026 Engineers is from M/s Carsten Rehder Schiffsmakler and Reederei GmbH \u0026 Co. The order that is to be executed in 33 Months from the date of manufacturing. As per the release the total value would be approx. $108 million for eight vessels.As of 16 September the company's order book stood at  ₹25230 Crore. And as per the current timelines, a majority of these orders should be executed by FY26 and FY27., said analysts at Antique Stock Broking. Next generation corvettes might aid the order book further. Antique like Garden Reach's growth prospects and maintained Buy ratings with a target price of  ₹2,092 indicating about 12% upside.","cleaned_content":"stock market today cochin shipyard ltd garden reach shipbuilders engineers ltd mazagon dock shipbuilders ltd share prices gained up to \u003cONE_TEN_PERCENT\u003e other defence stocks as hindustan aeronautics ltd bharat electronics and beml ltd share prices among others also gained upto \u003cFOUR_PERCENT\u003e the gains for the defence companies as cochin shipyard garden reach shipbuilders engineers mazagon dock shipbuilders bharat electronics beml share prices comes after having remained under pressure in the recent past and correcting up to \u003cTHREE_TEN_PERCENT\u003e from peaks in july the correction in share prices was driven by higher valuations the stocks were trading at the business outlook for defence manufacturers remains strong robust domestic demand and plans to increase defence exports all remain key earnings growth drivers however the market was already factoring in much of the positive news as was reflected in valuations sunil damania chief investment officer mojopms had said after corrections the valuations have somewhat normalised but investors need to follow stock specific approach say analysts garden reach shipbuilders engineers has announced large order win recently and that has lifted sentiments towards shipbuilders said analysts leading to sharp gains in stock prices of all garden reach shipbuilders announced an order for the construction and delivery of additional four \u003cFOUR_\u003e multipurpose vessels of \u003cSEVEN_THOUSAND\u003e dwt each totaling to eight \u003cEIGHT_\u003e vessel the order for garden reach shipbuilders engineers is from m s carsten rehder schiffsmakler and reederei gmbh co the order that is to be executed in \u003cTHREE_TEN\u003e months from the date of manufacturing as per the release the total value would be approx \u003cONE_HUNDRED\u003e million for eight vessels as of \u003cONE_TEN\u003e september the companys order book stood at \u003cTWO_TEN_THOUSAND\u003e crore and as per the current timelines a majority of these orders should be executed by fy26 and fy27 said analysts at antique stock broking next generation corvettes might aid the order book further antique like garden reachs growth prospects and maintained buy ratings with a target price of \u003cTWO_THOUSAND\u003e indicating about \u003cONE_TEN_PERCENT\u003e upside","timestamp":"2024-09-20T15:03:00+05:30","market_timestamp":"2024-09-20T15:03:00+05:30","off_market_hours":false}