{"url":"https://www.livemint.com/market/stock-market-news/tata-motors-stock-plummets-4-4-dips-below-rs-1000-mark-after-ubs-keeps-sell-rating-11726026663458.html","title":"Tata Motors stock plummets 5.5%, dips below  ₹1,000 mark after UBS maintains ’sell’ rating","description":"Shares of Tata Motors, a major global automobile manufacturer, fell nearly 5.5 percent in early trading today, reaching  ₹978.70. This decline marks the eighth consecutive day of losses for the stock, pushing it below the  ₹1,000 mark for the first time since late July.","content":"Shares of Tata Motors, a major global automobile manufacturer, dropped nearly 5.5 percent in early trading today, reaching  ₹978.70. This decline marks the ninth consecutive day of losses for the stock, pushing it below the  ₹1,000 mark for the first time since late July.Today's stock decline comes after the latest report of the global brokerage firm UBS Securities, which reaffirmed a 'sell' rating on the stock with a target price of  ₹825 per share. This target suggests a 20.3 percent downside from Tuesday’s closing price. UBS pointed to concerns about potential further declines due to margin pressures at the company's luxury arm, Jaguar Land Rover, and within the domestic passenger vehicle segment.UBS noted that JLR's focus on higher-margin models during the semiconductor shortage significantly boosted its average selling prices and gross margins from £49,000 and 26.7 percent in FY 2020 to £72,000 and 31 percent in FY 2024. This shift, coupled with reduced sales incentives, set JLR apart from competitors and helped buffer against weaker performance in China.However, UBS highlighted that the demand for these premium models is declining, with current orders falling below pre-COVID levels. This signals a potential slowdown in JLR’s recent success, and UBS expects discounts for Range Rover to rise.According to the company's Q1FY25 earnings report, the JLR order book fell to 1,04,000 units, down from 1,33,000 vehicles in Q4FY24.Jaguar Land Rover achieved revenue of £7.3 billion in the June quarter, its best first-quarter revenue on record, up 5 percent from the June quarter of FY24. The year-on-year increase in profitability was attributed to favourable volume, mix, and material cost improvements, though increased marketing expenses compared to the previous year offset some of those gains.Since the release of its Q1FY25 numbers in early August, the stock has been on a downward trend. Despite reporting healthy figures, the company's management expressed cautious optimism about the rest of FY25.The stock ended August with a 4 percent decline and has fallen another 12 percent so far in September. From its peak of  ₹1,176 per share, the stock has dropped 17 percent.The company expects production constraints for Jaguar Land Rover (JLR) in Q2 and Q3 due to an annual summer plant shutdown and supply chain disruptions caused by floods at a major aluminium supplier.Domestically, Tata Motors anticipates demand to rise during the festive season. Total passenger vehicle sales in August totalled approximately 44,500 units, marking a 3 percent year-over-year decrease and a 1 percent month-over-month drop.PV manufacturers are dealing with reduced consumer spending, resulting in a significant inventory buildup. Dealers are struggling to clear existing stock, prompting leading automakers to offer discounts on popular models to reduce unsold inventory.While these discounts aim to boost sales, there are concerns that they could adversely affect profit margins. Tata Motors has recently raised festive discounts to up to  ₹2.5 lakh on all petrol, diesel, and CNG cars and SUVs. The company may also offer consumer benefits of up to  ₹45,000 on popular models.","cleaned_content":"shares of tata motors a major global automobile manufacturer dropped nearly \u003cFIVE_PERCENT\u003e in early trading today reaching \u003cNINE_HUNDRED\u003e this decline marks the ninth consecutive day of losses for the stock pushing it below the \u003cONE_THOUSAND\u003e mark for the first time since late july todays stock decline comes after the latest report of the global brokerage firm ubs securities which reaffirmed a sell rating on the stock with a target price of \u003cEIGHT_HUNDRED\u003e per share this target suggests a \u003cTWO_TEN_PERCENT\u003e downside from tuesday s closing price ubs pointed to concerns about potential further declines due to margin pressures at the companys luxury arm jaguar land rover and within the domestic passenger vehicle segment ubs noted that jlrs focus on higher margin models during the semiconductor shortage significantly boosted its average selling prices and gross margins from \u003cFOUR_TEN_THOUSAND\u003e and \u003cTWO_TEN_PERCENT\u003e in fy \u003cTWO_THOUSAND\u003e to \u003cSEVEN_TEN_THOUSAND\u003e and \u003cTHREE_TEN_PERCENT\u003e in fy \u003cTWO_THOUSAND\u003e this shift coupled with reduced sales incentives set jlr apart from competitors and helped buffer against weaker performance in china however ubs highlighted that the demand for these premium models is declining with current orders falling below pre covid levels this signals a potential slowdown in jlr s recent success and ubs expects discounts for range rover to rise according to the companys q1fy25 earnings report the jlr order book fell to \u003cONE_HUNDRED_THOUSAND\u003e units down from \u003cONE_HUNDRED_THOUSAND\u003e vehicles in q4fy24 jaguar land rover achieved revenue of \u003cSEVEN_\u003e billion in the june quarter its best first quarter revenue on record up \u003cFIVE_PERCENT\u003e from the june quarter of fy24 the year on year increase in profitability was attributed to favourable volume mix and material cost improvements though increased marketing expenses compared to the previous year offset some of those gains since the release of its q1fy25 numbers in early august the stock has been on a downward trend despite reporting healthy figures the companys management expressed cautious optimism about the rest of fy25 the stock ended august with a \u003cFOUR_PERCENT\u003e decline and has fallen another \u003cONE_TEN_PERCENT\u003e so far in september from its peak of \u003cONE_THOUSAND\u003e per share the stock has dropped \u003cONE_TEN_PERCENT\u003e the company expects production constraints for jaguar land rover jlr in q2 and q3 due to an annual summer plant shutdown and supply chain disruptions caused by floods at a major aluminium supplier domestically tata motors anticipates demand to rise during the festive season total passenger vehicle sales in august totalled approximately \u003cFOUR_TEN_THOUSAND\u003e units marking a \u003cTHREE_PERCENT\u003e year over year decrease and a \u003cONE_PERCENT\u003e month over month drop pv manufacturers are dealing with reduced consumer spending resulting in a significant inventory buildup dealers are struggling to clear existing stock prompting leading automakers to offer discounts on popular models to reduce unsold inventory while these discounts aim to boost sales there are concerns that they could adversely affect profit margins tata motors has recently raised festive discounts to up to \u003cTWO_\u003e lakh on all petrol diesel and cng cars and suvs the company may also offer consumer benefits of up to \u003cFOUR_TEN_THOUSAND\u003e on popular models","timestamp":"2024-09-11T09:39:00+05:30","market_timestamp":"2024-09-11T09:39:00+05:30","off_market_hours":false}