{"url":"https://www.livemint.com/market/stock-market-news/ami-organics-rises-28-in-one-month-jm-initiates-buy-eyes-19-returns-at-rs-1-965-target-price-5-key-reasons-11726839512599.html","title":"Ami Organics rises 28% in one month; JM Financials initiates ‘buy’, eyes 19% returns at  ₹1,965 TP; 5 key reasons","description":"Ami Organics' strength in R\u0026D and manufacturing large-scale pharma intermediates will help it increase the contract revenue share in its pharma intermediates business and provide long-term sales visibility.","content":"Domestic brokerage JM Financials is bullish on Ami Organics and has initiated coverage on the small-cap pharma stock with a ‘buy’ rating based on strong volume growth prospects and robust profit over the next two to three years. The brokerage has set the target price at  ₹1,975 against a current market price (CMP) of  ₹1,625.55.The brokerage estimates Ami’s revenue to register a CAGR of 31 per cent over FY24-27E and reach  ₹~16 billion by FY27E. \"We believe Ami is on the cusp of getting a higher share of CDMO sales after successfully executing the Nubeqa contract. Moreover, the manufacturing of electrolytes would take care of growth beyond FY27E. We initiate coverage on Ami Organics with a BUY rating and a Mar’26 TP of  ₹1,965/share (based on 30x Mar’27E EPS),'' said JM Financials.Also Read: HCL Tech to declare Q2 results on THIS date, consider third interim dividend for FY25: Record date fixedThe brokerage highlighted that Ami’s strength in R\u0026D and manufacturing large-scale pharma intermediates would help it increase the contract revenue share in its pharma intermediates and provide long-term sales visibility. This will be supported by a base business of existing pharma intermediates for APIs in fast-growing chronic therapies, where Ami has a market share of 50-90 per cent.Ami, with its strong focus on innovation, has started supplying multiple intermediates for Nubeqa (Darolutamide), a prostate cancer drug, as a part of its contract with Fermion. Its recent acquisition of Baba Fine Chemicals has enabled it to enter the semiconductor chemicals space, while its existing businesses are likely to grow steadily.‘’We believe peak revenue potential from this contract could be  ₹5 billion 7.2 billion for Ami. Further, Ami has set up a 2,000 MT production capacity for each of two electrolytes additives for Li-ion batteries, which could provide peak revenue of  ₹1.5 billion by FY27, in our view,'' said JM Financials.1.Nubeqa intermediates market opportunity for Ami could be  ₹5.0 billion-7.2 billion:Ami has entered into a multi-million euro contract with Fermion for Nubeqa (Darolutamide), a drug used to treat prostate cancer. The Nubeqa contract is for the supply of five intermediates to Fermion. Bayer, jointly developing the drug with Fermion, has estimated a peak sales potential for Nubeqa at EUR 3bn+ ($ 3.3bn+) by CY30.‘’Basis our calculations, the peak market size for Nubeqa intermediates could be  ₹10 billion-12 billion. We believe Ami could achieve ~50-60 per cent market share, which would mean a peak opportunity size of ~  ₹5.0 billion- ₹7.2 billion for Ami,'' said the brokerage.Also Read: US Fed delivers supersized 50 bps rate cut: FPI inflows to stronger INR—here’s how the verdict is ‘good’ for India2.Electrolyte additives and electrolytes to propel growth:Ami is expanding its capacity to up to 2,000MT for each of the two electrolyte additives: Vinylene Corborate (VC) and Fluoroethylene Corborate (FEC). Ami is the first manufacturer of these additives outside China. These additives are used in the preparation of electrolyte formulation of Li-ion batteries.\"With a gradual increase in utilisation of these capacities, we estimate revenue contribution from these two electrolytes to be ~ ₹400 million in FY25, ~ ₹1 billion in FY26 and  ₹1.5 billion in FY27.Ami has entered into an MoU with a global electrolyte manufacturer to manufacture electrolyte solutions for battery cells. This project is expected to start contributing to Ami’s revenue from FY28. It has signed a  ₹3 billion MoU with the Gujarat government to set up a dedicated electrolyte facility.3.Strong advanced intermediates business:Ami produces pharma intermediates for many APIs in fast-growing chronic therapies. Ami has a 50-90 per cent market share in these intermediates. It has already been granted 10 process patents related to those intermediates; these patents are valid for the next 10-15 years and will enable it to retain its market share.A few APIs produced using these intermediates have started to see their product patent expire in various markets, thus opening them up for generics for which Ami supplies the intermediates.Recent legal wins for pharma players like Teva and Sandoz for launching generic Apixaban, Rivaroxaban and other drugs would allow those players to sell these drugs in multiple markets. This would help Ami increase its sales for these intermediates. Hence, these advanced intermediates would keep forming a major chunk of Ami’s revenue.Also Read: How US Fed rate cut could impact the Indian stock market? Experts suggest sectors to invest in a low-rate regime4.Pharma intermediates business contributes to 80% of total revenue:Most pharma intermediate revenue comes from Emerging Markets and Regulatory Markets, where Ami provides intermediates to pharma innovators or generic API producers. The number of drugs going off-patent creates a big opportunity for Ami’s emerging market segment. CDMO segment has started to pick up with the company entering into new, long-term contracts for various intermediates.5.Manufacturing facilities and R\u0026DAmi’s facility at Sachin, with a 144KL capacity spread, is for advanced pharma intermediate production with 13 production lines, 40 reactors, 17 dryers and a zero-liquid discharge-based system. Ami has a planned capex of INR 2.5bn for FY25, out of which  ₹700 million is to be used for Ankleshwar unit,  ₹1 billion will be capex for electrolyte additives,  ₹500 million for a captive solar power plant and remaining  ₹300 million is for maintenance.-Expect revenue CAGR of 31 per cent over FY24-FY27E: The brokerage expects Ami’s revenue to register a CAGR of 31 per cent over FY24-27E and reach ~  ₹16.1 billion in FY27E. On account of the low base in FY24, Ami could post an EPS CAGR of 76 per cent over FY24-27E.This growth will be driven by the contribution from CDMO products, including the Nubeqa intermediates sales and expected electrolyte additive sales from 2HFY25. Besides this, advanced pharma intermediates sales, and other speciality chemicals revenues are likely to grow steadily over the same period.-EPS CAGR of 75% over FY24-27E: Ami could post an EPS CAGR of 75 per cent over FY24-27E. The high CAGR is due to a low base in FY24 due to the impact of the one-off provision of Ami's US entity. RoE and RoCE will likely increase to 17 per cent and 29 per cent, respectively, by FY27.\"We initiate coverage on Ami Organics with a BUY rating and a Mar’26 TP of  ₹1,965 (based on 30x Mar’27E EPS). Ami is currently trading at ~32x/24x Mar’26E/Mar’27E EPS. At current valuations and considering the long growth runway for the business, we believe the stock can offer ~19 per cent return CAGR over the next 2-3 years even if one-year forward PE multiple compresses to ~30x vs. ~40x currently. In our FY28 numbers, electrolyte sales are not considered. Considering this, potential return CAGR could be higher than ~19 per cent, in our view,'' said JM Financials on Ami Organics.-Potential pharma intermediate issues: Delay in commercialising new products and inability to achieve optimal pricing for existing products could affect pharma segment revenue.-Underwhelming Nubeqa intermediate sales: The potential revenue from the 10-year Fermion intermediate supply contract depends on the downstream Nubeqa sales performance. Less-than-expected Nubeqa intermediate sales could affect Nubeqa intermediates demand, leading to muted pharma segment revenues for Ami.-Electrolyte production delays: Any delay in electrolyte additive production ramp-up or unplanned plant shutdowns could significantly lower capacity utilisation, leading to low offtake and muted electrolyte revenue. Further, this could lead to reduced operating leverage and subdued margins.","cleaned_content":"domestic brokerage jm financials is bullish on ami organics and has initiated coverage on the small cap pharma stock with a buy rating based on strong volume growth prospects and robust profit over the next two to three years the brokerage has set the target price at \u003cONE_THOUSAND\u003e against a current market price cmp of \u003cONE_THOUSAND\u003e the brokerage estimates ami s revenue to register a cagr of \u003cTHREE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e and reach \u003cONE_TEN\u003e billion by fy27e we believe ami is on the cusp of getting a higher share of cdmo sales after successfully executing the nubeqa contract moreover the manufacturing of electrolytes would take care of growth beyond fy27e we initiate coverage on ami organics with a buy rating and a mar \u003cTWO_TEN\u003e tp of \u003cONE_THOUSAND\u003e share based on \u003cTHREE_TEN\u003e x mar \u003cTWO_TEN\u003e e eps said jm financials also read hcl tech to declare q2 results on this date consider third interim dividend for fy25 record date fixedthe brokerage highlighted that ami s strength in r d and manufacturing large scale pharma intermediates would help it increase the contract revenue share in its pharma intermediates and provide long term sales visibility this will be supported by a base business of existing pharma intermediates for apis in fast growing chronic therapies where ami has a market share of \u003cFIVE_TEN\u003e \u003cNINE_TEN_PERCENT\u003e ami with its strong focus on innovation has started supplying multiple intermediates for nubeqa darolutamide a prostate cancer drug as a part of its contract with fermion its recent acquisition of baba fine chemicals has enabled it to enter the semiconductor chemicals space while its existing businesses are likely to grow steadily we believe peak revenue potential from this contract could be \u003cFIVE_\u003e billion \u003cSEVEN_\u003e billion for ami further ami has set up a \u003cTWO_THOUSAND\u003e mt production capacity for each of two electrolytes additives for li ion batteries which could provide peak revenue of \u003cONE_\u003e billion by fy27 in our view said jm financials 1 nubeqa intermediates market opportunity for ami could be \u003cFIVE_\u003e billion \u003cSEVEN_\u003e billion ami has entered into a multi million euro contract with fermion for nubeqa darolutamide a drug used to treat prostate cancer the nubeqa contract is for the supply of five intermediates to fermion bayer jointly developing the drug with fermion has estimated a peak sales potential for nubeqa at eur \u003cTHREE_\u003e bn \u003cTHREE_\u003e bn by cy30 basis our calculations the peak market size for nubeqa intermediates could be \u003cONE_TEN\u003e billion \u003cONE_TEN\u003e billion we believe ami could achieve \u003cFIVE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e market share which would mean a peak opportunity size of \u003cFIVE_\u003e billion \u003cSEVEN_\u003e billion for ami said the brokerage also read us fed delivers supersized \u003cFIVE_TEN\u003e bps rate cut fpi inflows to stronger inr here s how the verdict is good for india2 electrolyte additives and electrolytes to propel growth ami is expanding its capacity to up to \u003cTWO_THOUSAND\u003e mt for each of the two electrolyte additives vinylene corborate vc and fluoroethylene corborate fec ami is the first manufacturer of these additives outside china these additives are used in the preparation of electrolyte formulation of li ion batteries with a gradual increase in utilisation of these capacities we estimate revenue contribution from these two electrolytes to be \u003cFOUR_HUNDRED\u003e million in fy25 \u003cONE_\u003e billion in fy26 and \u003cONE_\u003e billion in fy27 ami has entered into an mou with a global electrolyte manufacturer to manufacture electrolyte solutions for battery cells this project is expected to start contributing to ami s revenue from fy28 it has signed a \u003cTHREE_\u003e billion mou with the gujarat government to set up a dedicated electrolyte facility 3 strong advanced intermediates business ami produces pharma intermediates for many apis in fast growing chronic therapies ami has a \u003cFIVE_TEN\u003e \u003cNINE_TEN_PERCENT\u003e market share in these intermediates it has already been granted \u003cONE_TEN\u003e process patents related to those intermediates these patents are valid for the next \u003cONE_TEN\u003e \u003cONE_TEN\u003e years and will enable it to retain its market share a few apis produced using these intermediates have started to see their product patent expire in various markets thus opening them up for generics for which ami supplies the intermediates recent legal wins for pharma players like teva and sandoz for launching generic apixaban rivaroxaban and other drugs would allow those players to sell these drugs in multiple markets this would help ami increase its sales for these intermediates hence these advanced intermediates would keep forming a major chunk of ami s revenue also read how us fed rate cut could impact the indian stock market experts suggest sectors to invest in a low rate regime4 pharma intermediates business contributes to \u003cEIGHT_TEN_PERCENT\u003e of total revenue most pharma intermediate revenue comes from emerging markets and regulatory markets where ami provides intermediates to pharma innovators or generic api producers the number of drugs going off patent creates a big opportunity for ami s emerging market segment cdmo segment has started to pick up with the company entering into new long term contracts for various intermediates 5 manufacturing facilities and r dami s facility at sachin with a \u003cONE_HUNDRED\u003e kl capacity spread is for advanced pharma intermediate production with \u003cONE_TEN\u003e production lines \u003cFOUR_TEN\u003e reactors \u003cONE_TEN\u003e dryers and a zero liquid discharge based system ami has a planned capex of inr \u003cTWO_\u003e bn for fy25 out of which \u003cSEVEN_HUNDRED\u003e million is to be used for ankleshwar unit \u003cONE_\u003e billion will be capex for electrolyte additives \u003cFIVE_HUNDRED\u003e million for a captive solar power plant and remaining \u003cTHREE_HUNDRED\u003e million is for maintenance expect revenue cagr of \u003cTHREE_TEN_PERCENT\u003e over fy24 fy27e the brokerage expects ami s revenue to register a cagr of \u003cTHREE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e and reach \u003cONE_TEN\u003e billion in fy27e on account of the low base in fy24 ami could post an eps cagr of \u003cSEVEN_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e this growth will be driven by the contribution from cdmo products including the nubeqa intermediates sales and expected electrolyte additive sales from \u003cTWO_\u003e hfy25 besides this advanced pharma intermediates sales and other speciality chemicals revenues are likely to grow steadily over the same period eps cagr of \u003cSEVEN_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e ami could post an eps cagr of \u003cSEVEN_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e the high cagr is due to a low base in fy24 due to the impact of the one off provision of amis us entity roe and roce will likely increase to \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively by fy27 we initiate coverage on ami organics with a buy rating and a mar \u003cTWO_TEN\u003e tp of \u003cONE_THOUSAND\u003e based on \u003cTHREE_TEN\u003e x mar \u003cTWO_TEN\u003e e eps ami is currently trading at \u003cTHREE_TEN\u003e x \u003cTWO_TEN\u003e x mar \u003cTWO_TEN\u003e e mar \u003cTWO_TEN\u003e e eps at current valuations and considering the long growth runway for the business we believe the stock can offer \u003cONE_TEN_PERCENT\u003e return cagr over the next \u003cTWO_\u003e \u003cTHREE_\u003e years even if one year forward pe multiple compresses to \u003cTHREE_TEN\u003e x vs \u003cFOUR_TEN\u003e x currently in our fy28 numbers electrolyte sales are not considered considering this potential return cagr could be higher than \u003cONE_TEN_PERCENT\u003e in our view said jm financials on ami organics potential pharma intermediate issues delay in commercialising new products and inability to achieve optimal pricing for existing products could affect pharma segment revenue underwhelming nubeqa intermediate sales the potential revenue from the \u003cONE_TEN\u003e year fermion intermediate supply contract depends on the downstream nubeqa sales performance less than expected nubeqa intermediate sales could affect nubeqa intermediates demand leading to muted pharma segment revenues for ami electrolyte production delays any delay in electrolyte additive production ramp up or unplanned plant shutdowns could significantly lower capacity utilisation leading to low offtake and muted electrolyte revenue further this could lead to reduced operating leverage and subdued margins","timestamp":"2024-09-20T19:14:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}