{"url":"https://www.livemint.com/market/stock-market-news/top-stock-recommendations-osho-krishan-of-angel-one-suggests-buying-cams-and-samvardhana-motherson-today-11726717261761.html","title":"Top Stock Recommendations: Osho Krishan of Angel One suggests buying CAMS, and Samvardhana Motherson today","description":"Top Stock Recommendations: Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives of Angel One, recommends buying - Computer Age Management Services Ltd (CAMS), and Samvardhana Motherson International Ltd.","content":"Stock Market News: On Thursday, the Indian stock market indices, Sensex and Nifty 50, reached all-time high levels, indicating robust investor confidence following the US Federal Reserve's decision to reduce interest rates in accordance with market predictions.The Sensex jumped by 595.85 points, equivalent to 0.72%, hitting an all-time high of 83,544.08. Meanwhile, the Nifty 50 surged by 176.65 points, or 0.70%, reaching a record peak of 25,554.20. The Nifty Bank surpassed 53,000-mark for the first time.The significant 50 basis point reduction in the Federal Reserve's benchmark interest rate might send equities markets into a consolidation period with an upward tilt, according to Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. The Fed's chief economist, Powell, expressed optimism about the US economy when he said, \"We have gained greater confidence that inflation is moving sustainably towards 2%.\" The US labor market is strong and growth is steady at the same time. The Fed's rate decreases will open the door for rate reductions in India as well.Nifty 50 Outlook by Osho Krishan, Sr. Analyst, Technical \u0026 Derivatives, Angel OneThe domestic market has settled the volatile session on a subdued note, with a modest cut of 0.16 percent ahead of the key Federal Open Market Committee (FOMC) outcome event. The benchmark index has shown significant fluctuations recently due to profit booking in the broader markets. Moreover, the increase in volatility and price action suggests that market participants have opted to secure some profits ahead of the FOMC outcome. It's worth noting that the stability of the benchmark can be attributed to the outperformance of Bank Nifty.On the level-specific front, 25,300-25,200 is anticipated to cushion any upcoming blips, while the sacrosanct support is placed at the pivotal zone of 25,000. On the higher end, 25,450-25,500 is expected to provide some resilience in the short run, followed by 25,600.Looking ahead, the overnight development of the US Fed rate outcome is anticipated to exert a substantial influence on global markets and is likely to define the intermediate trend for our indices. Given this, it is vital to exercise caution and adopt a pragmatic approach in the current scenario.On stocks to buy on Thursday, Osho Krishan recommended two stocks - Computer Age Management Services Ltd (CAMS), and Samvardhana Motherson International Ltd.CAMS has been trading in a tight range near the short-term Exponential Moving Average (EMA) on the daily chart, suggesting a period of consolidation. However, there are signs pointing to a potential uptrend. The stock has recently broken above a sloping trendline on the daily chart, and this breakout is supported by a bullish crossover on the Moving Average Convergence Divergence (MACD) indicator. These technical developments indicate the possibility of a sustained bullish movement in the stock.“Hence, we recommend to ‘BUY’ CAMS around  ₹4,500-4,480, keeping a stop loss of  ₹4,250 for a potential Target of  ₹4,900,” said Osho.Samvardhana Motherson witnessed a broad-range consolidation breakout in the last trading session, with substantial trading volumes supporting this move. The stock has been consistently trading above its Exponential Moving Average (EMA) on the daily chart for an extended period. The latest upward movement has injected even more strength into the existing bullish momentum of the stock. Additionally, the technical indicators strongly corroborate this outlook and point towards a potential further upward movement in the near future.“Hence, we recommend to ‘BUY’ Samvardhana Motherson around  ₹200, keeping a stop loss of  ₹190 for a potential Target of  ₹215-220,” said Krishan.","cleaned_content":"stock market news on thursday the indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e reached all time high levels indicating robust investor confidence following the us federal reserves decision to reduce interest rates in accordance with market predictions the sensex jumped by \u003cFIVE_HUNDRED\u003e points equivalent to \u003cZERO_PERCENT\u003e hitting an all time high of \u003cEIGHT_TEN_THOUSAND\u003e meanwhile the nifty \u003cFIVE_TEN\u003e surged by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e reaching a record peak of \u003cTWO_TEN_THOUSAND\u003e the nifty bank surpassed \u003cFIVE_TEN_THOUSAND\u003e mark for the first time the significant \u003cFIVE_TEN\u003e basis point reduction in the federal reserves benchmark interest rate might send equities markets into a consolidation period with an upward tilt according to dr v k vijayakumar chief investment strategist at geojit financial services the feds chief economist powell expressed optimism about the us economy when he said we have gained greater confidence that inflation is moving sustainably towards \u003cTWO_PERCENT\u003e the us labor market is strong and growth is steady at the same time the feds rate decreases will open the door for rate reductions in india as well nifty \u003cFIVE_TEN\u003e outlook by osho krishan sr analyst technical derivatives angel onethe domestic market has settled the volatile session on a subdued note with a modest cut of \u003cZERO_PERCENT\u003e ahead of the key federal open market committee fomc outcome event the benchmark index has shown significant fluctuations recently due to profit booking in the broader markets moreover the increase in volatility and price action suggests that market participants have opted to secure some profits ahead of the fomc outcome its worth noting that the stability of the benchmark can be attributed to the outperformance of bank nifty on the level specific front \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is anticipated to cushion any upcoming blips while the sacrosanct support is placed at the pivotal zone of \u003cTWO_TEN_THOUSAND\u003e on the higher end \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e is expected to provide some resilience in the short run followed by \u003cTWO_TEN_THOUSAND\u003e looking ahead the overnight development of the us fed rate outcome is anticipated to exert a substantial influence on global markets and is likely to define the intermediate trend for our indices given this it is vital to exercise caution and adopt a pragmatic approach in the current scenario on stocks to buy on thursday osho krishan recommended two stocks computer age management services ltd cams and samvardhana motherson international ltd cams has been trading in a tight range near the short term exponential moving average ema on the daily chart suggesting a period of consolidation however there are signs pointing to a potential uptrend the stock has recently broken above a sloping trendline on the daily chart and this breakout is supported by a bullish crossover on the moving average convergence divergence macd indicator these technical developments indicate the possibility of a sustained bullish movement in the stock hence we recommend to buy cams around \u003cFOUR_THOUSAND\u003e \u003cFOUR_THOUSAND\u003e keeping a stop loss of \u003cFOUR_THOUSAND\u003e for a potential target of \u003cFOUR_THOUSAND\u003e said osho samvardhana motherson witnessed a broad range consolidation breakout in the last trading session with substantial trading volumes supporting this move the stock has been consistently trading above its exponential moving average ema on the daily chart for an extended period the latest upward movement has injected even more strength into the existing bullish momentum of the stock additionally the technical indicators strongly corroborate this outlook and point towards a potential further upward movement in the near future hence we recommend to buy samvardhana motherson around \u003cTWO_HUNDRED\u003e keeping a stop loss of \u003cONE_HUNDRED\u003e for a potential target of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e said krishan","timestamp":"2024-09-19T10:01:00+05:30","market_timestamp":"2024-09-19T10:01:00+05:30","off_market_hours":false}