{"url":"https://www.livemint.com/market/stock-market-news/nifty-bank-hits-record-high-surpasses-53-000-mark-for-the-first-time-led-by-au-sfb-axis-hdfc-bank-11726718584999.html","title":"Nifty Bank hits record high, surpasses 53,000-mark for the first time led by AU SFB, Axis, HDFC Bank","description":"Nifty Bank surpassed 53,000 points for the first time after the US Federal Reserve cut interest rates by 50 basis points. Major banking stocks contributed to this peak, with expectations for further rate cuts in India as CPI inflation remains below the RBI's target.","content":"Nifty Bank exceeded the 53,000-point milestone for the first time following the US Federal Reserve's initiation of measures to avert a recession in the US through a larger-than-normal reduction in interest rates.In its most recent review meeting, the US Federal Reserve declared a sharp 50 basis point interest rate cut. The federal funds rate target range was lowered by 50 basis points to 4.75 to 5.0% by the US Federal Reserve monetary policy committee.Today, against the backdrop of the Fed rate-cutting cycle, Nifty Bank achieved a new peak, with significant contributions from leading banking stocks like AU Small Finance Bank (AU SFB), IDFC First Bank, Axis Bank, Bank of Baroda, and HDFC Bank, all of which experienced increases of more than 1-2%.Thursday's trading session saw the Nifty Bank starting at the 52,929.25 level and reaching an intraday high of 53,353.30.Rate reductions benefit markets in general. Usually, when the Fed lowers interest rates, foreign investment rises in emerging nations like India.The Sensex jumped by 595.85 points, equivalent to 0.72%, hitting an all-time high of 83,544.08. Meanwhile, the Nifty 50 surged by 176.65 points, or 0.70%, reaching a record peak of 25,554.20.The US Federal Reserve began its rate-reduction cycle on Wednesday, September 18, after more than four years, as the country's inflation has significantly decreased and the labour market is beginning to cool off.Going ahead, more rate cuts from the Fed are anticipated. Rates are expected to be 3.4% by the end of 2025 and 4.4% by the end of 2024. These are significant drops from the current 4.75 to 5% rate.“The rate cuts by the Fed will pave the way for rate cuts in India, too. CPI inflation coming below the RBI’s target of 4% during the last 2 months will facilitate rate cuts. Two rate cuts of 25bp each are possible in India before March 2025. In brief the market scenario is turning favourable for rate-sensitives, particularly banking,” highlighted Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.According to Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One, after recent underperformance, Nifty Bank has seen strong traction this week, especially after seeing a range breakout during the start of the week known as Inverse Head N Shoulder. It's on the verge of making a new milestone and is likely to lead the outperformance in the near term. 54,000-54,300 is the next level to watch, and 52,800 as support.“Short term trend for Nifty Bank index is positive. The index has immediate resistance around the previous swing high of 53,350, which if surpassed the we could see a continuation of the upmove towards 54,000 mark in the short term,” added Ruchit Jain, Lead Research Analyst at 5paisa.","cleaned_content":"nifty bank exceeded the \u003cFIVE_TEN_THOUSAND\u003e point milestone for the first time following the us federal reserves initiation of measures to avert a recession in the us through a larger than normal reduction in interest rates in its most recent review meeting the us federal reserve declared a sharp \u003cFIVE_TEN\u003e basis point interest rate cut the federal funds rate target range was lowered by \u003cFIVE_TEN\u003e basis points to \u003cFOUR_\u003e to \u003cFIVE_PERCENT\u003e by the us federal reserve monetary policy committee today against the backdrop of the fed rate cutting cycle nifty bank achieved a new peak with significant contributions from leading banking stocks like au small finance bank au sfb idfc first bank axis bank bank of baroda and hdfc bank all of which experienced increases of more than \u003cONE_\u003e \u003cTWO_PERCENT\u003e thursdays trading session saw the nifty bank starting at the \u003cFIVE_TEN_THOUSAND\u003e level and reaching an intraday high of \u003cFIVE_TEN_THOUSAND\u003e rate reductions benefit markets in general usually when the fed lowers interest rates foreign investment rises in emerging nations like india the sensex jumped by \u003cFIVE_HUNDRED\u003e points equivalent to \u003cZERO_PERCENT\u003e hitting an all time high of \u003cEIGHT_TEN_THOUSAND\u003e meanwhile the nifty \u003cFIVE_TEN\u003e surged by \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e reaching a record peak of \u003cTWO_TEN_THOUSAND\u003e the us federal reserve began its rate reduction cycle on wednesday september \u003cONE_TEN\u003e after more than four years as the countrys inflation has significantly decreased and the labour market is beginning to cool off going ahead more rate cuts from the fed are anticipated rates are expected to be \u003cTHREE_PERCENT\u003e by the end of \u003cTWO_THOUSAND\u003e and \u003cFOUR_PERCENT\u003e by the end of \u003cTWO_THOUSAND\u003e these are significant drops from the current \u003cFOUR_\u003e to \u003cFIVE_PERCENT\u003e rate the rate cuts by the fed will pave the way for rate cuts in india too cpi inflation coming below the rbi s target of \u003cFOUR_PERCENT\u003e during the last \u003cTWO_\u003e months will facilitate rate cuts two rate cuts of \u003cTWO_TEN\u003e bp each are possible in india before march \u003cTWO_THOUSAND\u003e in brief the market scenario is turning favourable for rate sensitives particularly banking highlighted dr v k vijayakumar chief investment strategist geojit financial services according to rajesh bhosale equity technical and derivative analyst at angel one after recent underperformance nifty bank has seen strong traction this week especially after seeing a range breakout during the start of the week known as inverse head n shoulder its on the verge of making a new milestone and is likely to lead the outperformance in the near term \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e is the next level to watch and \u003cFIVE_TEN_THOUSAND\u003e as support short term trend for nifty bank index is positive the index has immediate resistance around the previous swing high of \u003cFIVE_TEN_THOUSAND\u003e which if surpassed the we could see a continuation of the upmove towards \u003cFIVE_TEN_THOUSAND\u003e mark in the short term added ruchit jain lead research analyst at \u003cFIVE_\u003e paisa","timestamp":"2024-09-19T09:40:00+05:30","market_timestamp":"2024-09-19T09:40:00+05:30","off_market_hours":false}