{"url":"https://www.livemint.com/market/stock-market-news/piramal-pharma-share-price-jumps-23-in-september-so-far-and-68-ytd-investors-could-buy-on-dips-says-analyst-11726120969757.html","title":"Piramal Pharma share price jumps 23% in September so far and 68% YTD; investors could ’buy on dips’ says analyst","description":"Piramal Pharma share price surged 23% in September and 68% YTD, driven by strong trading volumes and growth prospects. A minor correction occurred due to profit booking. The US Biosecure Act boosts confidence in Indian CDMO players, potentially increasing business opportunities.","content":"Piramal Pharma share price has experienced a 23% surge during September, and has demonstrated a substantial 68% gain year-to-date (YTD). This positive performance is attributed to robust trading volumes and optimistic growth prospects fuelling investor enthusiasm for the company's stock. However, analysts have noted a minor correction in Piramal Pharma share price during Thursday's trading session due to profit booking activities. The recent passage of the draft US Biosecure Act has instilled renewed confidence in Indian Contract Development and Manufacturing Organisation (CDMO) players, such as Piramal Pharma, as it is anticipated to generate more business opportunities as US pharmaceutical firms seek to relocate their manufacturing operations away from China.Long-term benefits for contract manufacturers like Piramal Pharma, Laurus Labs, and Divi's Laboratories are expected following the US House's passageof the Biosecure Bill, which intends to blacklist Chinese biotech businesses, according to a Bloomberg article. More investors are probably going to turn their attention in the near future to the industry that has underperformed recently.InCred Equities noted in a research that the Biosecurity Act seeks to lessen technology transfer to China and the reliance of the US biopharmaceutical industry on China. The Act lists WuXi Apptec, Wuxi Biologics, BGI, MGI, and Complete Genomics as the five Chinese businesses that are explicitly designated. A company cannot be eligible for grants, loans, or contracts from executive agencies if it partners with any of the aforementioned businesses.Praful Bohra Director - Research, InCred Capital stated that Indian companies have traditionally excelled in the small molecule sector, with less emphasis on large molecules. Bohra expect a strong initial inflow of orders for small molecules to India. Companies like Piramal Pharma and Suven Pharma have advanced in the antibody-drug conjugate space, likely leading to increased opportunities.Piramal Pharma share price today opened at  ₹238.45 apiece on the BSE, the stock touched an intraday high of  ₹239.95, and an intraday low of  ₹230.65.According to Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One, Piramal Pharma share price is in a strong uptrend and has given a spectacular return in the current year, any dip is getting bought into and momentum has accelerated in the current month backed with strong volumes, traders should have a buy on dip approach with  ₹210 as support and  ₹260 as resistance.“Piramal Pharma share price has seen rising volumes during recent upmove and the overall trend remains positive. Investors with long positions can continue to ride the trend. The stock has good short term support around  ₹210,” said said Ruchit Jain, Lead Research Analyst at 5paisa.Due to increased sales, Piramal Pharma reportedconsolidated net loss for the first quarter ended June 30, 2024, narrowed to  ₹88.64 crore.In the same quarter of the previous fiscal year, Piramal Pharma reported a combined net loss of  ₹98.58 crore in a regulatory filing.The business stated that consolidated income from operations for the quarter under review was  ₹1,951.14 crore, up from  ₹1,748.85 crore during the same time last year.In an exchange filing, Nandini Piramal, the chairperson of Piramal Pharma, stated that the company's CDMO division continues to have steady order inflows, particularly for on-patent commercial manufacture.","cleaned_content":"piramal pharma share price has experienced a \u003cTWO_TEN_PERCENT\u003e surge during september and has demonstrated a substantial \u003cSIX_TEN_PERCENT\u003e gain year to date ytd this positive performance is attributed to robust trading volumes and optimistic growth prospects fuelling investor enthusiasm for the companys stock however analysts have noted a minor correction in piramal pharma share price during thursdays trading session due to profit booking activities the recent passage of the draft us biosecure act has instilled renewed confidence in indian contract development and manufacturing organisation cdmo players such as piramal pharma as it is anticipated to generate more business opportunities as us pharmaceutical firms seek to relocate their manufacturing operations away from china long term benefits for contract manufacturers like piramal pharma laurus labs and divis laboratories are expected following the us houses passageof the biosecure bill which intends to blacklist chinese biotech businesses according to a bloomberg article more investors are probably going to turn their attention in the near future to the industry that has underperformed recently incred equities noted in a research that the biosecurity act seeks to lessen technology transfer to china and the reliance of the us biopharmaceutical industry on china the act lists wuxi apptec wuxi biologics bgi mgi and complete genomics as the five chinese businesses that are explicitly designated a company cannot be eligible for grants loans or contracts from executive agencies if it partners with any of the aforementioned businesses praful bohra director research incred capital stated that indian companies have traditionally excelled in the small molecule sector with less emphasis on large molecules bohra expect a strong initial inflow of orders for small molecules to india companies like piramal pharma and suven pharma have advanced in the antibody drug conjugate space likely leading to increased opportunities piramal pharma share price today opened at \u003cTWO_HUNDRED\u003e apiece on the bse the stock touched an intraday high of \u003cTWO_HUNDRED\u003e and an intraday low of \u003cTWO_HUNDRED\u003e according to rajesh bhosale equity technical and derivative analyst at angel one piramal pharma share price is in a strong uptrend and has given a spectacular return in the current year any dip is getting bought into and momentum has accelerated in the current month backed with strong volumes traders should have a buy on dip approach with \u003cTWO_HUNDRED\u003e as support and \u003cTWO_HUNDRED\u003e as resistance piramal pharma share price has seen rising volumes during recent upmove and the overall trend remains positive investors with long positions can continue to ride the trend the stock has good short term support around \u003cTWO_HUNDRED\u003e said said ruchit jain lead research analyst at \u003cFIVE_\u003e paisa due to increased sales piramal pharma reportedconsolidated net loss for the first quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e narrowed to \u003cEIGHT_TEN\u003e crore in the same quarter of the previous fiscal year piramal pharma reported a combined net loss of \u003cNINE_TEN\u003e crore in a regulatory filing the business stated that consolidated income from operations for the quarter under review was \u003cONE_THOUSAND\u003e crore up from \u003cONE_THOUSAND\u003e crore during the same time last year in an exchange filing nandini piramal the chairperson of piramal pharma stated that the companys cdmo division continues to have steady order inflows particularly for on patent commercial manufacture","timestamp":"2024-09-12T12:19:00+05:30","market_timestamp":"2024-09-12T12:19:00+05:30","off_market_hours":false}