{"url":"https://www.livemint.com/market/stock-market-news/multibagger-jewellery-stock-motisons-jewellers-declares-1-10-stock-split-check-record-date-other-details-11726737604458.html","title":"Multibagger jewellery stock Motisons Jewellers declares 1:10 stock split: Check record date, other details","description":"Motisons Jewellers' shares dropped approximately 4% on September 19 following a 1:10 stock split announcement. The Board set November 9, 2024, as the Record Date for determining shareholder eligibility for the split, with the stock hitting a low of  ₹268.","content":"Shares of Motisons Jewellers experienced a decline of approximately 4 percent in intra-day trading on Thursday, September 19, following the company’s announcement of a 1:10 stock split.In an exchange filing, the company revealed that it plans to subdivide each existing equity share with a face value of  ₹10 into ten shares, each with a face value of Re. 1. The split is subject to approval from shareholders and any other required approvals. The Record Date for this split has been set for Saturday, November 9, 2024, to determine shareholder eligibility.\"Sub-division/split of company’s 1 (one) Equity Share having face value of Rs. 10/- (Rupees Ten only) each fully paid-up, into 10 (Ten) Equity shares of the company having face value of Re.1/- (Rupee One only) each fully paid-up, subject to the approval of shareholders and such other approvals as may be required,\" it said in an exchange filing.A stock split is a corporate action in which a company divides its existing shares into multiple new shares. The primary purpose of a stock split is to lower the trading price of a company's stock, making it more affordable and potentially increasing liquidity by attracting a broader range of investors.The announcement triggered a decline in Motisons' share price, which fell by as much as 3.9 percent to a day's low of  ₹268. The stock is now approximately 7 percent below its recent peak of  ₹287.85, reached on September 18. Despite this recent drop, the stock has surged about 208 percent from its 52-week low of  ₹87.10 recorded in December last year.Since its IPO, Motisons Jewellers' stock has been a multibagger, appreciating over 387 percent from its IPO price of  ₹55. The IPO was open for subscription from December 18-20, 2023, and the stock was listed on December 26, 2023. Year-to-date in 2024, the stock has rallied 173 percent, showing positive returns in five of the nine months so far. In September alone, the stock has risen by 60.5 percent, following a 15 percent increase in August. However, it experienced declines of 7.7 percent in July and 3.4 percent in June.The stock's recent rise was bolstered by the company's board approval on August 14 for the allotment of 10 million fully convertible warrants at an issue price of  ₹170 per share. The company aims to raise  ₹170 crore through these warrants to fund its long-term growth plans and expand its business horizons.Motisons Jewellers' FY24 annual report highlights a positive outlook for the jewellery market, which is expected to grow steadily from 2024 to 2030 due to increasing consumer demand, technological advancements, and evolving consumer preferences. The global jewellery market is projected to reach $310.90 billion in 2024 and grow at a compound annual growth rate (CAGR) of 3.53 percent through 2028. India, the world's largest revenue generator in the jewellery sector, is anticipated to see its market reach $81.26 billion in 2024, with a CAGR of 4.59 percent from 2024 to 2028.","cleaned_content":"shares of motisons jewellers experienced a decline of approximately \u003cFOUR_PERCENT\u003e in intra day trading on thursday september \u003cONE_TEN\u003e following the company s announcement of a \u003cONE_\u003e \u003cONE_TEN\u003e stock split in an exchange filing the company revealed that it plans to subdivide each existing equity share with a face value of \u003cONE_TEN\u003e into ten shares each with a face value of re \u003cONE_\u003e the split is subject to approval from shareholders and any other required approvals the record date for this split has been set for saturday november \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e to determine shareholder eligibility sub division split of company s \u003cONE_\u003e one equity share having face value of rs \u003cONE_TEN\u003e rupees ten only each fully paid up into \u003cONE_TEN\u003e ten equity shares of the company having face value of re 1 rupee one only each fully paid up subject to the approval of shareholders and such other approvals as may be required it said in an exchange filing a stock split is a corporate action in which a company divides its existing shares into multiple new shares the primary purpose of a stock split is to lower the trading price of a companys stock making it more affordable and potentially increasing liquidity by attracting a broader range of investors the announcement triggered a decline in motisons share price which fell by as much as \u003cTHREE_PERCENT\u003e to a days low of \u003cTWO_HUNDRED\u003e the stock is now approximately \u003cSEVEN_PERCENT\u003e below its recent peak of \u003cTWO_HUNDRED\u003e reached on september \u003cONE_TEN\u003e despite this recent drop the stock has surged about \u003cTWO_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cEIGHT_TEN\u003e recorded in december last year since its ipo motisons jewellers stock has been a multibagger appreciating over \u003cTHREE_HUNDRED_PERCENT\u003e from its ipo price of \u003cFIVE_TEN\u003e the ipo was open for subscription from december \u003cONE_TEN\u003e \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and the stock was listed on december \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e year to date in \u003cTWO_THOUSAND\u003e the stock has rallied \u003cONE_HUNDRED_PERCENT\u003e showing positive returns in five of the nine months so far in september alone the stock has risen by \u003cSIX_TEN_PERCENT\u003e following a \u003cONE_TEN_PERCENT\u003e increase in august however it experienced declines of \u003cSEVEN_PERCENT\u003e in july and \u003cTHREE_PERCENT\u003e in june the stocks recent rise was bolstered by the companys board approval on august \u003cONE_TEN\u003e for the allotment of \u003cONE_TEN\u003e million fully convertible warrants at an issue price of \u003cONE_HUNDRED\u003e per share the company aims to raise \u003cONE_HUNDRED\u003e crore through these warrants to fund its long term growth plans and expand its business horizons motisons jewellers fy24 annual report highlights a positive outlook for the jewellery market which is expected to grow steadily from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e due to increasing consumer demand technological advancements and evolving consumer preferences the global jewellery market is projected to reach \u003cTHREE_HUNDRED\u003e billion in \u003cTWO_THOUSAND\u003e and grow at a compound annual growth rate cagr of \u003cTHREE_PERCENT\u003e through \u003cTWO_THOUSAND\u003e india the worlds largest revenue generator in the jewellery sector is anticipated to see its market reach \u003cEIGHT_TEN\u003e billion in \u003cTWO_THOUSAND\u003e with a cagr of \u003cFOUR_PERCENT\u003e from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-19T15:07:00+05:30","market_timestamp":"2024-09-19T15:07:00+05:30","off_market_hours":false}