{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11726759876690.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy today: Chandan Taparia has recommended three stocks to buy today – Kotak Bank, Jubilant Food, and ICICI Lombard.","content":"Indian stock market: Benchmark equity indices Sensex and Nifty reached new all-time highs on Thursday, following positive global trends after the U.S. Federal Reserve announced its first policy rate cut in over four years.The 30-share BSE Sensex increased by 236.57 points, or 0.29%, closing at a record high of 83,184.80. During the trading session, it surged by as much as 825.38 points, or 0.99%, to achieve an intra-day peak of 83,773.61 before retracting some gains by the end of the day.Similarly, the NSE Nifty rose by 38.25 points, or 0.15%, to finish at 25,415.80. At its highest point during the day, it jumped 234.4 points, or 0.92%, reaching a fresh intra-day record of 25,611.95.“Domestic equities cheered the 50bps rate cut by the US Fed with Nifty making fresh high above 25,600 zones. The index witnessed profit booking at a higher zone, but managed to close with gains of 38 points at 25,416. Broader market bore the brunt of the profit booking with the Nifty midcap 100 down 0.7% and the Nifty smallcap 100 down 1.3%%. Sector-wise it was a mixed bag with buying seen in FMCG, Banking, Financials \u0026 Auto. Globally, investors welcome the US rate cut as this raises the expectation of other central banks to follow suit. On the domestic front, strong FIIs buying ( ₹17600cr month till date) and advance tax collection surging by 22.6% to  ₹4.36cr lakh crore in H1FY25 too boosted the sentiments. While the US Fed policy is out, investors will look for the other three central banks' outcome namely BOJ, BOE, and China. Overall we expect the market to stay in a range with positive bias,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd.Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL, has recommended three stocks to buy today, September 20. According to him, these stocks – Kotak Bank, Jubilant Food, and ICICI Lombard– are technically placed to see a decent upmove.Price has broken out of a consolidation zone with higher-than-average buying volumes, which could support the up move. The MACD indicator has given a bullish crossover and is headed up, which confirms the upward momentum.Stock is in a strong uptrend making higher highs with noticeable buying volumes to support the uptrend. The ROC momentum indicator has turned up which confirms the up move.Price has bounced back up from its support levels with high buying volumes to confirm the bull run. The RSI indicator is on the verge of giving a bullish crossover, which could confirm the bullish momentum.","cleaned_content":"indian stock market benchmark equity indices sensex and nifty reached new all time highs on thursday following positive global trends after the u s federal reserve announced its first policy rate cut in over four years the \u003cTHREE_TEN\u003e share bse sensex increased by \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e closing at a record high of \u003cEIGHT_TEN_THOUSAND\u003e during the trading session it surged by as much as \u003cEIGHT_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to achieve an intra day peak of \u003cEIGHT_TEN_THOUSAND\u003e before retracting some gains by the end of the day similarly the nse nifty rose by \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e to finish at \u003cTWO_TEN_THOUSAND\u003e at its highest point during the day it jumped \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e reaching a fresh intra day record of \u003cTWO_TEN_THOUSAND\u003e domestic equities cheered the \u003cFIVE_TEN\u003e bps rate cut by the us fed with nifty making fresh high above \u003cTWO_TEN_THOUSAND\u003e zones the index witnessed profit booking at a higher zone but managed to close with gains of \u003cTHREE_TEN\u003e points at \u003cTWO_TEN_THOUSAND\u003e broader market bore the brunt of the profit booking with the nifty midcap \u003cONE_HUNDRED\u003e down \u003cZERO_PERCENT\u003e and the nifty smallcap \u003cONE_HUNDRED\u003e down \u003cONE_PERCENT\u003e % sector wise it was a mixed bag with buying seen in fmcg banking financials auto globally investors welcome the us rate cut as this raises the expectation of other central banks to follow suit on the domestic front strong fiis buying \u003cONE_TEN_THOUSAND\u003e cr month till date and advance tax collection surging by \u003cTWO_TEN_PERCENT\u003e to \u003cFOUR_\u003e cr lakh crore in h1fy25 too boosted the sentiments while the us fed policy is out investors will look for the other three central banks outcome namely boj boe and china overall we expect the market to stay in a range with positive bias said siddhartha khemka head research wealth management motilal oswal financial services ltd chandan taparia head equity derivatives and technicals wealth management mofsl has recommended three stocks to buy today september \u003cTWO_TEN\u003e according to him these stocks kotak bank jubilant food and icici lombard are technically placed to see a decent upmove price has broken out of a consolidation zone with higher than average buying volumes which could support the up move the macd indicator has given a bullish crossover and is headed up which confirms the upward momentum stock is in a strong uptrend making higher highs with noticeable buying volumes to support the uptrend the roc momentum indicator has turned up which confirms the up move price has bounced back up from its support levels with high buying volumes to confirm the bull run the rsi indicator is on the verge of giving a bullish crossover which could confirm the bullish momentum","timestamp":"2024-09-20T06:11:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}