{"url":"https://www.livemint.com/market/stock-market-news/short-term-funds-money-market-funds-may-outperform-as-interest-rate-cut-cycle-starts-avnish-jain-of-canara-robeco-mf-11726641123702.html","title":"Short term funds, money market funds may outperform as interest rate cut cycle starts: Avnish Jain of Canara Robeco MF","description":"If inflation continues near 4% for next few readings, we may see some policy easing from the RBI MPC, like shifting policy stance to “Neutral” as well as liquidity measures to move systemic liquidity to surplus on a durable basis, said Avnish Jain.","content":"Stock market starts discounting interest rate cuts well in advance, as is evidenced by fall in bond yields in the past few months. As and when the actual rate easing cycle starts, short term debt funds and money market funds are likely to deliver relatively better returns, says Avnish Jain, Head Fixed Income, Canara Robeco Mutual Fund. In an interview with Livemint, Jain said he expects the Reserve Bank of India (RBI) to cut repo rates and move on rate easing from December 2024 monetary policy meeting. Here are edited excerpts:While global events do form part of the RBI Monetary Policy Committee deliberations, the decision is mainly driven by local macro-economic factors. Currently, with resilient growth rate and moderating inflation, there is no urgency to reduce rates. The RBI Governor is of the opinion that bringing inflation to 4% medium term target, on a sustainable basis, is the focus and last mile challenges on inflation, especially volatile food items basket, seems to be of concern to MPC members, keeping them cautious on easing rates earlier than required.However, if inflation continues near 4% for next few readings, we may see some policy easing from the RBI MPC, like shifting policy stance to “Neutral” as well as liquidity measures to move systemic liquidity to surplus on a durable basis. We expect RBI MPC to likely move on rate easing from December 2024 policy meet.With normal monsoons, the pressure on food prices is likely to abate. However, volatile food prices could keep RBI MPC members on the edge, though low core inflation should give comfort to the RBI MPC, that second round effects from food inflation are not feeding into core inflation. With RBI MPC focussed on a 4% inflation target, any stickiness in inflation, in near term, could delay the rate easing steps, as RBI MPC continues to watch the growth inflation trajectory.Markets start discounting rate cuts well in advance, as is evidenced by fall in yields in the past few months. Since April 2024, 10-year G-Sec yields topped 7.25% and since then has hit a low of around 6.76% (as of 16 September 2024 on closing basis). US 10-year benchmark yields dropped from around 4.70% to current level of 3.62% (as of 16 September 2024 on a closing basis) in a similar period. The overall global fall in rates has led markets to discount a few rate cuts in India as well.However, the short term rate curve remains elevated, as that is mainly driven by actual rate cuts and liquidity position (surplus or deficit). As and when actual rate easing cycle starts, short term funds and money market funds are likely to deliver relatively better returns. Medium to long term fund returns is likely to depend on future expectations of inflation and rate movement trajectory at any point of time.Investors are generally advised to follow a portfolio approach for long term management of their respective investment portfolios. A portfolio may invest in different asset classes like equity, debt, real estate or commodities like gold. Debt funds may form an essential part of an investment portfolio providing diversification as they are less risky and volatile as compared to equity.Further debt funds have the potential to generate regular income for an investment portfolio and may also provide liquidity. This may make debt funds one of the integral parts of any investment portfolio. Allocation to various asset classes in an investment portfolio may depend on the investor’s risk appetite and short / long term goals. Investors are advised not to time markets, but rather follow asset allocation approach for investments.Short term rates are relatively elevated as compared to medium to long term rates, especially in corporate bonds. The curve is inverted with 12-18 months rates at the higher level than the rest of the curve. Since short term rates closely track the repo rate, any rate easing measures in near term is likely to lead to sharper drop in short-term yields. This may likely benefit money market funds like Ultra Short term or Low duration fund category.In the short to medium term, these type of shorter term funds may have the potential to deliver good returns as compared to longer duration funds, in event of rate easing cycleAs an AMC, we are focussing on improving the share of Debt Funds in our Total AUM. Currently, the AMC is carrying out an outreach program wherein it will seek to reach all the major Investors and Distributors in Debt segment with a goal in mind to open new opportunities for the AMC to engage with them and increase share of Debt AUM. The AMC has presence across almost all the fund categories in Debt space that SEBI permits, which should help us in engaging during our outreach program.Investors in India have evolved significantly over the past few years. Most of them clearly understand the risk-reward positioning of all types of schemes they have invested or are looking to invest. If designed properly, we believe that there is a good scope for Debt oriented passive strategies like ETFs and Index funds. The AMC is closely watching the space and at an opportune time will seek to introduce some passive strategies.","cleaned_content":"stock market starts discounting interest rate cuts well in advance as is evidenced by fall in bond yields in the past few months as and when the actual rate easing cycle starts short term debt funds and money market funds are likely to deliver relatively better returns says avnish jain head fixed income canara robeco mutual fund in an interview with livemint jain said he expects the reserve bank of india rbi to cut repo rates and move on rate easing from december \u003cTWO_THOUSAND\u003e monetary policy meeting here are edited excerpts while global events do form part of the rbi monetary policy committee deliberations the decision is mainly driven by local macro economic factors currently with resilient growth rate and moderating inflation there is no urgency to reduce rates the rbi governor is of the opinion that bringing inflation to \u003cFOUR_PERCENT\u003e medium term target on a sustainable basis is the focus and last mile challenges on inflation especially volatile food items basket seems to be of concern to mpc members keeping them cautious on easing rates earlier than required however if inflation continues near \u003cFOUR_PERCENT\u003e for next few readings we may see some policy easing from the rbi mpc like shifting policy stance to neutral as well as liquidity measures to move systemic liquidity to surplus on a durable basis we expect rbi mpc to likely move on rate easing from december \u003cTWO_THOUSAND\u003e policy meet with normal monsoons the pressure on food prices is likely to abate however volatile food prices could keep rbi mpc members on the edge though low core inflation should give comfort to the rbi mpc that second round effects from food inflation are not feeding into core inflation with rbi mpc focussed on a \u003cFOUR_PERCENT\u003e inflation target any stickiness in inflation in near term could delay the rate easing steps as rbi mpc continues to watch the growth inflation trajectory markets start discounting rate cuts well in advance as is evidenced by fall in yields in the past few months since april \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e year g sec yields topped \u003cSEVEN_PERCENT\u003e and since then has hit a low of around \u003cSIX_PERCENT\u003e as of \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e on closing basis us \u003cONE_TEN\u003e year benchmark yields dropped from around \u003cFOUR_PERCENT\u003e to current level of \u003cTHREE_PERCENT\u003e as of \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e on a closing basis in a similar period the overall global fall in rates has led markets to discount a few rate cuts in india as well however the short term rate curve remains elevated as that is mainly driven by actual rate cuts and liquidity position surplus or deficit as and when actual rate easing cycle starts short term funds and money market funds are likely to deliver relatively better returns medium to long term fund returns is likely to depend on future expectations of inflation and rate movement trajectory at any point of time investors are generally advised to follow a portfolio approach for long term management of their respective investment portfolios a portfolio may invest in different asset classes like equity debt real estate or commodities like gold debt funds may form an essential part of an investment portfolio providing diversification as they are less risky and volatile as compared to equity further debt funds have the potential to generate regular income for an investment portfolio and may also provide liquidity this may make debt funds one of the integral parts of any investment portfolio allocation to various asset classes in an investment portfolio may depend on the investor s risk appetite and short long term goals investors are advised not to time markets but rather follow asset allocation approach for investments short term rates are relatively elevated as compared to medium to long term rates especially in corporate bonds the curve is inverted with \u003cONE_TEN\u003e \u003cONE_TEN\u003e months rates at the higher level than the rest of the curve since short term rates closely track the repo rate any rate easing measures in near term is likely to lead to sharper drop in short term yields this may likely benefit money market funds like ultra short term or low duration fund category in the short to medium term these type of shorter term funds may have the potential to deliver good returns as compared to longer duration funds in event of rate easing cycleas an amc we are focussing on improving the share of debt funds in our total aum currently the amc is carrying out an outreach program wherein it will seek to reach all the major investors and distributors in debt segment with a goal in mind to open new opportunities for the amc to engage with them and increase share of debt aum the amc has presence across almost all the fund categories in debt space that sebi permits which should help us in engaging during our outreach program investors in india have evolved significantly over the past few years most of them clearly understand the risk reward positioning of all types of schemes they have invested or are looking to invest if designed properly we believe that there is a good scope for debt oriented passive strategies like etfs and index funds the amc is closely watching the space and at an opportune time will seek to introduce some passive strategies","timestamp":"2024-09-18T12:19:00+05:30","market_timestamp":"2024-09-18T12:19:00+05:30","off_market_hours":false}