{"url":"https://www.livemint.com/market/stock-market-news/paytm-share-price-jumps-6-crosses-rs-700-mark-for-first-time-since-january-11726640171378.html","title":"Paytm share price crosses  ₹700 mark for first time since January, up 116% from May lows","description":"The stock has been on a recovery trajectory since hitting its all-time low of  ₹310 per share and has surged by 121% to date. The stock rebounded in June with an 11.4% increase. It continued to perform well, with gains of 23% and 26% in the following two months.","content":"In a significant rebound, shares of One 97 Communications, the parent company of Paytm, rose above the  ₹700 mark in today's intraday session for the first time since January 2024. The stock peaked at  ₹703.25 per share before closing with a gain of 1.06% at  ₹671.45.The stock has been on a recovery trajectory since hitting its all-time low of  ₹310 per share and has surged by 116 per cent to date. It has recorded double-digit gains over the past four months, including September.After declining for four consecutive months, the stock rebounded in June with an 11.4 per cent increase. It continued to perform well, with gains of 23 per cent and 26 per cent in the following two months. In the current month, the stock has further strengthened, posting an additional 10 per cent gain. The stock underwent a substantial correction at the start of 2024 after the RBI directed it to wind down its payments bank.At the 2024 annual general meeting, Vijay Shekhar Sharma, CEO and founder of Paytm, said the company intends to reapply for a payment aggregator (PA) license before the Reserve Bank of India (RBI).This announcement follows Paytm Payments Services Limited (PPSL), a subsidiary of Paytm, receiving approval from the Ministry of Finance to further invest in its payment services business. According to a recent filing, Paytm confirmed that PPSL had obtained clearance from the Government of India, Ministry of Finance, Department of Financial Services, via a letter dated August 27, 2024, for downstream investment from the company into PPSLThis approval paves the way for PPSL to proceed with its PA license application to the RBI. Although Paytm's initial application for a PA license was rejected in November 2022 due to non-compliance with Press Note 3, which mandates government approval for investments from countries sharing land borders with India, the company remains committed to the process.The RBI had previously cited non-compliance with foreign direct investment (FDI) norms in Press Note 3 as the reason for the rejection and instructed Paytm to address these issues before reapplying.The Paytm CEO also reaffirmed the company’s dedication to concentrating on its core payments business while expanding its offerings in financial services, including loans, mutual funds, and insurance products, all with the goal of achieving profitability.In FY 2024, the company achieved its first full year of EBITDA profitability since its IPO, with EBITDA before ESOP reaching  ₹559 crore, a 25 per cent year-over-year revenue increase, and an 8 per cent rise in EBITDA margin.However, the RBI's directive affecting Paytm Payment Bank in January 2024 impacted revenue scale and short-term profitability. The company has since transitioned PPBL's services to other partner banks, ensuring continued service to customers and merchants.","cleaned_content":"in a significant rebound shares of one \u003cNINE_TEN\u003e communications the parent company of paytm rose above the \u003cSEVEN_HUNDRED\u003e mark in todays intraday session for the first time since january \u003cTWO_THOUSAND\u003e the stock peaked at \u003cSEVEN_HUNDRED\u003e per share before closing with a gain of \u003cONE_PERCENT\u003e at \u003cSIX_HUNDRED\u003e the stock has been on a recovery trajectory since hitting its all time low of \u003cTHREE_HUNDRED\u003e per share and has surged by \u003cONE_HUNDRED_PERCENT\u003e to date it has recorded double digit gains over the past four months including september after declining for four consecutive months the stock rebounded in june with an \u003cONE_TEN_PERCENT\u003e increase it continued to perform well with gains of \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e in the following two months in the current month the stock has further strengthened posting an additional \u003cONE_TEN_PERCENT\u003e gain the stock underwent a substantial correction at the start of \u003cTWO_THOUSAND\u003e after the rbi directed it to wind down its payments bank at the \u003cTWO_THOUSAND\u003e annual general meeting vijay shekhar sharma ceo and founder of paytm said the company intends to reapply for a payment aggregator pa license before the reserve bank of india rbi this announcement follows paytm payments services limited ppsl a subsidiary of paytm receiving approval from the ministry of finance to further invest in its payment services business according to a recent filing paytm confirmed that ppsl had obtained clearance from the government of india ministry of finance department of financial services via a letter dated august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e for downstream investment from the company into ppslthis approval paves the way for ppsl to proceed with its pa license application to the rbi although paytms initial application for a pa license was rejected in november \u003cTWO_THOUSAND\u003e due to non compliance with press note \u003cTHREE_\u003e which mandates government approval for investments from countries sharing land borders with india the company remains committed to the process the rbi had previously cited non compliance with foreign direct investment fdi norms in press note \u003cTHREE_\u003e as the reason for the rejection and instructed paytm to address these issues before reapplying the paytm ceo also reaffirmed the company s dedication to concentrating on its core payments business while expanding its offerings in financial services including loans mutual funds and insurance products all with the goal of achieving profitability in fy \u003cTWO_THOUSAND\u003e the company achieved its first full year of ebitda profitability since its ipo with ebitda before esop reaching \u003cFIVE_HUNDRED\u003e crore a \u003cTWO_TEN_PERCENT\u003e year over year revenue increase and an \u003cEIGHT_PERCENT\u003e rise in ebitda margin however the rbis directive affecting paytm payment bank in january \u003cTWO_THOUSAND\u003e impacted revenue scale and short term profitability the company has since transitioned ppbls services to other partner banks ensuring continued service to customers and merchants","timestamp":"2024-09-18T11:56:00+05:30","market_timestamp":"2024-09-18T11:56:00+05:30","off_market_hours":false}