{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-11726154382635.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today","description":"Shares to buy today: Chandan Taparia has recommended three stocks to buy today – Apollo Hospitals, Hindustan Unilever, and Havells","content":"Indian stock market: The S\u0026P BSE Sensex surpassed 83,000 points for the first time, reaching 83,020 points in trading. Meanwhile, the Nifty 50 achieved a record high of 25,433 points, approaching the 25,500 mark.The Nifty 50 ended the session with a 1.89 percent increase, closing at 25,388.90 points. The S\u0026P BSE Sensex also rose by 1.77 percent, finishing at 82,962 points. This uptick has pushed both indices into positive territory for the month. The Nifty 50 is up 0.7 percent in September, while the Sensex has gained 0.72 percent.“It was a euphoric day for the Indian equities as Nifty made a fresh high above 25400 levels amid strong buying witnessed in the last hour of the session. The index closed with handsome gains of 470 points (+1.9%) at 25389 levels. Buying was seen across sectors with major buying seen in Auto and Metals. Nifty rallied in the final hour of the session supported by buying seen in Large-cap which outperformed the broader market by 0.7%. This positive up-move was supported by heightened expectations of a 25bps rate cut by the US Fed after the inflation data came in on expected lines. Overall we expect the market to continue its ongoing momentum on the back of healthy buying by FIIs and retail participation at every dip. Key event to watch out on domestic front - India’s inflation data,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd.Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL, has recommended three stocks to buy today, September 12. According to him, these stocks –Apollo Hospitals, Hindustan Unilever, and Havells– are technically placed to see a decent upmove.The most recent candle on the daily chart has breached its previous resistance and is headed towards its All Time High. The ROC indicator has turned up which confirms the bullish trend.Price has formed a rising three candle pattern on the daily scale which is a bullish continuation pattern with higher than average buying. The ADX Line has turned up with the Positive DI being well above the negative Di.Price has given a range breakout on the Daily chart with higher than average buying volumes. The ROC momentum indicator has turned up confirming the up move.","cleaned_content":"indian stock market the s p bse sensex surpassed \u003cEIGHT_TEN_THOUSAND\u003e points for the first time reaching \u003cEIGHT_TEN_THOUSAND\u003e points in trading meanwhile the nifty \u003cFIVE_TEN\u003e achieved a record high of \u003cTWO_TEN_THOUSAND\u003e points approaching the \u003cTWO_TEN_THOUSAND\u003e mark the nifty \u003cFIVE_TEN\u003e ended the session with a \u003cONE_PERCENT\u003e increase closing at \u003cTWO_TEN_THOUSAND\u003e points the s p bse sensex also rose by \u003cONE_PERCENT\u003e finishing at \u003cEIGHT_TEN_THOUSAND\u003e points this uptick has pushed both indices into positive territory for the month the nifty \u003cFIVE_TEN\u003e is up \u003cZERO_PERCENT\u003e in september while the sensex has gained \u003cZERO_PERCENT\u003e it was a euphoric day for the indian equities as nifty made a fresh high above \u003cTWO_TEN_THOUSAND\u003e levels amid strong buying witnessed in the last hour of the session the index closed with handsome gains of \u003cFOUR_HUNDRED\u003e points \u003cONE_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e levels buying was seen across sectors with major buying seen in auto and metals nifty rallied in the final hour of the session supported by buying seen in large cap which outperformed the broader market by \u003cZERO_PERCENT\u003e this positive up move was supported by heightened expectations of a \u003cTWO_TEN\u003e bps rate cut by the us fed after the inflation data came in on expected lines overall we expect the market to continue its ongoing momentum on the back of healthy buying by fiis and retail participation at every dip key event to watch out on domestic front india s inflation data said siddhartha khemka head research wealth management motilal oswal financial services ltd chandan taparia head equity derivatives and technicals wealth management mofsl has recommended three stocks to buy today september \u003cONE_TEN\u003e according to him these stocks apollo hospitals hindustan unilever and havells are technically placed to see a decent upmove the most recent candle on the daily chart has breached its previous resistance and is headed towards its all time high the roc indicator has turned up which confirms the bullish trend price has formed a rising three candle pattern on the daily scale which is a bullish continuation pattern with higher than average buying the adx line has turned up with the positive di being well above the negative di price has given a range breakout on the daily chart with higher than average buying volumes the roc momentum indicator has turned up confirming the up move","timestamp":"2024-09-13T06:24:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}