{"url":"https://www.livemint.com/market/stock-market-news/ultratech-ambuja-cements-acc-other-shares-price-hikes-in-the-east-positive-but-sustenance-key-11726543812826.html","title":"UltraTech, Ambuja Cements, ACC, other shares- Price hikes in the east positive but sustenance key","description":"Stock Market Today: UltraTech Cement, ACC , Dalmia Bharat, Shree Cement share prices have risen 2-6% in 1 month, However many others as Ambuja Cements, The Ramco Cements share price have been flat or declined. Price hikes in east though positive but market confidence on sustenance remains key","content":"Stock Market Today: UltraTech Cement, ACC , Dalmia Bharat , Shree Cement have seen their share prices rise 2-6% in last one month. However share prices of many others still remain rangebound or flat. Ambuja Cements share price has corrected 1-2% during the period, while The Ramco Cements share price are trading almost flat.Certain price hikes taken by cement manufacturers in the east India from September. The development is positive as East India had seen significant price corrections. The cement prices in East India per 50 kg bag averaged at Rs313 during Q1FY25, lower than  ₹320 in the previous quarter and  ₹326 in the year ago quarter as per analysts data.Price hikes in east are also positive as most of the capacity expansions have taken place in East India looking at the availability of limestone, the basic raw material for manufacturing cement.As per analysts at ICICI Securities the approaching festive season and competition are key factors that may add to challenge. As per ICICI Securities, the hikes in September 2023 were untenable owing to the festive season (Durga Pujo/Diwali) restricting demand in ensuing months and unrelenting competitive intensity thereafter. With the industry production unlikely to abate, ICICI Securities sees no reason preventing history from repeating. ICICI Securities remains Neutral on the Sector currently.The price hikes in East India while may also be positive to push price sin other regions specially South India, however sustainability of price in East India itself will be watched keenlyAs per channel checks by ICICI Securities analysts , a sharp price hike of  ₹30–40/bag has been announced in east India, effective first week of September’24. Additionally, the area is expected to see more price hikes being announced to the tune of  ₹30 per bag, increasing the quantum leap to  ₹60–70 per bag as per analysts.Notably these price hikes come after a total decline of  ₹100–110/bag since September 23 as per ICICI Securities. This fact makes investors and analysts further watchful on the sustenance of the price hikes.","cleaned_content":"stock market today ultratech cement acc dalmia bharat shree cement have seen their share prices rise \u003cTWO_\u003e \u003cSIX_PERCENT\u003e in last one month however share prices of many others still remain rangebound or flat ambuja cements share price has corrected \u003cONE_\u003e \u003cTWO_PERCENT\u003e during the period while the ramco cements share price are trading almost flat certain price hikes taken by cement manufacturers in the east india from september the development is positive as east india had seen significant price corrections the cement prices in east india per \u003cFIVE_TEN\u003e kg bag averaged at rs313 during q1fy25 lower than \u003cTHREE_HUNDRED\u003e in the previous quarter and \u003cTHREE_HUNDRED\u003e in the year ago quarter as per analysts data price hikes in east are also positive as most of the capacity expansions have taken place in east india looking at the availability of limestone the basic raw material for manufacturing cement as per analysts at icici securities the approaching festive season and competition are key factors that may add to challenge as per icici securities the hikes in september \u003cTWO_THOUSAND\u003e were untenable owing to the festive season durga pujo diwali restricting demand in ensuing months and unrelenting competitive intensity thereafter with the industry production unlikely to abate icici securities sees no reason preventing history from repeating icici securities remains neutral on the sector currently the price hikes in east india while may also be positive to push price sin other regions specially south india however sustainability of price in east india itself will be watched keenlyas per channel checks by icici securities analysts a sharp price hike of \u003cTHREE_TEN\u003e \u003cFOUR_TEN\u003e bag has been announced in east india effective first week of september \u003cTWO_TEN\u003e additionally the area is expected to see more price hikes being announced to the tune of \u003cTHREE_TEN\u003e per bag increasing the quantum leap to \u003cSIX_TEN\u003e \u003cSEVEN_TEN\u003e per bag as per analysts notably these price hikes come after a total decline of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e bag since september \u003cTWO_TEN\u003e as per icici securities this fact makes investors and analysts further watchful on the sustenance of the price hikes","timestamp":"2024-09-17T11:04:00+05:30","market_timestamp":"2024-09-17T11:04:00+05:30","off_market_hours":false}