{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-rs-100-sme-stock-hits-record-high-after-strategic-collaboration-update-11726563375799.html","title":"Small-cap stock below  ₹100: SME player hits record high after strategic collaboration update","description":"Cellecor Gadgets shares surged 5% to a record high of  ₹54.9 after announcing partnerships with Hello Mobiles and Comexcell Technologies to expand its market presence in Telangana, Andhra Pradesh, and Uttar Pradesh.","content":"Shares of Cellecor Gadgets jumped 5 per cent on Wednesday, September 17, to a record high after the company announced strategic collaborations with Hello Mobiles and Comexcell Technologies.\"Cellecor Gadgets Limited is excited to announce two strategic collaborations aimed at expanding its market presence and distribution reach. The company has partnered with Hello Mobiles Pvt Ltd to enhance its retail footprint in Telangana and Andhra Pradesh and with Comexcell Technologies to extend its distribution network in Uttar Pradesh,\" it said in an exchange filing.The stock climbed 5 per cent to a new high of  ₹54.9 in intra-day deals today. It had a muted debut on the NSE SME on September 28, 2023, listing at its IPO price of  ₹92.After listing, the stock entered a corrective phase, dropping over 40 per cent from its IPO price. However, it has surged by more than 72 per cent year-to-date in 2024.In September alone, the SME stock has jumped over 62 per cent, continuing its upward trend for four consecutive months. It gained 11 per cent in August, 3 per cent in July, and 23 per cent in June. Prior to that, the stock fell 9 per cent in May after a 35.5 per cent rally in April. The first three months of the year saw declines, with losses of 29 per cent in March, 2 per cent in February, and 9.5 percent in January.Cellecor Gadgets Limited announced two key partnerships to expand its market reach. The company collaborated with Hello Mobiles Pvt Ltd to boost its retail presence in Telangana and Andhra Pradesh, offering its product range through over 100 Happi Mobiles stores. This move aimed to increase customer access to Cellecor’s smart TVs, gadgets, mobile phones, and home appliances.Cellecor also teamed up with Comexcell Technologies to enhance distribution in Uttar Pradesh. Comexcell’s vast network of 2,000 dealers would help streamline Cellecor’s regional product reach, strengthening the company’s market presence.Founded in 2012 by Ravi Agarwal, Cellecor Gadgets has grown into a major player in consumer electronics, offering a diverse range of products at affordable prices. Cellecor Gadgets is known for its innovative technology and diverse product range, including mobile phones, smart TVs, speakers, soundbars, washing machines, and more.","cleaned_content":"shares of cellecor gadgets jumped \u003cFIVE_PERCENT\u003e on wednesday september \u003cONE_TEN\u003e to a record high after the company announced strategic collaborations with hello mobiles and comexcell technologies cellecor gadgets limited is excited to announce two strategic collaborations aimed at expanding its market presence and distribution reach the company has partnered with hello mobiles pvt ltd to enhance its retail footprint in telangana and andhra pradesh and with comexcell technologies to extend its distribution network in uttar pradesh it said in an exchange filing the stock climbed \u003cFIVE_PERCENT\u003e to a new high of \u003cFIVE_TEN\u003e in intra day deals today it had a muted debut on the nse sme on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e listing at its ipo price of \u003cNINE_TEN\u003e after listing the stock entered a corrective phase dropping over \u003cFOUR_TEN_PERCENT\u003e from its ipo price however it has surged by more than \u003cSEVEN_TEN_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e in september alone the sme stock has jumped over \u003cSIX_TEN_PERCENT\u003e continuing its upward trend for four consecutive months it gained \u003cONE_TEN_PERCENT\u003e in august \u003cTHREE_PERCENT\u003e in july and \u003cTWO_TEN_PERCENT\u003e in june prior to that the stock fell \u003cNINE_PERCENT\u003e in may after a \u003cTHREE_TEN_PERCENT\u003e rally in april the first three months of the year saw declines with losses of \u003cTWO_TEN_PERCENT\u003e in march \u003cTWO_PERCENT\u003e in february and \u003cNINE_PERCENT\u003e in january cellecor gadgets limited announced two key partnerships to expand its market reach the company collaborated with hello mobiles pvt ltd to boost its retail presence in telangana and andhra pradesh offering its product range through over \u003cONE_HUNDRED\u003e happi mobiles stores this move aimed to increase customer access to cellecor s smart tvs gadgets mobile phones and home appliances cellecor also teamed up with comexcell technologies to enhance distribution in uttar pradesh comexcell s vast network of \u003cTWO_THOUSAND\u003e dealers would help streamline cellecor s regional product reach strengthening the company s market presence founded in \u003cTWO_THOUSAND\u003e by ravi agarwal cellecor gadgets has grown into a major player in consumer electronics offering a diverse range of products at affordable prices cellecor gadgets is known for its innovative technology and diverse product range including mobile phones smart tvs speakers soundbars washing machines and more","timestamp":"2024-09-17T14:57:00+05:30","market_timestamp":"2024-09-17T14:57:00+05:30","off_market_hours":false}