{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-16-11726386852807.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 16","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,435 level, a premium of nearly 62 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open higher on Monday tracking positive cues from global peers.The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,435 level, a premium of nearly 62 points from the Nifty futures’ previous close.On Friday, domestic equity market indices ended marginally lower amid profit booking at higher levels.The Sensex eased 71.77 points to close at 82,890.94, while the Nifty 50 settled 32.40 points, or 0.13%, lower at 25,356.50.Nifty 50 formed a small negative candle on the daily chart with minor lower shadow.“Technically, such range movements soon after the sharp upmoves are considered as a breather pattern and they are considered as uptrend continuation patterns. Nifty on the weekly chart moved up and has engulfed the long bear candle of previous week, hence the bearish engulfing pattern of last week has been nullified. This is positive action and normally such negations of bearish pattern results in more upsides,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.He believes the short-term trend of Nifty 50 continues to be positive and a sustainable move above 25,400 levels could pull Nifty towards the next upside of around 25,800 in the near term.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 consolidated on September 13 and closed the day lower by 32 points amidst choppy movement.“On the higher end, Nifty 50 faced resistance at the rising trendline on the daily chart. On the lower timeframes, the RSI has entered a bearish crossover, signaling an early indication of a potential bearish momentum reversal. In the near term, the trend may remain sideways,” said Rupak De, Senior Technical Analyst at LKP Securities.According to him, Nifty 50’s support is observed at 25,150 – 25,200, while resistance is seen at 25,460.VLA Ambala, Co-Founder of Stock Market Today noted that Nifty’s RSI was trading above 82, a level that has been reached only twice in its price history. Historically, after such occurrences, we have observed severe selling pressure at benchmark levels, which led to a 40-55% decline in the next months. Currently, there are no signs of reversal. Regardless, we must remain vigilant.“After reaching a fresh all-time high of 25,430.5, the benchmark index Nifty experienced a sideways trading day in the latest session. By the end of the day, it had closed below the previous day's level and formed a ‘Hanging Man’ candlestick pattern on the daily timeframe,” Ambala said.In this situation, according to Ambala, a closing level below 25,250 could trigger profit-taking in the index, while moving above the 25,530 mark may suggest the continuation of a fresh short-term rally.“The broader market is being driven by liquidity from domestic institutional investors. Hence, I advise caution, especially when foreign institutional investors are playing the role of net sellers. Factoring in these observations, I expect the Nifty to gain support between 25,230 and 25,150 and meet resistance between 25,480 and 25,550 in the next session,” Ambala said.Bank Nifty index outperformed the frontline indices on Friday and ended 165.65 points, or 0.32%, higher at 51,938.05.“Bank Nifty continues to underperform with selective stocks performing well and hence any renewed breadth in banking stocks can push Bank Nifty higher. The resistance for Bank Nifty is at 52,200 – 52,300, above that, the resistance is placed at 53,000,” said Shrey Jain, Founder \u0026 CEO, SAS Online.On the downside, Jain believes any dip to 51,600 – 51,400 will act as a strong support.According to Praveen Dwarakanath, Vice President at Hedged.in, option writer’s data for the present week’s expiry and September end expiry shows increased call and put writing, indicating a halt at the present levels.“Bank Nifty is trading on the upper Bollinger band with Thursday’s rally, however, could not continue its rally, indicating not a great strength in the index even after a rally. Although, on the daily chart, all momentum indicators are showing signs of a rally, the 52,000 level acts as a resistance for now. A breach of this level can take the index to its immediate resistance at 52,700 levels and 53,500 levels,” Dwarakanath said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on monday tracking positive cues from global peers the trends on gift nifty also indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cSIX_TEN\u003e points from the nifty futures previous close on friday domestic equity market indices ended marginally lower amid profit booking at higher levels the sensex eased \u003cSEVEN_TEN\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart with minor lower shadow technically such range movements soon after the sharp upmoves are considered as a breather pattern and they are considered as uptrend continuation patterns nifty on the weekly chart moved up and has engulfed the long bear candle of previous week hence the bearish engulfing pattern of last week has been nullified this is positive action and normally such negations of bearish pattern results in more upsides said nagaraj shetti senior technical research analyst at hdfc securities he believes the short term trend of nifty \u003cFIVE_TEN\u003e continues to be positive and a sustainable move above \u003cTWO_TEN_THOUSAND\u003e levels could pull nifty towards the next upside of around \u003cTWO_TEN_THOUSAND\u003e in the near term here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e consolidated on september \u003cONE_TEN\u003e and closed the day lower by \u003cTHREE_TEN\u003e points amidst choppy movement on the higher end nifty \u003cFIVE_TEN\u003e faced resistance at the rising trendline on the daily chart on the lower timeframes the rsi has entered a bearish crossover signaling an early indication of a potential bearish momentum reversal in the near term the trend may remain sideways said rupak de senior technical analyst at lkp securities according to him nifty \u003cFIVE_TEN\u003e s support is observed at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e while resistance is seen at \u003cTWO_TEN_THOUSAND\u003e vla ambala co founder of stock market today noted that nifty s rsi was trading above \u003cEIGHT_TEN\u003e a level that has been reached only twice in its price history historically after such occurrences we have observed severe selling pressure at benchmark levels which led to a \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e decline in the next months currently there are no signs of reversal regardless we must remain vigilant after reaching a fresh all time high of \u003cTWO_TEN_THOUSAND\u003e the benchmark index nifty experienced a sideways trading day in the latest session by the end of the day it had closed below the previous days level and formed a hanging man candlestick pattern on the daily timeframe ambala said in this situation according to ambala a closing level below \u003cTWO_TEN_THOUSAND\u003e could trigger profit taking in the index while moving above the \u003cTWO_TEN_THOUSAND\u003e mark may suggest the continuation of a fresh short term rally the broader market is being driven by liquidity from domestic institutional investors hence i advise caution especially when foreign institutional investors are playing the role of net sellers factoring in these observations i expect the nifty to gain support between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and meet resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in the next session ambala said bank nifty index outperformed the frontline indices on friday and ended \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e bank nifty continues to underperform with selective stocks performing well and hence any renewed breadth in banking stocks can push bank nifty higher the resistance for bank nifty is at \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e above that the resistance is placed at \u003cFIVE_TEN_THOUSAND\u003e said shrey jain founder ceo sas online on the downside jain believes any dip to \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e will act as a strong support according to praveen dwarakanath vice president at hedged in option writer s data for the present week s expiry and september end expiry shows increased call and put writing indicating a halt at the present levels bank nifty is trading on the upper bollinger band with thursday s rally however could not continue its rally indicating not a great strength in the index even after a rally although on the daily chart all momentum indicators are showing signs of a rally the \u003cFIVE_TEN_THOUSAND\u003e level acts as a resistance for now a breach of this level can take the index to its immediate resistance at \u003cFIVE_TEN_THOUSAND\u003e levels and \u003cFIVE_TEN_THOUSAND\u003e levels dwarakanath said","timestamp":"2024-09-16T07:24:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}