{"url":"https://www.livemint.com/market/stock-market-news/stock-split-2024-varun-beverages-share-price-in-focus-as-stock-trades-ex-split-today-11726109058239.html","title":"Stock split 2024: Varun Beverages share price rise 5% as stock trades ex-split today","description":"Stock split 2024:Varun Beverages shares remained in focus on Thursday and gained 5% in morning trades on Thursday. as stock trades ex-split today. The shares would be divided from shares having a face value of  ₹5 each to shares with a face value of  ₹2.","content":"Stock split 2024: Varun Beverages Ltd share price gained 5% in the opening trades on Thursday. The stock remains in focus as the shares turn ex-date for a stock split today (12 September, 2024). The shares of the second-largest PepsiCo franchisee globally would be divided from shares having a face value of  ₹5 each to shares with a face value of  ₹2.The Varun Beverages share price opened at  ₹640.15 on the BSE on Thursday, higher than previous close of  ₹627.60. The Varun beverages share price thereafter gained further to intraday highs of  ₹665.65 marking gains of more than 5%The Varun Beverages share price already had risen close to 5% ever since the announcement made by the company on stock split and Thursday share price rise added further to gainsAs per the release by Varun Beverages on 2 September 2024, the Board of Directors of the company had fixed Thursday, September 12, 2024 as the “Record Date” for determining entitlement of Equity Shareholders for the purpose of sub-division or split of existing Equity Shares of the Company, such that each Equity Share having face value of Rs. 5/- (Rupees Five only) each fully paid-up, be subdivided/split into such number of Equity Shares having face value of Rs. 2/- (Rupees Two only)each fully paid-up, as approved by the Equity Shareholders through Postal Ballot on August 30, 2024.Varun Beverages share price has risen 26.61% year to date and is up 71% in last one year.Varun Beverages remains among top picks of Mirae Asset Capital Markets who had given Varun Beverages share price target of  ₹1,734 (prior to stock split) offering an expected return of 10% from the current share price. Varun Beverages has reported a 28.7% year-over-year increase in Q2CY24 revenue to  ₹73.3 billion, with a 28.1% rise in volume. Gross margins improved to 53.7%, and Ebitda margins reached 27.2%. The company showed strong performance in both the Indian and international markets, said Mirae Asset.Those at Motilal Oswal Financial Services also had maintained positive ratings with a target price of  ₹1850 post Q2FY24 results. Management had guided a double-digit volume growth in the domestic market going forward, while international market (mainly Zimbabwe) would rebound to a healthy volume growth from 3QCY24, highlighted analysts. MOFSL had largely maintain their CY24,CY25 and CY26 earnings estimates for Varun Beverages.","cleaned_content":"stock split \u003cTWO_THOUSAND\u003e varun beverages ltd share price gained \u003cFIVE_PERCENT\u003e in the opening trades on thursday the stock remains in focus as the shares turn ex date for a stock split today \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e the shares of the second largest pepsico franchisee globally would be divided from shares having a face value of \u003cFIVE_\u003e each to shares with a face value of \u003cTWO_\u003e the varun beverages share price opened at \u003cSIX_HUNDRED\u003e on the bse on thursday higher than previous close of \u003cSIX_HUNDRED\u003e the varun beverages share price thereafter gained further to intraday highs of \u003cSIX_HUNDRED\u003e marking gains of more than \u003cFIVE_PERCENT\u003e the varun beverages share price already had risen close to \u003cFIVE_PERCENT\u003e ever since the announcement made by the company on stock split and thursday share price rise added further to gainsas per the release by varun beverages on \u003cTWO_\u003e september \u003cTWO_THOUSAND\u003e the board of directors of the company had fixed thursday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date for determining entitlement of equity shareholders for the purpose of sub division or split of existing equity shares of the company such that each equity share having face value of rs \u003cFIVE_\u003e rupees five only each fully paid up be subdivided split into such number of equity shares having face value of rs \u003cTWO_\u003e rupees two only each fully paid up as approved by the equity shareholders through postal ballot on august \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e varun beverages share price has risen \u003cTWO_TEN_PERCENT\u003e year to date and is up \u003cSEVEN_TEN_PERCENT\u003e in last one year varun beverages remains among top picks of mirae asset capital markets who had given varun beverages share price target of \u003cONE_THOUSAND\u003e prior to stock split offering an expected return of \u003cONE_TEN_PERCENT\u003e from the current share price varun beverages has reported a \u003cTWO_TEN_PERCENT\u003e year over year increase in q2cy24 revenue to \u003cSEVEN_TEN\u003e billion with a \u003cTWO_TEN_PERCENT\u003e rise in volume gross margins improved to \u003cFIVE_TEN_PERCENT\u003e and ebitda margins reached \u003cTWO_TEN_PERCENT\u003e the company showed strong performance in both the indian and international markets said mirae asset those at motilal oswal financial services also had maintained positive ratings with a target price of \u003cONE_THOUSAND\u003e post q2fy24 results management had guided a double digit volume growth in the domestic market going forward while international market mainly zimbabwe would rebound to a healthy volume growth from \u003cTHREE_\u003e qcy24 highlighted analysts mofsl had largely maintain their cy24 cy25 and cy26 earnings estimates for varun beverages","timestamp":"2024-09-12T09:11:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}