{"url":"https://www.livemint.com/market/stock-market-news/ireda-share-price-jumps-over-4-after-dipam-nod-to-raise-rs-4-500-crore-via-qip-11726719141454.html","title":"IREDA share price jumps over 4% after DIPAM nod to raise  ₹4,500 crore via QIP","description":"IREDA share price has gained over 30% in one month, while the PSU stock has given multibagger returns of more than 126% year-to-date (YTD). IREDA was commanding a market capitalisation of over  ₹62,600 crore on Thursday.","content":"IREDA share price jumped over 4% in early trade on Thursday after the company received government approval for raising  ₹4,500 crore through fresh equity issue. IREDA stock price rose as much as 4.39% to  ₹237.50 apiece on the BSE.The Department of Investment and Public Asset Management (DIPAM) gave its approval to Indian Renewable Energy Development Agency (IREDA) on September 18 to raise up to  ₹4500 crore in fresh equity issue through a Qualified Institutional Placement (QIP).“The approval was granted by DIPAM based on the recommendations of a High-Level Committee. The fund-raising will be carried out through the Qualified Institutions Placement (QIP) route, with a planned dilution of the Government of India’s shareholding in IREDA by up to 7% on a post-issue basis, to be executed in one or more tranches,” IREDA said in a BSE filing.The fund-raising exercise aims to strengthen IREDA’s capital base, enabling the organization to scale its financing for renewable energy projects and further accelerate India’s transition to clean energy, it added.“DIPAM approval represents a critical step forward in our expansion plans. With fresh capital infusion, we will be better positioned to support India’s ambitious renewable energy goals and continue playing a pivotal role in financing clean energy projects across the country,” said Pradip Kumar Das, CMD, IREDA.IREDA share price has gained over 30% in one month, while the PSU stock has given multibagger returns of more than 126% year-to-date (YTD). IREDA was commanding a market capitalisation of over  ₹62,600 crore on Thursday.At 9:45 am, IREDA shares were trading 2.04% higher at  ₹232.15 apiece on the BSE.","cleaned_content":"ireda share price jumped over \u003cFOUR_PERCENT\u003e in early trade on thursday after the company received government approval for raising \u003cFOUR_THOUSAND\u003e crore through fresh equity issue ireda stock price rose as much as \u003cFOUR_PERCENT\u003e to \u003cTWO_HUNDRED\u003e apiece on the bse the department of investment and public asset management dipam gave its approval to indian renewable energy development agency ireda on september \u003cONE_TEN\u003e to raise up to \u003cFOUR_THOUSAND\u003e crore in fresh equity issue through a qualified institutional placement qip the approval was granted by dipam based on the recommendations of a high level committee the fund raising will be carried out through the qualified institutions placement qip route with a planned dilution of the government of india s shareholding in ireda by up to \u003cSEVEN_PERCENT\u003e on a post issue basis to be executed in one or more tranches ireda said in a bse filing the fund raising exercise aims to strengthen ireda s capital base enabling the organization to scale its financing for renewable energy projects and further accelerate india s transition to clean energy it added dipam approval represents a critical step forward in our expansion plans with fresh capital infusion we will be better positioned to support india s ambitious renewable energy goals and continue playing a pivotal role in financing clean energy projects across the country said pradip kumar das cmd ireda ireda share price has gained over \u003cTHREE_TEN_PERCENT\u003e in one month while the psu stock has given multibagger returns of more than \u003cONE_HUNDRED_PERCENT\u003e year to date ytd ireda was commanding a market capitalisation of over \u003cSIX_TEN_THOUSAND\u003e crore on thursday at \u003cNINE_\u003e \u003cFOUR_TEN\u003e am ireda shares were trading \u003cTWO_PERCENT\u003e higher at \u003cTWO_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-19T09:47:00+05:30","market_timestamp":"2024-09-19T09:47:00+05:30","off_market_hours":false}