{"url":"https://www.livemint.com/market/stock-market-news/mankind-pharma-shares-zoom-7-to-new-record-high-after-investec-initiates-coverage-with-buy-rating-sees-38-upside-11726805901638.html","title":"Mankind Pharma shares zoom 7% to new record high after Investec initiates coverage with ’buy’ rating, sees 36% upside","description":"Shares of Mankind Pharma rose 7% after Investec initiated coverage with a 'buy' rating. The company, known for its 36 brands, is well-positioned in the growing Indian pharmaceutical market, driven by increased healthcare expenditure and an ageing population.","content":"Shares of Mankind Pharma, India’s fourth-largest pharmaceutical company, surged 7 per cent in today's early morning trade, hitting a new all-time high  ₹2,597 per share. The rise comes after global brokerage firm Investec's initiated coverage on the stock with a 'buy' rating and a target price of  ₹3,300, indicating a potential upside of 36 per cent from the previous closing price.Investec cited Mankind's strong execution capabilities and brand equity, which are well-aligned with the super-specialty strengths of Bharat Serums and Vaccines (BSV), a brand Mankind Pharma recently acquired. The brokerage emphasized that BSV's expertise in research and development, combined with its sourcing capabilities, forms a significant competitive advantage that aligns with Mankind's strategic vision.Furthermore, Investec highlighted Mankind's robust presence in India and its vast distribution network as key factors that will drive a significant increase in BSV's India sales. This is due to the complementary synergies between the two companies. The underpenetrated in-vFitro fertilization (IVF) market also presents substantial growth potential, positioning the Mankind-BSV partnership as a future global leader in the space.Investec believes that the market is underestimating the long-term growth potential and strategic value of BSV's specialty business, which is expected to be a major growth driver for Mankind Pharma.Investec's target price is currently the highest among analysts. Previously, domestic brokerage firm Motilal Oswal had raised its target price to  ₹2,760 per share, citing Mankind's efforts to diversify its product range, gain market share in chronic therapy prescription drugs, and scale brands to revenues exceeding  ₹1 billion.The broekrage also noted Mankind's superior execution in past acquisitions, which provides strong visibility into long-term free cash flow generation.The company's shares made their debut on the Indian stock exchanges on May 9, 2023, priced at  ₹1,422, which represented a 31.7 per cent premium over the issue price of  ₹1,080 per share. Since its listing, the stock has maintained a strong upward trajectory, achieving a significant milestone in November by breaching the  ₹2,000 mark. In today's trading session the stock edged close to  ₹2,600 apiece.As of the current market price of  ₹2,573, the stock has appreciated by 138 per cent compared to its initial issue price.Mankind Pharma specializes in the development and manufacturing of pharmaceutical formulations across a range of acute and chronic therapeutic areas, and it boasts a portfolio of several well-known consumer healthcare brands. The company has approximately 36 brands, including Manforce, Prega News, Unwanted 72, Moxikind, and Nurokind, with multiple products ranking among the Top 10 in their respective markets.India’s pharmaceutical industry is poised to achieve a robust revenue growth rate of 10 per cent. This expansion will be primarily driven by increased spending on healthcare, ageing population, population expansion, a surge in lifestyle diseases, and higher awareness about quality healthcare.","cleaned_content":"shares of mankind pharma india s fourth largest pharmaceutical company surged \u003cSEVEN_PERCENT\u003e in todays early morning trade hitting a new all time high \u003cTWO_THOUSAND\u003e per share the rise comes after global brokerage firm investecs initiated coverage on the stock with a buy rating and a target price of \u003cTHREE_THOUSAND\u003e indicating a potential upside of \u003cTHREE_TEN_PERCENT\u003e from the previous closing price investec cited mankinds strong execution capabilities and brand equity which are well aligned with the super specialty strengths of bharat serums and vaccines bsv a brand mankind pharma recently acquired the brokerage emphasized that bsvs expertise in research and development combined with its sourcing capabilities forms a significant competitive advantage that aligns with mankinds strategic vision furthermore investec highlighted mankinds robust presence in india and its vast distribution network as key factors that will drive a significant increase in bsvs india sales this is due to the complementary synergies between the two companies the underpenetrated in vfitro fertilization ivf market also presents substantial growth potential positioning the mankind bsv partnership as a future global leader in the space investec believes that the market is underestimating the long term growth potential and strategic value of bsvs specialty business which is expected to be a major growth driver for mankind pharma investecs target price is currently the highest among analysts previously domestic brokerage firm motilal oswal had raised its target price to \u003cTWO_THOUSAND\u003e per share citing mankinds efforts to diversify its product range gain market share in chronic therapy prescription drugs and scale brands to revenues exceeding \u003cONE_\u003e billion the broekrage also noted mankinds superior execution in past acquisitions which provides strong visibility into long term free cash flow generation the companys shares made their debut on the indian stock exchanges on may \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e priced at \u003cONE_THOUSAND\u003e which represented a \u003cTHREE_TEN_PERCENT\u003e premium over the issue price of \u003cONE_THOUSAND\u003e per share since its listing the stock has maintained a strong upward trajectory achieving a significant milestone in november by breaching the \u003cTWO_THOUSAND\u003e mark in todays trading session the stock edged close to \u003cTWO_THOUSAND\u003e apiece as of the current market price of \u003cTWO_THOUSAND\u003e the stock has appreciated by \u003cONE_HUNDRED_PERCENT\u003e compared to its initial issue price mankind pharma specializes in the development and manufacturing of pharmaceutical formulations across a range of acute and chronic therapeutic areas and it boasts a portfolio of several well known consumer healthcare brands the company has approximately \u003cTHREE_TEN\u003e brands including manforce prega news unwanted \u003cSEVEN_TEN\u003e moxikind and nurokind with multiple products ranking among the top \u003cONE_TEN\u003e in their respective markets india s pharmaceutical industry is poised to achieve a robust revenue growth rate of \u003cONE_TEN_PERCENT\u003e this expansion will be primarily driven by increased spending on healthcare ageing population population expansion a surge in lifestyle diseases and higher awareness about quality healthcare","timestamp":"2024-09-20T10:08:00+05:30","market_timestamp":"2024-09-20T10:08:00+05:30","off_market_hours":false}