{"url":"https://www.livemint.com/market/stock-market-news/icici-bank-stock-hits-record-high-market-cap-crosses-9-lakh-crore-for-first-time-whats-driving-the-rally-11726658853957.html","title":"ICICI Bank stock hits record high, market cap crosses  ₹9 lakh crore for first time; What’s driving the rally?","description":"On September 18, ICICI Bank stock reached an all-time high of  ₹1,295 on the BSE, marking a 2 percent increase from the previous close, with a market capitalization of  ₹9.1 lakh crore.","content":"Private lender ICICI Bank, on Wednesday, became the fourth Indian company to surpass a market capitalization of  ₹9 lakh crore for the first time, following a share price increase of over 30 percent in 2024.On September 18, the stock reached an all-time high of  ₹1,295 on the BSE, marking a 2 percent increase from the previous close, with a market capitalization of  ₹9.1 lakh crore.Previously, Reliance Industries Ltd, Tata Consultancy Services Ltd, HDFC Bank, and Bharti Airtel have reached this achievement.The update comes as expectations build for a 25 or 50 basis point interest rate cut in tonight's US Fed meeting. Banks have performed strongly in today's trading session leading up to the FOMC meeting, with investors anticipating that rate cuts will favor banks and non-bank financial companies (NBFCs).ICICI Bank's shares have surged nearly 30% in both the current and previous calendar years. In the past month alone, the stock has climbed 9%, based on BSE analytics.In Q1FY25, ICICI Bank reported a 7.3% year-on-year (YoY) and 2.4% quarter-on-quarter (QoQ) increase in net interest income (NII), totaling  ₹19,553 crore, which was 1.3% below expectations. Pre-Provision Operating Profit (PPOP) grew by 13.3% YoY and 6.6% QoQ to  ₹16,025 crore. Non-interest income rose 28.8% YoY but fell 24.0% QoQ. Profit after tax surged 14.6% YoY and 3.3% QoQ to  ₹11,059 crore, exceeding estimates by 2.8%, driven by slightly higher-than-expected operating profits.ICICI Bank continued to show strong core operating performance despite macroeconomic pressures, aligning with analysts' forecasts. The bank maintained solid business momentum across various segments and is optimistic about robust deposit inflows to support credit growth in the upcoming quarters. Asset quality remained stable, despite a seasonal increase in slippages.Analysts anticipate that ICICI Bank will keep investing in branch expansion and digital banking, maintaining a stable cost-to-income ratio thanks to strong revenues in FY25E/FY26E. The bank is well-capitalized to take advantage of credit opportunities, and analysts expect its business momentum to drive superior return ratios.","cleaned_content":"private lender icici bank on wednesday became the fourth indian company to surpass a market capitalization of \u003cNINE_\u003e lakh crore for the first time following a share price increase of over \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e on september \u003cONE_TEN\u003e the stock reached an all time high of \u003cONE_THOUSAND\u003e on the bse marking a \u003cTWO_PERCENT\u003e increase from the previous close with a market capitalization of \u003cNINE_\u003e lakh crore previously reliance industries ltd tata consultancy services ltd hdfc bank and bharti airtel have reached this achievement the update comes as expectations build for a \u003cTWO_TEN\u003e or \u003cFIVE_TEN\u003e basis point interest rate cut in tonights us fed meeting banks have performed strongly in todays trading session leading up to the fomc meeting with investors anticipating that rate cuts will favor banks and non bank financial companies nbfcs icici banks shares have surged nearly \u003cTHREE_TEN_PERCENT\u003e in both the current and previous calendar years in the past month alone the stock has climbed \u003cNINE_PERCENT\u003e based on bse analytics in q1fy25 icici bank reported a \u003cSEVEN_PERCENT\u003e year on year yoy and \u003cTWO_PERCENT\u003e quarter on quarter qoq increase in net interest income nii totaling \u003cONE_TEN_THOUSAND\u003e crore which was \u003cONE_PERCENT\u003e below expectations pre provision operating profit ppop grew by \u003cONE_TEN_PERCENT\u003e yoy and \u003cSIX_PERCENT\u003e qoq to \u003cONE_TEN_THOUSAND\u003e crore non interest income rose \u003cTWO_TEN_PERCENT\u003e yoy but fell \u003cTWO_TEN_PERCENT\u003e qoq profit after tax surged \u003cONE_TEN_PERCENT\u003e yoy and \u003cTHREE_PERCENT\u003e qoq to \u003cONE_TEN_THOUSAND\u003e crore exceeding estimates by \u003cTWO_PERCENT\u003e driven by slightly higher than expected operating profits icici bank continued to show strong core operating performance despite macroeconomic pressures aligning with analysts forecasts the bank maintained solid business momentum across various segments and is optimistic about robust deposit inflows to support credit growth in the upcoming quarters asset quality remained stable despite a seasonal increase in slippages analysts anticipate that icici bank will keep investing in branch expansion and digital banking maintaining a stable cost to income ratio thanks to strong revenues in fy25e fy26e the bank is well capitalized to take advantage of credit opportunities and analysts expect its business momentum to drive superior return ratios","timestamp":"2024-09-18T17:34:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}