{"url":"https://www.livemint.com/market/stock-market-news/jewellery-stocks-tbz-motisons-jewellers-and-4-others-soar-up-to-55-in-sep-so-far-what-s-powering-the-rally-11726630416509.html","title":"Jewellery stocks TBZ, Motisons Jewellers and 4 others soar up to 55% in September so far: What’s powering the rally?","description":"Shares of Tribhovandas Bhimji Zaveri (TBZ) jumped 54% in September so far, while those of Motisons Jewellers, PC Jeweller, Senco Gold, Kalyan Jewellers, and Thangamayil Jewellery have jumped 47%, 36.35%, 18%, 16%, and 10% during the same period.","content":"Jewellery stocks are shining brightly on Dalal Street, painting a glittering picture for investors' portfolios. A surge in demand and strong market sentiment have pushed these stocks to outperform expectations, adding significant sparkle to investors' wealth.Leading companies in the sector saw substantial gains as rising gold prices and festive season demand fueled a buying frenzy. In addition, analysts have raised their target prices for these stocks, highlighting a consumer shift toward organised players.The recent Union Budget cuts in customs duties on gold and silver also sparked a rally in gold stocks. These factors have led to a sharp rise in jewellery stocks, which continued to strengthen in September.Notably, shares of Tribhovandas Bhimji Zaveri (TBZ) have jumped 54 percent in the current month so far.Meanwhile, shares of  Motisons Jewellers, PC Jeweller, Senco Gold, Kalyan Jewellers, and Thangamayil Jewellery surged 47 percent, 36.35 percent, 18 percent, 16 percent, and 10 percent during the same period.According to experts, the surge in jewellery demand in India is driven by increasing disposable incomes, a growing preference for regular wear jewellery beyond traditional wedding pieces, investment pieces, diversified product offerings (like new designs and diamonds), greater trust through hallmarking, and enhanced shopping experience at organised retail stores.Despite the strong rise in gold prices, domestic jewellery demand has continued to grow, and companies benefit from inventory gains when prices increase. Regional jewellery companies, which leave more gold inventory unhedged, profit directly from these price gains.In contrast, larger firms like Titan and Kalyan Jewellers hedge 70 percent–90 percent of their gold but still see a gain from the unhedged portion as gold prices rise.To meet rising demand, jewellery companies are rapidly expanding their footprint. Kalyan Jewellers had 89 FOCO showrooms in India as of June 30, 2024, with plans to open 80 new showrooms in FY25, having already signed Letters of Intent (LOIs) for all planned locations. Senco Gold expanded its showroom network to 165, adding six new showrooms in the June quarter.The company is preparing to launch a strong pipeline of new showrooms under both the COCO and FOFO models throughout the rest of the year, aligning with its growth strategy.India's gold demand has been on a remarkable upward trajectory in recent years, and in August, it touched a record USD 10.06 billion. This surge has been fueled by a steep cut in customs duty and heightened festive buying, further boosted by the central bank's continued gold purchases.India, the world's second-largest gold consumer after China, heavily depends on imports to satisfy its jewellery industry needs. While gold demand declined by 9 percent in the first quarter of the current financial year, the July-August 2024 period has shown promising signs of recovery, with further growth expected as the peak wedding season approaches.Analysts at Nuvama predict an 18 percent rise in industry-wide volume demand for the second half of 2024. It said that while affluent buyers led the market in the first quarter, the second quarter has seen a growing demand for lower-priced jewellery, particularly in semi-urban and rural areas.Gold has outperformed all other asset classes in 2024, providing substantial returns while maintaining its physical appeal. At the beginning of 2024, spot gold was trading at $2,062 per ounce. It has since risen 24.5 percent to $2,567 per ounce. The Nifty 50 has jumped 16 percent over the same period.The sustained rally in gold prices throughout 2024 can be attributed to various factors, including geopolitical tensions, inflation concerns, the central bank's buying, and economic uncertainties, all of which continue to drive demand upward.","cleaned_content":"jewellery stocks are shining brightly on dalal street painting a glittering picture for investors portfolios a surge in demand and strong market sentiment have pushed these stocks to outperform expectations adding significant sparkle to investors wealth leading companies in the sector saw substantial gains as rising gold prices and festive season demand fueled a buying frenzy in addition analysts have raised their target prices for these stocks highlighting a consumer shift toward organised players the recent union budget cuts in customs duties on gold and silver also sparked a rally in gold stocks these factors have led to a sharp rise in jewellery stocks which continued to strengthen in september notably shares of tribhovandas bhimji zaveri tbz have jumped \u003cFIVE_TEN_PERCENT\u003e in the current month so far meanwhile shares of motisons jewellers pc jeweller senco gold kalyan jewellers and thangamayil jewellery surged \u003cFOUR_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e during the same period according to experts the surge in jewellery demand in india is driven by increasing disposable incomes a growing preference for regular wear jewellery beyond traditional wedding pieces investment pieces diversified product offerings like new designs and diamonds greater trust through hallmarking and enhanced shopping experience at organised retail stores despite the strong rise in gold prices domestic jewellery demand has continued to grow and companies benefit from inventory gains when prices increase regional jewellery companies which leave more gold inventory unhedged profit directly from these price gains in contrast larger firms like titan and kalyan jewellers hedge \u003cSEVEN_TEN_PERCENT\u003e \u003cNINE_TEN_PERCENT\u003e of their gold but still see a gain from the unhedged portion as gold prices rise to meet rising demand jewellery companies are rapidly expanding their footprint kalyan jewellers had \u003cEIGHT_TEN\u003e foco showrooms in india as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e with plans to open \u003cEIGHT_TEN\u003e new showrooms in fy25 having already signed letters of intent lois for all planned locations senco gold expanded its showroom network to \u003cONE_HUNDRED\u003e adding six new showrooms in the june quarter the company is preparing to launch a strong pipeline of new showrooms under both the coco and fofo models throughout the rest of the year aligning with its growth strategy indias gold demand has been on a remarkable upward trajectory in recent years and in august it touched a record usd \u003cONE_TEN\u003e billion this surge has been fueled by a steep cut in customs duty and heightened festive buying further boosted by the central banks continued gold purchases india the worlds second largest gold consumer after china heavily depends on imports to satisfy its jewellery industry needs while gold demand declined by \u003cNINE_PERCENT\u003e in the first quarter of the current financial year the july august \u003cTWO_THOUSAND\u003e period has shown promising signs of recovery with further growth expected as the peak wedding season approaches analysts at nuvama predict an \u003cONE_TEN_PERCENT\u003e rise in industry wide volume demand for the second half of \u003cTWO_THOUSAND\u003e it said that while affluent buyers led the market in the first quarter the second quarter has seen a growing demand for lower priced jewellery particularly in semi urban and rural areas gold has outperformed all other asset classes in \u003cTWO_THOUSAND\u003e providing substantial returns while maintaining its physical appeal at the beginning of \u003cTWO_THOUSAND\u003e spot gold was trading at \u003cTWO_THOUSAND\u003e per ounce it has since risen \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e per ounce the nifty \u003cFIVE_TEN\u003e has jumped \u003cONE_TEN_PERCENT\u003e over the same period the sustained rally in gold prices throughout \u003cTWO_THOUSAND\u003e can be attributed to various factors including geopolitical tensions inflation concerns the central banks buying and economic uncertainties all of which continue to drive demand upward","timestamp":"2024-09-18T11:24:00+05:30","market_timestamp":"2024-09-18T11:24:00+05:30","off_market_hours":false}