{"url":"https://www.livemint.com/market/stock-market-news/icici-securities-recommends-buying-this-beaten-down-logistic-stock-sees-42-upside-potential-11726723223986.html","title":"ICICI Securities sees 42% upside in Delhivery, recommends ‘buy’—key reasons why","description":"Domestic brokerage firm ICICI Securities has maintained its 'buy' rating with a target price of  ₹600 apiece, indicating a potential upside of 42% from the latest closing price.","content":"Shares of logistics service provider Delhivery have faced significant selling pressure from investors since August 2022, trading below its IPO price of  ₹487. The stock dropped by 14.23 percent in May, and although it partially rebounded in the following months, it has yet to surpass its May highs.Domestic brokerage firm ICICI Securities identified several key factors contributing to the stock’s underperformance. These include a slowdown in the third-party logistics (3PL) market, exacerbated by increasing in-sourcing at Meesho; rapid growth in quick commerce within the e-commerce, where logistics are typically managed in-house; and rising market share among some competitors within the 3PL space.Despite these challenges, the brokerage notes that Delhivery is consolidating its leadership position in the express parcel market through cost control and service quality improvements. In the Part Truckload (PTL) segment, Delhivery has gradually approached 90 percent of the combined volumes of Delhivery and Spoton and has achieved profitability at the service EBITDA level starting Q4 FY24.Therefore, the brokerage maintains a 'buy' rating on the stock, with a target price of  ₹600 apiece, suggesting an upside potential of 42 percent from the latest closing price of  ₹423.The brokerage recently met with the company’s management, who shared insights on the market dynamics. Management informed that Meesho’s ongoing insourcing could create significant challenges for some competitors, potentially leading to market consolidation that could benefit Delhivery.They explained that disaggregation benefits only when partnering with firms with lower cost structures in specific parts of the value chain. As Delhivery considers itself a cost leader across all segments, it does not intend to list its services on platforms like Valmo.The brokerage, citing management, noted that Delhivery’s value proposition in the Part Truckload (PTL) sector lies in its broad and fast reach with high-quality service. While most PTL companies limit their networks to 4,000-5,000 pin codes due to density requirements, Delhivery’s e-commerce operations reach nearly 19,000 pin codes across the country daily.Management also informed the brokerage that Delhivery is exploring opportunities in quick commerce (QC) by leveraging its strengths in warehousing, distribution, and last-mile logistics for online brands. However, the company does not plan to compete in the 15-minute delivery ecosystem. According to management, clarity on the monetisation of its SaaS business is expected in FY26.As of March 31, 2024, Delhivery operated 29 automated sortation centres equipped with 41 sorters, handling a monthly sortation capacity of approximately 213 million shipments. This figure does not include an additional 20 smaller sorters. The efficiency of a logistics network is measured by its sortation capacity, not just the number of sorters or centres.","cleaned_content":"shares of logistics service provider delhivery have faced significant selling pressure from investors since august \u003cTWO_THOUSAND\u003e trading below its ipo price of \u003cFOUR_HUNDRED\u003e the stock dropped by \u003cONE_TEN_PERCENT\u003e in may and although it partially rebounded in the following months it has yet to surpass its may highs domestic brokerage firm icici securities identified several key factors contributing to the stock s underperformance these include a slowdown in the third party logistics \u003cTHREE_\u003e pl market exacerbated by increasing in sourcing at meesho rapid growth in quick commerce within the e commerce where logistics are typically managed in house and rising market share among some competitors within the \u003cTHREE_\u003e pl space despite these challenges the brokerage notes that delhivery is consolidating its leadership position in the express parcel market through cost control and service quality improvements in the part truckload ptl segment delhivery has gradually approached \u003cNINE_TEN_PERCENT\u003e of the combined volumes of delhivery and spoton and has achieved profitability at the service ebitda level starting q4 fy24 therefore the brokerage maintains a buy rating on the stock with a target price of \u003cSIX_HUNDRED\u003e apiece suggesting an upside potential of \u003cFOUR_TEN_PERCENT\u003e from the latest closing price of \u003cFOUR_HUNDRED\u003e the brokerage recently met with the company s management who shared insights on the market dynamics management informed that meesho s ongoing insourcing could create significant challenges for some competitors potentially leading to market consolidation that could benefit delhivery they explained that disaggregation benefits only when partnering with firms with lower cost structures in specific parts of the value chain as delhivery considers itself a cost leader across all segments it does not intend to list its services on platforms like valmo the brokerage citing management noted that delhivery s value proposition in the part truckload ptl sector lies in its broad and fast reach with high quality service while most ptl companies limit their networks to \u003cFOUR_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e pin codes due to density requirements delhivery s e commerce operations reach nearly \u003cONE_TEN_THOUSAND\u003e pin codes across the country daily management also informed the brokerage that delhivery is exploring opportunities in quick commerce qc by leveraging its strengths in warehousing distribution and last mile logistics for online brands however the company does not plan to compete in the \u003cONE_TEN\u003e minute delivery ecosystem according to management clarity on the monetisation of its saas business is expected in fy26 as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e delhivery operated \u003cTWO_TEN\u003e automated sortation centres equipped with \u003cFOUR_TEN\u003e sorters handling a monthly sortation capacity of approximately \u003cTWO_HUNDRED\u003e million shipments this figure does not include an additional \u003cTWO_TEN\u003e smaller sorters the efficiency of a logistics network is measured by its sortation capacity not just the number of sorters or centres","timestamp":"2024-09-19T11:40:00+05:30","market_timestamp":"2024-09-19T11:40:00+05:30","off_market_hours":false}