{"url":"https://www.livemint.com/market/stock-market-news/granules-india-shares-plunge-16-after-usfda-inspection-ends-with-6-observations-11726130459747.html","title":"Granules India shares plunge 16% after USFDA inspection ends with 6 observations","description":"Granules India shares fell over 16% on September 12 after the USFDA inspection revealed six observations. The company reassured investors of its commitment to address the issues and uphold quality standards while promising timely updates.","content":"Granules India shares plunged over 16 percent during intraday trading on Thursday, September 12, following the company's announcement that the USFDA's inspection of its Gagillapur FD facility, conducted from August 26 to September 6, 2024, concluded with six observations.In response, the company issued a statement to reassure concerned investors, emphasizing its commitment to resolving the issues raised. \"We acknowledge that several investors have sought clarification, and we want to reassure them that we are actively addressing the observations and are fully committed to resolving the issues raised,\" Granules India said in its stock exchange filing.The company further noted, \"At Granules, quality and compliance are paramount, and these principles are deeply embedded in our ongoing review and governance processes. We will work with the USFDA to address the issues raised in the observations.\" Granules India also assured investors that it will provide timely updates on the matter.Granules India’s stock took a sharp hit, plummeting 16.3 percent to an intra-day low of  ₹566.80 on September 12. With this steep decline, the stock is now trading nearly 22 percent below its all-time high of  ₹724.55, which it touched earlier this month. Despite the recent setback, the stock has shown remarkable performance over the past year, having surged 81 percent from its 52-week low of  ₹313, recorded in September 2023.The stock has delivered multibagger returns over the last 12 months, gaining nearly 120 percent. In 2024 alone, Granules India has advanced by around 40 percent. However, in September, the stock has shed nearly 21 percent after enjoying three consecutive months of robust gains. In August, the stock climbed 14 percent, followed by a significant 28 percent surge in July, and a 17 percent rise in June.This recent sell-off, following an impressive rally, highlights the volatility surrounding the stock, especially amid regulatory scrutiny. Investors will be closely monitoring developments as the company addresses the observations raised by the USFDA during its inspection.","cleaned_content":"granules india shares plunged over \u003cONE_TEN_PERCENT\u003e during intraday trading on thursday september \u003cONE_TEN\u003e following the companys announcement that the usfdas inspection of its gagillapur fd facility conducted from august \u003cTWO_TEN\u003e to september \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e concluded with six observations in response the company issued a statement to reassure concerned investors emphasizing its commitment to resolving the issues raised we acknowledge that several investors have sought clarification and we want to reassure them that we are actively addressing the observations and are fully committed to resolving the issues raised granules india said in its stock exchange filing the company further noted at granules quality and compliance are paramount and these principles are deeply embedded in our ongoing review and governance processes we will work with the usfda to address the issues raised in the observations granules india also assured investors that it will provide timely updates on the matter granules india s stock took a sharp hit plummeting \u003cONE_TEN_PERCENT\u003e to an intra day low of \u003cFIVE_HUNDRED\u003e on september \u003cONE_TEN\u003e with this steep decline the stock is now trading nearly \u003cTWO_TEN_PERCENT\u003e below its all time high of \u003cSEVEN_HUNDRED\u003e which it touched earlier this month despite the recent setback the stock has shown remarkable performance over the past year having surged \u003cEIGHT_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTHREE_HUNDRED\u003e recorded in september \u003cTWO_THOUSAND\u003e the stock has delivered multibagger returns over the last \u003cONE_TEN\u003e months gaining nearly \u003cONE_HUNDRED_PERCENT\u003e in \u003cTWO_THOUSAND\u003e alone granules india has advanced by around \u003cFOUR_TEN_PERCENT\u003e however in september the stock has shed nearly \u003cTWO_TEN_PERCENT\u003e after enjoying three consecutive months of robust gains in august the stock climbed \u003cONE_TEN_PERCENT\u003e followed by a significant \u003cTWO_TEN_PERCENT\u003e surge in july and a \u003cONE_TEN_PERCENT\u003e rise in june this recent sell off following an impressive rally highlights the volatility surrounding the stock especially amid regulatory scrutiny investors will be closely monitoring developments as the company addresses the observations raised by the usfda during its inspection","timestamp":"2024-09-12T14:14:00+05:30","market_timestamp":"2024-09-12T14:14:00+05:30","off_market_hours":false}