{"url":"https://www.livemint.com/market/stock-market-news/popular-foundations-ipo-here-are-the-steps-to-check-allotment-status-online-gmp-as-focus-shifts-to-listing-11726828829628.html","title":"Popular Foundations IPO:Here are the steps to check allotment status online, GMP as focus shifts to listing","description":"Popular Foundations IPO;: On September 13, 2024, the IPO subscription for Popular Foundations began ending on 18 September. Here are the steps to check allotment status online, GMP as focus shifts to listing","content":"Popular Foundations IPO;: On September 13, 2024, the IPO subscription for Popular Foundations began, and it concluded on September 19, 2024.Pelatro IPO was subscribed 9.21 times with the issue subscribed 14.89 times in the retail category, 3.54 times in Other category by the last day i.e 19 September'2024On Friday, September 20, 2024, the allocation for the Popular Foundations IPO is anticipated to be completed. Tuesday, September 24, 2024 has been set as the provisional listing date for Popular Foundations IPO on BSE SME.Bigshare Services Pvt Ltd is the registrant for the Popular Foundations IPO, while Srujan Alpha Capital Advisors Llp is the book running lead manager.Since Bigshare Services Pvt Ltd is the registrar for the Popular foundation IPO and share price of Popular foundations IPO will be listed on the BSE SME, the investors therefore can check allotment for Pelatro IPO on the Bigshare Services website or the BSE websiteStep1- Click on registrar Bigshare Services Pvt Ltd website by clicking on this linkhttps://www.bigshareonline.com/ipo_Allotment.htmlStep2- Select any one server to know your IPO Allotment StatusStep 3- click on Company selection and from the drop down select the company name Popular foundations Ltd.Step 4 Select among any from these - Application No., Demat Account or PAN numberStep 5- Enter these details from the option selectedStep 6 Don't forget to enter Captcha code and thereafter click on SubmitStep1- Check on BSE website by clicking on this linkhttps://www.bseindia.com/investors/appli_check.aspxStep2- select Equity option where it asks for issue type.Step 3- select Issuers name as Popular foundations from the dropdown. Note that the company name will only appear once the allotment is outStep 3] Enter either the Application No. or PAN numberStep 4] Click Search Button thereafter.Popular foundations Ltd shares are selling at NILL premium in the unlisted market. As per investorgains.com, the IPO of Popular foundations has a grey market premium (GMP) of  ₹0 per share. This demonstrates that Pelato Itd shares are being traded on the grey market at the issue price.","cleaned_content":"popular foundations ipo on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the ipo subscription for popular foundations began and it concluded on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e pelatro ipo was subscribed \u003cNINE_\u003e times with the issue subscribed \u003cONE_TEN\u003e times in the retail category \u003cTHREE_\u003e times in other category by the last day i e \u003cONE_TEN\u003e september2024on friday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the allocation for the popular foundations ipo is anticipated to be completed tuesday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e has been set as the provisional listing date for popular foundations ipo on bse sme bigshare services pvt ltd is the registrant for the popular foundations ipo while srujan alpha capital advisors llp is the book running lead manager since bigshare services pvt ltd is the registrar for the popular foundation ipo and share price of popular foundations ipo will be listed on the bse sme the investors therefore can check allotment for pelatro ipo on the bigshare services website or the bse websitestep1 click on registrar bigshare services pvt ltd website by clicking on this linkhttps www bigshareonline com ipo allotment htmlstep2 select any one server to know your ipo allotment statusstep \u003cTHREE_\u003e click on company selection and from the drop down select the company name popular foundations ltd step \u003cFOUR_\u003e select among any from these application no demat account or pan numberstep \u003cFIVE_\u003e enter these details from the option selectedstep \u003cSIX_\u003e dont forget to enter captcha code and thereafter click on submitstep1 check on bse website by clicking on this linkhttps www bseindia com investors appli check aspxstep2 select equity option where it asks for issue type step \u003cTHREE_\u003e select issuers name as popular foundations from the dropdown note that the company name will only appear once the allotment is outstep \u003cTHREE_\u003e enter either the application no or pan numberstep \u003cFOUR_\u003e click search button thereafter popular foundations ltd shares are selling at nill premium in the unlisted market as per investorgains com the ipo of popular foundations has a grey market premium gmp of \u003cZERO_\u003e per share this demonstrates that pelato itd shares are being traded on the grey market at the issue price","timestamp":"2024-09-20T16:46:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}