{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-sept-16-11726301826077.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Sept 16","description":"Buy or sell stocks: Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — IndusInd Bank, Grasim Industries, and Tata Steel","content":"Buy or sell stocks: The Indian stock market ended lower on Friday. However, banking stocks witnessed a decent demand throughout the session. Among the frontline indices, the Nifty 50 index lost 32 points and closed at the 25,356 mark, the BSE Sensex went off 71 points and closed at 82,890, whereas the Bank Nifty index added 165 points and finished at 51,938. In the broad market, the Small-cap index outshined the frontline indices after finishing higher by 0.95 per cent. The Mid-cap index ended 0.48 per cent higher.Sumeet Bagadia, Executive Director at Choice Broking, believes the Nifty 50 index will continue trading positive soon and touch the immediate target of 25,750 to 25,800. The Choice Broking expert advised investors to maintain a buy-on-dips strategy as support placed at 25,100 is expected to remain sacrosanct. He said that trend reversal on Dalal Street could be expected anytime, and the market may soon come out of the 'Buffallow Trend' and attain a fresh bull trend on breaching the 25,500 mark.Sumeet Bagadia recommended buying these three stocks on Monday: IndusInd Bank, Grasim Industries, and Tata Steel.Here we list out three of Sumeet Bagadia's stocks for Monday:1] IndusInd Bank: Buy at  ₹1464, target  ₹1600, stop loss  ₹1400.IndusInd Bank share is currently trading at  ₹1,464.05 and has recently broken out of a falling trend line. This was followed by a successful retest of the breakout levels on the daily chart, along with a significant rise in trading volume. This breakout suggests the potential for further gains. The stock has bounced back from its support zone and has surpassed vital moving averages, including the short-term (20-day) EMA, medium-term (50-day) EMA, and long-term (200-day) EMA, all of which indicate a strengthening trend.The Relative Strength Index (RSI) is at 63.84 and trending upwards, signalling increased buying pressure and the likelihood of a continued bullish trend. If INDUSINDBK can maintain its position above the 1470 level, it could advance towards higher price targets of  ₹1575 and  ₹1600.Considering the technical indicators and intense price action, entering a long position in IndusInd Bank share at  ₹1464.05 is a promising opportunity. With a well-defined stop loss at  ₹1400 and a target price of  ₹1600, this trade offers a favourable risk-reward ratio and aligns well with the bullish market sentiment for the stock.2] Grasim Industries: Buy at  ₹2784.35, target  ₹3015, stop loss  ₹2675.Grasim's share price is currently trading at  ₹2,784.35 and remains in a long-term uptrend, consistently forming higher highs and higher lows on the daily chart. After a recent pullback from higher levels, the stock has reversed from vital support areas and broken out of a consolidation range, signalling the potential continuation of its bullish trend. A close above the 2,800 level could pave the way for an upward move towards the  ₹3,015 target.The Relative Strength Index (RSI) is at 60.09 and trending upward, further reinforcing the bullish momentum. Additionally, Grasim's share price is trading above key moving averages, including the short-term (20-day) EMA and medium-term (50-day) EMA levels, confirming the strength of the current uptrend.Based on this analysis, we recommend buying Grasim shares at  ₹2,784.35, with a stop loss of  ₹2,675 and a target price of  ₹3,015. This trade setup aligns well with the bullish technical indicators observed in the stock.3] Tata Steel: Buy at  ₹153.49, target  ₹168, stop loss Es 146.50.Tata Steel share is currently trading at  ₹153.49 and, after a sharp decline, is showing signs of reversal by breaking out of a falling trend line on the daily chart. The breakout is supported by a significant increase in trading volumes, confirming the reversal. If Tata Steel's share price can sustain its position above the  ₹156.50 level, it could move toward an upward target of  ₹168.The Relative Strength Index (RSI) stands at 50.24, in the lower range of the neutral zone, with a positive crossover, suggesting that buyers may step in soon. Additionally, Tata Steel's share price has surpassed its long-term (200-day) EMA and short-term (20-day) EMA, signalling underlying strength.Based on current technical indicators and price action, Tata Steel's share appears well-positioned for an upward move. Investors may consider buying at  ₹153.49, with a stop loss set at  ₹146.5 to manage risk. The target price of  ₹168 aligns with resistance levels, offering a favourable risk-reward ratio and presenting a promising trading opportunity.","cleaned_content":"buy or sell stocks the indian stock market ended lower on friday however banking stocks witnessed a decent demand throughout the session among the frontline indices the nifty \u003cFIVE_TEN\u003e index lost \u003cTHREE_TEN\u003e points and closed at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex went off \u003cSEVEN_TEN\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index added \u003cONE_HUNDRED\u003e points and finished at \u003cFIVE_TEN_THOUSAND\u003e in the broad market the small cap index outshined the frontline indices after finishing higher by \u003cZERO_PERCENT\u003e the mid cap index ended \u003cZERO_PERCENT\u003e higher sumeet bagadia executive director at choice broking believes the nifty \u003cFIVE_TEN\u003e index will continue trading positive soon and touch the immediate target of \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e the choice broking expert advised investors to maintain a buy on dips strategy as support placed at \u003cTWO_TEN_THOUSAND\u003e is expected to remain sacrosanct he said that trend reversal on dalal street could be expected anytime and the market may soon come out of the buffallow trend and attain a fresh bull trend on breaching the \u003cTWO_TEN_THOUSAND\u003e mark sumeet bagadia recommended buying these three stocks on monday indusind bank grasim industries and tata steel here we list out three of sumeet bagadias stocks for monday \u003cONE_\u003e indusind bank buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e indusind bank share is currently trading at \u003cONE_THOUSAND\u003e and has recently broken out of a falling trend line this was followed by a successful retest of the breakout levels on the daily chart along with a significant rise in trading volume this breakout suggests the potential for further gains the stock has bounced back from its support zone and has surpassed vital moving averages including the short term \u003cTWO_TEN\u003e day ema medium term \u003cFIVE_TEN\u003e day ema and long term \u003cTWO_HUNDRED\u003e day ema all of which indicate a strengthening trend the relative strength index rsi is at \u003cSIX_TEN\u003e and trending upwards signalling increased buying pressure and the likelihood of a continued bullish trend if indusindbk can maintain its position above the \u003cONE_THOUSAND\u003e level it could advance towards higher price targets of \u003cONE_THOUSAND\u003e and \u003cONE_THOUSAND\u003e considering the technical indicators and intense price action entering a long position in indusind bank share at \u003cONE_THOUSAND\u003e is a promising opportunity with a well defined stop loss at \u003cONE_THOUSAND\u003e and a target price of \u003cONE_THOUSAND\u003e this trade offers a favourable risk reward ratio and aligns well with the bullish market sentiment for the stock 2 grasim industries buy at \u003cTWO_THOUSAND\u003e target \u003cTHREE_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e grasims share price is currently trading at \u003cTWO_THOUSAND\u003e and remains in a long term uptrend consistently forming higher highs and higher lows on the daily chart after a recent pullback from higher levels the stock has reversed from vital support areas and broken out of a consolidation range signalling the potential continuation of its bullish trend a close above the \u003cTWO_THOUSAND\u003e level could pave the way for an upward move towards the \u003cTHREE_THOUSAND\u003e target the relative strength index rsi is at \u003cSIX_TEN\u003e and trending upward further reinforcing the bullish momentum additionally grasims share price is trading above key moving averages including the short term \u003cTWO_TEN\u003e day ema and medium term \u003cFIVE_TEN\u003e day ema levels confirming the strength of the current uptrend based on this analysis we recommend buying grasim shares at \u003cTWO_THOUSAND\u003e with a stop loss of \u003cTWO_THOUSAND\u003e and a target price of \u003cTHREE_THOUSAND\u003e this trade setup aligns well with the bullish technical indicators observed in the stock 3 tata steel buy at \u003cONE_HUNDRED\u003e target \u003cONE_HUNDRED\u003e stop loss es \u003cONE_HUNDRED\u003e tata steel share is currently trading at \u003cONE_HUNDRED\u003e and after a sharp decline is showing signs of reversal by breaking out of a falling trend line on the daily chart the breakout is supported by a significant increase in trading volumes confirming the reversal if tata steels share price can sustain its position above the \u003cONE_HUNDRED\u003e level it could move toward an upward target of \u003cONE_HUNDRED\u003e the relative strength index rsi stands at \u003cFIVE_TEN\u003e in the lower range of the neutral zone with a positive crossover suggesting that buyers may step in soon additionally tata steels share price has surpassed its long term \u003cTWO_HUNDRED\u003e day ema and short term \u003cTWO_TEN\u003e day ema signalling underlying strength based on current technical indicators and price action tata steels share appears well positioned for an upward move investors may consider buying at \u003cONE_HUNDRED\u003e with a stop loss set at \u003cONE_HUNDRED\u003e to manage risk the target price of \u003cONE_HUNDRED\u003e aligns with resistance levels offering a favourable risk reward ratio and presenting a promising trading opportunity","timestamp":"2024-09-15T07:01:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}