{"url":"https://www.livemint.com/market/stock-market-news/ashish-kacholia-mukul-agrawal-buy-stake-in-this-solar-stock-do-you-own-this-circuit-to-circuit-stock-11726113895529.html","title":"Ashish Kacholia, Mukul Agrawal buy stake in this solar stock. Do you own this circuit-to-circuit stock?","description":"Ashish Kacholia has been offered 15,54,054 shares, or a 0.87% stake, worth approximately  ₹12 crore, while Mukul Agrawal has been offered 21,62,162 shares, or 1.21% stake in Ravindra Energy. His investment amounts to around  ₹16 crore.","content":"Ace investors Ashish Kacholia and Mukul Agrawal have invested in a solar company leading to its stock hitting upper circuit on Thursday. The circuit-to-circuit stock has jumped over 27% in one week.The smallcap company in which these prominent investors have invested is Ravindra Energy, which is in the business of selling solar pumps and setting up of solar generation power plant.Ravindra Energy share price was locked in at 5% upper circuit of  ₹104.55 apiece on Thursday after the company announced that its board approved raising  ₹179.99 crore on preferential basis.The company approved issue of 2.43 crore equity shares with face value of  ₹10 each, at a premium of  ₹64 per equity share, aggregating to  ₹179.99 crore.According to a BSE filing, the allottees list shows that Ashish Rameshchandra Kacholia has been offered 15,54,054 shares, or a 0.87% stake, worth approximately  ₹12 crore.Mukul Agrawal has been offered 21,62,162 shares, or 1.21% stake in Ravindra Energy. His investment amounts to around  ₹16 crore.Ravindra Energy’s preferential share allotment also included shares offered to other investors such as Quant Mutual Fund, COEUS Global Opportunities Fund, New Vernon India Limited, Aamara Ventures LLP and others.Ravindra Energy share price has been locked in upper circuit for the sixth straight session. In one week, Ravindra Energy shares rallied 27.60%, while the stock is up 42.53% in one month.At 10:00 am, Ravindra Energy shares were still locked in at 5% upper circuit of  ₹104.55 apiece on the BSE. The company is commanding a market capitalisation of  ₹1,612.48 crore.","cleaned_content":"ace investors ashish kacholia and mukul agrawal have invested in a solar company leading to its stock hitting upper circuit on thursday the circuit to circuit stock has jumped over \u003cTWO_TEN_PERCENT\u003e in one week the smallcap company in which these prominent investors have invested is ravindra energy which is in the business of selling solar pumps and setting up of solar generation power plant ravindra energy share price was locked in at \u003cFIVE_PERCENT\u003e upper circuit of \u003cONE_HUNDRED\u003e apiece on thursday after the company announced that its board approved raising \u003cONE_HUNDRED\u003e crore on preferential basis the company approved issue of \u003cTWO_\u003e crore equity shares with face value of \u003cONE_TEN\u003e each at a premium of \u003cSIX_TEN\u003e per equity share aggregating to \u003cONE_HUNDRED\u003e crore according to a bse filing the allottees list shows that ashish rameshchandra kacholia has been offered \u003cONE_MILLION\u003e shares or a \u003cZERO_PERCENT\u003e stake worth approximately \u003cONE_TEN\u003e crore mukul agrawal has been offered \u003cTWO_MILLION\u003e shares or \u003cONE_PERCENT\u003e stake in ravindra energy his investment amounts to around \u003cONE_TEN\u003e crore ravindra energy s preferential share allotment also included shares offered to other investors such as quant mutual fund coeus global opportunities fund new vernon india limited aamara ventures llp and others ravindra energy share price has been locked in upper circuit for the sixth straight session in one week ravindra energy shares rallied \u003cTWO_TEN_PERCENT\u003e while the stock is up \u003cFOUR_TEN_PERCENT\u003e in one month at \u003cONE_TEN\u003e \u003cZERO_\u003e am ravindra energy shares were still locked in at \u003cFIVE_PERCENT\u003e upper circuit of \u003cONE_HUNDRED\u003e apiece on the bse the company is commanding a market capitalisation of \u003cONE_THOUSAND\u003e crore","timestamp":"2024-09-12T09:37:00+05:30","market_timestamp":"2024-09-12T09:37:00+05:30","off_market_hours":false}