{"url":"https://www.livemint.com/market/stock-market-news/pn-gadgil-jewellers-stock-slumps-18-from-listing-high-hits-lower-circuit-11726730164486.html","title":"PN Gadgil Jewellers’ shares hit 10% lower circuit, slumps 18% from listing date high","description":"PN Gadgil Jewellers' share price plummeted by 18% on Thursday, September 19, hitting the lower circuit on Indian bourses.","content":"PN Gadgil Jewellers share price: PN Gadgil Jewellers (PNG) saw its share price hit the lower circuit on Thursday, September 19, 2024 on Indian bourses. The stock dropped to  ₹694.20, marking an 18 per cent decline from its post-listing high of  ₹830.PN Gadgil Jewellers' share price was trading in the red, down 7.47 per cent, at  ₹713.65during the intraday session on September 19, at 1:04 p.m., but it showed signs of recovery on the NSE. As per the NSE, PN Gadgil Jewellers enjoys a market capitalisation of  ₹9,635.29 crore.The jewellery company made a stellar debut on Tuesday, September 17, with shares opening at a significant premium. On the National Stock Exchange (NSE), PNG shares began trading at  ₹830, while on the Bombay Stock Exchange (BSE), they opened at  ₹834. This represented a substantial 73 per cent premium over the initial public offering (IPO) price of  ₹480 per share.However, the initial euphoria was short-lived as profit-taking set in shortly after the listing. The stock touched intraday highs of  ₹848 on the NSE and  ₹843.80 on the BSE before beginning its downward trajectory.PNG's IPO, which closed on September 12, had garnered strong interest from investors. The offering was oversubscribed 59.41 times, with qualified institutional buyers showing the highest demand at 136.85 times the allotted quota. The company raised a total of  ₹1,100 crore through the IPO, comprising a fresh issue of  ₹850 crore and an offer for sale of  ₹250 crore.Following the public offering, the Gadgil family, led by Saurabh Gadgil, retained an 83 per cent stake in the company. PNG has seen significant growth over the past decade, with revenues increasing from  ₹2,556 crore in FY14 to  ₹6,111 crore by the end of March 2024.The company operates 39 retail outlets in Maharashtra, including 28 company-owned stores and 11 franchises. PNG also maintained a presence in Goa and had previously ventured into international markets, though its Dubai store was closed in FY23 due to losses.","cleaned_content":"pn gadgil jewellers share price pn gadgil jewellers png saw its share price hit the lower circuit on thursday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on indian bourses the stock dropped to \u003cSIX_HUNDRED\u003e marking an \u003cONE_TEN_PERCENT\u003e decline from its post listing high of \u003cEIGHT_HUNDRED\u003e pn gadgil jewellers share price was trading in the red down \u003cSEVEN_PERCENT\u003e at \u003cSEVEN_HUNDRED\u003e during the intraday session on september \u003cONE_TEN\u003e at \u003cONE_\u003e \u003cFOUR_\u003e p m but it showed signs of recovery on the nse as per the nse pn gadgil jewellers enjoys a market capitalisation of \u003cNINE_THOUSAND\u003e crore the jewellery company made a stellar debut on tuesday september \u003cONE_TEN\u003e with shares opening at a significant premium on the national stock exchange nse png shares began trading at \u003cEIGHT_HUNDRED\u003e while on the bombay stock exchange bse they opened at \u003cEIGHT_HUNDRED\u003e this represented a substantial \u003cSEVEN_TEN_PERCENT\u003e premium over the initial public offering ipo price of \u003cFOUR_HUNDRED\u003e per share however the initial euphoria was short lived as profit taking set in shortly after the listing the stock touched intraday highs of \u003cEIGHT_HUNDRED\u003e on the nse and \u003cEIGHT_HUNDRED\u003e on the bse before beginning its downward trajectory pngs ipo which closed on september \u003cONE_TEN\u003e had garnered strong interest from investors the offering was oversubscribed \u003cFIVE_TEN\u003e times with qualified institutional buyers showing the highest demand at \u003cONE_HUNDRED\u003e times the allotted quota the company raised a total of \u003cONE_THOUSAND\u003e crore through the ipo comprising a fresh issue of \u003cEIGHT_HUNDRED\u003e crore and an offer for sale of \u003cTWO_HUNDRED\u003e crore following the public offering the gadgil family led by saurabh gadgil retained an \u003cEIGHT_TEN_PERCENT\u003e stake in the company png has seen significant growth over the past decade with revenues increasing from \u003cTWO_THOUSAND\u003e crore in fy14 to \u003cSIX_THOUSAND\u003e crore by the end of march \u003cTWO_THOUSAND\u003e the company operates \u003cTHREE_TEN\u003e retail outlets in maharashtra including \u003cTWO_TEN\u003e company owned stores and \u003cONE_TEN\u003e franchises png also maintained a presence in goa and had previously ventured into international markets though its dubai store was closed in fy23 due to losses","timestamp":"2024-09-19T14:25:00+05:30","market_timestamp":"2024-09-19T14:25:00+05:30","off_market_hours":false}