{"url":"https://www.livemint.com/market/stock-market-news/canadian-dollar-clings-to-weekly-gain-as-retail-sales-beat-estimates-11726859637071.html","title":"Canadian dollar clings to weekly gain as retail sales beat estimates","description":"CANADA-FOREX/:CANADA FX DEBT-Canadian dollar clings to weekly gain as retail sales beat estimates","content":"*Loonie notches weekly gain of 0.2%*Retail sales rise 0.9% in July*Price of US oil increases 0.5%*Bond yields rise across the curveBy Fergal SmithTORONTO, Sept 20 - The Canadian dollar steadied against its U.S. counterpart on Friday as domestic data showed retail sales rising more than expected in July and despite the greenback notching gains against some other major currencies.The loonie was trading nearly unchanged at 1.3560 to the U.S. dollar, or 73.75 U.S. cents, after moving in a range of 1.3543 to 1.3589. For the week, the currency was up 0.2%.Canadian retail sales grew by 0.9% in July from June, eclipsing forecasts for a gain of 0.6%, while a preliminary estimate showed sales up 0.5% in August.The data \"may ease concerns that the economy has slowed sharply,\" Shaun Osborne, chief currency strategist at Scotiabank, said in a note. \"That should help limit upside movement in the USD at least.\"The U.S. dollar strengthened against a basket of major currencies after the Bank of Japan left interest rates unchanged.The American currency was clawing back some declines after the Federal Reserve kicked of its easing cycle on Wednesday with a half-percentage-point reduction in interest rates.The Fed's larger-than-usual rate cut has led to investors raising bets the BoC would increase the size of its cuts. The central bank has eased three times since June, moving in quarter-percentage-point steps.Still, BoC Governor Tiff Macklem said adoption of artificial intelligence by businesses could add to price pressures in the short term by boosting demand.The price of oil, one of Canada's major exports, added to its weekly gain, advancing 0.5% to $72.34 a barrel.Canadian bond yields moved higher across the curve. The 10-year was up 1 basis point at 2.937%, having rebounded from a 16-month low on Tuesday at 2.829%.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"loonie notches weekly gain of \u003cZERO_PERCENT\u003e retail sales rise \u003cZERO_PERCENT\u003e in july price of us oil increases \u003cZERO_PERCENT\u003e bond yields rise across the curveby fergal smithtoronto sept \u003cTWO_TEN\u003e the canadian dollar steadied against its u s counterpart on friday as domestic data showed retail sales rising more than expected in july and despite the greenback notching gains against some other major currencies the loonie was trading nearly unchanged at \u003cONE_\u003e to the u s dollar or \u003cSEVEN_TEN\u003e u s cents after moving in a range of \u003cONE_\u003e to \u003cONE_\u003e for the week the currency was up \u003cZERO_PERCENT\u003e canadian retail sales grew by \u003cZERO_PERCENT\u003e in july from june eclipsing forecasts for a gain of \u003cZERO_PERCENT\u003e while a preliminary estimate showed sales up \u003cZERO_PERCENT\u003e in august the data may ease concerns that the economy has slowed sharply shaun osborne chief currency strategist at scotiabank said in a note that should help limit upside movement in the usd at least the u s dollar strengthened against a basket of major currencies after the bank of japan left interest rates unchanged the american currency was clawing back some declines after the federal reserve kicked of its easing cycle on wednesday with a half percentage point reduction in interest rates the feds larger than usual rate cut has led to investors raising bets the boc would increase the size of its cuts the central bank has eased three times since june moving in quarter percentage point steps still boc governor tiff macklem said adoption of artificial intelligence by businesses could add to price pressures in the short term by boosting demand the price of oil one of canadas major exports added to its weekly gain advancing \u003cZERO_PERCENT\u003e to \u003cSEVEN_TEN\u003e a barrel canadian bond yields moved higher across the curve the \u003cONE_TEN\u003e year was up \u003cONE_\u003e basis point at \u003cTWO_PERCENT\u003e having rebounded from a \u003cONE_TEN\u003e month low on tuesday at \u003cTWO_PERCENT\u003e this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-21T00:43:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}