{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-fell-over-half-a-per-cent-each-ahead-of-us-inflation-data-tata-motors-cracks-6-11726049363688.html","title":"Stock market today: Nifty 50, Sensex fall over half a per cent ahead of US inflation data; Tata Motors cracks 6%","description":"Indian shares experienced volatility as investors awaited US inflation data. The Nifty 50 index dropped by 0.50 per cent, while Bajaj Auto reached an all-time high.","content":"Indian shares showed considerable volatility during Wednesday's trading session as investors braced for the August US consumer inflation report that could help determine the scale of an expected interest rate cut from the Federal Reserve next week.During the session, the Nifty 50 index fell by 0.50 per cent, slipping below the 25,000 mark to close at 24,915 points. Out of the 50 constituent stocks, 13 ended in positive territory. Notable gainers included Bajaj Auto, LTI Mindtree, Asian Paints, Bajaj Finance, and Britannia Industries, which saw a rise between 1 per cent and 4 per cent.Similarly, the S\u0026P BSE Sensex also declined by 0.53 per cent, settling at 81.485 points. The broader Nifty Midcap 100 index remained flat at 59,021 points.Among the top midcap gainers, Suzlon Energy led with a 5 per cent increase, followed by CG Power and Industrial, which rose by 4.6 per cent. JSW Infrastructure and Page Industries also saw gains of 4.5 per cent and 3.6 per cent, respectively.Conversely, the Nifty Smallcap 100 index fell by 0.8 per cent to 19,163 points. Major losers included HFCL, IRB Infrastructure, Welspun Living, Swan Energy, and Aarti Industries, which experienced declines ranging from 4.2 per cent to 5 per cent.Tata Motors stock tumbled 6 per cent in today's session to  ₹970 levels after the global brokerage firm UBS retained its 'Sell' rating on the stock, citing the drop in JLR sales. UBS pointed out that demand for JLR models is waning, with current order levels now falling below those seen before the pandemic.This trend suggests a potential cooling in JLR’s recent success, and UBS anticipates that discounts for the Range Rover may increase as a result. According to the company's Q1FY25 earnings report, the JLR order book fell to 1,04,000 units, down from 1,33,000 vehicles in Q4FY24.Today's fall in the stock price was the biggest in five weeks, which caused the stock to lose 12.15 per cent in September so far after a 4 per cent drop in August. From its high of  ₹1,176 per share, it has decreased by 18 per cent.Shares of Bajaj Group companies, including Bajaj Auto, Bajaj Finance, and Bajaj Finserv, emerged as top performers in the Nifty 50 index today, with gains of up to 5 per cent. This surge in group stock comes in the wake of strong investor interest in the Bajaj Housing Finance IPO, which has seen robust subscription levels across various investor segments.As of the third day of the IPO, it has been oversubscribed by more than 47 times, with the Grey Market Premium (GMP) indicating a 96 per cent premium. Among the group stocks, Bajaj Auto reached an all-time high in today’s trading, with its shares hitting  ₹11,501 apiece—a gain of 4.3 per cent from the previous close.So far this year, the stock has surged by 70 per cent. In its recent note, domestic brokerage firm Sharekhan has maintained its 'buy' rating on Bajaj Auto, setting a target price of  ₹12,584. It highlighted the company's strong volume growth, despite a partial recovery in exports. Additionally, it said that the company's CNG motorcycles are receiving positive market feedback, and the company is also making strides in the electric vehicle (EV) sector, gaining market share.","cleaned_content":"indian shares showed considerable volatility during wednesdays trading session as investors braced for the august us consumer inflation report that could help determine the scale of an expected interest rate cut from the federal reserve next week during the session the nifty \u003cFIVE_TEN\u003e index fell by \u003cZERO_PERCENT\u003e slipping below the \u003cTWO_TEN_THOUSAND\u003e mark to close at \u003cTWO_TEN_THOUSAND\u003e points out of the \u003cFIVE_TEN\u003e constituent stocks \u003cONE_TEN\u003e ended in positive territory notable gainers included bajaj auto lti mindtree asian paints bajaj finance and britannia industries which saw a rise between \u003cONE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e similarly the s p bse sensex also declined by \u003cZERO_PERCENT\u003e settling at \u003cEIGHT_TEN\u003e points the broader nifty midcap \u003cONE_HUNDRED\u003e index remained flat at \u003cFIVE_TEN_THOUSAND\u003e points among the top midcap gainers suzlon energy led with a \u003cFIVE_PERCENT\u003e increase followed by cg power and industrial which rose by \u003cFOUR_PERCENT\u003e jsw infrastructure and page industries also saw gains of \u003cFOUR_PERCENT\u003e and \u003cTHREE_PERCENT\u003e respectively conversely the nifty smallcap \u003cONE_HUNDRED\u003e index fell by \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e points major losers included hfcl irb infrastructure welspun living swan energy and aarti industries which experienced declines ranging from \u003cFOUR_PERCENT\u003e to \u003cFIVE_PERCENT\u003e tata motors stock tumbled \u003cSIX_PERCENT\u003e in todays session to \u003cNINE_HUNDRED\u003e levels after the global brokerage firm ubs retained its sell rating on the stock citing the drop in jlr sales ubs pointed out that demand for jlr models is waning with current order levels now falling below those seen before the pandemic this trend suggests a potential cooling in jlr s recent success and ubs anticipates that discounts for the range rover may increase as a result according to the companys q1fy25 earnings report the jlr order book fell to \u003cONE_HUNDRED_THOUSAND\u003e units down from \u003cONE_HUNDRED_THOUSAND\u003e vehicles in q4fy24 todays fall in the stock price was the biggest in five weeks which caused the stock to lose \u003cONE_TEN_PERCENT\u003e in september so far after a \u003cFOUR_PERCENT\u003e drop in august from its high of \u003cONE_THOUSAND\u003e per share it has decreased by \u003cONE_TEN_PERCENT\u003e shares of bajaj group companies including bajaj auto bajaj finance and bajaj finserv emerged as top performers in the nifty \u003cFIVE_TEN\u003e index today with gains of up to \u003cFIVE_PERCENT\u003e this surge in group stock comes in the wake of strong investor interest in the bajaj housing finance ipo which has seen robust subscription levels across various investor segments as of the third day of the ipo it has been oversubscribed by more than \u003cFOUR_TEN\u003e times with the grey market premium gmp indicating a \u003cNINE_TEN_PERCENT\u003e premium among the group stocks bajaj auto reached an all time high in today s trading with its shares hitting \u003cONE_TEN_THOUSAND\u003e apiece a gain of \u003cFOUR_PERCENT\u003e from the previous close so far this year the stock has surged by \u003cSEVEN_TEN_PERCENT\u003e in its recent note domestic brokerage firm sharekhan has maintained its buy rating on bajaj auto setting a target price of \u003cONE_TEN_THOUSAND\u003e it highlighted the companys strong volume growth despite a partial recovery in exports additionally it said that the companys cng motorcycles are receiving positive market feedback and the company is also making strides in the electric vehicle ev sector gaining market share","timestamp":"2024-09-11T15:58:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}