{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-markets-five-stocks-to-buy-or-sell-on-thursday-sept-12-11726111372002.html","title":"Stock market today: Trade setup for Nifty 50 to global markets, five stocks to buy or sell on Thursday — Sept 12","description":"Stock market today: Jindal Steel, Britannia Industries, Zomato, Deepak Nitrite, and JK Lakshmi Cement","content":"Breakout stocks to buy or sell: After a subdued start, the Indian stock market registered a strong recovery on Wednesday. However, the frontline indices failed to recover the losses and ended lower. The Nifty 50 index finished 122 points lower at the 24,918 mark, the BSE Sensex corrected 398 points and closed at 81,523, whereas the Bank Nifty index ended 262 points lower at 51,010. In the broad market, the Small-cap index crashed 0.57 per cent, while the Mid-cap index ended 0.52 per cent lower.Speaking on the Nifty 50 index outlook, Rajesh Bhosale, Equity Technical Analyst at Angel One, said, \"Prices have again fallen below the 20 EMA, weakening their position and suggesting a potential retest of Monday's low around the 24750 level. If this support is broken, further weakness could push prices toward the 24500 mark. On the upside, 25100 - 25150 remains a strong resistance zone. The key levels to monitor on the weekly expiry day are 25000 - 25100 on the upside and 24800 - 24750 on the downside.\"On the outlook for the Bank Nifty today, Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C Mehta, said, \"Bank Nifty started the day on a flat-to-negative note, recovering slightly in the first half but faced selling pressure in the second half, ultimately closing negatively at 51,010. The index formed a red candle on the daily chart, reflecting weakness. On the downside, the 100-DEMA support is placed near 50,250, serving as a key level for Bank Nifty. On the upside, the 51,400-51,420 zone is a short-term hurdle. A sustainable move above 51,420 could push Bank Nifty towards 51,800-52,000 levels.\"Stocks in Asia rose Thursday after a tech-fueled rally lifted Wall Street as traders looked beyond elevated core US inflation to imminent rate cuts next week. Equities in Japan and South Korea advanced, with the Topix up the most in almost a month. Gauges in Tokyo partly reflected the yen's reversal from its most substantial level against the dollar since December. US futures changed slightly after the S\u0026P 500 closed 1.1% higher Wednesday, while the tech-heavy Nasdaq 100 rose 2.2%. Nvidia Corp. gained 8.2% as chipmakers rallied.Regarding shares to buy today, stock market experts — Sumeet Bagadia, Executive Director at Choice Broking and Ganesh Dongre, Senior Manager — Technical Research at Anand Rathi — have recommended buying these five shares: Jindal Steel, Britannia Industries, Zomato, Deepak Nitrite, and JK Lakshmi Cement.1] Jindal Steet: Buy at  ₹966.90, target  ₹1030, stop loss  ₹933.Jindal Steel \u0026 Power Limited is displaying promising technical signals on the daily chart, which is marked by a bullish candle formation. Currently, the stock is trading at  ₹966.90; it faces a minor resistance near the  ₹987 level. A successful breach of this resistance could pave the way for an upward move towards the target price of  ₹1030 and beyond. The stock has a robust support zone around  ₹933, reinforcing its strength.2] Britannia Industries: Buy at  ₹6008.65, target  ₹6310, stop loss  ₹5860.Britannia's daily chart presents a favourable outlook for the upcoming week, showcasing a steady upward trend. Notably, the stock has given a decisive breakout from a well-formed rounding bottom pattern, closing above the critical  ₹6000 mark. This breakout has successfully breached the neckline, marking a fresh all-time high and signalling the potential for a significant upward continuation in price.3] Zomato: Buy at  ₹270, target  ₹285, stop loss  ₹252.A notable bullish reversal pattern has emerged in the stock's recent short-term trend analysis. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around  ₹285. The stock is currently maintaining a crucial support level at  ₹242. Given the current market price of  ₹260, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of  ₹285.4] Deepak Nitrite: Buy at  ₹2920, target  ₹3030, stop loss  ₹2850.A notable bullish reversal pattern has emerged in the stock's recent short-term trend analysis. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around  ₹3030. The stock is currently maintaining a crucial support level at  ₹2850. Given the current market price of  ₹2920, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of  ₹3030.5] JK Lakshmi Cement: Buy at  ₹788, target  ₹820, stop loss  ₹770.On the daily chart of this stock, a breakout at the  ₹788 price level has been observed, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss of  ₹770 is recommended. The target price for this strategy is  ₹820 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"breakout stocks to buy or sell after a subdued start the indian stock market registered a strong recovery on wednesday however the frontline indices failed to recover the losses and ended lower the nifty \u003cFIVE_TEN\u003e index finished \u003cONE_HUNDRED\u003e points lower at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex corrected \u003cTHREE_HUNDRED\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index ended \u003cTWO_HUNDRED\u003e points lower at \u003cFIVE_TEN_THOUSAND\u003e in the broad market the small cap index crashed \u003cZERO_PERCENT\u003e while the mid cap index ended \u003cZERO_PERCENT\u003e lower speaking on the nifty \u003cFIVE_TEN\u003e index outlook rajesh bhosale equity technical analyst at angel one said prices have again fallen below the \u003cTWO_TEN\u003e ema weakening their position and suggesting a potential retest of mondays low around the \u003cTWO_TEN_THOUSAND\u003e level if this support is broken further weakness could push prices toward the \u003cTWO_TEN_THOUSAND\u003e mark on the upside \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e remains a strong resistance zone the key levels to monitor on the weekly expiry day are \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the upside and \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the downside on the outlook for the bank nifty today hrishikesh yedve avp technical and derivatives research at asit c mehta said bank nifty started the day on a flat to negative note recovering slightly in the first half but faced selling pressure in the second half ultimately closing negatively at \u003cFIVE_TEN_THOUSAND\u003e the index formed a red candle on the daily chart reflecting weakness on the downside the \u003cONE_HUNDRED\u003e dema support is placed near \u003cFIVE_TEN_THOUSAND\u003e serving as a key level for bank nifty on the upside the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e zone is a short term hurdle a sustainable move above \u003cFIVE_TEN_THOUSAND\u003e could push bank nifty towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels stocks in asia rose thursday after a tech fueled rally lifted wall street as traders looked beyond elevated core us inflation to imminent rate cuts next week equities in japan and south korea advanced with the topix up the most in almost a month gauges in tokyo partly reflected the yens reversal from its most substantial level against the dollar since december us futures changed slightly after the s p \u003cFIVE_HUNDRED\u003e closed \u003cONE_PERCENT\u003e higher wednesday while the tech heavy nasdaq \u003cONE_HUNDRED\u003e rose \u003cTWO_PERCENT\u003e nvidia corp gained \u003cEIGHT_PERCENT\u003e as chipmakers rallied regarding shares to buy today stock market experts sumeet bagadia executive director at choice broking and ganesh dongre senior manager technical research at anand rathi have recommended buying these five shares jindal steel britannia industries zomato deepak nitrite and jk lakshmi cement 1 jindal steet buy at \u003cNINE_HUNDRED\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cNINE_HUNDRED\u003e jindal steel power limited is displaying promising technical signals on the daily chart which is marked by a bullish candle formation currently the stock is trading at \u003cNINE_HUNDRED\u003e it faces a minor resistance near the \u003cNINE_HUNDRED\u003e level a successful breach of this resistance could pave the way for an upward move towards the target price of \u003cONE_THOUSAND\u003e and beyond the stock has a robust support zone around \u003cNINE_HUNDRED\u003e reinforcing its strength 2 britannia industries buy at \u003cSIX_THOUSAND\u003e target \u003cSIX_THOUSAND\u003e stop loss \u003cFIVE_THOUSAND\u003e britannias daily chart presents a favourable outlook for the upcoming week showcasing a steady upward trend notably the stock has given a decisive breakout from a well formed rounding bottom pattern closing above the critical \u003cSIX_THOUSAND\u003e mark this breakout has successfully breached the neckline marking a fresh all time high and signalling the potential for a significant upward continuation in price 3 zomato buy at \u003cTWO_HUNDRED\u003e target \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e a notable bullish reversal pattern has emerged in the stocks recent short term trend analysis this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around \u003cTWO_HUNDRED\u003e the stock is currently maintaining a crucial support level at \u003cTWO_HUNDRED\u003e given the current market price of \u003cTWO_HUNDRED\u003e a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of \u003cTWO_HUNDRED\u003e deepak nitrite buy at \u003cTWO_THOUSAND\u003e target \u003cTHREE_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e a notable bullish reversal pattern has emerged in the stocks recent short term trend analysis this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around \u003cTHREE_THOUSAND\u003e the stock is currently maintaining a crucial support level at \u003cTWO_THOUSAND\u003e given the current market price of \u003cTWO_THOUSAND\u003e a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of \u003cTHREE_THOUSAND\u003e jk lakshmi cement buy at \u003cSEVEN_HUNDRED\u003e target \u003cEIGHT_HUNDRED\u003e stop loss \u003cSEVEN_HUNDRED\u003e on the daily chart of this stock a breakout at the \u003cSEVEN_HUNDRED\u003e price level has been observed signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss of \u003cSEVEN_HUNDRED\u003e is recommended the target price for this strategy is \u003cEIGHT_HUNDRED\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-09-12T09:14:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}