{"url":"https://www.livemint.com/market/stock-market-news/ion-exchange-share-price-jumps-7-after-receiving-rs-161-crore-order-from-adani-power-11726720869489.html","title":"ION Exchange share price jumps 8% after receiving  ₹161 crore order from Adani Power","description":"ION Exchange share price opened with an upside gap at  ₹670 apiece on the NSE and touched an intraday high of  ₹709.15 per share","content":"Stock market today: Shares of ION Exchange (India) Ltd witnessed strong buying during the early morning session on Thursday. ION Exchange share price opened with an upside gap at  ₹670 apiece on the NSE and touched an intraday high of  ₹709.15 per share. While climbing to this intraday high, ION Exchange shares registered an intraday rise of over 8 per cent.According to stock market experts, the ION Exchange share price is skyrocketing today after the announcement of the receipt of a  ₹161 crore order from Adani Power. The company has declared about the order receipt in its latest exchange filing on Wednesday.On why the ION Exchange share price is skyrocketing today, Avinash Gorakshkar, Head of Research at Profitmart Securities, said, “ION Exchange share price is rising today after the company's latest exchange filing on Wednesday. In this exchange filing, ION Exchange (India) Ltd has declared that it received an order from Adani Power worth around  ₹161 crore.”Expecting more upside in ION Exchange shares, Sumeet Bagadia, Executive Director at Choice Broking, said, “Shareholders can hold the scrip maintaining stop loss at  ₹660 for the near-term target of  ₹750 and  ₹770 apiece.”In an exchange filing on Wednesday, ION Exchange (India) Ltd. said, “We wish to inform you that the Company has been awarded Contracts from Adani Power Limited for Comprehensive \u0026 Complete Total Water \u0026 Environment Management Solution valued at approx.  ₹161.19 Crores for Process \u0026 Utility required of 2 x 800 MW units for Raipur \u0026 Raigarh Ultra Super Power Projects. The projects are to be completed within 18 months from Project Award dates.”","cleaned_content":"stock market today shares of ion exchange india ltd witnessed strong buying during the early morning session on thursday ion exchange share price opened with an upside gap at \u003cSIX_HUNDRED\u003e apiece on the nse and touched an intraday high of \u003cSEVEN_HUNDRED\u003e per share while climbing to this intraday high ion exchange shares registered an intraday rise of over \u003cEIGHT_PERCENT\u003e according to stock market experts the ion exchange share price is skyrocketing today after the announcement of the receipt of a \u003cONE_HUNDRED\u003e crore order from adani power the company has declared about the order receipt in its latest exchange filing on wednesday on why the ion exchange share price is skyrocketing today avinash gorakshkar head of research at profitmart securities said ion exchange share price is rising today after the companys latest exchange filing on wednesday in this exchange filing ion exchange india ltd has declared that it received an order from adani power worth around \u003cONE_HUNDRED\u003e crore expecting more upside in ion exchange shares sumeet bagadia executive director at choice broking said shareholders can hold the scrip maintaining stop loss at \u003cSIX_HUNDRED\u003e for the near term target of \u003cSEVEN_HUNDRED\u003e and \u003cSEVEN_HUNDRED\u003e apiece in an exchange filing on wednesday ion exchange india ltd said we wish to inform you that the company has been awarded contracts from adani power limited for comprehensive complete total water environment management solution valued at approx \u003cONE_HUNDRED\u003e crores for process utility required of \u003cTWO_\u003e x \u003cEIGHT_HUNDRED\u003e mw units for raipur raigarh ultra super power projects the projects are to be completed within \u003cONE_TEN\u003e months from project award dates","timestamp":"2024-09-19T10:40:00+05:30","market_timestamp":"2024-09-19T10:40:00+05:30","off_market_hours":false}