{"url":"https://www.livemint.com/market/stock-market-news/top-stock-recommendations-dharmesh-shah-of-icici-securities-suggests-buying-infosys-and-indusind-bank-on-september-16-11726332742218.html","title":"Top Stock Recommendations: Dharmesh Shah of ICICI Securities suggests buying Infosys, and IndusInd Bank today","description":"Top Stock Recommendations: Dharmesh Shah of ICICI Securities recommends two stocks to buy this week: Infosys and IndusInd Bank.","content":"Stock Market News: Monday saw the domestic benchmark indices, Sensex and Nifty 50, opening slightly higher as investors stayed wary ahead of the upcoming Fed rate cut event this week.The Nifty 50 index commenced the day at 25,406.65 points, marking a 0.2% increase of 50.15 points, while the  Sensex began with a 0.11% surge, gaining 94.39 points to reach 82,985.33.Global equity markets will be watching the Fed's rate decision on Wednesday, which is expected to have an immediate impact on the direction of the stock market, according to Dr. V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services. One of the world's greatest performing stock indices is the Nifty 50, which has up 16.7% year to date. The primary driver of the Indian market at the moment is the consistent inflow of domestic money, notwithstanding the country's solid corporate profitability and economic fundamentals.Following a record-breaking rise in the previous session, the domestic equity benchmark indices, the Sensex and Nifty 50, paused on Friday and ended modestly down due to profit-taking.The Sensex fell 0.09% to 82,890.94, while the Nifty 50 finished 0.13% down at 25,356.5.Both indices increased by around 2% for the week, marking the highest advances since June's end. The week's gains were led by a 3% increase in consumer stocks, which are expected to climb in volume and demand owing to a consistent monsoon. A 2.8% rise was anticipated for IT companies, a significant portion of which comes from the United States, ahead of next week's almost certain Fed rate cut.The major domestic and global economic data, such as India's WPI Inflation (YoY) (Aug), India's Bank Loan Growth, India's Trade Balance (Aug), India FX Reserves (USD), US Core Retail Sales (MoM) (Aug), US Industrial Production (MoM) (Aug), US Fed Interest Rate Decision, US FOMC Economic Projections, US FOMC Press Conference, US Initial Jobless Claims, and China PBoC Loan Prime Rate (Sep), will serve as a guide for the market, according to Palka Arora Chopra, Director of Master Capital Services Ltd.The Nifty 50 reclaimed new highs as rate cut hopes and benign inflation expectations helped by good monsoon and lower brent prices boosted on sentiments. Strong FII inflows augmented robust domestic liquidity situation, that helped Nifty 50 to gain 2% (25,356) for the week, ahead of US Fed meeting next week. Nifty Mid cap and Small cap indices gained 2.8% and 1.2% respectively.The Nifty 50 formed a strong bull candle on weekly time frame as it completely reversed past week’s losses, in faster time, indicating continuation of uptrend. Going forward, we expect index to sustain its upward trajectory and gradually head towards 25,800 while key support is placed at last week lows of 24,750 levels. While volatility around Fed Meeting cannot be ruled out, we advise to deploy buy on dips approach.Our view is anchored upon following key observations:Private banks showing signs of strength and with their significant weightage likely to steer Nifty 50 higher.Sectorally, BFSI, IT, Metals, Consumption are expected to outperform.Liquidity: FIIs have been net buyers in four out of past five sessions. With prospects of rate cuts in US, we expect FII money returning to EM and India stands to benefit significantly. This is incrementally positive with already robust domestic liquidity.September seasonality favours buying dips: historically, September volatility with average of 3% decline has provided buying opportunity as 3M forward returns have been around 7% with 78% probability.Brent: Prices continue their down trend after breakdown from one year consolidation. Expect prices to head towards $67 over coming months while upsides capped at $80.On the Bank Nifty front, index appears at the cusp of breaking out of Bullis inverse head and shoulder pattern on daily chart. With private banks showing strength and PSU banks being oversold, we expect Bank nifty to head higher towards 52,600 levels in coming weeks while last week lows of 50,400 remains a support.1. Buy Infosys CMP  ₹1,943, Target  ₹2,110, Stoploss  ₹1,810.2. Buy IndusInd Bank CMP  ₹1,462, Target  ₹1,620, Stoploss  ₹1,330.The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and individual circumstances may vary.","cleaned_content":"stock market news monday saw the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e opening slightly higher as investors stayed wary ahead of the upcoming fed rate cut event this week the nifty \u003cFIVE_TEN\u003e index commenced the day at \u003cTWO_TEN_THOUSAND\u003e points marking a \u003cZERO_PERCENT\u003e increase of \u003cFIVE_TEN\u003e points while the sensex began with a \u003cZERO_PERCENT\u003e surge gaining \u003cNINE_TEN\u003e points to reach \u003cEIGHT_TEN_THOUSAND\u003e global equity markets will be watching the feds rate decision on wednesday which is expected to have an immediate impact on the direction of the stock market according to dr v k vijayakumar chief investment strategist geojit financial services one of the worlds greatest performing stock indices is the nifty \u003cFIVE_TEN\u003e which has up \u003cONE_TEN_PERCENT\u003e year to date the primary driver of the indian market at the moment is the consistent inflow of domestic money notwithstanding the countrys solid corporate profitability and economic fundamentals following a record breaking rise in the previous session the domestic equity benchmark indices the sensex and nifty \u003cFIVE_TEN\u003e paused on friday and ended modestly down due to profit taking the sensex fell \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e finished \u003cZERO_PERCENT\u003e down at \u003cTWO_TEN_THOUSAND\u003e both indices increased by around \u003cTWO_PERCENT\u003e for the week marking the highest advances since junes end the weeks gains were led by a \u003cTHREE_PERCENT\u003e increase in consumer stocks which are expected to climb in volume and demand owing to a consistent monsoon a \u003cTWO_PERCENT\u003e rise was anticipated for it companies a significant portion of which comes from the united states ahead of next weeks almost certain fed rate cut the major domestic and global economic data such as indias wpi inflation yoy aug indias bank loan growth indias trade balance aug india fx reserves usd us core retail sales mom aug us industrial production mom aug us fed interest rate decision us fomc economic projections us fomc press conference us initial jobless claims and china pboc loan prime rate sep will serve as a guide for the market according to palka arora chopra director of master capital services ltd the nifty \u003cFIVE_TEN\u003e reclaimed new highs as rate cut hopes and benign inflation expectations helped by good monsoon and lower brent prices boosted on sentiments strong fii inflows augmented robust domestic liquidity situation that helped nifty \u003cFIVE_TEN\u003e to gain \u003cTWO_PERCENT\u003e \u003cTWO_TEN_THOUSAND\u003e for the week ahead of us fed meeting next week nifty mid cap and small cap indices gained \u003cTWO_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively the nifty \u003cFIVE_TEN\u003e formed a strong bull candle on weekly time frame as it completely reversed past week s losses in faster time indicating continuation of uptrend going forward we expect index to sustain its upward trajectory and gradually head towards \u003cTWO_TEN_THOUSAND\u003e while key support is placed at last week lows of \u003cTWO_TEN_THOUSAND\u003e levels while volatility around fed meeting cannot be ruled out we advise to deploy buy on dips approach our view is anchored upon following key observations private banks showing signs of strength and with their significant weightage likely to steer nifty \u003cFIVE_TEN\u003e higher sectorally bfsi it metals consumption are expected to outperform liquidity fiis have been net buyers in four out of past five sessions with prospects of rate cuts in us we expect fii money returning to em and india stands to benefit significantly this is incrementally positive with already robust domestic liquidity september seasonality favours buying dips historically september volatility with average of \u003cTHREE_PERCENT\u003e decline has provided buying opportunity as \u003cTHREE_\u003e m forward returns have been around \u003cSEVEN_PERCENT\u003e with \u003cSEVEN_TEN_PERCENT\u003e probability brent prices continue their down trend after breakdown from one year consolidation expect prices to head towards \u003cSIX_TEN\u003e over coming months while upsides capped at \u003cEIGHT_TEN\u003e on the bank nifty front index appears at the cusp of breaking out of bullis inverse head and shoulder pattern on daily chart with private banks showing strength and psu banks being oversold we expect bank nifty to head higher towards \u003cFIVE_TEN_THOUSAND\u003e levels in coming weeks while last week lows of \u003cFIVE_TEN_THOUSAND\u003e remains a support 1 buy infosys cmp \u003cONE_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stoploss \u003cONE_THOUSAND\u003e buy indusind bank cmp \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stoploss \u003cONE_THOUSAND\u003e the views and recommendations provided in this analysis are those of individual analysts or broking companies not mint we strongly advise investors to consult with certified experts before making any investment decisions as market conditions can change rapidly and individual circumstances may vary","timestamp":"2024-09-16T10:01:00+05:30","market_timestamp":"2024-09-16T10:01:00+05:30","off_market_hours":false}