{"url":"https://www.livemint.com/market/stock-market-news/torrent-power-stock-climbs-over-5-after-winning-1-500-mw-pumped-hydro-storage-project-11726633044032.html","title":"Torrent Power stock climbs over 5% after winning 1,500 MW pumped hydro storage project","description":"Torrent Power's share price rose 5.2% following a major contract win for a pumped hydro storage project. The company aims to invest  ₹25,000 to  ₹35,000 crore in pumped storage, alongside commitments for renewable energy and green ammonia production.","content":"Torrent Power, a leading integrated power utility, saw its share price climb by 5.2 per cent to  ₹1,873 during Wednesday's trading session, driven by the announcement of securing an order for the Pumped Hydro Storage Project.The company informed investors on Tuesday, that it had emerged as a successful bidder and has received a Letter of Intent (LOI) from Maharashtra State Electricity Distribution Co. Limited. (MSEDCL) for procurement of 1,500 MW/ 12,000 MWh energy storage capacity from the pumped hydro storage project.The company plans to supply the storage capacity from its upcoming pumped hydro storage plant being set up in Raigad District, Maharashtra. Under the Pumped Hydro Energy Storage Facility Agreement (PHESFA), the company shall make available to MSEDCL a contracted capacity of 1,500 MW capable of scheduled discharge of 8 hours (with maximum continuous 5 hours) per day. The input energy for charging shall be provided by MSEDCL, the company said.Torrent Power has identified Pumped Storage Project (PSP) sites in multiple states. The company has already announced that it intends to install about 5 to 8 GW of PSP capacity, entailing an investment of  ₹25,000 to  ₹35,000 crores.The company has signed a memorandum of understanding (MoU) with the Gujarat State Government to establish a 5GW solar, wind, or hybrid solar-wind project in the Dwarka District, as per a stock exchange filing on Monday.The company plans to invest  ₹64,200 crore through two letters of commitment with the Union Ministry of New and Renewable Energy. One of these commitments includes achieving 10 GW of renewable energy capacity by 2030, with an estimated investment of  ₹57,000 crore.As part of next-generation energy reforms, green hydrogen will play a pivotal role in achieving net-zero emissions and decarbonizing sectors that are difficult to abate. Torrent Power is actively exploring opportunities in green hydrogen and green ammonia production to serve both domestic and export markets.The second letter of commitment focuses on setting up a green ammonia production facility with a capacity of 1,00,000 Kilo Tonnes Per Annum (KTPA), requiring an investment of  ₹7,200 crore.As of the latest update, the company has an installed generation capacity of 4.4 GWp, which includes 2.7 GW of gas-based capacity, 1.3 GWp of renewable energy, and 362 MW of coal-based power.With a solid track record in commissioning large-scale infrastructure projects and a strong financial position, Torrent Power is well-positioned to contribute significantly to India's goal of achieving 500 GW of renewable energy by 2030.The stock has been on a strong upward trajectory for the past 20 months, posting an impressive 305 per cent gain, fueled by strong order wins and improving fundamentals, which have garnered substantial investor interest.Over the last five years, the stock has delivered a return exceeding 557 per cent, and over the past decade, it has surged by an outstanding 1,236 per cent. This price rally has also propelled the company's market capitalization to USD 20 billion for the first time as of June.","cleaned_content":"torrent power a leading integrated power utility saw its share price climb by \u003cFIVE_PERCENT\u003e to \u003cONE_THOUSAND\u003e during wednesdays trading session driven by the announcement of securing an order for the pumped hydro storage project the company informed investors on tuesday that it had emerged as a successful bidder and has received a letter of intent loi from maharashtra state electricity distribution co limited msedcl for procurement of \u003cONE_THOUSAND\u003e mw \u003cONE_TEN_THOUSAND\u003e mwh energy storage capacity from the pumped hydro storage project the company plans to supply the storage capacity from its upcoming pumped hydro storage plant being set up in raigad district maharashtra under the pumped hydro energy storage facility agreement phesfa the company shall make available to msedcl a contracted capacity of \u003cONE_THOUSAND\u003e mw capable of scheduled discharge of \u003cEIGHT_\u003e hours with maximum continuous \u003cFIVE_\u003e hours per day the input energy for charging shall be provided by msedcl the company said torrent power has identified pumped storage project psp sites in multiple states the company has already announced that it intends to install about \u003cFIVE_\u003e to \u003cEIGHT_\u003e gw of psp capacity entailing an investment of \u003cTWO_TEN_THOUSAND\u003e to \u003cTHREE_TEN_THOUSAND\u003e crores the company has signed a memorandum of understanding mou with the gujarat state government to establish a \u003cFIVE_\u003e gw solar wind or hybrid solar wind project in the dwarka district as per a stock exchange filing on monday the company plans to invest \u003cSIX_TEN_THOUSAND\u003e crore through two letters of commitment with the union ministry of new and renewable energy one of these commitments includes achieving \u003cONE_TEN\u003e gw of renewable energy capacity by \u003cTWO_THOUSAND\u003e with an estimated investment of \u003cFIVE_TEN_THOUSAND\u003e crore as part of next generation energy reforms green hydrogen will play a pivotal role in achieving net zero emissions and decarbonizing sectors that are difficult to abate torrent power is actively exploring opportunities in green hydrogen and green ammonia production to serve both domestic and export markets the second letter of commitment focuses on setting up a green ammonia production facility with a capacity of \u003cONE_HUNDRED_THOUSAND\u003e kilo tonnes per annum ktpa requiring an investment of \u003cSEVEN_THOUSAND\u003e crore as of the latest update the company has an installed generation capacity of \u003cFOUR_\u003e gwp which includes \u003cTWO_\u003e gw of gas based capacity \u003cONE_\u003e gwp of renewable energy and \u003cTHREE_HUNDRED\u003e mw of coal based power with a solid track record in commissioning large scale infrastructure projects and a strong financial position torrent power is well positioned to contribute significantly to indias goal of achieving \u003cFIVE_HUNDRED\u003e gw of renewable energy by \u003cTWO_THOUSAND\u003e the stock has been on a strong upward trajectory for the past \u003cTWO_TEN\u003e months posting an impressive \u003cTHREE_HUNDRED_PERCENT\u003e gain fueled by strong order wins and improving fundamentals which have garnered substantial investor interest over the last five years the stock has delivered a return exceeding \u003cFIVE_HUNDRED_PERCENT\u003e and over the past decade it has surged by an outstanding \u003cONE_THOUSAND_PERCENT\u003e this price rally has also propelled the companys market capitalization to usd \u003cTWO_TEN\u003e billion for the first time as of june","timestamp":"2024-09-18T10:05:00+05:30","market_timestamp":"2024-09-18T10:05:00+05:30","off_market_hours":false}