{"url":"https://www.livemint.com/market/stock-market-news/suzlon-share-price-experts-give-buy-tag-despite-2800-rally-in-five-years-should-you-buy-this-fii-favourite-stock-11726287880668.html","title":"Suzlon share price: Experts give ’buy’ tag despite 2800% rally in five years. Should you buy this FII favourite stock?","description":"Suzlon share price has risen over 115% in one year","content":"Stock to buy: Suzlon Energy shares have been on an uptrend. In one year, Suzlon's share price has surged over 115 per cent, whereas in the last five years, this multibagger stock has surged over 2800 per cent. However, stock market experts are still bullish on this FIIs' favourite stock. They believe revival in the renewable energy sector and Suzlon Energy's fast-reducing debt are expected to keep the upside momentum intact. Suzlon's share price may touch the  ₹140 mark in the long term.On why Suzlon's share price is skyrocketing, Ravi Singh, SVP—Retail Research at Religare Broking, said, \"The recent surge in Suzlon's share price can be attributed to the revival of the renewable energy sector, especially wind energy, in which the company has a bigger foothold. Moreover, Suzlon's effort to significantly reduce debt improves financial health and boosts investor confidence. Technically, the stock has reached an all-time high, formed a new base, and crossed all major moving averages, indicating more upside.\"Sagar Shetty, Research Analyst at StoxBox, said, \"Suzlon's share prices have been steadily rising, reflecting the company's strong business performance and successful turnaround after a challenging decade. Recently, Suzlon reported impressive growth in both revenue and profit, achieving its highest quarterly EBITDA in seven years. The company has significantly improved its financial health by reducing debt through various debt-to-equity conversions and becoming net cash positive, following a successful equity raise aimed at further debt reduction.\"The StoxBox expert said that Suzlon has demonstrated robust delivery performance and is expected to continue this trend, supported by a record order book of 3.8 GW. With an anticipated operational ramp-up, the company focuses on addressing its business needs, including effective execution, stringent cost control measures, and improving its balance sheet. Favorable sectoral trends further support a positive future growth trajectory. Although many of the near-term positives appear reflected in the current share prices, which makes the short-term risk-reward ratio less favourable, the medium to long-term outlook remains promising. Effective project execution will be crucial for driving future growth.\"Strong fundamentals are thus combined with a favourable technical setup, making Suzlon Energy shares an interesting investment. Investors can continue holding long positions with a stop at  ₹72, which will help reduce losses and, at the same time, allow riding on the ongoing rally in the stock on the back of broader growth in renewable energy and the company's recovery.\"Asked about the technical outlook of Suzlon Energy shares, Sumeet Bagadia, Executive Director at Choice Broking, said, “Suzlon Energy share is currently trading at  ₹83 and is consistently forming new higher highs and higher lows, indicating a strong bullish trend. The monthly chart shows Suzlon's share price has formed a significant rounding pattern, suggesting further potential upside. For investors holding Suzlon Energy shares, it may be wise to continue holding with long-term targets of  ₹100 and  ₹140 in mind. Short-term traders might consider booking profits around the  ₹85 and  ₹90 apiece.”According to the shareholding pattern of Suzlon Energy Limited for the April to June 2024 quarter, FIIs hold 20.63 per cent stake in this renewable energy company.","cleaned_content":"stock to buy suzlon energy shares have been on an uptrend in one year suzlons share price has surged over \u003cONE_HUNDRED_PERCENT\u003e whereas in the last five years this multibagger stock has surged over \u003cTWO_THOUSAND_PERCENT\u003e however stock market experts are still bullish on this fiis favourite stock they believe revival in the renewable energy sector and suzlon energys fast reducing debt are expected to keep the upside momentum intact suzlons share price may touch the \u003cONE_HUNDRED\u003e mark in the long term on why suzlons share price is skyrocketing ravi singh svp retail research at religare broking said the recent surge in suzlons share price can be attributed to the revival of the renewable energy sector especially wind energy in which the company has a bigger foothold moreover suzlons effort to significantly reduce debt improves financial health and boosts investor confidence technically the stock has reached an all time high formed a new base and crossed all major moving averages indicating more upside sagar shetty research analyst at stoxbox said suzlons share prices have been steadily rising reflecting the companys strong business performance and successful turnaround after a challenging decade recently suzlon reported impressive growth in both revenue and profit achieving its highest quarterly ebitda in seven years the company has significantly improved its financial health by reducing debt through various debt to equity conversions and becoming net cash positive following a successful equity raise aimed at further debt reduction the stoxbox expert said that suzlon has demonstrated robust delivery performance and is expected to continue this trend supported by a record order book of \u003cTHREE_\u003e gw with an anticipated operational ramp up the company focuses on addressing its business needs including effective execution stringent cost control measures and improving its balance sheet favorable sectoral trends further support a positive future growth trajectory although many of the near term positives appear reflected in the current share prices which makes the short term risk reward ratio less favourable the medium to long term outlook remains promising effective project execution will be crucial for driving future growth strong fundamentals are thus combined with a favourable technical setup making suzlon energy shares an interesting investment investors can continue holding long positions with a stop at \u003cSEVEN_TEN\u003e which will help reduce losses and at the same time allow riding on the ongoing rally in the stock on the back of broader growth in renewable energy and the companys recovery asked about the technical outlook of suzlon energy shares sumeet bagadia executive director at choice broking said suzlon energy share is currently trading at \u003cEIGHT_TEN\u003e and is consistently forming new higher highs and higher lows indicating a strong bullish trend the monthly chart shows suzlons share price has formed a significant rounding pattern suggesting further potential upside for investors holding suzlon energy shares it may be wise to continue holding with long term targets of \u003cONE_HUNDRED\u003e and \u003cONE_HUNDRED\u003e in mind short term traders might consider booking profits around the \u003cEIGHT_TEN\u003e and \u003cNINE_TEN\u003e apiece according to the shareholding pattern of suzlon energy limited for the april to june \u003cTWO_THOUSAND\u003e quarter fiis hold \u003cTWO_TEN_PERCENT\u003e stake in this renewable energy company","timestamp":"2024-09-14T10:21:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}