{"url":"https://www.livemint.com/market/stock-market-news/newage-tech-stocks-policybazaar-pips-cartrade-to-log-biggest-weekly-gain-zomato-upgraded-on-near-term-profit-11726935828459.html","title":"New-Age Tech Stocks | Policybazaar pips CarTrade to log biggest weekly gain; Zomato ‘upgraded’ on near-term profit","description":"New-Age Tech Stocks | PB Fintech (Policybazaar) emerged as the biggest weekly gainer among new-age stocks, rising eight per cent in the last five days, followed by Zomato and Ola Electric.","content":"New-age tech stocks such as Paytm, Zomato, Nykaa, among others, witnessed rapid changes in their respective stock prices this week when domestic equity benchmarks Sensex and Nifty 50 logged record highs on strong global cues. Some of the top new-age tech stocks snapped their winning streaks, while others outperformed the frontline benchmarks on robust buying interest.Among the biggest trend makers, India's largest online insurance and lending platform, PB Fintech, which operates Policybazaar, overpowered CarTrade Tech to emerge as the biggest weekly gainer among the top new-age tech stocks. PB Fintech snapped CarTrade Tech's streak and gained eight per cent in the last five market sessions, followed by Zomato, which rose 4.66 per cent.Also Read: Multibagger PB Fintech share price declines up to 6%: Should you Buy, Sell or Hold the Policy Bazaar stock?During the week, new age-tech stocks like Zomato and Delhivery outperformed the Nifty 50 index. However, Nykaa, Paytm, Unicommerce eSolutions, and Brainbees Solutions (First Cry) underperformed the benchmark.Analysts at Jefferies India Pvt Ltd said that PB Fintech (Policybazaar) delivered another strong beat on growth with its core new premiums rising 66 per cent year-on-year (YoY). Better take rates (up 30 basis points YoY) are driving greater renewal commissions (up 35 per cent YoY).The increase in the percentage of health and ULIPs as well as the investment in advisers to support faster development led to the weaker contribution margins, which came in at 43 per cent ( down two percentage points).Also Read: Zomato stock price jumps over 6% to record high after UBS lifts target price to  ₹320ICICI Securities however says that \"while premium growth is the singular essential criterion, Q1FY25 adjusted net profit will need better margin coordination to reach  ₹1,000 Crore net profit by FY27.Ability to gain market share , expansion of client base and growth in registered customers (both for Policy Bazaar and Paisa bazaar)respectively in Q1FY25) are structural advantages. ICICI Securities target price of  ₹1,462 indicates limited upside for PB Fintech (Policybazaar) share price.PB Fintech, Zomato, and Ola Electric dominated the new-age tech pack last week logging an increase of eight per cent, 4.66 per cent, and three per cent respectively. Deepinder Goyal-led food delivery giant Zomato is the biggest new-age gen stock by market value with a market capitalisation (mcap) of  ₹25,6815.29 crore.Also Read: Ambit sees 11.5% downside in Ola Electric Mobility as stock falls 28% from peak, reiterates ‘sell’ call—key reasons whyOn the other hand, Netweb Technologies emerged as the biggest loser among the top 13 new-age tech stocks this week, shedding as much as 4.10 per cent from its stock price. This was followed by FSN E-Commerce Ventures Ltd -which owns the beauty and personal care brand Nykaa, logging a weekly decline of 2.75 per cent, and One97 Comunications - which operates the fintech major Paytm, registering a decline of 2.65 per cent in the last five days.Notably, Paytm stock rose above the  ₹700 mark last week for the first time since January 2024. The fintech has been on a recovery trajectory since hitting its all-time low of  ₹310 per share and has surged by 116 per cent to date. It has recorded double-digit gains over the past four months, including September.After declining for four consecutive months, the stock rebounded in June with an 11.4 per cent increase. It continued to perform well, with gains of 23 per cent and 26 per cent in the following two months. In the current month, the stock has further strengthened, posting an additional 10 per cent gain.Also Read: Paytm share price crosses  ₹700 mark for first time since January, up 116% from May lows1.FSN E-Commerce Ventures (Nykaa) CMP Target Price  ₹190Nykaa has a diverse portfolio of beauty, personal care, and fashion products, including owned brand products manufactured by it. ‘’As a percentage of NSV, we believe the fulfilment cost may increase in the near term, as the company attempts to cover a larger number of cities in the same-day/next-day delivery folds,'' said Shrikant Chouhan, Head Equity Research, Kotak Securities\"Consequently, we trim EBITDA estimates for our BPC and eB2B segments, resulting in a 7-11 per cent EPS cut for FY2025-27 and a new FV of Rs190. The sharp 34 per cent run-up in stock price in the past three months drives a downgrade in the rating from ADD to SELL,'' added Chouhan.2.Delhivery CMP Target Price  ₹560Delhivery provides a full range of Logistics services, including delivery of express parcels and heavy goods, PTL freight, TL freight, warehousing, supply chain solutions, cross-border Express, freight services, and supply chain software. The 1Q beat helps allay Valmo's effect on revenue growth and profitability.Also Read: Paytm AGM: CEO Vijay Shekhar to reapply for PA license, charts path from losses to profitability - top 10 things to knowThe growing reach and interplay of Delhivery’s businesses are helping it leverage its integrated and interoperable network, increasing its cost lead over its new-age/traditional monoline business peers. It is rightfully skipping new opportunities that limit the use of such network moats.‘’This should likely set the stage for a period of positive surprises on margin uptick. We increase our margin estimates by 60-100 bps (versus ~100 bps 1Q beat); FV increases to  ₹560 from  ₹545. BUY,'' said Kotak Securities.3.Zomato CMP Target Price  ₹270Zomato’s food delivery GOV growth came in at a solid 27 per cent YoY and beat estimates. Food delivery CM of 7.3 per cent (versus 7.5 per cent in 4QFY24) was muted, though operating leverage ensured sequential EBITDA margin expansion. Blinkit’s GOV grew a solid 130/22 per cent YoY/QoQ, accompanied by CM improvement and loss reduction.Also Read: Paytm to focus on core business, profitability, to extend leadership into AI tech: CEO Vijay Shekhar SharmaGuidance of achieving a ~2,000 store count by end-2026 is aggressive and shows the company’s confidence in the model. We upgrade revenue estimates, but bake in lower near-term profitability, resulting in a 7-9 per cent FY2025-27E EPS cut. Strong growth and steady margins in food delivery warrant lower WACC, resulting in a revised SoTP-based FV of  ₹270,'' said Shrikant Chouhan of Kotak Securities.New-age tech companies focus on innovative and high-growth areas. They often leverage modern technologies like artificial intelligence, machine learning, the Internet of Things (IoT), and blockchain to create unique products and services. The companies are characterized by sudden growth, high market valuations, and significant potential for disrupting traditional industries.","cleaned_content":"new age tech stocks such as paytm zomato nykaa among others witnessed rapid changes in their respective stock prices this week when domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e logged record highs on strong global cues some of the top new age tech stocks snapped their winning streaks while others outperformed the frontline benchmarks on robust buying interest among the biggest trend makers indias largest online insurance and lending platform pb fintech which operates policybazaar overpowered cartrade tech to emerge as the biggest weekly gainer among the top new age tech stocks pb fintech snapped cartrade techs streak and gained eight per cent in the last five market sessions followed by zomato which rose \u003cFOUR_PERCENT\u003e also read multibagger pb fintech share price declines up to \u003cSIX_PERCENT\u003e should you buy sell or hold the policy bazaar stock during the week new age tech stocks like zomato and delhivery outperformed the nifty \u003cFIVE_TEN\u003e index however nykaa paytm unicommerce esolutions and brainbees solutions first cry underperformed the benchmark analysts at jefferies india pvt ltd said that pb fintech policybazaar delivered another strong beat on growth with its core new premiums rising \u003cSIX_TEN_PERCENT\u003e year on year yoy better take rates up \u003cTHREE_TEN\u003e basis points yoy are driving greater renewal commissions up \u003cTHREE_TEN_PERCENT\u003e yoy the increase in the percentage of health and ulips as well as the investment in advisers to support faster development led to the weaker contribution margins which came in at \u003cFOUR_TEN_PERCENT\u003e down two percentage points also read zomato stock price jumps over \u003cSIX_PERCENT\u003e to record high after ubs lifts target price to \u003cTHREE_HUNDRED\u003e icici securities however says that while premium growth is the singular essential criterion q1fy25 adjusted net profit will need better margin coordination to reach \u003cONE_THOUSAND\u003e crore net profit by fy27 ability to gain market share expansion of client base and growth in registered customers both for policy bazaar and paisa bazaar respectively in q1fy25 are structural advantages icici securities target price of \u003cONE_THOUSAND\u003e indicates limited upside for pb fintech policybazaar share price pb fintech zomato and ola electric dominated the new age tech pack last week logging an increase of eight per cent \u003cFOUR_PERCENT\u003e and three per cent respectively deepinder goyal led food delivery giant zomato is the biggest new age gen stock by market value with a market capitalisation mcap of \u003cTWO_HUNDRED_THOUSAND\u003e crore also read ambit sees \u003cONE_TEN_PERCENT\u003e downside in ola electric mobility as stock falls \u003cTWO_TEN_PERCENT\u003e from peak reiterates sell call key reasons whyon the other hand netweb technologies emerged as the biggest loser among the top \u003cONE_TEN\u003e new age tech stocks this week shedding as much as \u003cFOUR_PERCENT\u003e from its stock price this was followed by fsn e commerce ventures ltd which owns the beauty and personal care brand nykaa logging a weekly decline of \u003cTWO_PERCENT\u003e and one97 comunications which operates the fintech major paytm registering a decline of \u003cTWO_PERCENT\u003e in the last five days notably paytm stock rose above the \u003cSEVEN_HUNDRED\u003e mark last week for the first time since january \u003cTWO_THOUSAND\u003e the fintech has been on a recovery trajectory since hitting its all time low of \u003cTHREE_HUNDRED\u003e per share and has surged by \u003cONE_HUNDRED_PERCENT\u003e to date it has recorded double digit gains over the past four months including september after declining for four consecutive months the stock rebounded in june with an \u003cONE_TEN_PERCENT\u003e increase it continued to perform well with gains of \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e in the following two months in the current month the stock has further strengthened posting an additional \u003cONE_TEN_PERCENT\u003e gain also read paytm share price crosses \u003cSEVEN_HUNDRED\u003e mark for first time since january up \u003cONE_HUNDRED_PERCENT\u003e from may lows1 fsn e commerce ventures nykaa cmp target price \u003cONE_HUNDRED\u003e nykaa has a diverse portfolio of beauty personal care and fashion products including owned brand products manufactured by it as a percentage of nsv we believe the fulfilment cost may increase in the near term as the company attempts to cover a larger number of cities in the same day next day delivery folds said shrikant chouhan head equity research kotak securities consequently we trim ebitda estimates for our bpc and eb2b segments resulting in a \u003cSEVEN_\u003e \u003cONE_TEN_PERCENT\u003e eps cut for fy2025 \u003cTWO_TEN\u003e and a new fv of rs190 the sharp \u003cTHREE_TEN_PERCENT\u003e run up in stock price in the past three months drives a downgrade in the rating from add to sell added chouhan 2 delhivery cmp target price \u003cFIVE_HUNDRED\u003e delhivery provides a full range of logistics services including delivery of express parcels and heavy goods ptl freight tl freight warehousing supply chain solutions cross border express freight services and supply chain software the \u003cONE_\u003e q beat helps allay valmos effect on revenue growth and profitability also read paytm agm ceo vijay shekhar to reapply for pa license charts path from losses to profitability top \u003cONE_TEN\u003e things to knowthe growing reach and interplay of delhivery s businesses are helping it leverage its integrated and interoperable network increasing its cost lead over its new age traditional monoline business peers it is rightfully skipping new opportunities that limit the use of such network moats this should likely set the stage for a period of positive surprises on margin uptick we increase our margin estimates by \u003cSIX_TEN\u003e \u003cONE_HUNDRED\u003e bps versus \u003cONE_HUNDRED\u003e bps \u003cONE_\u003e q beat fv increases to \u003cFIVE_HUNDRED\u003e from \u003cFIVE_HUNDRED\u003e buy said kotak securities 3 zomato cmp target price \u003cTWO_HUNDRED\u003e zomato s food delivery gov growth came in at a solid \u003cTWO_TEN_PERCENT\u003e yoy and beat estimates food delivery cm of \u003cSEVEN_PERCENT\u003e versus \u003cSEVEN_PERCENT\u003e in \u003cFOUR_\u003e qfy24 was muted though operating leverage ensured sequential ebitda margin expansion blinkit s gov grew a solid \u003cONE_HUNDRED\u003e \u003cTWO_TEN_PERCENT\u003e yoy qoq accompanied by cm improvement and loss reduction also read paytm to focus on core business profitability to extend leadership into ai tech ceo vijay shekhar sharmaguidance of achieving a \u003cTWO_THOUSAND\u003e store count by end \u003cTWO_THOUSAND\u003e is aggressive and shows the company s confidence in the model we upgrade revenue estimates but bake in lower near term profitability resulting in a \u003cSEVEN_\u003e \u003cNINE_PERCENT\u003e fy2025 \u003cTWO_TEN\u003e e eps cut strong growth and steady margins in food delivery warrant lower wacc resulting in a revised sotp based fv of \u003cTWO_HUNDRED\u003e said shrikant chouhan of kotak securities new age tech companies focus on innovative and high growth areas they often leverage modern technologies like artificial intelligence machine learning the internet of things iot and blockchain to create unique products and services the companies are characterized by sudden growth high market valuations and significant potential for disrupting traditional industries","timestamp":"2024-09-21T21:59:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}