{"url":"https://www.livemint.com/market/stock-market-news/zomato-share-price-at-a-fresh-record-high-up-nearly-193-from-its-1-year-low-is-it-still-buy-worthy-experts-weigh-in-11726139172127.html","title":"Zomato share price at a fresh record high, up nearly 193% from its 1-year low; is it still buy-worthy? Experts weigh in","description":"Zomato shares rose over 5 per cent to  ₹285.95, marking a new high on September 12. The stock has gained nearly 193 per cent from its 52-week low and delivered 274 per cent returns since its 2021 debut. Analysts attribute the surge to positive sentiment and strategic acquisitions.","content":"Zomato share price: Rising over 5 per cent in intraday trade, shares of Zomato hit its fresh all-time high of  ₹285.95 in intraday trade on the BSE on Thursday, September 12. The stock finally closed 4.49 per cent higher at  ₹283.90, extending its winning streak into the sixth consecutive session.The stock hit its 52-week low of  ₹97.07 on September 13 last year. At the current market price of  ₹283.90, it has jumped nearly 193 per cent from its one-year low.Zomato’s stock made its debut on the Indian bourses on July 23, 2021, and in just over three years, it has delivered a remarkable 274 per cent return, surging from its issue price of  ₹76.On a monthly basis, the stock has stayed in the green since April 2023, with May being the only month that broke its winning streak this year. After a brief pause in May, the stock resumed its upward march in June and has been climbing ever since. In the current month so far, the stock has surged 13 per cent.Given the stock’s impressive rally over the past year, we reached out to several analysts to gather their insights on what’s fueling its momentum and what investors should do with the stock. Here's what they said:The stock price of Zomato has rallied, mainly due to positive investor sentiments created after seeing a flurry of upgrades in target price by global brokerage firms like JPMorgan, CLSA, and Jefferies as analysts turn positive on its quick commerce business Blinkit.The rally in Zomato’s stock price, also boosted by its recent acquisition of Paytm's events and movie ticketing business, which will add a new revenue stream, has led to positive reactions from investors. Zomato's management is also optimistic about future growth, especially in the going-out segment, which is expected to draw strong demand.\"With more than half of the tech-based Indian food delivery market under its grip, Zomato has cemented its position as a major player in the sector. Its broad range of offerings, which includes grocery delivery, dine-out alternatives, food delivery, and the Hyperpure business, further contribute to its domination,\" said Sinha.Zomato’s overall strategy strongly focuses on profitability and scaling across multiple verticals. The food delivery segment remains the core of its business, where Zomato has achieved steady growth, reaching 13 per cent GMV growth in dollar terms by the end of FY24.The company’s margin improvements are notable, with its EBITDA margin projected to expand from 0.3 per cent in FY24 to 15.1 per cent by FY27, reflecting operational efficiencies and higher average order values.In parallel, Zomato’s quick commerce (Blinkit) has shown impressive traction, capitalizing on a growing consumer shift towards fast deliveries.Blinkit’s expanding dark store network, now at 433 locations, enhances Zomato’s reach, while its SKU expansion drives basket size growth. These efforts point to a diversified strategy where Zomato is not just about food delivery but also quick commerce and now the entertainment space.Zomato’s increasing cash reserves, projected at  ₹21,300 crore by FY27, give it the flexibility to pursue growth and new business lines, providing a strong foundation for its future ambitions.Matalia pointed out that Zomato stock has exhibited a strong uptrend, consistently forming higher highs and higher lows. This indicates robust bullish momentum and suggests the potential for continued upward movement. Support could be at  ₹265, with a short-term price target near  ₹325.The Relative Strength Index (RSI) is at 67.54 and trending upward, reflecting increasing buying momentum. This upward trend in the RSI signals that the stock is gaining strength, reinforcing the bullish outlook. Additionally, the stock is trading above its short-term (20-day), medium-term (50-day), and long-term (200-day) Exponential Moving Averages (EMAs), further confirming the prevailing bullish sentiment.\"Given these positive technical indicators and the current market environment, Zomato presents a promising buying opportunity for investors targeting  ₹325. To manage risk, stop loss at  ₹250 is recommended to protect against unexpected market downturns, ensuring that the losses can minimised,\" said Matalia.Zomato is currently experiencing a clear uptrend, as evidenced by its consistent formation of a \"higher highs\" structure on the price chart. This means that each new peak in price is higher than the previous one, indicating sustained upward momentum.On the technical indicator front, both the Directional Movement Index (DMI) and the Relative Strength Index (RSI) are suggesting bullish momentum.\"If Zomato’s stock price successfully breaks through the  ₹282 resistance, it opens the door for a potential move towards  ₹300, a psychologically significant and technical level. On the downside, if there’s any retracement or pullback, the support zone around  ₹265 is expected to act as a buffer, limiting the extent of the decline. This area should provide a strong base for the stock, keeping the uptrend intact unless broken decisively,\" said Patel.Read all market-related news here","cleaned_content":"zomato share price rising over \u003cFIVE_PERCENT\u003e in intraday trade shares of zomato hit its fresh all time high of \u003cTWO_HUNDRED\u003e in intraday trade on the bse on thursday september \u003cONE_TEN\u003e the stock finally closed \u003cFOUR_PERCENT\u003e higher at \u003cTWO_HUNDRED\u003e extending its winning streak into the sixth consecutive session the stock hit its \u003cFIVE_TEN\u003e week low of \u003cNINE_TEN\u003e on september \u003cONE_TEN\u003e last year at the current market price of \u003cTWO_HUNDRED\u003e it has jumped nearly \u003cONE_HUNDRED_PERCENT\u003e from its one year low zomato s stock made its debut on the indian bourses on july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and in just over three years it has delivered a remarkable \u003cTWO_HUNDRED_PERCENT\u003e return surging from its issue price of \u003cSEVEN_TEN\u003e on a monthly basis the stock has stayed in the green since april \u003cTWO_THOUSAND\u003e with may being the only month that broke its winning streak this year after a brief pause in may the stock resumed its upward march in june and has been climbing ever since in the current month so far the stock has surged \u003cONE_TEN_PERCENT\u003e given the stock s impressive rally over the past year we reached out to several analysts to gather their insights on what s fueling its momentum and what investors should do with the stock heres what they said the stock price of zomato has rallied mainly due to positive investor sentiments created after seeing a flurry of upgrades in target price by global brokerage firms like jpmorgan clsa and jefferies as analysts turn positive on its quick commerce business blinkit the rally in zomato s stock price also boosted by its recent acquisition of paytms events and movie ticketing business which will add a new revenue stream has led to positive reactions from investors zomatos management is also optimistic about future growth especially in the going out segment which is expected to draw strong demand with more than half of the tech based indian food delivery market under its grip zomato has cemented its position as a major player in the sector its broad range of offerings which includes grocery delivery dine out alternatives food delivery and the hyperpure business further contribute to its domination said sinha zomato s overall strategy strongly focuses on profitability and scaling across multiple verticals the food delivery segment remains the core of its business where zomato has achieved steady growth reaching \u003cONE_TEN_PERCENT\u003e gmv growth in dollar terms by the end of fy24 the company s margin improvements are notable with its ebitda margin projected to expand from \u003cZERO_PERCENT\u003e in fy24 to \u003cONE_TEN_PERCENT\u003e by fy27 reflecting operational efficiencies and higher average order values in parallel zomato s quick commerce blinkit has shown impressive traction capitalizing on a growing consumer shift towards fast deliveries blinkit s expanding dark store network now at \u003cFOUR_HUNDRED\u003e locations enhances zomato s reach while its sku expansion drives basket size growth these efforts point to a diversified strategy where zomato is not just about food delivery but also quick commerce and now the entertainment space zomato s increasing cash reserves projected at \u003cTWO_TEN_THOUSAND\u003e crore by fy27 give it the flexibility to pursue growth and new business lines providing a strong foundation for its future ambitions matalia pointed out that zomato stock has exhibited a strong uptrend consistently forming higher highs and higher lows this indicates robust bullish momentum and suggests the potential for continued upward movement support could be at \u003cTWO_HUNDRED\u003e with a short term price target near \u003cTHREE_HUNDRED\u003e the relative strength index rsi is at \u003cSIX_TEN\u003e and trending upward reflecting increasing buying momentum this upward trend in the rsi signals that the stock is gaining strength reinforcing the bullish outlook additionally the stock is trading above its short term \u003cTWO_TEN\u003e day medium term \u003cFIVE_TEN\u003e day and long term \u003cTWO_HUNDRED\u003e day exponential moving averages emas further confirming the prevailing bullish sentiment given these positive technical indicators and the current market environment zomato presents a promising buying opportunity for investors targeting \u003cTHREE_HUNDRED\u003e to manage risk stop loss at \u003cTWO_HUNDRED\u003e is recommended to protect against unexpected market downturns ensuring that the losses can minimised said matalia zomato is currently experiencing a clear uptrend as evidenced by its consistent formation of a higher highs structure on the price chart this means that each new peak in price is higher than the previous one indicating sustained upward momentum on the technical indicator front both the directional movement index dmi and the relative strength index rsi are suggesting bullish momentum if zomato s stock price successfully breaks through the \u003cTWO_HUNDRED\u003e resistance it opens the door for a potential move towards \u003cTHREE_HUNDRED\u003e a psychologically significant and technical level on the downside if there s any retracement or pullback the support zone around \u003cTWO_HUNDRED\u003e is expected to act as a buffer limiting the extent of the decline this area should provide a strong base for the stock keeping the uptrend intact unless broken decisively said patel read all market related news here","timestamp":"2024-09-12T16:47:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}