{"url":"https://www.livemint.com/market/stock-market-news/geopolitical-risks-global-markets-india-stock-markets-growth-drivers-chris-wood-foreign-investors-11726745378273.html","title":"Geopolitical risks loom large for global markets but India’s growth drivers provide a buffer, says Jefferies’ Chris Wood","description":"While foreign investors remain wary due to high valuations, Wood believes India’s domestic fundamentals will help cushion its markets from global volatility.","content":"As geopolitical tensions escalate and stock market valuations reach lofty heights, global markets face an unsettling combination of risks. But India, buoyed by its robust growth engines, appears better positioned to weather the storm, according to Christopher Wood, global head of equity strategy at investment bank Jefferies.Speaking to a select group of journalists on the sidelines of the Jefferies India Forum 2024, Wood highlighted that while the Russia-Ukraine war and the conflict in West Asia continue to stoke volatility, India's domestic fundamentals provide a cushion.The situation in the US also looms large, with market participants watching the upcoming presidential elections closely. According to Wood, investors are hoping for a Trump victory, viewing his pro-business policies as favourable for the markets. However, neither of the major US candidates is tackling the country's fiscal woes, and the markets will start to pay attention to the \"fiscal deterioration\" in the US after the elections, according to Wood.Investors face an uneasy choice: hedge against geopolitical risks by holding cash, gold, or energy, though Wood warns that cash could prove costly if no major upheavals occur.'The interesting point,\" Wood noted, “is that oil has been trading in the $70-90 range for an extended period. The question to ask is, why is oil trading at such weak levels?” He speculated that China’s economic slowdown could be a factor, though he expressed surprise at the current crude oil prices.He also noted that the US Federal Reserve rate cut may not lead to substantial foreign inflows into India, as the country’s high valuations remain a deterrent for fund managers. China's stock market trades at 8 times earnings, India (excluding financials) trades at around 29 times, which Wood characterized as a “bit of a nightmare situation.”Nonetheless, he argued that China’s deflationary spiral continues to make it an unattractive investment option, pointing to India's significantly stronger nominal GDP growth of 10-12%, compared to China’s 4%.\"The real slowdown in China is captured in the nominal data, not the real data,\" he pointed out.Wood underscored that India's large fiscal deficit is more palatable than those of G7 nations, as it is largely driven by infrastructure spending rather than transfer payments. Additionally, he said that India's markets will increasingly decouple from Wall Street as domestic investors take on a larger role.Read this | Higher revenue, poll impact rein in fiscal deficit at  ₹2.7 trillion in April-July“More the domestic investors drive the market, the less correlated it will be to Wall Street,” he remarked.Recent global disruptions, such as the unwinding of the yen carry trade, had little impact on Indian markets.Wood does not foresee the Reserve Bank of India rushing to cut interest rates.The US Federal Reserve kicked off its monetary policy easing cycle on Wednesday with a 50-basis-point (bps) interest rate cut, bringing the Fed funds target range to 4.75-5%.More here | After US Fed's surprise interest rate cut, all eyes on RBI's management skillsJefferies India’s head of research, Mahesh Nandurkar, echoed this sentiment, “Our global house view is that (US) Fed would cut rates by 200 basis point (bps) by June 2025, out of which 50 bps has been done. And the RBI would cut by 50 bps by that time.”The broader Indian market appears stable for now, though some mid and small-cap stocks may be vulnerable to correction, Wood noted. Certain sectors, such as defence PSUs and railways, have already seen sharp corrections of 10-15% in recent months.\"We should also remember that in a bull market, a stock can correct by one-third any time, Wood added. “Bull market corrections tend to be short, sharp and violent.”Wood pointed out that global central banks have been increasing their gold purchases, a trend accelerated by the freezing of Russia’s foreign exchange reserves, demonstrating the dollar's weaponization. This has been a key driver behind the recent surge in gold prices.As for alternative assets, Wood argued that there is little case for Indian investors to diversify into cryptocurrencies, given the strength of the domestic growth story. However, he recommended a modest allocation to crypto for those focused on dollar-denominated assets.\"I have a 5% allocation to Bitcoin ETF in my global equity portfolio,\" he added.","cleaned_content":"as geopolitical tensions escalate and stock market valuations reach lofty heights global markets face an unsettling combination of risks but india buoyed by its robust growth engines appears better positioned to weather the storm according to christopher wood global head of equity strategy at investment bank jefferies speaking to a select group of journalists on the sidelines of the jefferies india forum \u003cTWO_THOUSAND\u003e wood highlighted that while the russia ukraine war and the conflict in west asia continue to stoke volatility indias domestic fundamentals provide a cushion the situation in the us also looms large with market participants watching the upcoming presidential elections closely according to wood investors are hoping for a trump victory viewing his pro business policies as favourable for the markets however neither of the major us candidates is tackling the countrys fiscal woes and the markets will start to pay attention to the fiscal deterioration in the us after the elections according to wood investors face an uneasy choice hedge against geopolitical risks by holding cash gold or energy though wood warns that cash could prove costly if no major upheavals occur the interesting point wood noted is that oil has been trading in the \u003cSEVEN_TEN\u003e \u003cNINE_TEN\u003e range for an extended period the question to ask is why is oil trading at such weak levels he speculated that china s economic slowdown could be a factor though he expressed surprise at the current crude oil prices he also noted that the us federal reserve rate cut may not lead to substantial foreign inflows into india as the country s high valuations remain a deterrent for fund managers chinas stock market trades at \u003cEIGHT_\u003e times earnings india excluding financials trades at around \u003cTWO_TEN\u003e times which wood characterized as a bit of a nightmare situation nonetheless he argued that china s deflationary spiral continues to make it an unattractive investment option pointing to indias significantly stronger nominal gdp growth of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e compared to china s \u003cFOUR_PERCENT\u003e the real slowdown in china is captured in the nominal data not the real data he pointed out wood underscored that indias large fiscal deficit is more palatable than those of g7 nations as it is largely driven by infrastructure spending rather than transfer payments additionally he said that indias markets will increasingly decouple from wall street as domestic investors take on a larger role read this higher revenue poll impact rein in fiscal deficit at \u003cTWO_\u003e trillion in april july more the domestic investors drive the market the less correlated it will be to wall street he remarked recent global disruptions such as the unwinding of the yen carry trade had little impact on indian markets wood does not foresee the reserve bank of india rushing to cut interest rates the us federal reserve kicked off its monetary policy easing cycle on wednesday with a \u003cFIVE_TEN\u003e basis point bps interest rate cut bringing the fed funds target range to \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e more here after us feds surprise interest rate cut all eyes on rbis management skillsjefferies india s head of research mahesh nandurkar echoed this sentiment our global house view is that us fed would cut rates by \u003cTWO_HUNDRED\u003e basis point bps by june \u003cTWO_THOUSAND\u003e out of which \u003cFIVE_TEN\u003e bps has been done and the rbi would cut by \u003cFIVE_TEN\u003e bps by that time the broader indian market appears stable for now though some mid and small cap stocks may be vulnerable to correction wood noted certain sectors such as defence psus and railways have already seen sharp corrections of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e in recent months we should also remember that in a bull market a stock can correct by one third any time wood added bull market corrections tend to be short sharp and violent wood pointed out that global central banks have been increasing their gold purchases a trend accelerated by the freezing of russia s foreign exchange reserves demonstrating the dollars weaponization this has been a key driver behind the recent surge in gold prices as for alternative assets wood argued that there is little case for indian investors to diversify into cryptocurrencies given the strength of the domestic growth story however he recommended a modest allocation to crypto for those focused on dollar denominated assets i have a \u003cFIVE_PERCENT\u003e allocation to bitcoin etf in my global equity portfolio he added","timestamp":"2024-09-19T18:24:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}