{"url":"https://www.livemint.com/market/stock-market-news/fpi-favourite-penny-stock-evexia-lifecare-sets-board-meeting-date-for-fundraise-details-here-11726047055386.html","title":"FPI-favourite penny stock Evexia Lifecare sets board meeting date for fundraise. Details here","description":"Evexia Lifecare's upcoming board meeting on September 16, 2024, to discuss fundraising is pivotal for its future growth. Despite impressive stock performance, investors should be cautious due to potential volatility and regulatory dependencies.","content":"Shares of Evexia Lifecare came into the spotlight on Wednesday, September 11, after the company announced its upcoming board meeting, set for Monday, September 16, 2024, to discuss a significant fundraising initiative. The board is expected to consider raising funds through the issuance of convertible equity warrants and/or equity shares on a preferential basis. This move is subject to obtaining the necessary approvals, including from shareholders and other regulatory bodies.In a filing to the stock exchanges, Evexia Lifecare stated, “Pursuant to Regulation 29 and other applicable provisions of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, we would like to inform you that the Meeting of the Board of Directors of the Company will be held on Monday, September 16, 2024, inter-alia to consider raising of funds by way of Issue of Convertible Equity Warrants and/or Equity Shares on Preferential Basis, subject to such approvals as may be required including approval of the members and other statutory/regulatory approvals, as applicable.”The company also confirmed that its trading window would remain closed from September 11, 2024, until 48 hours after the completion of the board meeting. This restriction applies to all designated persons, including promoters, directors, insiders, and their immediate relatives, who will be prohibited from trading in the company’s shares during this period. This is a standard practice followed by companies to ensure compliance with insider trading regulations and maintain market integrity.The announcement coincided with a positive market response, as Evexia Lifecare’s stock witnessed a 2 per cent rise in intraday trading, reaching  ₹3.53. This places the stock just below its 52-week high of  ₹3.54, which it touched earlier this week on September 9. The penny stock has demonstrated impressive momentum, rallying nearly 128 per cent from its 52-week low of  ₹1.55, which was recorded in December 2023.Over the past year, Evexia Lifecare has delivered multibagger returns, surging by more than 101 per cent. The stock has also posted an 88 per cent gain in 2024 year-to-date, making it one of the best-performing penny stocks in the market. Investors have taken note of this significant upward trajectory, driven by the company’s strategic initiatives and positive market sentiment.In terms of shareholding, Evexia Lifecare boasts a diverse ownership structure. Foreign portfolio investors (FPIs) currently hold a 1.03 per cent stake in the company. Banks and mutual funds own 0.13 per cent and 0.4 per cent, respectively, highlighting the institutional interest in the stock. The promoter group controls a 6.29 per cent stake, while the majority of the company's shares—93.71 per cent—are held by public shareholders, according to the latest data from the June 2024 quarter.The upcoming board meeting to discuss a capital raise via convertible equity warrants or equity shares on a preferential basis could be a pivotal moment for Evexia Lifecare. The potential influx of capital is expected to strengthen the company’s balance sheet, enabling it to pursue growth initiatives, expand its operations, and invest in new business opportunities.Despite the strong performance, investors are advised to be cautious given the stock’s rapid rise. Penny stocks like Evexia Lifecare can be highly volatile, and the company’s future growth prospects will depend on its ability to effectively deploy the new capital raised. Additionally, the upcoming regulatory approvals and the board's decision regarding the method of fundraising will be crucial for the stock’s future trajectory.As the market eagerly awaits the outcome of the September 16 board meeting, the spotlight will remain firmly on Evexia Lifecare. Whether the company can sustain its impressive run remains to be seen, but for now, it continues to be a hot topic among investors looking for high-growth opportunities.","cleaned_content":"shares of evexia lifecare came into the spotlight on wednesday september \u003cONE_TEN\u003e after the company announced its upcoming board meeting set for monday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to discuss a significant fundraising initiative the board is expected to consider raising funds through the issuance of convertible equity warrants and or equity shares on a preferential basis this move is subject to obtaining the necessary approvals including from shareholders and other regulatory bodies in a filing to the stock exchanges evexia lifecare stated pursuant to regulation \u003cTWO_TEN\u003e and other applicable provisions of the sebi listing obligations and disclosure requirements regulations \u003cTWO_THOUSAND\u003e we would like to inform you that the meeting of the board of directors of the company will be held on monday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e inter alia to consider raising of funds by way of issue of convertible equity warrants and or equity shares on preferential basis subject to such approvals as may be required including approval of the members and other statutory regulatory approvals as applicable the company also confirmed that its trading window would remain closed from september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e until \u003cFOUR_TEN\u003e hours after the completion of the board meeting this restriction applies to all designated persons including promoters directors insiders and their immediate relatives who will be prohibited from trading in the company s shares during this period this is a standard practice followed by companies to ensure compliance with insider trading regulations and maintain market integrity the announcement coincided with a positive market response as evexia lifecare s stock witnessed a \u003cTWO_PERCENT\u003e rise in intraday trading reaching \u003cTHREE_\u003e this places the stock just below its \u003cFIVE_TEN\u003e week high of \u003cTHREE_\u003e which it touched earlier this week on september \u003cNINE_\u003e the penny stock has demonstrated impressive momentum rallying nearly \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_\u003e which was recorded in december \u003cTWO_THOUSAND\u003e over the past year evexia lifecare has delivered multibagger returns surging by more than \u003cONE_HUNDRED_PERCENT\u003e the stock has also posted an \u003cEIGHT_TEN_PERCENT\u003e gain in \u003cTWO_THOUSAND\u003e year to date making it one of the best performing penny stocks in the market investors have taken note of this significant upward trajectory driven by the company s strategic initiatives and positive market sentiment in terms of shareholding evexia lifecare boasts a diverse ownership structure foreign portfolio investors fpis currently hold a \u003cONE_PERCENT\u003e stake in the company banks and mutual funds own \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively highlighting the institutional interest in the stock the promoter group controls a \u003cSIX_PERCENT\u003e stake while the majority of the companys shares \u003cNINE_TEN_PERCENT\u003e are held by public shareholders according to the latest data from the june \u003cTWO_THOUSAND\u003e quarter the upcoming board meeting to discuss a capital raise via convertible equity warrants or equity shares on a preferential basis could be a pivotal moment for evexia lifecare the potential influx of capital is expected to strengthen the company s balance sheet enabling it to pursue growth initiatives expand its operations and invest in new business opportunities despite the strong performance investors are advised to be cautious given the stock s rapid rise penny stocks like evexia lifecare can be highly volatile and the company s future growth prospects will depend on its ability to effectively deploy the new capital raised additionally the upcoming regulatory approvals and the boards decision regarding the method of fundraising will be crucial for the stock s future trajectory as the market eagerly awaits the outcome of the september \u003cONE_TEN\u003e board meeting the spotlight will remain firmly on evexia lifecare whether the company can sustain its impressive run remains to be seen but for now it continues to be a hot topic among investors looking for high growth opportunities","timestamp":"2024-09-11T15:29:00+05:30","market_timestamp":"2024-09-11T15:29:00+05:30","off_market_hours":false}