{"url":"https://www.livemint.com/market/stock-market-news/reliance-infrastructure-share-price-rises-more-than-6-plans-to-raise-rs-3000-crore-though-a-qip-11726804338171.html","title":"Reliance Infrastructure share price rises more than 12% to 1 year high: Plans to raise  ₹3000 Crore though a QIP","description":"Stock Market Today: Reliance Infra share price rises more than 12% in morning trades on Friday to 1 year high. Reliance Infrastructure plans to raise  ₹3000 Crore via a qualified institutional placement","content":"Stock Market Today: Reliance Infrastructure share price gained more than 12% in morning trades on Friday to 1 year high. Reliance Infrastructure plans to raise  ₹3000 Crore via a qualified institutional placement.Reliance Infrastructure in its release on Thursday post market hours said that its Board of Directors have approved plans to seek enabling authorization of members for raising of funds aggregating up to Rs. 3,000 Crore (Rupees Three Thousand Crore only) through issue of equity shares or any other eligible securities to qualified institutional buyers by way of qualified institutional placement.The Reliance Infrastructure share price that opened at  ₹284.00 on the BSE on Friday, slightly lower than  ₹284.75, however continued to rise thereafter. The Reliance Infrastructure share price scaled  ₹320, marking gains of more than 12%.Reliance Infrastructure in its release on Thursday also said that its Board of Directors have also approved issuance of up to 12.56 crore equity shares of the Company and/or warrants convertible into equity shares of the Company at an Issue Price of Rs. 240 per share through preferential allotment.Reliance Infrastructure has said that it has reduced its standalone external Debt from  ₹3,831 crore to  ₹475 Crore. Consequently, the net worth of the Company will stand at  ₹9,041 crore.The company recently made settlement and paid its entire obligations with Edelweiss Asset Reconstruction Company Limited (Edelweiss) with respect to the Non Convertible Debentures issued by the Company, in consideration of an amount of Rs. 235 crore.Reliance Infrastructure also has said that it has cleared its funded outstanding dues to Life Insurance Corporation of India, Edelweiss Asset Reconstruction Company Limited, ICICI Bank, Union Bank, and other lenders.Besides Reliance Infrastructure Ltd has reached an agreement with Adani Electricity Mumbai Limited (AEML) and Adani Energy Solutions Limited (AESL) (Earlier known as Adani Transmission Limited). The settlement is towards Settlement of disputes and withdrawal of arbitration claims against each other as mutually agreed on September 17, 2024.","cleaned_content":"stock market today reliance infrastructure share price gained more than \u003cONE_TEN_PERCENT\u003e in morning trades on friday to \u003cONE_\u003e year high reliance infrastructure plans to raise \u003cTHREE_THOUSAND\u003e crore via a qualified institutional placement reliance infrastructure in its release on thursday post market hours said that its board of directors have approved plans to seek enabling authorization of members for raising of funds aggregating up to rs \u003cTHREE_THOUSAND\u003e crore rupees three thousand crore only through issue of equity shares or any other eligible securities to qualified institutional buyers by way of qualified institutional placement the reliance infrastructure share price that opened at \u003cTWO_HUNDRED\u003e on the bse on friday slightly lower than \u003cTWO_HUNDRED\u003e however continued to rise thereafter the reliance infrastructure share price scaled \u003cTHREE_HUNDRED\u003e marking gains of more than \u003cONE_TEN_PERCENT\u003e reliance infrastructure in its release on thursday also said that its board of directors have also approved issuance of up to \u003cONE_TEN\u003e crore equity shares of the company and or warrants convertible into equity shares of the company at an issue price of rs \u003cTWO_HUNDRED\u003e per share through preferential allotment reliance infrastructure has said that it has reduced its standalone external debt from \u003cTHREE_THOUSAND\u003e crore to \u003cFOUR_HUNDRED\u003e crore consequently the net worth of the company will stand at \u003cNINE_THOUSAND\u003e crore the company recently made settlement and paid its entire obligations with edelweiss asset reconstruction company limited edelweiss with respect to the non convertible debentures issued by the company in consideration of an amount of rs \u003cTWO_HUNDRED\u003e crore reliance infrastructure also has said that it has cleared its funded outstanding dues to life insurance corporation of india edelweiss asset reconstruction company limited icici bank union bank and other lenders besides reliance infrastructure ltd has reached an agreement with adani electricity mumbai limited aeml and adani energy solutions limited aesl earlier known as adani transmission limited the settlement is towards settlement of disputes and withdrawal of arbitration claims against each other as mutually agreed on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-09-20T09:34:00+05:30","market_timestamp":"2024-09-20T09:34:00+05:30","off_market_hours":false}