{"url":"https://www.livemint.com/market/stock-market-news/what-steady-mutual-fund-inflows-mean-for-indian-market-is-the-bull-run-here-to-stay-11726071775581.html","title":"What steady mutual fund inflows mean for Indian market—Is the bull run here to stay?","description":"In August, assets under management (AUM) for equity schemes hit  ₹30 trillion, driven by strong inflows and a market rally. The mutual fund sector's AUM reached  ₹66.7 lakh crore, with 20.45 crore folios highlighting growing investor confidence.","content":"Mutual funds have become the preferred investment choice for Indian retail investors in recent years, offering a way to tap into the growth of the country’s financial markets. This surge in popularity is largely driven by the rapid expansion of the Indian economy, offering investors the opportunity to benefit from the country’s dynamic economic landscape.Retail inflows into mutual funds have been on a consistent upward trajectory since 2020, growing stronger with each passing month. This steady influx of capital from individual investors has played a pivotal role in supporting the Indian stock market, helping it remain at elevated levels despite multiple challenges, including global geopolitical tensions, heightened volatility in international markets, and concerns over inflation and economic uncertainty.A significant portion of these inflows comes from millennials, who are embracing stock market investments much faster than previous generations. While some prefer direct investments through demat accounts, many still favour the steady approach of systematic investment plans (SIPs).Notably, the consistent inflows into mutual funds have become a growing concern for Indian banks, as this shift has disrupted their deposit base.With more investors opting to diversify away from traditional bank deposits in favour of stock market investments, particularly through mutual funds, banks are facing a significant challenge in attracting household savings.Reserve Bank of India Governor Shaktikanta Das recently flagged the widening gap between credit and deposit growth as more savings flow into mutual funds.He pointed out that an increasing portion of household savings is moving away from conventional savings instruments like fixed deposits and into more lucrative investment options such as mutual funds.Even mutual fund managers have, at times, paused or slowed down SIP investments as they found themselves running out of viable options for allocation. With limited attractive opportunities in the market, many fund managers are opting to hold onto cash reserves, waiting for the right moment to invest.Recent data from AMFI, released on Tuesday, highlights ongoing strong inflows into mutual equity funds. August 2024 marked the 42nd consecutive month of net inflows into equity funds, with total inflows reaching  ₹38,239 crore, up 3.3 percent from July's  ₹37,113 crore. August's inflows were the second highest this year, following June's  ₹40,608 crore.Systematic Investment Plans (SIPs), a method that allows investors to invest small amounts regularly, reached a new peak in August. Contributions to SIPs hit a record of  ₹2,354.7 crore, marking the 14th consecutive month of lifetime highs.The robust inflows and the equity market rally led to a sharper growth in the assets under management (AUM) of equity schemes as it touched  ₹30 trillion for the first time in August, which is 45 percent of the total assets being managed by the industry. A decade ago, the equity MF AUM was at  ₹1.9 trillion.With these inflows, the industry's net assets under management rose to an all-time high of  ₹66.7 lakh crore at the end of August from  ₹65 lakh crore at the end of July.Additionally, the number of mutual fund folios reached a new milestone of  ₹20.45 crore, reflecting increased investor confidence in the mutual fund sector.Hitesh Thakkar, acting CEO of ITI Mutual Fund, highlighted the impressive growth in Assets Under Management (AUM), saying, “It’s remarkable to consider that it took the Indian mutual fund industry 50 years to reach  ₹10 trillion in AUM from 1963 to 2013.”“The industry then added another  ₹13 trillion in just six years, reaching  ₹23 trillion by 2019. By August 2024, we have seen our AUM surge to  ₹66.70 trillion, tripling from the 2019 figure. Mutual funds are an attractive investment option due to their cost-effectiveness, transparency, and the opportunity they offer for retail investors to participate in India’s growth,” Hitesh Thakkar added.He highlighted that India is one of the fastest-growing economies in terms of GDP growth, financialisation, and digitisation. He noted that Moody’s latest report forecasts India’s economic growth at 7.2 percent. He also pointed out that sectoral/thematic funds, flexi-cap funds, and large and mid-cap funds have seen the most significant net mobilisation of funds among equity and hybrid funds.The influx of retail investments post-pandemic has significantly reshaped ownership dynamics. According to an analysis by domestic brokerage firm DAM Capital, domestic institutional investors (DIIs) saw their ownership of Nifty 500 companies reach a record high of 16.9 percent in the quarter ending June 2024.In contrast, foreign portfolio investor (FPI) ownership has been on a consistent decline, hitting its lowest level in nearly 12 years at 18.8 percent. Compared to the previous quarter, FPI ownership dropped by 30 basis points (bps) on a quarter-on-quarter (QoQ) basis, bringing the total value to USD 843 billion. This downward trend was even more pronounced in the Nifty-50, where FPI ownership fell by 40 bps QoQ, settling at 24.5 percent.The influence of FPIs in the Indian market has steadily waned. Since March 2021, FPI-free float ownership has declined each quarter, with only two quarters showing slight increases.As of June 2024, FPI free float ownership stood at 39 percent, down from a peak of 48 percent. Meanwhile, domestic investors, including DIIs and individual investors, now control nearly 53 percent of the free float. DIIs hold around 35 percent, while individual investors account for approximately 18 percent.The report also highlights how domestic investors have played a stabilising role in the market. It said that in every post-COVID global downturn, whether driven by Federal Reserve rate hikes or geopolitical tensions, domestic investors have consistently offset FPI outflows.Since 2019, the combined domestic holdings of DIIs and individual investors have surpassed those of FPIs, underscoring the growing influence of local investors in the Indian stock market.Every dip in the Indian stock market recently caused by Foreign Portfolio Investor (FPI) outflows has been promptly bought up by domestic institutional investors (DIIs), with strong support from retail inflows.Whenever global uncertainties and market volatility have led to sell-offs by FPIs, domestic investors have stepped in to stabilise and drive the markets higher. This consistent pattern of domestic buying has been bolstered by robust retail investment, ensuring that even amid global economic turbulence, the Indian stock market remains resilient.These inflows have contributed to stretched valuations; however, analysts believe that this trend is likely to persist in the near term.","cleaned_content":"mutual funds have become the preferred investment choice for indian retail investors in recent years offering a way to tap into the growth of the country s financial markets this surge in popularity is largely driven by the rapid expansion of the indian economy offering investors the opportunity to benefit from the country s dynamic economic landscape retail inflows into mutual funds have been on a consistent upward trajectory since \u003cTWO_THOUSAND\u003e growing stronger with each passing month this steady influx of capital from individual investors has played a pivotal role in supporting the indian stock market helping it remain at elevated levels despite multiple challenges including global geopolitical tensions heightened volatility in international markets and concerns over inflation and economic uncertainty a significant portion of these inflows comes from millennials who are embracing stock market investments much faster than previous generations while some prefer direct investments through demat accounts many still favour the steady approach of systematic investment plans sips notably the consistent inflows into mutual funds have become a growing concern for indian banks as this shift has disrupted their deposit base with more investors opting to diversify away from traditional bank deposits in favour of stock market investments particularly through mutual funds banks are facing a significant challenge in attracting household savings reserve bank of india governor shaktikanta das recently flagged the widening gap between credit and deposit growth as more savings flow into mutual funds he pointed out that an increasing portion of household savings is moving away from conventional savings instruments like fixed deposits and into more lucrative investment options such as mutual funds even mutual fund managers have at times paused or slowed down sip investments as they found themselves running out of viable options for allocation with limited attractive opportunities in the market many fund managers are opting to hold onto cash reserves waiting for the right moment to invest recent data from amfi released on tuesday highlights ongoing strong inflows into mutual equity funds august \u003cTWO_THOUSAND\u003e marked the \u003cFOUR_TEN\u003e nd consecutive month of net inflows into equity funds with total inflows reaching \u003cTHREE_TEN_THOUSAND\u003e crore up \u003cTHREE_PERCENT\u003e from julys \u003cTHREE_TEN_THOUSAND\u003e crore augusts inflows were the second highest this year following junes \u003cFOUR_TEN_THOUSAND\u003e crore systematic investment plans sips a method that allows investors to invest small amounts regularly reached a new peak in august contributions to sips hit a record of \u003cTWO_THOUSAND\u003e crore marking the \u003cONE_TEN\u003e th consecutive month of lifetime highs the robust inflows and the equity market rally led to a sharper growth in the assets under management aum of equity schemes as it touched \u003cTHREE_TEN\u003e trillion for the first time in august which is \u003cFOUR_TEN_PERCENT\u003e of the total assets being managed by the industry a decade ago the equity mf aum was at \u003cONE_\u003e trillion with these inflows the industrys net assets under management rose to an all time high of \u003cSIX_TEN\u003e lakh crore at the end of august from \u003cSIX_TEN\u003e lakh crore at the end of july additionally the number of mutual fund folios reached a new milestone of \u003cTWO_TEN\u003e crore reflecting increased investor confidence in the mutual fund sector hitesh thakkar acting ceo of iti mutual fund highlighted the impressive growth in assets under management aum saying it s remarkable to consider that it took the indian mutual fund industry \u003cFIVE_TEN\u003e years to reach \u003cONE_TEN\u003e trillion in aum from \u003cONE_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e the industry then added another \u003cONE_TEN\u003e trillion in just six years reaching \u003cTWO_TEN\u003e trillion by \u003cTWO_THOUSAND\u003e by august \u003cTWO_THOUSAND\u003e we have seen our aum surge to \u003cSIX_TEN\u003e trillion tripling from the \u003cTWO_THOUSAND\u003e figure mutual funds are an attractive investment option due to their cost effectiveness transparency and the opportunity they offer for retail investors to participate in india s growth hitesh thakkar added he highlighted that india is one of the fastest growing economies in terms of gdp growth financialisation and digitisation he noted that moody s latest report forecasts india s economic growth at \u003cSEVEN_PERCENT\u003e he also pointed out that sectoral thematic funds flexi cap funds and large and mid cap funds have seen the most significant net mobilisation of funds among equity and hybrid funds the influx of retail investments post pandemic has significantly reshaped ownership dynamics according to an analysis by domestic brokerage firm dam capital domestic institutional investors diis saw their ownership of nifty \u003cFIVE_HUNDRED\u003e companies reach a record high of \u003cONE_TEN_PERCENT\u003e in the quarter ending june \u003cTWO_THOUSAND\u003e in contrast foreign portfolio investor fpi ownership has been on a consistent decline hitting its lowest level in nearly \u003cONE_TEN\u003e years at \u003cONE_TEN_PERCENT\u003e compared to the previous quarter fpi ownership dropped by \u003cTHREE_TEN\u003e basis points bps on a quarter on quarter qoq basis bringing the total value to usd \u003cEIGHT_HUNDRED\u003e billion this downward trend was even more pronounced in the nifty \u003cFIVE_TEN\u003e where fpi ownership fell by \u003cFOUR_TEN\u003e bps qoq settling at \u003cTWO_TEN_PERCENT\u003e the influence of fpis in the indian market has steadily waned since march \u003cTWO_THOUSAND\u003e fpi free float ownership has declined each quarter with only two quarters showing slight increases as of june \u003cTWO_THOUSAND\u003e fpi free float ownership stood at \u003cTHREE_TEN_PERCENT\u003e down from a peak of \u003cFOUR_TEN_PERCENT\u003e meanwhile domestic investors including diis and individual investors now control nearly \u003cFIVE_TEN_PERCENT\u003e of the free float diis hold around \u003cTHREE_TEN_PERCENT\u003e while individual investors account for approximately \u003cONE_TEN_PERCENT\u003e the report also highlights how domestic investors have played a stabilising role in the market it said that in every post covid global downturn whether driven by federal reserve rate hikes or geopolitical tensions domestic investors have consistently offset fpi outflows since \u003cTWO_THOUSAND\u003e the combined domestic holdings of diis and individual investors have surpassed those of fpis underscoring the growing influence of local investors in the indian stock market every dip in the indian stock market recently caused by foreign portfolio investor fpi outflows has been promptly bought up by domestic institutional investors diis with strong support from retail inflows whenever global uncertainties and market volatility have led to sell offs by fpis domestic investors have stepped in to stabilise and drive the markets higher this consistent pattern of domestic buying has been bolstered by robust retail investment ensuring that even amid global economic turbulence the indian stock market remains resilient these inflows have contributed to stretched valuations however analysts believe that this trend is likely to persist in the near term","timestamp":"2024-09-12T13:34:00+05:30","market_timestamp":"2024-09-12T13:34:00+05:30","off_market_hours":false}