{"url":"https://www.livemint.com/market/stock-market-news/stellar-ipo-debuts-bajaj-housing-lists-at-114-premium-to-issue-price-a-look-at-multibagger-listings-11726557197071.html","title":"Stellar IPO debuts: Bajaj Housing lists at 114% premium to issue price; a look at multibagger listings","description":"Bajaj Housing Finance debuted on the stock market on September 16, listing at  ₹150, a 114.29 per cent premium over its IPO price of  ₹70. In addition to Bajaj Housing Finance, several other IPOs have delivered strong multibagger listings. Here's a look at 8 such stocks since 2021.","content":"Bajaj Housing Finance made a remarkable debut on the stock market in the previous session on September 16, doubling investors' capital upon listing. The shares were listed at  ₹150 each on the BSE and NSE, representing a 114.29 per cent premium over the issue price of  ₹70 per share.On September 17, the stock hit its 10 percent upper circuit in intra-day trading, reaching a new high of  ₹181.48. This brings the total rally to over 159 per cent from its IPO price of  ₹70.The IPO, which ran from September 9 to 11, was oversubscribed 63.61 times, with bids for more than 4,628 crore equity shares against the 72.75 crore shares on offer. The applications were valued at nearly  ₹3.24 lakh crore. Bajaj Housing Finance raised  ₹6,560 crore through a combination of a fresh issue ( ₹3,560 crore) and an offer-for-sale ( ₹3,000 crore).Premier Energies: Premier Energies made a remarkable debut on September 3, 2024, with its shares listing at  ₹990 on the NSE, representing a substantial 120 per cent premium over its issue price of  ₹450. On the BSE, the shares were listed at  ₹991, reflecting a 120.22 per cent premium. The stock has continued its upward trajectory and is trading nearly 147 per cent above its IPO price.The IPO, valued at  ₹2,830.40 crore, was open for subscription from August 27 to August 29, 2024. It witnessed strong demand and was oversubscribed 75 times. The IPO consisted of a fresh issue of 2.87 crore shares, raising  ₹1,291.40 crore, and an offer-for-sale (OFS) of 3.42 crore shares, totalling  ₹1,539 crore. Premier Energies, a prominent player in the solar cell and module manufacturing sector, has drawn significant interest from investors due to its growth prospects in the renewable energy market.Unicommerce eSolutions: Unicommerce eSolutions had a stellar stock market debut on August 13, 2024. The shares were listed at  ₹235 per share on the NSE, marking a 117.59 per cent premium over the issue price of  ₹108. The BSE listing price was  ₹230, a 112.96 per cent premium. The stock has since surged over 124 per cent from its IPO price.The IPO, open for subscription between August 6 and August 8, 2024, was highly oversubscribed, receiving bids 168.35 times the 1.4 crore shares offered. The IPO comprised an offer-for-sale of up to 2.56 crore shares, reflecting strong investor confidence in the company. Unicommerce eSolutions, known for its expertise in e-commerce solutions and technology, attracted significant attention due to its robust growth trajectory and market position.BLS E-Services: BLS E-Services made an impressive stock market debut on February 6, 2024. The shares were listed at  ₹305 per share on the NSE, a 125.93 per cent gain over the issue price of  ₹135. The BSE listed price was  ₹309, reflecting a 128.89 per cent premium. Despite some subsequent corrections, the stock still trades approximately 95 per cent higher than its IPO price.The IPO, valued at  ₹310.91 crore, was open for subscription from January 30 to February 1, 2024. It was oversubscribed 162.48 times, with strong participation from retail and institutional investors. The IPO was entirely a fresh issue of 2.3 crore shares. BLS E-Services, a prominent outsourcing and business services sector player, saw substantial interest due to its expanding business model and growth potential.Tata Technologies: Tata Technologies debuted strongly on the bourses on November 30, 2023. The shares were listed at  ₹1,199.95 per share, marking a 140 per cent premium over the issue price of  ₹500. Although the stock has corrected slightly, it still trades 119 per cent above its IPO price.The IPO, valued at  ₹3,042.51 crore, was open for subscription from November 22 to November 24, 2023. It was oversubscribed 69.43 times, with a fresh issue of 6.09 crore shares. Tata Technologies, known for its engineering and technology services, attracted strong investor interest due to its solid growth prospects and market leadership.Latent View Analytics: Latent View Analytics was listed with a remarkable 169.04 per cent premium on November 23, 2021, at  ₹530 compared to the issue price of  ₹197. The stock has since appreciated by 144.5 percent from its IPO price.The IPO, valued at  ₹600 crore, was open for subscription between November 10 and November 12, 2021. It received an overwhelming response, being subscribed 326.49 times. The IPO comprised a fresh issue of  ₹474 crore and an offer-for-sale of  ₹126 crore. Latent View Analytics, a key player in data analytics and business intelligence, saw significant interest due to its strong growth potential and market positioning.Sigachi Industries: Sigachi Industries was listed with a remarkable 252.76 per cent premium on November 15, 2021, at  ₹575 compared to an issue price of  ₹163. However, the stock has since experienced a significant correction and is trading almost 66 per cent below its IPO price.The IPO, valued at  ₹123.43 crore, was open for subscription from November 1 to November 3, 2021. It was heavily oversubscribed, receiving bids 101.91 times the shares offered. The IPO consisted of a fresh issue of 7.70 million shares. Sigachi Industries, a Hyderabad-based manufacturer of cellulose-based excipients, saw initial excitement due to its unique product offerings and market potential.Paras Defence And Space Technologies: Paras Defence And Space Technologies listed with a 171.43 per cent premium on October 1, 2021, at  ₹475 against an issue price of  ₹175. The stock has since surged by an impressive 553 per cent from its IPO price.The IPO, valued at  ₹170.78 crore, was open for subscription between September 21 and September 23, 2021. It was oversubscribed 304.26 times, reflecting strong investor confidence. The IPO comprised a fresh issue of  ₹140.60 crore and an offer-for-sale component. Paras Defence, known for its defence and space technologies, attracted significant attention due to its strategic importance and growth prospects.GR Infraprojects: GR Infraprojects was listed at  ₹1,700 on July 19, 2021, marking a 103.11 per cent premium over its issue price of  ₹837. The stock is currently trading up 96 per cent from its IPO price.The IPO, valued at  ₹963.28 crore, was open for subscription between July 7 and July 9, 2021. It was oversubscribed 102.58 times and was entirely an offer-for-sale of 1.15 crore shares. GR Infraprojects, a major player in infrastructure development, saw significant interest due to its robust project pipeline and growth prospects.","cleaned_content":"bajaj housing finance made a remarkable debut on the stock market in the previous session on september \u003cONE_TEN\u003e doubling investors capital upon listing the shares were listed at \u003cONE_HUNDRED\u003e each on the bse and nse representing a \u003cONE_HUNDRED_PERCENT\u003e premium over the issue price of \u003cSEVEN_TEN\u003e per share on september \u003cONE_TEN\u003e the stock hit its \u003cONE_TEN_PERCENT\u003e upper circuit in intra day trading reaching a new high of \u003cONE_HUNDRED\u003e this brings the total rally to over \u003cONE_HUNDRED_PERCENT\u003e from its ipo price of \u003cSEVEN_TEN\u003e the ipo which ran from september \u003cNINE_\u003e to \u003cONE_TEN\u003e was oversubscribed \u003cSIX_TEN\u003e times with bids for more than \u003cFOUR_THOUSAND\u003e crore equity shares against the \u003cSEVEN_TEN\u003e crore shares on offer the applications were valued at nearly \u003cTHREE_\u003e lakh crore bajaj housing finance raised \u003cSIX_THOUSAND\u003e crore through a combination of a fresh issue \u003cTHREE_THOUSAND\u003e crore and an offer for sale \u003cTHREE_THOUSAND\u003e crore premier energies premier energies made a remarkable debut on september \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e with its shares listing at \u003cNINE_HUNDRED\u003e on the nse representing a substantial \u003cONE_HUNDRED_PERCENT\u003e premium over its issue price of \u003cFOUR_HUNDRED\u003e on the bse the shares were listed at \u003cNINE_HUNDRED\u003e reflecting a \u003cONE_HUNDRED_PERCENT\u003e premium the stock has continued its upward trajectory and is trading nearly \u003cONE_HUNDRED_PERCENT\u003e above its ipo price the ipo valued at \u003cTWO_THOUSAND\u003e crore was open for subscription from august \u003cTWO_TEN\u003e to august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e it witnessed strong demand and was oversubscribed \u003cSEVEN_TEN\u003e times the ipo consisted of a fresh issue of \u003cTWO_\u003e crore shares raising \u003cONE_THOUSAND\u003e crore and an offer for sale ofs of \u003cTHREE_\u003e crore shares totalling \u003cONE_THOUSAND\u003e crore premier energies a prominent player in the solar cell and module manufacturing sector has drawn significant interest from investors due to its growth prospects in the renewable energy market unicommerce esolutions unicommerce esolutions had a stellar stock market debut on august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the shares were listed at \u003cTWO_HUNDRED\u003e per share on the nse marking a \u003cONE_HUNDRED_PERCENT\u003e premium over the issue price of \u003cONE_HUNDRED\u003e the bse listing price was \u003cTWO_HUNDRED\u003e a \u003cONE_HUNDRED_PERCENT\u003e premium the stock has since surged over \u003cONE_HUNDRED_PERCENT\u003e from its ipo price the ipo open for subscription between august \u003cSIX_\u003e and august \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e was highly oversubscribed receiving bids \u003cONE_HUNDRED\u003e times the \u003cONE_\u003e crore shares offered the ipo comprised an offer for sale of up to \u003cTWO_\u003e crore shares reflecting strong investor confidence in the company unicommerce esolutions known for its expertise in e commerce solutions and technology attracted significant attention due to its robust growth trajectory and market position bls e services bls e services made an impressive stock market debut on february \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e the shares were listed at \u003cTHREE_HUNDRED\u003e per share on the nse a \u003cONE_HUNDRED_PERCENT\u003e gain over the issue price of \u003cONE_HUNDRED\u003e the bse listed price was \u003cTHREE_HUNDRED\u003e reflecting a \u003cONE_HUNDRED_PERCENT\u003e premium despite some subsequent corrections the stock still trades approximately \u003cNINE_TEN_PERCENT\u003e higher than its ipo price the ipo valued at \u003cTHREE_HUNDRED\u003e crore was open for subscription from january \u003cTHREE_TEN\u003e to february \u003cONE_\u003e \u003cTWO_THOUSAND\u003e it was oversubscribed \u003cONE_HUNDRED\u003e times with strong participation from retail and institutional investors the ipo was entirely a fresh issue of \u003cTWO_\u003e crore shares bls e services a prominent outsourcing and business services sector player saw substantial interest due to its expanding business model and growth potential tata technologies tata technologies debuted strongly on the bourses on november \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the shares were listed at \u003cONE_THOUSAND\u003e per share marking a \u003cONE_HUNDRED_PERCENT\u003e premium over the issue price of \u003cFIVE_HUNDRED\u003e although the stock has corrected slightly it still trades \u003cONE_HUNDRED_PERCENT\u003e above its ipo price the ipo valued at \u003cTHREE_THOUSAND\u003e crore was open for subscription from november \u003cTWO_TEN\u003e to november \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e it was oversubscribed \u003cSIX_TEN\u003e times with a fresh issue of \u003cSIX_\u003e crore shares tata technologies known for its engineering and technology services attracted strong investor interest due to its solid growth prospects and market leadership latent view analytics latent view analytics was listed with a remarkable \u003cONE_HUNDRED_PERCENT\u003e premium on november \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cFIVE_HUNDRED\u003e compared to the issue price of \u003cONE_HUNDRED\u003e the stock has since appreciated by \u003cONE_HUNDRED_PERCENT\u003e from its ipo price the ipo valued at \u003cSIX_HUNDRED\u003e crore was open for subscription between november \u003cONE_TEN\u003e and november \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e it received an overwhelming response being subscribed \u003cTHREE_HUNDRED\u003e times the ipo comprised a fresh issue of \u003cFOUR_HUNDRED\u003e crore and an offer for sale of \u003cONE_HUNDRED\u003e crore latent view analytics a key player in data analytics and business intelligence saw significant interest due to its strong growth potential and market positioning sigachi industries sigachi industries was listed with a remarkable \u003cTWO_HUNDRED_PERCENT\u003e premium on november \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cFIVE_HUNDRED\u003e compared to an issue price of \u003cONE_HUNDRED\u003e however the stock has since experienced a significant correction and is trading almost \u003cSIX_TEN_PERCENT\u003e below its ipo price the ipo valued at \u003cONE_HUNDRED\u003e crore was open for subscription from november \u003cONE_\u003e to november \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e it was heavily oversubscribed receiving bids \u003cONE_HUNDRED\u003e times the shares offered the ipo consisted of a fresh issue of \u003cSEVEN_\u003e million shares sigachi industries a hyderabad based manufacturer of cellulose based excipients saw initial excitement due to its unique product offerings and market potential paras defence and space technologies paras defence and space technologies listed with a \u003cONE_HUNDRED_PERCENT\u003e premium on october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e at \u003cFOUR_HUNDRED\u003e against an issue price of \u003cONE_HUNDRED\u003e the stock has since surged by an impressive \u003cFIVE_HUNDRED_PERCENT\u003e from its ipo price the ipo valued at \u003cONE_HUNDRED\u003e crore was open for subscription between september \u003cTWO_TEN\u003e and september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e it was oversubscribed \u003cTHREE_HUNDRED\u003e times reflecting strong investor confidence the ipo comprised a fresh issue of \u003cONE_HUNDRED\u003e crore and an offer for sale component paras defence known for its defence and space technologies attracted significant attention due to its strategic importance and growth prospects gr infraprojects gr infraprojects was listed at \u003cONE_THOUSAND\u003e on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e marking a \u003cONE_HUNDRED_PERCENT\u003e premium over its issue price of \u003cEIGHT_HUNDRED\u003e the stock is currently trading up \u003cNINE_TEN_PERCENT\u003e from its ipo price the ipo valued at \u003cNINE_HUNDRED\u003e crore was open for subscription between july \u003cSEVEN_\u003e and july \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e it was oversubscribed \u003cONE_HUNDRED\u003e times and was entirely an offer for sale of \u003cONE_\u003e crore shares gr infraprojects a major player in infrastructure development saw significant interest due to its robust project pipeline and growth prospects","timestamp":"2024-09-17T13:12:00+05:30","market_timestamp":"2024-09-17T13:12:00+05:30","off_market_hours":false}