{"url":"https://www.livemint.com/market/stock-market-news/market-shifts-towards-high-growth-stocks-amid-volatility-says-pgim-india-mutual-fund-11726215697087.html","title":"Market shifts towards high-growth stocks amid volatility, says PGIM India Mutual Fund","description":"Market volatility marked the fiscal year, with significant corrections in the Nifty 50 Index. High-growth companies are regaining favor due to shifting interest rate expectations. Despite weak earnings in Q1 FY25, the decline in rates is expected to boost valuations for these firms.","content":"The fiscal year has been marked by significant market volatility, particularly after major events such as the union election results and the hawkish monetary policy changes by the Bank of Japan. According to PGIM India Mutual Fund, the Nifty 50 Index experienced sharp corrections, dropping more than 2 per cent on specific days due to these events. However, despite these initial dips, the market rebounded quickly, hitting new all-time highs. Beneath this recovery, investor preferences have shifted, with high-growth, high-quality companies regaining favour, observed PGIM in a recent report.The report informed that historically, the market has rewarded companies with high sales growth and strong returns on equity (RoE). As of September 9, 2024, high-growth companies delivered median returns of 32 per cent CAGR over the last five years, compared to the NSE 500's 25 per cent. However, FY24 saw a reversal of this trend, with companies showing lower growth and RoE outperforming their high-growth peers by 35 per cent from April 2023 to May 2024. Following the June 2024 union election results, high-growth companies made a comeback, outperforming lower-growth firms by around 10 per cent, noted the report.PGIM identified several factors driving this change. One key reason is the shift in interest rate expectations from global central banks, led by the US Federal Reserve and the European Central Bank. Indian interest rates have largely followed the Fed's moves, and rates are expected to decline over the next year, providing a supportive environment for high-growth companies.Another factor contributing to this shift is earnings performance. Research from Ambit Capital indicated that Q1 FY25 was relatively weak, with the NSE 500 showing a negative earnings surprise of 4 per cent. Fewer companies exceeded earnings expectations, while more firms missed estimates, particularly in cyclical sectors, it added.The MF further underscored that over the past three years, rising interest rates have significantly impacted high-growth companies, which typically have longer durations. With the US Fed funds rate climbing to 5.25 per cent and India's repo rate reaching 6.5 per cent, high-duration assets like these companies faced greater pressure. As interest rates begin to decline, the future cash flows of high-growth companies are discounted at lower rates, boosting their valuations. While bonds see this re-adjustment almost instantly, the equities process takes longer, over months or years, depending on how rates change.PGIM Mutual Fund also pointed out that this valuation re-adjustment will continue as long as interest rates fall, providing a favourable tailwind for high-growth companies. However, once interest rate cuts level off, the pace of valuation re-adjustment will slow.The market is undergoing a clear shift, with high-growth, high-quality companies once again in favor. This shift is largely driven by expectations of a more dovish interest rate environment, which benefits these firms. While earnings expectations remain strong for high-growth companies, cyclical sectors may face headwinds due to weaker earnings. As interest rates trend downward, high-growth strategies will likely continue to gain traction, supporting the valuation of these companies.","cleaned_content":"the fiscal year has been marked by significant market volatility particularly after major events such as the union election results and the hawkish monetary policy changes by the bank of japan according to pgim india mutual fund the nifty \u003cFIVE_TEN\u003e index experienced sharp corrections dropping more than \u003cTWO_PERCENT\u003e on specific days due to these events however despite these initial dips the market rebounded quickly hitting new all time highs beneath this recovery investor preferences have shifted with high growth high quality companies regaining favour observed pgim in a recent report the report informed that historically the market has rewarded companies with high sales growth and strong returns on equity roe as of september \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e high growth companies delivered median returns of \u003cTHREE_TEN_PERCENT\u003e cagr over the last five years compared to the nse \u003cFIVE_HUNDRED\u003e s \u003cTWO_TEN_PERCENT\u003e however fy24 saw a reversal of this trend with companies showing lower growth and roe outperforming their high growth peers by \u003cTHREE_TEN_PERCENT\u003e from april \u003cTWO_THOUSAND\u003e to may \u003cTWO_THOUSAND\u003e following the june \u003cTWO_THOUSAND\u003e union election results high growth companies made a comeback outperforming lower growth firms by around \u003cONE_TEN_PERCENT\u003e noted the report pgim identified several factors driving this change one key reason is the shift in interest rate expectations from global central banks led by the us federal reserve and the european central bank indian interest rates have largely followed the feds moves and rates are expected to decline over the next year providing a supportive environment for high growth companies another factor contributing to this shift is earnings performance research from ambit capital indicated that q1 fy25 was relatively weak with the nse \u003cFIVE_HUNDRED\u003e showing a negative earnings surprise of \u003cFOUR_PERCENT\u003e fewer companies exceeded earnings expectations while more firms missed estimates particularly in cyclical sectors it added the mf further underscored that over the past three years rising interest rates have significantly impacted high growth companies which typically have longer durations with the us fed funds rate climbing to \u003cFIVE_PERCENT\u003e and indias repo rate reaching \u003cSIX_PERCENT\u003e high duration assets like these companies faced greater pressure as interest rates begin to decline the future cash flows of high growth companies are discounted at lower rates boosting their valuations while bonds see this re adjustment almost instantly the equities process takes longer over months or years depending on how rates change pgim mutual fund also pointed out that this valuation re adjustment will continue as long as interest rates fall providing a favourable tailwind for high growth companies however once interest rate cuts level off the pace of valuation re adjustment will slow the market is undergoing a clear shift with high growth high quality companies once again in favor this shift is largely driven by expectations of a more dovish interest rate environment which benefits these firms while earnings expectations remain strong for high growth companies cyclical sectors may face headwinds due to weaker earnings as interest rates trend downward high growth strategies will likely continue to gain traction supporting the valuation of these companies","timestamp":"2024-09-13T15:04:00+05:30","market_timestamp":"2024-09-13T15:04:00+05:30","off_market_hours":false}