{"url":"https://www.livemint.com/market/stock-market-news/dcx-systems-shares-jump-5-hit-upper-circuit-whats-driving-the-rally-11726570747733.html","title":"DCX Systems shares jump 5%, hit upper-circuit; What’s driving the rally?","description":"The stock's strong performance today has enabled it to recoup all the losses incurred earlier this year. Looking at a longer timeframe, the stock has gained 13.5% over the past 12 months.","content":"Shares of DCX Systems rose 5 percent, reaching the upper circuit limit of  ₹345 on September 17, following the announcement that its subsidiary received an industrial license from the Cochin Special Economic Zone (CSEZ) to manufacture and test microwave submodules, as well as avionics and defense electronic equipment.The newly obtained license allows DCX Systems' wholly-owned subsidiary to manufacture items categorized as CATEGORY-A, as defined by the Ministry of Defence Security Manual. These products are classified as highly sensitive and classified, representing the highest security level in defense manufacturing. The license is valid for a period of 15 years.The newly acquired license permits DCX Systems’ wholly-owned subsidiary to manufacture items classified under CATEGORY-A, according to the Ministry of Defence Security Manual. These products are considered highly classified and sensitive, representing the highest level of security in defence manufacturing. The granted license is valid for 15 years.In the recently concluded June quarter, DCX Systems experienced a 19 percent year-on-year decline in revenue, while net profit fell by 69 percent. The company also reported an operating loss of  ₹4.8 crore, primarily due to rising costs.Despite these challenges, KR Choksey remains optimistic about the company's long-term outlook. The brokerage anticipates that Q2 will offer clearer insights into growth acceleration, fueled by a strong order pipeline. It has maintained its earnings forecasts for FY25 and FY26, backed by a solid order book, an increased focus on cable and wire harnessing, and the commencement of commercial production at Raneal Advanced Systems.DCX Systems shares have not performed well, remaining mostly stagnant with a modest increase of just 1.6 percent since the beginning of the year. The stock's strong performance today has enabled it to recoup all the losses incurred earlier this year. Looking at a longer timeframe, the stock has gained 13.5% over the past 12 months.","cleaned_content":"shares of dcx systems rose \u003cFIVE_PERCENT\u003e reaching the upper circuit limit of \u003cTHREE_HUNDRED\u003e on september \u003cONE_TEN\u003e following the announcement that its subsidiary received an industrial license from the cochin special economic zone csez to manufacture and test microwave submodules as well as avionics and defense electronic equipment the newly obtained license allows dcx systems wholly owned subsidiary to manufacture items categorized as category a as defined by the ministry of defence security manual these products are classified as highly sensitive and classified representing the highest security level in defense manufacturing the license is valid for a period of \u003cONE_TEN\u003e years the newly acquired license permits dcx systems wholly owned subsidiary to manufacture items classified under category a according to the ministry of defence security manual these products are considered highly classified and sensitive representing the highest level of security in defence manufacturing the granted license is valid for \u003cONE_TEN\u003e years in the recently concluded june quarter dcx systems experienced a \u003cONE_TEN_PERCENT\u003e year on year decline in revenue while net profit fell by \u003cSIX_TEN_PERCENT\u003e the company also reported an operating loss of \u003cFOUR_\u003e crore primarily due to rising costs despite these challenges kr choksey remains optimistic about the companys long term outlook the brokerage anticipates that q2 will offer clearer insights into growth acceleration fueled by a strong order pipeline it has maintained its earnings forecasts for fy25 and fy26 backed by a solid order book an increased focus on cable and wire harnessing and the commencement of commercial production at raneal advanced systems dcx systems shares have not performed well remaining mostly stagnant with a modest increase of just \u003cONE_PERCENT\u003e since the beginning of the year the stocks strong performance today has enabled it to recoup all the losses incurred earlier this year looking at a longer timeframe the stock has gained \u003cONE_TEN_PERCENT\u003e over the past \u003cONE_TEN\u003e months","timestamp":"2024-09-17T17:00:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}