{"url":"https://www.livemint.com/market/stock-market-news/kross-limited-ipo-gmp-subscription-status-key-dates-should-you-apply-or-not-11726022975527.html","title":"Kross Limited IPO: GMP, Subscription status, key dates. Should you apply or not?","description":"Kross Limited IPO: The issue that opened on 9 September closes today. Having received a good response on subscriptions and GMP should you apply or not? Here's what experts say-","content":"Kross Limited IPO; The Initial public issue that opened for subscription on 9 September closes today. The Kross IPO had been subscribed 2.73 times by Day 2 with retail portion having been subscribed 4.15 times. It had been subscribed 0.03 times in the QIB category, and 3.03 times in the NII category.Kross IPO, which is a book-built issue of  ₹500.00 crores comprises of an offer for sales of 1.04 crore shares totaling  ₹250.00 crores and a new issue of 1.04 crore shares totaling  ₹250.00 crores . On Thursday, September 12, 2024, it is anticipated that the allocation for the Kross IPO will be completed. The tentative listing date for the Kross IPO is set for Monday, September 16, 2024 on the BSE and NSE.The grey market premium, or Kross IPO GMP, is +50, according to investorgain.com. This shows that the price of Kross shares was selling at a premium of  ₹50 on the Grey market.Given the maximum limit of the IPO price range and the prevailing premium in the secondary market, the expected listing price of Kross shares was  ₹290 per share, signifying a 20.83% premium over the  ₹240 IPO price.The grey market activity over the last eight sessions indicates that today's IPO GMP is increasing and should have a strong listing. Experts at investorgain.com have revealed that the GMP is between  ₹0 and  ₹50.Kross Ltd., a diversified company is a producer of Trailer axles, suspension components, and high-performance, precision-machined safety-critical parts for Medium and Heavy Commercial Vehicles (M\u0026HCV) and farm equipments . Due to cargo fleet operators' preference for trailers over rigid vehicles in the 55 tonne plus market, the tractor-trailer segment is now outperforming the medium- and heavy commercial vehicle (MHCV) industry, where the company supplies parts say analysts.Axle beam extrusion is also being used by Kross as part of a backward integration process that could improve margins and gain firm export orders that have increased revenue visibility. The company's improved product mix and increased internal production have led to a comparatively large improvement in Earnings before interest tax depreciation and amortisation (Ebitda) and revenue margins over the last two fiscal years said analysts at Anand Rathi Research.For Kross Ltd, performance consistency may remain a challenge because of the cyclical nature of the commercial vehicle industry. Regarding valuation, Kross is seeking for a PE (price to earnings ratio) of 34 times for FY24 at the upper price band, and with a post-issue market capitalization of  ₹1548 crore , it appears that the issue is fully priced as per Anand Rathi Research. However, Anand Rathi Research advises the IPO with a higher risk appetite to \"SUBSCRIBE for LONG TERM\" given all of its business potential and steady financial performance.Given that the top five customers accounted for more than 66% of the company's revenue over the last three fiscal years, customer concentration puts the business at risk.Although Kross's P/E ratio of 28.92 times is marginally higher than the sector average of 26 times, its forward integration tactics, plans for capacity development, and excellent growth potential make this offering look attractive.For long-term benefits, the brokerage business advises SUBSCRIBING to this IPO.A fast-rising company with backward integration skills in the organized trailer axle manufacturing sector. Kross has long-term relationships with significant domestic and international clients. It has seen steady increases in sales, earnings, and margins along with a desirable debt-to-equity ratio.The valuation of the IPO is comparatively high says Swastika Investmart . Given the premium valuation and possible obstacles in the current market, we suggest giving the IPO a neutral grade.","cleaned_content":"kross limited ipo the initial public issue that opened for subscription on \u003cNINE_\u003e september closes today the kross ipo had been subscribed \u003cTWO_\u003e times by day \u003cTWO_\u003e with retail portion having been subscribed \u003cFOUR_\u003e times it had been subscribed \u003cZERO_\u003e times in the qib category and \u003cTHREE_\u003e times in the nii category kross ipo which is a book built issue of \u003cFIVE_HUNDRED\u003e crores comprises of an offer for sales of \u003cONE_\u003e crore shares totaling \u003cTWO_HUNDRED\u003e crores and a new issue of \u003cONE_\u003e crore shares totaling \u003cTWO_HUNDRED\u003e crores on thursday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e it is anticipated that the allocation for the kross ipo will be completed the tentative listing date for the kross ipo is set for monday september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on the bse and nse the grey market premium or kross ipo gmp is \u003cFIVE_TEN\u003e according to investorgain com this shows that the price of kross shares was selling at a premium of \u003cFIVE_TEN\u003e on the grey market given the maximum limit of the ipo price range and the prevailing premium in the secondary market the expected listing price of kross shares was \u003cTWO_HUNDRED\u003e per share signifying a \u003cTWO_TEN_PERCENT\u003e premium over the \u003cTWO_HUNDRED\u003e ipo price the grey market activity over the last eight sessions indicates that todays ipo gmp is increasing and should have a strong listing experts at investorgain com have revealed that the gmp is between \u003cZERO_\u003e and \u003cFIVE_TEN\u003e kross ltd a diversified company is a producer of trailer axles suspension components and high performance precision machined safety critical parts for medium and heavy commercial vehicles m hcv and farm equipments due to cargo fleet operators preference for trailers over rigid vehicles in the \u003cFIVE_TEN\u003e tonne plus market the tractor trailer segment is now outperforming the medium and heavy commercial vehicle mhcv industry where the company supplies parts say analysts axle beam extrusion is also being used by kross as part of a backward integration process that could improve margins and gain firm export orders that have increased revenue visibility the companys improved product mix and increased internal production have led to a comparatively large improvement in earnings before interest tax depreciation and amortisation ebitda and revenue margins over the last two fiscal years said analysts at anand rathi research for kross ltd performance consistency may remain a challenge because of the cyclical nature of the commercial vehicle industry regarding valuation kross is seeking for a pe price to earnings ratio of \u003cTHREE_TEN\u003e times for fy24 at the upper price band and with a post issue market capitalization of \u003cONE_THOUSAND\u003e crore it appears that the issue is fully priced as per anand rathi research however anand rathi research advises the ipo with a higher risk appetite to subscribe for long term given all of its business potential and steady financial performance given that the top five customers accounted for more than \u003cSIX_TEN_PERCENT\u003e of the companys revenue over the last three fiscal years customer concentration puts the business at risk although krosss p e ratio of \u003cTWO_TEN\u003e times is marginally higher than the sector average of \u003cTWO_TEN\u003e times its forward integration tactics plans for capacity development and excellent growth potential make this offering look attractive for long term benefits the brokerage business advises subscribing to this ipo a fast rising company with backward integration skills in the organized trailer axle manufacturing sector kross has long term relationships with significant domestic and international clients it has seen steady increases in sales earnings and margins along with a desirable debt to equity ratio the valuation of the ipo is comparatively high says swastika investmart given the premium valuation and possible obstacles in the current market we suggest giving the ipo a neutral grade","timestamp":"2024-09-11T09:09:00+05:30","market_timestamp":"2024-09-11T09:15:00+05:30","off_market_hours":true}