{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-reliance-infra-ntpc-powergrid-iifl-finance-vst-industries-and-more-11726767787478.html","title":"Stocks to Watch: Reliance Infra, NTPC, PowerGrid, IIFL Finance, VST Industries and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Reliance Infrastructure: The Anil Ambani-led Reliance Infrastructure Ltd announced plans on Thursday to raise up to  ₹6,014 crore through a combination of share and convertible warrant sales. This announcement follows the company's settlement of an arbitration dispute with Adani Group over power distribution and a loan issue with CFM Asset Reconstruction. In a board meeting, the company approved raising  ₹3,014 crore via a preferential issue of 125.6 million equity shares or convertible warrants at a price of  ₹240 per share.IIFL Finance: IIFL Finance Ltd announced on Thursday that the Reserve Bank of India (RBI) has lifted the restrictions on its gold loan business. In a statement to the stock exchange, the company said that the RBI's decision, effective immediately, allows them to resume activities including the sanctioning, disbursal, and sale of gold loans in compliance with regulations.VST Industries: Ace investor Radhakishan Damani sold 1 lakh shares in VST Industries for  ₹4.4 crore via a block deal, at  ₹439.05 per share, slightly above the previous closing price of  ₹437.85. Damani, who is the founder and promoter of DMart, had also sold 1 lakh shares on Tuesday for  ₹4.39 crore. Buyers in the latest deal included Reliance Mutual Fund and Thrift Savings Plan, with the shares sold representing a 0.65% stake in VST Industries.NTPC: In an exchange filing, NTPC announced that its board of directors approved investment for the Sipat Super Thermal Power Project, Stage-III (1x800 MW) with an estimated cost of  ₹9,790.87 crore. Additionally, the board approved investment for the Darlipali Super Thermal Power Project, Stage-II (1x800 MW), with an estimated cost of  ₹11,130.98 crore.Power Grid: The company has been declared the successful bidder for the inter-state transmission system project, \"Transmission System for Evacuation of Power from Potential Renewable Energy Zone in Khavda Area of Gujarat under Phase-IV (7GW): Part B.\" The project will be executed on a build, own, operate, and transfer (BOOT) basis.Macrotech Developers: The company has acquired shares in three warehousing companies for  ₹239.56 crore, boosting its stake and enhancing its rental income potential. This move aligns with the company's strategic growth in the real estate sector.Hero MotoCorp: The company plans to launch e-scooters under its Vida brand in the UK, France, and Spain by mid-2025, marking its entry into developed markets as demand for electric vehicles rises. The launch coincides with ongoing discussions on the India-UK trade agreement.SJVN: The company reported generating 8,489 million units of green energy in FY24 from hydro, solar, and wind power, achieving record daily and monthly generation rates. SJVN also posted a standalone revenue of  ₹2,533.59 crore and a profit after tax of  ₹908.40 crore.IDFC First Bank: The Reserve Bank of India has approved the re-appointment of V. Vaidyanathan as Managing Director and CEO of IDFC First Bank, effective December 19, 2024. Vaidyanathan has played a key role since the bank's merger with Capital First in 2018.MSTC: The government has approved the sale of Ferro Scrap Nigam Ltd, a wholly-owned subsidiary of MSTC, to Japan’s Konoike Transport Co. for  ₹320 crore, surpassing the reserve price. Konoike specializes in steel services and recycling, marking a strategic move in India's steel sector.SpiceJet: The company’s $358 million share sale attracted significant interest from major investors including Tata Mutual Fund, Authum Investment, and Think Investments, among other institutional investors. The placement was reportedly oversubscribed.","cleaned_content":"reliance infrastructure the anil ambani led reliance infrastructure ltd announced plans on thursday to raise up to \u003cSIX_THOUSAND\u003e crore through a combination of share and convertible warrant sales this announcement follows the companys settlement of an arbitration dispute with adani group over power distribution and a loan issue with cfm asset reconstruction in a board meeting the company approved raising \u003cTHREE_THOUSAND\u003e crore via a preferential issue of \u003cONE_HUNDRED\u003e million equity shares or convertible warrants at a price of \u003cTWO_HUNDRED\u003e per share iifl finance iifl finance ltd announced on thursday that the reserve bank of india rbi has lifted the restrictions on its gold loan business in a statement to the stock exchange the company said that the rbis decision effective immediately allows them to resume activities including the sanctioning disbursal and sale of gold loans in compliance with regulations vst industries ace investor radhakishan damani sold \u003cONE_\u003e lakh shares in vst industries for \u003cFOUR_\u003e crore via a block deal at \u003cFOUR_HUNDRED\u003e per share slightly above the previous closing price of \u003cFOUR_HUNDRED\u003e damani who is the founder and promoter of dmart had also sold \u003cONE_\u003e lakh shares on tuesday for \u003cFOUR_\u003e crore buyers in the latest deal included reliance mutual fund and thrift savings plan with the shares sold representing a \u003cZERO_PERCENT\u003e stake in vst industries ntpc in an exchange filing ntpc announced that its board of directors approved investment for the sipat super thermal power project stage iii \u003cONE_\u003e x800 mw with an estimated cost of \u003cNINE_THOUSAND\u003e crore additionally the board approved investment for the darlipali super thermal power project stage ii \u003cONE_\u003e x800 mw with an estimated cost of \u003cONE_TEN_THOUSAND\u003e crore power grid the company has been declared the successful bidder for the inter state transmission system project transmission system for evacuation of power from potential renewable energy zone in khavda area of gujarat under phase iv \u003cSEVEN_\u003e gw part b the project will be executed on a build own operate and transfer boot basis macrotech developers the company has acquired shares in three warehousing companies for \u003cTWO_HUNDRED\u003e crore boosting its stake and enhancing its rental income potential this move aligns with the companys strategic growth in the real estate sector hero motocorp the company plans to launch e scooters under its vida brand in the uk france and spain by mid \u003cTWO_THOUSAND\u003e marking its entry into developed markets as demand for electric vehicles rises the launch coincides with ongoing discussions on the india uk trade agreement sjvn the company reported generating \u003cEIGHT_THOUSAND\u003e million units of green energy in fy24 from hydro solar and wind power achieving record daily and monthly generation rates sjvn also posted a standalone revenue of \u003cTWO_THOUSAND\u003e crore and a profit after tax of \u003cNINE_HUNDRED\u003e crore idfc first bank the reserve bank of india has approved the re appointment of v vaidyanathan as managing director and ceo of idfc first bank effective december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e vaidyanathan has played a key role since the banks merger with capital first in \u003cTWO_THOUSAND\u003e mstc the government has approved the sale of ferro scrap nigam ltd a wholly owned subsidiary of mstc to japan s konoike transport co for \u003cTHREE_HUNDRED\u003e crore surpassing the reserve price konoike specializes in steel services and recycling marking a strategic move in indias steel sector spicejet the company s \u003cTHREE_HUNDRED\u003e million share sale attracted significant interest from major investors including tata mutual fund authum investment and think investments among other institutional investors the placement was reportedly oversubscribed","timestamp":"2024-09-20T08:18:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}