{"url":"https://www.livemint.com/market/stock-market-news/multibagger-nbcc-share-price-rises-4-5-as-it-collaborates-with-mtnl-for-rs-1600-crore-project-11726113918387.html","title":"Multibagger NBCC share price rises 4.5% as it collaborates with MTNL for  ₹1600 crore project. Buy, Sell or Hold?","description":"Stock Market Today: Multibagger NBCC share price gained 4.5% during the morning trades on Thursday as it announced  ₹1600 crore project with MTNL on Wednesday post market hours. Looking at the rising order book should you Buy, Sell or Hold the stock?","content":"Stock Market Today: Multibagger NBCC (India) Ltd share price gained 4.5% in morning trades on Thursday. The gains for NBCC share price were led by its announcement regarding a collaboration with Mahanagar Telephone Nigam Limited (MTNL) for  ₹1600 Crore project.The NBCC (India) share price opened at  ₹177.65 on the BSE on Thursday , more than 1% higher than previous close of  ₹175.75. The NBCC share price thereafter gained to intraday highs of  ₹183.70 marking gains of 4.5%.The NBCC share price has gained 121% year to date and 232% over last one year giving Multibagger returns to the investors.NBCC on Wednesday post market hours had announced that a Memorandum of Understanding (MoU) has been signed between NBCC (India) Limited and Mahanagar Telephone Nigam Limited (MTNL) on September 11, 2024 to collaborate to develop a prominent land parcel of MTNL measuring approximately 13.88 acres located on Pankha Road, New Delhi. The project is valued at Rs. 1,600 crores approximately.The regular order inflows are adding to the order book of NBCC earlier known as National Buildings Construction Corporation Ltd. The strong order inflows and expected monetization keeps analysts positive on prospects of NBCC (India) share prices.With a strong order book of  ₹813 billion (book-to-bill at approximately 7.6 times), strong order accretion with year-to-year order wins at  ₹198 billion (adding to order wins of  ₹235 billion in FY24), and improving real estate monetisation (realty monetisation at the Nauroji Nagar project was  ₹134 billion versus its expected realisation of  ₹125 billion), NBCC (India) is well-positioned for growth, said analysts at Nuvama Institutional Equities.The company is benefiting from better prospects as a result of a thriving real estate cycle, as many PSUs and the government entities are trying to monetise their excess land holdings.Positive developments for the business include increased order intake, execution, and profitability as well as traction in real estate monetisation all bode well for NBCC.Nuvama target price for NBCC share price stands at  ₹198,","cleaned_content":"stock market today multibagger nbcc india ltd share price gained \u003cFOUR_PERCENT\u003e in morning trades on thursday the gains for nbcc share price were led by its announcement regarding a collaboration with mahanagar telephone nigam limited mtnl for \u003cONE_THOUSAND\u003e crore project the nbcc india share price opened at \u003cONE_HUNDRED\u003e on the bse on thursday more than \u003cONE_PERCENT\u003e higher than previous close of \u003cONE_HUNDRED\u003e the nbcc share price thereafter gained to intraday highs of \u003cONE_HUNDRED\u003e marking gains of \u003cFOUR_PERCENT\u003e the nbcc share price has gained \u003cONE_HUNDRED_PERCENT\u003e year to date and \u003cTWO_HUNDRED_PERCENT\u003e over last one year giving multibagger returns to the investors nbcc on wednesday post market hours had announced that a memorandum of understanding mou has been signed between nbcc india limited and mahanagar telephone nigam limited mtnl on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to collaborate to develop a prominent land parcel of mtnl measuring approximately \u003cONE_TEN\u003e acres located on pankha road new delhi the project is valued at rs \u003cONE_THOUSAND\u003e crores approximately the regular order inflows are adding to the order book of nbcc earlier known as national buildings construction corporation ltd the strong order inflows and expected monetization keeps analysts positive on prospects of nbcc india share prices with a strong order book of \u003cEIGHT_HUNDRED\u003e billion book to bill at approximately \u003cSEVEN_\u003e times strong order accretion with year to year order wins at \u003cONE_HUNDRED\u003e billion adding to order wins of \u003cTWO_HUNDRED\u003e billion in fy24 and improving real estate monetisation realty monetisation at the nauroji nagar project was \u003cONE_HUNDRED\u003e billion versus its expected realisation of \u003cONE_HUNDRED\u003e billion nbcc india is well positioned for growth said analysts at nuvama institutional equities the company is benefiting from better prospects as a result of a thriving real estate cycle as many psus and the government entities are trying to monetise their excess land holdings positive developments for the business include increased order intake execution and profitability as well as traction in real estate monetisation all bode well for nbcc nuvama target price for nbcc share price stands at \u003cONE_HUNDRED\u003e","timestamp":"2024-09-12T09:47:00+05:30","market_timestamp":"2024-09-12T09:47:00+05:30","off_market_hours":false}