{"url":"https://www.livemint.com/market/stock-market-news/nifty-it-touches-fresh-all-time-high-5-stocks-including-mphasis-coforge-reach-new-52-week-highs-11726217448488.html","title":"Nifty IT touches fresh all-time high, 5 stocks including MphasiS, Coforge reach new 52-week highs","description":"5 stocks, including MphasiS, Coforge, Persistent Systems, HCL Technologies, and LTIMindtree, have reached new 52-week highs during the session. This rally has pushed the Nifty IT index to a 22.31% year-to-date gain, surpassing the Nifty 50's increase of 16%.","content":"The Nifty IT index surged by 1%, reaching a fresh all-time high in today's trade, as central banks, where Indian IT companies have significant revenue exposure, began cutting interest rates due to moderating inflation.The index opened today with a gap-up at 43,244 points, compared to its previous close of 43,152 points, and continued its upward momentum to hit a new record high of 43,571. This marks the second consecutive day of gains for the index.All 10 components of the index are trading in positive territory, with Wipro leading the pack, rallying 4.2% to  ₹552 per share. Other notable performers include MphasiS, up 2%, Coforge, up 1.9%, L\u0026T Technology Services, up 1.5%, and Persistent Systems, up 1.4%. Tech Mahindra, LTIMindtree, HCL Technologies, TCS, and Infosys also posted gains, ranging from 0.3% to 0.8%.Significantly, five stocks, including MphasiS, Coforge, Persistent Systems, HCL Technologies, and LTIMindtree, have reached new 52-week highs during the session. This rally has pushed the Nifty IT index to a 22.31% year-to-date gain, surpassing the Nifty 50's increase of 16%.The European Central Bank (ECB) on Thursday cut rates by 25 basis points, as anticipated. The ECB's decision reflects growing confidence among policymakers that inflation is easing. This marks the ECB's second rate cut, following the one in June.Sumeet Bagadia, Executive Director at Choice Broking, said, “The Nifty IT index is looking bullish on the technical chart. The index has a strong base of 43,100, and this support is expected to remain sacrosanct. So, investors should see any dip in the index as a buying opportunity. The index is expected to touch the 44,000 mark in the near term.”\"Wipro shares are looking strong on the technical chart, and they may touch  ₹575 to  ₹580 apiece soon. So, Wipro shareholders can hold their position in the Indian IT sector significantly, maintaining a stop loss at the  ₹535 apiece mark,\" he added.","cleaned_content":"the nifty it index surged by \u003cONE_PERCENT\u003e reaching a fresh all time high in todays trade as central banks where indian it companies have significant revenue exposure began cutting interest rates due to moderating inflation the index opened today with a gap up at \u003cFOUR_TEN_THOUSAND\u003e points compared to its previous close of \u003cFOUR_TEN_THOUSAND\u003e points and continued its upward momentum to hit a new record high of \u003cFOUR_TEN_THOUSAND\u003e this marks the second consecutive day of gains for the index all \u003cONE_TEN\u003e components of the index are trading in positive territory with wipro leading the pack rallying \u003cFOUR_PERCENT\u003e to \u003cFIVE_HUNDRED\u003e per share other notable performers include mphasis up \u003cTWO_PERCENT\u003e coforge up \u003cONE_PERCENT\u003e l t technology services up \u003cONE_PERCENT\u003e and persistent systems up \u003cONE_PERCENT\u003e tech mahindra ltimindtree hcl technologies tcs and infosys also posted gains ranging from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e significantly five stocks including mphasis coforge persistent systems hcl technologies and ltimindtree have reached new \u003cFIVE_TEN\u003e week highs during the session this rally has pushed the nifty it index to a \u003cTWO_TEN_PERCENT\u003e year to date gain surpassing the nifty \u003cFIVE_TEN\u003e s increase of \u003cONE_TEN_PERCENT\u003e the european central bank ecb on thursday cut rates by \u003cTWO_TEN\u003e basis points as anticipated the ecbs decision reflects growing confidence among policymakers that inflation is easing this marks the ecbs second rate cut following the one in june sumeet bagadia executive director at choice broking said the nifty it index is looking bullish on the technical chart the index has a strong base of \u003cFOUR_TEN_THOUSAND\u003e and this support is expected to remain sacrosanct so investors should see any dip in the index as a buying opportunity the index is expected to touch the \u003cFOUR_TEN_THOUSAND\u003e mark in the near term wipro shares are looking strong on the technical chart and they may touch \u003cFIVE_HUNDRED\u003e to \u003cFIVE_HUNDRED\u003e apiece soon so wipro shareholders can hold their position in the indian it sector significantly maintaining a stop loss at the \u003cFIVE_HUNDRED\u003e apiece mark he added","timestamp":"2024-09-13T14:45:00+05:30","market_timestamp":"2024-09-13T14:45:00+05:30","off_market_hours":false}