{"url":"https://www.livemint.com/market/stock-market-news/vodafone-idea-share-price-rebounds-from-52-week-low-nuvama-predicts-40-upside-11726890436987.html","title":"Vodafone Idea share price rebounds from 52-week low. Nuvama predicts 40% upside","description":"Vodafone Idea share price ended at  ₹10.52 apiece on the NSE after hitting a new 52-week low of  ₹9.79 on Friday","content":"Vodafone Idea share price: After the Supreme Court did not find relief on AGR dues, Vodafone Idea shares witnessed a strong sell-off last week and touched a new 52-week low of  ₹9.79 apiece during Friday deals. However, the beaten-down stock witnessed strong buying at the lower levels and finished green at  ₹10.52 per share, logging a 7.50 per cent rise against the 52-week high.According to the global brokerage Nuvama, the market had not factored in any upside in Vodafone Idea share price due to the Supreme Court reducing AGR dues. Hence, there can be a sharp recovery in the telecom stock as the rest of the fundamentals exist as they were at the beginning of the previous week. The brokerage said that Vodafone Idea has support from the Government of India (GoI), which is enough to fill the materialization of the funding gap. Nuvama said that the worst for the Vodafone Idea has passed, and the Vodafone Idea share price may touch  ₹15 apiece in the medium to long term.\"The Supreme Court (SC) dismissed VIL's Curative Petition for relief on its AGR dues of INR703bn. VIL's stock price declined sharply by 20% following the announcement as the Street had factored in a relief of ~50% on VIL's overall AGR dues. Unlike the Street, we had not factored any upsides to VIL from the SC reducing VIL's dues as the past view of the court was amply clear on the same,\" said Nuvama.\"In FY26F, VIL will generate  ₹224 bn of EBITDA, and its EBITDA generation will be used to meet government dues, which stand at  ₹290 bn partly; however, as indicated by VIL in the past, it is likely to use the option to convert government dues into equity — to this end, VIL will be able to convert  ₹120 bn of dues into equity and will be able to manage to repay the remaining of  ₹170 bn through its EBITDA generation,\" Nuvama said adding, \"In FY27F, VIL will generate  ₹261bn of EBITDA. Payments to the government will increase sharply to  ₹430 bn; out of this, VIL will be able to convert  ₹170 bn of dues to equity and pay the remaining  ₹260 bn through its EBITDA.\"On key triggers for Vodafone Idea shares, Nuvama said, “We note that the AGR outcome was a material overhang on VIL, and following the conclusion of this overhang, there is now incremental visibility on the way forward for VIL. Despite its large debt burden (but manageable with government support) in the coming years, VIL will be able to steadily repair and rebuild its business and partake in the robust outlook for the Indian telecom industry — which is underpinned by clarity on significant tariff hikes for the next two years and 5G monetization.”\"We maintain our estimates, which factor in a 12% ARPU hike and slowing subscriber loss trends for VIL over FY25-26F and a modest recovery in FY27F, which we opine can have upside risks. Hence, we expect its EBITDA to record a 15% CAGR over FY24-FY27F. We believe the worst has passed following the conclusion of the overhang, and the sharp decline in recent weeks offers an opportunity to buy the stock,\" the global brokerage said.On the suggestion to the stock market investors regarding Vodafone Idea shares, Nuvama said, \"We value Vodafone Idea using EV/EBITDA methodology using a multiple of 15x Sep-26F EV/EBITDA to arrive at our target price of  ₹15. The benchmark index for this stock is the Nifty 50.\"So, Nuvama is predicting an over 40 per cent upside in Vodafone Idea's share price compared to its current market price of  ₹10.52 apiece.","cleaned_content":"vodafone idea share price after the supreme court did not find relief on agr dues vodafone idea shares witnessed a strong sell off last week and touched a new \u003cFIVE_TEN\u003e week low of \u003cNINE_\u003e apiece during friday deals however the beaten down stock witnessed strong buying at the lower levels and finished green at \u003cONE_TEN\u003e per share logging a \u003cSEVEN_PERCENT\u003e rise against the \u003cFIVE_TEN\u003e week high according to the global brokerage nuvama the market had not factored in any upside in vodafone idea share price due to the supreme court reducing agr dues hence there can be a sharp recovery in the telecom stock as the rest of the fundamentals exist as they were at the beginning of the previous week the brokerage said that vodafone idea has support from the government of india goi which is enough to fill the materialization of the funding gap nuvama said that the worst for the vodafone idea has passed and the vodafone idea share price may touch \u003cONE_TEN\u003e apiece in the medium to long term the supreme court sc dismissed vils curative petition for relief on its agr dues of inr703bn vils stock price declined sharply by \u003cTWO_TEN_PERCENT\u003e following the announcement as the street had factored in a relief of \u003cFIVE_TEN_PERCENT\u003e on vils overall agr dues unlike the street we had not factored any upsides to vil from the sc reducing vils dues as the past view of the court was amply clear on the same said nuvama in fy26f vil will generate \u003cTWO_HUNDRED\u003e bn of ebitda and its ebitda generation will be used to meet government dues which stand at \u003cTWO_HUNDRED\u003e bn partly however as indicated by vil in the past it is likely to use the option to convert government dues into equity to this end vil will be able to convert \u003cONE_HUNDRED\u003e bn of dues into equity and will be able to manage to repay the remaining of \u003cONE_HUNDRED\u003e bn through its ebitda generation nuvama said adding in fy27f vil will generate \u003cTWO_HUNDRED\u003e bn of ebitda payments to the government will increase sharply to \u003cFOUR_HUNDRED\u003e bn out of this vil will be able to convert \u003cONE_HUNDRED\u003e bn of dues to equity and pay the remaining \u003cTWO_HUNDRED\u003e bn through its ebitda on key triggers for vodafone idea shares nuvama said we note that the agr outcome was a material overhang on vil and following the conclusion of this overhang there is now incremental visibility on the way forward for vil despite its large debt burden but manageable with government support in the coming years vil will be able to steadily repair and rebuild its business and partake in the robust outlook for the indian telecom industry which is underpinned by clarity on significant tariff hikes for the next two years and \u003cFIVE_\u003e g monetization we maintain our estimates which factor in a \u003cONE_TEN_PERCENT\u003e arpu hike and slowing subscriber loss trends for vil over fy25 \u003cTWO_TEN\u003e f and a modest recovery in fy27f which we opine can have upside risks hence we expect its ebitda to record a \u003cONE_TEN_PERCENT\u003e cagr over fy24 fy27f we believe the worst has passed following the conclusion of the overhang and the sharp decline in recent weeks offers an opportunity to buy the stock the global brokerage said on the suggestion to the stock market investors regarding vodafone idea shares nuvama said we value vodafone idea using ev ebitda methodology using a multiple of \u003cONE_TEN\u003e x sep \u003cTWO_TEN\u003e f ev ebitda to arrive at our target price of \u003cONE_TEN\u003e the benchmark index for this stock is the nifty \u003cFIVE_TEN\u003e so nuvama is predicting an over \u003cFOUR_TEN_PERCENT\u003e upside in vodafone ideas share price compared to its current market price of \u003cONE_TEN\u003e apiece","timestamp":"2024-09-21T09:43:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}