{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-pn-gadgil-jewellers-share-price-dips-after-bumper-opening-buy-sell-or-hold-11726560565222.html","title":"PN Gadgil Jewellers share price dips after bumper opening. Buy, sell or hold?","description":"PN Gadgil Jewellers share price opened on the NSE at  ₹830 apiece, delivering listing gain of around 73% to IPO allottees","content":"Stock market today: PN Gadgil share price opened at a bumper premium of 73 per cent on the Indian stock market exchanges during Tuesday dealings. PN Gadgil Jewellers' share price opened on the NSE at  ₹830 apiece and touched an intraday high of  ₹848 per share mark within a few minutes of the share listing. Likewise, on the BSE, PN Gadgil Jewellers' share price opened at  ₹834 per share mark and touched an intraday high of  ₹843.80 apiece. So, the jewellery stock delivered around 73 per cent listing premium to its lucky allottees against the upper price band of  ₹480 per equity share. However, the newly listed stock witnessed a profit booking trigger immediately after the dream debut on Dalal Street.According to stock market experts, those who applied for the listing gain are advised to book profit and exit as gold prices are at record highs, and it is expected to work as a taper for the stock rally in the near term. However, they advised long-term investors to hold the scrip as the company has strong financials.Expecting limited upside in PN Gadgil Jewellers' share price in the near term, Arun Kejriwal, Founder of Kejriwal Research and Investment Services, said, \"Those who have applied for listing gains are advised to book profit and exit as the small-sized initial offer is already listing at a strong premium, and the probability of further rally in the commodity stock in current skyrocketing gold prices is limited.\"On the suggestion to the long-term investors, Akriti Mehrotra, Research Analyst at StoxBox, said, “India's jewellery market benefits from a profound cultural affinity for gold, valued as a store of wealth, a hedge against inflation, and collateral for loans. PNG has leveraged this cultural affinity effectively, boasting a diverse product range with over 10,000 SKUs in gold, 1,200 in silver, 2,700 in platinum, and 24,000 in diamond jewellery, catering to a broad spectrum of customer needs. Operating 39 stores—38 in Maharashtra and Goa and one in the US—PNG has established a strong brand presence and is strategically expanding into underserved Tier I and Tier II cities, with plans to add 12 new stores in Maharashtra by FY26.”\"Financially, PNG has demonstrated robust growth, with significant increases in revenue and EBITDA during FY2022-24. Considering PNG's strategic market expansion, strong digital presence, and innovative marketing, we recommend that investors who have been allotted shares consider holding their positions from a medium to long-term perspective,\" the StoxBox expert said.\"Due to its rich heritage of PNG brand equity and legacy of over 150 years old, the market may give a higher valuation multiple than its listed peers. We believe PNG is well-positioned in India's growing organized jewellery sector. Hence, we recommend long-term investors to \"HOLD\" in P N Gadgil Jewellers Ltd for long-term perspective only,\" said Prashanth Tapse, Senior Vice President — Research at Mehta Equities.","cleaned_content":"stock market today pn gadgil share price opened at a bumper premium of \u003cSEVEN_TEN_PERCENT\u003e on the indian stock market exchanges during tuesday dealings pn gadgil jewellers share price opened on the nse at \u003cEIGHT_HUNDRED\u003e apiece and touched an intraday high of \u003cEIGHT_HUNDRED\u003e per share mark within a few minutes of the share listing likewise on the bse pn gadgil jewellers share price opened at \u003cEIGHT_HUNDRED\u003e per share mark and touched an intraday high of \u003cEIGHT_HUNDRED\u003e apiece so the jewellery stock delivered around \u003cSEVEN_TEN_PERCENT\u003e listing premium to its lucky allottees against the upper price band of \u003cFOUR_HUNDRED\u003e per equity share however the newly listed stock witnessed a profit booking trigger immediately after the dream debut on dalal street according to stock market experts those who applied for the listing gain are advised to book profit and exit as gold prices are at record highs and it is expected to work as a taper for the stock rally in the near term however they advised long term investors to hold the scrip as the company has strong financials expecting limited upside in pn gadgil jewellers share price in the near term arun kejriwal founder of kejriwal research and investment services said those who have applied for listing gains are advised to book profit and exit as the small sized initial offer is already listing at a strong premium and the probability of further rally in the commodity stock in current skyrocketing gold prices is limited on the suggestion to the long term investors akriti mehrotra research analyst at stoxbox said indias jewellery market benefits from a profound cultural affinity for gold valued as a store of wealth a hedge against inflation and collateral for loans png has leveraged this cultural affinity effectively boasting a diverse product range with over \u003cONE_TEN_THOUSAND\u003e skus in gold \u003cONE_THOUSAND\u003e in silver \u003cTWO_THOUSAND\u003e in platinum and \u003cTWO_TEN_THOUSAND\u003e in diamond jewellery catering to a broad spectrum of customer needs operating \u003cTHREE_TEN\u003e stores \u003cTHREE_TEN\u003e in maharashtra and goa and one in the us png has established a strong brand presence and is strategically expanding into underserved tier i and tier ii cities with plans to add \u003cONE_TEN\u003e new stores in maharashtra by fy26 financially png has demonstrated robust growth with significant increases in revenue and ebitda during fy2022 \u003cTWO_TEN\u003e considering pngs strategic market expansion strong digital presence and innovative marketing we recommend that investors who have been allotted shares consider holding their positions from a medium to long term perspective the stoxbox expert said due to its rich heritage of png brand equity and legacy of over \u003cONE_HUNDRED\u003e years old the market may give a higher valuation multiple than its listed peers we believe png is well positioned in indias growing organized jewellery sector hence we recommend long term investors to hold in p n gadgil jewellers ltd for long term perspective only said prashanth tapse senior vice president research at mehta equities","timestamp":"2024-09-17T14:02:00+05:30","market_timestamp":"2024-09-17T14:02:00+05:30","off_market_hours":false}