{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-fall-on-profit-booking-mid-and-smallcaps-outperform-11726220717848.html","title":"Stock market today: Nifty 50, Sensex fall on profit booking; mid and smallcaps outperform","description":"The Nifty 50 ended the session down by 0.13 percent, closing at 25,356 points, while S\u0026P BSE Sensex also closed nearly flat, slipping 0.09 percent to 82,890 points. The Nifty Midcap 100 index crossed the 60,000 mark for the first time, closing at 60,189 points with a 0.66 percent gain.","content":"Indian markets ended Friday’s session lower as investors took the opportunity to book profits. Both front indices briefly touched Thursday's record highs but were unable to hold those levels, as weakness in pharma and FMCG stocks weighed on the market, despite strong support from IT stocks.The Nifty 50 ended the session down by 0.13 percent, closing at 25,356 points. Among the 50 constituents, 20 stocks finished in positive territory, with Wipro leading the gainers, up 3.9 per cent.Other notable performers included Bajaj Finance, Bajaj Finserv, IndusInd Bank, Axis Bank, Tata Steel, and Grasim Industries, which saw gains ranging between 1 per cent and 2.3 per cent.The S\u0026P BSE Sensex also closed nearly flat, slipping 0.09 per cent to 82,890 points. Among the sectoral indices, the Nifty Realty index rose by 1.75 per cent, and the Nifty Media index increased by 1.74 per cent. The Nifty PSU Bank index also gained 1.25 per cent. In contrast, the Nifty Oil \u0026 Gas, Nifty FMCG, and Nifty Energy indices each fell by more than 0.6 per cent.Commenting on today's market performance, Vinod Nair, Head of Research, Geojit Financial Services said, \"The market took a breather and ended on a flat note after the previous day’s sharp uptick. Despite domestic CPI inflation being within RBI's target band, the increase in food prices may influence the central bank to remain prudent on rates. Higher liquidity from FIIs to the domestic market and a slide in US 10-year yield increased the prospects of the FED rate cut, which will aid domestic sentiment.\"For the week, the Nifty 50 surged by 2.03 per cent, marking its largest weekly gain since late June. The Sensex also finished the week up by 2.10 percent.Mid-cap and small-cap stocks extended their winning streak for a second consecutive session on Friday. The Nifty Midcap 100 index crossed the 60,000 mark for the first time, closing at 60,189 points with a 0.66 per cent gain.Among the top gainers in the mid-cap index, IDBI Bank led with a 7.9 per cent increase, while Oracle Financial Services Software saw a 5.9 per cent rise. Bandhan Bank shares surged 5 percent after Kotak Institutional Equities maintained a 'buy' rating with a target price of  ₹250 per share. Overall, 66 constituents of the index finished in positive territory.The Nifty Smallcap 100 index rose by 0.78 per cent, closing at 19,505 points. Out of its constituents, 69 ended in positive territory. IIFL Finance was the top performer in the index, with a gain of 7.2 per cent.The Nifty IT index surged by 1 percent, reaching a fresh all-time high in today's trade, as central banks, where Indian IT companies have significant revenue exposure, began cutting interest rates due to moderating inflation.All 10 stocks within the index ended the session in the green, with Wipro leading the gains, rising 3.9 percent to  ₹550 per share. Other strong performers included MphasiS, Coforge, L\u0026T Technology Services, and Persistent Systems were all ended with gains between 1 per cent and 2 per cent.Notably, five stocks including MphasiS, Coforge, Persistent Systems, HCL Technologies, and LTIMindtree have reached new 52-week highs during the session. This momentum has propelled the Nifty IT index to a year-to-date gain of 22.19 per cent, outpacing the Nifty 50's 16.68 per cent rise.Jewellery stocks jumped up sharply in today's trade as gold hit new record highs amid global central banks initiating interest rate cuts in response to easing inflation. Stocks including Tribhovandas Bhimji Zaveri (TBZ), Kalyan Jewellers, Senco Gold, Motisons Jewellers, PC Jeweller, and Thangamayil Jewellery saw their shares surge between 4 per cent and 20 per cent.For regional jewellery businesses, rising gold prices can be particularly beneficial. These companies often keep a significant portion of their gold inventory unhedged, enabling them to capitalize directly on the price increases through inventory gains.On the other hand, larger players like Titan and Kalyan Jewellers typically hedge 70 per cent to 90 per cent of their gold holdings. Despite this, the unhedged portion of their inventories still benefits from rising gold prices.Jewellery stocks have been performing well recently, supported by multiple factors including a cut in customs duties on gold and silver from the latest Union Budget, increasing wedding jewellery demand, favourable brokerage outlooks, and anticipated strong sales during the upcoming festive season.","cleaned_content":"indian markets ended friday s session lower as investors took the opportunity to book profits both front indices briefly touched thursdays record highs but were unable to hold those levels as weakness in pharma and fmcg stocks weighed on the market despite strong support from it stocks the nifty \u003cFIVE_TEN\u003e ended the session down by \u003cZERO_PERCENT\u003e closing at \u003cTWO_TEN_THOUSAND\u003e points among the \u003cFIVE_TEN\u003e constituents \u003cTWO_TEN\u003e stocks finished in positive territory with wipro leading the gainers up \u003cTHREE_PERCENT\u003e other notable performers included bajaj finance bajaj finserv indusind bank axis bank tata steel and grasim industries which saw gains ranging between \u003cONE_PERCENT\u003e and \u003cTWO_PERCENT\u003e the s p bse sensex also closed nearly flat slipping \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e points among the sectoral indices the nifty realty index rose by \u003cONE_PERCENT\u003e and the nifty media index increased by \u003cONE_PERCENT\u003e the nifty psu bank index also gained \u003cONE_PERCENT\u003e in contrast the nifty oil gas nifty fmcg and nifty energy indices each fell by more than \u003cZERO_PERCENT\u003e commenting on todays market performance vinod nair head of research geojit financial services said the market took a breather and ended on a flat note after the previous day s sharp uptick despite domestic cpi inflation being within rbis target band the increase in food prices may influence the central bank to remain prudent on rates higher liquidity from fiis to the domestic market and a slide in us \u003cONE_TEN\u003e year yield increased the prospects of the fed rate cut which will aid domestic sentiment for the week the nifty \u003cFIVE_TEN\u003e surged by \u003cTWO_PERCENT\u003e marking its largest weekly gain since late june the sensex also finished the week up by \u003cTWO_PERCENT\u003e mid cap and small cap stocks extended their winning streak for a second consecutive session on friday the nifty midcap \u003cONE_HUNDRED\u003e index crossed the \u003cSIX_TEN_THOUSAND\u003e mark for the first time closing at \u003cSIX_TEN_THOUSAND\u003e points with a \u003cZERO_PERCENT\u003e gain among the top gainers in the mid cap index idbi bank led with a \u003cSEVEN_PERCENT\u003e increase while oracle financial services software saw a \u003cFIVE_PERCENT\u003e rise bandhan bank shares surged \u003cFIVE_PERCENT\u003e after kotak institutional equities maintained a buy rating with a target price of \u003cTWO_HUNDRED\u003e per share overall \u003cSIX_TEN\u003e constituents of the index finished in positive territory the nifty smallcap \u003cONE_HUNDRED\u003e index rose by \u003cZERO_PERCENT\u003e closing at \u003cONE_TEN_THOUSAND\u003e points out of its constituents \u003cSIX_TEN\u003e ended in positive territory iifl finance was the top performer in the index with a gain of \u003cSEVEN_PERCENT\u003e the nifty it index surged by \u003cONE_PERCENT\u003e reaching a fresh all time high in todays trade as central banks where indian it companies have significant revenue exposure began cutting interest rates due to moderating inflation all \u003cONE_TEN\u003e stocks within the index ended the session in the green with wipro leading the gains rising \u003cTHREE_PERCENT\u003e to \u003cFIVE_HUNDRED\u003e per share other strong performers included mphasis coforge l t technology services and persistent systems were all ended with gains between \u003cONE_PERCENT\u003e and \u003cTWO_PERCENT\u003e notably five stocks including mphasis coforge persistent systems hcl technologies and ltimindtree have reached new \u003cFIVE_TEN\u003e week highs during the session this momentum has propelled the nifty it index to a year to date gain of \u003cTWO_TEN_PERCENT\u003e outpacing the nifty \u003cFIVE_TEN\u003e s \u003cONE_TEN_PERCENT\u003e rise jewellery stocks jumped up sharply in todays trade as gold hit new record highs amid global central banks initiating interest rate cuts in response to easing inflation stocks including tribhovandas bhimji zaveri tbz kalyan jewellers senco gold motisons jewellers pc jeweller and thangamayil jewellery saw their shares surge between \u003cFOUR_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e for regional jewellery businesses rising gold prices can be particularly beneficial these companies often keep a significant portion of their gold inventory unhedged enabling them to capitalize directly on the price increases through inventory gains on the other hand larger players like titan and kalyan jewellers typically hedge \u003cSEVEN_TEN_PERCENT\u003e to \u003cNINE_TEN_PERCENT\u003e of their gold holdings despite this the unhedged portion of their inventories still benefits from rising gold prices jewellery stocks have been performing well recently supported by multiple factors including a cut in customs duties on gold and silver from the latest union budget increasing wedding jewellery demand favourable brokerage outlooks and anticipated strong sales during the upcoming festive season","timestamp":"2024-09-13T15:43:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}