{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-us-fed-rate-cut-buzz-five-stocks-to-buy-or-sell-on-wednesday-sept-18-11726569811895.html","title":"Stock market today: Trade setup for Nifty 50 to US Fed rate cut buzz, five stocks to buy or sell on Wednesday — Sept 18","description":"Stock Market Today- The two-day Federal Open Market Committee (FOMC) meeting started on 17 Sept. and markets remain watchful on the outcome by Wednesday night. Religare's Ajit Mishra recommends continuing with a “buy on dips” strategy. Some sectors are presenting stock-specific buying opportunities","content":"Stock Market Today: The wait for interest rate cut decision by the US Federal Reserve continues keeping the market participants cautiously optimistic and thereby markets range bound, though with a positive bias. The benchmark Nifty 50 index on Tuesday ended with gains of 0.14% at 25,418.55 up 34.80 points. S\u0026P BSE Sensex was up 0.11% and at 83,079.66 ended Tuesday with gains of 90.88 points, very near the all time highs of 83,184.34.Nifty Banking Index after a winning spree in past few sessions is consolidating and on Tuesday, ended at 52,188.65 up 35.5 points or 0.7%. The other key sectoral gainers included Autos, realty, Consumer Durables and Oil\u0026 Gas.The narrow range movement continued in the market for the last three sessions and Nifty closed on Tuesday with minor gains. After opening with a positive note, the market was not able to show a decisive upside breakout of the range movement of the last few sessions around 25400 levels, said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities,A sustainable up move above 25450-25500 could open the next upside target of 25800 in the near term. Immediate support is placed at 25200, said Shetti.“Bank Nifty started the day on a positive note but was unable to sustain higher levels, leading to consolidation within a narrow range,” said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates. “Technically, the index sustained above the cup-and-handle breakout level of 51,750, indicating potential strength. Therefore, the 51,700–51,750 zone will act as immediate support for Bank Nifty in the short term as per Yedve. If the index holds the 51,700 support, it could test levels of 52,800–53,000 in the short term.”The two-day Federal Open Market Committee (FOMC) meeting that started on 17 September 2024, has drawn attention from investors worldwide for months in the hopes that the US Federal Reserve will start lowering policy rates. The outcome of the FOMC decision on the rate cuts will be known by Wednesday late evening keeping participants watchful.“The recent market action suggests that participants are in a wait-and-watch mode ahead of the US Fed meeting, although rotational buying in large-cap stocks is maintaining a positive tone,” said Ajit Mishra – SVP, Research, Religare Broking. “We recommend continuing with a ‘buy on dips’ strategy, targeting an upside of 25,550 in the Nifty, said Mishra Additionally, selective sectors like banking, financials, realty, and IT are presenting stock-specific buying opportunities so he advices investors to plan the trades accordingly.”Sumeet Bagadia, Executive Director at Choice Broking and Ganesh Dongre, Senior Manager of technical Research at Anand Rathi have recommended five stock picks for Wednesday. These include Gravita India Ltd, Arvind Fashions , GAIL India Ltd, Birlasoft Ltd and Dr Reddy's Laboratories Ltd1.GRAVITA INDIA LTD- Sumeet Bagadia Executive Director at Choice Broking recommends buying Gravita in cash market at  ₹2664.65 keeping a stop Loss at  ₹2575 for a target price of  ₹2888Gravita's daily chart analysis offers a favorable view for the following week, indicating a steady higher advance. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.2.Arvind Fashions Ltd- Bagadia recommends buying Arvind Fashions share price at  ₹599.15 keeping a stop loss at  ₹575 for a target price of  ₹675Arvind Fashions is exhibiting strong bullish momentum, currently trading at a 52-week high of 605.3 levels. The recent breakout above the crucial resistance at 575 levels is a significant technical development, supported by robust trading volumes, reinforcing the strength in the stock. The breakthrough suggests a potential continuation of the upward trend, offering an optimistic outlook for investors, said Bagadia.3.GAIL India Ltd- Ganesh Dongre recommends Buying GAIL at  ₹220 keeping a Stoploss at  ₹214 for a Target Price of  ₹228The stock as per Dongre has found a substantial support level at Rs. 214, marking a crucial juncture in its recent trading. Presently, at Rs.220, the stock has demonstrated a definitive reversal in price action, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at Rs.214. The anticipated target for this trade is Rs.228, representing the next significant resistance level. This strategy positions traders favorably to capitalize on the stock's anticipated rally in the weeks ahead, said Dongre4.Birlasoft Ltd - Dongre recommends buying Birlasoft Ltd at  ₹650 keeping a stoploss at  ₹635 for a Price target or  ₹665.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 665. At present, the stock is maintaining a crucial support level at Rs.635. Given the current market price of Rs.350, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 665, added Dongre.5. Dr.. Reddy's Laboratories - Dongre recommends buying Dr Reddy's Laboratories at  ₹6630 keeping a stop loss at  ₹6580 for a target price of  ₹6730On the daily chart of this stock, a breakout at the Rs. 6630 price level has been observed, signaling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 6580 is recommended. The target price for this strategy is Rs. 6730 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"stock market today the wait for interest rate cut decision by the us federal reserve continues keeping the market participants cautiously optimistic and thereby markets range bound though with a positive bias the benchmark nifty \u003cFIVE_TEN\u003e index on tuesday ended with gains of \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e up \u003cTHREE_TEN\u003e points s p bse sensex was up \u003cZERO_PERCENT\u003e and at \u003cEIGHT_TEN_THOUSAND\u003e ended tuesday with gains of \u003cNINE_TEN\u003e points very near the all time highs of \u003cEIGHT_TEN_THOUSAND\u003e nifty banking index after a winning spree in past few sessions is consolidating and on tuesday ended at \u003cFIVE_TEN_THOUSAND\u003e up \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e the other key sectoral gainers included autos realty consumer durables and oil gas the narrow range movement continued in the market for the last three sessions and nifty closed on tuesday with minor gains after opening with a positive note the market was not able to show a decisive upside breakout of the range movement of the last few sessions around \u003cTWO_TEN_THOUSAND\u003e levels said nagaraj shetti senior technical research analyst at hdfc securities a sustainable up move above \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e could open the next upside target of \u003cTWO_TEN_THOUSAND\u003e in the near term immediate support is placed at \u003cTWO_TEN_THOUSAND\u003e said shetti bank nifty started the day on a positive note but was unable to sustain higher levels leading to consolidation within a narrow range said hrishikesh yedve avp technical and derivatives research at asit c mehta investment interrmediates technically the index sustained above the cup and handle breakout level of \u003cFIVE_TEN_THOUSAND\u003e indicating potential strength therefore the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e zone will act as immediate support for bank nifty in the short term as per yedve if the index holds the \u003cFIVE_TEN_THOUSAND\u003e support it could test levels of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e in the short term the two day federal open market committee fomc meeting that started on \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e has drawn attention from investors worldwide for months in the hopes that the us federal reserve will start lowering policy rates the outcome of the fomc decision on the rate cuts will be known by wednesday late evening keeping participants watchful the recent market action suggests that participants are in a wait and watch mode ahead of the us fed meeting although rotational buying in large cap stocks is maintaining a positive tone said ajit mishra svp research religare broking we recommend continuing with a buy on dips strategy targeting an upside of \u003cTWO_TEN_THOUSAND\u003e in the nifty said mishra additionally selective sectors like banking financials realty and it are presenting stock specific buying opportunities so he advices investors to plan the trades accordingly sumeet bagadia executive director at choice broking and ganesh dongre senior manager of technical research at anand rathi have recommended five stock picks for wednesday these include gravita india ltd arvind fashions gail india ltd birlasoft ltd and dr reddys laboratories ltd1 gravita india ltd sumeet bagadia executive director at choice broking recommends buying gravita in cash market at \u003cTWO_THOUSAND\u003e keeping a stop loss at \u003cTWO_THOUSAND\u003e for a target price of \u003cTWO_THOUSAND\u003e gravitas daily chart analysis offers a favorable view for the following week indicating a steady higher advance notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 2 arvind fashions ltd bagadia recommends buying arvind fashions share price at \u003cFIVE_HUNDRED\u003e keeping a stop loss at \u003cFIVE_HUNDRED\u003e for a target price of \u003cSIX_HUNDRED\u003e arvind fashions is exhibiting strong bullish momentum currently trading at a \u003cFIVE_TEN\u003e week high of \u003cSIX_HUNDRED\u003e levels the recent breakout above the crucial resistance at \u003cFIVE_HUNDRED\u003e levels is a significant technical development supported by robust trading volumes reinforcing the strength in the stock the breakthrough suggests a potential continuation of the upward trend offering an optimistic outlook for investors said bagadia 3 gail india ltd ganesh dongre recommends buying gail at \u003cTWO_HUNDRED\u003e keeping a stoploss at \u003cTWO_HUNDRED\u003e for a target price of \u003cTWO_HUNDRED\u003e the stock as per dongre has found a substantial support level at rs \u003cTWO_HUNDRED\u003e marking a crucial juncture in its recent trading presently at rs 220 the stock has demonstrated a definitive reversal in price action suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at rs 214 the anticipated target for this trade is rs 228 representing the next significant resistance level this strategy positions traders favorably to capitalize on the stocks anticipated rally in the weeks ahead said dongre4 birlasoft ltd dongre recommends buying birlasoft ltd at \u003cSIX_HUNDRED\u003e keeping a stoploss at \u003cSIX_HUNDRED\u003e for a price target or \u003cSIX_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cSIX_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 635 given the current market price of rs 350 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cSIX_HUNDRED\u003e added dongre 5 dr reddys laboratories dongre recommends buying dr reddys laboratories at \u003cSIX_THOUSAND\u003e keeping a stop loss at \u003cSIX_THOUSAND\u003e for a target price of \u003cSIX_THOUSAND\u003e on the daily chart of this stock a breakout at the rs \u003cSIX_THOUSAND\u003e price level has been observed signaling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cSIX_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cSIX_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-09-18T08:08:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}