{"url":"https://www.livemint.com/market/stock-market-news/weekend-wrap-september-20-stock-market-top-market-movers-and-news-of-week-mutual-funds-11726806708441.html","title":"Weekend Wrap: From Torrent Power to Uno Minda, top market movers and news of week","description":"Stock market: Presenting a comprehensive recap of the week's highlights, spanning from top news to market performance, here's your market wrap for the week concluding on September 20, 2024.","content":"The National Payments Corporation of India (NPCI) has announced a significant change to its Unified Payments Interface (UPI) transaction limit. Effective from September 16, 2024, the UPI transaction cap has been raised to  ₹5 lakh per transaction. This increase aims to further bolster India's push toward a more robust digital economy by facilitating larger transactions through the UPI system. The revised limit is expected to enhance the utility of UPI for high-value transactions in areas such as investments, insurance, and other financial services, while continuing to support the government's vision for a cashless economy.Bajaj Housing Finance made a robust debut on the stock market, with its shares listing at a 114.29% premium over the issue price of  ₹70 per share. The company’s strong listing reflects investor confidence and highlights the positive sentiment surrounding the stock. Similarly, PN Gadgil Jewellers also saw an impressive listing, with its shares debuting at a 74% premium over the issue price of  ₹480 per share.Meanwhile, several other companies have seen overwhelming demand for their IPOs. Western Carriers (India) witnessed an oversubscription of 31.69 times, while Arkade Developers was oversubscribed by 113.49 times. Northern Arc Capital garnered even stronger interest, with an oversubscription rate of 117.19 times. These figures underline the strong appetite for new listings and indicate a buoyant market for initial public offerings (IPOs), driven by investor optimism and the overall momentum in the stock market.Among the prominent NFO launches are the Bandhan Business Cycle Fund by Bandhan AMC and the SBI Nifty 500 Index Fund by SBI AMC. These funds offer investors an opportunity to tap into different growth cycles and gain exposure to a broader market index.In addition, Nippon AMC has launched the Nippon India Nifty 500 Momentum 50 Index Fund, designed to focus on momentum-based strategies. Kotak AMC has introduced the Kotak Nifty Midcap 150 Momentum 50 Index Fund, offering midcap-focused momentum strategies to investors.HDFC AMC has launched the HDFC Nifty Largemidcap 250 Index Fund, which aims to capture growth from both large and mid-sized companies, while LIC AMC has launched the LIC MF Manufacturing Fund, which will focus on investment opportunities within the manufacturing sector.Kuvera is a free direct mutual fund investing platform. Unless otherwise stated data sourced from BSE, NSE and kuvera","cleaned_content":"the national payments corporation of india npci has announced a significant change to its unified payments interface upi transaction limit effective from september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the upi transaction cap has been raised to \u003cFIVE_\u003e lakh per transaction this increase aims to further bolster indias push toward a more robust digital economy by facilitating larger transactions through the upi system the revised limit is expected to enhance the utility of upi for high value transactions in areas such as investments insurance and other financial services while continuing to support the governments vision for a cashless economy bajaj housing finance made a robust debut on the stock market with its shares listing at a \u003cONE_HUNDRED_PERCENT\u003e premium over the issue price of \u003cSEVEN_TEN\u003e per share the company s strong listing reflects investor confidence and highlights the positive sentiment surrounding the stock similarly pn gadgil jewellers also saw an impressive listing with its shares debuting at a \u003cSEVEN_TEN_PERCENT\u003e premium over the issue price of \u003cFOUR_HUNDRED\u003e per share meanwhile several other companies have seen overwhelming demand for their ipos western carriers india witnessed an oversubscription of \u003cTHREE_TEN\u003e times while arkade developers was oversubscribed by \u003cONE_HUNDRED\u003e times northern arc capital garnered even stronger interest with an oversubscription rate of \u003cONE_HUNDRED\u003e times these figures underline the strong appetite for new listings and indicate a buoyant market for initial public offerings ipos driven by investor optimism and the overall momentum in the stock market among the prominent nfo launches are the bandhan business cycle fund by bandhan amc and the sbi nifty \u003cFIVE_HUNDRED\u003e index fund by sbi amc these funds offer investors an opportunity to tap into different growth cycles and gain exposure to a broader market index in addition nippon amc has launched the nippon india nifty \u003cFIVE_HUNDRED\u003e momentum \u003cFIVE_TEN\u003e index fund designed to focus on momentum based strategies kotak amc has introduced the kotak nifty midcap \u003cONE_HUNDRED\u003e momentum \u003cFIVE_TEN\u003e index fund offering midcap focused momentum strategies to investors hdfc amc has launched the hdfc nifty largemidcap \u003cTWO_HUNDRED\u003e index fund which aims to capture growth from both large and mid sized companies while lic amc has launched the lic mf manufacturing fund which will focus on investment opportunities within the manufacturing sector kuvera is a free direct mutual fund investing platform unless otherwise stated data sourced from bse nse and kuvera","timestamp":"2024-09-21T11:12:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}