{"url":"https://www.livemint.com/market/stock-market-news/breakout-stock-zomato-share-price-sees-range-breakout-analysts-expect-up-to-18-upside-11726206290169.html","title":"Breakout stock: Zomato share price sees range breakout; analysts expect up to 18% upside","description":"Zomato stock price has rallied over 7% in one week and has surged more than 50% in the past three months. The stock has witnessed a technical breakout above the consolidation zone and analysts expect the medium-term uptrend in Zomato shares will continue.","content":"Zomato share price hit its record high level of  ₹286.50 apiece in early deals on Friday, extending gains for the seventh straight session. However, Zomato shares cooled off from the high levels and declined over 2%.Zomato stock price has rallied over 7% in one week and has surged more than 50% in the past three months. The stock has witnessed a technical breakout above the consolidation zone and analysts expect the medium-term uptrend in Zomato shares will continue.“Zomato exhibited a strong breakout above the consolidation zone between  ₹280 - 249, marked by a decisive bullish candle on the weekly chart, reinforcing the continuation of the medium-term uptrend. The stock forms a pattern of higher high-low formations on a weekly chart while maintaining position above a medium-term upward sloping trendline, suggesting a sustained uptrend,” Axis Securities said.According to the technicals, Zomato stock is holding above the 23% Fibonacci retracement level of the rally from  ₹146 to  ₹279, with support forming around  ₹249, indicating a potential medium-term support zone.“The weekly Relative Strength Index (RSI) crossed above its reference line, generating a buy signal. Following the consolidation breakout, the stock is expected to continue medium term uptrend, with targets set at  ₹314 - 325,” said the brokerage firm.Axis Securities recommends buying Zomato shares in the range of  ₹278 - 272, with a target price of  ₹314 - 325, expecting gains of 14% - 18%. As per the analysis, a trend reversal can be seen below  ₹256 level.Foreign brokerage firm Bernstein has reaffirmed its ‘Outperform’ rating and raised Zomato share price target to  ₹330 apiece from  ₹275 earlier, implying an upside of more than 16% from Thursday’s closing price.Bernstein’s positive view on Zomato comes on the back of the growing quick commerce (QC) sector and the brokerage firm notes that Zomato is central to the quick commerce boom. It believes Zomato is prioritizing long-term growth and market leadership over immediate profitability.Zomato share price has given multibagger return of 125% year-to-date (YTD) and more than 183% in one year.At 11:25 am, Zomato shares were trading 2.11% lower at  ₹277.90 apiece on the BSE.","cleaned_content":"zomato share price hit its record high level of \u003cTWO_HUNDRED\u003e apiece in early deals on friday extending gains for the seventh straight session however zomato shares cooled off from the high levels and declined over \u003cTWO_PERCENT\u003e zomato stock price has rallied over \u003cSEVEN_PERCENT\u003e in one week and has surged more than \u003cFIVE_TEN_PERCENT\u003e in the past three months the stock has witnessed a technical breakout above the consolidation zone and analysts expect the medium term uptrend in zomato shares will continue zomato exhibited a strong breakout above the consolidation zone between \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e marked by a decisive bullish candle on the weekly chart reinforcing the continuation of the medium term uptrend the stock forms a pattern of higher high low formations on a weekly chart while maintaining position above a medium term upward sloping trendline suggesting a sustained uptrend axis securities said according to the technicals zomato stock is holding above the \u003cTWO_TEN_PERCENT\u003e fibonacci retracement level of the rally from \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e with support forming around \u003cTWO_HUNDRED\u003e indicating a potential medium term support zone the weekly relative strength index rsi crossed above its reference line generating a buy signal following the consolidation breakout the stock is expected to continue medium term uptrend with targets set at \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e said the brokerage firm axis securities recommends buying zomato shares in the range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e with a target price of \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e expecting gains of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e as per the analysis a trend reversal can be seen below \u003cTWO_HUNDRED\u003e level foreign brokerage firm bernstein has reaffirmed its outperform rating and raised zomato share price target to \u003cTHREE_HUNDRED\u003e apiece from \u003cTWO_HUNDRED\u003e earlier implying an upside of more than \u003cONE_TEN_PERCENT\u003e from thursday s closing price bernstein s positive view on zomato comes on the back of the growing quick commerce qc sector and the brokerage firm notes that zomato is central to the quick commerce boom it believes zomato is prioritizing long term growth and market leadership over immediate profitability zomato share price has given multibagger return of \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and more than \u003cONE_HUNDRED_PERCENT\u003e in one year at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e am zomato shares were trading \u003cTWO_PERCENT\u003e lower at \u003cTWO_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-13T11:27:00+05:30","market_timestamp":"2024-09-13T11:27:00+05:30","off_market_hours":false}