{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-hits-life-time-high-experts-list-out-these-5-reasons-11726133713765.html","title":"Stock market today: Nifty 50, Sensex hit life-time highs. Experts list out these 5 reasons","description":"Indian stocks gained momentum in the final hour of today's trade, pushing the major indices to new historic highs. The S\u0026P BSE Sensex crossed the 82,750 mark for the first time in session, reaching 82,791 points, while the Nifty 50 hit a record high of 25,433 points.","content":"Indian stocks gained momentum in the final hour of today's trade, pushing the major indices to new historic highs. The S\u0026P BSE Sensex crossed the 83,000 mark for the first time in trade reaching 83,020 points, while the Nifty 50 hit a record high of 25,433 points, edging closer to the 25,500 level.The rally was driven by banking and IT sectors, with additional support from the auto pack, propelling the frontline indices to new record fresh milestones. Heavyweight stocks like Reliance Industries, Bharti Airtel, HDFC Bank, Infosys, and ICICI Bank collectively added 171 points to the Nifty 50, accounting for 38 per cent of its total 470-point surge today.This marked the second record high for the index this month so far. Of the 50 index constituents, 49 closed in the green, with Hindalco leading the gainers at a 4.5 per cent rise. Bharti Airtel, NTPC, Shriram Finance, Mahindra \u0026 Mahindra, JSW Steel, Eicher Motors, ONGC, Adani Ports \u0026 SEZ, Wipro, and Grasim Industries followed, posting gains between 3 per cent and 4.5 per cent.Against this backdrop, the Nifty 50 closed the session with a 1.89 per cent gain, ending at 25,388.90 points. Similarly, the S\u0026P BSE Sensex finished at 82,962 points, up 1.77 per cent from the previous close. Today's rally turned both indices positive for the month, with the Nifty 50 up 0.7 per cent in September and the Sensex gaining 0.72 per cent over the same period.The following are the five key reasons listed by experts for the sharp rally observed in the final hour of trading:The data released on Wednesday showed that the US consumer price index increased by 0.2 per cent in August, consistent with July's rise. However, when excluding the more volatile food and energy sectors, the core CPI rose by 0.3 per cent, up from the previous month's 0.2 per cent gain.As a result, traders have largely discounted the likelihood of a 50-basis point rate cut on September 18, reducing its probability to 15 per cent. Instead, there is an 85 per cent chance of a 25-basis point cut. Despite this, markets still anticipate a total of 104 basis points in cuts by the end of the year, indicating expectations for a 50-bp reduction at either the November or December meetings.Seema Srivastava, Senior Equity Research Analyst at SMC Global Securities, said, \"After the comfortable US CPI data, the Indian market investors have been waiting and watching since morning dealing. As no strong selling was witnessed during the Thursday deals, bulls strongly responded during the closing bell.\"Arun Kejriwal, Founder of Kejriwal Research and Investment Services, said, \"The market is strongly responding to the Chinese rate cut buzz as it is expected to boost demand in the real estate and commodity market. So, this last-hour bounce in the Indian stock market should only be seen from this angle.\"Narendra Solanki, Head Fundamental Research Investment Services, Anand Rathi Shares and Stock Brokers, said, \"The Indian markets opened in green on the back of positive Asian markets buoyed by a tech-fuelled rally on Wall Street overnight during the afternoon session.\"The markets further gained strength on news of China cutting rates by 50 bps on $5 trillion mortgages as soon as this month to boost consumption came out ahead of a European Central Bank (ECB) policy meeting later in the day; providing much needed sentimental boost to the markets,\" Solanki said.Foreign Portfolio Investors (FPIs) have continued to be net buyers in the Indian stock market over the past three sessions. This follows an investment of nearly  ₹11,000 crore in the first week of the current month, driven by the resilience of the Indian market and expectations of an interest rate cut in the US.In the last three sessions alone, FPIs added  ₹5,319 crore to their investments. This sustained buying spree has been bolstered by improved market sentiment, particularly after recent remarks from US Federal Reserve Chair Jerome Powell, who indicated that a rate cut could be forthcoming.The European Central Bank (ECB) is anticipated to lower its rates by 25 basis points on Thursday, marking the first reduction since June when the possibility of a cut in September was still considered highly likely. Currently, the ECB's main interest rate stands at 3.75 per cent, reflecting the impact of several years of substantial rate increases.The ECB’s meeting comes just days ahead of the US Federal Reserve’s September 17-18 meeting, at which it’s expected to begin its own rate-cutting cycle.Vinod Nair, Head of Research, Geojit Financial Services said, “The bulls took charge towards the end of the day and lifted the indices to a new high, mirroring the bullish global trend. The rate-cut optimism across the globe (ECB \u0026 US Fed) has provided a positive impetus to the global market. The subsequent leg of the rally will be influenced by the outcome of domestic inflation and IIP data while the corporates core earnings are forecast to improve in Q2 on a QoQ basis.”Rupak De, Senior Technical Analyst, LKP Securities, said, \"The Nifty has broken out of its recent consolidation on the daily chart, indicating a rise in optimism. Additionally, the index has been sustaining above the critical 21-day EMA, a near-term moving average. The RSI on the daily chart shows a bullish crossover, reinforcing the positive sentiment. The trend is expected to remain strong, as the index closed above the recent consolidation high. On the upside, the rally could potentially continue toward the 25,470–25,500 range, while support is seen at 25,100.\"","cleaned_content":"indian stocks gained momentum in the final hour of todays trade pushing the major indices to new historic highs the s p bse sensex crossed the \u003cEIGHT_TEN_THOUSAND\u003e mark for the first time in trade reaching \u003cEIGHT_TEN_THOUSAND\u003e points while the nifty \u003cFIVE_TEN\u003e hit a record high of \u003cTWO_TEN_THOUSAND\u003e points edging closer to the \u003cTWO_TEN_THOUSAND\u003e level the rally was driven by banking and it sectors with additional support from the auto pack propelling the frontline indices to new record fresh milestones heavyweight stocks like reliance industries bharti airtel hdfc bank infosys and icici bank collectively added \u003cONE_HUNDRED\u003e points to the nifty \u003cFIVE_TEN\u003e accounting for \u003cTHREE_TEN_PERCENT\u003e of its total \u003cFOUR_HUNDRED\u003e point surge today this marked the second record high for the index this month so far of the \u003cFIVE_TEN\u003e index constituents \u003cFOUR_TEN\u003e closed in the green with hindalco leading the gainers at a \u003cFOUR_PERCENT\u003e rise bharti airtel ntpc shriram finance mahindra mahindra jsw steel eicher motors ongc adani ports sez wipro and grasim industries followed posting gains between \u003cTHREE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e against this backdrop the nifty \u003cFIVE_TEN\u003e closed the session with a \u003cONE_PERCENT\u003e gain ending at \u003cTWO_TEN_THOUSAND\u003e points similarly the s p bse sensex finished at \u003cEIGHT_TEN_THOUSAND\u003e points up \u003cONE_PERCENT\u003e from the previous close todays rally turned both indices positive for the month with the nifty \u003cFIVE_TEN\u003e up \u003cZERO_PERCENT\u003e in september and the sensex gaining \u003cZERO_PERCENT\u003e over the same period the following are the five key reasons listed by experts for the sharp rally observed in the final hour of trading the data released on wednesday showed that the us consumer price index increased by \u003cZERO_PERCENT\u003e in august consistent with julys rise however when excluding the more volatile food and energy sectors the core cpi rose by \u003cZERO_PERCENT\u003e up from the previous months \u003cZERO_PERCENT\u003e gain as a result traders have largely discounted the likelihood of a \u003cFIVE_TEN\u003e basis point rate cut on september \u003cONE_TEN\u003e reducing its probability to \u003cONE_TEN_PERCENT\u003e instead there is an \u003cEIGHT_TEN_PERCENT\u003e chance of a \u003cTWO_TEN\u003e basis point cut despite this markets still anticipate a total of \u003cONE_HUNDRED\u003e basis points in cuts by the end of the year indicating expectations for a \u003cFIVE_TEN\u003e bp reduction at either the november or december meetings seema srivastava senior equity research analyst at smc global securities said after the comfortable us cpi data the indian market investors have been waiting and watching since morning dealing as no strong selling was witnessed during the thursday deals bulls strongly responded during the closing bell arun kejriwal founder of kejriwal research and investment services said the market is strongly responding to the chinese rate cut buzz as it is expected to boost demand in the real estate and commodity market so this last hour bounce in the indian stock market should only be seen from this angle narendra solanki head fundamental research investment services anand rathi shares and stock brokers said the indian markets opened in green on the back of positive asian markets buoyed by a tech fuelled rally on wall street overnight during the afternoon session the markets further gained strength on news of china cutting rates by \u003cFIVE_TEN\u003e bps on \u003cFIVE_\u003e trillion mortgages as soon as this month to boost consumption came out ahead of a european central bank ecb policy meeting later in the day providing much needed sentimental boost to the markets solanki said foreign portfolio investors fpis have continued to be net buyers in the indian stock market over the past three sessions this follows an investment of nearly \u003cONE_TEN_THOUSAND\u003e crore in the first week of the current month driven by the resilience of the indian market and expectations of an interest rate cut in the us in the last three sessions alone fpis added \u003cFIVE_THOUSAND\u003e crore to their investments this sustained buying spree has been bolstered by improved market sentiment particularly after recent remarks from us federal reserve chair jerome powell who indicated that a rate cut could be forthcoming the european central bank ecb is anticipated to lower its rates by \u003cTWO_TEN\u003e basis points on thursday marking the first reduction since june when the possibility of a cut in september was still considered highly likely currently the ecbs main interest rate stands at \u003cTHREE_PERCENT\u003e reflecting the impact of several years of substantial rate increases the ecb s meeting comes just days ahead of the us federal reserve s september \u003cONE_TEN\u003e \u003cONE_TEN\u003e meeting at which it s expected to begin its own rate cutting cycle vinod nair head of research geojit financial services said the bulls took charge towards the end of the day and lifted the indices to a new high mirroring the bullish global trend the rate cut optimism across the globe ecb us fed has provided a positive impetus to the global market the subsequent leg of the rally will be influenced by the outcome of domestic inflation and iip data while the corporates core earnings are forecast to improve in q2 on a qoq basis rupak de senior technical analyst lkp securities said the nifty has broken out of its recent consolidation on the daily chart indicating a rise in optimism additionally the index has been sustaining above the critical \u003cTWO_TEN\u003e day ema a near term moving average the rsi on the daily chart shows a bullish crossover reinforcing the positive sentiment the trend is expected to remain strong as the index closed above the recent consolidation high on the upside the rally could potentially continue toward the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range while support is seen at \u003cTWO_TEN_THOUSAND\u003e","timestamp":"2024-09-12T15:15:00+05:30","market_timestamp":"2024-09-12T15:15:00+05:30","off_market_hours":false}