{"url":"https://www.livemint.com/market/stock-market-news/expert-view-smids-to-gain-from-rate-cuts-nifty-50-may-deliver-low-teen-return-baroda-bnp-paribas-mfs-jitendra-sriram-11726211423489.html","title":"Expert View: SMIDs to gain from rate cuts; Nifty 50 may deliver low-teen return: Baroda BNP Paribas MF’s Jitendra Sriram","description":"The leverage for the SMID space is usually higher, and they would be bigger beneficiaries of a rate-easing cycle as it gets underway, says Jitendra Sriram of Baroda BNP Paribas Mutual Fund.","content":"Smallcap and midcap stocks are likely to be the bigger beneficiaries of interest rate easing cycle and investors’ interest in this space may rise as earnings growth comes back, says Jitendra Sriram, Senior Fund Manager, Baroda BNP Paribas Mutual Fund. In an interview with Livemint, Sriram said he expects Nifty 50 to deliver low-teen returns from a one year perspective.Sriram shares his views on the resilience of Indian markets, key growth triggers and sectoral opportunities, and also discusses the building front in the SME IPO market. Here are edited excerpts:India has been a haven for growth in a global environment where growth is faltering across the European Union (EU), the US, and China. This has been one key reason why we are witnessing India eliciting investor interest. With growth rates likely to remain around the 7% mark, this is a powerful long-term propellant for Indian markets.In addition, over the medium term, the cost of capital dynamics is also playing well for India. India’s entry into the bond indices, coupled with the government targeting a steady lowering of the fiscal deficit, means that sovereign borrowing costs should head southwards. This would make the cost of capital dynamics incrementally positive.In the short term, a normal monsoon and certain favourable tax treatment on stock buybacks up to September 30, 2024, are added triggers. From a structure perspective, the rising share of domestic money arising from SIPs, retiral savings, etc., means that there is now a meaningful counterweight to foreign flows, which should reduce the volatility for Indian markets.Valuation always needs to be seen in the context of growth and costs of capital. As mentioned earlier, growth has been resilient, and there are some potential triggers for a downward bias on the cost of capital. Valuations may be marginally higher than historical averages, but given the growth rates and the potential lower cost of capital ahead, we are not unduly worried. There are definitely certain pockets of exuberance in some areas of the market, but an active fund weighing the risk-return trade-off should be able to navigate these.From a risk perspective, geopolitics remains the big risk which could take the shape of either logistics disruptions, supply chain disruptions or spikes in crude prices. There is now way to predict this and one needs to wait and react to such events. Other than this, electoral cycles – one in the US and the second locally in the states of India could cause some volatility for markets.In our view, the commencement of a US rate easing cycle can lead to a pickup in discretionary spending, improving the outlook for the IT sector. A weak dollar also has ramifications for the commodity sectors (energy, metals etc). India is also nearing an inflection on its rate trajectory, and this could have a positive rub-off on parts of the BFSI space, such as NBFCs. Certain thematics such as quick commerce, tariff revisions in telecom, the bio-secure act in the US for pharma are positive.Certain performing sectors of the recent past, such as industrials or utilities, may need to deliver on their backlogs as the focus is now increasingly on execution rather than order wins. Commodity chemicals may be another area where Chinese supplies are playing truant.In our view, the large-cap space is fairly reasonable, while the SMID (small and mid-cap) space may undergo either a time correction for earnings to catch up or a price correction to adjust for slower earnings in 1H. Electoral dynamics have led to lower government spending in 1H, which should pick up in 2H, leading to some perk-up/acceleration in earnings.From a near-term perspective, over the next 1-2 quarters, we prefer the large-cap space. As earnings come back on track for the SMID segments, interest levels should also be back up for this space. Investors looking beyond a quarter can surely take a look at these segments. Also, the leverage for the SMID space is usually higher, and they would be bigger beneficiaries of a rate-easing cycle as it gets underway.A general thumb rule has usually been that a soft dollar is usually better for flows to emerging markets, India is no exception. As the US moves into its rate easing, we expect trade to play itself out. India may be marginally more expensive than its peers in emerging markets, but its growth is also stronger. Further, India has a wide variety of sectors on offer compared to most EM’s, which are either commodity-heavy or heavily skewed towards certain sectors such as foundries in Taiwan.We expect the foreign flow to remain buoyant in the hunt for growth, but one must realise that just as Indian money is changing colour (emergence of NPS, provident funds, etc.), foreign money is also changing colour with more private equity, venture funds, etc. at play as compared to a decade back.We have always evaluated each IPO on its individual merits and typically our subscription rate would be 1 out of 4-5 IPOs. None of our funds invest in the SME segment but to answer your question, there does appear to be some froth in the space which even the regulator has been raising voices on. We would advise investors to do their due diligence prior to investing in such areas rather than follow a herd instinct like the Pied piper of Hamelin.This is a difficult question to answer. Investors' risk appetite and need for cash at points in time are varied, and it is not a case of one solution that suits all. In our view a financial planner with a line of sight on such requirements is better placed to advise on this. From a risk management perspective, we believe that within equity, one should have a mix of low volatility products like a large cap or a consumption product blended with a combination of higher volatility (mid and small cap and thematics) for better risk-adjusted return. The proportion will vary with age, investment needs, etc.From a one-year standpoint, we believe that the Nifty 50 should be able to deliver a low teen return from here. This is based on the current anticipated earnings growth.India is a structural growth story. A combination of favourable demographics, conducive government policies (Make in India, Aatmanirbhar Bharat, PLI schemes etc) and a structural longer-term move to a lower cost of capital augurs well for our markets. Do remember, markets are never linear, and you will have volatilities arising from crude price movements, global events, vagaries of monsoons, etc, but in the longer term, the markets are great compounders.","cleaned_content":"smallcap and midcap stocks are likely to be the bigger beneficiaries of interest rate easing cycle and investors interest in this space may rise as earnings growth comes back says jitendra sriram senior fund manager baroda bnp paribas mutual fund in an interview with livemint sriram said he expects nifty \u003cFIVE_TEN\u003e to deliver low teen returns from a one year perspective sriram shares his views on the resilience of indian markets key growth triggers and sectoral opportunities and also discusses the building front in the sme ipo market here are edited excerpts india has been a haven for growth in a global environment where growth is faltering across the european union eu the us and china this has been one key reason why we are witnessing india eliciting investor interest with growth rates likely to remain around the \u003cSEVEN_PERCENT\u003e mark this is a powerful long term propellant for indian markets in addition over the medium term the cost of capital dynamics is also playing well for india india s entry into the bond indices coupled with the government targeting a steady lowering of the fiscal deficit means that sovereign borrowing costs should head southwards this would make the cost of capital dynamics incrementally positive in the short term a normal monsoon and certain favourable tax treatment on stock buybacks up to september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e are added triggers from a structure perspective the rising share of domestic money arising from sips retiral savings etc means that there is now a meaningful counterweight to foreign flows which should reduce the volatility for indian markets valuation always needs to be seen in the context of growth and costs of capital as mentioned earlier growth has been resilient and there are some potential triggers for a downward bias on the cost of capital valuations may be marginally higher than historical averages but given the growth rates and the potential lower cost of capital ahead we are not unduly worried there are definitely certain pockets of exuberance in some areas of the market but an active fund weighing the risk return trade off should be able to navigate these from a risk perspective geopolitics remains the big risk which could take the shape of either logistics disruptions supply chain disruptions or spikes in crude prices there is now way to predict this and one needs to wait and react to such events other than this electoral cycles one in the us and the second locally in the states of india could cause some volatility for markets in our view the commencement of a us rate easing cycle can lead to a pickup in discretionary spending improving the outlook for the it sector a weak dollar also has ramifications for the commodity sectors energy metals etc india is also nearing an inflection on its rate trajectory and this could have a positive rub off on parts of the bfsi space such as nbfcs certain thematics such as quick commerce tariff revisions in telecom the bio secure act in the us for pharma are positive certain performing sectors of the recent past such as industrials or utilities may need to deliver on their backlogs as the focus is now increasingly on execution rather than order wins commodity chemicals may be another area where chinese supplies are playing truant in our view the large cap space is fairly reasonable while the smid small and mid cap space may undergo either a time correction for earnings to catch up or a price correction to adjust for slower earnings in \u003cONE_\u003e h electoral dynamics have led to lower government spending in \u003cONE_\u003e h which should pick up in \u003cTWO_\u003e h leading to some perk up acceleration in earnings from a near term perspective over the next \u003cONE_\u003e \u003cTWO_\u003e quarters we prefer the large cap space as earnings come back on track for the smid segments interest levels should also be back up for this space investors looking beyond a quarter can surely take a look at these segments also the leverage for the smid space is usually higher and they would be bigger beneficiaries of a rate easing cycle as it gets underway a general thumb rule has usually been that a soft dollar is usually better for flows to emerging markets india is no exception as the us moves into its rate easing we expect trade to play itself out india may be marginally more expensive than its peers in emerging markets but its growth is also stronger further india has a wide variety of sectors on offer compared to most em s which are either commodity heavy or heavily skewed towards certain sectors such as foundries in taiwan we expect the foreign flow to remain buoyant in the hunt for growth but one must realise that just as indian money is changing colour emergence of nps provident funds etc foreign money is also changing colour with more private equity venture funds etc at play as compared to a decade back we have always evaluated each ipo on its individual merits and typically our subscription rate would be \u003cONE_\u003e out of \u003cFOUR_\u003e \u003cFIVE_\u003e ipos none of our funds invest in the sme segment but to answer your question there does appear to be some froth in the space which even the regulator has been raising voices on we would advise investors to do their due diligence prior to investing in such areas rather than follow a herd instinct like the pied piper of hamelin this is a difficult question to answer investors risk appetite and need for cash at points in time are varied and it is not a case of one solution that suits all in our view a financial planner with a line of sight on such requirements is better placed to advise on this from a risk management perspective we believe that within equity one should have a mix of low volatility products like a large cap or a consumption product blended with a combination of higher volatility mid and small cap and thematics for better risk adjusted return the proportion will vary with age investment needs etc from a one year standpoint we believe that the nifty \u003cFIVE_TEN\u003e should be able to deliver a low teen return from here this is based on the current anticipated earnings growth india is a structural growth story a combination of favourable demographics conducive government policies make in india aatmanirbhar bharat pli schemes etc and a structural longer term move to a lower cost of capital augurs well for our markets do remember markets are never linear and you will have volatilities arising from crude price movements global events vagaries of monsoons etc but in the longer term the markets are great compounders","timestamp":"2024-09-13T13:07:00+05:30","market_timestamp":"2024-09-13T13:07:00+05:30","off_market_hours":false}