{"url":"https://www.livemint.com/market/stock-market-news/rs-5-dividend-1-1-bonus-rites-stock-in-focus-as-shares-trade-ex-bonus-and-ex-dividend-today-11726800576181.html","title":"₹5 dividend, 1:1 Bonus: RITES stock in focus as shares trade Ex-Bonus and Ex Dividend today","description":"Dividend stock: RITES share price will remain in focus on Friday as will trade Ex-Bonus, Ex-Dividend. The record date for being eligible for receiving 1:1 Bonus shares and Dividend of  ₹5 per share stood at Friday, 20th September, 2024","content":"Dividend stock: RITES ltd share price will remain in focus on Friday as will trade Ex Bonus and Ex Dividend today. The record date for being eligible for bonus of 1:1 and Dividend of  ₹5 per share stands at on Friday. 20 September 2024. The investors thereby were required to purchase RITES Ltd shares at least one day earlier i.e 19 September 2024 so that their names would appear in the shareholders list by 20 September, 2024, for being eligible for Bonus and Dividend .As Per RITES Ltd release on the Exchanges the Dividend was to be paid to those shareholders whose name appear in the Register of Members of the Company and to those shareholders whose name appears in the Statements of beneficial ownership furnished by NSDL and CDSL at the end of business hours on Friday, 20th September, 2024 (“Record Date”).The record date of 20th September, 2024 also stood for being eleigible for Bonus Shares. Rites Ltd had approved 1:1 Bonus Issue of One (1) Equity Share of Rs. 10/- each fully paid-up for every One (1) existing Equity Shares of Rs.10/- each fully paid-upRites Ltd share price has remained in focus on various developments in September. Rites Ltd had announced on 4th September 2024cits tie up with NBCC for Consultancy works. RITES Ltd , a prime transport infrastructure consultancy had signed a Memorandum of Understanding (MoU) with NBCC (India) Ltd., a CPSE under the Ministry of Housing Development, to explore and undertake a comprehensive range of consultancy, fee-based projects, and EPC contracts from concept to commissioning.RITES Ltd also had emerged as the Lowest Bidder (L-1) in tender floated by UP State Bridge Corporation Limited. RITES will be providing Consultancy Services for Construction of Civil works (CSC) for supervision, Monitoring, Quality Control and Work Zone Safety for Construction of Bridges, Rail Over/Under Bridges, Flyovers and Elevated Roads including approaches in several districts. The estimated value of the bid is Rs. 60.03 Crore plus GST.","cleaned_content":"dividend stock rites ltd share price will remain in focus on friday as will trade ex bonus and ex dividend today the record date for being eligible for bonus of \u003cONE_\u003e \u003cONE_\u003e and dividend of \u003cFIVE_\u003e per share stands at on friday \u003cTWO_TEN\u003e september \u003cTWO_THOUSAND\u003e the investors thereby were required to purchase rites ltd shares at least one day earlier i e \u003cONE_TEN\u003e september \u003cTWO_THOUSAND\u003e so that their names would appear in the shareholders list by \u003cTWO_TEN\u003e september \u003cTWO_THOUSAND\u003e for being eligible for bonus and dividend as per rites ltd release on the exchanges the dividend was to be paid to those shareholders whose name appear in the register of members of the company and to those shareholders whose name appears in the statements of beneficial ownership furnished by nsdl and cdsl at the end of business hours on friday \u003cTWO_TEN\u003e th september \u003cTWO_THOUSAND\u003e record date the record date of \u003cTWO_TEN\u003e th september \u003cTWO_THOUSAND\u003e also stood for being eleigible for bonus shares rites ltd had approved \u003cONE_\u003e \u003cONE_\u003e bonus issue of one \u003cONE_\u003e equity share of rs \u003cONE_TEN\u003e each fully paid up for every one \u003cONE_\u003e existing equity shares of rs 10 each fully paid uprites ltd share price has remained in focus on various developments in september rites ltd had announced on \u003cFOUR_\u003e th september \u003cTWO_THOUSAND\u003e cits tie up with nbcc for consultancy works rites ltd a prime transport infrastructure consultancy had signed a memorandum of understanding mou with nbcc india ltd a cpse under the ministry of housing development to explore and undertake a comprehensive range of consultancy fee based projects and epc contracts from concept to commissioning rites ltd also had emerged as the lowest bidder l \u003cONE_\u003e in tender floated by up state bridge corporation limited rites will be providing consultancy services for construction of civil works csc for supervision monitoring quality control and work zone safety for construction of bridges rail over under bridges flyovers and elevated roads including approaches in several districts the estimated value of the bid is rs \u003cSIX_TEN\u003e crore plus gst","timestamp":"2024-09-20T09:04:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}