{"url":"https://www.livemint.com/market/stock-market-news/centrum-broking-initiates-coverage-on-wealth-management-sees-upside-in-nuvama-wealth-downside-in-360-one-wam-11726741822400.html","title":"Centrum Broking initiates coverage on wealth management, sees upside in Nuvama Wealth, downside in 360 One WAM","description":"Centrum Broking has initiated coverage on the wealth management sector, issuing a REDUCE rating for 360 One WAM and Nuvama Wealth. Target prices are  ₹1,050 and  ₹7,180, respectively, reflecting downsides for both amid a growing market for wealth management in India.","content":"Domestic brokerage house Centrum Broking has initiated coverage on the wealth management industry with two reduced calls on – 360 One WAM and Nuvama Wealth.The brokerage has a target price of  ₹1,050 for 360 One, implying a downside of around 3 per cent, whereas for Nuvama, it has a target of  ₹7,180, indicating an upside of almost 8 per cent.In its report, Centrum Broking noted that the segment of wealthy Indians, particularly those earning over  ₹5 crore annually, has been expanding recently. Notably, only 15% of financial wealth in India is managed professionally, compared to 75% in mature markets, indicating a significant opportunity for wealth management firms. It informed that the combined financial assets of High Net-Worth Individuals (HNI) and Ultra High Net-Worth Individuals (UHNI) will increase from $1.2 trillion in 2023 to $2.2 trillion by 2028.Moreover, the brokerage highlighted that the mutual fund (MF) industry has demonstrated strong growth, with a 19 per cent compound annual growth rate (CAGR) in Quarterly Average Assets Under Management (QAAUM) from FY15 to FY24, reaching  ₹54 lakh crore. The Alternative Investment Fund (AIF) industry has grown considerably, with average incremental investments of  ₹60,000 crore over the last five years. Total commitments amounted to  ₹11.3 lakh crore, with  ₹4 lakh crore invested by the end of FY24, and funds raised totalled  ₹4.5 lakh crore.Centrum also noted that SIP (Systematic Investment Plan) inflows have shown impressive growth, reaching Rs166 billion in FY24, up from  ₹3,700 crore in FY17. The SIP Assets Under Management (AUM) surged to  ₹10.7 lakh crore in FY24, constituting 36 per cent of equity assets compared to 21 per cent ( ₹2 lakh crore) in FY18. Funds raised totalled  ₹4.5 lakh crore, with invested funds growing at a 30 per cent compound annual growth rate (CAGR) from FY19 to FY24. Additionally, Portfolio Management Services (PMS) AUM, excluding EPFO, grew at a 14 per cent CAGR over the same period, reaching  ₹9.2 lakh crore.Despite this positive outlook for both sectors, Centrum noted that recent increases in stock prices suggest limited upside potential in the near term.The brokerage stated that valuations appear stretched. They adopted a weighted approach to assess the coverage universe valuations based on various parameters. 360 One WAM, which underwent restructuring in FY20 by shifting from an upfront fee system to recurring trail income, has established a robust business model with unique propositions that facilitated decent net flows in recent years. Given the recent increase in stock prices, the brokerage initiates a REDUCE rating for 360 One WAM with a target price of  ₹1,050, which is a 10 per cent premium to the +1 standard deviation from the long-term mean, equating to a 33x September 2026 estimated EPS.In contrast, Nuvama Wealth has developed a diversified model with a strong focus on wealth management and maintains a significant presence in the capital markets. The brokerage values Nuvama Wealth at a 25x September 2026 estimated EPS, representing a 30 per cent discount to 360 One WAM. Consequently, the brokerage initiates coverage on Nuvama Wealth with a target price of  ₹7,180 and assigns a REDUCE rating.360 One WAM: The brokerage said 360 One WAM boasts a robust business model focusing on recurring income. The company currently manages  ₹2.2 lakh crore in active ARR AUM, which is expected to grow to  ₹3.8 lakh crore by FY27E. Revenue is projected to rise at a 15 per cent CAGR, reaching  ₹3000 crore by FY27. Yields are anticipated to stay around 70 basis points, with margins expected to improve further; ROAA is forecasted to increase to 6.6 per cent and ROAE to 31.0 per cent by FY27E.Despite these positive indicators, the brokerage noted that the stock has doubled in the past year. They have initiated coverage with a REDUCE rating, citing concerns over the stock's recent performance and high valuation. Net profit is expected to grow at a 17 per cent CAGR over FY24-27E, driven by a 24 per cent CAGR in active ARR AUM.Nuvama Wealth: The brokerage said that Nuvama Wealth is a diversified player focusing on HNI and UHNI wealth management and has a strong presence in the capital markets. Despite its nascent AMC business, the brokerage forecasts a 17 per cent CAGR in AUM to  ₹5.5 lakh crore over FY24-27 and a 21 per cent CAGR in revenue to  ₹36 billion. Yield (excluding capital markets) will remain around 55 basis points. The C/I ratio is anticipated to improve from 62 per cent in FY24 to 59 per cent in FY27, resulting in a 23 per cent CAGR in net profit to  ₹1100 crore.The brokerage initiates coverage with a REDUCE rating, valuing the stock at 25x September 2026 EPS with a target price of  ₹7,180. Although the capital markets division saw a 64 per cent year-on-year revenue growth to  ₹800 crore in FY24, it has experienced a lower 17 per cent CAGR from FY21-24. AUM grew at a 50 per cent CAGR to  ₹912 billion, with a 109 per cent year-on-year increase in FY24. PBT is expected to grow at a 20 per cent CAGR to  ₹660 crore. The stock is trading at 24x September 2026 EPS, with the REDUCE rating reflecting risks such as slower AUM growth and attrition.","cleaned_content":"domestic brokerage house centrum broking has initiated coverage on the wealth management industry with two reduced calls on \u003cTHREE_HUNDRED\u003e one wam and nuvama wealth the brokerage has a target price of \u003cONE_THOUSAND\u003e for \u003cTHREE_HUNDRED\u003e one implying a downside of around \u003cTHREE_PERCENT\u003e whereas for nuvama it has a target of \u003cSEVEN_THOUSAND\u003e indicating an upside of almost \u003cEIGHT_PERCENT\u003e in its report centrum broking noted that the segment of wealthy indians particularly those earning over \u003cFIVE_\u003e crore annually has been expanding recently notably only \u003cONE_TEN_PERCENT\u003e of financial wealth in india is managed professionally compared to \u003cSEVEN_TEN_PERCENT\u003e in mature markets indicating a significant opportunity for wealth management firms it informed that the combined financial assets of high net worth individuals hni and ultra high net worth individuals uhni will increase from \u003cONE_\u003e trillion in \u003cTWO_THOUSAND\u003e to \u003cTWO_\u003e trillion by \u003cTWO_THOUSAND\u003e moreover the brokerage highlighted that the mutual fund mf industry has demonstrated strong growth with a \u003cONE_TEN_PERCENT\u003e compound annual growth rate cagr in quarterly average assets under management qaaum from fy15 to fy24 reaching \u003cFIVE_TEN\u003e lakh crore the alternative investment fund aif industry has grown considerably with average incremental investments of \u003cSIX_TEN_THOUSAND\u003e crore over the last five years total commitments amounted to \u003cONE_TEN\u003e lakh crore with \u003cFOUR_\u003e lakh crore invested by the end of fy24 and funds raised totalled \u003cFOUR_\u003e lakh crore centrum also noted that sip systematic investment plan inflows have shown impressive growth reaching rs166 billion in fy24 up from \u003cTHREE_THOUSAND\u003e crore in fy17 the sip assets under management aum surged to \u003cONE_TEN\u003e lakh crore in fy24 constituting \u003cTHREE_TEN_PERCENT\u003e of equity assets compared to \u003cTWO_TEN_PERCENT\u003e \u003cTWO_\u003e lakh crore in fy18 funds raised totalled \u003cFOUR_\u003e lakh crore with invested funds growing at a \u003cTHREE_TEN_PERCENT\u003e compound annual growth rate cagr from fy19 to fy24 additionally portfolio management services pms aum excluding epfo grew at a \u003cONE_TEN_PERCENT\u003e cagr over the same period reaching \u003cNINE_\u003e lakh crore despite this positive outlook for both sectors centrum noted that recent increases in stock prices suggest limited upside potential in the near term the brokerage stated that valuations appear stretched they adopted a weighted approach to assess the coverage universe valuations based on various parameters \u003cTHREE_HUNDRED\u003e one wam which underwent restructuring in fy20 by shifting from an upfront fee system to recurring trail income has established a robust business model with unique propositions that facilitated decent net flows in recent years given the recent increase in stock prices the brokerage initiates a reduce rating for \u003cTHREE_HUNDRED\u003e one wam with a target price of \u003cONE_THOUSAND\u003e which is a \u003cONE_TEN_PERCENT\u003e premium to the \u003cONE_\u003e standard deviation from the long term mean equating to a \u003cTHREE_TEN\u003e x september \u003cTWO_THOUSAND\u003e estimated eps in contrast nuvama wealth has developed a diversified model with a strong focus on wealth management and maintains a significant presence in the capital markets the brokerage values nuvama wealth at a \u003cTWO_TEN\u003e x september \u003cTWO_THOUSAND\u003e estimated eps representing a \u003cTHREE_TEN_PERCENT\u003e discount to \u003cTHREE_HUNDRED\u003e one wam consequently the brokerage initiates coverage on nuvama wealth with a target price of \u003cSEVEN_THOUSAND\u003e and assigns a reduce rating 360 one wam the brokerage said \u003cTHREE_HUNDRED\u003e one wam boasts a robust business model focusing on recurring income the company currently manages \u003cTWO_\u003e lakh crore in active arr aum which is expected to grow to \u003cTHREE_\u003e lakh crore by fy27e revenue is projected to rise at a \u003cONE_TEN_PERCENT\u003e cagr reaching \u003cTHREE_THOUSAND\u003e crore by fy27 yields are anticipated to stay around \u003cSEVEN_TEN\u003e basis points with margins expected to improve further roaa is forecasted to increase to \u003cSIX_PERCENT\u003e and roae to \u003cTHREE_TEN_PERCENT\u003e by fy27e despite these positive indicators the brokerage noted that the stock has doubled in the past year they have initiated coverage with a reduce rating citing concerns over the stocks recent performance and high valuation net profit is expected to grow at a \u003cONE_TEN_PERCENT\u003e cagr over fy24 \u003cTWO_TEN\u003e e driven by a \u003cTWO_TEN_PERCENT\u003e cagr in active arr aum nuvama wealth the brokerage said that nuvama wealth is a diversified player focusing on hni and uhni wealth management and has a strong presence in the capital markets despite its nascent amc business the brokerage forecasts a \u003cONE_TEN_PERCENT\u003e cagr in aum to \u003cFIVE_\u003e lakh crore over fy24 \u003cTWO_TEN\u003e and a \u003cTWO_TEN_PERCENT\u003e cagr in revenue to \u003cTHREE_TEN\u003e billion yield excluding capital markets will remain around \u003cFIVE_TEN\u003e basis points the c i ratio is anticipated to improve from \u003cSIX_TEN_PERCENT\u003e in fy24 to \u003cFIVE_TEN_PERCENT\u003e in fy27 resulting in a \u003cTWO_TEN_PERCENT\u003e cagr in net profit to \u003cONE_THOUSAND\u003e crore the brokerage initiates coverage with a reduce rating valuing the stock at \u003cTWO_TEN\u003e x september \u003cTWO_THOUSAND\u003e eps with a target price of \u003cSEVEN_THOUSAND\u003e although the capital markets division saw a \u003cSIX_TEN_PERCENT\u003e year on year revenue growth to \u003cEIGHT_HUNDRED\u003e crore in fy24 it has experienced a lower \u003cONE_TEN_PERCENT\u003e cagr from fy21 \u003cTWO_TEN\u003e aum grew at a \u003cFIVE_TEN_PERCENT\u003e cagr to \u003cNINE_HUNDRED\u003e billion with a \u003cONE_HUNDRED_PERCENT\u003e year on year increase in fy24 pbt is expected to grow at a \u003cTWO_TEN_PERCENT\u003e cagr to \u003cSIX_HUNDRED\u003e crore the stock is trading at \u003cTWO_TEN\u003e x september \u003cTWO_THOUSAND\u003e eps with the reduce rating reflecting risks such as slower aum growth and attrition","timestamp":"2024-09-19T16:52:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}