{"url":"https://www.livemint.com/market/stock-market-news/oil-heads-for-first-weekly-gain-in-a-month-after-storm-francine-11726251318303.html","title":"Oil Heads for First Weekly Gain in a Month After Storm Francine","description":"Oil headed for its first weekly advance in a month after Storm Francine disrupted crude production and risk-on sentiment bolstered across wider markets, helping ease a previously oversold crude market.","content":"Oil headed for its first weekly advance in a month after Storm Francine disrupted crude production and risk-on sentiment bolstered across wider markets, helping ease a previously oversold crude market.West Texas Intermediate was little changed at around $69 a barrel, giving up its earlier gains after some operations restarted in the Gulf of Mexico following the passing of Storm Francine. The earlier rebound had mostly been driven by covering of extreme bearish positioning after prices settled below $66 on Tuesday, the lowest closing price since December 2021.Francine — which weakened from its previous hurricane force — had shut down a sizable amount of production in the Gulf of Mexico, but some companies including Shell Plc have resolved downstream issues and are reviving output. In broader markets, equities came off their highs for the day.WTI remains about 15% lower this quarter on concerns about slumping demand, particularly in top importer China. The International Energy Agency said global consumption growth in the first half was the lowest since the pandemic as China’s economy cooled. Against that backdrop, producer cartel OPEC has deferred a plan to relax supply curbs and Libyan oil flows have continued to slump.“The market is not without upside potential, given recent strife in Libya and a series of geopolitical distortions in recent years,” Macquarie analysts including Marcus Garvey and Vikas Dwivedi said in a note. “We forecast a heavy surplus, as non-OPEC supply growth and sluggish demand will limit the market’s need for OPEC to return barrels as planned.”The US Federal Reserve is widely expected to start cutting US interest rates at its meeting next week after signs of a labor market slowdown emerged, and traders are boosting bets that policymakers will opt for a 50-basis-point reduction. Lower borrowing costs may support growth and increase energy demand.To get Bloomberg’s Energy Daily newsletter into your inbox, click here.With assistance from Yongchang Chin.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"oil headed for its first weekly advance in a month after storm francine disrupted crude production and risk on sentiment bolstered across wider markets helping ease a previously oversold crude market west texas intermediate was little changed at around \u003cSIX_TEN\u003e a barrel giving up its earlier gains after some operations restarted in the gulf of mexico following the passing of storm francine the earlier rebound had mostly been driven by covering of extreme bearish positioning after prices settled below \u003cSIX_TEN\u003e on tuesday the lowest closing price since december \u003cTWO_THOUSAND\u003e francine which weakened from its previous hurricane force had shut down a sizable amount of production in the gulf of mexico but some companies including shell plc have resolved downstream issues and are reviving output in broader markets equities came off their highs for the day wti remains about \u003cONE_TEN_PERCENT\u003e lower this quarter on concerns about slumping demand particularly in top importer china the international energy agency said global consumption growth in the first half was the lowest since the pandemic as china s economy cooled against that backdrop producer cartel opec has deferred a plan to relax supply curbs and libyan oil flows have continued to slump the market is not without upside potential given recent strife in libya and a series of geopolitical distortions in recent years macquarie analysts including marcus garvey and vikas dwivedi said in a note we forecast a heavy surplus as non opec supply growth and sluggish demand will limit the market s need for opec to return barrels as planned the us federal reserve is widely expected to start cutting us interest rates at its meeting next week after signs of a labor market slowdown emerged and traders are boosting bets that policymakers will opt for a \u003cFIVE_TEN\u003e basis point reduction lower borrowing costs may support growth and increase energy demand to get bloomberg s energy daily newsletter into your inbox click here with assistance from yongchang chin this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-13T23:45:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}