{"url":"https://www.livemint.com/market/stock-market-news/zee-share-price-rallies-over-3-as-nclt-approves-recall-of-merger-scheme-with-sony-pictures-bangla-entertainment-11726201789961.html","title":"ZEE share price rallies over 3% as NCLT approves recall of merger scheme with Sony Pictures, Bangla Entertainment","description":"The National Company Law Tribunal (NCLT) has approved the recall of the merger order, allowing the company to withdraw the scheme, ZEE said in a regulatory filing on September 12.","content":"Zee Entertainment Enterprises Ltd. (ZEEL) share price rallied over 3% on Friday after the company said it received regulatory approval for the recall of merger with Culver Max Entertainment Pvt Ltd (formerly Sony Pictures Networks India) and Bangla Entertainment Pvt Ltd (BEPL). ZEE shares gained as much as 3.26% to  ₹139.15 apiece on the BSE.The National Company Law Tribunal (NCLT) has approved the recall of the merger order, allowing the company to withdraw the scheme, ZEE said in a regulatory filing on September 12.The NCLT approval marks the end of the legal battle over the merger.ZEE Entertainment Enterprises, Culver Max Entertainment and Bangla Entertainment on August 27 had announced a comprehensive non-cash settlement to withdraw the merger agreement and resolve all disputes. The companies entered into a merger agreement in August 2023.Zee-Sony merger had earlier received regulatory approvals, but the merger faced opposition from creditors and led to multiple legal disputes. This resulted in Sony terminating the merger agreement in January.Zee sought legal action, but both companies reached a settlement agreement in August.“Under the terms of the settlement, none of the parties will have any outstanding or continuing obligations or liabilities to the other. The settlement stems from a mutual understanding between the companies to independently pursue future growth opportunities with a renewed purpose and focus on the evolving media and entertainment landscape, signifying the definitive conclusion of all disputes,” Zee said.At 10:15 am Zee shares were trading 1.52% higher at  ₹136.80 apiece on the BSE.","cleaned_content":"zee entertainment enterprises ltd zeel share price rallied over \u003cTHREE_PERCENT\u003e on friday after the company said it received regulatory approval for the recall of merger with culver max entertainment pvt ltd formerly sony pictures networks india and bangla entertainment pvt ltd bepl zee shares gained as much as \u003cTHREE_PERCENT\u003e to \u003cONE_HUNDRED\u003e apiece on the bse the national company law tribunal nclt has approved the recall of the merger order allowing the company to withdraw the scheme zee said in a regulatory filing on september \u003cONE_TEN\u003e the nclt approval marks the end of the legal battle over the merger zee entertainment enterprises culver max entertainment and bangla entertainment on august \u003cTWO_TEN\u003e had announced a comprehensive non cash settlement to withdraw the merger agreement and resolve all disputes the companies entered into a merger agreement in august \u003cTWO_THOUSAND\u003e zee sony merger had earlier received regulatory approvals but the merger faced opposition from creditors and led to multiple legal disputes this resulted in sony terminating the merger agreement in january zee sought legal action but both companies reached a settlement agreement in august under the terms of the settlement none of the parties will have any outstanding or continuing obligations or liabilities to the other the settlement stems from a mutual understanding between the companies to independently pursue future growth opportunities with a renewed purpose and focus on the evolving media and entertainment landscape signifying the definitive conclusion of all disputes zee said at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am zee shares were trading \u003cONE_PERCENT\u003e higher at \u003cONE_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-13T10:17:00+05:30","market_timestamp":"2024-09-13T10:17:00+05:30","off_market_hours":false}