{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-wall-street-s-best-week-of-2024-closes-with-indexes-near-their-records-11726261708282.html","title":"Stock market today: Wall Street’s best week of 2024 closes with indexes near their records","description":"Stock market today: Wall Street’s best week of 2024 closes with indexes near their records","content":"NEW YORK — U.S. stocks closed out their best week of the year with more gains on Friday and climbed to the cusp of their records.The S\u0026P 500 rose 0.5% for a fifth straight gain and is just 0.7% below its all-time high set in July. Rallies for Microsoft, Broadcom and other big technology stocks helped it claw back almost all its losses from last week, which was its worst in nearly 18 months.The Dow Jones Industrial Average jumped 297 points, or 0.7%, and at one point got within 30 points of its record set last month. The Nasdaq composite added 0.7%.Uber Technologies helped drive the market higher with a gain of 6.4% after saying it will bring autonomous ride-hailing to Austin and Atlanta with Waymo early next year.Stocks also got support from the bond market, where Treasury yields eased ahead of next week’s meeting of the Federal Reserve. The unanimous expectation on Wall Street is for the Fed to deliver the first cut to interest rates in more than four years on Wednesday, and traders are rekindling hopes it may offer bigger-than-usual relief.The Federal Reserve has been keeping its main interest rate at a two-decade high in hopes of slowing the economy enough to stifle high inflation. With inflation having eased substantially from its peak two summers ago, the Fed has said it can turn more focus to bolstering the slowing job market and economy.How much to cut rates by will be a delicate balancing act for the Fed: Lowering them relieves pressure on the economy but can also give inflation more fuel. Reports earlier this week showed some underlying upward pressure may remain on inflation, which initially pushed traders to ratchet back expectations for the size of the Fed’s upcoming move.On Friday, though, traders were seeing roughly a coin flip’s chance that the Fed could deliver a large cut of half of a percentage point, instead of the more traditional quarter of a point, according to data from CME Group. The federal funds rate is currently sitting in a range of 5.25% to 5.50%.“Right now, the equity market is keying off the toss-up” in the size of the Fed’s cut next week “and would probably be fine with either,” said Sameer Samana, senior global market strategist at Wells Fargo Investment Institute.“They care more about direction than magnitude, and rates falling should take pressure” off companies’ expenses and stock prices, he said.The yield on the 10-year Treasury eased to 3.65% from 3.68% late Thursday. The two-year yield, which more closely tracks expectations for Fed action, fell more sharply to 3.58% from 3.65%.On Wall Street, home-furnishings company RH jumped 25.5% after reporting stronger profit and revenue for the latest quarter than expected. The company said demand has been gaining momentum each month “despite operating in the most challenging housing market in three decades.”The housing market has been contending with high mortgage rates, though they’ve been easing since the spring on expectations for coming rate cuts. Shoppers have also generally been beaten down as prices continue to rise across the economy, though a preliminary reading on U.S. consumer sentiment on Friday came in better than economists expected.Oracle pared a big early gain to inch up 0.4% after giving long-term financial forecasts that analysts said topped their expectations. That brought the software company’s gain to 14.3% for the week, which it began with a better-than-expected profit report for the latest quarter.Technology stocks were generally the market’s main drivers this week, particularly Nvidia and other big technology stocks that struggled earlier this summer on concerns their prices had shot too high in the frenzy around artificial intelligence. Nvidia rallied 15.8% over the week despite slipping 0.1% on Friday.On the losing end of Wall Street Friday was Boeing, which lost 3.7% as aircraft assembly workers walked off the job. Union members voted overwhelmingly to go on strike and reject the troubled aerospace giant’s tentative contract that would have increased wages by 25% over four years.Adobe fell 8.5%, even though the company also reported better profit for the latest quarter than expected. Analysts said investors were more focused on its financial forecasts for the current quarter, where some trends looked to be falling short of expectations.All told, the S\u0026P 500 rose 30.26 points to 5,626.02. The Dow gained 297.01 to 41,393.78, and the Nasdaq composite added 114.30 to 17,683.98.In stock markets abroad, indexes rose in Europe after finishing mixed in Asia.Writers Matt Ott and Zimo Zhong contributed.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"new york u s stocks closed out their best week of the year with more gains on friday and climbed to the cusp of their records the s p \u003cFIVE_HUNDRED\u003e rose \u003cZERO_PERCENT\u003e for a fifth straight gain and is just \u003cZERO_PERCENT\u003e below its all time high set in july rallies for microsoft broadcom and other big technology stocks helped it claw back almost all its losses from last week which was its worst in nearly \u003cONE_TEN\u003e months the dow jones industrial average jumped \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e and at one point got within \u003cTHREE_TEN\u003e points of its record set last month the nasdaq composite added \u003cZERO_PERCENT\u003e uber technologies helped drive the market higher with a gain of \u003cSIX_PERCENT\u003e after saying it will bring autonomous ride hailing to austin and atlanta with waymo early next year stocks also got support from the bond market where treasury yields eased ahead of next week s meeting of the federal reserve the unanimous expectation on wall street is for the fed to deliver the first cut to interest rates in more than four years on wednesday and traders are rekindling hopes it may offer bigger than usual relief the federal reserve has been keeping its main interest rate at a two decade high in hopes of slowing the economy enough to stifle high inflation with inflation having eased substantially from its peak two summers ago the fed has said it can turn more focus to bolstering the slowing job market and economy how much to cut rates by will be a delicate balancing act for the fed lowering them relieves pressure on the economy but can also give inflation more fuel reports earlier this week showed some underlying upward pressure may remain on inflation which initially pushed traders to ratchet back expectations for the size of the fed s upcoming move on friday though traders were seeing roughly a coin flip s chance that the fed could deliver a large cut of half of a percentage point instead of the more traditional quarter of a point according to data from cme group the federal funds rate is currently sitting in a range of \u003cFIVE_PERCENT\u003e to \u003cFIVE_PERCENT\u003e right now the equity market is keying off the toss up in the size of the fed s cut next week and would probably be fine with either said sameer samana senior global market strategist at wells fargo investment institute they care more about direction than magnitude and rates falling should take pressure off companies expenses and stock prices he said the yield on the \u003cONE_TEN\u003e year treasury eased to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e late thursday the two year yield which more closely tracks expectations for fed action fell more sharply to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e on wall street home furnishings company rh jumped \u003cTWO_TEN_PERCENT\u003e after reporting stronger profit and revenue for the latest quarter than expected the company said demand has been gaining momentum each month despite operating in the most challenging housing market in three decades the housing market has been contending with high mortgage rates though they ve been easing since the spring on expectations for coming rate cuts shoppers have also generally been beaten down as prices continue to rise across the economy though a preliminary reading on u s consumer sentiment on friday came in better than economists expected oracle pared a big early gain to inch up \u003cZERO_PERCENT\u003e after giving long term financial forecasts that analysts said topped their expectations that brought the software company s gain to \u003cONE_TEN_PERCENT\u003e for the week which it began with a better than expected profit report for the latest quarter technology stocks were generally the market s main drivers this week particularly nvidia and other big technology stocks that struggled earlier this summer on concerns their prices had shot too high in the frenzy around artificial intelligence nvidia rallied \u003cONE_TEN_PERCENT\u003e over the week despite slipping \u003cZERO_PERCENT\u003e on friday on the losing end of wall street friday was boeing which lost \u003cTHREE_PERCENT\u003e as aircraft assembly workers walked off the job union members voted overwhelmingly to go on strike and reject the troubled aerospace giant s tentative contract that would have increased wages by \u003cTWO_TEN_PERCENT\u003e over four years adobe fell \u003cEIGHT_PERCENT\u003e even though the company also reported better profit for the latest quarter than expected analysts said investors were more focused on its financial forecasts for the current quarter where some trends looked to be falling short of expectations all told the s p \u003cFIVE_HUNDRED\u003e rose \u003cTHREE_TEN\u003e points to \u003cFIVE_THOUSAND\u003e the dow gained \u003cTWO_HUNDRED\u003e to \u003cFOUR_TEN_THOUSAND\u003e and the nasdaq composite added \u003cONE_HUNDRED\u003e to \u003cONE_TEN_THOUSAND\u003e in stock markets abroad indexes rose in europe after finishing mixed in asia writers matt ott and zimo zhong contributed this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-14T02:38:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}