{"url":"https://www.livemint.com/market/stock-market-news/why-is-money-not-credited-in-the-demat-account-after-squaring-off-position-on-friday-zerodhas-nithin-kamath-explains-11726469612740.html","title":"Why is money not credited to the demat account after squaring off position on Friday? Zerodha’s Nikhil Kamath explains","description":"Stock Market Today: Today is a settlement holiday, and thus, settlements of funds and stocks don't happen. Banks in Maharashtra are closed, but trading on exchanges is open, said Zerodha founder Nikhil Kamath in a tweet.","content":"Stock Market Today: Today is a settlement holiday, and thus, settlements of funds and stocks don't happen. This happens when banks in Maharashtra are closed, but trading on exchanges is open, said Zerodha founder Nikhil Kamath in a tweet.The banks are closed on account of Eid-e-Milad-un-Nabi on Monday.This explains why the money is not credited to the demat account after squaring off position on Friday.“Most brokers don't allow shares bought on Friday to be sold on Monday because of this,” said Zeodha founder Nikhil Kamath in a tweet.“We at @zerodhaonline are among the few brokers that allow you to sell stocks bought on Friday,” highlighted Kamath.“By the way, due to the settlement holiday, your equity intraday profit credits and F\u0026O credits aren't included in your trading balance or are not available for withdrawal today,” Kamath noted.Since the Eid-e-Milad holiday is shifted from September 16 to 18, there will be a settlement holiday on September 18 also. But September 16 continues to be a settlement holiday, the Zerodha founder added.The Maharashtra state government has shifted the Eid-e-Milad-un-Nabi holiday from Monday, September 16, to Wednesday, September 18. Nevertheless, the trading holiday decided earlier on the 16th remains a settlement holiday, whereas Wednesday will again be a settlement Holiday.Wednesday, October 2, 2024, on the account of Mahatma Gandhi Jayanti, when settlements will not be done for trades executed earlier on the NSE, BSE and MCX.Friday, November 1, 2024, also will be a settlement holiday on account of Diwali-Laxmi Pujan, when no settlement will be made for trades on the NSE and BSE.November will have another holiday as no settlements will be made on Friday, November 15, 2024, on account of Guru Nanak Jayanti. This will include trade settlements both on the NSE and BSEWednesday, December 25, 2024, Christmas will be the last settlement holiday of the year when settlements will not be done for trades executed earlier on the NSE , BSE and MCX.","cleaned_content":"stock market today today is a settlement holiday and thus settlements of funds and stocks dont happen this happens when banks in maharashtra are closed but trading on exchanges is open said zerodha founder nikhil kamath in a tweet the banks are closed on account of eid e milad un nabi on monday this explains why the money is not credited to the demat account after squaring off position on friday most brokers dont allow shares bought on friday to be sold on monday because of this said zeodha founder nikhil kamath in a tweet we at zerodhaonline are among the few brokers that allow you to sell stocks bought on friday highlighted kamath by the way due to the settlement holiday your equity intraday profit credits and f o credits arent included in your trading balance or are not available for withdrawal today kamath noted since the eid e milad holiday is shifted from september \u003cONE_TEN\u003e to \u003cONE_TEN\u003e there will be a settlement holiday on september \u003cONE_TEN\u003e also but september \u003cONE_TEN\u003e continues to be a settlement holiday the zerodha founder added the maharashtra state government has shifted the eid e milad un nabi holiday from monday september \u003cONE_TEN\u003e to wednesday september \u003cONE_TEN\u003e nevertheless the trading holiday decided earlier on the \u003cONE_TEN\u003e th remains a settlement holiday whereas wednesday will again be a settlement holiday wednesday october \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e on the account of mahatma gandhi jayanti when settlements will not be done for trades executed earlier on the nse bse and mcx friday november \u003cONE_\u003e \u003cTWO_THOUSAND\u003e also will be a settlement holiday on account of diwali laxmi pujan when no settlement will be made for trades on the nse and bse november will have another holiday as no settlements will be made on friday november \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e on account of guru nanak jayanti this will include trade settlements both on the nse and bsewednesday december \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e christmas will be the last settlement holiday of the year when settlements will not be done for trades executed earlier on the nse bse and mcx","timestamp":"2024-09-16T13:01:00+05:30","market_timestamp":"2024-09-16T13:01:00+05:30","off_market_hours":false}