{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-bajaj-housing-finance-zee-mazagon-dock-spicejet-and-more-11726421973648.html","title":"Stocks to Watch: Bajaj Housing Finance, Zee, Mazagon Dock, SpiceJet, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Bajaj Housing Finance: Bajaj Housing Finance shares will be listed on BSE and NSE on Monday, September 16. The IPO’s Gray Market Premium (GMP) surged to around  ₹79, signaling strong demand with a premium of over 100%.Zee: The Mumbai bench of the National Company Law Tribunal (NCLT) has revoked its earlier approval of the $10 billion merger between Zee Entertainment and Sony Pictures Networks India. According to a PTI report on September 14, the bench withdrew its August 10, 2023 order after both companies mutually agreed to settle the matter and withdraw the amalgamation scheme. The NCLT confirmed that the board of directors of both Zee and Sony had passed resolutions to terminate the merger.Oil India: State-run Oil India Ltd is looking to boost its refinery capacity in Assam to 180,000 barrels per day (bpd) by the fiscal year ending March 2027, as announced by Chairman Ranjit Rath. The company’s subsidiary, Numaligarh Refinery Ltd (NRL), is currently expanding its capacity from the existing 60,000 bpd and building a crude oil pipeline connecting the refinery to Paradip Port in Odisha.Reliance Capital: The National Company Law Appellate Tribunal (NCLAT) has issued a notice to IndusInd International Holdings Ltd (IIHL) following a plea from lenders of insolvent Reliance Capital. The lenders are seeking the forfeiture of  ₹2,750 crore in equity if the Hinduja Group company fails to implement the resolution plan. NCLAT has asked IIHL to respond within two weeks, with the case scheduled for a hearing on September 30. Lenders are requesting modifications to the July 23 NCLT order, which allowed IIHL to take over Reliance Capital for  ₹9,861 crore, amid disagreements over the plan's execution.Mazagon Dock: Mazagon Dock Shipbuilders declared a final dividend of  ₹12.11 per share for FY 2024, setting September 19, 2024, as the record date for its AGM. This announcement has garnered attention from shareholders and market analysts.SpiceJet: SpiceJet's members approved a special resolution to raise funds to strengthen its financial resources. However, its market share dropped to 2.3% in August, down from 3.1% in July.Phoenix Mills: Phoenix Mills has set September 21, 2024, as the record date for its bonus share issue, offering one bonus share for every existing share, subject to approval at its AGM on September 13, 2024.Sugar Stocks: The government has granted sugar mills and distilleries approval to produce rectified spirit and extra-neutral alcohol from sugarcane juice and B-heavy molasses. This move aims to increase production flexibility in ethanol and alcohol-based products, supporting diversification efforts within the sugar industry.Adani Green Energy \u0026 Adani Power: Maharashtra State Electricity Distribution Company (MSEDCL) has issued a Letter of Intent for a 6,600 MW hybrid solar and thermal power supply. Adani Green Energy will provide 5,000 MW from its Khavda solar project, while Adani Power will supply 1,496 MW from its ultra-supercritical thermal plant.Thermax: Thermax Ltd, an Indian clean air and energy solutions company, announced that its subsidiary, Thermax Babcock \u0026 Wilcox Energy Solutions, secured a repeat order for a 600 MW greenfield energy plant in Botswana. The order is valued at  ₹516 crore.","cleaned_content":"bajaj housing finance bajaj housing finance shares will be listed on bse and nse on monday september \u003cONE_TEN\u003e the ipo s gray market premium gmp surged to around \u003cSEVEN_TEN\u003e signaling strong demand with a premium of over \u003cONE_HUNDRED_PERCENT\u003e zee the mumbai bench of the national company law tribunal nclt has revoked its earlier approval of the \u003cONE_TEN\u003e billion merger between zee entertainment and sony pictures networks india according to a pti report on september \u003cONE_TEN\u003e the bench withdrew its august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e order after both companies mutually agreed to settle the matter and withdraw the amalgamation scheme the nclt confirmed that the board of directors of both zee and sony had passed resolutions to terminate the merger oil india state run oil india ltd is looking to boost its refinery capacity in assam to \u003cONE_HUNDRED_THOUSAND\u003e barrels per day bpd by the fiscal year ending march \u003cTWO_THOUSAND\u003e as announced by chairman ranjit rath the company s subsidiary numaligarh refinery ltd nrl is currently expanding its capacity from the existing \u003cSIX_TEN_THOUSAND\u003e bpd and building a crude oil pipeline connecting the refinery to paradip port in odisha reliance capital the national company law appellate tribunal nclat has issued a notice to indusind international holdings ltd iihl following a plea from lenders of insolvent reliance capital the lenders are seeking the forfeiture of \u003cTWO_THOUSAND\u003e crore in equity if the hinduja group company fails to implement the resolution plan nclat has asked iihl to respond within two weeks with the case scheduled for a hearing on september \u003cTHREE_TEN\u003e lenders are requesting modifications to the july \u003cTWO_TEN\u003e nclt order which allowed iihl to take over reliance capital for \u003cNINE_THOUSAND\u003e crore amid disagreements over the plans execution mazagon dock mazagon dock shipbuilders declared a final dividend of \u003cONE_TEN\u003e per share for fy \u003cTWO_THOUSAND\u003e setting september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date for its agm this announcement has garnered attention from shareholders and market analysts spicejet spicejets members approved a special resolution to raise funds to strengthen its financial resources however its market share dropped to \u003cTWO_PERCENT\u003e in august down from \u003cTHREE_PERCENT\u003e in july phoenix mills phoenix mills has set september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date for its bonus share issue offering one bonus share for every existing share subject to approval at its agm on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e sugar stocks the government has granted sugar mills and distilleries approval to produce rectified spirit and extra neutral alcohol from sugarcane juice and b heavy molasses this move aims to increase production flexibility in ethanol and alcohol based products supporting diversification efforts within the sugar industry adani green energy adani power maharashtra state electricity distribution company msedcl has issued a letter of intent for a \u003cSIX_THOUSAND\u003e mw hybrid solar and thermal power supply adani green energy will provide \u003cFIVE_THOUSAND\u003e mw from its khavda solar project while adani power will supply \u003cONE_THOUSAND\u003e mw from its ultra supercritical thermal plant thermax thermax ltd an indian clean air and energy solutions company announced that its subsidiary thermax babcock wilcox energy solutions secured a repeat order for a \u003cSIX_HUNDRED\u003e mw greenfield energy plant in botswana the order is valued at \u003cFIVE_HUNDRED\u003e crore","timestamp":"2024-09-16T08:22:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}