{"url":"https://www.livemint.com/market/stock-market-news/sown-28-from-peak-ambit-issues-sell-call-on-ola-electric-mobility-predicts-further-11-5-downside-11726132495555.html","title":"Ambit sees 11.5% downside in Ola Electric Mobility as stock falls 28% from peak, reiterates ‘sell’ call—key reasons why","description":"Ola Electric's stock has faced challenges post its August debut, dropping over 28 percent from its peak. Ambit initiated a 'sell' rating, citing competition and financial losses as key concerns. Despite growth prospects, market share is expected to decline, raising investor apprehensions.","content":"Shares of Ola Electric Mobility have garnered significant attention on Dalal Street since the company's debut, but recent developments have left the stock struggling. After a flat listing in August, the stock initially turned into a multibagger but has since lost momentum, particularly following the lock-in expiry of anchor investors.Ola Electric listed on August 9, 2024, at its issue price of  ₹76. In the following days, the stock surged over 107 percent to reach a record high of  ₹157.53 on August 20. However, since that peak, shares have dropped more than 28 percent, currently trading at  ₹113.Adding to the company's woes, domestic brokerage firm Ambit has initiated coverage of stock with a ‘sell’ rating, setting a target price of  ₹100. This represents a potential downside of 11.5 percent from the current levels.Despite its impressive growth trajectory, Ambit cited several risks associated with Ola Electric’s business model. The firm pointed out that the electric vehicle (EV) market in India is still in its early stages, and rising competition could pressure Ola Electric’s market share.\"We expect e-2W (electric two-wheeler) penetration to rise from 5.7 percent in FY25YTD to 23.5 percent by FY29, driven by e-motorcycle launches. The competitive landscape will evolve as existing e-2W players expand their portfolio and reach, with major brands like Honda and Suzuki expected to enter the e-2W market by Q4 FY25. This increased competition will likely reduce Ola's market share from 35 percent in FY24 to 27.5 percent by FY29, and further down to 25 percent by FY31,” Ambit stated.Despite these concerns, Ambit acknowledged Ola Electric’s unique position as the only e-2W player in India that manufactures key components like motors, battery management systems (BMS), and lithium-ion cells in-house while also owning its sales network.The brokerage also pointed out that Ola benefits from significant incentives, including some exclusive to the company. However, the firm emphasised that maintaining this competitive edge will require substantial capital expenditure (capex).Ambit also predicted that electric two-wheeler (e-2W) original equipment manufacturers (OEMs) would likely prioritise market share over margins in the coming years. The brokerage estimated Ola Electric’s volumes to grow from 3.30 lakh units in FY24 to 1 million units by FY27 and to 1.64 million units by FY29.Economies of scale and falling battery costs are expected to reduce the bill of materials (BOM) cost, improving the company’s gross margins to 26.1 percent by FY29. Additionally, operating leverage should help Ola Electric achieve EBITDA break-even by FY27.The stock's recent decline coincides with the end of the anchor lock-in period, which expired on September 6, 2024. This lock-in period had restricted 50 percent of Ola Electric shares, or approximately 18.18 crore shares, from trading. With the lock-in period now over, these shares are free to trade, which has contributed to the downward pressure on the stock.Ola Electric’s financial performance also adds to the concerns. The company reported a consolidated net loss of  ₹347 crore for the quarter ended June 30, 2024, widening nearly 30 percent year-on-year from  ₹267 crore in the same period last year.However, revenue from operations increased by 32.3 percent year-on-year to  ₹1,644 crore for the quarter. The company posted an EBITDA loss of  ₹205 crore for the reported quarter.While Ambit acknowledged that Ola Electric deserves a premium for its extensive coverage of the e-2W value chain, it warned that the company’s market share is expected to decline to 25 percent by FY31.\"The current valuation implies a compound annual growth rate (CAGR) of 36.3 percent in volumes from FY24 to FY35, slightly higher than our estimate, leaving little margin of safety against the risks,\" the brokerage added.The combination of a stock price decline, competitive pressures, and financial losses led to growing concerns among investors. As Ola Electric navigates these challenges, it will be critical for the company to sustain its growth while addressing the risks outlined by Ambit and other market observers.","cleaned_content":"shares of ola electric mobility have garnered significant attention on dalal street since the companys debut but recent developments have left the stock struggling after a flat listing in august the stock initially turned into a multibagger but has since lost momentum particularly following the lock in expiry of anchor investors ola electric listed on august \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e at its issue price of \u003cSEVEN_TEN\u003e in the following days the stock surged over \u003cONE_HUNDRED_PERCENT\u003e to reach a record high of \u003cONE_HUNDRED\u003e on august \u003cTWO_TEN\u003e however since that peak shares have dropped more than \u003cTWO_TEN_PERCENT\u003e currently trading at \u003cONE_HUNDRED\u003e adding to the companys woes domestic brokerage firm ambit has initiated coverage of stock with a sell rating setting a target price of \u003cONE_HUNDRED\u003e this represents a potential downside of \u003cONE_TEN_PERCENT\u003e from the current levels despite its impressive growth trajectory ambit cited several risks associated with ola electric s business model the firm pointed out that the electric vehicle ev market in india is still in its early stages and rising competition could pressure ola electric s market share we expect e \u003cTWO_\u003e w electric two wheeler penetration to rise from \u003cFIVE_PERCENT\u003e in fy25ytd to \u003cTWO_TEN_PERCENT\u003e by fy29 driven by e motorcycle launches the competitive landscape will evolve as existing e \u003cTWO_\u003e w players expand their portfolio and reach with major brands like honda and suzuki expected to enter the e \u003cTWO_\u003e w market by q4 fy25 this increased competition will likely reduce olas market share from \u003cTHREE_TEN_PERCENT\u003e in fy24 to \u003cTWO_TEN_PERCENT\u003e by fy29 and further down to \u003cTWO_TEN_PERCENT\u003e by fy31 ambit stated despite these concerns ambit acknowledged ola electric s unique position as the only e \u003cTWO_\u003e w player in india that manufactures key components like motors battery management systems bms and lithium ion cells in house while also owning its sales network the brokerage also pointed out that ola benefits from significant incentives including some exclusive to the company however the firm emphasised that maintaining this competitive edge will require substantial capital expenditure capex ambit also predicted that electric two wheeler e \u003cTWO_\u003e w original equipment manufacturers oems would likely prioritise market share over margins in the coming years the brokerage estimated ola electric s volumes to grow from \u003cTHREE_\u003e lakh units in fy24 to \u003cONE_\u003e million units by fy27 and to \u003cONE_\u003e million units by fy29 economies of scale and falling battery costs are expected to reduce the bill of materials bom cost improving the company s gross margins to \u003cTWO_TEN_PERCENT\u003e by fy29 additionally operating leverage should help ola electric achieve ebitda break even by fy27 the stocks recent decline coincides with the end of the anchor lock in period which expired on september \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e this lock in period had restricted \u003cFIVE_TEN_PERCENT\u003e of ola electric shares or approximately \u003cONE_TEN\u003e crore shares from trading with the lock in period now over these shares are free to trade which has contributed to the downward pressure on the stock ola electric s financial performance also adds to the concerns the company reported a consolidated net loss of \u003cTHREE_HUNDRED\u003e crore for the quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e widening nearly \u003cTHREE_TEN_PERCENT\u003e year on year from \u003cTWO_HUNDRED\u003e crore in the same period last year however revenue from operations increased by \u003cTHREE_TEN_PERCENT\u003e year on year to \u003cONE_THOUSAND\u003e crore for the quarter the company posted an ebitda loss of \u003cTWO_HUNDRED\u003e crore for the reported quarter while ambit acknowledged that ola electric deserves a premium for its extensive coverage of the e \u003cTWO_\u003e w value chain it warned that the company s market share is expected to decline to \u003cTWO_TEN_PERCENT\u003e by fy31 the current valuation implies a compound annual growth rate cagr of \u003cTHREE_TEN_PERCENT\u003e in volumes from fy24 to fy35 slightly higher than our estimate leaving little margin of safety against the risks the brokerage added the combination of a stock price decline competitive pressures and financial losses led to growing concerns among investors as ola electric navigates these challenges it will be critical for the company to sustain its growth while addressing the risks outlined by ambit and other market observers","timestamp":"2024-09-12T15:34:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}