{"url":"https://www.livemint.com/market/stock-market-news/indian-stock-market-hits-all-time-high-after-outsized-fed-rate-cut-11726717440247.html","title":"Indian stock market hits all-time high after outsized Fed rate cut","description":"Some analysts had said the 50 basis point cut was already priced in by the market, but others said it would be positive for emerging markets such as India, bringing greater foreign inflows over time.","content":"Mumbai: The Indian stock market hit at an all-time high on Thursday morning, hours after the US Federal Reserve delivered a 50 basis point (bps) interest rate cut. At 9.20 am the Nifty was up 0.68% at 25,551.65 and the Sensex was up 0.71% at 83,542.65.Overnight, the Dow Jones had initially jumped after Wednesday's cut before erasing 479 points from its intraday high to close 0.25% lower at 41,503.10. Dow Jones active futures were up almost 0.5% on Thursday morning, indicating a higher opening for the bellwether US index.Some analysts said markets had generally expected a 25-50 bps cut in the federal funds rate and that there would be profit-booking. However, others said the rate cut would be positive for emerging markets such as India, which could attract greater foreign inflows over time.Also read: Big rate cut forces US Fed to contend with new obstacles\"Rate sensitives like realty, autos and NBFCs (non-banking financial companies) will benefit as the US Fed move could have a bearing on other global central banks,\" said Siddhartha Khemka, head of retail research at Motilal Oswal Financial Services.So far this year, FIIs have pumped  ₹73,782 crore into Indian stocks while DIIs have net invested  ₹3.2 trillion. Since the general election results on 4 June, the Nifty 50 index has gained 16%, reflecting strong market momentum through to 18 September.However, Sanjeev Prasad, MD \u0026 co-head of Kotak Institutional Equities Prasad advised caution as he found large caps to be “overvalued”, small and mid caps \"highly overvalued” and micro caps \"supervalued.\" Within the large cap space, he said select banks were the only place where there was value to be found.Indeed, the Nifty's current price-to-earnings (PE) multiple of 23.08 times is above its historic average of 21.42 while that of the Sensex stands at 23.50 times against the historic average of 22.42.Also read: Why the Federal Reserve has gambled on a big interest-rate cut\"We expect inflows into emerging markets to pick up post the Fed rate cut,\" said market expert Ajay Bagga. \"In anticipation [of the cut] we have seen good inflows into India and SE Asia in September. India is seeing a 20% share of the MSCI Emerging Market Index flows and has been an underweight market so far. We expect more FII inflows going ahead.\"\"There will be a knock-on effect of the Fed rate cut on global central banks as well. We expect RBI to start rate cuts by December and to cut rates by 75 basis points over the next 12 months,, which will benefit domestic cyclicals from financials to real estate and autos,\" he added.However, Aashish Sommaiyaa, CEO of WhiteOak Capital Asset Management, cautioned that while the 50 bps was a \"positive\" and could result in dollar depreciation with larger FPI flows, it could also cause some consternation on the health of the American economy.","cleaned_content":"mumbai the indian stock market hit at an all time high on thursday morning hours after the us federal reserve delivered a \u003cFIVE_TEN\u003e basis point bps interest rate cut at \u003cNINE_\u003e am the nifty was up \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e and the sensex was up \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e overnight the dow jones had initially jumped after wednesdays cut before erasing \u003cFOUR_HUNDRED\u003e points from its intraday high to close \u003cZERO_PERCENT\u003e lower at \u003cFOUR_TEN_THOUSAND\u003e dow jones active futures were up almost \u003cZERO_PERCENT\u003e on thursday morning indicating a higher opening for the bellwether us index some analysts said markets had generally expected a \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e bps cut in the federal funds rate and that there would be profit booking however others said the rate cut would be positive for emerging markets such as india which could attract greater foreign inflows over time also read big rate cut forces us fed to contend with new obstacles rate sensitives like realty autos and nbfcs non banking financial companies will benefit as the us fed move could have a bearing on other global central banks said siddhartha khemka head of retail research at motilal oswal financial services so far this year fiis have pumped \u003cSEVEN_TEN_THOUSAND\u003e crore into indian stocks while diis have net invested \u003cTHREE_\u003e trillion since the general election results on \u003cFOUR_\u003e june the nifty \u003cFIVE_TEN\u003e index has gained \u003cONE_TEN_PERCENT\u003e reflecting strong market momentum through to \u003cONE_TEN\u003e september however sanjeev prasad md co head of kotak institutional equities prasad advised caution as he found large caps to be overvalued small and mid caps highly overvalued and micro caps supervalued within the large cap space he said select banks were the only place where there was value to be found indeed the niftys current price to earnings pe multiple of \u003cTWO_TEN\u003e times is above its historic average of \u003cTWO_TEN\u003e while that of the sensex stands at \u003cTWO_TEN\u003e times against the historic average of \u003cTWO_TEN\u003e also read why the federal reserve has gambled on a big interest rate cut we expect inflows into emerging markets to pick up post the fed rate cut said market expert ajay bagga in anticipation of the cut we have seen good inflows into india and se asia in september india is seeing a \u003cTWO_TEN_PERCENT\u003e share of the msci emerging market index flows and has been an underweight market so far we expect more fii inflows going ahead there will be a knock on effect of the fed rate cut on global central banks as well we expect rbi to start rate cuts by december and to cut rates by \u003cSEVEN_TEN\u003e basis points over the next \u003cONE_TEN\u003e months which will benefit domestic cyclicals from financials to real estate and autos he added however aashish sommaiyaa ceo of whiteoak capital asset management cautioned that while the \u003cFIVE_TEN\u003e bps was a positive and could result in dollar depreciation with larger fpi flows it could also cause some consternation on the health of the american economy","timestamp":"2024-09-19T09:39:00+05:30","market_timestamp":"2024-09-19T09:39:00+05:30","off_market_hours":false}