{"url":"https://www.livemint.com/market/stock-market-news/stocks-at-record-high-itc-airtel-hul-nearly-280-stocks-hit-1-year-highs-investors-earn-6-lakh-crore-in-a-day-11726135526382.html","title":"Stocks at record high: ITC, Airtel, HUL.. nearly 280 stocks hit 1-year highs; investors earn  ₹6 lakh crore in a day","description":"Stocks at record high: The Indian stock market benchmarks—the Sensex and Nifty 50—hit new record highs. The total market capitalisation of BSE-listed companies rose by nearly  ₹6 lakh crore. Almost 280 stocks, including ITC, Bharti Airtel, and Hindustan Unilever (HUL), hit their 52-week highs.","content":"Stocks at record high: A broad-based rally in the Indian stock market propelled benchmark indices—the Sensex and Nifty 50—to new record highs on Thursday, September 12. This surge increased the total market capitalisation of BSE-listed companies by nearly  ₹6 lakh crore, with almost 280 stocks hitting their fresh 52-week highs.ITC, Bharti Airtel, Hindustan Unilever (HUL), Sun Pharma, Apollo Hospitals, Bajaj Auto, Britannia Industries, Cholamandalam Investment and Finance, Divi's Labs, Havells India, IndiGo, Persistent Systems, and Zomato were among the large-cap stocks that hit fresh 52-week highs in intraday trade on the BSE.As many as 278 stocks hit their fresh 52-week high levels on the BSE during the session.The Sensex hit its fresh record high of 83,116.19 during the session before closing at 82,962.71, with a gain of 1440 points, or 1.77 per cent. The Nifty 50 hit its all-time high of 25,433.35 and finally closed at 25,388.90, up 470 points, or 1.89 per cent.The BSE Midcap and Smallcap indices jumped 1.32 per cent and 0.79 per cent, respectively.The overall market capitalisation of the firms listed on the BSE rose to nearly  ₹467.1 lakh crore from  ₹460.8 lakh crore in the previous session, making investors richer by about  ₹6.3 lakh crore in a single session.The Indian stock market witnessed strong gains, reflecting positive global sentiment as optimism around the start of the rate cut cycle continues to grow.The European Central Bank (ECB) is almost certain to cut rates by 25 bps later today. The US Fed is expected to cut rates by 25 bps next week on September 18.India's Consumer Price Index (CPI)--based inflation prints will be out today, and experts see a growing possibility of a rate cut by the Reserve Bank of India in October.\"The bulls took charge towards the end of the day and lifted the indices to a new high, mirroring the bullish global trend. The global rate-cut optimism (ECB and US Fed) has provided a positive impetus to the global market. The outcome of domestic inflation and IIP data will influence the subsequent leg of the rally,\" said Vinod Nair, Head of Research, Geojit Financial Services.On the technical front, the Nifty 50 has broken out of its recent consolidation on the daily chart.Rupak De, Senior Technical Analyst at LKP Securities, pointed out that the Nifty 50 has been sustaining above the critical 21-day EMA, a near-term moving average. The RSI on the daily chart shows a bullish crossover, reinforcing the positive sentiment.\"The trend is expected to remain strong, as the index closed above the recent consolidation high. On the upside, the rally could potentially continue toward the 25,470–25,500 range, while support is seen at 25,100,\" said De.Read all market-related news here","cleaned_content":"stocks at record high a broad based rally in the indian stock market propelled benchmark indices the sensex and nifty \u003cFIVE_TEN\u003e to new record highs on thursday september \u003cONE_TEN\u003e this surge increased the total market capitalisation of bse listed companies by nearly \u003cSIX_\u003e lakh crore with almost \u003cTWO_HUNDRED\u003e stocks hitting their fresh \u003cFIVE_TEN\u003e week highs itc bharti airtel hindustan unilever hul sun pharma apollo hospitals bajaj auto britannia industries cholamandalam investment and finance divis labs havells india indigo persistent systems and zomato were among the large cap stocks that hit fresh \u003cFIVE_TEN\u003e week highs in intraday trade on the bse as many as \u003cTWO_HUNDRED\u003e stocks hit their fresh \u003cFIVE_TEN\u003e week high levels on the bse during the session the sensex hit its fresh record high of \u003cEIGHT_TEN_THOUSAND\u003e during the session before closing at \u003cEIGHT_TEN_THOUSAND\u003e with a gain of \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e the nifty \u003cFIVE_TEN\u003e hit its all time high of \u003cTWO_TEN_THOUSAND\u003e and finally closed at \u003cTWO_TEN_THOUSAND\u003e up \u003cFOUR_HUNDRED\u003e points or \u003cONE_PERCENT\u003e the bse midcap and smallcap indices jumped \u003cONE_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively the overall market capitalisation of the firms listed on the bse rose to nearly \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors richer by about \u003cSIX_\u003e lakh crore in a single session the indian stock market witnessed strong gains reflecting positive global sentiment as optimism around the start of the rate cut cycle continues to grow the european central bank ecb is almost certain to cut rates by \u003cTWO_TEN\u003e bps later today the us fed is expected to cut rates by \u003cTWO_TEN\u003e bps next week on september \u003cONE_TEN\u003e indias consumer price index cpi based inflation prints will be out today and experts see a growing possibility of a rate cut by the reserve bank of india in october the bulls took charge towards the end of the day and lifted the indices to a new high mirroring the bullish global trend the global rate cut optimism ecb and us fed has provided a positive impetus to the global market the outcome of domestic inflation and iip data will influence the subsequent leg of the rally said vinod nair head of research geojit financial services on the technical front the nifty \u003cFIVE_TEN\u003e has broken out of its recent consolidation on the daily chart rupak de senior technical analyst at lkp securities pointed out that the nifty \u003cFIVE_TEN\u003e has been sustaining above the critical \u003cTWO_TEN\u003e day ema a near term moving average the rsi on the daily chart shows a bullish crossover reinforcing the positive sentiment the trend is expected to remain strong as the index closed above the recent consolidation high on the upside the rally could potentially continue toward the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range while support is seen at \u003cTWO_TEN_THOUSAND\u003e said de read all market related news here","timestamp":"2024-09-12T16:04:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}