{"url":"https://www.livemint.com/market/stock-market-news/glenmark-jb-pharma-sun-zydus-lifescience-drive-pharma-market-growth-in-august-11726813983737.html","title":"Glenmark, JB Pharma, Sun, Zydus Lifescience drive pharma market growth in August","description":"Stock Market Today: The Nifty Pharma Index has gained around 37% year to date. The earnings growth for firms is being led by the US sales and well supported by domestic market that grew 7.6% year on year in August'24. Glenmark, JB Pharma, Sun, Zydus were key pharma market growth drivers in August'24","content":"Stock Market today: The Nifty Pharma Indexhas gained around 37% year to date. The gains are being led by strong earnings growth being reported by Indian Pharmaceutical companies in the US and well supported by the India markets.The India Pharma market growth remained decent in the month of August '2024 on a large base of last year. The Indian Pharma market as per reports grew 7.6% year on year in August’2024 (versus 11.2% in July’24 and 6% in August’2023).In August’24, among the top-20 pharma companies, JB Pharma (JB Chemical \u0026 Pharmaceuticals) clocked 13.7% YoY growth followed by Glenmark Pharma (up 13.5% YoY), and Intas Pharmaceuticals (unlisted that saw sales grow 11.4% YoY as per Motilal Oswal Financial Services Ltd. The growth recorded notably was higher that the Indian Pharma Market growth.Among other outperformers are Sun Pharmaceutical Industries Ltd and Zydus Lifescience Ltd that recorded growth of 9.9% and 9.7% year on year, closely followed by Ajanta Pharma Ltd, Abbott that clocked 9.4% and 9.5% year on year growth respectively. Lupin, Torrent Pharma and Dr Reddy's also reported 8% or more growthAs of August’24, Indian pharma companies hold a majority share of 84% in IPM, while the remaining is held by multi-national pharmaceutical companies, said analysts. Both MNCs and Indian companies registered single-digit growth sequentially during August’2024.The growth rate however remains stronger on trailing basis and for ther months (June, July and August 2024) the Indian Pharma market has grown 8.6% year on year.As per CRISIL Research, Domestic revenue is likely to see growth of 7-9% this fiscal, primarily price-driven, with volume growth to be backed by new product launches. Price growth will be led by the non-NLEM (National List of Essential Medicines) portfolio, as price growth for NLEM portfolio shall remain muted, due to minimal change in Wholesale Price Index (WPI) last fiscal. CRISIL expects the chronic segment to be the key revenue contributor amid increasing lifestyle-related diseases and continued emphasis on health awareness since the pandemic.","cleaned_content":"stock market today the nifty pharma indexhas gained around \u003cTHREE_TEN_PERCENT\u003e year to date the gains are being led by strong earnings growth being reported by indian pharmaceutical companies in the us and well supported by the india markets the india pharma market growth remained decent in the month of august 2024 on a large base of last year the indian pharma market as per reports grew \u003cSEVEN_PERCENT\u003e year on year in august \u003cTWO_THOUSAND\u003e versus \u003cONE_TEN_PERCENT\u003e in july \u003cTWO_TEN\u003e and \u003cSIX_PERCENT\u003e in august \u003cTWO_THOUSAND\u003e in august \u003cTWO_TEN\u003e among the top \u003cTWO_TEN\u003e pharma companies jb pharma jb chemical pharmaceuticals clocked \u003cONE_TEN_PERCENT\u003e yoy growth followed by glenmark pharma up \u003cONE_TEN_PERCENT\u003e yoy and intas pharmaceuticals unlisted that saw sales grow \u003cONE_TEN_PERCENT\u003e yoy as per motilal oswal financial services ltd the growth recorded notably was higher that the indian pharma market growth among other outperformers are sun pharmaceutical industries ltd and zydus lifescience ltd that recorded growth of \u003cNINE_PERCENT\u003e and \u003cNINE_PERCENT\u003e year on year closely followed by ajanta pharma ltd abbott that clocked \u003cNINE_PERCENT\u003e and \u003cNINE_PERCENT\u003e year on year growth respectively lupin torrent pharma and dr reddys also reported \u003cEIGHT_PERCENT\u003e or more growthas of august \u003cTWO_TEN\u003e indian pharma companies hold a majority share of \u003cEIGHT_TEN_PERCENT\u003e in ipm while the remaining is held by multi national pharmaceutical companies said analysts both mncs and indian companies registered single digit growth sequentially during august \u003cTWO_THOUSAND\u003e the growth rate however remains stronger on trailing basis and for ther months june july and august \u003cTWO_THOUSAND\u003e the indian pharma market has grown \u003cEIGHT_PERCENT\u003e year on year as per crisil research domestic revenue is likely to see growth of \u003cSEVEN_\u003e \u003cNINE_PERCENT\u003e this fiscal primarily price driven with volume growth to be backed by new product launches price growth will be led by the non nlem national list of essential medicines portfolio as price growth for nlem portfolio shall remain muted due to minimal change in wholesale price index wpi last fiscal crisil expects the chronic segment to be the key revenue contributor amid increasing lifestyle related diseases and continued emphasis on health awareness since the pandemic","timestamp":"2024-09-20T13:30:00+05:30","market_timestamp":"2024-09-20T13:30:00+05:30","off_market_hours":false}