{"url":"https://www.livemint.com/market/stock-market-news/bajaj-auto-stock-check-rallying-131-in-1-year-should-you-buy-it-technical-and-fundamental-experts-advise-11726644129188.html","title":"Bajaj Auto stock check: Rallying 131% in 1 year, should you buy it? Technical and fundamental experts advise","description":"Bajaj Auto has surged over 75 per cent this year and is currently at a lifetime peak. While indicators show overbought conditions, strong support exists around  ₹11,600-11,400. Investors are advised to protect profits as the stock navigates uncharted territory with potential resistance at  ₹12,140","content":"Auto stock Bajaj Auto has witnessed a remarkable multibagger rally, with the stock climbing 131 per cent last year. So far in 2024, the stock has risen by 76 per cent, giving positive returns in eight out of nine months.In September, the stock added almost 10 per cent, extending its gains for the fifth consecutive month. It rose by 12.7 per cent in August, following around a 2 per cent gain in July, a 4.4 per cent rise in June, and a 2.2 per cent increase in May. Meanwhile, it witnessed some corrections before that, down 2.7 per cent in April. From January to March, the stock remained positive, with a 15.6 per cent gain in March, a 3.3 per cent rise in February, and a 12.5 per cent jump in January.The auto stock hit a record high of  ₹12,050.00 in intra-day deals today, September 18. It has soared almost 146 per cent from its 52-week low of  ₹4,902.80 in October last year.Bajaj Auto's standalone profit after tax (PAT) rose to  ₹1,988.34 crore for the quarter ending June 30, 2024, compared to  ₹1,664.77 crore in the same period last year. The company's total revenue grew 15.7 per cent to  ₹11,928.02 crore in Q1 FY25, up from  ₹10,309.77 crore, driven by strong vehicle sales and record spares revenue, which boosted the average selling price (ASP).Bajaj Auto sold 11,02,056 vehicles in the June 2024 quarter, a 7 per cent increase from the 10,27,407 units sold a year earlier. EBITDA rose by 24 per cent to  ₹2,415 crore from  ₹1,954 crore, while the operating margin improved by 130 basis points to 20.2 per cent from 19 per cent YoY. The company attributed this growth to better realizations and cost reductions, which offset the impact of the growing electric two-wheeler (e2W) segment.BAJAJAUTO remains firmly in a bullish trend despite marking an all-time high of  ₹11,925 in today's session. In the broader horizon after breaking out of the rectangular range, the stock has surged significantly and is now trading above both its 20-day and 50-day moving averages. Recently, there has been a notable increase in delivery volume. Following some consolidation, the Nifty Auto index has also regained momentum in the last few days. However, the daily and weekly RSI has surged into the overbought territory at 80, which could moderate the momentum in the near term. The support is crucial at  ₹11,200 and  ₹11,000 levels and any retracement to these zones could present a buying opportunity. Looking ahead, Bajaj Auto has the potential to advance toward the  ₹12,800-13,000 range.Osho Krishan, Senior Analyst - Technical \u0026 Derivatives, Angel OneBajaj Auto is demonstrating a strong, sustained uptrend, consistently achieving higher highs, and is currently at its lifetime peak. The stock has surged impressively by over 75 per cent this year. However, it is important to note that from a technical perspective, the indicators suggest that the stock is overbought and at stretched levels. Regarding specific levels, 11600-11400 is expected to act as a stabilizing factor during any short-term fluctuations, as there is strong support around 11000, coinciding with the 20-day Exponential Moving Average (DEMA). Given the uncharted territory of the stock, it is challenging to pinpoint immediate hurdles or resistance. However, considering the current momentum, it is prudent to protect profits by adjusting stop-loss orders to higher levels as long as the momentum persists.The stock is currently experiencing a strong uptrend across all time frames, forming a series of higher tops and bottoms. It is positioned well above its 20, 50, 100, and 200-day SMA, which are also trending upwards along with the rising prices, confirming the bullish trend. Increased trading volumes over the past few weeks indicate growing rally participation. Additionally, the daily, weekly, and monthly RSI indicators are in positive terrain, demonstrating sustained strength across all time frames. The weekly Bollinger Bands signal a buy, suggesting increased momentum. Traders and investors must maintain their positions, with a critical support zone at 11455-11950 levels. This momentum is expected to continue towards 12300-12580 levels in the coming weeks.AR Ramachandran, Co-founder \u0026 Trainer, Tips2tradesBajaj Auto is bullish but overbought on the Daily charts, with the next resistance at 12140. Investors should be booking profits at current levels as a Daily close below support of 11319 could lead to the target of 10500 in the near term.Domestic brokerage house Motilal Oswal has a neutral call on the auto major with a target price of  ₹10,705, implying a downside potential of over 10 per cent.MOSL met with Bajaj Auto's (BJAUT) management for a business update. The management projected a 7-8 per cent volume growth in the domestic two-wheeler segment for FY25, with growth expected to moderate in the second half due to a high YoY base. In exports, the brokerage noted that strong demand from Latin America and ASEAN is offset by continued weakness in Africa and Bangladesh, leading to single-digit growth expectations for FY25.However, it also highlighted that positives for the firm include strong demand for the Freedom 125cc, prompting plans to increase production to 40,000 units by January 2025, alongside a new CNG bike launch by FY25 end. The Chetak ranks third in the market with aspirations for second, supported by upcoming launches. Additionally, the three-wheeler EV segment has seen substantial growth.Meanwhile, per the brokerage, the negatives are weak KTM performance and potential margin pressure from an adverse product mix. MOSL maintained a Neutral rating, citing the likelihood of slower growth after FY24 as HMSI regains lost market share. BJAUT is expected to see 5 per cent domestic motorcycle growth in FY25 and 10 per cent in FY26, with export growth of 7 per cent in FY25 and 20 per cent in FY26, projected MOSL.Despite a significant re-rating over the past year, driven by market share gains in the 125cc+ segment and improved margins, MOSL lowered FY25 earnings estimates by 6 per cent due to KTM's weak performance. With a 39x/31x FY25/FY26 earnings valuation, MOSL sees limited further upside and maintains a Neutral rating with a revised target price of  ₹10,705, based on 25x Sep-26 EPS.Bajaj Auto has experienced a phenomenal rally, driven by strong earnings, technical momentum, and optimism in the domestic and export markets. However, with the stock entering the overbought territory, experts recommend caution, advising investors to monitor support levels and consider booking profits. The fundamental outlook remains mixed, with some concerns over future growth. Still, the long-term prospects for the stock remain solid, particularly in light of its electric vehicle ambitions and international expansion plans. Whether the rally will sustain depends on the company's ability to navigate competitive pressures and maintain its operational excellence.","cleaned_content":"auto stock bajaj auto has witnessed a remarkable multibagger rally with the stock climbing \u003cONE_HUNDRED_PERCENT\u003e last year so far in \u003cTWO_THOUSAND\u003e the stock has risen by \u003cSEVEN_TEN_PERCENT\u003e giving positive returns in eight out of nine months in september the stock added almost \u003cONE_TEN_PERCENT\u003e extending its gains for the fifth consecutive month it rose by \u003cONE_TEN_PERCENT\u003e in august following around a \u003cTWO_PERCENT\u003e gain in july a \u003cFOUR_PERCENT\u003e rise in june and a \u003cTWO_PERCENT\u003e increase in may meanwhile it witnessed some corrections before that down \u003cTWO_PERCENT\u003e in april from january to march the stock remained positive with a \u003cONE_TEN_PERCENT\u003e gain in march a \u003cTHREE_PERCENT\u003e rise in february and a \u003cONE_TEN_PERCENT\u003e jump in january the auto stock hit a record high of \u003cONE_TEN_THOUSAND\u003e in intra day deals today september \u003cONE_TEN\u003e it has soared almost \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cFOUR_THOUSAND\u003e in october last year bajaj autos standalone profit after tax pat rose to \u003cONE_THOUSAND\u003e crore for the quarter ending june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to \u003cONE_THOUSAND\u003e crore in the same period last year the companys total revenue grew \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e crore in q1 fy25 up from \u003cONE_TEN_THOUSAND\u003e crore driven by strong vehicle sales and record spares revenue which boosted the average selling price asp bajaj auto sold \u003cONE_MILLION\u003e vehicles in the june \u003cTWO_THOUSAND\u003e quarter a \u003cSEVEN_PERCENT\u003e increase from the \u003cONE_MILLION\u003e units sold a year earlier ebitda rose by \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e crore from \u003cONE_THOUSAND\u003e crore while the operating margin improved by \u003cONE_HUNDRED\u003e basis points to \u003cTWO_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e yoy the company attributed this growth to better realizations and cost reductions which offset the impact of the growing electric two wheeler e2w segment bajajauto remains firmly in a bullish trend despite marking an all time high of \u003cONE_TEN_THOUSAND\u003e in todays session in the broader horizon after breaking out of the rectangular range the stock has surged significantly and is now trading above both its \u003cTWO_TEN\u003e day and \u003cFIVE_TEN\u003e day moving averages recently there has been a notable increase in delivery volume following some consolidation the nifty auto index has also regained momentum in the last few days however the daily and weekly rsi has surged into the overbought territory at \u003cEIGHT_TEN\u003e which could moderate the momentum in the near term the support is crucial at \u003cONE_TEN_THOUSAND\u003e and \u003cONE_TEN_THOUSAND\u003e levels and any retracement to these zones could present a buying opportunity looking ahead bajaj auto has the potential to advance toward the \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e range osho krishan senior analyst technical derivatives angel onebajaj auto is demonstrating a strong sustained uptrend consistently achieving higher highs and is currently at its lifetime peak the stock has surged impressively by over \u003cSEVEN_TEN_PERCENT\u003e this year however it is important to note that from a technical perspective the indicators suggest that the stock is overbought and at stretched levels regarding specific levels \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e is expected to act as a stabilizing factor during any short term fluctuations as there is strong support around \u003cONE_TEN_THOUSAND\u003e coinciding with the \u003cTWO_TEN\u003e day exponential moving average dema given the uncharted territory of the stock it is challenging to pinpoint immediate hurdles or resistance however considering the current momentum it is prudent to protect profits by adjusting stop loss orders to higher levels as long as the momentum persists the stock is currently experiencing a strong uptrend across all time frames forming a series of higher tops and bottoms it is positioned well above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma which are also trending upwards along with the rising prices confirming the bullish trend increased trading volumes over the past few weeks indicate growing rally participation additionally the daily weekly and monthly rsi indicators are in positive terrain demonstrating sustained strength across all time frames the weekly bollinger bands signal a buy suggesting increased momentum traders and investors must maintain their positions with a critical support zone at \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e levels this momentum is expected to continue towards \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e levels in the coming weeks ar ramachandran co founder trainer tips2tradesbajaj auto is bullish but overbought on the daily charts with the next resistance at \u003cONE_TEN_THOUSAND\u003e investors should be booking profits at current levels as a daily close below support of \u003cONE_TEN_THOUSAND\u003e could lead to the target of \u003cONE_TEN_THOUSAND\u003e in the near term domestic brokerage house motilal oswal has a neutral call on the auto major with a target price of \u003cONE_TEN_THOUSAND\u003e implying a downside potential of over \u003cONE_TEN_PERCENT\u003e mosl met with bajaj autos bjaut management for a business update the management projected a \u003cSEVEN_\u003e \u003cEIGHT_PERCENT\u003e volume growth in the domestic two wheeler segment for fy25 with growth expected to moderate in the second half due to a high yoy base in exports the brokerage noted that strong demand from latin america and asean is offset by continued weakness in africa and bangladesh leading to single digit growth expectations for fy25 however it also highlighted that positives for the firm include strong demand for the freedom \u003cONE_HUNDRED\u003e cc prompting plans to increase production to \u003cFOUR_TEN_THOUSAND\u003e units by january \u003cTWO_THOUSAND\u003e alongside a new cng bike launch by fy25 end the chetak ranks third in the market with aspirations for second supported by upcoming launches additionally the three wheeler ev segment has seen substantial growth meanwhile per the brokerage the negatives are weak ktm performance and potential margin pressure from an adverse product mix mosl maintained a neutral rating citing the likelihood of slower growth after fy24 as hmsi regains lost market share bjaut is expected to see \u003cFIVE_PERCENT\u003e domestic motorcycle growth in fy25 and \u003cONE_TEN_PERCENT\u003e in fy26 with export growth of \u003cSEVEN_PERCENT\u003e in fy25 and \u003cTWO_TEN_PERCENT\u003e in fy26 projected mosl despite a significant re rating over the past year driven by market share gains in the \u003cONE_HUNDRED\u003e cc segment and improved margins mosl lowered fy25 earnings estimates by \u003cSIX_PERCENT\u003e due to ktms weak performance with a \u003cTHREE_TEN\u003e x \u003cTHREE_TEN\u003e x fy25 fy26 earnings valuation mosl sees limited further upside and maintains a neutral rating with a revised target price of \u003cONE_TEN_THOUSAND\u003e based on \u003cTWO_TEN\u003e x sep \u003cTWO_TEN\u003e eps bajaj auto has experienced a phenomenal rally driven by strong earnings technical momentum and optimism in the domestic and export markets however with the stock entering the overbought territory experts recommend caution advising investors to monitor support levels and consider booking profits the fundamental outlook remains mixed with some concerns over future growth still the long term prospects for the stock remain solid particularly in light of its electric vehicle ambitions and international expansion plans whether the rally will sustain depends on the companys ability to navigate competitive pressures and maintain its operational excellence","timestamp":"2024-09-18T13:22:00+05:30","market_timestamp":"2024-09-18T13:22:00+05:30","off_market_hours":false}