{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-religare-sbi-rec-ireda-ntpc-and-more-11726679136914.html","title":"Stocks To Watch: Religare Enterprises, SBI, REC, IREDA, NTPC and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"IREDA: Indian Renewable Energy Development Agency (IREDA), a state-owned entity, secured government approval to raise up to  ₹4,500 crore by issuing equity shares through a qualified institutional placement (QIP). The government plans to dilute its stake in IREDA by 7 percent on a post-issue basis in one or more tranches. This approval came from the Department of Investment and Public Asset Management (DIPAM) following recommendations from a high-level committee.REC: REC Ltd, a state-run company, signed agreements valued at  ₹1.12 trillion to fund various renewable energy initiatives. The agreements, reached at a recent industry conclave, target projects scheduled for implementation over the next five years. The Memorandums of Understanding (MoUs) cover a wide array of green energy projects, including solar and wind hybrids, round-the-clock (RTC) solar and wind power, floating solar plants, ultra-mega renewable energy parks, and green hydrogen production. Other focus areas include hydroelectric projects, battery energy storage systems (BESS), and solar cell manufacturing.Religare Enterprises: The Delhi High Court issued notices to the Registrar of Companies (RoC) and Religare Enterprises Ltd after MB Finmart, part of the Burman Family, challenged the RoC’s decision to extend Religare's annual general meeting (AGM) by three months. The AGM, originally set for 30 September, was postponed to December without a stated reason. MB Finmart argued that the extension violated Section 96(1) of the Companies Act, which allows extensions only in \"exceptional circumstances.\" The court has set the next hearing for 21 October.Aurobindo Pharma: Aurobindo Pharma announced its plan to acquire the remaining 49 percent stake in GLS Pharma Ltd for  ₹22.5 crore, making it a wholly-owned subsidiary. The company entered into a binding agreement on September 18, 2024, with GLS Pharma and its promoters to purchase 5,90,361 equity shares at  ₹381.12 per share. This acquisition will bring full ownership of GLS to Aurobindo Pharma, and the transaction is expected to be completed by December 31, 2024.SBI: State Bank of India (SBI) raised  ₹7,500 crore by issuing Basel III-compliant Tier 2 bonds to qualified institutional bidders. The issue attracted an overwhelming response, with bids exceeding 3 times the base issue size of  ₹4,000 crore. The wide range of investors included provident funds, pension funds, mutual funds, and banks. SBI Chairman C S Setty noted that the strong participation reflected the trust investors have in India's largest bank.NTPC: NTPC will be a key stock to watch as it prepares to list its renewable energy subsidiary. The company aims to raise approximately  ₹10,000 crore through the green energy IPO, and the draft papers for the listing have already been submitted.BHEL, PFC: BHEL has paid a final dividend of  ₹55 crore to the government, while Power Finance Corporation (PFC) reported a record dividend payout of  ₹4,455 crore for 2023-24, with  ₹462 crore going to the government.Zee Entertainment Enterprises: Star India is seeking $940 million in damages from Zee Entertainment following the termination of an ICC TV rights deal. The arbitration process is ongoing, with Zee contesting the claims.","cleaned_content":"ireda indian renewable energy development agency ireda a state owned entity secured government approval to raise up to \u003cFOUR_THOUSAND\u003e crore by issuing equity shares through a qualified institutional placement qip the government plans to dilute its stake in ireda by \u003cSEVEN_PERCENT\u003e on a post issue basis in one or more tranches this approval came from the department of investment and public asset management dipam following recommendations from a high level committee rec rec ltd a state run company signed agreements valued at \u003cONE_\u003e trillion to fund various renewable energy initiatives the agreements reached at a recent industry conclave target projects scheduled for implementation over the next five years the memorandums of understanding mous cover a wide array of green energy projects including solar and wind hybrids round the clock rtc solar and wind power floating solar plants ultra mega renewable energy parks and green hydrogen production other focus areas include hydroelectric projects battery energy storage systems bess and solar cell manufacturing religare enterprises the delhi high court issued notices to the registrar of companies roc and religare enterprises ltd after mb finmart part of the burman family challenged the roc s decision to extend religares annual general meeting agm by three months the agm originally set for \u003cTHREE_TEN\u003e september was postponed to december without a stated reason mb finmart argued that the extension violated section \u003cNINE_TEN\u003e \u003cONE_\u003e of the companies act which allows extensions only in exceptional circumstances the court has set the next hearing for \u003cTWO_TEN\u003e october aurobindo pharma aurobindo pharma announced its plan to acquire the remaining \u003cFOUR_TEN_PERCENT\u003e stake in gls pharma ltd for \u003cTWO_TEN\u003e crore making it a wholly owned subsidiary the company entered into a binding agreement on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with gls pharma and its promoters to purchase \u003cFIVE_HUNDRED_THOUSAND\u003e equity shares at \u003cTHREE_HUNDRED\u003e per share this acquisition will bring full ownership of gls to aurobindo pharma and the transaction is expected to be completed by december \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e sbi state bank of india sbi raised \u003cSEVEN_THOUSAND\u003e crore by issuing basel iii compliant tier \u003cTWO_\u003e bonds to qualified institutional bidders the issue attracted an overwhelming response with bids exceeding \u003cTHREE_\u003e times the base issue size of \u003cFOUR_THOUSAND\u003e crore the wide range of investors included provident funds pension funds mutual funds and banks sbi chairman c s setty noted that the strong participation reflected the trust investors have in indias largest bank ntpc ntpc will be a key stock to watch as it prepares to list its renewable energy subsidiary the company aims to raise approximately \u003cONE_TEN_THOUSAND\u003e crore through the green energy ipo and the draft papers for the listing have already been submitted bhel pfc bhel has paid a final dividend of \u003cFIVE_TEN\u003e crore to the government while power finance corporation pfc reported a record dividend payout of \u003cFOUR_THOUSAND\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with \u003cFOUR_HUNDRED\u003e crore going to the government zee entertainment enterprises star india is seeking \u003cNINE_HUNDRED\u003e million in damages from zee entertainment following the termination of an icc tv rights deal the arbitration process is ongoing with zee contesting the claims","timestamp":"2024-09-19T08:21:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}