{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-2-small-cap-stock-teamo-productions-hq-hits-upper-circuit-heres-why-11726034538455.html","title":"Penny stock below  ₹2: Small-cap stock Teamo Productions HQ hits upper circuit; here’s why","description":"Penny stock below  ₹2: Teamo Productions HQ's stock surged 5% to  ₹1.51 after announcing the conversion of warrants into equities worth  ₹9 crore. The company allotted 80 lakh shares at  ₹1.50 each to non-promoters, contributing to a 36% annual gain despite recent monthly declines.","content":"Penny stock Teamo Productions HQ jumped 5 per cent to hit its upper circuit in intraday trade on the BSE on Wednesday, September 11, a day after the company announced the conversion of warrants into equities worth  ₹9 crore. Shares of Teamo Productions HQ opened at  ₹1.45 against its previous close of  ₹1.44 and touched its 5 per cent upper circuit of  ₹1.51. Around 11:30 am, the stock traded 2.78 per cent up at  ₹1.48.In an exchange filing post-market hour on Tuesday, September 10, the company said its board of directors, in their meeting held on Tuesday, approved the allotment of 8,00,00,000 equity shares with a face value of  ₹1 each at an issue price of  ₹1.50 per share.This allotment follows the conversion of 80,00,000 warrants originally issued at an issue price of  ₹15 each. After the sub-division of equity shares from one share of  ₹10 each to 10 shares of  ₹1 each, the paid-up capital per share and premium per share were adjusted accordingly.The shares have been allotted to individuals in the \"non-promoters/public category\" on a preferential basis. The total amount received from the allottees is  ₹9 crore, at the rate of  ₹11.25 per warrant.Mohaan Nadaar and Mariango Trading Private Limited are the two allottees of the shares. After the conversion of the warrant, both were allotted 4 crore shares each.Teamo Productions share price has seen a decent gain over the last one year, rising about 36 per cent. On a monthly scale, the stock is down about 8 per cent this month, following a 3 per cent fall in August, according to Investing.com data.The small-cap stock hit its 52-week high of  ₹1.87 on July 12 this year. It hit a 52-week low of  ₹1 on November 13 last year.If the stock ends in the green today, it will snap its three-day losing run.Read all market-related news here","cleaned_content":"penny stock teamo productions hq jumped \u003cFIVE_PERCENT\u003e to hit its upper circuit in intraday trade on the bse on wednesday september \u003cONE_TEN\u003e a day after the company announced the conversion of warrants into equities worth \u003cNINE_\u003e crore shares of teamo productions hq opened at \u003cONE_\u003e against its previous close of \u003cONE_\u003e and touched its \u003cFIVE_PERCENT\u003e upper circuit of \u003cONE_\u003e around \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e am the stock traded \u003cTWO_PERCENT\u003e up at \u003cONE_\u003e in an exchange filing post market hour on tuesday september \u003cONE_TEN\u003e the company said its board of directors in their meeting held on tuesday approved the allotment of \u003cEIGHT_TEN_MILLION\u003e equity shares with a face value of \u003cONE_\u003e each at an issue price of \u003cONE_\u003e per share this allotment follows the conversion of \u003cEIGHT_MILLION\u003e warrants originally issued at an issue price of \u003cONE_TEN\u003e each after the sub division of equity shares from one share of \u003cONE_TEN\u003e each to \u003cONE_TEN\u003e shares of \u003cONE_\u003e each the paid up capital per share and premium per share were adjusted accordingly the shares have been allotted to individuals in the non promoters public category on a preferential basis the total amount received from the allottees is \u003cNINE_\u003e crore at the rate of \u003cONE_TEN\u003e per warrant mohaan nadaar and mariango trading private limited are the two allottees of the shares after the conversion of the warrant both were allotted \u003cFOUR_\u003e crore shares each teamo productions share price has seen a decent gain over the last one year rising about \u003cTHREE_TEN_PERCENT\u003e on a monthly scale the stock is down about \u003cEIGHT_PERCENT\u003e this month following a \u003cTHREE_PERCENT\u003e fall in august according to investing com data the small cap stock hit its \u003cFIVE_TEN\u003e week high of \u003cONE_\u003e on july \u003cONE_TEN\u003e this year it hit a \u003cFIVE_TEN\u003e week low of \u003cONE_\u003e on november \u003cONE_TEN\u003e last year if the stock ends in the green today it will snap its three day losing run read all market related news here","timestamp":"2024-09-11T11:59:00+05:30","market_timestamp":"2024-09-11T11:59:00+05:30","off_market_hours":false}