{"url":"https://www.livemint.com/market/stock-market-news/reliance-power-stocks-in-focus-today-heres-why-11726629291883.html","title":"Reliance Power share price surges 5%. Here’s why","description":"Stocks in focus: Reliance Power has successfully settled a substantial debt owed by its former subsidiary, Vidarbha Industries Power Limited (VIPL).","content":"RPower Shares in focus: Reliance Power on September 17 announced the settlement of a massive  ₹3,872.04 crore debt associated with its former subsidiary, Vidarbha Industries Power Limited (VIPL), as per an exchange filing.Reliance Power's shares were trading up 5 per cent, at  ₹32.97, on September 18, at 9:30 am, on the NSE. RPower stock hit a 52-week high on August 28, 2024 at  ₹38.11, as per NSE.Reliance Power share price closed in the green, up 1 per cent, at  ₹31.41, on September 17, on the BSE.VIPL, which contributed a mere 0.11 per cent ( ₹8.73 crores) to RPower's consolidated revenue and held a negative net worth of  ₹3,086.29 crore in the last financial year, will cease to be a subsidiary of RPower effective September 19, 2024, the filing added.The transaction, initiated on September 17, 2024, involved the invocation of a pledge on VIPL's entire equity shareholding. The action was taken by Axis Trustee Services Limited, acting as a trustee for CFM Asset Reconstruction Private Limited and Axis Bank Limited, the primary lenders to VIPL.RPower's Company Secretary cum Compliance Officer, Ramandeep Kaur, stated in the official disclosure, “The entire obligations of the Company as a Guarantor on behalf of VIPL stands fully settled resulting in release and discharge of Corporate Guarantee, Undertakings and all obligations and claims thereunder in relation to the outstanding debt of VIPL,” Reliance Power said in the official statement.The pledge enforcement encompasses 1,49,16,260 shares, representing 100 per cent of VIPL's equity share capital. RPower and its subsidiary, Rosa Power Supply Company Limited, created this pledge. As a result of this action, all voting rights associated with VIPL's shares will now be exclusively exercised by the lenders, who will also assume management and control of the company.It's worth noting that this transaction does not fall under the category of related party transactions, as the lenders are not affiliated with RPower's promoter group or associated companies. Furthermore, the company clarified that this change in ownership structure is not part of any broader scheme of arrangement and does not involve the sale, lease, or disposal of any undertaking.","cleaned_content":"rpower shares in focus reliance power on september \u003cONE_TEN\u003e announced the settlement of a massive \u003cTHREE_THOUSAND\u003e crore debt associated with its former subsidiary vidarbha industries power limited vipl as per an exchange filing reliance powers shares were trading up \u003cFIVE_PERCENT\u003e at \u003cTHREE_TEN\u003e on september \u003cONE_TEN\u003e at \u003cNINE_\u003e \u003cTHREE_TEN\u003e am on the nse rpower stock hit a \u003cFIVE_TEN\u003e week high on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cTHREE_TEN\u003e as per nse reliance power share price closed in the green up \u003cONE_PERCENT\u003e at \u003cTHREE_TEN\u003e on september \u003cONE_TEN\u003e on the bse vipl which contributed a mere \u003cZERO_PERCENT\u003e \u003cEIGHT_\u003e crores to rpowers consolidated revenue and held a negative net worth of \u003cTHREE_THOUSAND\u003e crore in the last financial year will cease to be a subsidiary of rpower effective september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the filing added the transaction initiated on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e involved the invocation of a pledge on vipls entire equity shareholding the action was taken by axis trustee services limited acting as a trustee for cfm asset reconstruction private limited and axis bank limited the primary lenders to vipl rpowers company secretary cum compliance officer ramandeep kaur stated in the official disclosure the entire obligations of the company as a guarantor on behalf of vipl stands fully settled resulting in release and discharge of corporate guarantee undertakings and all obligations and claims thereunder in relation to the outstanding debt of vipl reliance power said in the official statement the pledge enforcement encompasses \u003cONE_TEN_MILLION\u003e shares representing \u003cONE_HUNDRED_PERCENT\u003e of vipls equity share capital rpower and its subsidiary rosa power supply company limited created this pledge as a result of this action all voting rights associated with vipls shares will now be exclusively exercised by the lenders who will also assume management and control of the company its worth noting that this transaction does not fall under the category of related party transactions as the lenders are not affiliated with rpowers promoter group or associated companies furthermore the company clarified that this change in ownership structure is not part of any broader scheme of arrangement and does not involve the sale lease or disposal of any undertaking","timestamp":"2024-09-18T09:07:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}