{"url":"https://www.livemint.com/market/stock-market-news/midcap-stock-responsive-industries-expects-strong-growth-due-to-indias-infrastructure-plans-ventura-sees-48-upside-11726639254815.html","title":"Mid-cap Stock: Responsive Industries expects strong growth due to India’s infrastructure plans; Ventura sees 48% upside","description":"Responsive Industries expects significant growth due to India's infrastructure plans, with Ventura Securities initiating a buy rating and a target price of  ₹436, indicating a potential 48% upside. The company is positioned to supply PVC membranes for 75 tunnel projects funded by  ₹1 lakh crore.","content":"Responsive Industries announced that it anticipated substantial growth following a major government infrastructure initiative. Moreover, brokerage house Ventura Securities has initiated coverage with a buy call on the mid-cap stock with a target price of  ₹436, implying an upside potential of 48 per cent in the next two years.Responsive Industries Ltd., a leading supplier of PVC membranes and synthetic products, highlighted its potential for business expansion as the Ministry of Road Transport \u0026 Highways (MoRTH) announced plans to develop 75 tunnel projects across the country. The government has committed  ₹1 lakh crore to these projects, aimed at improving national infrastructure and connectivity.As per the filing, the company is well-positioned to supply PVC membranes for these tunnel constructions, which are essential for structural integrity and longevity. Responsive Industries, already involved in high-profile infrastructure projects like the Rishikesh-Karanprayag rail link and the Rangpo Tunnel in Sikkim, expects this initiative to drive significant demand for its products. A company spokesperson expressed enthusiasm about the opportunity, noting that the government’s focus on infrastructure aligns with Responsive Industries' long-term growth strategy.With the surge in infrastructure development, Responsive Industries is preparing to meet immediate supply needs and aims to establish long-term partnerships for future projects. The company reiterated its commitment to delivering top-quality products and supporting the nation’s growth through its expertise in PVC membrane technology.The stock has fallen 11 per cent in the last one year and over 3 per cent in 2024 YTD. Just in September so far, it has risen over 11 per cent after two straight months of decline. It shed over 7 per cent in August and 11 per cent in July.The mid-cap stock hit its 52-week high of  ₹364.80 in September last year. Currently trading at  ₹294.40, it is over 19 per cent away from a year-high. Meanwhile, it has advanced over 15 per cent from its 52-week low of  ₹255.25, recorded in June this year.The brokerage noted that Responsive Industries Ltd (RESP), India’s largest vinyl flooring producer and the fifth largest globally, had a strong B2B and B2C presence with 2,000 retail outlets in 15 US states. With the Indian government’s anti-dumping duty on vinyl tile imports since April 2023, the domestic market, valued at $11.4 billion in CY23, offered RESP significant growth potential.RESP, already supplying vinyl flooring to hospitality, medical, and commercial sectors, planned to enter the residential market via B2B, with future retail expansion. The brokerage rated RESP a \"BUY\" with a  ₹436 target price, implying a 45.3 per cent upside, citing the company’s long-term growth outlook, supported by expanding high-margin products.Ventura expects RESP’s revenue to grow at a 26.2 per cent CAGR to  ₹2,470 crore by FY27, with EBITDA and net earnings projected to grow at 50.4 per cent and 100.4 per cent CAGRs. Margins had stabilized post-PVC price disruptions, expected to improve to 22.8 per cent (EBITDA) and 15.7 per cent (net) by FY27. With current capacity utilization at 50-55 per cent and  ₹350 crore capex planned, cumulative free cash flow (FCF) over FY23-27 was estimated at  ₹729 crore, allowing RESP to stay debt-free. It forecasts RoE and RoIC to rise to 19.5 per cent and 31.7 per cent by FY27.","cleaned_content":"responsive industries announced that it anticipated substantial growth following a major government infrastructure initiative moreover brokerage house ventura securities has initiated coverage with a buy call on the mid cap stock with a target price of \u003cFOUR_HUNDRED\u003e implying an upside potential of \u003cFOUR_TEN_PERCENT\u003e in the next two years responsive industries ltd a leading supplier of pvc membranes and synthetic products highlighted its potential for business expansion as the ministry of road transport highways morth announced plans to develop \u003cSEVEN_TEN\u003e tunnel projects across the country the government has committed \u003cONE_\u003e lakh crore to these projects aimed at improving national infrastructure and connectivity as per the filing the company is well positioned to supply pvc membranes for these tunnel constructions which are essential for structural integrity and longevity responsive industries already involved in high profile infrastructure projects like the rishikesh karanprayag rail link and the rangpo tunnel in sikkim expects this initiative to drive significant demand for its products a company spokesperson expressed enthusiasm about the opportunity noting that the government s focus on infrastructure aligns with responsive industries long term growth strategy with the surge in infrastructure development responsive industries is preparing to meet immediate supply needs and aims to establish long term partnerships for future projects the company reiterated its commitment to delivering top quality products and supporting the nation s growth through its expertise in pvc membrane technology the stock has fallen \u003cONE_TEN_PERCENT\u003e in the last one year and over \u003cTHREE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd just in september so far it has risen over \u003cONE_TEN_PERCENT\u003e after two straight months of decline it shed over \u003cSEVEN_PERCENT\u003e in august and \u003cONE_TEN_PERCENT\u003e in july the mid cap stock hit its \u003cFIVE_TEN\u003e week high of \u003cTHREE_HUNDRED\u003e in september last year currently trading at \u003cTWO_HUNDRED\u003e it is over \u003cONE_TEN_PERCENT\u003e away from a year high meanwhile it has advanced over \u003cONE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_HUNDRED\u003e recorded in june this year the brokerage noted that responsive industries ltd resp india s largest vinyl flooring producer and the fifth largest globally had a strong b2b and b2c presence with \u003cTWO_THOUSAND\u003e retail outlets in \u003cONE_TEN\u003e us states with the indian government s anti dumping duty on vinyl tile imports since april \u003cTWO_THOUSAND\u003e the domestic market valued at \u003cONE_TEN\u003e billion in cy23 offered resp significant growth potential resp already supplying vinyl flooring to hospitality medical and commercial sectors planned to enter the residential market via b2b with future retail expansion the brokerage rated resp a buy with a \u003cFOUR_HUNDRED\u003e target price implying a \u003cFOUR_TEN_PERCENT\u003e upside citing the company s long term growth outlook supported by expanding high margin products ventura expects resp s revenue to grow at a \u003cTWO_TEN_PERCENT\u003e cagr to \u003cTWO_THOUSAND\u003e crore by fy27 with ebitda and net earnings projected to grow at \u003cFIVE_TEN_PERCENT\u003e and \u003cONE_HUNDRED_PERCENT\u003e cagrs margins had stabilized post pvc price disruptions expected to improve to \u003cTWO_TEN_PERCENT\u003e ebitda and \u003cONE_TEN_PERCENT\u003e net by fy27 with current capacity utilization at \u003cFIVE_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e and \u003cTHREE_HUNDRED\u003e crore capex planned cumulative free cash flow fcf over fy23 \u003cTWO_TEN\u003e was estimated at \u003cSEVEN_HUNDRED\u003e crore allowing resp to stay debt free it forecasts roe and roic to rise to \u003cONE_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e by fy27","timestamp":"2024-09-18T12:02:00+05:30","market_timestamp":"2024-09-18T12:02:00+05:30","off_market_hours":false}