{"url":"https://www.livemint.com/market/stock-market-news/semicon-india-2024-spel-asm-tech-rir-power-other-chip-stocks-surge-5-after-pm-modi-outlines-investment-boost-11726051260833.html","title":"SEMICON India 2024: SPEL, ASM Tech, RIR Power, other chip stocks surge 5% after PM Modi outlines investment plans","description":"SEMICON India 2024: Chip stocks including RIR Power, ASM Technologies gained over five per cent after PM Modi laid out India's chip manufacturing plans","content":"SEMICON India 2024: India's leading semiconductor stocks, such as SPEL Semiconductor Ltd, ASM Technologies, and RIR Power Electronics, among others, surged over five-six per cent on Wednesday, September 11, in a fresh stock-specific rally fueled by the government's semiconductor manufacturing and investment plans outlined by Prime Minister Narendra Modi.PM Modi inaugurated the Semicon India 2024 conference on the outskirts of the national capital. He emphasized the critical role of supply chain resilience in the global economy and pitched for India's chip manufacturing capabilities. This fueled a rally among chip stocks that extended gains to six per cent against the frontline indices, snapping a two-day streak due to profit booking.Also Read: SEMICON India 2024: Indian-made chips to investment boost, 5 key takeaways from PM Modi's speechSEMICON India 2024 will be held from September 11-13 at India Expo Mart, Greater Noida, Uttar Pradesh. The theme is \"Shaping the Semiconductor Future.\" The three-day conference will showcase India's semiconductor strategy and policy, which envisions making India a global semiconductor hub.PM Modi highlighted that India has already secured commitments of over  ₹1.5 lakh crore in investments towards semiconductor manufacturing. This is a major step towards positioning India as a global semiconductor hub, with several new projects in the pipeline to accelerate growth further.The PM added that India is targeting a $500 billion size for the electronics sector by the end of the decade, up from the present $150 billion. He added that the country's supply chain resilience is \"critical\" and cited the global disruption amid the COVID-19 pandemic as an example.PM Modi also pointed out the three critical factors driving the country's semiconductor ambitions—a reformist government, a robust and growing manufacturing base, and a tech-savvy market eager to adopt cutting-edge innovations. He referred to these as the \"Three-D Power,\" which provides a strong foundation for India’s semiconductor industry.PM Modi positioned India as a reliable and attractive destination for new semiconductor investments, showcasing the country’s stable policies, reform-oriented governance, and expanding manufacturing ecosystem. He assured global investors that India would soon become a semiconductor powerhouse.On September 10, PM Modi chaired the Semiconductor Executives' Roundtable at his residence. Following this, industry executives said the centre of gravity of the semiconductor industry is starting to shift towards India, saying that the country now has a suitable environment for the industry, which has put India on the global map in the semiconductor sector.Also Read: TSMC to make world’s most advanced semiconductors in US, gets $6.6 billion subsidyRIR Power Electronics and SPEL Semiconductor hit their respective upper circuits of five per cent on Wednesday. CG Power and Industrial Solutions gained over four per cent while ASM Technologies shares settled nearly six per cent higher by the end of the session. Moschip Technologies shares also gained five per cent.During Wednesday's trading session, domestic equity benchmarks Sensex and Nifty 50 showed considerable volatility as investors braced for the August US consumer inflation report that could help determine the scale of an expected interest rate cut from the US Federal Reserve next week.Nifty 50 index fell by 0.50 per cent, slipping below the 25,000 mark to close at 24,915 points. Similarly, the S\u0026P BSE Sensex declined by 0.53 per cent, settling at 81.485 points. The broader Nifty Midcap 100 index remained flat at 59,021 points.Also Read: ‘Our dream is to have Indian-made chip in every device in the world,’ says PM Modi at SEMICON India 2024Both benchmarks struggled for direction for most of the session before profit booking intensified in the final two hours of trade. Prashanth Tapse, Senior VP (Research), Mehta Equities Ltd said, “Volatility marked the trading session with intense profit-taking in late trades dragging key indices deeper in red and pulling down Nifty below the 25k mark at close.\"\"Slowdown fears in China coupled with falling crude oil prices have been causing jitters amongst the investors. All eyes will be on key US inflation data that will give some hint about the Fed's likely move on interest rates in its policy meeting later this month. Technically, if Nifty slips below the 24,753 mark, the downside risk is seen at the 24,441 mark, while the index could only face resistance above its all-time high at the 25,333.65 mark.'' added Tapse.","cleaned_content":"semicon india \u003cTWO_THOUSAND\u003e indias leading semiconductor stocks such as spel semiconductor ltd asm technologies and rir power electronics among others surged over five six per cent on wednesday september \u003cONE_TEN\u003e in a fresh stock specific rally fueled by the governments semiconductor manufacturing and investment plans outlined by prime minister narendra modi pm modi inaugurated the semicon india \u003cTWO_THOUSAND\u003e conference on the outskirts of the national capital he emphasized the critical role of supply chain resilience in the global economy and pitched for indias chip manufacturing capabilities this fueled a rally among chip stocks that extended gains to six per cent against the frontline indices snapping a two day streak due to profit booking also read semicon india \u003cTWO_THOUSAND\u003e indian made chips to investment boost \u003cFIVE_\u003e key takeaways from pm modis speechsemicon india \u003cTWO_THOUSAND\u003e will be held from september \u003cONE_TEN\u003e \u003cONE_TEN\u003e at india expo mart greater noida uttar pradesh the theme is shaping the semiconductor future the three day conference will showcase indias semiconductor strategy and policy which envisions making india a global semiconductor hub pm modi highlighted that india has already secured commitments of over \u003cONE_\u003e lakh crore in investments towards semiconductor manufacturing this is a major step towards positioning india as a global semiconductor hub with several new projects in the pipeline to accelerate growth further the pm added that india is targeting a \u003cFIVE_HUNDRED\u003e billion size for the electronics sector by the end of the decade up from the present \u003cONE_HUNDRED\u003e billion he added that the countrys supply chain resilience is critical and cited the global disruption amid the covid \u003cONE_TEN\u003e pandemic as an example pm modi also pointed out the three critical factors driving the countrys semiconductor ambitions a reformist government a robust and growing manufacturing base and a tech savvy market eager to adopt cutting edge innovations he referred to these as the three d power which provides a strong foundation for india s semiconductor industry pm modi positioned india as a reliable and attractive destination for new semiconductor investments showcasing the country s stable policies reform oriented governance and expanding manufacturing ecosystem he assured global investors that india would soon become a semiconductor powerhouse on september \u003cONE_TEN\u003e pm modi chaired the semiconductor executives roundtable at his residence following this industry executives said the centre of gravity of the semiconductor industry is starting to shift towards india saying that the country now has a suitable environment for the industry which has put india on the global map in the semiconductor sector also read tsmc to make world s most advanced semiconductors in us gets \u003cSIX_\u003e billion subsidyrir power electronics and spel semiconductor hit their respective upper circuits of five per cent on wednesday cg power and industrial solutions gained over four per cent while asm technologies shares settled nearly six per cent higher by the end of the session moschip technologies shares also gained five per cent during wednesdays trading session domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e showed considerable volatility as investors braced for the august us consumer inflation report that could help determine the scale of an expected interest rate cut from the us federal reserve next week nifty \u003cFIVE_TEN\u003e index fell by \u003cZERO_PERCENT\u003e slipping below the \u003cTWO_TEN_THOUSAND\u003e mark to close at \u003cTWO_TEN_THOUSAND\u003e points similarly the s p bse sensex declined by \u003cZERO_PERCENT\u003e settling at \u003cEIGHT_TEN\u003e points the broader nifty midcap \u003cONE_HUNDRED\u003e index remained flat at \u003cFIVE_TEN_THOUSAND\u003e points also read our dream is to have indian made chip in every device in the world says pm modi at semicon india \u003cTWO_THOUSAND\u003e both benchmarks struggled for direction for most of the session before profit booking intensified in the final two hours of trade prashanth tapse senior vp research mehta equities ltd said volatility marked the trading session with intense profit taking in late trades dragging key indices deeper in red and pulling down nifty below the \u003cTWO_TEN\u003e k mark at close slowdown fears in china coupled with falling crude oil prices have been causing jitters amongst the investors all eyes will be on key us inflation data that will give some hint about the feds likely move on interest rates in its policy meeting later this month technically if nifty slips below the \u003cTWO_TEN_THOUSAND\u003e mark the downside risk is seen at the \u003cTWO_TEN_THOUSAND\u003e mark while the index could only face resistance above its all time high at the \u003cTWO_TEN_THOUSAND\u003e mark added tapse","timestamp":"2024-09-11T16:32:00+05:30","market_timestamp":"2024-09-12T09:15:00+05:30","off_market_hours":true}