{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-motisons-jewellers-to-declare-stock-split-soon-details-here-11726539349004.html","title":"Multibagger stock Motisons Jewellers to declare stock split soon. Details here","description":"Multibagger gold stock split: Motisons Jewellers to consider share split in the upcoming board meeting. Know share price history.","content":"Multibagger gold stock Motisons Jewellers stock split: Motisons Jewellers Limited on September 16 announced that it had scheduled a Board Meeting for September 19, 2024 (Thursday), the company announced in an exchange filing.The proposal for sub-division/split of Equity Shares of the Company presently having a face value of Rs. 10 apiece in such manner as the Board may determine.\"Alteration in the Capital clause of Memorandum of Association of the Company after the above decision, and seek members’ approval for the aforesaid items,” the filing said.The company had reported repeated profits, at 56.2 per cent compound annual growth rate (CAGR) over the last 5 years, but has not paid any dividend yet.Motisons Jewellers IPO was offered at a price range of  ₹52 to  ₹55 per equity share, generating a substantial  ₹151.09 crore from this book-build issue. The public offer received an overwhelming response from the Indian primary market investors, with the public offer being subscribed over 170 times in just three days of bidding from 18th to 20th December 2023. Continuing the success story, Motisons Jewellers' stock was listed on BSE and NSE on 26 December 2023 at over a 100 per cent premium after the IPO was launched at  ₹52 to  ₹55. Today, Motisons Jewellers share price stands at around  ₹260.00 on NSE, indicating a significant gain of over 372 per cent against the issue price of  ₹52 to  ₹55 per equity share. Motisons Jewellers stock price hit its 52-week high on September 13, 2024, at  ₹273.90.During the board meeting, critical business decisions are expected to be discussed. The company’s Board of Directors will evaluate a proposal for the sub-division or split of its equity shares. Currently, each share has a face value of Rs. 10, and the specific split ratio will be determined during the meeting, according to a corporate filing.In addition to the share split, the Board will also consider amending the capital clause in the company's Memorandum of Association to reflect this change. The proposed amendments will require the approval of the company's shareholders. The filing also mentioned that other matters could be taken up during the meeting at the discretion of the Chairman.","cleaned_content":"multibagger gold stock motisons jewellers stock split motisons jewellers limited on september \u003cONE_TEN\u003e announced that it had scheduled a board meeting for september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e thursday the company announced in an exchange filing the proposal for sub division split of equity shares of the company presently having a face value of rs \u003cONE_TEN\u003e apiece in such manner as the board may determine alteration in the capital clause of memorandum of association of the company after the above decision and seek members approval for the aforesaid items the filing said the company had reported repeated profits at \u003cFIVE_TEN_PERCENT\u003e compound annual growth rate cagr over the last \u003cFIVE_\u003e years but has not paid any dividend yet motisons jewellers ipo was offered at a price range of \u003cFIVE_TEN\u003e to \u003cFIVE_TEN\u003e per equity share generating a substantial \u003cONE_HUNDRED\u003e crore from this book build issue the public offer received an overwhelming response from the indian primary market investors with the public offer being subscribed over \u003cONE_HUNDRED\u003e times in just three days of bidding from \u003cONE_TEN\u003e th to \u003cTWO_TEN\u003e th december \u003cTWO_THOUSAND\u003e continuing the success story motisons jewellers stock was listed on bse and nse on \u003cTWO_TEN\u003e december \u003cTWO_THOUSAND\u003e at over a \u003cONE_HUNDRED_PERCENT\u003e premium after the ipo was launched at \u003cFIVE_TEN\u003e to \u003cFIVE_TEN\u003e today motisons jewellers share price stands at around \u003cTWO_HUNDRED\u003e on nse indicating a significant gain of over \u003cTHREE_HUNDRED_PERCENT\u003e against the issue price of \u003cFIVE_TEN\u003e to \u003cFIVE_TEN\u003e per equity share motisons jewellers stock price hit its \u003cFIVE_TEN\u003e week high on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cTWO_HUNDRED\u003e during the board meeting critical business decisions are expected to be discussed the company s board of directors will evaluate a proposal for the sub division or split of its equity shares currently each share has a face value of rs \u003cONE_TEN\u003e and the specific split ratio will be determined during the meeting according to a corporate filing in addition to the share split the board will also consider amending the capital clause in the companys memorandum of association to reflect this change the proposed amendments will require the approval of the companys shareholders the filing also mentioned that other matters could be taken up during the meeting at the discretion of the chairman","timestamp":"2024-09-17T08:17:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}