{"url":"https://www.livemint.com/market/stock-market-news/zaggle-prepaid-stock-climbs-14-3-to-record-biggest-intraday-jump-in-6-months-what-s-leading-the-rally-11726040887466.html","title":"Zaggle Prepaid stock climbs 14.3% to record biggest intraday jump in 6 months; what’s leading the rally?","description":"Zaggle's stock has surged 14.3 per cent, reaching a record high of  ₹420, following a deal with HDFC Ergo. Over the past 13 months, including September, the stock has shown remarkable performance, ending in the positive for 10 of those months.","content":"Shares of Zaggle Prepaid Ocean Services, a SaaS fintech company, surged 14.3 per cent in today's intraday trade, reaching a record high of  ₹420 per share. This marks the stock's largest intraday gain in six months, as investors reacted positively to the company's new deal with HDFC Ergo.In a filing on Tuesday, Zaggle announced that it had signed an agreement to offer its Zaggle Propel reward platform to HDFC Ergo General Insurance, though the financial details of the deal were not disclosed. The company said this agreement will remain in effect until August 31, 2025, unless terminated earlier under specified conditions.Earlier this month, the company also partnered with Blue Star to provide an expense management platform and employee benefits for the appliance maker’s workforce. Additionally, it entered into an agreement with FCM Travel Solutions (India) to offer corporate travel services.These positive developments were reflected in the stock's performance in recent weeks, and since the release of the company's June quarter numbers, the stock has been on a consistent upward trajectory.Zaggle Prepaid kicked off FY25 with a strong performance, achieving revenue of  ₹252 crore in Q1 FY25, representing a remarkable 112.9 per cent increase year-over-year. The net profit for Q1 FY25 surged to  ₹16.7 crore, a massive rise of 713.6 per cent compared to  ₹2.06 crore in Q1 FY24. This significant growth was supported by reduced incentive payouts and effectively managed operating expenses.In this quarter, Zaggle onboarded 100 new clients and added 160,000 users, compared to 185 clients and 150,000 users in Q1 FY24. This reflects increasing acceptance among larger clients. Notable partnerships include a collaboration with Skydo to provide international inward remittance solutions for mid-market clients, and the recent addition of high-profile clients such as Wipro and PNB MetLife Insurance.Following the robust performance, the company has maintained its earlier growth target for FY25 of 45–55 per cent, with expectations that revenues for FY24 will double within two years. This growth is projected to be achieved with adjusted EBITDA margins of around 10 per cent or higher.Zaggle is also exploring EBITDA-accretive inorganic opportunities to broaden its product range and expand into new markets, including the US. Domestic brokerage Equirus Securities maintains a positive outlook on Zaggle's revenue growth prospects through FY24-FY27, fueled by recent product launches, Zoyer initiatives, and the expansion of offerings through forex cards and other new partnerships.Since its listing in September 2023, the stock has been on a steady upward trajectory, delivering substantial returns to its shareholders. With today’s increase, the shares have appreciated by 84 per cent so far this year and are now trading 150 per cent above their initial issue price of  ₹164 per share.Over the past 13 months, including September, the stock has shown remarkable performance, ending in the positive for 10 of those months. February saw the highest monthly gain at 52 per cent, followed by July with an 18 per cent increase. This month alone, the stock has already surged by 16 per cent, continuing its impressive run.Founded in 2011, Zaggle is a prominent player in the business-to-business-to-customer (B2B2C) segment. The company specialises in delivering fintech products, including prepaid cards and software-as-a-service (SaaS) solutions, to corporate clients across various sectors.","cleaned_content":"shares of zaggle prepaid ocean services a saas fintech company surged \u003cONE_TEN_PERCENT\u003e in todays intraday trade reaching a record high of \u003cFOUR_HUNDRED\u003e per share this marks the stocks largest intraday gain in six months as investors reacted positively to the companys new deal with hdfc ergo in a filing on tuesday zaggle announced that it had signed an agreement to offer its zaggle propel reward platform to hdfc ergo general insurance though the financial details of the deal were not disclosed the company said this agreement will remain in effect until august \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e unless terminated earlier under specified conditions earlier this month the company also partnered with blue star to provide an expense management platform and employee benefits for the appliance maker s workforce additionally it entered into an agreement with fcm travel solutions india to offer corporate travel services these positive developments were reflected in the stocks performance in recent weeks and since the release of the companys june quarter numbers the stock has been on a consistent upward trajectory zaggle prepaid kicked off fy25 with a strong performance achieving revenue of \u003cTWO_HUNDRED\u003e crore in q1 fy25 representing a remarkable \u003cONE_HUNDRED_PERCENT\u003e increase year over year the net profit for q1 fy25 surged to \u003cONE_TEN\u003e crore a massive rise of \u003cSEVEN_HUNDRED_PERCENT\u003e compared to \u003cTWO_\u003e crore in q1 fy24 this significant growth was supported by reduced incentive payouts and effectively managed operating expenses in this quarter zaggle onboarded \u003cONE_HUNDRED\u003e new clients and added \u003cONE_HUNDRED_THOUSAND\u003e users compared to \u003cONE_HUNDRED\u003e clients and \u003cONE_HUNDRED_THOUSAND\u003e users in q1 fy24 this reflects increasing acceptance among larger clients notable partnerships include a collaboration with skydo to provide international inward remittance solutions for mid market clients and the recent addition of high profile clients such as wipro and pnb metlife insurance following the robust performance the company has maintained its earlier growth target for fy25 of \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e with expectations that revenues for fy24 will double within two years this growth is projected to be achieved with adjusted ebitda margins of around \u003cONE_TEN_PERCENT\u003e or higher zaggle is also exploring ebitda accretive inorganic opportunities to broaden its product range and expand into new markets including the us domestic brokerage equirus securities maintains a positive outlook on zaggles revenue growth prospects through fy24 fy27 fueled by recent product launches zoyer initiatives and the expansion of offerings through forex cards and other new partnerships since its listing in september \u003cTWO_THOUSAND\u003e the stock has been on a steady upward trajectory delivering substantial returns to its shareholders with today s increase the shares have appreciated by \u003cEIGHT_TEN_PERCENT\u003e so far this year and are now trading \u003cONE_HUNDRED_PERCENT\u003e above their initial issue price of \u003cONE_HUNDRED\u003e per share over the past \u003cONE_TEN\u003e months including september the stock has shown remarkable performance ending in the positive for \u003cONE_TEN\u003e of those months february saw the highest monthly gain at \u003cFIVE_TEN_PERCENT\u003e followed by july with an \u003cONE_TEN_PERCENT\u003e increase this month alone the stock has already surged by \u003cONE_TEN_PERCENT\u003e continuing its impressive run founded in \u003cTWO_THOUSAND\u003e zaggle is a prominent player in the business to business to customer b2b2c segment the company specialises in delivering fintech products including prepaid cards and software as a service saas solutions to corporate clients across various sectors","timestamp":"2024-09-11T13:45:00+05:30","market_timestamp":"2024-09-11T13:45:00+05:30","off_market_hours":false}