{"url":"https://www.livemint.com/market/stock-market-news/itc-hul-dabur-others-share-prices-rise-up-to-26-in-6-months-buy-sell-or-hold-the-stocks-11726629576573.html","title":"ITC , HUL, Dabur, others share prices rise up to 26% in 6 months: Buy, Sell or Hold the stocks?","description":"Stock Market Today: ITC Ltd, Hindustan Unilever Ltd, Dabur India, others share prices have risen up to 26% in last 6 months. The gains in share prices have been led by some improvement in demand, signs of recovery. Check for factors leading to improved prospects and stock picks by analysts","content":"Stock Market today: ITC Ltd, Hindustan Unilever Ltd, Dabur India, others share prices have risen up to 26% in last 6 months. The gains in share prices have been led by some improvement in demand . The good monsoon also is leading to improved prospects for rural economy. The same is also being reflected in around 20% gains recorded by the Nifty FMCG index since start of June'2024.Analysts remain positive. those at Antique Stock Broking said that , rural segment (~52% volume) faced demand stress in last 4-years due to prolonged impact of COVID-19 and unprecedented inflation. With favorable global factors and domestic revival at play, the sector may draw investor’s attention driven by volume recovery in rural.As per Antique analysts, demand drivers will include the factors as downward trend in rural inflation and gradual increase in real wages in rural. The above normal monsoon, and also rise in Minimum support prices (MSPs) especially for pulses, will also accrue benefits.Analysts anticipate that the food industry will do better than the home and personal care industry. The premiumization in the latter will be at a slower rate. Also wile FMCG may generally benefit , in the retail stronger performance is being anticipated for jewelry and value clothing, the growth in the market for luggage and footwear will still remain watched for.The decline in crude and derivatives prices may also be positive for many consumer companies, like in paints as Asian Paints, Grasim (Birla Opus paints), Berger Paints and others.Meanwhile Antique has maintained positive ratings and recomended buy on prefer ITC, Emami Ltd, Dabur , Asian Paints , Jubilant FoodWorks Ltd and V-MART Retail.Emkay Global Financial Services also remains bullish on Emami. They expect steady rebound in rural demand, better seasonality, and enhanced execution, backed by a proficient management team supporting the earnings. improving financials will support valuations.LKP Securities has also identified some opportunities in the space with robust volume growth, presence in bigger TAM (Total Addressable Market), ability to compete with large companies and strong fundamentals. Thus we are calling them “THE SFMCGs” (Super Fast Moving Consumer Goods) companies thy have identified include names as Mrs.Bector Food Specialities, CCL Products and Jyothy Laboratories.","cleaned_content":"stock market today itc ltd hindustan unilever ltd dabur india others share prices have risen up to \u003cTWO_TEN_PERCENT\u003e in last \u003cSIX_\u003e months the gains in share prices have been led by some improvement in demand the good monsoon also is leading to improved prospects for rural economy the same is also being reflected in around \u003cTWO_TEN_PERCENT\u003e gains recorded by the nifty fmcg index since start of june2024 analysts remain positive those at antique stock broking said that rural segment \u003cFIVE_TEN_PERCENT\u003e volume faced demand stress in last \u003cFOUR_\u003e years due to prolonged impact of covid \u003cONE_TEN\u003e and unprecedented inflation with favorable global factors and domestic revival at play the sector may draw investor s attention driven by volume recovery in rural as per antique analysts demand drivers will include the factors as downward trend in rural inflation and gradual increase in real wages in rural the above normal monsoon and also rise in minimum support prices msps especially for pulses will also accrue benefits analysts anticipate that the food industry will do better than the home and personal care industry the premiumization in the latter will be at a slower rate also wile fmcg may generally benefit in the retail stronger performance is being anticipated for jewelry and value clothing the growth in the market for luggage and footwear will still remain watched for the decline in crude and derivatives prices may also be positive for many consumer companies like in paints as asian paints grasim birla opus paints berger paints and others meanwhile antique has maintained positive ratings and recomended buy on prefer itc emami ltd dabur asian paints jubilant foodworks ltd and v mart retail emkay global financial services also remains bullish on emami they expect steady rebound in rural demand better seasonality and enhanced execution backed by a proficient management team supporting the earnings improving financials will support valuations lkp securities has also identified some opportunities in the space with robust volume growth presence in bigger tam total addressable market ability to compete with large companies and strong fundamentals thus we are calling them the sfmcgs super fast moving consumer goods companies thy have identified include names as mrs bector food specialities ccl products and jyothy laboratories","timestamp":"2024-09-18T12:57:00+05:30","market_timestamp":"2024-09-18T12:57:00+05:30","off_market_hours":false}