{"url":"https://www.livemint.com/market/stock-market-news/saksoft-up-190-in-2-years-1000-in-4-years-will-this-small-cap-it-stock-keep-climbing-11726729005680.html","title":"Saksoft soars 190% in 2 years, 1,000% in 4 years; Monarch sees 60% more upside for this small-cap IT stock","description":"Monarch Networth Capital has initiated coverage on the stock with a ‘buy’ rating and set a target price of  ₹435 apiece. Under the bull case scenario, the brokerage set an even bigger target price of  ₹475, reflecting an upside rally of 60%.","content":"Saksoft, a small-cap IT stock, has delivered a phenomenal performance in recent years, providing over 10x returns to its shareholders by maintaining a strong upward trajectory. While the stock has experienced some profit bookings in recent months, it continues to demonstrate substantial long-term growth.In the past two years alone, the stock's value surged from  ₹102 to its current price of  ₹290, marking an impressive 190 percent gain. The stock has delivered a massive return of nearly 1,000 percent over the last four years and a staggering 7,150 percent over the past decade.Notably, the stock delivered multibagger returns in two of the last four years. In CY23, it achieved a remarkable 161 percent gain, following a 154 percent return in CY21.The company is a digital transformation partner for mid-sized global enterprises, specialising in business transformation solutions across various sectors such as fintech, digital commerce, transportation and logistics, and hi-tech media and utilities.Saksoft offers services in application engineering, quality assurance and testing, data analytics, cloud infrastructure, and cybersecurity. Over time, It has evolved from focusing on digital transformation to product engineering. It helps businesses upgrade their IT systems with technology solutions, expert consulting, and analytics, including IoT, robotics, custom applications, and cloud support.Headquartered in Chennai, India, Saksoft operates 16 offices across India, Europe, Asia, and the USA. The company generates 55 percent of its revenue from digital engineering, 25 percent from data and cloud, 18 percent from testing, and 2 percent from infrastructure and security. Its high-margin areas include digital engineering and testing. Margins in data and cloud have the potential to improve as AI-related deals are expected to increase over the next two years.In its recent note, domestic brokerage firm Monarch Networth Capital initiated coverage on the stock with a ‘buy’ rating and set a target price of  ₹435 apiece, suggesting a 47 percent upside potential from its latest trading price. Under the bull case scenario, the brokerage set an even bigger target price of  ₹475, reflecting a 60 percent upside rally.Monarch believes the stock has the potential to trade at higher valuations, driven by continued IT spending in key business segments such as digital engineering, cloud, data, and digital commerce for Saksoft.It said that digital engineering remains the company's core growth driver, while the data and cloud segment is expected to grow at a 20 percent CAGR. Testing services continue to be highly profitable. Strong partnerships with Microsoft Azure, AWS, HCL Commerce, Salesforce, and Databricks further enhance Saksoft’s service offerings.Specialising in sectors like fintech, hi-tech, transport and logistics, and retail, Saksoft leverages over 15 years of expertise, maintaining long-term relationships with 80 percent of its top 20 clients, many of whom have been partners for over a decade.The brokerage highlighted the company's acquisition-driven ‘String of Pearls’ strategy, which has brought in premium clients and contributed 7 percent to 8 percent growth over the last five years. Recent acquisitions, such as Solveda and Augmento, have enhanced its expertise in cloud, product engineering, and digital commerce.The brokerage is projecting a CAGR of 21.0 percent in revenue, 22.3 percent in EBITDA, and 24.4 percent in PAT over FY25-FY27E. It has valued the business at 25x FY27E EPS, aligning with micro-and small-cap IT companies but at a discount to mid-cap peers.According to the brokerage, Saksoft has consistently outperformed its peers across all key metrics, showcasing solid growth despite challenges in the global IT sector. Over the past decade, the company has delivered more than 20 percent EPS growth, driven by strategic acquisitions that have expanded both its capabilities and geographic reach.These acquisitions, as per Monarch, have played a crucial role in maintaining strong profitability with high-teen EBITDA margins. The company stands out due to its wide range of capabilities, including over a decade of expertise in testing, data and automation, product engineering, and DevOps.Saksoft also boasts a well-balanced global presence and serves premium clients with revenues ranging from $200 million to $3 billion. The brokerage said the company has carved out a competitive advantage by focusing on niche sectors where it has deep experience.Financially, it leads its peers with the highest ROCE, EBITDA margins, PAT margins, and EPS growth and has strong partnerships with industry giants.","cleaned_content":"saksoft a small cap it stock has delivered a phenomenal performance in recent years providing over \u003cONE_TEN\u003e x returns to its shareholders by maintaining a strong upward trajectory while the stock has experienced some profit bookings in recent months it continues to demonstrate substantial long term growth in the past two years alone the stocks value surged from \u003cONE_HUNDRED\u003e to its current price of \u003cTWO_HUNDRED\u003e marking an impressive \u003cONE_HUNDRED_PERCENT\u003e gain the stock has delivered a massive return of nearly \u003cONE_THOUSAND_PERCENT\u003e over the last four years and a staggering \u003cSEVEN_THOUSAND_PERCENT\u003e over the past decade notably the stock delivered multibagger returns in two of the last four years in cy23 it achieved a remarkable \u003cONE_HUNDRED_PERCENT\u003e gain following a \u003cONE_HUNDRED_PERCENT\u003e return in cy21 the company is a digital transformation partner for mid sized global enterprises specialising in business transformation solutions across various sectors such as fintech digital commerce transportation and logistics and hi tech media and utilities saksoft offers services in application engineering quality assurance and testing data analytics cloud infrastructure and cybersecurity over time it has evolved from focusing on digital transformation to product engineering it helps businesses upgrade their it systems with technology solutions expert consulting and analytics including iot robotics custom applications and cloud support headquartered in chennai india saksoft operates \u003cONE_TEN\u003e offices across india europe asia and the usa the company generates \u003cFIVE_TEN_PERCENT\u003e of its revenue from digital engineering \u003cTWO_TEN_PERCENT\u003e from data and cloud \u003cONE_TEN_PERCENT\u003e from testing and \u003cTWO_PERCENT\u003e from infrastructure and security its high margin areas include digital engineering and testing margins in data and cloud have the potential to improve as ai related deals are expected to increase over the next two years in its recent note domestic brokerage firm monarch networth capital initiated coverage on the stock with a buy rating and set a target price of \u003cFOUR_HUNDRED\u003e apiece suggesting a \u003cFOUR_TEN_PERCENT\u003e upside potential from its latest trading price under the bull case scenario the brokerage set an even bigger target price of \u003cFOUR_HUNDRED\u003e reflecting a \u003cSIX_TEN_PERCENT\u003e upside rally monarch believes the stock has the potential to trade at higher valuations driven by continued it spending in key business segments such as digital engineering cloud data and digital commerce for saksoft it said that digital engineering remains the companys core growth driver while the data and cloud segment is expected to grow at a \u003cTWO_TEN_PERCENT\u003e cagr testing services continue to be highly profitable strong partnerships with microsoft azure aws hcl commerce salesforce and databricks further enhance saksoft s service offerings specialising in sectors like fintech hi tech transport and logistics and retail saksoft leverages over \u003cONE_TEN\u003e years of expertise maintaining long term relationships with \u003cEIGHT_TEN_PERCENT\u003e of its top \u003cTWO_TEN\u003e clients many of whom have been partners for over a decade the brokerage highlighted the companys acquisition driven string of pearls strategy which has brought in premium clients and contributed \u003cSEVEN_PERCENT\u003e to \u003cEIGHT_PERCENT\u003e growth over the last five years recent acquisitions such as solveda and augmento have enhanced its expertise in cloud product engineering and digital commerce the brokerage is projecting a cagr of \u003cTWO_TEN_PERCENT\u003e in revenue \u003cTWO_TEN_PERCENT\u003e in ebitda and \u003cTWO_TEN_PERCENT\u003e in pat over fy25 fy27e it has valued the business at \u003cTWO_TEN\u003e x fy27e eps aligning with micro and small cap it companies but at a discount to mid cap peers according to the brokerage saksoft has consistently outperformed its peers across all key metrics showcasing solid growth despite challenges in the global it sector over the past decade the company has delivered more than \u003cTWO_TEN_PERCENT\u003e eps growth driven by strategic acquisitions that have expanded both its capabilities and geographic reach these acquisitions as per monarch have played a crucial role in maintaining strong profitability with high teen ebitda margins the company stands out due to its wide range of capabilities including over a decade of expertise in testing data and automation product engineering and devops saksoft also boasts a well balanced global presence and serves premium clients with revenues ranging from \u003cTWO_HUNDRED\u003e million to \u003cTHREE_\u003e billion the brokerage said the company has carved out a competitive advantage by focusing on niche sectors where it has deep experience financially it leads its peers with the highest roce ebitda margins pat margins and eps growth and has strong partnerships with industry giants","timestamp":"2024-09-19T12:52:00+05:30","market_timestamp":"2024-09-19T12:52:00+05:30","off_market_hours":false}