{"url":"https://www.livemint.com/market/stock-market-news/brent-crude-sheds-25-ytd-on-soft-demand-should-you-buy-omc-stocks-d-street-experts-pick-ongc-oil-india-11726588969548.html","title":"Brent crude crashes 25% YTD on soft demand: Should you buy OMC stocks? D-Street experts pick ONGC, Oil India","description":"Brent crude crashed to a three-year low last week. Ahead of the US Federal Reserve policy decision, crude oil is teetering on the edge of a potential upside as the widely anticipated rate cut could revitalize demand","content":"Brent crude futures have lost nearly 25 per cent year-to-date (YTD) over softer demand and a low-risk premium so far in 2024. At its lowest in the last nine months, the crude oil benchmark declined to a 33-month low at under $70 per barrel due to continued weakness in Chinese economic growth and uncertainty on US economic growth. China is the world's top consumer/importer of crude oil.Adding to downside concerns is the potential oversupply caused by the group Organisation of Petroleum Exporting Countries and its allies (OPEC+) phasing out 2.2 million barrels per day (mbd) voluntary output cuts over a year from December 2024 to November 2025. However, D-Street experts believe the decline in oil prices was exaggerated due to the vast financial leverage in crude.Also Read: Crude View: D-Street experts peg Brent at $75-80 in near-term, Morgan Stanley cuts forecast by $5 on soft demandHistorically, softer crude oil prices have eased inflationary pressures and reduced petrol and diesel retail prices. Ahead of the much-awaited US Federal Reserve policy decision due September 18, crude oil prices are teetering on the edge of a potential upside as the central bank's widely anticipated rate cut could revitalize demand in the top oil-consuming nation.OPEC+ has paused its planned October oil output hike for two months amid fragile demand and plentiful supply, especially after the Libya deal resolution reports. OPEC's key coalition members will not proceed with the scheduled hike of 180,000 barrels per day (bpd) in October. OPEC is holding back a fraction of the 5.86 million bpd of output, equal to 5.7 per cent of global demand, to support the market over demand worries and rising supply outside the group.According to domestic brokerage JM Financials, the pricing power of the OPEC+ group has strengthened over the past 2-3 years due to limited growth in US oil production as US shale investors have become disciplined in capital investment.Also Read: OPEC+ to pause planned October oil output hike of 180,000 bpd for two months after Brent crashes to 14-month lowOPEC+ has shown a strong ability to cut output by ~10mmbpd in early CY20 to offset the ~10 per cent decline in global oil demand post-COVID-19. OPEC+ can still cut output by 3-5mmbpd to offset any macro-related risk to demand.According to prices on Investing.com, Brent crude futures hit an intra-day high of $92.18 per barrel on April 12, 2024, its highest peak achieved YTD. The benchmark hit its lowest YTD level on September 10 at $68.68 per barrel. The difference between the two figures gives an average decline of 25 per cent YTD.JM Financial believes the risk-reward of India's three state-owned oil marketing companies (OMCs) is still unfavourable. The brokerage believes OMCs could remain at risk due to continued weakness in China’s domestic oil demand and gross marketing margin to be higher than the historical average of  ₹3.5/litre.Also Read: Oil recovers 3% from 33-month low after Hurricane Francine instils supply fears; Brent at $71, WTI gains over $2However, it added that historical precedent suggests that the government cuts retail petrol/diesel prices and/or hikes excise duty on fuel if crude price sustains at lower levels. Hence, lower crude price benefits in the OMC marketing segment will likely be limited to only a few months.According to the brokerage, the valuations of OMCs are also trading at a 20-40 per cent premium to historical P/B valuations: -Hindustan Petroleum Corp Ltd (HPCL) at 1.5x FY26 P/B (vs. average of 1.0x)-Indian Oil Corp Ltd (IOCL) is trading at 1.2x FY26 P/B (vs. average of 1.0x)Also Read: Windfall tax on petroleum crude slashed to ’zero’ with effect from THIS date; Diesel, ATF retained at nil-Bharat Petroleum Corp Ltd (BPCL) is trading at 1.6x FY26 P/B (vs. average of 1.3x). Moreover, their aggressive capex plans accentuate the key structural concern, as many projects fail to create long-term shareholder value.The brokerage has left the target prices (TP) unchanged for all three OMCs and gives a ‘hold’ rating for BPCL. \"We reiterate that their risk-reward is still unfavourable and maintain our SELL rating on HPCL (unchanged target price of  ₹290) and IOCL (unchanged TP of  ₹150) and our HOLD rating on BPCL (unchanged TP of  ₹290),'' said JM Financials on OMC stocks.Also Read: Crude oil plunges on demand-supply imbalance in 2024, Brent down 20% in 12 months; OPEC+ in focus\"We maintain BUY on Oil India (unchanged TP of INR 720), and also ONGC (unchanged TP of INR 340), given the robust production growth outlook in the next 1-3 years (20-30 per cent for Oil India and 12-15 per cent for ONGC) and our expectation of OPEC+ supporting crude ~$75/bbl,'' said JM Financials.Further, Oil India’s earnings growth is likely to be aided by the expansion of the NRL refinery from three to nine million barrels per day by December 2025, given the management guidance that excise duty benefits will continue for the expanded capacity.Also Read: Oil rises 2% from three-year low after traders bet on demand growth ahead of US Fed rate cut; Brent at $73/bbl\"However, ONGC/Oil India's earnings will be negatively impacted if Brent crude price sustains below $75/bbl. Every $5/bbl decline in net crude realisation results in a decline in EPS and valuation by six-eight per cent. At CMP, ONGC trades at 5.6x FY26E EPS and 0.9x FY26E BV, and Oil India trades at 9.2x FY26E EPS and 1.5x FY26E BV,\" added the brokerage.","cleaned_content":"brent crude futures have lost nearly \u003cTWO_TEN_PERCENT\u003e year to date ytd over softer demand and a low risk premium so far in \u003cTWO_THOUSAND\u003e at its lowest in the last nine months the crude oil benchmark declined to a \u003cTHREE_TEN\u003e month low at under \u003cSEVEN_TEN\u003e per barrel due to continued weakness in chinese economic growth and uncertainty on us economic growth china is the worlds top consumer importer of crude oil adding to downside concerns is the potential oversupply caused by the group organisation of petroleum exporting countries and its allies opec phasing out \u003cTWO_\u003e million barrels per day mbd voluntary output cuts over a year from december \u003cTWO_THOUSAND\u003e to november \u003cTWO_THOUSAND\u003e however d street experts believe the decline in oil prices was exaggerated due to the vast financial leverage in crude also read crude view d street experts peg brent at \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e in near term morgan stanley cuts forecast by \u003cFIVE_\u003e on soft demandhistorically softer crude oil prices have eased inflationary pressures and reduced petrol and diesel retail prices ahead of the much awaited us federal reserve policy decision due september \u003cONE_TEN\u003e crude oil prices are teetering on the edge of a potential upside as the central banks widely anticipated rate cut could revitalize demand in the top oil consuming nation opec has paused its planned october oil output hike for two months amid fragile demand and plentiful supply especially after the libya deal resolution reports opecs key coalition members will not proceed with the scheduled hike of \u003cONE_HUNDRED_THOUSAND\u003e barrels per day bpd in october opec is holding back a fraction of the \u003cFIVE_\u003e million bpd of output equal to \u003cFIVE_PERCENT\u003e of global demand to support the market over demand worries and rising supply outside the group according to domestic brokerage jm financials the pricing power of the opec group has strengthened over the past \u003cTWO_\u003e \u003cTHREE_\u003e years due to limited growth in us oil production as us shale investors have become disciplined in capital investment also read opec to pause planned october oil output hike of \u003cONE_HUNDRED_THOUSAND\u003e bpd for two months after brent crashes to \u003cONE_TEN\u003e month lowopec has shown a strong ability to cut output by \u003cONE_TEN\u003e mmbpd in early cy20 to offset the \u003cONE_TEN_PERCENT\u003e decline in global oil demand post covid \u003cONE_TEN\u003e opec can still cut output by \u003cTHREE_\u003e \u003cFIVE_\u003e mmbpd to offset any macro related risk to demand according to prices on investing com brent crude futures hit an intra day high of \u003cNINE_TEN\u003e per barrel on april \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e its highest peak achieved ytd the benchmark hit its lowest ytd level on september \u003cONE_TEN\u003e at \u003cSIX_TEN\u003e per barrel the difference between the two figures gives an average decline of \u003cTWO_TEN_PERCENT\u003e ytd jm financial believes the risk reward of indias three state owned oil marketing companies omcs is still unfavourable the brokerage believes omcs could remain at risk due to continued weakness in china s domestic oil demand and gross marketing margin to be higher than the historical average of \u003cTHREE_\u003e litre also read oil recovers \u003cTHREE_PERCENT\u003e from \u003cTHREE_TEN\u003e month low after hurricane francine instils supply fears brent at \u003cSEVEN_TEN\u003e wti gains over \u003cTWO_\u003e however it added that historical precedent suggests that the government cuts retail petrol diesel prices and or hikes excise duty on fuel if crude price sustains at lower levels hence lower crude price benefits in the omc marketing segment will likely be limited to only a few months according to the brokerage the valuations of omcs are also trading at a \u003cTWO_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e premium to historical p b valuations hindustan petroleum corp ltd hpcl at \u003cONE_\u003e x fy26 p b vs average of \u003cONE_\u003e x indian oil corp ltd iocl is trading at \u003cONE_\u003e x fy26 p b vs average of \u003cONE_\u003e x also read windfall tax on petroleum crude slashed to zero with effect from this date diesel atf retained at nil bharat petroleum corp ltd bpcl is trading at \u003cONE_\u003e x fy26 p b vs average of \u003cONE_\u003e x moreover their aggressive capex plans accentuate the key structural concern as many projects fail to create long term shareholder value the brokerage has left the target prices tp unchanged for all three omcs and gives a hold rating for bpcl we reiterate that their risk reward is still unfavourable and maintain our sell rating on hpcl unchanged target price of \u003cTWO_HUNDRED\u003e and iocl unchanged tp of \u003cONE_HUNDRED\u003e and our hold rating on bpcl unchanged tp of \u003cTWO_HUNDRED\u003e said jm financials on omc stocks also read crude oil plunges on demand supply imbalance in \u003cTWO_THOUSAND\u003e brent down \u003cTWO_TEN_PERCENT\u003e in \u003cONE_TEN\u003e months opec in focus we maintain buy on oil india unchanged tp of inr \u003cSEVEN_HUNDRED\u003e and also ongc unchanged tp of inr \u003cTHREE_HUNDRED\u003e given the robust production growth outlook in the next \u003cONE_\u003e \u003cTHREE_\u003e years \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e for oil india and \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e for ongc and our expectation of opec supporting crude \u003cSEVEN_TEN\u003e bbl said jm financials further oil india s earnings growth is likely to be aided by the expansion of the nrl refinery from three to nine million barrels per day by december \u003cTWO_THOUSAND\u003e given the management guidance that excise duty benefits will continue for the expanded capacity also read oil rises \u003cTWO_PERCENT\u003e from three year low after traders bet on demand growth ahead of us fed rate cut brent at \u003cSEVEN_TEN\u003e bbl however ongc oil indias earnings will be negatively impacted if brent crude price sustains below \u003cSEVEN_TEN\u003e bbl every \u003cFIVE_\u003e bbl decline in net crude realisation results in a decline in eps and valuation by six eight per cent at cmp ongc trades at \u003cFIVE_\u003e x fy26e eps and \u003cZERO_\u003e x fy26e bv and oil india trades at \u003cNINE_\u003e x fy26e eps and \u003cONE_\u003e x fy26e bv added the brokerage","timestamp":"2024-09-17T21:37:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}