{"url":"https://www.livemint.com/market/stock-market-news/super-fmcgs-mrs-bectors-to-jyothy-labs-lkp-bets-on-3-consumer-staples-over-robust-volume-eyes-20-30-returns-11726847947103.html","title":"Super FMCGs! Mrs Bectors to Jyothy Labs—LKP bets on 3 consumer staples over robust volume, eyes 20-30% returns","description":"Super FMCGs: LKP Securities' top FMCG stock picks include Mrs.Bector Food Specialities, CCL Products, and Jyothy Laboratories Ltd over robust volume growth and revenue margins.","content":"Fast-moving consumer goods (FMCG) companies (largely staple companies) have struggled to improve their volume growth in the last few years due to sluggish demand growth, especially in rural areas. Domestic brokerage LKP Securities noted large consumer staple companies reporting an average mid- to high single-digit volume growth between FY20-24, unlike a few smaller size FMCG companies, which have, on average, delivered low to mid-teens volume growth.‘’This shows that these companies are notably gaining market share and growing at least by 1-2x faster than their larger peers. Based on this, we have identified companies with robust volume growth, presence in bigger TAM (Total Addressable Market), ability to compete with large companies, and strong fundamentals,\" said LKP Securities.Also Read: FMCG stocks to recover? Green shoots visible in rural demand; D-Street experts peg ‘hold’ for long-term, HUL is ‘buy’The brokerage has termed these companies ‘Super Fast Moving Consumer Goods’ or Super FMCGs. LKP Securities' top FMCG stock picks include Mrs. Bector Food Specialities Ltd, CCL Products, and Jyothy Laboratories Ltd.Most staple companies posted mid to high single-digit revenue growth despite facing challenges such as severe heatwaves in the northern region, heightened competitive intensity, and the general election impact.The growth was primarily led by a rural recovery, with rural markets outpacing urban growth. Rural demand continues to show steady improvement, with the rural market now surpassing urban areas, largely due to distribution expansion and region-specific launches.The sector has witnessed growth in rural consumption in volume terms, outpacing urban consumption for the first time in five quarters in January-March. According to Nielsen, rural consumption grew 7.6 per cent year-on-year (YoY) in Q1CY24, overtaking that in urban areas, which stood at 5.7 per cent.Also Read: Stocks to buy: Dabur, Godrej Consumer Products, Emami among InCred Equities’ top FMCG stock picksFMCG products have the highest penetration in rural areas and have been impacted the most compared to other consumer baskets. The mass segment has a large user base but slow income growth. Such high inflation has reduced the affordability of consumption. Households are over-indexed on food in their cost mix. With softer general inflation and price cuts for FMCG, the income-to-cost mix gradually stabilised over the last 6-12 months.The key growth drivers for the Indian FMCG sector are as follows:-Rapid rise in premiumisation-Growing adoption of technology-Increasing marketing activities through social media influencers-Surging rural penetration-Rising E-commerce growth.Lower general inflation and a reduction in FMCG prices have provided some relief, improving affordability. This stabilization, combined with price cuts in certain key FMCG categories, suggests that the sector is well-positioned for a recovery in mass segment consumption, particularly in rural areas. This renewed optimism for rural demand is expected to play a significant role in driving overall growth in the FMCG sector in the coming quarters.Also Read: Stocks to buy: ITC, HUL jump 18-27% in the last three months; what drives these FMCG stocks? — explained1.Mrs. Bectors Food Specialities LimitedMrs. Bectors Food Specialities Ltd has established itself as a leading player in northern India’s non-glucose biscuits and premium brands segment, despite facing stiff competition. The company is expanding its distribution reach and strategically growing its presence with new facilities in Rajpura, Khopoli, and an upcoming biscuit plant in Dhar. This expansion gives the firm a competitive advantage over unorganized players as it aims to become a pan-India player.“We believe Mrs Bectors will benefit from premiumisation trends in the underlying sector supported by structural tailwinds, strategic expansion of capacities / distribution reach in key areas, new product innovations across categories, and continued market share gains in the export business. We initiate coverage with a ‘BUY’ rating on the company and a target price (TP) of  ₹2,100,” said LKP Securities. The brokerage believes the FMCG stock will provide 18 per cent return at TP over the next 12 months.Also Read: Nifty FMCG hits all-time high for 4th straight session, gains 16.5% in 3 months; what’s fueling the surge?2.Jyothy LabsJyothy Labs Ltd has undergone a substantial transformation from a promoter-driven, southcentric, single-product entity to a professionally managed, and multi-product company operating nationwide. It has achieved consistent Rev/EBITDA/PAT CAGR of 13/19/24 per cent respectively between FY20-24.“Adopting above the line marketing strategy from below the line spending strategy, strategic pan-India expansion in distribution network, focusing on low-unit packs across product lines to enter into basket of consumers especially in rural areas boosted growth. We initiate coverage on Jyothy Labs with a ‘BUY’ rating and a TP of  ₹702,” said LKP Securities. The brokerage believes the FMCG stock will provide 28 per cent return at TP over the next 12 months.Also Read: Stocks to buy: HUL, Godrej Consumer, Dabur among top stock picks in the FMCG sector by MOFSL3.CCL Products (India) LimitedCCL Products has been consistent in performance despite severe volatility in coffee prices, intense competition, supply chain disruptions etc. It has maintained its volume growth trajectory and profitability on a per kilo basis. The supply chain disruptions across the globe has forced several coffee companies globally to diversify their supplies and therefore are seeking to acquire new alliances with manufacturers having global presence like CCL.“We believe CCL will clock mid-teens volume growth owing to doubling of capacity from 38,500 MT in FY22 to ~77,000 MT by FY25 across Vietnam and India in its value-added products especially freeze dried coffee and small packs, addition of high margin products like speciality coffee (five per cent of sales), along with cost-efficient business model. We initiate coverage on CCL Products with a ‘BUY’ rating and a TP of  ₹881,” said LKP Securities. The brokerage believes the FMCG stock will provide 23 per cent return at TP over the next 12 months.","cleaned_content":"fast moving consumer goods fmcg companies largely staple companies have struggled to improve their volume growth in the last few years due to sluggish demand growth especially in rural areas domestic brokerage lkp securities noted large consumer staple companies reporting an average mid to high single digit volume growth between fy20 \u003cTWO_TEN\u003e unlike a few smaller size fmcg companies which have on average delivered low to mid teens volume growth this shows that these companies are notably gaining market share and growing at least by \u003cONE_\u003e \u003cTWO_\u003e x faster than their larger peers based on this we have identified companies with robust volume growth presence in bigger tam total addressable market ability to compete with large companies and strong fundamentals said lkp securities also read fmcg stocks to recover green shoots visible in rural demand d street experts peg hold for long term hul is buy the brokerage has termed these companies super fast moving consumer goods or super fmcgs lkp securities top fmcg stock picks include mrs bector food specialities ltd ccl products and jyothy laboratories ltd most staple companies posted mid to high single digit revenue growth despite facing challenges such as severe heatwaves in the northern region heightened competitive intensity and the general election impact the growth was primarily led by a rural recovery with rural markets outpacing urban growth rural demand continues to show steady improvement with the rural market now surpassing urban areas largely due to distribution expansion and region specific launches the sector has witnessed growth in rural consumption in volume terms outpacing urban consumption for the first time in five quarters in january march according to nielsen rural consumption grew \u003cSEVEN_PERCENT\u003e year on year yoy in q1cy24 overtaking that in urban areas which stood at \u003cFIVE_PERCENT\u003e also read stocks to buy dabur godrej consumer products emami among incred equities top fmcg stock picksfmcg products have the highest penetration in rural areas and have been impacted the most compared to other consumer baskets the mass segment has a large user base but slow income growth such high inflation has reduced the affordability of consumption households are over indexed on food in their cost mix with softer general inflation and price cuts for fmcg the income to cost mix gradually stabilised over the last \u003cSIX_\u003e \u003cONE_TEN\u003e months the key growth drivers for the indian fmcg sector are as follows rapid rise in premiumisation growing adoption of technology increasing marketing activities through social media influencers surging rural penetration rising e commerce growth lower general inflation and a reduction in fmcg prices have provided some relief improving affordability this stabilization combined with price cuts in certain key fmcg categories suggests that the sector is well positioned for a recovery in mass segment consumption particularly in rural areas this renewed optimism for rural demand is expected to play a significant role in driving overall growth in the fmcg sector in the coming quarters also read stocks to buy itc hul jump \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e in the last three months what drives these fmcg stocks explained1 mrs bectors food specialities limitedmrs bectors food specialities ltd has established itself as a leading player in northern india s non glucose biscuits and premium brands segment despite facing stiff competition the company is expanding its distribution reach and strategically growing its presence with new facilities in rajpura khopoli and an upcoming biscuit plant in dhar this expansion gives the firm a competitive advantage over unorganized players as it aims to become a pan india player we believe mrs bectors will benefit from premiumisation trends in the underlying sector supported by structural tailwinds strategic expansion of capacities distribution reach in key areas new product innovations across categories and continued market share gains in the export business we initiate coverage with a buy rating on the company and a target price tp of \u003cTWO_THOUSAND\u003e said lkp securities the brokerage believes the fmcg stock will provide \u003cONE_TEN_PERCENT\u003e return at tp over the next \u003cONE_TEN\u003e months also read nifty fmcg hits all time high for \u003cFOUR_\u003e th straight session gains \u003cONE_TEN_PERCENT\u003e in \u003cTHREE_\u003e months what s fueling the surge \u003cTWO_\u003e jyothy labsjyothy labs ltd has undergone a substantial transformation from a promoter driven southcentric single product entity to a professionally managed and multi product company operating nationwide it has achieved consistent rev ebitda pat cagr of \u003cONE_TEN\u003e \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e respectively between fy20 \u003cTWO_TEN\u003e adopting above the line marketing strategy from below the line spending strategy strategic pan india expansion in distribution network focusing on low unit packs across product lines to enter into basket of consumers especially in rural areas boosted growth we initiate coverage on jyothy labs with a buy rating and a tp of \u003cSEVEN_HUNDRED\u003e said lkp securities the brokerage believes the fmcg stock will provide \u003cTWO_TEN_PERCENT\u003e return at tp over the next \u003cONE_TEN\u003e months also read stocks to buy hul godrej consumer dabur among top stock picks in the fmcg sector by mofsl3 ccl products india limitedccl products has been consistent in performance despite severe volatility in coffee prices intense competition supply chain disruptions etc it has maintained its volume growth trajectory and profitability on a per kilo basis the supply chain disruptions across the globe has forced several coffee companies globally to diversify their supplies and therefore are seeking to acquire new alliances with manufacturers having global presence like ccl we believe ccl will clock mid teens volume growth owing to doubling of capacity from \u003cTHREE_TEN_THOUSAND\u003e mt in fy22 to \u003cSEVEN_TEN_THOUSAND\u003e mt by fy25 across vietnam and india in its value added products especially freeze dried coffee and small packs addition of high margin products like speciality coffee five per cent of sales along with cost efficient business model we initiate coverage on ccl products with a buy rating and a tp of \u003cEIGHT_HUNDRED\u003e said lkp securities the brokerage believes the fmcg stock will provide \u003cTWO_TEN_PERCENT\u003e return at tp over the next \u003cONE_TEN\u003e months","timestamp":"2024-09-20T21:36:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}