{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-indigo-spicejet-ntpc-tata-power-jbm-auto-hcl-tech-and-more-11726594303579.html","title":"Stocks to Watch: IndiGo, SpiceJet, NTPC, Tata Power, JBM Auto, HCL Tech and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"IndiGo: InterGlobe Aviation Limited, parent company of IndiGo, reported that the airline grounded its A321 aircraft involved in a tail strike on September 9, 2024, on the Delhi-Bangalore flight 6E-6054. The Directorate General of Civil Aviation (DGCA) has launched an investigation and de-rostered the flight crew. IndiGo confirmed the aircraft is undergoing necessary repairs and will return to service after maintenance is completed.HCL Tech: HCL Technologies will announce its Q2FY25 financial results on October 14, 2024. The board will also consider the payment of its third interim dividend for FY25 on the same day, with a record date set for October 22, 2024.JBM Auto: JBM ECOLIFE Mobility Pvt. Ltd, a subsidiary of JBM Auto, has secured $100 million in funding from the Asian Development Bank (ADB) and the Asian Infrastructure Investment Bank (AIIB). The funds will be used to introduce 650 electric buses across multiple states, enhancing the company’s contribution to the country’s electric mobility landscape.SpiceJet: SpiceJet has set a floor price of  ₹64.79 per share for its upcoming securities sale to qualified institutional buyers, with the aim of raising up to  ₹3,000 crore. The proposal for the capital raise was recently approved by shareholders. According to the preliminary placement document submitted to the BSE, the company may offer up to a 5 percent discount on the floor price, in line with the approval given through a special resolution via postal ballot on September 13, 2024, and as per SEBI's ICDR regulations.NTPC: NTPC and Nuclear Power Corporation of India Limited (NPCIL) have received approval to form a joint venture, ASHVINI, aimed at constructing four 700 MWe nuclear power plants in Mahi Banswara, Rajasthan. This initiative supports India's plan to achieve 22,800 MW of nuclear power capacity by 2031-32.Tata Power: Tata Power plans to invest up to $9 billion to boost its renewable energy capacity to over 20 GW within the next five to six years. The company aims to expand its renewable capacity from the current 5 GW to over 20 GW by 2030, targeting 100 percent clean power generation by FY2045.Jupiter Wagons: Jupiter Wagons has announced a  ₹2,500 crore capacity expansion project to establish a new facility in Odisha for manufacturing forged wheelsets. The new plant, expected to be operational by 2027, will increase production capacity from 20,000 to 100,000 wheelsets annually.Torrent Power: Torrent Power has secured a letter of intent from Maharashtra State Electricity Distribution Co Ltd (MSEDCL) for a 1,500 MW pumped hydro storage project. This project will provide energy for 40 years and aligns with Torrent Power’s strategy to enhance its energy storage capabilities.DCM Shriram Industries, Life Insurance Corporation: LIC has reduced its stake in DCM Shriram Industries from 6.68 percent to 4.66 percent over the last three years. Shares were sold at an average price of  ₹110.072. DCM Shriram Industries is involved in sugar, alcohol, and industrial fibers production.","cleaned_content":"indigo interglobe aviation limited parent company of indigo reported that the airline grounded its a321 aircraft involved in a tail strike on september \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e on the delhi bangalore flight \u003cSIX_\u003e e \u003cSIX_THOUSAND\u003e the directorate general of civil aviation dgca has launched an investigation and de rostered the flight crew indigo confirmed the aircraft is undergoing necessary repairs and will return to service after maintenance is completed hcl tech hcl technologies will announce its q2fy25 financial results on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the board will also consider the payment of its third interim dividend for fy25 on the same day with a record date set for october \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e jbm auto jbm ecolife mobility pvt ltd a subsidiary of jbm auto has secured \u003cONE_HUNDRED\u003e million in funding from the asian development bank adb and the asian infrastructure investment bank aiib the funds will be used to introduce \u003cSIX_HUNDRED\u003e electric buses across multiple states enhancing the company s contribution to the country s electric mobility landscape spicejet spicejet has set a floor price of \u003cSIX_TEN\u003e per share for its upcoming securities sale to qualified institutional buyers with the aim of raising up to \u003cTHREE_THOUSAND\u003e crore the proposal for the capital raise was recently approved by shareholders according to the preliminary placement document submitted to the bse the company may offer up to a \u003cFIVE_PERCENT\u003e discount on the floor price in line with the approval given through a special resolution via postal ballot on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e and as per sebis icdr regulations ntpc ntpc and nuclear power corporation of india limited npcil have received approval to form a joint venture ashvini aimed at constructing four \u003cSEVEN_HUNDRED\u003e mwe nuclear power plants in mahi banswara rajasthan this initiative supports indias plan to achieve \u003cTWO_TEN_THOUSAND\u003e mw of nuclear power capacity by \u003cTWO_THOUSAND\u003e \u003cTHREE_TEN\u003e tata power tata power plans to invest up to \u003cNINE_\u003e billion to boost its renewable energy capacity to over \u003cTWO_TEN\u003e gw within the next five to six years the company aims to expand its renewable capacity from the current \u003cFIVE_\u003e gw to over \u003cTWO_TEN\u003e gw by \u003cTWO_THOUSAND\u003e targeting \u003cONE_HUNDRED_PERCENT\u003e clean power generation by fy2045 jupiter wagons jupiter wagons has announced a \u003cTWO_THOUSAND\u003e crore capacity expansion project to establish a new facility in odisha for manufacturing forged wheelsets the new plant expected to be operational by \u003cTWO_THOUSAND\u003e will increase production capacity from \u003cTWO_TEN_THOUSAND\u003e to \u003cONE_HUNDRED_THOUSAND\u003e wheelsets annually torrent power torrent power has secured a letter of intent from maharashtra state electricity distribution co ltd msedcl for a \u003cONE_THOUSAND\u003e mw pumped hydro storage project this project will provide energy for \u003cFOUR_TEN\u003e years and aligns with torrent power s strategy to enhance its energy storage capabilities dcm shriram industries life insurance corporation lic has reduced its stake in dcm shriram industries from \u003cSIX_PERCENT\u003e to \u003cFOUR_PERCENT\u003e over the last three years shares were sold at an average price of \u003cONE_HUNDRED\u003e dcm shriram industries is involved in sugar alcohol and industrial fibers production","timestamp":"2024-09-18T08:21:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}