{"url":"https://www.livemint.com/market/stock-market-news/cochin-shipyard-lt-hal-to-mazagon-dock-shipbuilders-should-you-buy-defence-stocks-after-sharp-pull-back-rally-11726903304005.html","title":"Cochin Shipyard, LT, HAL to Mazagon Dock shipbuilders: Should you buy defence stocks after sharp pull back rally?","description":"Defence stocks to buy: Experts have recommended these shares to buy on Monday — Cochin Shipyard, LT, and Mazagon Dock","content":"Stocks to buy: Defensive stocks witnessed a strong pullback during Friday deals after reeling under the sell-off heat for nearly three months. Cochin Shipyard shares surged 10 per cent and locked in the upper circuit, and Mazagon Dock Shipbuilders' share price skyrocketed over 7 per cent. Shares of ideaForge, Larsen \u0026 Turbo (LT), Bharat Dynamics, BHEL, etc., logged over a 2 per cent rise in this pullback rally. This rally in defence stocks has spurred a debate about whether the mojo in Indian defence stocks is back or not.According to stock market experts, it would take more sessions to ascertain whether the mojo in defence stocks is back. However, some defence stocks are available at attractive valuations, and one can start accumulating select ones. They said that most of the defence stocks are PSUs and have rallied a lot in recent years. So, firm selling was expected in defence stocks, and base-building mode can't be written off in a single pullback.Speaking on the outlook of Indian defence stocks, Manish Chowdhury, Head of Research at StoxBox, said, \"Though it is too early to conclude that the pain is over for the overall defence sector, our sense is that valuation in select pockets has become reasonable vis-à-vis historical trends. We advise accumulating stocks in the defence sector in every dip from a 12-18 months perspective. We feel that the robust order book of these companies, a higher focus on indigenization, and the growing potential of exports would continue to provide tailwinds to the overall sector. Executing the order book would be critical for these companies to sustain the current valuation, and any misses on the earnings front or slower deal wins could further weigh on the overall sector.\"Advising investors to remain cautious while making any investment decision in defence stocks, Anshul Jain, Head of Research at Lakshmi Shree Investment and Securities Ltd, said, “Post-budget 2024, I have remained bearish on the PSU stocks, including defence stocks, as they have rallied a lot in the recent years. So, a strong selling was expected by those who accumulated huge wealth from these stocks in the recent rally. So, one can only assume the end of base building mode in one rebound. One should wait for a few more sessions and only make investment decisions. The risk-reward ratio in defence PSU stocks is more tilted towards the 'sell on rise' than the 'buy on dips strategy.”On stocks that are looking attractive on the technical chart, Sugandha Sachdeva, Founder of SS WealthStreet, said, \"On the technical chart pattern, shares of Mazagon Dock Shipbuilders, Cochin Shipyard, and Larsen \u0026 Toubro (LT) are looking good.\"Here is the complete listing of defence stocks and their critical levels shared by Sugandha Sachdeva:1] Mazagon Dock Shipbuilders: Buy at  ₹4300 to  ₹4350, target  ₹5100 and  ₹5500, stop loss  ₹3700 (on a closing basis);2] Cochin Shipyard: Buy at  ₹1800, target  ₹2280, stop loss  ₹1500 (on a closing basis); and3] LT: Buy at  ₹3700 to  ₹3750, target  ₹4180, stop loss  ₹3300 (on a closing basis).","cleaned_content":"stocks to buy defensive stocks witnessed a strong pullback during friday deals after reeling under the sell off heat for nearly three months cochin shipyard shares surged \u003cONE_TEN_PERCENT\u003e and locked in the upper circuit and mazagon dock shipbuilders share price skyrocketed over \u003cSEVEN_PERCENT\u003e shares of ideaforge larsen turbo lt bharat dynamics bhel etc logged over a \u003cTWO_PERCENT\u003e rise in this pullback rally this rally in defence stocks has spurred a debate about whether the mojo in indian defence stocks is back or not according to stock market experts it would take more sessions to ascertain whether the mojo in defence stocks is back however some defence stocks are available at attractive valuations and one can start accumulating select ones they said that most of the defence stocks are psus and have rallied a lot in recent years so firm selling was expected in defence stocks and base building mode cant be written off in a single pullback speaking on the outlook of indian defence stocks manish chowdhury head of research at stoxbox said though it is too early to conclude that the pain is over for the overall defence sector our sense is that valuation in select pockets has become reasonable vis vis historical trends we advise accumulating stocks in the defence sector in every dip from a \u003cONE_TEN\u003e \u003cONE_TEN\u003e months perspective we feel that the robust order book of these companies a higher focus on indigenization and the growing potential of exports would continue to provide tailwinds to the overall sector executing the order book would be critical for these companies to sustain the current valuation and any misses on the earnings front or slower deal wins could further weigh on the overall sector advising investors to remain cautious while making any investment decision in defence stocks anshul jain head of research at lakshmi shree investment and securities ltd said post budget \u003cTWO_THOUSAND\u003e i have remained bearish on the psu stocks including defence stocks as they have rallied a lot in the recent years so a strong selling was expected by those who accumulated huge wealth from these stocks in the recent rally so one can only assume the end of base building mode in one rebound one should wait for a few more sessions and only make investment decisions the risk reward ratio in defence psu stocks is more tilted towards the sell on rise than the buy on dips strategy on stocks that are looking attractive on the technical chart sugandha sachdeva founder of ss wealthstreet said on the technical chart pattern shares of mazagon dock shipbuilders cochin shipyard and larsen toubro lt are looking good here is the complete listing of defence stocks and their critical levels shared by sugandha sachdeva \u003cONE_\u003e mazagon dock shipbuilders buy at \u003cFOUR_THOUSAND\u003e to \u003cFOUR_THOUSAND\u003e target \u003cFIVE_THOUSAND\u003e and \u003cFIVE_THOUSAND\u003e stop loss \u003cTHREE_THOUSAND\u003e on a closing basis \u003cTWO_\u003e cochin shipyard buy at \u003cONE_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e on a closing basis and3 lt buy at \u003cTHREE_THOUSAND\u003e to \u003cTHREE_THOUSAND\u003e target \u003cFOUR_THOUSAND\u003e stop loss \u003cTHREE_THOUSAND\u003e on a closing basis","timestamp":"2024-09-21T13:50:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}