{"url":"https://www.livemint.com/market/stock-market-news/bajaj-housing-finance-share-price-jumps-7-after-dream-debut-is-next-ireda-in-making-11726470506730.html","title":"Bajaj Housing Finance share price hits 10% upper circuit after dream debut. Can it replicate IREDA’s success?","description":"Bajaj Housing Finance share price opened on the NSE at  ₹150 and touched an intraday high of  ₹165 within a few minutes of the stock listing","content":"Stock market today: After receiving record bids exceeding  ₹3.24 lakh crore, Bajaj Housing Finance'share price was listed at a bumper 114 per cent premium. On the NSE and BSE, Bajaj Housing Finance's share price opened at  ₹150 apiece, delivering multibagger returns to its lucky share allottees. However, the newly listed Bajaj Group share continued to attract fresh buying and touched a new peak of  ₹165 apiece on the NSE, extending the listing gain of the share allottees. After the stellar debut, some experts believe that the housing finance stock may extend its rally further and advised share allottees to hold the scrip for the long term.On the suggestion to Bajaj Housing Finance shareholders after a dream debut on Dalal Street, Arun Kejriwal, Founder at Kejwiral Research and Investment Services, said, \"Those who want to hold the stock despite multibagger returns in one week are advised to hold the scrip maintaining stop loss below the weighted average of the stock, which is currently at  ₹155. If the stock sustains above this weighted average post-listing, we may expect further upside in the scrip.\"Dubbing Bajaj Housing Finance shares as one of the portfolio stocks, Astha Jain, Senior Research Analyst at HEM Securities, said, \"In the NBGC segment, Bajaj Group shares have delivered stellar returns to investors, and this could be one of the possible reasons for stock trading beyond its actual valuations. However, my suggestion to the long-term shareholders is to book 50 per cent profit, fish out one's principal from the stock and hold the scrip for the long term. If the stock plunges from current levels, they can reenter with the money received after the profit booking.\"On whether Bajaj Housing Finance share price has the potential to emerge next IREDA post-listing, Arun Kejriwal said, \"Much will depend upon the kind of response this new Bajaj Group stock receives in the next few sessions. Suppose the stock continues to trade above its weighted average and closes above  ₹155 today. In that case, tomorrow's opening will be crucial and fresh buying may trigger if it manages to sustain above  ₹155. So, continued uptrends for the next few sessions may help this Bajaj Group stock qualify for the debate around IREDA. However, if it falls below  ₹155, then in that case, we may expect sharp selling, and the stock also can become the next Tata Technologies share of Dalal Street.\"Bajaj Housing Finance IPO has stood out, attracting unprecedented interest and becoming the most subscribed IPO in Indian history, with total bids exceeding  ₹3.24 lakh crore. This surge in demand seems well-founded, as Bajaj is a well-known household name with a nearly 100-year legacy. Its robust business performance and the trust investors have in the Bajaj Group have contributed to the overwhelming success of its  ₹6,560 crore IPO. Before this, the last IPO to see such remarkable demand was the Coal India IPO in 2008, which garnered  ₹2.36 lakh crore in bids. Bajaj has now broken that record. In 2024, Premier Energies also drew significant attention, with bids approaching  ₹1.5 lakh crore.The initial public offering (IPO) of IREDA was launched at price band of  ₹30 to  ₹32 per equity share in November 2023. The PSU stock is listed at  ₹50 apiece on the BSE and NSE, and it delivers around 56 per cent. However, the bull trend in IREDA shares continued and it scaled to a new peak of  ₹310 apiece on the NSE.IREDA share price today available at around  ₹230 per share, which is more than 600 per cent from its upper price band of  ₹32 apiece.","cleaned_content":"stock market today after receiving record bids exceeding \u003cTHREE_\u003e lakh crore bajaj housing financeshare price was listed at a bumper \u003cONE_HUNDRED_PERCENT\u003e premium on the nse and bse bajaj housing finances share price opened at \u003cONE_HUNDRED\u003e apiece delivering multibagger returns to its lucky share allottees however the newly listed bajaj group share continued to attract fresh buying and touched a new peak of \u003cONE_HUNDRED\u003e apiece on the nse extending the listing gain of the share allottees after the stellar debut some experts believe that the housing finance stock may extend its rally further and advised share allottees to hold the scrip for the long term on the suggestion to bajaj housing finance shareholders after a dream debut on dalal street arun kejriwal founder at kejwiral research and investment services said those who want to hold the stock despite multibagger returns in one week are advised to hold the scrip maintaining stop loss below the weighted average of the stock which is currently at \u003cONE_HUNDRED\u003e if the stock sustains above this weighted average post listing we may expect further upside in the scrip dubbing bajaj housing finance shares as one of the portfolio stocks astha jain senior research analyst at hem securities said in the nbgc segment bajaj group shares have delivered stellar returns to investors and this could be one of the possible reasons for stock trading beyond its actual valuations however my suggestion to the long term shareholders is to book \u003cFIVE_TEN_PERCENT\u003e profit fish out ones principal from the stock and hold the scrip for the long term if the stock plunges from current levels they can reenter with the money received after the profit booking on whether bajaj housing finance share price has the potential to emerge next ireda post listing arun kejriwal said much will depend upon the kind of response this new bajaj group stock receives in the next few sessions suppose the stock continues to trade above its weighted average and closes above \u003cONE_HUNDRED\u003e today in that case tomorrows opening will be crucial and fresh buying may trigger if it manages to sustain above \u003cONE_HUNDRED\u003e so continued uptrends for the next few sessions may help this bajaj group stock qualify for the debate around ireda however if it falls below \u003cONE_HUNDRED\u003e then in that case we may expect sharp selling and the stock also can become the next tata technologies share of dalal street bajaj housing finance ipo has stood out attracting unprecedented interest and becoming the most subscribed ipo in indian history with total bids exceeding \u003cTHREE_\u003e lakh crore this surge in demand seems well founded as bajaj is a well known household name with a nearly \u003cONE_HUNDRED\u003e year legacy its robust business performance and the trust investors have in the bajaj group have contributed to the overwhelming success of its \u003cSIX_THOUSAND\u003e crore ipo before this the last ipo to see such remarkable demand was the coal india ipo in \u003cTWO_THOUSAND\u003e which garnered \u003cTWO_\u003e lakh crore in bids bajaj has now broken that record in \u003cTWO_THOUSAND\u003e premier energies also drew significant attention with bids approaching \u003cONE_\u003e lakh crore the initial public offering ipo of ireda was launched at price band of \u003cTHREE_TEN\u003e to \u003cTHREE_TEN\u003e per equity share in november \u003cTWO_THOUSAND\u003e the psu stock is listed at \u003cFIVE_TEN\u003e apiece on the bse and nse and it delivers around \u003cFIVE_TEN_PERCENT\u003e however the bull trend in ireda shares continued and it scaled to a new peak of \u003cTHREE_HUNDRED\u003e apiece on the nse ireda share price today available at around \u003cTWO_HUNDRED\u003e per share which is more than \u003cSIX_HUNDRED_PERCENT\u003e from its upper price band of \u003cTHREE_TEN\u003e apiece","timestamp":"2024-09-16T15:31:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}