{"url":"https://www.livemint.com/market/stock-market-news/hindenburgs-first-reaction-on-congress-allegations-on-sebi-chief-madhabi-buch-complete-silence-for-weeks-11726049674751.html","title":"Hindenburg’s first reaction on Congress allegations on Sebi chief Madhabi Buch: ’Complete silence for weeks’","description":"Hindenburg's first reaction on Congress allegations on Sebi chief Madhabi Buch, ‘Buch has maintained her complete silence for weeks on all of the emerging issues’.","content":"In response to recent allegations made by the opposition Congress, New York-based Hindenburg Research stated on Wednesday that Securities and Exchange Board of India (SEBI) Chairperson Madhabi Puri Buch has remained completely silent for weeks regarding all the emerging issues.\"Buch has maintained her complete silence for weeks on all of the emerging issues,\" said the New York-based shortseller in a post on X.“New allegations have emerged that the private consulting entity, 99% owned by SEBI Chair Madhabi Buch, accepted payments from multiple listed companies regulated by SEBI during her time as SEBI Whole-Time Member. The companies include: Mahindra \u0026 Mahindra, ICICI Bank, Dr. Reddy’s and Pidilite. These allegations apply to Buch's Indian consulting entity with no details thus far on Buch's Singapore-based consulting entity,\" Hindenburg said in a reaction to Congress' allegations.Meanwhile, Mahindra Group spokesperson said, Mahindra Group hired Mr. Dhaval Buch in 2019 specifically for his expertise in supply chain and sourcing, soon after he retired as Unilever's Global Chief Procurement Officer.“He has spent most of his time at Bristlecone, a subsidiary which is a supply chain consulting company. Mr. Buch is currently on the Board of Bristlecone. He joined Mahindra Group almost 3 years before Ms. Madhabi Puri Buch was appointed as SEBI Chairperson.”“Compensation has been specifically and only for Mr. Buch’s supply chain expertise and management acumen, based on his global experience at Unilever. We categorically state that we have not at any point requested SEBI for any preferential treatment. We maintain the highest standards of corporate governance,” the company spokesperson said.We consider these allegations false and misleading in nature, it added.Earlier on Tuesday, Congress made \"shocking\" revelations, claiming that Buch and her husband had earned crores of rupees from six publicly listed companies, including Mahindra and Mahindra.Congress stated that, despite her claim that the advisory company she owns became inactive when she took office, Agora Private Limited continued to operate and earned revenue of  ₹2.95 crore between 2016 and 2024.Congress stated that Agora's clients include Mahindra and Mahindra Limited, Dr. Reddy's, Pidilite, ICICI, Sembcorp, and Visu Leasing \u0026 Finance.“Strangely, of the total  ₹2.95 Crores received by Agora Advisory Private Limited, 2.59 Crores has come from one entity alone - the Mahindra \u0026 Mahindra Group. It accounts for 88 per cent of the total money that Agora Advisory received,” it said.The party further went on to say that, “If this was not shocking enough, the SEBI Chairperson’s husband - Dhaval Buch received  ₹4.78 Crores as income in a personal capacity from the M\u0026M. This is in addition to the  ₹2.95 crores received by ‘Agora Advisory Private Limited’ through its consultancy/advisory services.”Recently, US-based short seller Hindenburg Research leveled accusations against SEBI Chairperson Madhabi Puri Buch, alleging a conflict of interest. Last month, Hindenburg claimed that Buch and her husband, Dhaval Buch, held stakes in \"the obscure offshore entities involved in the Adani money siphoning scandal.\" The allegations were based on documents provided by a whistleblower and investigations conducted by other organizations, according to Hindenburg Research.Shortly afterward, the SEBI Chairperson and her husband, in their personal capacity, released a detailed statement refuting the allegations.“In the context of allegations made in the Hindenburg Report dated August 10, 2024, against us, we would like to state that we strongly deny the baseless allegations and insinuations made in the report. The same are devoid of any truth. Our life and finances are an open book. All disclosures as required have already been furnished to SEBI over the years. We have no hesitation in disclosing any and all financial documents, including those that relate to the period when we were strictly private citizens, to any and every authority that may seek them. Further, in the interest of complete transparency, we would be issuing a detailed statement in due course,” both said in the joint statement released to the media.","cleaned_content":"in response to recent allegations made by the opposition congress new york based hindenburg research stated on wednesday that securities and exchange board of india sebi chairperson madhabi puri buch has remained completely silent for weeks regarding all the emerging issues buch has maintained her complete silence for weeks on all of the emerging issues said the new york based shortseller in a post on x new allegations have emerged that the private consulting entity \u003cNINE_TEN_PERCENT\u003e owned by sebi chair madhabi buch accepted payments from multiple listed companies regulated by sebi during her time as sebi whole time member the companies include mahindra mahindra icici bank dr reddy s and pidilite these allegations apply to buchs indian consulting entity with no details thus far on buchs singapore based consulting entity hindenburg said in a reaction to congress allegations meanwhile mahindra group spokesperson said mahindra group hired mr dhaval buch in \u003cTWO_THOUSAND\u003e specifically for his expertise in supply chain and sourcing soon after he retired as unilevers global chief procurement officer he has spent most of his time at bristlecone a subsidiary which is a supply chain consulting company mr buch is currently on the board of bristlecone he joined mahindra group almost \u003cTHREE_\u003e years before ms madhabi puri buch was appointed as sebi chairperson compensation has been specifically and only for mr buch s supply chain expertise and management acumen based on his global experience at unilever we categorically state that we have not at any point requested sebi for any preferential treatment we maintain the highest standards of corporate governance the company spokesperson said we consider these allegations false and misleading in nature it added earlier on tuesday congress made shocking revelations claiming that buch and her husband had earned crores of rupees from six publicly listed companies including mahindra and mahindra congress stated that despite her claim that the advisory company she owns became inactive when she took office agora private limited continued to operate and earned revenue of \u003cTWO_\u003e crore between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e congress stated that agoras clients include mahindra and mahindra limited dr reddys pidilite icici sembcorp and visu leasing finance strangely of the total \u003cTWO_\u003e crores received by agora advisory private limited \u003cTWO_\u003e crores has come from one entity alone the mahindra mahindra group it accounts for \u003cEIGHT_TEN_PERCENT\u003e of the total money that agora advisory received it said the party further went on to say that if this was not shocking enough the sebi chairperson s husband dhaval buch received \u003cFOUR_\u003e crores as income in a personal capacity from the m m this is in addition to the \u003cTWO_\u003e crores received by agora advisory private limited through its consultancy advisory services recently us based short seller hindenburg research leveled accusations against sebi chairperson madhabi puri buch alleging a conflict of interest last month hindenburg claimed that buch and her husband dhaval buch held stakes in the obscure offshore entities involved in the adani money siphoning scandal the allegations were based on documents provided by a whistleblower and investigations conducted by other organizations according to hindenburg research shortly afterward the sebi chairperson and her husband in their personal capacity released a detailed statement refuting the allegations in the context of allegations made in the hindenburg report dated august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e against us we would like to state that we strongly deny the baseless allegations and insinuations made in the report the same are devoid of any truth our life and finances are an open book all disclosures as required have already been furnished to sebi over the years we have no hesitation in disclosing any and all financial documents including those that relate to the period when we were strictly private citizens to any and every authority that may seek them further in the interest of complete transparency we would be issuing a detailed statement in due course both said in the joint statement released to the media","timestamp":"2024-09-12T10:18:00+05:30","market_timestamp":"2024-09-12T10:18:00+05:30","off_market_hours":false}