{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-refex-industries-records-250-gain-in-less-than-4-months-soars-14000-in-6-years-11726566306448.html","title":"Multibagger Stock: Refex Industries records 250% gain in less than 4 months, soars 14,000% in 6 years","description":"The stock has consistently delivered strong performances year after year, making it a standout in the stock market. In 2019, the stock surged by an impressive 170 per cent, followed by an 88 per cent gain in 2020. In 2024 so far, the stock has already gained 300 per cent.","content":"Multibagger Stock: Investing in the stock market can yield substantial rewards when the right stocks are chosen, but it can also lead to disappointing outcomes if investments are made unwisely. Fortunately, shareholders of Refex Industries have reasons to celebrate, as the shares of this company delivered phenomenal returns.Recently, the stock has made massive gains on Dalal Street, surging 250 per cent in less than 4 months. In July alone, it posted a 71 per cent rise, followed by a 16.4 per cent increase in August. So far this month, it has already surged by 55 per cent. This recent rally has driven the stock to an impressive 1,300 per cent gain over the past two years and a staggering 3,100 per cent over five years.From its September 2018 price of  ₹3.5 per cent share, it has soared by 14,000 per cent to its current value of  ₹479 per share.The stock has consistently delivered strong gains year after year, making it one of the standout performers in the Indian stock market. In 2019, the stock surged by an impressive 170 per cent, followed by an 88 per cent gain in 2020, despite the global economic challenges posed by the pandemic.The momentum continued into 2021, where it recorded a 44 per cent rise, and then nearly doubled in 2022 with a gain of 96.57 per cent. In 2023, the stock further solidified its upward trajectory with a 116.13 per cent increase. In the current year, the stock shows no signs of slowing down. So far, it has already posted a staggering 300 per cent gain.Refex Industries is one of India’s leading business organisations, serving across different business lines such as refrigerant gases, ash and coal handling, green mobility, and power trading.It is a specialist manufacturer and re-filler of refrigerant gases in India, particularly, environmentally acceptable gases that are replacements for chloro-fluoro-carbons (CFCs). These are used primarily as refrigerants, foam-blowing agents, and aerosol propellants.It also offers services for handling and disposing of fly ash, crushing uncrushed coal, and trading coal to power plants. The company, in 2022, forayed into the supply of electricity and other services to power users, producers, state electricity boards, and distribution companies.Refex Industries gets the majority of its revenue from the Ash \u0026 Coal Handling segment, which in Q1 FY25 accounted for 94 per cent. It aims to be a full-service partner for power plants, using its own fleet of vehicles to transport ash, which has improved profit margins and reduced costs.With the help of a fleet of more than 800 vehicles, around 5 million tonnes of ash were disposed of in FY24, an increase of over 30 per cent from the year before. With an emphasis on road projects under the Bharatmala Pariyojana initiative, a sizable number of new clients are included, including NTPC in Chhattisgarh, Bihar, and Karnataka, as well as Adani and MP and other state power plants.With operations in NTPC, their joint ventures, state-owned power plants, and private power plants, the company's expansion has established it as the largest organised ash management service provider in the nation, according to its FY24 annual report.Refex Industries aims to become a leading business partner by leveraging its innovative solutions, advanced technology, and skilled team. The company focuses on expanding its vendor network and entering new markets for its refrigerant products while aiming to exceed client expectations.It is also working to secure large contracts with OEMs and the Indian government. The company is increasing its refrigerant refilling facilities across India, which is expected to boost future income. Additionally, the company's ash business is set to grow, with plans to expand distribution beyond Chhattisgarh to several other states.","cleaned_content":"multibagger stock investing in the stock market can yield substantial rewards when the right stocks are chosen but it can also lead to disappointing outcomes if investments are made unwisely fortunately shareholders of refex industries have reasons to celebrate as the shares of this company delivered phenomenal returns recently the stock has made massive gains on dalal street surging \u003cTWO_HUNDRED_PERCENT\u003e in less than \u003cFOUR_\u003e months in july alone it posted a \u003cSEVEN_TEN_PERCENT\u003e rise followed by a \u003cONE_TEN_PERCENT\u003e increase in august so far this month it has already surged by \u003cFIVE_TEN_PERCENT\u003e this recent rally has driven the stock to an impressive \u003cONE_THOUSAND_PERCENT\u003e gain over the past two years and a staggering \u003cTHREE_THOUSAND_PERCENT\u003e over five years from its september \u003cTWO_THOUSAND\u003e price of \u003cTHREE_PERCENT\u003e share it has soared by \u003cONE_TEN_THOUSAND_PERCENT\u003e to its current value of \u003cFOUR_HUNDRED\u003e per share the stock has consistently delivered strong gains year after year making it one of the standout performers in the indian stock market in \u003cTWO_THOUSAND\u003e the stock surged by an impressive \u003cONE_HUNDRED_PERCENT\u003e followed by an \u003cEIGHT_TEN_PERCENT\u003e gain in \u003cTWO_THOUSAND\u003e despite the global economic challenges posed by the pandemic the momentum continued into \u003cTWO_THOUSAND\u003e where it recorded a \u003cFOUR_TEN_PERCENT\u003e rise and then nearly doubled in \u003cTWO_THOUSAND\u003e with a gain of \u003cNINE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the stock further solidified its upward trajectory with a \u003cONE_HUNDRED_PERCENT\u003e increase in the current year the stock shows no signs of slowing down so far it has already posted a staggering \u003cTHREE_HUNDRED_PERCENT\u003e gain refex industries is one of india s leading business organisations serving across different business lines such as refrigerant gases ash and coal handling green mobility and power trading it is a specialist manufacturer and re filler of refrigerant gases in india particularly environmentally acceptable gases that are replacements for chloro fluoro carbons cfcs these are used primarily as refrigerants foam blowing agents and aerosol propellants it also offers services for handling and disposing of fly ash crushing uncrushed coal and trading coal to power plants the company in \u003cTWO_THOUSAND\u003e forayed into the supply of electricity and other services to power users producers state electricity boards and distribution companies refex industries gets the majority of its revenue from the ash coal handling segment which in q1 fy25 accounted for \u003cNINE_TEN_PERCENT\u003e it aims to be a full service partner for power plants using its own fleet of vehicles to transport ash which has improved profit margins and reduced costs with the help of a fleet of more than \u003cEIGHT_HUNDRED\u003e vehicles around \u003cFIVE_\u003e million tonnes of ash were disposed of in fy24 an increase of over \u003cTHREE_TEN_PERCENT\u003e from the year before with an emphasis on road projects under the bharatmala pariyojana initiative a sizable number of new clients are included including ntpc in chhattisgarh bihar and karnataka as well as adani and mp and other state power plants with operations in ntpc their joint ventures state owned power plants and private power plants the companys expansion has established it as the largest organised ash management service provider in the nation according to its fy24 annual report refex industries aims to become a leading business partner by leveraging its innovative solutions advanced technology and skilled team the company focuses on expanding its vendor network and entering new markets for its refrigerant products while aiming to exceed client expectations it is also working to secure large contracts with oems and the indian government the company is increasing its refrigerant refilling facilities across india which is expected to boost future income additionally the companys ash business is set to grow with plans to expand distribution beyond chhattisgarh to several other states","timestamp":"2024-09-17T17:19:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}