{"url":"https://www.livemint.com/market/stock-market-news/auto-sector-festive-demand-to-drive-two-wheeler-pv-sales-growth-says-nuvama-m-m-tvs-motor-among-top-picks-11726037422889.html","title":"Auto Sector: Festive demand to drive two-wheeler, PV sales growth, says Nuvama; M\u0026M, TVS Motor among top picks","description":"Nuvama Institutional Equities reported strong festive demand expectations for two-wheelers and commercial vehicles, favoring mass-market OEMs like Escorts Kubota and Mahindra \u0026 Mahindra. Anticipated growth in 2W demand is over 15%, while PV growth remains modest, supported by rural demand.","content":"In a recent study on the automobile industry, brokerage company Nuvama Institutional Equities said that dealers of two-wheeler (2W), passenger vehicles (PV), and medium and heavy commercial vehicles (MHCV) indicated high expectations for the upcoming festive season based on their channel checks.The brokerage has a preference for mass-market 2W Original Equipment Manufacturers (OEMs) and tractor OEMs. Their top picks consist of Escorts Kubota (Target Price:  ₹5,000), Mahindra \u0026 Mahindra ( ₹3,700), Hero MotoCorp ( ₹6,500), and TVS Motor ( ₹3,200).The brokerage noted in its research that strong rural demand and ongoing urban demand will drive a 15%+ growth in 2W festive demand. Premium OEM EIM-RE to be surpassed by mass-market OEMs. The brokerage also said that, with replacement demand supporting MHCV demand, PV demand would expand in single digits while MHCV demand would be mild at single digits.According to the brokerage, the rural portion of the 2W sector was around 55%. This indicates that mass-market OEMs like TVS Motor, Hero MotoCorp, and Bajaj Auto should fare better than luxury OEMs like EIM-RE. The Hero Xtreme 125R and TVS Jupiter are two new models that could help with volumes. In addition, PV growth should be modest, in the single digits, with the backing of rural demand (with a rural proportion of at least 35%).Nuvama stated that utility vehicles (UV) growth is probably going to reach double digits, exceeding hatchbacks and putting Mahindra \u0026 Mahindra and Tata Motors ahead of Maruti Suzuki. Volumes should also benefit from new models like the Tata Currv and Mahindra Thar Roxx. Because dealer stocks were built up in expectation of a busy holiday season, they are high for 2W and PV at 1.5–2.5 months. As replacement demand increases and freight availability keeps becoming better, the demand for MHCVs is anticipated to rise in the single digits.“We believe 2W and tractors are well positioned with volumes likely to grow in high single-digits over FY24–26E, compared with low single digits for PV and CV. We are increasing TP for TVS Motor to  ₹3,200 (earlier  ₹2,870), factoring in higher volume and margin assumptions, and for Hero MotoCorp to  ₹6,500 (earlier  ₹6,200), factoring in higher value of investments in Ather Energy/Hero Fincorp at  ₹365 (earlier  ₹173). In contrast, we are reducing TP for Eicher Motors to  ₹4,500 (earlier  ₹4,600), on lower volume assumption, for Mahindra \u0026 Mahindra to  ₹3,700 (earlier  ₹3,800) on lower PV volume assumption, for Maruti Suzuki to  ₹14,600 (earlier  ₹16,000),” said Nuvama in its report.","cleaned_content":"in a recent study on the automobile industry brokerage company nuvama institutional equities said that dealers of two wheeler \u003cTWO_\u003e w passenger vehicles pv and medium and heavy commercial vehicles mhcv indicated high expectations for the upcoming festive season based on their channel checks the brokerage has a preference for mass market \u003cTWO_\u003e w original equipment manufacturers oems and tractor oems their top picks consist of escorts kubota target price \u003cFIVE_THOUSAND\u003e mahindra mahindra \u003cTHREE_THOUSAND\u003e hero motocorp \u003cSIX_THOUSAND\u003e and tvs motor \u003cTHREE_THOUSAND\u003e the brokerage noted in its research that strong rural demand and ongoing urban demand will drive a \u003cONE_TEN_PERCENT\u003e growth in \u003cTWO_\u003e w festive demand premium oem eim re to be surpassed by mass market oems the brokerage also said that with replacement demand supporting mhcv demand pv demand would expand in single digits while mhcv demand would be mild at single digits according to the brokerage the rural portion of the \u003cTWO_\u003e w sector was around \u003cFIVE_TEN_PERCENT\u003e this indicates that mass market oems like tvs motor hero motocorp and bajaj auto should fare better than luxury oems like eim re the hero xtreme \u003cONE_HUNDRED\u003e r and tvs jupiter are two new models that could help with volumes in addition pv growth should be modest in the single digits with the backing of rural demand with a rural proportion of at least \u003cTHREE_TEN_PERCENT\u003e nuvama stated that utility vehicles uv growth is probably going to reach double digits exceeding hatchbacks and putting mahindra mahindra and tata motors ahead of maruti suzuki volumes should also benefit from new models like the tata currv and mahindra thar roxx because dealer stocks were built up in expectation of a busy holiday season they are high for \u003cTWO_\u003e w and pv at \u003cONE_\u003e \u003cTWO_\u003e months as replacement demand increases and freight availability keeps becoming better the demand for mhcvs is anticipated to rise in the single digits we believe \u003cTWO_\u003e w and tractors are well positioned with volumes likely to grow in high single digits over fy24 \u003cTWO_TEN\u003e e compared with low single digits for pv and cv we are increasing tp for tvs motor to \u003cTHREE_THOUSAND\u003e earlier \u003cTWO_THOUSAND\u003e factoring in higher volume and margin assumptions and for hero motocorp to \u003cSIX_THOUSAND\u003e earlier \u003cSIX_THOUSAND\u003e factoring in higher value of investments in ather energy hero fincorp at \u003cTHREE_HUNDRED\u003e earlier \u003cONE_HUNDRED\u003e in contrast we are reducing tp for eicher motors to \u003cFOUR_THOUSAND\u003e earlier \u003cFOUR_THOUSAND\u003e on lower volume assumption for mahindra mahindra to \u003cTHREE_THOUSAND\u003e earlier \u003cTHREE_THOUSAND\u003e on lower pv volume assumption for maruti suzuki to \u003cONE_TEN_THOUSAND\u003e earlier \u003cONE_TEN_THOUSAND\u003e said nuvama in its report","timestamp":"2024-09-11T13:01:00+05:30","market_timestamp":"2024-09-11T13:01:00+05:30","off_market_hours":false}