{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-sept-23-11726896931518.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Sept 23","description":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Bharti Airtel, Nestle India, and Adani Ports","content":"Buy or sell stocks: Following gains in the US and Asian stock markets, the Indian stock market ended at a record closing high on Friday last week. The Nifty 50 index finished 375 points higher at the 25,790 mark, the BSE Sensex shot up 1,359 points and closed at 84,544, whereas the Bank Nifty index ended 755 points higher at 53,793. Cash market volumes on the NSE were 43% higher than the previous session, aided by FTSE rebalancing volumes. Broad market indices rose less than the Nifty even as the advance-decline ratio rose sharply to 2.08:1.Sumeet Bagadia, Executive Director at Choice Broking, believes that overall Indian stock market bias has turned bullish after the Nifty 50 index climbed to a new peak on Friday. The Choice Broking expert said that sentiments might improve further if the 50-stock index is above the 25,800 mark for a few hours on Monday next week. Bagadia said that the frontline index sustaining above the 25,800 mark would mean a fresh target of 26,300 to 26,500.Regarding shares to buy, Sumeet Bagadia recommended buying these three stocks on Monday: Bharti Airtel, Nestle India, and Adani Ports.1] Bharti Airtel: Buy at  ₹1711.75, target  ₹1855, stop loss  ₹1640.Bharti Airtel's share price is currently trading at  ₹1711.75 and remains in a long-term uptrend, consistently forming higher highs and higher lows on the daily timeframe. The stock has recently formed a strong bullish candle on the daily chart, supported by high trading volumes, indicating a continuation of the uptrend. After bouncing from its support zones, BHARTIARTL looks poised to continue its upward trajectory toward new highs if it sustains above the 1725 level.The Relative Strength Index (RSI) is at 78.47 and trending upward, reflecting strong buying momentum. Additionally, the stock has bounced from its short-term 20-day EMA and is trading above all key moving averages, further reinforcing the bullish outlook.In summary, based on the favourable technical setup and critical indicators (RSI and moving averages), buying BHARTIARTL at the current market price of  ₹1711.75, with a stop loss at  ₹1640 and a target of  ₹1855, presents a compelling opportunity for potential gains. This strategy aligns with the stock's ongoing bullish trend.2] Nestle India: Buy around  ₹2700, target  ₹2930, stop loss  ₹2590.Nestle India is trading at  ₹2699.55 and has recently experienced a breakout from a consolidation phase, supported by substantial trading volumes, indicating significant buying interest. It is recommended to consider buying on dips near the immediate support level of  ₹2650, with a stop loss at  ₹2590. If the stock holds above the recent high of  ₹2705, it could move toward an upside target of  ₹2930.The Relative Strength Index (RSI) stands at 78.14 and is trending upward, reinforcing the bullish momentum. Additionally, the stock has bounced from its key moving averages, including the short-term (20-day), medium-term (50-day), and long-term (200-day) EMAs, signalling strong support at these levels.Nestle India's share price appears well-positioned for further upside based on the favourable technical setup and critical indicators (RSI and moving averages). Investors should consider buying on dips, with a stop loss set at  ₹2590 to manage risk. The target price of  ₹2930 aligns with resistance levels, offering a favourable risk-reward ratio and making this a promising trading opportunity.3] Adani Ports: Buy at  ₹1438.70, target  ₹1560, stop loss  ₹1385.Adani Ports' share price is currently trading around  ₹1438.70. It has recently pulled back from higher levels but found support near  ₹1395. The stock is showing signs of a potential reversal, supported by a significant increase in trading volumes, indicating strength in the current trend. If Adani Ports' share manages to sustain above the  ₹1460 level, it may continue its upward trajectory toward the  ₹1540 to  ₹1560 levels.The Relative Strength Index (RSI) is currently at 44.99, suggesting the stock is in a neutral zone, near a level where buyers could enter. Adani Ports' share price is also trading near its key moving averages, including the short-term (20-day) and medium-term (50-day) EMAs. If the stock surpasses and holds above these moving averages, it could further reinforce a bullish outlook.Given the current technical indicators and price action, Adani Ports' share price appears well-positioned for a potential upward move. Investors may consider buying at  ₹1438.70, with a stop loss set at  ₹1385 to manage risk. The target price of  ₹1560 aligns with resistance levels, offering a favourable risk-reward ratio, making this a promising trading opportunity.","cleaned_content":"buy or sell stocks following gains in the us and asian stock markets the indian stock market ended at a record closing high on friday last week the nifty \u003cFIVE_TEN\u003e index finished \u003cTHREE_HUNDRED\u003e points higher at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex shot up \u003cONE_THOUSAND\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index ended \u003cSEVEN_HUNDRED\u003e points higher at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were \u003cFOUR_TEN_PERCENT\u003e higher than the previous session aided by ftse rebalancing volumes broad market indices rose less than the nifty even as the advance decline ratio rose sharply to \u003cTWO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes that overall indian stock market bias has turned bullish after the nifty \u003cFIVE_TEN\u003e index climbed to a new peak on friday the choice broking expert said that sentiments might improve further if the \u003cFIVE_TEN\u003e stock index is above the \u003cTWO_TEN_THOUSAND\u003e mark for a few hours on monday next week bagadia said that the frontline index sustaining above the \u003cTWO_TEN_THOUSAND\u003e mark would mean a fresh target of \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e regarding shares to buy sumeet bagadia recommended buying these three stocks on monday bharti airtel nestle india and adani ports 1 bharti airtel buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e bharti airtels share price is currently trading at \u003cONE_THOUSAND\u003e and remains in a long term uptrend consistently forming higher highs and higher lows on the daily timeframe the stock has recently formed a strong bullish candle on the daily chart supported by high trading volumes indicating a continuation of the uptrend after bouncing from its support zones bhartiartl looks poised to continue its upward trajectory toward new highs if it sustains above the \u003cONE_THOUSAND\u003e level the relative strength index rsi is at \u003cSEVEN_TEN\u003e and trending upward reflecting strong buying momentum additionally the stock has bounced from its short term \u003cTWO_TEN\u003e day ema and is trading above all key moving averages further reinforcing the bullish outlook in summary based on the favourable technical setup and critical indicators rsi and moving averages buying bhartiartl at the current market price of \u003cONE_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e and a target of \u003cONE_THOUSAND\u003e presents a compelling opportunity for potential gains this strategy aligns with the stocks ongoing bullish trend 2 nestle india buy around \u003cTWO_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e nestle india is trading at \u003cTWO_THOUSAND\u003e and has recently experienced a breakout from a consolidation phase supported by substantial trading volumes indicating significant buying interest it is recommended to consider buying on dips near the immediate support level of \u003cTWO_THOUSAND\u003e with a stop loss at \u003cTWO_THOUSAND\u003e if the stock holds above the recent high of \u003cTWO_THOUSAND\u003e it could move toward an upside target of \u003cTWO_THOUSAND\u003e the relative strength index rsi stands at \u003cSEVEN_TEN\u003e and is trending upward reinforcing the bullish momentum additionally the stock has bounced from its key moving averages including the short term \u003cTWO_TEN\u003e day medium term \u003cFIVE_TEN\u003e day and long term \u003cTWO_HUNDRED\u003e day emas signalling strong support at these levels nestle indias share price appears well positioned for further upside based on the favourable technical setup and critical indicators rsi and moving averages investors should consider buying on dips with a stop loss set at \u003cTWO_THOUSAND\u003e to manage risk the target price of \u003cTWO_THOUSAND\u003e aligns with resistance levels offering a favourable risk reward ratio and making this a promising trading opportunity 3 adani ports buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e adani ports share price is currently trading around \u003cONE_THOUSAND\u003e it has recently pulled back from higher levels but found support near \u003cONE_THOUSAND\u003e the stock is showing signs of a potential reversal supported by a significant increase in trading volumes indicating strength in the current trend if adani ports share manages to sustain above the \u003cONE_THOUSAND\u003e level it may continue its upward trajectory toward the \u003cONE_THOUSAND\u003e to \u003cONE_THOUSAND\u003e levels the relative strength index rsi is currently at \u003cFOUR_TEN\u003e suggesting the stock is in a neutral zone near a level where buyers could enter adani ports share price is also trading near its key moving averages including the short term \u003cTWO_TEN\u003e day and medium term \u003cFIVE_TEN\u003e day emas if the stock surpasses and holds above these moving averages it could further reinforce a bullish outlook given the current technical indicators and price action adani ports share price appears well positioned for a potential upward move investors may consider buying at \u003cONE_THOUSAND\u003e with a stop loss set at \u003cONE_THOUSAND\u003e to manage risk the target price of \u003cONE_THOUSAND\u003e aligns with resistance levels offering a favourable risk reward ratio making this a promising trading opportunity","timestamp":"2024-09-21T11:24:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}