{"url":"https://www.livemint.com/market/stock-market-news/pi-industries-stock-check-axis-securities-says-hold-the-stock-heres-why-11726739318026.html","title":"PI Industries Stock Check: Axis Securities says hold the stock; here’s why","description":"Stock Check: PI Industries received a 'hold' rating from Axis Securities, targeting  ₹4,980, a 7% rise from  ₹4,668.50. The firm focuses on new product development and operational efficiency to drive revenue growth amid current market conditions.","content":"Stock Check: The brokerage house, Axis Securities, has given a 'hold' rating to PI Industries after conducting a thorough analysis. According to the brokerage, the target price for the stock is  ₹4,980, indicating a 7% upside from the current market price of  ₹4,668.50 (Thursday's close).The brokerage claims that PI Industries is still committed to finding new development prospects and increasing profitability by strengthening its product portfolio and practicing strict working capital management. As newer goods and the Pharma industry contribute more heavily, revenue growth is anticipated to pick up speed.\"Estimates have not been revised at this stage. The stock continues to be valued at 30x FY26E, translating into a target price of  ₹4,980 per share. However, given the recent rally in the stock price, the rating has been changed to HOLD. Financial estimates and the rating will be revisited post the Q2FY25 results,\" said Axis Securities in its report.Let's review the main points of the brokerage's analysis, which includes a breakdown of their assessment into Financial Review and Operational Review.According to the brokerage, the company's topline for FY24 was  ₹7,666 crore, an increase of 18% over  ₹6,492 crore the year before. This expansion was fuelled by a strong 25% rise in export earnings, totalling  ₹6,297 crore, which more than made up for a 6% drop in domestic earnings. Operating EBITDA for the firm increased by 31% to  ₹2,015 crore from  ₹1,542 crore the previous year. The year-over-year operating EBITDA margin was 26%, down from 24% YoY. A favorable product mix and a notable rise in operational leverage were the main drivers of this improvement, which also helped to raise the EBITDA margin.PI Industries reported growth above industry averages despite headwinds from throughout the world, challenges on industry performance, and an inventory destocking cycle that affects generic goods. Increased volumes, new product introductions, improved product mix optimisation, and marginal price increases were the main drivers of the company's revenue growth, according to the brokerage.In order to increase its operating leverage going forward and boost EBITDA and PAT margins, the firm intends to concentrate on these variables. PI commercialised or introduced 13 new goods in FY24: six for export and seven cutting-edge items for the domestic agri-brands market. Being a known innovator, PI's primary growth engine continues to be its capacity to launch new products in collaboration with international giants, especially while they are still in the early phases of development.","cleaned_content":"stock check the brokerage house axis securities has given a hold rating to pi industries after conducting a thorough analysis according to the brokerage the target price for the stock is \u003cFOUR_THOUSAND\u003e indicating a \u003cSEVEN_PERCENT\u003e upside from the current market price of \u003cFOUR_THOUSAND\u003e thursdays close the brokerage claims that pi industries is still committed to finding new development prospects and increasing profitability by strengthening its product portfolio and practicing strict working capital management as newer goods and the pharma industry contribute more heavily revenue growth is anticipated to pick up speed estimates have not been revised at this stage the stock continues to be valued at \u003cTHREE_TEN\u003e x fy26e translating into a target price of \u003cFOUR_THOUSAND\u003e per share however given the recent rally in the stock price the rating has been changed to hold financial estimates and the rating will be revisited post the q2fy25 results said axis securities in its report lets review the main points of the brokerages analysis which includes a breakdown of their assessment into financial review and operational review according to the brokerage the companys topline for fy24 was \u003cSEVEN_THOUSAND\u003e crore an increase of \u003cONE_TEN_PERCENT\u003e over \u003cSIX_THOUSAND\u003e crore the year before this expansion was fuelled by a strong \u003cTWO_TEN_PERCENT\u003e rise in export earnings totalling \u003cSIX_THOUSAND\u003e crore which more than made up for a \u003cSIX_PERCENT\u003e drop in domestic earnings operating ebitda for the firm increased by \u003cTHREE_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e crore from \u003cONE_THOUSAND\u003e crore the previous year the year over year operating ebitda margin was \u003cTWO_TEN_PERCENT\u003e down from \u003cTWO_TEN_PERCENT\u003e yoy a favorable product mix and a notable rise in operational leverage were the main drivers of this improvement which also helped to raise the ebitda margin pi industries reported growth above industry averages despite headwinds from throughout the world challenges on industry performance and an inventory destocking cycle that affects generic goods increased volumes new product introductions improved product mix optimisation and marginal price increases were the main drivers of the companys revenue growth according to the brokerage in order to increase its operating leverage going forward and boost ebitda and pat margins the firm intends to concentrate on these variables pi commercialised or introduced \u003cONE_TEN\u003e new goods in fy24 six for export and seven cutting edge items for the domestic agri brands market being a known innovator pis primary growth engine continues to be its capacity to launch new products in collaboration with international giants especially while they are still in the early phases of development","timestamp":"2024-09-19T16:39:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}