{"url":"https://www.livemint.com/market/stock-market-news/us-dollar-hits-more-than-one-year-low-versus-yen-as-market-eyes-aggressive-fed-rate-cut-11726519617340.html","title":"US dollar hits more than one-year low versus yen as market eyes aggressive Fed rate cut","description":"GLOBAL-FOREX:US dollar hits more than one-year low versus yen as market eyes aggressive Fed rate cut","content":"By Chibuike Oguh and Samuel IndykNEW YORK/LONDON - The U.S. dollar fell to a more than one-year low versus the yen on Monday, as expectations increased that the Federal Reserve could deliver a supersized cut to interest rates later this week.The Fed had been widely expected to announce at least a 25-basis-point cut to interest rates at the conclusion of its September policy meeting on Wednesday.But reports by the Wall Street Journal and Financial Times last week sparked speculation among traders that the central bank could deliver a more aggressive 50 bp cut.Futures markets are pricing in a 61% chance of a 50 bp cut, up from around 15% last week.\"There's only really one story today and that is a continuation of what we saw last week: after the CPI, the market was comfortable with a 25 basis point rate hike but many people suspect the Fed planted a story to put 50 basis points back on the table,\" said Marc Chandler, chief market strategist at Bannockburn Global Forex in New York.\"The markets have responded accordingly. And in fact, they're continuing to adjust.\"The dollar traded as low as 139.58 yen in Asia hours, which was the lowest since July 2023. It was last down 0.10% at 140.690 yen.The dollar index, which measures the currency against six others including the euro, yen and pound, was down 0.29% to 100.73.\"I think that part of it maybe some of the price action may have been exaggerated by the fact that China, Japan, and South Korea on vacation today,\" Chandler added.U.S. Treasury yields have been falling in the run-up to the highly anticipated Fed meeting, particularly as odds stack up for a half-point rate cut.Benchmark 10-year yields are down 30 basis points in about two weeks. Two-year yields, more closely linked to monetary policy expectations, fell 2.5 basis points to 3.5509% and down from roughly 3.94% two weeks ago.Investors are also looking to the Bank of Japan's interest rate decision on Friday, when it is expected to keep its short-term policy rate target steady at 0.25%, having raised rates twice already this year.BOJ board members have indicated they are keen to see rates higher, and the narrowing gap between rates in Japan and other major currencies has spurred the yen higher and caused billions of dollars worth of yen-funded carry trades to be unwound.Sterling rose 0.64% to $1.3206. The euro was up 0.42% at $1.1123.The European Central Bank cut interest rates by 25 bps last week, but ECB President Christine Lagarde dampened expectations for another reduction in borrowing costs next month.The ECB should almost certainly wait until December before cutting interest rates again to be certain it is not making a policy mistake in easing too quickly, ECB Governing Council member Peter Kazimir said on Monday.The Bank of England is expected to hold its key interest rate at 5% on Thursday, after kicking off its easing with a 25-bp reduction in August. Futures markets were pricing in around a 35.9% chance of a quarter-point rate cut on Thursday, versus a 20% chance on Friday.Currency bid prices at 16 September 06:09p.m. GMTDescription RIC Last U.S. Close Previous Session Pct Change YTD Pct High Bid Low BidDollar index 100.73 101.02 -0.28% -0.63% 101.01 100.58Euro/Dollar 1.1123 1.1076 0.43% 0.77% $1.1138 $1.1077Dollar/Yen 140.65 140.87 -0.13% -0.26% 140.865 139.64Euro/Yen 1.1123​ 155.97 0.3% 0.52% 156.67 155.16Dollar/Swiss 0.845 0.8489 -0.49% 0.37% 0.8487 0.8436Sterling/Dollar 1.3207 1.3125 0.65% 3.81% $1.3214 $1.3126​Dollar/Canadian 1.3588 1.3586 0.02% 2.51% 1.3608 1.3568Aussie/Dollar 0.6743 0.6705 0.6% -1.08% $0.6749 $0.67Euro/Swiss 0.9398 0.94 -0.02% 1.21% 0.9407 0.9384Euro/Sterling 0.842 0.8438 -0.21% -2.86% 0.8443 0.8421NZ Dollar/Dollar 0.6189 0.6159 0.5% -2.05% $0.6199 0.6155Dollar/Norway 10.6053​ 10.634 -0.27% 4.64% 10.6423 10.579Euro/Norway 11.7967 11.7914 0.04% 5.1% 11.816 11.7721Dollar/Sweden 10.193 10.2097 -0.16% 1.25% 10.2405 10.1654Euro/Sweden 11.3391 11.3172 0.19% 1.92% 11.3521 11.306This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"by chibuike oguh and samuel indyknew york london the u s dollar fell to a more than one year low versus the yen on monday as expectations increased that the federal reserve could deliver a supersized cut to interest rates later this week the fed had been widely expected to announce at least a \u003cTWO_TEN\u003e basis point cut to interest rates at the conclusion of its september policy meeting on wednesday but reports by the wall street journal and financial times last week sparked speculation among traders that the central bank could deliver a more aggressive \u003cFIVE_TEN\u003e bp cut futures markets are pricing in a \u003cSIX_TEN_PERCENT\u003e chance of a \u003cFIVE_TEN\u003e bp cut up from around \u003cONE_TEN_PERCENT\u003e last week theres only really one story today and that is a continuation of what we saw last week after the cpi the market was comfortable with a \u003cTWO_TEN\u003e basis point rate hike but many people suspect the fed planted a story to put \u003cFIVE_TEN\u003e basis points back on the table said marc chandler chief market strategist at bannockburn global forex in new york the markets have responded accordingly and in fact theyre continuing to adjust the dollar traded as low as \u003cONE_HUNDRED\u003e yen in asia hours which was the lowest since july \u003cTWO_THOUSAND\u003e it was last down \u003cZERO_PERCENT\u003e at \u003cONE_HUNDRED\u003e yen the dollar index which measures the currency against six others including the euro yen and pound was down \u003cZERO_PERCENT\u003e to \u003cONE_HUNDRED\u003e i think that part of it maybe some of the price action may have been exaggerated by the fact that china japan and south korea on vacation today chandler added u s treasury yields have been falling in the run up to the highly anticipated fed meeting particularly as odds stack up for a half point rate cut benchmark \u003cONE_TEN\u003e year yields are down \u003cTHREE_TEN\u003e basis points in about two weeks two year yields more closely linked to monetary policy expectations fell \u003cTWO_\u003e basis points to \u003cTHREE_PERCENT\u003e and down from roughly \u003cTHREE_PERCENT\u003e two weeks ago investors are also looking to the bank of japans interest rate decision on friday when it is expected to keep its short term policy rate target steady at \u003cZERO_PERCENT\u003e having raised rates twice already this year boj board members have indicated they are keen to see rates higher and the narrowing gap between rates in japan and other major currencies has spurred the yen higher and caused billions of dollars worth of yen funded carry trades to be unwound sterling rose \u003cZERO_PERCENT\u003e to \u003cONE_\u003e the euro was up \u003cZERO_PERCENT\u003e at \u003cONE_\u003e the european central bank cut interest rates by \u003cTWO_TEN\u003e bps last week but ecb president christine lagarde dampened expectations for another reduction in borrowing costs next month the ecb should almost certainly wait until december before cutting interest rates again to be certain it is not making a policy mistake in easing too quickly ecb governing council member peter kazimir said on monday the bank of england is expected to hold its key interest rate at \u003cFIVE_PERCENT\u003e on thursday after kicking off its easing with a \u003cTWO_TEN\u003e bp reduction in august futures markets were pricing in around a \u003cTHREE_TEN_PERCENT\u003e chance of a quarter point rate cut on thursday versus a \u003cTWO_TEN_PERCENT\u003e chance on friday currency bid prices at \u003cONE_TEN\u003e september \u003cSIX_\u003e \u003cNINE_\u003e p m gmtdescription ric last u s close previous session pct change ytd pct high bid low biddollar index \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e euro dollar \u003cONE_\u003e \u003cONE_\u003e \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e \u003cONE_\u003e \u003cONE_\u003e dollar yen \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e euro yen \u003cONE_\u003e \u003cONE_HUNDRED\u003e \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e dollar swiss \u003cZERO_\u003e \u003cZERO_\u003e \u003cZERO_PERCENT\u003e \u003cZERO_PERCENT\u003e \u003cZERO_\u003e \u003cZERO_\u003e sterling dollar \u003cONE_\u003e \u003cONE_\u003e \u003cZERO_PERCENT\u003e \u003cTHREE_PERCENT\u003e \u003cONE_\u003e \u003cONE_\u003e dollar canadian \u003cONE_\u003e \u003cONE_\u003e \u003cZERO_PERCENT\u003e \u003cTWO_PERCENT\u003e \u003cONE_\u003e \u003cONE_\u003e aussie dollar \u003cZERO_\u003e \u003cZERO_\u003e \u003cZERO_PERCENT\u003e \u003cONE_PERCENT\u003e \u003cZERO_\u003e \u003cZERO_\u003e euro swiss \u003cZERO_\u003e \u003cZERO_\u003e \u003cZERO_PERCENT\u003e \u003cONE_PERCENT\u003e \u003cZERO_\u003e \u003cZERO_\u003e euro sterling \u003cZERO_\u003e \u003cZERO_\u003e \u003cZERO_PERCENT\u003e \u003cTWO_PERCENT\u003e \u003cZERO_\u003e \u003cZERO_\u003e nz dollar dollar \u003cZERO_\u003e \u003cZERO_\u003e \u003cZERO_PERCENT\u003e \u003cTWO_PERCENT\u003e \u003cZERO_\u003e \u003cZERO_\u003e dollar norway \u003cONE_TEN\u003e \u003cONE_TEN\u003e \u003cZERO_PERCENT\u003e \u003cFOUR_PERCENT\u003e \u003cONE_TEN\u003e \u003cONE_TEN\u003e euro norway \u003cONE_TEN\u003e \u003cONE_TEN\u003e \u003cZERO_PERCENT\u003e \u003cFIVE_PERCENT\u003e \u003cONE_TEN\u003e \u003cONE_TEN\u003e dollar sweden \u003cONE_TEN\u003e \u003cONE_TEN\u003e \u003cZERO_PERCENT\u003e \u003cONE_PERCENT\u003e \u003cONE_TEN\u003e \u003cONE_TEN\u003e euro sweden \u003cONE_TEN\u003e \u003cONE_TEN\u003e \u003cZERO_PERCENT\u003e \u003cONE_PERCENT\u003e \u003cONE_TEN\u003e \u003cONE_TEN\u003e this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-17T02:16:00+05:30","market_timestamp":"2024-09-17T09:15:00+05:30","off_market_hours":true}