{"url":"https://www.livemint.com/market/stock-market-news/bajaj-housing-finance-shares-soar-159-from-ipo-price-of-rs-70-how-much-more-room-left-philip-capital-explains-11726548747494.html","title":"Bajaj Housing shares hit 10% upper circuit, jumps 160% post-listing. Philip Capital sees more upside","description":"Phillip Capital forecasts a 27% rise for Bajaj Housing Finance Ltd in the next year, initiating coverage with a 'Buy' recommendation. The brokerage emphasizes the company's strategic focus and expects it to be among India’s top four mortgage players.","content":"Stock market today: After a dream debut on Dalal Street during Monday deals, Bajaj Housing Finance shares remained under the bulls' radar on Tuesday. Bajaj Housing Finance share price today opened with an upside gap at  ₹175.50 apiece on the NSE and touched an intraday high of  ₹181.50 within a few hours of the Opening Bell. While climbing to this intraday high, the newly listed Bajaj Group shares locked in the upper circuit for a second straight session post-listing. This intraday high is around 160 per cent higher than the Bajaja Housing Finance IPO price band's upper price band. However, Phillip Capital sees more upside in Bajaj Housing Finance shares.Following Bajaj Housing Finance Ltd's outstanding multi-bagger debut on September 16, brokerage house Phillip Capital sees further upside potential for the stock over the next year, forecasting an additional 27 per cent rise. The stock hit its 10 per cent upper circuit in intra-day deals today, September 17, to its new high of  ₹181.48. It has now rallied over 159 per cent from its IPO price of  ₹70.Initiating coverage with a \"Buy\" recommendation, the brokerage highlighted the company’s strategic positioning and unique focus in the housing finance market. Furthermore, in its bull case scenario, the brokerage foresees over 35 per cent upside in the stock.Phillip Capital’s evaluation involved three scenarios, with a conservative 15 per cent hold-co discount despite no tax obligation for such a discount. The brokerage attributed 50 per cent weight to the base case, 40 per cent to a bear case, and 10 per cent to a bull case, assuming a P/E multiple of 30x, around 20 per cent below the +1 standard deviation of Bajaj Finance. For BHFL’s standalone credit business, an earnings multiple was used, while a price-to-book multiple was applied to its housing finance operations, reflecting its traditional lending model.The brokerage praised the company's focus on salaried home loans, stable expense ratios, and manageable credit costs, all contributing to impressive return ratios.Bajaj Housing Finance’s stock market debut was nothing short of stellar, doubling investors' capital. The shares were listed at  ₹150 per share on the BSE and NSE, marking a premium of 114.29 per cent over the issue price of  ₹70 per share.The IPO, held from September 9 to 11, was oversubscribed by 63.61 times, with bids for more than 4,628 crore equity shares compared to the 72.75 crore shares offered. The applications were valued at nearly  ₹3.24 lakh crore. The company raised  ₹6,560 crore through a mix of fresh issue and offer-for-sale (OFS) components, with the fresh issue accounting for  ₹3,560 crore and the OFS contributing  ₹3,000 crore.Phillip Capital projects that BHFL will be among India’s top four mortgage players in the medium term. Despite only six years of operations, BHFL has already established itself among the top seven mortgage originators and the top three housing finance companies (HFCs) in the country. The company aims to maintain gross non-performing assets (NPA) between 0.6 and 0.8 per cent, focusing primarily on salaried housing loans.According to Phillip Capital, BHFL leverages Bajaj Finance’s extensive customer base 88 million for data insights, allowing it to create well-targeted offerings focusing on cross-selling. To support this growth, Bajaj Finance infused  ₹2,500 crore in capital in FY23 and an additional  ₹2,000 crore via a rights issue, bringing the total capital infusion to  ₹9,500 crore. Backed by strong parentage and a low-risk business model, BHFL has received an AAA rating from CRISIL and India Ratings.BHFL’s Competitive Position in the Home Loan Market: The brokerage noted that BHFL primarily caters to home loan customers with an average annual income of  ₹14 lakh, giving it the advantage of targeting individuals with pricing power and multiple options in key markets. Additionally, BHFL strategically offers top-up home loans, enhancing yields in an intensely competitive sector. This approach was seen as a smart move to differentiate its peers.Sourcing and Risk Management: According to the brokerage, approximately 40 per cent of BHFL’s home loans were sourced from existing BAF customers, and nearly 90 per cent of its home loan borrowers were salaried individuals. This customer profile allowed BHFL to operate with a lower expense ratio in the medium term and improve risk-adjusted spreads, contributing to superior return ratios compared to its peers. The focus on salaried customers helped reduce operational costs while improving risk metrics.Loan Against Property (LAP) and Cost Efficiency: Roughly 70 per cent of BHFL’s Loan Against Property (LAP) portfolio comprised loans for self-occupied residential properties, with around 45 per cent LTV (loan-to-value) originating from existing customers. This focus on self-occupied properties strongly emphasised cost management and enhanced return ratios. As BHFL expanded its operations, its AUM per branch neared that of LIC Housing Finance (LICHF), while its AUM per employee was comparable to Can Fin Homes. However, despite better borrowing costs than Can Fin Homes, BHFL’s risk-adjusted spreads remained lower, reflected in its Return on Equity (RoE), noted the brokerage.Growth Outlook and Focus on High-Yield Segments: Phillip Capital highlighted BHFL’s strategic focus on the ‘desirable’  ₹50 lakh ticket size, which accounts for approximately 65 per cent of home loan originations in India. This focus, combined with its increasing interest in Lease Rental Discounting (LRD)—a high-yield segment offering operational leverage—positioned BHFL favourably for long-term growth. Its construction finance (CF) portfolio, expected to remain between 8 and 10 per cent of the total book, was considered range-bound.The brokerage expects BHFL to have a balance sheet exceeding  ₹2 lakh crore in the next three years. In the short term, credit costs are anticipated to remain benign. At the same time, the company's commitment to building a low-risk balance sheet is expected to result in a robust Return on Assets (RoA) of over 2% and a Return on Equity (RoE) above 12 per cent. As BHFL continues to scale, its expense ratios will likely improve, further enhancing return ratios.\"With a guidance of GNPA of 0.6-0.8 per cent, we expect credit cost to remain benign in the near term; this, along with its focus on building a low-risk balance sheet, will lead to RoA/RoE of 2 per cent/12 per cent in FY25-27,\" projected the brokerage.","cleaned_content":"stock market today after a dream debut on dalal street during monday deals bajaj housing finance shares remained under the bulls radar on tuesday bajaj housing finance share price today opened with an upside gap at \u003cONE_HUNDRED\u003e apiece on the nse and touched an intraday high of \u003cONE_HUNDRED\u003e within a few hours of the opening bell while climbing to this intraday high the newly listed bajaj group shares locked in the upper circuit for a second straight session post listing this intraday high is around \u003cONE_HUNDRED_PERCENT\u003e higher than the bajaja housing finance ipo price bands upper price band however phillip capital sees more upside in bajaj housing finance shares following bajaj housing finance ltds outstanding multi bagger debut on september \u003cONE_TEN\u003e brokerage house phillip capital sees further upside potential for the stock over the next year forecasting an additional \u003cTWO_TEN_PERCENT\u003e rise the stock hit its \u003cONE_TEN_PERCENT\u003e upper circuit in intra day deals today september \u003cONE_TEN\u003e to its new high of \u003cONE_HUNDRED\u003e it has now rallied over \u003cONE_HUNDRED_PERCENT\u003e from its ipo price of \u003cSEVEN_TEN\u003e initiating coverage with a buy recommendation the brokerage highlighted the company s strategic positioning and unique focus in the housing finance market furthermore in its bull case scenario the brokerage foresees over \u003cTHREE_TEN_PERCENT\u003e upside in the stock phillip capital s evaluation involved three scenarios with a conservative \u003cONE_TEN_PERCENT\u003e hold co discount despite no tax obligation for such a discount the brokerage attributed \u003cFIVE_TEN_PERCENT\u003e weight to the base case \u003cFOUR_TEN_PERCENT\u003e to a bear case and \u003cONE_TEN_PERCENT\u003e to a bull case assuming a p e multiple of \u003cTHREE_TEN\u003e x around \u003cTWO_TEN_PERCENT\u003e below the \u003cONE_\u003e standard deviation of bajaj finance for bhfl s standalone credit business an earnings multiple was used while a price to book multiple was applied to its housing finance operations reflecting its traditional lending model the brokerage praised the companys focus on salaried home loans stable expense ratios and manageable credit costs all contributing to impressive return ratios bajaj housing finance s stock market debut was nothing short of stellar doubling investors capital the shares were listed at \u003cONE_HUNDRED\u003e per share on the bse and nse marking a premium of \u003cONE_HUNDRED_PERCENT\u003e over the issue price of \u003cSEVEN_TEN\u003e per share the ipo held from september \u003cNINE_\u003e to \u003cONE_TEN\u003e was oversubscribed by \u003cSIX_TEN\u003e times with bids for more than \u003cFOUR_THOUSAND\u003e crore equity shares compared to the \u003cSEVEN_TEN\u003e crore shares offered the applications were valued at nearly \u003cTHREE_\u003e lakh crore the company raised \u003cSIX_THOUSAND\u003e crore through a mix of fresh issue and offer for sale ofs components with the fresh issue accounting for \u003cTHREE_THOUSAND\u003e crore and the ofs contributing \u003cTHREE_THOUSAND\u003e crore phillip capital projects that bhfl will be among india s top four mortgage players in the medium term despite only six years of operations bhfl has already established itself among the top seven mortgage originators and the top three housing finance companies hfcs in the country the company aims to maintain gross non performing assets npa between \u003cZERO_\u003e and \u003cZERO_PERCENT\u003e focusing primarily on salaried housing loans according to phillip capital bhfl leverages bajaj finance s extensive customer base \u003cEIGHT_TEN\u003e million for data insights allowing it to create well targeted offerings focusing on cross selling to support this growth bajaj finance infused \u003cTWO_THOUSAND\u003e crore in capital in fy23 and an additional \u003cTWO_THOUSAND\u003e crore via a rights issue bringing the total capital infusion to \u003cNINE_THOUSAND\u003e crore backed by strong parentage and a low risk business model bhfl has received an aaa rating from crisil and india ratings bhfl s competitive position in the home loan market the brokerage noted that bhfl primarily caters to home loan customers with an average annual income of \u003cONE_TEN\u003e lakh giving it the advantage of targeting individuals with pricing power and multiple options in key markets additionally bhfl strategically offers top up home loans enhancing yields in an intensely competitive sector this approach was seen as a smart move to differentiate its peers sourcing and risk management according to the brokerage approximately \u003cFOUR_TEN_PERCENT\u003e of bhfl s home loans were sourced from existing baf customers and nearly \u003cNINE_TEN_PERCENT\u003e of its home loan borrowers were salaried individuals this customer profile allowed bhfl to operate with a lower expense ratio in the medium term and improve risk adjusted spreads contributing to superior return ratios compared to its peers the focus on salaried customers helped reduce operational costs while improving risk metrics loan against property lap and cost efficiency roughly \u003cSEVEN_TEN_PERCENT\u003e of bhfl s loan against property lap portfolio comprised loans for self occupied residential properties with around \u003cFOUR_TEN_PERCENT\u003e ltv loan to value originating from existing customers this focus on self occupied properties strongly emphasised cost management and enhanced return ratios as bhfl expanded its operations its aum per branch neared that of lic housing finance lichf while its aum per employee was comparable to can fin homes however despite better borrowing costs than can fin homes bhfl s risk adjusted spreads remained lower reflected in its return on equity roe noted the brokerage growth outlook and focus on high yield segments phillip capital highlighted bhfl s strategic focus on the desirable \u003cFIVE_TEN\u003e lakh ticket size which accounts for approximately \u003cSIX_TEN_PERCENT\u003e of home loan originations in india this focus combined with its increasing interest in lease rental discounting lrd a high yield segment offering operational leverage positioned bhfl favourably for long term growth its construction finance cf portfolio expected to remain between \u003cEIGHT_\u003e and \u003cONE_TEN_PERCENT\u003e of the total book was considered range bound the brokerage expects bhfl to have a balance sheet exceeding \u003cTWO_\u003e lakh crore in the next three years in the short term credit costs are anticipated to remain benign at the same time the companys commitment to building a low risk balance sheet is expected to result in a robust return on assets roa of over \u003cTWO_PERCENT\u003e and a return on equity roe above \u003cONE_TEN_PERCENT\u003e as bhfl continues to scale its expense ratios will likely improve further enhancing return ratios with a guidance of gnpa of \u003cZERO_\u003e \u003cZERO_PERCENT\u003e we expect credit cost to remain benign in the near term this along with its focus on building a low risk balance sheet will lead to roa roe of \u003cTWO_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e in fy25 \u003cTWO_TEN\u003e projected the brokerage","timestamp":"2024-09-17T14:55:00+05:30","market_timestamp":"2024-09-17T14:55:00+05:30","off_market_hours":false}