{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-dharmesh-shah-of-icici-securities-recommends-buying-tata-consumer-union-bank-on-september-23-11726845253931.html","title":"Stocks to buy or sell : Dharmesh Shah of ICICI Securities recommends buying Tata Consumer, and Union Bank tomorrow","description":"Stocks to buy or sell : Dharmesh Shah of ICICI Securities recommends buying Tata Consumer Products Ltd and Union Bank of India this week.","content":"Stock Market News: On Friday, the domestic benchmark indices, Sensex and Nifty 50, reached all-time highs and recorded weekly gains following a substantial interest rate cut by the US Federal Reserve earlier in the week, which stimulated investor risk appetite in global markets.The Nifty 50 climbed 1.48% to 25,790.95, while the Sensex rose 1.63% to 84,544.31, marking new record closing highs. Over the week, the Nifty 50 and Sensex saw gains of 1.7% and 2% respectively, marking the fifth week of gains in six.The Indian market has joined the rise after the Fed slashed interest rates by 50 basis points and implemented a very accommodativemonetary policy, according to Vinod Nair, Head of Research at Geojit Financial Services. Given the continued strength of the global economy, it is anticipated to have a positive short- to medium-term impact on the economy and foreign inflows. In rate-sensitive industries like finance and autos, traction is strong. Conventional industries, such as FMCG, are also doing well in expectation of positive outcomes driven by the combined advantages of rising demand and falling input costs.The equity benchmark concluded eventful week on a positive note as US Fed rate cut boosted market sentiment. The index started the week on a muted note. However, Friday’s sharp up move helped index to resolve higher and clocked a fresh all time high of 25,849. Consequently, Nifty 50 surpassed our target of 25,800. The formation of sizable weekly candle with carrying higher high-low formation signifies continuation of uptrend.The formation of higher peak and trough supported by revived traction in Bank Nifty signifies inherent strength that makes us revise target to 26,200 for the upcoming month. However, readers should note that over past 2 weeks Nifty has rallied ~1,100 points, which hauled short term oscillator in overbought conditions. Thus, any temporary breather from hereon should be capitalised as incremental buying opportunity as strong support is placed at 25,300. Our positive bias is validated by following observations:a) Last few sessions, large caps have relatively outperformed Midcap category, which is reflected in weak breadth. Fed’s 50 bps cut has put spotlight on dollar index which is expected to weaken. Technically, its already in sequential downtrend. However, decisive breach of 100 mark would lead to sharp and quick decline towards 98 and would be positive in terms of global liquidity especially for EM including India. Consequently, large caps may remain in focus going forward.b) On expected lines, ratio chart of Bank Nifty / Nifty 50 staged a strong rebound from cycle low. As a result, Bank Nifty scaled back to life highs led by large private banks. With banks having significant weightage on Nifty 50, strength in corporate banks and large NBFCs would act as tailwind for current uptrend. PSU Banks have also achieved price wise maturity of uptrend and provide favourable risk-reward. We expect, Bank Nifty to gradually head towards 54,800 while strong support is placed at 52,800.Sectorally, BFSI, Capital Goods, IT, Infra, Real Estate, Consumption are expected to outperform while PSU banks are currently poised at key support.The buying demand at elevated base makes us revise support base at psychological mark of 25,300 as it is placement of 20 days EMA coincided with last week’s low.On stocks to buy next week, Dharmesh Shah recommended two stocks -1. Buy Tata Consumer Products Ltd in the range of  ₹1,195-1,220 for the target of  ₹1,295 with a stop loss of  ₹1,140.2. Buy Union Bank of India in the range of  ₹120-124 for the target of  ₹140 with a stop loss of  ₹114.The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and individual circumstances may vary.","cleaned_content":"stock market news on friday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e reached all time highs and recorded weekly gains following a substantial interest rate cut by the us federal reserve earlier in the week which stimulated investor risk appetite in global markets the nifty \u003cFIVE_TEN\u003e climbed \u003cONE_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e while the sensex rose \u003cONE_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e marking new record closing highs over the week the nifty \u003cFIVE_TEN\u003e and sensex saw gains of \u003cONE_PERCENT\u003e and \u003cTWO_PERCENT\u003e respectively marking the fifth week of gains in six the indian market has joined the rise after the fed slashed interest rates by \u003cFIVE_TEN\u003e basis points and implemented a very accommodativemonetary policy according to vinod nair head of research at geojit financial services given the continued strength of the global economy it is anticipated to have a positive short to medium term impact on the economy and foreign inflows in rate sensitive industries like finance and autos traction is strong conventional industries such as fmcg are also doing well in expectation of positive outcomes driven by the combined advantages of rising demand and falling input costs the equity benchmark concluded eventful week on a positive note as us fed rate cut boosted market sentiment the index started the week on a muted note however friday s sharp up move helped index to resolve higher and clocked a fresh all time high of \u003cTWO_TEN_THOUSAND\u003e consequently nifty \u003cFIVE_TEN\u003e surpassed our target of \u003cTWO_TEN_THOUSAND\u003e the formation of sizable weekly candle with carrying higher high low formation signifies continuation of uptrend the formation of higher peak and trough supported by revived traction in bank nifty signifies inherent strength that makes us revise target to \u003cTWO_TEN_THOUSAND\u003e for the upcoming month however readers should note that over past \u003cTWO_\u003e weeks nifty has rallied \u003cONE_THOUSAND\u003e points which hauled short term oscillator in overbought conditions thus any temporary breather from hereon should be capitalised as incremental buying opportunity as strong support is placed at \u003cTWO_TEN_THOUSAND\u003e our positive bias is validated by following observations a last few sessions large caps have relatively outperformed midcap category which is reflected in weak breadth fed s \u003cFIVE_TEN\u003e bps cut has put spotlight on dollar index which is expected to weaken technically its already in sequential downtrend however decisive breach of \u003cONE_HUNDRED\u003e mark would lead to sharp and quick decline towards \u003cNINE_TEN\u003e and would be positive in terms of global liquidity especially for em including india consequently large caps may remain in focus going forward b on expected lines ratio chart of bank nifty nifty \u003cFIVE_TEN\u003e staged a strong rebound from cycle low as a result bank nifty scaled back to life highs led by large private banks with banks having significant weightage on nifty \u003cFIVE_TEN\u003e strength in corporate banks and large nbfcs would act as tailwind for current uptrend psu banks have also achieved price wise maturity of uptrend and provide favourable risk reward we expect bank nifty to gradually head towards \u003cFIVE_TEN_THOUSAND\u003e while strong support is placed at \u003cFIVE_TEN_THOUSAND\u003e sectorally bfsi capital goods it infra real estate consumption are expected to outperform while psu banks are currently poised at key support the buying demand at elevated base makes us revise support base at psychological mark of \u003cTWO_TEN_THOUSAND\u003e as it is placement of \u003cTWO_TEN\u003e days ema coincided with last week s low on stocks to buy next week dharmesh shah recommended two stocks \u003cONE_\u003e buy tata consumer products ltd in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e for the target of \u003cONE_THOUSAND\u003e with a stop loss of \u003cONE_THOUSAND\u003e buy union bank of india in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e for the target of \u003cONE_HUNDRED\u003e with a stop loss of \u003cONE_HUNDRED\u003e the views and recommendations provided in this analysis are those of individual analysts or broking companies not mint we strongly advise investors to consult with certified experts before making any investment decisions as market conditions can change rapidly and individual circumstances may vary","timestamp":"2024-09-22T10:54:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}