{"url":"https://www.livemint.com/market/stock-market-news/olectra-greentech-jbm-auto-shares-jump-up-to-8-7-on-pm-ebus-sewa-scheme-11726116378456.html","title":"Olectra Greentech, JBM Auto shares jump up to 8.7% on PM-eBus sewa scheme","description":"The Union Cabinet approved the PM E-DRIVE and PM-eBus Sewa schemes to promote electric buses and vehicles, providing financial incentives and support. The initiatives aim to increase e-bus deployment and reduce greenhouse gas emissions, enhancing the role of private operators in public transport.","content":"Shares of electric bus manufacturers, including Olectra Greentech and JBM Auto, surged by 5 per cent and 8.7 per cent, respectively, during today’s trading session. The former reached  ₹1,699, while the latter touched  ₹2,093 apiece.This boost follows the recent approval by the Union Cabinet of the “PM-eBus Sewa-Payment Security Mechanism (PSM) scheme”. The scheme, with a total outlay of  ₹3,435.33 crore, is aimed at supporting the procurement and operation of electric buses (e-buses) by Public Transport Authorities (PTAs).Under the scheme, more than 38,000 electric buses are expected to be deployed from FY 2024-25 to FY 2028-29, with support provided for up to 12 years from the date of deployment. Currently, the majority of buses operated by PTAs run on diesel or CNG, and electric buses account for less than 10 per cent of the total bus fleet on Indian roads.Historically, the high upfront cost and lower revenue realization from electric buses have posed challenges for PTAs in procuring and operating these vehicles. To overcome this, the scheme facilitates the acquisition of e-buses through a public-private partnership (PPP) under a gross cost contract (GCC) model. This model eliminates the need for PTAs to pay the upfront costs, as OEMs/operators handle procurement and operation with monthly payments.However, OEMs/operators have been reluctant to engage in this model due to concerns over payment defaults. To address this issue, the scheme includes a dedicated fund to ensure timely payments to OEMs/operators. If PTAs default on payments, CESL, the implementing agency, will cover the payments from the scheme funds, which will later be recovered from the PTAs, States, or UTs.This initiative aims to boost the adoption of electric buses by promoting private sector participation, significantly reducing greenhouse gas emissions, and decreasing fossil fuel consumption. It benefits all PTAs across States and UTs participating in the scheme.In addition, the Union Cabinet has also approved the \"PM Electric Drive Revolution In Innovative Vehicle Enhancement\" (PM E-DRIVE) scheme, which will succeed the previous FAME program that concluded in March after a nine-year run.This new scheme, with a total allocation of  ₹10,900 crore over two years, does not extend support to electric cars or hybrid vehicles, contrary to some expectations.The key elements of the PM E-DRIVE scheme include subsidies and demand incentives totalling  ₹3,679 crore. These incentives are designed to promote the adoption of electric two-wheelers (e-2Ws), three-wheelers (e-3Ws), e-ambulances, e-trucks, and other emerging electric vehicles (EVs).Specifically, the scheme aims to support 24.79 lakh e-2Ws, 3.16 lakh e-3Ws, and 14,028 e-buses.","cleaned_content":"shares of electric bus manufacturers including olectra greentech and jbm auto surged by \u003cFIVE_PERCENT\u003e and \u003cEIGHT_PERCENT\u003e respectively during today s trading session the former reached \u003cONE_THOUSAND\u003e while the latter touched \u003cTWO_THOUSAND\u003e apiece this boost follows the recent approval by the union cabinet of the pm ebus sewa payment security mechanism psm scheme the scheme with a total outlay of \u003cTHREE_THOUSAND\u003e crore is aimed at supporting the procurement and operation of electric buses e buses by public transport authorities ptas under the scheme more than \u003cTHREE_TEN_THOUSAND\u003e electric buses are expected to be deployed from fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e to fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with support provided for up to \u003cONE_TEN\u003e years from the date of deployment currently the majority of buses operated by ptas run on diesel or cng and electric buses account for less than \u003cONE_TEN_PERCENT\u003e of the total bus fleet on indian roads historically the high upfront cost and lower revenue realization from electric buses have posed challenges for ptas in procuring and operating these vehicles to overcome this the scheme facilitates the acquisition of e buses through a public private partnership ppp under a gross cost contract gcc model this model eliminates the need for ptas to pay the upfront costs as oems operators handle procurement and operation with monthly payments however oems operators have been reluctant to engage in this model due to concerns over payment defaults to address this issue the scheme includes a dedicated fund to ensure timely payments to oems operators if ptas default on payments cesl the implementing agency will cover the payments from the scheme funds which will later be recovered from the ptas states or uts this initiative aims to boost the adoption of electric buses by promoting private sector participation significantly reducing greenhouse gas emissions and decreasing fossil fuel consumption it benefits all ptas across states and uts participating in the scheme in addition the union cabinet has also approved the pm electric drive revolution in innovative vehicle enhancement pm e drive scheme which will succeed the previous fame program that concluded in march after a nine year run this new scheme with a total allocation of \u003cONE_TEN_THOUSAND\u003e crore over two years does not extend support to electric cars or hybrid vehicles contrary to some expectations the key elements of the pm e drive scheme include subsidies and demand incentives totalling \u003cTHREE_THOUSAND\u003e crore these incentives are designed to promote the adoption of electric two wheelers e \u003cTWO_\u003e ws three wheelers e \u003cTHREE_\u003e ws e ambulances e trucks and other emerging electric vehicles evs specifically the scheme aims to support \u003cTWO_TEN\u003e lakh e \u003cTWO_\u003e ws \u003cTHREE_\u003e lakh e \u003cTHREE_\u003e ws and \u003cONE_TEN_THOUSAND\u003e e buses","timestamp":"2024-09-12T12:11:00+05:30","market_timestamp":"2024-09-12T12:11:00+05:30","off_market_hours":false}