{"url":"https://www.livemint.com/market/stock-market-news/adani-groups-ambuja-cements-faces-customs-penalty-cmo-arrest-on-bribery-charges-share-price-green-amidst-storm-11726206860047.html","title":"Ambuja Cements share price stays in green even as it faces double blow with customs penalty and CMO arrest","description":"Ambuja Cements, a major player in India's cement industry, is facing a perfect storm of challenges. The company has been hit with a significant customs penalty and its Chief Manufacturing Officer has been arrested on bribery charges.","content":"Ambuja Cements Limited, a major entity in India's cement sector, has been levied a significant penalty by customs authorities. In a recent disclosure to stock exchanges, the company reported receiving an order from the Office of Commissioner of Customs, Mumbai, on September 12 imposing fines and duties amounting to approximately  ₹1.39 crore.However, on September 13, at 11:30 AM, the shares of Ambuja Cements were trading in the green, up 0.83 per cent, at  ₹634.15 on the BSE.The order, issued on September 11, 2024, details the following financial obligations:The penalty arises from what authorities allege was a misclassification of goods, which led to the company being denied a lower basic customs duty rate.In response, Ambuja Cements said, \"The Company is taking appropriate steps to appeal against the said order imposing the penalty before the appropriate authority.\" Despite the significant monetary penalties, the company remains optimistic. Ambuja Cements added, \"The Company does not foresee any material impact on financial or operational or other activities of the Company.\"To compound its troubles, Ambuja Cements suffered another major setback on September 12, 2024, when Rambhav Gattu, the company’s Chief Manufacturing Officer (CMO) in Chhattisgarh, was arrested on bribery charges. According to Odisha’s vigilance directorate, Gattu attempted to bribe the collector of the Barghar region by offering a bouquet and a packet of sweets containing  ₹2,00,000 in cash, as per Reuters.The vigilance directorate said, \"A case has been registered against the officer for attempting to induce a public servant... The accused was arrested and forwarded to the court. Investigation of the case is in progress.\" Ambuja Cements and its parent company, Adani Group, have yet to issue any comment on the incident, as quoted by Reuters.","cleaned_content":"ambuja cements limited a major entity in indias cement sector has been levied a significant penalty by customs authorities in a recent disclosure to stock exchanges the company reported receiving an order from the office of commissioner of customs mumbai on september \u003cONE_TEN\u003e imposing fines and duties amounting to approximately \u003cONE_\u003e crore however on september \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e am the shares of ambuja cements were trading in the green up \u003cZERO_PERCENT\u003e at \u003cSIX_HUNDRED\u003e on the bse the order issued on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e details the following financial obligations the penalty arises from what authorities allege was a misclassification of goods which led to the company being denied a lower basic customs duty rate in response ambuja cements said the company is taking appropriate steps to appeal against the said order imposing the penalty before the appropriate authority despite the significant monetary penalties the company remains optimistic ambuja cements added the company does not foresee any material impact on financial or operational or other activities of the company to compound its troubles ambuja cements suffered another major setback on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e when rambhav gattu the company s chief manufacturing officer cmo in chhattisgarh was arrested on bribery charges according to odisha s vigilance directorate gattu attempted to bribe the collector of the barghar region by offering a bouquet and a packet of sweets containing \u003cTWO_HUNDRED_THOUSAND\u003e in cash as per reuters the vigilance directorate said a case has been registered against the officer for attempting to induce a public servant the accused was arrested and forwarded to the court investigation of the case is in progress ambuja cements and its parent company adani group have yet to issue any comment on the incident as quoted by reuters","timestamp":"2024-09-13T12:22:00+05:30","market_timestamp":"2024-09-13T12:22:00+05:30","off_market_hours":false}