{"url":"https://www.livemint.com/market/stock-market-news/microsoft-boosts-s-p-500-with-2-5-rise-on-new-60-billion-buyback-plan-quarterly-dividend-hiked-by-10-11726587589386.html","title":"Microsoft boosts S\u0026P 500 with 2.5% rise on new $60 billion buyback plan, quarterly dividend hiked by 10%","description":"Microsoft Corp. announced a 10% increase in its quarterly dividend and launched a new $60 billion stock buyback program, matching the size of its repurchase plan from three years ago.","content":"Microsoft Corp. announced a 10 per cent increase in its quarterly dividend and introduced a new $60 billion stock buyback program, matching the scale of its repurchase plan from three years ago. The company's shares rose by up to 2.4 per cent following the news.In a statement late Monday, the tech giant revealed that shareholders as of November 21 will receive a quarterly dividend of 83 cents per share, up from the current 75 cents. The new share repurchase program, which has no expiration date, replaces the $60 billion buyback plan announced in 2021.Although the figures are substantial in absolute terms, the buyback agreement accounts for less than 2 per cent of Microsoft's total market value. Shares of the Redmond, Washington-based company have risen by 31 per cent over the past 12 months, bringing its market capitalization to $3.2 trillion as of Monday's close. Microsoft typically spreads its share repurchases over several years, with approximately $17 billion spent on buybacks in the fiscal year ending in June, according to Bloomberg data.As of 10:02 a.m. New York time, Microsoft’s shares were up 1.7 per cent at $438.74.In recent months, Microsoft’s stock has reached new all-time highs, driven by investor optimism about potential gains from its advancements in artificial intelligence.The company has integrated AI technology from its partner OpenAI into its product suite, promoting the tools’ ability to enhance business applications such as Teams, Word, and Outlook. On Monday, Microsoft also unveiled a new suite of AI tools.As of June 30, Microsoft held $75.5 billion in cash and equivalents, according to Bloomberg data.The company reported in July that free cash flow for the fiscal fourth quarter was $23.3 billion, an 18 per cent increase year-over-year, driven by higher capital expenditures to support its cloud and AI services.(With inputs from Bloomberg)","cleaned_content":"microsoft corp announced a \u003cONE_TEN_PERCENT\u003e increase in its quarterly dividend and introduced a new \u003cSIX_TEN\u003e billion stock buyback program matching the scale of its repurchase plan from three years ago the companys shares rose by up to \u003cTWO_PERCENT\u003e following the news in a statement late monday the tech giant revealed that shareholders as of november \u003cTWO_TEN\u003e will receive a quarterly dividend of \u003cEIGHT_TEN\u003e cents per share up from the current \u003cSEVEN_TEN\u003e cents the new share repurchase program which has no expiration date replaces the \u003cSIX_TEN\u003e billion buyback plan announced in \u003cTWO_THOUSAND\u003e although the figures are substantial in absolute terms the buyback agreement accounts for less than \u003cTWO_PERCENT\u003e of microsofts total market value shares of the redmond washington based company have risen by \u003cTHREE_TEN_PERCENT\u003e over the past \u003cONE_TEN\u003e months bringing its market capitalization to \u003cTHREE_\u003e trillion as of mondays close microsoft typically spreads its share repurchases over several years with approximately \u003cONE_TEN\u003e billion spent on buybacks in the fiscal year ending in june according to bloomberg data as of \u003cONE_TEN\u003e \u003cTWO_\u003e a m new york time microsoft s shares were up \u003cONE_PERCENT\u003e at \u003cFOUR_HUNDRED\u003e in recent months microsoft s stock has reached new all time highs driven by investor optimism about potential gains from its advancements in artificial intelligence the company has integrated ai technology from its partner openai into its product suite promoting the tools ability to enhance business applications such as teams word and outlook on monday microsoft also unveiled a new suite of ai tools as of june \u003cTHREE_TEN\u003e microsoft held \u003cSEVEN_TEN\u003e billion in cash and equivalents according to bloomberg data the company reported in july that free cash flow for the fiscal fourth quarter was \u003cTWO_TEN\u003e billion an \u003cONE_TEN_PERCENT\u003e increase year over year driven by higher capital expenditures to support its cloud and ai services with inputs from bloomberg","timestamp":"2024-09-17T21:39:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}