{"url":"https://www.livemint.com/market/stock-market-news/stocks-at-52-week-high-icici-bank-to-hcl-tech-300-shares-hit-one-year-high-on-tuesday-do-you-own-any-11726567745531.html","title":"Stocks at 52-week high: ICICI Bank to HCL Tech — 300 shares hit one-year high on Tuesday. Do you own any?","description":"Stocks at 52-week high: Almost 300 stocks, including ICICI Bank, HCL Tech, Bharti Airtel and Tech Mahindra, hit fresh 52-week highs in intraday trade on the BSE on Tuesday, September 17.","content":"Stocks at 52-week high: Almost 300 stocks, including ICICI Bank, HCL Tech, Bharti Airtel and Tech Mahindra, hit fresh 52-week highs in intraday trade on the BSE on Tuesday, September 17, even as Indian stock market benchmarks- the Sensex and the Nifty 50- closed with gains for the second consecutive session.Bajaj Auto, Hero MotoCorp, Apollo Hospitals, Britannia Industries, Dabur, Marico, Cipla, Divi's Labs, LTIMindtree, Persistent Systems, Naukri, Shriram Finance, Trent and United Spirits were also among the stocks that rose to their one-year highs.The domestic market advanced, buoyed by positive global cues ahead of the US Fed policy decision on Wednesday. However, gains were limited as widespread expectations point to a 25 bps rate cut by the Fed, in line with market forecasts.A 25 bps rate cut may not impact the market positively as it is almost discounted. However, there are speculations that the US central bank may go for an aggressive rate cut.\"Futures markets are fully pricing in a quarter-point cut and now imply almost a 70 per cent chance that the Fed could ease rates by half a percentage point on Wednesday, up from around a 15 per cent chance last week, after a slew of media reports revived the prospect of more aggressive easing,\" reported Reuters.Benchmarks the Sensex and the Nifty 50 extended gains into the second consecutive session, while the mid and smallcap segments on the BSE ended in the red.The Sensex closed 91 points, or 0.11 per cent, higher at 83,079.66, while the Nifty 50 settled at 25,418.55, up 35 points, or 0.14 per cent.On the other hand, the BSE Midcap index slipped 0.08 per cent and the Smallcap index declined 0.13 per cent.The total market capitalisation of BSE-listed firms declined slightly to nearly  ₹470.3 lakh crore from  ₹470.5 lakh crore in the previous session.Shares of Bharti Airtel, NTPC and Mahindra and Mahindra closed as the top gainers in the Sensex index, while those of Tata Motors, Adani Ports and JSW Steel closed as the top losers in the index.\"The Indian market exhibited a subtle positive momentum, driven by the anticipation of a rate cut cycle by the US Fed. Although a 25-bps cut is largely factored in, the market remains attuned to the Fed's comments on the health of the economy and the future trajectory of rate cuts,\" Vinod Nair, the head of research at Geojit Financial Services, observed.\"Further, robust institutional flows continued to bolster the domestic market. While the overall trend remained positive, there was notable buying interest in large-cap stocks, particularly in sectors such as IT, FMCG, and private banks,\" said Nair.Read all market-related news here","cleaned_content":"stocks at \u003cFIVE_TEN\u003e week high almost \u003cTHREE_HUNDRED\u003e stocks including icici bank hcl tech bharti airtel and tech mahindra hit fresh \u003cFIVE_TEN\u003e week highs in intraday trade on the bse on tuesday september \u003cONE_TEN\u003e even as indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e closed with gains for the second consecutive session bajaj auto hero motocorp apollo hospitals britannia industries dabur marico cipla divis labs ltimindtree persistent systems naukri shriram finance trent and united spirits were also among the stocks that rose to their one year highs the domestic market advanced buoyed by positive global cues ahead of the us fed policy decision on wednesday however gains were limited as widespread expectations point to a \u003cTWO_TEN\u003e bps rate cut by the fed in line with market forecasts a \u003cTWO_TEN\u003e bps rate cut may not impact the market positively as it is almost discounted however there are speculations that the us central bank may go for an aggressive rate cut futures markets are fully pricing in a quarter point cut and now imply almost a \u003cSEVEN_TEN_PERCENT\u003e chance that the fed could ease rates by half a percentage point on wednesday up from around a \u003cONE_TEN_PERCENT\u003e chance last week after a slew of media reports revived the prospect of more aggressive easing reported reuters benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e extended gains into the second consecutive session while the mid and smallcap segments on the bse ended in the red the sensex closed \u003cNINE_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e up \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e on the other hand the bse midcap index slipped \u003cZERO_PERCENT\u003e and the smallcap index declined \u003cZERO_PERCENT\u003e the total market capitalisation of bse listed firms declined slightly to nearly \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session shares of bharti airtel ntpc and mahindra and mahindra closed as the top gainers in the sensex index while those of tata motors adani ports and jsw steel closed as the top losers in the index the indian market exhibited a subtle positive momentum driven by the anticipation of a rate cut cycle by the us fed although a \u003cTWO_TEN\u003e bps cut is largely factored in the market remains attuned to the feds comments on the health of the economy and the future trajectory of rate cuts vinod nair the head of research at geojit financial services observed further robust institutional flows continued to bolster the domestic market while the overall trend remained positive there was notable buying interest in large cap stocks particularly in sectors such as it fmcg and private banks said nair read all market related news here","timestamp":"2024-09-17T16:09:00+05:30","market_timestamp":"2024-09-18T09:15:00+05:30","off_market_hours":true}