{"url":"https://www.livemint.com/market/stock-market-news/hcl-tech-shares-fall-after-kotak-downgrades-stock-to-reduce-11726741706085.html","title":"HCL Tech shares fall after Kotak downgrades stock to ‘reduce’","description":"Shares of HCL Tech closed in red on Thursday's trading session. The stock ended the day 0.83 per cent down at  ₹1,741.85, on September.","content":"As HCL Technologies' stock surged by 22 percent over the past three months, Kotak Institutional Equities downgraded the IT company from an 'add' to a 'reduce' rating.HCL Tech’s share price has increased by 5 percent in the last month, 22 percent over three months, and 35 percent in the past year. The company is now trading at a 9 percent and 4 percent discount to TCS and Infosys, respectively—considerably narrower than its five-year historical average. The stock is currently valued at 26 times its estimated FY2026 earnings, reflecting full valuations.The shares of HCL Tech closed in red on Thursday's trading session. The stock ended the day 0.83 per cent down at  ₹1,741.85, on September.The stock has risen by 5%, 22%, and 35% over the past one, three, and twelve months, respectively, and is now trading at a 9% and 4% discount to TCS and Infosys. This discount is notably smaller compared to the five-year historical average.\"We believe that HCLTech can deliver consistent industry-matching or industry-leading growth, led by a balanced portfolio of services and strength in cost takeout deals. However, the stock trades at full valuations at 26X FY2026E earnings,\" the brokerage firm said in a note.Kotak noted that there are challenges ahead, including the anniversary of the Verizon deal and relatively modest deal wins in recent quarters, which contribute to limited visibility for growth in FY2026E.The total contract value of deal wins has been moderate since the Verizon deal, and the outlook for mega deal-driven revenue in FY2026E remains uncertain, depending on wins in the second half of FY2025 (assuming no wins in 2QFY25). As a result, while HCL Tech stands to benefit from an industry recovery in FY2026E, its growth may be slightly lower compared to peers like Infosys.\"The portfolio mix may limit the extent of recovery relative to peers due to lesser exposure to BFS, especially in the US, where growth recovery is stronger, higher exposure to retail, CPG and manufacturing, where there are incremental headwinds and an underperforming ERD","cleaned_content":"as hcl technologies stock surged by \u003cTWO_TEN_PERCENT\u003e over the past three months kotak institutional equities downgraded the it company from an add to a reduce rating hcl tech s share price has increased by \u003cFIVE_PERCENT\u003e in the last month \u003cTWO_TEN_PERCENT\u003e over three months and \u003cTHREE_TEN_PERCENT\u003e in the past year the company is now trading at a \u003cNINE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e discount to tcs and infosys respectively considerably narrower than its five year historical average the stock is currently valued at \u003cTWO_TEN\u003e times its estimated fy2026 earnings reflecting full valuations the shares of hcl tech closed in red on thursdays trading session the stock ended the day \u003cZERO_PERCENT\u003e down at \u003cONE_THOUSAND\u003e on september the stock has risen by \u003cFIVE_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e over the past one three and twelve months respectively and is now trading at a \u003cNINE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e discount to tcs and infosys this discount is notably smaller compared to the five year historical average we believe that hcltech can deliver consistent industry matching or industry leading growth led by a balanced portfolio of services and strength in cost takeout deals however the stock trades at full valuations at \u003cTWO_TEN\u003e x fy2026e earnings the brokerage firm said in a note kotak noted that there are challenges ahead including the anniversary of the verizon deal and relatively modest deal wins in recent quarters which contribute to limited visibility for growth in fy2026e the total contract value of deal wins has been moderate since the verizon deal and the outlook for mega deal driven revenue in fy2026e remains uncertain depending on wins in the second half of fy2025 assuming no wins in \u003cTWO_\u003e qfy25 as a result while hcl tech stands to benefit from an industry recovery in fy2026e its growth may be slightly lower compared to peers like infosys the portfolio mix may limit the extent of recovery relative to peers due to lesser exposure to bfs especially in the us where growth recovery is stronger higher exposure to retail cpg and manufacturing where there are incremental headwinds and an underperforming erd","timestamp":"2024-09-19T16:33:00+05:30","market_timestamp":"2024-09-20T09:15:00+05:30","off_market_hours":true}