{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-13-11726191494661.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 13","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,390 level, a premium of nearly 56 points from the Nifty futures’ previous close.","content":"Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Friday amid positive global market cues.The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 25,390 level, a premium of nearly 56 points from the Nifty futures’ previous close.On Thursday, the domestic equity market ended sharply higher, with both the benchmark indices, Sensex and Nifty 50, hitting fresh record highs.The Sensex surged 1,439.55 points, or 1.77%, to close at 82,962.71, while the Nifty 50 settled 470.45 points, or 1.89%, higher at 25,388.90.Nifty 50 formed a long bull candle on the daily chart which has broken above the crucial hurdle and also the range movement around 25,200 levels.“Technically, this pattern signals a decisive upside breakout of the important resistance zone at 25,360 (1.382% Fibonacci extension). This is a positive indication. The sharp upside breakout of Thursday is indicating more upmove for the market ahead,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to him, the next upside levels to be watched are around 25,800 (1.5% Fibonacci extension) by next week.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 witnessed a decisive upside breakout of the hurdle on September 12 and closed the day with hefty gains of 470 points.“Nifty 50 has broken out of its recent consolidation on the daily chart, indicating a rise in optimism. Additionally, the index has been sustaining above the critical 21-day EMA (Exponential Moving Average), a near-term moving average. The RSI on the daily chart shows a bullish crossover, reinforcing the positive sentiment. The trend is expected to remain strong, as the index closed above the recent consolidation high,” said Rupak De, Senior Technical Analyst, LKP Securities.On the upside, he believes the rally could potentially continue toward the 25,470 – 25,500 range, while support is seen at 25,100.According to Aditya Agarwal, Head of Derivatives and Technical at Sanctum Wealth, Nifty 50 finally gave a breakout and saw fresh Open Interest (OI) buildup on the long side that helped index to breach its previous all time high and close at new highs.“Short term view for index remains bullish and dip towards 25,300 - 25,180 will be used by traders to initiate fresh longs. On the higher side, immediate resistance will be around 25,500 (maximum Call writing in weekly expiry) and from those levels minor profit booking can be seen. However, as the overall view remains bullish dips can be used to add long positions,” Agarwal said.Amid the ongoing market situation, VLA Ambala, Co-Founder of Stock Market Today suggested that the Nifty 50 index could expect support levels around 25,260 and 25,180, whereas resistance could be between 25,480 and 25,550 in today’s session.Bank Nifty index surged 762.40 points, or 1.49%, to close at 51,772.40 on Thursday, witnessing a decisive breakout above its key resistance zone of 51,500 - 51,700.“Bank Nifty found support around its 13 DEMA and saw pullback from those levels and managed to close above its 50 DMA. Short to medium term perspective in Bank Nifty remains strong and on the higher side it can move towards 52,140 / 52,450 levels. On the lower side, it will find support around 51,400 / 51,220 levels,” Agarwal said.Dhupesh Dhameja, Derivatives Analyst, SAMCO Securities notes that significant open interest is concentrated at the 52,000 Call (16.55 lakh contracts) and 51,000 Put (18.90 lakh contracts), reflecting a bullish outlook as call writers shifted their positions higher.“Active trading is focused around the 51,800 - 51,900 Calls and 51,500 - 51,600 Puts. The Put-Call Ratio (PCR) surged from 0.84 to 1.23, signalling strong bullish sentiment with put writers gaining control. The Max Pain point remains at 53,000, a critical level for potential market shifts,” Dhameja said.According to him, Bank Nifty outlook has turned bullish after the index broke through its major resistance at 51,300 - 51,500.“With the index trading firmly above its 10-20 DEMA, immediate support is seen at 51,400, where aggressive put writing is concentrated. On the upside, 52,000 is now a crucial resistance level. The index remains favourable for a buy-on-dips strategy.” he added.","cleaned_content":"indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on friday amid positive global market cues the trends on gift nifty also indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cFIVE_TEN\u003e points from the nifty futures previous close on thursday the domestic equity market ended sharply higher with both the benchmark indices sensex and nifty \u003cFIVE_TEN\u003e hitting fresh record highs the sensex surged \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cFOUR_HUNDRED\u003e points or \u003cONE_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a long bull candle on the daily chart which has broken above the crucial hurdle and also the range movement around \u003cTWO_TEN_THOUSAND\u003e levels technically this pattern signals a decisive upside breakout of the important resistance zone at \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension this is a positive indication the sharp upside breakout of thursday is indicating more upmove for the market ahead said nagaraj shetti senior technical research analyst at hdfc securities according to him the next upside levels to be watched are around \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension by next week here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e witnessed a decisive upside breakout of the hurdle on september \u003cONE_TEN\u003e and closed the day with hefty gains of \u003cFOUR_HUNDRED\u003e points nifty \u003cFIVE_TEN\u003e has broken out of its recent consolidation on the daily chart indicating a rise in optimism additionally the index has been sustaining above the critical \u003cTWO_TEN\u003e day ema exponential moving average a near term moving average the rsi on the daily chart shows a bullish crossover reinforcing the positive sentiment the trend is expected to remain strong as the index closed above the recent consolidation high said rupak de senior technical analyst lkp securities on the upside he believes the rally could potentially continue toward the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range while support is seen at \u003cTWO_TEN_THOUSAND\u003e according to aditya agarwal head of derivatives and technical at sanctum wealth nifty \u003cFIVE_TEN\u003e finally gave a breakout and saw fresh open interest oi buildup on the long side that helped index to breach its previous all time high and close at new highs short term view for index remains bullish and dip towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e will be used by traders to initiate fresh longs on the higher side immediate resistance will be around \u003cTWO_TEN_THOUSAND\u003e maximum call writing in weekly expiry and from those levels minor profit booking can be seen however as the overall view remains bullish dips can be used to add long positions agarwal said amid the ongoing market situation vla ambala co founder of stock market today suggested that the nifty \u003cFIVE_TEN\u003e index could expect support levels around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e whereas resistance could be between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in today s session bank nifty index surged \u003cSEVEN_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on thursday witnessing a decisive breakout above its key resistance zone of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e bank nifty found support around its \u003cONE_TEN\u003e dema and saw pullback from those levels and managed to close above its \u003cFIVE_TEN\u003e dma short to medium term perspective in bank nifty remains strong and on the higher side it can move towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels on the lower side it will find support around \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e levels agarwal said dhupesh dhameja derivatives analyst samco securities notes that significant open interest is concentrated at the \u003cFIVE_TEN_THOUSAND\u003e call \u003cONE_TEN\u003e lakh contracts and \u003cFIVE_TEN_THOUSAND\u003e put \u003cONE_TEN\u003e lakh contracts reflecting a bullish outlook as call writers shifted their positions higher active trading is focused around the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e calls and \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e puts the put call ratio pcr surged from \u003cZERO_\u003e to \u003cONE_\u003e signalling strong bullish sentiment with put writers gaining control the max pain point remains at \u003cFIVE_TEN_THOUSAND\u003e a critical level for potential market shifts dhameja said according to him bank nifty outlook has turned bullish after the index broke through its major resistance at \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e with the index trading firmly above its \u003cONE_TEN\u003e \u003cTWO_TEN\u003e dema immediate support is seen at \u003cFIVE_TEN_THOUSAND\u003e where aggressive put writing is concentrated on the upside \u003cFIVE_TEN_THOUSAND\u003e is now a crucial resistance level the index remains favourable for a buy on dips strategy he added","timestamp":"2024-09-13T07:22:00+05:30","market_timestamp":"2024-09-13T09:15:00+05:30","off_market_hours":true}