{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-mos-utility-share-price-hits-new-high-after-this-acquisition-update-details-here-11726215717158.html","title":"Small-cap stock MOS Utility’s share price hits new high after this acquisition update. Details here","description":"Stock Market Today: MOS Utility's share price hits new highs after it announces its plan to acquire a 51 per cent stake in Samvriddhi Inclusive Growth Network. MOS Utility share has given multibagger returns to investors, having risen more than three-fold in the last one year. Here are the details.","content":"Stock Market Today: MOS Utility Ltd's share price hit a new high after it announced its plan to acquire a 51 per cent stake in Samvriddhi Inclusive Growth Network Pvt Ltd.MOS Utility's share price opened at  ₹320 on the NSE on Friday, higher than the previous close of  ₹314.85. However, it gained further. The share price hit a one-year high of  ₹332.90 during intraday trades, which also remains a new high.MOS Utility share has given multibagger returns to investors, having risen more than threefold from  ₹97 to  ₹320 during the last one year.MOS Utility Limited, which offers consumers and enterprises a range of fintech and utility payment solutions services, has announced that it has entered into a share subscription or share purchase agreement to acquire 51 per cent equity shares of Samvriddhi Inclusive Growth Network Private Limited. The latter is engaged in the business of providing financial services on a pan-India basis through its network of agents.The company expects to complete the acquisition by September 2024.According to recent bulk deal data available on the NSE, on September 5, 2024, Minerva Ventures Fund and Saint Capital Fund acquired a stake in MOS Utility at an average price of  ₹285.94 and  ₹285, respectively.MOS Utility has added certain new business activities related to manufacturing, assembling, purchasing, importing, exporting, and dealing in India or abroad in all types of solar PV modules, cells, batteries, and energy storage devices. It also has conversion and generation devices, appliances, gadgets, equipment, and products including power packs, generators, and solar panels.","cleaned_content":"stock market today mos utility ltds share price hit a new high after it announced its plan to acquire a \u003cFIVE_TEN_PERCENT\u003e stake in samvriddhi inclusive growth network pvt ltd mos utilitys share price opened at \u003cTHREE_HUNDRED\u003e on the nse on friday higher than the previous close of \u003cTHREE_HUNDRED\u003e however it gained further the share price hit a one year high of \u003cTHREE_HUNDRED\u003e during intraday trades which also remains a new high mos utility share has given multibagger returns to investors having risen more than threefold from \u003cNINE_TEN\u003e to \u003cTHREE_HUNDRED\u003e during the last one year mos utility limited which offers consumers and enterprises a range of fintech and utility payment solutions services has announced that it has entered into a share subscription or share purchase agreement to acquire \u003cFIVE_TEN_PERCENT\u003e equity shares of samvriddhi inclusive growth network private limited the latter is engaged in the business of providing financial services on a pan india basis through its network of agents the company expects to complete the acquisition by september \u003cTWO_THOUSAND\u003e according to recent bulk deal data available on the nse on september \u003cFIVE_\u003e \u003cTWO_THOUSAND\u003e minerva ventures fund and saint capital fund acquired a stake in mos utility at an average price of \u003cTWO_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e respectively mos utility has added certain new business activities related to manufacturing assembling purchasing importing exporting and dealing in india or abroad in all types of solar pv modules cells batteries and energy storage devices it also has conversion and generation devices appliances gadgets equipment and products including power packs generators and solar panels","timestamp":"2024-09-13T14:05:00+05:30","market_timestamp":"2024-09-13T14:05:00+05:30","off_market_hours":false}