{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-us-fed-rate-cut-buzz-five-stocks-to-buy-or-sell-on-thursday-sept-19-11726648653374.html","title":"Stock market today: Trade setup for Nifty 50 to US Fed rate cut, five stocks to buy or sell on Thursday — Sept 19","description":"Stock Market Today: The Benchmark Indices on Wednesday after scaling new highs, however corrected to end with 0.16% decline ahead of FOMC meeting outcome. Analysts say markets will react on Thursday to the quantum of rate cuts as will take cues from the Fed commentary on further rate cuts.","content":"Stock Market Today: The nervousness in the market ahead of the Federal Open Market Committee (FOMC) meeting outcome was evident in the Indian stock market during trading session on Wednesday. The Benchmark Nifty 50 index and the S\u0026P BSE Sensex ended 0.16 % lower at 25,377.55 and 82,948.23 on Wednesday amidst profit booking after scaling all time highs during the day.The Nifty Bank Index after consolidating for a day however ended 1.08% higher at 52,750.40 on expectations of rate cut by the US federal Reserve. Nifty Financial Services was also a key gainer (up 1.4%) supporting the markets on day when most other sectoral indices ended lower. Broader markets remained under pressure and Nifty Midcap 100 and Small cap 100 indices underperformed the Nifty where they fell by 0.8% each.“The Nifty index reached a new all-time high ahead of the important announcement from the Federal Reserve about interest rates. However, some traders decided to take profits at these higher levels, which caused the market to close about 130 points below its peak for the day” said Rupak De, Senior Technical Analyst, LKP Securities.Lately, Nifty has been moving within a small range. On the downside, there is support at 25,300. If Nifty falls below this level, it could lead to a further drop towards the 24,900-25,000 range. On the upside, 25,500 is acting as a resistance level, meaning it may be difficult for the market to move above this point in the short term, added De.Bank Nifty started the day on a flat note but subsequently witnessed strong buying interest, which helped it achieve its short-term targets of 52,800-53,000 (with a high of 52,954). Technically, the index formed a strong bullish candle on a daily scale, indicating strength. However, it will encounter short-term resistance near 53,000 and if Bank Nifty sustains above this level, the rally could extend toward 53,500-53,800, said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates Ltd.Assessing the impact of the 50 bps US Fed rate cut, Shashank Pal, Chief Business Officer at PL Wealth Management, said, \"This rate cut by the Fed will bring down the borrowing costs of US companies and also push central banks across the world to relook at their own monetary policy this week. The 50 bps US Fed rate cut may cause a short-term spurt in our domestic stock prices, only to realign after possibly four to six weeks.”Sumeet Bagadia, Executive Director at Choice Broking and Ganesh Dongre, Senior Manager of technical Research at Anand Rathi have recommended five stock picks for Thursday. These include Nava Ltd, Bajaj Finance, Vedanta Ltd, Federal Bank, Intellect Design Arena Ltd.1.Nava Ltd- Sumeet Bagadia Executive Director at Choice Broking recommends buying Nava Ltd in cash at  ₹1316.2 keeping Stop Loss at  ₹1270 for a target price of Rs1390NAVA daily chart analysis offers a favorable view for the following week, indicating a steady higher advance, said Bagadia. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.2. Bajaj Finance - Sumeet Bagadia recommends buying Bajaj Finance at  ₹7631.10 keeping a stoploss at  ₹7385 with a target price of  ₹8185Baja Finance is currently trading around 7631.10 and has recently broken out of a falling trend line and consolidation. The stock has also retested the consolidation breakout and has bounced from the levels of 7385 levels. This movement typically signals a potential continuation of bullish momentum. The stock has a key resistance in a zone between 7700-7800. A successful breakout above this range could pave the way for a short-term target of 8185.3. Vedanta Ltd - Ganesh Dongre recommends buying Vedanta at  ₹448 with a Stoploss at  ₹435 for a target price of  ₹465The stock found a substantial support level at Rs.435, marking a crucial juncture in its recent trading. Dongre. Presently, at Rs. 448, the stock has demonstrated a definitive reversal in price action, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at Rs.435. The anticipated target for this trade is Rs.465, representing the next significant resistance level. This strategy positions traders favorably to capitalize on the stock's anticipated rally in the weeks ahead..4- Federal Bank - Ganesh Dongre recommends buying Federal Bank at  ₹186 with a stop loss at  ₹180 and target price of  ₹195In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 195. At present, the stock is maintaining a crucial support level at Rs.160. Given the current market price of Rs.186, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 1955.Intellect Design Arena Ltd- Ganesh Dongre recommends buying Intellect at  ₹986 with at Stoploss at  ₹970 for a target price of  ₹1025On the daily chart of this stock, a breakout at the Rs.986 price level has been observed, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 970 is recommended. The target price for this strategy is Rs. 1025 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory, said Dongre.","cleaned_content":"stock market today the nervousness in the market ahead of the federal open market committee fomc meeting outcome was evident in the indian stock market during trading session on wednesday the benchmark nifty \u003cFIVE_TEN\u003e index and the s p bse sensex ended \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e on wednesday amidst profit booking after scaling all time highs during the day the nifty bank index after consolidating for a day however ended \u003cONE_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e on expectations of rate cut by the us federal reserve nifty financial services was also a key gainer up \u003cONE_PERCENT\u003e supporting the markets on day when most other sectoral indices ended lower broader markets remained under pressure and nifty midcap \u003cONE_HUNDRED\u003e and small cap \u003cONE_HUNDRED\u003e indices underperformed the nifty where they fell by \u003cZERO_PERCENT\u003e each the nifty index reached a new all time high ahead of the important announcement from the federal reserve about interest rates however some traders decided to take profits at these higher levels which caused the market to close about \u003cONE_HUNDRED\u003e points below its peak for the day said rupak de senior technical analyst lkp securities lately nifty has been moving within a small range on the downside there is support at \u003cTWO_TEN_THOUSAND\u003e if nifty falls below this level it could lead to a further drop towards the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e range on the upside \u003cTWO_TEN_THOUSAND\u003e is acting as a resistance level meaning it may be difficult for the market to move above this point in the short term added de bank nifty started the day on a flat note but subsequently witnessed strong buying interest which helped it achieve its short term targets of \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e with a high of \u003cFIVE_TEN_THOUSAND\u003e technically the index formed a strong bullish candle on a daily scale indicating strength however it will encounter short term resistance near \u003cFIVE_TEN_THOUSAND\u003e and if bank nifty sustains above this level the rally could extend toward \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e said hrishikesh yedve avp technical and derivatives research at asit c mehta investment interrmediates ltd assessing the impact of the \u003cFIVE_TEN\u003e bps us fed rate cut shashank pal chief business officer at pl wealth management said this rate cut by the fed will bring down the borrowing costs of us companies and also push central banks across the world to relook at their own monetary policy this week the \u003cFIVE_TEN\u003e bps us fed rate cut may cause a short term spurt in our domestic stock prices only to realign after possibly four to six weeks sumeet bagadia executive director at choice broking and ganesh dongre senior manager of technical research at anand rathi have recommended five stock picks for thursday these include nava ltd bajaj finance vedanta ltd federal bank intellect design arena ltd 1 nava ltd sumeet bagadia executive director at choice broking recommends buying nava ltd in cash at \u003cONE_THOUSAND\u003e keeping stop loss at \u003cONE_THOUSAND\u003e for a target price of rs1390nava daily chart analysis offers a favorable view for the following week indicating a steady higher advance said bagadia notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 2 bajaj finance sumeet bagadia recommends buying bajaj finance at \u003cSEVEN_THOUSAND\u003e keeping a stoploss at \u003cSEVEN_THOUSAND\u003e with a target price of \u003cEIGHT_THOUSAND\u003e baja finance is currently trading around \u003cSEVEN_THOUSAND\u003e and has recently broken out of a falling trend line and consolidation the stock has also retested the consolidation breakout and has bounced from the levels of \u003cSEVEN_THOUSAND\u003e levels this movement typically signals a potential continuation of bullish momentum the stock has a key resistance in a zone between \u003cSEVEN_THOUSAND\u003e \u003cSEVEN_THOUSAND\u003e a successful breakout above this range could pave the way for a short term target of \u003cEIGHT_THOUSAND\u003e vedanta ltd ganesh dongre recommends buying vedanta at \u003cFOUR_HUNDRED\u003e with a stoploss at \u003cFOUR_HUNDRED\u003e for a target price of \u003cFOUR_HUNDRED\u003e the stock found a substantial support level at rs 435 marking a crucial juncture in its recent trading dongre presently at rs \u003cFOUR_HUNDRED\u003e the stock has demonstrated a definitive reversal in price action suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at rs 435 the anticipated target for this trade is rs 465 representing the next significant resistance level this strategy positions traders favorably to capitalize on the stocks anticipated rally in the weeks ahead 4 federal bank ganesh dongre recommends buying federal bank at \u003cONE_HUNDRED\u003e with a stop loss at \u003cONE_HUNDRED\u003e and target price of \u003cONE_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cONE_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 160 given the current market price of rs 186 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cONE_THOUSAND\u003e intellect design arena ltd ganesh dongre recommends buying intellect at \u003cNINE_HUNDRED\u003e with at stoploss at \u003cNINE_HUNDRED\u003e for a target price of \u003cONE_THOUSAND\u003e on the daily chart of this stock a breakout at the rs 986 price level has been observed signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cNINE_HUNDRED\u003e is recommended the target price for this strategy is rs \u003cONE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory said dongre","timestamp":"2024-09-19T06:30:00+05:30","market_timestamp":"2024-09-19T09:15:00+05:30","off_market_hours":true}