{"url":"https://www.livemint.com/market/stock-market-news/muted-debut-kross-shares-lists-at-rs-240-on-nse-and-bse-same-as-ipo-price-11726459173232.html","title":"Muted Debut: Kross shares lists at  ₹240 on NSE and BSE, same as IPO price","description":"Kross Limited manufactures trailer axles and safety-critical parts for M\u0026HCV. The company reported a significant profit increase in FY 2024. Its IPO, launched at  ₹228-240 per share, was heavily subscribed but listed at the IPO price of  ₹240 on the stock exchanges.","content":"Kross IPO listing: Shares of Kross made a muted debut on the bourses today. It listed at  ₹240 on NSE and BSE, same as its IPO price.The initial public offering (IPO), valued at  ₹500 crore, was open for subscription from September 9, 2024, to September 11, 2024, with a price set at  ₹228-240 per share.During the 3 days of bidding the IPO received robust subscription and was bid 17.66 times overall. The issue received bids for 25.75 crore equity shares against 1.45 crore shares on offer. The retail category saw a subscription of 11.26 times, while NII quota was subscribed 23.40 times. The QIB portion also witnessed strong 24.55 times bids.Kross IPO was a combination of fresh issue of 1.04 crore shares aggregating to  ₹250 crore and offer for sale of 1.04 crore shares aggregating to  ₹250 crore. According to DRHP, Sudhir Rai and Anita Rai are the promoters of the company.Retail investors were required to purchase a minimum lot size of 62 shares, with the smallest investment starting at  ₹14,880.The company plans to use the net proceeds for several key purposes, including funding capital expenditures for the purchase of machinery and equipment. Additionally, it intends to repay or prepay a portion or all of its outstanding borrowings from banks and financial institutions. The proceeds will also support the company’s working capital needs and be allocated towards general corporate purposes.Equirus Capital Private Limited was the book running lead manager of the Kross IPO, while Kfin Technologies Limited was the registrar for the issue.Kross Limited, previously known as Kross Manufacturers (India) Private Limited, was founded in 1991 and specializes in manufacturing and supplying trailer axles, suspensions, and high-performance forged and precision-machined safety-critical parts for medium and heavy-duty commercial vehicles (M\u0026HCV) as well as agricultural equipment. Its product range includes axle shafts, companion flanges, anti-roll bars, suspension linkages, bevel gears, planet carriers, and tractor components like PTO shafts and front axle spindles.The company serves major original equipment manufacturers (OEMs) in the M\u0026HCV and tractor segments, along with domestic dealers and trailer axle manufacturers. In fiscal year 2024, Kross Limited reported a 45.1 percent rise in net profit, reaching  ₹44.9 crore, with revenue increasing by 27 percent to  ₹620.3 crore. EBITDA surged by 40.4 percent to  ₹80.8 crore, and the margin expanded by 120 basis points to 13 percent compared to the previous year.","cleaned_content":"kross ipo listing shares of kross made a muted debut on the bourses today it listed at \u003cTWO_HUNDRED\u003e on nse and bse same as its ipo price the initial public offering ipo valued at \u003cFIVE_HUNDRED\u003e crore was open for subscription from september \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with a price set at \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e per share during the \u003cTHREE_\u003e days of bidding the ipo received robust subscription and was bid \u003cONE_TEN\u003e times overall the issue received bids for \u003cTWO_TEN\u003e crore equity shares against \u003cONE_\u003e crore shares on offer the retail category saw a subscription of \u003cONE_TEN\u003e times while nii quota was subscribed \u003cTWO_TEN\u003e times the qib portion also witnessed strong \u003cTWO_TEN\u003e times bids kross ipo was a combination of fresh issue of \u003cONE_\u003e crore shares aggregating to \u003cTWO_HUNDRED\u003e crore and offer for sale of \u003cONE_\u003e crore shares aggregating to \u003cTWO_HUNDRED\u003e crore according to drhp sudhir rai and anita rai are the promoters of the company retail investors were required to purchase a minimum lot size of \u003cSIX_TEN\u003e shares with the smallest investment starting at \u003cONE_TEN_THOUSAND\u003e the company plans to use the net proceeds for several key purposes including funding capital expenditures for the purchase of machinery and equipment additionally it intends to repay or prepay a portion or all of its outstanding borrowings from banks and financial institutions the proceeds will also support the company s working capital needs and be allocated towards general corporate purposes equirus capital private limited was the book running lead manager of the kross ipo while kfin technologies limited was the registrar for the issue kross limited previously known as kross manufacturers india private limited was founded in \u003cONE_THOUSAND\u003e and specializes in manufacturing and supplying trailer axles suspensions and high performance forged and precision machined safety critical parts for medium and heavy duty commercial vehicles m hcv as well as agricultural equipment its product range includes axle shafts companion flanges anti roll bars suspension linkages bevel gears planet carriers and tractor components like pto shafts and front axle spindles the company serves major original equipment manufacturers oems in the m hcv and tractor segments along with domestic dealers and trailer axle manufacturers in fiscal year \u003cTWO_THOUSAND\u003e kross limited reported a \u003cFOUR_TEN_PERCENT\u003e rise in net profit reaching \u003cFOUR_TEN\u003e crore with revenue increasing by \u003cTWO_TEN_PERCENT\u003e to \u003cSIX_HUNDRED\u003e crore ebitda surged by \u003cFOUR_TEN_PERCENT\u003e to \u003cEIGHT_TEN\u003e crore and the margin expanded by \u003cONE_HUNDRED\u003e basis points to \u003cONE_TEN_PERCENT\u003e compared to the previous year","timestamp":"2024-09-16T09:59:00+05:30","market_timestamp":"2024-09-16T09:59:00+05:30","off_market_hours":false}