{"url":"https://www.livemint.com/market/stock-market-news/voltas-stock-climbs-nearly-100-in-cy24-to-record-best-annual-performance-in-6-years-11726810466562.html","title":"Voltas stock climbs nearly 100% in CY24, records best annual performance in 6 years","description":"Voltas has shown remarkable growth, with stock prices climbing 97 percent this year, hitting an all-time high of  ₹1,944.90. The company sold over 2 million AC units in 2023-24, maintaining a leading market share of 21.2 percent in India’s cooling products segment.","content":"Tata Group stocks have performed exceptionally well this year, building on the momentum from last year’s strong rally. Many of the group's stocks have reached new record highs, crossed key milestones, and delivered some of their best annual returns in recent history.Voltas has been a standout among Tata Group companies, delivering substantial returns to its shareholders. The company's shares have surged 97 percent in 2024, climbing from  ₹979 apiece to the current trading price of  ₹1,929. This marks the stock's best yearly performance in the last six years.During today's trading session, Voltas hit an all-time high of  ₹1,944.90, edging closer to the  ₹2,000 mark. The company's market capitalisation stands at  ₹64,000 crore. Impressively, the stock finished seven out of the last nine months in positive territory, with April seeing the highest monthly gain of 34 percent, followed by a 13.40 percent gain in August.After consecutive summers disrupted by the pandemic and unseasonal rains, the cooling products segment rebounded in recent quarters, gaining momentum in the first quarter of the current fiscal year. Voltas capitalised on this resurgence, bolstered by its resilient supply chains.In a record-breaking achievement, Voltas sold over 2 million air conditioning (AC) units in 2023-24, the highest ever by any brand in a single year in India. This milestone was driven by the company’s expanded product range, featuring enhanced attributes and stronger engagement with key regional retailers and modern trade partners.Voltas' strong brand positioning, extensive distribution network, and efficient supply chain management helped the company maintain its market leadership throughout the year. The company led the market in both split and window air conditioners, achieving a year-to-date exit market share of 21.2 percent as of June 2024 (primary market share), securing its position as the top player.Notably, Voltas held an 800-basis point lead over the second-ranked competitor. In Q1, it increased its market share by 50 basis points to 19.5 percent, maintaining a 450-basis point lead over its nearest competitor. The company remains focused on retaining its leadership position in the highly competitive RAC (room air conditioner) market.In April, global brokerage firm UBS projected that Voltas' market share in the room air conditioner (RAC) segment would rise to 23 percent by FY26. UBS highlighted that the company has restructured its supply chain to lower costs in this segment, positioning it for continued growth.Voltas is committed to retaining its numero uno market position through strategic investments in capacity expansion, product innovation, and operational efficiency. The company has allocated  ₹8 billion to  ₹10 billion for this purpose, with  ₹5 billion already invested in the newly commissioned Chennai plant in August 2024 and  ₹3 billion earmarked for expanding the Waghodia plant.While the domestic market remains Voltas' primary focus, the company is cautiously exploring export opportunities, though it does not view them as a major strategic priority at this time.","cleaned_content":"tata group stocks have performed exceptionally well this year building on the momentum from last year s strong rally many of the groups stocks have reached new record highs crossed key milestones and delivered some of their best annual returns in recent history voltas has been a standout among tata group companies delivering substantial returns to its shareholders the companys shares have surged \u003cNINE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e climbing from \u003cNINE_HUNDRED\u003e apiece to the current trading price of \u003cONE_THOUSAND\u003e this marks the stocks best yearly performance in the last six years during todays trading session voltas hit an all time high of \u003cONE_THOUSAND\u003e edging closer to the \u003cTWO_THOUSAND\u003e mark the companys market capitalisation stands at \u003cSIX_TEN_THOUSAND\u003e crore impressively the stock finished seven out of the last nine months in positive territory with april seeing the highest monthly gain of \u003cTHREE_TEN_PERCENT\u003e followed by a \u003cONE_TEN_PERCENT\u003e gain in august after consecutive summers disrupted by the pandemic and unseasonal rains the cooling products segment rebounded in recent quarters gaining momentum in the first quarter of the current fiscal year voltas capitalised on this resurgence bolstered by its resilient supply chains in a record breaking achievement voltas sold over \u003cTWO_\u003e million air conditioning ac units in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the highest ever by any brand in a single year in india this milestone was driven by the company s expanded product range featuring enhanced attributes and stronger engagement with key regional retailers and modern trade partners voltas strong brand positioning extensive distribution network and efficient supply chain management helped the company maintain its market leadership throughout the year the company led the market in both split and window air conditioners achieving a year to date exit market share of \u003cTWO_TEN_PERCENT\u003e as of june \u003cTWO_THOUSAND\u003e primary market share securing its position as the top player notably voltas held an \u003cEIGHT_HUNDRED\u003e basis point lead over the second ranked competitor in q1 it increased its market share by \u003cFIVE_TEN\u003e basis points to \u003cONE_TEN_PERCENT\u003e maintaining a \u003cFOUR_HUNDRED\u003e basis point lead over its nearest competitor the company remains focused on retaining its leadership position in the highly competitive rac room air conditioner market in april global brokerage firm ubs projected that voltas market share in the room air conditioner rac segment would rise to \u003cTWO_TEN_PERCENT\u003e by fy26 ubs highlighted that the company has restructured its supply chain to lower costs in this segment positioning it for continued growth voltas is committed to retaining its numero uno market position through strategic investments in capacity expansion product innovation and operational efficiency the company has allocated \u003cEIGHT_\u003e billion to \u003cONE_TEN\u003e billion for this purpose with \u003cFIVE_\u003e billion already invested in the newly commissioned chennai plant in august \u003cTWO_THOUSAND\u003e and \u003cTHREE_\u003e billion earmarked for expanding the waghodia plant while the domestic market remains voltas primary focus the company is cautiously exploring export opportunities though it does not view them as a major strategic priority at this time","timestamp":"2024-09-20T11:26:00+05:30","market_timestamp":"2024-09-20T11:26:00+05:30","off_market_hours":false}