{"url":"https://www.livemint.com/market/stock-market-news/inox-wind-stock-check-up-over-394-in-1-year-should-you-still-buy-it-technical-and-fundamental-experts-answer-11726121956167.html","title":"Inox Wind Stock Check: Up over 394% in 1 year, should you still buy it? Technical and fundamental experts answer","description":"Inox Wind Limited has experienced a remarkable rally, rising over 394 per cent in the past year and 91 per cent in 2024. Analysts predict continued upward momentum, with target prices between  ₹270-315, driven by strong earnings and bullish technical indicators.","content":"Inox Wind (INOXWIND) has recently captured significant attention in the stock market, with technical analysts forecasting a promising trajectory.The Renewable energy stock has witnessed a remarkable multi-bagger rally, with the stock climbing over 394 per cent last year. So far in 2024, the stock has risen by 91 per cent, giving positive returns in five out of the nine months.In September, the stock added over 12 per cent, extending its gains for the third consecutive month. It rose by 20.4 per cent in August, following a 29.4 per cent gain in July. Meanwhile, it witnessed some correction before that, down 3.5 per cent in June and a 6.3 per cent dip in May.From January to April, the stock remained volatile, with a 20.3 per cent gain in April, a 13.5 per cent fall in March, a 26.11 per cent rise in February, and a 4.3 per cent decline in January.The stock hit a record high of  ₹250.45 in intra-day deals yesterday, September 11. It has soared almost 407 per cent from its 52-week low of  ₹47.06, hit in September last year.With such a substantial rally behind it, the key question for investors is whether this upward momentum will continue. Here's what the experts say about the stock's technical and fundamental outlook.Inox Wind Limited (IWL) reported a profit after tax of  ₹50 crore for the June quarter, reversing a loss of  ₹65 crore from last year. This turnaround was driven by an 85 per cent surge in revenue, which rose to  ₹651 crore from  ₹352 crore. The company's EBITDA more than quadrupled to  ₹136.1 crore, compared to  ₹31.3 crore a year ago. The EBITDA margin also improved significantly, expanding to 21.3 per cent from 9 per cent, attributed to a better sales mix. For the fiscal year, margins are expected to remain in the 15-16 per cent range, with the potential for a slight improvement.Inox Wind (INOXWIND) has recently broken out of a trendline connected to higher tops, indicating a potential shift in momentum. Following a period of consolidation, the stock has regained momentum with a sharp increase in volume. Immediate support is seen at the 20-day moving average (DMA), while the daily Relative Strength Index (RSI) remains comfortably above the 70 zone, reflecting strong bullish momentum. The delivery percentage has also risen over the last two days, increasing investor confidence. With a solid base around the  ₹225-230 range and a robust overall setup, the stock is poised to target the  ₹270-275 range.Inox Wind has shown a strong uptrend, trading within an ascending channel on daily and weekly charts. The recent breakout and retest of a four-year rising channel suggest a potential movement towards the  ₹275-280 levels. The stock is also on the verge of a breakout from a bullish pennant pattern on daily charts, supporting the  ₹275-280 price target. A rise above an RSI of 78 on daily charts could further boost stock prices. Existing investors are advised to hold, while new investors are encouraged to buy at current levels for a potential 15 per cent upside.The stock has recently broken above the consolidation range of  ₹235-210, signalling the continuation of the previous uptrend. It remains well above its 20, 50, 100, and 200-day simple moving averages (SMA), confirming a bullish trend across all time frames. This breakout is supported by significant trading volumes, indicating increased market participation. The Bollinger Bands on the daily chart suggest heightened momentum and daily and weekly RSI indicators are in positive territory, reflecting growing strength. Traders and investors are advised to hold, buy, and accumulate the stock, with an expected upside of  ₹285-315. Short-term support levels are around  ₹233-213.Brokerage house Axis Securities has retained its buy call on the stock and raised its target price to  ₹270 (from  ₹205 earlier), implying an upside potential of over 13 per cent.In a recent report, the brokerage pointed out that Inox Wind's EPC projects arm, Resco Global, approved a  ₹350 crore equity raise from marquee investors to capitalize on strong tailwinds in India's wind sector. This fundraiser is expected to result in a 7-8 p stake dilution and value Resco at approximately  ₹5,000 crore. Additionally, the substation assets under Inox Green Energy will be demerged and merged into Resco, unlocking further value. Resco will use these assets to evacuate wind and solar power, enhancing asset utilization and revenue generation. The hybridization of substation assets is projected to boost Inox Wind’s PAT by  ₹75-100 crore annually, with an additional  ₹50-60 crore from crane services, increasing total EBITDA by  ₹150-175 crore by FY26.Inox Wind expects higher order execution starting FY25, with guidance of 800 MW and 1,200 MW for FY25 and FY26, respectively. Axis Securities revised its FY27 execution estimate to 1,750 MW, citing tailwinds in the wind energy sector, and maintained a capex guidance of  ₹50-75 crore. The company is well-positioned for growth with a strong order book, execution capability, and net interest-free debt. Axis Securities raised its FY26 revenue/EBITDA/PAT estimates by 4 per cent/9 per cent/10 per cent and for FY27 by 13 per cent/17 per cent/22 per cent.The technical analysis of Inox Wind Limited reveals a strong bullish outlook, supported by recent breakouts, increased trading volumes, and positive momentum indicators. Expert projections suggest potential price targets in the range of  ₹270-315, positioning the stock for notable gains. Investors and traders should monitor the stock closely, considering the optimistic forecasts and technical signals. As Inox Wind continues to navigate its growth trajectory, it presents a compelling opportunity for those looking to capitalize on its upward momentum.","cleaned_content":"inox wind inoxwind has recently captured significant attention in the stock market with technical analysts forecasting a promising trajectory the renewable energy stock has witnessed a remarkable multi bagger rally with the stock climbing over \u003cTHREE_HUNDRED_PERCENT\u003e last year so far in \u003cTWO_THOUSAND\u003e the stock has risen by \u003cNINE_TEN_PERCENT\u003e giving positive returns in five out of the nine months in september the stock added over \u003cONE_TEN_PERCENT\u003e extending its gains for the third consecutive month it rose by \u003cTWO_TEN_PERCENT\u003e in august following a \u003cTWO_TEN_PERCENT\u003e gain in july meanwhile it witnessed some correction before that down \u003cTHREE_PERCENT\u003e in june and a \u003cSIX_PERCENT\u003e dip in may from january to april the stock remained volatile with a \u003cTWO_TEN_PERCENT\u003e gain in april a \u003cONE_TEN_PERCENT\u003e fall in march a \u003cTWO_TEN_PERCENT\u003e rise in february and a \u003cFOUR_PERCENT\u003e decline in january the stock hit a record high of \u003cTWO_HUNDRED\u003e in intra day deals yesterday september \u003cONE_TEN\u003e it has soared almost \u003cFOUR_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cFOUR_TEN\u003e hit in september last year with such a substantial rally behind it the key question for investors is whether this upward momentum will continue heres what the experts say about the stocks technical and fundamental outlook inox wind limited iwl reported a profit after tax of \u003cFIVE_TEN\u003e crore for the june quarter reversing a loss of \u003cSIX_TEN\u003e crore from last year this turnaround was driven by an \u003cEIGHT_TEN_PERCENT\u003e surge in revenue which rose to \u003cSIX_HUNDRED\u003e crore from \u003cTHREE_HUNDRED\u003e crore the companys ebitda more than quadrupled to \u003cONE_HUNDRED\u003e crore compared to \u003cTHREE_TEN\u003e crore a year ago the ebitda margin also improved significantly expanding to \u003cTWO_TEN_PERCENT\u003e from \u003cNINE_PERCENT\u003e attributed to a better sales mix for the fiscal year margins are expected to remain in the \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e range with the potential for a slight improvement inox wind inoxwind has recently broken out of a trendline connected to higher tops indicating a potential shift in momentum following a period of consolidation the stock has regained momentum with a sharp increase in volume immediate support is seen at the \u003cTWO_TEN\u003e day moving average dma while the daily relative strength index rsi remains comfortably above the \u003cSEVEN_TEN\u003e zone reflecting strong bullish momentum the delivery percentage has also risen over the last two days increasing investor confidence with a solid base around the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e range and a robust overall setup the stock is poised to target the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e range inox wind has shown a strong uptrend trading within an ascending channel on daily and weekly charts the recent breakout and retest of a four year rising channel suggest a potential movement towards the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels the stock is also on the verge of a breakout from a bullish pennant pattern on daily charts supporting the \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e price target a rise above an rsi of \u003cSEVEN_TEN\u003e on daily charts could further boost stock prices existing investors are advised to hold while new investors are encouraged to buy at current levels for a potential \u003cONE_TEN_PERCENT\u003e upside the stock has recently broken above the consolidation range of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e signalling the continuation of the previous uptrend it remains well above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day simple moving averages sma confirming a bullish trend across all time frames this breakout is supported by significant trading volumes indicating increased market participation the bollinger bands on the daily chart suggest heightened momentum and daily and weekly rsi indicators are in positive territory reflecting growing strength traders and investors are advised to hold buy and accumulate the stock with an expected upside of \u003cTWO_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e short term support levels are around \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e brokerage house axis securities has retained its buy call on the stock and raised its target price to \u003cTWO_HUNDRED\u003e from \u003cTWO_HUNDRED\u003e earlier implying an upside potential of over \u003cONE_TEN_PERCENT\u003e in a recent report the brokerage pointed out that inox winds epc projects arm resco global approved a \u003cTHREE_HUNDRED\u003e crore equity raise from marquee investors to capitalize on strong tailwinds in indias wind sector this fundraiser is expected to result in a \u003cSEVEN_\u003e \u003cEIGHT_\u003e p stake dilution and value resco at approximately \u003cFIVE_THOUSAND\u003e crore additionally the substation assets under inox green energy will be demerged and merged into resco unlocking further value resco will use these assets to evacuate wind and solar power enhancing asset utilization and revenue generation the hybridization of substation assets is projected to boost inox wind s pat by \u003cSEVEN_TEN\u003e \u003cONE_HUNDRED\u003e crore annually with an additional \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e crore from crane services increasing total ebitda by \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e crore by fy26 inox wind expects higher order execution starting fy25 with guidance of \u003cEIGHT_HUNDRED\u003e mw and \u003cONE_THOUSAND\u003e mw for fy25 and fy26 respectively axis securities revised its fy27 execution estimate to \u003cONE_THOUSAND\u003e mw citing tailwinds in the wind energy sector and maintained a capex guidance of \u003cFIVE_TEN\u003e \u003cSEVEN_TEN\u003e crore the company is well positioned for growth with a strong order book execution capability and net interest free debt axis securities raised its fy26 revenue ebitda pat estimates by \u003cFOUR_PERCENT\u003e \u003cNINE_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and for fy27 by \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e the technical analysis of inox wind limited reveals a strong bullish outlook supported by recent breakouts increased trading volumes and positive momentum indicators expert projections suggest potential price targets in the range of \u003cTWO_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e positioning the stock for notable gains investors and traders should monitor the stock closely considering the optimistic forecasts and technical signals as inox wind continues to navigate its growth trajectory it presents a compelling opportunity for those looking to capitalize on its upward momentum","timestamp":"2024-09-14T07:56:00+05:30","market_timestamp":"2024-09-16T09:15:00+05:30","off_market_hours":true}