{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-hi-tech-pipes-posts-150-gain-in-2-years-1765-in-4-years-should-you-still-buy-11726828652692.html","title":"Multibagger Stock: Hi-Tech Pipes posts 150% gain in 2 years, 1,765% in 4 years. Should you still buy?","description":"Over the past 12 months, the stock has posted gains in 9 months, with January leading the way with a 27 per cent increase, followed closely by August at 26 per cent. Looking back over four years, the stock has soared from  ₹11 per share, delivering an astonishing return of 1,765 per cent.","content":"In the current investment landscape, there has been a noticeable shift in investor sentiment toward small-cap stocks. This change is reflected in the substantial returns generated by many stocks in this space, indicating a growing confidence among investors.Many are attracted to small-cap and penny stocks because of their lower price points, which create opportunities for rapid gains, particularly if the companies have strong fundamentals and are strategically positioned within their industries. While some small-cap stocks have delivered impressive growth and rewarded investors handsomely, others have struggled to gain traction, remaining stagnant in a competitive market.Nonetheless, small-cap stocks are generally expected to benefit from the rise in capital expenditure, as increased investment often leads to enhanced growth prospects.One noteworthy performer in this context is Hi-Tech Pipes. This small-cap stock has been generating stellar returns for its shareholders in recent years. Despite such strong performance, analysts remain optimistic about its future performance, continuing to express bullish sentiments even after the stock's impressive rally.The stock began its one-way rally in September 2022 and has maintained the same momentum to date, yielding a fabulous return of 150 per cent, climbing from  ₹82.3 apiece to the current level of 205.24 apiece.Over the past 12 months, the stock has posted gains in 9 months, with January leading the way with a 27 per cent increase, followed closely by August at 26 per cent. Looking back over four years, the stock has soared from  ₹11 per share to the current level, producing an astonishing return of 1,765 per cent to shareholders.Hi-Tech Pipes is a prominent manufacturer and supplier of electric resistance welding (ERW) pipes. It specialises in producing steel tubes and pipes for various industries, including infrastructure, telecommunications, defence, railroads, airports, real estate, and automobiles.With an installed capacity of 750,000 metric tons and six manufacturing facilities, its products are distributed across 17 states through a robust network of over 525 dealers. Currently, around 28 per cent of the company's revenue comes from value-added products (VAP).Domestic brokerage firm Midas equities and research in its latest note issued an 'accumulate' rating on the stock, setting a target price of  ₹296 per share. This target reflects a potential upside of 44 per cent from the stock's last closing price.The brokerage notes that the company stands to benefit significantly from the Indian government's infrastructure initiatives. With plans to double its capacity and increase its share of value-added products (VAP), the company is well-positioned for earnings growth.According to the brokerage, the country's steel production capacity is projected to rise from 122 MT in FY22 to 193 MT by FY30, representing a CAGR of 5.9 per cent. Among the key consumers of steel, it expects structural steel tubes to grow at a CAGR of 9.8 per cent, increasing from 9 MT in FY23 to 17.3 MT by FY30.This demand, as per the brokerage, will primarily stem from infrastructure development across various key sectors. It says the company is already involved in significant projects, including the Noida International Airport, Kangra Airport in Himachal Pradesh, Khavda Solar Park (the world's largest solar park), and various metro and borewell projects in Agra, Gandhinagar, Maharashtra, and Karnataka.Therefore, it expects the company to touch 1 MT capacity by the end of FY25 from 0.75 MT as of FY24. On the back of strong demand expected from end-use sectors, Hi-Tech aspires to double its capacity to 2 MT in the next 4-5 years. Hi-Tech already has products approved for key sectors and is well-poised to expand market share in the high-growth end-use sectors.As Hi-Tech advances up the value chain by offering value-added products such as GP Pipes and GI Pipes, the brokerage expects the share of VAP in total revenue to rise from 28 per cent in FY24 to between 45 per cent and 50 per cent by FY28.The brokerage anticipates that the growth in the share of VAP, along with expected operational leverage, will significantly enhance Hi-Tech's profitability in the future.It expects Hi-Tech to clock a revenue CAGR of 27.9 per cent over FY24-28E on the back of strong growth in end-use sectors and a volume growth of 27.3 per cent. It projects that Hi-Tech will achieve an EBITDA per ton of  ₹4,318 by FY28E, reflecting a CAGR of 10.1 per cent. This growth is anticipated as the share of Value-Added Products (VAP) increases to 45-50 per cent.Further, it projects Hi-Tech to report EBITDA of  ₹443 crore by FY28E and expects EPS to grow at 45.1 per cent CAGR over FY24-28E to  ₹13.0 in FY28E from  ₹2.9 in FY24.","cleaned_content":"in the current investment landscape there has been a noticeable shift in investor sentiment toward small cap stocks this change is reflected in the substantial returns generated by many stocks in this space indicating a growing confidence among investors many are attracted to small cap and penny stocks because of their lower price points which create opportunities for rapid gains particularly if the companies have strong fundamentals and are strategically positioned within their industries while some small cap stocks have delivered impressive growth and rewarded investors handsomely others have struggled to gain traction remaining stagnant in a competitive market nonetheless small cap stocks are generally expected to benefit from the rise in capital expenditure as increased investment often leads to enhanced growth prospects one noteworthy performer in this context is hi tech pipes this small cap stock has been generating stellar returns for its shareholders in recent years despite such strong performance analysts remain optimistic about its future performance continuing to express bullish sentiments even after the stocks impressive rally the stock began its one way rally in september \u003cTWO_THOUSAND\u003e and has maintained the same momentum to date yielding a fabulous return of \u003cONE_HUNDRED_PERCENT\u003e climbing from \u003cEIGHT_TEN\u003e apiece to the current level of \u003cTWO_HUNDRED\u003e apiece over the past \u003cONE_TEN\u003e months the stock has posted gains in \u003cNINE_\u003e months with january leading the way with a \u003cTWO_TEN_PERCENT\u003e increase followed closely by august at \u003cTWO_TEN_PERCENT\u003e looking back over four years the stock has soared from \u003cONE_TEN\u003e per share to the current level producing an astonishing return of \u003cONE_THOUSAND_PERCENT\u003e to shareholders hi tech pipes is a prominent manufacturer and supplier of electric resistance welding erw pipes it specialises in producing steel tubes and pipes for various industries including infrastructure telecommunications defence railroads airports real estate and automobiles with an installed capacity of \u003cSEVEN_HUNDRED_THOUSAND\u003e metric tons and six manufacturing facilities its products are distributed across \u003cONE_TEN\u003e states through a robust network of over \u003cFIVE_HUNDRED\u003e dealers currently around \u003cTWO_TEN_PERCENT\u003e of the companys revenue comes from value added products vap domestic brokerage firm midas equities and research in its latest note issued an accumulate rating on the stock setting a target price of \u003cTWO_HUNDRED\u003e per share this target reflects a potential upside of \u003cFOUR_TEN_PERCENT\u003e from the stocks last closing price the brokerage notes that the company stands to benefit significantly from the indian governments infrastructure initiatives with plans to double its capacity and increase its share of value added products vap the company is well positioned for earnings growth according to the brokerage the countrys steel production capacity is projected to rise from \u003cONE_HUNDRED\u003e mt in fy22 to \u003cONE_HUNDRED\u003e mt by fy30 representing a cagr of \u003cFIVE_PERCENT\u003e among the key consumers of steel it expects structural steel tubes to grow at a cagr of \u003cNINE_PERCENT\u003e increasing from \u003cNINE_\u003e mt in fy23 to \u003cONE_TEN\u003e mt by fy30 this demand as per the brokerage will primarily stem from infrastructure development across various key sectors it says the company is already involved in significant projects including the noida international airport kangra airport in himachal pradesh khavda solar park the worlds largest solar park and various metro and borewell projects in agra gandhinagar maharashtra and karnataka therefore it expects the company to touch \u003cONE_\u003e mt capacity by the end of fy25 from \u003cZERO_\u003e mt as of fy24 on the back of strong demand expected from end use sectors hi tech aspires to double its capacity to \u003cTWO_\u003e mt in the next \u003cFOUR_\u003e \u003cFIVE_\u003e years hi tech already has products approved for key sectors and is well poised to expand market share in the high growth end use sectors as hi tech advances up the value chain by offering value added products such as gp pipes and gi pipes the brokerage expects the share of vap in total revenue to rise from \u003cTWO_TEN_PERCENT\u003e in fy24 to between \u003cFOUR_TEN_PERCENT\u003e and \u003cFIVE_TEN_PERCENT\u003e by fy28 the brokerage anticipates that the growth in the share of vap along with expected operational leverage will significantly enhance hi techs profitability in the future it expects hi tech to clock a revenue cagr of \u003cTWO_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e on the back of strong growth in end use sectors and a volume growth of \u003cTWO_TEN_PERCENT\u003e it projects that hi tech will achieve an ebitda per ton of \u003cFOUR_THOUSAND\u003e by fy28e reflecting a cagr of \u003cONE_TEN_PERCENT\u003e this growth is anticipated as the share of value added products vap increases to \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e further it projects hi tech to report ebitda of \u003cFOUR_HUNDRED\u003e crore by fy28e and expects eps to grow at \u003cFOUR_TEN_PERCENT\u003e cagr over fy24 \u003cTWO_TEN\u003e e to \u003cONE_TEN\u003e in fy28e from \u003cTWO_\u003e in fy24","timestamp":"2024-09-20T16:40:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}