{"url":"https://www.livemint.com/market/stock-market-news/why-will-multibagger-stock-ptc-industries-be-a-stock-to-watch-on-monday-11727513999209.html","title":"Why will multibagger stock PTC Industries be a stock to watch on Monday?","description":"Stock to watch: PTC Industries informed Indian exchanges on Friday about the receipt of fresh order from BAE Systems for the supply of Titanium castings","content":"Stock to watch: PTC Industries' share price would be under the radar of stock market observers as the company has received a significant production order from BAE Systems. The multibagger stock that has delivered around 130% return to its shareholders in one year informed us about the order book update in an exchange filing on Friday at noon. After announcing a fresh order update, PTC Industries shares surged 5% and hit the upper circuit. Knowing how the multibagger stock trades on Monday would be interesting, as the market may not have wholly discounted the news.PTC Industries informed about the order book update saying, \"PTC Industries Limited, a leading manufacturer of high-quality engineering metal components, is pleased to announce that it has received a significant production order from BAE Systems for the supply of Titanium castings for the M777 Ultra-Lightweight Howitzer (ULH), including Spade Trails and Blades. PTC Industries developed these Titanium castings for M777 ULH over the last two years. This order marks a major milestone in PTC Industries' ongoing relationship with BAE Systems and underscores the company's technological prowess to supply mission-critical components for such advanced defence platforms.\"\"PTC Industries will produce complex lightweight Titanium castings for the 155mm M777 ULH at its state-of-the-art production facility in Lucknow, Uttar Pradesh. This partnership is a testimony to PTC Industries' capabilities in delivering high-precision components for critical defence applications. With a weight of about 4.2 MT, BAE Systems' M777 ULH is the lightest towed howitzer gun. This considerable weight reduction is achieved due to the extensive use of thin-walled Titanium castings in the structure of the artillery gun, allowing the M777 to even be transportable by helicopter,\" the company said in a press release available on the Indian exchanges.Regarding the development, Sachin Agarwal, Chairman \u0026 Managing Director of PTC Industries, said: “We are thrilled to receive this serial production order from BAE Systems for this significant project. This order enhances our partnership with BAE Systems. It showcases our proficiency in producing highly complex and thin-walled Titanium castings for such critical applications, making us amongst two to three companies with such capability. We provide top-quality products to support the defence sector and further the 'Make in India – Make for the World' initiative.”In the last six months, PTC Industries' share price has risen from around  ₹7,334 to  ₹13,652 apiece, logging a nearly 85% rise. In YTD time, PTC Industries' shares delivered 105% returns to its shareholders, whereas in one year, they rose by around 130%.","cleaned_content":"stock to watch ptc industries share price would be under the radar of stock market observers as the company has received a significant production order from bae systems the multibagger stock that has delivered around \u003cONE_HUNDRED_PERCENT\u003e return to its shareholders in one year informed us about the order book update in an exchange filing on friday at noon after announcing a fresh order update ptc industries shares surged \u003cFIVE_PERCENT\u003e and hit the upper circuit knowing how the multibagger stock trades on monday would be interesting as the market may not have wholly discounted the news ptc industries informed about the order book update saying ptc industries limited a leading manufacturer of high quality engineering metal components is pleased to announce that it has received a significant production order from bae systems for the supply of titanium castings for the m777 ultra lightweight howitzer ulh including spade trails and blades ptc industries developed these titanium castings for m777 ulh over the last two years this order marks a major milestone in ptc industries ongoing relationship with bae systems and underscores the companys technological prowess to supply mission critical components for such advanced defence platforms ptc industries will produce complex lightweight titanium castings for the \u003cONE_HUNDRED\u003e mm m777 ulh at its state of the art production facility in lucknow uttar pradesh this partnership is a testimony to ptc industries capabilities in delivering high precision components for critical defence applications with a weight of about \u003cFOUR_\u003e mt bae systems m777 ulh is the lightest towed howitzer gun this considerable weight reduction is achieved due to the extensive use of thin walled titanium castings in the structure of the artillery gun allowing the m777 to even be transportable by helicopter the company said in a press release available on the indian exchanges regarding the development sachin agarwal chairman managing director of ptc industries said we are thrilled to receive this serial production order from bae systems for this significant project this order enhances our partnership with bae systems it showcases our proficiency in producing highly complex and thin walled titanium castings for such critical applications making us amongst two to three companies with such capability we provide top quality products to support the defence sector and further the make in india make for the world initiative in the last six months ptc industries share price has risen from around \u003cSEVEN_THOUSAND\u003e to \u003cONE_TEN_THOUSAND\u003e apiece logging a nearly \u003cEIGHT_TEN_PERCENT\u003e rise in ytd time ptc industries shares delivered \u003cONE_HUNDRED_PERCENT\u003e returns to its shareholders whereas in one year they rose by around \u003cONE_HUNDRED_PERCENT\u003e","timestamp":"2024-09-28T14:43:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}