{"url":"https://www.livemint.com/market/stock-market-news/indian-oil-corporation-withdraws-rs-22-000-crore-rights-issue-11727689761325.html","title":"Indian Oil Corporation withdraws  ₹22,000 crore rights issue","description":"Indian Oil Corporation has withdrawn its  ₹22,000 crore rights issue due to the government's non-participation and lack of allocated funds for Oil Marketing Companies in the 2024-25 budget, following earlier approvals for raising capital.","content":"Indian Oil Corporation (IOC) came into focus on Monday after announcing the withdrawal of its  ₹22,000 crore rights issue. The company had initially approved the capital raise via a rights issue, as per its earlier notification dated July 7, 2023, subject to statutory approvals.However, following a board meeting on September 30, 2024, IOC decided to cancel the issue. This decision came after the Ministry of Petroleum \u0026 Natural Gas (MoP\u0026NG) informed the company that no funds had been allocated for capital support to Oil Marketing Companies (OMCs) in the 2024-25 budget. The government's earlier proposed allocation of  ₹30,000 crore was ultimately excluded from the final budget, prompting its non-participation in the rights issue.IOC stated that, due to the government's decision, the board opted to withdraw the proposed rights issue of equity shares.\"In this regard, we would like to inform that the MoP\u0026NG has conveyed that no funds have been allocated for capital support to Oil Marketing Companies (OMC’s) in the Budget 2024-25, as against the earlier proposed allocation of Rs. 30,000 crore. Therefore, in view of the Govt. of India’s (Promoters) non-participation in the Right Issue, the Board at its meeting held on 30.09.2024 has decided to withdraw the proposed Right Issue of equity shares,\" informed the company in an exchange filing.The stock has soared 98 percent in the last 1 year and over 38 percent in 2024 YTD. It added 1.4 percent in September after a 2.6 percent fall in August.The OMC stock is currently trading 8.5 percent away from its peak of  ₹196.80, hit in February this year while it has surged over 110 percent from its 52-week low of  ₹85.51, recorded in October last year.A rights issue is a way for companies to raise capital by offering existing shareholders the opportunity to purchase additional shares at a discounted price, in proportion to their current holdings. This method allows shareholders to maintain their ownership percentage while providing the company with funds for purposes like expansion or debt reduction. The offer is usually time-bound, and if shareholders choose not to buy more shares, they can sometimes sell their rights on the market. Rights issues are commonly used when companies need to raise substantial capital without taking on new debt.","cleaned_content":"indian oil corporation ioc came into focus on monday after announcing the withdrawal of its \u003cTWO_TEN_THOUSAND\u003e crore rights issue the company had initially approved the capital raise via a rights issue as per its earlier notification dated july \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e subject to statutory approvals however following a board meeting on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e ioc decided to cancel the issue this decision came after the ministry of petroleum natural gas mop ng informed the company that no funds had been allocated for capital support to oil marketing companies omcs in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e budget the governments earlier proposed allocation of \u003cTHREE_TEN_THOUSAND\u003e crore was ultimately excluded from the final budget prompting its non participation in the rights issue ioc stated that due to the governments decision the board opted to withdraw the proposed rights issue of equity shares in this regard we would like to inform that the mop ng has conveyed that no funds have been allocated for capital support to oil marketing companies omc s in the budget \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e as against the earlier proposed allocation of rs \u003cTHREE_TEN_THOUSAND\u003e crore therefore in view of the govt of india s promoters non participation in the right issue the board at its meeting held on \u003cTHREE_TEN\u003e 2024 has decided to withdraw the proposed right issue of equity shares informed the company in an exchange filing the stock has soared \u003cNINE_TEN_PERCENT\u003e in the last \u003cONE_\u003e year and over \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd it added \u003cONE_PERCENT\u003e in september after a \u003cTWO_PERCENT\u003e fall in august the omc stock is currently trading \u003cEIGHT_PERCENT\u003e away from its peak of \u003cONE_HUNDRED\u003e hit in february this year while it has surged over \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cEIGHT_TEN\u003e recorded in october last year a rights issue is a way for companies to raise capital by offering existing shareholders the opportunity to purchase additional shares at a discounted price in proportion to their current holdings this method allows shareholders to maintain their ownership percentage while providing the company with funds for purposes like expansion or debt reduction the offer is usually time bound and if shareholders choose not to buy more shares they can sometimes sell their rights on the market rights issues are commonly used when companies need to raise substantial capital without taking on new debt","timestamp":"2024-09-30T15:19:00+05:30","market_timestamp":"2024-09-30T15:19:00+05:30","off_market_hours":false}