{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-markets-outlook-five-stocks-to-buy-or-sell-on-friday-sept-27-11727350129429.html","title":"Stock market today: Trade setup for Nifty 50 to global markets outlook, five stocks to buy or sell on Friday —Sept 27","description":"Stock Market Today: Nifty continuing its record run ended at fresh closing highs on Thursday. Analysts expect positive momentum to continues as long as Nifty and Sensex is trading above 26000 and 85300 respectively. Check for ive stocks to buy or sell on Friday —Sept 27","content":"Stock Market Today: The benchmark Nifty 50, extending its record run, ended at fresh closing highs on September 26 . The late surge after a soft opening meant that the Nifty-50 index with gains of 211.90 points ended at 26,216.05 up 0.81% while S\u0026P BSE Sensex with gains of 666.25 points ended at 85,836.12, up 0.78%Bank Nifty at 54,375.35 also ended with 0.51% gains led by surge in PSU banks. Gains in Auto and metal stocks supported the markets while Nifty Consumer Durables closed in the red. Broader indices remained subdued for another session, with mid and small caps ending mixed.After Nifty ending with gains on Thursday, analysts expect momentum to continue. Technically, after a muted opening market successfully cleared 26000/85300 mark. Shrikant Chouhan, Head of Equity Research, Kotak Securities said that “We are of the view that, as long as market is trading above 26000/85300 the bullish setup is likely to continue.” On the higher side, it could move up till 26300-26375/86000-86300, while below 26000/85300 uptrend would be vulnerable.Bank Nifty broke out of the sideways consolidation 53800 – 54300 on the upside. we expect the momentum to continue towards 55000. Support base shift higher towards 54000 – 53900, said Jatin Gedia – Technical Research Analyst at Sharekhan.Asia and European markets on Thursday saw a surge in technology shares and China news as Beijing revealed additional stimulus plans aimed at boosting the country's economy. Beijing unveiled additional plans to boost the second-biggest economy in the world, including cash transfers to the underprivileged and an alleged $140 billion infusion into the biggest state-run banks.Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd expects  the bullish momentum in Nifty to continue supported by strong action in frontline stock. Globally, US Q2 GDP \u0026 PCE numbers would be important data to watch outSumeet Bagadia, Executive Director at Choice Broking has recommended two stock picks for Wednesday. Also Ganesh Dongre, Senior Manager of technical Research at Anand Rathi has given another three stock picks for today.These include TVS Motor Company Ltd,  BF Utilities Ltd , Bharat Petroleum Corporation Ltd, Indus Towers Ltd , Alembic Pharmaceuticals LTD1, TVS Motor Company Ltd. Sumeet Bagadia recommends buying TVS Motor Company at  ₹2891.1 with Stop Loss at  ₹2790  and target price at  ₹3050TVS Motor Company is exhibiting strong bullish momentum, currently trading at an all-time high of 2902 levels. The recent breakout above the crucial resistance at 2800 levels is a significant technical development, supported by robust trading volumes, reinforcing the strength in the stock. The breakthrough suggests a potential continuation of the upward trend, offering an optimistic outlook for investors, said Bagadia2. BF Utilities Ltd - Bagadia recommends buying BF Utilities Ltd at 1009.8 with Stoploss at  ₹975 and target price at  ₹1060BF Utilities daily chart analysis offers a favourable view for the following week, indicating a steady higher advance. Notably, the stock has produced a notable higher high and higher low pattern, and the company's recent upward swing has effectively violated the neckline, establishing a new week high. This breakthrough indicates the possibility of a significant follow-through upward increase in the stock price.3. Bharat Petroleum Corporation Ltd- Dongre recommended buying BPCL at  ₹345 with a Stoploss at  ₹335 with a Target price of  ₹360The stock found a substantial support level at Rs. 335, marking a crucial juncture in its recent trading. Presently, at Rs.345, the stock has demonstrated a definitive reversal in price action, suggesting a potential continuation of its upward momentum. Traders keen on seizing this opportunity could consider buying and holding the stock, setting a prudent stop loss at Rs.335. The anticipated target for this trade is Rs.360, representing the next significant resistance level. This strategy positions traders favorably to capitalize on the stock's anticipated rally in the weeks ahead, said Dongre4. Indus Towers Ltd - Dongre recommends buying Indus Towers Ltd at  ₹395 with a stoploss at  ₹382 and target price of  ₹420.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around Rs. 420. At present, the stock is maintaining a crucial support level at Rs.382. Given the current market price of Rs.395, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of Rs. 420, said Dongre5. Alembic Pharmaceuticals LTD - Dongre recommends buying  Alembic Pharmaceuticals Ltd at  ₹1200 with Stop Loss at  ₹1160 and target price of  ₹1260On the daily chart of this stock, a breakout at the Rs. 1200 price level has been observed, signaling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increasing buying momentum. Given these technical indicators, traders can consider buying on dips, entering the stock at a lower price point. To manage risk, a stop loss at Rs. 1160 is recommended. The target price for this strategy is Rs. 1260 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.","cleaned_content":"stock market today the benchmark nifty \u003cFIVE_TEN\u003e extending its record run ended at fresh closing highs on september \u003cTWO_TEN\u003e the late surge after a soft opening meant that the nifty \u003cFIVE_TEN\u003e index with gains of \u003cTWO_HUNDRED\u003e points ended at \u003cTWO_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e while s p bse sensex with gains of \u003cSIX_HUNDRED\u003e points ended at \u003cEIGHT_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e bank nifty at \u003cFIVE_TEN_THOUSAND\u003e also ended with \u003cZERO_PERCENT\u003e gains led by surge in psu banks gains in auto and metal stocks supported the markets while nifty consumer durables closed in the red broader indices remained subdued for another session with mid and small caps ending mixed after nifty ending with gains on thursday analysts expect momentum to continue technically after a muted opening market successfully cleared \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e mark shrikant chouhan head of equity research kotak securities said that we are of the view that as long as market is trading above \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e the bullish setup is likely to continue on the higher side it could move up till \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e while below \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e uptrend would be vulnerable bank nifty broke out of the sideways consolidation \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e on the upside we expect the momentum to continue towards \u003cFIVE_TEN_THOUSAND\u003e support base shift higher towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e said jatin gedia technical research analyst at sharekhan asia and european markets on thursday saw a surge in technology shares and china news as beijing revealed additional stimulus plans aimed at boosting the countrys economy beijing unveiled additional plans to boost the second biggest economy in the world including cash transfers to the underprivileged and an alleged \u003cONE_HUNDRED\u003e billion infusion into the biggest state run banks siddhartha khemka head research wealth management motilal oswal financial services ltd expects the bullish momentum in nifty to continue supported by strong action in frontline stock globally us q2 gdp pce numbers would be important data to watch outsumeet bagadia executive director at choice broking has recommended two stock picks for wednesday also ganesh dongre senior manager of technical research at anand rathi has given another three stock picks for today these include tvs motor company ltd bf utilities ltd bharat petroleum corporation ltd indus towers ltd alembic pharmaceuticals ltd1 tvs motor company ltd sumeet bagadia recommends buying tvs motor company at \u003cTWO_THOUSAND\u003e with stop loss at \u003cTWO_THOUSAND\u003e and target price at \u003cTHREE_THOUSAND\u003e tvs motor company is exhibiting strong bullish momentum currently trading at an all time high of \u003cTWO_THOUSAND\u003e levels the recent breakout above the crucial resistance at \u003cTWO_THOUSAND\u003e levels is a significant technical development supported by robust trading volumes reinforcing the strength in the stock the breakthrough suggests a potential continuation of the upward trend offering an optimistic outlook for investors said bagadia2 bf utilities ltd bagadia recommends buying bf utilities ltd at \u003cONE_THOUSAND\u003e with stoploss at \u003cNINE_HUNDRED\u003e and target price at \u003cONE_THOUSAND\u003e bf utilities daily chart analysis offers a favourable view for the following week indicating a steady higher advance notably the stock has produced a notable higher high and higher low pattern and the companys recent upward swing has effectively violated the neckline establishing a new week high this breakthrough indicates the possibility of a significant follow through upward increase in the stock price 3 bharat petroleum corporation ltd dongre recommended buying bpcl at \u003cTHREE_HUNDRED\u003e with a stoploss at \u003cTHREE_HUNDRED\u003e with a target price of \u003cTHREE_HUNDRED\u003e the stock found a substantial support level at rs \u003cTHREE_HUNDRED\u003e marking a crucial juncture in its recent trading presently at rs 345 the stock has demonstrated a definitive reversal in price action suggesting a potential continuation of its upward momentum traders keen on seizing this opportunity could consider buying and holding the stock setting a prudent stop loss at rs 335 the anticipated target for this trade is rs 360 representing the next significant resistance level this strategy positions traders favorably to capitalize on the stocks anticipated rally in the weeks ahead said dongre4 indus towers ltd dongre recommends buying indus towers ltd at \u003cTHREE_HUNDRED\u003e with a stoploss at \u003cTHREE_HUNDRED\u003e and target price of \u003cFOUR_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around rs \u003cFOUR_HUNDRED\u003e at present the stock is maintaining a crucial support level at rs 382 given the current market price of rs 395 a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of rs \u003cFOUR_HUNDRED\u003e said dongre5 alembic pharmaceuticals ltd dongre recommends buying alembic pharmaceuticals ltd at \u003cONE_THOUSAND\u003e with stop loss at \u003cONE_THOUSAND\u003e and target price of \u003cONE_THOUSAND\u003e on the daily chart of this stock a breakout at the rs \u003cONE_THOUSAND\u003e price level has been observed signaling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increasing buying momentum given these technical indicators traders can consider buying on dips entering the stock at a lower price point to manage risk a stop loss at rs \u003cONE_THOUSAND\u003e is recommended the target price for this strategy is rs \u003cONE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory","timestamp":"2024-09-27T06:51:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}