{"url":"https://www.livemint.com/market/stock-market-news/paramount-speciality-forgings-ipo-allotment-expected-today-heres-how-to-check-status-11727089738869.html","title":"Paramount Speciality Forgings IPO allotment expected today: Here’s how to check status","description":"Investors can check their allotment through the registrar, Purva Sharegistry India Pvt Ltd. The SME IPO is expected to be listed on the NSE SME platform, with a tentative date of September 25, 2024.","content":"The allotment for Paramount Speciality Forgings IPO is expected to be finalized today. Investors can check their allotment status through the registrar, Purva Sharegistry India Pvt Ltd.The IPO, which was opened for subscription from September 17 to September 20, saw a healthy response from investors, being oversubscribed by 73.88 times. Specifically, the non-institutional investor (NII) segment was oversubscribed 220.24 times, while the retail portion was oversubscribed 41.35 times. The IPO price was set between  ₹57 and  ₹59 per share.Given the high level of retail oversubscription, shares will be allocated to retail individual investors (RIIs) on a proportional basis. Those who do not receive an allotment can expect the refund process to start on September 24, 2024.Shares allotted will be credited to investors' demat accounts on the same day as the refunds. The SME IPO is expected to be listed on the NSE SME platform, with a tentative date of September 25, 2024.The company plans to use the net proceeds from the IPO for capital expenditure through the purchase of machinery and equipment required for expansion at the Khopoli Plant and general corporate purposes.Step 01: Log in to the Paramount Speciality Forgings page: https://www.purvashare.com/investor-service/ipo-queryStep 02: Choose IPO Name ‘Paramount Speciality Forgings‘from the drop-down menu bar.Step 03: Pick one of all three options to check the status: Application No., Demat Account, or PAN.Step 04: Click on the 'Search' button.Step 05: Your Paramount Speciality Forgings IPO allotment status will be displayed on the screen (desktop/mobile).Paramount Speciality IPO GMP or grey market premium was  ₹0, which meant shares were trading at their issue price of  ₹59 with no premium or discount in the grey market, according to investorgain.com.The company is a manufacturer of steel forgings in India, offering a diverse range of forged products. It has developed its business and scale of operations since its founding in 1996 and has invested in a variety of machinery to boost and diversify its manufacturing capabilities.The company can now manufacture and provide forged components ranging in weight from 1 kg to 4 metric tons in rough or finish-machined condition. Its products are manufactured in accordance with national and international standards and are used in a wide range of industrial applications catering to the extensive requirements of petrochemicals, chemicals, fertilizers, oil \u0026 gas, nuclear power, and other heavy engineering sectors, according to the company's DRHP report.","cleaned_content":"the allotment for paramount speciality forgings ipo is expected to be finalized today investors can check their allotment status through the registrar purva sharegistry india pvt ltd the ipo which was opened for subscription from september \u003cONE_TEN\u003e to september \u003cTWO_TEN\u003e saw a healthy response from investors being oversubscribed by \u003cSEVEN_TEN\u003e times specifically the non institutional investor nii segment was oversubscribed \u003cTWO_HUNDRED\u003e times while the retail portion was oversubscribed \u003cFOUR_TEN\u003e times the ipo price was set between \u003cFIVE_TEN\u003e and \u003cFIVE_TEN\u003e per share given the high level of retail oversubscription shares will be allocated to retail individual investors riis on a proportional basis those who do not receive an allotment can expect the refund process to start on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e shares allotted will be credited to investors demat accounts on the same day as the refunds the sme ipo is expected to be listed on the nse sme platform with a tentative date of september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company plans to use the net proceeds from the ipo for capital expenditure through the purchase of machinery and equipment required for expansion at the khopoli plant and general corporate purposes step \u003cONE_\u003e log in to the paramount speciality forgings page https www purvashare com investor service ipo querystep \u003cTWO_\u003e choose ipo name paramount speciality forgings from the drop down menu bar step \u003cTHREE_\u003e pick one of all three options to check the status application no demat account or pan step \u003cFOUR_\u003e click on the search button step \u003cFIVE_\u003e your paramount speciality forgings ipo allotment status will be displayed on the screen desktop mobile paramount speciality ipo gmp or grey market premium was \u003cZERO_\u003e which meant shares were trading at their issue price of \u003cFIVE_TEN\u003e with no premium or discount in the grey market according to investorgain com the company is a manufacturer of steel forgings in india offering a diverse range of forged products it has developed its business and scale of operations since its founding in \u003cONE_THOUSAND\u003e and has invested in a variety of machinery to boost and diversify its manufacturing capabilities the company can now manufacture and provide forged components ranging in weight from \u003cONE_\u003e kg to \u003cFOUR_\u003e metric tons in rough or finish machined condition its products are manufactured in accordance with national and international standards and are used in a wide range of industrial applications catering to the extensive requirements of petrochemicals chemicals fertilizers oil gas nuclear power and other heavy engineering sectors according to the companys drhp report","timestamp":"2024-09-23T17:04:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}