{"url":"https://www.livemint.com/market/stock-market-news/zerodha-confirms-free-equity-delivery-nithin-kamath-says-will-continue-to-be-free-11727768962214.html","title":"Zerodha confirms free equity delivery, Nithin Kamath says ‘will continue to be free’","description":"Nithin Kamath, CEO of Zerodha, stated equity delivery will continue to be free and there will be no brokerage changes. As of October 1, the STT for options rose to 0.1%, but the transaction charge fell to 0.035%","content":"Zerodha has confirmed that equity delivery will remain free, with no changes to brokerage at this time. Starting October 1, 2024, charges for options and futures trading will be adjusted. For options, the Securities Transaction Tax (STT) will rise from 0.0625% to 0.1%, while the transaction charge will decrease from 0.0495% to 0.035%.“Currently, we are not making any changes to our brokerage.” Regarding recent updates in the stock market effective October 1, he noted,\" said Zerodha CEO Nithin Kamath, “For options, the STT has increased to 0.1% from 0.0625%, while the transaction charge has decreased to 0.035% from 0.0495%.”\"This results in a net increase of 0.02303%, or  ₹2,303 per crore of premium on the NSE, and 0.0205%, or  ₹2,050 per crore on the BSE,\" he explained in a LinkedIn post.\"In the case of futures, STT will increase from 0.0125% to 0.02%, with the transaction charge slightly decreasing from 0.00183% to 0.00173%. This leads to a net increase of 0.00735%, or  ₹735 per crore of futures turnover,\" Kamath said.Since STT applies to the entire contract value for futures, he added that the impact will be significantly larger for futures traders than options.Starting October 1, the Indian stock markets will undergo notable changes, as the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) implement new transaction fees for brokers in multiple segments.Starting Tuesday, October 1, the Securities Transaction Tax (STT) for futures and options (F\u0026O) will be raised. The STT on the sale of options will increase from 0.0625% to 0.1% of the premium, while the STT on the sale of futures will rise from 0.0125% to 0.02% of the trade price.Effective October 1, the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) introduced new transaction fee structures for the cash and derivatives segments. In the cash market, the NSE will charge a fee of  ₹2.97 per lakh of traded value on each side. For equity futures, the fee will be  ₹1.73 per lakh on each side, while equity options will incur a fee of  ₹35.03 per lakh of premium value.","cleaned_content":"zerodha has confirmed that equity delivery will remain free with no changes to brokerage at this time starting october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e charges for options and futures trading will be adjusted for options the securities transaction tax stt will rise from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e while the transaction charge will decrease from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e currently we are not making any changes to our brokerage regarding recent updates in the stock market effective october \u003cONE_\u003e he noted said zerodha ceo nithin kamath for options the stt has increased to \u003cZERO_PERCENT\u003e from \u003cZERO_PERCENT\u003e while the transaction charge has decreased to \u003cZERO_PERCENT\u003e from \u003cZERO_PERCENT\u003e this results in a net increase of \u003cZERO_PERCENT\u003e or \u003cTWO_THOUSAND\u003e per crore of premium on the nse and \u003cZERO_PERCENT\u003e or \u003cTWO_THOUSAND\u003e per crore on the bse he explained in a linkedin post in the case of futures stt will increase from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e with the transaction charge slightly decreasing from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e this leads to a net increase of \u003cZERO_PERCENT\u003e or \u003cSEVEN_HUNDRED\u003e per crore of futures turnover kamath said since stt applies to the entire contract value for futures he added that the impact will be significantly larger for futures traders than options starting october \u003cONE_\u003e the indian stock markets will undergo notable changes as the national stock exchange nse and bombay stock exchange bse implement new transaction fees for brokers in multiple segments starting tuesday october \u003cONE_\u003e the securities transaction tax stt for futures and options f o will be raised the stt on the sale of options will increase from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e of the premium while the stt on the sale of futures will rise from \u003cZERO_PERCENT\u003e to \u003cZERO_PERCENT\u003e of the trade price effective october \u003cONE_\u003e the national stock exchange nse and bombay stock exchange bse introduced new transaction fee structures for the cash and derivatives segments in the cash market the nse will charge a fee of \u003cTWO_\u003e per lakh of traded value on each side for equity futures the fee will be \u003cONE_\u003e per lakh on each side while equity options will incur a fee of \u003cTHREE_TEN\u003e per lakh of premium value","timestamp":"2024-10-01T13:58:00+05:30","market_timestamp":"2024-10-01T13:58:00+05:30","off_market_hours":false}