{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-dharmesh-shah-of-icici-securities-recommends-tata-motors-and-deepak-nitrite-to-buy-on-september-11727539077898.html","title":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying Tata Motors, Deepak Nitrite today","description":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying Tata Motors Ltd and Deepak Nitrite Ltd this week.","content":"Stock Market News: On Monday, domestic benchmark indices, Sensex and Nifty 50, started the day with losses, primarily due to a decline in information technology and financial stocks as investors booked profits at all-time high levels.The Nifty 50 index commenced at 26,061.30 points, marking a decrease of 0.45% or 117.65 points, while the BSE Sensex dropped by 363 points or 0.42% at the opening, reaching 85,208.76 points.Market analysts anticipate heightened volatility in October as the US Presidential election season approaches, but they are optimistic about a potential return of the stock rally after the conclusion of the elections.The market is probably going to enter a consolidation period soon, according to Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services. The outperformance of Chinese equities, which is shown in the enormous increase in the Hang Seng index by around 18% in September, is one important reason that is impacting global portfolios. Expectations of a Chinese economic rebound in reaction to the monetary and fiscal stimulus measures proposed by the Chinese government have set off this upsurge.According to Vijayakumar, the huge amount of domestic money means that the FIIs' sales are unlikely to have a substantial influence on the Indian market.On Friday, the domestic benchmark indices, Nifty 50 and Sensex, closed slightly lower as investors took profits.In the end, the Sensex fell 0.3% to 85,571.85, while the benchmark Nifty 50 finished 0.14% lower at 26,178.95 points. For the third week, the indices saw advances of 1.5% and 1.2%, respectively.Due to an oversized reduction in US interest rates last Wednesday, capital flows into emerging markets have increased, and Indian benchmarks have reached record highs for seven straight sessions.Going forward, market analysts anticipate that changes in commodity prices, the US dollar index, and important macroeconomic indicators from the US will play a crucial role in determining the market's trajectory. Furthermore, geopolitical events will remain influential on the international platform. On the home front, forthcoming monthly automobile sales figures and quarterly reports from businesses could impact specific stock movements in the short run.The equity benchmark extended record-setting spree over the third consecutive week aided by Chinese stimulus wherein large caps relatively outperformed the broader market. We expect markets to consolidate in the 25,800 and 26,500 range with stock-specific focus as earnings cues would kick in which would provide further directional bias. The key point to highlight is that in the past three weeks, the Nifty 50 has rallied \u003e1,500 points, which has hauled the daily stochastic oscillator into overbought territory (placed at 91), indicating possibility of a temporary breather at higher levels. Only a decisive close below the previous session's low would result in a pause in upward momentum. Our positive bias is further validated by following observations:a) The sturdy price structure of Banking and IT (which carries 50% weightage in Nifty 50) stocks signifies that the broader positive structure remains intact. Meanwhile, the recently underperforming Metal index has seen a rejuvenation of upward momentum as it has given a breakout from a four-month trading range with faster pace of retracement backed by the rally in base metals aided by Chinese stimulus.b) Brent prices declined sharply as supply-side concerns have eased and crude prices are expected to remain under pressure with downside target of 67-65 levels. Falling crude oil prices usually have an inverse correlation with the domestic market.Sectorally, we expect PSU banks, IT, and metals to remain in focus. Declining yields and recent corrections would act as catalysts for PSU banks.The buying demand at elevated support base highlights inherent strength that makes us revise the support base at the psychological mark of 25,800 as it is a 38.2% retracement of the recent up move (24,753-26,277) coincided with last week's low of 25,847.On stocks to buy this week, Dharmesh Shah recommended two stocks - Tata Motors Ltd, and Deepak Nitrite Ltd.2. Buy Deepak Nitrite in the range of  ₹2,830-2,900 for the target of  ₹3,275 with a stop loss of  ₹2,668.The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and individual circumstances may vary.","cleaned_content":"stock market news on monday domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e started the day with losses primarily due to a decline in information technology and financial stocks as investors booked profits at all time high levels the nifty \u003cFIVE_TEN\u003e index commenced at \u003cTWO_TEN_THOUSAND\u003e points marking a decrease of \u003cZERO_PERCENT\u003e or \u003cONE_HUNDRED\u003e points while the bse sensex dropped by \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e at the opening reaching \u003cEIGHT_TEN_THOUSAND\u003e points market analysts anticipate heightened volatility in october as the us presidential election season approaches but they are optimistic about a potential return of the stock rally after the conclusion of the elections the market is probably going to enter a consolidation period soon according to dr v k vijayakumar chief investment strategist at geojit financial services the outperformance of chinese equities which is shown in the enormous increase in the hang seng index by around \u003cONE_TEN_PERCENT\u003e in september is one important reason that is impacting global portfolios expectations of a chinese economic rebound in reaction to the monetary and fiscal stimulus measures proposed by the chinese government have set off this upsurge according to vijayakumar the huge amount of domestic money means that the fiis sales are unlikely to have a substantial influence on the indian market on friday the domestic benchmark indices nifty \u003cFIVE_TEN\u003e and sensex closed slightly lower as investors took profits in the end the sensex fell \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e while the benchmark nifty \u003cFIVE_TEN\u003e finished \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points for the third week the indices saw advances of \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively due to an oversized reduction in us interest rates last wednesday capital flows into emerging markets have increased and indian benchmarks have reached record highs for seven straight sessions going forward market analysts anticipate that changes in commodity prices the us dollar index and important macroeconomic indicators from the us will play a crucial role in determining the markets trajectory furthermore geopolitical events will remain influential on the international platform on the home front forthcoming monthly automobile sales figures and quarterly reports from businesses could impact specific stock movements in the short run the equity benchmark extended record setting spree over the third consecutive week aided by chinese stimulus wherein large caps relatively outperformed the broader market we expect markets to consolidate in the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e range with stock specific focus as earnings cues would kick in which would provide further directional bias the key point to highlight is that in the past three weeks the nifty \u003cFIVE_TEN\u003e has rallied \u003cONE_THOUSAND\u003e points which has hauled the daily stochastic oscillator into overbought territory placed at \u003cNINE_TEN\u003e indicating possibility of a temporary breather at higher levels only a decisive close below the previous sessions low would result in a pause in upward momentum our positive bias is further validated by following observations a the sturdy price structure of banking and it which carries \u003cFIVE_TEN_PERCENT\u003e weightage in nifty \u003cFIVE_TEN\u003e stocks signifies that the broader positive structure remains intact meanwhile the recently underperforming metal index has seen a rejuvenation of upward momentum as it has given a breakout from a four month trading range with faster pace of retracement backed by the rally in base metals aided by chinese stimulus b brent prices declined sharply as supply side concerns have eased and crude prices are expected to remain under pressure with downside target of \u003cSIX_TEN\u003e \u003cSIX_TEN\u003e levels falling crude oil prices usually have an inverse correlation with the domestic market sectorally we expect psu banks it and metals to remain in focus declining yields and recent corrections would act as catalysts for psu banks the buying demand at elevated support base highlights inherent strength that makes us revise the support base at the psychological mark of \u003cTWO_TEN_THOUSAND\u003e as it is a \u003cTHREE_TEN_PERCENT\u003e retracement of the recent up move \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e coincided with last weeks low of \u003cTWO_TEN_THOUSAND\u003e on stocks to buy this week dharmesh shah recommended two stocks tata motors ltd and deepak nitrite ltd 2 buy deepak nitrite in the range of \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e for the target of \u003cTHREE_THOUSAND\u003e with a stop loss of \u003cTWO_THOUSAND\u003e the views and recommendations provided in this analysis are those of individual analysts or broking companies not mint we strongly advise investors to consult with certified experts before making any investment decisions as market conditions can change rapidly and individual circumstances may vary","timestamp":"2024-09-30T10:02:00+05:30","market_timestamp":"2024-09-30T10:02:00+05:30","off_market_hours":false}