{"url":"https://www.livemint.com/market/stock-market-news/bank-of-baroda-shares-remain-a-buy-for-motilal-oswal-despite-10-fall-in-3-months-heres-what-the-brokerage-says-11727675449434.html","title":"Bank of Baroda shares remain a buy for Motilal Oswal despite 10% fall in 3 months; here’s what the brokerage says","description":"Motilal Oswal maintains a 'buy' recommendation on Bank of Baroda despite a 9.5% decline over the last three months. The brokerage has a target price of  ₹290 on the stock, indicating a 16% upside from current levels as it expects steady earnings growth.","content":"Bank of Baroda (BoB) shares have fallen 9.5 per cent since July following three straight months of decline. Despite this domestic brokerage Motilal Oswal (MOSL) reiterated its ‘buy’ recommendation on the public sector lender as it expects the bank's earnings to clock a modest 10 per cent CAGR and return on assets (RoA) to remain steady at 1.1 per cent.The brokerage has a target price of  ₹290 on the stock, implying an upside potential of over 16 per cent from its current market price.MOSL highlighted that BoB saw a strong rise in RoA from 0.57 per cent in FY22 to 1.17 per cent in FY24. The brokerage remains bullish on Bank of Baroda stock supported by improving asset quality and a projected cost-to-income ratio of 45 per cent by FY27.“Loan growth was strong at 17 per cent CAGR over FY22-FY24, while deposit growth is expected to align with the system at 11 per cent, with advances growth moderating to 11.5 per cent over FY24-FY27, driven by retail, agriculture, and MSME segments,” MOSL said in a recent note.The public sector lender has risen 16.66 per cent in the last one year and 8 per cent in 2024 so far. The stock shed almost a per cent in September, extending losses for the third straight month. It fell 1.4 per cent in August and 7.9 per cent in July.Before that, the stock witnessed continued volatility between January to June. In June, the stock was in the green, up 3.7 per cent after a 5.65 per cent fall in May. It also gained 6.6 per cent in April and lost 0.5 per cent in March. Meanwhile, it jumped 6.8 per cent in February and 7.6 per cent in January.The scrip has risen almost 33 per cent from its 52-week low of  ₹187.95, hit in October last year and is down over 16 per cent from its record high of  ₹298.45, recorded in June 2024.Loan book to post 11.5% CAGR: MOSL reported that Bank of Baroda (BoB) achieved a 13 per cent year-on-year (YoY) loan growth in FY24, driven by a 21 per cent increase in retail, agriculture, and MSME (RAM) segments. The retail portfolio, comprising 21 per cent of the loan book, is expected to grow 20 per cent YoY in FY25, according to the brokerage. BoB aims to increase the RAM segment share from 45 per cent to 60 per cent, boosting margins and profitability. MOSL projected a modest 11.5 per cent CAGR in loan growth for BoB over FY24-FY27, amid systemic growth moderation and a higher credit-deposit ratio.Deposit accretion remains a challenge: However, MOSL noted that deposit growth remained a challenge for Bank of Baroda, projecting an 11 per cent CAGR in deposits over FY24-FY27. The bank reduced bulk deposits to 15 per cent from 17 per cent in 1QFY24 and aimed to lower this further. The credit-deposit (CD) ratio is expected to rise slightly to 81.6 per cent by FY27. Intense deposit competition and slower CASA growth would likely keep deposit costs high, with MOSL estimating costs to remain at 5.3 per cent over FY25-FY26.NIM to remain range-bound in the near term: In terms of margins, BoB's net interest margin (NIM) contracted by 35 basis points from a peak of 3.53 per cent in 4QFY23 to 3.18 per cent in 1QFY25, driven by a 63 basis point increase in deposit costs. Despite these pressures, the bank’s focus on reducing high-cost deposits and maintaining a strong CASA ratio helped protect its margins. With 50 per cent of BoB's loan book linked to the marginal cost of funds-based lending rate (MCLR) and 30 per cent tied to the repo rate, the bank expected a gradual margin progression as the rate cycle turns. MOSL projected a 19 basis point contraction in NIM over FY26.Opex growth to remain controlled: Operating expenditure (opex) growth, which surged in FY24, was expected to moderate, enabling improvements in the cost-to-income (C/I) ratio. MOSL estimated opex to post a 9 per cent CAGR over FY26-27, while revenues were forecast to grow at 11 per cent during the same period, driven by a focus on increasing fee income, where BoB lagged behind peers. The C/I ratio was projected to decline from 47.7 per cent in FY24 to 45.1 per cent by FY27.Asset quality remains robust: BoB’s asset quality remained robust, with its gross non-performing asset (GNPA) ratio improving from 9.4 per cent in FY20 to 2.9 per cent in FY24. MOSL projected further improvement, estimating the GNPA ratio would decline to 2.4 per cent by FY27, with fresh slippages remaining under control. BoB guided for recoveries and upgrades totalling  ₹100 billion, and credit costs were expected to stay within the guided range of below 0.75 per cent. MOSL remained cautious about potential provisioning requirements related to the final expected credit loss (ECL) guidelines in the public sector banking space.Despite some headwinds, MOSL remains optimistic about BoB’s prospects. The brokerage cited the bank’s focus on reducing high-cost deposits, maintaining healthy margins, and improving operating efficiency as key factors supporting its positive outlook. Additionally, BoB's asset quality has seen substantial improvement with more projected by FY27. MOSL concluded that these factors position BoB well for future growth, despite short-term challenges in the deposit market.","cleaned_content":"bank of baroda bob shares have fallen \u003cNINE_PERCENT\u003e since july following three straight months of decline despite this domestic brokerage motilal oswal mosl reiterated its buy recommendation on the public sector lender as it expects the banks earnings to clock a modest \u003cONE_TEN_PERCENT\u003e cagr and return on assets roa to remain steady at \u003cONE_PERCENT\u003e the brokerage has a target price of \u003cTWO_HUNDRED\u003e on the stock implying an upside potential of over \u003cONE_TEN_PERCENT\u003e from its current market price mosl highlighted that bob saw a strong rise in roa from \u003cZERO_PERCENT\u003e in fy22 to \u003cONE_PERCENT\u003e in fy24 the brokerage remains bullish on bank of baroda stock supported by improving asset quality and a projected cost to income ratio of \u003cFOUR_TEN_PERCENT\u003e by fy27 loan growth was strong at \u003cONE_TEN_PERCENT\u003e cagr over fy22 fy24 while deposit growth is expected to align with the system at \u003cONE_TEN_PERCENT\u003e with advances growth moderating to \u003cONE_TEN_PERCENT\u003e over fy24 fy27 driven by retail agriculture and msme segments mosl said in a recent note the public sector lender has risen \u003cONE_TEN_PERCENT\u003e in the last one year and \u003cEIGHT_PERCENT\u003e in \u003cTWO_THOUSAND\u003e so far the stock shed almost a per cent in september extending losses for the third straight month it fell \u003cONE_PERCENT\u003e in august and \u003cSEVEN_PERCENT\u003e in july before that the stock witnessed continued volatility between january to june in june the stock was in the green up \u003cTHREE_PERCENT\u003e after a \u003cFIVE_PERCENT\u003e fall in may it also gained \u003cSIX_PERCENT\u003e in april and lost \u003cZERO_PERCENT\u003e in march meanwhile it jumped \u003cSIX_PERCENT\u003e in february and \u003cSEVEN_PERCENT\u003e in january the scrip has risen almost \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e hit in october last year and is down over \u003cONE_TEN_PERCENT\u003e from its record high of \u003cTWO_HUNDRED\u003e recorded in june \u003cTWO_THOUSAND\u003e loan book to post \u003cONE_TEN_PERCENT\u003e cagr mosl reported that bank of baroda bob achieved a \u003cONE_TEN_PERCENT\u003e year on year yoy loan growth in fy24 driven by a \u003cTWO_TEN_PERCENT\u003e increase in retail agriculture and msme ram segments the retail portfolio comprising \u003cTWO_TEN_PERCENT\u003e of the loan book is expected to grow \u003cTWO_TEN_PERCENT\u003e yoy in fy25 according to the brokerage bob aims to increase the ram segment share from \u003cFOUR_TEN_PERCENT\u003e to \u003cSIX_TEN_PERCENT\u003e boosting margins and profitability mosl projected a modest \u003cONE_TEN_PERCENT\u003e cagr in loan growth for bob over fy24 fy27 amid systemic growth moderation and a higher credit deposit ratio deposit accretion remains a challenge however mosl noted that deposit growth remained a challenge for bank of baroda projecting an \u003cONE_TEN_PERCENT\u003e cagr in deposits over fy24 fy27 the bank reduced bulk deposits to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in \u003cONE_\u003e qfy24 and aimed to lower this further the credit deposit cd ratio is expected to rise slightly to \u003cEIGHT_TEN_PERCENT\u003e by fy27 intense deposit competition and slower casa growth would likely keep deposit costs high with mosl estimating costs to remain at \u003cFIVE_PERCENT\u003e over fy25 fy26 nim to remain range bound in the near term in terms of margins bobs net interest margin nim contracted by \u003cTHREE_TEN\u003e basis points from a peak of \u003cTHREE_PERCENT\u003e in \u003cFOUR_\u003e qfy23 to \u003cTHREE_PERCENT\u003e in \u003cONE_\u003e qfy25 driven by a \u003cSIX_TEN\u003e basis point increase in deposit costs despite these pressures the bank s focus on reducing high cost deposits and maintaining a strong casa ratio helped protect its margins with \u003cFIVE_TEN_PERCENT\u003e of bobs loan book linked to the marginal cost of funds based lending rate mclr and \u003cTHREE_TEN_PERCENT\u003e tied to the repo rate the bank expected a gradual margin progression as the rate cycle turns mosl projected a \u003cONE_TEN\u003e basis point contraction in nim over fy26 opex growth to remain controlled operating expenditure opex growth which surged in fy24 was expected to moderate enabling improvements in the cost to income c i ratio mosl estimated opex to post a \u003cNINE_PERCENT\u003e cagr over fy26 \u003cTWO_TEN\u003e while revenues were forecast to grow at \u003cONE_TEN_PERCENT\u003e during the same period driven by a focus on increasing fee income where bob lagged behind peers the c i ratio was projected to decline from \u003cFOUR_TEN_PERCENT\u003e in fy24 to \u003cFOUR_TEN_PERCENT\u003e by fy27 asset quality remains robust bob s asset quality remained robust with its gross non performing asset gnpa ratio improving from \u003cNINE_PERCENT\u003e in fy20 to \u003cTWO_PERCENT\u003e in fy24 mosl projected further improvement estimating the gnpa ratio would decline to \u003cTWO_PERCENT\u003e by fy27 with fresh slippages remaining under control bob guided for recoveries and upgrades totalling \u003cONE_HUNDRED\u003e billion and credit costs were expected to stay within the guided range of below \u003cZERO_PERCENT\u003e mosl remained cautious about potential provisioning requirements related to the final expected credit loss ecl guidelines in the public sector banking space despite some headwinds mosl remains optimistic about bob s prospects the brokerage cited the bank s focus on reducing high cost deposits maintaining healthy margins and improving operating efficiency as key factors supporting its positive outlook additionally bobs asset quality has seen substantial improvement with more projected by fy27 mosl concluded that these factors position bob well for future growth despite short term challenges in the deposit market","timestamp":"2024-09-30T12:25:00+05:30","market_timestamp":"2024-09-30T12:25:00+05:30","off_market_hours":false}