{"url":"https://www.livemint.com/market/stock-market-news/sebi-mandates-framework-for-indias-booming-derivates-market-steps-announced-to-curb-rush-in-f-o-trading-11727790774627.html","title":"SEBI mandates framework for India’s booming derivates market; steps announced to curb rush in F\u0026O trading","description":"SEBI mandates framework for India's booming derivates market; steps announced to curb rush in F\u0026O trading","content":"The capital market regulator on Tuesday implemented six out of seven measures recommended by an expert panel to cool the exuberance in India's derivatives market, where countless investors chasing easy money have burned their fingers over the years.Market participants said the measures, which will be implemented in a phased manner, could dent derivatives volumes by 20-30%. Out of the six, the ones which could impact volumes the most are the reduction in weekly expiries per exchange from five to just one; increase in lot size to  ₹15-20 lakh from  ₹5-10 lakh; and the removal of calendar spread benefit on expiry day. The first two will take effect on 20 November, and the third on 1 February 2025, a circular issued by the Securities and Exchange Board of India (Sebi) showed.The other three measures include intra-day monitoring of position limits effective 1 April 2025 to ensure that the position limit per client is not exceeded during a trading session; upfront collection of option premia from buyers from 1 February 2025; and the increase in extreme loss margin on the day of expiry from 20 November.\"There will be an overall 20-30% dent in volumes consequent to the implementation of these measures,\" said Rajesh Baheti, MD of Crosseas Capital, one of India's largest arbitrage and jobbing firms.Agreed Jimeet Modi , founder of Samco Securities. \"The measures could result in a moderation of 20% at least and more over time,\" he said.On reducing weekly expiry to just one each per exchange, market veterans were divided. While R. Venkataraman, chairman of IIFL Securities, deems this as having maximum impact on volume moderation, Dhiraj Relli, MD \u0026 CEO of HDFC Securities, said volumes from other weekly products will shift to the one expiry chosen by NSE and BSE, likely to be Nifty and Sensex options.The lot size increase is expected to temper the sale of index options and futures contracts on the likes of Nifty and Bank Nifty or Sensex. Since the lot size value has risen by around two to three times, those selling nine options in the past will sell three now, as the margin to sell will rise concomitantly. For instance, to sell one Nifty futures or options contract, the margin is  ₹75,000-1 lakh. If the lot size rises by three times, the margin rises proportionately.\"Normally options are sold, and futures are bought and sold by traders with deeper pockets,\" said a broker. They will not stop selling but the quantum of options sold will go down.\"The Sebi circular was released on the first day of an increase in securities transaction tax by 60% for derivatives.Buyers of options have to pay a premium to a seller for a call or put option. While most big brokers now collect premium upfront, others collect it at the end of the day or on the next day against collateral (stocks) kept with them by clients. The Sebi rule now specifies that the premium should be collected upfront.One measure proposed on tail risk has been diluted. The experts' group had proposed raising the extreme loss margin (ELM) by 3% a day before expiry and 5% on the day of expiry. This has been diluted to a 2% rise on the day of expiry. On a futures buy or sell or an option sell, the margin is composed SPAN (Standard Portfolio Analysis of Risk) of around 10% and ELM of 2%. The committee had proposed to increase the total margin to 20%, but now it will rise by 14% on the day of expiry.Monitoring of position limits would stop brokers from giving certain clients extra leverage during intra-day trading of options or futures. This will prevent any systemic risk from building up, as the broker will have to ensure that the notional position limit per client is not breached during the day.Calendar spread benefit meant that on expiry day, a client not having enough margin to sell Nifty or Sensex options would sell in the current expiry, and buy the same options in the next expiry. This would reduce the margin needed to be placed to sell the options in the current expiry as the purchase of same options in the next weekly expiry would effectively become a hedged position.But that benefit has now been changed to prevent systemic risk in the event of sudden adverse movement of markets on expiry day.These are not the end of measures though. Crosseas' Baheti believes that the next measure to curb retail participation will be a product suitability framework stipulating an income or net worth threshold for trading in derivatives.A Sebi study released on 23 September revealed that 93% of over 10 million individual F\u0026O traders on average lost  ₹2 lakh each ( ₹1.8 trillion in aggregate), inclusive of transaction charges, in the three years through FY24. Over 75% of these traders declared an annual income of less than  ₹5 lakh in FY24. More than 75% of loss-makers continued trading in F\u0026O.","cleaned_content":"the capital market regulator on tuesday implemented six out of seven measures recommended by an expert panel to cool the exuberance in indias derivatives market where countless investors chasing easy money have burned their fingers over the years market participants said the measures which will be implemented in a phased manner could dent derivatives volumes by \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e out of the six the ones which could impact volumes the most are the reduction in weekly expiries per exchange from five to just one increase in lot size to \u003cONE_TEN\u003e \u003cTWO_TEN\u003e lakh from \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh and the removal of calendar spread benefit on expiry day the first two will take effect on \u003cTWO_TEN\u003e november and the third on \u003cONE_\u003e february \u003cTWO_THOUSAND\u003e a circular issued by the securities and exchange board of india sebi showed the other three measures include intra day monitoring of position limits effective \u003cONE_\u003e april \u003cTWO_THOUSAND\u003e to ensure that the position limit per client is not exceeded during a trading session upfront collection of option premia from buyers from \u003cONE_\u003e february \u003cTWO_THOUSAND\u003e and the increase in extreme loss margin on the day of expiry from \u003cTWO_TEN\u003e november there will be an overall \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e dent in volumes consequent to the implementation of these measures said rajesh baheti md of crosseas capital one of indias largest arbitrage and jobbing firms agreed jimeet modi founder of samco securities the measures could result in a moderation of \u003cTWO_TEN_PERCENT\u003e at least and more over time he said on reducing weekly expiry to just one each per exchange market veterans were divided while r venkataraman chairman of iifl securities deems this as having maximum impact on volume moderation dhiraj relli md ceo of hdfc securities said volumes from other weekly products will shift to the one expiry chosen by nse and bse likely to be nifty and sensex options the lot size increase is expected to temper the sale of index options and futures contracts on the likes of nifty and bank nifty or sensex since the lot size value has risen by around two to three times those selling nine options in the past will sell three now as the margin to sell will rise concomitantly for instance to sell one nifty futures or options contract the margin is \u003cSEVEN_TEN_THOUSAND\u003e \u003cONE_\u003e lakh if the lot size rises by three times the margin rises proportionately normally options are sold and futures are bought and sold by traders with deeper pockets said a broker they will not stop selling but the quantum of options sold will go down the sebi circular was released on the first day of an increase in securities transaction tax by \u003cSIX_TEN_PERCENT\u003e for derivatives buyers of options have to pay a premium to a seller for a call or put option while most big brokers now collect premium upfront others collect it at the end of the day or on the next day against collateral stocks kept with them by clients the sebi rule now specifies that the premium should be collected upfront one measure proposed on tail risk has been diluted the experts group had proposed raising the extreme loss margin elm by \u003cTHREE_PERCENT\u003e a day before expiry and \u003cFIVE_PERCENT\u003e on the day of expiry this has been diluted to a \u003cTWO_PERCENT\u003e rise on the day of expiry on a futures buy or sell or an option sell the margin is composed span standard portfolio analysis of risk of around \u003cONE_TEN_PERCENT\u003e and elm of \u003cTWO_PERCENT\u003e the committee had proposed to increase the total margin to \u003cTWO_TEN_PERCENT\u003e but now it will rise by \u003cONE_TEN_PERCENT\u003e on the day of expiry monitoring of position limits would stop brokers from giving certain clients extra leverage during intra day trading of options or futures this will prevent any systemic risk from building up as the broker will have to ensure that the notional position limit per client is not breached during the day calendar spread benefit meant that on expiry day a client not having enough margin to sell nifty or sensex options would sell in the current expiry and buy the same options in the next expiry this would reduce the margin needed to be placed to sell the options in the current expiry as the purchase of same options in the next weekly expiry would effectively become a hedged position but that benefit has now been changed to prevent systemic risk in the event of sudden adverse movement of markets on expiry day these are not the end of measures though crosseas baheti believes that the next measure to curb retail participation will be a product suitability framework stipulating an income or net worth threshold for trading in derivatives a sebi study released on \u003cTWO_TEN\u003e september revealed that \u003cNINE_TEN_PERCENT\u003e of over \u003cONE_TEN\u003e million individual f o traders on average lost \u003cTWO_\u003e lakh each \u003cONE_\u003e trillion in aggregate inclusive of transaction charges in the three years through fy24 over \u003cSEVEN_TEN_PERCENT\u003e of these traders declared an annual income of less than \u003cFIVE_\u003e lakh in fy24 more than \u003cSEVEN_TEN_PERCENT\u003e of loss makers continued trading in f o","timestamp":"2024-10-02T09:08:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}