{"url":"https://www.livemint.com/market/stock-market-news/vedanta-shares-jump-3-to-touch-record-high-up-100-in-cy24-rally-to-continue-11727410295050.html","title":"Vedanta shares jump 3% to touch record high, up 100% in CY24. Rally to continue?","description":"Vedanta's shares rose 3 per cent to an all-time high of  ₹515.90, marking a 15 per cent gain over five days, driven by China's economic measures and US rate cuts. Analysts suggest targeting  ₹532, with key support at  ₹487.","content":"Shares of mining giant Vedanta maintained their remarkable upward momentum on Friday, achieving gains for the fifth consecutive trading session. The stock jumped by an additional 3 per cent today, hitting a new all-time high of  ₹515.90 per share.In addition to Vedanta, metal stocks are continuing to surge upward steadily as positive developments from China and rate cuts announced by global central banks have prompted investors to flock to metal counters. China's recent implementation of policy measures, including a cut in the reverse repo rate, aimed at bolstering its economy to achieve a growth target of around 5 per cent for the year.Additionally, aggressive rate cuts by the US Federal Reserve have further contributed to rising metal prices, creating a favourable market environment for metal companies. These developments have pushed the prices of industrial metals like aluminum, copper, and nickel to multi-month highs in recent sessions.As the world's largest consumer of base metals, accounting for approximately 50 per cent of global output, any revival in China's domestic demand is likely to have a significant impact on the base metals market.aThis recent rally has propelled the stock to a 100 per cent gain for the year, breaking a two-calendar-year trend of weak performance. Sumeet Bagadia, Executive Director at Choice Broking, anticipates that the stock will continue its upward trajectory, targeting  ₹532 in the short term.\"The Relative Strength Index (RSI) stands at 76.46, reflecting strong bullish strength. Despite this, VEDL is trading comfortably above its key 20-day, 50-day, and 200-day Exponential Moving Averages (EMA), reinforcing the positive trend. If the stock sustains above the critical resistance level of  ₹510, it presents a favourable long trading opportunity. Investors may consider entering a long position with a target price of  ₹532, while maintaining a stop loss at  ₹487 to manage risk effectively. Proper risk management is crucial to protect against potential downside, given the elevated RSI and the possibility of short-term volatility,\" Sumeet Bagadia said.The company said on Wednesday (September 25) that its board will meet on October 8 to consider and approve the fourth interim dividend for 2024-25. The record date for determining the entitlement of the equity shareholders for the fourth dividend, if declared, is October 16, 2024, the company said in an exchange filing.So far, the company has approved a total dividend of  ₹13,474 crore for 2024–25.On the capex front, the company is set to execute around USD 8 billion in growth capex over the next few years, reflecting its ambitious expansion plans across multiple sectors. Management aims to ramp up oil and gas production to 300,000 barrels per day, while the iron ore business in Liberia is expected to yield approximately 30 million tonnes per year (mtpa).Notably, the BALCO expansion is projected to be commissioned in the fourth quarter of FY25--a slight delay from the earlier forecast of 3QFY25--with operations anticipated to begin in the first quarter of FY26.Additionally, the Radhikapur coal block secured environmental clearance and stage 1 forest clearances and is likely to commence operations by 4QFY25. Similarly, the Kurloi coal mine block is progressing well and is expected to be operational by 4QFY25, while the Ghograpalli mine is set to be fully operational in FY26, said domestic brokerage firm Motilal Oswal.In terms of renewable energy, the brokerage said the company has begun utilising energy from its RE-RTC (renewable energy round-the-clock) projects, with Hindustan Zinc achieving an 8.5 per cent renewable power share in the first quarter of FY25.Looking ahead, the company has set a target of delivering USD 10 billion in EBITDA in the near term. Of this, the aluminum business is expected to contribute USD 4 billion, Zinc India around USD 2.7 billion, and the oil and gas segment USD 1 billion. The remainder will come from the company’s iron ore, steel, power, and other business segments, highlighting its diverse revenue streams and strong growth potential across industries.","cleaned_content":"shares of mining giant vedanta maintained their remarkable upward momentum on friday achieving gains for the fifth consecutive trading session the stock jumped by an additional \u003cTHREE_PERCENT\u003e today hitting a new all time high of \u003cFIVE_HUNDRED\u003e per share in addition to vedanta metal stocks are continuing to surge upward steadily as positive developments from china and rate cuts announced by global central banks have prompted investors to flock to metal counters chinas recent implementation of policy measures including a cut in the reverse repo rate aimed at bolstering its economy to achieve a growth target of around \u003cFIVE_PERCENT\u003e for the year additionally aggressive rate cuts by the us federal reserve have further contributed to rising metal prices creating a favourable market environment for metal companies these developments have pushed the prices of industrial metals like aluminum copper and nickel to multi month highs in recent sessions as the worlds largest consumer of base metals accounting for approximately \u003cFIVE_TEN_PERCENT\u003e of global output any revival in chinas domestic demand is likely to have a significant impact on the base metals market athis recent rally has propelled the stock to a \u003cONE_HUNDRED_PERCENT\u003e gain for the year breaking a two calendar year trend of weak performance sumeet bagadia executive director at choice broking anticipates that the stock will continue its upward trajectory targeting \u003cFIVE_HUNDRED\u003e in the short term the relative strength index rsi stands at \u003cSEVEN_TEN\u003e reflecting strong bullish strength despite this vedl is trading comfortably above its key \u003cTWO_TEN\u003e day \u003cFIVE_TEN\u003e day and \u003cTWO_HUNDRED\u003e day exponential moving averages ema reinforcing the positive trend if the stock sustains above the critical resistance level of \u003cFIVE_HUNDRED\u003e it presents a favourable long trading opportunity investors may consider entering a long position with a target price of \u003cFIVE_HUNDRED\u003e while maintaining a stop loss at \u003cFOUR_HUNDRED\u003e to manage risk effectively proper risk management is crucial to protect against potential downside given the elevated rsi and the possibility of short term volatility sumeet bagadia said the company said on wednesday september \u003cTWO_TEN\u003e that its board will meet on october \u003cEIGHT_\u003e to consider and approve the fourth interim dividend for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the record date for determining the entitlement of the equity shareholders for the fourth dividend if declared is october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company said in an exchange filing so far the company has approved a total dividend of \u003cONE_TEN_THOUSAND\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e on the capex front the company is set to execute around usd \u003cEIGHT_\u003e billion in growth capex over the next few years reflecting its ambitious expansion plans across multiple sectors management aims to ramp up oil and gas production to \u003cTHREE_HUNDRED_THOUSAND\u003e barrels per day while the iron ore business in liberia is expected to yield approximately \u003cTHREE_TEN\u003e million tonnes per year mtpa notably the balco expansion is projected to be commissioned in the fourth quarter of fy25 a slight delay from the earlier forecast of \u003cTHREE_\u003e qfy25 with operations anticipated to begin in the first quarter of fy26 additionally the radhikapur coal block secured environmental clearance and stage \u003cONE_\u003e forest clearances and is likely to commence operations by \u003cFOUR_\u003e qfy25 similarly the kurloi coal mine block is progressing well and is expected to be operational by \u003cFOUR_\u003e qfy25 while the ghograpalli mine is set to be fully operational in fy26 said domestic brokerage firm motilal oswal in terms of renewable energy the brokerage said the company has begun utilising energy from its re rtc renewable energy round the clock projects with hindustan zinc achieving an \u003cEIGHT_PERCENT\u003e renewable power share in the first quarter of fy25 looking ahead the company has set a target of delivering usd \u003cONE_TEN\u003e billion in ebitda in the near term of this the aluminum business is expected to contribute usd \u003cFOUR_\u003e billion zinc india around usd \u003cTWO_\u003e billion and the oil and gas segment usd \u003cONE_\u003e billion the remainder will come from the company s iron ore steel power and other business segments highlighting its diverse revenue streams and strong growth potential across industries","timestamp":"2024-09-27T10:33:00+05:30","market_timestamp":"2024-09-27T10:33:00+05:30","off_market_hours":false}