{"url":"https://www.livemint.com/market/stock-market-news/treasury-market-closes-in-on-historic-five-month-winning-streak-11727714921510.html","title":"Treasury Market Closes In on Historic Five-Month Winning Streak","description":"US government bonds are on track to end September with a historic fifth-straight monthly gain even as bond traders pared slightly the amount of Federal Reserve easing they consider likely over the next year.","content":"US government bonds are on track to end September with a historic fifth-straight monthly gain even as bond traders pared slightly the amount of Federal Reserve easing they consider likely over the next year.Ahead of a speech by Fed Chair Jerome Powell later Monday, short-maturity yields in particular moved higher, signifying some erosion in confidence that the central bank will deliver another half-point interest-rate cut in the next few months. That conviction will be tested this week by the first major economic reports for September, including the employment report on Oct. 4.Still, Treasury debt returned 1.4% through Friday, as measured by the Bloomberg US Treasury Total Return Index. If sustained, it will be the market’s longest streak of monthly gains since 2010. After climbing during the first several months of the year as sticky inflation data eroded expectations for Fed rate cuts, yields in April began a descent that converted losses into a 4.1% year-to-date gain.Calling the rally “impressive,” Gregory Faranello, head of US rates trading and strategy for AmeriVet Securities said the sustained run from April reflected “better inflation and slowing job growth.” He said “being more nimble at these levels” makes sense given the extent of rate cuts anticipated by the market.Swap contracts that predict the outcome of future Fed meetings price in just over a percentage point of cumulative easing by the end of January and close to two percentage points over the next 12 months. The half-point cut on Sept. 18 set the target range for the federal funds rate at 4.75% to 5%.To some, that looks excessive. Speaking Monday, Fed Governor Michelle Bowman reiterated that inflation remains “uncomfortably” above the central bank’s 2% target, supporting the case for a “measured” approach to lowering interest rates. Powell is slated to deliver remarks at a National Association for Business Economics meeting at 1:55pm New York time.In cutting rates against that backdrop, Fed policymakers said they were trying to head off further weakness in employment. This week’s labor-market data — culminating Friday with the September jobs report — also include the JOLTS job openings gauge Tuesday, the ADP private-sector hiring data Wednesday, and employment gauges in the ISM reports on the manufacturing and services sectors.For Friday’s report, economists’ median estimate is a 146,000 increase in nonfarm jobs and no change in the 4.2% unemployment rate, according to a Bloomberg survey.“If we can keep having 100k-plus monthly jobs reports, we will continue to be in a soft-landing regime,” said John Hancock Investment Management co-chief investment strategists, Emily Roland and Matt Miskin in a note Monday.Monday’s rise in yields was concentrated in short maturities, leaving 30-year yields only slightly higher on the day. That’s in contrast to the dominant trend since mid-September, in which long-maturity yields rose more.It “may be just a culling of long positions put on from overly-aggressive implied Fed policy levels,” said John Brady, managing director at RJ O’Brien. “The market, in other words, is going to need a new impetus to move to richer yields,” and “may be a bit extended going into a big week of data.”This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"us government bonds are on track to end september with a historic fifth straight monthly gain even as bond traders pared slightly the amount of federal reserve easing they consider likely over the next year ahead of a speech by fed chair jerome powell later monday short maturity yields in particular moved higher signifying some erosion in confidence that the central bank will deliver another half point interest rate cut in the next few months that conviction will be tested this week by the first major economic reports for september including the employment report on oct \u003cFOUR_\u003e still treasury debt returned \u003cONE_PERCENT\u003e through friday as measured by the bloomberg us treasury total return index if sustained it will be the market s longest streak of monthly gains since \u003cTWO_THOUSAND\u003e after climbing during the first several months of the year as sticky inflation data eroded expectations for fed rate cuts yields in april began a descent that converted losses into a \u003cFOUR_PERCENT\u003e year to date gain calling the rally impressive gregory faranello head of us rates trading and strategy for amerivet securities said the sustained run from april reflected better inflation and slowing job growth he said being more nimble at these levels makes sense given the extent of rate cuts anticipated by the market swap contracts that predict the outcome of future fed meetings price in just over a percentage point of cumulative easing by the end of january and close to two percentage points over the next \u003cONE_TEN\u003e months the half point cut on sept \u003cONE_TEN\u003e set the target range for the federal funds rate at \u003cFOUR_PERCENT\u003e to \u003cFIVE_PERCENT\u003e to some that looks excessive speaking monday fed governor michelle bowman reiterated that inflation remains uncomfortably above the central bank s \u003cTWO_PERCENT\u003e target supporting the case for a measured approach to lowering interest rates powell is slated to deliver remarks at a national association for business economics meeting at \u003cONE_\u003e \u003cFIVE_TEN\u003e pm new york time in cutting rates against that backdrop fed policymakers said they were trying to head off further weakness in employment this week s labor market data culminating friday with the september jobs report also include the jolts job openings gauge tuesday the adp private sector hiring data wednesday and employment gauges in the ism reports on the manufacturing and services sectors for friday s report economists median estimate is a \u003cONE_HUNDRED_THOUSAND\u003e increase in nonfarm jobs and no change in the \u003cFOUR_PERCENT\u003e unemployment rate according to a bloomberg survey if we can keep having \u003cONE_HUNDRED\u003e k plus monthly jobs reports we will continue to be in a soft landing regime said john hancock investment management co chief investment strategists emily roland and matt miskin in a note monday monday s rise in yields was concentrated in short maturities leaving \u003cTHREE_TEN\u003e year yields only slightly higher on the day that s in contrast to the dominant trend since mid september in which long maturity yields rose more it may be just a culling of long positions put on from overly aggressive implied fed policy levels said john brady managing director at rj o brien the market in other words is going to need a new impetus to move to richer yields and may be a bit extended going into a big week of data this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-09-30T22:18:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}