{"url":"https://www.livemint.com/market/stock-market-news/abans-holdings-shares-aditya-birla-money-estimates-small-cap-stock-to-give-multibagger-returns-buy-or-avoid-11727161033775.html","title":"Abans Holdings shares: Aditya Birla Money estimates small-cap stock to give multibagger returns. Buy or avoid?","description":"Abans Holdings share price has fallen over 10% in the past one week and has dropped more than 40% in one month. The smallcap stock is down over 25% in three months.","content":"Abans Holdings share price is trading at a discount to its peers and has the potential to nearly double, or see up to 98% upside, according to brokerage firm Aditya Birla Money.Aditya Birla Money has recommended a ‘Buy’ rating for Abans Holdings shares with a target price of  ₹710 apiece, implying an upside potential of over 98% from Monday’s closing price.Abans Holdings is a global asset management firm with a diverse range of services, including institutional broking, financial lending, treasury operations, and remittance services.Aditya Birla Money anticipates Abans Holdings earnings to likely grow at a CAGR of 25% over the FY24-26. Given Abans Holdings’ strong positioning and diversification, the company is well-placed to benefit from growth opportunities both in India and internationally.It believes the recent correction in Abans Holdings share price has given a good opportunity to take position as there are no change in fundamentals which lead to sharp correction. Abans Holdings shares have declined significantly by 44% from its 52-week high of  ₹625 apiece hit on August 22, 2024.“Abans Holdings is well-positioned with diversified financial assistance across various asset classes, offering a comprehensive range of services that distinguishes it from its peers. India’s investable surplus is growing at least 11% YoY, considering nominal GDP growth rate of 11%, but the number of asset managers to handle this surplus remains limited. The company also has global investors, a unique feature for a listed wealth management firm in India,” Aditya Birla Money said.Currently, Abans Holdings stock trades at 15x FY26 earnings, which is at a discount compared to other listed wealth management companies, which are trading between 25-30x FY26 earnings, the brokerage firm noted.Abans Holdings share price has fallen over 10% in the past one week and has dropped more than 40% in one month. The smallcap stock is down over 25% in three months.However, Abans Holdings stock is up more than 12% year-to-date (YTD).At 12:35 pm, Abans Holdings shares were trading 0.99% lower at  ₹354.75 apiece on the BSE with a market capitalization of nearly  ₹1,779 crore.","cleaned_content":"abans holdings share price is trading at a discount to its peers and has the potential to nearly double or see up to \u003cNINE_TEN_PERCENT\u003e upside according to brokerage firm aditya birla money aditya birla money has recommended a buy rating for abans holdings shares with a target price of \u003cSEVEN_HUNDRED\u003e apiece implying an upside potential of over \u003cNINE_TEN_PERCENT\u003e from monday s closing price abans holdings is a global asset management firm with a diverse range of services including institutional broking financial lending treasury operations and remittance services aditya birla money anticipates abans holdings earnings to likely grow at a cagr of \u003cTWO_TEN_PERCENT\u003e over the fy24 \u003cTWO_TEN\u003e given abans holdings strong positioning and diversification the company is well placed to benefit from growth opportunities both in india and internationally it believes the recent correction in abans holdings share price has given a good opportunity to take position as there are no change in fundamentals which lead to sharp correction abans holdings shares have declined significantly by \u003cFOUR_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week high of \u003cSIX_HUNDRED\u003e apiece hit on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e abans holdings is well positioned with diversified financial assistance across various asset classes offering a comprehensive range of services that distinguishes it from its peers india s investable surplus is growing at least \u003cONE_TEN_PERCENT\u003e yoy considering nominal gdp growth rate of \u003cONE_TEN_PERCENT\u003e but the number of asset managers to handle this surplus remains limited the company also has global investors a unique feature for a listed wealth management firm in india aditya birla money said currently abans holdings stock trades at \u003cONE_TEN\u003e x fy26 earnings which is at a discount compared to other listed wealth management companies which are trading between \u003cTWO_TEN\u003e \u003cTHREE_TEN\u003e x fy26 earnings the brokerage firm noted abans holdings share price has fallen over \u003cONE_TEN_PERCENT\u003e in the past one week and has dropped more than \u003cFOUR_TEN_PERCENT\u003e in one month the smallcap stock is down over \u003cTWO_TEN_PERCENT\u003e in three months however abans holdings stock is up more than \u003cONE_TEN_PERCENT\u003e year to date ytd at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e pm abans holdings shares were trading \u003cZERO_PERCENT\u003e lower at \u003cTHREE_HUNDRED\u003e apiece on the bse with a market capitalization of nearly \u003cONE_THOUSAND\u003e crore","timestamp":"2024-09-24T12:37:00+05:30","market_timestamp":"2024-09-24T12:37:00+05:30","off_market_hours":false}