{"url":"https://www.livemint.com/market/stock-market-news/skipper-shares-smallcap-stock-jumps-15-as-axis-securities-initiates-coverage-with-a-buy-sees-44-upside-11727082650048.html","title":"Skipper shares: Smallcap stock jumps 15% as Axis Securities initiates coverage with a ‘Buy’, sees 44% upside","description":"Skipper share price has gained 4% in one month and rallied over 30% in three months. The smallcap stock has given multibagger returns of more than 108% year-to-date (YTD) and over 118% in one year.","content":"Skipper share price jumped over 15% on Monday after brokerage firm Axis Securities initiated coverage on the smallcap stock with a bullish view. Skipper shares rallied as much as 15.67% to a 52-week high of  ₹483.10 apiece on the BSE.Axis Securities has assigned a ‘Buy’ rating on Skipper shares with a March 2026 target price of  ₹600 per share, implying an upside potential of 44% from Friday’s closing price. With the sectorial tailwinds, capacity expansion, robust order book and revenue growth along with expected improvement in margins, the brokerage firm assigned a target P/E multiple of 22x on its FY27 EPS estimates.Skipper is India’s largest and the world’s only integrated Transmission \u0026 Distribution (T\u0026D) company present across the entire transmission chain. The company currently has ~10% - 15% market share in high-voltage transmission lines. Skipper is also a leading brand in the polymer sector in India (pipes and fittings) with a capacity of 62,000 MTPA. It also manufactures Telecom towers and Railway structures.The company operates through three segments - Engineering (68% of FY24 Revenue), Infrastructure (18%) and Polymer (14%).Axis Securities believes Skipper is well-positioned to cater to this growing T\u0026D investment. To cater to the soaring T\u0026D infrastructure demand, Skipper targets to double its capacity from the current 3 Lc tonnes to 6 Lc tonnes over the next 4-5 years with a total Capex of ~ ₹800 crore.Skipper has a healthy order book of  ₹5,844 crore as of June 2024 with 59% domestic T\u0026D orders, 27% Non-T\u0026D orders and 14% export orders. The company also has a strong bidding pipeline of  ₹18,000 crore of which  ₹11,500 crore pertains to international orders. It has an average order-win ratio of 25% of the bid pipeline.The company has the largest Engineering capacity in India at 3,00,000 tonnes and it is currently operating at 90% utilisation. To fulfil robust demand, the company is expanding its capacity by 25% i.e., 75,000 tonnes by Q1FY26. It plans to further increase its capacity by another 75,000 tonnes in FY26.“The additional capacity of 75,000 tonnes by Q1FY26 will contribute to additional revenue of  ₹800 - 1,000 crore in FY26. The management has a strong guidance of 25% revenue CAGR over the next 3 years as the order book stands at 2.1x of the combined revenue of the Engineering and Infrastructure segments in FY24,” Axis Securities said.The company has consistently operated at an EBITDA margin of 9.7% - 9.8% in the last 3 years. On the back of operating leverage from the revenue growth and better product mix (from export orders), the company expects its margins to improve to 10.5% - 11% in the coming years.The brokerage firm models Revenue / EBITDA / PAT CAGR of 25% / 30% / 55% over FY24-27E and models EBITDA margins to improve YoY to 10%, 10.5% and 11% over FY25-27E. The company’s Debt-to-Equity ratio stood at 0.64x as of FY24.Skipper share price has gained 4% in one month and rallied over 30% in three months. The smallcap stock has given multibagger returns of more than 108% year-to-date (YTD) and over 118% in one year.At 2:50 pm, Skipper shares were trading 13.77% higher at  ₹475.15 apiece on the BSE.","cleaned_content":"skipper share price jumped over \u003cONE_TEN_PERCENT\u003e on monday after brokerage firm axis securities initiated coverage on the smallcap stock with a bullish view skipper shares rallied as much as \u003cONE_TEN_PERCENT\u003e to a \u003cFIVE_TEN\u003e week high of \u003cFOUR_HUNDRED\u003e apiece on the bse axis securities has assigned a buy rating on skipper shares with a march \u003cTWO_THOUSAND\u003e target price of \u003cSIX_HUNDRED\u003e per share implying an upside potential of \u003cFOUR_TEN_PERCENT\u003e from friday s closing price with the sectorial tailwinds capacity expansion robust order book and revenue growth along with expected improvement in margins the brokerage firm assigned a target p e multiple of \u003cTWO_TEN\u003e x on its fy27 eps estimates skipper is india s largest and the world s only integrated transmission distribution t d company present across the entire transmission chain the company currently has \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e market share in high voltage transmission lines skipper is also a leading brand in the polymer sector in india pipes and fittings with a capacity of \u003cSIX_TEN_THOUSAND\u003e mtpa it also manufactures telecom towers and railway structures the company operates through three segments engineering \u003cSIX_TEN_PERCENT\u003e of fy24 revenue infrastructure \u003cONE_TEN_PERCENT\u003e and polymer \u003cONE_TEN_PERCENT\u003e axis securities believes skipper is well positioned to cater to this growing t d investment to cater to the soaring t d infrastructure demand skipper targets to double its capacity from the current \u003cTHREE_\u003e lc tonnes to \u003cSIX_\u003e lc tonnes over the next \u003cFOUR_\u003e \u003cFIVE_\u003e years with a total capex of \u003cEIGHT_HUNDRED\u003e crore skipper has a healthy order book of \u003cFIVE_THOUSAND\u003e crore as of june \u003cTWO_THOUSAND\u003e with \u003cFIVE_TEN_PERCENT\u003e domestic t d orders \u003cTWO_TEN_PERCENT\u003e non t d orders and \u003cONE_TEN_PERCENT\u003e export orders the company also has a strong bidding pipeline of \u003cONE_TEN_THOUSAND\u003e crore of which \u003cONE_TEN_THOUSAND\u003e crore pertains to international orders it has an average order win ratio of \u003cTWO_TEN_PERCENT\u003e of the bid pipeline the company has the largest engineering capacity in india at \u003cTHREE_HUNDRED_THOUSAND\u003e tonnes and it is currently operating at \u003cNINE_TEN_PERCENT\u003e utilisation to fulfil robust demand the company is expanding its capacity by \u003cTWO_TEN_PERCENT\u003e i e \u003cSEVEN_TEN_THOUSAND\u003e tonnes by q1fy26 it plans to further increase its capacity by another \u003cSEVEN_TEN_THOUSAND\u003e tonnes in fy26 the additional capacity of \u003cSEVEN_TEN_THOUSAND\u003e tonnes by q1fy26 will contribute to additional revenue of \u003cEIGHT_HUNDRED\u003e \u003cONE_THOUSAND\u003e crore in fy26 the management has a strong guidance of \u003cTWO_TEN_PERCENT\u003e revenue cagr over the next \u003cTHREE_\u003e years as the order book stands at \u003cTWO_\u003e x of the combined revenue of the engineering and infrastructure segments in fy24 axis securities said the company has consistently operated at an ebitda margin of \u003cNINE_PERCENT\u003e \u003cNINE_PERCENT\u003e in the last \u003cTHREE_\u003e years on the back of operating leverage from the revenue growth and better product mix from export orders the company expects its margins to improve to \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e in the coming years the brokerage firm models revenue ebitda pat cagr of \u003cTWO_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e \u003cFIVE_TEN_PERCENT\u003e over fy24 \u003cTWO_TEN\u003e e and models ebitda margins to improve yoy to \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e over fy25 \u003cTWO_TEN\u003e e the company s debt to equity ratio stood at \u003cZERO_\u003e x as of fy24 skipper share price has gained \u003cFOUR_PERCENT\u003e in one month and rallied over \u003cTHREE_TEN_PERCENT\u003e in three months the smallcap stock has given multibagger returns of more than \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and over \u003cONE_HUNDRED_PERCENT\u003e in one year at \u003cTWO_\u003e \u003cFIVE_TEN\u003e pm skipper shares were trading \u003cONE_TEN_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-23T14:54:00+05:30","market_timestamp":"2024-09-23T14:54:00+05:30","off_market_hours":false}