{"url":"https://www.livemint.com/market/stock-market-news/gensol-engineering-stock-rallies-over-7-as-promoter-buys-12-00-shares-from-open-market-now-holds-a-21-17-stake-11727331367005.html","title":"Gensol Engineering stock rallies over 7% as promoter buys 12,000 shares from open market; now holds a 21.17% stake","description":"Gensol shares surged over 7% after promoter Anmol Singh Jaggi acquired 12,000 shares, increasing his stake to 21.17%. The stock has fluctuated significantly in recent months.","content":"Shares of Gensol Engineering surged over 7 percent in intra-day trading on Thursday, September 26, following the announcement that the company's promoter and managing director, Anmol Singh Jaggi, purchased 12,000 shares from the open market. This acquisition increased his stake in the company to 21.17 percent.\"This is for the information of the valued members of the company that previously Mr. Anmol Singh Jaggi (Promoter and Managing Director) holds 80,18,711 (Eighty Lakhs Eighteen Thousand Seven Hundred Eleven) equity shares of the company which is amounting to 21.17 % of the total shareholding of the company. The guidance and trust of the promoters feeds new energy in the company in line with that our One of promoter Mr. Anmol Singh Jaggi has invested more in the company though acquisition of 12,000 (Twelve Thousand) Equity shares of the company through open market operation which increase the stake of him, by 0.0003% in the company,\" Gensol Engineering stated in the exchange filing.The stock climbed as much as 7.3 percent, reaching an intra-day high of  ₹886.55. This upward move comes after nine consecutive days of decline, during which the stock shed 10.3 percent since September 12. Despite recent losses, the stock has risen 25.3 percent over the past year and gained over 5 percent year-to-date in 2024.However, it has experienced a decline of 9 percent in September so far, marking its third consecutive month of losses. Prior to this, the stock fell 5 percent in August and 0.3 percent in July. In the April to June period, the stock showed positive momentum, with increases of 10.3 percent in June, 0.11 percent in May, and 4.2 percent in April. Notably, it faced a significant correction of 25 percent in March. The beginning of the year was also favorable, with the stock rising 2.6 percent in January and 35.7 percent in February.Despite today's jump, the stock remains 35.6 percent below its record high of  ₹1,377.10, reached in February 2024, but has rebounded 39 percent from its 52-week low of  ₹638.11, recorded in October last year.Earlier in September, Gensol Engineering’s board approved a Qualified Institutional Placement (QIP) to raise  ₹750 crore. The company, which specialises in renewable energy, focuses on solar power EPC services and electric mobility solutions.In June, Gensol secured an additional 250 MW/500 MW Battery Energy Storage System (BESS) project from Gujarat Urja Vikas Nigam Limited (GUVNL), bringing its order book in this segment to  ₹3,100 crore. This follows a similar BESS project awarded by GUVNL earlier.","cleaned_content":"shares of gensol engineering surged over \u003cSEVEN_PERCENT\u003e in intra day trading on thursday september \u003cTWO_TEN\u003e following the announcement that the companys promoter and managing director anmol singh jaggi purchased \u003cONE_TEN_THOUSAND\u003e shares from the open market this acquisition increased his stake in the company to \u003cTWO_TEN_PERCENT\u003e this is for the information of the valued members of the company that previously mr anmol singh jaggi promoter and managing director holds \u003cEIGHT_MILLION\u003e eighty lakhs eighteen thousand seven hundred eleven equity shares of the company which is amounting to \u003cTWO_TEN_PERCENT\u003e of the total shareholding of the company the guidance and trust of the promoters feeds new energy in the company in line with that our one of promoter mr anmol singh jaggi has invested more in the company though acquisition of \u003cONE_TEN_THOUSAND\u003e twelve thousand equity shares of the company through open market operation which increase the stake of him by \u003cZERO_PERCENT\u003e in the company gensol engineering stated in the exchange filing the stock climbed as much as \u003cSEVEN_PERCENT\u003e reaching an intra day high of \u003cEIGHT_HUNDRED\u003e this upward move comes after nine consecutive days of decline during which the stock shed \u003cONE_TEN_PERCENT\u003e since september \u003cONE_TEN\u003e despite recent losses the stock has risen \u003cTWO_TEN_PERCENT\u003e over the past year and gained over \u003cFIVE_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e however it has experienced a decline of \u003cNINE_PERCENT\u003e in september so far marking its third consecutive month of losses prior to this the stock fell \u003cFIVE_PERCENT\u003e in august and \u003cZERO_PERCENT\u003e in july in the april to june period the stock showed positive momentum with increases of \u003cONE_TEN_PERCENT\u003e in june \u003cZERO_PERCENT\u003e in may and \u003cFOUR_PERCENT\u003e in april notably it faced a significant correction of \u003cTWO_TEN_PERCENT\u003e in march the beginning of the year was also favorable with the stock rising \u003cTWO_PERCENT\u003e in january and \u003cTHREE_TEN_PERCENT\u003e in february despite todays jump the stock remains \u003cTHREE_TEN_PERCENT\u003e below its record high of \u003cONE_THOUSAND\u003e reached in february \u003cTWO_THOUSAND\u003e but has rebounded \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSIX_HUNDRED\u003e recorded in october last year earlier in september gensol engineering s board approved a qualified institutional placement qip to raise \u003cSEVEN_HUNDRED\u003e crore the company which specialises in renewable energy focuses on solar power epc services and electric mobility solutions in june gensol secured an additional \u003cTWO_HUNDRED\u003e mw \u003cFIVE_HUNDRED\u003e mw battery energy storage system bess project from gujarat urja vikas nigam limited guvnl bringing its order book in this segment to \u003cTHREE_THOUSAND\u003e crore this follows a similar bess project awarded by guvnl earlier","timestamp":"2024-09-26T11:55:00+05:30","market_timestamp":"2024-09-26T11:55:00+05:30","off_market_hours":false}