{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-hdfc-bank-it-stocks-rites-indian-bank-trent-bel-and-more-11727377842681.html","title":"Stocks to Watch: HDFC Bank, IT Stocks, RITES, Indian Bank, Trent, BEL, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"HDFC Bank: HDFC Bank Ltd. has offloaded a housing loan portfolio worth  ₹60 billion ($717 million) as part of its efforts to reduce credit exposure amidst rising regulatory pressures. The portfolio was sold through private deals to around six state-run banks, according to sources familiar with the matter. Additionally, the bank securitized another pool of car loans worth  ₹90.6 billion, structured into pass-through certificates.Godrej Properties: Godrej Properties has announced plans to explore fundraising options, with the board meeting set for October 1 to consider various methods. According to a regulatory filing, options include issuing equity shares and other securities via public offerings, private placements, or rights issues.IT Stocks: Shares of major IT companies like Infosys, TCS, HCL Tech, and Tech Mahindra are expected to be in the spotlight following Accenture's positive revision of its revenue guidance for FY25. The IT consulting and services giant has increased its projected growth rate for FY25 to a range of 3–6 percent, despite missing its FY24 target of 1.5–2.5 percent. Accenture, which operates on a September–August fiscal year, also announced a $4 billion share buyback and exceeded quarterly earnings expectations. This was largely driven by strong demand for its services, particularly those related to generative AI technologies that help businesses enhance their operational efficiency.Prataap Snacks: Authum Investment and Infrastructure, in collaboration with Mahi Madhusudan Kela, has entered into a share purchase agreement to acquire a controlling stake in Prataap Snacks Ltd., according to an exchange filing. The deal involves Authum and Mahi Madhusudan Kela acquiring a 46.85 percent stake in the snack manufacturer from its private equity promoters. Once the transaction is finalized, Authum Investment and Infrastructure will hold a 42.31 percent stake in the company. The total deal value is  ₹846.6 crore, with shares being acquired at  ₹746 per share.NIFTY Rejig: Tata Group's retail arm Trent and state-run Bharat Electronics Limited (BEL) will soon be included in the NIFTY50 index as part of the exchange's semi-annual rejig. These two companies will replace Divi's Laboratories and IT firm LTIMindtree, marking a shift in the index's composition.Railtel: Railtel Corporation has secured a major work order valued at  ₹155 crore. The order was awarded by the Rural Development Department of Mantralaya, Maharashtra, for the operationalization of the ASSK-GP project in regions like Konkan, Pune, and Nashik. Railtel, known for its telecom infrastructure services, will be responsible for the implementation of the project, which involves a significant technological upgrade.Reliance Power: Reliance Power announced that its subsidiary, Rosa Power, has prepaid  ₹850 crore of its outstanding debt to Singapore-based lender Varde Partners. This repayment marks a significant step towards Rosa Power's goal of becoming debt-free. The company expects to clear its remaining debt in the next quarter, targeting full repayment before the end of the current fiscal year.Torrent Pharmaceuticals: Torrent Pharmaceuticals has strongly refuted claims that its Shelcal 500 product failed a quality test conducted by the Central Drug Standards Control Organisation (CDSCO). According to the company’s regulatory filing with the Bombay Stock Exchange (BSE), the allegations pertain to a single batch of Shelcal 500, which was flagged as \"Not of Standard Quality\" (NSQ) in CDSCO’s August 2024 monthly drug alert. Torrent maintains that Shelcal 500 continues to meet all required quality standards.Indian Bank: The board of Indian Bank has approved the raising of  ₹5,000 crore through long-term infrastructure bonds, a move aimed at financing infrastructure projects across various sectors. This new issuance comes in addition to the  ₹5,000 crore already raised by the bank during FY25, highlighting its focus on supporting long-term infrastructure development.RITES: RITES Limited, a government-owned engineering consultancy company, has emerged as the lowest bidder in a competitive tender floated by Delhi Metro Rail Corporation Ltd (DMRC). The contract is valued at  ₹87.58 crore, according to a recent exchange filing. RITES, which leads the consortium, will be responsible for executing the project, further strengthening its position in the urban transport sector.","cleaned_content":"hdfc bank hdfc bank ltd has offloaded a housing loan portfolio worth \u003cSIX_TEN\u003e billion \u003cSEVEN_HUNDRED\u003e million as part of its efforts to reduce credit exposure amidst rising regulatory pressures the portfolio was sold through private deals to around six state run banks according to sources familiar with the matter additionally the bank securitized another pool of car loans worth \u003cNINE_TEN\u003e billion structured into pass through certificates godrej properties godrej properties has announced plans to explore fundraising options with the board meeting set for october \u003cONE_\u003e to consider various methods according to a regulatory filing options include issuing equity shares and other securities via public offerings private placements or rights issues it stocks shares of major it companies like infosys tcs hcl tech and tech mahindra are expected to be in the spotlight following accentures positive revision of its revenue guidance for fy25 the it consulting and services giant has increased its projected growth rate for fy25 to a range of \u003cTHREE_\u003e \u003cSIX_PERCENT\u003e despite missing its fy24 target of \u003cONE_\u003e \u003cTWO_PERCENT\u003e accenture which operates on a september august fiscal year also announced a \u003cFOUR_\u003e billion share buyback and exceeded quarterly earnings expectations this was largely driven by strong demand for its services particularly those related to generative ai technologies that help businesses enhance their operational efficiency prataap snacks authum investment and infrastructure in collaboration with mahi madhusudan kela has entered into a share purchase agreement to acquire a controlling stake in prataap snacks ltd according to an exchange filing the deal involves authum and mahi madhusudan kela acquiring a \u003cFOUR_TEN_PERCENT\u003e stake in the snack manufacturer from its private equity promoters once the transaction is finalized authum investment and infrastructure will hold a \u003cFOUR_TEN_PERCENT\u003e stake in the company the total deal value is \u003cEIGHT_HUNDRED\u003e crore with shares being acquired at \u003cSEVEN_HUNDRED\u003e per share nifty rejig tata groups retail arm trent and state run bharat electronics limited bel will soon be included in the nifty50 index as part of the exchanges semi annual rejig these two companies will replace divis laboratories and it firm ltimindtree marking a shift in the indexs composition railtel railtel corporation has secured a major work order valued at \u003cONE_HUNDRED\u003e crore the order was awarded by the rural development department of mantralaya maharashtra for the operationalization of the assk gp project in regions like konkan pune and nashik railtel known for its telecom infrastructure services will be responsible for the implementation of the project which involves a significant technological upgrade reliance power reliance power announced that its subsidiary rosa power has prepaid \u003cEIGHT_HUNDRED\u003e crore of its outstanding debt to singapore based lender varde partners this repayment marks a significant step towards rosa powers goal of becoming debt free the company expects to clear its remaining debt in the next quarter targeting full repayment before the end of the current fiscal year torrent pharmaceuticals torrent pharmaceuticals has strongly refuted claims that its shelcal \u003cFIVE_HUNDRED\u003e product failed a quality test conducted by the central drug standards control organisation cdsco according to the company s regulatory filing with the bombay stock exchange bse the allegations pertain to a single batch of shelcal \u003cFIVE_HUNDRED\u003e which was flagged as not of standard quality nsq in cdsco s august \u003cTWO_THOUSAND\u003e monthly drug alert torrent maintains that shelcal \u003cFIVE_HUNDRED\u003e continues to meet all required quality standards indian bank the board of indian bank has approved the raising of \u003cFIVE_THOUSAND\u003e crore through long term infrastructure bonds a move aimed at financing infrastructure projects across various sectors this new issuance comes in addition to the \u003cFIVE_THOUSAND\u003e crore already raised by the bank during fy25 highlighting its focus on supporting long term infrastructure development rites rites limited a government owned engineering consultancy company has emerged as the lowest bidder in a competitive tender floated by delhi metro rail corporation ltd dmrc the contract is valued at \u003cEIGHT_TEN\u003e crore according to a recent exchange filing rites which leads the consortium will be responsible for executing the project further strengthening its position in the urban transport sector","timestamp":"2024-09-27T08:27:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}