{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-pc-jeweller-declares-1-10-stock-split-details-here-11727750701866.html","title":"PC Jeweller stock hits 5% upper circuit after announcement of 1:10 stock split","description":"Stock Split 2024: This move by the multibagger stock will increase the total number of PC Jeweller shares from 46.5 crore to 465.4 crore.","content":"Stock Split 2024: Shares of PC Jeweller were locked in the 5 per cent upper circuit on Tuesday, October 1 after the company announced a 1:10 stock split. This was the fourth consecutive session when the stock was locked in the 5 per cent upper circuit.PC Jeweller share price opened at  ₹184.70 apiece today and further extended gains to  ₹186.80, also its 52-week high level.The company in a stock exchange filing on Monday said that the Board of Directors on September 30, 2024, approved the 1:10 stock split to enhance liquidity and make the shares more affordable for retail investors.This move will subdivide each fully paid-up equity share of  ₹10 face value into 10 shares of  ₹1 each, according to the official filing made by the company. As a result, the total number of shares will increase from approximately 46.5 crore to 465.4 crore.PC Jeweller share price has surged 563.12 per cent over the past year and has risen by 246.4 per cent so far in the current calendar year. Over the last three and six months, the stock has delivered impressive multibagger returns of 241.6 per cent and 225 per cent, respectively. In September, the stock rallied 60 per cent. It was trading at its highest level on September 30 since May 2018. The stock had hit a record high of  ₹600.65 on January 16, 2018.The company enjoys a market capitalisation of  ₹8,693.74 crore, as per the data available on BSE.Additionally, the board approved the preferential allotment of 11.5 crore fully convertible warrants on a private placement basis to two promoter group entities—New Track Garments Pvt. Ltd. and Balram Garg (HUF)—at an issue price of  ₹56.20 per warrant. These warrants, convertible into equity shares of the company, will raise  ₹646 crore, with an initial 25 per cent subscription received upfront. The balance 75 per cent of the issue price must be paid by the promoters within 18 months from the date of allotment for full conversion into equity shares​.","cleaned_content":"stock split \u003cTWO_THOUSAND\u003e shares of pc jeweller were locked in the \u003cFIVE_PERCENT\u003e upper circuit on tuesday october \u003cONE_\u003e after the company announced a \u003cONE_\u003e \u003cONE_TEN\u003e stock split this was the fourth consecutive session when the stock was locked in the \u003cFIVE_PERCENT\u003e upper circuit pc jeweller share price opened at \u003cONE_HUNDRED\u003e apiece today and further extended gains to \u003cONE_HUNDRED\u003e also its \u003cFIVE_TEN\u003e week high level the company in a stock exchange filing on monday said that the board of directors on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e approved the \u003cONE_\u003e \u003cONE_TEN\u003e stock split to enhance liquidity and make the shares more affordable for retail investors this move will subdivide each fully paid up equity share of \u003cONE_TEN\u003e face value into \u003cONE_TEN\u003e shares of \u003cONE_\u003e each according to the official filing made by the company as a result the total number of shares will increase from approximately \u003cFOUR_TEN\u003e crore to \u003cFOUR_HUNDRED\u003e crore pc jeweller share price has surged \u003cFIVE_HUNDRED_PERCENT\u003e over the past year and has risen by \u003cTWO_HUNDRED_PERCENT\u003e so far in the current calendar year over the last three and six months the stock has delivered impressive multibagger returns of \u003cTWO_HUNDRED_PERCENT\u003e and \u003cTWO_HUNDRED_PERCENT\u003e respectively in september the stock rallied \u003cSIX_TEN_PERCENT\u003e it was trading at its highest level on september \u003cTHREE_TEN\u003e since may \u003cTWO_THOUSAND\u003e the stock had hit a record high of \u003cSIX_HUNDRED\u003e on january \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company enjoys a market capitalisation of \u003cEIGHT_THOUSAND\u003e crore as per the data available on bse additionally the board approved the preferential allotment of \u003cONE_TEN\u003e crore fully convertible warrants on a private placement basis to two promoter group entities new track garments pvt ltd and balram garg huf at an issue price of \u003cFIVE_TEN\u003e per warrant these warrants convertible into equity shares of the company will raise \u003cSIX_HUNDRED\u003e crore with an initial \u003cTWO_TEN_PERCENT\u003e subscription received upfront the balance \u003cSEVEN_TEN_PERCENT\u003e of the issue price must be paid by the promoters within \u003cONE_TEN\u003e months from the date of allotment for full conversion into equity shares","timestamp":"2024-10-01T08:36:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}