{"url":"https://www.livemint.com/market/stock-market-news/multibagger-small-cap-stock-zaggle-prepaid-shares-rally-over-6-on-acquiring-it-services-company-11727324687248.html","title":"Multibagger small-cap stock Zaggle Prepaid shares rally over 6% on acquiring IT services company","description":"Zaggle Prepaid share price has given significant returns to investors. This smallcap stock has risen more than 27% in one month and over 61% in three months. Zaggle Prepaid stock has given multibagger returns of 105% year-to-date (YTD) and over 155% in one year.","content":"Zaggle Prepaid Ocean Services share price rallied over 6% in early trade on Thursday after the company announced the acquisition of a controlling stake in an information technology services company. The multibagger small-cap stock, Zaggle Prepaid, surged as much as 6.86% to  ₹461.55 apiece on the BSE.The Board of Directors of Zaggle Prepaid Ocean Services on September 25 approved the acquisition of 10,66,314 equity shares at a price of  ₹300.80 per share, constituting 98.32% stake in Span Across IT Solutions Private Limited. The cost of acquisition stands at  ₹32.07 crore.Consequent to this, Span Across will become a subsidiary of Zaggle Prepaid Ocean Services once the procedural requirements are completed.“The proposed acquisition gives an opportunity to enter a new segment of employee related business. Span Across will become a subsidiary company with 98.32% stake and this will help in achieving inorganic growth which will benefit all the stakeholders associated with the Company including shareholders at large,” Zaggle Prepaid Ocean Services said in a stock exchange filing.Span Across reported a turnover of  ₹4.73 crore for the financial year 2023-24.Additionally, the Board of Directors of Zaggle Prepaid Ocean Services also approved an investment of  ₹15.6 crore for 26% ownership capital of Mobileware Technologies Private on a post issue and fully diluted basis.Mobileware is a digital payments infrastructure company and offers an integrated product suite of NPCI certified switch solutions across UPI, IMPS, AEPS \u0026 BBPS, along with an API \u0026 Agency banking platform called Transxt.“Zaggle would be able to leverage their expertise and infrastructure to make our solutions and embedded payment experiences best-in-class for our esteemed clientele. We would also be able to co-create multiple use-cases for our customers while keeping payments at the forefront through Lending stack, Credit solutions, Card Management Services, etc,” Zaggle Prepaid said.Zaggle Prepaid share price has given significant returns to investors. The smallcap stock has risen more than 27% in one month and over 61% in three months. Zaggle Prepaid stock has given multibagger returns of 105% year-to-date (YTD) and over 155% in one year.At 10:00 am, Zaggle Prepaid shares were trading 6.16% higher at  ₹458.50 apiece on the BSE with a market capitalisation of over  ₹5,621 crore.","cleaned_content":"zaggle prepaid ocean services share price rallied over \u003cSIX_PERCENT\u003e in early trade on thursday after the company announced the acquisition of a controlling stake in an information technology services company the multibagger small cap stock zaggle prepaid surged as much as \u003cSIX_PERCENT\u003e to \u003cFOUR_HUNDRED\u003e apiece on the bse the board of directors of zaggle prepaid ocean services on september \u003cTWO_TEN\u003e approved the acquisition of \u003cONE_MILLION\u003e equity shares at a price of \u003cTHREE_HUNDRED\u003e per share constituting \u003cNINE_TEN_PERCENT\u003e stake in span across it solutions private limited the cost of acquisition stands at \u003cTHREE_TEN\u003e crore consequent to this span across will become a subsidiary of zaggle prepaid ocean services once the procedural requirements are completed the proposed acquisition gives an opportunity to enter a new segment of employee related business span across will become a subsidiary company with \u003cNINE_TEN_PERCENT\u003e stake and this will help in achieving inorganic growth which will benefit all the stakeholders associated with the company including shareholders at large zaggle prepaid ocean services said in a stock exchange filing span across reported a turnover of \u003cFOUR_\u003e crore for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e additionally the board of directors of zaggle prepaid ocean services also approved an investment of \u003cONE_TEN\u003e crore for \u003cTWO_TEN_PERCENT\u003e ownership capital of mobileware technologies private on a post issue and fully diluted basis mobileware is a digital payments infrastructure company and offers an integrated product suite of npci certified switch solutions across upi imps aeps bbps along with an api agency banking platform called transxt zaggle would be able to leverage their expertise and infrastructure to make our solutions and embedded payment experiences best in class for our esteemed clientele we would also be able to co create multiple use cases for our customers while keeping payments at the forefront through lending stack credit solutions card management services etc zaggle prepaid said zaggle prepaid share price has given significant returns to investors the smallcap stock has risen more than \u003cTWO_TEN_PERCENT\u003e in one month and over \u003cSIX_TEN_PERCENT\u003e in three months zaggle prepaid stock has given multibagger returns of \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and over \u003cONE_HUNDRED_PERCENT\u003e in one year at \u003cONE_TEN\u003e \u003cZERO_\u003e am zaggle prepaid shares were trading \u003cSIX_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece on the bse with a market capitalisation of over \u003cFIVE_THOUSAND\u003e crore","timestamp":"2024-09-26T10:05:00+05:30","market_timestamp":"2024-09-26T10:05:00+05:30","off_market_hours":false}