{"url":"https://www.livemint.com/market/stock-market-news/mgl-stock-check-mahanagar-gas-rallies-31-in-3-months-outperforms-sensex-by-22-should-you-buy-or-sell-11727791681775.html","title":"MGL stock check: Mahanagar Gas rallies 31% in 3 months, outperforms Sensex by 22%; Should you buy or sell?","description":"MGL stock check: In the last three months, Mahanagar Gas Ltd has provided 19.93 per cent returns to investors against Nifty 50's 7.44 per cent during the period.","content":"MGL stock check: Shares of city gas distributor (CGD) Mahanagar Gas Ltd (MGL) have rallied 31 per cent in the last three months and outperformed the 30-share BSE Sensex by nearly 22 per cent. In the last three months, MGL has provided 19.93 per cent returns to investors against Nifty 50's 7.44 per cent during the period. According to domestic brokerage HDFC Securities, strong volume growth will continue to drive the stock price outperformance.On Tuesday, shares of MGL opened at  ₹1,950 and hit an intra day high of  ₹1,950 against a 52-week high of  ₹1,988.55 before settling 1.40 per cent lower at  ₹1,914.35 apiece on the BSE. The natural gas distributor commands a market capitalization of  ₹18,909.52 crore and a turnover of  ₹3.21 crore.Also Read: MGL, IGL shares jump 6% each after UBS lifts target price, expects over 30% upsideMGL's net profit jumped 7.4 per cent YoY to  ₹285 crore in the first quarter of fiscal 2025, compared with  ₹265 crore over the same period last year. The CGD's revenue rose 1.5 per cent to  ₹1,590 compared to  ₹1,567 crore in the year-ago period. The total sales volume for the quarter stood 2.1 per cent higher on a quarter-on-quarter basis at 3.859 million metric standard cubic meter per day.MGL was incorporated in 1995 and is a natural gas distribution company. MGL is an enterprise of MahaRatna GAIL (India) Limited (Formerly Gas Authority of India Limited) and the Government of Maharashtra. MGL sources natural gas from a diversified base of suppliers for its domestic and industrial customers.Also Read: IGL vs MGL: Which gas stock should you choose for long-term? Here’s a 5-point analysisBrokerage HDFC Securities has raised the target price to  ₹2,320 per share from the earlier target of  ₹2,090 per share based on the natural gas distributer's higher volume growth assumptions in the medium and long term.Valuation: At the current price, MGL is trading at 14.8x Mar-26E EPS, at a 21 per cent premium to its five-year average because of a stronger volume growth outlook. HDFC Securities reiterated its 'BUY' rating on MGL with a revised target price of  ₹2,320 per share.The brokerage anticipates that MGL's robust CNG vehicle registration data, accelerated addition of retail outlets, customer additions in the industrial segment, volume growth contribution from the acquired three GAs of Unison Enviro (UEPL) and competitive CNG price vs petrol/diesel should support strong volume growth of 11 per cent CAGR over FY24-26E.Also Read: IGL stock check: Indraprastha Gas rallies 14% in three months, outperforms Sensex by 5%; Should you buy or sell?D-Street analysts expect MGL's strong volume growth to be sustained, led by the company’s increased focus on expanding the CNG retail network and improving CNG vehicle registrations and additional volumes from the industrial segment. The company is targeting adding ~50 new CNG stations on a standalone basis and another 30 CNG stations in recently acquired Unison GAs in FY25, an increase of almost 20 per cent on a consolidated basis.“Over FY24-26E, we expect a CAGR growth of nine per cent in CNG and 16 per cent in PNG volumes. We estimate MGL volumes at 4.1/4.4mmscmd for FY25/26E, a +11 per cent CAGR volume growth over FY24-26E, compared to 4.8 per cent volume growth CAGR seen over FY18-23,” said HDFC Securities.Also Read: Mahanagar Gas share price rises 5% following CNG, PNG price hikes in Mumbai. Should you Buy, Sell or Hold the stock?\"With the pricing power that the company enjoys, we expect MGL’s EBITDA margin to remain strong at  ₹12 per scm in FY25/26 despite the potential shortfall in the APM gas supply,\" added the domestic brokerage.The recent Vahan data shows a 37 per cent YoY growth in new CNG vehicle registrations in MGL’s core GAs for FY25YTD to 31,091 over Apr-Aug 2024 from 22,782 vehicles over Apr-Aug 2023. The new CNG vehicle registrations for Aug 2024 were at 6,972, up by 21 per cent YoY. HDFC Securities expects the competitiveness of CNG against petrol/diesel in Mumbai and the increasing footprint of retail outlets to continue to support vehicle conversions to CNG.","cleaned_content":"mgl stock check shares of city gas distributor cgd mahanagar gas ltd mgl have rallied \u003cTHREE_TEN_PERCENT\u003e in the last three months and outperformed the \u003cTHREE_TEN\u003e share bse sensex by nearly \u003cTWO_TEN_PERCENT\u003e in the last three months mgl has provided \u003cONE_TEN_PERCENT\u003e returns to investors against nifty \u003cFIVE_TEN\u003e s \u003cSEVEN_PERCENT\u003e during the period according to domestic brokerage hdfc securities strong volume growth will continue to drive the stock price outperformance on tuesday shares of mgl opened at \u003cONE_THOUSAND\u003e and hit an intra day high of \u003cONE_THOUSAND\u003e against a \u003cFIVE_TEN\u003e week high of \u003cONE_THOUSAND\u003e before settling \u003cONE_PERCENT\u003e lower at \u003cONE_THOUSAND\u003e apiece on the bse the natural gas distributor commands a market capitalization of \u003cONE_TEN_THOUSAND\u003e crore and a turnover of \u003cTHREE_\u003e crore also read mgl igl shares jump \u003cSIX_PERCENT\u003e each after ubs lifts target price expects over \u003cTHREE_TEN_PERCENT\u003e upsidemgls net profit jumped \u003cSEVEN_PERCENT\u003e yoy to \u003cTWO_HUNDRED\u003e crore in the first quarter of fiscal \u003cTWO_THOUSAND\u003e compared with \u003cTWO_HUNDRED\u003e crore over the same period last year the cgds revenue rose \u003cONE_PERCENT\u003e to \u003cONE_THOUSAND\u003e compared to \u003cONE_THOUSAND\u003e crore in the year ago period the total sales volume for the quarter stood \u003cTWO_PERCENT\u003e higher on a quarter on quarter basis at \u003cTHREE_\u003e million metric standard cubic meter per day mgl was incorporated in \u003cONE_THOUSAND\u003e and is a natural gas distribution company mgl is an enterprise of maharatna gail india limited formerly gas authority of india limited and the government of maharashtra mgl sources natural gas from a diversified base of suppliers for its domestic and industrial customers also read igl vs mgl which gas stock should you choose for long term here s a \u003cFIVE_\u003e point analysisbrokerage hdfc securities has raised the target price to \u003cTWO_THOUSAND\u003e per share from the earlier target of \u003cTWO_THOUSAND\u003e per share based on the natural gas distributers higher volume growth assumptions in the medium and long term valuation at the current price mgl is trading at \u003cONE_TEN\u003e x mar \u003cTWO_TEN\u003e e eps at a \u003cTWO_TEN_PERCENT\u003e premium to its five year average because of a stronger volume growth outlook hdfc securities reiterated its buy rating on mgl with a revised target price of \u003cTWO_THOUSAND\u003e per share the brokerage anticipates that mgls robust cng vehicle registration data accelerated addition of retail outlets customer additions in the industrial segment volume growth contribution from the acquired three gas of unison enviro uepl and competitive cng price vs petrol diesel should support strong volume growth of \u003cONE_TEN_PERCENT\u003e cagr over fy24 \u003cTWO_TEN\u003e e also read igl stock check indraprastha gas rallies \u003cONE_TEN_PERCENT\u003e in three months outperforms sensex by \u003cFIVE_PERCENT\u003e should you buy or sell d street analysts expect mgls strong volume growth to be sustained led by the company s increased focus on expanding the cng retail network and improving cng vehicle registrations and additional volumes from the industrial segment the company is targeting adding \u003cFIVE_TEN\u003e new cng stations on a standalone basis and another \u003cTHREE_TEN\u003e cng stations in recently acquired unison gas in fy25 an increase of almost \u003cTWO_TEN_PERCENT\u003e on a consolidated basis over fy24 \u003cTWO_TEN\u003e e we expect a cagr growth of nine per cent in cng and \u003cONE_TEN_PERCENT\u003e in png volumes we estimate mgl volumes at \u003cFOUR_\u003e \u003cFOUR_\u003e mmscmd for fy25 \u003cTWO_TEN\u003e e a \u003cONE_TEN_PERCENT\u003e cagr volume growth over fy24 \u003cTWO_TEN\u003e e compared to \u003cFOUR_PERCENT\u003e volume growth cagr seen over fy18 \u003cTWO_TEN\u003e said hdfc securities also read mahanagar gas share price rises \u003cFIVE_PERCENT\u003e following cng png price hikes in mumbai should you buy sell or hold the stock with the pricing power that the company enjoys we expect mgl s ebitda margin to remain strong at \u003cONE_TEN\u003e per scm in fy25 \u003cTWO_TEN\u003e despite the potential shortfall in the apm gas supply added the domestic brokerage the recent vahan data shows a \u003cTHREE_TEN_PERCENT\u003e yoy growth in new cng vehicle registrations in mgl s core gas for fy25ytd to \u003cTHREE_TEN_THOUSAND\u003e over apr aug \u003cTWO_THOUSAND\u003e from \u003cTWO_TEN_THOUSAND\u003e vehicles over apr aug \u003cTWO_THOUSAND\u003e the new cng vehicle registrations for aug \u003cTWO_THOUSAND\u003e were at \u003cSIX_THOUSAND\u003e up by \u003cTWO_TEN_PERCENT\u003e yoy hdfc securities expects the competitiveness of cng against petrol diesel in mumbai and the increasing footprint of retail outlets to continue to support vehicle conversions to cng","timestamp":"2024-10-01T19:39:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}