{"url":"https://www.livemint.com/market/stock-market-news/yes-bank-shares-decline-following-q2-business-update-deposits-and-advances-show-steady-growth-lcr-declines-11727932567285.html","title":"Yes Bank shares decline following Q2 business update: Deposits and advances show steady growth, LCR declines","description":"Yes Bank's shares dropped following its Q2 update, showing strong YoY growth in deposits and advances but a decline in liquidity coverage ratio. Despite steady performance, concerns over liquidity and credit-deposit ratio affected investor sentiment.","content":"Shares of Yes Bank fell in trading on Thursday after the private sector lender released its business update for the September quarter (Q2). The bank reported strong growth in both deposits and advances year-on-year (YoY) but noted a sequential decline in its liquidity coverage ratio (LCR), which dampened investor sentiment.In its update, Yes Bank highlighted an 18.3 percent YoY increase in total deposits for the September quarter, reaching  ₹2,77,173 crore compared to  ₹2,34,360 crore in the corresponding quarter last year. However, this was a slight moderation compared to the 20.9 percent YoY growth in deposits that the bank reported in the June quarter. Sequentially, deposits grew by 4.6 percent from the June quarter, showing a steady but slower pace of growth.On the advances side, Yes Bank reported a 13.1 percent YoY rise in loans and advances, which amounted to  ₹2,36,512 crore, compared to  ₹2,09,106 crore in the same quarter last year. This growth, while healthy, was lower than the 14.8 percent YoY increase in advances reported during the June quarter. Sequentially, advances were up 3 percent over the  ₹2,29,565 crore reported in the June quarter, indicating consistent performance but slightly slowing momentum.Yes Bank also shared an improvement in its Current Account and Savings Account (CASA) deposits, which rose 28.4 percent YoY to  ₹88,559 crore. Sequentially, CASA deposits were up 8.6 percent from the June quarter. The CASA ratio, an important metric for evaluating a bank's cost of funds, improved to 32 percent, up from 29.4 percent in the same period last year and 30.8 percent in the June quarter. This improvement reflects Yes Bank’s focus on growing its low-cost deposit base.One area of concern was the bank's liquidity coverage ratio (LCR), which declined to 131.9 percent in Q2 from 137.8 percent in the June quarter. While the LCR was higher than the 120.9 percent recorded in the same quarter last year, the sequential drop raised eyebrows among investors. A lower LCR suggests that the bank's liquidity buffer has slightly diminished, which may impact its ability to meet short-term obligations.The bank’s credit-to-deposit (C-D) ratio, another key measure of banking efficiency, stood at 85.3 percent in the September quarter, lower than the 86.6 percent reported in the June quarter and 89.2 percent in the same period last year. A lower C-D ratio indicates that the bank is lending out a smaller portion of its deposits, which may suggest caution in its lending strategy or underutilization of resources.The stock fell as much as 1.6 percent to its intra-day low of  ₹22.05. It is now 33 percent away from its 52-week high of  ₹32.81, hit in February this year while has rallied over 56 percent from its 52-week low of  ₹14.10, recorded in October last year.In the last one year, the private bank stock has gained over 30 percent but has been almost flat, up just around 3 percent in 2024 YTD. It shed around 5 percent in September after an 11 percent decline in August.Yes Bank's Q2 business update reflects steady growth in deposits and advances, with notable improvements in its CASA ratio. However, concerns over the sequential decline in liquidity coverage and a lower credit-deposit ratio have likely contributed to the decline in the bank’s stock price. While the bank continues to perform well overall, especially in terms of deposit growth, its next steps in addressing liquidity and optimizing resource utilization will be key areas to watch moving forward.","cleaned_content":"shares of yes bank fell in trading on thursday after the private sector lender released its business update for the september quarter q2 the bank reported strong growth in both deposits and advances year on year yoy but noted a sequential decline in its liquidity coverage ratio lcr which dampened investor sentiment in its update yes bank highlighted an \u003cONE_TEN_PERCENT\u003e yoy increase in total deposits for the september quarter reaching \u003cTWO_HUNDRED_THOUSAND\u003e crore compared to \u003cTWO_HUNDRED_THOUSAND\u003e crore in the corresponding quarter last year however this was a slight moderation compared to the \u003cTWO_TEN_PERCENT\u003e yoy growth in deposits that the bank reported in the june quarter sequentially deposits grew by \u003cFOUR_PERCENT\u003e from the june quarter showing a steady but slower pace of growth on the advances side yes bank reported a \u003cONE_TEN_PERCENT\u003e yoy rise in loans and advances which amounted to \u003cTWO_HUNDRED_THOUSAND\u003e crore compared to \u003cTWO_HUNDRED_THOUSAND\u003e crore in the same quarter last year this growth while healthy was lower than the \u003cONE_TEN_PERCENT\u003e yoy increase in advances reported during the june quarter sequentially advances were up \u003cTHREE_PERCENT\u003e over the \u003cTWO_HUNDRED_THOUSAND\u003e crore reported in the june quarter indicating consistent performance but slightly slowing momentum yes bank also shared an improvement in its current account and savings account casa deposits which rose \u003cTWO_TEN_PERCENT\u003e yoy to \u003cEIGHT_TEN_THOUSAND\u003e crore sequentially casa deposits were up \u003cEIGHT_PERCENT\u003e from the june quarter the casa ratio an important metric for evaluating a banks cost of funds improved to \u003cTHREE_TEN_PERCENT\u003e up from \u003cTWO_TEN_PERCENT\u003e in the same period last year and \u003cTHREE_TEN_PERCENT\u003e in the june quarter this improvement reflects yes bank s focus on growing its low cost deposit base one area of concern was the banks liquidity coverage ratio lcr which declined to \u003cONE_HUNDRED_PERCENT\u003e in q2 from \u003cONE_HUNDRED_PERCENT\u003e in the june quarter while the lcr was higher than the \u003cONE_HUNDRED_PERCENT\u003e recorded in the same quarter last year the sequential drop raised eyebrows among investors a lower lcr suggests that the banks liquidity buffer has slightly diminished which may impact its ability to meet short term obligations the bank s credit to deposit c d ratio another key measure of banking efficiency stood at \u003cEIGHT_TEN_PERCENT\u003e in the september quarter lower than the \u003cEIGHT_TEN_PERCENT\u003e reported in the june quarter and \u003cEIGHT_TEN_PERCENT\u003e in the same period last year a lower c d ratio indicates that the bank is lending out a smaller portion of its deposits which may suggest caution in its lending strategy or underutilization of resources the stock fell as much as \u003cONE_PERCENT\u003e to its intra day low of \u003cTWO_TEN\u003e it is now \u003cTHREE_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cTHREE_TEN\u003e hit in february this year while has rallied over \u003cFIVE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e recorded in october last year in the last one year the private bank stock has gained over \u003cTHREE_TEN_PERCENT\u003e but has been almost flat up just around \u003cTHREE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd it shed around \u003cFIVE_PERCENT\u003e in september after an \u003cONE_TEN_PERCENT\u003e decline in august yes banks q2 business update reflects steady growth in deposits and advances with notable improvements in its casa ratio however concerns over the sequential decline in liquidity coverage and a lower credit deposit ratio have likely contributed to the decline in the bank s stock price while the bank continues to perform well overall especially in terms of deposit growth its next steps in addressing liquidity and optimizing resource utilization will be key areas to watch moving forward","timestamp":"2024-10-03T10:53:00+05:30","market_timestamp":"2024-10-03T10:53:00+05:30","off_market_hours":false}