{"url":"https://www.livemint.com/market/stock-market-news/bse-to-discontinue-weekly-derivatives-contracts-for-sensex-effective-nov-18-11727965805407.html","title":"BSE to discontinue weekly derivatives contracts for Sensex50, Bankex; What will happen to current contract?","description":"In a notification, the BSE announced that no new weekly contracts for the SENSEX 50 will be issued after the expiration of current unexpired contracts.","content":"After markets regulator Sebi's directive to limit weekly expiries to one per exchange, BSE announced on Thursday that it will discontinue the weekly contracts for both Sensex 50 from November 14 and Bankex from November 18. This means BSE will continue offering weekly derivative contracts for Sensex, its index of 30 blue-chip stocks.In a notification, the BSE announced that no new weekly contracts for the SENSEX 50 will be issued after the expiration of current unexpired contracts. However, the existing contracts will remain valid until their respective expiry dates.\"Weekly index derivatives contracts on Bankex will be discontinued with effect from November 18, 2024, end of day. New weekly contracts will not be generated after the expiry of existing unexpired contracts. Existing unexpired contracts will continue till their respective expiry,\" BSE said in a circular.BSE announced that no new weekly contracts will be generated for BANKEX after the expiration of the currently active contracts. However, the existing unexpired contracts will remain in effect until their respective expiry dates.On October 1, market regulator SEBI introduced several measures to enhance the index derivatives framework, aiming to protect investors and improve market stability. One of the key changes includes reducing contract expiries to a weekly basis. Each exchange will now be permitted to offer derivatives contracts with weekly expiries for only one of its benchmark indices.The Securities and Exchange Board of India (Sebi) has raised the minimum trading amount for derivatives from the current range of  ₹5-10 lakh to  ₹15 lakh upon its introduction in the market. This amount will later be adjusted to fall between  ₹15 lakh and  ₹20 lakh.According to the market regulator’s press release, “the lot size will be determined so that the contract value of the derivative at the time of review is within  ₹15 lakh to  ₹20 lakh.”The notional turnover for BSE's index options in August was  ₹2,603 lakh crore. According to exchange data, the Sensex accounted for 85 per cent of the total volumes in the financial year ending March 2024.In the coming days, NSE is expected to announce whether it will retain Nifty or Nifty Bank for the weekly derivatives market.","cleaned_content":"after markets regulator sebis directive to limit weekly expiries to one per exchange bse announced on thursday that it will discontinue the weekly contracts for both sensex \u003cFIVE_TEN\u003e from november \u003cONE_TEN\u003e and bankex from november \u003cONE_TEN\u003e this means bse will continue offering weekly derivative contracts for sensex its index of \u003cTHREE_TEN\u003e blue chip stocks in a notification the bse announced that no new weekly contracts for the sensex \u003cFIVE_TEN\u003e will be issued after the expiration of current unexpired contracts however the existing contracts will remain valid until their respective expiry dates weekly index derivatives contracts on bankex will be discontinued with effect from november \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e end of day new weekly contracts will not be generated after the expiry of existing unexpired contracts existing unexpired contracts will continue till their respective expiry bse said in a circular bse announced that no new weekly contracts will be generated for bankex after the expiration of the currently active contracts however the existing unexpired contracts will remain in effect until their respective expiry dates on october \u003cONE_\u003e market regulator sebi introduced several measures to enhance the index derivatives framework aiming to protect investors and improve market stability one of the key changes includes reducing contract expiries to a weekly basis each exchange will now be permitted to offer derivatives contracts with weekly expiries for only one of its benchmark indices the securities and exchange board of india sebi has raised the minimum trading amount for derivatives from the current range of \u003cFIVE_\u003e \u003cONE_TEN\u003e lakh to \u003cONE_TEN\u003e lakh upon its introduction in the market this amount will later be adjusted to fall between \u003cONE_TEN\u003e lakh and \u003cTWO_TEN\u003e lakh according to the market regulator s press release the lot size will be determined so that the contract value of the derivative at the time of review is within \u003cONE_TEN\u003e lakh to \u003cTWO_TEN\u003e lakh the notional turnover for bses index options in august was \u003cTWO_THOUSAND\u003e lakh crore according to exchange data the sensex accounted for \u003cEIGHT_TEN_PERCENT\u003e of the total volumes in the financial year ending march \u003cTWO_THOUSAND\u003e in the coming days nse is expected to announce whether it will retain nifty or nifty bank for the weekly derivatives market","timestamp":"2024-10-03T20:02:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}