{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-september-rejig-bharat-electronics-trent-to-enter-nse-index-tomorrow-divis-lab-ltimindtree-excluded-11727363698800.html","title":"Nifty 50 September rejig: Bharat Electronics, Trent to enter NSE index on Sept 27; Divi’s Lab, LTIMindtree excluded","description":"Nifty 50 September rejig: The changes would lead to an inflow worth $500 million in Trent and $440 million in BEL. The counters will have a weight of 1.4 per cent and 0.9 per cent respectively","content":"Nifty 50 September Rejig: Defence PSU stock Bharat Electronics Ltd (BEL) and Tata Group company Trent will enter the NSE’s benchmark Nifty 50 index in its September reshuffle, according to the estimates by Nuvama Alternative \u0026 Quantitative Research. On the contrary, LTIMindtree and Divi’s Laboratories are likely to be excluded from the Nifty 50 index.These changes would lead to an inflow worth $500 million in Trent and $440 million in BEL. The counters will have a weight of 1.4 per cent and 0.9 per cent respectively. LTIMindtree and Divi’s Laboratories are estimated to witness an outflow of $210 million and $260 million, respectively.Also Read: Nifty 50 September rejig: Bharat Electronics, Trent likely to replace LTIMindtree, Divi’s Labs in 50-stock indexThe Index Maintenance Sub-Committee (Equity) of NSE Indices has decided to change various Nifty equity indices as part of the semi-annual review of broad market indices. Only stocks available for trading in NSE’s Futures \u0026 Options (F\u00260) segment are eligible for inclusion in the Nifty 50 index.More than 70 stocks currently qualify for F\u0026O inclusions based on the quantitative criteria but have not made the cut as the capital markets regulator, the Securities and Exchange Board of India (SEBI) has yet to approve them. Nuvama noted that SEBI has not approved any new inclusions in several years. However, SEBI has recently highlighted that it could introduce some new stocks in the derivatives segment using the revised methodology.Also Read: NSE replaces Divi’s Laboratories, LTIMindtree by BEL \u0026 Trent In Nifty 50In the September rejig, Cipla and HDFC Life Insurance are expected to witness an increase in their weightage on the Nifty 50 index. On the other hand, Infosys, ICICI Bank, M\u0026M, Adani Enterprises, Axis Bank, Reliance Industries, Bharti Airtel, HDFC Bank, Kotak Mahindra Bank, and Hindustan Unilever will see their weights in the index go down.According to Nuvama’s estimates, Canara Bank may replace Bandhan Bank in the Nifty Bank index in the upcoming reshuffle. This anticipated change reflects adjustments based on market performance and index requirements. The weightage of State Bank of India (SBI), AU Bank Federal Bank, IDFC First Bank, Bank of Baroda, and a few others is expected to rise while the weights of private banking leaders Kotak Mahindra Bank and HDFC Bank will reduce.JSW Energy, NHPC, BHEL, Union Bank of India, and Macrotech Developers are the potential inclusions in the Nifty Next 50, while Colgate Palmolive India, SRF, Marico, SBI Cards \u0026 Payment Services, and Berger Paints are likely to be dropped out. Divi’s Labs, LTIMindtree, and BPCL's inclusion in the Nifty Next 50 is subjective to the final decisions made during the Nifty 50 rejig.Also Read: MSCI August rejig today: Indian stock market likely to see $5.5 billion inflows; HDFC Bank shares up on weight increase","cleaned_content":"nifty \u003cFIVE_TEN\u003e september rejig defence psu stock bharat electronics ltd bel and tata group company trent will enter the nse s benchmark nifty \u003cFIVE_TEN\u003e index in its september reshuffle according to the estimates by nuvama alternative quantitative research on the contrary ltimindtree and divi s laboratories are likely to be excluded from the nifty \u003cFIVE_TEN\u003e index these changes would lead to an inflow worth \u003cFIVE_HUNDRED\u003e million in trent and \u003cFOUR_HUNDRED\u003e million in bel the counters will have a weight of \u003cONE_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively ltimindtree and divi s laboratories are estimated to witness an outflow of \u003cTWO_HUNDRED\u003e million and \u003cTWO_HUNDRED\u003e million respectively also read nifty \u003cFIVE_TEN\u003e september rejig bharat electronics trent likely to replace ltimindtree divi s labs in \u003cFIVE_TEN\u003e stock indexthe index maintenance sub committee equity of nse indices has decided to change various nifty equity indices as part of the semi annual review of broad market indices only stocks available for trading in nse s futures options f \u003cZERO_\u003e segment are eligible for inclusion in the nifty \u003cFIVE_TEN\u003e index more than \u003cSEVEN_TEN\u003e stocks currently qualify for f o inclusions based on the quantitative criteria but have not made the cut as the capital markets regulator the securities and exchange board of india sebi has yet to approve them nuvama noted that sebi has not approved any new inclusions in several years however sebi has recently highlighted that it could introduce some new stocks in the derivatives segment using the revised methodology also read nse replaces divi s laboratories ltimindtree by bel trent in nifty \u003cFIVE_TEN\u003e in the september rejig cipla and hdfc life insurance are expected to witness an increase in their weightage on the nifty \u003cFIVE_TEN\u003e index on the other hand infosys icici bank m m adani enterprises axis bank reliance industries bharti airtel hdfc bank kotak mahindra bank and hindustan unilever will see their weights in the index go down according to nuvama s estimates canara bank may replace bandhan bank in the nifty bank index in the upcoming reshuffle this anticipated change reflects adjustments based on market performance and index requirements the weightage of state bank of india sbi au bank federal bank idfc first bank bank of baroda and a few others is expected to rise while the weights of private banking leaders kotak mahindra bank and hdfc bank will reduce jsw energy nhpc bhel union bank of india and macrotech developers are the potential inclusions in the nifty next \u003cFIVE_TEN\u003e while colgate palmolive india srf marico sbi cards payment services and berger paints are likely to be dropped out divi s labs ltimindtree and bpcls inclusion in the nifty next \u003cFIVE_TEN\u003e is subjective to the final decisions made during the nifty \u003cFIVE_TEN\u003e rejig also read msci august rejig today indian stock market likely to see \u003cFIVE_\u003e billion inflows hdfc bank shares up on weight increase","timestamp":"2024-09-26T20:50:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}