{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-pitti-engineering-share-price-jumps-over-116-in-a-year-should-you-buy-sell-or-hold-11727683645358.html","title":"Multibagger stock: Pitti Engineering share price jumps over 116% in a year; should you buy, sell or hold?","description":"Multibagger stock: Pitti Engineering share price has achieved a 116% rise in share price over the past year. Brokerages project a revenue increase to  ₹22.5 billion by FY27, supported by efficient manufacturing processes and acquisitions, despite a recent 2% drop in stock price.","content":"Multibagger stock: Pitti Engineering share price has seen a remarkable 116% surge over the course of one year, providing multibagger returns for its investors. Specialising in components for rotating electrical equipment (motors) and precision machining, Pitti Engineering is an integrated manufacturer that contributes approximately 70% of a motor's total value and around 90% in terms of volume. Its product line encompasses loose laminations, both low and high value-added assemblies of stators and rotors, shaft manufacturing, and integrated assemblies.Over a six-month period, Pitti Engineering share price has experienced a growth of more than 70%. Pitti Engineering share price dropped by about 2% on Monday due to the overall subdued sentiment in the market.“On Friday, stock prices witnessed a strong traction from its key support; however, after a gap up today, there's no follow-up movement. The stock has a strong support around the 50EMA at 1250, but for the momentum to trigger, it needs to cross 1350 beyond which 1450 could be expected,” said Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One.Brokerage house, DR Choksey, which is optimistic about Pitti Engineering, advised a buy recommendation on the stock with a target price of  ₹1552. The brokerage reported in its report that it paid a visit to Pitti Engineering's Aurangabad location. With a built-up area of more than 16,500 square meters, this facility is situated on 26 acres of freehold property. It is anticipated that the built-up area would reach more than 38,600 square meters with the proposed development.In a similar manner, Haitong Securities India Private Ltd, a brokerage house, initiated coverage on Pitti Engineering and conducted a management visit. In its recent report, the brokerage house stated that Pitti Engineering maintains a stronger margin profile compared to its competitors due to its integrated manufacturing process. The company's in-house slitting and child part machining provide additional revenue streams, while competitors face higher costs by outsourcing these processes. Furthermore, as a relatively larger player, Pitti enjoys the benefit of scale in raw material procurement, while customers pay based on index price. This operational efficiency enables Pitti to retain superior EBITDA margins.\"The management has provided guidance for achieving a consolidated topline of  ₹22.5 bn by FY27, up from  ₹12 bn in FY24. EBITDA margins are expected to improve by 150-200 bps from 14.8% in FY24, driven by synergies from recent acquisitions and mergers, along with an increasing share of value-added products.As per management projections, standalone revenue is anticipated to grow to  ₹17-18 bn, with Bagadia Chaitra contributing approximately  ₹3 bn, Dakshin Foundry adding  ₹750 mn, and Pitti Castings contributing Rs500mn, bringing the total consolidated revenue to  ₹22.5 bn by FY27. Also, the company is eligible for  ₹350 mn of incentive income from the Maharashtra State Government,\" said Haitong in its report.","cleaned_content":"multibagger stock pitti engineering share price has seen a remarkable \u003cONE_HUNDRED_PERCENT\u003e surge over the course of one year providing multibagger returns for its investors specialising in components for rotating electrical equipment motors and precision machining pitti engineering is an integrated manufacturer that contributes approximately \u003cSEVEN_TEN_PERCENT\u003e of a motors total value and around \u003cNINE_TEN_PERCENT\u003e in terms of volume its product line encompasses loose laminations both low and high value added assemblies of stators and rotors shaft manufacturing and integrated assemblies over a six month period pitti engineering share price has experienced a growth of more than \u003cSEVEN_TEN_PERCENT\u003e pitti engineering share price dropped by about \u003cTWO_PERCENT\u003e on monday due to the overall subdued sentiment in the market on friday stock prices witnessed a strong traction from its key support however after a gap up today theres no follow up movement the stock has a strong support around the \u003cFIVE_TEN\u003e ema at \u003cONE_THOUSAND\u003e but for the momentum to trigger it needs to cross \u003cONE_THOUSAND\u003e beyond which \u003cONE_THOUSAND\u003e could be expected said rajesh bhosale equity technical and derivative analyst at angel one brokerage house dr choksey which is optimistic about pitti engineering advised a buy recommendation on the stock with a target price of \u003cONE_THOUSAND\u003e the brokerage reported in its report that it paid a visit to pitti engineerings aurangabad location with a built up area of more than \u003cONE_TEN_THOUSAND\u003e square meters this facility is situated on \u003cTWO_TEN\u003e acres of freehold property it is anticipated that the built up area would reach more than \u003cTHREE_TEN_THOUSAND\u003e square meters with the proposed development in a similar manner haitong securities india private ltd a brokerage house initiated coverage on pitti engineering and conducted a management visit in its recent report the brokerage house stated that pitti engineering maintains a stronger margin profile compared to its competitors due to its integrated manufacturing process the companys in house slitting and child part machining provide additional revenue streams while competitors face higher costs by outsourcing these processes furthermore as a relatively larger player pitti enjoys the benefit of scale in raw material procurement while customers pay based on index price this operational efficiency enables pitti to retain superior ebitda margins the management has provided guidance for achieving a consolidated topline of \u003cTWO_TEN\u003e bn by fy27 up from \u003cONE_TEN\u003e bn in fy24 ebitda margins are expected to improve by \u003cONE_HUNDRED\u003e \u003cTWO_HUNDRED\u003e bps from \u003cONE_TEN_PERCENT\u003e in fy24 driven by synergies from recent acquisitions and mergers along with an increasing share of value added products as per management projections standalone revenue is anticipated to grow to \u003cONE_TEN\u003e \u003cONE_TEN\u003e bn with bagadia chaitra contributing approximately \u003cTHREE_\u003e bn dakshin foundry adding \u003cSEVEN_HUNDRED\u003e mn and pitti castings contributing rs500mn bringing the total consolidated revenue to \u003cTWO_TEN\u003e bn by fy27 also the company is eligible for \u003cTHREE_HUNDRED\u003e mn of incentive income from the maharashtra state government said haitong in its report","timestamp":"2024-09-30T14:38:00+05:30","market_timestamp":"2024-09-30T14:38:00+05:30","off_market_hours":false}