{"url":"https://www.livemint.com/market/stock-market-news/bank-nifty-trading-strategy-today-how-to-trade-bank-nifty-options-on-september-26-rahul-ghose-suggests-this-strategy-11727316050109.html","title":"Bank Nifty Trading Strategy Today: How to trade Bank Nifty options on September 26? Rahul Ghose suggests this strategy","description":"Bank Nifty Trading Strategy Today: Bank Nifty Index is unable to sustain above 54,100 levels and is showing signs of a sideways move. With this, Rahul Ghose suggests a low-risk Bank Nifty options strategy for today.","content":"Bank Nifty Trading Strategy Today: Indian stock market indices touched record high levels on Wednesday, with the BSE Sensex surpassing 85,000 level and the Nifty 50 closing above the 26,000-mark. The rally in the domestic equity has been accelerated by improved investors’ risk appetite after the US Federal Reserve’s supersized interest rate cut, sustained foreign fund inflows and robust macro indicators.Bank Nifty index gained 133.05 points, or 0.25%, to close at 54,101.65 on Wednesday and formed a bullish candlestick pattern on the daily charts.Rahul Ghose, CEO of Hedged.in noted that the Bank Nifty Index is unable to sustain above 54,100 levels and is showing signs of a sideways move for the next few days. Wednesday’s high of 54,141 is acting as an immediate resistance, he said.With this, Ghose suggests a low-risk Bank Nifty options strategy which makes money if the Bank Nifty falls below 53,200 by the end of 9 October weekly expiry.“Even if the Bank Nifty does move up, the max risk in the trade is  ₹1,000 only,” Ghose said.Here is Bank Nifty options trading strategy for today by Rahul Ghose:\u003e Buy 1 lot of the 09th Oct expiry 53500 PE at CMP 289\u003e Buy 1 lot of the 09th Oct expiry 53100 PE at CMP 184\u003e Sell 2 lots of the 09th Oct expiry 53200 PE at CMP 204The capital required in the trade is  ₹39,700. This trade can be entered today if Bank Nifty is trading between the levels of 53,800 and 54,300. The maximum loss in the trade is  ₹1,000 and one can look to exit with a profit of above 1,500 per set, Ghose said.The trade is protected with a limited risk of  ₹1,000 per set. However, if Bank Nifty goes above 54,600 levels, the sold Put option can be brought higher by 100 to 200 points, to get more credit, making the trade safe, Ghose added.","cleaned_content":"bank nifty trading strategy today indian stock market indices touched record high levels on wednesday with the bse sensex surpassing \u003cEIGHT_TEN_THOUSAND\u003e level and the nifty \u003cFIVE_TEN\u003e closing above the \u003cTWO_TEN_THOUSAND\u003e mark the rally in the domestic equity has been accelerated by improved investors risk appetite after the us federal reserve s supersized interest rate cut sustained foreign fund inflows and robust macro indicators bank nifty index gained \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on wednesday and formed a bullish candlestick pattern on the daily charts rahul ghose ceo of hedged in noted that the bank nifty index is unable to sustain above \u003cFIVE_TEN_THOUSAND\u003e levels and is showing signs of a sideways move for the next few days wednesday s high of \u003cFIVE_TEN_THOUSAND\u003e is acting as an immediate resistance he said with this ghose suggests a low risk bank nifty options strategy which makes money if the bank nifty falls below \u003cFIVE_TEN_THOUSAND\u003e by the end of \u003cNINE_\u003e october weekly expiry even if the bank nifty does move up the max risk in the trade is \u003cONE_THOUSAND\u003e only ghose said here is bank nifty options trading strategy for today by rahul ghose buy \u003cONE_\u003e lot of the \u003cNINE_\u003e th oct expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cTWO_HUNDRED\u003e buy \u003cONE_\u003e lot of the \u003cNINE_\u003e th oct expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cONE_HUNDRED\u003e sell \u003cTWO_\u003e lots of the \u003cNINE_\u003e th oct expiry \u003cFIVE_TEN_THOUSAND\u003e pe at cmp \u003cTWO_HUNDRED\u003e the capital required in the trade is \u003cTHREE_TEN_THOUSAND\u003e this trade can be entered today if bank nifty is trading between the levels of \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e the maximum loss in the trade is \u003cONE_THOUSAND\u003e and one can look to exit with a profit of above \u003cONE_THOUSAND\u003e per set ghose said the trade is protected with a limited risk of \u003cONE_THOUSAND\u003e per set however if bank nifty goes above \u003cFIVE_TEN_THOUSAND\u003e levels the sold put option can be brought higher by \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e points to get more credit making the trade safe ghose added","timestamp":"2024-09-26T07:41:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}