{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-yatharth-hospital-soars-90-since-ipo-phillip-capital-sees-another-44-upside-11727687437668.html","title":"Smallcap stock Yatharth Hospital soars 90% since IPO; Phillip Capital sees another 44% upside","description":"Yatharth Hospital's stock has surged over 90% since its IPO last August, prompting Phillip Capital to issue a 'buy' recommendation with a target price of  ₹827. The company is expected to achieve strong revenue growth through bed capacity expansion and improved occupancy rates.","content":"Rallying over 90 per cent from its initial public offering (IPO) price of  ₹300, smallcap stock Yatharth Hospital and Trauma Care Services has had a strong run since listing in August last year. The IPO, which ran between July 26-28, 2023, witnessed a robust 37.28 times subscription.Notwithstanding the surge, brokerage Phillip Capital has initiated coverage on this hospital stock with a 'buy' recommendation and a target price of  ₹827, implying an upside potential of over 44 per cent from current levels. It noted that Yatharth is an emerging mid-market multi-specialty healthcare player, with room to expand on all fronts.\"Yatharth is a multi-specialty tertiary healthcare player in the northern Indian region. With its bed addition plans which would take its current bed capacity of 1605 to 2800+, we foresee healthy growth in business. We also anticipate growth in ARPOBs (average revenue per bed occupied) owing to better therapy, patient and business mix. These two factors combined will exponentially boost the topline of the company. In our view, its geographic location also serves as a moat as it sits closer to high population density areas in the northern states,\" explained the brokerage.Going ahead, it expects the company's Revenue/EBITDA/PAT to grow at a CAGR of 29 per cent/30 per cent/33 per cent, respectively over FY24-FY27E.The smallcap stock has climbed 51 per cent in the last one year as well as on a year-to-date basis. It jumped 8.5 per cent in September, extending gains for the fourth straight month. The scrip added over 14 per cent in August, 10 per cent in July and half a per cent in June. However, it shed 7 per cent in May. Before that, the stock faced volatility as it rose 6 per cent in April and slipped 10.6 per cent in March. The first two months were positive for the stock, as it clocked 24 per cent gains in February and 0.5 per cent in January.The hospital stock is currently just 4.5 per cent away from its record high of  ₹599.65 hit last week (September 25). However, it has soared 66.5 per cent from its 52-week low of  ₹344, recorded in October last year.Phillip Capital noted that the company strategically expanded into an under-served market, positioning itself to achieve higher in-patient volumes compared to peers. With rising surgery costs in key hubs like Gurugram and NCR, the firm expected a shift in traffic towards Noida, where patients could save approximately 10 per cent on average. The company consistently increased its bed count, starting with 250 beds in Noida and growing to around 1,605 beds by Q1FY25, with plans to reach over 2,800 beds in the next 3-4 years, said the brokerage.It further pointed out that occupancy rates also saw improvement, rising from 50 per cent in FY22 to 61 per cent in Q1FY25, with further potential to increase to 65 per cent by FY27. Phillip Capital projected that new beds and occupancy improvements could add approximately  ₹500 crore to the company’s topline. The ARPOB grew from  ₹23,000 in FY22 to around  ₹30,000 in Q1FY25, driven by a shift towards high-value specialities and a favourable payor mix. ARPOB is expected to continue growing at a 5-7 per cent CAGR through FY27, potentially adding  ₹150 crore to revenues, forecasted the brokerage.Financially, the company saw its topline growing 43 per cent CAGR between FY21 and FY24, supported by rising occupancies and ARPOBs, added Phillip Capital. It anticipates this trend to persist, with improving therapy mix and economies of scale enhancing EBITDA margins and lifting return ratios to 17 per cent ROE and 19 per cent ROCE by FY27.With its robust growth strategy, including plans to increase bed capacity and improve ARPOB, Yatharth Hospital is well-positioned for further gains. Phillip Capital's outlook, supported by strong fundamentals and a favourable geographic location, suggests significant upside potential, with projected growth in revenue, EBITDA, and profitability through FY27. For investors, the hospital stock continues to offer an attractive opportunity in the mid-market healthcare sector.","cleaned_content":"rallying over \u003cNINE_TEN_PERCENT\u003e from its initial public offering ipo price of \u003cTHREE_HUNDRED\u003e smallcap stock yatharth hospital and trauma care services has had a strong run since listing in august last year the ipo which ran between july \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e witnessed a robust \u003cTHREE_TEN\u003e times subscription notwithstanding the surge brokerage phillip capital has initiated coverage on this hospital stock with a buy recommendation and a target price of \u003cEIGHT_HUNDRED\u003e implying an upside potential of over \u003cFOUR_TEN_PERCENT\u003e from current levels it noted that yatharth is an emerging mid market multi specialty healthcare player with room to expand on all fronts yatharth is a multi specialty tertiary healthcare player in the northern indian region with its bed addition plans which would take its current bed capacity of \u003cONE_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e we foresee healthy growth in business we also anticipate growth in arpobs average revenue per bed occupied owing to better therapy patient and business mix these two factors combined will exponentially boost the topline of the company in our view its geographic location also serves as a moat as it sits closer to high population density areas in the northern states explained the brokerage going ahead it expects the companys revenue ebitda pat to grow at a cagr of \u003cTWO_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e \u003cTHREE_TEN_PERCENT\u003e respectively over fy24 fy27e the smallcap stock has climbed \u003cFIVE_TEN_PERCENT\u003e in the last one year as well as on a year to date basis it jumped \u003cEIGHT_PERCENT\u003e in september extending gains for the fourth straight month the scrip added over \u003cONE_TEN_PERCENT\u003e in august \u003cONE_TEN_PERCENT\u003e in july and half a per cent in june however it shed \u003cSEVEN_PERCENT\u003e in may before that the stock faced volatility as it rose \u003cSIX_PERCENT\u003e in april and slipped \u003cONE_TEN_PERCENT\u003e in march the first two months were positive for the stock as it clocked \u003cTWO_TEN_PERCENT\u003e gains in february and \u003cZERO_PERCENT\u003e in january the hospital stock is currently just \u003cFOUR_PERCENT\u003e away from its record high of \u003cFIVE_HUNDRED\u003e hit last week september \u003cTWO_TEN\u003e however it has soared \u003cSIX_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTHREE_HUNDRED\u003e recorded in october last year phillip capital noted that the company strategically expanded into an under served market positioning itself to achieve higher in patient volumes compared to peers with rising surgery costs in key hubs like gurugram and ncr the firm expected a shift in traffic towards noida where patients could save approximately \u003cONE_TEN_PERCENT\u003e on average the company consistently increased its bed count starting with \u003cTWO_HUNDRED\u003e beds in noida and growing to around \u003cONE_THOUSAND\u003e beds by q1fy25 with plans to reach over \u003cTWO_THOUSAND\u003e beds in the next \u003cTHREE_\u003e \u003cFOUR_\u003e years said the brokerage it further pointed out that occupancy rates also saw improvement rising from \u003cFIVE_TEN_PERCENT\u003e in fy22 to \u003cSIX_TEN_PERCENT\u003e in q1fy25 with further potential to increase to \u003cSIX_TEN_PERCENT\u003e by fy27 phillip capital projected that new beds and occupancy improvements could add approximately \u003cFIVE_HUNDRED\u003e crore to the company s topline the arpob grew from \u003cTWO_TEN_THOUSAND\u003e in fy22 to around \u003cTHREE_TEN_THOUSAND\u003e in q1fy25 driven by a shift towards high value specialities and a favourable payor mix arpob is expected to continue growing at a \u003cFIVE_\u003e \u003cSEVEN_PERCENT\u003e cagr through fy27 potentially adding \u003cONE_HUNDRED\u003e crore to revenues forecasted the brokerage financially the company saw its topline growing \u003cFOUR_TEN_PERCENT\u003e cagr between fy21 and fy24 supported by rising occupancies and arpobs added phillip capital it anticipates this trend to persist with improving therapy mix and economies of scale enhancing ebitda margins and lifting return ratios to \u003cONE_TEN_PERCENT\u003e roe and \u003cONE_TEN_PERCENT\u003e roce by fy27 with its robust growth strategy including plans to increase bed capacity and improve arpob yatharth hospital is well positioned for further gains phillip capitals outlook supported by strong fundamentals and a favourable geographic location suggests significant upside potential with projected growth in revenue ebitda and profitability through fy27 for investors the hospital stock continues to offer an attractive opportunity in the mid market healthcare sector","timestamp":"2024-09-30T15:12:00+05:30","market_timestamp":"2024-09-30T15:12:00+05:30","off_market_hours":false}