{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-26-11727315450169.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 26","description":"Nifty 50, Sensex today: The trends on Gift Nifty indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 26,045 level, a premium of nearly 40 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open on a cautious note Thursday ahead of monthly futures \u0026 options (F\u0026O) expiry and amid mixed global market cues.The trends on Gift Nifty indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 26,045 level, a premium of nearly 40 points from the Nifty futures’ previous close.On Wednesday, the domestic equity indices closed higher, with the benchmark Nifty 50 ending above the 26,000 level for the first time.The Sensex gained 255.83 points to close at 85,169.87, while the Nifty 50 settled 63.75 points or, 0.25%, higher at 26,004.15.Nifty 50 formed a reasonable bull candle on the daily chart with minor upper shadow.“Technically, this pattern indicates an attempt of an upside breakout of the small range movement of two sessions at the 26,000 mark. The near-term trend of Nifty continues to be positive. The market is exhibiting strong upside momentum with range bound action in between,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to him, the next upside levels to be watched are around 26,200 - 26,300 (1.618% Fibonacci Extension).Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 made an attempt to bounce back from the lows on September 25 and closed the day higher by 63 points above the 26,000-mark.“The Nifty 50 made another lifetime high as bulls seemed in no mood to back down, despite a weak start. The sentiment is likely to remain positive as long as it remains above 25,900, where aggressive put writing was visible. Technically, the Nifty has sustained above its very short-term moving average. Furthermore, no reversal is visible in the momentum indicator. Therefore, we might witness a range-bound to positive move in the near term. Resistance on the higher end, is seen at 26,200 - 26,250,” said Rupak De, Senior Technical Analyst, LKP Securities.VLA Ambala, Co-Founder of Stock Market Today highlighted that the Nifty 50 index showed RSI of 75 on the weekly and 83 on the monthly timeframe and has a PE ratio of 24, which indicates that the market was overvalued and needed a correction. Meanwhile, the broader market needs strong reasons to adjust its valuation.“The market looks stable and confident, but I recommend a cautious approach. My analysis suggests that we can witness a market dip in the next 1-2 months. It will create valuable buying opportunities for fresh investments. The market is abounding with liquidity in mutual funds houses, and in this situation, any dip opportunity, particularly “flash dips”, should be encashed,” Ambala said.She expects the Nifty 50 index could find support levels around 25,960 and 25,910 and notice resistance between 26,070 and 26,190 in today’s session.Praveen Dwarakanath, Vice President of Hedged.in said that with the Nifty 50 closing above its all-time high and the psychological level of 26,000, it has continued its walk on the band, technically a sign of bullishness.“However, the Options writer’s data for today’s expiry shows increased calls and put writing at 26,000 levels, indicating a sideways move. For today’s expiry, the intraday support is at 25,930 levels while the 26,000 levels can act as an immediate resistance,” Dwarakanath said.Bank Nifty index ended 133.05 points, or 0.25%, higher at 54,101.65 on Wednesday, forming a bullish candlestick pattern on the daily charts.“The daily candle in Bank Nifty closed below the Bollinger band, although a green candle, indicating a weakness in the index at the present levels. On the daily chart, the stochastics is forming a possible negative divergence, indicating no further steam on the upside in the index. Immediate support for the index is at the 53,700 levels, a break of which can trigger 53,000 or even 52,200 levels soon,” said Dwarakanath.According to him, options writer’s data for the next month’s expiry shows increased calls and put writing at 54,000 levels, indicating a possible halt or reversal from the current levels.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a cautious note thursday ahead of monthly futures options f o expiry and amid mixed global market cues the trends on gift nifty indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cFOUR_TEN\u003e points from the nifty futures previous close on wednesday the domestic equity indices closed higher with the benchmark nifty \u003cFIVE_TEN\u003e ending above the \u003cTWO_TEN_THOUSAND\u003e level for the first time the sensex gained \u003cTWO_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cSIX_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a reasonable bull candle on the daily chart with minor upper shadow technically this pattern indicates an attempt of an upside breakout of the small range movement of two sessions at the \u003cTWO_TEN_THOUSAND\u003e mark the near term trend of nifty continues to be positive the market is exhibiting strong upside momentum with range bound action in between said nagaraj shetti senior technical research analyst at hdfc securities according to him the next upside levels to be watched are around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e made an attempt to bounce back from the lows on september \u003cTWO_TEN\u003e and closed the day higher by \u003cSIX_TEN\u003e points above the \u003cTWO_TEN_THOUSAND\u003e mark the nifty \u003cFIVE_TEN\u003e made another lifetime high as bulls seemed in no mood to back down despite a weak start the sentiment is likely to remain positive as long as it remains above \u003cTWO_TEN_THOUSAND\u003e where aggressive put writing was visible technically the nifty has sustained above its very short term moving average furthermore no reversal is visible in the momentum indicator therefore we might witness a range bound to positive move in the near term resistance on the higher end is seen at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst lkp securities vla ambala co founder of stock market today highlighted that the nifty \u003cFIVE_TEN\u003e index showed rsi of \u003cSEVEN_TEN\u003e on the weekly and \u003cEIGHT_TEN\u003e on the monthly timeframe and has a pe ratio of \u003cTWO_TEN\u003e which indicates that the market was overvalued and needed a correction meanwhile the broader market needs strong reasons to adjust its valuation the market looks stable and confident but i recommend a cautious approach my analysis suggests that we can witness a market dip in the next \u003cONE_\u003e \u003cTWO_\u003e months it will create valuable buying opportunities for fresh investments the market is abounding with liquidity in mutual funds houses and in this situation any dip opportunity particularly flash dips should be encashed ambala said she expects the nifty \u003cFIVE_TEN\u003e index could find support levels around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and notice resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in today s session praveen dwarakanath vice president of hedged in said that with the nifty \u003cFIVE_TEN\u003e closing above its all time high and the psychological level of \u003cTWO_TEN_THOUSAND\u003e it has continued its walk on the band technically a sign of bullishness however the options writer s data for today s expiry shows increased calls and put writing at \u003cTWO_TEN_THOUSAND\u003e levels indicating a sideways move for today s expiry the intraday support is at \u003cTWO_TEN_THOUSAND\u003e levels while the \u003cTWO_TEN_THOUSAND\u003e levels can act as an immediate resistance dwarakanath said bank nifty index ended \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e on wednesday forming a bullish candlestick pattern on the daily charts the daily candle in bank nifty closed below the bollinger band although a green candle indicating a weakness in the index at the present levels on the daily chart the stochastics is forming a possible negative divergence indicating no further steam on the upside in the index immediate support for the index is at the \u003cFIVE_TEN_THOUSAND\u003e levels a break of which can trigger \u003cFIVE_TEN_THOUSAND\u003e or even \u003cFIVE_TEN_THOUSAND\u003e levels soon said dwarakanath according to him options writer s data for the next month s expiry shows increased calls and put writing at \u003cFIVE_TEN_THOUSAND\u003e levels indicating a possible halt or reversal from the current levels","timestamp":"2024-09-26T07:30:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}