{"url":"https://www.livemint.com/market/stock-market-news/paytm-rallies-7-on-fresh-uptrend-dolat-capital-pegs-buy-eyes-37-upside-at-tp-rs-920-11727783818786.html","title":"Paytm rallies 7% on fresh uptrend; Dolat Capital pegs ‘buy’, eyes 37% upside at TP  ₹920","description":"Paytm stock check: Dolat Capital maintained its “buy” rating and increased the target price to  ₹920, nearly 26 per cent higher than CMP.","content":"Paytm's parent company, One 97 Communications Ltd, shares surged on Tuesday, October 1, after Dolat Capital, a research analyst firm, issued a report on Monday maintaining its “buy” rating and increasing the target price to  ₹920, nearly 26 per cent higher than the current market price as of Tuesday's market close.According to the research report, Dolat Capital eyed a 37 per cent upside in Paytm's parent stock from the current market price when the report was released. The current market price mentioned in the report was  ₹672.One 97 Communications Ltd shares closed 6.23 per cent higher at  ₹731.25 after Tuesday's market session, compared to  ₹688.35 at Monday's market close.“Paytm remains in a bright spot of continued rapid growth in digital payments in India. We believe that the company has potential for growing its revenues multi-fold over next decade and is expected to deliver steadily growing profits FY26E onwards. We believe that DCF (discounted cash flow) valuation is an ideal tool to value the real long-term potential of this business,” the report said.Dolat Capital also stated that the company's business is “resilient” and “well poised” to deliver robust growth, which led to the analyst firm realigning its estimates considering the improved business prospects and divesture of its events business for  ₹2,000 crore ( ₹20 billion), according to the report.The analyst firm also noted that in the last three months, Paytm's business has experienced fewer challenges and improved prospects across the segments. These include Paytm handle migration, clearance of regulatory hurdles with FDI approval for the Payment Aggregator (PA) license, stable market share as indicated by UPI consumer data, and a growing partner network in financial distribution, as per the report.The analyst firm also stated that the brand is set on the recovery path from its PPBL (Paytm Payments Bank Limited) and Postpaid impact. “The company continues to possess large (serving both on need and want), huge customer base (MTUs of 78mn+, ATU of ~150mn+) and robust tech platform number of use cases,” the firm said in the report.“We maintain our ‘BUY’ rating on the stock with revised TP of Rs. 920 (implies 4.6x/3.6x on FY26/FY27E EV/Sales),” Dolat Capital report said.","cleaned_content":"paytms parent company one \u003cNINE_TEN\u003e communications ltd shares surged on tuesday october \u003cONE_\u003e after dolat capital a research analyst firm issued a report on monday maintaining its buy rating and increasing the target price to \u003cNINE_HUNDRED\u003e nearly \u003cTWO_TEN_PERCENT\u003e higher than the current market price as of tuesdays market close according to the research report dolat capital eyed a \u003cTHREE_TEN_PERCENT\u003e upside in paytms parent stock from the current market price when the report was released the current market price mentioned in the report was \u003cSIX_HUNDRED\u003e one \u003cNINE_TEN\u003e communications ltd shares closed \u003cSIX_PERCENT\u003e higher at \u003cSEVEN_HUNDRED\u003e after tuesdays market session compared to \u003cSIX_HUNDRED\u003e at mondays market close paytm remains in a bright spot of continued rapid growth in digital payments in india we believe that the company has potential for growing its revenues multi fold over next decade and is expected to deliver steadily growing profits fy26e onwards we believe that dcf discounted cash flow valuation is an ideal tool to value the real long term potential of this business the report said dolat capital also stated that the companys business is resilient and well poised to deliver robust growth which led to the analyst firm realigning its estimates considering the improved business prospects and divesture of its events business for \u003cTWO_THOUSAND\u003e crore \u003cTWO_TEN\u003e billion according to the report the analyst firm also noted that in the last three months paytms business has experienced fewer challenges and improved prospects across the segments these include paytm handle migration clearance of regulatory hurdles with fdi approval for the payment aggregator pa license stable market share as indicated by upi consumer data and a growing partner network in financial distribution as per the report the analyst firm also stated that the brand is set on the recovery path from its ppbl paytm payments bank limited and postpaid impact the company continues to possess large serving both on need and want huge customer base mtus of \u003cSEVEN_TEN\u003e mn atu of \u003cONE_HUNDRED\u003e mn and robust tech platform number of use cases the firm said in the report we maintain our buy rating on the stock with revised tp of rs \u003cNINE_HUNDRED\u003e implies \u003cFOUR_\u003e x \u003cTHREE_\u003e x on fy26 fy27e ev sales dolat capital report said","timestamp":"2024-10-01T19:13:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}