{"url":"https://www.livemint.com/market/stock-market-news/indian-stock-market-a-change-in-the-texture-large-caps-are-on-charge-geojits-vinod-nair-11727607747677.html","title":"Indian stock market | A change in the texture, large caps are on charge: Geojit’s Vinod Nair","description":"Domestic midcaps have been trading to large caps at a premium, which stands at a historic peak of 55 per cent. Large caps are better placed to handle the global slowdown, as indicated by the super accommodative Fed’s September policy.","content":"The US Federal Reserve's unexpected 50 bps rate cut and its shift in policy are boosting the emerging markets. After the event, it was highly expected to do so in anticipation of an influx of FII inflows. There is courtesy of the dollar to depreciate and EMs currency to appreciate as the dollar interest rate starts to reduce.Typically, this reallocation of funds to emerging markets is driven by forecasts of a slowdown in developed economies. However, in this instance, the primary factor is not an expected economic slowdown but rather the relatively high valuation of dollar-based markets compared to emerging markets. The consensus suggests that the developed economies will likely experience a soft landing rather than a significant downturn.Also Read: Buy or sell: ONGC to Syrma SGS Tech—Ganesh Dongre recommends three stocks for MondayChina is currently the top performer in the emerging markets rally, benefiting from low valuations and new central bank stimulus measures that have boosted investor confidence. MSCI-China is trading at 9.4x, while MSCI-India is at 25x, with a one-year forward P/E ratio. Since the pandemic, the PBOC has unleashed the biggest stimulus package to provide rate cuts and influx liquidity.In the current emerging markets rally, India is lagging behind its Asian counterparts. Since September 18, MSCI India is up by 2.9 per cent, MSCI-China is up by 16.1 per cent, and MSCI-EM is up by 6.9 per cent. Despite that, the liquidity from FIIs is providing a push to the domestic momentum.Domestic benchmarks have breached new highs. However, this rally differs from previous ones as large-cap stocks are leading the charge, while mid-and small-cap stocks are lagging, with small-cap stocks showing the most negative bias.Also Read: Week Ahead: Auto sales, SEBI board meet, FII inflows, global cues among key market triggers as Nifty eyes 26,500This is in contrast to the market trend of the last five years. The last one-year Nifty100 is up by 39 per cent, while mid and small caps are 49 per cent and 52 per cent, respectively, marginally better. Compared to the last five years, it was 133 per cent, 272 per cent, and 240 per cent, respectively. Mid and small caps, on average, outperformed large caps by two times.We can expect this change in India's trend to underperform other emerging markets and the better performance of the domestic large caps to mid \u0026 small caps to continue in the short to medium term. This is because India has long been trading at a premium valuation to EMs.Similarly, domestic Midcaps have been trading to large caps at a premium, which stands at a historic peak of 55 per cent. Large caps are better placed to handle the global slowdown, as indicated by the super accommodative Fed’s September policy. Additionally, FII inflows are currently more concentrated in large-cap than mid-cap stocks, further supporting this trend.Also Read: Upcoming IPOs: 3 new public issues, 12 listings to keep primary market buzzing this week; Full list hereIndia's earnings growth had already slowed in Q1, with a modest 5-6 per cent growth, and the upcoming Q2 results in the first week of October will be crucial in determining the extent of India's underperformance or outperformance relative to other emerging markets.While the Q1 slowdown was attributed to reduced government spending during the national elections, it may be premature to draw definitive conclusions. The slowdown is evident across multiple sectors, suggesting that the issue may go beyond temporary or technical factors.The market still believes earnings growth will recover. The sharp correction in international commodity prices indicates that the world’s demand is in contract. Though this is a net positive for India, it will negatively impact commodity players while benefiting the majority of the economy as a net user/importer of materials.However, if world demand slows across the category, it will affect growth, making it difficult for India to maintain the premium valuation in the short to medium term. Finally, for the mid-and small caps to slow down, we need to see a reduction in retail inflows directly and through MFs. This will happen only if new and retail investors incur losses, as many have remained insulated since the pandemic.The author Vinod Nair is the Head of Research at Geojit Financial Services.","cleaned_content":"the us federal reserves unexpected \u003cFIVE_TEN\u003e bps rate cut and its shift in policy are boosting the emerging markets after the event it was highly expected to do so in anticipation of an influx of fii inflows there is courtesy of the dollar to depreciate and ems currency to appreciate as the dollar interest rate starts to reduce typically this reallocation of funds to emerging markets is driven by forecasts of a slowdown in developed economies however in this instance the primary factor is not an expected economic slowdown but rather the relatively high valuation of dollar based markets compared to emerging markets the consensus suggests that the developed economies will likely experience a soft landing rather than a significant downturn also read buy or sell ongc to syrma sgs tech ganesh dongre recommends three stocks for mondaychina is currently the top performer in the emerging markets rally benefiting from low valuations and new central bank stimulus measures that have boosted investor confidence msci china is trading at \u003cNINE_\u003e x while msci india is at \u003cTWO_TEN\u003e x with a one year forward p e ratio since the pandemic the pboc has unleashed the biggest stimulus package to provide rate cuts and influx liquidity in the current emerging markets rally india is lagging behind its asian counterparts since september \u003cONE_TEN\u003e msci india is up by \u003cTWO_PERCENT\u003e msci china is up by \u003cONE_TEN_PERCENT\u003e and msci em is up by \u003cSIX_PERCENT\u003e despite that the liquidity from fiis is providing a push to the domestic momentum domestic benchmarks have breached new highs however this rally differs from previous ones as large cap stocks are leading the charge while mid and small cap stocks are lagging with small cap stocks showing the most negative bias also read week ahead auto sales sebi board meet fii inflows global cues among key market triggers as nifty eyes \u003cTWO_TEN_THOUSAND\u003e this is in contrast to the market trend of the last five years the last one year nifty100 is up by \u003cTHREE_TEN_PERCENT\u003e while mid and small caps are \u003cFOUR_TEN_PERCENT\u003e and \u003cFIVE_TEN_PERCENT\u003e respectively marginally better compared to the last five years it was \u003cONE_HUNDRED_PERCENT\u003e \u003cTWO_HUNDRED_PERCENT\u003e and \u003cTWO_HUNDRED_PERCENT\u003e respectively mid and small caps on average outperformed large caps by two times we can expect this change in indias trend to underperform other emerging markets and the better performance of the domestic large caps to mid small caps to continue in the short to medium term this is because india has long been trading at a premium valuation to ems similarly domestic midcaps have been trading to large caps at a premium which stands at a historic peak of \u003cFIVE_TEN_PERCENT\u003e large caps are better placed to handle the global slowdown as indicated by the super accommodative fed s september policy additionally fii inflows are currently more concentrated in large cap than mid cap stocks further supporting this trend also read upcoming ipos \u003cTHREE_\u003e new public issues \u003cONE_TEN\u003e listings to keep primary market buzzing this week full list hereindias earnings growth had already slowed in q1 with a modest \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e growth and the upcoming q2 results in the first week of october will be crucial in determining the extent of indias underperformance or outperformance relative to other emerging markets while the q1 slowdown was attributed to reduced government spending during the national elections it may be premature to draw definitive conclusions the slowdown is evident across multiple sectors suggesting that the issue may go beyond temporary or technical factors the market still believes earnings growth will recover the sharp correction in international commodity prices indicates that the world s demand is in contract though this is a net positive for india it will negatively impact commodity players while benefiting the majority of the economy as a net user importer of materials however if world demand slows across the category it will affect growth making it difficult for india to maintain the premium valuation in the short to medium term finally for the mid and small caps to slow down we need to see a reduction in retail inflows directly and through mfs this will happen only if new and retail investors incur losses as many have remained insulated since the pandemic the author vinod nair is the head of research at geojit financial services","timestamp":"2024-09-29T16:54:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}