{"url":"https://www.livemint.com/market/stock-market-news/highspeed-traders-made-7-billion-in-indian-options-market-boom-11727139541862.html","title":"High-speed traders made $7 billion in Indian options market boom","description":"A study reveals that algorithms enabled foreign funds to earn $7 billion from Indian equity derivatives, while individual traders lost $7.3 billion. This highlights the challenges faced by individuals against larger trading firms in India's $4.6 trillion derivatives market.","content":"Algorithms helped foreign funds and proprietary trading desks pocket 588.4 billion rupees ($7 billion) in gross profits from trading Indian equity derivatives, a study by the nation’s market regulator showed.The bulk of the gains came at the expense of individual traders and others, who lost a combined 610 billion rupees dabbling in futures and options in the financial year ended March, according to the study published Monday.The size of profits raked in by high-frequency trading firms shows how individual traders face long odds when competing against larger and better-funded players. India’s $4.6 trillion derivatives market grabbed global attention in April after US-based Jane Street Group revealed that a strategy used in the country generated $1 billion in profits.Nine out of every 10 retail traders in the derivatives market lost money during the three-year period ended March, with only 1% making profits of over 100,000 rupees. More than 75% of the 10 million individual traders in India declared annual income of less than 500,000 rupees, the study showed.","cleaned_content":"algorithms helped foreign funds and proprietary trading desks pocket \u003cFIVE_HUNDRED\u003e billion rupees \u003cSEVEN_\u003e billion in gross profits from trading indian equity derivatives a study by the nation s market regulator showed the bulk of the gains came at the expense of individual traders and others who lost a combined \u003cSIX_HUNDRED\u003e billion rupees dabbling in futures and options in the financial year ended march according to the study published monday the size of profits raked in by high frequency trading firms shows how individual traders face long odds when competing against larger and better funded players india s \u003cFOUR_\u003e trillion derivatives market grabbed global attention in april after us based jane street group revealed that a strategy used in the country generated \u003cONE_\u003e billion in profits nine out of every \u003cONE_TEN\u003e retail traders in the derivatives market lost money during the three year period ended march with only \u003cONE_PERCENT\u003e making profits of over \u003cONE_HUNDRED_THOUSAND\u003e rupees more than \u003cSEVEN_TEN_PERCENT\u003e of the \u003cONE_TEN\u003e million individual traders in india declared annual income of less than \u003cFIVE_HUNDRED_THOUSAND\u003e rupees the study showed","timestamp":"2024-09-24T06:40:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}