{"url":"https://www.livemint.com/market/stock-market-news/sebi-board-to-meet-amid-growing-pressure-on-chairperson-madhabi-buch-over-conflict-of-interest-allegations-11727661099507.html","title":"SEBI board meeting today amid growing pressure on Chairperson Madhabi Buch over conflict of interest","description":"Sebi faces internal and external scrutiny as its chairperson faces conflict of interest allegations. Tensions within the regulator have escalated following Hindenburg Research's allegations and Congress party's accusations against Buch.","content":"The Securities and Exchange Board of India (Sebi) is set to convene a crucial board meeting on Monday, its first since allegations of conflict of interest were levelled against chairperson Madhabi Puri Buch. These accusations come from US-based Hindenburg Research and India's Congress party.While the official agenda does not list the conflict of interest issue, sources suggest that it might still be discussed informally. \"Between the last board meeting and Monday's meeting, any significant event concerning the institution, its board members, including the chairperson, has to be taken note of by the board,\" said a person familiar with the matter.Tensions have been mounting since the last board meeting on June 27. During this period, Sebi employees lodged a complaint with the finance ministry, criticising the institution’s \"toxic work culture.\" Initially, Sebi blamed external influences for the unrest but later withdrew this claim following pushback from its staff.In the same period, Hindenburg Research accused Buch and her husband of having investments in offshore funds controlled by Vinod Adani, brother of Adani Group chairman Gautam Adani. These funds were allegedly used to manipulate stock prices of the group's listed companies in India. The report also claimed Sebi had changed rules around real estate investment trusts (REITs) in ways that benefited Blackstone, where Buch’s husband is a senior advisor.Adding to the controversy, the Congress party accused Buch of trading in listed securities and selling employee stock options from her time at ICICI Bank while serving at Sebi. They also alleged she profited from her advisory firm, breaching Sebi’s conflict of interest rules.Buch and Sebi have denied these allegations, but the board has yet to make an official statement. Sebi’s board includes Buch, four whole-time members, and three part-time members from the finance ministry, corporate affairs ministry, and the Reserve Bank of India.","cleaned_content":"the securities and exchange board of india sebi is set to convene a crucial board meeting on monday its first since allegations of conflict of interest were levelled against chairperson madhabi puri buch these accusations come from us based hindenburg research and indias congress party while the official agenda does not list the conflict of interest issue sources suggest that it might still be discussed informally between the last board meeting and mondays meeting any significant event concerning the institution its board members including the chairperson has to be taken note of by the board said a person familiar with the matter tensions have been mounting since the last board meeting on june \u003cTWO_TEN\u003e during this period sebi employees lodged a complaint with the finance ministry criticising the institution s toxic work culture initially sebi blamed external influences for the unrest but later withdrew this claim following pushback from its staff in the same period hindenburg research accused buch and her husband of having investments in offshore funds controlled by vinod adani brother of adani group chairman gautam adani these funds were allegedly used to manipulate stock prices of the groups listed companies in india the report also claimed sebi had changed rules around real estate investment trusts reits in ways that benefited blackstone where buch s husband is a senior advisor adding to the controversy the congress party accused buch of trading in listed securities and selling employee stock options from her time at icici bank while serving at sebi they also alleged she profited from her advisory firm breaching sebi s conflict of interest rules buch and sebi have denied these allegations but the board has yet to make an official statement sebi s board includes buch four whole time members and three part time members from the finance ministry corporate affairs ministry and the reserve bank of india","timestamp":"2024-09-30T07:37:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}