{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-us-stocks-edge-higher-commodity-shares-get-boost-from-china-stimulus-11727185050200.html","title":"Wall Street today: US stocks mixed after weak consumer confidence report, commodity shares rally on China stimulus","description":"At 10:16 a.m., the Dow Jones rose 6.17 points, the S\u0026P 500 lost 9.20 points, and the Nasdaq lost 38.86 points","content":"US stock indices were mixed on Tuesday after weak consumer confidence report, while commodity shares rallied after China unveiled a bumper stimulus package.A Conference Board report showed an index tracking consumer confidence stood at 98.7 in September. The index was revised to 105.6 for August.China's central bank on Tuesday announced a broad set of changes to bolster its economy, including a cut in slew of rates.At 10:16 a.m., the Dow Jones Industrial Average rose 6.17 points, or 0.02 per cent, to 42,133.64, the S\u0026P 500 lost 9.20 points, or 0.17 per cent, to 5,708.95 and the Nasdaq Composite lost 38.86 points, or 0.22 per cent, to 17,935.41.As of 9:35 a.m. Eastern time, the S\u0026P 500 was 0.1 per centhigher, the Dow Jones Industrial Average was up 0.2 per cent, and the Nasdaq Composite was 0.2 per cent higher.At the opening bell, the Dow Jones Industrial Average rose 110.3 points, or 0.26 per cent, to 42234.99. The S\u0026P 500 rose 9.1 points, or 0.16 per cent, to 5727.66, while the Nasdaq Composite rose 72.2 points, or 0.40 per cent, to 18046.442.Among the megacap stocks, Amazon.com, Meta Platforms and Microsoft lost over 1 per cent each.Copper and lithium miners such as Freeport-McMoRan rose 5.9 per cent, Southern Copper gained 7.1 per cent and Albemarle advanced 4.2 per cent and Arcadium climbed 5.8 per cent.In the bond market, Treasury yields ticked higher. The 10-year yield rose to 3.78 per cent from 3.75 per cent late on Monday. The 2-year yield was steady at 3.59 per cent.Oil prices jumped more than 2 per cent on Tuesday on news of monetary stimulus from China.Brent crude futures were up $1.79, or 2.4 per cent, at $75.69 a barrel by 1320 GMT. US WTI crude futures rose $1.87, or 2.7 per cent, to $72.24.Gold prices surged to a record high on Tuesday on US rate cut momentum and China stimulus measures.Spot gold rose 0.2 per cent to $2,633.25 per ounce by 1100 GMT after hitting a record of $2,639.95 earlier in the day. US gold futures gained 0.2 per centto $2,657.90.Spot silver rose 0.7 per cent to $30.87.","cleaned_content":"us stock indices were mixed on tuesday after weak consumer confidence report while commodity shares rallied after china unveiled a bumper stimulus package a conference board report showed an index tracking consumer confidence stood at \u003cNINE_TEN\u003e in september the index was revised to \u003cONE_HUNDRED\u003e for august chinas central bank on tuesday announced a broad set of changes to bolster its economy including a cut in slew of rates at \u003cONE_TEN\u003e \u003cONE_TEN\u003e a m the dow jones industrial average rose \u003cSIX_\u003e points or \u003cZERO_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e the s p \u003cFIVE_HUNDRED\u003e lost \u003cNINE_\u003e points or \u003cZERO_PERCENT\u003e to \u003cFIVE_THOUSAND\u003e and the nasdaq composite lost \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e as of \u003cNINE_\u003e \u003cTHREE_TEN\u003e a m eastern time the s p \u003cFIVE_HUNDRED\u003e was \u003cZERO_PERCENT\u003e higher the dow jones industrial average was up \u003cZERO_PERCENT\u003e and the nasdaq composite was \u003cZERO_PERCENT\u003e higher at the opening bell the dow jones industrial average rose \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e the s p \u003cFIVE_HUNDRED\u003e rose \u003cNINE_\u003e points or \u003cZERO_PERCENT\u003e to \u003cFIVE_THOUSAND\u003e while the nasdaq composite rose \u003cSEVEN_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e among the megacap stocks amazon com meta platforms and microsoft lost over \u003cONE_PERCENT\u003e each copper and lithium miners such as freeport mcmoran rose \u003cFIVE_PERCENT\u003e southern copper gained \u003cSEVEN_PERCENT\u003e and albemarle advanced \u003cFOUR_PERCENT\u003e and arcadium climbed \u003cFIVE_PERCENT\u003e in the bond market treasury yields ticked higher the \u003cONE_TEN\u003e year yield rose to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e late on monday the \u003cTWO_\u003e year yield was steady at \u003cTHREE_PERCENT\u003e oil prices jumped more than \u003cTWO_PERCENT\u003e on tuesday on news of monetary stimulus from china brent crude futures were up \u003cONE_\u003e or \u003cTWO_PERCENT\u003e at \u003cSEVEN_TEN\u003e a barrel by \u003cONE_THOUSAND\u003e gmt us wti crude futures rose \u003cONE_\u003e or \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e gold prices surged to a record high on tuesday on us rate cut momentum and china stimulus measures spot gold rose \u003cZERO_PERCENT\u003e to \u003cTWO_THOUSAND\u003e per ounce by \u003cONE_THOUSAND\u003e gmt after hitting a record of \u003cTWO_THOUSAND\u003e earlier in the day us gold futures gained \u003cZERO_PERCENT\u003e to \u003cTWO_THOUSAND\u003e spot silver rose \u003cZERO_PERCENT\u003e to \u003cTHREE_TEN\u003e","timestamp":"2024-09-24T20:53:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}