{"url":"https://www.livemint.com/market/stock-market-news/mcap-of-top-8-most-valued-firms-surges-rs-1-21-lakh-crore-reliance-industries-biggest-winner-among-top-10-companies-11727596742683.html","title":"Mcap of top 8 most valued firms surges  ₹1.21 lakh crore; Reliance Industries biggest winner among top 10 companies","description":"Reliance Industries Ltd retained the highest ranking in the chart of the most valued firms, followed by TCS, HDFC Bank, Bharti Airtel, ICICI Bank, Infosys, State Bank of India, Hindustan Unilever, ITC and LIC","content":"The combined market valuation of eight of the top 10 most valued firms surged  ₹1,21,270.83 crore last week. Reliance Industries became the biggest gainer, in line with an outstanding rally in benchmark equity indices. Last week, the BSE benchmark jumped 1,027.54 points or 1.21 per cent. The 30-share BSE Sensex hit its previous record high of 85,978.25 on Friday.Reliance Industries Ltd (RIL) retained the highest ranking in the chart of the most valued firms, followed by TCS, HDFC Bank, Bharti Airtel, ICICI Bank, Infosys, State Bank of India, Hindustan Unilever, ITC and LIC. Mukesh Ambani-led RIL's mcap jumped  ₹53,652.92 crore to  ₹20,65,197.60 crore.Also Read: Week Ahead: Auto sales, SEBI board meet, FII inflows, global cues among key market triggers as Nifty eyes 26,500State Bank of India added  ₹18,518.57 crore, taking its valuation to  ₹7,16,333.98 crore. Bharti Airtel's market valuation soared  ₹13,094.52 crore to  ₹9,87,904.63 crore and that of ITC grew by  ₹9,927.3 crore to  ₹6,53,834.72 crore. The market capitalisation (mcap) of Tata Consultancy Services (TCS) surged  ₹8,592.96 crore to  ₹15,59,052 crore.HDFC Bank's valuation climbed  ₹8,581.64 crore to  ₹13,37,186.93 crore and that of Life Insurance Corporation of India (LIC) zoomed  ₹8,443.87 crore to  ₹6,47,616.51 crore. The mcap of Infosys went up by  ₹459.05 crore to  ₹7,91,897.44 crore. However, the market valuation of ICICI Bank tumbled  ₹23,706.16 crore to  ₹9,20,520.72 crore. The mcap of Hindustan Unilever declined by  ₹3,195.44 crore to  ₹6,96,888.77 crore.The Indian stock market closed September on a remarkably positive note after picking up an invincible bullish rally largely driven by strong global cues. The market's bullish rally was fueled by the supersized 50-basis-point (bps) rate cut by the US Federal Reserve, which showed no significant concerns about the US economy and China's monetary stimulus.Also Read: Nifty 50 unbeatable since outsized US Fed rate cut: What should be your trading strategy amid high valuations?As the new month begins, investors will closely monitor key market triggers such as domestic and global macroeconomic data, auto sales data, second-quarter corporate updates, market watchdog's board meeting, primary market action, foreign fund inflows, crude oil prices, and global cues. Investors will see intense action in the domestic and corporate sectors in the first week of October.Domestic equity benchmarks Sensex and Nifty 50 achieved fresh record highs for six consecutive sessions and logged a third straight weekly gain. The remarkable performance was primarily fueled by a robust rally in metals and financial stocks, which have seen significant buying interest amid improving global and domestic cues.After a strong start, the benchmark indices moved within a narrow range during the initial sessions. However, a sharp rally on Thursday allowed the indices to resume their uptrend. The continued optimism in the US markets and China’s newly announced stimulus measures contributed to the positive sentiment.Also Read: Upcoming IPOs: 3 new public issues, 12 listings to keep primary market buzzing this week; Full list hereThe Nifty 50 rose by 0.23 per cent, reaching a fresh all-time high of 26,277 during Friday's trade before closing with a 0.14 per cent drop at 26,199. Notably, this marked the third straight session where the NSE index closed above the crucial psychological level of 26,000.Similarly, the S\u0026P BSE Sensex hit a new peak of 85,978, climbing 0.16 per cent. It ended the session at 85,615, a 0.30 per cent fall from its previous close, but stayed above the 85,000 mark for the third consecutive session. On the weekly front, the 30-share BSE benchmark jumped 1,027.54 points or 1.21 per cent, while the Nifty surged 388 points or 1.50 per cent.“Nifty consolidated on the last day after witnessing a run-up above 26k during the week. We expect the positive momentum to continue in the market driven by frontline stocks. While on the sectorial front, the focus could shift towards IT \u0026 Banking space as companies would release their pre-quarterly updates next week. Auto Sector will also be in focus next week as OEMs will announce their monthly sales data,” said Siddhartha Khemka, Head - Research, Wealth Management, Motilal Oswal Financial Services Ltd.","cleaned_content":"the combined market valuation of eight of the top \u003cONE_TEN\u003e most valued firms surged \u003cONE_HUNDRED_THOUSAND\u003e crore last week reliance industries became the biggest gainer in line with an outstanding rally in benchmark equity indices last week the bse benchmark jumped \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e the \u003cTHREE_TEN\u003e share bse sensex hit its previous record high of \u003cEIGHT_TEN_THOUSAND\u003e on friday reliance industries ltd ril retained the highest ranking in the chart of the most valued firms followed by tcs hdfc bank bharti airtel icici bank infosys state bank of india hindustan unilever itc and lic mukesh ambani led rils mcap jumped \u003cFIVE_TEN_THOUSAND\u003e crore to \u003cTWO_MILLION\u003e crore also read week ahead auto sales sebi board meet fii inflows global cues among key market triggers as nifty eyes \u003cTWO_TEN_THOUSAND\u003e state bank of india added \u003cONE_TEN_THOUSAND\u003e crore taking its valuation to \u003cSEVEN_HUNDRED_THOUSAND\u003e crore bharti airtels market valuation soared \u003cONE_TEN_THOUSAND\u003e crore to \u003cNINE_HUNDRED_THOUSAND\u003e crore and that of itc grew by \u003cNINE_THOUSAND\u003e crore to \u003cSIX_HUNDRED_THOUSAND\u003e crore the market capitalisation mcap of tata consultancy services tcs surged \u003cEIGHT_THOUSAND\u003e crore to \u003cONE_MILLION\u003e crore hdfc banks valuation climbed \u003cEIGHT_THOUSAND\u003e crore to \u003cONE_MILLION\u003e crore and that of life insurance corporation of india lic zoomed \u003cEIGHT_THOUSAND\u003e crore to \u003cSIX_HUNDRED_THOUSAND\u003e crore the mcap of infosys went up by \u003cFOUR_HUNDRED\u003e crore to \u003cSEVEN_HUNDRED_THOUSAND\u003e crore however the market valuation of icici bank tumbled \u003cTWO_TEN_THOUSAND\u003e crore to \u003cNINE_HUNDRED_THOUSAND\u003e crore the mcap of hindustan unilever declined by \u003cTHREE_THOUSAND\u003e crore to \u003cSIX_HUNDRED_THOUSAND\u003e crore the indian stock market closed september on a remarkably positive note after picking up an invincible bullish rally largely driven by strong global cues the markets bullish rally was fueled by the supersized \u003cFIVE_TEN\u003e basis point bps rate cut by the us federal reserve which showed no significant concerns about the us economy and chinas monetary stimulus also read nifty \u003cFIVE_TEN\u003e unbeatable since outsized us fed rate cut what should be your trading strategy amid high valuations as the new month begins investors will closely monitor key market triggers such as domestic and global macroeconomic data auto sales data second quarter corporate updates market watchdogs board meeting primary market action foreign fund inflows crude oil prices and global cues investors will see intense action in the domestic and corporate sectors in the first week of october domestic equity benchmarks sensex and nifty \u003cFIVE_TEN\u003e achieved fresh record highs for six consecutive sessions and logged a third straight weekly gain the remarkable performance was primarily fueled by a robust rally in metals and financial stocks which have seen significant buying interest amid improving global and domestic cues after a strong start the benchmark indices moved within a narrow range during the initial sessions however a sharp rally on thursday allowed the indices to resume their uptrend the continued optimism in the us markets and china s newly announced stimulus measures contributed to the positive sentiment also read upcoming ipos \u003cTHREE_\u003e new public issues \u003cONE_TEN\u003e listings to keep primary market buzzing this week full list herethe nifty \u003cFIVE_TEN\u003e rose by \u003cZERO_PERCENT\u003e reaching a fresh all time high of \u003cTWO_TEN_THOUSAND\u003e during fridays trade before closing with a \u003cZERO_PERCENT\u003e drop at \u003cTWO_TEN_THOUSAND\u003e notably this marked the third straight session where the nse index closed above the crucial psychological level of \u003cTWO_TEN_THOUSAND\u003e similarly the s p bse sensex hit a new peak of \u003cEIGHT_TEN_THOUSAND\u003e climbing \u003cZERO_PERCENT\u003e it ended the session at \u003cEIGHT_TEN_THOUSAND\u003e a \u003cZERO_PERCENT\u003e fall from its previous close but stayed above the \u003cEIGHT_TEN_THOUSAND\u003e mark for the third consecutive session on the weekly front the \u003cTHREE_TEN\u003e share bse benchmark jumped \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e while the nifty surged \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e nifty consolidated on the last day after witnessing a run up above \u003cTWO_TEN\u003e k during the week we expect the positive momentum to continue in the market driven by frontline stocks while on the sectorial front the focus could shift towards it banking space as companies would release their pre quarterly updates next week auto sector will also be in focus next week as oems will announce their monthly sales data said siddhartha khemka head research wealth management motilal oswal financial services ltd","timestamp":"2024-09-29T13:31:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}