{"url":"https://www.livemint.com/market/stock-market-news/hfcl-share-price-jumps-5-to-52-week-high-on-deal-to-supply-drone-sub-systems-to-general-atomics-11727067617829.html","title":"HFCL share price jumps 5% to 52-week high on deal to supply Drone sub-systems to General Atomics","description":"HFCL share price has risen over 10% in one month and more than 36% in three months. The stock is up over 96% year-to-date (YTD) and has given multibagger returns of over 128% in one year.","content":"HFCL share price rallied over 5% to a 52-week high after the company announced its strategic partnership with General Atomics Aeronautical Systems Incorporated (GA-ASI). The multibagger stock, HFCL shares rose as much as 5.71% to a fresh high of  ₹171 apiece on the BSE.HFCL said it has been selected to develop and supply critical sub-systems for GA-ASI’s advanced Unmanned Aircraft Systems (UAS). The collaboration envisions development of critical sub-systems for GA-ASI’s current and future UAV platforms reflecting India's growing investment in advanced defence technologies.“A critical radar sub-system is being developed by HFCL for UAVs showcases HFCL’s technical excellence. This key payload component is known for its compact and lightweight design and adheres to the highest environmental and MIL-STD specifications,” HFCL said in a stock exchange filing on Sunday.HFCL is actively developing a Drone Detection Radar, set to become a crucial element in modern drone detection systems. Its ongoing R\u0026D initiatives encompass a wide array of radar technologies, including Ground Surveillance Radars, Weather Radars, Threat Emulators, LTE-based Passive Radars, Fog and Foliage Penetration Radars, Coastal Surveillance Radars, Avalanche Detection Radars, Muzzle Velocity Radars and Altimeters.HFCL shares also traded ex-dividend on Monday. The company had announced a dividend of  ₹0.20 per share. The Record Date for the purpose of determining the name of members for entitlement of dividend is Monday, September 23, 2024.HFCL specialises in creating digital networks for telcos, enterprises and governments.HFCL share price has risen over 10% in one month and more than 36% in three months. The stock is up over 96% year-to-date (YTD) and has given multibagger returns of over 128% in one year.At 10:35 am, HFCL shares were trading 2.10% higher at  ₹165.15 apiece on the BSE.","cleaned_content":"hfcl share price rallied over \u003cFIVE_PERCENT\u003e to a \u003cFIVE_TEN\u003e week high after the company announced its strategic partnership with general atomics aeronautical systems incorporated ga asi the multibagger stock hfcl shares rose as much as \u003cFIVE_PERCENT\u003e to a fresh high of \u003cONE_HUNDRED\u003e apiece on the bse hfcl said it has been selected to develop and supply critical sub systems for ga asi s advanced unmanned aircraft systems uas the collaboration envisions development of critical sub systems for ga asi s current and future uav platforms reflecting indias growing investment in advanced defence technologies a critical radar sub system is being developed by hfcl for uavs showcases hfcl s technical excellence this key payload component is known for its compact and lightweight design and adheres to the highest environmental and mil std specifications hfcl said in a stock exchange filing on sunday hfcl is actively developing a drone detection radar set to become a crucial element in modern drone detection systems its ongoing r d initiatives encompass a wide array of radar technologies including ground surveillance radars weather radars threat emulators lte based passive radars fog and foliage penetration radars coastal surveillance radars avalanche detection radars muzzle velocity radars and altimeters hfcl shares also traded ex dividend on monday the company had announced a dividend of \u003cZERO_\u003e per share the record date for the purpose of determining the name of members for entitlement of dividend is monday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e hfcl specialises in creating digital networks for telcos enterprises and governments hfcl share price has risen over \u003cONE_TEN_PERCENT\u003e in one month and more than \u003cTHREE_TEN_PERCENT\u003e in three months the stock is up over \u003cNINE_TEN_PERCENT\u003e year to date ytd and has given multibagger returns of over \u003cONE_HUNDRED_PERCENT\u003e in one year at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e am hfcl shares were trading \u003cTWO_PERCENT\u003e higher at \u003cONE_HUNDRED\u003e apiece on the bse","timestamp":"2024-09-23T10:36:00+05:30","market_timestamp":"2024-09-23T10:36:00+05:30","off_market_hours":false}