{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-100-hits-52-week-high-after-bulk-deals-soars-almost-240-ytd-11727159125320.html","title":"Small-cap stock below  ₹100 hits 52-week high after bulk deals; soars almost 240% YTD","description":"Small-cap stock: Arnold Holdings shares rose over 4% to a new 52-week high, a day after witnessing bulk deals. However, the stock quickly lost momentum, dropping over 6%. The stock has soared almost 240% year-to-date (YTD).","content":"Small-cap stock: Arnold Holdings shares surged over 4 per cent in early Tuesday trading, reaching a fresh 52-week high of  ₹74.70 on the BSE, following a flurry of bulk deals the previous day. However, the momentum quickly faded, with the stock erasing all gains and slipping into the red. Arnold Holdings share price opened at  ₹72 against its previous close of  ₹71.70 and jumped 4.2 per cent to hit its 52-week high of  ₹74.70. The stock, however, soon erased all gains and dropped as much as 6.3 per cent to the level of  ₹67.20. Subsequently, paring losses, the stock traded 0.28 per cent lower at  ₹71.50 apiece around 11:50 am.BSE data shows that the small-cap counter saw six bulk deals on Monday-three buys and three sells. Among the buyers, Navratri Share Trading Private Limited bought 11.70 lakh shares of the company at a price of  ₹71.61 apiece. Mansi Share \u0026 Stock Advisors Private Limited bought 3.50 lakh shares, and Multiplier Share And Stock Advisors Private Limited bought 1.50 lakh shares at a price of  ₹71.70 each.On the other hand, Raudramukhi Commerce Private Limited sold 1,139,200 shares, Nirmal Lunkar sold 305,000 shares, and Bhuvneshwari Vyapaar Private Limited sold 178,689 shares of the company at an average price of  ₹71.70 each.The stock has seen an exorbitant gain over the last year. It hit its 52-week low of  ₹16.90 on October 5 last year. From that level, it surged 342 per cent to scale its fresh one-year high today. Year-to-date (YTD), the stock has gained nearly 240 per cent.Arnold Holdings, incorporated in 1981, is a non-banking financial company (NBFC) that has diversified into multiple financial sectors, including corporate finance, infrastructure finance, mortgage and loans, and the capital market.In addition to its private equity practice, Arnold Holdings has invested in the real estate sector, establishing various funds at key points in the real estate cycle.According to the company, its digital lending platform, Tradofina App, offers several kinds of loans, including online purchase loans, consumer durable loans, and personal loans. Arnold Holdings, regulated by the Reserve Bank of India, finances these loans.Read all market-related news here","cleaned_content":"small cap stock arnold holdings shares surged over \u003cFOUR_PERCENT\u003e in early tuesday trading reaching a fresh \u003cFIVE_TEN\u003e week high of \u003cSEVEN_TEN\u003e on the bse following a flurry of bulk deals the previous day however the momentum quickly faded with the stock erasing all gains and slipping into the red arnold holdings share price opened at \u003cSEVEN_TEN\u003e against its previous close of \u003cSEVEN_TEN\u003e and jumped \u003cFOUR_PERCENT\u003e to hit its \u003cFIVE_TEN\u003e week high of \u003cSEVEN_TEN\u003e the stock however soon erased all gains and dropped as much as \u003cSIX_PERCENT\u003e to the level of \u003cSIX_TEN\u003e subsequently paring losses the stock traded \u003cZERO_PERCENT\u003e lower at \u003cSEVEN_TEN\u003e apiece around \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e am bse data shows that the small cap counter saw six bulk deals on monday three buys and three sells among the buyers navratri share trading private limited bought \u003cONE_TEN\u003e lakh shares of the company at a price of \u003cSEVEN_TEN\u003e apiece mansi share stock advisors private limited bought \u003cTHREE_\u003e lakh shares and multiplier share and stock advisors private limited bought \u003cONE_\u003e lakh shares at a price of \u003cSEVEN_TEN\u003e each on the other hand raudramukhi commerce private limited sold \u003cONE_MILLION\u003e shares nirmal lunkar sold \u003cTHREE_HUNDRED_THOUSAND\u003e shares and bhuvneshwari vyapaar private limited sold \u003cONE_HUNDRED_THOUSAND\u003e shares of the company at an average price of \u003cSEVEN_TEN\u003e each the stock has seen an exorbitant gain over the last year it hit its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e on october \u003cFIVE_\u003e last year from that level it surged \u003cTHREE_HUNDRED_PERCENT\u003e to scale its fresh one year high today year to date ytd the stock has gained nearly \u003cTWO_HUNDRED_PERCENT\u003e arnold holdings incorporated in \u003cONE_THOUSAND\u003e is a non banking financial company nbfc that has diversified into multiple financial sectors including corporate finance infrastructure finance mortgage and loans and the capital market in addition to its private equity practice arnold holdings has invested in the real estate sector establishing various funds at key points in the real estate cycle according to the company its digital lending platform tradofina app offers several kinds of loans including online purchase loans consumer durable loans and personal loans arnold holdings regulated by the reserve bank of india finances these loans read all market related news here","timestamp":"2024-09-24T12:24:00+05:30","market_timestamp":"2024-09-24T12:24:00+05:30","off_market_hours":false}