{"url":"https://www.livemint.com/market/stock-market-news/weekend-wrap-september-27-stock-market-mahindra-mahindra-top-market-movers-and-news-of-week-mutual-funds-11727438459038.html","title":"Weekend Wrap: From Vedanta to GAIL, top market movers and news of week","description":"Stock market: Presenting a comprehensive recap of the week's highlights, spanning from top news to market performance, here's your market wrap for the week concluding on September 27, 2024.","content":"The Securities and Exchange Board of India (SEBI) has introduced a new directive concerning the use of the Unified Payments Interface (UPI) for individual investors. According to SEBI’s recent circular, starting November 1, 2024, individual investors can apply for public issues of debt securities, non-convertible preference shares, municipal debt securities, and securitized debt instruments through intermediaries using UPI for amounts up to  ₹5 lakh.This move is aimed at streamlining the application process and making it more accessible for retail investors. The initiative is expected to enhance participation in these markets and provide a convenient payment method for individualsSeveral companies made strong debuts in the IPO market, with Western Carriers (India) getting listed at a premium of 5.81 percent over its issue price of  ₹172 per share. Arkade Developers saw an even stronger debut, listing at a premium of 37 percent over its issue price of  ₹128 per share, reflecting strong investor confidence in the real estate sector. Northern Arc Capital also performed well, debuting with a premium of 33.46 percent over its issue price of  ₹263 per share.In terms of IPO demand, several companies recorded substantial oversubscription rates. Manba Finance’s IPO was oversubscribed by 224.05 times, showing significant interest from both retail and institutional investors. KRN Heat Exchanger also experienced strong demand, with its IPO oversubscribed by 212.93 times. Diffusion Engineers saw an oversubscription rate of 27.47 times, indicating robust demand in the engineering sector.Three prominent asset management companies—Whiteoak Capital, Groww, and Baroda BNP Paribas—have rolled out exciting New Fund Offers (NFOs), providing investors fresh opportunities to tap into India’s evolving sectors. Whiteoak Capital AMC has launched the Digital Bharat Fund, which focuses on India’s ongoing digital revolution. With a closing date of October 4, 2024, this fund allows investors to participate in sectors driving the country's technological advancement.Meanwhile, Groww AMC introduces the Nifty India Defence ETF Fund, which closes on October 4, 2024. As India strengthens its defence sector, this ETF offers an accessible way for investors to align with the nation's increasing defence capabilities. Baroda BNP Paribas AMC brings forward the Nifty 200 Momentum 30 Fund, also closing on October 4, 2024. This fund targets the top 30 momentum-driven stocks from the Nifty 200, providing an opportunity for those seeking growth through a dynamic stock selection approach.Kuvera is a free direct mutual fund investing platform. Unless otherwise stated data sourced from BSE, NSE and kuvera.","cleaned_content":"the securities and exchange board of india sebi has introduced a new directive concerning the use of the unified payments interface upi for individual investors according to sebi s recent circular starting november \u003cONE_\u003e \u003cTWO_THOUSAND\u003e individual investors can apply for public issues of debt securities non convertible preference shares municipal debt securities and securitized debt instruments through intermediaries using upi for amounts up to \u003cFIVE_\u003e lakh this move is aimed at streamlining the application process and making it more accessible for retail investors the initiative is expected to enhance participation in these markets and provide a convenient payment method for individualsseveral companies made strong debuts in the ipo market with western carriers india getting listed at a premium of \u003cFIVE_PERCENT\u003e over its issue price of \u003cONE_HUNDRED\u003e per share arkade developers saw an even stronger debut listing at a premium of \u003cTHREE_TEN_PERCENT\u003e over its issue price of \u003cONE_HUNDRED\u003e per share reflecting strong investor confidence in the real estate sector northern arc capital also performed well debuting with a premium of \u003cTHREE_TEN_PERCENT\u003e over its issue price of \u003cTWO_HUNDRED\u003e per share in terms of ipo demand several companies recorded substantial oversubscription rates manba finance s ipo was oversubscribed by \u003cTWO_HUNDRED\u003e times showing significant interest from both retail and institutional investors krn heat exchanger also experienced strong demand with its ipo oversubscribed by \u003cTWO_HUNDRED\u003e times diffusion engineers saw an oversubscription rate of \u003cTWO_TEN\u003e times indicating robust demand in the engineering sector three prominent asset management companies whiteoak capital groww and baroda bnp paribas have rolled out exciting new fund offers nfos providing investors fresh opportunities to tap into india s evolving sectors whiteoak capital amc has launched the digital bharat fund which focuses on india s ongoing digital revolution with a closing date of october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e this fund allows investors to participate in sectors driving the countrys technological advancement meanwhile groww amc introduces the nifty india defence etf fund which closes on october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e as india strengthens its defence sector this etf offers an accessible way for investors to align with the nations increasing defence capabilities baroda bnp paribas amc brings forward the nifty \u003cTWO_HUNDRED\u003e momentum \u003cTHREE_TEN\u003e fund also closing on october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e this fund targets the top \u003cTHREE_TEN\u003e momentum driven stocks from the nifty \u003cTWO_HUNDRED\u003e providing an opportunity for those seeking growth through a dynamic stock selection approach kuvera is a free direct mutual fund investing platform unless otherwise stated data sourced from bse nse and kuvera","timestamp":"2024-09-28T11:37:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}