{"url":"https://www.livemint.com/market/stock-market-news/sjvn-stock-surges-5-following-psu-agreement-with-maharashtra-government-11727436566979.html","title":"SJVN stock surges 5% following PSU agreement with Maharashtra government","description":"The multibagger stock increased by 5.71 per cent to  ₹133.20 in today's session on the BSE. The company's market capitalization is  ₹52,266 crore. On the BSE, 21.35 lakh shares were traded, resulting in a turnover of  ₹27.89 crore.","content":"State-run SJVN's shares surged by almost 5 per cent on Friday following the company's announcement to exchanges about securing two MoUs with the Maharashtra government for power project development. The estimated total investment for these projects is around  ₹48,000 crore.The Navratna CPSE announced today that it has entered into two Memorandums of Understanding (MoUs) with the Maharashtra government for the development of Pumped Storage Projects (PSPs) and Floating Solar Projects (FSPs) within the state.The initial Memorandum of Understanding (MoU) was signed between SJVN and the Department of Water Resources for the development of five Pumped Storage Projects with a total capacity of 8,100 MW.The second Memorandum of Understanding (MoU) was executed between SJVN and Maharashtra State Power Generation Company (MAHAGENCO) for the development of a 505 MW floating solar project at Lower Wardha Dam in Maharashtra.\"The phased development will ensure optimal use of existing power evacuation infrastructure and will provide a sustainable and reliable energy source for the region,\" the company filing said.The 505 MW floating solar project will be executed in two phases: the initial phase will involve 100 MW, and the subsequent phase will cover 405 MW.The 8100 MW Pumped Storage Projects encompass the following: the 800 MW Kolmondapada, 1500 MW Sidgarh, 2000 MW Chornai, 1800 MW Baitarni, and 2000 MW Jalvara Pumped Storage Projects.This MoU will enable SJVN to conduct surveys and investigations, prepare the Detailed Project Reports (DPR), and establish the aforementioned projects in Maharashtra in a timely manner, in accordance with the applicable rules of both the Central and state governments.The PSPs are essential for energy storage, stabilizing the grid, and meeting peak electricity demand, thereby ensuring that the state of Maharashtra receives reliable and clean energy, according to the company's filing.The multibagger stock increased by 5.71 per cent to  ₹133.20 in today's session on the BSE. The company's market capitalization is  ₹52,266 crore. On the BSE, 21.35 lakh shares were traded, resulting in a turnover of  ₹27.89 crore.","cleaned_content":"state run sjvns shares surged by almost \u003cFIVE_PERCENT\u003e on friday following the companys announcement to exchanges about securing two mous with the maharashtra government for power project development the estimated total investment for these projects is around \u003cFOUR_TEN_THOUSAND\u003e crore the navratna cpse announced today that it has entered into two memorandums of understanding mous with the maharashtra government for the development of pumped storage projects psps and floating solar projects fsps within the state the initial memorandum of understanding mou was signed between sjvn and the department of water resources for the development of five pumped storage projects with a total capacity of \u003cEIGHT_THOUSAND\u003e mw the second memorandum of understanding mou was executed between sjvn and maharashtra state power generation company mahagenco for the development of a \u003cFIVE_HUNDRED\u003e mw floating solar project at lower wardha dam in maharashtra the phased development will ensure optimal use of existing power evacuation infrastructure and will provide a sustainable and reliable energy source for the region the company filing said the \u003cFIVE_HUNDRED\u003e mw floating solar project will be executed in two phases the initial phase will involve \u003cONE_HUNDRED\u003e mw and the subsequent phase will cover \u003cFOUR_HUNDRED\u003e mw the \u003cEIGHT_THOUSAND\u003e mw pumped storage projects encompass the following the \u003cEIGHT_HUNDRED\u003e mw kolmondapada \u003cONE_THOUSAND\u003e mw sidgarh \u003cTWO_THOUSAND\u003e mw chornai \u003cONE_THOUSAND\u003e mw baitarni and \u003cTWO_THOUSAND\u003e mw jalvara pumped storage projects this mou will enable sjvn to conduct surveys and investigations prepare the detailed project reports dpr and establish the aforementioned projects in maharashtra in a timely manner in accordance with the applicable rules of both the central and state governments the psps are essential for energy storage stabilizing the grid and meeting peak electricity demand thereby ensuring that the state of maharashtra receives reliable and clean energy according to the companys filing the multibagger stock increased by \u003cFIVE_PERCENT\u003e to \u003cONE_HUNDRED\u003e in todays session on the bse the companys market capitalization is \u003cFIVE_TEN_THOUSAND\u003e crore on the bse \u003cTWO_TEN\u003e lakh shares were traded resulting in a turnover of \u003cTWO_TEN\u003e crore","timestamp":"2024-09-27T17:30:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}