{"url":"https://www.livemint.com/market/stock-market-news/multibagger-it-stock-blue-cloud-softech-solutions-sets-board-meeting-date-to-consider-stock-split-details-here-11727404203824.html","title":"Multibagger IT stock sets board meeting date to consider stock split. Details here","description":"Multibagger stock: Blue Cloud Softech Solutions is set to discuss a potential stock split at its upcoming board meeting scheduled for October 16, 2024","content":"Multibagger IT stock: Blue Cloud Softech Solutions Limited, a Hyderabad-based IT firm, has announced a board meeting scheduled for October 16, 2024, at 4:00 PM. The meeting will discuss a potential stock split of the company’s equity shares.In a statement to the Bombay Stock Exchange (BSE), the company cited Regulation 29(3)(a) of SEBI's Listing Obligations and Disclosure Requirements as the basis for the meeting. The proposal includes the sub-division of shares under Section 61(1)(d) of the Companies Act, 2013.In connection with this upcoming board meeting, Blue Cloud Softech Solutions has implemented a trading window closure starting on September 27, 2024. This window will remain closed until 48 hours after the financial results for the second quarter and half-year ending September 30, 2024, are made public. The company cited its Code of Insider Trading Regulations and SEBI’s Prohibition of Insider Trading Regulations, 2015, as the basis for this decision.Shares of multibagger IT firm Blue Cloud Softech Solutions Ltd rose by 1.66 per cent on September 26, closing at  ₹171.00 per share. The company, which has provided returns of 192 per cent over the last six months but has dipped 21 per cent in the last month, currently holds a market capitalization of  ₹3,730.21 crore.Shares of Blue Cloud Softech Solutions have been on a remarkable upward trajectory. On September 24, 2024, the stock surged 5 per cent to hit its upper circuit limit for the second consecutive day, closing at  ₹160.20.Blue Cloud Softech has delivered exceptional returns to its investors, solidifying its status as a multi-bagger stock. According to BSE analytics, the stock has surged an impressive 182 per cent in just the last six months, more than doubling investor wealth. Over a two-year period, the stock has soared 877%, and in the last three years, it has appreciated by a staggering 1,400%.Foreign Institutional Investors (FIIs) hold a notable 22.93 per cent stake in Blue Cloud Softech Solutions, indicating strong overseas investor interest. The company’s promoters own 34.01 per cent, while non-institutional investors account for the remaining 43.05 per cent.","cleaned_content":"multibagger it stock blue cloud softech solutions limited a hyderabad based it firm has announced a board meeting scheduled for october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cFOUR_\u003e \u003cZERO_\u003e pm the meeting will discuss a potential stock split of the company s equity shares in a statement to the bombay stock exchange bse the company cited regulation \u003cTWO_TEN\u003e \u003cTHREE_\u003e a of sebis listing obligations and disclosure requirements as the basis for the meeting the proposal includes the sub division of shares under section \u003cSIX_TEN\u003e \u003cONE_\u003e d of the companies act \u003cTWO_THOUSAND\u003e in connection with this upcoming board meeting blue cloud softech solutions has implemented a trading window closure starting on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e this window will remain closed until \u003cFOUR_TEN\u003e hours after the financial results for the second quarter and half year ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e are made public the company cited its code of insider trading regulations and sebi s prohibition of insider trading regulations \u003cTWO_THOUSAND\u003e as the basis for this decision shares of multibagger it firm blue cloud softech solutions ltd rose by \u003cONE_PERCENT\u003e on september \u003cTWO_TEN\u003e closing at \u003cONE_HUNDRED\u003e per share the company which has provided returns of \u003cONE_HUNDRED_PERCENT\u003e over the last six months but has dipped \u003cTWO_TEN_PERCENT\u003e in the last month currently holds a market capitalization of \u003cTHREE_THOUSAND\u003e crore shares of blue cloud softech solutions have been on a remarkable upward trajectory on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the stock surged \u003cFIVE_PERCENT\u003e to hit its upper circuit limit for the second consecutive day closing at \u003cONE_HUNDRED\u003e blue cloud softech has delivered exceptional returns to its investors solidifying its status as a multi bagger stock according to bse analytics the stock has surged an impressive \u003cONE_HUNDRED_PERCENT\u003e in just the last six months more than doubling investor wealth over a two year period the stock has soared \u003cEIGHT_HUNDRED_PERCENT\u003e and in the last three years it has appreciated by a staggering \u003cONE_THOUSAND_PERCENT\u003e foreign institutional investors fiis hold a notable \u003cTWO_TEN_PERCENT\u003e stake in blue cloud softech solutions indicating strong overseas investor interest the company s promoters own \u003cTHREE_TEN_PERCENT\u003e while non institutional investors account for the remaining \u003cFOUR_TEN_PERCENT\u003e","timestamp":"2024-09-27T08:42:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}