{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-under-rs-50-bhatia-communications-share-price-jumps-over-4-on-loan-agreement-with-interlink-warehousing-11727069263813.html","title":"Penny stock under  ₹50: Bhatia Communications share price jumps over 4% on loan agreement with Interlink Warehousing","description":"Penny stock under  ₹50: Bhatia Communications \u0026 Retail will provide an unsecured loan of  ₹5 crore with an interest rate of 15% p.a. to Interlink Warehousing LLP.","content":"Penny stock under  ₹50: Bhatia Communications \u0026 Retail (India) Ltd share price jumped over 4% on Monday after the company announced entering into a loan agreement. Bhatia Communications \u0026 Retail is a penny stock under  ₹50 which rose as much as 4.4% to  ₹36 apiece on BSE.Bhatia Communications \u0026 Retail has entered into loan agreement with M/s Interlink Warehousing LLP. As per the details of the Inter Corporate Loan agreement, the company will provide an unsecured loan of  ₹5 crore with an interest rate of 15% p.a. to Interlink Warehousing LLP.The date of execution of the loan agreement is September 20, 2024.The loan is to be given for a maximum period of 6 months from 1st Disbursement or as and when demanded by the lender, even earlier, the Bhatia Communications \u0026 Retail said in a BSE filing.Bhatia Communications \u0026 Retail is a smallcap stock that has rallied over 18% in one week and more than 56% in one month. The smallcap stock is up more than 65% in three months and has given robust returns of over 75% year-to-date (YTD) .In the past one year, Bhatia Communications share price has jumped over 55%, while it has surged 119% in three years.At 11:15 am, Bhatia Communications \u0026 Retail shares were trading 1.54% higher at  ₹35.00 apiece on the BSE.","cleaned_content":"penny stock under \u003cFIVE_TEN\u003e bhatia communications retail india ltd share price jumped over \u003cFOUR_PERCENT\u003e on monday after the company announced entering into a loan agreement bhatia communications retail is a penny stock under \u003cFIVE_TEN\u003e which rose as much as \u003cFOUR_PERCENT\u003e to \u003cTHREE_TEN\u003e apiece on bse bhatia communications retail has entered into loan agreement with m s interlink warehousing llp as per the details of the inter corporate loan agreement the company will provide an unsecured loan of \u003cFIVE_\u003e crore with an interest rate of \u003cONE_TEN_PERCENT\u003e p a to interlink warehousing llp the date of execution of the loan agreement is september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the loan is to be given for a maximum period of \u003cSIX_\u003e months from \u003cONE_\u003e st disbursement or as and when demanded by the lender even earlier the bhatia communications retail said in a bse filing bhatia communications retail is a smallcap stock that has rallied over \u003cONE_TEN_PERCENT\u003e in one week and more than \u003cFIVE_TEN_PERCENT\u003e in one month the smallcap stock is up more than \u003cSIX_TEN_PERCENT\u003e in three months and has given robust returns of over \u003cSEVEN_TEN_PERCENT\u003e year to date ytd in the past one year bhatia communications share price has jumped over \u003cFIVE_TEN_PERCENT\u003e while it has surged \u003cONE_HUNDRED_PERCENT\u003e in three years at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am bhatia communications retail shares were trading \u003cONE_PERCENT\u003e higher at \u003cTHREE_TEN\u003e apiece on the bse","timestamp":"2024-09-23T11:16:00+05:30","market_timestamp":"2024-09-23T11:16:00+05:30","off_market_hours":false}