{"url":"https://www.livemint.com/market/stock-market-news/bse-psu-index-jumps-5-in-6-sessions-as-psu-stocks-return-to-action-whats-behind-this-rebound-11727422361987.html","title":"BSE PSU index jumps 5% in 6 sessions as PSU stocks return to action. What’s behind this rebound?","description":"The S\u0026P BSE PSU index has surged nearly 5% in recent sessions, driven by rallies in metal and power stocks. Key contributors include NALCO and NMDC. The recovery is linked to picking up in government capital expenditure after Q1 and the finalization of the National Electricity Plan.","content":"The S\u0026P BSE PSU index experienced a strong resurgence in recent trading sessions following a period of stagnation since mid-July. Over the past six sessions, the index has climbed nearly 5 per cent, largely driven by rallies in metal and power stocks.Leading the charge is NALCO, which surged an impressive 16.70 per cent during this period. It was closely followed by NMDC, which rallied 13.2 per cent, while SAIL and Power Grid Corporation both posted solid gains of 14 per cent and 8.5 per cent, respectively. GAIL and Bharat Heavy Electricals also contributed to the index's recovery, each rising 13 per cent.The rally in PSU stocks is driven by various factors, such as the resumption of new order flows, China's monetary stimulus (boosting metal stocks), and the finalisation of the country's National Electricity Plan (NEP) for 2023-2032 which aims to meet a peak demand of 458 GW by 2032 with an investment of  ₹9.15 lakh crore (driving power sector stocks).Additionally, PSU banks have also shown remarkable recovery during this period.Mohit Khanna, Fund Manager at Purnartha, highlighted that PSU companies have been significant beneficiaries of the government’s increased capital expenditure, securing a large portion of the order inflows, which has kept the PSU stocks buoyant.He noted that during the first quarter of FY25, project announcements and tendering from the government were halted due to the general elections. It wasn't until the new government presented its Union Budget in late July 2024 that order inflows resumed around mid-August, with the government working in a more normalised manner.\"Additionally, as the government has increased its Capex spending by +17% YoY (3.4% of the GDP) to Rs. 11.1 trillion in the current fiscal, we expect to see increased order inflow. The recent rebound in the PSU index reflects this,\" Khanna stated.The current budgeted capital spending of  ₹11.1 trillion for FY25 must be completed by March 2025, but the full-fledged ordering/spending started around August 24, he said, adding that the positive trigger is higher spending in less time.Khanna highlighted that another budget announcement is set to occur in less than six months. The market will be closely watching for indications that the government is committed to maintaining its capital expenditure momentum. He emphasised that the conversion of the order book into actual revenues will be crucial. While a healthy order book provides revenue visibility, it's only the execution capability that translates into real revenue recognition.Khanna believes that companies demonstrating faster execution capabilities will be rewarded by the market as this trend unfolds.Explaining why the PSU banking stocks are seeing traction in recent sessions, Khanna stated that PSU banks have successfully cleaned their books by adequate NPA recognition. This process, coupled with subsequent capital raising, has positioned them to actively engage in the upcoming credit upcycle.\"However, it remains to be seen if they will be prudent in lending this time. But the market is ignoring these risks for some other day and pivoting itself to a possibility that interest rate decline will kick-start the credit growth cycle,\" he added.","cleaned_content":"the s p bse psu index experienced a strong resurgence in recent trading sessions following a period of stagnation since mid july over the past six sessions the index has climbed nearly \u003cFIVE_PERCENT\u003e largely driven by rallies in metal and power stocks leading the charge is nalco which surged an impressive \u003cONE_TEN_PERCENT\u003e during this period it was closely followed by nmdc which rallied \u003cONE_TEN_PERCENT\u003e while sail and power grid corporation both posted solid gains of \u003cONE_TEN_PERCENT\u003e and \u003cEIGHT_PERCENT\u003e respectively gail and bharat heavy electricals also contributed to the indexs recovery each rising \u003cONE_TEN_PERCENT\u003e the rally in psu stocks is driven by various factors such as the resumption of new order flows chinas monetary stimulus boosting metal stocks and the finalisation of the countrys national electricity plan nep for \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e which aims to meet a peak demand of \u003cFOUR_HUNDRED\u003e gw by \u003cTWO_THOUSAND\u003e with an investment of \u003cNINE_\u003e lakh crore driving power sector stocks additionally psu banks have also shown remarkable recovery during this period mohit khanna fund manager at purnartha highlighted that psu companies have been significant beneficiaries of the government s increased capital expenditure securing a large portion of the order inflows which has kept the psu stocks buoyant he noted that during the first quarter of fy25 project announcements and tendering from the government were halted due to the general elections it wasnt until the new government presented its union budget in late july \u003cTWO_THOUSAND\u003e that order inflows resumed around mid august with the government working in a more normalised manner additionally as the government has increased its capex spending by \u003cONE_TEN_PERCENT\u003e yoy \u003cTHREE_PERCENT\u003e of the gdp to rs \u003cONE_TEN\u003e trillion in the current fiscal we expect to see increased order inflow the recent rebound in the psu index reflects this khanna stated the current budgeted capital spending of \u003cONE_TEN\u003e trillion for fy25 must be completed by march \u003cTWO_THOUSAND\u003e but the full fledged ordering spending started around august \u003cTWO_TEN\u003e he said adding that the positive trigger is higher spending in less time khanna highlighted that another budget announcement is set to occur in less than six months the market will be closely watching for indications that the government is committed to maintaining its capital expenditure momentum he emphasised that the conversion of the order book into actual revenues will be crucial while a healthy order book provides revenue visibility its only the execution capability that translates into real revenue recognition khanna believes that companies demonstrating faster execution capabilities will be rewarded by the market as this trend unfolds explaining why the psu banking stocks are seeing traction in recent sessions khanna stated that psu banks have successfully cleaned their books by adequate npa recognition this process coupled with subsequent capital raising has positioned them to actively engage in the upcoming credit upcycle however it remains to be seen if they will be prudent in lending this time but the market is ignoring these risks for some other day and pivoting itself to a possibility that interest rate decline will kick start the credit growth cycle he added","timestamp":"2024-09-27T14:33:00+05:30","market_timestamp":"2024-09-27T14:33:00+05:30","off_market_hours":false}