{"url":"https://www.livemint.com/market/stock-market-news/at-record-highs-why-hsbc-prefers-bajaj-auto-over-tvs-motor-company-11727084729499.html","title":"At record highs! Why HSBC prefers Bajaj Auto over TVS Motor Company?","description":"HSBC prefers Bajaj Auto over TVS Motor, citing better growth prospects and margin resilience. Bajaj's target price is  ₹14,000, while TVS's is increased to  ₹2,800 with a 'hold' rating, reflecting valuation concerns despite both companies' strong fundamentals.","content":"Bajaj Auto vs TVS Motor Company is always a tough choice, global brokerage house HSBC said on Monday, September 23, adding that they both are well-diversified and well-run companies. However, HSBC reaffirmed its preference for Bajaj Auto over TVS Motor, citing better growth prospects and margin resilience.The global financial firm maintained its 'buy' rating on Bajaj Auto with an increased target price of  ₹14,000 (from  ₹11,000), signalling a strong over 17 per cent upside potential for the stock. Simultaneously, HSBC raised its target price for TVS Motor to  ₹2,800 (from  ₹2,400) but kept a 'hold' recommendation, indicating a more cautious stance due to valuation concerns. Currently, the stock is trading at  ₹2817.70.Despite TVS Motor's robust fundamentals, the firm highlighted that its current market valuation appeared too elevated for significant near-term gains.Bajaj Auto has significantly outperformed TVS Motor over the past year, delivering impressive multibagger returns. Bajaj has surged nearly 139 per cent compared to the 88.5 per cent gain recorded by TVS during the same period. In 2024 year-to-date (YTD) performance, Bajaj continued to lead, rallying more than 81 per cent, whereas TVS posted a gain of over 40 per cent.In September, Bajaj has jumped 13 per cent so far, marking its fifth consecutive month of gains. TVS has also recorded its fifth straight month of positive returns but with a more modest 1 per cent rise in the same period.Bajaj Auto reached an all-time high of  ₹12,352.25 during intra-day trading today, marking a remarkable 152 per cent gain from its 52-week low of  ₹4,902.80 in October last year. Meanwhile, TVS also hit a record high of  ₹2,879 during intra-day trades today, September 23, reflecting a 94 per cent increase from its 52-week low of  ₹1,483.40 in September last year.HSBC noted that Bajaj Auto had consistently demonstrated operational resilience with a well-diversified revenue mix across segments. It expected the company to maintain this trend, projecting Bajaj to perform better in growth and margin stability than TVS. The brokerage firm also highlighted Bajaj's CNG bike initiative, which it believed could disrupt the 75cc-125cc two-wheeler market segment by offering consumers significant savings on fuel costs. This would likely attract customers upgrading within this segment, giving Bajaj a distinct first-mover advantage in the CNG bike market.According to HSBC, a key differentiator for Bajaj was the company’s introduction of the CNG-powered bike, the ‘Freedom,’ which had shown promising results in select states. Sales of the CNG bike averaged around 4,000 units per month in just two states, and HSBC projected that these figures could rise to 15,000-20,000 units monthly as the model expands into other regions. The fact that Bajaj is the only original equipment manufacturer (OEM) offering this fuel powertrain gave it a competitive edge in the vast, untapped market segment for cost-conscious customers seeking to save on operational expenses.Both Bajaj and TVS have been aggressive in the electric two-wheeler (E2W) market, with each company launching new variants to capture the growing demand. However, HSBC pointed out that Bajaj had secured a strong foothold as the second-largest OEM in the segment, commanding a 19 per cent market share in August and improving to 21 per cent in September. HSBC noted that the incremental nature of Bajaj’s E2W sales was an added advantage from a stock perspective, further enhancing the company's market positioning and value proposition.According to HSBC, another standout feature for Bajaj was its dominance in the three-wheeler (3W) market. The company had maintained its leadership in this space and made significant strides in the electric three-wheeler (e3W) market, positioning itself for future growth. HSBC also flagged the potential upside for Bajaj’s entry into the electric rickshaw (eRick) segment, a rapidly expanding market. Given that the eRick market is nearly double the size of the 3W market in terms of value, HSBC saw a substantial growth opportunity for Bajaj in this space.HSBC acknowledged that TVS had led the export recovery so far in 2024, largely due to its lower reliance on the African market than Bajaj. For instance, Bajaj’s exports to Nigeria fell sharply from 32 per cent at its peak in FY20 to just 5.4 per cent in FY25. By comparison, TVS saw a smaller decline from 22 per cent to 1.4 per cent over the same period. However, HSBC believed Bajaj was poised to catch up in export growth, particularly as the African market began recovering. Bright spots for Bajaj’s exports included strong performances in Mexico and the UK, while TVS saw robust demand from Guinea and other Latin American markets.Looking at margins, HSBC forecasted stable EBITDA margins for Bajaj in the 20-21 per cent range over FY26/27, supported by its diverse business segments and operational efficiency. While TVS was also expected to continue expanding its margins, HSBC flagged potential risks, suggesting that downside pressures were more likely for TVS than Bajaj in the near term.In terms of valuations, both Bajaj and TVS traded at significant premiums to their historical averages. Bajaj’s valuation was 62 per cent higher than its five-year average, while TVS traded at a 43 per cent premium. However, HSBC saw more upside for Bajaj, arguing that the company’s stable growth outlook, export recovery, and electrification potential justified its valuation expansion. On the other hand, while TVS remained fundamentally solid, the brokerage believed that the company’s higher valuation made further gains in market share more difficult to achieve, particularly as electrification posed a longer-term risk to its scooter segment.In conclusion, HSBC retained its preference for Bajaj Auto, noting that its operational resilience, margin stability, and growth prospects made it a more attractive option than TVS. While both companies exhibited strong fundamentals and aggressive strategies in emerging segments like electric vehicles, Bajaj’s positioning in CNG bikes, three-wheelers, and electric rickshaws gave it a distinctive advantage. Despite the premium valuations of both stocks, Bajaj continued to trade at a 30 per cent discount relative to TVS, further supporting HSBC’s 'buy' recommendation for Bajaj over TVS in the current market scenario.","cleaned_content":"bajaj auto vs tvs motor company is always a tough choice global brokerage house hsbc said on monday september \u003cTWO_TEN\u003e adding that they both are well diversified and well run companies however hsbc reaffirmed its preference for bajaj auto over tvs motor citing better growth prospects and margin resilience the global financial firm maintained its buy rating on bajaj auto with an increased target price of \u003cONE_TEN_THOUSAND\u003e from \u003cONE_TEN_THOUSAND\u003e signalling a strong over \u003cONE_TEN_PERCENT\u003e upside potential for the stock simultaneously hsbc raised its target price for tvs motor to \u003cTWO_THOUSAND\u003e from \u003cTWO_THOUSAND\u003e but kept a hold recommendation indicating a more cautious stance due to valuation concerns currently the stock is trading at \u003cTWO_THOUSAND\u003e despite tvs motors robust fundamentals the firm highlighted that its current market valuation appeared too elevated for significant near term gains bajaj auto has significantly outperformed tvs motor over the past year delivering impressive multibagger returns bajaj has surged nearly \u003cONE_HUNDRED_PERCENT\u003e compared to the \u003cEIGHT_TEN_PERCENT\u003e gain recorded by tvs during the same period in \u003cTWO_THOUSAND\u003e year to date ytd performance bajaj continued to lead rallying more than \u003cEIGHT_TEN_PERCENT\u003e whereas tvs posted a gain of over \u003cFOUR_TEN_PERCENT\u003e in september bajaj has jumped \u003cONE_TEN_PERCENT\u003e so far marking its fifth consecutive month of gains tvs has also recorded its fifth straight month of positive returns but with a more modest \u003cONE_PERCENT\u003e rise in the same period bajaj auto reached an all time high of \u003cONE_TEN_THOUSAND\u003e during intra day trading today marking a remarkable \u003cONE_HUNDRED_PERCENT\u003e gain from its \u003cFIVE_TEN\u003e week low of \u003cFOUR_THOUSAND\u003e in october last year meanwhile tvs also hit a record high of \u003cTWO_THOUSAND\u003e during intra day trades today september \u003cTWO_TEN\u003e reflecting a \u003cNINE_TEN_PERCENT\u003e increase from its \u003cFIVE_TEN\u003e week low of \u003cONE_THOUSAND\u003e in september last year hsbc noted that bajaj auto had consistently demonstrated operational resilience with a well diversified revenue mix across segments it expected the company to maintain this trend projecting bajaj to perform better in growth and margin stability than tvs the brokerage firm also highlighted bajajs cng bike initiative which it believed could disrupt the \u003cSEVEN_TEN\u003e cc \u003cONE_HUNDRED\u003e cc two wheeler market segment by offering consumers significant savings on fuel costs this would likely attract customers upgrading within this segment giving bajaj a distinct first mover advantage in the cng bike market according to hsbc a key differentiator for bajaj was the company s introduction of the cng powered bike the freedom which had shown promising results in select states sales of the cng bike averaged around \u003cFOUR_THOUSAND\u003e units per month in just two states and hsbc projected that these figures could rise to \u003cONE_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e units monthly as the model expands into other regions the fact that bajaj is the only original equipment manufacturer oem offering this fuel powertrain gave it a competitive edge in the vast untapped market segment for cost conscious customers seeking to save on operational expenses both bajaj and tvs have been aggressive in the electric two wheeler e2w market with each company launching new variants to capture the growing demand however hsbc pointed out that bajaj had secured a strong foothold as the second largest oem in the segment commanding a \u003cONE_TEN_PERCENT\u003e market share in august and improving to \u003cTWO_TEN_PERCENT\u003e in september hsbc noted that the incremental nature of bajaj s e2w sales was an added advantage from a stock perspective further enhancing the companys market positioning and value proposition according to hsbc another standout feature for bajaj was its dominance in the three wheeler \u003cTHREE_\u003e w market the company had maintained its leadership in this space and made significant strides in the electric three wheeler e3w market positioning itself for future growth hsbc also flagged the potential upside for bajaj s entry into the electric rickshaw erick segment a rapidly expanding market given that the erick market is nearly double the size of the \u003cTHREE_\u003e w market in terms of value hsbc saw a substantial growth opportunity for bajaj in this space hsbc acknowledged that tvs had led the export recovery so far in \u003cTWO_THOUSAND\u003e largely due to its lower reliance on the african market than bajaj for instance bajaj s exports to nigeria fell sharply from \u003cTHREE_TEN_PERCENT\u003e at its peak in fy20 to just \u003cFIVE_PERCENT\u003e in fy25 by comparison tvs saw a smaller decline from \u003cTWO_TEN_PERCENT\u003e to \u003cONE_PERCENT\u003e over the same period however hsbc believed bajaj was poised to catch up in export growth particularly as the african market began recovering bright spots for bajaj s exports included strong performances in mexico and the uk while tvs saw robust demand from guinea and other latin american markets looking at margins hsbc forecasted stable ebitda margins for bajaj in the \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e range over fy26 \u003cTWO_TEN\u003e supported by its diverse business segments and operational efficiency while tvs was also expected to continue expanding its margins hsbc flagged potential risks suggesting that downside pressures were more likely for tvs than bajaj in the near term in terms of valuations both bajaj and tvs traded at significant premiums to their historical averages bajaj s valuation was \u003cSIX_TEN_PERCENT\u003e higher than its five year average while tvs traded at a \u003cFOUR_TEN_PERCENT\u003e premium however hsbc saw more upside for bajaj arguing that the company s stable growth outlook export recovery and electrification potential justified its valuation expansion on the other hand while tvs remained fundamentally solid the brokerage believed that the company s higher valuation made further gains in market share more difficult to achieve particularly as electrification posed a longer term risk to its scooter segment in conclusion hsbc retained its preference for bajaj auto noting that its operational resilience margin stability and growth prospects made it a more attractive option than tvs while both companies exhibited strong fundamentals and aggressive strategies in emerging segments like electric vehicles bajaj s positioning in cng bikes three wheelers and electric rickshaws gave it a distinctive advantage despite the premium valuations of both stocks bajaj continued to trade at a \u003cTHREE_TEN_PERCENT\u003e discount relative to tvs further supporting hsbc s buy recommendation for bajaj over tvs in the current market scenario","timestamp":"2024-09-23T15:56:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}