{"url":"https://www.livemint.com/market/stock-market-news/hsbc-downgrades-ongc-to-reduce-over-falling-oil-prices-operational-challenges-sees-22-downside-to-rs-230-11727159976024.html","title":"HSBC downgrades ONGC to ‘reduce’ over falling oil prices, operational challenges, sees 22% downside to  ₹230","description":"HSBC downgraded ONGC from 'Hold' to 'Reduce', citing risks from falling oil prices and operational challenges. The target price is set at  ₹230, indicating over 22% downside potential amidst concerns over production declines and rising capital expenditure in renewable energy.","content":"HSBC downgraded Oil and Natural Gas Corporation (ONGC) from 'Hold' to 'Reduce' due to concerns over falling oil prices and operational setbacks that have exposed the downside risks to its earnings and project viability. The brokerage has set a target price of  ₹230 for the oil and gas stock, implying an over 22 per cent downside potential.HSBC cited various challenges, including declining production volumes, delays in key projects, and increased capital expenditure in green energy ventures. These factors, combined with oil price volatility, have led to a cautious outlook for the company in the near term.The stock has jumped around 60 per cent in the last one year and 44 per cent in 2024 YTD. The oil and gas stock has lost over 10 per cent in September so far after a 1 per cent decline in August. Before that, it rose 22 per cent in July and almost 4 per cent in June. It corrected 6.5 per cent in May after four straight months of gains. It added 5.5 per cent in April, 1.3 per cent in March, 4.5 per cent in February and 23.5 per cent in January.Currently trading at  ₹295.35, the stock is over 14 per cent away from its peak of  ₹344.60, hit in August 2024. Meanwhile, it has soared over 64 per cent from its 52-week low of  ₹179.80, recorded in October last year.Concerns regarding ONGC’s earnings: According to HSBC, ONGC’s earnings are largely dictated by production levels rather than oil prices, as government policies cap the price realisation for oil at USD 75 per barrel and gas at USD 6.50 per mmbtu. With oil prices falling below this threshold, HSBC warned that ONGC faces a significant downside risk. There is no floor for oil prices under current policies, leaving ONGC vulnerable to further price declines, which could impact the profitability of greenfield and enhanced oil recovery projects. This assessment aligns with HSBC's broader view on the global oil market, as noted in a previous report by analyst Kim Fustier.Production struggles and delayed projects: ONGC has also struggled with declining production volumes, especially from its ageing oilfields, such as the Western High fields, which were discovered in the 1970s. Despite efforts to enhance oil recovery, production has continued to decline. Additionally, the KG-DWN-98/2 field, considered one of ONGC’s most promising new assets, has faced delays and reduced output guidance. HSBC pointed out that ONGC has missed its forward-year production targets, raising concerns about its ability to maintain consistent output.Increased capex and renewable energy focus: ONGC’s capital expenditure is expected to rise, particularly as the company pivots towards renewable energy. In 2024, ONGC began its green energy transition by acquiring PTC’s renewable assets and is currently vying for Ayana Renewable Power. The company has committed  ₹970 billion by 2030 to set up 5GW of renewable power capacity. While this transition marks a positive long-term shift, HSBC expressed concerns about the potential strain on ONGC’s core business in the short term.Weak performance of subsidiaries: HSBC also highlighted the weaker performance of ONGC’s subsidiaries, particularly Hindustan Petroleum Corporation Limited (HPCL) and Mangalore Refinery and Petrochemicals Limited (MRPL), which have historically contributed significantly to ONGC’s earnings. Declining refining margins in these subsidiaries could affect ONGC’s ability to distribute dividends, a key value driver for the company.Despite the challenges, HSBC acknowledged that ONGC remains relatively inexpensive compared to other government-owned entities (PSUs) and global oil majors. However, the brokerage attributed this discount to poor earnings growth expectations and high carbon emissions associated with ONGC’s traditional oil exploration business. HSBC believes that ONGC’s pivot towards renewable energy warrants a higher valuation than previously assigned, although near-term earnings growth is expected to remain slow.HSBC has valued ONGC using a dividend discount model, as the brokerage believes that government actions heavily influence the company’s cash flow and dividends. While the transition to green energy is a positive long-term strategy, it is expected to take time before significantly boosting profits. In the meantime, dividends remain the most reliable gauge of ONGC’s value, making them a crucial factor in the company’s overall assessment.HSBC’s downgrade of ONGC reflects the company's challenges from falling oil prices, declining production, and rising capital expenditure. While the move towards renewable energy offers a glimmer of hope for long-term growth, the near-term outlook remains challenging. ONGC’s ability to navigate these headwinds, maintain dividend payouts, and execute its green energy transition will be critical for its future performance.","cleaned_content":"hsbc downgraded oil and natural gas corporation ongc from hold to reduce due to concerns over falling oil prices and operational setbacks that have exposed the downside risks to its earnings and project viability the brokerage has set a target price of \u003cTWO_HUNDRED\u003e for the oil and gas stock implying an over \u003cTWO_TEN_PERCENT\u003e downside potential hsbc cited various challenges including declining production volumes delays in key projects and increased capital expenditure in green energy ventures these factors combined with oil price volatility have led to a cautious outlook for the company in the near term the stock has jumped around \u003cSIX_TEN_PERCENT\u003e in the last one year and \u003cFOUR_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e ytd the oil and gas stock has lost over \u003cONE_TEN_PERCENT\u003e in september so far after a \u003cONE_PERCENT\u003e decline in august before that it rose \u003cTWO_TEN_PERCENT\u003e in july and almost \u003cFOUR_PERCENT\u003e in june it corrected \u003cSIX_PERCENT\u003e in may after four straight months of gains it added \u003cFIVE_PERCENT\u003e in april \u003cONE_PERCENT\u003e in march \u003cFOUR_PERCENT\u003e in february and \u003cTWO_TEN_PERCENT\u003e in january currently trading at \u003cTWO_HUNDRED\u003e the stock is over \u003cONE_TEN_PERCENT\u003e away from its peak of \u003cTHREE_HUNDRED\u003e hit in august \u003cTWO_THOUSAND\u003e meanwhile it has soared over \u003cSIX_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e recorded in october last year concerns regarding ongc s earnings according to hsbc ongc s earnings are largely dictated by production levels rather than oil prices as government policies cap the price realisation for oil at usd \u003cSEVEN_TEN\u003e per barrel and gas at usd \u003cSIX_\u003e per mmbtu with oil prices falling below this threshold hsbc warned that ongc faces a significant downside risk there is no floor for oil prices under current policies leaving ongc vulnerable to further price declines which could impact the profitability of greenfield and enhanced oil recovery projects this assessment aligns with hsbcs broader view on the global oil market as noted in a previous report by analyst kim fustier production struggles and delayed projects ongc has also struggled with declining production volumes especially from its ageing oilfields such as the western high fields which were discovered in the \u003cONE_THOUSAND\u003e s despite efforts to enhance oil recovery production has continued to decline additionally the kg dwn \u003cNINE_TEN\u003e \u003cTWO_\u003e field considered one of ongc s most promising new assets has faced delays and reduced output guidance hsbc pointed out that ongc has missed its forward year production targets raising concerns about its ability to maintain consistent output increased capex and renewable energy focus ongc s capital expenditure is expected to rise particularly as the company pivots towards renewable energy in \u003cTWO_THOUSAND\u003e ongc began its green energy transition by acquiring ptc s renewable assets and is currently vying for ayana renewable power the company has committed \u003cNINE_HUNDRED\u003e billion by \u003cTWO_THOUSAND\u003e to set up \u003cFIVE_\u003e gw of renewable power capacity while this transition marks a positive long term shift hsbc expressed concerns about the potential strain on ongc s core business in the short term weak performance of subsidiaries hsbc also highlighted the weaker performance of ongc s subsidiaries particularly hindustan petroleum corporation limited hpcl and mangalore refinery and petrochemicals limited mrpl which have historically contributed significantly to ongc s earnings declining refining margins in these subsidiaries could affect ongc s ability to distribute dividends a key value driver for the company despite the challenges hsbc acknowledged that ongc remains relatively inexpensive compared to other government owned entities psus and global oil majors however the brokerage attributed this discount to poor earnings growth expectations and high carbon emissions associated with ongc s traditional oil exploration business hsbc believes that ongc s pivot towards renewable energy warrants a higher valuation than previously assigned although near term earnings growth is expected to remain slow hsbc has valued ongc using a dividend discount model as the brokerage believes that government actions heavily influence the company s cash flow and dividends while the transition to green energy is a positive long term strategy it is expected to take time before significantly boosting profits in the meantime dividends remain the most reliable gauge of ongc s value making them a crucial factor in the company s overall assessment hsbc s downgrade of ongc reflects the companys challenges from falling oil prices declining production and rising capital expenditure while the move towards renewable energy offers a glimmer of hope for long term growth the near term outlook remains challenging ongc s ability to navigate these headwinds maintain dividend payouts and execute its green energy transition will be critical for its future performance","timestamp":"2024-09-24T12:44:00+05:30","market_timestamp":"2024-09-24T12:44:00+05:30","off_market_hours":false}