{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-1-11727746858610.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market on October 1 after US Fed Chair Powell’s comments","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a flat start for the Indian benchmark index. The Gift Nifty was trading around 26,000 level, a premium of nearly 10 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open flat on Tuesday as investors remain cautious amid mixed global cues after hawkish comments from the US Federal Reserve Chairman Jerome Powell.The trends on Gift Nifty also indicate a flat start for the Indian benchmark index. The Gift Nifty was trading around 26,000 level, a premium of nearly 10 points from the Nifty futures’ previous close.On Monday, the domestic equity indices ended more than a percent lower each, with the benchmark Nifty 50 falling below 26,000 level.The Sensex crashed 1,272.07 points, or 1.49%, to close at 84,299.78, while the Nifty 50 settled 368.10 points, or 1.41%, lower at 25,810.85.Nifty 50 formed a long bear candle on the daily chart with a gap down opening.“Technically, this chart pattern is indicating a bearish reversal type candle pattern (type of bearish evening star-not a classical one). This market action is also signaling a short term top reversal action for the Nifty 50 and expect some more weakness in the coming sessions. Bullish higher tops and bottoms is intact on Nifty as per daily timeframe chart. Present weakness could be in line with the new higher bottom of the sequence,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Shetti expects Nifty 50 to find support around 25,500 - 25,400 and the market is likely to bounce back from the lows.Here’s what to expect from Nifty 50 and Bank Nifty today:In terms of open interest (OI), the highest call-side OI was at the 26,000 and 26,200 strike prices, while the highest put-side OI was concentrated at the 25,500 strike price, indicating strong support around the 25,600 level for Nifty, said Mandar Bhojane, Technical Research Analyst at Choice Broking.Nifty witnessed sharp profit booking on September 30 and closed the day lower by 368 points below the 26,000 level.“The Nifty 50 slipped sharply following a brief pause in the previous trading session, breaking below its recent consolidation. This decline was accompanied by a significant negative divergence in the RSI (14), indicating potential further weakness. Sentiment may remain weak in the near term, with support placed at 25,750,” said Rupak De, Senior Technical Analyst, LKP Securities.According to him, a break below 25,750 could lead to further correction and on the higher side, resistance is seen at 26,000.Dr. Praveen Dwarakanath, Vice President of Hedged noted that RSI and stochastics establish negative divergence on the daily chart, indicating weakness in the index.“The sudden fall can also be because the ITM puts of October-end expiry were covered during the day, which could have led to a quicker fall. Immediate support for the index is at 25,800 levels, if broken below this, it can slip to 25,500 and 24,800 levels soon. The Options writer’s data for this week’s expiry shows increased writing in calls, however, in October’s expiry ITM puts saw short covering, indicating weakness in the index,” said Dwarakanath.Bank Nifty index plunged 856.20 points, or 1.59%, to close at 52,978.10 on Monday.“Bank Nifty was much weaker than nifty owing to the formation of a possible negative divergence in the weekly time frame. If Bank Nifty closes at present levels or below by the end of the week, a clear negative divergence is established, indicating a possible further fall. Although weaker than Nifty, Bank Nifty has been taking support on the Upper Keltner channel on the weekly time frame, a close below this will ascertain a downside for the index,” said Dwarakanath.Immediate support for the index continues to be at the 52,800 level, likely to be broken. Options writer's data for the present week's expiry shows increased call writing at 53,000 and above levels, indicating weakness in the index, he added.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open flat on tuesday as investors remain cautious amid mixed global cues after hawkish comments from the us federal reserve chairman jerome powell the trends on gift nifty also indicate a flat start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cONE_TEN\u003e points from the nifty futures previous close on monday the domestic equity indices ended more than a percent lower each with the benchmark nifty \u003cFIVE_TEN\u003e falling below \u003cTWO_TEN_THOUSAND\u003e level the sensex crashed \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a long bear candle on the daily chart with a gap down opening technically this chart pattern is indicating a bearish reversal type candle pattern type of bearish evening star not a classical one this market action is also signaling a short term top reversal action for the nifty \u003cFIVE_TEN\u003e and expect some more weakness in the coming sessions bullish higher tops and bottoms is intact on nifty as per daily timeframe chart present weakness could be in line with the new higher bottom of the sequence said nagaraj shetti senior technical research analyst at hdfc securities shetti expects nifty \u003cFIVE_TEN\u003e to find support around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e and the market is likely to bounce back from the lows here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today in terms of open interest oi the highest call side oi was at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices while the highest put side oi was concentrated at the \u003cTWO_TEN_THOUSAND\u003e strike price indicating strong support around the \u003cTWO_TEN_THOUSAND\u003e level for nifty said mandar bhojane technical research analyst at choice broking nifty witnessed sharp profit booking on september \u003cTHREE_TEN\u003e and closed the day lower by \u003cTHREE_HUNDRED\u003e points below the \u003cTWO_TEN_THOUSAND\u003e level the nifty \u003cFIVE_TEN\u003e slipped sharply following a brief pause in the previous trading session breaking below its recent consolidation this decline was accompanied by a significant negative divergence in the rsi \u003cONE_TEN\u003e indicating potential further weakness sentiment may remain weak in the near term with support placed at \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst lkp securities according to him a break below \u003cTWO_TEN_THOUSAND\u003e could lead to further correction and on the higher side resistance is seen at \u003cTWO_TEN_THOUSAND\u003e dr praveen dwarakanath vice president of hedged noted that rsi and stochastics establish negative divergence on the daily chart indicating weakness in the index the sudden fall can also be because the itm puts of october end expiry were covered during the day which could have led to a quicker fall immediate support for the index is at \u003cTWO_TEN_THOUSAND\u003e levels if broken below this it can slip to \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e levels soon the options writer s data for this week s expiry shows increased writing in calls however in october s expiry itm puts saw short covering indicating weakness in the index said dwarakanath bank nifty index plunged \u003cEIGHT_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on monday bank nifty was much weaker than nifty owing to the formation of a possible negative divergence in the weekly time frame if bank nifty closes at present levels or below by the end of the week a clear negative divergence is established indicating a possible further fall although weaker than nifty bank nifty has been taking support on the upper keltner channel on the weekly time frame a close below this will ascertain a downside for the index said dwarakanath immediate support for the index continues to be at the \u003cFIVE_TEN_THOUSAND\u003e level likely to be broken options writers data for the present weeks expiry shows increased call writing at \u003cFIVE_TEN_THOUSAND\u003e and above levels indicating weakness in the index he added","timestamp":"2024-10-01T07:26:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}