{"url":"https://www.livemint.com/market/stock-market-news/kec-international-share-price-rises-4-6-launches-a-qip-to-raise-funds-floor-price-set-at-rs-97664-11727236853728.html","title":"KEC International share price rises 4.6%: Launches a QIP to raise funds: Floor price set at  ₹976.64","description":"Stock Market today: KEC International share price gained up to 4.6% on Wednesday as it launches a QIP to raise funds. The floor price has been set at  ₹976.64 not much lower than previous close of  ₹983.45 on the BSE.","content":"Stock Market today: KEC International share price gained up to 4.6% on Wednesday as it launches a QIP to raise funds. The floor price has been set at  ₹976.64 not much lower than previous close of  ₹983.45 on the BSE.KEC International share price opened at  ₹989.75 on the BSE on Wednesday, slightly higher than Tuesday's close. KEC International Share price there after gained further to highs of  ₹1029.00 marking gains of more than 4% and was not far from its 1 year or 52-week high of  ₹1039.KEC International share price has risen almost 67% year to date during 2024 giving stellar returns to investors.A floor price of  ₹976.64 per share has been determined for the QIP that has been launched by KEC International. The Company may offer a discount of not more than 5% on the floor price for the Issue, it said in its release on the exchanges.On July 26, 2024, the board had first accepted the QIP. On August 22, 2024, during the annual general meeting, a special resolution was approved.At its meeting held on September 24, 2024, KEC International board of directors passed the resolution authorizing the opening of the Issue on September 24, 2024 and approving the floor price for the Issue, being  ₹ 976.64 per Equity Share based on the pricing formula as prescribed by SEBI.KEC International also has remained in limelight on regular order flows adding to its order book and improving its revenue visibility.KEC International recently announced securing new orders of Rs. 1,003 crores across its various businesses.Our Railway business has strengthened its presence in the emerging Tunnel Ventilation segment, while our Civil business has expanded its portfolio with the addition of a prestigious new client in the Metals \u0026 Mining segment, said . Vimal Kejriwal, MD \u0026 CEO, KEC InternationalWith these orders, KEC's order intake stands at over Rs. 12,300 crores, reflecting a stellar growth of over 60% compared to last year. Notably, a substantial ~70% of this year’s order intake comes from our Transmission \u0026 Distribution (T\u0026D) business","cleaned_content":"stock market today kec international share price gained up to \u003cFOUR_PERCENT\u003e on wednesday as it launches a qip to raise funds the floor price has been set at \u003cNINE_HUNDRED\u003e not much lower than previous close of \u003cNINE_HUNDRED\u003e on the bse kec international share price opened at \u003cNINE_HUNDRED\u003e on the bse on wednesday slightly higher than tuesdays close kec international share price there after gained further to highs of \u003cONE_THOUSAND\u003e marking gains of more than \u003cFOUR_PERCENT\u003e and was not far from its \u003cONE_\u003e year or \u003cFIVE_TEN\u003e week high of \u003cONE_THOUSAND\u003e kec international share price has risen almost \u003cSIX_TEN_PERCENT\u003e year to date during \u003cTWO_THOUSAND\u003e giving stellar returns to investors a floor price of \u003cNINE_HUNDRED\u003e per share has been determined for the qip that has been launched by kec international the company may offer a discount of not more than \u003cFIVE_PERCENT\u003e on the floor price for the issue it said in its release on the exchanges on july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the board had first accepted the qip on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e during the annual general meeting a special resolution was approved at its meeting held on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e kec international board of directors passed the resolution authorizing the opening of the issue on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and approving the floor price for the issue being \u003cNINE_HUNDRED\u003e per equity share based on the pricing formula as prescribed by sebi kec international also has remained in limelight on regular order flows adding to its order book and improving its revenue visibility kec international recently announced securing new orders of rs \u003cONE_THOUSAND\u003e crores across its various businesses our railway business has strengthened its presence in the emerging tunnel ventilation segment while our civil business has expanded its portfolio with the addition of a prestigious new client in the metals mining segment said vimal kejriwal md ceo kec internationalwith these orders kecs order intake stands at over rs \u003cONE_TEN_THOUSAND\u003e crores reflecting a stellar growth of over \u003cSIX_TEN_PERCENT\u003e compared to last year notably a substantial \u003cSEVEN_TEN_PERCENT\u003e of this year s order intake comes from our transmission distribution t d business","timestamp":"2024-09-25T09:42:00+05:30","market_timestamp":"2024-09-25T09:42:00+05:30","off_market_hours":false}