{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-3-amid-israel-iran-war-11727919962536.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 3 amid Israel-Iran war","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 25,720 level, a discount of nearly 255 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open lower on Thursday following weak global cues amid escalating tension in the Middle East and worries over full fledged war between Iran and Israel.The trends on Gift Nifty also indicate a gap-down start for the Indian benchmark index. The Gift Nifty was trading around 25,720 level, a discount of nearly 255 points from the Nifty futures’ previous close.On Tuesday, the Indian stock market indices ended the volatile session flat with a negative bias.The Sensex eased 33.49 points to close at 84,266.29, while the Nifty 50 settled 13.95 points, or 0.05%, lower at 25,796.90.Nifty 50 formed a small candle on the daily chart with upper shadow.“Technically, this pattern indicates a sell on rise opportunity in the market. But, the sharp follow-through selling momentum was absent on Tuesday. The positive chart pattern like higher tops and bottoms is intact on the daily chart and the present weakness in the market is in line with the new higher bottom formation of the pattern. The higher bottom reversal needs to be confirmed,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Shetti believes the near term uptrend status of Nifty 50 remains intact and the market is currently shifted into a short term downward correction. Nifty is expected to find support around 25,500 - 25,400 levels in this week and could witness a sustainable upside bounce from the lows.Here’s what to expect from Nifty 50 and Bank Nifty today:In terms of Nifty open interest (OI), the highest call-side OI was seen at the 26,000 and 26,200 strike prices, while the highest put-side OI was concentrated at the 25,500 strike price, indicating strong support around the 25,600 level for Nifty, said Mandar Bhojane, Technical Research Analyst at Choice Broking.Nifty 50 consolidated on October 1 amidst a range movement and closed the day lower by 13 points.“Nifty 50 formed a doji pattern with a long upper shadow on the daily chart, indicating market indecision. Heavy call writing at 25,800 suggests it may act as strong resistance if sustained. Immediate support lies at 25,750, and a decisive break below this could push the index to 25,600 / 25,500. On the higher side, a move above 25,800 may propel Nifty towards 26,050, where sellers could become active again,” said Rupak De, Senior Technical Analyst, LKP Securities.VLA Ambala, Co-Founder of Stock Market Today noted that the Nifty 50 index formed a bearish “Dark Cloud Cover” candlestick pattern at all-time highs.“The index is still in the overbought zone, as seen from its monthly RSI reading, which is above 83. Nifty has fallen nearly 2% in three trading sessions, and its current movements suggest that it is likely to see more profit-booking activities. According to my analysis, traders should look for a ‘sell on rise’ strategy. Since Nifty is trading at around 1% of its 20-day EMA, market participants can target the range if they are waiting for a sell-on rise. I would advise to track this for 1-3 days to make the most of the latest developments,” Ambala said.Considering these aspects, she expects the benchmark Nifty 50 to gain support between 25,700 and 25,550 and face resistance between 25,830 and 25,925.Dr. Praveen Dwarakanath, Vice President of Hedged said that the Nifty 50 consolidated near the previous closing, indicating a small halt in the fall and Tuesday’s low of 25,740 level can act as immediate support from the index.“ADX DI+ line on the daily chart is almost on the verge of crossing the ADX average line, indicating weakness to continue. The momentum indicators also show a small room on the downside as they are closer to the oversold region. Options writer’s data showed increased call writing in the present week's expiry above 25,800 levels, indicating a possible closing below this level,” Dwarakanath said.Bank Nifty index ended 55.50 points, or 0.1%, lower at 52,922.60 on Tuesday, forming a small bullish candlestick pattern.“Bank Nifty tested its support at 52,800 levels, a break of this can push it down further to 52,000 or 51,200 levels. Momentum indicators are pointing towards a small room for a further fall, as two days of fall have pushed the momentum indicators to the oversold region,” said Dwarakanath.According to him, Bank Nifty options writer's data shows increased writing at 53,000 levels, indicating a pause in the fall at the present levels, however, an increased call writing indicates weakness to continue, making the bias in Bank Nifty, sideways to the downside.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open lower on thursday following weak global cues amid escalating tension in the middle east and worries over full fledged war between iran and israel the trends on gift nifty also indicate a gap down start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cTWO_HUNDRED\u003e points from the nifty futures previous close on tuesday the indian stock market indices ended the volatile session flat with a negative bias the sensex eased \u003cTHREE_TEN\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small candle on the daily chart with upper shadow technically this pattern indicates a sell on rise opportunity in the market but the sharp follow through selling momentum was absent on tuesday the positive chart pattern like higher tops and bottoms is intact on the daily chart and the present weakness in the market is in line with the new higher bottom formation of the pattern the higher bottom reversal needs to be confirmed said nagaraj shetti senior technical research analyst at hdfc securities shetti believes the near term uptrend status of nifty \u003cFIVE_TEN\u003e remains intact and the market is currently shifted into a short term downward correction nifty is expected to find support around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in this week and could witness a sustainable upside bounce from the lows here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today in terms of nifty open interest oi the highest call side oi was seen at the \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike prices while the highest put side oi was concentrated at the \u003cTWO_TEN_THOUSAND\u003e strike price indicating strong support around the \u003cTWO_TEN_THOUSAND\u003e level for nifty said mandar bhojane technical research analyst at choice broking nifty \u003cFIVE_TEN\u003e consolidated on october \u003cONE_\u003e amidst a range movement and closed the day lower by \u003cONE_TEN\u003e points nifty \u003cFIVE_TEN\u003e formed a doji pattern with a long upper shadow on the daily chart indicating market indecision heavy call writing at \u003cTWO_TEN_THOUSAND\u003e suggests it may act as strong resistance if sustained immediate support lies at \u003cTWO_TEN_THOUSAND\u003e and a decisive break below this could push the index to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the higher side a move above \u003cTWO_TEN_THOUSAND\u003e may propel nifty towards \u003cTWO_TEN_THOUSAND\u003e where sellers could become active again said rupak de senior technical analyst lkp securities vla ambala co founder of stock market today noted that the nifty \u003cFIVE_TEN\u003e index formed a bearish dark cloud cover candlestick pattern at all time highs the index is still in the overbought zone as seen from its monthly rsi reading which is above \u003cEIGHT_TEN\u003e nifty has fallen nearly \u003cTWO_PERCENT\u003e in three trading sessions and its current movements suggest that it is likely to see more profit booking activities according to my analysis traders should look for a sell on rise strategy since nifty is trading at around \u003cONE_PERCENT\u003e of its \u003cTWO_TEN\u003e day ema market participants can target the range if they are waiting for a sell on rise i would advise to track this for \u003cONE_\u003e \u003cTHREE_\u003e days to make the most of the latest developments ambala said considering these aspects she expects the benchmark nifty \u003cFIVE_TEN\u003e to gain support between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and face resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e dr praveen dwarakanath vice president of hedged said that the nifty \u003cFIVE_TEN\u003e consolidated near the previous closing indicating a small halt in the fall and tuesday s low of \u003cTWO_TEN_THOUSAND\u003e level can act as immediate support from the index adx di line on the daily chart is almost on the verge of crossing the adx average line indicating weakness to continue the momentum indicators also show a small room on the downside as they are closer to the oversold region options writer s data showed increased call writing in the present weeks expiry above \u003cTWO_TEN_THOUSAND\u003e levels indicating a possible closing below this level dwarakanath said bank nifty index ended \u003cFIVE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e on tuesday forming a small bullish candlestick pattern bank nifty tested its support at \u003cFIVE_TEN_THOUSAND\u003e levels a break of this can push it down further to \u003cFIVE_TEN_THOUSAND\u003e or \u003cFIVE_TEN_THOUSAND\u003e levels momentum indicators are pointing towards a small room for a further fall as two days of fall have pushed the momentum indicators to the oversold region said dwarakanath according to him bank nifty options writers data shows increased writing at \u003cFIVE_TEN_THOUSAND\u003e levels indicating a pause in the fall at the present levels however an increased call writing indicates weakness to continue making the bias in bank nifty sideways to the downside","timestamp":"2024-10-03T07:36:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}