{"url":"https://www.livemint.com/market/stock-market-news/multibagger-penny-stock-evexia-lifecare-declares-preferential-issue-at-rs-3-60-per-share-details-here-11727068679702.html","title":"Multibagger penny stock Evexia Lifecare declares preferential issue at  ₹3.60 per share. Details here","description":"Evexia Lifecare's stock rose nearly 5% after the company announced a fundraising initiative for up to 24 crore convertible warrants at  ₹3.60 each. The stock hit a 52-week high of  ₹3.81, reflecting a 146% increase from its December low, amid solid earnings growth.","content":"Multibagger penny stock Evexia Lifecare caught investors' attention on Monday, as the stock surged by almost 5 per cent following the company’s announcement of a new fundraising initiative.The company’s board approved the preferential issue of up to 24 crore convertible warrants, each priced at  ₹3.60. These warrants can be converted into fully paid-up equity shares, with a face value of  ₹1 and a premium of  ₹2.60 per share, totalling  ₹86.4 crore. This issue will be executed in accordance with Sections 42 and 62 of the Companies Act 2013 and related rules. Approval from shareholders and relevant regulatory authorities will be sought before moving forward, and proposed allottees will be required to make an upfront payment of 25 per cent of the total issue size, per the company’s filing.Evexia Lifecare's stock has demonstrated remarkable performance, rising 4.6 per cent on Monday to hit its 52-week high of  ₹3.81 in intra-day trading. The stock has surged an impressive 146 per cent from its 52-week low of  ₹1.55, recorded in December 2023.In the past year, the stock has delivered multibagger returns of 108 per cent. Year-to-date (YTD) in 2023, it has rallied by 103 per cent, offering positive returns in 6 of the 9 months this calendar year. In September alone, it climbed 12.5 per cent, marking a third consecutive month of gains. The penny stock also rose 12.3 per cent in August and 24.7 per cent in July, reflecting sustained investor interest.The shareholding structure of Evexia Lifecare showcases diverse ownership. Foreign portfolio investors (FPIs) hold a 1.03 per cent stake in the company, while banks and mutual funds own smaller stakes of 0.13 per cent and 0.4 per cent, respectively. The promoter group controls 6.29 per cent, with the remaining 93.71 per cent held by public shareholders, according to the June 2024 quarter data.Evexia Lifecare reported strong earnings growth in the June 2024 quarter. Net Sales increased by 45.65 per cent to  ₹20.42 crore, up from  ₹14.02 crore in June 2023. The company's Net Profit for the quarter soared by 253.68 per cent, reaching  ₹0.26 crore compared to  ₹0.07 crore in the same period last year. EBITDA also saw a significant jump, rising 130 per cent to  ₹0.46 crore, up from  ₹0.20 crore in the June 2023 quarter.Despite the stock's impressive performance, market experts advise investors to be cautious. Penny stocks like Evexia Lifecare are known for their volatility, and sudden corrections could accompany the stock's rapid rise. The company's ability to effectively utilize the new capital raised through the convertible warrants and the outcomes of upcoming regulatory approvals will be key to its long-term growth prospects. Investors should monitor the company's board decisions and fundraising methods closely.Evexia Lifecare Limited operates through its subsidiaries and trades various products, including chemicals, edible oils, diamonds, gold, and plastic granules. The company also provides web and software development services and manufactures eBikes. Previously known as Kavit Industries Limited, it rebranded as Evexia Lifecare in January 2021. Established in 1990, it is headquartered in Vadodara, India.","cleaned_content":"multibagger penny stock evexia lifecare caught investors attention on monday as the stock surged by almost \u003cFIVE_PERCENT\u003e following the company s announcement of a new fundraising initiative the company s board approved the preferential issue of up to \u003cTWO_TEN\u003e crore convertible warrants each priced at \u003cTHREE_\u003e these warrants can be converted into fully paid up equity shares with a face value of \u003cONE_\u003e and a premium of \u003cTWO_\u003e per share totalling \u003cEIGHT_TEN\u003e crore this issue will be executed in accordance with sections \u003cFOUR_TEN\u003e and \u003cSIX_TEN\u003e of the companies act \u003cTWO_THOUSAND\u003e and related rules approval from shareholders and relevant regulatory authorities will be sought before moving forward and proposed allottees will be required to make an upfront payment of \u003cTWO_TEN_PERCENT\u003e of the total issue size per the company s filing evexia lifecares stock has demonstrated remarkable performance rising \u003cFOUR_PERCENT\u003e on monday to hit its \u003cFIVE_TEN\u003e week high of \u003cTHREE_\u003e in intra day trading the stock has surged an impressive \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_\u003e recorded in december \u003cTWO_THOUSAND\u003e in the past year the stock has delivered multibagger returns of \u003cONE_HUNDRED_PERCENT\u003e year to date ytd in \u003cTWO_THOUSAND\u003e it has rallied by \u003cONE_HUNDRED_PERCENT\u003e offering positive returns in \u003cSIX_\u003e of the \u003cNINE_\u003e months this calendar year in september alone it climbed \u003cONE_TEN_PERCENT\u003e marking a third consecutive month of gains the penny stock also rose \u003cONE_TEN_PERCENT\u003e in august and \u003cTWO_TEN_PERCENT\u003e in july reflecting sustained investor interest the shareholding structure of evexia lifecare showcases diverse ownership foreign portfolio investors fpis hold a \u003cONE_PERCENT\u003e stake in the company while banks and mutual funds own smaller stakes of \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively the promoter group controls \u003cSIX_PERCENT\u003e with the remaining \u003cNINE_TEN_PERCENT\u003e held by public shareholders according to the june \u003cTWO_THOUSAND\u003e quarter data evexia lifecare reported strong earnings growth in the june \u003cTWO_THOUSAND\u003e quarter net sales increased by \u003cFOUR_TEN_PERCENT\u003e to \u003cTWO_TEN\u003e crore up from \u003cONE_TEN\u003e crore in june \u003cTWO_THOUSAND\u003e the companys net profit for the quarter soared by \u003cTWO_HUNDRED_PERCENT\u003e reaching \u003cZERO_\u003e crore compared to \u003cZERO_\u003e crore in the same period last year ebitda also saw a significant jump rising \u003cONE_HUNDRED_PERCENT\u003e to \u003cZERO_\u003e crore up from \u003cZERO_\u003e crore in the june \u003cTWO_THOUSAND\u003e quarter despite the stocks impressive performance market experts advise investors to be cautious penny stocks like evexia lifecare are known for their volatility and sudden corrections could accompany the stocks rapid rise the companys ability to effectively utilize the new capital raised through the convertible warrants and the outcomes of upcoming regulatory approvals will be key to its long term growth prospects investors should monitor the companys board decisions and fundraising methods closely evexia lifecare limited operates through its subsidiaries and trades various products including chemicals edible oils diamonds gold and plastic granules the company also provides web and software development services and manufactures ebikes previously known as kavit industries limited it rebranded as evexia lifecare in january \u003cTWO_THOUSAND\u003e established in \u003cONE_THOUSAND\u003e it is headquartered in vadodara india","timestamp":"2024-09-23T11:12:00+05:30","market_timestamp":"2024-09-23T11:12:00+05:30","off_market_hours":false}