{"url":"https://www.livemint.com/market/stock-market-news/stock-check-up-313-in-1-year-should-you-buy-multibagger-smallcap-stock-gmr-power-11727341765728.html","title":"Stock Check: Up 313% in 1 year, should you buy multibagger smallcap stock GMR Power?","description":"GMR Power and Urban Infra's stock surged over 313% in a year and nearly 190% in 2024, hitting a record high of  ₹163.70. Analysts see continued positive momentum, with key support around  ₹148 and targets up to  ₹180-195.","content":"Power stock GMR Power and Urban Infra has witnessed a remarkable multibagger rally. The stock soared over 313 per cent in the last one year. So far in 2024, the stock has rallied almost 190 per cent, giving positive returns in seven out of nine months.In September, the stock jumped almost 18 per cent, extending its gains for the sixth consecutive month. It climbed by around 41 per cent in August, 17 per cent in July, over 27 per cent in June, 3 per cent in May and over 49 per cent in April. Meanwhile, it witnessed some volatility before that, down 18 per cent in March, up 2 per cent in February and down 9 per cent in January.The smallcap stock hit a record high of  ₹163.70 in intra-day deals in the previous session, on September 24. It has now surged almost 451 per cent from its 52-week low of  ₹29.71, recorded in October last year.GMR Power is currently trading at  ₹163..84, near its 52-week high, showing strong momentum across weekly and monthly charts. The stock is above all short-term moving averages, indicating continued strength. The daily and weekly RSI suggest it’s in an overbought zone, potentially setting up for a healthy short-term pullback. The key accumulation levels are around  ₹152-154, with  ₹148 acting as strong support. As long as this support holds, the trend remains positive, with a potential upside to  ₹180-185 by year-end.The stock is currently in a strong uptrend, forming a series of higher tops and bottoms. On the daily chart, the stock has broken out of a consolidation range at 152 levels, suggesting a continuation of the uptrend. Increasing volumes over the past three sessions indicate higher participation. The stock is trading above its 20, 50, 100, and 200-day SMA, and these averages are also trending upwards alongside the price, confirming the bullish trend. The daily, weekly, and monthly RSI indicators are in positive terrain, supporting strength across all time frames. The daily Bollinger Bands signal a buy, further indicating increased participation. Investors are advised to buy, hold, and accumulate this stock, with an expected upside of 178-195 and downside support at 150-135 levels.Emkay Global has initiated coverage on GMR Power and Urban Infra with a 'Buy' rating and a 12-month target price of  ₹180 per share, with a bull case target of  ₹205 per share. The brokerage is optimistic about the company's improving debt metrics and the near-optimal performance of its core thermal assets (1,650 MW), backed by coal tie-ups and power purchase agreements (PPAs), which could push capacity utilisation to 90 per cent. Additionally, GMR Power's 180 MW Bajoli Holi hydro-power asset has stabilised, and its smart meter installation contract (7.5 million units) with Bosch presents a lucrative, asset-light business opportunity, showcasing its strong execution capabilities.Emkay also highlighted the company's management focus on deleveraging, supported by strong operating cash flows, conversion of Foreign Currency Convertible Bonds (FCCBs) into equity, and the handover of the Hyderabad-Vijayawada road project. Incremental smart meter contracts, asset monetisation, and dispute settlements could provide further optional value. On valuation, Emkay values GMR Power's core power-generating assets at 10-12x Sep-25E Enterprise Value/EBITDA, the smart meter project using a discounted cash flow (DCF) method, and the standalone EPC business at 1.0x Sep-25E book value. Additionally, optional opportunities could add  ₹25 per share to the bull case valuation.","cleaned_content":"power stock gmr power and urban infra has witnessed a remarkable multibagger rally the stock soared over \u003cTHREE_HUNDRED_PERCENT\u003e in the last one year so far in \u003cTWO_THOUSAND\u003e the stock has rallied almost \u003cONE_HUNDRED_PERCENT\u003e giving positive returns in seven out of nine months in september the stock jumped almost \u003cONE_TEN_PERCENT\u003e extending its gains for the sixth consecutive month it climbed by around \u003cFOUR_TEN_PERCENT\u003e in august \u003cONE_TEN_PERCENT\u003e in july over \u003cTWO_TEN_PERCENT\u003e in june \u003cTHREE_PERCENT\u003e in may and over \u003cFOUR_TEN_PERCENT\u003e in april meanwhile it witnessed some volatility before that down \u003cONE_TEN_PERCENT\u003e in march up \u003cTWO_PERCENT\u003e in february and down \u003cNINE_PERCENT\u003e in january the smallcap stock hit a record high of \u003cONE_HUNDRED\u003e in intra day deals in the previous session on september \u003cTWO_TEN\u003e it has now surged almost \u003cFOUR_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_TEN\u003e recorded in october last year gmr power is currently trading at \u003cONE_HUNDRED\u003e 84 near its \u003cFIVE_TEN\u003e week high showing strong momentum across weekly and monthly charts the stock is above all short term moving averages indicating continued strength the daily and weekly rsi suggest it s in an overbought zone potentially setting up for a healthy short term pullback the key accumulation levels are around \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e with \u003cONE_HUNDRED\u003e acting as strong support as long as this support holds the trend remains positive with a potential upside to \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e by year end the stock is currently in a strong uptrend forming a series of higher tops and bottoms on the daily chart the stock has broken out of a consolidation range at \u003cONE_HUNDRED\u003e levels suggesting a continuation of the uptrend increasing volumes over the past three sessions indicate higher participation the stock is trading above its \u003cTWO_TEN\u003e \u003cFIVE_TEN\u003e \u003cONE_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e day sma and these averages are also trending upwards alongside the price confirming the bullish trend the daily weekly and monthly rsi indicators are in positive terrain supporting strength across all time frames the daily bollinger bands signal a buy further indicating increased participation investors are advised to buy hold and accumulate this stock with an expected upside of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e and downside support at \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e levels emkay global has initiated coverage on gmr power and urban infra with a buy rating and a \u003cONE_TEN\u003e month target price of \u003cONE_HUNDRED\u003e per share with a bull case target of \u003cTWO_HUNDRED\u003e per share the brokerage is optimistic about the companys improving debt metrics and the near optimal performance of its core thermal assets \u003cONE_THOUSAND\u003e mw backed by coal tie ups and power purchase agreements ppas which could push capacity utilisation to \u003cNINE_TEN_PERCENT\u003e additionally gmr powers \u003cONE_HUNDRED\u003e mw bajoli holi hydro power asset has stabilised and its smart meter installation contract \u003cSEVEN_\u003e million units with bosch presents a lucrative asset light business opportunity showcasing its strong execution capabilities emkay also highlighted the companys management focus on deleveraging supported by strong operating cash flows conversion of foreign currency convertible bonds fccbs into equity and the handover of the hyderabad vijayawada road project incremental smart meter contracts asset monetisation and dispute settlements could provide further optional value on valuation emkay values gmr powers core power generating assets at \u003cONE_TEN\u003e \u003cONE_TEN\u003e x sep \u003cTWO_TEN\u003e e enterprise value ebitda the smart meter project using a discounted cash flow dcf method and the standalone epc business at \u003cONE_\u003e x sep \u003cTWO_TEN\u003e e book value additionally optional opportunities could add \u003cTWO_TEN\u003e per share to the bull case valuation","timestamp":"2024-09-26T16:06:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}