{"url":"https://www.livemint.com/market/stock-market-news/adani-total-gas-share-price-rises-more-than-7-secures-its-largest-global-funding-in-the-city-gas-distribution-business-11727063635539.html","title":"Adani Total Gas share price rises 8% : Secures its largest Global Funding in the City Gas Distribution Business","description":"Stock Market today: Adani Total Gas share price gained 8% during the morning trades on Monday. The company announced that it has secured largest Global Funding in the City Gas Distribution Business","content":"Stock Market today: Adani Total Gas share price gained almost 8% in opening trades on Monday. The company announced that it has secured largest Global Funding in the City Gas Distribution Business.The Adani Total Gas share price opened at  ₹845 on the BSE on Monday, more than 7% higher than its previous close on Friday. The Adani Total Gas share price gained further to highs of  ₹851.00 marking almost 8% gains.The Adani Total Gas share price has seen more than 33% gains during last one year.Adani Total Gas  on Friday post market hours annunced that it has entered into an overall financing framework which enables Adani Total Gas Ltd to secure future funding based on its business plan in the city gas distribution business.As per the release \"the maiden financing of $ 375 million executed with international lenders include an initial commitment of $ 315 million with accordion feature to enhance the commitments. Five international lenders participated in the initial financing which includes BNP Paribas, DBS Bank, Mizuho Bank, MUFG Bank, and Sumitomo Mitsui Banking Corporation.The development will help it expand its City Gas distribution network into its 34 authorized Geographical Areas (GAs) across 13 states.Over 200 million people, or up to 14% of India's total population, will be served by this development plan. By expanding the infrastructure for compressed natural gas (CNG) and piped natural gas (PNG), an ecosystem for a gas-based economy will be created, as per the company.The Adani total Gas is active in e 53 geographical areas in the city Gas Distribution space. Out of these 34 are owned by Adani Total Gas Ltd on its own and the balance 19 GAs are owned by Indian Oil-Adani Gas Private Limited (IOAGPL) – a 50:50 joint venture between Adani Total Gas Limited and Indian Oil Corporation Limited.","cleaned_content":"stock market today adani total gas share price gained almost \u003cEIGHT_PERCENT\u003e in opening trades on monday the company announced that it has secured largest global funding in the city gas distribution business the adani total gas share price opened at \u003cEIGHT_HUNDRED\u003e on the bse on monday more than \u003cSEVEN_PERCENT\u003e higher than its previous close on friday the adani total gas share price gained further to highs of \u003cEIGHT_HUNDRED\u003e marking almost \u003cEIGHT_PERCENT\u003e gains the adani total gas share price has seen more than \u003cTHREE_TEN_PERCENT\u003e gains during last one year adani total gas on friday post market hours annunced that it has entered into an overall financing framework which enables adani total gas ltd to secure future funding based on its business plan in the city gas distribution business as per the release the maiden financing of \u003cTHREE_HUNDRED\u003e million executed with international lenders include an initial commitment of \u003cTHREE_HUNDRED\u003e million with accordion feature to enhance the commitments five international lenders participated in the initial financing which includes bnp paribas dbs bank mizuho bank mufg bank and sumitomo mitsui banking corporation the development will help it expand its city gas distribution network into its \u003cTHREE_TEN\u003e authorized geographical areas gas across \u003cONE_TEN\u003e states over \u003cTWO_HUNDRED\u003e million people or up to \u003cONE_TEN_PERCENT\u003e of indias total population will be served by this development plan by expanding the infrastructure for compressed natural gas cng and piped natural gas png an ecosystem for a gas based economy will be created as per the company the adani total gas is active in e \u003cFIVE_TEN\u003e geographical areas in the city gas distribution space out of these \u003cTHREE_TEN\u003e are owned by adani total gas ltd on its own and the balance \u003cONE_TEN\u003e gas are owned by indian oil adani gas private limited ioagpl a \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e joint venture between adani total gas limited and indian oil corporation limited","timestamp":"2024-09-23T09:32:00+05:30","market_timestamp":"2024-09-23T09:32:00+05:30","off_market_hours":false}