{"url":"https://www.livemint.com/market/stock-market-news/september-auto-sales-2ws-rev-up-with-double-digit-growth-pvs-continue-to-slump-11727871230404.html","title":"September Auto Sales: 2Ws rev up with double-digit growth, PVs continue to slump","description":"Two-wheeler sales surged in September, driven by electric models and exports, with brands like Bajaj and TVS reporting significant growth. In contrast, passenger vehicle sales declined for the third month in September.","content":"Sales of two-wheelers have demonstrated robust growth in September, driven by a notable surge in electric two-wheeler sales and improvement in the exports. Leading brands like Hero MotorCorp, Bajaj, TVS Motor Co, and Honda all reported positive growth compared to their performance in September 2023.In contrast, passenger vehicle manufacturers reported disappointing sales figures for the third consecutive month in September, reflecting ongoing challenges within the industry due to persistently low demand. Inventory has accumulated at dealerships, prompting companies to reduce dispatches in order to manage excess stock amid declining demand.Bajaj Auto reported a 22% increase in 2W sales, reaching 4,00,489 units (including exports), crossing the 4-lakh milestone for the first time. In the same period of last year, the company sold 3,27,712 units.Domestic two-wheeler sales experienced a 28% year-on-year growth to 2,59,333 units, while exports rose by 13%. Year-to-date figures for two-wheelers indicate a 12% year-on-year increase, with a total of 1,984,125 units sold.TVS Motor Company registered a growth of 22%, with sales increasing from 386,955 units in September 2023 to 471,792 units in September 2024. Domestic two-wheelers registered growth of 23%, with sales increasing from 300,493 units in September 2023 to 369,138 units in September 2024.Honda Motorcycle \u0026 Scooter India reported a rise in wholesale sales in the domestic market, reaching 536,391 units, up from 491,802 units in September 2023.Hero MotoCorp sold 637,050 motorcycles and scooters in September, reflecting 19% year-on-year growth. From April to September 2024, the company achieved total sales of 3,054,840 units, a 10% increase compared to the same period last year.In the electric two-wheeler segment, Bajaj Auto sold 18,933 Bajaj Chetaks in September, overtaking TVS Motor to claim the second spot in electric two-wheeler sales. TVS Motor sold 17,865 iQubes in September, marking a 15% year-on-year increase, as per the recent media reports.In August, Bajaj Auto was trailing TVS by just 791 units. For September, Bajaj Auto held a market share of 21.47%, while TVS Motor Co. accounted for 20.26%. Meanwhile, Ola experienced its lowest monthly retail sales in 11 months, with sales falling to 23,594 units in September 2024, down from the previous October. The company's market share further dropped to 27% in September.In September, passenger vehicle manufacturers struggled with low demand, even as automakers provided significant discounts to stimulate sales.Maruti Suzuki, India's leading car manufacturer, reported a 4% decline in domestic passenger vehicle wholesales, totaling 144,962 units compared to 150,812 units in September 2023.In September, the mini segment, including Alto and S-Presso, experienced a slight sales increase to 10,363 units from 10,351 units year-on-year. Conversely, compact car sales, which include models like Baleno, Celerio, and Swift, declined to 60,480 units from 68,551 units.However, utility vehicle sales, featuring Brezza and Ertiga, grew by 4% to 61,549 units, up from 59,272 units in the previous year. Hyundai Motor India reported a 6% decline in domestic dispatches to dealers, totaling 51,101 units in September, down from 54,241 units in the same month last year.Tata Motors also experienced a decrease, with total passenger vehicle sales—including electric vehicles—falling by 8% to 41,063 units compared to 44,809 units in September 2023.In contrast, Mahindra \u0026 Mahindra saw a positive trend, with SUV wholesales in the domestic market increasing by 24% to 51,062 units year-over-year. Toyota Kirloskar Motor reported a 14% increase in wholesales, reaching 26,847 units in September. Meanwhile, Kia India enjoyed a 17% rise in sales, achieving 23,523 units for the month.(with inputs from PTI)","cleaned_content":"sales of two wheelers have demonstrated robust growth in september driven by a notable surge in electric two wheeler sales and improvement in the exports leading brands like hero motorcorp bajaj tvs motor co and honda all reported positive growth compared to their performance in september \u003cTWO_THOUSAND\u003e in contrast passenger vehicle manufacturers reported disappointing sales figures for the third consecutive month in september reflecting ongoing challenges within the industry due to persistently low demand inventory has accumulated at dealerships prompting companies to reduce dispatches in order to manage excess stock amid declining demand bajaj auto reported a \u003cTWO_TEN_PERCENT\u003e increase in \u003cTWO_\u003e w sales reaching \u003cFOUR_HUNDRED_THOUSAND\u003e units including exports crossing the \u003cFOUR_\u003e lakh milestone for the first time in the same period of last year the company sold \u003cTHREE_HUNDRED_THOUSAND\u003e units domestic two wheeler sales experienced a \u003cTWO_TEN_PERCENT\u003e year on year growth to \u003cTWO_HUNDRED_THOUSAND\u003e units while exports rose by \u003cONE_TEN_PERCENT\u003e year to date figures for two wheelers indicate a \u003cONE_TEN_PERCENT\u003e year on year increase with a total of \u003cONE_MILLION\u003e units sold tvs motor company registered a growth of \u003cTWO_TEN_PERCENT\u003e with sales increasing from \u003cTHREE_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e to \u003cFOUR_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e domestic two wheelers registered growth of \u003cTWO_TEN_PERCENT\u003e with sales increasing from \u003cTHREE_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e to \u003cTHREE_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e honda motorcycle scooter india reported a rise in wholesale sales in the domestic market reaching \u003cFIVE_HUNDRED_THOUSAND\u003e units up from \u003cFOUR_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e hero motocorp sold \u003cSIX_HUNDRED_THOUSAND\u003e motorcycles and scooters in september reflecting \u003cONE_TEN_PERCENT\u003e year on year growth from april to september \u003cTWO_THOUSAND\u003e the company achieved total sales of \u003cTHREE_MILLION\u003e units a \u003cONE_TEN_PERCENT\u003e increase compared to the same period last year in the electric two wheeler segment bajaj auto sold \u003cONE_TEN_THOUSAND\u003e bajaj chetaks in september overtaking tvs motor to claim the second spot in electric two wheeler sales tvs motor sold \u003cONE_TEN_THOUSAND\u003e iqubes in september marking a \u003cONE_TEN_PERCENT\u003e year on year increase as per the recent media reports in august bajaj auto was trailing tvs by just \u003cSEVEN_HUNDRED\u003e units for september bajaj auto held a market share of \u003cTWO_TEN_PERCENT\u003e while tvs motor co accounted for \u003cTWO_TEN_PERCENT\u003e meanwhile ola experienced its lowest monthly retail sales in \u003cONE_TEN\u003e months with sales falling to \u003cTWO_TEN_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e down from the previous october the companys market share further dropped to \u003cTWO_TEN_PERCENT\u003e in september in september passenger vehicle manufacturers struggled with low demand even as automakers provided significant discounts to stimulate sales maruti suzuki indias leading car manufacturer reported a \u003cFOUR_PERCENT\u003e decline in domestic passenger vehicle wholesales totaling \u003cONE_HUNDRED_THOUSAND\u003e units compared to \u003cONE_HUNDRED_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e in september the mini segment including alto and s presso experienced a slight sales increase to \u003cONE_TEN_THOUSAND\u003e units from \u003cONE_TEN_THOUSAND\u003e units year on year conversely compact car sales which include models like baleno celerio and swift declined to \u003cSIX_TEN_THOUSAND\u003e units from \u003cSIX_TEN_THOUSAND\u003e units however utility vehicle sales featuring brezza and ertiga grew by \u003cFOUR_PERCENT\u003e to \u003cSIX_TEN_THOUSAND\u003e units up from \u003cFIVE_TEN_THOUSAND\u003e units in the previous year hyundai motor india reported a \u003cSIX_PERCENT\u003e decline in domestic dispatches to dealers totaling \u003cFIVE_TEN_THOUSAND\u003e units in september down from \u003cFIVE_TEN_THOUSAND\u003e units in the same month last year tata motors also experienced a decrease with total passenger vehicle sales including electric vehicles falling by \u003cEIGHT_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e units compared to \u003cFOUR_TEN_THOUSAND\u003e units in september \u003cTWO_THOUSAND\u003e in contrast mahindra mahindra saw a positive trend with suv wholesales in the domestic market increasing by \u003cTWO_TEN_PERCENT\u003e to \u003cFIVE_TEN_THOUSAND\u003e units year over year toyota kirloskar motor reported a \u003cONE_TEN_PERCENT\u003e increase in wholesales reaching \u003cTWO_TEN_THOUSAND\u003e units in september meanwhile kia india enjoyed a \u003cONE_TEN_PERCENT\u003e rise in sales achieving \u003cTWO_TEN_THOUSAND\u003e units for the month with inputs from pti","timestamp":"2024-10-02T18:48:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}