{"url":"https://www.livemint.com/market/stock-market-news/stock-market-crash-sensex-crash-1-200-points-nifty-50-drops-over-1-5-key-factors-why-market-is-falling-today-11727926576924.html","title":"Stock market today: Nifty 50, Sensex drop over 2%, biggest 1-day fall in 2 months","description":"All the sectoral indices, barring the metals ended in the red. Nifty Auto, Nifty FMCG, Nifty Realty, Nifty Private Bank fell the most, with cuts exceeding up to 4.5%. The stock market crash today resulted in the decline in market capitalisation of all listed companies on BSE by around  ₹10 lakh cr.","content":"The Indian stock market experienced a significant crash on Thursday, with the benchmark indices, Sensex and Nifty 50, both closing the session down over 2%. This marked their worst intraday drop in two months as investor sentiment soured amid escalating tensions between Iran and Israel, prompting a shift away from riskier assets like stocks.The Nifty 50 finished 2.12% lower at 25,250, dipping below the 25,300-point mark for the first time since mid-September. This decline has resulted in a 3.9% correction for the index over just four sessions. Similarly, the Sensex closed down 2.10% at 82,491 points, breaching the 82,500 mark for the first time since mid-September. This represents the fourth consecutive day of losses for the index, accumulating a total decline of 3.6%.In the broader market, the Nifty Midcap 100 index fell 2.21%, closing at 59,024 points, while the Nifty SmallCap 100 ended the trading day down 1.96% at 18,952 points.All the sectoral indices, barring the metals ended in the red. Nifty Auto, Nifty FMCG, Nifty Realty, Nifty Private Bank fell the most, with cuts exceeding up to 4.5%. The stock market crash today resulted in the decline in market capitalisation of all listed companies on BSE by around  ₹10 lakh crore to around  ₹465 lakh crore.Apart from the rising tensions in the Middle East, the new guidelines by the capital market Securities and Exchange Board of India (SEBI) for derivatives trading also weighed on market sentiment.Commenting on today's market performance, Vinod Nair, Head of Research, Geojit Financial Services, said, \"The domestic market took a sharp downturn following Iran’s launch of ballistic missiles at Israel, sparking fears of retaliation and escalation in war. This could potentially drive-up oil prices and lead to inflationary pressures. Additionally, new SEBI regulations for the F\u0026O segment have raised concerns about reduced trading volumes in the broader market. Lastly, with attractive valuations in China, FIIs have redirected their funds, adding pressure on Indian stocks.\"Here are five key factors why Indian stock market crashed today:Tensions in the Middle East escalated after Iran fired a barrage of around 200 missiles at Israel on 1 October in retaliation to the killing of Hezbollah’s Hassan Nasrallah. Israel has vowed to make Iran ‘pay’ for the attack on its territory, with Tehran warning it would launch an even bigger attack if it were targeted. Israel also said it began limited ground incursions into Lebanon targeting the Iran-backed Hezbollah militia.In the latest development, the Guardian reported that at least six people have been killed and seven were injured in an Israeli attack on a health center in central Beirut.Market regulator Sebi tightened the rules for equity derivatives trading, raising the entry barrier and making it more costly to trade in the asset class. In its latest circular, Sebi announced a slew of new guidelines, including the reduction of the number of weekly options contracts available to trade to one per exchange, raising the minimum trading amount nearly three times, among others.Puneet Sharma, CEO and fund manager at Whitespace Alpha believes while these guardrails can strengthen market resilience, they also introduce challenges.“Stricter norms around leverage, transparency, and capital adequacy could limit the ability of investors to determine their own risk appetite, thereby stifling innovation in trading strategies. By putting guardrails around the market, Sebi may inadvertently reduce participation from those investors who could have otherwise contributed significantly to the evolution and liquidity of the market. Over-regulation in an environment that thrives on strategic flexibility and creativity could dampen the market’s dynamism, affecting India's competitiveness in the global derivatives landscape,” Sharma said.According to him, the challenge now is for market participants to align with these enhanced compliance standards while striving to maintain innovation and growth.Crude oil prices traded higher as worries of a further escalation in the Middle East intensified, stoking anxieties that oil supplies from the world’s top-producing region may be threatened if the conflict intensifies. A rise in oil prices is a negative for importers of the commodity like India, as crude contributes significantly to the country’s import bill.Brent crude futures rose 1.24% to $74.82 a barrel, while US West Texas Intermediate crude futures rallied 1.37% to $71.06 a barrel.Foreign institutional investors (FIIs) extended their selling as they sold equities worth  ₹5,579.35 crore on 1 October, while domestic institutional investors extended their buying as they bought equities worth  ₹4,609.55 crore. FIIs were net sellers for the third consecutive day on Tuesday.V.K. Vijayakumar, chief investment strategist, Geojit Financial Services is of the view that FIIs may continue to sell since Chinese stocks have turned bullish and a lot of money is moving into the Hong Kong market which continues to be cheap relative to the high valuations in India.Nifty 50 broke the downside support levels of 25,700, followed by 25,500.“A break below these levels could trigger additional selling of 300 - 500 points. Traders with long positions are advised to book profits near resistance zones and wait for dips to re-enter buying positions,” said Hardik Matalia, Derivative Analyst at Choice Broking.According to Santosh Meena, while the Nifty 50 is currently trading around its 20-day moving average (DMA) of 25,500, there is a possibility of a rebound from these levels.“However, selling pressure at higher levels remains a risk. The recent high of 26,277 is likely to act as a near-term resistance, and traders are advised to adopt a ‘sell on rise’ strategy until the Nifty fails to sustain above the 26,000 mark. On the downside, key support levels to watch are 25,100 and 24,800,” Meena said.Santosh Meena believes for long-term investors, this correction offers a good buying opportunity in large-cap stocks, where valuations have become more attractive. We are observing sectoral rotation, with commodity-related stocks expected to perform well in the near term, he added.","cleaned_content":"the indian stock market experienced a significant crash on thursday with the benchmark indices sensex and nifty \u003cFIVE_TEN\u003e both closing the session down over \u003cTWO_PERCENT\u003e this marked their worst intraday drop in two months as investor sentiment soured amid escalating tensions between iran and israel prompting a shift away from riskier assets like stocks the nifty \u003cFIVE_TEN\u003e finished \u003cTWO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e dipping below the \u003cTWO_TEN_THOUSAND\u003e point mark for the first time since mid september this decline has resulted in a \u003cTHREE_PERCENT\u003e correction for the index over just four sessions similarly the sensex closed down \u003cTWO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e points breaching the \u003cEIGHT_TEN_THOUSAND\u003e mark for the first time since mid september this represents the fourth consecutive day of losses for the index accumulating a total decline of \u003cTHREE_PERCENT\u003e in the broader market the nifty midcap \u003cONE_HUNDRED\u003e index fell \u003cTWO_PERCENT\u003e closing at \u003cFIVE_TEN_THOUSAND\u003e points while the nifty smallcap \u003cONE_HUNDRED\u003e ended the trading day down \u003cONE_PERCENT\u003e at \u003cONE_TEN_THOUSAND\u003e points all the sectoral indices barring the metals ended in the red nifty auto nifty fmcg nifty realty nifty private bank fell the most with cuts exceeding up to \u003cFOUR_PERCENT\u003e the stock market crash today resulted in the decline in market capitalisation of all listed companies on bse by around \u003cONE_TEN\u003e lakh crore to around \u003cFOUR_HUNDRED\u003e lakh crore apart from the rising tensions in the middle east the new guidelines by the capital market securities and exchange board of india sebi for derivatives trading also weighed on market sentiment commenting on todays market performance vinod nair head of research geojit financial services said the domestic market took a sharp downturn following iran s launch of ballistic missiles at israel sparking fears of retaliation and escalation in war this could potentially drive up oil prices and lead to inflationary pressures additionally new sebi regulations for the f o segment have raised concerns about reduced trading volumes in the broader market lastly with attractive valuations in china fiis have redirected their funds adding pressure on indian stocks here are five key factors why indian stock market crashed today tensions in the middle east escalated after iran fired a barrage of around \u003cTWO_HUNDRED\u003e missiles at israel on \u003cONE_\u003e october in retaliation to the killing of hezbollah s hassan nasrallah israel has vowed to make iran pay for the attack on its territory with tehran warning it would launch an even bigger attack if it were targeted israel also said it began limited ground incursions into lebanon targeting the iran backed hezbollah militia in the latest development the guardian reported that at least six people have been killed and seven were injured in an israeli attack on a health center in central beirut market regulator sebi tightened the rules for equity derivatives trading raising the entry barrier and making it more costly to trade in the asset class in its latest circular sebi announced a slew of new guidelines including the reduction of the number of weekly options contracts available to trade to one per exchange raising the minimum trading amount nearly three times among others puneet sharma ceo and fund manager at whitespace alpha believes while these guardrails can strengthen market resilience they also introduce challenges stricter norms around leverage transparency and capital adequacy could limit the ability of investors to determine their own risk appetite thereby stifling innovation in trading strategies by putting guardrails around the market sebi may inadvertently reduce participation from those investors who could have otherwise contributed significantly to the evolution and liquidity of the market over regulation in an environment that thrives on strategic flexibility and creativity could dampen the market s dynamism affecting indias competitiveness in the global derivatives landscape sharma said according to him the challenge now is for market participants to align with these enhanced compliance standards while striving to maintain innovation and growth crude oil prices traded higher as worries of a further escalation in the middle east intensified stoking anxieties that oil supplies from the world s top producing region may be threatened if the conflict intensifies a rise in oil prices is a negative for importers of the commodity like india as crude contributes significantly to the country s import bill brent crude futures rose \u003cONE_PERCENT\u003e to \u003cSEVEN_TEN\u003e a barrel while us west texas intermediate crude futures rallied \u003cONE_PERCENT\u003e to \u003cSEVEN_TEN\u003e a barrel foreign institutional investors fiis extended their selling as they sold equities worth \u003cFIVE_THOUSAND\u003e crore on \u003cONE_\u003e october while domestic institutional investors extended their buying as they bought equities worth \u003cFOUR_THOUSAND\u003e crore fiis were net sellers for the third consecutive day on tuesday v k vijayakumar chief investment strategist geojit financial services is of the view that fiis may continue to sell since chinese stocks have turned bullish and a lot of money is moving into the hong kong market which continues to be cheap relative to the high valuations in india nifty \u003cFIVE_TEN\u003e broke the downside support levels of \u003cTWO_TEN_THOUSAND\u003e followed by \u003cTWO_TEN_THOUSAND\u003e a break below these levels could trigger additional selling of \u003cTHREE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e points traders with long positions are advised to book profits near resistance zones and wait for dips to re enter buying positions said hardik matalia derivative analyst at choice broking according to santosh meena while the nifty \u003cFIVE_TEN\u003e is currently trading around its \u003cTWO_TEN\u003e day moving average dma of \u003cTWO_TEN_THOUSAND\u003e there is a possibility of a rebound from these levels however selling pressure at higher levels remains a risk the recent high of \u003cTWO_TEN_THOUSAND\u003e is likely to act as a near term resistance and traders are advised to adopt a sell on rise strategy until the nifty fails to sustain above the \u003cTWO_TEN_THOUSAND\u003e mark on the downside key support levels to watch are \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e meena said santosh meena believes for long term investors this correction offers a good buying opportunity in large cap stocks where valuations have become more attractive we are observing sectoral rotation with commodity related stocks expected to perform well in the near term he added","timestamp":"2024-10-03T15:41:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}