{"url":"https://www.livemint.com/market/stock-market-news/muted-debut-western-carriers-shares-lists-at-rs-171-on-nse-0-58-down-from-its-ipo-price-of-rs-172-11727151012118.html","title":"Muted Debut: Western Carriers shares lists at  ₹171 on NSE, 0.58% down from its IPO price of  ₹172","description":"Western Carriers (India) IPO listing: Shares of Western Carriers (India) made a robust debut on the bourses today. It listed at  ₹171 on NSE, a discount of half a percent from its IPO price of  ₹172. Meanwhile, on BSE, it listed at  ₹170, a discount of 1.16 percent from issue price.","content":"Western Carriers (India) IPO listing: Western Carriers (India) IPO listing: Shares of Western Carriers (India) made a robust debut on the bourses today. It listed at  ₹171 on NSE, a discount of half a percent from its IPO price of  ₹172. Meanwhile, on BSE, it listed at  ₹170, a discount of 1.16 percent from issue price.The initial public offering (IPO), valued at  ₹492.88 crore, was open for subscription from September 13, 2024, to September 19, 2024, with a price band set in the range of  ₹163-172 per share.During the 3 days of bidding the IPO closed with a robust demand, with the issue subscribed 31.69 times overall. The IPO received bids for 63.57 crore shares against the 2 crore shares on offer. The retail investor segment saw a subscription of 26.92 times, while the Non Institutional Investors (NII) category was booked 46.68 times. Meanwhile, the Qualified Institutional Buyers (QIBs) quota was bid 28.81 times.The issue was a combination of fresh issue of 2.33 crore shares aggregating to  ₹400.00 crores and offer for sale of 0.54 crore shares aggregating to  ₹92.88 crores. The minimum application size for retail investors is set at 87 shares, requiring an investment of  ₹14,964.The net proceeds from the Fresh Issue, after deducting the expenses related to the offer, are planned to be utilized for several purposes. These include the prepayment or scheduled repayment of a portion of the company's outstanding borrowings. Additionally, the funds will be allocated to capital expenditure needs, specifically for the purchase of commercial vehicles, specialized 40-foot containers, standard 20-foot shipping containers, and reach stackers. A portion of the proceeds will also be directed towards general corporate purposes.JM Financial Limited and Kotak Mahindra Capital Company Limited are the book running lead managers of the Western Carriers (India) IPO, while Link Intime India Private Ltd is the registrar for the issue.Western Carriers (India) Limited is a multi-modal, rail-centric, 4PL asset-light logistics provider. Founded in March 2011, the company offers a broad range of customizable logistics solutions, covering road, rail, water, and air transport, along with a suite of value-added services. It serves various sectors, including metals, FMCG, pharmaceuticals, chemicals, engineering, oil and gas, and retail. The company's clientele features prominent names such as Tata Steel, Hindalco, JSW Steel, HUL, and Cipla, among others.Western Carriers also provides chartering services for international destinations, stevedoring at Indian ports, and coastal cargo movement within India. It leverages an asset-light model, combining rail and road transportation, and manages supply chains for increased imports, exports, and production for leading metals and resource companies. The company saw its revenue grow by 3 percent and its profit after tax (PAT) rise by 12 percent in the fiscal year ending March 31, 2024, compared to the previous year.","cleaned_content":"western carriers india ipo listing western carriers india ipo listing shares of western carriers india made a robust debut on the bourses today it listed at \u003cONE_HUNDRED\u003e on nse a discount of half a percent from its ipo price of \u003cONE_HUNDRED\u003e meanwhile on bse it listed at \u003cONE_HUNDRED\u003e a discount of \u003cONE_PERCENT\u003e from issue price the initial public offering ipo valued at \u003cFOUR_HUNDRED\u003e crore was open for subscription from september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e with a price band set in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e per share during the \u003cTHREE_\u003e days of bidding the ipo closed with a robust demand with the issue subscribed \u003cTHREE_TEN\u003e times overall the ipo received bids for \u003cSIX_TEN\u003e crore shares against the \u003cTWO_\u003e crore shares on offer the retail investor segment saw a subscription of \u003cTWO_TEN\u003e times while the non institutional investors nii category was booked \u003cFOUR_TEN\u003e times meanwhile the qualified institutional buyers qibs quota was bid \u003cTWO_TEN\u003e times the issue was a combination of fresh issue of \u003cTWO_\u003e crore shares aggregating to \u003cFOUR_HUNDRED\u003e crores and offer for sale of \u003cZERO_\u003e crore shares aggregating to \u003cNINE_TEN\u003e crores the minimum application size for retail investors is set at \u003cEIGHT_TEN\u003e shares requiring an investment of \u003cONE_TEN_THOUSAND\u003e the net proceeds from the fresh issue after deducting the expenses related to the offer are planned to be utilized for several purposes these include the prepayment or scheduled repayment of a portion of the companys outstanding borrowings additionally the funds will be allocated to capital expenditure needs specifically for the purchase of commercial vehicles specialized \u003cFOUR_TEN\u003e foot containers standard \u003cTWO_TEN\u003e foot shipping containers and reach stackers a portion of the proceeds will also be directed towards general corporate purposes jm financial limited and kotak mahindra capital company limited are the book running lead managers of the western carriers india ipo while link intime india private ltd is the registrar for the issue western carriers india limited is a multi modal rail centric \u003cFOUR_\u003e pl asset light logistics provider founded in march \u003cTWO_THOUSAND\u003e the company offers a broad range of customizable logistics solutions covering road rail water and air transport along with a suite of value added services it serves various sectors including metals fmcg pharmaceuticals chemicals engineering oil and gas and retail the companys clientele features prominent names such as tata steel hindalco jsw steel hul and cipla among others western carriers also provides chartering services for international destinations stevedoring at indian ports and coastal cargo movement within india it leverages an asset light model combining rail and road transportation and manages supply chains for increased imports exports and production for leading metals and resource companies the company saw its revenue grow by \u003cTHREE_PERCENT\u003e and its profit after tax pat rise by \u003cONE_TEN_PERCENT\u003e in the fiscal year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e compared to the previous year","timestamp":"2024-09-24T10:00:00+05:30","market_timestamp":"2024-09-24T10:00:00+05:30","off_market_hours":false}