{"url":"https://www.livemint.com/market/stock-market-news/40-rally-in-one-week-why-is-subhash-ghai-owned-mukta-arts-shares-skyrocketing-11727324260665.html","title":"40% rally in one week. Why are Subhash Ghai-owned Mukta Arts shares skyrocketing?","description":"Stock Market today: Mukta Arts MUKTA share price gained more than 15% on Thursday. With this the share price has risen almost 40% in last five trading sessions. The share price has been rising as Mukta Arts and Zee Entertainment have signed to a 6-Year Agreement for 37 Films.","content":"Stock Market today: MUKTA ARTS LTD Share price gained more than 15% on Thursday. Mukta Arts share price has risen almost 40% in last five trading sessionsThe Mukta Arts share price has been rising as Mukta Arts and Zee Entertainment have signed to a 6-Year Agreement for 37 Films.As per the Mukta Arts release on the exchanges dated 24th September, 2024, Mukta Arts informed that Assignment Agreement and Term Sheet has been executed between the Company and Zee Entertainment Enterprises Limited (“Zee”) for Assignment of Satellite and Media Rights of 37 Films of the Company for a limited period of 6 years commencing from 25th August, 2027 for a total consideration of 25% more as compared to previous Agreement and as per the terms and conditions entered between the Company and Zee.Mukta Arts also said that the Agreement is in the normal course of business and does not impact the management of the Company.The Mukta Arts share price that opened at  ₹104.00 on the BSE on Thursday , more than 7% higher than the previous close of  ₹97.09 , however gained further. Mukta Arts share price hit intraday highs of  ₹115.08, which also remains 1 year or 52 week high of Mukta arts share price.The Mukta arts share price has been rising for last 5 sessions and is up almost 40%.Mukta Arts' revenue from operations for the fiscal year that ended on March 31, 2024, was  ₹209 crore.In addition to creating TV and OTT content, it runs a chain of multiplexes called Mukta A2 Cinemas.Zee Entertainment Enterprises share price too has been rising and is up 6-7% during last five trading sessions.The company had recorded a Consolidated Total Income of  ₹2149.52 Crore for the quarter that ended on June 30, 2024. This was an increase of 7.57% over the same quarter last year at  ₹1998.26 Crore, but a decrease of 1.64% from the previous quarter's Total Income of  ₹2185.29 Crore. In the quarter gone by, the company achieved net profit after tax of  ₹118.01 crore. compared to a loss in the year ago quarter.","cleaned_content":"stock market today mukta arts ltd share price gained more than \u003cONE_TEN_PERCENT\u003e on thursday mukta arts share price has risen almost \u003cFOUR_TEN_PERCENT\u003e in last five trading sessionsthe mukta arts share price has been rising as mukta arts and zee entertainment have signed to a \u003cSIX_\u003e year agreement for \u003cTHREE_TEN\u003e films as per the mukta arts release on the exchanges dated \u003cTWO_TEN\u003e th september \u003cTWO_THOUSAND\u003e mukta arts informed that assignment agreement and term sheet has been executed between the company and zee entertainment enterprises limited zee for assignment of satellite and media rights of \u003cTHREE_TEN\u003e films of the company for a limited period of \u003cSIX_\u003e years commencing from \u003cTWO_TEN\u003e th august \u003cTWO_THOUSAND\u003e for a total consideration of \u003cTWO_TEN_PERCENT\u003e more as compared to previous agreement and as per the terms and conditions entered between the company and zee mukta arts also said that the agreement is in the normal course of business and does not impact the management of the company the mukta arts share price that opened at \u003cONE_HUNDRED\u003e on the bse on thursday more than \u003cSEVEN_PERCENT\u003e higher than the previous close of \u003cNINE_TEN\u003e however gained further mukta arts share price hit intraday highs of \u003cONE_HUNDRED\u003e which also remains \u003cONE_\u003e year or \u003cFIVE_TEN\u003e week high of mukta arts share price the mukta arts share price has been rising for last \u003cFIVE_\u003e sessions and is up almost \u003cFOUR_TEN_PERCENT\u003e mukta arts revenue from operations for the fiscal year that ended on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e was \u003cTWO_HUNDRED\u003e crore in addition to creating tv and ott content it runs a chain of multiplexes called mukta a2 cinemas zee entertainment enterprises share price too has been rising and is up \u003cSIX_\u003e \u003cSEVEN_PERCENT\u003e during last five trading sessions the company had recorded a consolidated total income of \u003cTWO_THOUSAND\u003e crore for the quarter that ended on june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e this was an increase of \u003cSEVEN_PERCENT\u003e over the same quarter last year at \u003cONE_THOUSAND\u003e crore but a decrease of \u003cONE_PERCENT\u003e from the previous quarters total income of \u003cTWO_THOUSAND\u003e crore in the quarter gone by the company achieved net profit after tax of \u003cONE_HUNDRED\u003e crore compared to a loss in the year ago quarter","timestamp":"2024-09-26T10:05:00+05:30","market_timestamp":"2024-09-26T10:05:00+05:30","off_market_hours":false}