{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-50-soar-to-fresh-highs-over-250-stocks-hit-fresh-one-year-peaks-11727346367343.html","title":"Stock market today: Sensex, Nifty 50 soar to fresh highs; over 250 stocks hit one-year peaks","description":"Stock market today: The Indian stock market benchmarks, Sensex and Nifty 50, reached new all-time highs, rising nearly one per cent. Key contributors included automakers like Mahindra and Mahindra, Maruti, and Tata Motors.","content":"Stock market today: Indian stock market benchmarks- the Sensex and the Nifty 50- rose almost a per cent each to hit their fresh all-time highs on Thursday, September 26, with gains led by select automaker heavyweights, including Mahindra and Mahindra, Maruti Suzuki and Tata Motors.The Sensex hit a fresh record high of 85,930.43 before closing 0.78 per cent higher at 85,836.12. The Nifty 50 made a fresh peak of 26,250.90 but closed at 26,216.05, up 0.81 per cent.While the large caps stole the show, mid and small-cap segments remained subdued. The BSE Midcap index ended almost flat, and the BSE Smallcap index dropped 0.39 per cent.The overall market capitalisation of BSE-listed firms rose to  ₹477 lakh crore from  ₹475 lakh crore in the previous session, making investors richer by about  ₹2 lakh crore in a day.As many as 257 stocks, including ITC, Mahindra and Mahindra, NTPC, Bharti Airtel, Bajaj Finserv and Sun Pharma, hit their fresh 52-week highs in intraday trade on BSE.Positive global cues and gains in select auto, FMCG and other index heavyweights drove the Indian stock market benchmarks to higher levels on the monthly derivatives expiry day.Shares of Maruti Suzuki, Mahindra and Mahindra, Reliance Industries, Tata Motors, ITC and Hindustan Unilever were the top contributors to the gains in the Nifty index.As many as 41 stocks ended with gains in the Nifty 50 index.The Nifty Auto index jumped 2.26 per cent, followed by the Nifty Metal index, which rose 2.13 per cent.\"China's recent economic stimulus announcement has greatly enhanced investor confidence, resulting in significant positive momentum in global markets, especially within Asian indices. The Indian market is reaching new highs, anticipating a strong recovery in corporate earnings for the H2FY25, fuelled by expected government expenditure. This rally is led by large-cap stocks, which are more fairly valued compared to mid and small caps, which are exhibiting signs of fatigue,\" said Vinod Nair, Head of Research, Geojit Financial Services.Global markets across Europe and Asia traded in the green following China’s announcement of key measures to bolster its economy. Adding to the positive sentiment is the start of the rate-cut cycle in the US, which has further buoyed market optimism.\"Winding up of positions by investors on the monthly expiry day coupled with buoyancy in Asian and European market cues triggered a sharp upsurge as both benchmark Sensex and Nifty scaled fresh highs,\" said Prashanth Tapse, Senior VP (Research), Mehta Equities.\"Buying in banking, auto, and metal stocks led the rally in benchmark indices, with the Sensex now inching towards the 86k mark. Falling bond yields in the US and some other developed economies, coupled with stimulus announcements by China, have fuelled fresh optimism in global equity markets, including India,\" said Tapse.Read all market-related news here","cleaned_content":"stock market today indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e rose almost a per cent each to hit their fresh all time highs on thursday september \u003cTWO_TEN\u003e with gains led by select automaker heavyweights including mahindra and mahindra maruti suzuki and tata motors the sensex hit a fresh record high of \u003cEIGHT_TEN_THOUSAND\u003e before closing \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e made a fresh peak of \u003cTWO_TEN_THOUSAND\u003e but closed at \u003cTWO_TEN_THOUSAND\u003e up \u003cZERO_PERCENT\u003e while the large caps stole the show mid and small cap segments remained subdued the bse midcap index ended almost flat and the bse smallcap index dropped \u003cZERO_PERCENT\u003e the overall market capitalisation of bse listed firms rose to \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors richer by about \u003cTWO_\u003e lakh crore in a day as many as \u003cTWO_HUNDRED\u003e stocks including itc mahindra and mahindra ntpc bharti airtel bajaj finserv and sun pharma hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on bse positive global cues and gains in select auto fmcg and other index heavyweights drove the indian stock market benchmarks to higher levels on the monthly derivatives expiry day shares of maruti suzuki mahindra and mahindra reliance industries tata motors itc and hindustan unilever were the top contributors to the gains in the nifty index as many as \u003cFOUR_TEN\u003e stocks ended with gains in the nifty \u003cFIVE_TEN\u003e index the nifty auto index jumped \u003cTWO_PERCENT\u003e followed by the nifty metal index which rose \u003cTWO_PERCENT\u003e chinas recent economic stimulus announcement has greatly enhanced investor confidence resulting in significant positive momentum in global markets especially within asian indices the indian market is reaching new highs anticipating a strong recovery in corporate earnings for the h2fy25 fuelled by expected government expenditure this rally is led by large cap stocks which are more fairly valued compared to mid and small caps which are exhibiting signs of fatigue said vinod nair head of research geojit financial services global markets across europe and asia traded in the green following china s announcement of key measures to bolster its economy adding to the positive sentiment is the start of the rate cut cycle in the us which has further buoyed market optimism winding up of positions by investors on the monthly expiry day coupled with buoyancy in asian and european market cues triggered a sharp upsurge as both benchmark sensex and nifty scaled fresh highs said prashanth tapse senior vp research mehta equities buying in banking auto and metal stocks led the rally in benchmark indices with the sensex now inching towards the \u003cEIGHT_TEN\u003e k mark falling bond yields in the us and some other developed economies coupled with stimulus announcements by china have fuelled fresh optimism in global equity markets including india said tapse read all market related news here","timestamp":"2024-09-26T16:50:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}