{"url":"https://www.livemint.com/market/stock-market-news/westlife-foodworld-stock-climbs-9-after-goldman-sachs-boosts-rating-to-buy-just-2-away-from-record-high-11727420279310.html","title":"Westlife Foodworld stock climbs 9% after Goldman Sachs boosts rating to ’Buy’, just 2% away from record high","description":"Goldman Sachs upgraded Westlife Foodworld to 'buy' with a target price of  ₹1,075, citing recovery potential from new product launches like the McCrispy platform. Shares surged over 9% following the recommendation, reflecting optimism for future same-store sales growth.","content":"Shares of McDonald's operator Westlife Foodworld surged over 9 per cent in intra-day deals on Friday, September 27 following an upgrade by brokerage house Goldman Sachs, which raised its recommendation to 'buy' with a target price of  ₹1,075. This target implies a potential upside of 22.6 per cent from the stock’s previous closing price.Goldman Sachs highlighted the launch of the McCrispy platform as a major driver for Westlife’s recovery. According to the brokerage, this marked the first significant addition to McDonald’s core burger lineup in over a decade, with the last being the introduction of the McSpicy range in 2011.The McCrispy platform includes premium offerings such as the McCrispy Chicken Burger and Crispy Veggie Burger across West and South India, and Crispy Fried Chicken in the Southern region. These items are positioned at the higher end of the menu, aligning with McDonald’s global focus on expanding its chicken category, which Goldman Sachs views as beneficial for Westlife.The brokerage also forecasted that Westlife's same-store sales growth (SSSG) would begin recovering in the second half of FY25, supported by a soft base from the previous year. Looking ahead, it expects high single-digit SSSG from FY26, further strengthening the company's performance outlook.The QSR stock climbed as much as 9.1 per cent to its day's high of  ₹956.65. The stock is now just 2 per cent away from its record high of  ₹975.65, hit in October last year. Meanwhile, the stock has advanced over 36 per cent from its 52-week low of  ₹701.05, recorded in March this year.The upgrade and positive outlook caused a surge in trading volume, with over 1.5 million shares of Westlife changing hands across the BSE and NSE on September 27, far exceeding the one-month average of 100,000 shares.The midcap stock has shed almost 10 per cent in the last one year and over 17 per cent year-to-date (YTD). It has jumped 13 per cent in September so far after two straight months of losses. The calendar year so far has been extremely volatile for the stock.Westlife Foodworld, which operates nearly 400 McDonald’s restaurants across 62 cities in West and South India, including Maharashtra, Karnataka, Telangana, Gujarat, and Tamil Nadu, has faced challenges in recent quarters. In its first-quarter FY24 results, the company reported a significant decline in profit due to weak demand and rising costs. Consolidated profit after tax for the quarter ending June 30 fell by 89 per cent year-on-year to  ₹3.25 crore. Same-store sales also dropped by 6.7 per cent during the quarter.Westlife’s operating expenses increased by around 7 per cent to  ₹617 crore, driven by higher royalty costs, though the company did not provide further details. Revenue from operations remained flat at  ₹616 crore. Chairperson Amit Jatia noted that the first quarter's results reflected the ongoing challenges in the current operating environment.Despite these near-term setbacks, Goldman Sachs expressed confidence in Westlife’s recovery potential, particularly with the support of new product launches and a focused growth strategy.","cleaned_content":"shares of mcdonalds operator westlife foodworld surged over \u003cNINE_PERCENT\u003e in intra day deals on friday september \u003cTWO_TEN\u003e following an upgrade by brokerage house goldman sachs which raised its recommendation to buy with a target price of \u003cONE_THOUSAND\u003e this target implies a potential upside of \u003cTWO_TEN_PERCENT\u003e from the stock s previous closing price goldman sachs highlighted the launch of the mccrispy platform as a major driver for westlife s recovery according to the brokerage this marked the first significant addition to mcdonald s core burger lineup in over a decade with the last being the introduction of the mcspicy range in \u003cTWO_THOUSAND\u003e the mccrispy platform includes premium offerings such as the mccrispy chicken burger and crispy veggie burger across west and south india and crispy fried chicken in the southern region these items are positioned at the higher end of the menu aligning with mcdonald s global focus on expanding its chicken category which goldman sachs views as beneficial for westlife the brokerage also forecasted that westlifes same store sales growth sssg would begin recovering in the second half of fy25 supported by a soft base from the previous year looking ahead it expects high single digit sssg from fy26 further strengthening the companys performance outlook the qsr stock climbed as much as \u003cNINE_PERCENT\u003e to its days high of \u003cNINE_HUNDRED\u003e the stock is now just \u003cTWO_PERCENT\u003e away from its record high of \u003cNINE_HUNDRED\u003e hit in october last year meanwhile the stock has advanced over \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSEVEN_HUNDRED\u003e recorded in march this year the upgrade and positive outlook caused a surge in trading volume with over \u003cONE_\u003e million shares of westlife changing hands across the bse and nse on september \u003cTWO_TEN\u003e far exceeding the one month average of \u003cONE_HUNDRED_THOUSAND\u003e shares the midcap stock has shed almost \u003cONE_TEN_PERCENT\u003e in the last one year and over \u003cONE_TEN_PERCENT\u003e year to date ytd it has jumped \u003cONE_TEN_PERCENT\u003e in september so far after two straight months of losses the calendar year so far has been extremely volatile for the stock westlife foodworld which operates nearly \u003cFOUR_HUNDRED\u003e mcdonald s restaurants across \u003cSIX_TEN\u003e cities in west and south india including maharashtra karnataka telangana gujarat and tamil nadu has faced challenges in recent quarters in its first quarter fy24 results the company reported a significant decline in profit due to weak demand and rising costs consolidated profit after tax for the quarter ending june \u003cTHREE_TEN\u003e fell by \u003cEIGHT_TEN_PERCENT\u003e year on year to \u003cTHREE_\u003e crore same store sales also dropped by \u003cSIX_PERCENT\u003e during the quarter westlife s operating expenses increased by around \u003cSEVEN_PERCENT\u003e to \u003cSIX_HUNDRED\u003e crore driven by higher royalty costs though the company did not provide further details revenue from operations remained flat at \u003cSIX_HUNDRED\u003e crore chairperson amit jatia noted that the first quarters results reflected the ongoing challenges in the current operating environment despite these near term setbacks goldman sachs expressed confidence in westlife s recovery potential particularly with the support of new product launches and a focused growth strategy","timestamp":"2024-09-27T12:39:00+05:30","market_timestamp":"2024-09-27T12:39:00+05:30","off_market_hours":false}