{"url":"https://www.livemint.com/market/stock-market-news/unlock-stock-market-success-benefits-of-a-demat-account-and-step-by-step-guide-to-open-one-11727865771948.html","title":"17 crore Demat accounts and you are still missing out","description":"Opening a Demat account is essential for wealth creation, as traditional investments like FDs yield low returns. With stocks offering significantly higher returns, having a Demat account allows investors to participate in the market effectively.","content":"India now ranks 9th globally with over 17 crore active Demat accounts. Still:If you are one of those 87%, then you may never be rich. People are slowly realising this, and stock market participation is rising! So far, in 2024, 3.18 crore new accounts have been opened, surpassing last year's total. This article discusses why you should get a Demat account immediately, its benefits, and how you can choose one that fits you best!Gold and Fixed Deposits (FDs) may seem safe investment options. However, if you do not invest in the stock market, you could be missing out on 200% returns. In the past 6 months, various stocks and indices have given returns ranging from 14% to 277%.Lately, people have started recognising the stock market's potential. The number of demat accounts has grown exponentially from 39 lahks in FY2013-14 to 399 lahks in FY2023-24. The infographic below shows the rise in the number of demat accounts for the past 10 years. However, only about 3% of Indians participate in the stock market.There are many reasons to open a Demat account. If the growing number of Demat accounts and potential returns don't convince you, here's another fact that might!Did you know that you are essentially losing money on FDs and endowment plans? These instruments only generate about 4-6% returns. Considering inflation, you could lose over  ₹14 lakh on an investment of  ₹50 lakh in 10 years!That's why you need a Demat account today; to take advantage of the stock market and grow your wealth. Before you open one, there are certain things you must know, such as what a Demat account is and the advantages it provides.However, choosing one can be quite difficult with so many different options out there. But worry not! At Finology Select, you’ll find the top brokers with their features, benefits, comparisons and everything else you need to make the right choice.It is short for \"dematerialised account”. Think of it as a digital bank account for your investments. You need one to buy/sell stocks. Like a bank account keeps your money safe, a Demat account keeps your stocks and securities safe in a digital format.Initially, shares were held in the form of physical certificates, which were prone to loss, damage, or theft. A Demat account emerged as the solution to these problems.Now, if you want to open a Demat account, you need to approach a Depository Participant (DP). It may be a bank, Financial Institution (FI), or stockbroker registered with depositories like the National Securities Depository Limited (NSDL) or the Central Depository Services Limited (CDSL). It is similar to a middleman between you and the depository. When you buy or sell shares, the DP manages the flow by crediting or debiting your Demat account. It makes sure that you retain ownership of your shares.Opening a Demat account comes with numerous advantages:FDs can earn an interest between 3.50% - 7.80%. However, in 2023, the Nifty 50 gave 20% returns, and the Sensex gave over 18% returns. Without a Demat account, you will be stuck with meagre returns and will never be able to create wealth.Here's a simple step-by-step guide to opening a Demat account:1. Choose a Broker: You can consider various brokers offering Demat account services. You can find reliable brokers such as Groww, Zerodha, Angel One, and 22 others on Finology Select.2. Choose Account Type: There are two types of Demat accounts:3. Document Submission: Typically, the required documents include:4. KYC Verification: The DP carries out this step, ensuring compliance with regulatory requirements5. In-person Verification: This can be done via a video call or by visiting the DP's office6. Agreement Signing: An agreement or consent form outlining the terms and conditions of the Demat account and the services provided by the DP7. Account Activation: The DP provides a unique Demat account number (similar to a bank account number) and other relevant account details8. Commence Trading and/or Investing: Electronically buy, sell, hold, and manage investments through a trading platformThe Demat account opening process may vary from broker to broker. Finology Select provides detailed guides on how to open a Demat account with 20+ brokers with images, simplifying the entire process.Here is a list of some of the most prominent brokers in India:Compare their various offerings, features and charges and those of 15 more brokers on Finology Select! But what to do if you have already chosen a broker and want to switch? Well, you can change brokers easily!There are multiple reasons to transfer shares from one Demat account to another. It may be to switch to a broker offering better services or lower fees or simply move your shares to a family member's account. It can be done in two ways:Step 1: Ask your current broker for a Delivery Instruction Slip (DIS), it contains all the necessary details needed for the transfer.Step 2: Fill in the following details:Step 3: Sign the document and give it to your current broker.Step 4: Investors may need to pay a fee for the transfer.Step 4: Collect the acknowledgement slip.Consequently, the shares will be transferred within 3-5 days.Step 1: Visit the CDSL or NSDL website and sign up for the ‘Easiest’ or ‘Speed-e’ facility.Step 2: Fill in all the required details and submit the form.Step 3: Provide a copy of the form to your DP, which will then send it to the central depository.Step 4: Relevant authorities will verify your information, and you will receive your login details within 1 to 2 days.Now, you can transfer stocks from your demat account whenever you want.Nearly 3.10 crore fresh Demat accounts were opened in 2023 and 3.18 crore in 2024. Having a Demat account has become a necessity for wealth creation. Without a Demat account, you can’t invest in the stock market or earn high returns.More investors are recognising how important a Demat account is to their investment strategy. The financial markets are now almost completely digital, and in this scenario, having a reliable platform to find broker information can help your investment experience.Opening a Demat account may be a complex procedure, but it does not have to be difficult. With the right guide, like Finology Select, it's as easy as pie.","cleaned_content":"india now ranks \u003cNINE_\u003e th globally with over \u003cONE_TEN\u003e crore active demat accounts still if you are one of those \u003cEIGHT_TEN_PERCENT\u003e then you may never be rich people are slowly realising this and stock market participation is rising so far in \u003cTWO_THOUSAND\u003e \u003cTHREE_\u003e crore new accounts have been opened surpassing last years total this article discusses why you should get a demat account immediately its benefits and how you can choose one that fits you best gold and fixed deposits fds may seem safe investment options however if you do not invest in the stock market you could be missing out on \u003cTWO_HUNDRED_PERCENT\u003e returns in the past \u003cSIX_\u003e months various stocks and indices have given returns ranging from \u003cONE_TEN_PERCENT\u003e to \u003cTWO_HUNDRED_PERCENT\u003e lately people have started recognising the stock markets potential the number of demat accounts has grown exponentially from \u003cTHREE_TEN\u003e lahks in fy2013 \u003cONE_TEN\u003e to \u003cTHREE_HUNDRED\u003e lahks in fy2023 \u003cTWO_TEN\u003e the infographic below shows the rise in the number of demat accounts for the past \u003cONE_TEN\u003e years however only about \u003cTHREE_PERCENT\u003e of indians participate in the stock market there are many reasons to open a demat account if the growing number of demat accounts and potential returns dont convince you heres another fact that might did you know that you are essentially losing money on fds and endowment plans these instruments only generate about \u003cFOUR_\u003e \u003cSIX_PERCENT\u003e returns considering inflation you could lose over \u003cONE_TEN\u003e lakh on an investment of \u003cFIVE_TEN\u003e lakh in \u003cONE_TEN\u003e years thats why you need a demat account today to take advantage of the stock market and grow your wealth before you open one there are certain things you must know such as what a demat account is and the advantages it provides however choosing one can be quite difficult with so many different options out there but worry not at finology select you ll find the top brokers with their features benefits comparisons and everything else you need to make the right choice it is short for dematerialised account think of it as a digital bank account for your investments you need one to buy sell stocks like a bank account keeps your money safe a demat account keeps your stocks and securities safe in a digital format initially shares were held in the form of physical certificates which were prone to loss damage or theft a demat account emerged as the solution to these problems now if you want to open a demat account you need to approach a depository participant dp it may be a bank financial institution fi or stockbroker registered with depositories like the national securities depository limited nsdl or the central depository services limited cdsl it is similar to a middleman between you and the depository when you buy or sell shares the dp manages the flow by crediting or debiting your demat account it makes sure that you retain ownership of your shares opening a demat account comes with numerous advantages fds can earn an interest between \u003cTHREE_PERCENT\u003e \u003cSEVEN_PERCENT\u003e however in \u003cTWO_THOUSAND\u003e the nifty \u003cFIVE_TEN\u003e gave \u003cTWO_TEN_PERCENT\u003e returns and the sensex gave over \u003cONE_TEN_PERCENT\u003e returns without a demat account you will be stuck with meagre returns and will never be able to create wealth heres a simple step by step guide to opening a demat account \u003cONE_\u003e choose a broker you can consider various brokers offering demat account services you can find reliable brokers such as groww zerodha angel one and \u003cTWO_TEN\u003e others on finology select 2 choose account type there are two types of demat accounts \u003cTHREE_\u003e document submission typically the required documents include \u003cFOUR_\u003e kyc verification the dp carries out this step ensuring compliance with regulatory requirements5 in person verification this can be done via a video call or by visiting the dps office6 agreement signing an agreement or consent form outlining the terms and conditions of the demat account and the services provided by the dp7 account activation the dp provides a unique demat account number similar to a bank account number and other relevant account details8 commence trading and or investing electronically buy sell hold and manage investments through a trading platformthe demat account opening process may vary from broker to broker finology select provides detailed guides on how to open a demat account with \u003cTWO_TEN\u003e brokers with images simplifying the entire process here is a list of some of the most prominent brokers in india compare their various offerings features and charges and those of \u003cONE_TEN\u003e more brokers on finology select but what to do if you have already chosen a broker and want to switch well you can change brokers easily there are multiple reasons to transfer shares from one demat account to another it may be to switch to a broker offering better services or lower fees or simply move your shares to a family members account it can be done in two ways step \u003cONE_\u003e ask your current broker for a delivery instruction slip dis it contains all the necessary details needed for the transfer step \u003cTWO_\u003e fill in the following details step \u003cTHREE_\u003e sign the document and give it to your current broker step \u003cFOUR_\u003e investors may need to pay a fee for the transfer step \u003cFOUR_\u003e collect the acknowledgement slip consequently the shares will be transferred within \u003cTHREE_\u003e \u003cFIVE_\u003e days step \u003cONE_\u003e visit the cdsl or nsdl website and sign up for the easiest or speed e facility step \u003cTWO_\u003e fill in all the required details and submit the form step \u003cTHREE_\u003e provide a copy of the form to your dp which will then send it to the central depository step \u003cFOUR_\u003e relevant authorities will verify your information and you will receive your login details within \u003cONE_\u003e to \u003cTWO_\u003e days now you can transfer stocks from your demat account whenever you want nearly \u003cTHREE_\u003e crore fresh demat accounts were opened in \u003cTWO_THOUSAND\u003e and \u003cTHREE_\u003e crore in \u003cTWO_THOUSAND\u003e having a demat account has become a necessity for wealth creation without a demat account you can t invest in the stock market or earn high returns more investors are recognising how important a demat account is to their investment strategy the financial markets are now almost completely digital and in this scenario having a reliable platform to find broker information can help your investment experience opening a demat account may be a complex procedure but it does not have to be difficult with the right guide like finology select its as easy as pie","timestamp":"2024-10-02T17:28:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}