{"url":"https://www.livemint.com/market/stock-market-news/zee-media-shares-hit-10-upper-circuit-to-its-52-week-high-on-fundraising-news-soars-107-from-year-low-11727428359698.html","title":"Zee Media shares hit 10% upper circuit to scale 52-week highs on fundraising news; soar 107% from one-year low","description":"Shares of Zee Media Corporation were locked in the 10 per cent upper circuit of  ₹20.70 on Friday after the company board approved a fundraising plan of up to  ₹200 crore via the issue of warrants.","content":"Shares of Zee Media Corporation were locked in the 10 per cent upper circuit of  ₹20.70, also their 52-week high on Friday, September 27 after the company board approved a fund raise of up to  ₹200 crore via issue of warrants.As per the exchange filing, the company has proposed the issuance of up to 13,33,33,333 (Thirteen Crores Thirty-Three Lakhs Thirty-Three Thousand Three Hundred and Thirty-Three) warrants, fully convertible or exchangeable into one fully paid-up equity share each. These warrants are priced at  ₹15 apiece, amounting to a total not exceeding  ₹200 crore.It further informed that each warrant holder will have the right to apply for and be allotted one fully paid equity share with a face value of Re 1, at an issue price of  ₹15 (including a premium of Rs. 14). Warrant holders have 18 months to convert their warrants into equity shares, added the company.Moreover, the filing added that this preferential issue will be made to entities that are part of the Non-Promoter/Non-Promoter Group of the company, in accordance with SEBI regulations and the Companies Act.An initial payment of 25% of the issue price will be required at the time of warrant subscription and allotment, with the remaining 75% to be paid upon exercising the conversion option within the specified 18-month period. The issue is subject to approval from the company’s members and other regulatory authorities as needed, stated the firm.The company further informed that the trading window for dealing in securities of the company will remain closed with effect from the date and time of this intimation till 48 hours after the declaration of the unaudited financial results of the company for the quarter and period ended September 30, 2024.With today's rally, it has now skyrocketed 107 per cent from its 52-week low of  ₹10, recorded in March 2024.The multibagger stock has climbed 49 per cent in the last one year and 37 per cent in 2024 so far. It has rallied 56 per cent in September so far after a 12 per cent decline in August. Before that it rose for four straight months, rising 1.7 per cent in July, 12.7 per cent in June, 17.8 per cent in May and 7.7 per cent in April. The first three months of the stock, however, were in the red, as it slipped 24.6 per cent in March, 7 per cent in February and 1.7 per cent in January.","cleaned_content":"shares of zee media corporation were locked in the \u003cONE_TEN_PERCENT\u003e upper circuit of \u003cTWO_TEN\u003e also their \u003cFIVE_TEN\u003e week high on friday september \u003cTWO_TEN\u003e after the company board approved a fund raise of up to \u003cTWO_HUNDRED\u003e crore via issue of warrants as per the exchange filing the company has proposed the issuance of up to \u003cONE_HUNDRED_MILLION\u003e thirteen crores thirty three lakhs thirty three thousand three hundred and thirty three warrants fully convertible or exchangeable into one fully paid up equity share each these warrants are priced at \u003cONE_TEN\u003e apiece amounting to a total not exceeding \u003cTWO_HUNDRED\u003e crore it further informed that each warrant holder will have the right to apply for and be allotted one fully paid equity share with a face value of re \u003cONE_\u003e at an issue price of \u003cONE_TEN\u003e including a premium of rs \u003cONE_TEN\u003e warrant holders have \u003cONE_TEN\u003e months to convert their warrants into equity shares added the company moreover the filing added that this preferential issue will be made to entities that are part of the non promoter non promoter group of the company in accordance with sebi regulations and the companies act an initial payment of \u003cTWO_TEN_PERCENT\u003e of the issue price will be required at the time of warrant subscription and allotment with the remaining \u003cSEVEN_TEN_PERCENT\u003e to be paid upon exercising the conversion option within the specified \u003cONE_TEN\u003e month period the issue is subject to approval from the company s members and other regulatory authorities as needed stated the firm the company further informed that the trading window for dealing in securities of the company will remain closed with effect from the date and time of this intimation till \u003cFOUR_TEN\u003e hours after the declaration of the unaudited financial results of the company for the quarter and period ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e with todays rally it has now skyrocketed \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e recorded in march \u003cTWO_THOUSAND\u003e the multibagger stock has climbed \u003cFOUR_TEN_PERCENT\u003e in the last one year and \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e so far it has rallied \u003cFIVE_TEN_PERCENT\u003e in september so far after a \u003cONE_TEN_PERCENT\u003e decline in august before that it rose for four straight months rising \u003cONE_PERCENT\u003e in july \u003cONE_TEN_PERCENT\u003e in june \u003cONE_TEN_PERCENT\u003e in may and \u003cSEVEN_PERCENT\u003e in april the first three months of the stock however were in the red as it slipped \u003cTWO_TEN_PERCENT\u003e in march \u003cSEVEN_PERCENT\u003e in february and \u003cONE_PERCENT\u003e in january","timestamp":"2024-09-27T14:51:00+05:30","market_timestamp":"2024-09-27T14:51:00+05:30","off_market_hours":false}