{"url":"https://www.livemint.com/market/stock-market-news/stock-market-holiday-in-october-2024-sensex-nifty-nse-bse-to-remain-shut-on-this-day-next-month-oct-2-gandhi-jayanti-11727503182673.html","title":"Stock Market Holiday in October 2024: Sensex, Nifty to remain shut on THIS day next month","description":"The Indian stock market is experiencing bullish growth due to solid domestic investments and positive economic indicators. With Sensex and Nifty 50 reaching new highs, traders should prepare for market closures on October 2 for Gandhi Jayanti.","content":"Ahead of the beginning of October, stock market traders and investors need to be aware of the stock market holidays next month. Both Indian stock exchanges, the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE), will remain shut on 2 October to mark the birth anniversary of Mahatma Gandhi.According to the Bombay Stock Exchange's website, trading in the equity, equity derivative, currency, SLB, commodity, and Electronic Gold Receipts (EGR) segments will remain closed on October 2.The National Stock Exchange's holiday calendar has notified 2 October as a holiday for equities.October 2, 2024 - Gandhi JayantiNovember 1, 2024 - DiwaliNovember 15, 2024 - Guru Nanak JayantiDecember 25, 2024 - ChristmasIndian stock market indices continued their stellar run last week. Benchmark indices Sensex and Nifty 50 broke all-time records and settled at a promising mark on Friday.Last week also saw Sensex surpass the remarkable 85,000 mark, which is seen as a significant milestone by market traders and experts. The achievement has also unlocked another phase of the benchmark index and brightened the prospect of reaching the coveted 1 lakh (1,00,000) mark, indicated market experts to Mint's Pranati Deva.Nifty 50 touched an all-time-high mark of 26,277 on Friday. However, it settled 37 points or 0.14 per cent lower at 26,179 later in the day. Sensex reached an all-time-high mark of 85978.25 during the Friday trading hours after settling 264.27 points or 0.31 per cent lower at 85,571.85.The Indian market growth and robust domestic inflows are the result of several factors, including strong economic projections, robust global market mood, supportive monetary policies, and growing domestic investments, which are contributing to this bullish sentiment in the market. Driven by the positive economic outlook, domestic inflows have increased significantly in recent years, with the rising retail participation in the equity markets creating substantial liquidity and stable demand.","cleaned_content":"ahead of the beginning of october stock market traders and investors need to be aware of the stock market holidays next month both indian stock exchanges the bombay stock exchange bse and the national stock exchange nse will remain shut on \u003cTWO_\u003e october to mark the birth anniversary of mahatma gandhi according to the bombay stock exchanges website trading in the equity equity derivative currency slb commodity and electronic gold receipts egr segments will remain closed on october \u003cTWO_\u003e the national stock exchanges holiday calendar has notified \u003cTWO_\u003e october as a holiday for equities october \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e gandhi jayantinovember \u003cONE_\u003e \u003cTWO_THOUSAND\u003e diwalinovember \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e guru nanak jayantidecember \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e christmasindian stock market indices continued their stellar run last week benchmark indices sensex and nifty \u003cFIVE_TEN\u003e broke all time records and settled at a promising mark on friday last week also saw sensex surpass the remarkable \u003cEIGHT_TEN_THOUSAND\u003e mark which is seen as a significant milestone by market traders and experts the achievement has also unlocked another phase of the benchmark index and brightened the prospect of reaching the coveted \u003cONE_\u003e lakh \u003cONE_HUNDRED_THOUSAND\u003e mark indicated market experts to mints pranati deva nifty \u003cFIVE_TEN\u003e touched an all time high mark of \u003cTWO_TEN_THOUSAND\u003e on friday however it settled \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e later in the day sensex reached an all time high mark of \u003cEIGHT_TEN_THOUSAND\u003e during the friday trading hours after settling \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e the indian market growth and robust domestic inflows are the result of several factors including strong economic projections robust global market mood supportive monetary policies and growing domestic investments which are contributing to this bullish sentiment in the market driven by the positive economic outlook domestic inflows have increased significantly in recent years with the rising retail participation in the equity markets creating substantial liquidity and stable demand","timestamp":"2024-09-28T12:07:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}