{"url":"https://www.livemint.com/market/stock-market-news/is-your-net-worth-doubling-the-hidden-truth-behind-equity-market-performance-stock-market-sensex-11727092575718.html","title":"Is your net worth doubling? The hidden truth behind equity market performance","description":"Stock Market: Benchmark returns do not reflect individual portfolio performance unless fully invested in equities. If your equity investments lag behind benchmarks, consider low-cost index funds. Focus on prudent returns aligned with financial goals instead of chasing market highs.","content":"The S\u0026P BSE Sensex 30 has crossed 83000, now nicely perched at an all-time high, a 15% gain already in this calendar year. To be fair, there were expectations even at the start of this year for a stellar performance in Indian equities and some brokerages even put out targets of 86,000 on the Sensex by year end.Over the last five years, the benchmark index has more than doubled; rising from around 38000 Sensex to what it is today.Has your net worth doubled in this period?The answer to that will depend on your portfolio break up. Your net worth is an aggregate of the value of all assets you hold including deposits, property, gold, bonds and equity, less the value of any liabilities you have, like say a home loan or credit card outstanding.If half your money is invested in fixed deposits and you have a housing loan to repay, there is little probability of your net worth doubling despite equity markets moving up more than 100% in the last five years.Does this mean that you need to be 100% invested in equity and that’s the way to move forward full speed?Before deciding to move ahead full speed you must question whether you need to do so and are you equipped and prepared to not trip and fall or get exhausted. What do I mean by this?Chasing market returns doesn’t work-out for most long term investors. For traders whose job it is to try and catch the upside on a price trendline, may be able to do this gainfully. If one were to go by SEBI data on profits made by traders, hardly 10% are able to make profits consistently. Why invest in markets, if you can’t beat the benchmark returns?While professional athletes run 42 km marathons with an aim to beat the best time and break into the finish line ribbon first, the thousands of other runners are not aiming for a podium finish. What do they want? They are usually in it for the experience of running and if at all, they are attempting to beat their own previous best time for a marathon finish.Along the 42 kms, each runner runs her own race. Some will overtake her and she will overtake others. Usually, for such a long race, each runner is simply keeping to their own pace, because that is what they can control effectively. In trying to match another’s they may get tired too fast or get an injury, because their own body’s risk taking capability is not the same as their fellow runners’.Similarly, your investing journey is speckled with your financial needs and your risk taking ability. Investing in equity assets is unlikely to fit all your financial needs at a given point in time. Some short term financial objectives may need you to invest in assets that have some capital safety and stable returns, you may just want to cushion your portfolio from short term volatility that comes with equity investments and invest in fixed return assets for that purpose. You may have some investments in properties or gold. As you diversify, so does your return.Thus, looking at just one asset return, in this case the equity market benchmark return and then comparing whether your own investments did well or not is futile. A better approach is to consider comparing equity market returns to the portion of your money invested in equities and that too for longer periods of time, across market cycles rather than just for a few months or a year.Equity returns are not linear and instead of comparing year on year, look at long term averages and rolling returns. Secondly, a more accurate measure of success is looking at investments relative to your goals.In the goal based investing approach, you pick assets and financial investments on the basis of what your goal is. For example, if you are investing to build your retirement kitty, putting money in a 10 year fixed deposit where returns are not beating inflation is not going to cut it. Over long periods of time, we know that the value of money is eaten up by inflation and you need to invest in assets like equity to beat inflation; thus creating long term wealth. If long term inflation is 6% a year, a 15% annualised return is good and 20% annualised return is great but even 12% annualised return is enough.The overall return on your investment may not be the highest return for the period under consideration, but that’s not the goal. On the other hand, if you want to keep aside money safely for a down-payment on a house purchase six months down the line, chasing equity market returns will make you anxious thanks to the volatility. Thus, here you must pick an investment that is more stable, regardless of the return.If your equity portfolio return is consistently below benchmark return, year after year and seen in different periods of time, then there is merit in recognising that the fund or stock choices you are making are not working in your favour. In such a case, it’s worth picking a fund that mirrors the benchmark like an index fund or an exchange traded fund and simply invest in that. It will be like investing directly in the benchmark index and long term returns are likely to be very close to index returns.In summary, benchmark returns alone are not a reflection on how your portfolio has performed, unless all your money is invested only in listed equity assets. Don’t panic or feel slighted, if your overall portfolio value has not doubled in five years like the benchmark value. Secondly, if your equity portfolio itself is unable to beat the benchmark in such a long period, it’s worth considering a simpler and low cost approach and investing in the benchmark itself via index or exchange traded funds.Chasing returns is ineffective and causes emotional strain, instead look for prudent, reasonable returns, based on your overall financial objectives.Lisa Pallavi Barbora is a financial coach and founder of moneypuzzle.in","cleaned_content":"the s p bse sensex \u003cTHREE_TEN\u003e has crossed \u003cEIGHT_TEN_THOUSAND\u003e now nicely perched at an all time high a \u003cONE_TEN_PERCENT\u003e gain already in this calendar year to be fair there were expectations even at the start of this year for a stellar performance in indian equities and some brokerages even put out targets of \u003cEIGHT_TEN_THOUSAND\u003e on the sensex by year end over the last five years the benchmark index has more than doubled rising from around \u003cTHREE_TEN_THOUSAND\u003e sensex to what it is today has your net worth doubled in this period the answer to that will depend on your portfolio break up your net worth is an aggregate of the value of all assets you hold including deposits property gold bonds and equity less the value of any liabilities you have like say a home loan or credit card outstanding if half your money is invested in fixed deposits and you have a housing loan to repay there is little probability of your net worth doubling despite equity markets moving up more than \u003cONE_HUNDRED_PERCENT\u003e in the last five years does this mean that you need to be \u003cONE_HUNDRED_PERCENT\u003e invested in equity and that s the way to move forward full speed before deciding to move ahead full speed you must question whether you need to do so and are you equipped and prepared to not trip and fall or get exhausted what do i mean by this chasing market returns doesn t work out for most long term investors for traders whose job it is to try and catch the upside on a price trendline may be able to do this gainfully if one were to go by sebi data on profits made by traders hardly \u003cONE_TEN_PERCENT\u003e are able to make profits consistently why invest in markets if you can t beat the benchmark returns while professional athletes run \u003cFOUR_TEN\u003e km marathons with an aim to beat the best time and break into the finish line ribbon first the thousands of other runners are not aiming for a podium finish what do they want they are usually in it for the experience of running and if at all they are attempting to beat their own previous best time for a marathon finish along the \u003cFOUR_TEN\u003e kms each runner runs her own race some will overtake her and she will overtake others usually for such a long race each runner is simply keeping to their own pace because that is what they can control effectively in trying to match another s they may get tired too fast or get an injury because their own body s risk taking capability is not the same as their fellow runners similarly your investing journey is speckled with your financial needs and your risk taking ability investing in equity assets is unlikely to fit all your financial needs at a given point in time some short term financial objectives may need you to invest in assets that have some capital safety and stable returns you may just want to cushion your portfolio from short term volatility that comes with equity investments and invest in fixed return assets for that purpose you may have some investments in properties or gold as you diversify so does your return thus looking at just one asset return in this case the equity market benchmark return and then comparing whether your own investments did well or not is futile a better approach is to consider comparing equity market returns to the portion of your money invested in equities and that too for longer periods of time across market cycles rather than just for a few months or a year equity returns are not linear and instead of comparing year on year look at long term averages and rolling returns secondly a more accurate measure of success is looking at investments relative to your goals in the goal based investing approach you pick assets and financial investments on the basis of what your goal is for example if you are investing to build your retirement kitty putting money in a \u003cONE_TEN\u003e year fixed deposit where returns are not beating inflation is not going to cut it over long periods of time we know that the value of money is eaten up by inflation and you need to invest in assets like equity to beat inflation thus creating long term wealth if long term inflation is \u003cSIX_PERCENT\u003e a year a \u003cONE_TEN_PERCENT\u003e annualised return is good and \u003cTWO_TEN_PERCENT\u003e annualised return is great but even \u003cONE_TEN_PERCENT\u003e annualised return is enough the overall return on your investment may not be the highest return for the period under consideration but that s not the goal on the other hand if you want to keep aside money safely for a down payment on a house purchase six months down the line chasing equity market returns will make you anxious thanks to the volatility thus here you must pick an investment that is more stable regardless of the return if your equity portfolio return is consistently below benchmark return year after year and seen in different periods of time then there is merit in recognising that the fund or stock choices you are making are not working in your favour in such a case it s worth picking a fund that mirrors the benchmark like an index fund or an exchange traded fund and simply invest in that it will be like investing directly in the benchmark index and long term returns are likely to be very close to index returns in summary benchmark returns alone are not a reflection on how your portfolio has performed unless all your money is invested only in listed equity assets don t panic or feel slighted if your overall portfolio value has not doubled in five years like the benchmark value secondly if your equity portfolio itself is unable to beat the benchmark in such a long period it s worth considering a simpler and low cost approach and investing in the benchmark itself via index or exchange traded funds chasing returns is ineffective and causes emotional strain instead look for prudent reasonable returns based on your overall financial objectives lisa pallavi barbora is a financial coach and founder of moneypuzzle in","timestamp":"2024-09-25T12:59:00+05:30","market_timestamp":"2024-09-25T12:59:00+05:30","off_market_hours":false}