{"url":"https://www.livemint.com/market/stock-market-news/manba-finance-share-price-hits-upper-circuit-after-listing-at-25-premium-buy-sell-or-hold-11727679461859.html","title":"Manba Finance share price hits upper circuit after listing at 25% premium. Buy, sell or hold?","description":"Stock market today: Manba Finance's share price opened on the BSE at  ₹150, whereas, on the NSE, the NBFC shares opened at  ₹145 per share.","content":"Stock market today: Manba Finance share price listed on the bourses at a whopping 25% premium against its upper price band of  ₹120 apiece on Monday, September 30.Manba Finance's share price opened on the BSE at  ₹150, whereas, on the NSE, the NBFC shares opened at  ₹145 per share. The newly-listed financial stock didn't stop here only. It continued to attract strong buying interest after a dream debut and was locked in the 5% upper circuit post listing, touching an intraday high of  ₹152.25 on the NSE.Manba Finance is in the business of two-wheeler and MSME loans. The NBFC industry is projected to capture 65% of the two-wheeler loan business and 35% of the MSME loan business. Hence, according to experts, investors with a long-term perspective can hold the stock for the medium-to-long term. However, the Indian stock market experts suggested investors with a short-term view to book profits at around  ₹160 levels.Speaking on the outlook of Manba Finance shares, Arun Kejriwal, Founder of Kejriwal Research and Investment Services, said, \"Manba Finance share price has listed in the trade-to-trade category. Hence, the stock is expected to move in one direction, but it will remain one of the circuit-to-circuit stocks of the Indian stock market in the next ten sessions. However, the fair value of the stock comes to around  ₹160; hence, I would suggest short-term investors book profit around these levels and take an exit.\"Commenting on the strategy for long-term investors, Akriti Mehrotra, Research Analyst at StoxBox, said, “The Indian NBFC industry is poised for robust growth in segments like two-wheelers, three-wheelers, and MSME lending, driven by rising finance penetration and consumer demand, with NBFCs projected to capture 65% of the two-wheeler financing market and 35% of MSME loans. Manba's AUM grew at a 37.5% CAGR from FY22 to FY24, reaching  ₹9,368.6 million, while profit after tax (PAT) rose to  ₹314.2 million. Operating across six states with over 1,100 dealers, Manba has expanded into personal, business, and used car loans.”With improving RoCE margins, reduced NPAs, and expansion plans, investors who have been allotted shares are advised to hold their position from a medium to long-term perspective, the StoxBox expert said.","cleaned_content":"stock market today manba finance share price listed on the bourses at a whopping \u003cTWO_TEN_PERCENT\u003e premium against its upper price band of \u003cONE_HUNDRED\u003e apiece on monday september \u003cTHREE_TEN\u003e manba finances share price opened on the bse at \u003cONE_HUNDRED\u003e whereas on the nse the nbfc shares opened at \u003cONE_HUNDRED\u003e per share the newly listed financial stock didnt stop here only it continued to attract strong buying interest after a dream debut and was locked in the \u003cFIVE_PERCENT\u003e upper circuit post listing touching an intraday high of \u003cONE_HUNDRED\u003e on the nse manba finance is in the business of two wheeler and msme loans the nbfc industry is projected to capture \u003cSIX_TEN_PERCENT\u003e of the two wheeler loan business and \u003cTHREE_TEN_PERCENT\u003e of the msme loan business hence according to experts investors with a long term perspective can hold the stock for the medium to long term however the indian stock market experts suggested investors with a short term view to book profits at around \u003cONE_HUNDRED\u003e levels speaking on the outlook of manba finance shares arun kejriwal founder of kejriwal research and investment services said manba finance share price has listed in the trade to trade category hence the stock is expected to move in one direction but it will remain one of the circuit to circuit stocks of the indian stock market in the next ten sessions however the fair value of the stock comes to around \u003cONE_HUNDRED\u003e hence i would suggest short term investors book profit around these levels and take an exit commenting on the strategy for long term investors akriti mehrotra research analyst at stoxbox said the indian nbfc industry is poised for robust growth in segments like two wheelers three wheelers and msme lending driven by rising finance penetration and consumer demand with nbfcs projected to capture \u003cSIX_TEN_PERCENT\u003e of the two wheeler financing market and \u003cTHREE_TEN_PERCENT\u003e of msme loans manbas aum grew at a \u003cTHREE_TEN_PERCENT\u003e cagr from fy22 to fy24 reaching \u003cNINE_THOUSAND\u003e million while profit after tax pat rose to \u003cTHREE_HUNDRED\u003e million operating across six states with over \u003cONE_THOUSAND\u003e dealers manba has expanded into personal business and used car loans with improving roce margins reduced npas and expansion plans investors who have been allotted shares are advised to hold their position from a medium to long term perspective the stoxbox expert said","timestamp":"2024-09-30T13:03:00+05:30","market_timestamp":"2024-09-30T13:03:00+05:30","off_market_hours":false}