{"url":"https://www.livemint.com/market/stock-market-news/manba-finance-shares-make-strong-debut-lists-at-rs-145-up-20-83-from-ipo-price-11727669200597.html","title":"Manba Finance shares make strong debut, list at  ₹145, up 21% over IPO price","description":"Shares of Manba Finance made a strong debut on the bourses on Monday, September 30, listing at  ₹145 on NSE, a premium of 20.83 per cent from its IPO price of  ₹120. Meanwhile, on BSE, it listed at  ₹150, up 25 per cent from its issue price.","content":"Manba Finance IPO listing: Shares of Manba Finance made a strong debut on the bourses on Monday, September 30, listing at  ₹145 on NSE, a premium of 20.83 per cent over its IPO price of  ₹120. Meanwhile, on BSE, it listed at  ₹150, up 25 per cent.The initial public offering IPO, valued at  ₹150.84 crore, was open for subscription from September 23 to September 25. The IPO was priced in the range of  ₹114-120 per share.Following the three-day bidding process, Manba Finance IPO closed with an overwhelming demand, with the issue subscribed 224.05 times. The IPO received bids for 197.14 crore shares against 87.99 lakh shares on offer. The retail investor segment saw a massive subscription of 143.95 times, while the Non-Institutional Investors (NII) category was booked 511.62 times. Meanwhile, the Qualified Institutional Buyers (QIBs) quota was subscribed 148.55 times.The Manba Finance IPO was entirely a fresh issue of 1.26 crore shares. There was no offer for sale component in the IPO. The minimum application size for retail investors was set at 125 shares, requiring an investment of  ₹15,000. Investors could bid for a minimum of 125 shares and in multiples thereof. The IPO allotment date was September 26.“Manba Finance Ltd’s offering saw impressive demand, with a subscription rate over 224 times, signalling a strong debut today, potentially at a 30-35% premium. With improving RoCE margins, reduced NPAs, and expansion plans, investors who have been allotted shares are advised to hold their position from a medium to long-term perspective,” said Akriti Mehrotra, Research Analyst, Stoxbox.Manba Finance IPO reserved 20% of the issue for QIB, 15% for NII, and 35% for retail investors.The Company proposes to utilize the Net Proceeds towards augmenting the capital base to meet the Company’s future capital requirements. Hem Securities Limited is the book-running lead manager of the Manba Finance IPO, while Link Intime India Private Ltd is the registrar for the issue.Established in 1998, Manba Finance Limited is a non-banking finance company (NBFC-BL) specializing in providing financial solutions for new two-wheelers, three-wheelers, electric vehicles (EV2Ws and EV3Ws), used cars, small business loans, and personal loans. The company caters to both employees and the self-employed, offering tailored financing solutions that typically cover up to 85% of the vehicle's on-road price, with the customer contributing the remaining amount. Operating across urban, semi-urban, and metropolitan regions, Manba Finance has built a robust network of over 1,100 dealers, including more than 190 EV dealers in states like Maharashtra, Gujarat, Rajasthan, Chhattisgarh, Madhya Pradesh, and Uttar Pradesh.In the fiscal year ending March 31, 2024, the company achieved a 44% revenue increase and saw a 90% jump in profit after tax compared to the previous year.","cleaned_content":"manba finance ipo listing shares of manba finance made a strong debut on the bourses on monday september \u003cTHREE_TEN\u003e listing at \u003cONE_HUNDRED\u003e on nse a premium of \u003cTWO_TEN_PERCENT\u003e over its ipo price of \u003cONE_HUNDRED\u003e meanwhile on bse it listed at \u003cONE_HUNDRED\u003e up \u003cTWO_TEN_PERCENT\u003e the initial public offering ipo valued at \u003cONE_HUNDRED\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTWO_TEN\u003e the ipo was priced in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e per share following the three day bidding process manba finance ipo closed with an overwhelming demand with the issue subscribed \u003cTWO_HUNDRED\u003e times the ipo received bids for \u003cONE_HUNDRED\u003e crore shares against \u003cEIGHT_TEN\u003e lakh shares on offer the retail investor segment saw a massive subscription of \u003cONE_HUNDRED\u003e times while the non institutional investors nii category was booked \u003cFIVE_HUNDRED\u003e times meanwhile the qualified institutional buyers qibs quota was subscribed \u003cONE_HUNDRED\u003e times the manba finance ipo was entirely a fresh issue of \u003cONE_\u003e crore shares there was no offer for sale component in the ipo the minimum application size for retail investors was set at \u003cONE_HUNDRED\u003e shares requiring an investment of \u003cONE_TEN_THOUSAND\u003e investors could bid for a minimum of \u003cONE_HUNDRED\u003e shares and in multiples thereof the ipo allotment date was september \u003cTWO_TEN\u003e manba finance ltd s offering saw impressive demand with a subscription rate over \u003cTWO_HUNDRED\u003e times signalling a strong debut today potentially at a \u003cTHREE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e premium with improving roce margins reduced npas and expansion plans investors who have been allotted shares are advised to hold their position from a medium to long term perspective said akriti mehrotra research analyst stoxbox manba finance ipo reserved \u003cTWO_TEN_PERCENT\u003e of the issue for qib \u003cONE_TEN_PERCENT\u003e for nii and \u003cTHREE_TEN_PERCENT\u003e for retail investors the company proposes to utilize the net proceeds towards augmenting the capital base to meet the company s future capital requirements hem securities limited is the book running lead manager of the manba finance ipo while link intime india private ltd is the registrar for the issue established in \u003cONE_THOUSAND\u003e manba finance limited is a non banking finance company nbfc bl specializing in providing financial solutions for new two wheelers three wheelers electric vehicles ev2ws and ev3ws used cars small business loans and personal loans the company caters to both employees and the self employed offering tailored financing solutions that typically cover up to \u003cEIGHT_TEN_PERCENT\u003e of the vehicles on road price with the customer contributing the remaining amount operating across urban semi urban and metropolitan regions manba finance has built a robust network of over \u003cONE_THOUSAND\u003e dealers including more than \u003cONE_HUNDRED\u003e ev dealers in states like maharashtra gujarat rajasthan chhattisgarh madhya pradesh and uttar pradesh in the fiscal year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company achieved a \u003cFOUR_TEN_PERCENT\u003e revenue increase and saw a \u003cNINE_TEN_PERCENT\u003e jump in profit after tax compared to the previous year","timestamp":"2024-09-30T10:00:00+05:30","market_timestamp":"2024-09-30T10:00:00+05:30","off_market_hours":false}