{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-pc-jeweller-to-declare-stock-split-after-452-surge-in-one-year-details-here-11727201419054.html","title":"At 52-week high! Multibagger stock PC Jeweller to declare stock split after 452% surge in one year","description":"PC Jeweller plans its first stock split after a 452 percent rally. A board meeting is set for September 30, 2024, to discuss share subdivision and potential new directors. The stock has surged 468.95 percent over the past year, attracting significant investor interest.","content":"PC Jeweller Stock Split: Multibagger small-cap stock PC Jewellers rose over 4 percent to its 52-week high after the company announced that its Board of Directors will convene on September 30, 2024, to discuss and approve its first-ever stock split.The ratio for this split, which marks the company’s first, will be disclosed after the board meeting. The board will also consider potential appointments of new directors, according to the company's exchange filing.“Notice is hereby given pursuant to Regulation 29 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, that a meeting of the Board of Directors of the Company will be held on Monday, September 30, 2024, inter-alia, to consider and approve the alteration in the share capital of the Company by sub-division / split of existing equity shares having face value of Rs10/- each, fully paid-up, as may be determined by the Board of Directors and consequent alteration of Memorandum of Association of the Company,” it said in the exchange filing.-week high of RsPC Jeweller also noted that its trading window is now closed until two days after the announcement of its unaudited financial results for the quarter and six months ending September 30, 2024.A stock split is a corporate action in which a company increases the number of its outstanding shares by dividing its existing shares into multiple new shares. This action reduces the stock's price, making it more affordable for investors while keeping the total market value of the company the same.For example, in a 2-for-1 stock split, every shareholder receives an additional share for each share they own, and the stock price is halved. If a company’s stock was trading at  ₹1,000 before a 2-for-1 split, the new price would be  ₹500, and the number of shares held by each shareholder would double.The stock rose as much as 4.2 percent to its 52-week high of  ₹157.30 in intra-day deals today.PC Jeweller has a history of rewarding its shareholders through dividends and bonus shares. However, this stock split will be a first for the jewellery company, further boosting investor interest.The stock has been a multibagger, delivering remarkable returns over the past year. It has surged more than 452 percent in the last 12 months alone and 223.4 percent year-to-date in 2024. The stock has posted gains in six of the nine months this year, with a significant 36 percent rise in September so far. Notably, it saw an 18.11 percent rally in August and a massive 83.83 percent jump in July, further extending its impressive run.Despite a brief three-month correction earlier in 2024, where the stock declined by 11 percent in May, 3 percent in April, and 6.8 percent in March, PC Jeweller bounced back strongly. It had already gained 4.6 percent in February and 18.2 percent in January. The stock hit a 52-week high of  ₹157.30 on September 25, a significant 518 percent rise from its 52-week low of  ₹25.45 recorded in October last year.With PC Jeweller considering its first-ever stock split following a phenomenal 452 percent rally, investor excitement is high. The stock’s meteoric rise in 2024 and its potential for further growth make it one to watch out for.The upcoming Board meeting on September 30 will reveal the ratio of the stock split and could also introduce new leadership, potentially setting the stage for the next phase of the company’s growth.","cleaned_content":"pc jeweller stock split multibagger small cap stock pc jewellers rose over \u003cFOUR_PERCENT\u003e to its \u003cFIVE_TEN\u003e week high after the company announced that its board of directors will convene on september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e to discuss and approve its first ever stock split the ratio for this split which marks the company s first will be disclosed after the board meeting the board will also consider potential appointments of new directors according to the companys exchange filing notice is hereby given pursuant to regulation \u003cTWO_TEN\u003e of the sebi listing obligations and disclosure requirements regulations \u003cTWO_THOUSAND\u003e that a meeting of the board of directors of the company will be held on monday september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e inter alia to consider and approve the alteration in the share capital of the company by sub division split of existing equity shares having face value of rs10 each fully paid up as may be determined by the board of directors and consequent alteration of memorandum of association of the company it said in the exchange filing week high of rspc jeweller also noted that its trading window is now closed until two days after the announcement of its unaudited financial results for the quarter and six months ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e a stock split is a corporate action in which a company increases the number of its outstanding shares by dividing its existing shares into multiple new shares this action reduces the stocks price making it more affordable for investors while keeping the total market value of the company the same for example in a \u003cTWO_\u003e for \u003cONE_\u003e stock split every shareholder receives an additional share for each share they own and the stock price is halved if a company s stock was trading at \u003cONE_THOUSAND\u003e before a \u003cTWO_\u003e for \u003cONE_\u003e split the new price would be \u003cFIVE_HUNDRED\u003e and the number of shares held by each shareholder would double the stock rose as much as \u003cFOUR_PERCENT\u003e to its \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e in intra day deals today pc jeweller has a history of rewarding its shareholders through dividends and bonus shares however this stock split will be a first for the jewellery company further boosting investor interest the stock has been a multibagger delivering remarkable returns over the past year it has surged more than \u003cFOUR_HUNDRED_PERCENT\u003e in the last \u003cONE_TEN\u003e months alone and \u003cTWO_HUNDRED_PERCENT\u003e year to date in \u003cTWO_THOUSAND\u003e the stock has posted gains in six of the nine months this year with a significant \u003cTHREE_TEN_PERCENT\u003e rise in september so far notably it saw an \u003cONE_TEN_PERCENT\u003e rally in august and a massive \u003cEIGHT_TEN_PERCENT\u003e jump in july further extending its impressive run despite a brief three month correction earlier in \u003cTWO_THOUSAND\u003e where the stock declined by \u003cONE_TEN_PERCENT\u003e in may \u003cTHREE_PERCENT\u003e in april and \u003cSIX_PERCENT\u003e in march pc jeweller bounced back strongly it had already gained \u003cFOUR_PERCENT\u003e in february and \u003cONE_TEN_PERCENT\u003e in january the stock hit a \u003cFIVE_TEN\u003e week high of \u003cONE_HUNDRED\u003e on september \u003cTWO_TEN\u003e a significant \u003cFIVE_HUNDRED_PERCENT\u003e rise from its \u003cFIVE_TEN\u003e week low of \u003cTWO_TEN\u003e recorded in october last year with pc jeweller considering its first ever stock split following a phenomenal \u003cFOUR_HUNDRED_PERCENT\u003e rally investor excitement is high the stock s meteoric rise in \u003cTWO_THOUSAND\u003e and its potential for further growth make it one to watch out for the upcoming board meeting on september \u003cTHREE_TEN\u003e will reveal the ratio of the stock split and could also introduce new leadership potentially setting the stage for the next phase of the company s growth","timestamp":"2024-09-25T09:22:00+05:30","market_timestamp":"2024-09-25T09:22:00+05:30","off_market_hours":false}