{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-this-small-cap-stock-rockets-18710-in-11-years-turns-rs-1-lakh-into-rs-2-crore-11727021474083.html","title":"Multibagger Stock: This small cap stock rockets 18710% in 11 years, turns  ₹1 lakh into  ₹2 crore","description":"Over the past 5 years, the company's shares have surged from  ₹74 apiece to their current value of  ₹1,398, delivering a return of nearly 1,800%. Over the last 11 years, the stock has skyrocketed from  ₹7.65 apiece to its present value, resulting in a phenomenal gain of 18,714%.","content":"Stock market investing is often seen as a journey of patience and strategy. Those who can spot potential in companies early on and hold onto their investments tend to be rewarded the most. Unlike the quick profits from short-term trading, long-term investors understand the value of sticking with companies that demonstrate strong fundamentals, growth prospects, and industry leadership.In this context, Action Constructions Equipment (ACE) is such a stock in this lineup. It has rewarded its long-term shareholders with phenomenal returns by maintaining a steady upward trajectory with each passing year.The company is India's leading material handling and construction equipment manufacturer, dominating the mobile and tower crane segments. Along with mobile cranes, the company offers a wide range of products, including tower cranes, electric cranes, crawler cranes, truck-mounted cranes, backhoe loaders, vibratory rollers, forklifts, warehousing equipment, and agricultural machinery like tractors and harvesters.Over the past five years, the company's shares have surged from  ₹74 apiece to their current value of  ₹1,398, delivering an extraordinary return of nearly 1,800 per cent. Looking even further back over the last eleven years, the stock has skyrocketed from  ₹7.65 apiece to its present value, resulting in a phenomenal gain of 18,710 per cent.To put this into perspective, if an investor had invested  ₹1 lakh into the stock during this period, the investment would now be worth nearly  ₹2 crore. What's more impressive is that in these 11 years, the stock only posted losses in two calendar years, with the rest yielding positive returns.The standout years include CY17, with a remarkable gain of 219 per cent, and CY23, with a 173 per cent increase. In the current year alone, the stock has already risen 70 per cent, and in April, it crossed the  ₹1,500 mark for the first time, hitting a new all-time high of  ₹1,695 apiece.ACE achieved its best-ever first-quarter performance (April-June) in terms of revenue and margins. It demonstrated strong growth momentum, with operational revenue increasing by 12.82 per cent year-on-year (YoY). Additionally, EBITDA margins expanded by 212 basis points (bps) YoY, reaching 17.11 per cent.This margin expansion was primarily driven by operating leverage, an improved product mix with better price realizations, and efficient cost control measures. ACE's cranes, construction equipment, and material handling volumes also saw significant growth of 20 per cent YoY, further contributing to the robust quarterly performance. The net profit for the quarter improved to  ₹84 crore from  ₹68 crore in the same period last year.Meanwhile, the company is discussing with KATO Works, a Japanese global construction equipment manufacturer of mobile cranes and excavators, to establish a joint venture in India.The Joint Venture intends to produce medium—and large-sized cranes, mainly truck cranes, crawler cranes, and rough terrain cranes, for the growing Indian market. In the future, the JV also plans to utilize the technology cultivated by the expertise of ACE and KATO to introduce a wide range of value-added products for the export market.The construction equipment industry in India is witnessing robust growth, driven by government initiatives such as the National Infrastructure Pipeline, the PM Gati Shakti Master Plan, and the \"Make in India\" campaign that prioritizes domestic manufacturing.Looking forward, original equipment manufacturers (OEMs) are expected to invest between  ₹1,400and1,500 crore in FY25. This investment will target debottlenecking, product development—including CEV-V compliant equipment and alternative fuel powertrains—and localization efforts. Ongoing projects under initiatives like the Pradhan Mantri Gram Sadak Yojana (PMGSY) are also boosting demand for construction equipment.Moreover, the expansion of airports, railways, ports, and metro systems further underscores the construction market's growth potential, indicating a promising outlook for the industry.","cleaned_content":"stock market investing is often seen as a journey of patience and strategy those who can spot potential in companies early on and hold onto their investments tend to be rewarded the most unlike the quick profits from short term trading long term investors understand the value of sticking with companies that demonstrate strong fundamentals growth prospects and industry leadership in this context action constructions equipment ace is such a stock in this lineup it has rewarded its long term shareholders with phenomenal returns by maintaining a steady upward trajectory with each passing year the company is indias leading material handling and construction equipment manufacturer dominating the mobile and tower crane segments along with mobile cranes the company offers a wide range of products including tower cranes electric cranes crawler cranes truck mounted cranes backhoe loaders vibratory rollers forklifts warehousing equipment and agricultural machinery like tractors and harvesters over the past five years the companys shares have surged from \u003cSEVEN_TEN\u003e apiece to their current value of \u003cONE_THOUSAND\u003e delivering an extraordinary return of nearly \u003cONE_THOUSAND_PERCENT\u003e looking even further back over the last eleven years the stock has skyrocketed from \u003cSEVEN_\u003e apiece to its present value resulting in a phenomenal gain of \u003cONE_TEN_THOUSAND_PERCENT\u003e to put this into perspective if an investor had invested \u003cONE_\u003e lakh into the stock during this period the investment would now be worth nearly \u003cTWO_\u003e crore whats more impressive is that in these \u003cONE_TEN\u003e years the stock only posted losses in two calendar years with the rest yielding positive returns the standout years include cy17 with a remarkable gain of \u003cTWO_HUNDRED_PERCENT\u003e and cy23 with a \u003cONE_HUNDRED_PERCENT\u003e increase in the current year alone the stock has already risen \u003cSEVEN_TEN_PERCENT\u003e and in april it crossed the \u003cONE_THOUSAND\u003e mark for the first time hitting a new all time high of \u003cONE_THOUSAND\u003e apiece ace achieved its best ever first quarter performance april june in terms of revenue and margins it demonstrated strong growth momentum with operational revenue increasing by \u003cONE_TEN_PERCENT\u003e year on year yoy additionally ebitda margins expanded by \u003cTWO_HUNDRED\u003e basis points bps yoy reaching \u003cONE_TEN_PERCENT\u003e this margin expansion was primarily driven by operating leverage an improved product mix with better price realizations and efficient cost control measures aces cranes construction equipment and material handling volumes also saw significant growth of \u003cTWO_TEN_PERCENT\u003e yoy further contributing to the robust quarterly performance the net profit for the quarter improved to \u003cEIGHT_TEN\u003e crore from \u003cSIX_TEN\u003e crore in the same period last year meanwhile the company is discussing with kato works a japanese global construction equipment manufacturer of mobile cranes and excavators to establish a joint venture in india the joint venture intends to produce medium and large sized cranes mainly truck cranes crawler cranes and rough terrain cranes for the growing indian market in the future the jv also plans to utilize the technology cultivated by the expertise of ace and kato to introduce a wide range of value added products for the export market the construction equipment industry in india is witnessing robust growth driven by government initiatives such as the national infrastructure pipeline the pm gati shakti master plan and the make in india campaign that prioritizes domestic manufacturing looking forward original equipment manufacturers oems are expected to invest between \u003cONE_THOUSAND\u003e and1 500 crore in fy25 this investment will target debottlenecking product development including cev v compliant equipment and alternative fuel powertrains and localization efforts ongoing projects under initiatives like the pradhan mantri gram sadak yojana pmgsy are also boosting demand for construction equipment moreover the expansion of airports railways ports and metro systems further underscores the construction markets growth potential indicating a promising outlook for the industry","timestamp":"2024-09-23T13:16:00+05:30","market_timestamp":"2024-09-23T13:16:00+05:30","off_market_hours":false}