{"url":"https://www.livemint.com/market/stock-market-news/stellar-listing-techera-engineering-lists-at-rs-125-premium-of-52-5-to-ipo-price-11727928788564.html","title":"Stellar Debut! TechEra Engineering shares list at  ₹125 on NSE SME, 52.5% premium over IPO price","description":"TechEra Engineering (India) debuted on October 3 at  ₹125 per share on NSE SME, a 52.5% premium over its issue price of  ₹82. The IPO, valued at  ₹35.90 crore, was oversubscribed 70 times, with significant interest from non-institutional and retail investors.","content":"IPO Listing: TechEra Engineering (India) made a stellar stock market debut on Thursday, 3 October, as its shares were listed at  ₹125 each on NSE SME, a premium of 52.5% over the issue price of  ₹82.The SME IPO, valued at  ₹35.90 crore, was open for subscription from September 25 to September 27. The issue was priced between  ₹75 and  ₹82 apiece.The IPO consisted solely of a fresh issue of 43.78 shares, without any offer-for-sale component. It garnered strong interest, achieving an overall subscription of 70 times. Notably, the non-institutional investor (NII) segment was oversubscribed by 128.88 times, while the retail portion saw an oversubscription of 66.52 times. The qualified institutional buyer (QIB) portion was booked at 31.22 times.The company proposes to utilise the net proceeds for several key purposes. The primary objective is to fund capital expenditures for the purchase of new machinery, which will enhance operational efficiency. Additionally, the proceeds will be used to meet the company's working capital requirements, ensuring sufficient liquidity for day-to-day operations.TechEra Engineering (India) Limited, established in October 2018, designs, manufactures, and supplies precision tooling, components for the aerospace and defence industries, and automation system solutions.The company's product portfolio includes assembly toolings, jigs, fixtures, maintenance, repair, and overhaul (MRO) toolings, ground support equipment, and precision machined components. It utilises advanced manufacturing technologies, such as 5-axis machining and 3-D modelling for design visualisation, to meet the requirements of its target sectors.The company has participated in notable projects, including the manufacture of tooling for the commercial aircraft vertical fin assembly line and fighter wing skin layup tool, indicating its capability to execute complex engineering projects. It aims to contribute to technological advancement and the upliftment of the sectors it serves through continuous improvement and innovation in its processes and offerings, according to the RHP report.","cleaned_content":"ipo listing techera engineering india made a stellar stock market debut on thursday \u003cTHREE_\u003e october as its shares were listed at \u003cONE_HUNDRED\u003e each on nse sme a premium of \u003cFIVE_TEN_PERCENT\u003e over the issue price of \u003cEIGHT_TEN\u003e the sme ipo valued at \u003cTHREE_TEN\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTWO_TEN\u003e the issue was priced between \u003cSEVEN_TEN\u003e and \u003cEIGHT_TEN\u003e apiece the ipo consisted solely of a fresh issue of \u003cFOUR_TEN\u003e shares without any offer for sale component it garnered strong interest achieving an overall subscription of \u003cSEVEN_TEN\u003e times notably the non institutional investor nii segment was oversubscribed by \u003cONE_HUNDRED\u003e times while the retail portion saw an oversubscription of \u003cSIX_TEN\u003e times the qualified institutional buyer qib portion was booked at \u003cTHREE_TEN\u003e times the company proposes to utilise the net proceeds for several key purposes the primary objective is to fund capital expenditures for the purchase of new machinery which will enhance operational efficiency additionally the proceeds will be used to meet the companys working capital requirements ensuring sufficient liquidity for day to day operations techera engineering india limited established in october \u003cTWO_THOUSAND\u003e designs manufactures and supplies precision tooling components for the aerospace and defence industries and automation system solutions the companys product portfolio includes assembly toolings jigs fixtures maintenance repair and overhaul mro toolings ground support equipment and precision machined components it utilises advanced manufacturing technologies such as \u003cFIVE_\u003e axis machining and \u003cTHREE_\u003e d modelling for design visualisation to meet the requirements of its target sectors the company has participated in notable projects including the manufacture of tooling for the commercial aircraft vertical fin assembly line and fighter wing skin layup tool indicating its capability to execute complex engineering projects it aims to contribute to technological advancement and the upliftment of the sectors it serves through continuous improvement and innovation in its processes and offerings according to the rhp report","timestamp":"2024-10-03T10:19:00+05:30","market_timestamp":"2024-10-03T10:19:00+05:30","off_market_hours":false}