{"url":"https://www.livemint.com/market/stock-market-news/reliance-power-announces-rs-1-525-crore-preferential-share-issue-11727099184760.html","title":"Reliance Power announces  ₹1,525 crore preferential share issue","description":"Reliance Power's board of directors approved the issue of preferential shares to raise  ₹1,524.60 crore, the company said in an exchange filing on Monday.","content":"Reliance Power Ltd's board of directors approved the issue of preferential shares to raise  ₹1,524.60 crore, the company said in a filing on the Bombay Stock Exchange (BSE) on Monday, September 23.“We hereby inform you that the Board of Directors at its Meeting held today i.e., Monday, September 23, 2024, has approved issuance of up to 46,20,00,000 equity shares and/or warrants convertible into equity shares of the Company at an Issue Price of Rs. 33/- per share aggregating  ₹1524.60 crore through preferential allotment,” said the company in the exchange filing.Reliance Power shares closed 4.98 per cent higher at  ₹38.16 after Monday's trading session, compared to  ₹36.35 at Friday's market close. The company filed the preferential share issue notification with the exchange after market hours.The board has approved the issue of up to 46,20,00,000 or 46.20 crore equity shares at an issue price of  ₹33 per share or warrants convertible into equity shares of the company, according to the filing.Reliance Infrastructure Limited, the promoter of Reliance Power, will enhance its equity stake by over  ₹600 crore. The other investors in the preferential issue are Authum Investment and Infrastructure and Sanatan Financial Advisory Services, according to the company statement.Reliance Power aims to use the proceeds raised from the preferential share issue to expand business operations directly or through investment in subsidiaries and joint ventures. The company also plans to reduce its debt and use the money raised for general business purposes, it said in the exchange filing.Reliance Power's renewable energy sector participation will also be supported through the enhanced capital, as per the company filing.“Preferential Issue will enhance the company’s networth from over  ₹11,155 crore to over  ₹12,680 crore,” said the company in the statement. The listed entity has zero bank debt.The company will also host a postal ballot to seek shareholder approval for the preferential share issue.","cleaned_content":"reliance power ltds board of directors approved the issue of preferential shares to raise \u003cONE_THOUSAND\u003e crore the company said in a filing on the bombay stock exchange bse on monday september \u003cTWO_TEN\u003e we hereby inform you that the board of directors at its meeting held today i e monday september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e has approved issuance of up to \u003cFOUR_HUNDRED_MILLION\u003e equity shares and or warrants convertible into equity shares of the company at an issue price of rs \u003cTHREE_TEN\u003e per share aggregating \u003cONE_THOUSAND\u003e crore through preferential allotment said the company in the exchange filing reliance power shares closed \u003cFOUR_PERCENT\u003e higher at \u003cTHREE_TEN\u003e after mondays trading session compared to \u003cTHREE_TEN\u003e at fridays market close the company filed the preferential share issue notification with the exchange after market hours the board has approved the issue of up to \u003cFOUR_HUNDRED_MILLION\u003e or \u003cFOUR_TEN\u003e crore equity shares at an issue price of \u003cTHREE_TEN\u003e per share or warrants convertible into equity shares of the company according to the filing reliance infrastructure limited the promoter of reliance power will enhance its equity stake by over \u003cSIX_HUNDRED\u003e crore the other investors in the preferential issue are authum investment and infrastructure and sanatan financial advisory services according to the company statement reliance power aims to use the proceeds raised from the preferential share issue to expand business operations directly or through investment in subsidiaries and joint ventures the company also plans to reduce its debt and use the money raised for general business purposes it said in the exchange filing reliance powers renewable energy sector participation will also be supported through the enhanced capital as per the company filing preferential issue will enhance the company s networth from over \u003cONE_TEN_THOUSAND\u003e crore to over \u003cONE_TEN_THOUSAND\u003e crore said the company in the statement the listed entity has zero bank debt the company will also host a postal ballot to seek shareholder approval for the preferential share issue","timestamp":"2024-09-23T20:58:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}