{"url":"https://www.livemint.com/market/stock-market-news/expert-view-fmcg-auto-bfsi-sectors-still-offer-growth-at-reasonable-valuations-says-kashyap-javeri-of-emkay-11727414627722.html","title":"Expert View: FMCG, Auto, BFSI sectors still offer growth at reasonable valuations, says Kashyap Javeri of Emkay","description":"Expert View: Sectors like FMCG, automobiles, BFSI, and chemicals still offer growth at reasonable valuations, presenting investment opportunities in the current market, says Kashyap Javeri of Emkay Investment Managers.","content":"Nifty 50 Index is trading at 24x TTM earnings, a 25% premium to its long-term average, while the Nifty Smallcap 250 Index is at a 25% premium to Nifty 50 valuations. With projected earnings growth of 15-16%, a PEG ratio of 1.5x appears reasonable, says Kashyap Javeri, Fund Manager and Head Of Research, Emkay Investment Managers.In an interview with Livemint, Javeri highlighted that sectors like FMCG, automobiles, BFSI, and chemicals still offer growth at reasonable valuations, presenting investment opportunities in the current market. Here are edited excerpts:A. For a while we have been highlighting that there are three events that would shape Indian markets for the next couple of years. Firstly, Lok Sabha elections 2024 outcome was an unexpected one. However, we still have a fairly stable government at the centre with its intentions still guided towards accelerating reforms.Second is liquidity. Liquidity still continues to be benign with excess durable liquidity at almost 1.6% - 1.7% of deposits. And the third is the US Federal Reserve. We believe that the Fed has acted more aggressively earlier than what the market was expecting about six months ago.So overall, of the three events, two have turned out to be positive and one is partially positive. We believe that going forward now the fourth event which will be of much importance is earnings growth. While April - June quarter has been modest with 5% growth in Nifty 50 Index EBITDA/PAT, this was impacted by elections and heatwave. We have seen a turnaround in demand for discretionary spends like two-wheelers, white goods and some part of building materials. Robust monsoon and Kharif sowing should help rural demand. The rising strength of the rural economy is also visible in lower MNREGA jobs being demanded and the rural demand will be a key factor to watch out for.A. From a global financial system standpoint, the good news is already out in terms of the dovish Fed and it has already highlighted that there is scope to further reduce rates. There is a belief in the market that the policies of Republicans are going to be more beneficial in terms of US capex, growth and their restrictive policies towards China will be beneficial for India. However, global diplomacies are more complicated and the outcome is anybody’s guess.A. India’s own consumer inflation has been less than 4% for two straight months and averaged at 4.4% for FYTD’25. That is the good news that the Reserve Bank of India (RBI) would have wanted to hear. The core consumer inflation has averaged at \u003c3.3% for FYTD’25. The 40 bps higher inflation above RBI target rate of 4% consumer inflation has been driven by food prices. Lot of downside risks to inflation are now in place like lower crude prices which further help to bring down pass-through impact on core inflation, robust southwest monsoon and Kharif sowing for foodgrains at 102% of long period average.So downside risks to inflation coupled with Fed rate cuts open a lot of legroom for the RBI to manoeuvre its monetary policy. The treasury yields are already reflecting they are down by 10-20 bps in the last 1-3 months.A. Nifty 50 Index is quoting at 24x TTM earnings which is now 25% premium to long period average and Nifty Smallcap 250 Index is quoting at 25% premium to Nifty 50 Index valuations. Having said that, the valuations are always a relative game with respect to growth and demand driven by liquidity.If Nifty 50 Index earnings are going to grow by 15-16% going forward, a PEG of 1.5x may not seem too expensive. And also bear in mind that the liquidity may continue to remain benevolent. Having said that, there are still opportunities available in the market where growth is available at a reasonable price in sectors like FMCG, automobile, BFSI and chemicals.A. Ideal strategy at any market level is very simple – look for opportunities for investment where the growth (which until now was challenged due to exogenous factors) is making a turnaround and valuations are in favour. We believe that the Indian promoters are one of the smartest in the world and when the headwinds turn into opportunities, they never miss the bus. Opportunities are abound to invest, the investors just need to keep their eyes open and not just get into a feeling of FOMO.A. For one, we have never been fans of thematic funds. They usually come when markets are euphoric about a theme and drive up valuations of a particular sector unnecessarily. One can definitely look at trends like we were first one in the market to identify that India will be the world's manufacturing hub in the next few decades and which is why we launched our PMS strategy ENVI. But that was a strategy launched on a trend and not one particular industry or theme.","cleaned_content":"nifty \u003cFIVE_TEN\u003e index is trading at \u003cTWO_TEN\u003e x ttm earnings a \u003cTWO_TEN_PERCENT\u003e premium to its long term average while the nifty smallcap \u003cTWO_HUNDRED\u003e index is at a \u003cTWO_TEN_PERCENT\u003e premium to nifty \u003cFIVE_TEN\u003e valuations with projected earnings growth of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e a peg ratio of \u003cONE_\u003e x appears reasonable says kashyap javeri fund manager and head of research emkay investment managers in an interview with livemint javeri highlighted that sectors like fmcg automobiles bfsi and chemicals still offer growth at reasonable valuations presenting investment opportunities in the current market here are edited excerpts a for a while we have been highlighting that there are three events that would shape indian markets for the next couple of years firstly lok sabha elections \u003cTWO_THOUSAND\u003e outcome was an unexpected one however we still have a fairly stable government at the centre with its intentions still guided towards accelerating reforms second is liquidity liquidity still continues to be benign with excess durable liquidity at almost \u003cONE_PERCENT\u003e \u003cONE_PERCENT\u003e of deposits and the third is the us federal reserve we believe that the fed has acted more aggressively earlier than what the market was expecting about six months ago so overall of the three events two have turned out to be positive and one is partially positive we believe that going forward now the fourth event which will be of much importance is earnings growth while april june quarter has been modest with \u003cFIVE_PERCENT\u003e growth in nifty \u003cFIVE_TEN\u003e index ebitda pat this was impacted by elections and heatwave we have seen a turnaround in demand for discretionary spends like two wheelers white goods and some part of building materials robust monsoon and kharif sowing should help rural demand the rising strength of the rural economy is also visible in lower mnrega jobs being demanded and the rural demand will be a key factor to watch out for a from a global financial system standpoint the good news is already out in terms of the dovish fed and it has already highlighted that there is scope to further reduce rates there is a belief in the market that the policies of republicans are going to be more beneficial in terms of us capex growth and their restrictive policies towards china will be beneficial for india however global diplomacies are more complicated and the outcome is anybody s guess a india s own consumer inflation has been less than \u003cFOUR_PERCENT\u003e for two straight months and averaged at \u003cFOUR_PERCENT\u003e for fytd \u003cTWO_TEN\u003e that is the good news that the reserve bank of india rbi would have wanted to hear the core consumer inflation has averaged at \u003cTHREE_PERCENT\u003e for fytd \u003cTWO_TEN\u003e the \u003cFOUR_TEN\u003e bps higher inflation above rbi target rate of \u003cFOUR_PERCENT\u003e consumer inflation has been driven by food prices lot of downside risks to inflation are now in place like lower crude prices which further help to bring down pass through impact on core inflation robust southwest monsoon and kharif sowing for foodgrains at \u003cONE_HUNDRED_PERCENT\u003e of long period average so downside risks to inflation coupled with fed rate cuts open a lot of legroom for the rbi to manoeuvre its monetary policy the treasury yields are already reflecting they are down by \u003cONE_TEN\u003e \u003cTWO_TEN\u003e bps in the last \u003cONE_\u003e \u003cTHREE_\u003e months a nifty \u003cFIVE_TEN\u003e index is quoting at \u003cTWO_TEN\u003e x ttm earnings which is now \u003cTWO_TEN_PERCENT\u003e premium to long period average and nifty smallcap \u003cTWO_HUNDRED\u003e index is quoting at \u003cTWO_TEN_PERCENT\u003e premium to nifty \u003cFIVE_TEN\u003e index valuations having said that the valuations are always a relative game with respect to growth and demand driven by liquidity if nifty \u003cFIVE_TEN\u003e index earnings are going to grow by \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e going forward a peg of \u003cONE_\u003e x may not seem too expensive and also bear in mind that the liquidity may continue to remain benevolent having said that there are still opportunities available in the market where growth is available at a reasonable price in sectors like fmcg automobile bfsi and chemicals a ideal strategy at any market level is very simple look for opportunities for investment where the growth which until now was challenged due to exogenous factors is making a turnaround and valuations are in favour we believe that the indian promoters are one of the smartest in the world and when the headwinds turn into opportunities they never miss the bus opportunities are abound to invest the investors just need to keep their eyes open and not just get into a feeling of fomo a for one we have never been fans of thematic funds they usually come when markets are euphoric about a theme and drive up valuations of a particular sector unnecessarily one can definitely look at trends like we were first one in the market to identify that india will be the worlds manufacturing hub in the next few decades and which is why we launched our pms strategy envi but that was a strategy launched on a trend and not one particular industry or theme","timestamp":"2024-09-27T11:11:00+05:30","market_timestamp":"2024-09-27T11:11:00+05:30","off_market_hours":false}