{"url":"https://www.livemint.com/market/stock-market-news/stock-market-crash-m-cap-of-bse-listed-companies-tumbles-nearly-rs-10-lakh-crore-amid-bloodbath-on-dalal-street-11727957695571.html","title":"Stock Market Crash: M-cap of BSE-listed companies tumbles nearly  ₹10 trillion amid bloodbath on Dalal Street","description":"Sensex Crash Today: The Indian stock market experienced its worst intra-day fall in two months, erasing nearly  ₹9.78 trillion in investor wealth. Geopolitical tensions, rising crude oil prices, and recent regulatory changes contributed to this decline.","content":"The Indian stock markets on Thursday saw their worst intraday fall in two months, wiping off nearly  ₹9.78 trillion from investors’ wealth. The market capitalisation of all companies listed on the BSE tumbled to  ₹465 trillion from  ₹474 trillion on Tuesday.During the day, the overall market cap had slipped as much as  ₹10.5 trillion amid over 2% decline in the Indian benchmark indices.Singed by the escalating tensions in the Middle East amid a growing conflict between Iran and Israel, the benchmark equity indices – the Sensex and the Nifty – tumbled sharply today. The Sensex closed at 82,497, down 1,769 points or 2.10% while the Nifty 50 ended at 25,250, down 547 points or 2.12%. It was the fourth consecutive day of decline for both indices, wherein they lost over 3.5% each.Apart from geopolitical concerns, other factors have contributed to the stock market crash today, including a surge in crude oil prices, regulatory changes in the F\u0026O segment by the market regulator SEBI and outflows from foreign institutional investors.Iran launched around 180 ballistic missiles at Israel, causing a surge in crude oil prices. Brent crude jumped to $75 per barrel from $71 per barrel on Monday. Speculation is growing that Israel may retaliate by targeting major oil fields in Iran, which could further fuel the rise in oil prices. This does not bode well for India as it depends 80% on imports for its old demand. Any material increase in oil prices could raise India’s import bill.Further, recent regulatory changes in the F\u0026O segment by Sebi are expected to impact trading volumes, as retail participation may decline due to the increased contract size and limits on weekly expiries.Besides, foreign portfolio investors (FPIs) sold equities worth  ₹5,579.35 crore on 1 October, taking their selling to the third day in a row.Siddhartha Khemka, head - research, Wealth Management, Motilal Oswal Financial Services, said the market could witness volatility in the near term, with stock-specific action as the companies will announce pre-quarterly updates.On BSE, the market trend leaned in favour of declines as 2,881 stocks closed in the red while 1,107 ended in the green.","cleaned_content":"the indian stock markets on thursday saw their worst intraday fall in two months wiping off nearly \u003cNINE_\u003e trillion from investors wealth the market capitalisation of all companies listed on the bse tumbled to \u003cFOUR_HUNDRED\u003e trillion from \u003cFOUR_HUNDRED\u003e trillion on tuesday during the day the overall market cap had slipped as much as \u003cONE_TEN\u003e trillion amid over \u003cTWO_PERCENT\u003e decline in the indian benchmark indices singed by the escalating tensions in the middle east amid a growing conflict between iran and israel the benchmark equity indices the sensex and the nifty tumbled sharply today the sensex closed at \u003cEIGHT_TEN_THOUSAND\u003e down \u003cONE_THOUSAND\u003e points or \u003cTWO_PERCENT\u003e while the nifty \u003cFIVE_TEN\u003e ended at \u003cTWO_TEN_THOUSAND\u003e down \u003cFIVE_HUNDRED\u003e points or \u003cTWO_PERCENT\u003e it was the fourth consecutive day of decline for both indices wherein they lost over \u003cTHREE_PERCENT\u003e each apart from geopolitical concerns other factors have contributed to the stock market crash today including a surge in crude oil prices regulatory changes in the f o segment by the market regulator sebi and outflows from foreign institutional investors iran launched around \u003cONE_HUNDRED\u003e ballistic missiles at israel causing a surge in crude oil prices brent crude jumped to \u003cSEVEN_TEN\u003e per barrel from \u003cSEVEN_TEN\u003e per barrel on monday speculation is growing that israel may retaliate by targeting major oil fields in iran which could further fuel the rise in oil prices this does not bode well for india as it depends \u003cEIGHT_TEN_PERCENT\u003e on imports for its old demand any material increase in oil prices could raise india s import bill further recent regulatory changes in the f o segment by sebi are expected to impact trading volumes as retail participation may decline due to the increased contract size and limits on weekly expiries besides foreign portfolio investors fpis sold equities worth \u003cFIVE_THOUSAND\u003e crore on \u003cONE_\u003e october taking their selling to the third day in a row siddhartha khemka head research wealth management motilal oswal financial services said the market could witness volatility in the near term with stock specific action as the companies will announce pre quarterly updates on bse the market trend leaned in favour of declines as \u003cTWO_THOUSAND\u003e stocks closed in the red while \u003cONE_THOUSAND\u003e ended in the green","timestamp":"2024-10-03T17:56:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}