{"url":"https://www.livemint.com/market/stock-market-news/vedanta-share-price-rises-5-whats-driving-the-stock-that-is-inching-towards-1-year-high-11727340037014.html","title":"Vedanta share price rises 5%. What’s driving the stock towards its 1-year high level?","description":"Stock Market Today: Vedanta Ltd's share price rose over 5% in intraday trading, reaching  ₹504.75. The stock has gained over 10% in the last three sessions, driven by hopes of recovery in China's metals demand and rising base metal prices.","content":"Stock Market Today: Vedanta Ltd share price gained more than 5% in intraday trades:Vedanta Ltd share price after opening slightly higher at  ₹485.45 on the BSE on Thursday, September 26 extended gains to hit the intraday high of  ₹504.75, marking a rise of more than 5% over its previous close. Notably, Vedanta share price has inched close to its one-year or 52-week high of  ₹506.85.Vedanta share price has gained more than 10% in the past three trading sessions.Here are the key reasons that drove Vedanta share price over 10% in the last three trading sessions and close to its one-year high:2. China demand recovery hopes- The hope of recovery in metals demand from China has risen significantly with multiple steps being taken by the world's largest consumer of commodities.In a bid to spur economic growth, China's central bank will cut banks' reserve requirement ratio (RRR) by 50 basis points, which is expected to release about 1 trillion yuan ($142.21 billion) for new lending. Moreover, the central bank is willing to lower the RRR by another 0.25-0.5 percentage points later this year if required. Additionally, to support the struggling real-estate market, they will lower interest rates on existing mortgages and reduce the minimum down payment for homes to 15%.3. Rising base metal prices- Aluminium prices on the London Metals Exchange (LME), which were trading at slightly over $2300 a tonne on September 11, have crossed the$2500 a tonne level. Copper prices have jumped from $8800 a tonne to $9600 a tonne during this period. Similarly, zinc and lead prices have risen more than 10% while others such as nickel are following suit. Furthermore, there are expectations of an uptick in steel prices too.The rising prices of base metals and steel improve Vedanta's earnings outlook.","cleaned_content":"stock market today vedanta ltd share price gained more than \u003cFIVE_PERCENT\u003e in intraday trades vedanta ltd share price after opening slightly higher at \u003cFOUR_HUNDRED\u003e on the bse on thursday september \u003cTWO_TEN\u003e extended gains to hit the intraday high of \u003cFIVE_HUNDRED\u003e marking a rise of more than \u003cFIVE_PERCENT\u003e over its previous close notably vedanta share price has inched close to its one year or \u003cFIVE_TEN\u003e week high of \u003cFIVE_HUNDRED\u003e vedanta share price has gained more than \u003cONE_TEN_PERCENT\u003e in the past three trading sessions here are the key reasons that drove vedanta share price over \u003cONE_TEN_PERCENT\u003e in the last three trading sessions and close to its one year high \u003cTWO_\u003e china demand recovery hopes the hope of recovery in metals demand from china has risen significantly with multiple steps being taken by the worlds largest consumer of commodities in a bid to spur economic growth chinas central bank will cut banks reserve requirement ratio rrr by \u003cFIVE_TEN\u003e basis points which is expected to release about \u003cONE_\u003e trillion yuan \u003cONE_HUNDRED\u003e billion for new lending moreover the central bank is willing to lower the rrr by another \u003cZERO_\u003e \u003cZERO_PERCENT\u003e age points later this year if required additionally to support the struggling real estate market they will lower interest rates on existing mortgages and reduce the minimum down payment for homes to \u003cONE_TEN_PERCENT\u003e 3 rising base metal prices aluminium prices on the london metals exchange lme which were trading at slightly over \u003cTWO_THOUSAND\u003e a tonne on september \u003cONE_TEN\u003e have crossed the \u003cTWO_THOUSAND\u003e a tonne level copper prices have jumped from \u003cEIGHT_THOUSAND\u003e a tonne to \u003cNINE_THOUSAND\u003e a tonne during this period similarly zinc and lead prices have risen more than \u003cONE_TEN_PERCENT\u003e while others such as nickel are following suit furthermore there are expectations of an uptick in steel prices too the rising prices of base metals and steel improve vedantas earnings outlook","timestamp":"2024-09-26T14:42:00+05:30","market_timestamp":"2024-09-26T14:42:00+05:30","off_market_hours":false}