{"url":"https://www.livemint.com/market/stock-market-news/sectoral-shifts-in-indian-markets-industrials-metals-lead-financials-expected-to-rebound-says-phillip-capital-11727332184988.html","title":"Sectoral shifts in Indian markets: Industrials, metals lead, financials expected to rebound, says Phillip Capital","description":"Phillip Capital reported a shift in Indian equity sectors, with industrials and metals gaining post-Covid-19. Financials have retreated, but a recovery is anticipated. The report forecasts growth in staples and IT sectors, maintaining a positive long-term outlook on Indian equities.","content":"Global brokerage house Phillip Capital, in a recent note, observed that it has witnessed sectoral shifts within the Nifty and broader Indian equity markets, focusing on changes over both long and short terms. According to the report, investment-oriented sectors, including cement and building materials, gained considerable traction post the Covid-19 pandemic and reached decade-high weight within the market indices majorly driven by industrials and metals. Phillip Capital revealed that they have been overweight in this sector for the past two years and will maintain this position going forward.Meanwhile, financials, which had retreated from recent highs, are expected to see a gradual recovery, driven by declining bond yields and potential rate cuts, suggested the brokerage. The consumer sector saw an increase in its weightage from three-year lows, with expectations that the staples sector would continue to gain momentum. Information Technology (IT) stocks also rebounded from 2024 lows, while the energy sector dipped from its earlier highs but is expected to see long-term growth, especially with reforms related to green energy. Pharma and chemicals sectors also show promising potential due to strong domestic and export demand, noted the brokerage.Driven by financial penetration since 2014, the weight of the financials sector in the Nifty 500 (N-500) and Nifty 50 (N-50) indices increased by 2 percent and 5 percent, respectively, touching 27.6 percent in the N-500 and 32.6 percent in the N-50. However, as of 2024, these weights have fallen by 2.7 percent and 4.2 percent compared to FY23, informed the brokerage.It highlighted that within the financials space, the banking sector saw steady growth over the past decade, especially in the N-50. The sector's weight increased to 28.5 percent from 20.6 percent. However, the merger of HDFC Bank and HDFC led to a 4.3 percent decline in the sector’s weight in the N-50 and a 4.7 percent reduction in the N-500, as private banks underperformed public sector banks (PSUs). PSUs benefitted from stable asset quality, improved profitability, and strong credit growth in FY24, nevertheless, their overall index weight remained small.As for non-banking financial companies (NBFCs), the sector gained attention over the past decade due to increased financial penetration and economic expansion. The weight of NBFCs consistently rose until 2021 before gradually declining until June 2023. The merger of HDFC further reduced the weight of NBFCs, but was partially offset by the inclusion of Shriram Finance, added the brokerage.As per the brokerage, investment-oriented stocks, especially capital goods and defence, saw their weight in the N-500 reach an all-time high of 16.3 percent by May 2024, up from 9 percent in FY20. In the N-50, the weight increased to 11.7 percent from 7.5 percent. However, weights slightly declined to 15 percent in the N-500 and 10.5 percent in the N-50 after market corrections.Meanwhile, the industrials sector weight in the N-500 nearly halved by 2020 from 2014 levels, but more than doubled to 7.3 percent by FY25-to-date (FYTD25), driven by capital expenditure (capex), infrastructure development, and economic expansion. Metals and mining sector experienced a similar trend, with weights in the N-500 doubling to 4.3 percent from FY20 to FYTD25 due to rising demand and a surge in prices, it further pointed out.Moreover, cement stocks remained stable in their weight over the past decade, accounting for 2-3 percent of the N-500 and N-50 indices since 2014. Phillip Capital projected an upside in cement stocks in the medium term due to increasing demand and supply efficiencies.According to the brokerage, the weight of consumption-oriented stocks fluctuated in the N-50 and N-500 indices between 15-23 percent over the last decade. The sector gained momentum at the onset of Covid-19, followed by a slowdown, before rising again in 2023. As of FYTD25, the consumption sector's weight in the N-500 and N-50 indices has risen to 21.4 percent and 19.4 percent, respectively, due to growth in the auto and ancillary sectors.Phillip Capital also noted that the staples sector faced mixed sentiment, with its weight declining over the past decade. However, by FY25, the sector saw a rebound driven by price hikes, softening commodity prices, and increasing disposable incomes. The report forecasts stronger fundamentals for the sector in the second half of FY25.Meanwhile, it observed that discretionary consumption stocks also experienced an increase in weight from 2014 to 2020, though the weight remained flat post-pandemic. Auto and ancillary sectors saw their weight halve from 2017 to 2022 but recovered strongly over the past two years due to rising demand for passenger vehicles, electric vehicles, and government production-linked incentive (PLI) schemes.IT sector stocks experienced significant weight gains between 2017 and 2022, driven by rising digitisation demand, highlighted Phillip Capital. However, valuations and growth rates started to decline in late 2022, leading to a reduction in weight within the N-500 and N-50 indices. In the last three months, weights have increased again, boosted by global factors such as interest rate cuts.Telecom and media sectors, on the other hand, have seen consistent weight declines since 2015, though a marginal recovery was observed recently due to tariff hikes and advancements in 5G. Services also saw slight weight gains over the past year, particularly in tourism, logistics, and ports, the brokerage stated.According to Phillip Capital, the pharma sector’s weight in the N-500 and N-50 indices surged to an eight-year high by FY24, driven by robust business performance and earnings improvements post-pandemic. Chemicals, which had seen a rise in global demand in 2021 and 2022, faced declining weights in 2023 due to weaker domestic demand and lower commodity prices.The energy sector saw a sharp rise in weight between 2017 and 2022, driven by rising crude prices and electricity demand. Its weight has since stabilised, and as of FYTD25, stood at 11.8 percent and 14 percent in the N-500 and N-50 indices, respectively. Long-term reforms and the shift toward green energy to propel further growth in the sector, said the brokerage.Overall, Phillip Capital remains bullish on Indian equities, maintaining a structurally positive outlook on investment-oriented sectors while staying diversified across other sectors. Their long-term view is supported by strong corporate earnings, expanding demand, sustainable margins, and continued equity inflows from domestic and foreign institutional investors.","cleaned_content":"global brokerage house phillip capital in a recent note observed that it has witnessed sectoral shifts within the nifty and broader indian equity markets focusing on changes over both long and short terms according to the report investment oriented sectors including cement and building materials gained considerable traction post the covid \u003cONE_TEN\u003e pandemic and reached decade high weight within the market indices majorly driven by industrials and metals phillip capital revealed that they have been overweight in this sector for the past two years and will maintain this position going forward meanwhile financials which had retreated from recent highs are expected to see a gradual recovery driven by declining bond yields and potential rate cuts suggested the brokerage the consumer sector saw an increase in its weightage from three year lows with expectations that the staples sector would continue to gain momentum information technology it stocks also rebounded from \u003cTWO_THOUSAND\u003e lows while the energy sector dipped from its earlier highs but is expected to see long term growth especially with reforms related to green energy pharma and chemicals sectors also show promising potential due to strong domestic and export demand noted the brokerage driven by financial penetration since \u003cTWO_THOUSAND\u003e the weight of the financials sector in the nifty \u003cFIVE_HUNDRED\u003e n \u003cFIVE_HUNDRED\u003e and nifty \u003cFIVE_TEN\u003e n \u003cFIVE_TEN\u003e indices increased by \u003cTWO_PERCENT\u003e and \u003cFIVE_PERCENT\u003e respectively touching \u003cTWO_TEN_PERCENT\u003e in the n \u003cFIVE_HUNDRED\u003e and \u003cTHREE_TEN_PERCENT\u003e in the n \u003cFIVE_TEN\u003e however as of \u003cTWO_THOUSAND\u003e these weights have fallen by \u003cTWO_PERCENT\u003e and \u003cFOUR_PERCENT\u003e compared to fy23 informed the brokerage it highlighted that within the financials space the banking sector saw steady growth over the past decade especially in the n \u003cFIVE_TEN\u003e the sectors weight increased to \u003cTWO_TEN_PERCENT\u003e from \u003cTWO_TEN_PERCENT\u003e however the merger of hdfc bank and hdfc led to a \u003cFOUR_PERCENT\u003e decline in the sector s weight in the n \u003cFIVE_TEN\u003e and a \u003cFOUR_PERCENT\u003e reduction in the n \u003cFIVE_HUNDRED\u003e as private banks underperformed public sector banks psus psus benefitted from stable asset quality improved profitability and strong credit growth in fy24 nevertheless their overall index weight remained small as for non banking financial companies nbfcs the sector gained attention over the past decade due to increased financial penetration and economic expansion the weight of nbfcs consistently rose until \u003cTWO_THOUSAND\u003e before gradually declining until june \u003cTWO_THOUSAND\u003e the merger of hdfc further reduced the weight of nbfcs but was partially offset by the inclusion of shriram finance added the brokerage as per the brokerage investment oriented stocks especially capital goods and defence saw their weight in the n \u003cFIVE_HUNDRED\u003e reach an all time high of \u003cONE_TEN_PERCENT\u003e by may \u003cTWO_THOUSAND\u003e up from \u003cNINE_PERCENT\u003e in fy20 in the n \u003cFIVE_TEN\u003e the weight increased to \u003cONE_TEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e however weights slightly declined to \u003cONE_TEN_PERCENT\u003e in the n \u003cFIVE_HUNDRED\u003e and \u003cONE_TEN_PERCENT\u003e in the n \u003cFIVE_TEN\u003e after market corrections meanwhile the industrials sector weight in the n \u003cFIVE_HUNDRED\u003e nearly halved by \u003cTWO_THOUSAND\u003e from \u003cTWO_THOUSAND\u003e levels but more than doubled to \u003cSEVEN_PERCENT\u003e by fy25 to date fytd25 driven by capital expenditure capex infrastructure development and economic expansion metals and mining sector experienced a similar trend with weights in the n \u003cFIVE_HUNDRED\u003e doubling to \u003cFOUR_PERCENT\u003e from fy20 to fytd25 due to rising demand and a surge in prices it further pointed out moreover cement stocks remained stable in their weight over the past decade accounting for \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e of the n \u003cFIVE_HUNDRED\u003e and n \u003cFIVE_TEN\u003e indices since \u003cTWO_THOUSAND\u003e phillip capital projected an upside in cement stocks in the medium term due to increasing demand and supply efficiencies according to the brokerage the weight of consumption oriented stocks fluctuated in the n \u003cFIVE_TEN\u003e and n \u003cFIVE_HUNDRED\u003e indices between \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e over the last decade the sector gained momentum at the onset of covid \u003cONE_TEN\u003e followed by a slowdown before rising again in \u003cTWO_THOUSAND\u003e as of fytd25 the consumption sectors weight in the n \u003cFIVE_HUNDRED\u003e and n \u003cFIVE_TEN\u003e indices has risen to \u003cTWO_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively due to growth in the auto and ancillary sectors phillip capital also noted that the staples sector faced mixed sentiment with its weight declining over the past decade however by fy25 the sector saw a rebound driven by price hikes softening commodity prices and increasing disposable incomes the report forecasts stronger fundamentals for the sector in the second half of fy25 meanwhile it observed that discretionary consumption stocks also experienced an increase in weight from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e though the weight remained flat post pandemic auto and ancillary sectors saw their weight halve from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e but recovered strongly over the past two years due to rising demand for passenger vehicles electric vehicles and government production linked incentive pli schemes it sector stocks experienced significant weight gains between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e driven by rising digitisation demand highlighted phillip capital however valuations and growth rates started to decline in late \u003cTWO_THOUSAND\u003e leading to a reduction in weight within the n \u003cFIVE_HUNDRED\u003e and n \u003cFIVE_TEN\u003e indices in the last three months weights have increased again boosted by global factors such as interest rate cuts telecom and media sectors on the other hand have seen consistent weight declines since \u003cTWO_THOUSAND\u003e though a marginal recovery was observed recently due to tariff hikes and advancements in \u003cFIVE_\u003e g services also saw slight weight gains over the past year particularly in tourism logistics and ports the brokerage stated according to phillip capital the pharma sector s weight in the n \u003cFIVE_HUNDRED\u003e and n \u003cFIVE_TEN\u003e indices surged to an eight year high by fy24 driven by robust business performance and earnings improvements post pandemic chemicals which had seen a rise in global demand in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e faced declining weights in \u003cTWO_THOUSAND\u003e due to weaker domestic demand and lower commodity prices the energy sector saw a sharp rise in weight between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e driven by rising crude prices and electricity demand its weight has since stabilised and as of fytd25 stood at \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e in the n \u003cFIVE_HUNDRED\u003e and n \u003cFIVE_TEN\u003e indices respectively long term reforms and the shift toward green energy to propel further growth in the sector said the brokerage overall phillip capital remains bullish on indian equities maintaining a structurally positive outlook on investment oriented sectors while staying diversified across other sectors their long term view is supported by strong corporate earnings expanding demand sustainable margins and continued equity inflows from domestic and foreign institutional investors","timestamp":"2024-09-26T13:21:00+05:30","market_timestamp":"2024-09-26T13:21:00+05:30","off_market_hours":false}