{"url":"https://www.livemint.com/market/stock-market-news/fpis-invest-rs-57-359-crore-in-indian-equities-sept-logs-highest-inflows-ytd-on-us-fed-pivot-11727535228664.html","title":"FPIs continue buying streak, invest  ₹57,359 crore in Indian equities; Sept logs highest inflows YTD on US Fed pivot","description":"FPIs invested  ₹57,359 crore worth of Indian equities, and the net investment stood at  ₹91,702 crore as of September 27, taking into account debt, hybrid, debt-VRR, and equities","content":"Foreign portfolio investors (FPIs) continued their buying streak boosted by the latest supersized 50 basis points (bps) interest rate cut by the US Federal Reserve. FPIs made a remarkable comeback to Indian markets this month, snapping their previous moderation, driven by domestic and global factors. They were consistent buyers in June and July after election-related jitters faded and stability returned to Indian markets. However, FPIs halted their buying streak with the onset of the new fiscal year 2024-25 (FY25).FPIs invested  ₹57,359 crore worth of Indian equities, and the net investment stood at  ₹91,702 crore as of September 27, taking into account debt, hybrid, debt-VRR, and equities, according to the National Securities Depository Ltd (NSDL) data. This month, the total investment in debt markets is  ₹8,543 crore. Regarding equities, September has logged the highest FPI inflows year-to-date (YTD), while the total investment is at a nine-month high.Also Read: US Fed delivers supersized 50 bps rate cut: FPI inflows to stronger INR—here’s how the verdict is ‘good’ for India“The strong FII buying witnessed this month continued for the week ending on September 27. The variations in FII activity through exchanges and the primary market also continued with occasional selling in the cash market and sustained investment through the primary market. FIIs invested  ₹57,359 crore in September, with investment through the exchanges alone touching  ₹46,480 crore,” said Dr V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services.According to Dr V K Vijayakumar, the total investment by FIIs so far in 2024 now stands at  ₹1,00,245 crore. This has contributed to the stability in INR this year. The September 18th rate cut and the US Fed's dovish commentary can be seen as a major pivot in interest rates. According to the analyst, this can facilitate sustained flows to emerging markets like India.Also Read: US Fed pivot in focus: Why are gold prices following US Treasury yield? — Explained“This week witnessed the Sensex marking at all-time high record levels,  all thanks to the FPI fraternity making net positive inflows in the equity segment. Last week’s Fed rate cuts increased the liquidity in the Indian markets since currency fluctuations aided the Indian rupee. This interest rate differential is expected to attract more FPI inflows into India,\" said Manoj Purohit, Partner and Leader of FS Tax, Tax and Regulatory Services, BDO India.According to Purohit, the capital markets regulator, the Securities and Exchange Board of India (SEBI), also added the icing to lure investors by establishing a dedicated FPI Outreach Cell to directly engage with foreign investors.The cell will guide prospective FPIs during the pre-application stage, including assistance with documentation and compliance processes. It will also offer support during the onboarding phase and resolve any operational challenges that may arise during the registration process or thereafter.Also Read: Nifty 50 unbeatable since outsized US Fed rate cut: What should be your trading strategy amid high valuations?“All eyes now on the upcoming SEBI Board Meeting on September 30, which may bring up such fees and more such announcements which will reflect the government’s intention of making India a transparent, flexible, and easy to trade platform for offshore investors,” said Purohit.However, analysts at Geojit Financial Services said a recent trend is the big inflows into the Hong Kong market. The market was the star performer in September, with the Hang Seng index gaining a whopping 14 per cent.“The monetary and fiscal stimulus implemented by China is expected to stimulate the Chinese economy and the Chinese stocks listed in the Hong Kong market. If the outperformance of Hang Seng continues, more funds may flow to Hong Kong since that market continues to be very cheap,” said Geojit's Dr V K Vijayakumar.Also Read: US Fed lowers policy rate by 50 bps from 23-year high, signals additional 50 bps cuts; 5 key takeawaysExperts remain concerned that the market will overheat and valuations will be stretched. Analysts added that the Indian markets reflected their resilience positively based on the strong fundamentals and robust economic performance at the expected economic growth.All eyes are on the Reserve Bank of India (RBI), whether it follows suit by cutting the repo rate in October or waiting until December. There is a strong case to marginally cut rates to manage food inflation and diluted interest from household savings, which impact banks' retail lending business.\"India’s monetary policy has been more conservative despite the Fed's recent action. The Indian government is vigilant enough to the external macro factors, leaving no stone unturned to shift its policies to make the capital market most conducive for foreign infusions,\" said Purohit of BDO India.","cleaned_content":"foreign portfolio investors fpis continued their buying streak boosted by the latest supersized \u003cFIVE_TEN\u003e basis points bps interest rate cut by the us federal reserve fpis made a remarkable comeback to indian markets this month snapping their previous moderation driven by domestic and global factors they were consistent buyers in june and july after election related jitters faded and stability returned to indian markets however fpis halted their buying streak with the onset of the new fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fy25 fpis invested \u003cFIVE_TEN_THOUSAND\u003e crore worth of indian equities and the net investment stood at \u003cNINE_TEN_THOUSAND\u003e crore as of september \u003cTWO_TEN\u003e taking into account debt hybrid debt vrr and equities according to the national securities depository ltd nsdl data this month the total investment in debt markets is \u003cEIGHT_THOUSAND\u003e crore regarding equities september has logged the highest fpi inflows year to date ytd while the total investment is at a nine month high also read us fed delivers supersized \u003cFIVE_TEN\u003e bps rate cut fpi inflows to stronger inr here s how the verdict is good for india the strong fii buying witnessed this month continued for the week ending on september \u003cTWO_TEN\u003e the variations in fii activity through exchanges and the primary market also continued with occasional selling in the cash market and sustained investment through the primary market fiis invested \u003cFIVE_TEN_THOUSAND\u003e crore in september with investment through the exchanges alone touching \u003cFOUR_TEN_THOUSAND\u003e crore said dr v k vijayakumar chief investment strategist geojit financial services according to dr v k vijayakumar the total investment by fiis so far in \u003cTWO_THOUSAND\u003e now stands at \u003cONE_HUNDRED_THOUSAND\u003e crore this has contributed to the stability in inr this year the september \u003cONE_TEN\u003e th rate cut and the us feds dovish commentary can be seen as a major pivot in interest rates according to the analyst this can facilitate sustained flows to emerging markets like india also read us fed pivot in focus why are gold prices following us treasury yield explained this week witnessed the sensex marking at all time high record levels all thanks to the fpi fraternity making net positive inflows in the equity segment last week s fed rate cuts increased the liquidity in the indian markets since currency fluctuations aided the indian rupee this interest rate differential is expected to attract more fpi inflows into india said manoj purohit partner and leader of fs tax tax and regulatory services bdo india according to purohit the capital markets regulator the securities and exchange board of india sebi also added the icing to lure investors by establishing a dedicated fpi outreach cell to directly engage with foreign investors the cell will guide prospective fpis during the pre application stage including assistance with documentation and compliance processes it will also offer support during the onboarding phase and resolve any operational challenges that may arise during the registration process or thereafter also read nifty \u003cFIVE_TEN\u003e unbeatable since outsized us fed rate cut what should be your trading strategy amid high valuations all eyes now on the upcoming sebi board meeting on september \u003cTHREE_TEN\u003e which may bring up such fees and more such announcements which will reflect the government s intention of making india a transparent flexible and easy to trade platform for offshore investors said purohit however analysts at geojit financial services said a recent trend is the big inflows into the hong kong market the market was the star performer in september with the hang seng index gaining a whopping \u003cONE_TEN_PERCENT\u003e the monetary and fiscal stimulus implemented by china is expected to stimulate the chinese economy and the chinese stocks listed in the hong kong market if the outperformance of hang seng continues more funds may flow to hong kong since that market continues to be very cheap said geojits dr v k vijayakumar also read us fed lowers policy rate by \u003cFIVE_TEN\u003e bps from \u003cTWO_TEN\u003e year high signals additional \u003cFIVE_TEN\u003e bps cuts \u003cFIVE_\u003e key takeawaysexperts remain concerned that the market will overheat and valuations will be stretched analysts added that the indian markets reflected their resilience positively based on the strong fundamentals and robust economic performance at the expected economic growth all eyes are on the reserve bank of india rbi whether it follows suit by cutting the repo rate in october or waiting until december there is a strong case to marginally cut rates to manage food inflation and diluted interest from household savings which impact banks retail lending business india s monetary policy has been more conservative despite the feds recent action the indian government is vigilant enough to the external macro factors leaving no stone unturned to shift its policies to make the capital market most conducive for foreign infusions said purohit of bdo india","timestamp":"2024-09-28T20:29:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}