{"url":"https://www.livemint.com/market/stock-market-news/stock-in-focus-ag-dynamics-to-minerva-ventures-these-five-fiis-buy-stake-in-this-small-cap-stock-11727405214074.html","title":"Stock in focus: AG Dynamics to Minerva Ventures — five FIIs buy stake in this multibagger small-cap stock","description":"Stock Market Today- MOS Utility Ltd share price remains in focus as five FIIs have picked stake in this small-cap stock. The stock price of MOS Utility has more than doubled since July 2024 lows and grown almost four folds in the last one year, giving multibagger returns to investors.","content":"Stock Market Today: MOS Utility Ltd share price is in focus on Friday, September 27 as five foreign institutional investors (FIIs) have picked a stake in the small-cap stock.MOS Utility share price has more than doubled since July 2024 lows and almost grown 4 folds in the last one year, hence giving multibagger returns to the investorsAs per bulk deals data available on NSE, five FIIs, namely Saint Capital Fund, AG Dynamic Funds Ltd., Minerva Ventures Fund, Nexpact Ltd. and Bridge India Fund, picked up stakes in MOS Utility Ltd on 26 September 2024.Saint Capital Fund picked up 15,40,000 shares, AG Dynamic Funds picked up 2,69,600 shares, while Bridge India Fund picked up 5,49,600 shares.Recently, MOS Utility's share price has also remained in focus as it entered into a share subscription/share purchase agreement to acquire 51% equity shares of Samvriddhi Inclusive Growth Network Private Limited. Samvriddhi Inclusive Growth Network is engaged in the business of providing financial inclusion and financial services etc. related services on a pan India basis through its network of agents.MOS Utility Limited provides a variety of fintech and utility payment solutions services to businesses and consumers. As per the block deal data, Minerva Ventures Fund and Saint Capital Fund acquired a stake in MOS Utility at an average price of  ₹285.94 and  ₹285, respectively.MOS is associated with renowned actor Nawazuddin Siddiqui to amplify its mission of financial inclusion. Helped by this strategic collaboration, MOS aims to highlight the convenience and accessibility of its financial services, showcasing how they cater to the diverse needs of individuals across India. Siddiqui's relatable and humble personality seamlessly aligns with MOS’s customer-centric approach, resonating with the masses, according to the company.By tapping into his massive fan following spanning urban and rural India, MOS seeks to bridge the financial divide, promoting economic empowerment and social mobility.","cleaned_content":"stock market today mos utility ltd share price is in focus on friday september \u003cTWO_TEN\u003e as five foreign institutional investors fiis have picked a stake in the small cap stock mos utility share price has more than doubled since july \u003cTWO_THOUSAND\u003e lows and almost grown \u003cFOUR_\u003e folds in the last one year hence giving multibagger returns to the investorsas per bulk deals data available on nse five fiis namely saint capital fund ag dynamic funds ltd minerva ventures fund nexpact ltd and bridge india fund picked up stakes in mos utility ltd on \u003cTWO_TEN\u003e september \u003cTWO_THOUSAND\u003e saint capital fund picked up \u003cONE_MILLION\u003e shares ag dynamic funds picked up \u003cTWO_HUNDRED_THOUSAND\u003e shares while bridge india fund picked up \u003cFIVE_HUNDRED_THOUSAND\u003e shares recently mos utilitys share price has also remained in focus as it entered into a share subscription share purchase agreement to acquire \u003cFIVE_TEN_PERCENT\u003e equity shares of samvriddhi inclusive growth network private limited samvriddhi inclusive growth network is engaged in the business of providing financial inclusion and financial services etc related services on a pan india basis through its network of agents mos utility limited provides a variety of fintech and utility payment solutions services to businesses and consumers as per the block deal data minerva ventures fund and saint capital fund acquired a stake in mos utility at an average price of \u003cTWO_HUNDRED\u003e and \u003cTWO_HUNDRED\u003e respectively mos is associated with renowned actor nawazuddin siddiqui to amplify its mission of financial inclusion helped by this strategic collaboration mos aims to highlight the convenience and accessibility of its financial services showcasing how they cater to the diverse needs of individuals across india siddiquis relatable and humble personality seamlessly aligns with mos s customer centric approach resonating with the masses according to the company by tapping into his massive fan following spanning urban and rural india mos seeks to bridge the financial divide promoting economic empowerment and social mobility","timestamp":"2024-09-27T09:03:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}