{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-sensex-close-at-record-levels-for-the-3rd-day-running-nifty-psu-bank-up-33-11727085253500.html","title":"Stock market today: Nifty 50, Sensex close at record levels for the 3rd day running, Nifty PSU Bank up 3.4%","description":"Nifty 50 reached a record high of 25,956 points, just shy of the 26,000 mark, before ending the day up 0.57% at 25,939 points. Similarly, the S\u0026P BSE Sensex touched a fresh record high of 84,928 points before closing at 84,864 points, 0.45% higher than the previous close.","content":"Continuing their winning streak for the third consecutive trading session, Indian benchmark indices reached new record highs today, driven by strong support from the financial services sector. In addition, a rally in realty and auto stocks contributed to the market's strength, while the recovery in PSU stocks continued in today's session. All major sectoral indices closed in positive territory at the end of Monday's trading session.As a result, the Nifty 50 reached a record high of 25,956 points, just shy of the 26,000 mark, before ending the day up 0.57 per cent at 25,939 points. Similarly, the S\u0026P BSE Sensex touched a fresh record high of 84,928 points before closing at 84,864 points, 0.45 per cent higher than the previous close.Among sectoral indices, Nifty PSU Bank led the gains with a rise of 3.40 per cent, followed by Nifty Realty, Nifty Oil \u0026 Gas, Nifty Auto, and Nifty Consumer Durables, which posted gains between 1.3 per cent and 2.5 per cent.Out of the 50 constituents of the Nifty 50, 34 closed in the green. Bajaj Auto led the gains with a 3.7 per cent increase, followed by Mahindra \u0026 Mahindra, ONGC, Hero MotoCorp, SBI Life Insurance, SBI, HDFC Life Insurance, Airtel, BPCL, and Coal India, all posting gains between 2 per cent and 3.3 per cent.Commenting on today's market performance, Vinod Nair, Head of Research at Geojit Financial Services, said, \"The euphoria from the FED rate cut continued to lift the domestic market. The benign input costs and an expectation of a change in stance by the RBI amid cuts by global banks will provide tailwinds to valuation. Though there is moderation in India PMI data, investors anticipate that the wave of liquidity from FII may provide stability in the sentiment.\"Nifty 50 rose by 2.5 per cent following the Federal Open Market Committee (FOMC) decision to lower the Fed funds rate by 50 basis points Historically, India's equity markets have performed well three to six months after the first rate cut in a non-recessionary environment.However, global brokerage firm Goldman Sachs observed that the gains were relatively modest compared to other rate-sensitive markets in the Asia-Pacific region. Sectors such as consumer discretionary, industrials, and IT have historically benefited from non-recessionary rate cuts.The stocks of PSU banks extended their recovery trend in today’s trading session, with all 12 constituents of the Nifty PSU index closing in positive territory. The Bank of Maharashtra led the gains, rising by 8.1 per cent, followed by Punjab \u0026 Sind Bank, Indian Bank, Central Bank of India, and UCO Bank, all finishing with gains above 5 per cent.Additionally, stocks like Indian Overseas Bank, Canara Bank, Bank of Baroda, Union Bank of India, Punjab National Bank, State Bank of India, and Bank of India recorded gains between 1.9 per cent and 4.5 per cent.Real estate stocks performed well in today's session, marking their third consecutive day of gains. The Nifty Realty index soared by 2.60 per cent during intraday trading, reaching a two-month high before closing the session up 2.23 per cent at 1,126 points.All 10 constituents of the index ended the day in positive territory, with Godrej Properties leading the way, gaining 6.8 per cent to close at 3,192 points. DLF and Sobha also finished the trading session with gains exceeding 3 per cent.Amit Golia, Group CEO of MarketsMojo, said, \"The U.S. Federal Reserve's decision to cut rates by 50 basis points signals a shift in global monetary policy, and its ripple effects are felt across global markets, including India. Sectors benefiting from lowering interest costs might include real estate and infrastructure companies, which are heavily debt-funded.\"The recent surge in Indian equities is largely attributed to significant inflows from Foreign Portfolio Investors (FPI). Experts believe that the markets will likely maintain their upward momentum if these inflows persist.September has seen the second highest inflows of 2024 to date. Data from NSDL shows that, FPIs have invested a net total of  ₹33,691 crore in Indian equities this month so far.Manoj Purohit, Partner \u0026 Leader of Financial Services Tax at BDO India, said, \"Despite global uncertainties, the strong FPI inflows into India are driven by key factors such as balanced fiscal deficits, the impact of rate cuts on the Indian currency, strong valuations, and the RBI's commitment to controlling inflation without resorting to a rate cut.\"He also added that Indian IPOs have drawn significant foreign funds, making the Indian capital market more buoyant and an attractive option for investors looking to shift their positions from riskier countries.","cleaned_content":"continuing their winning streak for the third consecutive trading session indian benchmark indices reached new record highs today driven by strong support from the financial services sector in addition a rally in realty and auto stocks contributed to the markets strength while the recovery in psu stocks continued in todays session all major sectoral indices closed in positive territory at the end of mondays trading session as a result the nifty \u003cFIVE_TEN\u003e reached a record high of \u003cTWO_TEN_THOUSAND\u003e points just shy of the \u003cTWO_TEN_THOUSAND\u003e mark before ending the day up \u003cZERO_PERCENT\u003e at \u003cTWO_TEN_THOUSAND\u003e points similarly the s p bse sensex touched a fresh record high of \u003cEIGHT_TEN_THOUSAND\u003e points before closing at \u003cEIGHT_TEN_THOUSAND\u003e points \u003cZERO_PERCENT\u003e higher than the previous close among sectoral indices nifty psu bank led the gains with a rise of \u003cTHREE_PERCENT\u003e followed by nifty realty nifty oil gas nifty auto and nifty consumer durables which posted gains between \u003cONE_PERCENT\u003e and \u003cTWO_PERCENT\u003e out of the \u003cFIVE_TEN\u003e constituents of the nifty \u003cFIVE_TEN\u003e \u003cTHREE_TEN\u003e closed in the green bajaj auto led the gains with a \u003cTHREE_PERCENT\u003e increase followed by mahindra mahindra ongc hero motocorp sbi life insurance sbi hdfc life insurance airtel bpcl and coal india all posting gains between \u003cTWO_PERCENT\u003e and \u003cTHREE_PERCENT\u003e commenting on todays market performance vinod nair head of research at geojit financial services said the euphoria from the fed rate cut continued to lift the domestic market the benign input costs and an expectation of a change in stance by the rbi amid cuts by global banks will provide tailwinds to valuation though there is moderation in india pmi data investors anticipate that the wave of liquidity from fii may provide stability in the sentiment nifty \u003cFIVE_TEN\u003e rose by \u003cTWO_PERCENT\u003e following the federal open market committee fomc decision to lower the fed funds rate by \u003cFIVE_TEN\u003e basis points historically indias equity markets have performed well three to six months after the first rate cut in a non recessionary environment however global brokerage firm goldman sachs observed that the gains were relatively modest compared to other rate sensitive markets in the asia pacific region sectors such as consumer discretionary industrials and it have historically benefited from non recessionary rate cuts the stocks of psu banks extended their recovery trend in today s trading session with all \u003cONE_TEN\u003e constituents of the nifty psu index closing in positive territory the bank of maharashtra led the gains rising by \u003cEIGHT_PERCENT\u003e followed by punjab sind bank indian bank central bank of india and uco bank all finishing with gains above \u003cFIVE_PERCENT\u003e additionally stocks like indian overseas bank canara bank bank of baroda union bank of india punjab national bank state bank of india and bank of india recorded gains between \u003cONE_PERCENT\u003e and \u003cFOUR_PERCENT\u003e real estate stocks performed well in todays session marking their third consecutive day of gains the nifty realty index soared by \u003cTWO_PERCENT\u003e during intraday trading reaching a two month high before closing the session up \u003cTWO_PERCENT\u003e at \u003cONE_THOUSAND\u003e points all \u003cONE_TEN\u003e constituents of the index ended the day in positive territory with godrej properties leading the way gaining \u003cSIX_PERCENT\u003e to close at \u003cTHREE_THOUSAND\u003e points dlf and sobha also finished the trading session with gains exceeding \u003cTHREE_PERCENT\u003e amit golia group ceo of marketsmojo said the u s federal reserves decision to cut rates by \u003cFIVE_TEN\u003e basis points signals a shift in global monetary policy and its ripple effects are felt across global markets including india sectors benefiting from lowering interest costs might include real estate and infrastructure companies which are heavily debt funded the recent surge in indian equities is largely attributed to significant inflows from foreign portfolio investors fpi experts believe that the markets will likely maintain their upward momentum if these inflows persist september has seen the second highest inflows of \u003cTWO_THOUSAND\u003e to date data from nsdl shows that fpis have invested a net total of \u003cTHREE_TEN_THOUSAND\u003e crore in indian equities this month so far manoj purohit partner leader of financial services tax at bdo india said despite global uncertainties the strong fpi inflows into india are driven by key factors such as balanced fiscal deficits the impact of rate cuts on the indian currency strong valuations and the rbis commitment to controlling inflation without resorting to a rate cut he also added that indian ipos have drawn significant foreign funds making the indian capital market more buoyant and an attractive option for investors looking to shift their positions from riskier countries","timestamp":"2024-09-23T15:42:00+05:30","market_timestamp":"2024-09-24T09:15:00+05:30","off_market_hours":true}