{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-sumeet-bagadia-recommends-three-stocks-to-buy-on-monday-sept-30-11727505222975.html","title":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Sept 30","description":"Buy or sell: Sumeet Bagadia recommends three stocks to buy on Monday — Eicher Motors, Pidilit Industries, and Cipla","content":"Buy or sell stocks: Despite global market sentiments, the Indian stock market snapped a six-session winning streak on Friday. The Nifty 50 index finished 37 points lower at 26,178, the BSE Sensex shed 264 points and closed at 85,571, and the Nifty Bank index ended 541 points lower at 53,834. Cash market volumes on the NSE were up 36.2% compared to the previous day, partly due to Nifty rebalancing volumes. Broad market indices ended marginally positive even as the advance-decline ratio rose to 0.99:1.Sumeet Bagadia, Executive Director at Choice Broking, believes the overall trend of the Indian stock market is bullish, and the Nifty 50 index is poised to touch 26,900 despite the 50-stock index closing red on Friday. The Choice Broking expert maintained that investors should maintain a buy-on-dips strategy until the frontline index exceeds the 26,000 mark. He said crucial support for the Nifty 50 index is placed at 25,800.Sumeet Bagadia recommended buying Eicher Motors, Pidilite Industries, and Cipla as stocks to buy on Monday.1] Eicher Motors: Buy at  ₹5062.60, target  ₹5300, stop loss  ₹4900.Eicher Motors shares' daily chart analysis offers a favourable view for the coming days ahead, indicating a sustainable upside bounce over the last two weeks. The stock price has moved in a larger consolidation pattern in the previous couple of months and is currently attempting to break above the range of  ₹4900 to  ₹5000 levels. A sustainable move above the hurdle could be considered a decisive upside breakout, which could have a sharp positive impact on the stock price to the next target of  ₹5300.2] Pidilite Industries: Buy at  ₹3363.45, target  ₹3555, stop loss  ₹3250.Pidilite Industries' share has demonstrated remarkable strength and positive momentum in recent high-volume trading sessions, currently trading at  ₹3363.45. The stock's recent consolidation within the  ₹3200 to  ₹3300 range has laid the foundation for a potential upward movement, emphasized by a rising wedge candlestick pattern on the weekly charts.Notably, Pidilite Industries' share price maintains a robust technical posture by comfortably holding its position above the crucial 20-day, 50-day, and 200-day Exponential Moving Averages (EMA), reflecting a solid base and signalling a positive trend. The Relative Strength Index (RSI), a pivotal momentum indicator, is rising and currently stands at 65 levels.As Pidilite Industries shares gear up to confront the next target level at  ₹3555, its ability to sustain itself above critical support levels during pullbacks suggests a strong technical setup. Employing trailing stop losses, with a protective buffer near the significant support level of  ₹3250, is a prudent risk management strategy for investors who entered the market at lower levels. In conclusion, the technical analysis paints a favourable picture for PIDILITIND, indicating the potential for further upward movement and instilling confidence among investors.3] Cipla: Buy at  ₹1672.50, target  ₹1777, stop loss  ₹1616.CIPLA's share price currently trades at  ₹1672.5, showcasing a notable uptrend from the support levels around  ₹1600, near its 50-day Exponential Moving Average (EMA). The stock's positive momentum is further confirmed by its positioning above the short-term (20-day), medium-term (50-day), and long-term (200-day) EMA levels, reinforcing its technical resilience.A significant breakthrough above the resistance at  ₹1699, supported by robust volumes, underscores the stock's strength. A sustained closure above this resistance could propel the stock to the next target of  ₹1777. Traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near 1616, aiming for  ₹1777 and beyond.The momentum indicator, Relative Strength Index (RSI), is currently at 60 levels, indicating positive momentum in the stock. For those considering fresh investments, purchasing at the current market price (CMP) is a viable option, targeting  ₹1777, with a stringent stop loss set at  ₹1616 levels to manage risk effectively.","cleaned_content":"buy or sell stocks despite global market sentiments the indian stock market snapped a six session winning streak on friday the nifty \u003cFIVE_TEN\u003e index finished \u003cTHREE_TEN\u003e points lower at \u003cTWO_TEN_THOUSAND\u003e the bse sensex shed \u003cTWO_HUNDRED\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e and the nifty bank index ended \u003cFIVE_HUNDRED\u003e points lower at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were up \u003cTHREE_TEN_PERCENT\u003e compared to the previous day partly due to nifty rebalancing volumes broad market indices ended marginally positive even as the advance decline ratio rose to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes the overall trend of the indian stock market is bullish and the nifty \u003cFIVE_TEN\u003e index is poised to touch \u003cTWO_TEN_THOUSAND\u003e despite the \u003cFIVE_TEN\u003e stock index closing red on friday the choice broking expert maintained that investors should maintain a buy on dips strategy until the frontline index exceeds the \u003cTWO_TEN_THOUSAND\u003e mark he said crucial support for the nifty \u003cFIVE_TEN\u003e index is placed at \u003cTWO_TEN_THOUSAND\u003e sumeet bagadia recommended buying eicher motors pidilite industries and cipla as stocks to buy on monday 1 eicher motors buy at \u003cFIVE_THOUSAND\u003e target \u003cFIVE_THOUSAND\u003e stop loss \u003cFOUR_THOUSAND\u003e eicher motors shares daily chart analysis offers a favourable view for the coming days ahead indicating a sustainable upside bounce over the last two weeks the stock price has moved in a larger consolidation pattern in the previous couple of months and is currently attempting to break above the range of \u003cFOUR_THOUSAND\u003e to \u003cFIVE_THOUSAND\u003e levels a sustainable move above the hurdle could be considered a decisive upside breakout which could have a sharp positive impact on the stock price to the next target of \u003cFIVE_THOUSAND\u003e pidilite industries buy at \u003cTHREE_THOUSAND\u003e target \u003cTHREE_THOUSAND\u003e stop loss \u003cTHREE_THOUSAND\u003e pidilite industries share has demonstrated remarkable strength and positive momentum in recent high volume trading sessions currently trading at \u003cTHREE_THOUSAND\u003e the stocks recent consolidation within the \u003cTHREE_THOUSAND\u003e to \u003cTHREE_THOUSAND\u003e range has laid the foundation for a potential upward movement emphasized by a rising wedge candlestick pattern on the weekly charts notably pidilite industries share price maintains a robust technical posture by comfortably holding its position above the crucial \u003cTWO_TEN\u003e day \u003cFIVE_TEN\u003e day and \u003cTWO_HUNDRED\u003e day exponential moving averages ema reflecting a solid base and signalling a positive trend the relative strength index rsi a pivotal momentum indicator is rising and currently stands at \u003cSIX_TEN\u003e levels as pidilite industries shares gear up to confront the next target level at \u003cTHREE_THOUSAND\u003e its ability to sustain itself above critical support levels during pullbacks suggests a strong technical setup employing trailing stop losses with a protective buffer near the significant support level of \u003cTHREE_THOUSAND\u003e is a prudent risk management strategy for investors who entered the market at lower levels in conclusion the technical analysis paints a favourable picture for pidilitind indicating the potential for further upward movement and instilling confidence among investors 3 cipla buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e ciplas share price currently trades at \u003cONE_THOUSAND\u003e showcasing a notable uptrend from the support levels around \u003cONE_THOUSAND\u003e near its \u003cFIVE_TEN\u003e day exponential moving average ema the stocks positive momentum is further confirmed by its positioning above the short term \u003cTWO_TEN\u003e day medium term \u003cFIVE_TEN\u003e day and long term \u003cTWO_HUNDRED\u003e day ema levels reinforcing its technical resilience a significant breakthrough above the resistance at \u003cONE_THOUSAND\u003e supported by robust volumes underscores the stocks strength a sustained closure above this resistance could propel the stock to the next target of \u003cONE_THOUSAND\u003e traders and investors who entered at lower levels are advised to safeguard their positions by trailing stop losses near \u003cONE_THOUSAND\u003e aiming for \u003cONE_THOUSAND\u003e and beyond the momentum indicator relative strength index rsi is currently at \u003cSIX_TEN\u003e levels indicating positive momentum in the stock for those considering fresh investments purchasing at the current market price cmp is a viable option targeting \u003cONE_THOUSAND\u003e with a stringent stop loss set at \u003cONE_THOUSAND\u003e levels to manage risk effectively","timestamp":"2024-09-29T07:47:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}