{"url":"https://www.livemint.com/market/stock-market-news/g-r-infraprojects-stock-soars-over-6-on-rs-904-crore-metro-contract-win-11727150647132.html","title":"G R Infraprojects stock soars over 6% on  ₹904 crore metro contract win","description":"The company’s shares began their upward rally in December 2023 and have maintained this momentum to date. During this period, the shares have surged from  ₹1,036 each to the current trading price of  ₹1,717, representing a gain of 66 per cent.","content":"Shares of G R Infraprojects surged by 6.12 F in early morning trading, reaching  ₹1,774.95 each, following the announcement of a major contract win. On Monday, the company informed investors through an exchange filing that it had secured the position of lowest bidder for a metro construction project valued at  ₹904 crore.This project is being executed by Maharashtra Metro Rail Corporation Ltd. in Nagpur. According to an exchange filing, it involves the design and construction of a 17.62 km elevated metro viaduct, which includes railway spans of 79 meters and 100 meters in length.Additionally, the engineering, procurement, and construction project encompasses the design and construction of a six-lane double-decker section featuring a vehicular underpass that measures 1.14 km in Reach-1A of NMRP Phase 2, according to the regulatory filing.The company is in the construction and upkeep of roads, bridges, highways, and various civil infrastructure projects. It holds a significant presence in northern and central India, with recent expansion into the western and southern regions.The company has evolved its project models, notably the engineering, procurement, and construction (EPC) model and the build, operate, and transfer (BOT) model, offering it a competitive advantage.As of 31st March 2024, the company’s order book stands at  ₹16,780.61 crore. During FY24, it successfully secured various projects, including two road projects under the Hybrid Annuity Model (HAM) valued at  ₹1,615.70 crore, one ropeway project worth  ₹259.32 crore, one transmission project valued at  ₹313.56 crore, and one tunneling project worth  ₹1,541.15 crore, all catering to the hydro sector, as per the company's FY24 annual report.The company’s shares began their upward rally in December 2023 and have maintained this momentum to date. During this period, the shares have surged from  ₹1,036 each to the current trading price of  ₹1,717, representing a gain of 66 per cent.India’s infrastructure sector is poised for continued growth, with planned investments totaling USD 1.4 trillion by 2025. 10 The government's ambitious National Infrastructure Pipeline (NIP) program outlines a massive infusion of capital into various subsectors, including energy, roads, railways, and urban development.","cleaned_content":"shares of g r infraprojects surged by \u003cSIX_\u003e f in early morning trading reaching \u003cONE_THOUSAND\u003e each following the announcement of a major contract win on monday the company informed investors through an exchange filing that it had secured the position of lowest bidder for a metro construction project valued at \u003cNINE_HUNDRED\u003e crore this project is being executed by maharashtra metro rail corporation ltd in nagpur according to an exchange filing it involves the design and construction of a \u003cONE_TEN\u003e km elevated metro viaduct which includes railway spans of \u003cSEVEN_TEN\u003e meters and \u003cONE_HUNDRED\u003e meters in length additionally the engineering procurement and construction project encompasses the design and construction of a six lane double decker section featuring a vehicular underpass that measures \u003cONE_\u003e km in reach \u003cONE_\u003e a of nmrp phase \u003cTWO_\u003e according to the regulatory filing the company is in the construction and upkeep of roads bridges highways and various civil infrastructure projects it holds a significant presence in northern and central india with recent expansion into the western and southern regions the company has evolved its project models notably the engineering procurement and construction epc model and the build operate and transfer bot model offering it a competitive advantage as of \u003cTHREE_TEN\u003e st march \u003cTWO_THOUSAND\u003e the company s order book stands at \u003cONE_TEN_THOUSAND\u003e crore during fy24 it successfully secured various projects including two road projects under the hybrid annuity model ham valued at \u003cONE_THOUSAND\u003e crore one ropeway project worth \u003cTWO_HUNDRED\u003e crore one transmission project valued at \u003cTHREE_HUNDRED\u003e crore and one tunneling project worth \u003cONE_THOUSAND\u003e crore all catering to the hydro sector as per the companys fy24 annual report the company s shares began their upward rally in december \u003cTWO_THOUSAND\u003e and have maintained this momentum to date during this period the shares have surged from \u003cONE_THOUSAND\u003e each to the current trading price of \u003cONE_THOUSAND\u003e representing a gain of \u003cSIX_TEN_PERCENT\u003e india s infrastructure sector is poised for continued growth with planned investments totaling usd \u003cONE_\u003e trillion by \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e the governments ambitious national infrastructure pipeline nip program outlines a massive infusion of capital into various subsectors including energy roads railways and urban development","timestamp":"2024-09-24T09:46:00+05:30","market_timestamp":"2024-09-24T09:46:00+05:30","off_market_hours":false}