{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-under-rs-5-advik-capital-rights-issue-to-raise-rs-49-95-crore-opens-check-details-11727163540944.html","title":"Penny stock under  ₹5: Advik Capital rights issue to raise  ₹49.95 crore opens; check details","description":"Advik Capital's rights issue opened on September 24, 2024, allowing shareholders to buy new shares at  ₹2.50 each until October 4. The company aims to raise  ₹49.95 crore to expand operations, despite a recent stock decline of 2.3%.","content":"Penny stock Advik Capital was in the spotlight as the company's rights issue of equity shares opened on September 24, 2024. The rights issue, which remains open until October 4, 2024, offers shareholders the opportunity to increase their ownership by subscribing to newly issued shares at a discounted price. This move aims to raise capital and expand the company’s operations.As per a regulatory filing, Advik Capital is issuing 19.98 crore fully paid-up equity shares with a face value of Re 1 each. The total amount raised is expected to be  ₹49.95 crore, assuming full subscription after allotment.The issue price is set at  ₹2.50 per share, including a premium of  ₹1.50 per equity share. Shareholders can acquire additional shares at this lower rate, providing an opportunity to increase their stake at a discount compared to the market price.The entitlement ratio for the rights issue is 14:30, meaning shareholders will be eligible to receive 14 rights equity shares for every 30 fully paid-up shares they own. Following the rights issue, the total number of outstanding equity shares will increase to 62.79 crore.To participate, shareholders needed to hold equity shares as of September 12, 2024, which was set as the record date for determining eligibility.With the start of its rights issue, the stock declined as much as 2.3 per cent to its day's low of  ₹2.94. The stock is now over 28 per cent away from its 52-week high of  ₹4.10, reached in January 2024. However, it has rallied 51.5 per cent from its 52-week low of  ₹2.06, recorded in October last year.In terms of year-to-date performance, the stock has surged 40 per cent in 2024 and seen an overall gain of almost 16 per cent in the past year. The penny stock  gained over 11 perc ent in September following an over 8 per cent decline in August.Advik Capital Limited, established in 1985, operates as a non-deposit-taking non-banking financial company (NBFC) registered with the RBI. The company primarily focuses on investing funds, providing financial support through loans and advances to industrial enterprises, and engaging in leasing and financing lease operations for various types of plant and machinery.For the financial year ending March 31, 2024, Advik Capital reported a 40 per cent increase in revenue, although profit after tax (PAT) saw a decline of 32 per cent compared to the previous fiscal year ending March 31, 2023.Recently, the company announced its strategic entry into supply chain financing. This move aims to diversify its product offerings and provide crucial financial support to businesses across sectors such as agri-food, FMCG, FMCD, metals, and engineering goods. The initiative is designed to boost operational efficiency and drive sustainable growth within the targeted industry supply chains.As part of this effort, Advik Capital signed a Memorandum of Understanding (MoU) with a prominent agri-product FMCG company. While the partner's name remains undisclosed due to business confidentiality, the company assured stakeholders that this collaboration will form the foundation for expanding its supply chain financing model.","cleaned_content":"penny stock advik capital was in the spotlight as the companys rights issue of equity shares opened on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the rights issue which remains open until october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e offers shareholders the opportunity to increase their ownership by subscribing to newly issued shares at a discounted price this move aims to raise capital and expand the company s operations as per a regulatory filing advik capital is issuing \u003cONE_TEN\u003e crore fully paid up equity shares with a face value of re \u003cONE_\u003e each the total amount raised is expected to be \u003cFOUR_TEN\u003e crore assuming full subscription after allotment the issue price is set at \u003cTWO_\u003e per share including a premium of \u003cONE_\u003e per equity share shareholders can acquire additional shares at this lower rate providing an opportunity to increase their stake at a discount compared to the market price the entitlement ratio for the rights issue is \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e meaning shareholders will be eligible to receive \u003cONE_TEN\u003e rights equity shares for every \u003cTHREE_TEN\u003e fully paid up shares they own following the rights issue the total number of outstanding equity shares will increase to \u003cSIX_TEN\u003e crore to participate shareholders needed to hold equity shares as of september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e which was set as the record date for determining eligibility with the start of its rights issue the stock declined as much as \u003cTWO_PERCENT\u003e to its days low of \u003cTWO_\u003e the stock is now over \u003cTWO_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cFOUR_\u003e reached in january \u003cTWO_THOUSAND\u003e however it has rallied \u003cFIVE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTWO_\u003e recorded in october last year in terms of year to date performance the stock has surged \u003cFOUR_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and seen an overall gain of almost \u003cONE_TEN_PERCENT\u003e in the past year the penny stock gained over \u003cONE_TEN\u003e perc ent in september following an over \u003cEIGHT_PERCENT\u003e decline in august advik capital limited established in \u003cONE_THOUSAND\u003e operates as a non deposit taking non banking financial company nbfc registered with the rbi the company primarily focuses on investing funds providing financial support through loans and advances to industrial enterprises and engaging in leasing and financing lease operations for various types of plant and machinery for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e advik capital reported a \u003cFOUR_TEN_PERCENT\u003e increase in revenue although profit after tax pat saw a decline of \u003cTHREE_TEN_PERCENT\u003e compared to the previous fiscal year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e recently the company announced its strategic entry into supply chain financing this move aims to diversify its product offerings and provide crucial financial support to businesses across sectors such as agri food fmcg fmcd metals and engineering goods the initiative is designed to boost operational efficiency and drive sustainable growth within the targeted industry supply chains as part of this effort advik capital signed a memorandum of understanding mou with a prominent agri product fmcg company while the partners name remains undisclosed due to business confidentiality the company assured stakeholders that this collaboration will form the foundation for expanding its supply chain financing model","timestamp":"2024-09-24T13:46:00+05:30","market_timestamp":"2024-09-24T13:46:00+05:30","off_market_hours":false}