{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-vedanta-spicejet-sbi-piramal-pharma-shriram-finance-and-more-11727284864076.html","title":"Stocks to Watch: Vedanta, SpiceJet, SBI, Piramal Pharma, Shriram Finance and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Vedanta: Metals conglomerate Vedanta Ltd will review the possibility of declaring a fourth interim dividend for FY25 during a Board meeting scheduled for October 8, 2024. The company announced this on Wednesday, stating that the interim dividend, if approved, will be for equity shareholders. The record date for eligibility to receive the interim dividend has been set for October 16, 2024. The company further clarified in its statement that the Board will consider and potentially approve the dividend for the ongoing fiscal year during the upcoming meeting.SpiceJet: Societe Generale executed block deals involving shares of SpiceJet on Wednesday, selling shares worth  ₹47 crore. The French financial services giant offloaded over 83.56 lakh shares valued at  ₹52.5 crore while purchasing 9.4 lakh shares for  ₹5.87 crore. Overall, Societe Generale emerged as a net seller, divesting 74.15 lakh shares. The selling price was  ₹62.90 per share, while the buying price stood slightly lower at  ₹62.43 per share.State Bank of India: State Bank of India (SBI) has set an ambitious goal of becoming the first Indian financial institution to achieve a net profit of  ₹1 trillion within the next 3 to 5 years, according to Chairman C S Setty. With a standalone net profit of  ₹61,077 crore in FY24, representing a 21.59 per cent growth year-on-year, the bank is balancing strong profit growth with customer-centric operations. SBI is also eyeing a  ₹4 trillion credit pipeline from corporate clients, with a particular focus on infrastructure sectors.Piramal Pharma: Piramal Pharma has set an ambitious target to double its revenue to $2 billion by FY30, while also tripling its Ebitda, according to Chairperson Nandini Piramal. The company plans to maintain a net debt to Ebitda ratio of 1x by the same period. The Contract Development and Manufacturing Organization (CDMO) segment is expected to be a key driver of this growth, particularly due to rising demand and the potential impact of the US Biosecure Act.Shriram Finance: Shriram Finance has successfully raised $500 million through the issuance of fixed-rate senior secured social USD notes with a 6.15 per cent coupon. This marks the company’s first USD bond issuance in FY25, drawing strong interest from investors and achieving a subscription rate of 2.4x. The funds raised will primarily be used for sustainable, income-generating segments, particularly in vehicle financing and MSME lending.Bank of India: Bank of India has raised  ₹2,500 crore through tier-II bonds at a coupon rate of 7.49 per cent, following robust demand that resulted in bids exceeding  ₹6,000 crore. This move is part of the bank’s broader strategy to strengthen its capital adequacy ratio, which is expected to rise to 16 per cent. In the coming months, the bank plans to raise additional capital through tier-I and infrastructure bonds to further enhance its financial position.Biocon: Biocon Biologics, a subsidiary of Biocon, announced positive results from Phase-III clinical trials for its biosimilars of adalimumab and ustekinumab at the EADV Congress 2024. The results suggest that patients can safely switch between the biosimilars and the reference drugs, underscoring the potential for interchangeability. These outcomes could enhance patient access to treatment and contribute to reducing healthcare costs.KEC International: KEC International has launched its qualified institutional placement (QIP) of equity shares with an aim to raise  ₹4,500 crore. The QIP floor price has been set at  ₹976.64 per share. The company's board had initially approved this fundraising plan on July 26, 2024, with a special resolution passed at the annual general meeting on August 22, 2024. KEC International may offer a discount of up to 5 per cent on the floor price, as disclosed in an exchange filing.Delta Corp: Delta Corp’s board has approved a draft composite scheme of arrangement with Delta Penland, according to recent reports. This scheme includes the demerger of Delta Corp’s hospitality and real estate businesses. Under the plan, Delta Penland will issue one share of the newly demerged entity for each share held by Delta Corp shareholders.ASK Automotive: Promoter Kuldip Singh Rathee is set to offload a 6.05 per cent stake in ASK Automotive via an offer for sale (OFS) on September 26-27. The OFS includes a base issue of 5.5 per cent and an additional greenshoe option of 0.55 per cent. The sale will open for non-retail investors on September 26, followed by retail investors on September 27. The floor price for the OFS has been set at  ₹433 per share.Five Star Business Finance: According to sources from CNBC-TV18, Peak XV Partners and other private equity investors are likely to divest up to 20 per cent of their stake in Five Star Business Finance through a block deal. The block deal is expected to be worth approximately $500 million.Coromandel International: Coromandel International has increased its stake in Senegal-based Baobab Mining and Chemicals Corporation (BMCC) by acquiring an additional 8.82 per cent, bringing its total holding to 53.8 per cent. The company will invest $3.84 million ( ₹32 crore) in BMCC, along with an additional loan infusion of $6.5 million ( ₹54 crore) to support expansion projects and working capital needs.Coromandel International","cleaned_content":"vedanta metals conglomerate vedanta ltd will review the possibility of declaring a fourth interim dividend for fy25 during a board meeting scheduled for october \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e the company announced this on wednesday stating that the interim dividend if approved will be for equity shareholders the record date for eligibility to receive the interim dividend has been set for october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company further clarified in its statement that the board will consider and potentially approve the dividend for the ongoing fiscal year during the upcoming meeting spicejet societe generale executed block deals involving shares of spicejet on wednesday selling shares worth \u003cFOUR_TEN\u003e crore the french financial services giant offloaded over \u003cEIGHT_TEN\u003e lakh shares valued at \u003cFIVE_TEN\u003e crore while purchasing \u003cNINE_\u003e lakh shares for \u003cFIVE_\u003e crore overall societe generale emerged as a net seller divesting \u003cSEVEN_TEN\u003e lakh shares the selling price was \u003cSIX_TEN\u003e per share while the buying price stood slightly lower at \u003cSIX_TEN\u003e per share state bank of india state bank of india sbi has set an ambitious goal of becoming the first indian financial institution to achieve a net profit of \u003cONE_\u003e trillion within the next \u003cTHREE_\u003e to \u003cFIVE_\u003e years according to chairman c s setty with a standalone net profit of \u003cSIX_TEN_THOUSAND\u003e crore in fy24 representing a \u003cTWO_TEN_PERCENT\u003e growth year on year the bank is balancing strong profit growth with customer centric operations sbi is also eyeing a \u003cFOUR_\u003e trillion credit pipeline from corporate clients with a particular focus on infrastructure sectors piramal pharma piramal pharma has set an ambitious target to double its revenue to \u003cTWO_\u003e billion by fy30 while also tripling its ebitda according to chairperson nandini piramal the company plans to maintain a net debt to ebitda ratio of \u003cONE_\u003e x by the same period the contract development and manufacturing organization cdmo segment is expected to be a key driver of this growth particularly due to rising demand and the potential impact of the us biosecure act shriram finance shriram finance has successfully raised \u003cFIVE_HUNDRED\u003e million through the issuance of fixed rate senior secured social usd notes with a \u003cSIX_PERCENT\u003e coupon this marks the company s first usd bond issuance in fy25 drawing strong interest from investors and achieving a subscription rate of \u003cTWO_\u003e x the funds raised will primarily be used for sustainable income generating segments particularly in vehicle financing and msme lending bank of india bank of india has raised \u003cTWO_THOUSAND\u003e crore through tier ii bonds at a coupon rate of \u003cSEVEN_PERCENT\u003e following robust demand that resulted in bids exceeding \u003cSIX_THOUSAND\u003e crore this move is part of the bank s broader strategy to strengthen its capital adequacy ratio which is expected to rise to \u003cONE_TEN_PERCENT\u003e in the coming months the bank plans to raise additional capital through tier i and infrastructure bonds to further enhance its financial position biocon biocon biologics a subsidiary of biocon announced positive results from phase iii clinical trials for its biosimilars of adalimumab and ustekinumab at the eadv congress \u003cTWO_THOUSAND\u003e the results suggest that patients can safely switch between the biosimilars and the reference drugs underscoring the potential for interchangeability these outcomes could enhance patient access to treatment and contribute to reducing healthcare costs kec international kec international has launched its qualified institutional placement qip of equity shares with an aim to raise \u003cFOUR_THOUSAND\u003e crore the qip floor price has been set at \u003cNINE_HUNDRED\u003e per share the companys board had initially approved this fundraising plan on july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e with a special resolution passed at the annual general meeting on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e kec international may offer a discount of up to \u003cFIVE_PERCENT\u003e on the floor price as disclosed in an exchange filing delta corp delta corp s board has approved a draft composite scheme of arrangement with delta penland according to recent reports this scheme includes the demerger of delta corp s hospitality and real estate businesses under the plan delta penland will issue one share of the newly demerged entity for each share held by delta corp shareholders ask automotive promoter kuldip singh rathee is set to offload a \u003cSIX_PERCENT\u003e stake in ask automotive via an offer for sale ofs on september \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e the ofs includes a base issue of \u003cFIVE_PERCENT\u003e and an additional greenshoe option of \u003cZERO_PERCENT\u003e the sale will open for non retail investors on september \u003cTWO_TEN\u003e followed by retail investors on september \u003cTWO_TEN\u003e the floor price for the ofs has been set at \u003cFOUR_HUNDRED\u003e per share five star business finance according to sources from cnbc tv18 peak xv partners and other private equity investors are likely to divest up to \u003cTWO_TEN_PERCENT\u003e of their stake in five star business finance through a block deal the block deal is expected to be worth approximately \u003cFIVE_HUNDRED\u003e million coromandel international coromandel international has increased its stake in senegal based baobab mining and chemicals corporation bmcc by acquiring an additional \u003cEIGHT_PERCENT\u003e bringing its total holding to \u003cFIVE_TEN_PERCENT\u003e the company will invest \u003cTHREE_\u003e million \u003cTHREE_TEN\u003e crore in bmcc along with an additional loan infusion of \u003cSIX_\u003e million \u003cFIVE_TEN\u003e crore to support expansion projects and working capital needs coromandel international","timestamp":"2024-09-26T08:27:00+05:30","market_timestamp":"2024-09-26T09:15:00+05:30","off_market_hours":true}