{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-sagar-doshi-of-nuvama-recommends-buying-vedanta-sirca-paints-adani-enterprises-on-october-3-11727800711902.html","title":"Stocks to buy or sell: Sagar Doshi of Nuvama recommends buying Vedanta, Sirca Paints, Adani Enterprises tomorrow","description":"Stocks to buy or sell: Sagar Doshi of Nuvama Professional Clients Group recommends buying these three stocks tomorrow - Vedanta Ltd, Sirca Paints India Ltd, and Adani Enterprises Ltd.","content":"Stock Market News: On Tuesday, the domestic benchmark indices Sensex and Nifty 50 remained relatively stable but closed the session slightly lower due to ongoing profit booking. The Nifty 50 index declined by 0.05% to 25,796.9, while the Sensex finished 0.04% lower at 84,266.29.September witnessed a 2.3% surge in the Nifty 50, making it the fourth straight month of gains and hitting all-time highs. This was fuelled by a substantial US rate cut, which raised hopes of increased foreign investments in India. Nevertheless, the lack of significant local triggers led some investors to offload the rally in the last two days.The Nifty Midcap and Small-cap indices closed above the marked levels, suggesting that a lack of momentum doesn't indicate an imminent market crash. The focus is now on the upcoming release of US non-farm payroll data on Friday, October 4th.According to Vinod Nair, Head of Research at Geojit Financial Services, funds is shifting from expensive markets like India to cheaper Chinese equities as a result of the Chinese central bank's recent stimulus measures. The market is eagerly anticipating the next RBI policy meeting and Q2 results to gain more understanding of the market's direction.Nifty 50 closed nearly 400 pts in red on the calendar monthly / quarterly closing for September 2024 after the index struggled to reclaim 26,230 in the opening trade on Monday. Nifty 50 is likely to slide further towards 25,600/25,450 before it could find any initial support on the downside while any rallies towards 25,900 are likely to get sold into with 26,000 now acting as resistance on the upside.Bank Nifty has been underperforming Nifty 50 with a -1.7% cut compared to a -1.45% on Nifty after the Bank Nifty v/s Nifty 50 ratio chart showed signs of reversal in Friday's closing. For the past 3 consecutive trading days, index is closing below its previous day’s low indicating inherit selling pressure in the frontline names. Further downside is likely to get extended towards 52,200 while any rallies towards 53,250 are likely to get sold into in this truncated week ahead.On stocks to buy on Thursday, Sagar Doshi of Nuvama recommended three stocks - Vedanta Ltd, Sirca Paints India Ltd, and Adani Enterprises Ltd.With metals continue to remain in focus backed by favourable macro environment, Vedanta Ltd continues to remain a highlight on charts as the stock once again has ended at fresh all time highs after ending its 4 - month consolidation in last week’s trade. For the past 10-12 weeks the stock has also been witnessing a higher low formation indicating that there have been dip buyers along the consolidation. Stock can rally another 9-12% from CMP given the end of consolidation in this breakout.On daily charts, stock has crossed above its 200 DMA and has been consolidation as it awaits a trendline breakout on its weekly charts above 361. With cooldown on crude, a push higher is likely to unfold which can allow 361 to be taken outs. For the past 6 months now Sirca Paints has also been witnessing a higher low formation indicating that there have been dip buyers along the consolidation. These dips have also witnessed notable surge in volumes. Stock can rally another 10-12% from CMP given the end of consolidation in this breakout.Stock has closed at a 4 week high reclaiming back above its 200 DMA which is a positive sign on the structure. A double bottom formation was seen sub 2900 levels on daily charts while. Momentum is now set to pick up further as stock has given a short term trendline breakout above 3140. A quick 6-9% rally is likely to unfold on the stock given the formation on charts.","cleaned_content":"stock market news on tuesday the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e remained relatively stable but closed the session slightly lower due to ongoing profit booking the nifty \u003cFIVE_TEN\u003e index declined by \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e while the sensex finished \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e september witnessed a \u003cTWO_PERCENT\u003e surge in the nifty \u003cFIVE_TEN\u003e making it the fourth straight month of gains and hitting all time highs this was fuelled by a substantial us rate cut which raised hopes of increased foreign investments in india nevertheless the lack of significant local triggers led some investors to offload the rally in the last two days the nifty midcap and small cap indices closed above the marked levels suggesting that a lack of momentum doesnt indicate an imminent market crash the focus is now on the upcoming release of us non farm payroll data on friday october \u003cFOUR_\u003e th according to vinod nair head of research at geojit financial services funds is shifting from expensive markets like india to cheaper chinese equities as a result of the chinese central banks recent stimulus measures the market is eagerly anticipating the next rbi policy meeting and q2 results to gain more understanding of the markets direction nifty \u003cFIVE_TEN\u003e closed nearly \u003cFOUR_HUNDRED\u003e pts in red on the calendar monthly quarterly closing for september \u003cTWO_THOUSAND\u003e after the index struggled to reclaim \u003cTWO_TEN_THOUSAND\u003e in the opening trade on monday nifty \u003cFIVE_TEN\u003e is likely to slide further towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e before it could find any initial support on the downside while any rallies towards \u003cTWO_TEN_THOUSAND\u003e are likely to get sold into with \u003cTWO_TEN_THOUSAND\u003e now acting as resistance on the upside bank nifty has been underperforming nifty \u003cFIVE_TEN\u003e with a \u003cONE_PERCENT\u003e cut compared to a \u003cONE_PERCENT\u003e on nifty after the bank nifty v s nifty \u003cFIVE_TEN\u003e ratio chart showed signs of reversal in fridays closing for the past \u003cTHREE_\u003e consecutive trading days index is closing below its previous day s low indicating inherit selling pressure in the frontline names further downside is likely to get extended towards \u003cFIVE_TEN_THOUSAND\u003e while any rallies towards \u003cFIVE_TEN_THOUSAND\u003e are likely to get sold into in this truncated week ahead on stocks to buy on thursday sagar doshi of nuvama recommended three stocks vedanta ltd sirca paints india ltd and adani enterprises ltd with metals continue to remain in focus backed by favourable macro environment vedanta ltd continues to remain a highlight on charts as the stock once again has ended at fresh all time highs after ending its \u003cFOUR_\u003e month consolidation in last week s trade for the past \u003cONE_TEN\u003e \u003cONE_TEN\u003e weeks the stock has also been witnessing a higher low formation indicating that there have been dip buyers along the consolidation stock can rally another \u003cNINE_\u003e \u003cONE_TEN_PERCENT\u003e from cmp given the end of consolidation in this breakout on daily charts stock has crossed above its \u003cTWO_HUNDRED\u003e dma and has been consolidation as it awaits a trendline breakout on its weekly charts above \u003cTHREE_HUNDRED\u003e with cooldown on crude a push higher is likely to unfold which can allow \u003cTHREE_HUNDRED\u003e to be taken outs for the past \u003cSIX_\u003e months now sirca paints has also been witnessing a higher low formation indicating that there have been dip buyers along the consolidation these dips have also witnessed notable surge in volumes stock can rally another \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e from cmp given the end of consolidation in this breakout stock has closed at a \u003cFOUR_\u003e week high reclaiming back above its \u003cTWO_HUNDRED\u003e dma which is a positive sign on the structure a double bottom formation was seen sub \u003cTWO_THOUSAND\u003e levels on daily charts while momentum is now set to pick up further as stock has given a short term trendline breakout above \u003cTHREE_THOUSAND\u003e a quick \u003cSIX_\u003e \u003cNINE_PERCENT\u003e rally is likely to unfold on the stock given the formation on charts","timestamp":"2024-10-02T08:29:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}