{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-sbi-tata-motors-acc-among-six-october-stock-picks-by-deven-choksey-11727933906241.html","title":"Stocks to buy: SBI, Tata Motors, ACC, among six October stock picks by Deven Choksey","description":"DRChoksey FinServ has recommended six stocks to buy this month which it projects to have the upside potential of up to 28%. Check out the list of October stock picks here:","content":"Indian stock market commenced October on a subdued note, with benchmark indices Sensex and Nifty 50 declining approximately 1.5% during the first two trading sessions of the month. The stock market witnessed a sharp downturn on Thursday, driven by weak global cues, as escalating tensions in the Middle East, particularly the Israel-Iran conflict, weighed heavily on investor sentiment.DRChoksey FinServ has recommended six stocks to buy this month which it projects can have an upside potential of up to 28%.The October stock picks by Deven Choksey Research include ACC, Glenmark Pharma, Godrej Consumer Products, Rossari Biotech, State Bank of India (SBI) and Tata Motors.Here are the top stocks to buy in October:Deven Choksey Research expects ACC to report revenue, EBITDA and PAT CAGR of 8.8%, 15.1% and 8.4%, respectively over FY24 to FY26E. The brokerage firm maintains its multiple of 13.0x to FY26E EBITDA of  ₹40,527 crore to arrive at a target price of  ₹2,923 per share. It has a ‘Buy’ rating on ACC shares.The brokerage firm has a ‘Buy’ call on Glenmark Pharmaceuticals shares with a target price of  ₹1,894 apiece. It expects the company’s revenue to grow at 10.0% CAGR and Adj. PAT to grow at 42.5% CAGR over FY23-FY26E.Currently, Glenmark Pharma stock is trading at PE multiples of 35.1x/27.1x based on FY25E/FY26E EPS, respectively. We assign a PE multiple of 31.0x on FY26E EPS of  ₹61.1 to arrive at a target price of  ₹1,894, Deven Choksey Research said.Godrej Consumer Products is implementing a growth-focused strategy that involves pursuing acquisitions, cross-selling, entering new categories, and expanding its Total Addressable Market (TAM) for current products. The company has boosted reinvestments, particularly increasing marketing spend by 36% YoY in FY24. Strategic initiatives, such as enhancing inventory management in RCCL and Indonesia, along with divesting non-core businesses, aim to stabilize performance and enhance earnings growth, said the brokerage firm.It estimates Revenue, EBITDA and PAT CAGR of 10.1%, 14% and 18.5%, respectively, from FY24 to FY26E. It has an ‘Accumulate’ rating on Godrej Consumer Products shares and a target price of  ₹1,541 apiece.Deven Choksey Research estimates Rossari Biotech’s revenue to grow at 20.3% CAGR and PAT to grow at 22.7% CAGR over FY24-FY26E. Rossari Biotech stock is trading at a PE multiple of 31.6/25.5x based on FY25E/FY26E EPS, respectively. The brokerage firm assigned a PE multiple of 29x on FY26E EPS of  ₹35.7 to arrive at a target price of  ₹1,034 per share and has a ‘Buy’ rating on the stock.SBI continued its positive trend in terms of return ratios, achieving a 21.0% Return on Equity (RoE) and a 1.1% Return on Assets (RoA) on an annualized basis in Q1FY25. ROA has continuously improved from FY19 onwards, primarily led by the surge in overall profitability. SBI’s capital position remains healthy for future growth opportunities, and the bank is prepared to raise additional capital if needed, Deven Choksey Research said.It values the bank at 1.5x FY26E P/ABV on an ABV of  ₹520.6 per share and assigns the subsidiaries a value of  ₹231 per share. It maintained SBI share price target of  ₹1,010 apiece with a ‘Buy’ rating on the stock.The brokerage firm expects an EV/EBITDA multiple for JLR at 3.2x FY26E EBITDA and values the Chery-JLR JV at 2.4x EV/EBITDA, Tata Motors-CV at 14.0x, and Tata Motors-PV at 16.0x, reflecting steady prospects. With positive outlooks for CV and JLR, it set a target price of  ₹1,156 for Tata Motors shares, including  ₹42 for Tata Technologies. It has an ‘Accumulate’ rating on Tata Motors stock.","cleaned_content":"indian stock market commenced october on a subdued note with benchmark indices sensex and nifty \u003cFIVE_TEN\u003e declining approximately \u003cONE_PERCENT\u003e during the first two trading sessions of the month the stock market witnessed a sharp downturn on thursday driven by weak global cues as escalating tensions in the middle east particularly the israel iran conflict weighed heavily on investor sentiment drchoksey finserv has recommended six stocks to buy this month which it projects can have an upside potential of up to \u003cTWO_TEN_PERCENT\u003e the october stock picks by deven choksey research include acc glenmark pharma godrej consumer products rossari biotech state bank of india sbi and tata motors here are the top stocks to buy in october deven choksey research expects acc to report revenue ebitda and pat cagr of \u003cEIGHT_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cEIGHT_PERCENT\u003e respectively over fy24 to fy26e the brokerage firm maintains its multiple of \u003cONE_TEN\u003e x to fy26e ebitda of \u003cFOUR_TEN_THOUSAND\u003e crore to arrive at a target price of \u003cTWO_THOUSAND\u003e per share it has a buy rating on acc shares the brokerage firm has a buy call on glenmark pharmaceuticals shares with a target price of \u003cONE_THOUSAND\u003e apiece it expects the company s revenue to grow at \u003cONE_TEN_PERCENT\u003e cagr and adj pat to grow at \u003cFOUR_TEN_PERCENT\u003e cagr over fy23 fy26e currently glenmark pharma stock is trading at pe multiples of \u003cTHREE_TEN\u003e x \u003cTWO_TEN\u003e x based on fy25e fy26e eps respectively we assign a pe multiple of \u003cTHREE_TEN\u003e x on fy26e eps of \u003cSIX_TEN\u003e to arrive at a target price of \u003cONE_THOUSAND\u003e deven choksey research said godrej consumer products is implementing a growth focused strategy that involves pursuing acquisitions cross selling entering new categories and expanding its total addressable market tam for current products the company has boosted reinvestments particularly increasing marketing spend by \u003cTHREE_TEN_PERCENT\u003e yoy in fy24 strategic initiatives such as enhancing inventory management in rccl and indonesia along with divesting non core businesses aim to stabilize performance and enhance earnings growth said the brokerage firm it estimates revenue ebitda and pat cagr of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively from fy24 to fy26e it has an accumulate rating on godrej consumer products shares and a target price of \u003cONE_THOUSAND\u003e apiece deven choksey research estimates rossari biotech s revenue to grow at \u003cTWO_TEN_PERCENT\u003e cagr and pat to grow at \u003cTWO_TEN_PERCENT\u003e cagr over fy24 fy26e rossari biotech stock is trading at a pe multiple of \u003cTHREE_TEN\u003e \u003cTWO_TEN\u003e x based on fy25e fy26e eps respectively the brokerage firm assigned a pe multiple of \u003cTWO_TEN\u003e x on fy26e eps of \u003cTHREE_TEN\u003e to arrive at a target price of \u003cONE_THOUSAND\u003e per share and has a buy rating on the stock sbi continued its positive trend in terms of return ratios achieving a \u003cTWO_TEN_PERCENT\u003e return on equity roe and a \u003cONE_PERCENT\u003e return on assets roa on an annualized basis in q1fy25 roa has continuously improved from fy19 onwards primarily led by the surge in overall profitability sbi s capital position remains healthy for future growth opportunities and the bank is prepared to raise additional capital if needed deven choksey research said it values the bank at \u003cONE_\u003e x fy26e p abv on an abv of \u003cFIVE_HUNDRED\u003e per share and assigns the subsidiaries a value of \u003cTWO_HUNDRED\u003e per share it maintained sbi share price target of \u003cONE_THOUSAND\u003e apiece with a buy rating on the stock the brokerage firm expects an ev ebitda multiple for jlr at \u003cTHREE_\u003e x fy26e ebitda and values the chery jlr jv at \u003cTWO_\u003e x ev ebitda tata motors cv at \u003cONE_TEN\u003e x and tata motors pv at \u003cONE_TEN\u003e x reflecting steady prospects with positive outlooks for cv and jlr it set a target price of \u003cONE_THOUSAND\u003e for tata motors shares including \u003cFOUR_TEN\u003e for tata technologies it has an accumulate rating on tata motors stock","timestamp":"2024-10-03T11:23:00+05:30","market_timestamp":"2024-10-03T11:23:00+05:30","off_market_hours":false}