{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-27-11727400760480.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 27","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 26,340 level, a premium of nearly 30 points from the Nifty futures’ previous close.","content":"Indian stock market benchmark indices, Sensex and Nifty 50, are likely to open higher on Friday tracking positive sentiment in global markets.The trends on Gift Nifty also indicate a positive start for the Indian benchmark index. The Gift Nifty was trading around 26,340 level, a premium of nearly 30 points from the Nifty futures’ previous close.On Thursday, the domestic equity benchmark indices ended higher with the Nifty 50 closing above 26,200 level.The Sensex surged 666.25 points, or 0.78%, to close at 85,836.12, while the Nifty 50 settled 211.90 points, or 0.81%, higher at 26,216.05.Nifty 50 formed a long bull candle on the daily chart, which is indicating a decisive upside breakout of the small range movement at 26,000 levels.“The positive chart pattern like higher highs and lows is observed on the daily chart and the market is displaying a strong upside momentum without showing any reasonable downward correction in between,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.He believes the underlying trend of Nifty 50 remains positive and having reached an upside target of 26,250 levels (1.618% Fibonacci Extension) on Thursday, the Nifty 50 could now move up towards another upside levels of 26,900 (1.786% Fibonacci Extension) by the next couple of weeks.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty shifted into a sustainable upside breakout on September 26, the F\u0026O expiry day, and closed the day higher by 211 points above the 26,200 level.“The Nifty has broken out of consolidation on the daily timeframe, indicating increasing bullish momentum. The sentiment is expected to stay positive as the index closed above a key moving average. A drop below 26,000 might disrupt the current bullish trend, but until then, the strength is likely to persist in the index,” said Rupak De, Senior Technical Analyst, LKP Securities.According to Dr. Praveen Dwarakanath, Vice President of Hedged.in, Nifty 50 has given a breakout above the psychological level of 26,000 and is also walking on the Upper Bollinger band, a strong sign of bullishness.“Thursday’s upside move can also be due to the short covering in the sold calls of yesterday’s expiry. The Options writer data for October expiry shows increased put writing at 26,000 levels, indicating a further rally from the current levels. Immediate support for Nifty is now at 26,000 levels, while Nifty can test 26,500 levels soon,” Dwarakanath said.Bank Nifty index rallied 273.70 points, or 0.51%, to close at 54,375.35 on Thursday, forming a bullish candlestick pattern on the daily charts.“Bank Nifty is closing above its all-time high level, technically a sign of bullishness. A break above yesterday’s high of 54,467, can trigger 55,000 levels soon. Although the stochastics have yet to form a negative divergence, a break above 54,467 can negate this while a new negative divergence can be formed at higher levels. Immediate support for the index continues to be at the 53,700 level,” said Dwarakanath.Options writer data for the present week’s expiry shows increased put writing at 54,500 and below levels, indicating continued bullishness in the index, he added.","cleaned_content":"indian stock market benchmark indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on friday tracking positive sentiment in global markets the trends on gift nifty also indicate a positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cTHREE_TEN\u003e points from the nifty futures previous close on thursday the domestic equity benchmark indices ended higher with the nifty \u003cFIVE_TEN\u003e closing above \u003cTWO_TEN_THOUSAND\u003e level the sensex surged \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a long bull candle on the daily chart which is indicating a decisive upside breakout of the small range movement at \u003cTWO_TEN_THOUSAND\u003e levels the positive chart pattern like higher highs and lows is observed on the daily chart and the market is displaying a strong upside momentum without showing any reasonable downward correction in between said nagaraj shetti senior technical research analyst at hdfc securities he believes the underlying trend of nifty \u003cFIVE_TEN\u003e remains positive and having reached an upside target of \u003cTWO_TEN_THOUSAND\u003e levels \u003cONE_PERCENT\u003e fibonacci extension on thursday the nifty \u003cFIVE_TEN\u003e could now move up towards another upside levels of \u003cTWO_TEN_THOUSAND\u003e \u003cONE_PERCENT\u003e fibonacci extension by the next couple of weeks here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty shifted into a sustainable upside breakout on september \u003cTWO_TEN\u003e the f o expiry day and closed the day higher by \u003cTWO_HUNDRED\u003e points above the \u003cTWO_TEN_THOUSAND\u003e level the nifty has broken out of consolidation on the daily timeframe indicating increasing bullish momentum the sentiment is expected to stay positive as the index closed above a key moving average a drop below \u003cTWO_TEN_THOUSAND\u003e might disrupt the current bullish trend but until then the strength is likely to persist in the index said rupak de senior technical analyst lkp securities according to dr praveen dwarakanath vice president of hedged in nifty \u003cFIVE_TEN\u003e has given a breakout above the psychological level of \u003cTWO_TEN_THOUSAND\u003e and is also walking on the upper bollinger band a strong sign of bullishness thursday s upside move can also be due to the short covering in the sold calls of yesterday s expiry the options writer data for october expiry shows increased put writing at \u003cTWO_TEN_THOUSAND\u003e levels indicating a further rally from the current levels immediate support for nifty is now at \u003cTWO_TEN_THOUSAND\u003e levels while nifty can test \u003cTWO_TEN_THOUSAND\u003e levels soon dwarakanath said bank nifty index rallied \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to close at \u003cFIVE_TEN_THOUSAND\u003e on thursday forming a bullish candlestick pattern on the daily charts bank nifty is closing above its all time high level technically a sign of bullishness a break above yesterday s high of \u003cFIVE_TEN_THOUSAND\u003e can trigger \u003cFIVE_TEN_THOUSAND\u003e levels soon although the stochastics have yet to form a negative divergence a break above \u003cFIVE_TEN_THOUSAND\u003e can negate this while a new negative divergence can be formed at higher levels immediate support for the index continues to be at the \u003cFIVE_TEN_THOUSAND\u003e level said dwarakanath options writer data for the present week s expiry shows increased put writing at \u003cFIVE_TEN_THOUSAND\u003e and below levels indicating continued bullishness in the index he added","timestamp":"2024-09-27T07:26:00+05:30","market_timestamp":"2024-09-27T09:15:00+05:30","off_market_hours":true}