{"url":"https://www.livemint.com/market/stock-market-news/mcx-share-price-hits-record-high-on-f-o-transaction-fees-revision-should-you-buy-11727246335986.html","title":"MCX share price hits record high on F\u0026O transaction fees revision. Should you buy?","description":"MCX share price has given stellar returns to investors this year. MCX stock has risen over 21% in one month and more than 50% in three months. MCX shares are up over 86% year-to-date (YTD) and have delivered multibagger returns of over 210% in one year.","content":"Multi Commodity Exchange of India (MCX) share price rose over 2% to a 52-week high on Wednesday after the company announced a revision in transaction fees for both futures and options (F\u0026O) contracts. MCX shares gained as much as 2.70% to a fresh high of  ₹6,037.05 apiece on the BSE.According to the updated fee structure, MCX will levy a fixed charge of  ₹2.10 per lakh of turnover for futures contracts and  ₹41.80 per lakh of premium turnover for options contracts. The applicable transaction fees for Futures and Options contracts with effect from October 01, 2024, MCX said.The country’s largest commodity exchange, MCX has moved from a tiered fee system to fixed transaction fee structure following the directive of the Securities and Exchange Board of India (Sebi).The change is in line with the Sebi’s True to Label principle, i.e. the fees levied on the end client by exchange members shall not exceed the amount charged by the exchange to the member.Brokerage firm Morgan Stanley expects the hike in MCX transaction fees to lead to a 5% increase in earnings per share (EPS) for FY26 for the company, assuming that other relevant factors remain constant.MCX share price has given stellar returns to investors this year. MCX stock has risen over 21% in one month and more than 50% in three months. MCX shares are up over 86% year-to-date (YTD) and have delivered multibagger returns of over 210% in one year.“The trend in MCX shares is bullish and we expect the upward momentum in the stock to continue as all technical indicators are bullish. Sectoral tailwinds will also support the upmove in MCX shares,” said Rajesh Palviya, SVP - Technical and Derivatives Research, Axis Securities.Palviya suggests a ‘buy on dips’ strategy for MCX shares as according to him, the stock price charts suggest no weakness.“Short-term traders can buy MCX shares around  ₹5,750 - 5,800 levels, keeping a stop loss at  ₹5,650. If MCX stock crosses  ₹5,960 level, it could potentially reach a target of  ₹6,200 - 6,300 levels,” Palvia said.At 12:20 pm, MCX shares were trading 0.39% higher at  ₹5,901.00 apiece on the BSE.","cleaned_content":"multi commodity exchange of india mcx share price rose over \u003cTWO_PERCENT\u003e to a \u003cFIVE_TEN\u003e week high on wednesday after the company announced a revision in transaction fees for both futures and options f o contracts mcx shares gained as much as \u003cTWO_PERCENT\u003e to a fresh high of \u003cSIX_THOUSAND\u003e apiece on the bse according to the updated fee structure mcx will levy a fixed charge of \u003cTWO_\u003e per lakh of turnover for futures contracts and \u003cFOUR_TEN\u003e per lakh of premium turnover for options contracts the applicable transaction fees for futures and options contracts with effect from october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e mcx said the country s largest commodity exchange mcx has moved from a tiered fee system to fixed transaction fee structure following the directive of the securities and exchange board of india sebi the change is in line with the sebi s true to label principle i e the fees levied on the end client by exchange members shall not exceed the amount charged by the exchange to the member brokerage firm morgan stanley expects the hike in mcx transaction fees to lead to a \u003cFIVE_PERCENT\u003e increase in earnings per share eps for fy26 for the company assuming that other relevant factors remain constant mcx share price has given stellar returns to investors this year mcx stock has risen over \u003cTWO_TEN_PERCENT\u003e in one month and more than \u003cFIVE_TEN_PERCENT\u003e in three months mcx shares are up over \u003cEIGHT_TEN_PERCENT\u003e year to date ytd and have delivered multibagger returns of over \u003cTWO_HUNDRED_PERCENT\u003e in one year the trend in mcx shares is bullish and we expect the upward momentum in the stock to continue as all technical indicators are bullish sectoral tailwinds will also support the upmove in mcx shares said rajesh palviya svp technical and derivatives research axis securities palviya suggests a buy on dips strategy for mcx shares as according to him the stock price charts suggest no weakness short term traders can buy mcx shares around \u003cFIVE_THOUSAND\u003e \u003cFIVE_THOUSAND\u003e levels keeping a stop loss at \u003cFIVE_THOUSAND\u003e if mcx stock crosses \u003cFIVE_THOUSAND\u003e level it could potentially reach a target of \u003cSIX_THOUSAND\u003e \u003cSIX_THOUSAND\u003e levels palvia said at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e pm mcx shares were trading \u003cZERO_PERCENT\u003e higher at \u003cFIVE_THOUSAND\u003e apiece on the bse","timestamp":"2024-09-25T12:22:00+05:30","market_timestamp":"2024-09-25T12:22:00+05:30","off_market_hours":false}