{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-reliance-infra-to-prism-johnson-sumeet-bagadia-recommends-five-shares-to-buy-today-11727057339343.html","title":"Breakout stocks to buy or sell: Reliance Infra to Prism Johnson — Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Marksans Pharma, Concord Biotech, Magadh Sugar, Prism Johnson, and Reliance Infra","content":"Breakout stocks to buy or sell: Following gains in the US and Asian stock markets, the Indian stock market ended at a record closing high on Friday last week. The Nifty 50 index finished 375 points higher at the 25,790 mark, the BSE Sensex shot up 1,359 points and closed at 84,544, whereas the Bank Nifty index ended 755 points higher at 53,793. Cash market volumes on the NSE were 43% higher than the previous session, aided by FTSE rebalancing volumes. Broad market indices rose less than the Nifty even as the advance-decline ratio rose sharply to 2.08:1.Sumeet Bagadia, Executive Director at Choice Broking, believes that overall Indian stock market bias has turned bullish after the Nifty 50 index climbed to a new peak on Friday. The Choice Broking expert said that sentiments might improve further if the 50-stock index is above the 25,800 mark for a few hours on Monday next week. Bagadia said that the frontline index sustaining above the 25,800 mark would mean a fresh target of 26,300 to 26,500. Bagadia recommended a stock-specific approach for intraday trading and suggested looking at breakout stocks.Speaking on the outlook of the Indian stock market today, Sumeet Bagadia said, \"The nifty 50 index breached above the crucial 25,800 barrier on Friday, and the first few hours on Monday would be crucial. If the 50-stock index manages to sustain above 25,800 in the Opening Bell, we can expect the frontline index to climb up to the 26,300 mark. So, it is better to maintain a stock-specific approach and looking at breakout stocks can be a good idea for intraday trading.\"Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: Marksans Pharma, Concord Biotech, Magadh Sugar, Prism Johnson, and Reliance Infra.1] Marksans Pharma: Buy at  ₹318.35, target  ₹336, stop loss  ₹307;2] Concord Biotech: Buy at  ₹2601.10, target  ₹2750, stop loss  ₹2515;3] Magadh Sugar: Buy at  ₹957.45, target  ₹1010, stop loss  ₹920;4] Prism Johnson: Buy at  ₹219.45, target  ₹233, stop loss  ₹211;5] Reliance Infra: Buy at  ₹316.30, target  ₹335, stop loss  ₹305.","cleaned_content":"breakout stocks to buy or sell following gains in the us and asian stock markets the indian stock market ended at a record closing high on friday last week the nifty \u003cFIVE_TEN\u003e index finished \u003cTHREE_HUNDRED\u003e points higher at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex shot up \u003cONE_THOUSAND\u003e points and closed at \u003cEIGHT_TEN_THOUSAND\u003e whereas the bank nifty index ended \u003cSEVEN_HUNDRED\u003e points higher at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were \u003cFOUR_TEN_PERCENT\u003e higher than the previous session aided by ftse rebalancing volumes broad market indices rose less than the nifty even as the advance decline ratio rose sharply to \u003cTWO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes that overall indian stock market bias has turned bullish after the nifty \u003cFIVE_TEN\u003e index climbed to a new peak on friday the choice broking expert said that sentiments might improve further if the \u003cFIVE_TEN\u003e stock index is above the \u003cTWO_TEN_THOUSAND\u003e mark for a few hours on monday next week bagadia said that the frontline index sustaining above the \u003cTWO_TEN_THOUSAND\u003e mark would mean a fresh target of \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e bagadia recommended a stock specific approach for intraday trading and suggested looking at breakout stocks speaking on the outlook of the indian stock market today sumeet bagadia said the nifty \u003cFIVE_TEN\u003e index breached above the crucial \u003cTWO_TEN_THOUSAND\u003e barrier on friday and the first few hours on monday would be crucial if the \u003cFIVE_TEN\u003e stock index manages to sustain above \u003cTWO_TEN_THOUSAND\u003e in the opening bell we can expect the frontline index to climb up to the \u003cTWO_TEN_THOUSAND\u003e mark so it is better to maintain a stock specific approach and looking at breakout stocks can be a good idea for intraday trading regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares marksans pharma concord biotech magadh sugar prism johnson and reliance infra 1 marksans pharma buy at \u003cTHREE_HUNDRED\u003e target \u003cTHREE_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e \u003cTWO_\u003e concord biotech buy at \u003cTWO_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e \u003cTHREE_\u003e magadh sugar buy at \u003cNINE_HUNDRED\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cNINE_HUNDRED\u003e \u003cFOUR_\u003e prism johnson buy at \u003cTWO_HUNDRED\u003e target \u003cTWO_HUNDRED\u003e stop loss \u003cTWO_HUNDRED\u003e \u003cFIVE_\u003e reliance infra buy at \u003cTHREE_HUNDRED\u003e target \u003cTHREE_HUNDRED\u003e stop loss \u003cTHREE_HUNDRED\u003e","timestamp":"2024-09-23T07:52:00+05:30","market_timestamp":"2024-09-23T09:15:00+05:30","off_market_hours":true}