{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-september-30-11727628279244.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — September 30","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy today — ONGC, NLC India, and Bharat Dynamics","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, both closed lower after reaching new record highs in the early trading session on Friday. The domestic indices could not sustain the highs, as investors' profit booking drove them to close lower. The day's rally was fueled by metals and financial stocks, which are witnessing significant buying amid improving domestic and global indicators.The Nifty 50 closed 0.14 per cent lower at 26,178.95 points, down from 26,216.05 in the previous session. The BSE Sensex closed 0.31 per cent lower at 85,571.85 points, compared to 85,836.12 points at Friday's market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty 50 has continued to make new highs while maintaining a strong uptrend with the upcoming target of 26,900 level visible. With the performance of the frontline stocks, we expect Nifty to achieve this target in the coming days. Parekh estimates the Nifty 50 Spot index to find support at 26,000 points and face resistance at 26,350 points. The Bank Nifty index will likely move in a range of 53,500 to 54,300 today.For today, Parekh recommended three buy-or-sell stocks: Oil and Natural Gas Corporation Ltd, NLC India Ltd, and Bharat Dynamics Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty continue to make new highs maintaining the strong uptrend with next target of 26,900 level visible and along with frontline stocks performing, we can anticipate to achieve this target in the coming days.”“The index would have the 25800 zone as the near-term important support which needs to be sustained to maintain the trend intact,” said the stock market expert.“Bank Nifty after the decent rally has witnessed some consolidation near the 54,000 levels with near-term support maintained near 53,400 zone of the previous peak level and would need a decisive breach above 54,470 levels to continue with the uptrend,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 26,000 points, while the resistance lies at 26,350 points. The Bank Nifty index would have a daily range of 53,500 to 54,300.1. Oil and Natural Gas Corporation Ltd. (ONGC): Buy at  ₹297; Target at  ₹315; Stop Loss at  ₹288.2. NLC India Ltd. (NLCINDIA): Buy at  ₹288; Target at  ₹308; Stop Loss at  ₹280.3. Bharat Dynamics Ltd. (BDL): Buy at  ₹1,128; Target at  ₹1,200; Stop Loss at  ₹1,090.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e both closed lower after reaching new record highs in the early trading session on friday the domestic indices could not sustain the highs as investors profit booking drove them to close lower the days rally was fueled by metals and financial stocks which are witnessing significant buying amid improving domestic and global indicators the nifty \u003cFIVE_TEN\u003e closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points down from \u003cTWO_TEN_THOUSAND\u003e in the previous session the bse sensex closed \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e points compared to \u003cEIGHT_TEN_THOUSAND\u003e points at fridays market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty \u003cFIVE_TEN\u003e has continued to make new highs while maintaining a strong uptrend with the upcoming target of \u003cTWO_TEN_THOUSAND\u003e level visible with the performance of the frontline stocks we expect nifty to achieve this target in the coming days parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks oil and natural gas corporation ltd nlc india ltd and bharat dynamics ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty continue to make new highs maintaining the strong uptrend with next target of \u003cTWO_TEN_THOUSAND\u003e level visible and along with frontline stocks performing we can anticipate to achieve this target in the coming days the index would have the \u003cTWO_TEN_THOUSAND\u003e zone as the near term important support which needs to be sustained to maintain the trend intact said the stock market expert bank nifty after the decent rally has witnessed some consolidation near the \u003cFIVE_TEN_THOUSAND\u003e levels with near term support maintained near \u003cFIVE_TEN_THOUSAND\u003e zone of the previous peak level and would need a decisive breach above \u003cFIVE_TEN_THOUSAND\u003e levels to continue with the uptrend said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e oil and natural gas corporation ltd ongc buy at \u003cTWO_HUNDRED\u003e target at \u003cTHREE_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e nlc india ltd nlcindia buy at \u003cTWO_HUNDRED\u003e target at \u003cTHREE_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e bharat dynamics ltd bdl buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e","timestamp":"2024-09-30T06:22:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}