{"url":"https://www.livemint.com/market/stock-market-news/nearly-300-stocks-hit-1-year-highs-while-sensex-nifty-50-crash-investors-lose-over-3-lakh-crore-in-a-day-11727689730040.html","title":"Over 300 stocks hit 1-year highs while Sensex, Nifty 50 crash, investors lose over  ₹3 lakh crore in a day","description":"Over 300 stocks, including JSW Steel and NTPC, reached one-year highs on the BSE, despite the Sensex and Nifty 50 falling over one per cent amid weak global cues.","content":"Over 300 stocks, including JSW Steel, NTPC, Sun Pharma, BPCL, Cipla, Hindalco, Sun Pharma and Vedanta, hit their one-year highs in intraday trade on BSE on Monday, September 30, even as Indian stock market benchmarks, the Sensex and the Nifty 50, suffered strong losses of over a per cent each amid weak global cues.Apollo Hospitals, Britannia Industries, Colgate-Palmolive (India), Pidilite Industries, ICICI Prudential Life Insurance Company, AstraZeneca Pharma India, National Aluminium, Hitachi Energy India, Whirlpool of India, Praj Industries and Welspun Corp were also among the stocks that rose to 52-week highs.Meanwhile, the Sensex and the Nifty 50 crashed over a per cent each in intraday trade. The Sensex closed 1,272 points, or 1.49 per cent, down at 84,299.78, while the Nifty ended 368 points, or 1.41 per cent, down at 25,810.85.The overall market capitalisation of the BSE-listed firms dropped to nearly  ₹474.4 lakh crore from nearly  ₹477.9 lakh crore in the previous session, causing investors to lose about  ₹3.5 lakh crore in a day.As many as 25 stocks ended in the red in the 30-share pack Sensex, with shares of Reliance Industries, Axis Bank, Mahindra and Mahindra, ICICI Bank and Nestle as top losers.Barring Nifty Metal (up 1.33 per cent) and Media (up 1.12 per cent), all sectoral indices suffered losses. Nifty Auto (down 2.11 per cent), Financial Services (down 1.72 per cent) and Realty (down 1.68 per cent) lost almost 2 per cent each.Nifty Bank crashed 1.59 per cent, while the Private Bank and PSU Bank indices dropped 1.70 per cent and 1.42 per cent, respectively.\"Global markets turned topsy turvy under the threat of rising geopolitical risk in the Middle-East and plausible increase in Yen interest rate which can reduce cross country investments in equity,\" Vinod Nair, Head of Research, Geojit Financial Services, observed.\"The Chinese market had a resurgence due to a large stimulus package and cheap valuation. India also weakens under global pressure and premium valuation, while metals are expected to outperform in the near term. Going ahead, the domestic focus will be on the upcoming Q2 results, where earnings growth is expected to revert after the dull Q1,\" said Nair.According to Prashanth Tapse, Senior VP (Research), Mehta Equities, while valuations are already on the higher side, the focus will now shift to the RBI credit policy announcement next week and the start of the quarterly earnings season.\"The sharp rally in recent weeks was the outcome of the Fed rate cut and hopes that RBI would also follow suit in its policy meeting. If the central bank keeps the rates steady, it may lead to short-term weakness. Globally, if the Israel-Hezbollah war escalates further, nervousness could fuel panic selling going ahead,\" said Tapse.Read all market-related news here","cleaned_content":"over \u003cTHREE_HUNDRED\u003e stocks including jsw steel ntpc sun pharma bpcl cipla hindalco sun pharma and vedanta hit their one year highs in intraday trade on bse on monday september \u003cTHREE_TEN\u003e even as indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e suffered strong losses of over a per cent each amid weak global cues apollo hospitals britannia industries colgate palmolive india pidilite industries icici prudential life insurance company astrazeneca pharma india national aluminium hitachi energy india whirlpool of india praj industries and welspun corp were also among the stocks that rose to \u003cFIVE_TEN\u003e week highs meanwhile the sensex and the nifty \u003cFIVE_TEN\u003e crashed over a per cent each in intraday trade the sensex closed \u003cONE_THOUSAND\u003e points or \u003cONE_PERCENT\u003e down at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty ended \u003cTHREE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e down at \u003cTWO_TEN_THOUSAND\u003e the overall market capitalisation of the bse listed firms dropped to nearly \u003cFOUR_HUNDRED\u003e lakh crore from nearly \u003cFOUR_HUNDRED\u003e lakh crore in the previous session causing investors to lose about \u003cTHREE_\u003e lakh crore in a day as many as \u003cTWO_TEN\u003e stocks ended in the red in the \u003cTHREE_TEN\u003e share pack sensex with shares of reliance industries axis bank mahindra and mahindra icici bank and nestle as top losers barring nifty metal up \u003cONE_PERCENT\u003e and media up \u003cONE_PERCENT\u003e all sectoral indices suffered losses nifty auto down \u003cTWO_PERCENT\u003e financial services down \u003cONE_PERCENT\u003e and realty down \u003cONE_PERCENT\u003e lost almost \u003cTWO_PERCENT\u003e each nifty bank crashed \u003cONE_PERCENT\u003e while the private bank and psu bank indices dropped \u003cONE_PERCENT\u003e and \u003cONE_PERCENT\u003e respectively global markets turned topsy turvy under the threat of rising geopolitical risk in the middle east and plausible increase in yen interest rate which can reduce cross country investments in equity vinod nair head of research geojit financial services observed the chinese market had a resurgence due to a large stimulus package and cheap valuation india also weakens under global pressure and premium valuation while metals are expected to outperform in the near term going ahead the domestic focus will be on the upcoming q2 results where earnings growth is expected to revert after the dull q1 said nair according to prashanth tapse senior vp research mehta equities while valuations are already on the higher side the focus will now shift to the rbi credit policy announcement next week and the start of the quarterly earnings season the sharp rally in recent weeks was the outcome of the fed rate cut and hopes that rbi would also follow suit in its policy meeting if the central bank keeps the rates steady it may lead to short term weakness globally if the israel hezbollah war escalates further nervousness could fuel panic selling going ahead said tapse read all market related news here","timestamp":"2024-09-30T16:03:00+05:30","market_timestamp":"2024-10-01T09:15:00+05:30","off_market_hours":true}