{"url":"https://www.livemint.com/market/stock-market-news/indian-stock-market-today-m-m-ntpc-bharti-airtel-300-stocks-hit-one-year-highs-on-the-bse-11727172640601.html","title":"Indian stock market today: M\u0026M, NTPC, Bharti Airtel...300 stocks hit one-year highs on the BSE","description":"300 stocks, including Mahindra and Mahindra and Bharti Airtel, reached new 52-week highs. The Sensex and Nifty 50 peaked but settled flat amid mixed gains and losses. Market sentiment remains positive due to US rate cuts, though profit booking persists.","content":"Indian stock market today: As many as 300 stocks, including Mahindra and Mahindra (M\u0026M), NTPC, Bharti Airtel, JSW Steel and Sun Pharma, hit their fresh 52-week highs in intraday trade on BSE on Tuesday, September 24.Zomato, Apollo Hospitals, Bajaj Auto, Hero MotoCorp, DMart, Hindalco, Indian Hotels Company, Max Healthcare Institute, Tata Power Company, Trent, TVS Motor Company and United Spirits were also among the stocks that rose to their new one-year highs during the session on the BSE.Benchmark indices the Sensex and the Nifty 50 scaled their fresh peaks of 85,163.23 and 26,011.55 but settled flat as gains in shares of select heavyweights, such as HDFC Bank, Tata Steel and Power Grid, were offset by losses in shares of Hindustan Unilever, Kotak Mahindra Bank, ICICI Bank and Reliance Industries.The Sensex ended the day at 84,914.04, down 15 points, while the Nifty 50 settled at 25,940.40, up 1 point. The BSE Midcap index climbed 0.21 per cent. However, the Smallcap index dropped 0.04 per cent.The overall market capitalisation of BSE-listed firms stood stable at  ₹476 lakh crore.The start of the rate reduction cycle in the US has kept market sentiment positive. However, investors are booking some profit at record-high levels as concerns over rich valuation persist. Experts say the RBI monetary policy in October, Q2 earnings and global cues will remain major triggers for the market in the near term.\"Domestic benchmarks are attempting to sustain new highs, driven by the US Fed’s aggressive rate cut. Meanwhile, the Chinese central bank’s rate cut and additional stimulus measures have positively influenced global investor sentiment, resulting in gains for domestic metal stocks,\" said Vinod Nair, Head of Research, Geojit Financial Services.\"FMCG and banking stocks exhibited declines due to profit-booking at higher levels. In the near term, strong inflows from FIIs, driven by the US Fed’s dovish outlook and expectations of a rate cut by the RBI in October, are expected to maintain momentum,\" said Nair.Read all market-related news here","cleaned_content":"indian stock market today as many as \u003cTHREE_HUNDRED\u003e stocks including mahindra and mahindra m m ntpc bharti airtel jsw steel and sun pharma hit their fresh \u003cFIVE_TEN\u003e week highs in intraday trade on bse on tuesday september \u003cTWO_TEN\u003e zomato apollo hospitals bajaj auto hero motocorp dmart hindalco indian hotels company max healthcare institute tata power company trent tvs motor company and united spirits were also among the stocks that rose to their new one year highs during the session on the bse benchmark indices the sensex and the nifty \u003cFIVE_TEN\u003e scaled their fresh peaks of \u003cEIGHT_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e but settled flat as gains in shares of select heavyweights such as hdfc bank tata steel and power grid were offset by losses in shares of hindustan unilever kotak mahindra bank icici bank and reliance industries the sensex ended the day at \u003cEIGHT_TEN_THOUSAND\u003e down \u003cONE_TEN\u003e points while the nifty \u003cFIVE_TEN\u003e settled at \u003cTWO_TEN_THOUSAND\u003e up \u003cONE_\u003e point the bse midcap index climbed \u003cZERO_PERCENT\u003e however the smallcap index dropped \u003cZERO_PERCENT\u003e the overall market capitalisation of bse listed firms stood stable at \u003cFOUR_HUNDRED\u003e lakh crore the start of the rate reduction cycle in the us has kept market sentiment positive however investors are booking some profit at record high levels as concerns over rich valuation persist experts say the rbi monetary policy in october q2 earnings and global cues will remain major triggers for the market in the near term domestic benchmarks are attempting to sustain new highs driven by the us fed s aggressive rate cut meanwhile the chinese central bank s rate cut and additional stimulus measures have positively influenced global investor sentiment resulting in gains for domestic metal stocks said vinod nair head of research geojit financial services fmcg and banking stocks exhibited declines due to profit booking at higher levels in the near term strong inflows from fiis driven by the us fed s dovish outlook and expectations of a rate cut by the rbi in october are expected to maintain momentum said nair read all market related news here","timestamp":"2024-09-24T16:00:00+05:30","market_timestamp":"2024-09-25T09:15:00+05:30","off_market_hours":true}