{"url":"https://www.livemint.com/market/stock-market-news/ola-electric-stock-slips-below-rs-100-skids-20-in-8-sessions-what-s-causing-the-slide-11727683460662.html","title":"Ola Electric stock slips below  ₹100, skids 20% in 8 sessions. What’s causing the slide?","description":"Ola Electric's stock has fallen 38% from its peak to  ₹97.85 amid investor concerns over market share losses and product reliability issues. Increased competition in the growing electric vehicle market in India is weighing on Ola Electric shares.","content":"Shares of Ola Electric Mobility, India's leading two-wheeler electric vehicle manufacturer, have been in a steady downtrend, showing no signs of a rebound. In Monday's trading session, this downward trend persisted, causing the stock to fall below the  ₹100 mark for the first time since mid-August, to  ₹97.85 per share.With this decline, the stock has lost 20% in eight sessions and 38% from its recent high of  ₹157. The ongoing fall in Ola Electric Mobility's stock stems from increasing investor worries about a potential drop in the company's market share in the electric two-wheeler segment.Major players in the internal combustion engine (ICE) market are ramping up their production and introducing new EV models at competitive prices, which has heightened the competition for Ola Electric.Additionally, the stock has witnessed substantial profit-taking, particularly following the lock-in expiry of anchor investors. After an impressive surge of 73% in just six sessions following its Dalal Street debut on August 9, many investors are now looking to capitalise on their gains, contributing to the stock's downward pressure.Compounding these challenges, reports have surfaced indicating that Ola Electric customers are experiencing significant issues with malfunctioning hardware and glitching software in their vehicles. Spare parts are reportedly difficult to obtain, leading to substantial delays in servicing. Service centres across India are currently overwhelmed, with media reports indicating they receive nearly 80,000 complaints each month.Ola Electric's market share declined to 31% in August from 39% in July, raising concerns among analysts about the company's position amid intensifying competition. Domestic brokerage firm Ambit Capital highlighted that the electric vehicle (EV) market in India is still in its nascent stages, and the increasing competition could put pressure on Ola Electric’s market share.Ambit predicts that Ola's market share will decrease from 35% in FY24 to 27.5% by FY29 and further down to 25% by FY31. Consequently, the firm initiated coverage of the stock with a ‘sell’ rating and a target price of  ₹100, a level that the stock reached in today's session.Global brokerage firm HSBC Securities has also expressed concerns about Ola Electric's recent market share loss. The brokerage foresees a downside risk of 15-20% to its FY25/26 volume estimates for Ola if the current trend continues.According to Elara Capital, competitors such as Hero, Bajaj, TVS, and Ather Energy, initially viewed as the \"tortoises\" of the industry due to their slower growth, are now expected to expand their market share. They plan to achieve this by launching more affordable scooters and enhancing their distribution networks while maintaining a strong emphasis on quality.Furthermore, the report notes that Honda Motorcycle and Scooters India (HMSI), the leader in internal combustion engine (ICE) vehicles, has yet to introduce an electric scooter. This delay could further undermine Ola Electric's market share, intensifying the competitive landscape.","cleaned_content":"shares of ola electric mobility indias leading two wheeler electric vehicle manufacturer have been in a steady downtrend showing no signs of a rebound in mondays trading session this downward trend persisted causing the stock to fall below the \u003cONE_HUNDRED\u003e mark for the first time since mid august to \u003cNINE_TEN\u003e per share with this decline the stock has lost \u003cTWO_TEN_PERCENT\u003e in eight sessions and \u003cTHREE_TEN_PERCENT\u003e from its recent high of \u003cONE_HUNDRED\u003e the ongoing fall in ola electric mobilitys stock stems from increasing investor worries about a potential drop in the companys market share in the electric two wheeler segment major players in the internal combustion engine ice market are ramping up their production and introducing new ev models at competitive prices which has heightened the competition for ola electric additionally the stock has witnessed substantial profit taking particularly following the lock in expiry of anchor investors after an impressive surge of \u003cSEVEN_TEN_PERCENT\u003e in just six sessions following its dalal street debut on august \u003cNINE_\u003e many investors are now looking to capitalise on their gains contributing to the stocks downward pressure compounding these challenges reports have surfaced indicating that ola electric customers are experiencing significant issues with malfunctioning hardware and glitching software in their vehicles spare parts are reportedly difficult to obtain leading to substantial delays in servicing service centres across india are currently overwhelmed with media reports indicating they receive nearly \u003cEIGHT_TEN_THOUSAND\u003e complaints each month ola electrics market share declined to \u003cTHREE_TEN_PERCENT\u003e in august from \u003cTHREE_TEN_PERCENT\u003e in july raising concerns among analysts about the companys position amid intensifying competition domestic brokerage firm ambit capital highlighted that the electric vehicle ev market in india is still in its nascent stages and the increasing competition could put pressure on ola electric s market share ambit predicts that olas market share will decrease from \u003cTHREE_TEN_PERCENT\u003e in fy24 to \u003cTWO_TEN_PERCENT\u003e by fy29 and further down to \u003cTWO_TEN_PERCENT\u003e by fy31 consequently the firm initiated coverage of the stock with a sell rating and a target price of \u003cONE_HUNDRED\u003e a level that the stock reached in todays session global brokerage firm hsbc securities has also expressed concerns about ola electrics recent market share loss the brokerage foresees a downside risk of \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e to its fy25 \u003cTWO_TEN\u003e volume estimates for ola if the current trend continues according to elara capital competitors such as hero bajaj tvs and ather energy initially viewed as the tortoises of the industry due to their slower growth are now expected to expand their market share they plan to achieve this by launching more affordable scooters and enhancing their distribution networks while maintaining a strong emphasis on quality furthermore the report notes that honda motorcycle and scooters india hmsi the leader in internal combustion engine ice vehicles has yet to introduce an electric scooter this delay could further undermine ola electrics market share intensifying the competitive landscape","timestamp":"2024-09-30T14:30:00+05:30","market_timestamp":"2024-09-30T14:30:00+05:30","off_market_hours":false}