{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-september-30-11727661452798.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on September 30","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 26,305 level, a discount of nearly 40 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open on a weak note on Monday tracking fall in Asian peers.The trends on Gift Nifty also indicate a negative start for the Indian benchmark index. The Gift Nifty was trading around 26,305 level, a discount of nearly 40 points from the Nifty futures’ previous close.On Friday, the domestic equity market indices ended lower amid profit booking at record high levels.The Sensex fell 264.27 points to close at 85,571.85, while the Nifty 50 settled 37.10 points, or 0.14%, lower at 26,178.95.Nifty 50 formed a small negative candle on the daily chart at the new highs, which is indicating a breather type pattern post upside breakout.“As happened in the past the market is expected to shift into a range bound action for a few sessions before witnessing another upside breakout. Nifty on the weekly chart formed a long bull candle which is the third consecutive candle on the row. Technically, this weekly market action is indicating a bullish ‘three advancing soldiers’ type pattern which signals uptrend continuation,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to Shetti, the near-term uptrend of the market remains intact and the Nifty 50 could eventually bounce after the consolidation in the next few sessions.Here’s what to expect from Nifty 50 and Bank Nifty todayNifty 50 index slipped into consolidation on September 27 and closed the day lower by 37 points.“The Nifty 50 took a breather after a few days of continuous gains. The sentiment remains strong as the index continues to stay above important moving averages. This strength is likely to persist as long as it remains above 25,900. On the higher end, a fresh round of rally may begin above 26,300. If the Nifty moves above 26,300, it could potentially rise towards 26,600,” said Rupak De, Senior Technical Analyst at LKP Securities.According to VLA Ambala, Co-Founder of Stock Market Today, while the overall markets recorded all-time highs, the higher valuations and technical indicators point to the overbought zone.“In this situation, I recommend adopting a cautious approach. Investors should choose different sectors wisely. According to my analysis, sectors such as Metals, Energy, PSUs, and Pharma could be in focus in the coming weeks. Sell activities are on the rise, with RSI readings being 76 on the daily, 75 on the weekly, and 83 on the monthly timeframe. Nifty also formed a Dark Cloud Cover candlestick pattern in the latest session,” said Ambala.Based on these situations, she expects the Nifty index could find support levels around 26,080 and 26,000, and notice resistance between 26,220 and 26,270 in today’s sessionDr. Praveen Dwarakanath, Vice President of Hedged.in noted that Nifty 50 has consolidated at the 26,200 level, signifying the breakout is still valid unless the 26,000 crucial support is not removed.“ADX DI+ line is showing a reversal, a sign of slowness in the rally. The stochastics show signs of negative divergence, however yet to be established, making the view still on the upside for the next target of 26,500 levels in the index. The Options writer’s data for October expiry shows increased put writing and short covering in the ITM and OTM calls (25900, 26000, 26500), showing signs of a continuation of the present rally,” Dwarakanath said.Bank Nifty index underperformed the benchmark Nifty 50 on Friday and ended 541.05 points, or 1.00%, lower at 53,834.30, forming a Bearish Belt Hold pattern on the daily charts.“Bank Nifty on a weekly time frame is showing signs of negative divergence, a strong sign of a reversal. A formation of a red candle in the next week establishes a further move downside. However, on the daily time frame, Bank Nifty has to close below 53,000 levels to show signs of a reversal. Although weaker than Nifty, Bank Nifty has been taking support on the Upper Keltner channel, which is where it has closed on Friday as well,” said Dwarakanath.According to him, immediate support for the Bank Nifty index continues to be at the 53,700 level. Options writer's data for the present week's expiry shows increased call writing at 54,000 and above levels, indicating weakness in the rally, he added.Amol Athawale, VP-Technical Research, Kotak Securities believes for Bank Nifty, the medium term texture is bullish, but due to temporary overbought conditions, we could see range bound activity in the near future.“For traders now, 53,500 and 53,100 would be the key support zones while 54,500 - 54,800 could be the profit booking areas for the bulls. However, below 53,100 uptrend would be vulnerable,” Athawale said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a weak note on monday tracking fall in asian peers the trends on gift nifty also indicate a negative start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cFOUR_TEN\u003e points from the nifty futures previous close on friday the domestic equity market indices ended lower amid profit booking at record high levels the sensex fell \u003cTWO_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart at the new highs which is indicating a breather type pattern post upside breakout as happened in the past the market is expected to shift into a range bound action for a few sessions before witnessing another upside breakout nifty on the weekly chart formed a long bull candle which is the third consecutive candle on the row technically this weekly market action is indicating a bullish three advancing soldiers type pattern which signals uptrend continuation said nagaraj shetti senior technical research analyst at hdfc securities according to shetti the near term uptrend of the market remains intact and the nifty \u003cFIVE_TEN\u003e could eventually bounce after the consolidation in the next few sessions here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty todaynifty \u003cFIVE_TEN\u003e index slipped into consolidation on september \u003cTWO_TEN\u003e and closed the day lower by \u003cTHREE_TEN\u003e points the nifty \u003cFIVE_TEN\u003e took a breather after a few days of continuous gains the sentiment remains strong as the index continues to stay above important moving averages this strength is likely to persist as long as it remains above \u003cTWO_TEN_THOUSAND\u003e on the higher end a fresh round of rally may begin above \u003cTWO_TEN_THOUSAND\u003e if the nifty moves above \u003cTWO_TEN_THOUSAND\u003e it could potentially rise towards \u003cTWO_TEN_THOUSAND\u003e said rupak de senior technical analyst at lkp securities according to vla ambala co founder of stock market today while the overall markets recorded all time highs the higher valuations and technical indicators point to the overbought zone in this situation i recommend adopting a cautious approach investors should choose different sectors wisely according to my analysis sectors such as metals energy psus and pharma could be in focus in the coming weeks sell activities are on the rise with rsi readings being \u003cSEVEN_TEN\u003e on the daily \u003cSEVEN_TEN\u003e on the weekly and \u003cEIGHT_TEN\u003e on the monthly timeframe nifty also formed a dark cloud cover candlestick pattern in the latest session said ambala based on these situations she expects the nifty index could find support levels around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e and notice resistance between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e in today s sessiondr praveen dwarakanath vice president of hedged in noted that nifty \u003cFIVE_TEN\u003e has consolidated at the \u003cTWO_TEN_THOUSAND\u003e level signifying the breakout is still valid unless the \u003cTWO_TEN_THOUSAND\u003e crucial support is not removed adx di line is showing a reversal a sign of slowness in the rally the stochastics show signs of negative divergence however yet to be established making the view still on the upside for the next target of \u003cTWO_TEN_THOUSAND\u003e levels in the index the options writer s data for october expiry shows increased put writing and short covering in the itm and otm calls \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e showing signs of a continuation of the present rally dwarakanath said bank nifty index underperformed the benchmark nifty \u003cFIVE_TEN\u003e on friday and ended \u003cFIVE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e forming a bearish belt hold pattern on the daily charts bank nifty on a weekly time frame is showing signs of negative divergence a strong sign of a reversal a formation of a red candle in the next week establishes a further move downside however on the daily time frame bank nifty has to close below \u003cFIVE_TEN_THOUSAND\u003e levels to show signs of a reversal although weaker than nifty bank nifty has been taking support on the upper keltner channel which is where it has closed on friday as well said dwarakanath according to him immediate support for the bank nifty index continues to be at the \u003cFIVE_TEN_THOUSAND\u003e level options writers data for the present weeks expiry shows increased call writing at \u003cFIVE_TEN_THOUSAND\u003e and above levels indicating weakness in the rally he added amol athawale vp technical research kotak securities believes for bank nifty the medium term texture is bullish but due to temporary overbought conditions we could see range bound activity in the near future for traders now \u003cFIVE_TEN_THOUSAND\u003e and \u003cFIVE_TEN_THOUSAND\u003e would be the key support zones while \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e could be the profit booking areas for the bulls however below \u003cFIVE_TEN_THOUSAND\u003e uptrend would be vulnerable athawale said","timestamp":"2024-09-30T07:37:00+05:30","market_timestamp":"2024-09-30T09:15:00+05:30","off_market_hours":true}