{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-servotech-power-systems-soars-7-500-in-5-years-hits-5-upper-circuit-on-preferential-share-issuance-11727162118694.html","title":"Multibagger stock Servotech Power Systems soars 7,500% in 5 years, hits 5% upper circuit on preferential share issuance","description":"Servotech Power Systems shares reached a record high of  ₹191.99 after announcing a fundraising initiative through preferential share issuance. The board approved convertible warrants and amendments to its authorised share capital amid significant stock growth over the past five years.","content":"Shares of Servotech Power Systems hit their 5 percent upper circuit of  ₹191.99, marking a record high following the company’s announcement of a fundraising initiative via preferential share issuance. The Board of Directors approved the issuance of warrants convertible into equity shares during a meeting held on September 23, 2024.The decision followed recommendations from the company’s sub-committees and was approved through a postal ballot. In a stock exchange filing, Servotech Power Systems disclosed that the postal ballot notice would be dispatched electronically, with September 20, 2024, as the cut-off date for sending the notice and enabling e-voting for the company's shareholders.The company has also appointed Debabrata Deb Nath, a practising company secretary, as the scrutiniser to oversee the remote e-voting process. The board also approved amendments to Clause V of its Memorandum of Association, revising the company’s authorised share capital to  ₹50 crore, divided into 50 crore equity shares with a face value of  ₹1 each.The stock has skyrocketed by over 7,500 percent in the last five years, delivering exceptional multibagger returns. In the last year, the stock surged by around 142 percent, with a year-to-date gain of 112 percent in 2024.In September alone, the stock climbed about 35 percent, marking its fourth consecutive month of gains. It rose by more than 15 percent in August, 40.3 percent in July, and approximately 11 percent in June. However, the stock experienced volatility earlier in the year, declining by 7.2 percent in May after rising 10.5 percent in April and dropping 22 percent in March. It posted gains of 18.2 percent in January and 9.6 percent in February.In another recent development, Servotech Power Systems secured a significant contract from the Bangalore Electricity Supply Company Limited (BESCOM) to set up 11 DC fast EV charging stations across Karnataka. The contract, signed on September 10, 2024, emphasises the company's growing presence in the electric vehicle (EV) infrastructure space.Under this project, Servotech will install EV charging stations at various Regional Transport Office (RTO) locations, enhancing the availability of charging facilities across the state. The company will oversee every phase of the project, from design to final installation, while adhering to strict safety and performance standards. In addition to manufacturing and testing the charging stations, Servotech will handle all electrical connections and power supply arrangements, ensuring seamless project implementation and providing warranty support.Servotech Power Systems has taken strategic steps to enhance its growth trajectory through both fundraising and expansion into the EV charging infrastructure sector.The company's initiatives not only bolster its financial standing but also align with the growing demand for electric vehicle support across India. As Servotech continues to innovate and expand its offerings, its stock performance and market position are expected to remain strong in the coming months.","cleaned_content":"shares of servotech power systems hit their \u003cFIVE_PERCENT\u003e upper circuit of \u003cONE_HUNDRED\u003e marking a record high following the company s announcement of a fundraising initiative via preferential share issuance the board of directors approved the issuance of warrants convertible into equity shares during a meeting held on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the decision followed recommendations from the company s sub committees and was approved through a postal ballot in a stock exchange filing servotech power systems disclosed that the postal ballot notice would be dispatched electronically with september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as the cut off date for sending the notice and enabling e voting for the companys shareholders the company has also appointed debabrata deb nath a practising company secretary as the scrutiniser to oversee the remote e voting process the board also approved amendments to clause v of its memorandum of association revising the company s authorised share capital to \u003cFIVE_TEN\u003e crore divided into \u003cFIVE_TEN\u003e crore equity shares with a face value of \u003cONE_\u003e each the stock has skyrocketed by over \u003cSEVEN_THOUSAND_PERCENT\u003e in the last five years delivering exceptional multibagger returns in the last year the stock surged by around \u003cONE_HUNDRED_PERCENT\u003e with a year to date gain of \u003cONE_HUNDRED_PERCENT\u003e in \u003cTWO_THOUSAND\u003e in september alone the stock climbed about \u003cTHREE_TEN_PERCENT\u003e marking its fourth consecutive month of gains it rose by more than \u003cONE_TEN_PERCENT\u003e in august \u003cFOUR_TEN_PERCENT\u003e in july and approximately \u003cONE_TEN_PERCENT\u003e in june however the stock experienced volatility earlier in the year declining by \u003cSEVEN_PERCENT\u003e in may after rising \u003cONE_TEN_PERCENT\u003e in april and dropping \u003cTWO_TEN_PERCENT\u003e in march it posted gains of \u003cONE_TEN_PERCENT\u003e in january and \u003cNINE_PERCENT\u003e in february in another recent development servotech power systems secured a significant contract from the bangalore electricity supply company limited bescom to set up \u003cONE_TEN\u003e dc fast ev charging stations across karnataka the contract signed on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e emphasises the companys growing presence in the electric vehicle ev infrastructure space under this project servotech will install ev charging stations at various regional transport office rto locations enhancing the availability of charging facilities across the state the company will oversee every phase of the project from design to final installation while adhering to strict safety and performance standards in addition to manufacturing and testing the charging stations servotech will handle all electrical connections and power supply arrangements ensuring seamless project implementation and providing warranty support servotech power systems has taken strategic steps to enhance its growth trajectory through both fundraising and expansion into the ev charging infrastructure sector the companys initiatives not only bolster its financial standing but also align with the growing demand for electric vehicle support across india as servotech continues to innovate and expand its offerings its stock performance and market position are expected to remain strong in the coming months","timestamp":"2024-09-24T13:26:00+05:30","market_timestamp":"2024-09-24T13:26:00+05:30","off_market_hours":false}