{"url":"https://www.livemint.com/market/stock-market-news/weekend-wrap-october-11-stock-market-bse-nse-top-market-movers-and-news-of-week-mutual-funds-11728546280637.html","title":"Weekend Wrap: From Divi’s Labs to Dixon Technologies, top market movers and news of week","description":"Stock market: Presenting a comprehensive recap of the week's highlights, spanning from top news to market performance, here's your market wrap for the week concluding on October 11, 2024.","content":"The Securities and Exchange Board of India (SEBI) has issued a recent circular revising the payout timing for securities in T+1 rolling settlements. According to the new guidelines, securities will now be credited directly to clients' demat accounts by the Clearing Corporations at 3:30 PM on the settlement day. This change is aimed at enhancing the efficiency of securities settlement and ensuring timely credit of securities to investors' accounts. The revised payout system aligns with SEBI's broader efforts to streamline market operations and improve investor experience.In the equity markets, Diffusion Engineers had a successful listing, with its shares debuting at a premium of 15.2% over the issue price of  ₹168 per share. The company's listing performance reflects positive investor demand and interest in its shares. In another development, Garuda Construction and Engineering saw strong interest from investors, with its initial public offering (IPO) being oversubscribed by 7.55 times. This high level of oversubscription indicates solid market confidence in the company’s growth potential and business prospects.Several asset management companies (AMCs) have launched new fund offerings (NFOs) this week. Mirae Asset Management Company (AMC) has introduced three new funds: the Mirae Asset Nifty 50 Index Fund, the Mirae Asset Nifty Largemidcap 250 Index Fund, and the Mirae Asset Nifty Total Market Index Fund. These funds offer investors exposure to a broad spectrum of companies across large-cap, mid-cap, and the total market, providing diversified investment opportunities.Kotak AMC has launched the Kotak MNC Fund, which focuses on multinational companies operating in India. This fund is designed to provide investors with exposure to globally reputed companies with a strong presence in India.Also, Tata AMC has introduced the Tata Nifty Capital Markets Index Fund, targeting companies within the capital markets sector. The fund offers investors an opportunity to invest in businesses that play a pivotal role in India’s financial markets infrastructure.Additionally, Samco AMC has also introduced the Samco Multi Cap Fund, a diversified fund that invests across companies of different market capitalizations, including large-cap, mid-cap, and small-cap segments. The fund provides investors with exposure to a wide range of companies, helping them benefit from growth opportunities across various sectors and industries.Kuvera is a free direct mutual fund investing platform. Unless otherwise stated data sourced from BSE, NSE and kuvera.","cleaned_content":"the securities and exchange board of india sebi has issued a recent circular revising the payout timing for securities in t \u003cONE_\u003e rolling settlements according to the new guidelines securities will now be credited directly to clients demat accounts by the clearing corporations at \u003cTHREE_\u003e \u003cTHREE_TEN\u003e pm on the settlement day this change is aimed at enhancing the efficiency of securities settlement and ensuring timely credit of securities to investors accounts the revised payout system aligns with sebis broader efforts to streamline market operations and improve investor experience in the equity markets diffusion engineers had a successful listing with its shares debuting at a premium of \u003cONE_TEN_PERCENT\u003e over the issue price of \u003cONE_HUNDRED\u003e per share the companys listing performance reflects positive investor demand and interest in its shares in another development garuda construction and engineering saw strong interest from investors with its initial public offering ipo being oversubscribed by \u003cSEVEN_\u003e times this high level of oversubscription indicates solid market confidence in the company s growth potential and business prospects several asset management companies amcs have launched new fund offerings nfos this week mirae asset management company amc has introduced three new funds the mirae asset nifty \u003cFIVE_TEN\u003e index fund the mirae asset nifty largemidcap \u003cTWO_HUNDRED\u003e index fund and the mirae asset nifty total market index fund these funds offer investors exposure to a broad spectrum of companies across large cap mid cap and the total market providing diversified investment opportunities kotak amc has launched the kotak mnc fund which focuses on multinational companies operating in india this fund is designed to provide investors with exposure to globally reputed companies with a strong presence in india also tata amc has introduced the tata nifty capital markets index fund targeting companies within the capital markets sector the fund offers investors an opportunity to invest in businesses that play a pivotal role in india s financial markets infrastructure additionally samco amc has also introduced the samco multi cap fund a diversified fund that invests across companies of different market capitalizations including large cap mid cap and small cap segments the fund provides investors with exposure to a wide range of companies helping them benefit from growth opportunities across various sectors and industries kuvera is a free direct mutual fund investing platform unless otherwise stated data sourced from bse nse and kuvera","timestamp":"2024-10-12T12:08:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}