{"url":"https://www.livemint.com/market/stock-market-news/sebi-allows-settlement-in-nse-tap-misuse-case-after-nse-officials-pay-643-crore-11728045813238.html","title":"Sebi approves  ₹643 crore settlement for NSE, former chief Vikram Limaye","description":"Sebi recently closed proceedings in another case against NSE and its officials, citing a lack of evidence.","content":"The Securities and Exchange Board of India on Friday approved a  ₹643-crore settlement—the largest in Sebi’s history—in a case involving the National Stock Exchange, former NSE chief executive Vikram Limaye and former chief technology officer Umesh Jain, among others.NSE and its former top executives were accused of not taking remedial measures to prevent or discourage certain high-frequency traders from misusing a technology, which gave them an unfair advantage over others.The technology—trading access point (TAP)—is a software application that NSE deployed in 2008 on the servers of trading members for managing their connections and messages of orders on the NSE trading system.While NSE introduced ‘trimmed TAP’ in December 2013 and ‘direct connect’ in February 2016 as an alternative to TAP, it continued with TAP till September 2019 in the equity segment.In 2013, it was alleged in a complaint to Sebi that high-frequency traders manipulated the TAP software to gain an unfair advantage, including bypassing transaction fees and executing orders without detection.The misuse was discovered in 2017 during an investigation into the colocation scam involving former NSE chiefs Chitra Ramkrishna and Ravi Narain. The scam surfaced after three whistleblowers complained about preferential access to certain brokers, which resulted in huge gains for them to the detriment of other brokers.Sebi had earlier directed NSE to disgorge  ₹624.89 crore, which was reduced by the Securities Appellate Tribunal to  ₹100 crore. Eventually, on 3 September, Sebi closed proceedings in the colocation case against NSE and its officials, citing a lack of evidence.Securities lawyer Chirag M. Shah said NSE settling with Sebi will put an end to a sordid chapter as the stock exchange prepares for a public issue of its shares.“NSE intends to launch its IPO, hence any such legacy issues shouldn't be allowed to fester and await closure through a long and winding adjudication process. This settlement is a welcome step,” he said.In the TAP misuse case, the allegation was that NSE did not take remedial measures to prevent or discourage any possible bypass of TAP. Despite complaints, allegedly, the deficiencies of the TAP system were not brought to the notice of NSE’s Standing Committee on Technology (SCOT), as mandated.Sebi issued a show cause notice to NSE and its top executives including former top executives Limaye and Jain. While the proceedings were pending, the accused applied for settlement of the case without admitting or denying the findings.The applications along with settlement terms were considered by a high-powered advisory committee, which recommended a combined settlement amount of  ₹643 crore along. It also recommended pro-bono community service of at least 14 days this financial year for the executives involved, except for former vice president of NSE Infotech, G.M. Shenoy.Sebi was informed that on 25 September, NSE and the other accused had remitted the penalty amount. The accused (except NSE and Shenoy) also submitted an undertaking of pro bono community service of at least 14 days.With these submissions in place, Sebi disposed the investigation against NSE and the former top executives in the TAP misuse case.","cleaned_content":"the securities and exchange board of india on friday approved a \u003cSIX_HUNDRED\u003e crore settlement the largest in sebi s history in a case involving the national stock exchange former nse chief executive vikram limaye and former chief technology officer umesh jain among others nse and its former top executives were accused of not taking remedial measures to prevent or discourage certain high frequency traders from misusing a technology which gave them an unfair advantage over others the technology trading access point tap is a software application that nse deployed in \u003cTWO_THOUSAND\u003e on the servers of trading members for managing their connections and messages of orders on the nse trading system while nse introduced trimmed tap in december \u003cTWO_THOUSAND\u003e and direct connect in february \u003cTWO_THOUSAND\u003e as an alternative to tap it continued with tap till september \u003cTWO_THOUSAND\u003e in the equity segment in \u003cTWO_THOUSAND\u003e it was alleged in a complaint to sebi that high frequency traders manipulated the tap software to gain an unfair advantage including bypassing transaction fees and executing orders without detection the misuse was discovered in \u003cTWO_THOUSAND\u003e during an investigation into the colocation scam involving former nse chiefs chitra ramkrishna and ravi narain the scam surfaced after three whistleblowers complained about preferential access to certain brokers which resulted in huge gains for them to the detriment of other brokers sebi had earlier directed nse to disgorge \u003cSIX_HUNDRED\u003e crore which was reduced by the securities appellate tribunal to \u003cONE_HUNDRED\u003e crore eventually on \u003cTHREE_\u003e september sebi closed proceedings in the colocation case against nse and its officials citing a lack of evidence securities lawyer chirag m shah said nse settling with sebi will put an end to a sordid chapter as the stock exchange prepares for a public issue of its shares nse intends to launch its ipo hence any such legacy issues shouldnt be allowed to fester and await closure through a long and winding adjudication process this settlement is a welcome step he said in the tap misuse case the allegation was that nse did not take remedial measures to prevent or discourage any possible bypass of tap despite complaints allegedly the deficiencies of the tap system were not brought to the notice of nse s standing committee on technology scot as mandated sebi issued a show cause notice to nse and its top executives including former top executives limaye and jain while the proceedings were pending the accused applied for settlement of the case without admitting or denying the findings the applications along with settlement terms were considered by a high powered advisory committee which recommended a combined settlement amount of \u003cSIX_HUNDRED\u003e crore along it also recommended pro bono community service of at least \u003cONE_TEN\u003e days this financial year for the executives involved except for former vice president of nse infotech g m shenoy sebi was informed that on \u003cTWO_TEN\u003e september nse and the other accused had remitted the penalty amount the accused except nse and shenoy also submitted an undertaking of pro bono community service of at least \u003cONE_TEN\u003e days with these submissions in place sebi disposed the investigation against nse and the former top executives in the tap misuse case","timestamp":"2024-10-04T18:19:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}