{"url":"https://www.livemint.com/market/stock-market-news/telecos-have-headroom-for-more-15-tariff-hikes-in-fy27-says-jpmorgan-raises-target-for-bharti-airtel-vodafone-idea-11728621453704.html","title":"Telcos have headroom for another 15% tariff hike in FY27, says JPMorgan; raises target for Bharti Airtel, Vodafone Idea","description":"JPMorgan raised the Vodafone Idea share price target to  ₹10 per share from  ₹7 earlier as it upgraded the stock to Neutral from Underweight. It remains Overweight on Bharti Airtel stock as it expects the telco to start paying meaningful dividends from FY25.","content":"Telecom companies, including Bharti Airtel and Vodafone Idea, have the headroom to implement another 15% tariff hike in FY27 due to the affordability of services compared to other Asian countries, as well as a benign regulatory environment, analysts said.The unfavourable ruling by the Supreme Court last month in the Adjusted Gross Revenue (AGR) case necessitates annual tariff hikes for beleaguered Vodafone Idea to be able to pay the spectrum dues, including AGR dues outstanding, according to analysts at JPMorgan.The foreign brokerage house highlights that Indian data yield stays the lowest in the region at $0.09 per GB, sharply below the trend adjusted for GDP per capita. Moreover, mobile fees or Average Revenue Per User (ARPU) as a percentage of the GDP also remains one of the lowest at 0.7%, almost a decade since Jio’s launch.“This provides headroom for successive rounds of tariff repair. We bake in tariff hikes of 15% in FY27E given sustained conditions for tariff repair,” JPMorgan said.The brokerage expects tariff hikes of 15% in FY27E for the three telcos - Bharti Airtel, Bharti Hexacom and Vodafone Idea. For the second quarter ended September 2024, it anticipates subscriber losses for incumbents Bharti Airtel and Vodafone Idea, however, ARPU is expected to enjoy flow through of recent tariff hikes.JPMorgan upgraded the rating for Vodafone Idea and raised the target price for all four telecom stocks. Its new pecking order is Indus Towers, Bharti Airtel, Bharti Hexacom and Vodafone Idea.Bharti Airtel is JPMorgan’s top pick in the telecom sector. It bakes in another tariff hike of 15% in FY27E, driving up India wireless revenues/EBITDA by 5-6% and margins by 50 bps for FY27E. It increased the target EV/EBITDA multiples to 12.5x from 11.5x, rolled forward to December 2025 and raised Bharti Airtel share price target to  ₹1,920 apiece from  ₹1,670 earlier.It remains Overweight on Bharti Airtel stock as it expects the telco to start paying meaningful dividends from FY25 as FCF improves and de-leveraging occurs.JPMorgan increased revenue and EBITDA estimates by 4-5% in FY27E as it bakes in another 15% tariff hike. It has an ‘Overweight’ rating on Bharti Hexacom shares with an increased target price of  ₹1,580 apiece from  ₹1,330 earlier.Indus Towers is JPMorgan’s overall top pick in the telcos and tower sector. It believes Vodafone Idea’s monthly payments should continue to remain on track along with continuous tower additions in FY25. The brokerage firm raised its target EV/EBITDA multiple to 9x from 8.5x, along with an increase in the Indus Tower stock price target to  ₹525 from  ₹500, maintaining an Overweight rating.JPMorgan raised Vodafone Idea share price target to  ₹10 from  ₹7 earlier as it upgraded the rating on the counter to Neutral from Underweight.“We bake in another tariff hike of 15% in FY27, increase our target EV/Ebitda multiple to 12x (from 11.5x) and roll forward to December 2025. Vodafone Idea is still in the early days of proving the success of its strategy that will begin with the capex rollout, followed by arresting subscriber losses before regaining share. We will wait for proof of success in arresting subscriber losses and balance sheet exposures before turning more constructive,” JPMorgan said.Bharti Airtel is expected to report a 6.7% quarter-on-quarter (QoQ) growth in India wireless revenue led by a 9% increase in ARPU, counterbalanced by subscriber churn of 1.2 million. The brokerage firm expects Bharti Hexacom to report a 6.1% QoQ revenue growth led by a 7% increase in ARPU while the subscribers could decline by 0.2 million.Vodafone Idea is estimated to report a 5.7% QoQ revenue growth led by 8% ARPU growth while subscribers should decline by 4 million. Indus Towers is expected to report a 4% QoQ growth in revenue led by tower additions.","cleaned_content":"telecom companies including bharti airtel and vodafone idea have the headroom to implement another \u003cONE_TEN_PERCENT\u003e tariff hike in fy27 due to the affordability of services compared to other asian countries as well as a benign regulatory environment analysts said the unfavourable ruling by the supreme court last month in the adjusted gross revenue agr case necessitates annual tariff hikes for beleaguered vodafone idea to be able to pay the spectrum dues including agr dues outstanding according to analysts at jpmorgan the foreign brokerage house highlights that indian data yield stays the lowest in the region at \u003cZERO_\u003e per gb sharply below the trend adjusted for gdp per capita moreover mobile fees or average revenue per user arpu as a percentage of the gdp also remains one of the lowest at \u003cZERO_PERCENT\u003e almost a decade since jio s launch this provides headroom for successive rounds of tariff repair we bake in tariff hikes of \u003cONE_TEN_PERCENT\u003e in fy27e given sustained conditions for tariff repair jpmorgan said the brokerage expects tariff hikes of \u003cONE_TEN_PERCENT\u003e in fy27e for the three telcos bharti airtel bharti hexacom and vodafone idea for the second quarter ended september \u003cTWO_THOUSAND\u003e it anticipates subscriber losses for incumbents bharti airtel and vodafone idea however arpu is expected to enjoy flow through of recent tariff hikes jpmorgan upgraded the rating for vodafone idea and raised the target price for all four telecom stocks its new pecking order is indus towers bharti airtel bharti hexacom and vodafone idea bharti airtel is jpmorgan s top pick in the telecom sector it bakes in another tariff hike of \u003cONE_TEN_PERCENT\u003e in fy27e driving up india wireless revenues ebitda by \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e and margins by \u003cFIVE_TEN\u003e bps for fy27e it increased the target ev ebitda multiples to \u003cONE_TEN\u003e x from \u003cONE_TEN\u003e x rolled forward to december \u003cTWO_THOUSAND\u003e and raised bharti airtel share price target to \u003cONE_THOUSAND\u003e apiece from \u003cONE_THOUSAND\u003e earlier it remains overweight on bharti airtel stock as it expects the telco to start paying meaningful dividends from fy25 as fcf improves and de leveraging occurs jpmorgan increased revenue and ebitda estimates by \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e in fy27e as it bakes in another \u003cONE_TEN_PERCENT\u003e tariff hike it has an overweight rating on bharti hexacom shares with an increased target price of \u003cONE_THOUSAND\u003e apiece from \u003cONE_THOUSAND\u003e earlier indus towers is jpmorgan s overall top pick in the telcos and tower sector it believes vodafone idea s monthly payments should continue to remain on track along with continuous tower additions in fy25 the brokerage firm raised its target ev ebitda multiple to \u003cNINE_\u003e x from \u003cEIGHT_\u003e x along with an increase in the indus tower stock price target to \u003cFIVE_HUNDRED\u003e from \u003cFIVE_HUNDRED\u003e maintaining an overweight rating jpmorgan raised vodafone idea share price target to \u003cONE_TEN\u003e from \u003cSEVEN_\u003e earlier as it upgraded the rating on the counter to neutral from underweight we bake in another tariff hike of \u003cONE_TEN_PERCENT\u003e in fy27 increase our target ev ebitda multiple to \u003cONE_TEN\u003e x from \u003cONE_TEN\u003e x and roll forward to december \u003cTWO_THOUSAND\u003e vodafone idea is still in the early days of proving the success of its strategy that will begin with the capex rollout followed by arresting subscriber losses before regaining share we will wait for proof of success in arresting subscriber losses and balance sheet exposures before turning more constructive jpmorgan said bharti airtel is expected to report a \u003cSIX_PERCENT\u003e quarter on quarter qoq growth in india wireless revenue led by a \u003cNINE_PERCENT\u003e increase in arpu counterbalanced by subscriber churn of \u003cONE_\u003e million the brokerage firm expects bharti hexacom to report a \u003cSIX_PERCENT\u003e qoq revenue growth led by a \u003cSEVEN_PERCENT\u003e increase in arpu while the subscribers could decline by \u003cZERO_\u003e million vodafone idea is estimated to report a \u003cFIVE_PERCENT\u003e qoq revenue growth led by \u003cEIGHT_PERCENT\u003e arpu growth while subscribers should decline by \u003cFOUR_\u003e million indus towers is expected to report a \u003cFOUR_PERCENT\u003e qoq growth in revenue led by tower additions","timestamp":"2024-10-11T10:25:00+05:30","market_timestamp":"2024-10-11T10:25:00+05:30","off_market_hours":false}