{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-sensex-nifty-extends-gains-climbs-over-0-5-as-rbi-changes-stance-to-neutral-11728450048368.html","title":"Stock Market Today: Sensex, Nifty extend gains, climb nearly 1% as RBI changes stance to neutral; most sectors rise","description":"Indian stock markets rose over 0.5% on October 9 after the RBI held the repo rate at 6.5% for the tenth time. The RBI shifted its policy stance to 'neutral', hinting at potential rate cuts, boosting investor sentiment and leading to significant gains in various sectors.","content":"Indian stock markets extended gains on Wednesday, October 9, rising nearly 1 per cent, after the Reserve Bank of India (RBI) altered its policy stance to 'neutral' from 'withdrawal of accommodation,' signalling the possibility of a rate cut in December.The RBI's Monetary Policy Committee (MPC), meanwhile, kept the repo rate unchanged at 6.5 per cent for the tenth consecutive meeting.RBI Governor Shaktikanta Das announced that five of the six MPC members voted to maintain the repo rate at 6.5 per cent, while all members agreed on the change in stance. This shift to a neutral policy outlook is the first in two years, suggesting that the central bank may be preparing for a potential easing of interest rates in the near future.Following the policy announcement, the Indian stock markets surged further. The Sensex gained 608 points or 0.75 per cent to the intra-day high of 82,243, while the broader Nifty rose 204 points or 0.8 per cent to the day's high of 25,217.5. Broader markets outperformed the benchmarks, with midcap and smallcap indices rallying 1.5 per cent each following the announcement.Sector-wise, most sectors traded positively, benefiting from the optimistic market sentiment. Rate-sensitive sectors saw notable gains, with Nifty Realty surging over 2 per cent and Nifty PSU Bank and Nifty Financial Services advancing by around 1.5 per cent each. Nifty Bank, Nifty Private Bank, and Nifty Auto also posted gains of around a per cent each.Among other sectors, Nifty Pharma and Nifty Healthcare jumped 1.5 per cent each, Nifty IT gained 0.8 per cent while Nifty Metal and Nifty Oil and Gas were up around 0.5 per cent each. Nifty FMCG was the only index in the red, down 0.8 per cent.Among Sensex stocks, SBI, Axis Bank, Tata Motors, Bajaj Finance and Bharti Airtel were the top gainers while Nestle, ITC, HUL, Reliance Industries, and M\u0026M emerged as the worst laggards.The RBI maintained its inflation projection for 2024–2025 at 4.5 per cent. Governor Shaktikanta Das provided specific forecasts for inflation, with Q2 at 4.1 per cent, Q3 at 4.8 per cent, and Q4 at 4.2 per cent. For the first quarter of FY26, the CPI inflation projection stands at 4.3 per cent, with risks seen as balanced.On the growth front, the RBI’s monetary policy committee continues to project the Indian economy to grow at 7.2 per cent in the financial year 2024-25 (FY25). While the growth outlook for Q2 FY25 has been moderated, the MPC raised its expectations for the latter half of FY25 and the first quarter of FY26. Governor Das emphasised that the real GDP growth rate for FY25 is expected to be 7.2 per cent, reflecting a steady pace of expansion for the Indian economy.This policy update, combined with the stock market gains, reflects confidence in India’s economic trajectory, with the potential for further growth momentum and easing inflation risks.","cleaned_content":"indian stock markets extended gains on wednesday october \u003cNINE_\u003e rising nearly \u003cONE_PERCENT\u003e after the reserve bank of india rbi altered its policy stance to neutral from withdrawal of accommodation signalling the possibility of a rate cut in december the rbis monetary policy committee mpc meanwhile kept the repo rate unchanged at \u003cSIX_PERCENT\u003e for the tenth consecutive meeting rbi governor shaktikanta das announced that five of the six mpc members voted to maintain the repo rate at \u003cSIX_PERCENT\u003e while all members agreed on the change in stance this shift to a neutral policy outlook is the first in two years suggesting that the central bank may be preparing for a potential easing of interest rates in the near future following the policy announcement the indian stock markets surged further the sensex gained \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to the intra day high of \u003cEIGHT_TEN_THOUSAND\u003e while the broader nifty rose \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to the days high of \u003cTWO_TEN_THOUSAND\u003e broader markets outperformed the benchmarks with midcap and smallcap indices rallying \u003cONE_PERCENT\u003e each following the announcement sector wise most sectors traded positively benefiting from the optimistic market sentiment rate sensitive sectors saw notable gains with nifty realty surging over \u003cTWO_PERCENT\u003e and nifty psu bank and nifty financial services advancing by around \u003cONE_PERCENT\u003e each nifty bank nifty private bank and nifty auto also posted gains of around a per cent each among other sectors nifty pharma and nifty healthcare jumped \u003cONE_PERCENT\u003e each nifty it gained \u003cZERO_PERCENT\u003e while nifty metal and nifty oil and gas were up around \u003cZERO_PERCENT\u003e each nifty fmcg was the only index in the red down \u003cZERO_PERCENT\u003e among sensex stocks sbi axis bank tata motors bajaj finance and bharti airtel were the top gainers while nestle itc hul reliance industries and m m emerged as the worst laggards the rbi maintained its inflation projection for \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e at \u003cFOUR_PERCENT\u003e governor shaktikanta das provided specific forecasts for inflation with q2 at \u003cFOUR_PERCENT\u003e q3 at \u003cFOUR_PERCENT\u003e and q4 at \u003cFOUR_PERCENT\u003e for the first quarter of fy26 the cpi inflation projection stands at \u003cFOUR_PERCENT\u003e with risks seen as balanced on the growth front the rbi s monetary policy committee continues to project the indian economy to grow at \u003cSEVEN_PERCENT\u003e in the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fy25 while the growth outlook for q2 fy25 has been moderated the mpc raised its expectations for the latter half of fy25 and the first quarter of fy26 governor das emphasised that the real gdp growth rate for fy25 is expected to be \u003cSEVEN_PERCENT\u003e reflecting a steady pace of expansion for the indian economy this policy update combined with the stock market gains reflects confidence in india s economic trajectory with the potential for further growth momentum and easing inflation risks","timestamp":"2024-10-09T10:35:00+05:30","market_timestamp":"2024-10-09T10:35:00+05:30","off_market_hours":false}