{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-re-1-srestha-finvest-share-price-hits-5-upper-circuit-after-these-updates-11728539403618.html","title":"Penny stock below Re 1 hits 5% upper circuit as board approves fundraising, preferential share issue","description":"Srestha Finvest shares hit the 5% upper circuit at  ₹0.89 after announcing a fundraising initiative via Qualified Institutional Placement (QIP). The board approved issuing equity shares worth  ₹100 crore for various purposes, subject to necessary approvals..","content":"Penny stock Srestha Finvest hit its 5 per cent upper circuit at  ₹0.89 on Thursday, October 10 following the company’s announcement of a fundraising initiative through Qualified Institutional Placement (QIP). The company also made other key announcements after its board meeting held on October 9.The Board of Directors of the company convened a meeting on October 9, 2024, from 9:00 P.M. to 10:00 P.M., during which several significant matters were discussed and approved.One of the key decisions made was the approval to raise funds by issuing equity shares with a face value of Re.1 each, amounting to a total of  ₹100 crore. This fundraising will be conducted through a Qualified Institutional Placement (QIP) in accordance with applicable laws, the company said in a filing. The board noted that this move is subject to necessary approvals, including those from the company’s members and regulatory authorities.The proceeds from the QIP shall be used for any of the following objectives of the company, i.e. for pre-payment and/or repayment of debts, working capital requirements, general corporate purposes and such other purpose(s) as may be permissible under applicable laws, said the firm.In addition, the board approved the issuance of up to 93 crore equity shares with a face value of Re.1 each, at an issue price of  ₹1.05, which includes a premium of  ₹0.05 per share. This preferential allotment of shares is also subject to necessary approvals from members and other regulatory bodies.Shares totaling 93 crore have been allotted to a diverse group of allottees under the preferential issue. These include Sneha Bhandari, Sunil Bhandari, Financial World India Private Limited, Mayoga Investments Limited, Momento Fabric Fashions Private Limited, Jainex Compuware Manufacturing Private Limited, Kamlesh Vajubhai Nandaniya, Aryadeep Tie-Up Private Limited, Kiwi Delcom Private Limited, Ayodhya Vincom Private Limited, Simplicity Trading, Swastik Trading, Oswal Industries Limited, Alok Kumar, Alok Kumar HUF, Base Engineering LLP, Pratibha Jain, Naina Singh, Rubina Khan, and Mukesh Sharma.Furthermore, the board also decided to increase the company’s borrowing limit to  ₹500 crore. Lastly, the board agreed to convene an Extraordinary General Meeting (EGM) on Friday, November 8, 2024, at 4:00 P.M. at the company's registered office to discuss these matters further and seek member approvals where required.On September 23, 2024, Srestha Finvest reached its record date to determine the eligibility of shareholders for a stock split. Each fully paid-up equity share with a face value of  ₹2 was subdivided into two fully paid equity shares with a face value of  ₹1 each.In the fiscal year 2023-2024, the company reported a profit of  ₹173.86 lakh, a significant turnaround from the loss of  ₹497.41 lakh in 2022-2023. As per RBI regulations, the company transferred  ₹37.51 lakh, or 20 per cent of its net profit, to statutory reserves.Additionally, during 2023-2024, the company issued 25 crore equity shares with a face value of  ₹2 each to selected individuals under the Non-Promoter Public Category. This increased the company's paid-up equity share capital to  ₹116 crore, which was later split into 58 crore fully paid equity shares with a face value of  ₹2 each. The funds raised through the preferential offering were utilised for the company's planned objectives.The stock has gained over 36 per cent in the last one year and 46 per cent year-to-date. The penny stock has climbed 14 per cent in October so far after two straight months of decline. It was down 19.5 per cent in September and 12 per cent in August. Prior to that, the stock rose for four straight months, up 22 per cent in July, 38 per cent in June, 8 per cent in May and 17.6 per cent in April.The scrip is currently over 30 per cent away from its 52-week high of  ₹1.28, hit in July. Meanwhile, it has surged around 82 per cent from its 52-week low of  ₹0.49, recorded in March.","cleaned_content":"penny stock srestha finvest hit its \u003cFIVE_PERCENT\u003e upper circuit at \u003cZERO_\u003e on thursday october \u003cONE_TEN\u003e following the company s announcement of a fundraising initiative through qualified institutional placement qip the company also made other key announcements after its board meeting held on october \u003cNINE_\u003e the board of directors of the company convened a meeting on october \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e from \u003cNINE_\u003e \u003cZERO_\u003e p m to \u003cONE_TEN\u003e \u003cZERO_\u003e p m during which several significant matters were discussed and approved one of the key decisions made was the approval to raise funds by issuing equity shares with a face value of re 1 each amounting to a total of \u003cONE_HUNDRED\u003e crore this fundraising will be conducted through a qualified institutional placement qip in accordance with applicable laws the company said in a filing the board noted that this move is subject to necessary approvals including those from the company s members and regulatory authorities the proceeds from the qip shall be used for any of the following objectives of the company i e for pre payment and or repayment of debts working capital requirements general corporate purposes and such other purpose s as may be permissible under applicable laws said the firm in addition the board approved the issuance of up to \u003cNINE_TEN\u003e crore equity shares with a face value of re 1 each at an issue price of \u003cONE_\u003e which includes a premium of \u003cZERO_\u003e per share this preferential allotment of shares is also subject to necessary approvals from members and other regulatory bodies shares totaling \u003cNINE_TEN\u003e crore have been allotted to a diverse group of allottees under the preferential issue these include sneha bhandari sunil bhandari financial world india private limited mayoga investments limited momento fabric fashions private limited jainex compuware manufacturing private limited kamlesh vajubhai nandaniya aryadeep tie up private limited kiwi delcom private limited ayodhya vincom private limited simplicity trading swastik trading oswal industries limited alok kumar alok kumar huf base engineering llp pratibha jain naina singh rubina khan and mukesh sharma furthermore the board also decided to increase the company s borrowing limit to \u003cFIVE_HUNDRED\u003e crore lastly the board agreed to convene an extraordinary general meeting egm on friday november \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e at \u003cFOUR_\u003e \u003cZERO_\u003e p m at the companys registered office to discuss these matters further and seek member approvals where required on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e srestha finvest reached its record date to determine the eligibility of shareholders for a stock split each fully paid up equity share with a face value of \u003cTWO_\u003e was subdivided into two fully paid equity shares with a face value of \u003cONE_\u003e each in the fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e the company reported a profit of \u003cONE_HUNDRED\u003e lakh a significant turnaround from the loss of \u003cFOUR_HUNDRED\u003e lakh in \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e as per rbi regulations the company transferred \u003cTHREE_TEN\u003e lakh or \u003cTWO_TEN_PERCENT\u003e of its net profit to statutory reserves additionally during \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e the company issued \u003cTWO_TEN\u003e crore equity shares with a face value of \u003cTWO_\u003e each to selected individuals under the non promoter public category this increased the companys paid up equity share capital to \u003cONE_HUNDRED\u003e crore which was later split into \u003cFIVE_TEN\u003e crore fully paid equity shares with a face value of \u003cTWO_\u003e each the funds raised through the preferential offering were utilised for the companys planned objectives the stock has gained over \u003cTHREE_TEN_PERCENT\u003e in the last one year and \u003cFOUR_TEN_PERCENT\u003e year to date the penny stock has climbed \u003cONE_TEN_PERCENT\u003e in october so far after two straight months of decline it was down \u003cONE_TEN_PERCENT\u003e in september and \u003cONE_TEN_PERCENT\u003e in august prior to that the stock rose for four straight months up \u003cTWO_TEN_PERCENT\u003e in july \u003cTHREE_TEN_PERCENT\u003e in june \u003cEIGHT_PERCENT\u003e in may and \u003cONE_TEN_PERCENT\u003e in april the scrip is currently over \u003cTHREE_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cONE_\u003e hit in july meanwhile it has surged around \u003cEIGHT_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cZERO_\u003e recorded in march","timestamp":"2024-10-10T11:51:00+05:30","market_timestamp":"2024-10-10T11:51:00+05:30","off_market_hours":false}