{"url":"https://www.livemint.com/market/stock-market-news/suzlon-energy-shares-back-to-winning-ways-gain-nearly-13-in-2-days-whats-behind-the-rebound-11728455828042.html","title":"Suzlon Energy shares back to winning ways, gain nearly 13% in 2 days. What’s behind the rebound?","description":"Suzlon Energy's share price surged 9.5% today, taking its two-day gains to over 13%. The stock's removal from the ASM framework reduces volatility concerns. The company is competing for a Tata Power contract.","content":"Shares of Suzlon Energy resumed their winning streak after a brief pause, rising 13.5% in two days. The stock rose 9.5% in intra-day trade on Wednesday, October 9, to  ₹80.60 each, close to their recent peak of  ₹86.On Tuesday, the it broke an eight-day losing streak, gaining 4% after it was removed from the Additional Surveillance Measure (ASM) framework. Following this development, its upper circuit limit of the stock was revised upwards to 10% from 5% earlier.Removal from the ASM framework indicates a reduced likelihood of price manipulation or volatility concerns associated with the stock.In addition, a media report suggested that the company is actively pursuing bids to supply wind turbines to Tata Power. The Tata Group is seeking proposals for wind turbines with a total capacity exceeding 3 gigawatts (GW) to be installed at its wind-solar hybrid renewable energy facilities across the country over the next three to five years, as reported by the Economic Times.Original equipment manufacturers of wind turbines, including Siemens Gamesa, Senvion India, Envision Energy, and Suzlon Energy, are competing for the opportunity to fulfil Tata Power's requirements, the report added.Furthermore, the company aims to enhance its renewable energy capabilities within other Tata Group companies, such as Tata Steel.In early September, Suzlon Energy received a significant order from NTPC Green Energy, the renewable energy division of the state-owned power producer NTPC, for the installation of 370 wind turbine generators (WTGs) of the S144 model. Each turbine will be equipped with a hybrid lattice tubular (HLT) tower and a rated capacity of 3.15 MW.The S144 wind turbine is among the largest in India and can be extended up to 3.15 MW, depending on the wind conditions at the site. It is available with a hub height of 140 meters, which can be increased to 160 meters with its serial launch.Suzlon has claimed that the S144, at a hub height of 160 meters, is also the tallest wind turbine in India. This new fleet is designed to provide 40% to 43% higher energy generation compared to Suzlon's previous turbine models.The company's shares have shown robust momentum in the market, reaching new multi-month highs. Since March 2023, the stock has followed a strong upward trend, with an impressive gain of 882% to date.Investor confidence has been bolstered by the company's strong quarterly financial performance, efforts to reduce debt, and notable order wins. By the end of Q1 FY25, its order book expanded to 3.8 GW, marking the largest in the company's history.This significant surge in share price has also propelled the company's market capitalisation past the  ₹1 lakh crore mark in August.","cleaned_content":"shares of suzlon energy resumed their winning streak after a brief pause rising \u003cONE_TEN_PERCENT\u003e in two days the stock rose \u003cNINE_PERCENT\u003e in intra day trade on wednesday october \u003cNINE_\u003e to \u003cEIGHT_TEN\u003e each close to their recent peak of \u003cEIGHT_TEN\u003e on tuesday the it broke an eight day losing streak gaining \u003cFOUR_PERCENT\u003e after it was removed from the additional surveillance measure asm framework following this development its upper circuit limit of the stock was revised upwards to \u003cONE_TEN_PERCENT\u003e from \u003cFIVE_PERCENT\u003e earlier removal from the asm framework indicates a reduced likelihood of price manipulation or volatility concerns associated with the stock in addition a media report suggested that the company is actively pursuing bids to supply wind turbines to tata power the tata group is seeking proposals for wind turbines with a total capacity exceeding \u003cTHREE_\u003e gigawatts gw to be installed at its wind solar hybrid renewable energy facilities across the country over the next three to five years as reported by the economic times original equipment manufacturers of wind turbines including siemens gamesa senvion india envision energy and suzlon energy are competing for the opportunity to fulfil tata powers requirements the report added furthermore the company aims to enhance its renewable energy capabilities within other tata group companies such as tata steel in early september suzlon energy received a significant order from ntpc green energy the renewable energy division of the state owned power producer ntpc for the installation of \u003cTHREE_HUNDRED\u003e wind turbine generators wtgs of the s144 model each turbine will be equipped with a hybrid lattice tubular hlt tower and a rated capacity of \u003cTHREE_\u003e mw the s144 wind turbine is among the largest in india and can be extended up to \u003cTHREE_\u003e mw depending on the wind conditions at the site it is available with a hub height of \u003cONE_HUNDRED\u003e meters which can be increased to \u003cONE_HUNDRED\u003e meters with its serial launch suzlon has claimed that the s144 at a hub height of \u003cONE_HUNDRED\u003e meters is also the tallest wind turbine in india this new fleet is designed to provide \u003cFOUR_TEN_PERCENT\u003e to \u003cFOUR_TEN_PERCENT\u003e higher energy generation compared to suzlons previous turbine models the companys shares have shown robust momentum in the market reaching new multi month highs since march \u003cTWO_THOUSAND\u003e the stock has followed a strong upward trend with an impressive gain of \u003cEIGHT_HUNDRED_PERCENT\u003e to date investor confidence has been bolstered by the companys strong quarterly financial performance efforts to reduce debt and notable order wins by the end of q1 fy25 its order book expanded to \u003cTHREE_\u003e gw marking the largest in the companys history this significant surge in share price has also propelled the companys market capitalisation past the \u003cONE_\u003e lakh crore mark in august","timestamp":"2024-10-09T13:37:00+05:30","market_timestamp":"2024-10-09T13:37:00+05:30","off_market_hours":false}