{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-below-50-lic-owned-vakrangee-share-price-hits-5-upper-circuit-11728537886024.html","title":"Small-cap stock below  ₹50: LIC-owned Vakrangee share price hits 5% upper circuit","description":"Small-cap stock: Vakrangee shares rose for the third consecutive session, opening at a 5% upper circuit of  ₹32.06 on BSE. The stock has gained 16% over the last three days, reflecting strong traction in its performance.","content":"Small-cap stock: Vakrangee share price continued to witness strong traction for the third consecutive session as the stock opened at a 5 per cent upper circuit of  ₹32.06 on BSE on Thursday, October 10. Shares of this LIC portfolio stock have been on a steady rise since Tuesday, gaining 5 per cent each day. At the current price of  ₹32.06, the stock has gained nearly 16 per cent in the last three days.The stock snapped its four-day losing streak on October 8, a day after it announced the launch of its own private-label apparel products across its e-commerce business.\"Vakrangee proudly announces the sourcing and distribution of its own Private Label Apparel products under the e-commerce business category. The company has successfully launched the pilot phase in the apparel segment and would leverage the extensive network of Vakrangee Kendra outlets, including both Franchisee and Master Franchisee channels,\" the company said in an exchange filing.After the pilot project, the company plans to scale the initiative to a pan-India level.\"Vakrangee Kendras are exclusive format outlets offering a comprehensive range of products and services across banking, insurance, ATM, assisted e-commerce, e-governance and Total Healthcare. We will continue to add more products and services to offer our customers a one-stop solution to all their needs,\" the company said.Vakrangee share price has been on a roll over the last year, surging as much as 95 per cent. It hit its 52-week high of  ₹37.72 on October 1 this year and a 52-week low of  ₹16.45 on October 11 last year.On a monthly scale, the stock surged 74 per cent in September. However, after reaching a peak on October 1, it faced profit booking and has declined by 10 per cent this month despite the last three days of solid gains.Vakrangee's shareholding pattern data for the June quarter of the current financial year shows that by the end of the quarter, Life Insurance Corporation of India held 6,58,14,647 shares, equivalent to a 6.11 per cent stake in the company.By the end of the same quarter, foreign portfolio investors (FPIs) held 3,15,03,809 shares, or 2.93 per cent, of the company's shares.Promoters and promoter groups of the company cumulatively held 41.92 per cent stake in the company.The stock's rise over the last year has been impressive. However, some technical experts underscore that the stock has a key resistance around the 200-period exponential moving average.Jigar S. Patel, Senior Manager of Equity Research at Anand Rathi Share and Stock Brokers, pointed out that the stock has faced consistent resistance around the weekly chart's 200-period exponential moving average (EMA).Patel said this technical level has historically acted as a barrier, leading to corrective moves whenever the stock price tests. Given this recurring pattern of pullbacks from the 200-period EMA, it is prudent to book profits at current levels.Furthermore, Patel added that initiating fresh long positions at this stage may carry higher risk, as the stock could experience another correction.\"Avoiding new entries is recommended until clearer signs of strength or a breakthrough above the EMA are seen,\" said Patel.Read all market-related news here","cleaned_content":"small cap stock vakrangee share price continued to witness strong traction for the third consecutive session as the stock opened at a \u003cFIVE_PERCENT\u003e upper circuit of \u003cTHREE_TEN\u003e on bse on thursday october \u003cONE_TEN\u003e shares of this lic portfolio stock have been on a steady rise since tuesday gaining \u003cFIVE_PERCENT\u003e each day at the current price of \u003cTHREE_TEN\u003e the stock has gained nearly \u003cONE_TEN_PERCENT\u003e in the last three days the stock snapped its four day losing streak on october \u003cEIGHT_\u003e a day after it announced the launch of its own private label apparel products across its e commerce business vakrangee proudly announces the sourcing and distribution of its own private label apparel products under the e commerce business category the company has successfully launched the pilot phase in the apparel segment and would leverage the extensive network of vakrangee kendra outlets including both franchisee and master franchisee channels the company said in an exchange filing after the pilot project the company plans to scale the initiative to a pan india level vakrangee kendras are exclusive format outlets offering a comprehensive range of products and services across banking insurance atm assisted e commerce e governance and total healthcare we will continue to add more products and services to offer our customers a one stop solution to all their needs the company said vakrangee share price has been on a roll over the last year surging as much as \u003cNINE_TEN_PERCENT\u003e it hit its \u003cFIVE_TEN\u003e week high of \u003cTHREE_TEN\u003e on october \u003cONE_\u003e this year and a \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e on october \u003cONE_TEN\u003e last year on a monthly scale the stock surged \u003cSEVEN_TEN_PERCENT\u003e in september however after reaching a peak on october \u003cONE_\u003e it faced profit booking and has declined by \u003cONE_TEN_PERCENT\u003e this month despite the last three days of solid gains vakrangees shareholding pattern data for the june quarter of the current financial year shows that by the end of the quarter life insurance corporation of india held \u003cSIX_TEN_MILLION\u003e shares equivalent to a \u003cSIX_PERCENT\u003e stake in the company by the end of the same quarter foreign portfolio investors fpis held \u003cTHREE_TEN_MILLION\u003e shares or \u003cTWO_PERCENT\u003e of the companys shares promoters and promoter groups of the company cumulatively held \u003cFOUR_TEN_PERCENT\u003e stake in the company the stocks rise over the last year has been impressive however some technical experts underscore that the stock has a key resistance around the \u003cTWO_HUNDRED\u003e period exponential moving average jigar s patel senior manager of equity research at anand rathi share and stock brokers pointed out that the stock has faced consistent resistance around the weekly charts \u003cTWO_HUNDRED\u003e period exponential moving average ema patel said this technical level has historically acted as a barrier leading to corrective moves whenever the stock price tests given this recurring pattern of pullbacks from the \u003cTWO_HUNDRED\u003e period ema it is prudent to book profits at current levels furthermore patel added that initiating fresh long positions at this stage may carry higher risk as the stock could experience another correction avoiding new entries is recommended until clearer signs of strength or a breakthrough above the ema are seen said patel read all market related news here","timestamp":"2024-10-10T12:07:00+05:30","market_timestamp":"2024-10-10T12:07:00+05:30","off_market_hours":false}