{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-hdfc-bank-titan-indusind-bank-rec-godrej-properties-and-more-11728234721348.html","title":"Stocks to Watch: HDFC Bank, Titan, IndusInd Bank, REC, Godrej Properties, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"HDFC Bank reported a deposit growth of over  ₹1.2 trillion in Q2FY25, surpassing market expectations. The bank's deposits increased 5.1 percent sequentially, bringing the total deposit base to  ₹25 trillion, a 15.1 percent year-on-year increase. Gross advances stood at  ₹25.19 trillion, marking a 7 percent YoY rise. The bank is focused on reducing its loan-to-deposit ratio post its merger with HDFC. Analysts also expect substantial inflows as HDFC Bank’s weight in MSCI indices is set to rise, potentially attracting over $1.8 billion in foreign investment.Titan reported a strong performance in its jewellery division, with domestic operations growing nearly 25 percent year-on-year, driven by a surge in consumer demand after the reduction in customs duty on gold imports. While the non-solitaire studded segment grew in high double digits, the solitaire segment saw a decline due to price volatility and demand-supply challenges. Titan's Watches and Wearables division recorded 19 percent growth YoY, and EyeCare's domestic business grew 6 percent. Additionally, Taneira's revenue saw an 11 percent YoY growth.IndusInd Bank's net advances grew 13 percent year-on-year and 3 percent sequentially to  ₹3.56 lakh crore. Deposits increased 15 percent YoY and 4 percent from June, reaching  ₹4.12 lakh crore. However, the CASA ratio decreased to 35.9 percent from 39.4 percent YoY and 36.7 percent in the previous quarter.REC reported loan disbursements totaling  ₹90,955 crore in H1FY25, reflecting a 20.1 percent YoY increase. A significant portion of these disbursements comprised green loans, underlining REC’s commitment to renewable energy financing, which made up 13 percent of total loans in Q2FY25.Bank of Maharashtra saw an increase in Life Insurance Corporation of India's shareholding, which rose from 4.05 percent to 7.10 percent following a Qualified Institutional Placement (QIP). LIC acquired 3.376 percent equity at an average price of  ₹57.36, indicating confidence in the bank's future.Federal Bank's total deposits grew 15.6 percent year-on-year and 1.1 percent sequentially, reaching  ₹2.69 lakh crore. Advances were up 19.3 percent YoY and 4.3 percent sequentially to  ₹2.33 lakh crore. The CASA ratio stood at 30 percent, down from 31.17 percent last year and 29.27 percent in June.Godrej Properties reported strong sales performance with bookings exceeding  ₹13,800 crore in H1FY25. The company is targeting  ₹27,500 crore in sales for FY25, benefiting from robust demand for premium homes.Macrotech Developers achieved record pre-sales of  ₹4,290 crore in Q2FY25, marking a 21 percent YoY increase. The company also reported collections of  ₹3,070 crore, up 11 percent YoY.","cleaned_content":"hdfc bank reported a deposit growth of over \u003cONE_\u003e trillion in q2fy25 surpassing market expectations the banks deposits increased \u003cFIVE_PERCENT\u003e sequentially bringing the total deposit base to \u003cTWO_TEN\u003e trillion a \u003cONE_TEN_PERCENT\u003e year on year increase gross advances stood at \u003cTWO_TEN\u003e trillion marking a \u003cSEVEN_PERCENT\u003e yoy rise the bank is focused on reducing its loan to deposit ratio post its merger with hdfc analysts also expect substantial inflows as hdfc bank s weight in msci indices is set to rise potentially attracting over \u003cONE_\u003e billion in foreign investment titan reported a strong performance in its jewellery division with domestic operations growing nearly \u003cTWO_TEN_PERCENT\u003e year on year driven by a surge in consumer demand after the reduction in customs duty on gold imports while the non solitaire studded segment grew in high double digits the solitaire segment saw a decline due to price volatility and demand supply challenges titans watches and wearables division recorded \u003cONE_TEN_PERCENT\u003e growth yoy and eyecares domestic business grew \u003cSIX_PERCENT\u003e additionally taneiras revenue saw an \u003cONE_TEN_PERCENT\u003e yoy growth indusind banks net advances grew \u003cONE_TEN_PERCENT\u003e year on year and \u003cTHREE_PERCENT\u003e sequentially to \u003cTHREE_\u003e lakh crore deposits increased \u003cONE_TEN_PERCENT\u003e yoy and \u003cFOUR_PERCENT\u003e from june reaching \u003cFOUR_\u003e lakh crore however the casa ratio decreased to \u003cTHREE_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e yoy and \u003cTHREE_TEN_PERCENT\u003e in the previous quarter rec reported loan disbursements totaling \u003cNINE_TEN_THOUSAND\u003e crore in h1fy25 reflecting a \u003cTWO_TEN_PERCENT\u003e yoy increase a significant portion of these disbursements comprised green loans underlining rec s commitment to renewable energy financing which made up \u003cONE_TEN_PERCENT\u003e of total loans in q2fy25 bank of maharashtra saw an increase in life insurance corporation of indias shareholding which rose from \u003cFOUR_PERCENT\u003e to \u003cSEVEN_PERCENT\u003e following a qualified institutional placement qip lic acquired \u003cTHREE_PERCENT\u003e equity at an average price of \u003cFIVE_TEN\u003e indicating confidence in the banks future federal banks total deposits grew \u003cONE_TEN_PERCENT\u003e year on year and \u003cONE_PERCENT\u003e sequentially reaching \u003cTWO_\u003e lakh crore advances were up \u003cONE_TEN_PERCENT\u003e yoy and \u003cFOUR_PERCENT\u003e sequentially to \u003cTWO_\u003e lakh crore the casa ratio stood at \u003cTHREE_TEN_PERCENT\u003e down from \u003cTHREE_TEN_PERCENT\u003e last year and \u003cTWO_TEN_PERCENT\u003e in june godrej properties reported strong sales performance with bookings exceeding \u003cONE_TEN_THOUSAND\u003e crore in h1fy25 the company is targeting \u003cTWO_TEN_THOUSAND\u003e crore in sales for fy25 benefiting from robust demand for premium homes macrotech developers achieved record pre sales of \u003cFOUR_THOUSAND\u003e crore in q2fy25 marking a \u003cTWO_TEN_PERCENT\u003e yoy increase the company also reported collections of \u003cTHREE_THOUSAND\u003e crore up \u003cONE_TEN_PERCENT\u003e yoy","timestamp":"2024-10-07T08:22:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}