{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-11-11728610188218.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 11","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a weak start for the Indian benchmark index. The Gift Nifty was trading around 25,090 level, a discount of nearly 30 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open on a tepid note on Friday tracking mixed sentiment in global markets.The trends on Gift Nifty also indicate a weak start for the Indian benchmark index. The Gift Nifty was trading around 25,090 level, a discount of nearly 30 points from the Nifty futures’ previous close.On Thursday, the domestic equity market ended with minor gains amid strong global cues.The Sensex rose 144.31 points to close at 81,611.41, while the Nifty 50 settled 16.50 points, or 0.07%, higher at 24,998.45.Nifty 50 formed a small negative candle on the daily chart with minor upper shadow.“Technically, this pattern indicates range bound action around 25,150 - 24,950 levels. The formation of long upper shadows indicates the emergence of weakness from near the hurdles. The double bottom formation in Nifty 50 around 24,700 is still not confirmed as the market is not sustaining with follow-through upside bounces. Any decline below the recent swing low of 24,700 levels could mean bearish lower top confirmation at 25,230 for short-term and that could change the underlying trend to negative,” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.However, Shetti believes if Nifty manages to sustain above the resistance of 25,250 - 25,300 levels in the next 1-2 sessions, then a fresh round of up move could resume and that could possibly pull Nifty towards the next hurdle of 25,500 - 25,600 levels in the near term.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 shifted into a consolidation with narrow range movement on October 10 and closed the day higher by 16 points.“On the daily chart, the Nifty 50 index has been failing to reclaim 50-EMA (Exponential Moving Average) for the last two days, indicating prevailing weakness. On the lower end, support is placed at 24,950 – 24,900. A fall below 24,900 could trigger a correction toward 24,750 – 24,700. On the other hand, resistance is seen at 25,150, and a move above this level could push the index towards 25,350 – 25,400 in the short term,” said Rupak De, Senior Technical Analyst, LKP Securities.Dr. Praveen Dwarakanath, Vice President of Hedged.in noted that the Nifty 50 formed an insider candle, indicating indecisiveness, and the rally during the day was sold-off, indicating weakness to continue in the index.“ADX DI- line continues to trend downward, still not showing signs of a further fall, however, momentum indicators are hinting towards a fall in the index. Options writer’s data showed a short covering of 25,300 puts while an increase in call writing at 25,000 and above levels, indicating a sideways to downside bias in the index,” said Dwarakanath.Meanwhile, given the current market conditions, VLA Ambala, Co-Founder of Stock Market Today recommends taking a neutral approach over the next few weeks until prices stabilize.“Technically, Nifty ended the day at 24,998.45, forming a small red range Doji candlestick pattern on the daily timeframe. The index is currently trading below both the 20 and 50-day EMAs, making the bearish outlook very evident. Currently, the Nifty RSI level is 42 on daily, 59 on weekly, and 75 on monthly timeframe, indicating that traders should be cautious. I recommend using a sell-on-rise strategy,” Ambala said.According to her, the Nifty 50 index can expect support near 24,930, 24,800, or 24,650 and resistance near 25,080 to 25,240.Bank Nifty index outperformed the Nifty 50 on Thursday and ended 523.90 points, or 1.03%, higher at 51,530.90, forming an insider candle, indicating indecisiveness in the index.“The momentum indicators are bouncing from the oversold region, indicating a possible upside from the present levels. However, the ADX DI- line is still above the ADX DI+ line, indicating weakness in the index. Immediate resistance at 51,700 levels was not touched in Thursday’s rally too, indicating the prevalent weakness in the index to continue,” said Dr. Praveen Dwarakanath.Options writer’s data showed a short covering of 51,500 calls while the 51,500 puts were seen to be written, indicating a possible bounce till the resistance levels, he added.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open on a tepid note on friday tracking mixed sentiment in global markets the trends on gift nifty also indicate a weak start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a discount of nearly \u003cTHREE_TEN\u003e points from the nifty futures previous close on thursday the domestic equity market ended with minor gains amid strong global cues the sensex rose \u003cONE_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_TEN\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart with minor upper shadow technically this pattern indicates range bound action around \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels the formation of long upper shadows indicates the emergence of weakness from near the hurdles the double bottom formation in nifty \u003cFIVE_TEN\u003e around \u003cTWO_TEN_THOUSAND\u003e is still not confirmed as the market is not sustaining with follow through upside bounces any decline below the recent swing low of \u003cTWO_TEN_THOUSAND\u003e levels could mean bearish lower top confirmation at \u003cTWO_TEN_THOUSAND\u003e for short term and that could change the underlying trend to negative said nagaraj shetti senior technical research analyst at hdfc securities however shetti believes if nifty manages to sustain above the resistance of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in the next \u003cONE_\u003e \u003cTWO_\u003e sessions then a fresh round of up move could resume and that could possibly pull nifty towards the next hurdle of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels in the near term here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e shifted into a consolidation with narrow range movement on october \u003cONE_TEN\u003e and closed the day higher by \u003cONE_TEN\u003e points on the daily chart the nifty \u003cFIVE_TEN\u003e index has been failing to reclaim \u003cFIVE_TEN\u003e ema exponential moving average for the last two days indicating prevailing weakness on the lower end support is placed at \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e a fall below \u003cTWO_TEN_THOUSAND\u003e could trigger a correction toward \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e on the other hand resistance is seen at \u003cTWO_TEN_THOUSAND\u003e and a move above this level could push the index towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e in the short term said rupak de senior technical analyst lkp securities dr praveen dwarakanath vice president of hedged in noted that the nifty \u003cFIVE_TEN\u003e formed an insider candle indicating indecisiveness and the rally during the day was sold off indicating weakness to continue in the index adx di line continues to trend downward still not showing signs of a further fall however momentum indicators are hinting towards a fall in the index options writer s data showed a short covering of \u003cTWO_TEN_THOUSAND\u003e puts while an increase in call writing at \u003cTWO_TEN_THOUSAND\u003e and above levels indicating a sideways to downside bias in the index said dwarakanath meanwhile given the current market conditions vla ambala co founder of stock market today recommends taking a neutral approach over the next few weeks until prices stabilize technically nifty ended the day at \u003cTWO_TEN_THOUSAND\u003e forming a small red range doji candlestick pattern on the daily timeframe the index is currently trading below both the \u003cTWO_TEN\u003e and \u003cFIVE_TEN\u003e day emas making the bearish outlook very evident currently the nifty rsi level is \u003cFOUR_TEN\u003e on daily \u003cFIVE_TEN\u003e on weekly and \u003cSEVEN_TEN\u003e on monthly timeframe indicating that traders should be cautious i recommend using a sell on rise strategy ambala said according to her the nifty \u003cFIVE_TEN\u003e index can expect support near \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e or \u003cTWO_TEN_THOUSAND\u003e and resistance near \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e bank nifty index outperformed the nifty \u003cFIVE_TEN\u003e on thursday and ended \u003cFIVE_HUNDRED\u003e points or \u003cONE_PERCENT\u003e higher at \u003cFIVE_TEN_THOUSAND\u003e forming an insider candle indicating indecisiveness in the index the momentum indicators are bouncing from the oversold region indicating a possible upside from the present levels however the adx di line is still above the adx di line indicating weakness in the index immediate resistance at \u003cFIVE_TEN_THOUSAND\u003e levels was not touched in thursday s rally too indicating the prevalent weakness in the index to continue said dr praveen dwarakanath options writer s data showed a short covering of \u003cFIVE_TEN_THOUSAND\u003e calls while the \u003cFIVE_TEN_THOUSAND\u003e puts were seen to be written indicating a possible bounce till the resistance levels he added","timestamp":"2024-10-11T07:21:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}