{"url":"https://www.livemint.com/market/stock-market-news/car-makers-festive-hopes-hang-in-balance-as-sales-continue-to-slump-11728530706429.html","title":"Car makers’ festive hopes hang in balance as sales continue to slump","description":"Indian car manufacturers are hopeful of a boost to sales during the festive season. With discounts and seasonal spending expected to drive demand, October's performance is crucial for setting a positive growth trajectory for FY25.","content":"Indian car makers are hopeful that the ongoing festive season will bring a much-needed boost to their sales. With inventory levels rising to alarming levels due to sluggish demand and the market showing signs of a slowdown, manufacturers are counting on the seasonal uptick in consumer spending to help clear stock and drive growth.Top manufacturers have already announced discounts of up to  ₹2 lakh on their best-selling models in recent months to boost sales. However, this has yet to fully translate into actual sales.The Indian automobile industry is now hopeful as the Shraddh period for 2024 concluded on October 2, marking the end of the 16-day Pitru Paksha, which began on September 17.Shraddh is considered an inauspicious time in the Hindu calendar, during which people typically avoid making new purchases. Last year, despite Shraddh extending until October 14, Indian car manufacturers sold 3,53,990 units, even against a high base. As Shraddh ends at the start of October and discounts increase, companies expect sales to pick up.The onset of Onam and Ganesh Chaturthi, which traditionally marks the beginning of India's annual festive season, has not revived sales as expected. However, with Navratri and Diwali occurring in the same month, automakers are optimistic that sales will pick up notably.According to domestic brokerage firm Motilal Oswal's channel checks, the initial festive season has shown limited momentum, making the upcoming Navratri-Diwali period crucial for overall FY25 sales.Meanwhile, the latest retail sales data from the Federation of Automobile Dealers Associations (FADA) indicates ongoing challenges in the passenger vehicle segment, as sales declined for the third consecutive month, leading to record-high inventory levels.In September, sales apart from the Shraddh period, were also hindered by heavy rains, which resulted in delayed purchases and a sluggish market. Passenger vehicle retail sales fell to 275,681 units, marking an 18.81% year-on-year decrease from 339,543 units sold during the same month last year.Additionally, September sales were lower than the 309,053 units sold in August. This continued decline in sales has left dealers with historically high inventory levels, averaging 80-85 days, which translates to approximately 790,000 vehicles valued at  ₹79,000 crore, according to FADA.Given the all-time high inventory levels, experts believe that if sales do not improve as anticipated in October, dealers may face significant financial pressure from unsold stock accumulating in their warehouses.\"While dealers and OEMs are betting on robust festive sales, especially in rural markets where positive cash flow and better agricultural conditions are expected to spur demand, the outcome remains uncertain. A successful October is essential to clear out excess inventory and set a positive growth trajectory for the remainder of FY25,\" said FADA President, Mr C S Vigneshwar.\"With rising inquiries and optimistic dealer sentiments, the outlook leans towards optimism, but high stakes and dependency on October’s performance warrant a cautious approach. If the anticipated sales do not materialize, it could shift the outlook to pessimistic, putting dealers as well as OEMs in a difficult position heading into the new year,\" he added.Domestic brokerage firm Prabhudas Lilladher noted in its latest report that passenger vehicle (PV) volumes in the September quarter were impacted by reduced foot traffic due to the monsoon and a high base from the previous year. This resulted in a volume decline for Maruti Suzuki India Ltd. (MSIL) and Tata Motors Ltd. (TTMT).\"Mahindra \u0026 Mahindra continues to report strong growth owing to new launches, which led to the overall mix of UVs improving by 474 bps YoY. Maruti Suzuki UV volume growth remained flat, but slowdown in the small car segment improved its penetration by 176 bps YoY. In contrast, Tata Motors PV volume declined by 5.9% YoY, dragged by competition and its EV business. Hence, we expect revenue for our PV universe to increase by 3% YoY,\" said the brokerage.","cleaned_content":"indian car makers are hopeful that the ongoing festive season will bring a much needed boost to their sales with inventory levels rising to alarming levels due to sluggish demand and the market showing signs of a slowdown manufacturers are counting on the seasonal uptick in consumer spending to help clear stock and drive growth top manufacturers have already announced discounts of up to \u003cTWO_\u003e lakh on their best selling models in recent months to boost sales however this has yet to fully translate into actual sales the indian automobile industry is now hopeful as the shraddh period for \u003cTWO_THOUSAND\u003e concluded on october \u003cTWO_\u003e marking the end of the \u003cONE_TEN\u003e day pitru paksha which began on september \u003cONE_TEN\u003e shraddh is considered an inauspicious time in the hindu calendar during which people typically avoid making new purchases last year despite shraddh extending until october \u003cONE_TEN\u003e indian car manufacturers sold \u003cTHREE_HUNDRED_THOUSAND\u003e units even against a high base as shraddh ends at the start of october and discounts increase companies expect sales to pick up the onset of onam and ganesh chaturthi which traditionally marks the beginning of indias annual festive season has not revived sales as expected however with navratri and diwali occurring in the same month automakers are optimistic that sales will pick up notably according to domestic brokerage firm motilal oswals channel checks the initial festive season has shown limited momentum making the upcoming navratri diwali period crucial for overall fy25 sales meanwhile the latest retail sales data from the federation of automobile dealers associations fada indicates ongoing challenges in the passenger vehicle segment as sales declined for the third consecutive month leading to record high inventory levels in september sales apart from the shraddh period were also hindered by heavy rains which resulted in delayed purchases and a sluggish market passenger vehicle retail sales fell to \u003cTWO_HUNDRED_THOUSAND\u003e units marking an \u003cONE_TEN_PERCENT\u003e year on year decrease from \u003cTHREE_HUNDRED_THOUSAND\u003e units sold during the same month last year additionally september sales were lower than the \u003cTHREE_HUNDRED_THOUSAND\u003e units sold in august this continued decline in sales has left dealers with historically high inventory levels averaging \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN\u003e days which translates to approximately \u003cSEVEN_HUNDRED_THOUSAND\u003e vehicles valued at \u003cSEVEN_TEN_THOUSAND\u003e crore according to fada given the all time high inventory levels experts believe that if sales do not improve as anticipated in october dealers may face significant financial pressure from unsold stock accumulating in their warehouses while dealers and oems are betting on robust festive sales especially in rural markets where positive cash flow and better agricultural conditions are expected to spur demand the outcome remains uncertain a successful october is essential to clear out excess inventory and set a positive growth trajectory for the remainder of fy25 said fada president mr c s vigneshwar with rising inquiries and optimistic dealer sentiments the outlook leans towards optimism but high stakes and dependency on october s performance warrant a cautious approach if the anticipated sales do not materialize it could shift the outlook to pessimistic putting dealers as well as oems in a difficult position heading into the new year he added domestic brokerage firm prabhudas lilladher noted in its latest report that passenger vehicle pv volumes in the september quarter were impacted by reduced foot traffic due to the monsoon and a high base from the previous year this resulted in a volume decline for maruti suzuki india ltd msil and tata motors ltd ttmt mahindra mahindra continues to report strong growth owing to new launches which led to the overall mix of uvs improving by \u003cFOUR_HUNDRED\u003e bps yoy maruti suzuki uv volume growth remained flat but slowdown in the small car segment improved its penetration by \u003cONE_HUNDRED\u003e bps yoy in contrast tata motors pv volume declined by \u003cFIVE_PERCENT\u003e yoy dragged by competition and its ev business hence we expect revenue for our pv universe to increase by \u003cTHREE_PERCENT\u003e yoy said the brokerage","timestamp":"2024-10-10T12:49:00+05:30","market_timestamp":"2024-10-10T12:49:00+05:30","off_market_hours":false}