{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-tata-chemicals-dredging-corporation-vip-are-the-3-technical-picks-of-the-week-by-axis-securities-11728281219908.html","title":"Stocks to Buy: Tata Chemicals, Dredging Corporation ,VIP  are the 3 technical picks of the week by Axis Securities","description":"Stocks to Buy: Tata Chemicals, Dredging Corporation of India Ltd, VIP Industries Ltd are the three technical stock picks of the week by Axis Securities. Check details","content":"Stock Markets Today: VIP Industries Ltd. Tata Chemicals Ltd , Dredging Corporation of India Ltd are the three technical stock picks of the week by Axis Securities.VIP Industries as per Axis has successfully broken out of a \"Falling Channel\" pattern at 510 on the weekly chart during the last week of September 2024, signaling a potential onset of an uptrend. The Axis analysis indicates an upside to  ₹624-645 levels.* The holding period as per Axis is 3 to 4 weeks.2. Tata Chemicals: Axis Securities recommends buying Tata Chemicals in the range of  ₹1120-1098 with a stop loss at  ₹1072 for an upside of 7% – 9%Tata Chemicals share price as per Axis Securities has confirmed a breakout above the “Symmetrical Triangle\" pattern at the 1100 level on the weekly chart, accompanied by a strong bullish candle, signaling a continuation of the medium-term uptrend. The weekly RSI has broken above the downward-sloping trendline, further confirming the strength in pricesAxis analysis indicates an upside to  ₹1185-1213 levels. The holding period for Tata Chemicals is 3 to 4 weeks.Axis recommends buying Dredging Corporation in the range of  ₹1010-990 keeping Stop loss ats  ₹960 for an upside of 9% –13%Dredging Corporation as per Axis is trending within an upward-sloping channel. Recently, it found support at the lower band of the rising channel and is now heading toward the upper band.The weekly RSI strength indicator has crossed above its reference line, generating a buy signal, said Axis Securities'Axis analysis indicates an upside to  ₹1085-1125 levels. The holding period is 3 to 4 weeks.","cleaned_content":"stock markets today vip industries ltd tata chemicals ltd dredging corporation of india ltd are the three technical stock picks of the week by axis securities vip industries as per axis has successfully broken out of a falling channel pattern at \u003cFIVE_HUNDRED\u003e on the weekly chart during the last week of september \u003cTWO_THOUSAND\u003e signaling a potential onset of an uptrend the axis analysis indicates an upside to \u003cSIX_HUNDRED\u003e \u003cSIX_HUNDRED\u003e levels the holding period as per axis is \u003cTHREE_\u003e to \u003cFOUR_\u003e weeks 2 tata chemicals axis securities recommends buying tata chemicals in the range of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e for an upside of \u003cSEVEN_PERCENT\u003e \u003cNINE_PERCENT\u003e tata chemicals share price as per axis securities has confirmed a breakout above the symmetrical triangle pattern at the \u003cONE_THOUSAND\u003e level on the weekly chart accompanied by a strong bullish candle signaling a continuation of the medium term uptrend the weekly rsi has broken above the downward sloping trendline further confirming the strength in pricesaxis analysis indicates an upside to \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels the holding period for tata chemicals is \u003cTHREE_\u003e to \u003cFOUR_\u003e weeks axis recommends buying dredging corporation in the range of \u003cONE_THOUSAND\u003e \u003cNINE_HUNDRED\u003e keeping stop loss ats \u003cNINE_HUNDRED\u003e for an upside of \u003cNINE_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e dredging corporation as per axis is trending within an upward sloping channel recently it found support at the lower band of the rising channel and is now heading toward the upper band the weekly rsi strength indicator has crossed above its reference line generating a buy signal said axis securitiesaxis analysis indicates an upside to \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e levels the holding period is \u003cTHREE_\u003e to \u003cFOUR_\u003e weeks","timestamp":"2024-10-07T13:17:00+05:30","market_timestamp":"2024-10-07T13:17:00+05:30","off_market_hours":false}