{"url":"https://www.livemint.com/market/stock-market-news/nmdc-share-price-falls-another-8-down-15-in-5-sessions-heres-why-11728360045663.html","title":"NMDC share price falls another 8%, tanks 15% in 5 sessions. Here’s why","description":"Shares of NMDC fell 8% to  ₹211, marking a 15% loss over five days. This drop follows a slump in iron ore prices due to a lack of new spending pledges from China.","content":"Continuing their bearish trend for the fifth consecutive trading session, shares of NMDC, India’s largest iron ore producer, fell another 8% in early morning trade on Tuesday, October 8, to  ₹211 apiece. This brings the cumulative loss over the past five days to nearly 15%.Today's drop in shares came after the iron ore prices slumped from a five-month high as a much-anticipated briefing by China’s top economic planner ended without new pledges to boost government spending. Iron ore futures in Singapore fell as much as 4% after being up by a similar amount earlier in the session.In September 2024, the company recorded iron ore production of 3.04 million tonnes (MT), reflecting a 1.3% increase from the 3 MT produced in the same month the previous year. Additionally, sales saw a year-on-year growth of 13.8%, totalling 3.54 MT last month.Recently, the company announced an increase in the prices of lump ore and fines. The price of lump ore has increased by  ₹400 per tonne, reaching  ₹5,750 per tonne, while fines have also risen by  ₹400 per tonne, now priced at  ₹5,010 per tonne. These new prices took effect on October 1.This latest price adjustment follows a prior reduction by NMDC. Earlier, the company had lowered the prices for lump ore by  ₹600 per tonne to  ₹5,350 and for fines by  ₹500 per tonne to  ₹4,610.Domestic brokerage Elara Capital projected a 2% YoY increase and a 3% quarter-on-quarter (QoQ) drop in the company’s sales volume during the second quarter of the current financial year (Q2 FY25).Following two price hikes in Q1 FY25, the company implemented two price reductions: first, a decrease of  ₹500 per tonne for both lumps and fines on June 30, 2024, and second, a reduction of  ₹600 per tonne for lumps and  ₹500 per tonne for fines on August 7.As a result, the brokerage forecasts that realisations will improve by approximately 14% YoY while declining around 11% QoQ. Consequently, it estimates EBITDA per tonne to rise by 33% YoY but decrease by about 29% QoQ.Motilal Oswal forecasts that the metal companies within its coverage will experience a QoQ decline in revenue (-3%), EBITDA (-15%), and adjusted profit after tax (APAT) (-27%) for 2QFY25E. This downturn is attributed to weak metal prices and lower sales volumes during the quarter.It said that the seasonal impact of the monsoon, combined with cheaper imports from China, has exerted pressure on domestic prices and demand. However, a decrease in input costs is expected to partially mitigate these challenges.Mining companies are likely to report a sequential decline due to reduced volumes stemming from heavy monsoon rains and lower average selling prices (ASP), it stated.Motilal Oswal highlighted that iron ore prices have decreased by  ₹900-1,000 per tonne compared to the exit prices in June 2024. For 2Q, NMDC's average prices for lumps and fines were  ₹5,350 per tonne and  ₹4,610 per tonne, respectively.The slowdown in China's real estate sector, which is the largest consumer of metals, has led to an influx of cheaper Chinese exports into the global market, putting downward pressure on global prices. Looking ahead, the brokerage anticipates that China’s stimulus efforts to revitalise its struggling real estate market will provide support for global metal prices.","cleaned_content":"continuing their bearish trend for the fifth consecutive trading session shares of nmdc india s largest iron ore producer fell another \u003cEIGHT_PERCENT\u003e in early morning trade on tuesday october \u003cEIGHT_\u003e to \u003cTWO_HUNDRED\u003e apiece this brings the cumulative loss over the past five days to nearly \u003cONE_TEN_PERCENT\u003e todays drop in shares came after the iron ore prices slumped from a five month high as a much anticipated briefing by china s top economic planner ended without new pledges to boost government spending iron ore futures in singapore fell as much as \u003cFOUR_PERCENT\u003e after being up by a similar amount earlier in the session in september \u003cTWO_THOUSAND\u003e the company recorded iron ore production of \u003cTHREE_\u003e million tonnes mt reflecting a \u003cONE_PERCENT\u003e increase from the \u003cTHREE_\u003e mt produced in the same month the previous year additionally sales saw a year on year growth of \u003cONE_TEN_PERCENT\u003e totalling \u003cTHREE_\u003e mt last month recently the company announced an increase in the prices of lump ore and fines the price of lump ore has increased by \u003cFOUR_HUNDRED\u003e per tonne reaching \u003cFIVE_THOUSAND\u003e per tonne while fines have also risen by \u003cFOUR_HUNDRED\u003e per tonne now priced at \u003cFIVE_THOUSAND\u003e per tonne these new prices took effect on october \u003cONE_\u003e this latest price adjustment follows a prior reduction by nmdc earlier the company had lowered the prices for lump ore by \u003cSIX_HUNDRED\u003e per tonne to \u003cFIVE_THOUSAND\u003e and for fines by \u003cFIVE_HUNDRED\u003e per tonne to \u003cFOUR_THOUSAND\u003e domestic brokerage elara capital projected a \u003cTWO_PERCENT\u003e yoy increase and a \u003cTHREE_PERCENT\u003e quarter on quarter qoq drop in the company s sales volume during the second quarter of the current financial year q2 fy25 following two price hikes in q1 fy25 the company implemented two price reductions first a decrease of \u003cFIVE_HUNDRED\u003e per tonne for both lumps and fines on june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and second a reduction of \u003cSIX_HUNDRED\u003e per tonne for lumps and \u003cFIVE_HUNDRED\u003e per tonne for fines on august \u003cSEVEN_\u003e as a result the brokerage forecasts that realisations will improve by approximately \u003cONE_TEN_PERCENT\u003e yoy while declining around \u003cONE_TEN_PERCENT\u003e qoq consequently it estimates ebitda per tonne to rise by \u003cTHREE_TEN_PERCENT\u003e yoy but decrease by about \u003cTWO_TEN_PERCENT\u003e qoq motilal oswal forecasts that the metal companies within its coverage will experience a qoq decline in revenue \u003cTHREE_PERCENT\u003e ebitda \u003cONE_TEN_PERCENT\u003e and adjusted profit after tax apat \u003cTWO_TEN_PERCENT\u003e for \u003cTWO_\u003e qfy25e this downturn is attributed to weak metal prices and lower sales volumes during the quarter it said that the seasonal impact of the monsoon combined with cheaper imports from china has exerted pressure on domestic prices and demand however a decrease in input costs is expected to partially mitigate these challenges mining companies are likely to report a sequential decline due to reduced volumes stemming from heavy monsoon rains and lower average selling prices asp it stated motilal oswal highlighted that iron ore prices have decreased by \u003cNINE_HUNDRED\u003e \u003cONE_THOUSAND\u003e per tonne compared to the exit prices in june \u003cTWO_THOUSAND\u003e for \u003cTWO_\u003e q nmdcs average prices for lumps and fines were \u003cFIVE_THOUSAND\u003e per tonne and \u003cFOUR_THOUSAND\u003e per tonne respectively the slowdown in chinas real estate sector which is the largest consumer of metals has led to an influx of cheaper chinese exports into the global market putting downward pressure on global prices looking ahead the brokerage anticipates that china s stimulus efforts to revitalise its struggling real estate market will provide support for global metal prices","timestamp":"2024-10-08T09:36:00+05:30","market_timestamp":"2024-10-08T09:36:00+05:30","off_market_hours":false}