{"url":"https://www.livemint.com/market/stock-market-news/wall-street-today-us-stocks-rise-after-sharp-selloff-11728396531048.html","title":"Wall Street today: US stocks rise after sharp selloff","description":"As of 12:41 p.m. Eastern time, the S\u0026P 500 was 0.8 per cent higher, the Dow Jones Industrial Average was up 0.2 per cent, and the Nasdaq Composite was 1.2 per cent higher","content":"US stocks rose on Tuesday, after a sharp selloff in the previous session as investors turned their focus to the third quarter earnings and key consumer price inflation data due later this week.As of 12:41 p.m. Eastern time, the S\u0026P 500 was 0.8 per cent higher, the Dow Jones Industrial Average was up 0.2 per cent, and the Nasdaq Composite was 1.2 per cent higher.At the opening bell, the Dow Jones Industrial Average rose 68.4 points, or 0.16 per cent, to 42022.65. The S\u0026P 500 rose 23.2 points, or 0.41 per cent, to 5719.14, while the Nasdaq Composite rose 94.0 points, or 0.52 per cent, to 18017.929.On Monday, all three major indices had tumbled roughly 1 per cent as Treasury yields surged and on escalating Middle East tensions.The 10-year Treasury yield edged up to 4.05 per cent from 4.03 per cent late on Monday. The 2-year yield edged down to 3.98 per cent from 3.99 per cent.PepsiCo stock rose 0.7 per cent after it delivered stronger profit for the third quarter.Shares of Caterpillar dropped 2.5 per cent.Chevron shares fell 1.9 per cent on decline in oil prices.US-listed shares of Chinese companies slid, tracking losses in domestic stocks. Shares of Alibaba Group, JD.com and PDD Holdings lost between 5.9 per cent and 6.3 per cent.Oil prices fell on Tuesday, breaking a five-day run of gains.Brent crude futures were down $2.29, or 2.83 per cent, to $78.64 per barrel at 1315 GMT. US West Texas Intermediate futures were down $2.28, or 2.96 per cent, to $74.86 a barrel.Gold prices fell for a fifth consecutive session on Tuesday.Spot gold fell 0.2 per cent to $2,639.13 per ounce by 9:53 am ET (1353 GMT). US gold futures lost 0.3 per cent to $2,658.00.Spot silver lost 1.9 per cent to $31.13 per ounce.","cleaned_content":"us stocks rose on tuesday after a sharp selloff in the previous session as investors turned their focus to the third quarter earnings and key consumer price inflation data due later this week as of \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e p m eastern time the s p \u003cFIVE_HUNDRED\u003e was \u003cZERO_PERCENT\u003e higher the dow jones industrial average was up \u003cZERO_PERCENT\u003e and the nasdaq composite was \u003cONE_PERCENT\u003e higher at the opening bell the dow jones industrial average rose \u003cSIX_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e the s p \u003cFIVE_HUNDRED\u003e rose \u003cTWO_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cFIVE_THOUSAND\u003e while the nasdaq composite rose \u003cNINE_TEN\u003e points or \u003cZERO_PERCENT\u003e to \u003cONE_TEN_THOUSAND\u003e on monday all three major indices had tumbled roughly \u003cONE_PERCENT\u003e as treasury yields surged and on escalating middle east tensions the \u003cONE_TEN\u003e year treasury yield edged up to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e late on monday the \u003cTWO_\u003e year yield edged down to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e pepsico stock rose \u003cZERO_PERCENT\u003e after it delivered stronger profit for the third quarter shares of caterpillar dropped \u003cTWO_PERCENT\u003e chevron shares fell \u003cONE_PERCENT\u003e on decline in oil prices us listed shares of chinese companies slid tracking losses in domestic stocks shares of alibaba group jd com and pdd holdings lost between \u003cFIVE_PERCENT\u003e and \u003cSIX_PERCENT\u003e oil prices fell on tuesday breaking a five day run of gains brent crude futures were down \u003cTWO_\u003e or \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e per barrel at \u003cONE_THOUSAND\u003e gmt us west texas intermediate futures were down \u003cTWO_\u003e or \u003cTWO_PERCENT\u003e to \u003cSEVEN_TEN\u003e a barrel gold prices fell for a fifth consecutive session on tuesday spot gold fell \u003cZERO_PERCENT\u003e to \u003cTWO_THOUSAND\u003e per ounce by \u003cNINE_\u003e \u003cFIVE_TEN\u003e am et \u003cONE_THOUSAND\u003e gmt us gold futures lost \u003cZERO_PERCENT\u003e to \u003cTWO_THOUSAND\u003e spot silver lost \u003cONE_PERCENT\u003e to \u003cTHREE_TEN\u003e per ounce","timestamp":"2024-10-08T22:57:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}