{"url":"https://www.livemint.com/market/stock-market-news/elon-musks-tesla-share-price-plummets-following-lackluster-robotaxi-reveal-11728721311563.html","title":"Tesla share price plummets following lackluster Robotaxi reveal","description":"Elon Musk unveiled Tesla Inc.’s highly anticipated self-driving taxi at a flashy event that was light on specifics, sending its stock sliding as investors questioned how the carmaker will achieve its ambitious goals.","content":"Elon Musk unveiled Tesla Inc.’s highly anticipated self-driving taxi at a flashy event that was light on specifics, sending its stock sliding as investors questioned how the carmaker will achieve its ambitious goals.The chief executive officer showed off prototypes of a slick two-door sedan called the Cybercab late Thursday, along with a van concept and an updated version of Tesla’s humanoid robot. The robotaxi — which has no steering wheel or pedals — could cost less than $30,000 and “probably” will go into production in 2026, Musk said.The product launch, held on a movie studio lot near Los Angeles, didn’t address how Tesla will make the leap from selling advanced driver-assistance features to fully autonomous vehicles. Musk’s presentation lacked technical details and glossed over topics including regulation or whether the company will own and operate its own fleet of Cybercabs.As Jefferies analysts put it, Tesla’s robotaxi appears “toothless.”Listen and subscribe to Elon, Inc. onApple,Spotify,iHeartand the Bloomberg Terminal.The underwhelming event sent Tesla’s shares tumbling as much as 10% Friday in New York, the biggest intraday decline in more than two months. They were down 7.6% at 12:29 p.m., wiping out $58 billion in market value. The stock had soared almost 70% since mid-April, largely in anticipation of the event.Uber Technologies Inc. and Lyft Inc., competing ride-hailing companies whose investors had been nervously awaiting the Cybercab’s debut, each surged as much as 11% Friday. Uber’s stock hit an all-time high.Tesla has a track record of blowing past timelines Musk has offered for all manner of future products, and has had a particularly difficult time following through on his self-driving forecasts. The CEO told investors in 2019 that Tesla would have more than 1 million robotaxis on the road by the following year. The company hasn’t deployed a single autonomous vehicle in the years since.“The only specific was the $30,000 for a Cybercab,” said Nancy Tengler, the chief executive officer of Laffer Tengler Investments and a Tesla investor who attended the event. “The concepts were all grand. Is the idea super cool? Absolutely.”Tesla has for years been selling a suite of features it’s marketed as Full Self-Driving, or FSD, that require constant supervision and don’t make its vehicles autonomous.Musk said Thursday the company expects to be able to allow Model 3 and Model Y owners in Texas and California to no longer need to supervise those features sometime next year.Among the other reveals at the event were a futuristic-looking Robovan concept that Musk said could transport as many as 20 people, plus new versions of the humanoid robot, called Optimus. While the CEO offered a rough sense of when the Cybercab may be ready, he didn’t say when Tesla will make the Robovan.“Investors we spoke to at the event thought the event was light of real numbers and timelines,” RBC Capital Markets analyst Tom Narayan said in a note. “We would expect shares to trade lower.”The robotaxi event itself was postponed by two months after Musk ordered changes to the prototype’s design, Bloomberg first reported in July. The Cybercab features doors that open upward like butterfly wings and lacks a steering wheel or pedals.“They nailed the form factor,” said Gene Munster, managing partner of growth-investment firm Deepwater Asset Management, who went for a ride in one of the prototypes. “But the investor reaction is probably going to be muted because it’s still a long ways away, in terms of the time frame.”Musk told the crowd gathered at a Warner Bros. Discovery Inc. movie studio lot that consumers will be able to buy the Cybercab, then offered a hedged answer when an attendee asked when it will be available.“Probably, well I tend to be a little optimistic with time frames, but in 2026,” Musk said. “Before 2027, let me put it that way.”US presidential candidate Donald Trump provided fresh indication of the potential for Tesla’s robotaxi to run into regulatory snags in the lead up to Tesla’s party.Speaking at a Detroit Economic Club event, the Republican nominee questioned whether anybody likes autonomous vehicles and said they were “concerning” to him. It was unclear from his remarks whether he was only singling out cars from China.“The autonomous vehicles, we’re going to stop from operating on American roads, remember this,” Trump said. Musk endorsed Trump for president in July and has been spending millions of dollars supporting his candidacy.Missing ModelsAnalysts said ahead of the event that they hoped Tesla would share additional information about the more affordable models Musk has teased for the first half of next year.The CEO didn’t offer any such updates, casting further doubt on the company’s vehicle sales prospects. The carmaker needs to deliver a record number of cars and trucks in the coming months to avoid its first ever annual decline.“We were disappointed by the lack of detail regarding Tesla’s near-term product roadmap,” Garrett Nelson, a CFRA Research analyst, said in a note. “We think the event did little to change an opaque intermediate-term earnings outlook.”","cleaned_content":"elon musk unveiled tesla inc s highly anticipated self driving taxi at a flashy event that was light on specifics sending its stock sliding as investors questioned how the carmaker will achieve its ambitious goals the chief executive officer showed off prototypes of a slick two door sedan called the cybercab late thursday along with a van concept and an updated version of tesla s humanoid robot the robotaxi which has no steering wheel or pedals could cost less than \u003cTHREE_TEN_THOUSAND\u003e and probably will go into production in \u003cTWO_THOUSAND\u003e musk said the product launch held on a movie studio lot near los angeles didn t address how tesla will make the leap from selling advanced driver assistance features to fully autonomous vehicles musk s presentation lacked technical details and glossed over topics including regulation or whether the company will own and operate its own fleet of cybercabs as jefferies analysts put it tesla s robotaxi appears toothless listen and subscribe to elon inc onapple spotify iheartand the bloomberg terminal the underwhelming event sent tesla s shares tumbling as much as \u003cONE_TEN_PERCENT\u003e friday in new york the biggest intraday decline in more than two months they were down \u003cSEVEN_PERCENT\u003e at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e p m wiping out \u003cFIVE_TEN\u003e billion in market value the stock had soared almost \u003cSEVEN_TEN_PERCENT\u003e since mid april largely in anticipation of the event uber technologies inc and lyft inc competing ride hailing companies whose investors had been nervously awaiting the cybercab s debut each surged as much as \u003cONE_TEN_PERCENT\u003e friday uber s stock hit an all time high tesla has a track record of blowing past timelines musk has offered for all manner of future products and has had a particularly difficult time following through on his self driving forecasts the ceo told investors in \u003cTWO_THOUSAND\u003e that tesla would have more than \u003cONE_\u003e million robotaxis on the road by the following year the company hasn t deployed a single autonomous vehicle in the years since the only specific was the \u003cTHREE_TEN_THOUSAND\u003e for a cybercab said nancy tengler the chief executive officer of laffer tengler investments and a tesla investor who attended the event the concepts were all grand is the idea super cool absolutely tesla has for years been selling a suite of features it s marketed as full self driving or fsd that require constant supervision and don t make its vehicles autonomous musk said thursday the company expects to be able to allow model \u003cTHREE_\u003e and model y owners in texas and california to no longer need to supervise those features sometime next year among the other reveals at the event were a futuristic looking robovan concept that musk said could transport as many as \u003cTWO_TEN\u003e people plus new versions of the humanoid robot called optimus while the ceo offered a rough sense of when the cybercab may be ready he didn t say when tesla will make the robovan investors we spoke to at the event thought the event was light of real numbers and timelines rbc capital markets analyst tom narayan said in a note we would expect shares to trade lower the robotaxi event itself was postponed by two months after musk ordered changes to the prototype s design bloomberg first reported in july the cybercab features doors that open upward like butterfly wings and lacks a steering wheel or pedals they nailed the form factor said gene munster managing partner of growth investment firm deepwater asset management who went for a ride in one of the prototypes but the investor reaction is probably going to be muted because it s still a long ways away in terms of the time frame musk told the crowd gathered at a warner bros discovery inc movie studio lot that consumers will be able to buy the cybercab then offered a hedged answer when an attendee asked when it will be available probably well i tend to be a little optimistic with time frames but in \u003cTWO_THOUSAND\u003e musk said before \u003cTWO_THOUSAND\u003e let me put it that way us presidential candidate donald trump provided fresh indication of the potential for tesla s robotaxi to run into regulatory snags in the lead up to tesla s party speaking at a detroit economic club event the republican nominee questioned whether anybody likes autonomous vehicles and said they were concerning to him it was unclear from his remarks whether he was only singling out cars from china the autonomous vehicles we re going to stop from operating on american roads remember this trump said musk endorsed trump for president in july and has been spending millions of dollars supporting his candidacy missing modelsanalysts said ahead of the event that they hoped tesla would share additional information about the more affordable models musk has teased for the first half of next year the ceo didn t offer any such updates casting further doubt on the company s vehicle sales prospects the carmaker needs to deliver a record number of cars and trucks in the coming months to avoid its first ever annual decline we were disappointed by the lack of detail regarding tesla s near term product roadmap garrett nelson a cfra research analyst said in a note we think the event did little to change an opaque intermediate term earnings outlook","timestamp":"2024-10-12T13:59:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}