{"url":"https://www.livemint.com/market/stock-market-news/paytm-stock-rises-16-marking-best-single-day-gain-since-february-2023-should-you-buy-or-sell-11728381093628.html","title":"Paytm stock rises 16%, marking best single-day gain since February 2023; should you buy or sell?","description":"Shares of One97 Communications, the parent company of Paytm, surged 15.76%, snapping their three-day losing streak. With today's surge, Paytm stock has turned positive for the year, up 12% in 2024.","content":"Shares of One97 Communications, the parent company of payments platform Paytm, soared up to 15.76 per cent on Tuesday, October 8, achieving their largest single-day gain since February 8, 2023. With today's rise, the stock also snapped its three-day losing run.The exact reason for the rally remained unclear, but it seems the stock is recovering after a phase of profit-taking. Over the past week, the stock has risen by 4.30 per cent.With this move, the stock has turned positive for the year, now up 12 per cent in 2024.Paytm's shares had dropped to an all-time low of  ₹310 after the Reserve Bank of India (RBI) imposed restrictions on its Payments Bank earlier this year. RBI had barred Paytm Payments Bank from accepting new deposits and processing credit transactions.On the charts, Paytm's Relative Strength Index (RSI) is currently at 61, indicating that the stock is approaching \"overbought\" territory. Typically, an RSI above 70 signals that a stock is \"overbought.\"At a recent event, Paytm founder Vijay Shekhar Sharma expressed his regret over not selecting the right bankers for the company's IPO.Paytm's shares debuted on the stock exchanges in 2021 at an IPO price of  ₹2,150 per share. Despite the recent recovery, the stock remains 66 per cent below its IPO price.Data from Trendlyne shows that out of the 18 analysts covering Paytm, six have a \"buy\" recommendation, six suggest \"hold,\" and the remaining six recommend “sell.”In a separate analysis, Emkay Global last month predicted a potential surge in the company's shares. The firm upgraded its rating for the payments giant from \"reduce\" to \"add,\" raising the target price from  ₹375 to  ₹750.","cleaned_content":"shares of one97 communications the parent company of payments platform paytm soared up to \u003cONE_TEN_PERCENT\u003e on tuesday october \u003cEIGHT_\u003e achieving their largest single day gain since february \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e with todays rise the stock also snapped its three day losing run the exact reason for the rally remained unclear but it seems the stock is recovering after a phase of profit taking over the past week the stock has risen by \u003cFOUR_PERCENT\u003e with this move the stock has turned positive for the year now up \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e paytms shares had dropped to an all time low of \u003cTHREE_HUNDRED\u003e after the reserve bank of india rbi imposed restrictions on its payments bank earlier this year rbi had barred paytm payments bank from accepting new deposits and processing credit transactions on the charts paytms relative strength index rsi is currently at \u003cSIX_TEN\u003e indicating that the stock is approaching overbought territory typically an rsi above \u003cSEVEN_TEN\u003e signals that a stock is overbought at a recent event paytm founder vijay shekhar sharma expressed his regret over not selecting the right bankers for the companys ipo paytms shares debuted on the stock exchanges in \u003cTWO_THOUSAND\u003e at an ipo price of \u003cTWO_THOUSAND\u003e per share despite the recent recovery the stock remains \u003cSIX_TEN_PERCENT\u003e below its ipo price data from trendlyne shows that out of the \u003cONE_TEN\u003e analysts covering paytm six have a buy recommendation six suggest hold and the remaining six recommend sell in a separate analysis emkay global last month predicted a potential surge in the companys shares the firm upgraded its rating for the payments giant from reduce to add raising the target price from \u003cTHREE_HUNDRED\u003e to \u003cSEVEN_HUNDRED\u003e","timestamp":"2024-10-08T15:56:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}