{"url":"https://www.livemint.com/market/stock-market-news/israeliran-war-tcs-adani-ports-to-bpcl-experts-see-selling-heat-in-these-10-indian-stocks-11728277448204.html","title":"Israel-Iran war: TCS, Adani Ports to BPCL — experts see selling heat in these 10 Indian stocks","description":"Israel-Iran war: According to experts, stocks from IT, infra, and oil segments will be most affected if this Middle East tension continues for a longer period","content":"Israel-Iran war: After a year of the Israel-Hamas war, the Middle East tension has breached the Lebenan border and entered Iran. After the air strikes by Tehran in Israel and Israel's strong retaliation, the global markets, including the Indian stock market, came under massive selling pressure last week. While experts are busy finding out the impact of this Israel-Iran war on the Indian economy, some experts think that those Indian companies that have direct business in the Middle East, especially in Iran and its neighbouring countries, will be worst affected. They said that oil companies like Bharat Petroleum Corporation Ltd (BPCL), Indian Oil Corporation Limited (IOCL), Hindustan Petroleum Corporation Ltd (HPCL), Oil and Natural Gas Limited (ONGC), etc., would be the most affected Indian companies due to the soaring crude oil prices. However, some other companies like Adani Ports, Tata Consultancy Services (TCS), Tech Mahindra, Infosys, Wipro, and Larsen \u0026 Turbo would also feel the heat as these companies draw a good amount of business from the Middle East nations.Speaking on the impact of the Israel-Iran news on the Indin stock market, Anshul Jain, Head of Research at Lakshmi Shree Investment and Securities, said, \"The Israel-Iran war is expected to hit some Indian companies of a considerable reputation as they draw a large amount of business from Israel and some other Middle Eastern nations. The companies affected by this Middle East tension include IT, infra, and oil-producing companies. When we talk about business houses, the Iran-Israel war will impact the business houses of Tatas, Gautam Adani, and Anand Mahindra.\"Speaking on the companies that may feel the heat of the Israel-Iran war, Manish Chowdhury, Head of Research at StoxBox, said, \"The Israel-Iran conflict has impacted sectors that have some exposure to Israel. IT majors TCS and Infosys have a presence in Israel that focuses on innovation and collaboration. TCS has launched the Open Innovation program with Jaguar Land Rover in Tel Aviv to connect with local start-ups and scale innovative mobility solutions in Israel. This initiative is part of JLR's Reimagine strategy and utilizes TCS's COIN platform. Meanwhile, Infosys operates through its subsidiary Panaya Ltd in Israel. Both companies acknowledge that geopolitical and macroeconomic factors can influence service demand, with TCS generating 2.1% of its revenue from the Middle East and Africa.\"Pointing towards the infrastructure segment companies whose business may come under pressure due to this Middle East crisis, the StoxBox expert said, \"Adani Ports also hogged the limelight during the week. The company operates the Haifa Port in Israel. The operations in Haifa Port, Israel's largest port, provided access to the busy Mediterranean and opportunities for expansion in the Middle East; the company also effectively owns a 70% stake in Haifa Port, Israel.\"Anshul Jain of Lakshimishree said Larsen \u0026 Turbo is another infra-sector company with a strong business network in Israel. The current Iran-Israel war may negatively impact the company's upcoming quarterly numbers.\"It is around one year since the Israel-Hamas war began, and it has now reached Iran from Lebnan. So, oil companies are under pressure due to the soaring crude oil prices. So, IOC, BPCL, HPCL, ONGC, etc., are expected to come under stress if the Israel-Iran war gets prolonged,\" said Anshul Jain.\"Investors should also keep an eye on oil and gas companies, including IOC, BPCL, HPCL, and ONGC, among others in India, as the country imports a significant portion of its crude oil from the Middle East, and rising tensions could lead to supply disruptions or price volatility. Any rise in crude oil prices will increase costs for these companies and could affect profitability. On the other hand, rising oil prices lead to increased fuel costs, directly impacting the aviation sector due to higher jet fuel prices,\" said Manish Chowdhury of StoxBox.So, let's go by the words of these stock market experts. If the Israel-Iran war gets prolonged, these 10 Indian stocks are expected to come under pressure: TCS, Infosys, Wipro, Tech Mahindra, Adani Ports, Larsen \u0026 Turbo, IOC, BPCL, HPCL, and ONGC.","cleaned_content":"israel iran war after a year of the israel hamas war the middle east tension has breached the lebenan border and entered iran after the air strikes by tehran in israel and israels strong retaliation the global markets including the indian stock market came under massive selling pressure last week while experts are busy finding out the impact of this israel iran war on the indian economy some experts think that those indian companies that have direct business in the middle east especially in iran and its neighbouring countries will be worst affected they said that oil companies like bharat petroleum corporation ltd bpcl indian oil corporation limited iocl hindustan petroleum corporation ltd hpcl oil and natural gas limited ongc etc would be the most affected indian companies due to the soaring crude oil prices however some other companies like adani ports tata consultancy services tcs tech mahindra infosys wipro and larsen turbo would also feel the heat as these companies draw a good amount of business from the middle east nations speaking on the impact of the israel iran news on the indin stock market anshul jain head of research at lakshmi shree investment and securities said the israel iran war is expected to hit some indian companies of a considerable reputation as they draw a large amount of business from israel and some other middle eastern nations the companies affected by this middle east tension include it infra and oil producing companies when we talk about business houses the iran israel war will impact the business houses of tatas gautam adani and anand mahindra speaking on the companies that may feel the heat of the israel iran war manish chowdhury head of research at stoxbox said the israel iran conflict has impacted sectors that have some exposure to israel it majors tcs and infosys have a presence in israel that focuses on innovation and collaboration tcs has launched the open innovation program with jaguar land rover in tel aviv to connect with local start ups and scale innovative mobility solutions in israel this initiative is part of jlrs reimagine strategy and utilizes tcss coin platform meanwhile infosys operates through its subsidiary panaya ltd in israel both companies acknowledge that geopolitical and macroeconomic factors can influence service demand with tcs generating \u003cTWO_PERCENT\u003e of its revenue from the middle east and africa pointing towards the infrastructure segment companies whose business may come under pressure due to this middle east crisis the stoxbox expert said adani ports also hogged the limelight during the week the company operates the haifa port in israel the operations in haifa port israels largest port provided access to the busy mediterranean and opportunities for expansion in the middle east the company also effectively owns a \u003cSEVEN_TEN_PERCENT\u003e stake in haifa port israel anshul jain of lakshimishree said larsen turbo is another infra sector company with a strong business network in israel the current iran israel war may negatively impact the companys upcoming quarterly numbers it is around one year since the israel hamas war began and it has now reached iran from lebnan so oil companies are under pressure due to the soaring crude oil prices so ioc bpcl hpcl ongc etc are expected to come under stress if the israel iran war gets prolonged said anshul jain investors should also keep an eye on oil and gas companies including ioc bpcl hpcl and ongc among others in india as the country imports a significant portion of its crude oil from the middle east and rising tensions could lead to supply disruptions or price volatility any rise in crude oil prices will increase costs for these companies and could affect profitability on the other hand rising oil prices lead to increased fuel costs directly impacting the aviation sector due to higher jet fuel prices said manish chowdhury of stoxbox so lets go by the words of these stock market experts if the israel iran war gets prolonged these \u003cONE_TEN\u003e indian stocks are expected to come under pressure tcs infosys wipro tech mahindra adani ports larsen turbo ioc bpcl hpcl and ongc","timestamp":"2024-10-07T11:04:00+05:30","market_timestamp":"2024-10-07T11:04:00+05:30","off_market_hours":false}