{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-tata-stocks-vedanta-adani-enterprises-zee-icici-securities-and-more-11728500450038.html","title":"Stocks to Watch: Tata stocks, Vedanta, Adani Enterprises, Zee, ICICI Securities, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Tata Stocks: Tata group companies are likely to be in focus following the passing of Chairman Emeritus, Ratan Naval Tata, during the night of Thursday, October 10.Adani Enterprises: The company has launched a qualified institutional placement (QIP) at a floor price of  ₹3,117 per share, aiming to raise up to  ₹16,600 crore. The funds will be used to finance various projects, including airport expansions. SBI Capital Markets, Jefferies India, and ICICI Securities are the book-running lead managers for the issue.Vedanta: As part of its liquidity management strategy, Vedanta has repaid $869 million to bondholders by redeeming bonds due in 2027 and 2028 ahead of maturity. This move is expected to reduce interest costs for the company.Jio Financial Services: Jio Payments Bank, a subsidiary of Jio Financial Services, has obtained a mutual fund distribution license from AMFI, allowing it to distribute direct mutual fund plans. This aligns with the company’s broader expansion in the financial services sector, which includes a joint venture with BlackRock.Zee Entertainment Enterprises: Following a probe by SEBI regarding alleged fund diversions, the Independent Investigation Committee (ICC) set up by ZEEL found 'no material irregularities' in the company. This comes after scrutiny involving Chairman Emeritus Subhash Chandra and CEO Punit Goenka concerning the alleged diversion of over  ₹2,000 crore.JSW Infrastructure: The company has received a Letter of Intent from the Maharashtra Maritime Board to develop a multipurpose port in Palghar district, with an estimated cost of  ₹4,259 crore. The project is expected to create 1,500 jobs and support JSW’s goal of significantly increasing capacity by FY30.Star Health and Allied Insurance: The company is currently undergoing a forensic investigation after a major data breach impacting 31 million customers. Star Health is cooperating with authorities and has taken legal action against platforms involved in the leak.ICICI Securities: The National Company Law Tribunal has approved the delisting of ICICI Securities, making it a wholly-owned subsidiary of ICICI Bank. Shareholders of ICICI Securities will receive 67 shares of ICICI Bank for every 100 shares they own, and minority shareholder objections have been dismissed.HDFC Life Insurance: The company plans to raise  ₹1,000 crore through the issuance of non-convertible debentures to support business growth. The debentures will be unsecured and listed on the National Stock Exchange.IRB Infrastructure Developers: The company aims to raise up to $200 million through foreign currency-denominated notes to meet financial needs. The board has authorized the management committee to oversee this fundraising initiative.Results Today: Several companies, including Tata Consultancy Services, Tata Elxsi, Indian Renewable Energy Development Agency, Arkade Developers, Anand Rathi Wealth, Den Networks, GM Breweries, Ashoka Metcast, Hathway Bhawani Cabletel, Infomedia Press, NB Footwear, and Reliance Naval and Engineering, are set to release their quarterly earnings today, October 10.","cleaned_content":"tata stocks tata group companies are likely to be in focus following the passing of chairman emeritus ratan naval tata during the night of thursday october \u003cONE_TEN\u003e adani enterprises the company has launched a qualified institutional placement qip at a floor price of \u003cTHREE_THOUSAND\u003e per share aiming to raise up to \u003cONE_TEN_THOUSAND\u003e crore the funds will be used to finance various projects including airport expansions sbi capital markets jefferies india and icici securities are the book running lead managers for the issue vedanta as part of its liquidity management strategy vedanta has repaid \u003cEIGHT_HUNDRED\u003e million to bondholders by redeeming bonds due in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e ahead of maturity this move is expected to reduce interest costs for the company jio financial services jio payments bank a subsidiary of jio financial services has obtained a mutual fund distribution license from amfi allowing it to distribute direct mutual fund plans this aligns with the company s broader expansion in the financial services sector which includes a joint venture with blackrock zee entertainment enterprises following a probe by sebi regarding alleged fund diversions the independent investigation committee icc set up by zeel found no material irregularities in the company this comes after scrutiny involving chairman emeritus subhash chandra and ceo punit goenka concerning the alleged diversion of over \u003cTWO_THOUSAND\u003e crore jsw infrastructure the company has received a letter of intent from the maharashtra maritime board to develop a multipurpose port in palghar district with an estimated cost of \u003cFOUR_THOUSAND\u003e crore the project is expected to create \u003cONE_THOUSAND\u003e jobs and support jsw s goal of significantly increasing capacity by fy30 star health and allied insurance the company is currently undergoing a forensic investigation after a major data breach impacting \u003cTHREE_TEN\u003e million customers star health is cooperating with authorities and has taken legal action against platforms involved in the leak icici securities the national company law tribunal has approved the delisting of icici securities making it a wholly owned subsidiary of icici bank shareholders of icici securities will receive \u003cSIX_TEN\u003e shares of icici bank for every \u003cONE_HUNDRED\u003e shares they own and minority shareholder objections have been dismissed hdfc life insurance the company plans to raise \u003cONE_THOUSAND\u003e crore through the issuance of non convertible debentures to support business growth the debentures will be unsecured and listed on the national stock exchange irb infrastructure developers the company aims to raise up to \u003cTWO_HUNDRED\u003e million through foreign currency denominated notes to meet financial needs the board has authorized the management committee to oversee this fundraising initiative results today several companies including tata consultancy services tata elxsi indian renewable energy development agency arkade developers anand rathi wealth den networks gm breweries ashoka metcast hathway bhawani cabletel infomedia press nb footwear and reliance naval and engineering are set to release their quarterly earnings today october \u003cONE_TEN\u003e","timestamp":"2024-10-10T08:19:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}