{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-sumeet-bagadia-recommends-five-shares-to-buy-today-oct-11-11728612844143.html","title":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Oct 11","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Sharda Motor Industries, OnMobile, Sree Rayalaseema Hi-Strength Hypo, Pavna Industries, and Crest Ventures","content":"Breakout stocks to buy or sell: Powered by a sharp rally in the banking and power sector stocks, the Indian stock market ended higher on Thursday. The Nifty 50 index rose 0.07% to 24,998.45, while the S\u0026P BSE Sensex added 0.18% to 81,611.41. The Nifty Bank index finished over one per cent higher on Thursday. In the broader market, while the BSE mid-cap gauge slipped 0.36%, the small-cap index rose 0.43%. Cash market volumes on the NSE fell 13% compared to the previous session to  ₹0.94 lakh crore – the lowest in 5 months. The mid-cap index fell 0.36% even as the advance-decline ratio fell to 1.17:1.Sumeet Bagadia, Executive Director at Choice Broking, believes that the overall sentiment of the Indian stock market is cautious as the Nifty 50 index is trading in the 24,900 to 25,300 range. The Choice Broking expert said that bullish or bearish sentiment can be assumed on the breakage of either side of this range. However, the Bank Nifty is looking positive after reaching above the 51,200 mark on a closing basis. Sumeet Bagadia said that the Q2FY25 results season has begun, and the market would react to the quarterly numbers of the listed entity. He advised a stock-specific approach focusing on the breakout stocks for intraday trading.On the outlook of the Indian stock market today, Sumeet Bagadia said, \"Banking stocks are expected to attract fresh buyers as the Nifty Bank Index has closed above 51,200. However, overall sentiment on Dalal Street is expected to remain cautious as the Nifty 50 index is trading range-bound in a tight 24,900 to 25,300 range. So, a bullish or bearish trend can be assumed on the breakage of this range on a decisive basis. Until then, I suggest a stock-specific approach focusing on breakout stocks.\"Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: Sharda Motor Industries, OnMobile, Sree Rayalaseema Hi-Strength Hypo, Pavna Industries, and Crest Ventures.1] Sharda Motor Industries: Buy at  ₹2103.15, target  ₹2244, stop loss  ₹2025;2] OnMobile: Buy at  ₹91.60, target  ₹96.50, stop loss  ₹88;3] Sree Rayalaseema Hi-Strength Hypo: Buy at  ₹898.50, target  ₹950, stop loss  ₹866;4] Pavna Industries: Buy at  ₹602, target  ₹640, stop loss  ₹580; and5] Crest Ventures: Buy at  ₹525.80, target  ₹560, stop loss  ₹507.","cleaned_content":"breakout stocks to buy or sell powered by a sharp rally in the banking and power sector stocks the indian stock market ended higher on thursday the nifty \u003cFIVE_TEN\u003e index rose \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e while the s p bse sensex added \u003cZERO_PERCENT\u003e to \u003cEIGHT_TEN_THOUSAND\u003e the nifty bank index finished over one per cent higher on thursday in the broader market while the bse mid cap gauge slipped \u003cZERO_PERCENT\u003e the small cap index rose \u003cZERO_PERCENT\u003e cash market volumes on the nse fell \u003cONE_TEN_PERCENT\u003e compared to the previous session to \u003cZERO_\u003e lakh crore the lowest in \u003cFIVE_\u003e months the mid cap index fell \u003cZERO_PERCENT\u003e even as the advance decline ratio fell to \u003cONE_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes that the overall sentiment of the indian stock market is cautious as the nifty \u003cFIVE_TEN\u003e index is trading in the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range the choice broking expert said that bullish or bearish sentiment can be assumed on the breakage of either side of this range however the bank nifty is looking positive after reaching above the \u003cFIVE_TEN_THOUSAND\u003e mark on a closing basis sumeet bagadia said that the q2fy25 results season has begun and the market would react to the quarterly numbers of the listed entity he advised a stock specific approach focusing on the breakout stocks for intraday trading on the outlook of the indian stock market today sumeet bagadia said banking stocks are expected to attract fresh buyers as the nifty bank index has closed above \u003cFIVE_TEN_THOUSAND\u003e however overall sentiment on dalal street is expected to remain cautious as the nifty \u003cFIVE_TEN\u003e index is trading range bound in a tight \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range so a bullish or bearish trend can be assumed on the breakage of this range on a decisive basis until then i suggest a stock specific approach focusing on breakout stocks regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares sharda motor industries onmobile sree rayalaseema hi strength hypo pavna industries and crest ventures 1 sharda motor industries buy at \u003cTWO_THOUSAND\u003e target \u003cTWO_THOUSAND\u003e stop loss \u003cTWO_THOUSAND\u003e \u003cTWO_\u003e onmobile buy at \u003cNINE_TEN\u003e target \u003cNINE_TEN\u003e stop loss \u003cEIGHT_TEN\u003e \u003cTHREE_\u003e sree rayalaseema hi strength hypo buy at \u003cEIGHT_HUNDRED\u003e target \u003cNINE_HUNDRED\u003e stop loss \u003cEIGHT_HUNDRED\u003e \u003cFOUR_\u003e pavna industries buy at \u003cSIX_HUNDRED\u003e target \u003cSIX_HUNDRED\u003e stop loss \u003cFIVE_HUNDRED\u003e and5 crest ventures buy at \u003cFIVE_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cFIVE_HUNDRED\u003e","timestamp":"2024-10-11T07:54:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}