{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-tata-motors-nykaa-ola-electric-hi-tech-pipes-and-more-11728321055089.html","title":"Stocks to Watch: Tata Motors, Nykaa, Ola Electric, Hi-Tech Pipes, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Tata Motors: Tata Motors' British luxury car unit, Jaguar Land Rover (JLR), reported a three percent decline in retail sales to 1,03,108 units for the second quarter of the current fiscal (Q2FY25) compared to the same period last year. However, retail sales for the first half of FY25 stood at 2,14,288 units, reflecting a three percent year-on-year (YoY) increase. Production in Q2FY25 was limited to 86,000 units, down seven percent from the previous year's 93,000 units, due to aluminium supply disruptions reported in the first quarter. Regional retail sales in Q2 showed a mixed performance, with a 29 percent rise in the UK and nine percent growth in North America, but declines of 22 percent in Europe, 17 percent in China, and six percent in other regions.Nykaa: Nykaa posted consolidated net revenue growth in the mid-twenties for the quarter ended September 2024. However, the fashion segment saw subdued demand in the first half of FY25. The industry anticipates a gradual recovery in the second half, driven by the upcoming festive and wedding season.Ola Electric: Ola Electric has reportedly received a show cause notice from the Central Consumer Protection Authority following a surge in consumer complaints about service issues. The company has been given 15 days to address the allegations, which include accusations of unfair trade practices and misleading advertisements. This comes amid increasing public criticism of the company's service standards.Hero Motors: The Securities and Exchange Board of India (SEBI) announced that Hero Motors has withdrawn its draft red herring prospectus as of October 5, while Suraksha Diagnostic received approval to launch its initial public offering (IPO). Hero Motors, a flagship auto components company of Hero Motors Company (HMC) Group, had initially planned a  ₹900-crore public issue, which included a fresh equity share issuance of  ₹500 crore and an offer-for-sale (OFS) worth  ₹400 crore. Promoters OP Munjal Holdings, Bhagyoday Investments, and Hero Cycles were set to sell stakes as part of the OFS.Axis Bank: Axis Bank has secured a $500 million loan from the International Finance Corporation (IFC), the World Bank's soft loan arm, to enhance green project financing in India. This partnership represents the IFC's first blue investment in India and the country's inaugural blue loan issued by a financial institution.Pfizer: Pfizer won a legal battle in a London court to invalidate two of GSK's patents concerning a respiratory syncytial virus (RSV) vaccine. Both pharmaceutical giants are vying for market dominance in developing RSV vaccines, which target cold-like symptoms and pneumonia, particularly in toddlers and older adults. Despite the ruling, GSK stated that it would not affect its ability to launch and market its RSV vaccine, Arexvy, globally.Hi-Tech Pipes: The board of Hi-Tech Pipes approved the launch of a Qualified Institutional Placement (QIP), setting the floor price at  ₹194.98 per equity share. The company plans to raise  ₹600 crore through the QIP, with the possibility of offering a discount of up to five percent on the floor price. Hi-Tech Pipes is the third-largest pipe manufacturer in India, with a production capacity of nearly one million tonnes.HDFC Bank: HDFC Bank announced the sale of its 100 percent stake in its subsidiary HDFC Education to Vama Sundari Investments for  ₹192 crore in an all-cash deal. The sale price was set at  ₹9.60 per share. The bank plans to divest 91 percent of its stake by October 31, 2024, and the remaining nine percent by June 30, 2025, after which HDFC Education will no longer be a subsidiary.Kalyan Jewellers: Kalyan Jewellers reported a robust 39 percent revenue growth in India for the second quarter of FY25, fueled by increased foot traffic and a 23 percent rise in same-store sales. The reduction in customs duties on gold imports has positively impacted sales, and the company plans to expand its showroom presence ahead of the festive season.Results Today: Navkar Corporation, Transformers and Rectifiers India, VL E-Governance \u0026 IT Solutions, Darshan Orna, Emerald Finance, Gautam Gems, Hawa Engineers, and Integra Switchgear are scheduled to announce their quarterly earnings on October 8.","cleaned_content":"tata motors tata motors british luxury car unit jaguar land rover jlr reported a three percent decline in retail sales to \u003cONE_HUNDRED_THOUSAND\u003e units for the second quarter of the current fiscal q2fy25 compared to the same period last year however retail sales for the first half of fy25 stood at \u003cTWO_HUNDRED_THOUSAND\u003e units reflecting a three percent year on year yoy increase production in q2fy25 was limited to \u003cEIGHT_TEN_THOUSAND\u003e units down seven percent from the previous years \u003cNINE_TEN_THOUSAND\u003e units due to aluminium supply disruptions reported in the first quarter regional retail sales in q2 showed a mixed performance with a \u003cTWO_TEN_PERCENT\u003e rise in the uk and nine percent growth in north america but declines of \u003cTWO_TEN_PERCENT\u003e in europe \u003cONE_TEN_PERCENT\u003e in china and six percent in other regions nykaa nykaa posted consolidated net revenue growth in the mid twenties for the quarter ended september \u003cTWO_THOUSAND\u003e however the fashion segment saw subdued demand in the first half of fy25 the industry anticipates a gradual recovery in the second half driven by the upcoming festive and wedding season ola electric ola electric has reportedly received a show cause notice from the central consumer protection authority following a surge in consumer complaints about service issues the company has been given \u003cONE_TEN\u003e days to address the allegations which include accusations of unfair trade practices and misleading advertisements this comes amid increasing public criticism of the companys service standards hero motors the securities and exchange board of india sebi announced that hero motors has withdrawn its draft red herring prospectus as of october \u003cFIVE_\u003e while suraksha diagnostic received approval to launch its initial public offering ipo hero motors a flagship auto components company of hero motors company hmc group had initially planned a \u003cNINE_HUNDRED\u003e crore public issue which included a fresh equity share issuance of \u003cFIVE_HUNDRED\u003e crore and an offer for sale ofs worth \u003cFOUR_HUNDRED\u003e crore promoters op munjal holdings bhagyoday investments and hero cycles were set to sell stakes as part of the ofs axis bank axis bank has secured a \u003cFIVE_HUNDRED\u003e million loan from the international finance corporation ifc the world banks soft loan arm to enhance green project financing in india this partnership represents the ifcs first blue investment in india and the countrys inaugural blue loan issued by a financial institution pfizer pfizer won a legal battle in a london court to invalidate two of gsks patents concerning a respiratory syncytial virus rsv vaccine both pharmaceutical giants are vying for market dominance in developing rsv vaccines which target cold like symptoms and pneumonia particularly in toddlers and older adults despite the ruling gsk stated that it would not affect its ability to launch and market its rsv vaccine arexvy globally hi tech pipes the board of hi tech pipes approved the launch of a qualified institutional placement qip setting the floor price at \u003cONE_HUNDRED\u003e per equity share the company plans to raise \u003cSIX_HUNDRED\u003e crore through the qip with the possibility of offering a discount of up to five percent on the floor price hi tech pipes is the third largest pipe manufacturer in india with a production capacity of nearly one million tonnes hdfc bank hdfc bank announced the sale of its \u003cONE_HUNDRED_PERCENT\u003e stake in its subsidiary hdfc education to vama sundari investments for \u003cONE_HUNDRED\u003e crore in an all cash deal the sale price was set at \u003cNINE_\u003e per share the bank plans to divest \u003cNINE_TEN_PERCENT\u003e of its stake by october \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and the remaining nine percent by june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e after which hdfc education will no longer be a subsidiary kalyan jewellers kalyan jewellers reported a robust \u003cTHREE_TEN_PERCENT\u003e revenue growth in india for the second quarter of fy25 fueled by increased foot traffic and a \u003cTWO_TEN_PERCENT\u003e rise in same store sales the reduction in customs duties on gold imports has positively impacted sales and the company plans to expand its showroom presence ahead of the festive season results today navkar corporation transformers and rectifiers india vl e governance it solutions darshan orna emerald finance gautam gems hawa engineers and integra switchgear are scheduled to announce their quarterly earnings on october \u003cEIGHT_\u003e","timestamp":"2024-10-08T08:38:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}