{"url":"https://www.livemint.com/market/stock-market-news/consumer-durables-q2-preview-wire-cables-segment-to-shine-even-as-overall-demand-stays-weak-says-prabhudas-lilladher-11728548891796.html","title":"Consumer Durables Q2 Preview: Wire \u0026 cables segment to shine even as overall demand stays weak, says Prabhudas Lilladher","description":"Prabhudas Lilladher's Q2FY25 preview indicates weak demand in consumer durables due to a slow festive season and heavy rainfall, although the W\u0026C segment thrives. Sales growth is projected at 11.5%, with Polycab and RR Kabel expected to perform well, while challenges persist in the fan segment.","content":"In its Q2FY25 consumer durables earnings preview, domestic brokerage firm Prabhudas Lilladher highlighted weak demand in the sector, largely due to a tepid start to the festive season and heavy rainfall. However, the Wire and Cable (W\u0026C) segment outperformed, driven by robust cable demand from infrastructure projects.Prabhudas Lilladher anticipates its consumer durables universe to report sales, EBITDA, and PAT growth of 11.5%, 14.5%, and 20.1% YoY, respectively, for Q2FY25. The brokerage expects Polycab and RR Kabel to be strong performers, while Bajaj Electricals may underperform in sales. In terms of profitability, Crompton Greaves Consumer Electricals, Havells, and Voltas are projected to surpass expectations.\"Cable B2B business is expected to sustain momentum, leveraging infrastructure growth and a quarter-on-quarter (QoQ) decline in copper and aluminium prices (Cu down 5.2% QoQ \u0026 Al down 5.3% QoQ in Q2FY25), which has enabled steady volume growth,\" said the brokerage.Domestic wire demand remains soft, however, an increase in raw material prices in September 2024 has led to channel stocking, resulting in volume pickup, it said.The brokerage anticipates KEI Industries revenue to grow 11.7% year-on-year (YoY), driven by an 11.8% increase in the W\u0026C segment, with significant growth of 15% YoY in LT cables and 16% YoY in HT cables. According to the brokerage, the EHV and wire segments are expected to see a 10% and 7% YoY growth, respectively, making up 53% of the company’s revenue.The EPC segment, including cables, is projected to grow by 10.2% YoY, while the EBITDA margin could drop slightly by 12 bps YoY to 10.4%.For Polycab India, it expects sales to increase by 15.7% YoY, with wires \u0026 cables growing 10% YoY and the FMEG segment rising 3.5% YoY. It projects the EBITDA margin at 13.1% and PAT growth of 3.9% YoY.In the case of RR Kabel, the brokerage forecasts 15.2% YoY revenue growth, largely from a 15% YoY increase in the W\u0026C segment due to volume expansion. It also expects the FMEG business to grow by 17% YoY, although the EBITDA margin may contract to 6.6%, attributed to challenging export conditions and ongoing losses in the FMEG segment.Prabhudas Lilladher notes that demand in the fan segment was soft in Q2FY25 due to the rainy season. Despite a low demand, companies announced a price hike in the fan segment. Small appliances segment did not see any price increases.Looking ahead, the brokerage expects demand to rebound in Q3FY25 and Q4FY25, driven by the festive season. It projects that companies within its coverage will report a 7% YoY growth in the FMEG segment for Q2FY25.In the Room Air Conditioner (RAC) segment, the brokerage estimates a 13.5% YoY growth, despite this being a traditionally weak season, driven by channel restocking following substantial inventory reductions in Q1 FY25. It expects Voltas' Unitary Cooling Products (UCP) segment to achieve 12% YoY sales growth, while Lloyd is forecasted to grow by 17% YoY in Q2FY25, with both companies seeing improvements in margins.The brokerage's top picks in the wire and cable segment are Polycab, KEI Industries, and RR Kabel. For Polycab India, the brokerage has set a target price of  ₹8,741 per share, while RR Kabel has a target price of  ₹2,178 per share, and KEI Industries of  ₹5,265 per share.In addition, it has a ‘buy’ rating on Crompton, with a target price of  ₹536. The brokerage believes Crompton can sustain its growth momentum by continuing to gain market share across key segments despite short-term demand challenges.","cleaned_content":"in its q2fy25 consumer durables earnings preview domestic brokerage firm prabhudas lilladher highlighted weak demand in the sector largely due to a tepid start to the festive season and heavy rainfall however the wire and cable w c segment outperformed driven by robust cable demand from infrastructure projects prabhudas lilladher anticipates its consumer durables universe to report sales ebitda and pat growth of \u003cONE_TEN_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e yoy respectively for q2fy25 the brokerage expects polycab and rr kabel to be strong performers while bajaj electricals may underperform in sales in terms of profitability crompton greaves consumer electricals havells and voltas are projected to surpass expectations cable b2b business is expected to sustain momentum leveraging infrastructure growth and a quarter on quarter qoq decline in copper and aluminium prices cu down \u003cFIVE_PERCENT\u003e qoq al down \u003cFIVE_PERCENT\u003e qoq in q2fy25 which has enabled steady volume growth said the brokerage domestic wire demand remains soft however an increase in raw material prices in september \u003cTWO_THOUSAND\u003e has led to channel stocking resulting in volume pickup it said the brokerage anticipates kei industries revenue to grow \u003cONE_TEN_PERCENT\u003e year on year yoy driven by an \u003cONE_TEN_PERCENT\u003e increase in the w c segment with significant growth of \u003cONE_TEN_PERCENT\u003e yoy in lt cables and \u003cONE_TEN_PERCENT\u003e yoy in ht cables according to the brokerage the ehv and wire segments are expected to see a \u003cONE_TEN_PERCENT\u003e and \u003cSEVEN_PERCENT\u003e yoy growth respectively making up \u003cFIVE_TEN_PERCENT\u003e of the company s revenue the epc segment including cables is projected to grow by \u003cONE_TEN_PERCENT\u003e yoy while the ebitda margin could drop slightly by \u003cONE_TEN\u003e bps yoy to \u003cONE_TEN_PERCENT\u003e for polycab india it expects sales to increase by \u003cONE_TEN_PERCENT\u003e yoy with wires cables growing \u003cONE_TEN_PERCENT\u003e yoy and the fmeg segment rising \u003cTHREE_PERCENT\u003e yoy it projects the ebitda margin at \u003cONE_TEN_PERCENT\u003e and pat growth of \u003cTHREE_PERCENT\u003e yoy in the case of rr kabel the brokerage forecasts \u003cONE_TEN_PERCENT\u003e yoy revenue growth largely from a \u003cONE_TEN_PERCENT\u003e yoy increase in the w c segment due to volume expansion it also expects the fmeg business to grow by \u003cONE_TEN_PERCENT\u003e yoy although the ebitda margin may contract to \u003cSIX_PERCENT\u003e attributed to challenging export conditions and ongoing losses in the fmeg segment prabhudas lilladher notes that demand in the fan segment was soft in q2fy25 due to the rainy season despite a low demand companies announced a price hike in the fan segment small appliances segment did not see any price increases looking ahead the brokerage expects demand to rebound in q3fy25 and q4fy25 driven by the festive season it projects that companies within its coverage will report a \u003cSEVEN_PERCENT\u003e yoy growth in the fmeg segment for q2fy25 in the room air conditioner rac segment the brokerage estimates a \u003cONE_TEN_PERCENT\u003e yoy growth despite this being a traditionally weak season driven by channel restocking following substantial inventory reductions in q1 fy25 it expects voltas unitary cooling products ucp segment to achieve \u003cONE_TEN_PERCENT\u003e yoy sales growth while lloyd is forecasted to grow by \u003cONE_TEN_PERCENT\u003e yoy in q2fy25 with both companies seeing improvements in margins the brokerages top picks in the wire and cable segment are polycab kei industries and rr kabel for polycab india the brokerage has set a target price of \u003cEIGHT_THOUSAND\u003e per share while rr kabel has a target price of \u003cTWO_THOUSAND\u003e per share and kei industries of \u003cFIVE_THOUSAND\u003e per share in addition it has a buy rating on crompton with a target price of \u003cFIVE_HUNDRED\u003e the brokerage believes crompton can sustain its growth momentum by continuing to gain market share across key segments despite short term demand challenges","timestamp":"2024-10-10T17:57:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}