{"url":"https://www.livemint.com/market/stock-market-news/hdfc-securities-retains-sell-call-on-chemical-stock-vinati-organics-sees-23-downside-11728379284613.html","title":"HDFC Securities retains ‘sell’ call on chemical stock Vinati Organics, sees 23% downside","description":"HDFC Securities maintains a 'sell' recommendation on Vinati Organics due to high valuations and a target price of  ₹1,491. Despite this, the company is expected to grow significantly over the long term through new projects and product expansions.","content":"Domestic brokerage house HDFC Securities reiterated its 'sell' call on the chemicals stock Vinati Organics on the back of high valuations. It has a target price of  ₹1,491 on the counter, implying a downside potential of 23 per cent from current levels.\"Currently, the stock is trading at 50/40.2 FY25 and FY26, which we believe is contextually high. Therefore, we are maintaining a SELL recommendation on Vinati Organics with a target price of  ₹1,491,\" said the brokerage even as it remains bullish on the company's long-term outlook.Vinati Organics (VO) is poised for substantial growth over the next few years, driven by significant investments in new projects and an expanded product range, said the brokerage.According to HDFC Securities, the company is set to commercialise projects worth approximately  ₹800 crore in the next two quarters. This development is expected to fuel revenue and EBITDA growth rates of 19% and 20%, respectively, from FY24 to FY27.Expansion of Product Range: Vinati Organics plans to invest  ₹5 billion in its subsidiary, Veeral Organic Private Limited (VOPL), to establish production plants for new products like MEHQ, Guaiacol, Anisole, and Isoamylene derivatives. These products will serve industries such as polymers, pharmaceuticals, agrochemicals, and personal care. The company will have capacities of 5,000 MTPA for Anisole, 3,000 MTPA for MEHQ, and 2,000 MTPA for Guaiacol, with full operations expected by Q3 FY25. MEHQ and Guaiacol will be produced using a cost-effective vapour phase technology, ensuring high profit margins. While MEHQ is geared toward exports, especially in China, Guaiacol has both domestic and global potential.Integration of Subsidiaries: Vinati Organics is strengthening its butyl phenol value chain by building a 10,000 MTPA Isoamylene plant, which will help maintain margins. The integration of Veeral Additives with VO will further protect margins in the antioxidants segment. Veeral Additives produces phenolic antioxidants used in various polymers and materials, with plans to introduce new molecules currently in R\u0026D. The antioxidant segment contributed around  ₹130 crore to FY24 revenue, and the company is aiming for a 60-70% domestic market share while pursuing export opportunities. At peak utilisation, revenue from this segment could reach  ₹700 crore.Increased Capacity for ATBS: Vinati Organics, a market leader in ATBS and IBB with a 65% share, saw these segments contribute 30% and 18%, respectively to FY24 revenue. To meet rising demand, it is expanding ATBS capacity from 40,000 MT to 60,000 MT, investing  ₹300 crore, with the new plant expected to be operational by H2 FY25. In Q1 FY24, the company reported strong sales of high-grade ATBS molecules, which are key to revenue growth. Long-term contracts for ATBS also signal continued demand.For FY24, Vinati Organics reported a 6.5% year-on-year decline in revenue to  ₹1,938.8 crore, with EBITDA decreasing by 11% to  ₹508.6 crore. The EBITDA margin fell by 132 basis points to 26.2%. The company invested  ₹360 crore in capex during FY24, focusing on niche products and facility expansions.Projected revenue growth of 21% is anticipated for FY25 and FY26, driven by improved utilisation of the antioxidants business and the commencement of new product facilities. The return on equity (ROE) is expected to rise from 15.5% to 17% by FY26, and the company is poised to generate a free cash flow of  ₹330 crore over the next two years.Vinati Organics stands at the cusp of significant growth, backed by strategic investments in new product lines and capacity expansions. With a solid financial foundation and a diversified product portfolio, the company is well-positioned to capitalize on emerging market opportunities while maintaining a robust outlook for the coming years.","cleaned_content":"domestic brokerage house hdfc securities reiterated its sell call on the chemicals stock vinati organics on the back of high valuations it has a target price of \u003cONE_THOUSAND\u003e on the counter implying a downside potential of \u003cTWO_TEN_PERCENT\u003e from current levels currently the stock is trading at \u003cFIVE_TEN\u003e \u003cFOUR_TEN\u003e fy25 and fy26 which we believe is contextually high therefore we are maintaining a sell recommendation on vinati organics with a target price of \u003cONE_THOUSAND\u003e said the brokerage even as it remains bullish on the companys long term outlook vinati organics vo is poised for substantial growth over the next few years driven by significant investments in new projects and an expanded product range said the brokerage according to hdfc securities the company is set to commercialise projects worth approximately \u003cEIGHT_HUNDRED\u003e crore in the next two quarters this development is expected to fuel revenue and ebitda growth rates of \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e respectively from fy24 to fy27 expansion of product range vinati organics plans to invest \u003cFIVE_\u003e billion in its subsidiary veeral organic private limited vopl to establish production plants for new products like mehq guaiacol anisole and isoamylene derivatives these products will serve industries such as polymers pharmaceuticals agrochemicals and personal care the company will have capacities of \u003cFIVE_THOUSAND\u003e mtpa for anisole \u003cTHREE_THOUSAND\u003e mtpa for mehq and \u003cTWO_THOUSAND\u003e mtpa for guaiacol with full operations expected by q3 fy25 mehq and guaiacol will be produced using a cost effective vapour phase technology ensuring high profit margins while mehq is geared toward exports especially in china guaiacol has both domestic and global potential integration of subsidiaries vinati organics is strengthening its butyl phenol value chain by building a \u003cONE_TEN_THOUSAND\u003e mtpa isoamylene plant which will help maintain margins the integration of veeral additives with vo will further protect margins in the antioxidants segment veeral additives produces phenolic antioxidants used in various polymers and materials with plans to introduce new molecules currently in r d the antioxidant segment contributed around \u003cONE_HUNDRED\u003e crore to fy24 revenue and the company is aiming for a \u003cSIX_TEN\u003e \u003cSEVEN_TEN_PERCENT\u003e domestic market share while pursuing export opportunities at peak utilisation revenue from this segment could reach \u003cSEVEN_HUNDRED\u003e crore increased capacity for atbs vinati organics a market leader in atbs and ibb with a \u003cSIX_TEN_PERCENT\u003e share saw these segments contribute \u003cTHREE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively to fy24 revenue to meet rising demand it is expanding atbs capacity from \u003cFOUR_TEN_THOUSAND\u003e mt to \u003cSIX_TEN_THOUSAND\u003e mt investing \u003cTHREE_HUNDRED\u003e crore with the new plant expected to be operational by h2 fy25 in q1 fy24 the company reported strong sales of high grade atbs molecules which are key to revenue growth long term contracts for atbs also signal continued demand for fy24 vinati organics reported a \u003cSIX_PERCENT\u003e year on year decline in revenue to \u003cONE_THOUSAND\u003e crore with ebitda decreasing by \u003cONE_TEN_PERCENT\u003e to \u003cFIVE_HUNDRED\u003e crore the ebitda margin fell by \u003cONE_HUNDRED\u003e basis points to \u003cTWO_TEN_PERCENT\u003e the company invested \u003cTHREE_HUNDRED\u003e crore in capex during fy24 focusing on niche products and facility expansions projected revenue growth of \u003cTWO_TEN_PERCENT\u003e is anticipated for fy25 and fy26 driven by improved utilisation of the antioxidants business and the commencement of new product facilities the return on equity roe is expected to rise from \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e by fy26 and the company is poised to generate a free cash flow of \u003cTHREE_HUNDRED\u003e crore over the next two years vinati organics stands at the cusp of significant growth backed by strategic investments in new product lines and capacity expansions with a solid financial foundation and a diversified product portfolio the company is well positioned to capitalize on emerging market opportunities while maintaining a robust outlook for the coming years","timestamp":"2024-10-08T15:57:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}