{"url":"https://www.livemint.com/market/stock-market-news/neopolitan-pizza-shares-list-at-rs-20-on-bse-sme-same-as-ipo-price-11728446546976.html","title":"Neopolitan Pizza shares list at  ₹20 on BSE SME, same as IPO price","description":"Neopolitan Pizza debuted at  ₹19.25, nearly matching its IPO price of  ₹20, on October 9. The IPO was 32.72 times subscribed, raising  ₹12 crore to fund a new manufacturing unit and repay debts while supporting its restaurant and agricultural trading businesses.","content":"Neopolitan Pizza IPO listing: Shares of Neopolitan Pizza had a flat debut on the bourses on Wednesday, October 9, listing at  ₹19.25 on the BSE SME, which is close to its IPO price of  ₹20. The SME initial public offer (IPO), valued at  ₹12 crore, was open for subscription from September 30 to October 4, 2024. The IPO is entirely a fresh issue of 60 lakh.The IPO received a healthy response, with an overall subscription of 32.72 times.The company plans to utilize the proceeds from the net fresh issue for several key initiatives. This includes setting up a new manufacturing unit to enhance its production capabilities.Additionally, a portion of the funds will be allocated for the repayment or prepayment of certain debt facilities. Furthermore, the proceeds will cover expenses related to the registration of land purchased from the promoter. The company will also reserve some funds for general corporate purposes to support its overall operations and strategic objectives.The company operates in two segments, namely the restaurant business and the trading of agricultural commodities. In the restaurant business, the company owns and operates its own restaurants as well as operates through a franchise model.It offers Neopolitan-style pizza, which is a traditional Italian pizza made with fresh ingredients. The menu includes a variety of toppings, and the company offers gluten-free and vegetarian options. The brand was named “Neopolitan Pizza,” a name derived from the little village of Italy where Pizza originated.In addition, the company deals in products such as wheat, rice, tomatoes, onions, and other such products. The trading segment of the business aims to source high-quality agricultural products from trusted suppliers and sell them to customers at competitive prices.As of December 31, 2023, the company has 19 restaurants located in more than 16 cities, spread across 2 states and union territories in India, as per the company's DRHP report.","cleaned_content":"neopolitan pizza ipo listing shares of neopolitan pizza had a flat debut on the bourses on wednesday october \u003cNINE_\u003e listing at \u003cONE_TEN\u003e on the bse sme which is close to its ipo price of \u003cTWO_TEN\u003e the sme initial public offer ipo valued at \u003cONE_TEN\u003e crore was open for subscription from september \u003cTHREE_TEN\u003e to october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e the ipo is entirely a fresh issue of \u003cSIX_TEN\u003e lakh the ipo received a healthy response with an overall subscription of \u003cTHREE_TEN\u003e times the company plans to utilize the proceeds from the net fresh issue for several key initiatives this includes setting up a new manufacturing unit to enhance its production capabilities additionally a portion of the funds will be allocated for the repayment or prepayment of certain debt facilities furthermore the proceeds will cover expenses related to the registration of land purchased from the promoter the company will also reserve some funds for general corporate purposes to support its overall operations and strategic objectives the company operates in two segments namely the restaurant business and the trading of agricultural commodities in the restaurant business the company owns and operates its own restaurants as well as operates through a franchise model it offers neopolitan style pizza which is a traditional italian pizza made with fresh ingredients the menu includes a variety of toppings and the company offers gluten free and vegetarian options the brand was named neopolitan pizza a name derived from the little village of italy where pizza originated in addition the company deals in products such as wheat rice tomatoes onions and other such products the trading segment of the business aims to source high quality agricultural products from trusted suppliers and sell them to customers at competitive prices as of december \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company has \u003cONE_TEN\u003e restaurants located in more than \u003cONE_TEN\u003e cities spread across \u003cTWO_\u003e states and union territories in india as per the companys drhp report","timestamp":"2024-10-09T10:16:00+05:30","market_timestamp":"2024-10-09T10:16:00+05:30","off_market_hours":false}