{"url":"https://www.livemint.com/market/stock-market-news/tata-elxsi-ttml-to-tata-power-these-ratan-tata-backed-tata-shares-jump-up-to-11-in-stock-market-today-11728536155623.html","title":"Tata Elxsi, TTML to Tata Power: These Tata group shares jump up to 15% in stock market today","description":"Tata Elxsi, TTML to Tata Power: These Ratan Tata-backed Tata shares jumped up to 15% in the stock market today. Tata Investment Corporation emerged as the top gainer among Tata group stocks.","content":"Tata Group Shares: Shares of Tata Group saw significant buying action during the early morning trade on Thursday, October 10. Most of the group's stocks were in the positive territory, led by Tata Investment Corporation, which surged 15% to  ₹7,545 apiece. Tata Teleservices (Maharashtra) followed with a gain of 9%, while Tata Chemicals also rose by 8.9%.Additionally, other stocks such as Tata Elxsi, Tata Technologies, and Tata Power Company also recorded gains exceeding 3%. Ahead of the Q2 earnings announcement today, TCS shares were also trading in the green, with a rise of nearly 1%.The whole country is paying tribute to the legendary Ratan Tata, who played a pivotal role in shaping one of India’s oldest conglomerates into a global empire through a series of visionary and eye-catching deals.Ratan Tata, who passed away on Wednesday at the age of 86, was not only a business leader but also a symbol of innovation and philanthropy. In the wake of his passing, the stock market is also reflecting this sentiment, with investors rallying to honour his legacy by buying shares in Tata Group companies.Despite Axis Capital retaining its 'reduce' rating on Tata Technologies with a target price of  ₹950 apiece, the stock jumped 4% today to  ₹1,089 apiece, reflecting positive sentiment towards Tata group stocks.Dr V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said, \"Investors can pay tribute to Ratan Tata and the great corporate empire he built by buying stocks like TCS, Tata Motors, Tata Steel, Tata Consumer and Indian Hotels. Ratan Tata, while pursuing the group’s growth, contributed substantially to India’s growth and millions of ordinary investors gained from the great man’s vision.\"Also, investors should learn from the growth of the Tata empire that a long-term investment horizon is required to really participate in the wealth creation that happens through the capital market. In a bull market like the present one, there will always be valuation concerns. But great companies like the ones Ratan Tata built will create wealth for investors in the long run,\" he added.Under Ratan Tata's leadership from 1991 to 2012, the Tata Group underwent significant transformations, expanding its global presence and diversifying its business portfolio. His tenure was marked by a strong emphasis on innovation, philanthropy, and sustainability, which helped transform the Tata Group into a leading global conglomerate.Ratan Tata spearheaded the group's expansion into new sectors, including, telecommunications, and retail, while overseeing the acquisition of iconic brands such as Jaguar Land Rover, Corus Steel, and Tetley Tea. During his leadership, the Tata Group achieved several milestones, including surpassing $100 billion in revenue, and launching the Tata Nano, the world's most affordable car.One of his most significant achievements was revitalizing Tata Motors. Under his leadership, the company’s passenger vehicle business, once on the verge of being sold, made a strong comeback with the successful launch of the Tata Indica in 1998. The model quickly became a leader in the Indian car market within two years.The company achieved profitability by 2003-2004, and in the following years, Tata Motors expanded its global footprint by acquiring Jaguar Land Rover in 2008.Tata Motors also launched India's first SUV, the Tata Safari, and in 2020, it introduced India's first electric SUV, the Nexon. Understanding the needs of the common man, Ratan Tata also launched the Tata Nano, further solidifying his commitment to affordable innovation.Tata Group now operates in more than 100 countries across six continents. Tata Sons is the principal investment holding company and promoter of Tata companies. Sixty-six per cent of the equity share capital of Tata Sons is held by philanthropic trusts, which support education, health, livelihood generation and art and culture.In 2023-24, the revenue of Tata companies, taken together, was more than $165 billion. These companies collectively employ over 1 million people. Each Tata company or enterprise operates independently under the guidance and supervision of its own board of directors. There are 26 publicly-listed Tata enterprises with a combined market capitalisation of more than $365 billion as of March 31, 2024.","cleaned_content":"tata group shares shares of tata group saw significant buying action during the early morning trade on thursday october \u003cONE_TEN\u003e most of the groups stocks were in the positive territory led by tata investment corporation which surged \u003cONE_TEN_PERCENT\u003e to \u003cSEVEN_THOUSAND\u003e apiece tata teleservices maharashtra followed with a gain of \u003cNINE_PERCENT\u003e while tata chemicals also rose by \u003cEIGHT_PERCENT\u003e additionally other stocks such as tata elxsi tata technologies and tata power company also recorded gains exceeding \u003cTHREE_PERCENT\u003e ahead of the q2 earnings announcement today tcs shares were also trading in the green with a rise of nearly \u003cONE_PERCENT\u003e the whole country is paying tribute to the legendary ratan tata who played a pivotal role in shaping one of india s oldest conglomerates into a global empire through a series of visionary and eye catching deals ratan tata who passed away on wednesday at the age of \u003cEIGHT_TEN\u003e was not only a business leader but also a symbol of innovation and philanthropy in the wake of his passing the stock market is also reflecting this sentiment with investors rallying to honour his legacy by buying shares in tata group companies despite axis capital retaining its reduce rating on tata technologies with a target price of \u003cNINE_HUNDRED\u003e apiece the stock jumped \u003cFOUR_PERCENT\u003e today to \u003cONE_THOUSAND\u003e apiece reflecting positive sentiment towards tata group stocks dr v k vijayakumar chief investment strategist geojit financial services said investors can pay tribute to ratan tata and the great corporate empire he built by buying stocks like tcs tata motors tata steel tata consumer and indian hotels ratan tata while pursuing the group s growth contributed substantially to india s growth and millions of ordinary investors gained from the great man s vision also investors should learn from the growth of the tata empire that a long term investment horizon is required to really participate in the wealth creation that happens through the capital market in a bull market like the present one there will always be valuation concerns but great companies like the ones ratan tata built will create wealth for investors in the long run he added under ratan tatas leadership from \u003cONE_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e the tata group underwent significant transformations expanding its global presence and diversifying its business portfolio his tenure was marked by a strong emphasis on innovation philanthropy and sustainability which helped transform the tata group into a leading global conglomerate ratan tata spearheaded the groups expansion into new sectors including telecommunications and retail while overseeing the acquisition of iconic brands such as jaguar land rover corus steel and tetley tea during his leadership the tata group achieved several milestones including surpassing \u003cONE_HUNDRED\u003e billion in revenue and launching the tata nano the worlds most affordable car one of his most significant achievements was revitalizing tata motors under his leadership the company s passenger vehicle business once on the verge of being sold made a strong comeback with the successful launch of the tata indica in \u003cONE_THOUSAND\u003e the model quickly became a leader in the indian car market within two years the company achieved profitability by \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e and in the following years tata motors expanded its global footprint by acquiring jaguar land rover in \u003cTWO_THOUSAND\u003e tata motors also launched indias first suv the tata safari and in \u003cTWO_THOUSAND\u003e it introduced indias first electric suv the nexon understanding the needs of the common man ratan tata also launched the tata nano further solidifying his commitment to affordable innovation tata group now operates in more than \u003cONE_HUNDRED\u003e countries across six continents tata sons is the principal investment holding company and promoter of tata companies sixty six per cent of the equity share capital of tata sons is held by philanthropic trusts which support education health livelihood generation and art and culture in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the revenue of tata companies taken together was more than \u003cONE_HUNDRED\u003e billion these companies collectively employ over \u003cONE_\u003e million people each tata company or enterprise operates independently under the guidance and supervision of its own board of directors there are \u003cTWO_TEN\u003e publicly listed tata enterprises with a combined market capitalisation of more than \u003cTHREE_HUNDRED\u003e billion as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-10T10:34:00+05:30","market_timestamp":"2024-10-10T10:34:00+05:30","off_market_hours":false}