{"url":"https://www.livemint.com/market/stock-market-news/shrikant-chouhan-of-kotak-securities-warns-of-market-corrections-advocates-buying-on-dips-11728624351732.html","title":"Shrikant Chouhan of Kotak Securities warns of market corrections, advocates buying on dips","description":"Shrikant Chouhan of Kotak Securities believes that the markets are completely dependent upon global macros and geopolitical cues. Chouhan expects some time-based corrections if the markets fail to surpass the immediate highest levels of 26,277 and 85,978 on the Nifty and Sensex, respectively.","content":"Shrikant Chouhan, Head of Equity Research at Kotak Securities, emphasised that market movements are heavily influenced by global macroeconomic factors and geopolitical tensions. He noted that Indian markets are beginning to discount domestic macroeconomic conditions and liquidity. Chouhan anticipates potential time-based corrections if the markets do not breach the immediate resistance levels of 26,277 for Nifty and 85,978 for Sensex. He advises investors to adopt a strategy of buying on dips at key support levels while also recommending a reduction in cash positions at resistance levels to facilitate portfolio consolidation. Edited Excerpts:The markets are depending entirely upon global macros and geopolitical developments now. I feel our markets have started discounting domestic macros and liquidity. We now need some support from global macros and ease in geopolitical tensions.The structural growth story of India is still intact but due to rich valuations, we could see limited upside in the near term. We could see time-based corrections if the markets fail to surpass the immediate highest levels of 26,277 and 85,978 on the Nifty and Sensex, respectively. Our strategy should be to buy on dips at each major support but at the same time, it is recommended to reduce some cash positions at resistance levels with a view to consolidate the portfolio.We expect Q2FY25 net profits of the BSE 30 index to increase by 5.3% YoY and 2.7% QoQ, and of the Nifty 50 index to grow by 3.7% YoY and 2.5% QoQ. We estimate the EPS of the BSE 30 index at  ₹3,448 for FY25 and  ₹4,039 for FY26 and of the Nifty 50 index at  ₹1,063 for FY25 and  ₹1,234 for FY26. In the consumer staples pack, we expect some uptick in value growth for most companies, largely led by pricing.We see a weakening in demand conditions imparting downside to the RBI’s growth estimates for FY25/26 as inflation aligns with the 4% target in FY26. This should leave enough room for policy easing, though an upside surprise in near-term food inflation can push out the rate cut cycle start to H1CY25. Our base case, for now, continues to be a shallow rate cut cycle (75-100 bps) beginning in December.Global macros, such as the trend of 10-year US bond yield, the rate-cutting cycle in the US, size of the stimulus package from China and the performance of crude prices on the back of rising geopolitical tensions.It should remain within the trading range of 23,000 and 27,000.Invest with a view of more than two years. Also, follow the strategy of investing gradually on dips. If they follow the route of SIP then it could be a much better option.","cleaned_content":"shrikant chouhan head of equity research at kotak securities emphasised that market movements are heavily influenced by global macroeconomic factors and geopolitical tensions he noted that indian markets are beginning to discount domestic macroeconomic conditions and liquidity chouhan anticipates potential time based corrections if the markets do not breach the immediate resistance levels of \u003cTWO_TEN_THOUSAND\u003e for nifty and \u003cEIGHT_TEN_THOUSAND\u003e for sensex he advises investors to adopt a strategy of buying on dips at key support levels while also recommending a reduction in cash positions at resistance levels to facilitate portfolio consolidation edited excerpts the markets are depending entirely upon global macros and geopolitical developments now i feel our markets have started discounting domestic macros and liquidity we now need some support from global macros and ease in geopolitical tensions the structural growth story of india is still intact but due to rich valuations we could see limited upside in the near term we could see time based corrections if the markets fail to surpass the immediate highest levels of \u003cTWO_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e on the nifty and sensex respectively our strategy should be to buy on dips at each major support but at the same time it is recommended to reduce some cash positions at resistance levels with a view to consolidate the portfolio we expect q2fy25 net profits of the bse \u003cTHREE_TEN\u003e index to increase by \u003cFIVE_PERCENT\u003e yoy and \u003cTWO_PERCENT\u003e qoq and of the nifty \u003cFIVE_TEN\u003e index to grow by \u003cTHREE_PERCENT\u003e yoy and \u003cTWO_PERCENT\u003e qoq we estimate the eps of the bse \u003cTHREE_TEN\u003e index at \u003cTHREE_THOUSAND\u003e for fy25 and \u003cFOUR_THOUSAND\u003e for fy26 and of the nifty \u003cFIVE_TEN\u003e index at \u003cONE_THOUSAND\u003e for fy25 and \u003cONE_THOUSAND\u003e for fy26 in the consumer staples pack we expect some uptick in value growth for most companies largely led by pricing we see a weakening in demand conditions imparting downside to the rbi s growth estimates for fy25 \u003cTWO_TEN\u003e as inflation aligns with the \u003cFOUR_PERCENT\u003e target in fy26 this should leave enough room for policy easing though an upside surprise in near term food inflation can push out the rate cut cycle start to h1cy25 our base case for now continues to be a shallow rate cut cycle \u003cSEVEN_TEN\u003e \u003cONE_HUNDRED\u003e bps beginning in december global macros such as the trend of \u003cONE_TEN\u003e year us bond yield the rate cutting cycle in the us size of the stimulus package from china and the performance of crude prices on the back of rising geopolitical tensions it should remain within the trading range of \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e invest with a view of more than two years also follow the strategy of investing gradually on dips if they follow the route of sip then it could be a much better option","timestamp":"2024-10-11T11:56:00+05:30","market_timestamp":"2024-10-11T11:56:00+05:30","off_market_hours":false}