{"url":"https://www.livemint.com/market/stock-market-news/up-1-174-in-4-years-pearl-global-industries-shares-surge-7-as-avendus-initiates-coverage-should-you-buy-11728024308653.html","title":"Up 1,174% in 4 years! Pearl Global Industries shares surge 7% as Avendus initiates coverage. Should you buy?","description":"Pearl Global Industries shares have been on a consistent upward trajectory over the past four years, rising from  ₹73 apiece to their current value of  ₹930, marking an impressive gain of 1,174%. Avendus Spark Institutional Equities has assigned a target price of  ₹1350 apiece.","content":"Shares of Pearl Global Industries (PGIL) regained momentum in Friday's trading session, surging 7.23% to  ₹939.80 per share after the domestic brokerage firm Avendus Spark Institutional Equities initiated coverage with a 'buy' rating. The brokerage set a target price of  ₹1,350 on the stock, signalling an upside potential of 54% from its previous close of  ₹875.40.The brokerage said the company is the only listed India-based Ready-Made Garment (RMG) manufacturer with a diversified production base spanning across Bangladesh, India, Vietnam, Indonesia, and Guatemala, positioning it as a proxy for the global RMG trade.While India’s role in the RMG trade is increasing, the significance of other exporting nations like Bangladesh and Vietnam remains strong due to their established ecosystems. PGIL’s multi-country presence allows it to leverage India’s growth story while benefiting from the cost advantages and capabilities of these other regions, said the brokerage.It stated that the company has undergone significant organisational changes in the past five years, with its promoters moving to non-executive roles and a professional management team being appointed.This transition has included hiring new auditors, bankers, and industry veterans to key managerial positions. It notes that several Indian garment manufacturers have seen improved profitability and growth after professional management was put in place, and Avendus believes PGIL is on a similar path.With an aggressive capex strategy, the brokerage believes the company is well-positioned to capture market share in the fragmented Indian RMG export market. It projects PGIL’s volume, EBITDA, and PAT to grow at approximately 15%, 25%, and 31% CAGR, respectively, over FY24-27.It also highlighted key volume drivers, including the revival in U.S. apparel imports, supplier consolidation, and global brands diversifying their sourcing bases. Additionally, the company plans to ramp up capacity from 85 million pieces annually to around 115 million in the next three years, with most of the incremental capex focused on India.It expects that the improved price/mix, driven by value-added offerings and higher contributions from premium brands, will enhance EBITDA per piece through better product mix and operating leverage.Despite the company's superior capital efficiency, Avendus notes that the company trades at a discount with a 10x FY27 P/E compared to the industry average of 19x FY27 P/E, leaving room for potential multiple revisions.The shares have been on a consistent upward trajectory over the past four years, rising from  ₹73 apiece to their current value of  ₹930, marking an impressive gain of 1,174%. This remarkable performance is reflected in its yearly returns, as the stock has consistently ended each of the past five years in positive territory.In the calendar year 2023 (CY23), the stock delivered a whopping return of 217%, building on a 17% gain in CY22 and an impressive 74% surge in CY21. Looking further back, it posted gains of 29% in CY20 and 15% in CY19. Notably, the upward momentum has shown no signs of slowing down in the current year, with the stock already up by 43% without any significant pullback.In August, the company’s shares achieved a significant milestone by crossing the  ₹1,000 mark for the first time, hitting a fresh all-time high of  ₹1,095 per share. Further, the latest target price set by Spark suggests that the rally could extend through the remainder of the year.","cleaned_content":"shares of pearl global industries pgil regained momentum in fridays trading session surging \u003cSEVEN_PERCENT\u003e to \u003cNINE_HUNDRED\u003e per share after the domestic brokerage firm avendus spark institutional equities initiated coverage with a buy rating the brokerage set a target price of \u003cONE_THOUSAND\u003e on the stock signalling an upside potential of \u003cFIVE_TEN_PERCENT\u003e from its previous close of \u003cEIGHT_HUNDRED\u003e the brokerage said the company is the only listed india based ready made garment rmg manufacturer with a diversified production base spanning across bangladesh india vietnam indonesia and guatemala positioning it as a proxy for the global rmg trade while india s role in the rmg trade is increasing the significance of other exporting nations like bangladesh and vietnam remains strong due to their established ecosystems pgil s multi country presence allows it to leverage india s growth story while benefiting from the cost advantages and capabilities of these other regions said the brokerage it stated that the company has undergone significant organisational changes in the past five years with its promoters moving to non executive roles and a professional management team being appointed this transition has included hiring new auditors bankers and industry veterans to key managerial positions it notes that several indian garment manufacturers have seen improved profitability and growth after professional management was put in place and avendus believes pgil is on a similar path with an aggressive capex strategy the brokerage believes the company is well positioned to capture market share in the fragmented indian rmg export market it projects pgil s volume ebitda and pat to grow at approximately \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e cagr respectively over fy24 \u003cTWO_TEN\u003e it also highlighted key volume drivers including the revival in u s apparel imports supplier consolidation and global brands diversifying their sourcing bases additionally the company plans to ramp up capacity from \u003cEIGHT_TEN\u003e million pieces annually to around \u003cONE_HUNDRED\u003e million in the next three years with most of the incremental capex focused on india it expects that the improved price mix driven by value added offerings and higher contributions from premium brands will enhance ebitda per piece through better product mix and operating leverage despite the companys superior capital efficiency avendus notes that the company trades at a discount with a \u003cONE_TEN\u003e x fy27 p e compared to the industry average of \u003cONE_TEN\u003e x fy27 p e leaving room for potential multiple revisions the shares have been on a consistent upward trajectory over the past four years rising from \u003cSEVEN_TEN\u003e apiece to their current value of \u003cNINE_HUNDRED\u003e marking an impressive gain of \u003cONE_THOUSAND_PERCENT\u003e this remarkable performance is reflected in its yearly returns as the stock has consistently ended each of the past five years in positive territory in the calendar year \u003cTWO_THOUSAND\u003e cy23 the stock delivered a whopping return of \u003cTWO_HUNDRED_PERCENT\u003e building on a \u003cONE_TEN_PERCENT\u003e gain in cy22 and an impressive \u003cSEVEN_TEN_PERCENT\u003e surge in cy21 looking further back it posted gains of \u003cTWO_TEN_PERCENT\u003e in cy20 and \u003cONE_TEN_PERCENT\u003e in cy19 notably the upward momentum has shown no signs of slowing down in the current year with the stock already up by \u003cFOUR_TEN_PERCENT\u003e without any significant pullback in august the company s shares achieved a significant milestone by crossing the \u003cONE_THOUSAND\u003e mark for the first time hitting a fresh all time high of \u003cONE_THOUSAND\u003e per share further the latest target price set by spark suggests that the rally could extend through the remainder of the year","timestamp":"2024-10-04T14:03:00+05:30","market_timestamp":"2024-10-04T14:03:00+05:30","off_market_hours":false}