{"url":"https://www.livemint.com/market/stock-market-news/pnc-infratech-shares-climb-7-after-company-secures-road-project-worth-rs-2-091-crore-11728534379681.html","title":"PNC Infratech shares climb 7% after company secures project worth  ₹2,091 crore","description":"PNC Infratech shares rose 7% to  ₹458.90 after winning a  ₹2,091 crore infrastructure project near Navi Mumbai Airport. The four-year contract includes road and bridge construction, enhancing the company's robust order book valued at  ₹14,100 crore.","content":"PNC Infratech shares surged 7% in Thursday's early morning trade to  ₹458.90 after the company announced that it has emerged as the \"lowest bidder\" for a  ₹2,091 crore infrastructure project near the upcoming Navi Mumbai Airport.The four-year contract includes building roads, flyovers, minor bridges, and related electrical works, according to the regulatory filing. The project bids were invited by the City \u0026 Industrial Development Corporation of Maharashtra Ltd. (CIDCO), Navi Mumbai’s town planning authority.\"Our Company has been declared Ll (First Lowest) bidder in an EPC project on item rate percentage, namely \"Integrated Infrastructure Development of 20M \u0026 above wide roads, Construction of Various Major \u0026 Minor Structures (Viz Flyover, Minor Bridges, VUPS, PUPS, etc.), and Allied Electrical Works (Street Light) in TPS-8,9 and TPS-12 under NAINA Project on 09.10.2024 for a quoted price of Rs. 2090.59 crore,\" the company said in its regulatory filing on Wednesday.In August, the company was awarded a  ₹380 crore contract as the lowest bidder for a highway-cum-bridge project by the National Highways Authority of India (NHAI). This involves constructing and operating an additional three-lane bridge over the River Ganga, connecting Buxar and Bharauli on National Highway 922 in Uttar Pradesh and Bihar under the hybrid annuity model.This year, the company has secured numerous highway and expressway projects, positioning itself to leverage the government’s extensive plans for infrastructure development. As of the June quarter, the company maintains a robust order book valued at  ₹14,100 crore, as per the company's Q1 earnings presentation.In the FY 2024-25 Interim Budget, road sector funding increased by 2.7%, with the Ministry of Road Transport and Highways receiving  ₹2.78 lakh crore, just 0.5% above the revised estimate of  ₹2.76 lakh crore. Of this allocation,  ₹1.68 lakh crore is earmarked for NHAI's national highway corridor under the Bharatmala Pariyojana.In terms of financials, the company in the first quarter of the current fiscal year reported a consolidated net profit of  ₹575 crore, a 218% rise from  ₹181 crore in the same period last year, while revenue from operations grew to  ₹2,168 crore from  ₹2,092 crore in Q1 FY24.Over the past four years, the stock has risen from  ₹156 to  ₹445.95 per share, delivering an impressive 185% gain. In June, it reached an all-time high of  ₹556.95 per share.The company offers comprehensive infrastructure solutions, including EPC services on item-rate and fixed-sum turnkey bases. It also undertakes projects under various public-private partnership models, such as Design-Build-Finance-Operate-Transfer (DBFOT) and Operate-Maintain-Transfer.","cleaned_content":"pnc infratech shares surged \u003cSEVEN_PERCENT\u003e in thursdays early morning trade to \u003cFOUR_HUNDRED\u003e after the company announced that it has emerged as the lowest bidder for a \u003cTWO_THOUSAND\u003e crore infrastructure project near the upcoming navi mumbai airport the four year contract includes building roads flyovers minor bridges and related electrical works according to the regulatory filing the project bids were invited by the city industrial development corporation of maharashtra ltd cidco navi mumbai s town planning authority our company has been declared ll first lowest bidder in an epc project on item rate percentage namely integrated infrastructure development of \u003cTWO_TEN\u003e m above wide roads construction of various major minor structures viz flyover minor bridges vups pups etc and allied electrical works street light in tps \u003cEIGHT_TEN\u003e and tps \u003cONE_TEN\u003e under naina project on \u003cNINE_\u003e 2024 for a quoted price of rs \u003cTWO_THOUSAND\u003e crore the company said in its regulatory filing on wednesday in august the company was awarded a \u003cTHREE_HUNDRED\u003e crore contract as the lowest bidder for a highway cum bridge project by the national highways authority of india nhai this involves constructing and operating an additional three lane bridge over the river ganga connecting buxar and bharauli on national highway \u003cNINE_HUNDRED\u003e in uttar pradesh and bihar under the hybrid annuity model this year the company has secured numerous highway and expressway projects positioning itself to leverage the government s extensive plans for infrastructure development as of the june quarter the company maintains a robust order book valued at \u003cONE_TEN_THOUSAND\u003e crore as per the companys q1 earnings presentation in the fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e interim budget road sector funding increased by \u003cTWO_PERCENT\u003e with the ministry of road transport and highways receiving \u003cTWO_\u003e lakh crore just \u003cZERO_PERCENT\u003e above the revised estimate of \u003cTWO_\u003e lakh crore of this allocation \u003cONE_\u003e lakh crore is earmarked for nhais national highway corridor under the bharatmala pariyojana in terms of financials the company in the first quarter of the current fiscal year reported a consolidated net profit of \u003cFIVE_HUNDRED\u003e crore a \u003cTWO_HUNDRED_PERCENT\u003e rise from \u003cONE_HUNDRED\u003e crore in the same period last year while revenue from operations grew to \u003cTWO_THOUSAND\u003e crore from \u003cTWO_THOUSAND\u003e crore in q1 fy24 over the past four years the stock has risen from \u003cONE_HUNDRED\u003e to \u003cFOUR_HUNDRED\u003e per share delivering an impressive \u003cONE_HUNDRED_PERCENT\u003e gain in june it reached an all time high of \u003cFIVE_HUNDRED\u003e per share the company offers comprehensive infrastructure solutions including epc services on item rate and fixed sum turnkey bases it also undertakes projects under various public private partnership models such as design build finance operate transfer dbfot and operate maintain transfer","timestamp":"2024-10-10T10:07:00+05:30","market_timestamp":"2024-10-10T10:07:00+05:30","off_market_hours":false}