{"url":"https://www.livemint.com/market/stock-market-news/q2-earnings-preview-3-nifty-50-companies-likely-to-see-over-25-decline-in-net-profit-11728545497588.html","title":"Q2 Earnings Preview: 3 Nifty 50 companies likely to see over 25% decline in net profit","description":"MOSL forecasts BPCL's net profit to fall 45.3% YoY in Q2FY25, with revenue increasing by 4%. Ultratech Cement is expected to see a 27% drop in net profit, while JSW Steel's profit may plummet over 85% YoY.","content":"Q2 Earnings Preview: Motilal Oswal Financial Services (MOSL) noted that the past two financial years saw a dynamic interplay between revenue and earnings growth, largely influenced by global macroeconomic factors. In FY23, the MOFSL Universe faced a significant margin squeeze due to rising commodity prices, driven by the Russia-Ukraine war. Despite a 24 per cent growth in revenue, the sharp increase in costs resulted in only an 11 per cent earnings growth for the MOFSL Universe.However, FY24 witnessed a reversal of this trend, as commodity prices eased and margins rebounded significantly. This led to a 30 per cent earnings growth, despite revenue growth slowing to just 4 per cent. MOSL expects earnings to normalise in FY25, aligning more closely with revenue trends.For FY25, MOSL anticipates the MOFSL Universe to deliver 7 per cent revenue growth, with EBITDA and PAT growth of 8 per cent year-on-year (YoY) each. The Nifty 50 is projected to post a 7 per cent earnings growth in FY25, following a high base of 26 per cent in FY24.While most companies are expected to show moderate earnings growth in the September quarter, the brokerage has identified three Nifty50 firms that are likely to post an over 25 per cent decline in their net profits.Let's delve into the details.Ultratech Cement: MOSL expects the cement company to post a 27 per cent YoY decline in its net profit to  ₹930 crore for Q2FY25 as against  ₹1,280 crore in the same quarter last year. Meanwhile, its net sales are also likely to decrease by 2.4 per cent YoY to  ₹15,630 crore in the quarter under review from  ₹16,000 crore in the year-ago period. EBITDA is expected to decline 29 per cent to  ₹2,170 crore while margins could fall to 13.9 per cent from 17.2 per cent in the same period last year.The brokerage estimates a 5 per cent yearly increase in consolidated sales volume, while blended realisation is expected to decline by 7 per cent YoY. Revenue from Ready Mix Concrete (RMC) and white cement is projected to grow by 9 per cent YoY. The brokerage anticipates EBITDA per ton to come in at  ₹775, compared with  ₹956 in the second quarter of FY24 and  ₹951 in the first quarter of FY25. Variable cost per ton is estimated to drop by 7 per cent YoY, with operating expenses per ton expected to decline by 5 per cent YoY.Additionally, depreciation and interest expenses are estimated to rise 7 per cent and 5 per cent YoY, respectively, leading to an expected adjusted profit after tax (PAT) decline of 27 per cent YoY.JSW Steel: According to the brokerage, the net profit of the steel firm is likely to tank over 85 per cent YoY to around  ₹500 crore for Q2FY25 versus  ₹2,800 crore in the same quarter last year. Meanwhile, MOFSL forecasts its net sales to fall 7.1 per cent YoY to  ₹41,400 crore in the quarter under review as against  ₹44,600 crore in the year-ago period.MOSL also indicated that quarter-on-quarter (QoQ) margins are expected to decline due to weak average selling prices (ASP). The pricing outlook for both the domestic and international markets will be critical to monitor moving forward. Additionally, the performance of domestic subsidiaries and overseas operations will play a vital role in the overall assessment. Management commentary on capital expenditures and project timelines will also be essential for understanding the company's strategic direction.BPCL: MOSL estimates the net profit of the OMC to decrease by 45.3 per cent YoY to  ₹4,650 crore in Q2FY25 versus  ₹8,500 crore in the same quarter last year. Meanwhile, its revenue is expected to rise 4 per cent YoY to  ₹1,07,110 crore in the quarter under review from  ₹1,02,990 crore in the year-ago period. EBITDA is also likely to fall to  ₹7,820 crore from  ₹13,010 crore in Q2FY24 while the margin is projected to drop to 7.3 per cent from 12.6 per cent YoY.MOSL projects refinery throughput at 9 million metric tons (mmt) for the upcoming quarter. The brokerage expects reported gross refining margins (GRM) to reach $8 per barrel, with a blended gross marketing margin of  ₹5.7 per litre. Marketing sales volumes, excluding exports, are anticipated to be 12.7 mmt, reflecting a 4 per cent YoY increase but a 4 per cent quarter-on-quarter decline. MOSL emphasised the importance of monitoring updates regarding the expansion of the Bina refinery and the construction of a new petrochemical plant, as these developments could significantly impact future performance.","cleaned_content":"q2 earnings preview motilal oswal financial services mosl noted that the past two financial years saw a dynamic interplay between revenue and earnings growth largely influenced by global macroeconomic factors in fy23 the mofsl universe faced a significant margin squeeze due to rising commodity prices driven by the russia ukraine war despite a \u003cTWO_TEN_PERCENT\u003e growth in revenue the sharp increase in costs resulted in only an \u003cONE_TEN_PERCENT\u003e earnings growth for the mofsl universe however fy24 witnessed a reversal of this trend as commodity prices eased and margins rebounded significantly this led to a \u003cTHREE_TEN_PERCENT\u003e earnings growth despite revenue growth slowing to just \u003cFOUR_PERCENT\u003e mosl expects earnings to normalise in fy25 aligning more closely with revenue trends for fy25 mosl anticipates the mofsl universe to deliver \u003cSEVEN_PERCENT\u003e revenue growth with ebitda and pat growth of \u003cEIGHT_PERCENT\u003e year on year yoy each the nifty \u003cFIVE_TEN\u003e is projected to post a \u003cSEVEN_PERCENT\u003e earnings growth in fy25 following a high base of \u003cTWO_TEN_PERCENT\u003e in fy24 while most companies are expected to show moderate earnings growth in the september quarter the brokerage has identified three nifty50 firms that are likely to post an over \u003cTWO_TEN_PERCENT\u003e decline in their net profits lets delve into the details ultratech cement mosl expects the cement company to post a \u003cTWO_TEN_PERCENT\u003e yoy decline in its net profit to \u003cNINE_HUNDRED\u003e crore for q2fy25 as against \u003cONE_THOUSAND\u003e crore in the same quarter last year meanwhile its net sales are also likely to decrease by \u003cTWO_PERCENT\u003e yoy to \u003cONE_TEN_THOUSAND\u003e crore in the quarter under review from \u003cONE_TEN_THOUSAND\u003e crore in the year ago period ebitda is expected to decline \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_THOUSAND\u003e crore while margins could fall to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in the same period last year the brokerage estimates a \u003cFIVE_PERCENT\u003e yearly increase in consolidated sales volume while blended realisation is expected to decline by \u003cSEVEN_PERCENT\u003e yoy revenue from ready mix concrete rmc and white cement is projected to grow by \u003cNINE_PERCENT\u003e yoy the brokerage anticipates ebitda per ton to come in at \u003cSEVEN_HUNDRED\u003e compared with \u003cNINE_HUNDRED\u003e in the second quarter of fy24 and \u003cNINE_HUNDRED\u003e in the first quarter of fy25 variable cost per ton is estimated to drop by \u003cSEVEN_PERCENT\u003e yoy with operating expenses per ton expected to decline by \u003cFIVE_PERCENT\u003e yoy additionally depreciation and interest expenses are estimated to rise \u003cSEVEN_PERCENT\u003e and \u003cFIVE_PERCENT\u003e yoy respectively leading to an expected adjusted profit after tax pat decline of \u003cTWO_TEN_PERCENT\u003e yoy jsw steel according to the brokerage the net profit of the steel firm is likely to tank over \u003cEIGHT_TEN_PERCENT\u003e yoy to around \u003cFIVE_HUNDRED\u003e crore for q2fy25 versus \u003cTWO_THOUSAND\u003e crore in the same quarter last year meanwhile mofsl forecasts its net sales to fall \u003cSEVEN_PERCENT\u003e yoy to \u003cFOUR_TEN_THOUSAND\u003e crore in the quarter under review as against \u003cFOUR_TEN_THOUSAND\u003e crore in the year ago period mosl also indicated that quarter on quarter qoq margins are expected to decline due to weak average selling prices asp the pricing outlook for both the domestic and international markets will be critical to monitor moving forward additionally the performance of domestic subsidiaries and overseas operations will play a vital role in the overall assessment management commentary on capital expenditures and project timelines will also be essential for understanding the companys strategic direction bpcl mosl estimates the net profit of the omc to decrease by \u003cFOUR_TEN_PERCENT\u003e yoy to \u003cFOUR_THOUSAND\u003e crore in q2fy25 versus \u003cEIGHT_THOUSAND\u003e crore in the same quarter last year meanwhile its revenue is expected to rise \u003cFOUR_PERCENT\u003e yoy to \u003cONE_HUNDRED_THOUSAND\u003e crore in the quarter under review from \u003cONE_HUNDRED_THOUSAND\u003e crore in the year ago period ebitda is also likely to fall to \u003cSEVEN_THOUSAND\u003e crore from \u003cONE_TEN_THOUSAND\u003e crore in q2fy24 while the margin is projected to drop to \u003cSEVEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e yoy mosl projects refinery throughput at \u003cNINE_\u003e million metric tons mmt for the upcoming quarter the brokerage expects reported gross refining margins grm to reach \u003cEIGHT_\u003e per barrel with a blended gross marketing margin of \u003cFIVE_\u003e per litre marketing sales volumes excluding exports are anticipated to be \u003cONE_TEN\u003e mmt reflecting a \u003cFOUR_PERCENT\u003e yoy increase but a \u003cFOUR_PERCENT\u003e quarter on quarter decline mosl emphasised the importance of monitoring updates regarding the expansion of the bina refinery and the construction of a new petrochemical plant as these developments could significantly impact future performance","timestamp":"2024-10-10T13:38:00+05:30","market_timestamp":"2024-10-10T13:38:00+05:30","off_market_hours":false}