{"url":"https://www.livemint.com/market/stock-market-news/breakout-stocks-to-buy-or-sell-vip-industries-to-care-ratings-sumeet-bagadia-recommends-five-shares-to-buy-today-11728265381560.html","title":"Breakout stocks to buy or sell: VIP Industries to CARE Ratings — Sumeet Bagadia recommends five shares to buy today","description":"Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Sree Rayalaseema Hi-Strength Hypo, Quick Heal Technologies, VIP Industries, R Systems International, and CARE Ratings","content":"Breakout stocks to buy or sell: Amid the Israel-Iran war, the Indian stock market ended lower for the fifth straight session on Friday last week. The Nifty 50 index recorded its worst week in over two years amid rising tensions in the Middle East region. After the end of Friday's session, the Nifty 50 index lost 235 points and closed at the 25,014 mark; the BSE Sensex crashed 808 points and ended at 81,688, whereas the Nifty Bank index finished 288 points lower at 51,556. Cash market volumes on the NSE were 7% lower than in the previous session. The Mid-cap index fell slightly more than the Nifty, even as the advance-decline ratio dropped sharply to 0.43:1.Sumeet Bagadia, Executive Director at Choice Broking, believes the Indian stock market trend has turned highly bearish after the biggest weekly fall in the Nifty 50 index in CY24. The Choice Broking expert said the 50-stock index has crucial support at around the 24,300 to 24,250 range. Bagadia noted that the Nifty Bank Index also looks weak after breaching below the 51,900 mark. He said the support for the Nifty Bank index is now in the 49,800 to 49,700 range. Sumeet Bagadia of Choice Broking advised investors to maintain a stock-specific approach and suggested looking at breakout stocks that still look positive on the technical chart.Regarding breakout stocks to buy today, Sumeet Bagadia recommended buying these five shares: Sree Rayalaseema Hi-Strength Hypo, Quick Heal Technologies, VIP Industries, R Systems International, and CARE Ratings.1] Sree Rayalaseema Hi-Strength Hypo: Buy at  ₹757, target  ₹807, stop loss  ₹730;2] Quick Heal Technologies: Buy at  ₹685, target  ₹725, stop loss  ₹660;3] VIP Industries: Buy at  ₹564.15, target  ₹595, stop loss  ₹544;4] R Systems International: Buy at  ₹506.15, target  ₹533, stop loss  ₹487; and5] CARE Rating: Buy at  ₹1096.25, target  ₹1150, stop loss  ₹1060.","cleaned_content":"breakout stocks to buy or sell amid the israel iran war the indian stock market ended lower for the fifth straight session on friday last week the nifty \u003cFIVE_TEN\u003e index recorded its worst week in over two years amid rising tensions in the middle east region after the end of fridays session the nifty \u003cFIVE_TEN\u003e index lost \u003cTWO_HUNDRED\u003e points and closed at the \u003cTWO_TEN_THOUSAND\u003e mark the bse sensex crashed \u003cEIGHT_HUNDRED\u003e points and ended at \u003cEIGHT_TEN_THOUSAND\u003e whereas the nifty bank index finished \u003cTWO_HUNDRED\u003e points lower at \u003cFIVE_TEN_THOUSAND\u003e cash market volumes on the nse were \u003cSEVEN_PERCENT\u003e lower than in the previous session the mid cap index fell slightly more than the nifty even as the advance decline ratio dropped sharply to \u003cZERO_\u003e \u003cONE_\u003e sumeet bagadia executive director at choice broking believes the indian stock market trend has turned highly bearish after the biggest weekly fall in the nifty \u003cFIVE_TEN\u003e index in cy24 the choice broking expert said the \u003cFIVE_TEN\u003e stock index has crucial support at around the \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e range bagadia noted that the nifty bank index also looks weak after breaching below the \u003cFIVE_TEN_THOUSAND\u003e mark he said the support for the nifty bank index is now in the \u003cFOUR_TEN_THOUSAND\u003e to \u003cFOUR_TEN_THOUSAND\u003e range sumeet bagadia of choice broking advised investors to maintain a stock specific approach and suggested looking at breakout stocks that still look positive on the technical chart regarding breakout stocks to buy today sumeet bagadia recommended buying these five shares sree rayalaseema hi strength hypo quick heal technologies vip industries r systems international and care ratings 1 sree rayalaseema hi strength hypo buy at \u003cSEVEN_HUNDRED\u003e target \u003cEIGHT_HUNDRED\u003e stop loss \u003cSEVEN_HUNDRED\u003e \u003cTWO_\u003e quick heal technologies buy at \u003cSIX_HUNDRED\u003e target \u003cSEVEN_HUNDRED\u003e stop loss \u003cSIX_HUNDRED\u003e \u003cTHREE_\u003e vip industries buy at \u003cFIVE_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cFIVE_HUNDRED\u003e \u003cFOUR_\u003e r systems international buy at \u003cFIVE_HUNDRED\u003e target \u003cFIVE_HUNDRED\u003e stop loss \u003cFOUR_HUNDRED\u003e and5 care rating buy at \u003cONE_THOUSAND\u003e target \u003cONE_THOUSAND\u003e stop loss \u003cONE_THOUSAND\u003e","timestamp":"2024-10-07T07:24:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}