{"url":"https://www.livemint.com/market/stock-market-news/vedanta-stock-dips-2-even-after-posting-highest-ever-aluminium-production-in-q2-11728040041183.html","title":"Vedanta stock dips 2% even after posting highest-ever aluminium production in Q2","description":"Vedanta also reported achieving its highest-ever mined and refined metal production in Zinc India during the second quarter.","content":"Metal giant Vedanta announced that it achieved its highest-ever aluminium production, reaching 1,205 kt in the first half of the financial year. Despite the positive update, the company's stock dropped by 2 per cent, hitting a day's low of  ₹501 on the BSE.The company's alumina production has increased by 21 per cent year-on-year (YoY).Vedanta also reported achieving its highest-ever mined and refined metal production in Zinc India during the second quarter. The company reached a record high in mined metal production, while refined metal output rose by 5 per cent YoY, totaling 524 kt in the first half of the year.Zinc international volumes increased by 16 per cent quarter-on-quarter, while the company's power sales grew by 10 per cent year-on-year in the first half, driven by higher generation from thermal plants. Silver volumes in the second quarter surged by 10 per cent compared to the previous quarter.For the first quarter ending June 2024, Vedanta reported a 37 per cent year-on-year (YoY) increase in consolidated net profit, reaching  ₹3,606 crore compared to  ₹2,640 crore in the same period last year.Revenue from operations for the quarter grew by 6 per cent YoY to  ₹35,239 crore, up from  ₹33,342 crore in the corresponding quarter of the previous year.The company also highlighted record-high Alumina production at its Lanjigarh refinery, hitting 539 kt, a 36 per cent YoY increase driven by expanded capacity. Cast Metal production of Aluminium rose 3 per cent YoY to 596 kt, while the cost of Aluminium production decreased by 11 per cent YoY.Vedanta’s shares have surged nearly 160 per cent over the past year. Year-to-date, the stock has nearly doubled, rising by 65 per cent over the last six months and 9.4 per cent in the past three months, according to BSE analytics.","cleaned_content":"metal giant vedanta announced that it achieved its highest ever aluminium production reaching \u003cONE_THOUSAND\u003e kt in the first half of the financial year despite the positive update the companys stock dropped by \u003cTWO_PERCENT\u003e hitting a days low of \u003cFIVE_HUNDRED\u003e on the bse the companys alumina production has increased by \u003cTWO_TEN_PERCENT\u003e year on year yoy vedanta also reported achieving its highest ever mined and refined metal production in zinc india during the second quarter the company reached a record high in mined metal production while refined metal output rose by \u003cFIVE_PERCENT\u003e yoy totaling \u003cFIVE_HUNDRED\u003e kt in the first half of the year zinc international volumes increased by \u003cONE_TEN_PERCENT\u003e quarter on quarter while the companys power sales grew by \u003cONE_TEN_PERCENT\u003e year on year in the first half driven by higher generation from thermal plants silver volumes in the second quarter surged by \u003cONE_TEN_PERCENT\u003e compared to the previous quarter for the first quarter ending june \u003cTWO_THOUSAND\u003e vedanta reported a \u003cTHREE_TEN_PERCENT\u003e year on year yoy increase in consolidated net profit reaching \u003cTHREE_THOUSAND\u003e crore compared to \u003cTWO_THOUSAND\u003e crore in the same period last year revenue from operations for the quarter grew by \u003cSIX_PERCENT\u003e yoy to \u003cTHREE_TEN_THOUSAND\u003e crore up from \u003cTHREE_TEN_THOUSAND\u003e crore in the corresponding quarter of the previous year the company also highlighted record high alumina production at its lanjigarh refinery hitting \u003cFIVE_HUNDRED\u003e kt a \u003cTHREE_TEN_PERCENT\u003e yoy increase driven by expanded capacity cast metal production of aluminium rose \u003cTHREE_PERCENT\u003e yoy to \u003cFIVE_HUNDRED\u003e kt while the cost of aluminium production decreased by \u003cONE_TEN_PERCENT\u003e yoy vedanta s shares have surged nearly \u003cONE_HUNDRED_PERCENT\u003e over the past year year to date the stock has nearly doubled rising by \u003cSIX_TEN_PERCENT\u003e over the last six months and \u003cNINE_PERCENT\u003e in the past three months according to bse analytics","timestamp":"2024-10-04T17:17:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}