{"url":"https://www.livemint.com/market/stock-market-news/ratesensitive-sectors-soar-as-rbi-shifts-policy-stance-realty-leads-with-2-gains-banks-auto-jump-1-each-11728452841649.html","title":"Rate-sensitive sectors soar as RBI shifts policy stance; realty pack leads with 2% gain, banks \u0026 auto jump 1% each","description":"The rate-sensitive sectors reacted strongly to the RBI’s policy shift. Nifty Realty surged over 2 per cent, while Nifty PSU Bank and Nifty Financial Services advanced by around 1.5 per cent each. Nifty Bank, Nifty Private Bank, and Nifty Auto also gained more than 1 per cent each.","content":"Rate-sensitive sectors surged on Wednesday, October 9 following the Reserve Bank of India (RBI)'s decision to change its policy stance to 'Neutral' from 'Withdrawal of Accommodation,' indicating the possibility of a rate cut in December.The RBI’s Monetary Policy Committee (MPC), however, kept the repo rate unchanged at 6.5 per cent for the tenth consecutive time.RBI Governor Shaktikanta Das, in his policy statement, noted that five out of six MPC members voted to maintain the repo rate at 6.5 per cent, while all six agreed on the shift to a ‘neutral’ stance. This change marks the first alteration in the RBI's stance in two years. Alongside the rate decision, the central bank maintained its inflation projection for FY25 at 4.5 per cent and forecasted a real GDP growth rate of 7.2 per cent for the fiscal year.Following the policy announcement, Indian stock markets extended their upward momentum. The Sensex gained 608 points, or 0.75 per cent, to reach the day's high of 82,243. Meanwhile, the Nifty 50 rose 208.3 points, or 0.8 per cent, to 25,221.45. Broader market indices, including midcap and smallcap stocks, outperformed the benchmarks, rallying 1.5 per cent each.The rate-sensitive sectors reacted strongly to the RBI’s policy shift. Nifty Realty surged over 2 per cent, while Nifty PSU Bank and Nifty Financial Services advanced by around 1.5 per cent each. Nifty Bank, Nifty Private Bank, and Nifty Auto also gained more than 1 per cent each.Within the Nifty Bank index, most stocks traded positively. Punjab National Bank led the gains, rising over 2 per cent, followed by SBI and Axis Bank, which added more than 2 per cent each. Other major gainers included ICICI Bank, IndusInd Bank, and Bank of Baroda, each posting gains between 0.5 per cent and 2 per cent. Federal Bank and IDFC First Bank were the only two stocks in the red.In the financial services space, Shriram Finance led the rally with a 4 per cent increase. HDFC AMC and Chola Finance followed closely, both rising over 3 per cent. Muthoot Finance, Bajaj Finance, Bajaj FinServ, HDFC Life, PFC, REC, SBI Cards, LIC Housing, ICICI Prudential, and SBI Life also posted gains ranging from 1 to 3 per cent.\"After a rate cut by the US Federal Reserve, the RBI has taken a prudent approach by focusing on key indicators like domestic inflation and financial stability, particularly in light of the declining individual savings as a percentage of GDP, which poses a financial stability risk. Recent global geopolitical developments have led to a surge in oil prices, which could drive inflation further. This likely influenced the MPC's decision to hold rates steady. Over the last couple of weeks, the 10-year benchmark G-sec yields have risen by around 10 basis points due to these factors. However, if these global challenges prove temporary, we might see a rate cut in the next policy cycle,\" said Suresh Darak, founder of Bondbazaar.Exide Industries led the charge within the auto pack, with over 4 per cent gains. Bosch, Tata Motors, and Motherson Sumi followed closely, adding over 2 per cent each. TVS Motor Company, Balkrishna Industries, Maruti Suzuki, and Apollo Tyres also rose by over 1 per cent in intra-day trading.In the realty sector, Lodha and Prestige Estates emerged as top gainers, rising over 4 per cent each, while Brigade Enterprises, Oberoi Realty, Mahindra Lifespace, and DLF rose by more than 1 per cent.Ramani Sastri, Chairman and Managing Director of Sterling Developers, commented on the RBI’s decision, saying, \"The RBI has once again kept the repo rate unchanged, implying no immediate effect on home loan EMIs. While the real estate sector has witnessed robust growth, a rate cut would have provided an opportunity to boost the market with reduced interest rates, especially ahead of the festive season. Moving forward, we expect lower interest rates to further stimulate demand across industries and fuel economic growth. The real estate sector remains vital to India's economic expansion, and the positive outlook suggests sustained growth in the coming years.\"With the festive season approaching and market sentiment positive, rate-sensitive sectors such as real estate, banking, and auto are expected to maintain their upward trajectory. The possibility of a rate cut in December could further bolster these sectors, adding to the broader market growth.","cleaned_content":"rate sensitive sectors surged on wednesday october \u003cNINE_\u003e following the reserve bank of india rbi s decision to change its policy stance to neutral from withdrawal of accommodation indicating the possibility of a rate cut in december the rbi s monetary policy committee mpc however kept the repo rate unchanged at \u003cSIX_PERCENT\u003e for the tenth consecutive time rbi governor shaktikanta das in his policy statement noted that five out of six mpc members voted to maintain the repo rate at \u003cSIX_PERCENT\u003e while all six agreed on the shift to a neutral stance this change marks the first alteration in the rbis stance in two years alongside the rate decision the central bank maintained its inflation projection for fy25 at \u003cFOUR_PERCENT\u003e and forecasted a real gdp growth rate of \u003cSEVEN_PERCENT\u003e for the fiscal year following the policy announcement indian stock markets extended their upward momentum the sensex gained \u003cSIX_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to reach the days high of \u003cEIGHT_TEN_THOUSAND\u003e meanwhile the nifty \u003cFIVE_TEN\u003e rose \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e broader market indices including midcap and smallcap stocks outperformed the benchmarks rallying \u003cONE_PERCENT\u003e each the rate sensitive sectors reacted strongly to the rbi s policy shift nifty realty surged over \u003cTWO_PERCENT\u003e while nifty psu bank and nifty financial services advanced by around \u003cONE_PERCENT\u003e each nifty bank nifty private bank and nifty auto also gained more than \u003cONE_PERCENT\u003e each within the nifty bank index most stocks traded positively punjab national bank led the gains rising over \u003cTWO_PERCENT\u003e followed by sbi and axis bank which added more than \u003cTWO_PERCENT\u003e each other major gainers included icici bank indusind bank and bank of baroda each posting gains between \u003cZERO_PERCENT\u003e and \u003cTWO_PERCENT\u003e federal bank and idfc first bank were the only two stocks in the red in the financial services space shriram finance led the rally with a \u003cFOUR_PERCENT\u003e increase hdfc amc and chola finance followed closely both rising over \u003cTHREE_PERCENT\u003e muthoot finance bajaj finance bajaj finserv hdfc life pfc rec sbi cards lic housing icici prudential and sbi life also posted gains ranging from \u003cONE_\u003e to \u003cTHREE_PERCENT\u003e after a rate cut by the us federal reserve the rbi has taken a prudent approach by focusing on key indicators like domestic inflation and financial stability particularly in light of the declining individual savings as a percentage of gdp which poses a financial stability risk recent global geopolitical developments have led to a surge in oil prices which could drive inflation further this likely influenced the mpcs decision to hold rates steady over the last couple of weeks the \u003cONE_TEN\u003e year benchmark g sec yields have risen by around \u003cONE_TEN\u003e basis points due to these factors however if these global challenges prove temporary we might see a rate cut in the next policy cycle said suresh darak founder of bondbazaar exide industries led the charge within the auto pack with over \u003cFOUR_PERCENT\u003e gains bosch tata motors and motherson sumi followed closely adding over \u003cTWO_PERCENT\u003e each tvs motor company balkrishna industries maruti suzuki and apollo tyres also rose by over \u003cONE_PERCENT\u003e in intra day trading in the realty sector lodha and prestige estates emerged as top gainers rising over \u003cFOUR_PERCENT\u003e each while brigade enterprises oberoi realty mahindra lifespace and dlf rose by more than \u003cONE_PERCENT\u003e ramani sastri chairman and managing director of sterling developers commented on the rbi s decision saying the rbi has once again kept the repo rate unchanged implying no immediate effect on home loan emis while the real estate sector has witnessed robust growth a rate cut would have provided an opportunity to boost the market with reduced interest rates especially ahead of the festive season moving forward we expect lower interest rates to further stimulate demand across industries and fuel economic growth the real estate sector remains vital to indias economic expansion and the positive outlook suggests sustained growth in the coming years with the festive season approaching and market sentiment positive rate sensitive sectors such as real estate banking and auto are expected to maintain their upward trajectory the possibility of a rate cut in december could further bolster these sectors adding to the broader market growth","timestamp":"2024-10-09T11:33:00+05:30","market_timestamp":"2024-10-09T11:33:00+05:30","off_market_hours":false}