{"url":"https://www.livemint.com/market/stock-market-news/multibagger-penny-stock-ok-play-india-hits-5-upper-circuit-as-promoter-raises-stake-11728372222493.html","title":"Multibagger penny stock hits 5% upper circuit as promoter raises stake","description":"OK Play India shares rose 5% to  ₹13.59 after a promoter raised stake in the company. The board approved the allotment of 1 crore shares to Anandana Handa at  ₹6.021 each. Despite a 20% drop in 2024, the stock is up 450% since October 2019.","content":"Shares of penny stock OK Play India surged by 5 per cent to their upper circuit limit of  ₹13.59 during intra-day trading on Tuesday, October 8, following news of a stake increase by the promoter.In an exchange filing, the company announced that its board has approved the allotment of 1 crore equity shares to promoter Anandana Handa. This decision follows a special resolution passed by the members at the Extra Ordinary General Meeting (EGM) on March 25, 2023, and received approval from BSE Limited on March 31, 2023. The allotment, part of the tenth tranche, will occur on a preferential basis at a price of  ₹6.021 per share, which includes a premium of  ₹5.021 per share, in compliance with SEBI regulations.Anandana Handa has already paid  ₹4.5 crore, accounting for 75 per cent of the total amount due.Furthermore, OK Play India reported that its shares underwent a split effective March 11, 2024, transforming each equity share with a nominal value of  ₹10 into ten equity shares with a nominal value of  ₹1 each. Consequently, both the price and the number of shares and warrants have been adjusted accordingly.The company revealed an impressive net profit growth of 140 per cent year-on-year in Q1 FY 2024-25. For the quarter, OK Play India achieved a net profit of  ₹0.87 crore, significantly up from  ₹0.36 crore in the same quarter the previous year.Despite a nearly 11 per cent rise over the last year, the penny stock has faced challenges in 2024, with the stock down 20 per cent year-to-date (YTD). After experiencing a decline of over 12 per cent in September, it shed an additional 1.5 per cent in October. The stock had previously recorded gains for two consecutive months, up 6.8 per cent in August and 13.4 per cent in July. It remained flat in June and endured losses for three straight months prior, down 1.5 per cent in May, 6 per cent in April, and 27 per cent in March. Conversely, it began the year on a positive note, climbing 12 per cent in February and 1.5 per cent in January.Despite the recent surge, the stock is approximately 37 per cent away from its 52-week high of  ₹21.50, achieved in February 2024. However, it has advanced 36 per cent from its 52-week low of  ₹10 recorded in October last year.In the long term, the stock has experienced multibagger returns, skyrocketing almost 450 per cent from  ₹2.5 in October 2019. In the past three years, it has rallied over 327 per cent from  ₹3.18 in October 2021, reflecting a strong performance in the penny stock segment.","cleaned_content":"shares of penny stock ok play india surged by \u003cFIVE_PERCENT\u003e to their upper circuit limit of \u003cONE_TEN\u003e during intra day trading on tuesday october \u003cEIGHT_\u003e following news of a stake increase by the promoter in an exchange filing the company announced that its board has approved the allotment of \u003cONE_\u003e crore equity shares to promoter anandana handa this decision follows a special resolution passed by the members at the extra ordinary general meeting egm on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and received approval from bse limited on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the allotment part of the tenth tranche will occur on a preferential basis at a price of \u003cSIX_\u003e per share which includes a premium of \u003cFIVE_\u003e per share in compliance with sebi regulations anandana handa has already paid \u003cFOUR_\u003e crore accounting for \u003cSEVEN_TEN_PERCENT\u003e of the total amount due furthermore ok play india reported that its shares underwent a split effective march \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e transforming each equity share with a nominal value of \u003cONE_TEN\u003e into ten equity shares with a nominal value of \u003cONE_\u003e each consequently both the price and the number of shares and warrants have been adjusted accordingly the company revealed an impressive net profit growth of \u003cONE_HUNDRED_PERCENT\u003e year on year in q1 fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e for the quarter ok play india achieved a net profit of \u003cZERO_\u003e crore significantly up from \u003cZERO_\u003e crore in the same quarter the previous year despite a nearly \u003cONE_TEN_PERCENT\u003e rise over the last year the penny stock has faced challenges in \u003cTWO_THOUSAND\u003e with the stock down \u003cTWO_TEN_PERCENT\u003e year to date ytd after experiencing a decline of over \u003cONE_TEN_PERCENT\u003e in september it shed an additional \u003cONE_PERCENT\u003e in october the stock had previously recorded gains for two consecutive months up \u003cSIX_PERCENT\u003e in august and \u003cONE_TEN_PERCENT\u003e in july it remained flat in june and endured losses for three straight months prior down \u003cONE_PERCENT\u003e in may \u003cSIX_PERCENT\u003e in april and \u003cTWO_TEN_PERCENT\u003e in march conversely it began the year on a positive note climbing \u003cONE_TEN_PERCENT\u003e in february and \u003cONE_PERCENT\u003e in january despite the recent surge the stock is approximately \u003cTHREE_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cTWO_TEN\u003e achieved in february \u003cTWO_THOUSAND\u003e however it has advanced \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e recorded in october last year in the long term the stock has experienced multibagger returns skyrocketing almost \u003cFOUR_HUNDRED_PERCENT\u003e from \u003cTWO_\u003e in october \u003cTWO_THOUSAND\u003e in the past three years it has rallied over \u003cTHREE_HUNDRED_PERCENT\u003e from \u003cTHREE_\u003e in october \u003cTWO_THOUSAND\u003e reflecting a strong performance in the penny stock segment","timestamp":"2024-10-08T13:45:00+05:30","market_timestamp":"2024-10-08T13:45:00+05:30","off_market_hours":false}