{"url":"https://www.livemint.com/market/stock-market-news/q2-earnings-preview-trent-bharti-airtel-among-6-nifty-50-companies-likely-to-see-over-35-jump-in-net-profit-11728369099617.html","title":"Q2 Earnings Preview: Trent, Bharti Airtel among 6 Nifty 50 companies likely to see over 35% jump in net profit","description":"While most companies are expected to show moderate earnings growth in the September quarter, Motilal Oswal has identified six Nifty 50 firms that are likely to report an over 35 per cent surge in their net profits. Let's delve into the details.","content":"Domestic brokerage Motilal Oswal Financial Services (MOSL) expects Nifty 50 earnings to see a modest 2 per cent year-on-year (YoY) growth in the September quarter (Q2FY25), the lowest in 17 quarters.Excluding oil marketing companies (OMCs), MOSL forecasts a 7 per cent YoY earnings growth for its universe and a 5 per cent rise for Nifty, still representing the weakest performance in recent quarters.MOSL indicated that the margin tailwinds from previous quarters are expected to fade, with Nifty 50 margins likely to contract by 40 basis points to 20 per cent. The bulk of the earnings growth will be driven by sectors such as banking, financial services, and insurance (BFSI) and an improved contribution from telecom, the brokerage said. Meanwhile, global cyclicals like oil \u0026 gas (O\u0026G), led by OMCs, metals, cement and auto are expected to weigh on earnings growth.While most companies are expected to show moderate earnings growth in the September quarter, the brokerage has identified six firms that are likely to report an over 35 per cent surge in their net profit for Q2FY25.Let's delve into the details.SBI Life Insurance: According to MOSL, SBI Life is likely to post a 35 per cent YoY growth in its net profit at around  ₹510 crore in the September quarter versus  ₹380 crore in the same quarter last year. Its gross premium income is expected to jump 10 per cent to  ₹22,150 crore from  ₹20,180 crore in the year-ago period.MOSL noted that growth in new business premiums is expected to remain stable, supported by consistent cost leadership. The firm also projected a steady growth in the value of new business (VNB), with margins likely to expand quarter-on-quarter (QoQ). However, MOSL highlighted concerns over sluggish growth in the SBI channel, making the outlook in this area critical.Apollo Hospitals: MOSL expects the healthcare company to post a 56 per cent YoY jump in its net profit at  ₹361.6 crore for Q2FY25 as against  ₹231.7 crore in the same quarter last year. Meanwhile, its gross sales are also likely to increase 11.3 per cent YoY to  ₹5,395 crore in the quarter under review from  ₹4,847 crore in the year-ago period. EBITDA is expected to rise 20.8 per cent to  ₹758 crore while margins could expand to 14.15 per cent from 12.9 per cent in the same period last year.This will be driven by higher volumes, growth in the specialty segment at Apollo Health and Lifestyle Limited (AHLL), and reduced operating expenses in Apollo 24/7. Enhanced footfalls in primary care, lower customer acquisition costs, and a focus on omnichannel strategies are among other factors behind the performance.Hindalco: According to the brokerage, the net profit of the metal firm is likely to jump 45.5 per cent YoY to  ₹3,100 crore for Q2FY25 versus  ₹2,200 crore in the same quarter last year. Meanwhile, MOFSL forecasts its net sales to rise 5.1 per cent to  ₹56,900 crore in the quarter under review as against  ₹54,200 crore in the year-ago period. EBITDA is also projected to advance 16.7 per cent to  ₹6,600 crore from  ₹5,600 crore in Q2FY24.MOSL indicated that volumes are expected to remain stable, but Novelis' performance is likely to be weak due to a one-off event. Investors should watch out for the timeline for commissioning various capital expenditure projects and Novelis' EBITDA per ton guidance.Trent: MOSL estimates the net profit of the retail company to increase 37.3 per cent YoY to  ₹398 crore in Q2FY25 versus  ₹290 crore in the same quarter last year. Meanwhile, its revenue is expected to rise 48 per cent YoY to  ₹4,278 crore in the quarter under review from  ₹2,891 crore in the year-ago period. EBITDA is also likely to increase to  ₹694 crore from  ₹461 crore in Q2FY24 while the margin is projected to jump to 16.2 per cent from 15.9 per cent last year.MOSL projected strong revenue growth, driven by robust same-store sales growth (SSSG) and significant store additions. The EBITDA margin could benefit from operating leverage. MOSL also anticipates Westside and Zudio to have added two and 25 stores, respectively, in the second quarter of FY25.Bharti Airtel: According to the brokerage, the net profit of the telecom company is likely to have soared 50.7 per cent YoY to  ₹4,500 crore in Q2FY25 versus  ₹3,000 crore in the same quarter last year. Meanwhile, MOFSL forecasts its net sales to rise 10.8 per cent to  ₹41,000 crore in the quarter under review as against  ₹37,000 crore in the year-ago period. MOSL anticipates around 7 per cent quarter-on-quarter consolidated revenue growth, primarily driven by strong performance in India's wireless segment.It further sees a 10 per cent and 13 per cent sequential growth in India wireless revenue and EBITDA, respectively, led by the tariff hike. The consolidated EBITDA margin is projected to expand by approximately 155 basis points to 52.7 per cent, also driven by the tariff hike. Additionally, Airtel could report a 10 per cent quarter-on-quarter growth in wireless average revenue per user (ARPU) to rise to  ₹231 alongside a decline in wireless subscribers by 15 lakhs.NTPC: According to MOSL, NTPC is likely to post a 41.5 per cent YoY growth in its net profit at around  ₹4,613 crore in the September quarter versus  ₹3,261 crore in the same quarter last year. However, its net sales are expected to rise just 2 per cent YoY to  ₹41,693 crore from  ₹40,875 crore in the year-ago period. EBITDA margin is projected to rise to 28.7 per cent from 25.8 per cent YoY.MOSL stated that NTPC's standalone financial outlook indicated a stable projected revenue. The adjusted profit after tax (PAT) is expected to surge by 41 per cent YoY, recovering from one-off adjustments of  ₹600 crore related to previous-year sales that impacted the second quarter of FY24. Furthermore, the EBITDA is expected to improve by 13 per cent YoY to  ₹11,900 crore.","cleaned_content":"domestic brokerage motilal oswal financial services mosl expects nifty \u003cFIVE_TEN\u003e earnings to see a modest \u003cTWO_PERCENT\u003e year on year yoy growth in the september quarter q2fy25 the lowest in \u003cONE_TEN\u003e quarters excluding oil marketing companies omcs mosl forecasts a \u003cSEVEN_PERCENT\u003e yoy earnings growth for its universe and a \u003cFIVE_PERCENT\u003e rise for nifty still representing the weakest performance in recent quarters mosl indicated that the margin tailwinds from previous quarters are expected to fade with nifty \u003cFIVE_TEN\u003e margins likely to contract by \u003cFOUR_TEN\u003e basis points to \u003cTWO_TEN_PERCENT\u003e the bulk of the earnings growth will be driven by sectors such as banking financial services and insurance bfsi and an improved contribution from telecom the brokerage said meanwhile global cyclicals like oil gas o g led by omcs metals cement and auto are expected to weigh on earnings growth while most companies are expected to show moderate earnings growth in the september quarter the brokerage has identified six firms that are likely to report an over \u003cTHREE_TEN_PERCENT\u003e surge in their net profit for q2fy25 lets delve into the details sbi life insurance according to mosl sbi life is likely to post a \u003cTHREE_TEN_PERCENT\u003e yoy growth in its net profit at around \u003cFIVE_HUNDRED\u003e crore in the september quarter versus \u003cTHREE_HUNDRED\u003e crore in the same quarter last year its gross premium income is expected to jump \u003cONE_TEN_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e crore from \u003cTWO_TEN_THOUSAND\u003e crore in the year ago period mosl noted that growth in new business premiums is expected to remain stable supported by consistent cost leadership the firm also projected a steady growth in the value of new business vnb with margins likely to expand quarter on quarter qoq however mosl highlighted concerns over sluggish growth in the sbi channel making the outlook in this area critical apollo hospitals mosl expects the healthcare company to post a \u003cFIVE_TEN_PERCENT\u003e yoy jump in its net profit at \u003cTHREE_HUNDRED\u003e crore for q2fy25 as against \u003cTWO_HUNDRED\u003e crore in the same quarter last year meanwhile its gross sales are also likely to increase \u003cONE_TEN_PERCENT\u003e yoy to \u003cFIVE_THOUSAND\u003e crore in the quarter under review from \u003cFOUR_THOUSAND\u003e crore in the year ago period ebitda is expected to rise \u003cTWO_TEN_PERCENT\u003e to \u003cSEVEN_HUNDRED\u003e crore while margins could expand to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in the same period last year this will be driven by higher volumes growth in the specialty segment at apollo health and lifestyle limited ahll and reduced operating expenses in apollo \u003cTWO_TEN\u003e \u003cSEVEN_\u003e enhanced footfalls in primary care lower customer acquisition costs and a focus on omnichannel strategies are among other factors behind the performance hindalco according to the brokerage the net profit of the metal firm is likely to jump \u003cFOUR_TEN_PERCENT\u003e yoy to \u003cTHREE_THOUSAND\u003e crore for q2fy25 versus \u003cTWO_THOUSAND\u003e crore in the same quarter last year meanwhile mofsl forecasts its net sales to rise \u003cFIVE_PERCENT\u003e to \u003cFIVE_TEN_THOUSAND\u003e crore in the quarter under review as against \u003cFIVE_TEN_THOUSAND\u003e crore in the year ago period ebitda is also projected to advance \u003cONE_TEN_PERCENT\u003e to \u003cSIX_THOUSAND\u003e crore from \u003cFIVE_THOUSAND\u003e crore in q2fy24 mosl indicated that volumes are expected to remain stable but novelis performance is likely to be weak due to a one off event investors should watch out for the timeline for commissioning various capital expenditure projects and novelis ebitda per ton guidance trent mosl estimates the net profit of the retail company to increase \u003cTHREE_TEN_PERCENT\u003e yoy to \u003cTHREE_HUNDRED\u003e crore in q2fy25 versus \u003cTWO_HUNDRED\u003e crore in the same quarter last year meanwhile its revenue is expected to rise \u003cFOUR_TEN_PERCENT\u003e yoy to \u003cFOUR_THOUSAND\u003e crore in the quarter under review from \u003cTWO_THOUSAND\u003e crore in the year ago period ebitda is also likely to increase to \u003cSIX_HUNDRED\u003e crore from \u003cFOUR_HUNDRED\u003e crore in q2fy24 while the margin is projected to jump to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e last year mosl projected strong revenue growth driven by robust same store sales growth sssg and significant store additions the ebitda margin could benefit from operating leverage mosl also anticipates westside and zudio to have added two and \u003cTWO_TEN\u003e stores respectively in the second quarter of fy25 bharti airtel according to the brokerage the net profit of the telecom company is likely to have soared \u003cFIVE_TEN_PERCENT\u003e yoy to \u003cFOUR_THOUSAND\u003e crore in q2fy25 versus \u003cTHREE_THOUSAND\u003e crore in the same quarter last year meanwhile mofsl forecasts its net sales to rise \u003cONE_TEN_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e crore in the quarter under review as against \u003cTHREE_TEN_THOUSAND\u003e crore in the year ago period mosl anticipates around \u003cSEVEN_PERCENT\u003e quarter on quarter consolidated revenue growth primarily driven by strong performance in indias wireless segment it further sees a \u003cONE_TEN_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e sequential growth in india wireless revenue and ebitda respectively led by the tariff hike the consolidated ebitda margin is projected to expand by approximately \u003cONE_HUNDRED\u003e basis points to \u003cFIVE_TEN_PERCENT\u003e also driven by the tariff hike additionally airtel could report a \u003cONE_TEN_PERCENT\u003e quarter on quarter growth in wireless average revenue per user arpu to rise to \u003cTWO_HUNDRED\u003e alongside a decline in wireless subscribers by \u003cONE_TEN\u003e lakhs ntpc according to mosl ntpc is likely to post a \u003cFOUR_TEN_PERCENT\u003e yoy growth in its net profit at around \u003cFOUR_THOUSAND\u003e crore in the september quarter versus \u003cTHREE_THOUSAND\u003e crore in the same quarter last year however its net sales are expected to rise just \u003cTWO_PERCENT\u003e yoy to \u003cFOUR_TEN_THOUSAND\u003e crore from \u003cFOUR_TEN_THOUSAND\u003e crore in the year ago period ebitda margin is projected to rise to \u003cTWO_TEN_PERCENT\u003e from \u003cTWO_TEN_PERCENT\u003e yoy mosl stated that ntpcs standalone financial outlook indicated a stable projected revenue the adjusted profit after tax pat is expected to surge by \u003cFOUR_TEN_PERCENT\u003e yoy recovering from one off adjustments of \u003cSIX_HUNDRED\u003e crore related to previous year sales that impacted the second quarter of fy24 furthermore the ebitda is expected to improve by \u003cONE_TEN_PERCENT\u003e yoy to \u003cONE_TEN_THOUSAND\u003e crore","timestamp":"2024-10-08T13:24:00+05:30","market_timestamp":"2024-10-08T13:24:00+05:30","off_market_hours":false}