{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-rs-5-hits-upper-circuit-evexia-lifecare-share-price-jumps-120-ytd-11728461797315.html","title":"Penny stock below  ₹5 hits the upper circuit. Evexia Lifecare share price jumps 120% YTD","description":"Stock Market Today: Penny stock below  ₹5, Evexia Lifecare share price hit an upper circuit with 5% intraday gains. The stock is up 120% year to date","content":"Stock Market Today: Penny stock below  ₹5, Evexia Lifecare share price hit an upper circuit with 5% intraday gains on Wednesday. The stock is up 120% year to dateEvexia Lifecare share price opened at  ₹4.09 on the BSE on Wednesday, more than 2% higher than the previous close of  ₹4. Evexia Lifecare share price thereafter gained further to hit intraday highs of  ₹4.20 marking gains of 5% and thereby was also locked in the upper circuit. Notably Evexia Lifecare share price with gains of more than 120% year to date also hit 1 year high (52 week high). The Evexia Lifecare share price thereby has also given Multibagger returns to the investors.The focus on the Evexia Lifecare share price remains also led by an acquisition it completed recently. As per exchange filings by Evexia Lifecare , it has executed Term sheet with Vittal's MediCare Private Limited on 06.10.2024 to acquire 51 % stake in Vittal's MediCare Private Limited. The total consideration for the deal being Rs. 35 crores (Rupees Thirty-five Crores only) sas per Evexia Lifecare filing. Vittal's MediCare Private Limited will become a Subsidiary Company of Evexia Lifecare Limited after completion of entire transaction as described in the Term Sheet .Vittal's MediCare Private Limited, the entity being acquired by Evexia Lifecare is engaged in the business of Diagnostic Centers. Evexia Lifecare Limited is also engaged in manufacturing and trading in pharmaceuticals, chemicals and lifecare products hence its acquisition of Vittal's MediCare in diagnostic Centers business also signifies a strategic alignment aimed at capitalizing on synergistic opportunities for business advancement as per the Evexia's release. The Indicative time period for completion of the acquisition as per Evexia's press release remains 45 days from days from the date of Execution of the Share Purchase Agreement and any other such agreements","cleaned_content":"stock market today penny stock below \u003cFIVE_\u003e evexia lifecare share price hit an upper circuit with \u003cFIVE_PERCENT\u003e intraday gains on wednesday the stock is up \u003cONE_HUNDRED_PERCENT\u003e year to dateevexia lifecare share price opened at \u003cFOUR_\u003e on the bse on wednesday more than \u003cTWO_PERCENT\u003e higher than the previous close of \u003cFOUR_\u003e evexia lifecare share price thereafter gained further to hit intraday highs of \u003cFOUR_\u003e marking gains of \u003cFIVE_PERCENT\u003e and thereby was also locked in the upper circuit notably evexia lifecare share price with gains of more than \u003cONE_HUNDRED_PERCENT\u003e year to date also hit \u003cONE_\u003e year high \u003cFIVE_TEN\u003e week high the evexia lifecare share price thereby has also given multibagger returns to the investors the focus on the evexia lifecare share price remains also led by an acquisition it completed recently as per exchange filings by evexia lifecare it has executed term sheet with vittals medicare private limited on \u003cSIX_\u003e 2024 to acquire \u003cFIVE_TEN_PERCENT\u003e stake in vittals medicare private limited the total consideration for the deal being rs \u003cTHREE_TEN\u003e crores rupees thirty five crores only sas per evexia lifecare filing vittals medicare private limited will become a subsidiary company of evexia lifecare limited after completion of entire transaction as described in the term sheet vittals medicare private limited the entity being acquired by evexia lifecare is engaged in the business of diagnostic centers evexia lifecare limited is also engaged in manufacturing and trading in pharmaceuticals chemicals and lifecare products hence its acquisition of vittals medicare in diagnostic centers business also signifies a strategic alignment aimed at capitalizing on synergistic opportunities for business advancement as per the evexias release the indicative time period for completion of the acquisition as per evexias press release remains \u003cFOUR_TEN\u003e days from days from the date of execution of the share purchase agreement and any other such agreements","timestamp":"2024-10-09T14:39:00+05:30","market_timestamp":"2024-10-09T14:39:00+05:30","off_market_hours":false}