{"url":"https://www.livemint.com/market/stock-market-news/heidelbergcement-share-price-jumps-18-on-report-adani-group-firm-ambuja-cements-eyeing-rs-10-000-crore-buyout-11728279975185.html","title":"HeidelbergCement share price jumps 18% on report Adani Group firm Ambuja Cements eyeing  ₹10,000-crore buyout","description":"Adani Group company Ambuja Cements will lead the proposed buyout of Heidelberg’s India unit and the acquisition could be worth around $1.2 billion or  ₹10,000 crore, a report said.","content":"HeidelbergCement India share price jumped 18% on Monday after a report that Adani Group is in discussions to acquire the company and Zuari Cement from its German parent firm. HeidelbergCement shares spiked as much as 17.95% to  ₹257.85 apiece on the BSE.The volumes traded of Heidelberg Cement India shares also jumped significantly on October 7. Around 1 crore HeidelbergCement shares changed hands on BSE and NSE combined as against its one week average volume of 2 lakh shares.The billionaire Gautam Adani-led Adani Group has begun discussions for the acquisition of the Indian cement operations of Germany’s Heidelberg Materials, The Economic Times reported, quoting people familiar with the matter.Adani Group company Ambuja Cements will lead the proposed buyout of Heidelberg’s India unit and the acquisition could be worth around $1.2 billion or  ₹10,000 crore, the report said.Meanwhile, Ambuja Cements shares were trading over 3% lower. The Adani Group stock was up more than 1% in early morning deals on BSE.The potential acquisition would add HeidelbergCement India’s 14 million tonnes and Zuari Cement’s 7 million tonnes of production capacity to Ambuja Cements. This move is set to substantially increase Ambuja's output, enhancing its current capacity of 89 million tonnes, as the Adani Group aims for a target of 140 million tonnes by 2028.HeidelbergCement India stock price has failed to give any substantial returns this year. The stock is up more than 3% in one month and just over 2.5% year-to-date (YTD). HeidelbergCement shares have gained over 23% in one year.Meanwhile, Adani Group stock, Ambuja Cements shares have declined over 13% in three months and gained more than 14% YTD. In the past one year, Ambuja Cements stock price has given over 36% returns.At 11:25 am, HeidelbergCement India shares were trading 9.06% higher at  ₹238.40 apiece with a market capitalisation of more than  ₹5,402 crore on the BSE. Ambuja Cements stock price was down 1.44% at  ₹601.15 apiece.","cleaned_content":"heidelbergcement india share price jumped \u003cONE_TEN_PERCENT\u003e on monday after a report that adani group is in discussions to acquire the company and zuari cement from its german parent firm heidelbergcement shares spiked as much as \u003cONE_TEN_PERCENT\u003e to \u003cTWO_HUNDRED\u003e apiece on the bse the volumes traded of heidelberg cement india shares also jumped significantly on october \u003cSEVEN_\u003e around \u003cONE_\u003e crore heidelbergcement shares changed hands on bse and nse combined as against its one week average volume of \u003cTWO_\u003e lakh shares the billionaire gautam adani led adani group has begun discussions for the acquisition of the indian cement operations of germany s heidelberg materials the economic times reported quoting people familiar with the matter adani group company ambuja cements will lead the proposed buyout of heidelberg s india unit and the acquisition could be worth around \u003cONE_\u003e billion or \u003cONE_TEN_THOUSAND\u003e crore the report said meanwhile ambuja cements shares were trading over \u003cTHREE_PERCENT\u003e lower the adani group stock was up more than \u003cONE_PERCENT\u003e in early morning deals on bse the potential acquisition would add heidelbergcement india s \u003cONE_TEN\u003e million tonnes and zuari cement s \u003cSEVEN_\u003e million tonnes of production capacity to ambuja cements this move is set to substantially increase ambujas output enhancing its current capacity of \u003cEIGHT_TEN\u003e million tonnes as the adani group aims for a target of \u003cONE_HUNDRED\u003e million tonnes by \u003cTWO_THOUSAND\u003e heidelbergcement india stock price has failed to give any substantial returns this year the stock is up more than \u003cTHREE_PERCENT\u003e in one month and just over \u003cTWO_PERCENT\u003e year to date ytd heidelbergcement shares have gained over \u003cTWO_TEN_PERCENT\u003e in one year meanwhile adani group stock ambuja cements shares have declined over \u003cONE_TEN_PERCENT\u003e in three months and gained more than \u003cONE_TEN_PERCENT\u003e ytd in the past one year ambuja cements stock price has given over \u003cTHREE_TEN_PERCENT\u003e returns at \u003cONE_TEN\u003e \u003cTWO_TEN\u003e am heidelbergcement india shares were trading \u003cNINE_PERCENT\u003e higher at \u003cTWO_HUNDRED\u003e apiece with a market capitalisation of more than \u003cFIVE_THOUSAND\u003e crore on the bse ambuja cements stock price was down \u003cONE_PERCENT\u003e at \u003cSIX_HUNDRED\u003e apiece","timestamp":"2024-10-07T11:26:00+05:30","market_timestamp":"2024-10-07T11:26:00+05:30","off_market_hours":false}