{"url":"https://www.livemint.com/market/stock-market-news/power-stocks-to-buy-tata-power-jsw-energy-gets-buy-tag-from-nomura-up-to-22-upside-seen-11728466411878.html","title":"Power stocks to buy: Tata Power, JSW Energy get ‘buy’ tag from Nomura, up to 22% upside likely","description":"Power stocks to buy: Nomura has initiated coverage on Tata Power and JSW Energy, assigning them 'buy' ratings with target prices of  ₹560 and  ₹885. The firm anticipates robust growth in India's power sector, driven by renewable energy and increasing demand.","content":"Nomura initiated coverage on Tata Power and JSW Energy with a 'buy' rating and target prices of  ₹560 and  ₹885, respectively. The brokerage believes India's power sector offers substantial growth opportunities and sees green energy as the new gold amid a major shift from conventional to sustainable energy sources.Tata Power and JSW Energy are expected to achieve a 16% and 38% compound annual growth rate (CAGR) in earnings before interest, taxes, depreciation, and amortization (EBITDA), respectively from FY24 to FY27 due to increasing capacities, according to the brokerage.It expects India's energy demand growth to be more robust in the next five years compared to the past, presenting a significant opportunity for value creation. Describing the sector as having a long runway for growth would be an understatement, Nomura said.Significant opportunities are seen by the brokerage across the complete energy value chain, including solar module manufacturing, renewable energy (RE) generation, and transmission and distribution.The global brokerage indicated a significant uptick in the expansion of renewables, resulting in an expanding proportion of renewables in India's energy combination. It is anticipated that solar and wind power will meet around 75% of the additional demand by FY25F. In FY24, renewables accounted for 33.5% of India's electricity provision and is predicted to rise to 35% in FY25F, fuelled by a 23% annual increase in solar power. The brokerage expects the increasing trajectory of renewables to persist and gather momentum.“We expect three new themes to contribute to incremental demand: (1) strong capacity additions for data centres, (2) rising penetration from electric vehicles (EV), and (3) green hydrogen. We envisage green hydrogen will likely be the largest of these themes and can drive demand of 150-300TWh,” the brokerage said.As the biggest integrated power firm in India, Tata Power is well-positioned to profit from the nation's energy revolution, according to Nomura. With a strong 5.5GW pipeline and plans for further integration, the business would have a 4.5GW RE portfolio, which is expected to quadruple. It also has a sizable order book of  ₹157 billion for EPCs, given its recent venture into the production of solar PV cells and modules. The business has also made great progress in building an EV charging network with more than 5,500 contact points, and it is experimenting with pumped storage with an initial capacity of 2.8GW.“With a goal to source 70% of its generation through renewables by FY30 and phase out thermal generation by 2045, Tata Power is well-placed to capitalise on favourable government policies promoting RE,” said Nomura.On Wednesday's session, Tata Power share price ended about 1% higher at  ₹460.90 apiece on BSE.Brokerage claims that JSW Energy, one of India's top independent power producers (IPPs), plans to use RE to generate 20GW of capacity by FY30. As of right now, the firm has 7.54GW of installed capacity, 8.3GW of renewable energy in the pipeline, and 2.3GW of capacity under construction.The business has LT Power Purchase Agreements (PPAs) attached to around 92% of its installed capacity, which allows for excellent profit visibility. Through FY24-FY27F, favourable RE bid victories and robust merchant market tariffs will significantly improve operational and cash flow visibility. Additionally, the firm has ventured into energy storage solutions, where Nomura's estimate predicts JSW Energy will earn almost 95% of the business's EBITDA margin.On Wednesday's session, JSW Energy share price ended about 1% higher at  ₹729.95 apiece on BSE.","cleaned_content":"nomura initiated coverage on tata power and jsw energy with a buy rating and target prices of \u003cFIVE_HUNDRED\u003e and \u003cEIGHT_HUNDRED\u003e respectively the brokerage believes indias power sector offers substantial growth opportunities and sees green energy as the new gold amid a major shift from conventional to sustainable energy sources tata power and jsw energy are expected to achieve a \u003cONE_TEN_PERCENT\u003e and \u003cTHREE_TEN_PERCENT\u003e compound annual growth rate cagr in earnings before interest taxes depreciation and amortization ebitda respectively from fy24 to fy27 due to increasing capacities according to the brokerage it expects indias energy demand growth to be more robust in the next five years compared to the past presenting a significant opportunity for value creation describing the sector as having a long runway for growth would be an understatement nomura said significant opportunities are seen by the brokerage across the complete energy value chain including solar module manufacturing renewable energy re generation and transmission and distribution the global brokerage indicated a significant uptick in the expansion of renewables resulting in an expanding proportion of renewables in indias energy combination it is anticipated that solar and wind power will meet around \u003cSEVEN_TEN_PERCENT\u003e of the additional demand by fy25f in fy24 renewables accounted for \u003cTHREE_TEN_PERCENT\u003e of indias electricity provision and is predicted to rise to \u003cTHREE_TEN_PERCENT\u003e in fy25f fuelled by a \u003cTWO_TEN_PERCENT\u003e annual increase in solar power the brokerage expects the increasing trajectory of renewables to persist and gather momentum we expect three new themes to contribute to incremental demand \u003cONE_\u003e strong capacity additions for data centres \u003cTWO_\u003e rising penetration from electric vehicles ev and \u003cTHREE_\u003e green hydrogen we envisage green hydrogen will likely be the largest of these themes and can drive demand of \u003cONE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e twh the brokerage said as the biggest integrated power firm in india tata power is well positioned to profit from the nations energy revolution according to nomura with a strong \u003cFIVE_\u003e gw pipeline and plans for further integration the business would have a \u003cFOUR_\u003e gw re portfolio which is expected to quadruple it also has a sizable order book of \u003cONE_HUNDRED\u003e billion for epcs given its recent venture into the production of solar pv cells and modules the business has also made great progress in building an ev charging network with more than \u003cFIVE_THOUSAND\u003e contact points and it is experimenting with pumped storage with an initial capacity of \u003cTWO_\u003e gw with a goal to source \u003cSEVEN_TEN_PERCENT\u003e of its generation through renewables by fy30 and phase out thermal generation by \u003cTWO_THOUSAND\u003e tata power is well placed to capitalise on favourable government policies promoting re said nomura on wednesdays session tata power share price ended about \u003cONE_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece on bse brokerage claims that jsw energy one of indias top independent power producers ipps plans to use re to generate \u003cTWO_TEN\u003e gw of capacity by fy30 as of right now the firm has \u003cSEVEN_\u003e gw of installed capacity \u003cEIGHT_\u003e gw of renewable energy in the pipeline and \u003cTWO_\u003e gw of capacity under construction the business has lt power purchase agreements ppas attached to around \u003cNINE_TEN_PERCENT\u003e of its installed capacity which allows for excellent profit visibility through fy24 fy27f favourable re bid victories and robust merchant market tariffs will significantly improve operational and cash flow visibility additionally the firm has ventured into energy storage solutions where nomuras estimate predicts jsw energy will earn almost \u003cNINE_TEN_PERCENT\u003e of the businesss ebitda margin on wednesdays session jsw energy share price ended about \u003cONE_PERCENT\u003e higher at \u003cSEVEN_HUNDRED\u003e apiece on bse","timestamp":"2024-10-09T16:56:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}