{"url":"https://www.livemint.com/market/stock-market-news/fo-strategy-buy-godrej-consumer-icici-bk-suggests-rupak-de-as-indian-stock-market-rebounds-after-tumbling-last-week-11728276599082.html","title":"F\u0026O Strategy: Buy Godrej Consumer, ICICI Bk, suggests Rupak De as Indian stock market rebounds after tumbling last week","description":"F\u0026O Strategy: Technical views on F\u0026O market by Rupak De, Senior Technical Analyst, LKP Securities. De suggests buying Godrej Consumer Products Ltd, and ICICI Bank Ltd.","content":"Stock market today: Monday saw the domestic benchmark indices, the Sensex and Nifty 50, beginning the day positively, mirroring the upward trends observed in global markets. In the preceding week, Indian markets recorded a decline of more than 4%. Strong US jobs data alleviated worries about a recession in the world's largest economy, leading to information technology stocks driving gains in domestic shares on Monday.The Nifty 50 saw an opening at 25,084.10 points, marking a surge of 69.50 points or 0.28%. Similarly, the Sensex had an opening at 81,852.01, experiencing a gain of 163.56 points or 0.20%.While market analysts predicted that Indian stock markets would continue to perform well this week, they also pointed out that the geopolitical environment and the upcoming earnings season might have a impact.According to technical analysts in the derivatives segment, Foreign Institutional Investors (FII) have unwound their long positions in the index futures segment and have also formed new shorts. Their long-short ratio has reduced from 81% at the start of the series to 58% now. Until we see change in the FII's stance, our markets could continue to see selling pressure on pullback moves. The support for Nifty 50 is placed around 24,800.For Bank Nifty the last expiry date was Tuesday, October 1. Bank Nifty faced selling pressure near the 52,200 level, closing below its 50-day EMA and forming a bearish candlestick on the daily chart. This indicates a strong bearish sentiment and the dominance of bears in the market. The current outlook suggests a \"sell on rise\" strategy. Bank Nifty has key support at its rising trendline around 51,000, while resistance is expected at 51,900. The index’s failure to hold above these levels reinforces the cautious approach in the market.Open Interest Analysis: PUT writing was not significant on the 2nd day of the new expiry; while significant CALL writing was visible at 52,000 indicating strong resistance for the short term at 52,500. Maximum CALL open interest is seen at 52,500 and maximum PUT open interest was seen at the 50,500 strike, indicating a big range for the near term. Both PUT and CALL writers remained equally active in the weekly expiry.For Nifty 50 the last expiry date was Thursday, October 3. The Nifty 50 faced a second straight day of bearish pressure, with continued trading below crucial levels leading to a correction towards 25,000. Market sentiment has significantly weakened, with higher levels now acting as selling opportunities. On the downside, support is expected around 24,750, while resistance is noted at 25,300 on the upside.Open Interest Analysis: PUT writing was not significant on the first day of the new expiry; while significant CALL writing was visible at 25,400 indicating strong resistance for the short term at 25,400. Maximum PUT open interest was seen at the 24,500 strike, whereas maximum CALL open interest was seen at 25,500, indicating a broader range for the market. Both PUT and CALL writers remained equally active in the weekly expiry.The stock has been trading near a rising trendline, which may provide strong short-term support. Additionally, the stock has been forming a pattern of higher highs and higher lows. A recovery from the current level is possible unless the stock falls below 1,300. On the higher end, it could potentially rise towards 1,430.The stock has risen after forming an inverted hammer pattern on the daily chart. The trend is likely to stay strong as long as it remains above the 50-day moving average (50DMA). On the upside, it could move towards 1,310, with support located at 1,229.","cleaned_content":"stock market today monday saw the domestic benchmark indices the sensex and nifty \u003cFIVE_TEN\u003e beginning the day positively mirroring the upward trends observed in global markets in the preceding week indian markets recorded a decline of more than \u003cFOUR_PERCENT\u003e strong us jobs data alleviated worries about a recession in the worlds largest economy leading to information technology stocks driving gains in domestic shares on monday the nifty \u003cFIVE_TEN\u003e saw an opening at \u003cTWO_TEN_THOUSAND\u003e points marking a surge of \u003cSIX_TEN\u003e points or \u003cZERO_PERCENT\u003e similarly the sensex had an opening at \u003cEIGHT_TEN_THOUSAND\u003e experiencing a gain of \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e while market analysts predicted that indian stock markets would continue to perform well this week they also pointed out that the geopolitical environment and the upcoming earnings season might have a impact according to technical analysts in the derivatives segment foreign institutional investors fii have unwound their long positions in the index futures segment and have also formed new shorts their long short ratio has reduced from \u003cEIGHT_TEN_PERCENT\u003e at the start of the series to \u003cFIVE_TEN_PERCENT\u003e now until we see change in the fiis stance our markets could continue to see selling pressure on pullback moves the support for nifty \u003cFIVE_TEN\u003e is placed around \u003cTWO_TEN_THOUSAND\u003e for bank nifty the last expiry date was tuesday october \u003cONE_\u003e bank nifty faced selling pressure near the \u003cFIVE_TEN_THOUSAND\u003e level closing below its \u003cFIVE_TEN\u003e day ema and forming a bearish candlestick on the daily chart this indicates a strong bearish sentiment and the dominance of bears in the market the current outlook suggests a sell on rise strategy bank nifty has key support at its rising trendline around \u003cFIVE_TEN_THOUSAND\u003e while resistance is expected at \u003cFIVE_TEN_THOUSAND\u003e the index s failure to hold above these levels reinforces the cautious approach in the market open interest analysis put writing was not significant on the \u003cTWO_\u003e nd day of the new expiry while significant call writing was visible at \u003cFIVE_TEN_THOUSAND\u003e indicating strong resistance for the short term at \u003cFIVE_TEN_THOUSAND\u003e maximum call open interest is seen at \u003cFIVE_TEN_THOUSAND\u003e and maximum put open interest was seen at the \u003cFIVE_TEN_THOUSAND\u003e strike indicating a big range for the near term both put and call writers remained equally active in the weekly expiry for nifty \u003cFIVE_TEN\u003e the last expiry date was thursday october \u003cTHREE_\u003e the nifty \u003cFIVE_TEN\u003e faced a second straight day of bearish pressure with continued trading below crucial levels leading to a correction towards \u003cTWO_TEN_THOUSAND\u003e market sentiment has significantly weakened with higher levels now acting as selling opportunities on the downside support is expected around \u003cTWO_TEN_THOUSAND\u003e while resistance is noted at \u003cTWO_TEN_THOUSAND\u003e on the upside open interest analysis put writing was not significant on the first day of the new expiry while significant call writing was visible at \u003cTWO_TEN_THOUSAND\u003e indicating strong resistance for the short term at \u003cTWO_TEN_THOUSAND\u003e maximum put open interest was seen at the \u003cTWO_TEN_THOUSAND\u003e strike whereas maximum call open interest was seen at \u003cTWO_TEN_THOUSAND\u003e indicating a broader range for the market both put and call writers remained equally active in the weekly expiry the stock has been trading near a rising trendline which may provide strong short term support additionally the stock has been forming a pattern of higher highs and higher lows a recovery from the current level is possible unless the stock falls below \u003cONE_THOUSAND\u003e on the higher end it could potentially rise towards \u003cONE_THOUSAND\u003e the stock has risen after forming an inverted hammer pattern on the daily chart the trend is likely to stay strong as long as it remains above the \u003cFIVE_TEN\u003e day moving average \u003cFIVE_TEN\u003e dma on the upside it could move towards \u003cONE_THOUSAND\u003e with support located at \u003cONE_THOUSAND\u003e","timestamp":"2024-10-07T10:57:00+05:30","market_timestamp":"2024-10-07T10:57:00+05:30","off_market_hours":false}