{"url":"https://www.livemint.com/market/stock-market-news/zomato-announces-esops-worth-rs-330-crore-for-11-997-768-shares-11728180229353.html","title":"Zomato announces ESOPs worth  ₹330 crore, for 11,997,768 shares","description":"Food delivery giant Zomato has significantly boosted its employee stock ownership plans (ESOPs), granting a total of 11,997,768 shares to its workforce. The move comes as Zomato's competitor, Swiggy, prepares for a major IPO.","content":"Food delivery giant Zomato revealed that it has granted a total of 11,997,768 shares under its employee stock ownership plans (ESOPs). The announcement was made on Wednesday, October 2, 2024. With Zomato’s shares closing at  ₹275.20 on the Bombay Stock Exchange (BSE) during the last trading session of the week, the total value of these ESOPs stands at  ₹330.17 crore.Out of the total shares, 11,997,652 options are part of the \"ESOP 2021\" scheme, while 116 options are included in the \"ESOP 2014\" scheme, branded as the “Foodie Bay Employee Stock Option Plan.”ESOPs are a form of compensation where employees are granted company stock options. These options act as both a reward and an incentive for employees, with the company’s performance and market value reflecting the efforts of its workforce. In this case, the \"option\" refers to the instrument that can be converted into an equity share when the holder decides to exercise it.Each of the ESOPs has a face value of  ₹1 and can be exercised within 10 years from the date of vesting or 12 years from the date of listing, whichever is later. According to the filing, these options will not be subject to a lock-in period.Earlier in the year, Zomato had approved the granting of 40,739,330 stock options in July, followed by an additional 19,82,980 stock options covering 35,17,051 equity shares in August, as stated in previous filings.This new round of stock options comes at a time when Zomato's key competitor, Bengaluru-based Swiggy, is preparing for an initial public offering (IPO). Initially set to raise  ₹3,750 crore, Swiggy's shareholders have approved an increase, with the IPO now expected to raise  ₹5,000 crore. Together, Zomato and Swiggy dominate the online food delivery market in India.On Friday, October 4, 2024, Zomato share price closed at  ₹275.20 on the BSE, marking a 2.38% increase, or a gain of 6.40 points, for the week. However, the exchange filing related to the ESOP grant was made earlier in the week, on October 2, when the stock markets were closed for Gandhi Jayanti.By Thursday, October 3, Zomato’s shares had dropped slightly, closing at  ₹269, a decrease of 1.88% or 5.15 points.","cleaned_content":"food delivery giant zomato revealed that it has granted a total of \u003cONE_TEN_MILLION\u003e shares under its employee stock ownership plans esops the announcement was made on wednesday october \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e with zomato s shares closing at \u003cTWO_HUNDRED\u003e on the bombay stock exchange bse during the last trading session of the week the total value of these esops stands at \u003cTHREE_HUNDRED\u003e crore out of the total shares \u003cONE_TEN_MILLION\u003e options are part of the esop \u003cTWO_THOUSAND\u003e scheme while \u003cONE_HUNDRED\u003e options are included in the esop \u003cTWO_THOUSAND\u003e scheme branded as the foodie bay employee stock option plan esops are a form of compensation where employees are granted company stock options these options act as both a reward and an incentive for employees with the company s performance and market value reflecting the efforts of its workforce in this case the option refers to the instrument that can be converted into an equity share when the holder decides to exercise it each of the esops has a face value of \u003cONE_\u003e and can be exercised within \u003cONE_TEN\u003e years from the date of vesting or \u003cONE_TEN\u003e years from the date of listing whichever is later according to the filing these options will not be subject to a lock in period earlier in the year zomato had approved the granting of \u003cFOUR_TEN_MILLION\u003e stock options in july followed by an additional \u003cONE_MILLION\u003e stock options covering \u003cTHREE_MILLION\u003e equity shares in august as stated in previous filings this new round of stock options comes at a time when zomatos key competitor bengaluru based swiggy is preparing for an initial public offering ipo initially set to raise \u003cTHREE_THOUSAND\u003e crore swiggys shareholders have approved an increase with the ipo now expected to raise \u003cFIVE_THOUSAND\u003e crore together zomato and swiggy dominate the online food delivery market in india on friday october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e zomato share price closed at \u003cTWO_HUNDRED\u003e on the bse marking a \u003cTWO_PERCENT\u003e increase or a gain of \u003cSIX_\u003e points for the week however the exchange filing related to the esop grant was made earlier in the week on october \u003cTWO_\u003e when the stock markets were closed for gandhi jayanti by thursday october \u003cTHREE_\u003e zomato s shares had dropped slightly closing at \u003cTWO_HUNDRED\u003e a decrease of \u003cONE_PERCENT\u003e or \u003cFIVE_\u003e points","timestamp":"2024-10-06T08:09:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}