{"url":"https://www.livemint.com/market/stock-market-news/stock-check-divis-laboratories-share-price-hits-52-week-high-analysts-see-more-upside-after-55-rally-ytd-11728626038442.html","title":"Stock Check: Divi’s Laboratories share price hits 52-week high; analysts see more upside after 55% rally YTD","description":"Stock Check: Divi's Laboratories share price rose 12.02% this week, driven by Citi Research's 'buy' rating and a target price of  ₹6,400. The stock hit a 52-week high of  ₹6,106.50, with a year-to-date surge of over 55%.","content":"Stock Check: This week, Divi's Laboratories share price has garnered attention following Citi Research's initiation of a ‘buy’ rating on the stock, setting a target price of  ₹6,400. Over the course of one week, Divi's Laboratories share price has experienced a 12.02% increase, and year-to-date (YTD), the stock has seen a significant surge of over 55%. Divi's Laboratories share price today surged nearly 3% to touch a 52-week high at  ₹6,106.50 apiece on BSE, the pharma stock opened at an intraday low of  ₹5,952.05 per share.Ruchit Jain, Lead Research Analyst at 5paisa, highlighted that the immediate near-term hurdle for the Divi's Laboratories share price is around  ₹6,150 as per retracements. If the stock manages to surpass that, then it can continue this rally up to  ₹7,000 in midterm.According to a recent report from Citi Research, Divi's Laboratories has established itself in the GLP-1 APIs, positioning the company for potential revenues exceeding US$800 million by CY30E. The report delves deeply into the landscape of Glucagon-like peptide-1 (GLP-1) active pharmaceutical ingredients (API) to highlight this. Divi's Laboratories is expected to benefit significantly from the trend of supply chain diversification, as evidenced by the confidence shown by innovators in the company. This is reflected in the addition of new names such as Ribociclib and Upadacitinib to Divi's Laboratories' portfolio in the CS business.The brokerage also noted that Eli Lilly, as the innovator, is experiencing high demand and is taking actions to broaden its supply chain. This is in line with the progress on the US Biosecure Act. Due to its ability to scale up at an industrial level, Divi's Laboratories has the potential to become a significant player. According to the brokerage, European contract development and manufacturing organisations (CDMOs) will still be important but might struggle to keep up with demand because of the high costs and difficulties in commercialising larger capacities.\"The US Biosecure Act (irrespective of its strictness) is expected to work as a catalyst for innovators to diversify supply chains. As more and more innovators show confidence in Divi's Laboratories, it has the potential to become a prominent player in chemistry-based CDMO projects, in our view,\" Citi Research said.Divi's Laboratories has seen a YTD increase of about 40% as per the brokerage's report (dated on October 8), attributed to advancements in the US Biosecure Act. It is currently trading approximately 20% higher than its historical premium over NSE Pharma.“We assign 40x EV/EBITDA multiple to the company’s Sept’26E EBITDA to arrive at target price of  ₹6,400. Our target multiple (40x) is c30% premium to the company’s past 5-yr mean and we believe valuations are likely to continue to remain elevated for the stock as global innovators are diversifying their supply base and it’s apparent that Divi's Laboratories is turning out to be one of the key beneficiaries,” the brokerage said.","cleaned_content":"stock check this week divis laboratories share price has garnered attention following citi researchs initiation of a buy rating on the stock setting a target price of \u003cSIX_THOUSAND\u003e over the course of one week divis laboratories share price has experienced a \u003cONE_TEN_PERCENT\u003e increase and year to date ytd the stock has seen a significant surge of over \u003cFIVE_TEN_PERCENT\u003e divis laboratories share price today surged nearly \u003cTHREE_PERCENT\u003e to touch a \u003cFIVE_TEN\u003e week high at \u003cSIX_THOUSAND\u003e apiece on bse the pharma stock opened at an intraday low of \u003cFIVE_THOUSAND\u003e per share ruchit jain lead research analyst at \u003cFIVE_\u003e paisa highlighted that the immediate near term hurdle for the divis laboratories share price is around \u003cSIX_THOUSAND\u003e as per retracements if the stock manages to surpass that then it can continue this rally up to \u003cSEVEN_THOUSAND\u003e in midterm according to a recent report from citi research divis laboratories has established itself in the glp \u003cONE_\u003e apis positioning the company for potential revenues exceeding us \u003cEIGHT_HUNDRED\u003e million by cy30e the report delves deeply into the landscape of glucagon like peptide \u003cONE_\u003e glp \u003cONE_\u003e active pharmaceutical ingredients api to highlight this divis laboratories is expected to benefit significantly from the trend of supply chain diversification as evidenced by the confidence shown by innovators in the company this is reflected in the addition of new names such as ribociclib and upadacitinib to divis laboratories portfolio in the cs business the brokerage also noted that eli lilly as the innovator is experiencing high demand and is taking actions to broaden its supply chain this is in line with the progress on the us biosecure act due to its ability to scale up at an industrial level divis laboratories has the potential to become a significant player according to the brokerage european contract development and manufacturing organisations cdmos will still be important but might struggle to keep up with demand because of the high costs and difficulties in commercialising larger capacities the us biosecure act irrespective of its strictness is expected to work as a catalyst for innovators to diversify supply chains as more and more innovators show confidence in divis laboratories it has the potential to become a prominent player in chemistry based cdmo projects in our view citi research said divis laboratories has seen a ytd increase of about \u003cFOUR_TEN_PERCENT\u003e as per the brokerages report dated on october \u003cEIGHT_\u003e attributed to advancements in the us biosecure act it is currently trading approximately \u003cTWO_TEN_PERCENT\u003e higher than its historical premium over nse pharma we assign \u003cFOUR_TEN\u003e x ev ebitda multiple to the company s sept \u003cTWO_TEN\u003e e ebitda to arrive at target price of \u003cSIX_THOUSAND\u003e our target multiple \u003cFOUR_TEN\u003e x is c30% premium to the company s past \u003cFIVE_\u003e yr mean and we believe valuations are likely to continue to remain elevated for the stock as global innovators are diversifying their supply base and it s apparent that divis laboratories is turning out to be one of the key beneficiaries the brokerage said","timestamp":"2024-10-11T12:15:00+05:30","market_timestamp":"2024-10-11T12:15:00+05:30","off_market_hours":false}