{"url":"https://www.livemint.com/market/stock-market-news/reliance-bonus-issue-2024-ril-may-announce-bonus-share-record-date-tomorrow-reports-11728796247000.html","title":"Reliance Bonus issue 2024: RIL may announce bonus share record date tomorrow - reports","description":"Reliance Industries announced plans to distribute one additional share for every share held by shareholders during its AGM. However, the record date is yet to be announced.","content":"Reliance Industries Limited (RIL) announced that its Board of Directors had approved a 1:1 bonus share issue during its annual general meeting (AGM) in September this year. This means shareholders holding one fully paid-up equity share of  ₹10 each will receive an additional share of the same value.The bonus issuance is expected to be the largest of its kind in India’s stock market, coinciding with the festive season, which RIL has dubbed as an \"early Diwali gift\" to investors, as per various media reports. However, the company has not yet disclosed the official record date for the bonus share distribution.The Board is expected to finalize the record date for the bonus issue during its meeting on October 14, 2024, as per various media reports. On the same day, the company will also review and approve its standalone and consolidated unaudited financial results for the quarter and half-year ending September 30, 2024.In an exchange filing, the company stated,“...the Board of Directors of the Company is scheduled to be held on Monday, October 14, 2024, inter alia, to consider and approve the standalone and consolidated unaudited financial results of the Company for the quarter and half year ended September 30, 2024.\"As per SEBI regulations, RIL’s trading window for dealing in securities closed on October 1, 2024, and will remain shut until 48 hours after the financial results are made public.This marks the sixth bonus issue by RIL since its initial public offering (IPO) and the second within the current decade. The company highlighted in its filings that these measures reflect its consistent strategy to reward shareholders as part of its “Golden Decade” from 2017 to 2027.In 2017, RIL also issued bonus shares in a 1:1 ratio, followed by a landmark Rights Issue in 2020, which increased shareholder investments by 2.5 times. More recently, in July 2023, Jio Financial Services Limited was demerged from Reliance, with the spin-off now valued 35% higher than its listing price.","cleaned_content":"reliance industries limited ril announced that its board of directors had approved a \u003cONE_\u003e \u003cONE_\u003e bonus share issue during its annual general meeting agm in september this year this means shareholders holding one fully paid up equity share of \u003cONE_TEN\u003e each will receive an additional share of the same value the bonus issuance is expected to be the largest of its kind in india s stock market coinciding with the festive season which ril has dubbed as an early diwali gift to investors as per various media reports however the company has not yet disclosed the official record date for the bonus share distribution the board is expected to finalize the record date for the bonus issue during its meeting on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e as per various media reports on the same day the company will also review and approve its standalone and consolidated unaudited financial results for the quarter and half year ending september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e in an exchange filing the company stated the board of directors of the company is scheduled to be held on monday october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e inter alia to consider and approve the standalone and consolidated unaudited financial results of the company for the quarter and half year ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as per sebi regulations ril s trading window for dealing in securities closed on october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e and will remain shut until \u003cFOUR_TEN\u003e hours after the financial results are made public this marks the sixth bonus issue by ril since its initial public offering ipo and the second within the current decade the company highlighted in its filings that these measures reflect its consistent strategy to reward shareholders as part of its golden decade from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e in \u003cTWO_THOUSAND\u003e ril also issued bonus shares in a \u003cONE_\u003e \u003cONE_\u003e ratio followed by a landmark rights issue in \u003cTWO_THOUSAND\u003e which increased shareholder investments by \u003cTWO_\u003e times more recently in july \u003cTWO_THOUSAND\u003e jio financial services limited was demerged from reliance with the spin off now valued \u003cTHREE_TEN_PERCENT\u003e higher than its listing price","timestamp":"2024-10-13T10:55:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}