{"url":"https://www.livemint.com/market/stock-market-news/india-to-underperform-ems-in-short-term-the-risk-of-side-effect-is-more-on-indian-market-11728145070213.html","title":"India to underperform EMs in short-term: “The risk of ‘side effect’ is more on Indian market…”","description":"India will likely underperform other EMs in the short term, with midcap stocks expected to lag behind domestic large-caps","content":"The stronger impact on the domestic stock market was partly due to our playing on a weak wicket. In the weeks prior, the domestic market had been underperforming relative to other EMs.The underperformance intensified as investors began shifting funds to Asian counterparts like China, trading at significantly lower valuations—10x to 25x forward P/E in dollar terms, compared to India's premium valuation.India was trading at a premium valuation for a long time due to its economic supremacy. However, recent corporate earnings growth has stabilised with a negative slope, indicating that India will have to bear a correction in valuation.Also Read: Stock Market Crash: Israel-Iran war to FII outflows—5 reasons why Sensex, Nifty plunged today amid volatilityRising tensions in West Asia have had a disproportionate impact on the Indian stock market compared to the global clampdown. Since 26 September, the Nifty 50 has been down by 4.5 per cent, while major global indices have fallen by just 1.25 per cent, excluding China, which is up by more than 10 per cent.The world is coping better, while given India's dependence on crude oil imports, the surge in oil prices has a direct effect on its trade deficit. With crude prices up by 10 per cent, the resulting volatility affects both the currency and stock markets.We maintain that India will likely underperform other EMs in the short term, with midcap stocks expected to lag behind domestic large caps. This shift in our outlook was already in motion before the recent Israel-Iran conflict, which has only intensified the situation.Also Read: FPIs take U-turn in October, offload  ₹27,142 crore in Indian equities: Here’s what triggered the sell-offThe heightened tension is expected to hold the uncertainty elevated as the world awaits to see the response of Israel to the Iran missile attack. The broader concern—or hope—is that this historic skirmish does not escalate into a full-scale war, with the US playing a pivotal role in the background.The Ukraine-Russia war had profound economic consequences, severely disrupting global supply chains. Ukraine, a vital supplier of key food commodities like corn, wheat, and edible oil to regions including China, faced major export challenges.Simultaneously, Russia, a key supplier of oil, gas, and metals to Europe, saw its commodity flows impacted. The war happened at a time (Feb 2022) when the world was already burning under the COVID-19-led low-capacity utilisation, affecting supplies and leading to hyperworld inflation.Israel and Iran's economic trade with the global market is largely limited, as they lack essential goods, which minimizes their direct impact on global inflation. However, Iran is the ninth largest oil producer in the world, and the collision is happening near key shipping lanes and the oil trade region, which is already spiking crude prices. This is expected to be negative for India, escalating the risk of underperformance.Also Read: Nifty 50 slides 4.4% this week, posts largest weekly drop since June 2022 on growing Iran-Israel war fears, FII outflowsAnother key area of focus in India will be the start of corporate Q2 results this week. It will start with the IT sector, which is expected to see a marginal improvement in earnings growth on a QoQ basis. Whether they are good enough on a YoY basis to suggest the current decent high valuation is another point.The push is from data centres, North America, the healthcare sector, and ERP.  Meanwhile, sector margins are likely to remain mixed due to deferred wage hikes and budget constraints among clients, leading to cuts in discretionary spending.Clients continue to squeeze their budgets and cut discretionary spending. Despite these challenges, there are signs of a gradual recovery in client spending, particularly in modernization and discretionary areas. The outlook for BFSI will likely improve as the US Fed is expected to cut rates to a good degree.In the near term, the IT sector is likely to continue its growth trajectory, albeit at a slower pace. The sector has performed well in the last three years, taking the valuation to a three-year high, affecting performance in the short term. Domestically, there is traction in the sector’s investment, given its defensive nature, which is expected to continue.Also Read: US Fed delivers supersized 50 bps rate cut: FPI inflows to stronger INR—here’s how the verdict is ‘good’ for IndiaBanks, a key sector to start the session, have a subdued view. Lower-than-anticipated budgeted spending by the central government and subdued growth in advances and deposits are expected to continue exerting margin pressures in the second quarter.Industry advances are expected to grow by only 4.05 per cent QoQ, significantly lower than the eight per cent QoQ growth achieved last year. Consequently, only marginal improvements in bank profits are anticipated. Stress in the SME segment could lead to increased delinquencies, resulting in higher-than-anticipated provisioning, further hindering bank profitability.The beginning of the Q2 earnings season is expected to start on a mixed trend, with a negative prejudice. There is a risk of short achievements in the coming 1-2 quarters. This may lead to downgrades as the market believes earnings growth will revert.Q1 was weak due to the national election's effect. The prevailing market sentiment is that steady domestic demand, a shift in global demand, and lower inflation compared to last year will support earnings growth in the future. This view will be tested in Q2.","cleaned_content":"the stronger impact on the domestic stock market was partly due to our playing on a weak wicket in the weeks prior the domestic market had been underperforming relative to other ems the underperformance intensified as investors began shifting funds to asian counterparts like china trading at significantly lower valuations \u003cONE_TEN\u003e x to \u003cTWO_TEN\u003e x forward p e in dollar terms compared to indias premium valuation india was trading at a premium valuation for a long time due to its economic supremacy however recent corporate earnings growth has stabilised with a negative slope indicating that india will have to bear a correction in valuation also read stock market crash israel iran war to fii outflows \u003cFIVE_\u003e reasons why sensex nifty plunged today amid volatilityrising tensions in west asia have had a disproportionate impact on the indian stock market compared to the global clampdown since \u003cTWO_TEN\u003e september the nifty \u003cFIVE_TEN\u003e has been down by \u003cFOUR_PERCENT\u003e while major global indices have fallen by just \u003cONE_PERCENT\u003e excluding china which is up by more than \u003cONE_TEN_PERCENT\u003e the world is coping better while given indias dependence on crude oil imports the surge in oil prices has a direct effect on its trade deficit with crude prices up by \u003cONE_TEN_PERCENT\u003e the resulting volatility affects both the currency and stock markets we maintain that india will likely underperform other ems in the short term with midcap stocks expected to lag behind domestic large caps this shift in our outlook was already in motion before the recent israel iran conflict which has only intensified the situation also read fpis take u turn in october offload \u003cTWO_TEN_THOUSAND\u003e crore in indian equities here s what triggered the sell offthe heightened tension is expected to hold the uncertainty elevated as the world awaits to see the response of israel to the iran missile attack the broader concern or hope is that this historic skirmish does not escalate into a full scale war with the us playing a pivotal role in the background the ukraine russia war had profound economic consequences severely disrupting global supply chains ukraine a vital supplier of key food commodities like corn wheat and edible oil to regions including china faced major export challenges simultaneously russia a key supplier of oil gas and metals to europe saw its commodity flows impacted the war happened at a time feb \u003cTWO_THOUSAND\u003e when the world was already burning under the covid \u003cONE_TEN\u003e led low capacity utilisation affecting supplies and leading to hyperworld inflation israel and irans economic trade with the global market is largely limited as they lack essential goods which minimizes their direct impact on global inflation however iran is the ninth largest oil producer in the world and the collision is happening near key shipping lanes and the oil trade region which is already spiking crude prices this is expected to be negative for india escalating the risk of underperformance also read nifty \u003cFIVE_TEN\u003e slides \u003cFOUR_PERCENT\u003e this week posts largest weekly drop since june \u003cTWO_THOUSAND\u003e on growing iran israel war fears fii outflowsanother key area of focus in india will be the start of corporate q2 results this week it will start with the it sector which is expected to see a marginal improvement in earnings growth on a qoq basis whether they are good enough on a yoy basis to suggest the current decent high valuation is another point the push is from data centres north america the healthcare sector and erp meanwhile sector margins are likely to remain mixed due to deferred wage hikes and budget constraints among clients leading to cuts in discretionary spending clients continue to squeeze their budgets and cut discretionary spending despite these challenges there are signs of a gradual recovery in client spending particularly in modernization and discretionary areas the outlook for bfsi will likely improve as the us fed is expected to cut rates to a good degree in the near term the it sector is likely to continue its growth trajectory albeit at a slower pace the sector has performed well in the last three years taking the valuation to a three year high affecting performance in the short term domestically there is traction in the sector s investment given its defensive nature which is expected to continue also read us fed delivers supersized \u003cFIVE_TEN\u003e bps rate cut fpi inflows to stronger inr here s how the verdict is good for indiabanks a key sector to start the session have a subdued view lower than anticipated budgeted spending by the central government and subdued growth in advances and deposits are expected to continue exerting margin pressures in the second quarter industry advances are expected to grow by only \u003cFOUR_PERCENT\u003e qoq significantly lower than the eight per cent qoq growth achieved last year consequently only marginal improvements in bank profits are anticipated stress in the sme segment could lead to increased delinquencies resulting in higher than anticipated provisioning further hindering bank profitability the beginning of the q2 earnings season is expected to start on a mixed trend with a negative prejudice there is a risk of short achievements in the coming \u003cONE_\u003e \u003cTWO_\u003e quarters this may lead to downgrades as the market believes earnings growth will revert q1 was weak due to the national elections effect the prevailing market sentiment is that steady domestic demand a shift in global demand and lower inflation compared to last year will support earnings growth in the future this view will be tested in q2","timestamp":"2024-10-05T22:00:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}