{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-under-rs-5-advik-capital-jumps-around-10-despite-stock-market-crash-11728294254263.html","title":"Penny stock under  ₹5: Advik Capital jumps around 10% despite stock market crash","description":"Advik Capital's shares rose nearly 10% to  ₹3.02 on October 7, despite a broader market decline. The stock remains 26% below its 52-week high but has gained 56% from its low. The company extended its rights issue closing date to October 10, 2024.","content":"Shares of penny stock Advik Capital surged nearly 10 per cent in intra-day trading on Monday, October 7, despite a continued downturn in the broader stock market.The stock rose as much as 9.8 per cent to  ₹3.02, outperforming the benchmark indices, which saw a decline of over 1 per cent for the sixth consecutive session today. Despite this rise, the NBFC stock remains 26 per cent below its 52-week high of  ₹4.10, which it touched in January 2024. However, from its 52-week low of  ₹1.94, recorded in October of the previous year, the stock has gained nearly 56 per cent.It has risen 17 per cent in the last one year and 44 per cent on a year-to-date (YTD) basis. Meanwhile, the penny stock is up 8 per cent in October so far despite a 4 per cent drop in the Indian benchmark indices.Advik Capital recently announced the extension of its ongoing rights issue, which was initially scheduled to close on October 4, to October 10. The company stated in a regulatory filing, \"The Rights Issue Committee, in its meeting held on October 1, 2024, decided to extend the issue's closing date to provide shareholders more time to exercise their rights.\" The last date for submitting applications was extended to October 10, 2024.There were no changes to the Letter of Offer (LOF), Composite Application Form (CAF), or Abridged Letter of Offer (ALOF), except for the adjustment in the closing date and the corresponding changes in the post-issue activity timetable, it added.The board of Advik Capital had approved the rights issue during a meeting on September 7, 2024. Under this offering, the company planned to issue 19,98,05,013 fully paid-up equity shares with a face value of Re 1 each, aiming to raise  ₹4,995.13 lakh, assuming full subscription.The issue price was set at  ₹2.50 per share, including a premium of  ₹1.50 per share. This provided eligible shareholders with an opportunity to purchase additional shares at a discounted price. The entitlement ratio was set at 14:30, meaning shareholders could buy 14 rights equity shares for every 30 fully paid-up shares they owned.Advik Capital had set September 12, 2024, as the record date to determine shareholder eligibility for the rights issue. Upon completion of the issue, the total number of outstanding equity shares would increase to 62,79,58,613.Advik Capital is a non-banking financial company (NBFC) registered with the Reserve Bank of India. It primarily focuses on providing financial loans and ancillary services. The company's activities include offering loans and advances to industrial enterprises, financing leasing operations, and investing in emerging businesses and securities.","cleaned_content":"shares of penny stock advik capital surged nearly \u003cONE_TEN_PERCENT\u003e in intra day trading on monday october \u003cSEVEN_\u003e despite a continued downturn in the broader stock market the stock rose as much as \u003cNINE_PERCENT\u003e to \u003cTHREE_\u003e outperforming the benchmark indices which saw a decline of over \u003cONE_PERCENT\u003e for the sixth consecutive session today despite this rise the nbfc stock remains \u003cTWO_TEN_PERCENT\u003e below its \u003cFIVE_TEN\u003e week high of \u003cFOUR_\u003e which it touched in january \u003cTWO_THOUSAND\u003e however from its \u003cFIVE_TEN\u003e week low of \u003cONE_\u003e recorded in october of the previous year the stock has gained nearly \u003cFIVE_TEN_PERCENT\u003e it has risen \u003cONE_TEN_PERCENT\u003e in the last one year and \u003cFOUR_TEN_PERCENT\u003e on a year to date ytd basis meanwhile the penny stock is up \u003cEIGHT_PERCENT\u003e in october so far despite a \u003cFOUR_PERCENT\u003e drop in the indian benchmark indices advik capital recently announced the extension of its ongoing rights issue which was initially scheduled to close on october \u003cFOUR_\u003e to october \u003cONE_TEN\u003e the company stated in a regulatory filing the rights issue committee in its meeting held on october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e decided to extend the issues closing date to provide shareholders more time to exercise their rights the last date for submitting applications was extended to october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e there were no changes to the letter of offer lof composite application form caf or abridged letter of offer alof except for the adjustment in the closing date and the corresponding changes in the post issue activity timetable it added the board of advik capital had approved the rights issue during a meeting on september \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e under this offering the company planned to issue \u003cONE_HUNDRED_MILLION\u003e fully paid up equity shares with a face value of re \u003cONE_\u003e each aiming to raise \u003cFOUR_THOUSAND\u003e lakh assuming full subscription the issue price was set at \u003cTWO_\u003e per share including a premium of \u003cONE_\u003e per share this provided eligible shareholders with an opportunity to purchase additional shares at a discounted price the entitlement ratio was set at \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e meaning shareholders could buy \u003cONE_TEN\u003e rights equity shares for every \u003cTHREE_TEN\u003e fully paid up shares they owned advik capital had set september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e as the record date to determine shareholder eligibility for the rights issue upon completion of the issue the total number of outstanding equity shares would increase to \u003cSIX_HUNDRED_MILLION\u003e advik capital is a non banking financial company nbfc registered with the reserve bank of india it primarily focuses on providing financial loans and ancillary services the companys activities include offering loans and advances to industrial enterprises financing leasing operations and investing in emerging businesses and securities","timestamp":"2024-10-07T15:20:00+05:30","market_timestamp":"2024-10-07T15:20:00+05:30","off_market_hours":false}