{"url":"https://www.livemint.com/market/multibagger-stock-shakti-pumps-announces-bonus-share-issue-in-5-1-ratio-after-300-rally-yeartodate-11728292607168.html","title":"Multibagger stock: Shakti Pumps announces bonus shares in 5:1 ratio after 300% rally year-to-date","description":"Shakti Pumps announced a 5:1 bonus share issue, providing five new shares for every existing share held. The decision was made during the board meeting on October 7, 2024, and requires member approval through a postal ballot. The record date will be announced later.","content":"Multibagger Stock 2024: Shakti Pumps, manufacturer and supplier of energy-efficient pumps and motors, on Monday, October 7, said that its board has approved the bonus shares in a 5:1 ratio. This means, the company will issue five new shares for every one share held by the shareholder.The company in an exchange filing said, “Board of Directors of Shakti Pumps (India) Limited at its meeting held today i.e. Monday, October 07, 2024, recommended issue of bonus shares in the ratio of 5:1 i.e., 5 (Five) new fully paid up equity share of  ₹10/- each for every 1 (One) existing fully paid up equity share to the eligible shareholders of the company as on the record date, subject to the approval of Members of the Company through the postal ballot process.”The company has not yet determined the record date for the bonus share issue. “Record date to determine the eligible shareholders for bonus equity shares shall be intimated in due course of time to the exchanges separately,” the filing added.The board also gave its nod to the increase in the authorised share capital of the company from  ₹40 crore to  ₹190, subject to approval.Furthermore, the company's board also approved the appointment of Ramakrishna Sataluri as an additional cum non-executive \u0026 non-independent director of the company.Shakti Pumps stock continued to trade with cuts following these announcements. At around 3.10 pm, Shakti Pumps share price was locked in the 5 per cent lower circuit at  ₹4,304.9 on the BSE.The scrip hit a high of  ₹4,599.95 and a low of  ₹4,304.90 in intra-day trading on Monday.So far in 2024, the stock has risen 321 per cent. Meanwhile, in the last one year, the stock has surged 369 per cent.","cleaned_content":"multibagger stock \u003cTWO_THOUSAND\u003e shakti pumps manufacturer and supplier of energy efficient pumps and motors on monday october \u003cSEVEN_\u003e said that its board has approved the bonus shares in a \u003cFIVE_\u003e \u003cONE_\u003e ratio this means the company will issue five new shares for every one share held by the shareholder the company in an exchange filing said board of directors of shakti pumps india limited at its meeting held today i e monday october \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e recommended issue of bonus shares in the ratio of \u003cFIVE_\u003e \u003cONE_\u003e i e \u003cFIVE_\u003e five new fully paid up equity share of \u003cONE_TEN\u003e each for every \u003cONE_\u003e one existing fully paid up equity share to the eligible shareholders of the company as on the record date subject to the approval of members of the company through the postal ballot process the company has not yet determined the record date for the bonus share issue record date to determine the eligible shareholders for bonus equity shares shall be intimated in due course of time to the exchanges separately the filing added the board also gave its nod to the increase in the authorised share capital of the company from \u003cFOUR_TEN\u003e crore to \u003cONE_HUNDRED\u003e subject to approval furthermore the companys board also approved the appointment of ramakrishna sataluri as an additional cum non executive non independent director of the company shakti pumps stock continued to trade with cuts following these announcements at around \u003cTHREE_\u003e pm shakti pumps share price was locked in the \u003cFIVE_PERCENT\u003e lower circuit at \u003cFOUR_THOUSAND\u003e on the bse the scrip hit a high of \u003cFOUR_THOUSAND\u003e and a low of \u003cFOUR_THOUSAND\u003e in intra day trading on monday so far in \u003cTWO_THOUSAND\u003e the stock has risen \u003cTHREE_HUNDRED_PERCENT\u003e meanwhile in the last one year the stock has surged \u003cTHREE_HUNDRED_PERCENT\u003e","timestamp":"2024-10-07T14:54:00+05:30","market_timestamp":"2024-10-07T14:54:00+05:30","off_market_hours":false}