{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-gujarat-toolroom-completes-fundraising-via-qip-share-hits-5-upper-circuit-11728630789885.html","title":"Penny stock Gujarat Toolroom completes fundraising via QIP; share hits 5% upper circuit","description":"Following a QIP to raise  ₹50 crore, Gujarat Toolroom's share price hit the 5 per cent upper circuit at  ₹13.05. The funds will support the company's growth objectives. It also declared a 100% dividend, reflecting robust cash flow.","content":"Penny stock Gujarat Toolroom hit the 5 per cent upper circuit limit of  ₹13.05 on Friday, October 11, following the successful completion of a Qualified Institutional Placement (QIP). The company raised  ₹50 crore at an issue price of  ₹11.50 per share, with significant participation from institutional investors, including Zeta Global Funds and Eminence Global Fund PCC Trade Fund.“Gujarat Toolroom is delighted to announce the successful completion of its Qualified Institutional Placement (QIP), raising  ₹50 crore through the issue and allotment of 4,34,78,260 equity shares at a price of  ₹11.50 per share, including a premium of  ₹10.50 per share. This represents a significant milestone in the Company’s ongoing growth journey,” it said in an exchange filing.Prominent institutional investors, including Zeta Global Funds (OEIC) PCC Ltd and Eminence Global Fund PCC Trade Fund 1, participated in the QIP, with each entity subscribing to 2,17,39,130 equity shares, collectively representing 50% of the total allotment, the filing added.The company also noted that the strategic rationale for the QIP was to obtain additional capital to accelerate long-term growth objectives.This initiative focuses on several key areas: first, it aims to invest in critical projects that will expand operations across various sectors. Second, funds will be allocated to research and development of clean energy technologies and initiatives that align with global sustainability goals. Third, the company plans to enhance its mining operations by increasing capacity and developing new projects. Lastly, the QIP will help ensure adequate liquidity to optimise daily operations and support the scaling of the business effectively, it added.Management expressed enthusiasm over the strong response from institutional investors, reaffirming the company's commitment to sustainable growth and shareholder value.\"We are thrilled with the overwhelming response to our QIP from leading institutional investors. This fund-raising exercise reaffirms our commitment to driving sustainable growth and enhancing shareholder value. The raised capital will support our strategic initiatives across clean energy, mining, and overall business expansion, propelling us towards new heights of success. We are confident that these investments will play a pivotal role in shaping the future of Gujarat Toolroom Ltd. and solidifying our market leadership,” the management of the company said.The company is optimistic that the raised capital will help fuel its ambitious growth trajectory, strengthen its balance sheet, and support innovations that will drive long-term value creation for all stakeholders, the press release further stated.In addition, the company declared a 100 per cent dividend for the last quarter, showcasing its robust cash flow and consistent value delivery to shareholders.Financially, Gujarat Toolroom's Price-to-Earnings (P/E) ratio is low at 2.1, with a Return on Capital Employed (RoCE) of 179 per cent and a Return on Equity (RoE) of 91.85 per cent, highlighting effective capital utilisation and profit generation. The company operates with virtually no debt.Strategically, Gujarat Toolroom is committed to clean energy, developing a hybrid power plant in Gujarat to integrate renewable sources. This project has a total cost of  ₹572.5 crore, covering land acquisition, solar panels, wind turbines, and infrastructure.Furthermore, the acquisition of gold mines in Zambia and the establishment of a Dubai subsidiary signal the company’s international expansion into high-demand mining and construction sectors. Overall, Gujarat Toolroom is well-positioned for growth in both domestic and international markets.The penny stock was locked in its 5 per cent upper circuit today at  ₹13.05. The stock is on an upward trend for the fourth straight session, gaining over 15 per cent in this period. Despite the recent rally, the stock is still almost 72 per cent away from its 52-week high of  ₹45.97, recorded in March 2024. Meanwhile, it has advanced over 21 per cent from its 52-week low of  ₹10.75, hit in August 2024.However, the stock has corrected over 34 per cent in the last one year and 63 per cent in 2024 so far.","cleaned_content":"penny stock gujarat toolroom hit the \u003cFIVE_PERCENT\u003e upper circuit limit of \u003cONE_TEN\u003e on friday october \u003cONE_TEN\u003e following the successful completion of a qualified institutional placement qip the company raised \u003cFIVE_TEN\u003e crore at an issue price of \u003cONE_TEN\u003e per share with significant participation from institutional investors including zeta global funds and eminence global fund pcc trade fund gujarat toolroom is delighted to announce the successful completion of its qualified institutional placement qip raising \u003cFIVE_TEN\u003e crore through the issue and allotment of \u003cFOUR_TEN_MILLION\u003e equity shares at a price of \u003cONE_TEN\u003e per share including a premium of \u003cONE_TEN\u003e per share this represents a significant milestone in the company s ongoing growth journey it said in an exchange filing prominent institutional investors including zeta global funds oeic pcc ltd and eminence global fund pcc trade fund \u003cONE_\u003e participated in the qip with each entity subscribing to \u003cTWO_TEN_MILLION\u003e equity shares collectively representing \u003cFIVE_TEN_PERCENT\u003e of the total allotment the filing added the company also noted that the strategic rationale for the qip was to obtain additional capital to accelerate long term growth objectives this initiative focuses on several key areas first it aims to invest in critical projects that will expand operations across various sectors second funds will be allocated to research and development of clean energy technologies and initiatives that align with global sustainability goals third the company plans to enhance its mining operations by increasing capacity and developing new projects lastly the qip will help ensure adequate liquidity to optimise daily operations and support the scaling of the business effectively it added management expressed enthusiasm over the strong response from institutional investors reaffirming the companys commitment to sustainable growth and shareholder value we are thrilled with the overwhelming response to our qip from leading institutional investors this fund raising exercise reaffirms our commitment to driving sustainable growth and enhancing shareholder value the raised capital will support our strategic initiatives across clean energy mining and overall business expansion propelling us towards new heights of success we are confident that these investments will play a pivotal role in shaping the future of gujarat toolroom ltd and solidifying our market leadership the management of the company said the company is optimistic that the raised capital will help fuel its ambitious growth trajectory strengthen its balance sheet and support innovations that will drive long term value creation for all stakeholders the press release further stated in addition the company declared a \u003cONE_HUNDRED_PERCENT\u003e dividend for the last quarter showcasing its robust cash flow and consistent value delivery to shareholders financially gujarat toolrooms price to earnings p e ratio is low at \u003cTWO_\u003e with a return on capital employed roce of \u003cONE_HUNDRED_PERCENT\u003e and a return on equity roe of \u003cNINE_TEN_PERCENT\u003e highlighting effective capital utilisation and profit generation the company operates with virtually no debt strategically gujarat toolroom is committed to clean energy developing a hybrid power plant in gujarat to integrate renewable sources this project has a total cost of \u003cFIVE_HUNDRED\u003e crore covering land acquisition solar panels wind turbines and infrastructure furthermore the acquisition of gold mines in zambia and the establishment of a dubai subsidiary signal the company s international expansion into high demand mining and construction sectors overall gujarat toolroom is well positioned for growth in both domestic and international markets the penny stock was locked in its \u003cFIVE_PERCENT\u003e upper circuit today at \u003cONE_TEN\u003e the stock is on an upward trend for the fourth straight session gaining over \u003cONE_TEN_PERCENT\u003e in this period despite the recent rally the stock is still almost \u003cSEVEN_TEN_PERCENT\u003e away from its \u003cFIVE_TEN\u003e week high of \u003cFOUR_TEN\u003e recorded in march \u003cTWO_THOUSAND\u003e meanwhile it has advanced over \u003cTWO_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_TEN\u003e hit in august \u003cTWO_THOUSAND\u003e however the stock has corrected over \u003cTHREE_TEN_PERCENT\u003e in the last one year and \u003cSIX_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e so far","timestamp":"2024-10-11T13:01:00+05:30","market_timestamp":"2024-10-11T13:01:00+05:30","off_market_hours":false}