{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-or-sell-dharmesh-shah-of-icici-securities-recommends-buying-ntpc-lemon-tree-hotel-tomorrow-11728749006526.html","title":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying NTPC, Lemon Tree Hotel today","description":"Stocks to buy or sell: Dharmesh Shah of ICICI Securities recommends buying NTPC, and Lemon Tree Hotel this week.","content":"Stock Market News: Monday's opening session saw the domestic benchmark indices, Sensex and Nifty 50, commencing the new week cautiously, with both indices showing slight gains at the opening.The Nifty 50 index opened at 25,023, marking a gain of 59.20 points, while the Sensex index also showed an increase of 0.24%, opening at 81,576.93 after gaining 195 points.Analysts observed that the impact of the Chinese stimulus and geopolitical risks in Indian markets is tapering off. However, they also noted that there is no immediate relief in sight for the markets in the near future due to the upcoming volatility in global markets caused by the impending US presidential election.Dr. V K Vijayakumar, the Chief Investment Strategist at Geojit Financial Services, pointed out that as of 11th October, foreign portfolio investors (FPIs) have offloaded equities worth  ₹58710 crores, according to NSDL data. Despite the substantial sell-off, the market has not been significantly impacted as domestic institutional investors (DIIs) have effectively absorbed the FPI selling through consistent fund inflows. This pattern of FII selling and DII purchasing is expected to continue in the short term due to the relatively low valuations of Chinese stocks compared to the high valuations in India.The Nifty 50 and Sensex saw decreases in their daily and weekly performance due to foreign outflows, slowing corporate earnings, and escalating tensions in the Middle East on Friday.At the close of the week, the Sensex concluded at a level of 81,381.36, showing a decline of 230.05 points or 0.28%, while the Nifty 50 ended at 24,964.25, down 34.20 points or 0.14%. The Nifty 50 experienced a drop of approximately 0.2%, whereas the Sensex saw a decrease of 0.4% this week. Similarly, both indices recorded losses of around 4.5% each last week, representing the most significant decline since June 2022.Vinod Nair, the Head of Research at Geojit Financial Services, explained that this week, the market showed a combination of trends and closed with a downward inclination. The Indian market is currently going through a phase of consolidation due to high valuations and a less optimistic outlook for Q2 results. On the other hand, foreign institutional investors (FIIs) are taking advantage of arbitrage opportunities in the Chinese markets, encouraged by stimulus measures and low valuations. The RBI policy remained neutral, as the change in stance does not suggest the possibility of a rate cut in the near future.Despite the continuous aggressive selling by FIIs, the selling rate has witnessed a slight decrease, highlighted Santosh Meena, the Head of Research at Swastika Investmart Ltd. FIIs offloaded approximately  ₹28,000 crore, but this was offset by Domestic Institutional Investors (DIIs) who bought more than  ₹31,000 crore.Many Q2 earnings releases are expected this coming week, which may cause moves in particular stocks and sectors. The announcement of India's Consumer Price Index (CPI) and Wholesale Price Index (WPI) figures will also be widely watched.Index recouped intra-week losses as investors shrugged off geopolitical concerns while RBI policy and Haryana state election outcome further boosted the market sentiment. Consequently, Nifty 50 settled the volatile week on a flat note at 24964. Broader market outperformed by gaining \u003e1%. The index started the week on a negative note. However, supportive efforts from 50 days EMA amid oversold conditions resulted into pullback after last week’s sharp decline. The weekly price action formed a small bear candle with shadow on either side, indicating pause in corrective bias amid elevated volatility.Going ahead, we expect Nifty 50 to consolidate in 25,500-24,700 wherein stock specific action would prevail as we kick start the earning season. In the upcoming week, index heavy weights would be in focus as stocks carrying \u003e35% weightage in Nifty 50 are coming out with Q2FY25 earnings which would dictate further trend of the market along with geopolitical development.Structurally, on expected lines, supportive efforts emerged in Nifty 50 from 50 days EMA after 6% correction. In CY24, on five occasions, after 5-6% correction index has a tendency to form a base in the vicinity of 50 days EMA for next couple of weeks and set the stage for next leg of up move. In the current context, we expect Nifty 50 to maintain this rhythm and hold the key support of 24,700 on a closing basis that is based on following observations:A) 61.8% retracement of Aug-Sept rally (23,894-26,277), placed at 24,800B) Last month’s low is placed at 24,753Sectorally, BFSI, IT, consumption, pharma, metal are likely to outperform while capital goods, PSU offers favourable risk-reward set upCrude oil price retreated after facing stiff resistance in 80-82 zone as fears of supply disruptions from theconflict between Israel and Iranappears to be easing out. We expect, crude to consolidate in 75-82 rangeThe Bank Nifty has once again respected the long-term rising trend line held since Oct-23 that coincided with 100 days EMA. Key point to highlight is that, since July-23, on 4 occasions Bank Nifty has maintained the rhythm of not correcting \u003e9% and subsequently undergone base formation for next 2-3 weeks before unfolding next leg of up move. In current scenario, with 8% correction already in place, we expect Bank Nifty to form a base and eventually outperform the Nifty as ratio chart of Bank Nifty/Nifty 50 has found support from cycle lows and now inching upward that makes us believe index would gradually head towards 52,400 in coming weeks1. Buy NTPC in the range of  ₹410-425 for the target of  ₹485 with a stop loss of  ₹394.2. Buy Lemon Tree Hotel in the range of  ₹121-126 target  ₹142 stop loss  ₹113.The views and recommendations provided in this analysis are those of individual analysts or broking companies, not Mint. We strongly advise investors to consult with certified experts before making any investment decisions, as market conditions can change rapidly and individual circumstances may vary.","cleaned_content":"stock market news mondays opening session saw the domestic benchmark indices sensex and nifty \u003cFIVE_TEN\u003e commencing the new week cautiously with both indices showing slight gains at the opening the nifty \u003cFIVE_TEN\u003e index opened at \u003cTWO_TEN_THOUSAND\u003e marking a gain of \u003cFIVE_TEN\u003e points while the sensex index also showed an increase of \u003cZERO_PERCENT\u003e opening at \u003cEIGHT_TEN_THOUSAND\u003e after gaining \u003cONE_HUNDRED\u003e points analysts observed that the impact of the chinese stimulus and geopolitical risks in indian markets is tapering off however they also noted that there is no immediate relief in sight for the markets in the near future due to the upcoming volatility in global markets caused by the impending us presidential election dr v k vijayakumar the chief investment strategist at geojit financial services pointed out that as of \u003cONE_TEN\u003e th october foreign portfolio investors fpis have offloaded equities worth \u003cFIVE_TEN_THOUSAND\u003e crores according to nsdl data despite the substantial sell off the market has not been significantly impacted as domestic institutional investors diis have effectively absorbed the fpi selling through consistent fund inflows this pattern of fii selling and dii purchasing is expected to continue in the short term due to the relatively low valuations of chinese stocks compared to the high valuations in india the nifty \u003cFIVE_TEN\u003e and sensex saw decreases in their daily and weekly performance due to foreign outflows slowing corporate earnings and escalating tensions in the middle east on friday at the close of the week the sensex concluded at a level of \u003cEIGHT_TEN_THOUSAND\u003e showing a decline of \u003cTWO_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e while the nifty \u003cFIVE_TEN\u003e ended at \u003cTWO_TEN_THOUSAND\u003e down \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e the nifty \u003cFIVE_TEN\u003e experienced a drop of approximately \u003cZERO_PERCENT\u003e whereas the sensex saw a decrease of \u003cZERO_PERCENT\u003e this week similarly both indices recorded losses of around \u003cFOUR_PERCENT\u003e each last week representing the most significant decline since june \u003cTWO_THOUSAND\u003e vinod nair the head of research at geojit financial services explained that this week the market showed a combination of trends and closed with a downward inclination the indian market is currently going through a phase of consolidation due to high valuations and a less optimistic outlook for q2 results on the other hand foreign institutional investors fiis are taking advantage of arbitrage opportunities in the chinese markets encouraged by stimulus measures and low valuations the rbi policy remained neutral as the change in stance does not suggest the possibility of a rate cut in the near future despite the continuous aggressive selling by fiis the selling rate has witnessed a slight decrease highlighted santosh meena the head of research at swastika investmart ltd fiis offloaded approximately \u003cTWO_TEN_THOUSAND\u003e crore but this was offset by domestic institutional investors diis who bought more than \u003cTHREE_TEN_THOUSAND\u003e crore many q2 earnings releases are expected this coming week which may cause moves in particular stocks and sectors the announcement of indias consumer price index cpi and wholesale price index wpi figures will also be widely watched index recouped intra week losses as investors shrugged off geopolitical concerns while rbi policy and haryana state election outcome further boosted the market sentiment consequently nifty \u003cFIVE_TEN\u003e settled the volatile week on a flat note at \u003cTWO_TEN_THOUSAND\u003e broader market outperformed by gaining \u003cONE_PERCENT\u003e the index started the week on a negative note however supportive efforts from \u003cFIVE_TEN\u003e days ema amid oversold conditions resulted into pullback after last week s sharp decline the weekly price action formed a small bear candle with shadow on either side indicating pause in corrective bias amid elevated volatility going ahead we expect nifty \u003cFIVE_TEN\u003e to consolidate in \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e wherein stock specific action would prevail as we kick start the earning season in the upcoming week index heavy weights would be in focus as stocks carrying \u003cTHREE_TEN_PERCENT\u003e weightage in nifty \u003cFIVE_TEN\u003e are coming out with q2fy25 earnings which would dictate further trend of the market along with geopolitical development structurally on expected lines supportive efforts emerged in nifty \u003cFIVE_TEN\u003e from \u003cFIVE_TEN\u003e days ema after \u003cSIX_PERCENT\u003e correction in cy24 on five occasions after \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e correction index has a tendency to form a base in the vicinity of \u003cFIVE_TEN\u003e days ema for next couple of weeks and set the stage for next leg of up move in the current context we expect nifty \u003cFIVE_TEN\u003e to maintain this rhythm and hold the key support of \u003cTWO_TEN_THOUSAND\u003e on a closing basis that is based on following observations a \u003cSIX_TEN_PERCENT\u003e retracement of aug sept rally \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e placed at \u003cTWO_TEN_THOUSAND\u003e b last month s low is placed at \u003cTWO_TEN_THOUSAND\u003e sectorally bfsi it consumption pharma metal are likely to outperform while capital goods psu offers favourable risk reward set up crude oil price retreated after facing stiff resistance in \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN\u003e zone as fears of supply disruptions from theconflict between israel and iranappears to be easing out we expect crude to consolidate in \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e range the bank nifty has once again respected the long term rising trend line held since oct \u003cTWO_TEN\u003e that coincided with \u003cONE_HUNDRED\u003e days ema key point to highlight is that since july \u003cTWO_TEN\u003e on \u003cFOUR_\u003e occasions bank nifty has maintained the rhythm of not correcting \u003cNINE_PERCENT\u003e and subsequently undergone base formation for next \u003cTWO_\u003e \u003cTHREE_\u003e weeks before unfolding next leg of up move in current scenario with \u003cEIGHT_PERCENT\u003e correction already in place we expect bank nifty to form a base and eventually outperform the nifty as ratio chart of bank nifty nifty \u003cFIVE_TEN\u003e has found support from cycle lows and now inching upward that makes us believe index would gradually head towards \u003cFIVE_TEN_THOUSAND\u003e in coming weeks1 buy ntpc in the range of \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e for the target of \u003cFOUR_HUNDRED\u003e with a stop loss of \u003cTHREE_HUNDRED\u003e buy lemon tree hotel in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e target \u003cONE_HUNDRED\u003e stop loss \u003cONE_HUNDRED\u003e the views and recommendations provided in this analysis are those of individual analysts or broking companies not mint we strongly advise investors to consult with certified experts before making any investment decisions as market conditions can change rapidly and individual circumstances may vary","timestamp":"2024-10-14T10:00:00+05:30","market_timestamp":"2024-10-14T10:00:00+05:30","off_market_hours":false}