{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-tcs-tata-elxsi-ireda-mazagon-dock-zydus-lifesciences-ril-and-more-11728580870231.html","title":"Stocks to Watch: TCS, Tata Elxsi, IREDA, Mazagon Dock, Zydus Lifesciences, RIL, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"TCS reported a consolidated net profit of  ₹11,909 crore for Q2FY25, reflecting a 5 percent year-on-year growth compared to  ₹11,342 crore in the same quarter last year. Revenue from operations rose 7.7 percent year-on-year to  ₹64,259 crore from  ₹59,692 crore in Q2FY24. In constant currency terms, revenue grew by 5.5 percent. The company posted an operating margin of 24.1 percent and a net margin of 18.5 percent, with the operating margin slightly declining by 0.2 percent year-on-year.Tata Elxsi exceeded market expectations by reporting a 14.7 percent rise in net profit for the second quarter, driven by strong demand in its transportation division. The company’s profit rose to  ₹229 crore, surpassing analysts' estimates of  ₹205 crore. Revenue from operations increased by 8.3 percent to  ₹955 crore, aligning with analyst expectations of  ₹956 crore.Indian Renewable Energy Development Agency (IREDA) reported a net profit of  ₹387.74 crore for the quarter ended September 30, 2024, marking a 36 percent increase compared to  ₹284.73 crore in the year-ago period. The net profit also slightly surpassed the  ₹383 crore recorded in the June quarter. Total income rose by 38.5 percent to  ₹1,630 crore in Q2FY25, compared to  ₹1,177 crore in the same quarter last year, and  ₹1,510 crore in the June quarter.Mazagon Dock Shipbuilders received an order worth  ₹121.7 crore from Maharashtra State Power Generation Company (MAHAGENCO) for supplying, installing, and commissioning an AI-based “comprehensive infrasecure project.”Bandhan Bank: The Reserve Bank of India appointed Partha Pratim Sengupta as the MD \u0026 CEO of Bandhan Bank. He will assume the role for a three-year term, starting no later than November 10, according to the bank’s stock exchange filing.Anand Rathi Wealth reported a 32.4 percent year-on-year increase in net profit to  ₹76.1 crore for Q2FY25, up from  ₹57.5 crore in the same period last year. The company's revenue from operations rose 32.8 percent to  ₹242.5 crore, compared to  ₹182.6 crore in the previous year.Den Networks posted a 14 percent year-on-year rise in net profit, reaching  ₹52 crore for Q2FY25, up from  ₹45.6 crore a year ago. However, its revenue from operations declined by 10 percent to  ₹249 crore, down from  ₹276.6 crore in the corresponding period of last year.Oberoi Realty’s board approved a proposal to raise up to  ₹6,000 crore through various financial instruments.Zydus Lifesciences received US FDA approval to produce a generic version of Paliperidone extended-release tablets, used to treat schizophrenia.Earnings today: Quarterly earnings are expected today from companies such as Reliance Infrastructure, Just Dial, Plastiblends India, Hathway Cable, Jagsonpal Finance, Jaypee Infratech, Atishay, PVV Infra, Universal Arts, and Sangam Finserv.","cleaned_content":"tcs reported a consolidated net profit of \u003cONE_TEN_THOUSAND\u003e crore for q2fy25 reflecting a \u003cFIVE_PERCENT\u003e year on year growth compared to \u003cONE_TEN_THOUSAND\u003e crore in the same quarter last year revenue from operations rose \u003cSEVEN_PERCENT\u003e year on year to \u003cSIX_TEN_THOUSAND\u003e crore from \u003cFIVE_TEN_THOUSAND\u003e crore in q2fy24 in constant currency terms revenue grew by \u003cFIVE_PERCENT\u003e the company posted an operating margin of \u003cTWO_TEN_PERCENT\u003e and a net margin of \u003cONE_TEN_PERCENT\u003e with the operating margin slightly declining by \u003cZERO_PERCENT\u003e year on year tata elxsi exceeded market expectations by reporting a \u003cONE_TEN_PERCENT\u003e rise in net profit for the second quarter driven by strong demand in its transportation division the company s profit rose to \u003cTWO_HUNDRED\u003e crore surpassing analysts estimates of \u003cTWO_HUNDRED\u003e crore revenue from operations increased by \u003cEIGHT_PERCENT\u003e to \u003cNINE_HUNDRED\u003e crore aligning with analyst expectations of \u003cNINE_HUNDRED\u003e crore indian renewable energy development agency ireda reported a net profit of \u003cTHREE_HUNDRED\u003e crore for the quarter ended september \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e marking a \u003cTHREE_TEN_PERCENT\u003e increase compared to \u003cTWO_HUNDRED\u003e crore in the year ago period the net profit also slightly surpassed the \u003cTHREE_HUNDRED\u003e crore recorded in the june quarter total income rose by \u003cTHREE_TEN_PERCENT\u003e to \u003cONE_THOUSAND\u003e crore in q2fy25 compared to \u003cONE_THOUSAND\u003e crore in the same quarter last year and \u003cONE_THOUSAND\u003e crore in the june quarter mazagon dock shipbuilders received an order worth \u003cONE_HUNDRED\u003e crore from maharashtra state power generation company mahagenco for supplying installing and commissioning an ai based comprehensive infrasecure project bandhan bank the reserve bank of india appointed partha pratim sengupta as the md ceo of bandhan bank he will assume the role for a three year term starting no later than november \u003cONE_TEN\u003e according to the bank s stock exchange filing anand rathi wealth reported a \u003cTHREE_TEN_PERCENT\u003e year on year increase in net profit to \u003cSEVEN_TEN\u003e crore for q2fy25 up from \u003cFIVE_TEN\u003e crore in the same period last year the companys revenue from operations rose \u003cTHREE_TEN_PERCENT\u003e to \u003cTWO_HUNDRED\u003e crore compared to \u003cONE_HUNDRED\u003e crore in the previous year den networks posted a \u003cONE_TEN_PERCENT\u003e year on year rise in net profit reaching \u003cFIVE_TEN\u003e crore for q2fy25 up from \u003cFOUR_TEN\u003e crore a year ago however its revenue from operations declined by \u003cONE_TEN_PERCENT\u003e to \u003cTWO_HUNDRED\u003e crore down from \u003cTWO_HUNDRED\u003e crore in the corresponding period of last year oberoi realty s board approved a proposal to raise up to \u003cSIX_THOUSAND\u003e crore through various financial instruments zydus lifesciences received us fda approval to produce a generic version of paliperidone extended release tablets used to treat schizophrenia earnings today quarterly earnings are expected today from companies such as reliance infrastructure just dial plastiblends india hathway cable jagsonpal finance jaypee infratech atishay pvv infra universal arts and sangam finserv","timestamp":"2024-10-11T08:22:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}