{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-today-october-7-11728228001487.html","title":"Buy or sell: Vaishali Parekh recommends three stocks for today — October 7","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy or sell today — Exide Industries, Mahindra and Mahindra, and ICICI Securities","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50, fell for the fifth successive session on Friday, extending their losses in exceptionally volatile trade amid rising geopolitical tensions in the Middle East. The Nifty 50 index closed 0.93 per cent lower at 25,014.60 points on Friday, compared to 25,250.10 points at the previous market close.The BSE Sensex closed 0.98 per cent at 81,688.45 points after Friday's trading session, compared to 82,497.10 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty witnessed its biggest fall for 2024, dropping nearly 1,200 points with a bearish candle turning the bias weak with the market sentiment maintained at a very cautious approach. Parekh estimates the Nifty 50 Spot index to find support at 24,800 points and face resistance at 25,250 points. The Bank Nifty index will likely move in a range of 51,000 to 52,000 today.For today, Parekh recommended three buy-or-sell stocks: Exide Industries Ltd, Mahindra and Mahindra Ltd, and ICICI Securities Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty registered the biggest weekly fall for the year 2024 plunging almost 1,200 points with a big bearish candle turning the bias very weak and with the sentiment maintained with a very cautious approach.”“The index is precariously placed with next major support zone visible near the 100 period MA at 24,300 level and thereafter, the crucial and important 200 period MA at 23,200 level,” said the stock market expert.“Bank Nifty witnessing heavy profit booking has breached below the significant 50EMA level of 51,900 with bias turned weak and has the next major support zone near 49,700 level and thereafter, the important 200 period MA at 49,200 zone. One can maintain a cautious view and wait for further conviction and clarity in the market in the coming days,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 24,800 points, while the resistance lies at 25,250 points. The Bank Nifty index would have a daily range of 51,000 to 52,000.1. Exide Industries Ltd. (EXIDEIND): Buy at  ₹503; Target at  ₹520; Stop Loss at  ₹485.2. Mahindra and Mahindra Ltd. (M\u0026M): Sell at  ₹3,020; Target at  ₹2,945; Stop Loss at  ₹3,090.3. ICICI Securities Ltd. (ISEC): Buy at  ₹877; Target at  ₹920; Stop Loss at  ₹860.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e fell for the fifth successive session on friday extending their losses in exceptionally volatile trade amid rising geopolitical tensions in the middle east the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e points on friday compared to \u003cTWO_TEN_THOUSAND\u003e points at the previous market close the bse sensex closed \u003cZERO_PERCENT\u003e at \u003cEIGHT_TEN_THOUSAND\u003e points after fridays trading session compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty witnessed its biggest fall for \u003cTWO_THOUSAND\u003e dropping nearly \u003cONE_THOUSAND\u003e points with a bearish candle turning the bias weak with the market sentiment maintained at a very cautious approach parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks exide industries ltd mahindra and mahindra ltd and icici securities ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty registered the biggest weekly fall for the year \u003cTWO_THOUSAND\u003e plunging almost \u003cONE_THOUSAND\u003e points with a big bearish candle turning the bias very weak and with the sentiment maintained with a very cautious approach the index is precariously placed with next major support zone visible near the \u003cONE_HUNDRED\u003e period ma at \u003cTWO_TEN_THOUSAND\u003e level and thereafter the crucial and important \u003cTWO_HUNDRED\u003e period ma at \u003cTWO_TEN_THOUSAND\u003e level said the stock market expert bank nifty witnessing heavy profit booking has breached below the significant \u003cFIVE_TEN\u003e ema level of \u003cFIVE_TEN_THOUSAND\u003e with bias turned weak and has the next major support zone near \u003cFOUR_TEN_THOUSAND\u003e level and thereafter the important \u003cTWO_HUNDRED\u003e period ma at \u003cFOUR_TEN_THOUSAND\u003e zone one can maintain a cautious view and wait for further conviction and clarity in the market in the coming days said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e exide industries ltd exideind buy at \u003cFIVE_HUNDRED\u003e target at \u003cFIVE_HUNDRED\u003e stop loss at \u003cFOUR_HUNDRED\u003e mahindra and mahindra ltd m m sell at \u003cTHREE_THOUSAND\u003e target at \u003cTWO_THOUSAND\u003e stop loss at \u003cTHREE_THOUSAND\u003e icici securities ltd isec buy at \u003cEIGHT_HUNDRED\u003e target at \u003cNINE_HUNDRED\u003e stop loss at \u003cEIGHT_HUNDRED\u003e","timestamp":"2024-10-07T06:11:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}