{"url":"https://www.livemint.com/market/stock-market-news/shares-to-buy-or-sell-chandan-taparia-recommends-three-stocks-to-buy-today-oct-8-11728317975452.html","title":"Shares to buy or sell: Chandan Taparia recommends three stocks to buy today — Oct 8","description":"Shares to buy or sell: Chandan Taparia has recommended three stocks to buy today – M\u0026M, Infosys and Bharti Airtel","content":"Shares to buy or sell: The Nifty index ended the day at 25,014.6, showing a decrease of 0.87%. During the session, it peaked at 25,143.0 and a low of 24,694.35. Meanwhile, the Sensex ranged between 82,137.77 and 80,726.06, closing 0.78% lower at 81,688.45, down 638.45 points from its opening level.“Nifty Index opened positive and cascaded by 450 points during the day and breached its 50 DEMA. It took a breather near 24700 zones and closed with losses of around 220 points. It formed a Bearish candle on daily frame and has been making lower highs lower lows from the last five sessions. Now till it holds below 24950 zones, weakness could be seen towards 24650 then 24500 zones whereas hurdles are placed at 24950 then 25150 zones,” said Chandan Taparia, Head – Equity Derivatives and Technicals, Wealth Management, MOFSL.On option front, Maximum Call OI is at 27000 then 26000 strike while Maximum Put OI is at 24000 then 24500 strike. Call writing is seen at 25000 then 24900 strike while Put writing is seen at 24700 then 24100 strike. Option data suggests a broader trading range in between 24400 to 25400 zones while an immediate range between 24500 to 25200 levels.On the Bank Nifty outlook, Taparia added, “Bank Nifty Index opened on a positive note but failed to hold at higher levels and drifted lower towards 50200 zones in the latter part of the session. It corrected by almost 1500 points from its opening levels and remained volatile in the last hour of the session. It formed a Bearish candle on daily frame and structure of lower highs - lower lows is intact from the last five sessions. Now till it holds below 50750 zones weakness could be seen towards 50000 then 49500 levels while on the upside hurdle is seen at 51000 then 51250 zones.”Price is retesting its breakout from a consolidation zone with a hammer candlestick on the daily chart. The RSI indicator is rising which confirms the upward momentum.A range breakout is visible on the daily chart and is headed to its all-time high price. The IT sector held gains in spite of broader market selling. The Stochastic indicator is headed up which may support the up move.A bullish harami candle has formed near its support levels which may signal a bullish reversal. Overall trend is positive and every small decline is being bought into. The ADX line is declining which indicates a potential reversal could be seen.","cleaned_content":"shares to buy or sell the nifty index ended the day at \u003cTWO_TEN_THOUSAND\u003e showing a decrease of \u003cZERO_PERCENT\u003e during the session it peaked at \u003cTWO_TEN_THOUSAND\u003e and a low of \u003cTWO_TEN_THOUSAND\u003e meanwhile the sensex ranged between \u003cEIGHT_TEN_THOUSAND\u003e and \u003cEIGHT_TEN_THOUSAND\u003e closing \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e down \u003cSIX_HUNDRED\u003e points from its opening level nifty index opened positive and cascaded by \u003cFOUR_HUNDRED\u003e points during the day and breached its \u003cFIVE_TEN\u003e dema it took a breather near \u003cTWO_TEN_THOUSAND\u003e zones and closed with losses of around \u003cTWO_HUNDRED\u003e points it formed a bearish candle on daily frame and has been making lower highs lower lows from the last five sessions now till it holds below \u003cTWO_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones whereas hurdles are placed at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e zones said chandan taparia head equity derivatives and technicals wealth management mofsl on option front maximum call oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while maximum put oi is at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike call writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike while put writing is seen at \u003cTWO_TEN_THOUSAND\u003e then \u003cTWO_TEN_THOUSAND\u003e strike option data suggests a broader trading range in between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e zones while an immediate range between \u003cTWO_TEN_THOUSAND\u003e to \u003cTWO_TEN_THOUSAND\u003e levels on the bank nifty outlook taparia added bank nifty index opened on a positive note but failed to hold at higher levels and drifted lower towards \u003cFIVE_TEN_THOUSAND\u003e zones in the latter part of the session it corrected by almost \u003cONE_THOUSAND\u003e points from its opening levels and remained volatile in the last hour of the session it formed a bearish candle on daily frame and structure of lower highs lower lows is intact from the last five sessions now till it holds below \u003cFIVE_TEN_THOUSAND\u003e zones weakness could be seen towards \u003cFIVE_TEN_THOUSAND\u003e then \u003cFOUR_TEN_THOUSAND\u003e levels while on the upside hurdle is seen at \u003cFIVE_TEN_THOUSAND\u003e then \u003cFIVE_TEN_THOUSAND\u003e zones price is retesting its breakout from a consolidation zone with a hammer candlestick on the daily chart the rsi indicator is rising which confirms the upward momentum a range breakout is visible on the daily chart and is headed to its all time high price the it sector held gains in spite of broader market selling the stochastic indicator is headed up which may support the up move a bullish harami candle has formed near its support levels which may signal a bullish reversal overall trend is positive and every small decline is being bought into the adx line is declining which indicates a potential reversal could be seen","timestamp":"2024-10-08T06:21:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}