{"url":"https://www.livemint.com/market/stock-market-news/ashoka-buildcon-share-price-rises-6-on-strong-large-inflows-from-maharashtra-11728877768540.html","title":"Ashoka Buildcon share price rises 8% on large order inflows from Maharashtra","description":"Stock Market Today: Ashoka Buildcon share price gained 8% in morning trades following strong order inflows from Maharashtra. It has received Letters of Acceptance (LOAs) for two projects from Maharashtra State Road Development Corp. Ltd. Projects and one LOA for CIDCO Project worth  ₹3,267 crore.","content":"Stock Market Today: Ashoka Buildcon share price gained 8% in the morning trade on Monday, October 14 after it received large orders from Maharashtra.Ashoka Buildcon share price opened at  ₹266.05 on the BSE, slightly higher than its previous close of  ₹251.80. The stock thereafter rose to intraday highs of  ₹272, marking gains of 8% over the previous close.Ashoka Buildcon announced receiving two Letters of Acceptance (LOAs) for Maharashtra State Road Development projects and 1 LOA for CIDCO project, amounting to  ₹3,267 crore.Amongst various large orders, Ashoka Buildcon won an Engineering, Procurement and Construction (EPC Work) order from the City \u0026 Industrial Development Corporation of Maharashtra Limited (CIDCO). The accepted bid price for the project is  ₹1,673.24 crore plus applicable GST as per the company. The domestic order is to be completed in 1,460 days from the commencement date, including monsoon. The works involve integrated infrastructure development of 20M \u0026 above wide roads, construction of various major \u0026 minor structures (viz. flyover, minor bridges, VUPS, PUPS etc.) and allied electrical works (street light) in TPS - 10 \u0026 TPS - 11 under the NAINA Project.Ashoka Buildcon also announced receiving another Engineering, Procurement and Construction (EPC Work) order from Maharashtra State Road Development Corporation Ltd. The accepted bid price stands at  ₹1,284 crore plus applicable GST. The works involve the construction of a major bridge across Kundalika Creek between Revdanda to Salav on Revas Reddi Coastal Highway (SH (Special) No. 5 in Ratnagiri District in the State of Maharashtra. The order is to be completed in 36 months.In addition to the above orders, Ashoka Buidcon announced receiving another order worth  ₹310 crore plus GST applicable from Maharashtra State Road Development Corporation Ltd. The EPC work order is for the construction of a major bridge across Bankot Creek between Kolmandla, District Raigad to Veshvi on Revas Reddi Costal Highway (SH (special) No. 5 in Ratnagiri District on EPC mode in the state of Maharashtra. The order is to be completed in 36 calendar months, including monsoon.","cleaned_content":"stock market today ashoka buildcon share price gained \u003cEIGHT_PERCENT\u003e in the morning trade on monday october \u003cONE_TEN\u003e after it received large orders from maharashtra ashoka buildcon share price opened at \u003cTWO_HUNDRED\u003e on the bse slightly higher than its previous close of \u003cTWO_HUNDRED\u003e the stock thereafter rose to intraday highs of \u003cTWO_HUNDRED\u003e marking gains of \u003cEIGHT_PERCENT\u003e over the previous close ashoka buildcon announced receiving two letters of acceptance loas for maharashtra state road development projects and \u003cONE_\u003e loa for cidco project amounting to \u003cTHREE_THOUSAND\u003e crore amongst various large orders ashoka buildcon won an engineering procurement and construction epc work order from the city industrial development corporation of maharashtra limited cidco the accepted bid price for the project is \u003cONE_THOUSAND\u003e crore plus applicable gst as per the company the domestic order is to be completed in \u003cONE_THOUSAND\u003e days from the commencement date including monsoon the works involve integrated infrastructure development of \u003cTWO_TEN\u003e m above wide roads construction of various major minor structures viz flyover minor bridges vups pups etc and allied electrical works street light in tps \u003cONE_TEN\u003e tps \u003cONE_TEN\u003e under the naina project ashoka buildcon also announced receiving another engineering procurement and construction epc work order from maharashtra state road development corporation ltd the accepted bid price stands at \u003cONE_THOUSAND\u003e crore plus applicable gst the works involve the construction of a major bridge across kundalika creek between revdanda to salav on revas reddi coastal highway sh special no \u003cFIVE_\u003e in ratnagiri district in the state of maharashtra the order is to be completed in \u003cTHREE_TEN\u003e months in addition to the above orders ashoka buidcon announced receiving another order worth \u003cTHREE_HUNDRED\u003e crore plus gst applicable from maharashtra state road development corporation ltd the epc work order is for the construction of a major bridge across bankot creek between kolmandla district raigad to veshvi on revas reddi costal highway sh special no \u003cFIVE_\u003e in ratnagiri district on epc mode in the state of maharashtra the order is to be completed in \u003cTHREE_TEN\u003e calendar months including monsoon","timestamp":"2024-10-14T09:29:00+05:30","market_timestamp":"2024-10-14T09:29:00+05:30","off_market_hours":false}