{"url":"https://www.livemint.com/market/stock-market-news/phoenix-overseas-shares-nse-sme-stock-hits-5-upper-circuit-do-you-own-11728538527661.html","title":"Phoenix Overseas shares: This NSE SME stock hits 5% upper circuit; do you own?","description":"Stock Market Today: Phoenix Overseas shares hit the 5% upper circuit today. This NSE Emerge-listed company recently announced that its associate company  has started production of  crude edible oils like crude rice bran oil, crude mustard oil and de-oiled cakes.","content":"Stock Market Today: Phoenix Overseas share price hit the 5 per cent upper circuit limit on Thursday, October 10.Phoenix Overseas share price opened at  ₹44.80 on the NSE SME on Thursday, over 2% higher than the previous close of  ₹43.60. The stock extended gains up to 5% to hit  ₹45.75 in intra-day trade, also its upper price band.The company, listed on the NSE Emerge, recently announced that its associate company  M/S. BCL Bio Energy Private has started the production of crude edible oils like crude rice bran oil, crude mustard oil and de-oiled cakes.Phoenix Overseas holds a 29% stake in BCL Bio Energy.BCL Bio Energy Private runs a solvent extraction plant, which was established to extract crude rice bran oil from rice bran of 300 TPD (tonnes per day). The residual cake, called DE-oiled rice bran, is used as cattle feed and exported from India to countries like Bangladesh and Vietnam. Established in 2021, it is in the business of extraction of edible rice bran oil and is a subsidiary of BCPL Railway Infrastructure Limited.Phoenix Overseas in its release said that reducing India's reliance on importing edible oils is a modest step toward the nation's energy security. Additionally, the company will prioritise shipping deoiled cakes from India to a number of other nations, which will help the nation earn foreign exchange.Phoenix Overseas shares had debuted on the National Stock Exchange (NSE) SME on September 27, 2024, at a share price of  ₹64 per share, which was the same as the issue price.","cleaned_content":"stock market today phoenix overseas share price hit the \u003cFIVE_PERCENT\u003e upper circuit limit on thursday october \u003cONE_TEN\u003e phoenix overseas share price opened at \u003cFOUR_TEN\u003e on the nse sme on thursday over \u003cTWO_PERCENT\u003e higher than the previous close of \u003cFOUR_TEN\u003e the stock extended gains up to \u003cFIVE_PERCENT\u003e to hit \u003cFOUR_TEN\u003e in intra day trade also its upper price band the company listed on the nse emerge recently announced that its associate company m s bcl bio energy private has started the production of crude edible oils like crude rice bran oil crude mustard oil and de oiled cakes phoenix overseas holds a \u003cTWO_TEN_PERCENT\u003e stake in bcl bio energy bcl bio energy private runs a solvent extraction plant which was established to extract crude rice bran oil from rice bran of \u003cTHREE_HUNDRED\u003e tpd tonnes per day the residual cake called de oiled rice bran is used as cattle feed and exported from india to countries like bangladesh and vietnam established in \u003cTWO_THOUSAND\u003e it is in the business of extraction of edible rice bran oil and is a subsidiary of bcpl railway infrastructure limited phoenix overseas in its release said that reducing indias reliance on importing edible oils is a modest step toward the nations energy security additionally the company will prioritise shipping deoiled cakes from india to a number of other nations which will help the nation earn foreign exchange phoenix overseas shares had debuted on the national stock exchange nse sme on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at a share price of \u003cSIX_TEN\u003e per share which was the same as the issue price","timestamp":"2024-10-10T11:22:00+05:30","market_timestamp":"2024-10-10T11:22:00+05:30","off_market_hours":false}