{"url":"https://www.livemint.com/market/stock-market-news/multibagger-penny-stock-aa-plus-tradelink-to-consider-bonus-shares-stock-split-after-140-rally-in-ytd-11728704403006.html","title":"Multibagger penny stock to consider bonus shares, stock split after 140% rally in YTD","description":"Multibagger penny stock: AA Plus Tradelink, which has surged 140% year-to-date, is expected to announce a stock split and bonus share approval.","content":"Multibagger penny stock: AA Plus Tradelink has announced two potential shareholder-friendly moves, including a stock split and a bonus share issue, on October 10. AA Plus Tradelink share price has rallied around 140 per cent on a year-to-date (YTD) basis, as per BSE Analytics.Meanwhile, AA Plus Tradelink were locked at a 5 per cent lower circuit on Thursday, October 10, closing at  ₹20.63.According to a regulatory filing, the Board of Directors will review these corporate actions, which could impact the stock's accessibility and liquidity.AA Plus Tradelink stock has gained over 139 per cent, from the levels of  ₹8.19 closing at  ₹19.60 on October 11, Friday, as per BSE.The stock has surged around 114 per cent during a period of one year and delivered multibagger returns in 2024, skyrocketing over 140 per cent year-to-date. Despite Thursday’s drop, the shares remain 27 per cent below their all-time high of  ₹26.88, reached in July 2024. The stock has gained more than 180 per cent from its 52-week low of  ₹7.01, recorded in February 2024.The stock split is aimed at lowering the share price, making it more affordable for retail investors. It’s expected to improve liquidity by increasing the number of shares available for trading, which could reduce price volatility and ease market transactions, as per the filing.The company emphasized that the announcement complies with SEBI regulations, including those concerning stock splits and bonus issues. It also adheres to BSE disclosure guidelines, ensuring timely and accurate information for investors.The upcoming corporate actions will be discussed at an Extraordinary General Meeting (EGM) or through a postal ballot. Shareholders will have the opportunity to vote on the proposed changes. Additional details on the meeting and voting procedures will be shared soon.Founded in 2016, AA Plus Tradelink specializes in wholesale trade services, including the supply of iron, steel, aluminium, and alloy products. The company also offers installation services for aluminium windows and glass fittings. With a strong financial record, AA Plus Tradelink continues to pursue growth and value creation for its stakeholders.","cleaned_content":"multibagger penny stock aa plus tradelink has announced two potential shareholder friendly moves including a stock split and a bonus share issue on october \u003cONE_TEN\u003e aa plus tradelink share price has rallied around \u003cONE_HUNDRED_PERCENT\u003e on a year to date ytd basis as per bse analytics meanwhile aa plus tradelink were locked at a \u003cFIVE_PERCENT\u003e lower circuit on thursday october \u003cONE_TEN\u003e closing at \u003cTWO_TEN\u003e according to a regulatory filing the board of directors will review these corporate actions which could impact the stocks accessibility and liquidity aa plus tradelink stock has gained over \u003cONE_HUNDRED_PERCENT\u003e from the levels of \u003cEIGHT_\u003e closing at \u003cONE_TEN\u003e on october \u003cONE_TEN\u003e friday as per bse the stock has surged around \u003cONE_HUNDRED_PERCENT\u003e during a period of one year and delivered multibagger returns in \u003cTWO_THOUSAND\u003e skyrocketing over \u003cONE_HUNDRED_PERCENT\u003e year to date despite thursday s drop the shares remain \u003cTWO_TEN_PERCENT\u003e below their all time high of \u003cTWO_TEN\u003e reached in july \u003cTWO_THOUSAND\u003e the stock has gained more than \u003cONE_HUNDRED_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cSEVEN_\u003e recorded in february \u003cTWO_THOUSAND\u003e the stock split is aimed at lowering the share price making it more affordable for retail investors it s expected to improve liquidity by increasing the number of shares available for trading which could reduce price volatility and ease market transactions as per the filing the company emphasized that the announcement complies with sebi regulations including those concerning stock splits and bonus issues it also adheres to bse disclosure guidelines ensuring timely and accurate information for investors the upcoming corporate actions will be discussed at an extraordinary general meeting egm or through a postal ballot shareholders will have the opportunity to vote on the proposed changes additional details on the meeting and voting procedures will be shared soon founded in \u003cTWO_THOUSAND\u003e aa plus tradelink specializes in wholesale trade services including the supply of iron steel aluminium and alloy products the company also offers installation services for aluminium windows and glass fittings with a strong financial record aa plus tradelink continues to pursue growth and value creation for its stakeholders","timestamp":"2024-10-12T10:23:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}