{"url":"https://www.livemint.com/market/stock-market-news/navratna-psu-stock-rites-shares-surge-7-after-mou-with-uae-based-etihad-rail-11728448125147.html","title":"Navratna PSU stock: RITES shares surge over 7% after signing an MoU with UAE-based Etihad Rail","description":"Midcap Navratna PSU stock: RITES share price has risen 7 per cent following the announcement of a major international partnership with Etihad Rail.","content":"Midcap Navratna PSU stock: Rail India Technical and Economic Service, (RITES) Ltd, a Navratna PSU, hogged the limelight in intra-day trade on Wednesday, October 9, as its shares surged over 7 per cent on signing an international deal. The mid-cap infrastructure consultancy inked a partnership with Etihad Rail, positioning itself for significant rail infrastructure projects in the UAE.RITES share price was trading in the green, up 7.49 per cent at  ₹322.85 around 10:05 am on the NSE. RITES enjoys a market capitalisation of  ₹15,516.29 crore. RITES stock price hit its 52-week high on February 27, 2024, at  ₹412.98 apiece.The surge comes after RITES announced it has signed a Memorandum of Understanding (MoU) with Etihad Rail, a major player in the UAE’s national rail network, for infrastructure development projects. This collaboration could lead to significant opportunities for RITES in the region.“RITES Ltd., a prime transport infrastructure consultancy, today signed a Memorandum of Understanding (MoU) with Etihad Rail, the developer and operator of the UAE National Rail Network, to explore cooperation and synergise strengths in developing railways and related infrastructure services in the UAE and wider region,” the company announced in an exchange filing on October 9.The partnership is not the only recent positive development for RITES. Just last week, the firm secured a  ₹5.40 million order from Ntokoto Rail Holdings Pty. Ltd., to be executed within six months. The company also rewarded shareholders with a 1:1 bonus issue on July 31, 2024, and announced a  ₹5 per share dividend on May 28, 2024.Despite a dip of 14 per cent over the last two weeks, the stock has posted a remarkable 27 per cent gain over the past year.","cleaned_content":"midcap navratna psu stock rail india technical and economic service rites ltd a navratna psu hogged the limelight in intra day trade on wednesday october \u003cNINE_\u003e as its shares surged over \u003cSEVEN_PERCENT\u003e on signing an international deal the mid cap infrastructure consultancy inked a partnership with etihad rail positioning itself for significant rail infrastructure projects in the uae rites share price was trading in the green up \u003cSEVEN_PERCENT\u003e at \u003cTHREE_HUNDRED\u003e around \u003cONE_TEN\u003e \u003cFIVE_\u003e am on the nse rites enjoys a market capitalisation of \u003cONE_TEN_THOUSAND\u003e crore rites stock price hit its \u003cFIVE_TEN\u003e week high on february \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cFOUR_HUNDRED\u003e apiece the surge comes after rites announced it has signed a memorandum of understanding mou with etihad rail a major player in the uae s national rail network for infrastructure development projects this collaboration could lead to significant opportunities for rites in the region rites ltd a prime transport infrastructure consultancy today signed a memorandum of understanding mou with etihad rail the developer and operator of the uae national rail network to explore cooperation and synergise strengths in developing railways and related infrastructure services in the uae and wider region the company announced in an exchange filing on october \u003cNINE_\u003e the partnership is not the only recent positive development for rites just last week the firm secured a \u003cFIVE_\u003e million order from ntokoto rail holdings pty ltd to be executed within six months the company also rewarded shareholders with a \u003cONE_\u003e \u003cONE_\u003e bonus issue on july \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and announced a \u003cFIVE_\u003e per share dividend on may \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e despite a dip of \u003cONE_TEN_PERCENT\u003e over the last two weeks the stock has posted a remarkable \u003cTWO_TEN_PERCENT\u003e gain over the past year","timestamp":"2024-10-09T10:06:00+05:30","market_timestamp":"2024-10-09T10:06:00+05:30","off_market_hours":false}