{"url":"https://www.livemint.com/market/stock-market-news/buy-or-sell-vaishali-parekh-recommends-three-stocks-to-buy-today-october-9-11728407006378.html","title":"Buy or sell: Vaishali Parekh recommends three stocks to buy today — October 9","description":"Buy or sell stocks: Vaishali Parekh has recommended three stocks to buy or sell today — Infosys, Bombay Dyeing, and Tata Chemicals.","content":"Buy or sell stocks: India's benchmark stock market indices, Sensex and Nifty 50 witnessed a respite as investors bought into the dip. Stock market investors now eye the Reserve Bank of India's (RBI) monetary policy decision on Wednesday, October 9. The Nifty 50 index closed 0.88 per cent higher at 25,013.15 points after Tuesday's market session, compared to 24,795.75 at the previous market close.The BSE Sensex index closed 0.72 per cent higher at 81,634.81 points after Tuesday's session, compared to 81,050 points at the previous market close.Vaishali Parekh, vice president of technical research at Prabhudas Lilladher, said that the Nifty witnessed a strong pullback to end above the 25,000 zone, bringing little relief to investors. The overall bias is maintained with a cautious approach. Parekh estimates the Nifty 50 Spot index to find support at 24,800 points and face resistance at 25,200 points. The Bank Nifty index will likely move in a range of 50,500 to 51,500 today.For today, Parekh recommended three buy-or-sell stocks: Infosys Ltd, Bombay Dyeing and Manufacturing Co. Ltd, and Tata Chemicals Ltd.On the outlook for the Nifty 50 and the Bank Nifty index, Parekh said, “Nifty after having 6 days losing streak of sessions witnessed a strong pullback to end above the 25,000 zone to bring some sort of relief to the market players but still the overall bias is maintained with a cautious approach.”“The index would need to breach above the 25,450 zone to improve the bias overall with major support positioned near 24,400 level of the important 100 period MA,” said the stock market expert.“Bank Nifty has seen a decent pullback to close above the 51,000 zone with most of the frontline banking stocks picking up from their lows and for the bias to improve overall, it needs to breach above the significant 50EMA of 51,800 levels. The index has the important support near the previous low made at 49,600 level which needs to be sustained as of now to maintain the trend intact,” said Parekh.Parekh said that the Nifty 50 Spot for today has support at 24,800 points, while the resistance lies at 25,200 points. The Bank Nifty index would have a daily range of 50,500 to 51,500.1. Infosys Ltd. (INFY): Buy at  ₹1,945; Target at  ₹2,000; Stop Loss at  ₹1,900.2. Bombay Dyeing and Manufacturing Co. Ltd. (BOMDYEING): Buy at  ₹221; Target at  ₹245; Stop Loss at  ₹205.3. Tata Chemicals Ltd. (TATACHEM): Buy at  ₹1,092; Target at  ₹1,150; Stop Loss at  ₹1,060.","cleaned_content":"buy or sell stocks indias benchmark stock market indices sensex and nifty \u003cFIVE_TEN\u003e witnessed a respite as investors bought into the dip stock market investors now eye the reserve bank of indias rbi monetary policy decision on wednesday october \u003cNINE_\u003e the nifty \u003cFIVE_TEN\u003e index closed \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e points after tuesdays market session compared to \u003cTWO_TEN_THOUSAND\u003e at the previous market close the bse sensex index closed \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e points after tuesdays session compared to \u003cEIGHT_TEN_THOUSAND\u003e points at the previous market close vaishali parekh vice president of technical research at prabhudas lilladher said that the nifty witnessed a strong pullback to end above the \u003cTWO_TEN_THOUSAND\u003e zone bringing little relief to investors the overall bias is maintained with a cautious approach parekh estimates the nifty \u003cFIVE_TEN\u003e spot index to find support at \u003cTWO_TEN_THOUSAND\u003e points and face resistance at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index will likely move in a range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e today for today parekh recommended three buy or sell stocks infosys ltd bombay dyeing and manufacturing co ltd and tata chemicals ltd on the outlook for the nifty \u003cFIVE_TEN\u003e and the bank nifty index parekh said nifty after having \u003cSIX_\u003e days losing streak of sessions witnessed a strong pullback to end above the \u003cTWO_TEN_THOUSAND\u003e zone to bring some sort of relief to the market players but still the overall bias is maintained with a cautious approach the index would need to breach above the \u003cTWO_TEN_THOUSAND\u003e zone to improve the bias overall with major support positioned near \u003cTWO_TEN_THOUSAND\u003e level of the important \u003cONE_HUNDRED\u003e period ma said the stock market expert bank nifty has seen a decent pullback to close above the \u003cFIVE_TEN_THOUSAND\u003e zone with most of the frontline banking stocks picking up from their lows and for the bias to improve overall it needs to breach above the significant \u003cFIVE_TEN\u003e ema of \u003cFIVE_TEN_THOUSAND\u003e levels the index has the important support near the previous low made at \u003cFOUR_TEN_THOUSAND\u003e level which needs to be sustained as of now to maintain the trend intact said parekh parekh said that the nifty \u003cFIVE_TEN\u003e spot for today has support at \u003cTWO_TEN_THOUSAND\u003e points while the resistance lies at \u003cTWO_TEN_THOUSAND\u003e points the bank nifty index would have a daily range of \u003cFIVE_TEN_THOUSAND\u003e to \u003cFIVE_TEN_THOUSAND\u003e infosys ltd infy buy at \u003cONE_THOUSAND\u003e target at \u003cTWO_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e bombay dyeing and manufacturing co ltd bomdyeing buy at \u003cTWO_HUNDRED\u003e target at \u003cTWO_HUNDRED\u003e stop loss at \u003cTWO_HUNDRED\u003e tata chemicals ltd tatachem buy at \u003cONE_THOUSAND\u003e target at \u003cONE_THOUSAND\u003e stop loss at \u003cONE_THOUSAND\u003e","timestamp":"2024-10-09T06:27:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}