{"url":"https://www.livemint.com/market/stock-market-news/hcl-technologies-market-cap-crosses-5-trillion-mark-as-the-share-price-hits-1-year-high-11728631093086.html","title":"HCL Technologies market cap crosses  ₹5 trillion mark as share price hits 1-year high","description":"Stock Market Today: HCL Technologies' market cap touched the  ₹5 trillion ( ₹5 lakh crore ) mark for the first time as the stock hit a one-year high on Friday during the intraday trade.","content":"Stock Market Today: HCL Technologies' market cap touched  ₹5 trillion or  ₹5 lakh crore mark for the first time on Friday, October 11, as the stock hit a one-year high during the intraday trade.HCL Technologies share price opened at  ₹1,800.25 on the BSE, marginally lower than the previous close of  ₹1,810 following IT bellwether Tata Consultancy Services (TCS) Q2FY25 earnings. HCL Technologies share price, however, reversed losses and rose 2% to a one-year or 52-week high of  ₹1,852 during the intraday trade. This helped the market cap of HCL Technologies touch  ₹5 trillion or  ₹5 lakh crore for the first time.The total value of outstanding common shares held by investors in a publicly listed and traded company is known as market capitalisation, also abbreviated as market cap.HCL Technologies share price has risen 23.5% year-to-date and around 47% over the last one year.HCL Technologies has now entered the elite class of companies having a  ₹5 trillion market cap, which includes peers such as TCS and Infosys. While the market cap of TCS is close to  ₹15 trillion, Infosys' market cap stands at  ₹8 trillion.LTIMindtree and Wipro have a market cap of  ₹1.9 trillion and  ₹2.5 trillion, respectively.The expectations remain strong from HCL Technologies' Q2 result performance even though TCS's Q2 performance remained a mixed bag.Analysts at Emkay Global Financial Services are building in a 1.4% sequential dollar-denominated revenue growth after factoring in 70bps cross-currency tailwinds, impacted by the State Street divestment. They expect Earnings Before Interest Tax (EBIT) margins to expand by 90bps sequentially.Things to watch out for remain FY25 outlook. They expect the company to retain its guidance of 3-5% constant currency revenue growth with 18-19% EBIT margins. Impact of furlough in Q3 and possibility of demand uptick in H2, deal wins, deal pipeline and pace of deal closures, growth outlook for ER\u0026D and Software businesses, updates on certain CTG assets acquisition deal with HPE and its financial impact, demand outlook for major verticals like BFSI, Manufacturing, Technology, Communications, Retail, and Healthcare, pricing environment, wage hike, and hiring plan and attrition trends are among key monitorables.(more to come)ly","cleaned_content":"stock market today hcl technologies market cap touched \u003cFIVE_\u003e trillion or \u003cFIVE_\u003e lakh crore mark for the first time on friday october \u003cONE_TEN\u003e as the stock hit a one year high during the intraday trade hcl technologies share price opened at \u003cONE_THOUSAND\u003e on the bse marginally lower than the previous close of \u003cONE_THOUSAND\u003e following it bellwether tata consultancy services tcs q2fy25 earnings hcl technologies share price however reversed losses and rose \u003cTWO_PERCENT\u003e to a one year or \u003cFIVE_TEN\u003e week high of \u003cONE_THOUSAND\u003e during the intraday trade this helped the market cap of hcl technologies touch \u003cFIVE_\u003e trillion or \u003cFIVE_\u003e lakh crore for the first time the total value of outstanding common shares held by investors in a publicly listed and traded company is known as market capitalisation also abbreviated as market cap hcl technologies share price has risen \u003cTWO_TEN_PERCENT\u003e year to date and around \u003cFOUR_TEN_PERCENT\u003e over the last one year hcl technologies has now entered the elite class of companies having a \u003cFIVE_\u003e trillion market cap which includes peers such as tcs and infosys while the market cap of tcs is close to \u003cONE_TEN\u003e trillion infosys market cap stands at \u003cEIGHT_\u003e trillion ltimindtree and wipro have a market cap of \u003cONE_\u003e trillion and \u003cTWO_\u003e trillion respectively the expectations remain strong from hcl technologies q2 result performance even though tcss q2 performance remained a mixed bag analysts at emkay global financial services are building in a \u003cONE_PERCENT\u003e sequential dollar denominated revenue growth after factoring in \u003cSEVEN_TEN\u003e bps cross currency tailwinds impacted by the state street divestment they expect earnings before interest tax ebit margins to expand by \u003cNINE_TEN\u003e bps sequentially things to watch out for remain fy25 outlook they expect the company to retain its guidance of \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e constant currency revenue growth with \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e ebit margins impact of furlough in q3 and possibility of demand uptick in h2 deal wins deal pipeline and pace of deal closures growth outlook for er d and software businesses updates on certain ctg assets acquisition deal with hpe and its financial impact demand outlook for major verticals like bfsi manufacturing technology communications retail and healthcare pricing environment wage hike and hiring plan and attrition trends are among key monitorables more to come ly","timestamp":"2024-10-11T13:15:00+05:30","market_timestamp":"2024-10-11T13:15:00+05:30","off_market_hours":false}