{"url":"https://www.livemint.com/market/stock-market-news/titan-share-price-drops-despite-strong-q2-business-update-should-you-buy-the-tata-group-stock-11728274472134.html","title":"Titan share price drops despite strong Q2 business update. Should you buy the Tata group stock?","description":"Titan stock price has fallen over 6% in one week and over 3% in one month. Titan shares have risen more than 9% in three months, but have fallen a little over 2% year-to-date (YTD).","content":"Titan share price traded over 2% lower on Monday despite the company reported strong business performance for the quarter ended September 2024, exceeding analysts’ expectations. Titan shares opened 2.36% higher at a high of  ₹3,750.00 apiece on BSE, but soon gave up gains on profit booking and were trading over 2% lower.The Tata group firm, Titan Company, reported 25% year-on-year (YoY) growth in Q2FY25 led by higher than expected growth across most business segments. The company added a total of 75 stores (net) during the quarter expanding its combined retail network presence to 3,171 stores.Jewellery domestic operations grew 25% YoY in Q2 after a relatively soft Q1. The non-solitaire studded segment recorded growth in high double-digits whereas the solitaire segment saw a decline amidst price uncertainty and demand supply dynamics in the international markets, both together resulting in overall studded sales growth in low double-digits for the quarter, Titan Company said in its Q1 business update.Watches \u0026 Wearables domestic business grew 19% YoY. Revenue growth in Analog was around 25% YoY well supported by both volume and value growths. EyeCare’s domestic business grew 6% YoY, while in Emerging Businesses, Taneira's revenue grew 11% YoY.“As per its Q2 business update, Titan has exceeded our growth expectations across most business segments. Importantly, jewellery has reported a significant improvement with 26% growth in Q2 vs our 15% expectation and 9% growth in Q1. LTL growth has also inched upwards to the mid-teens vs 3% in Q1, likely triggered by a big 900 bps duty cut. Revenue mix is likely a tad weaker with low-double-digits growth in the high-margin studded segment (vs ~25% overall growth),” said Devanshu Bansal, Research Analyst at Emkay Global Financial Services.However, he believes Titan is comfortably placed to meet its ~12% jewellery EBIT margin guidance in FY25.“Q2 outperformance should address investor concerns around potential moderation in growth for Titan and drive a 4-5% increase in our earnings estimates,” he added.Emkay Global recommended a ‘Buy’ rating on Titan shares with a revised target price of  ₹4,400 per share.Titan stock price has remained muted recently, falling over 6% in one week and over 3% in one month. Titan shares have risen more than 9% in three months, but have fallen a little over 2% year-to-date (YTD). In the past one year period, Titan stock price has gained over 8%.On the technical front, Titan stock is finding support at its 200-day moving average (DMA).“Titan stock has corrected from its classical double top formation at  ₹3,800 - 3,820 levels. The stock is testing support at its 200 DMA at  ₹3,558 level. It has a strong support range of  ₹3,475 -  ₹3,550,” said Milan Vaishnav, founder of ChartWizard FZE and Gemstone Equity Research.Vaishnav recommends traders not to take any fresh positions in Titan shares and suggests investors holding Titan shares to stay invested.“Investors in Titan shares are advised to remain invested and keep a stop loss above  ₹3,475 level. If the stock breaches the support strong level, investors can exit the stock,” Vaishnav said.At 10:00 am, Titan shares were trading 2.11% lower at  ₹3,586.00 apiece on the BSE.","cleaned_content":"titan share price traded over \u003cTWO_PERCENT\u003e lower on monday despite the company reported strong business performance for the quarter ended september \u003cTWO_THOUSAND\u003e exceeding analysts expectations titan shares opened \u003cTWO_PERCENT\u003e higher at a high of \u003cTHREE_THOUSAND\u003e apiece on bse but soon gave up gains on profit booking and were trading over \u003cTWO_PERCENT\u003e lower the tata group firm titan company reported \u003cTWO_TEN_PERCENT\u003e year on year yoy growth in q2fy25 led by higher than expected growth across most business segments the company added a total of \u003cSEVEN_TEN\u003e stores net during the quarter expanding its combined retail network presence to \u003cTHREE_THOUSAND\u003e stores jewellery domestic operations grew \u003cTWO_TEN_PERCENT\u003e yoy in q2 after a relatively soft q1 the non solitaire studded segment recorded growth in high double digits whereas the solitaire segment saw a decline amidst price uncertainty and demand supply dynamics in the international markets both together resulting in overall studded sales growth in low double digits for the quarter titan company said in its q1 business update watches wearables domestic business grew \u003cONE_TEN_PERCENT\u003e yoy revenue growth in analog was around \u003cTWO_TEN_PERCENT\u003e yoy well supported by both volume and value growths eyecare s domestic business grew \u003cSIX_PERCENT\u003e yoy while in emerging businesses taneiras revenue grew \u003cONE_TEN_PERCENT\u003e yoy as per its q2 business update titan has exceeded our growth expectations across most business segments importantly jewellery has reported a significant improvement with \u003cTWO_TEN_PERCENT\u003e growth in q2 vs our \u003cONE_TEN_PERCENT\u003e expectation and \u003cNINE_PERCENT\u003e growth in q1 ltl growth has also inched upwards to the mid teens vs \u003cTHREE_PERCENT\u003e in q1 likely triggered by a big \u003cNINE_HUNDRED\u003e bps duty cut revenue mix is likely a tad weaker with low double digits growth in the high margin studded segment vs \u003cTWO_TEN_PERCENT\u003e overall growth said devanshu bansal research analyst at emkay global financial services however he believes titan is comfortably placed to meet its \u003cONE_TEN_PERCENT\u003e jewellery ebit margin guidance in fy25 q2 outperformance should address investor concerns around potential moderation in growth for titan and drive a \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e increase in our earnings estimates he added emkay global recommended a buy rating on titan shares with a revised target price of \u003cFOUR_THOUSAND\u003e per share titan stock price has remained muted recently falling over \u003cSIX_PERCENT\u003e in one week and over \u003cTHREE_PERCENT\u003e in one month titan shares have risen more than \u003cNINE_PERCENT\u003e in three months but have fallen a little over \u003cTWO_PERCENT\u003e year to date ytd in the past one year period titan stock price has gained over \u003cEIGHT_PERCENT\u003e on the technical front titan stock is finding support at its \u003cTWO_HUNDRED\u003e day moving average dma titan stock has corrected from its classical double top formation at \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e levels the stock is testing support at its \u003cTWO_HUNDRED\u003e dma at \u003cTHREE_THOUSAND\u003e level it has a strong support range of \u003cTHREE_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e said milan vaishnav founder of chartwizard fze and gemstone equity research vaishnav recommends traders not to take any fresh positions in titan shares and suggests investors holding titan shares to stay invested investors in titan shares are advised to remain invested and keep a stop loss above \u003cTHREE_THOUSAND\u003e level if the stock breaches the support strong level investors can exit the stock vaishnav said at \u003cONE_TEN\u003e \u003cZERO_\u003e am titan shares were trading \u003cTWO_PERCENT\u003e lower at \u003cTHREE_THOUSAND\u003e apiece on the bse","timestamp":"2024-10-07T10:02:00+05:30","market_timestamp":"2024-10-07T10:02:00+05:30","off_market_hours":false}