{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-why-midcap-and-smallcap-indices-surged-over-2-each-11728382226963.html","title":"Stock Market Today: Why midcap and smallcap indices surged over 2% each","description":"Broader markets outperformed Indian benchmarks on Tuesday, with Nifty Midcap and Smallcap indices rising over 2%. The Nifty gained 0.88%, aided by positive sentiment and expectations of an RBI rate cut. Paytm and Trienni Turbine were top gainers in their respective indices.","content":"Broader markets outperformed the Indian benchmarks on Tuesday, October 8, with the Nifty Midcap and Nifty Smallcap indices rising over 2 per cent each. In comparison, the benchmark Nifty 50 rose around a per cent in today's deals.The rise in midcaps and smallcaps comes on the back of the overall positive market sentiment and value buying following a sharp drop in Indian equities. Moreover, hopes of a rate cut by the RBI's monetary policy committee (MPC) aided the sentiment. The RBI MPC is slated to announce its decision on Wednesday, October 9.The Nifty Midcap100 index rose 2.16 per cent to settle at 58,535.90 while the Nifty Smallcap100 index advanced 2.05 per cent to end at 18,617.65. In comparison, the benchmark Nifty 50 closed today's session 0.88 per cent higher at 25,013.15. Sensex also added 0.72 per cent to settle at 81,634.81.“The oversold condition played its part well and after a knee-jerk reaction in the opening trade, one-way up-move was seen throughout the day. Except for metals, all the other sectors ended the session in the green with media and auto being the top performers. With a piercing candlestick pattern, mid and smallcaps gained over 2% each and outperformed the frontline index. Nifty 50 ended the streak of bearish candles and formed a strong bullish candle on the daily chart known as Bullish Harami, with a hidden bullish divergence in the RSI, which indicates a potential reversal of a bearish trend. A firm move above 25,140 will confirm the trend reversal while on the downside, 24,950 will serve as immediate support,” said Aditya Gaggar, Director of Progressive Shares.In the Nifty Midcap 100 index, Paytm was the top gainer, rallying over 15 per cent, followed by BSE, HUDCO, RVNL, Dixon Tech, IREDA, Balkrishna Industries, IRB, Solar Industries, and Indian Hotels, up between 5-11 per cent. Only 13 stocks in the index closed in the red today. NMDC emerged as the top loser as it dipped almost 4 per cent. Poonawalla Fincorp, SAIL, Phoenix Mills, IGL, APL Apollo Tubes, and Policy Bazaar also declined between 1-2 per cent.Meanwhile, in the Nifty Smallcap 100 index, Triveni Turbine was the top gainer, surging over 10 per cent followed by GRSE and HFCL, up over 9 per cent and 8 per cent, respectively. Kaynes Tech, CAMS, IndiaMart, Data Patterns, OLA Electric, IRCON, Tejas Net, and Swan Energy also added over 6 per cent each in today's deals. Twelve stocks in the smallcap index closed with cuts. Brigade Enterprises dropped the most, around 3 per cent. NALCO, GoDigit, Blue Star, and Sonata Software also lost over a per cent each.Ajit Mishra, Senior Vice President of Research at Religare Broking Ltd, noted that after six consecutive days of decline, the markets bounced back, gaining nearly 1 per cent. Nifty started flat but gradually rose throughout the day, driven by a recovery in select heavyweight stocks, and closed near the day's high. Sectors such as auto, energy, and pharma led the gains, while broader indices also recovered, advancing over 2 per cent each.Mishra cautioned that although the recovery in key heavyweights could push Nifty further upward, maintaining this momentum may be difficult. He identified an immediate resistance zone for Nifty between 25,150 and 25,300, with a significant hurdle at 25,500. He advised traders to consider using this recovery to reduce positions and be selective with long trades, favouring IT and pharma stocks for their resilience while recommending careful stock selection in other sectors.Most Asian markets declined today, with the exception of Chinese stocks, which surged after returning from the Golden Week holiday, boosted by recent stimulus measures from Beijing. However, this positive momentum did not extend to other Asian markets, as Hong Kong retreated after its recent gains.In the US, Wall Street's major indexes fell around 1 per cent overnight, impacted by rising oil prices and higher Treasury yields. Market sentiment was further weighed down by concerns about the potential impact of the Middle East conflict on oil prices.Investors are now awaiting the release of the Federal Reserve's September meeting minutes on October 9, looking for clues on future rate-cut strategies. Additionally, the upcoming consumer price index (CPI) data on October 10 will be a key factor in shaping the Fed's monetary policy.In India, the focus remains on the upcoming RBI policy decision and September quarter earnings.","cleaned_content":"broader markets outperformed the indian benchmarks on tuesday october \u003cEIGHT_\u003e with the nifty midcap and nifty smallcap indices rising over \u003cTWO_PERCENT\u003e each in comparison the benchmark nifty \u003cFIVE_TEN\u003e rose around a per cent in todays deals the rise in midcaps and smallcaps comes on the back of the overall positive market sentiment and value buying following a sharp drop in indian equities moreover hopes of a rate cut by the rbis monetary policy committee mpc aided the sentiment the rbi mpc is slated to announce its decision on wednesday october \u003cNINE_\u003e the nifty midcap100 index rose \u003cTWO_PERCENT\u003e to settle at \u003cFIVE_TEN_THOUSAND\u003e while the nifty smallcap100 index advanced \u003cTWO_PERCENT\u003e to end at \u003cONE_TEN_THOUSAND\u003e in comparison the benchmark nifty \u003cFIVE_TEN\u003e closed todays session \u003cZERO_PERCENT\u003e higher at \u003cTWO_TEN_THOUSAND\u003e sensex also added \u003cZERO_PERCENT\u003e to settle at \u003cEIGHT_TEN_THOUSAND\u003e the oversold condition played its part well and after a knee jerk reaction in the opening trade one way up move was seen throughout the day except for metals all the other sectors ended the session in the green with media and auto being the top performers with a piercing candlestick pattern mid and smallcaps gained over \u003cTWO_PERCENT\u003e each and outperformed the frontline index nifty \u003cFIVE_TEN\u003e ended the streak of bearish candles and formed a strong bullish candle on the daily chart known as bullish harami with a hidden bullish divergence in the rsi which indicates a potential reversal of a bearish trend a firm move above \u003cTWO_TEN_THOUSAND\u003e will confirm the trend reversal while on the downside \u003cTWO_TEN_THOUSAND\u003e will serve as immediate support said aditya gaggar director of progressive shares in the nifty midcap \u003cONE_HUNDRED\u003e index paytm was the top gainer rallying over \u003cONE_TEN_PERCENT\u003e followed by bse hudco rvnl dixon tech ireda balkrishna industries irb solar industries and indian hotels up between \u003cFIVE_\u003e \u003cONE_TEN_PERCENT\u003e only \u003cONE_TEN\u003e stocks in the index closed in the red today nmdc emerged as the top loser as it dipped almost \u003cFOUR_PERCENT\u003e poonawalla fincorp sail phoenix mills igl apl apollo tubes and policy bazaar also declined between \u003cONE_\u003e \u003cTWO_PERCENT\u003e meanwhile in the nifty smallcap \u003cONE_HUNDRED\u003e index triveni turbine was the top gainer surging over \u003cONE_TEN_PERCENT\u003e followed by grse and hfcl up over \u003cNINE_PERCENT\u003e and \u003cEIGHT_PERCENT\u003e respectively kaynes tech cams indiamart data patterns ola electric ircon tejas net and swan energy also added over \u003cSIX_PERCENT\u003e each in todays deals twelve stocks in the smallcap index closed with cuts brigade enterprises dropped the most around \u003cTHREE_PERCENT\u003e nalco godigit blue star and sonata software also lost over a per cent each ajit mishra senior vice president of research at religare broking ltd noted that after six consecutive days of decline the markets bounced back gaining nearly \u003cONE_PERCENT\u003e nifty started flat but gradually rose throughout the day driven by a recovery in select heavyweight stocks and closed near the days high sectors such as auto energy and pharma led the gains while broader indices also recovered advancing over \u003cTWO_PERCENT\u003e each mishra cautioned that although the recovery in key heavyweights could push nifty further upward maintaining this momentum may be difficult he identified an immediate resistance zone for nifty between \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with a significant hurdle at \u003cTWO_TEN_THOUSAND\u003e he advised traders to consider using this recovery to reduce positions and be selective with long trades favouring it and pharma stocks for their resilience while recommending careful stock selection in other sectors most asian markets declined today with the exception of chinese stocks which surged after returning from the golden week holiday boosted by recent stimulus measures from beijing however this positive momentum did not extend to other asian markets as hong kong retreated after its recent gains in the us wall streets major indexes fell around \u003cONE_PERCENT\u003e overnight impacted by rising oil prices and higher treasury yields market sentiment was further weighed down by concerns about the potential impact of the middle east conflict on oil prices investors are now awaiting the release of the federal reserves september meeting minutes on october \u003cNINE_\u003e looking for clues on future rate cut strategies additionally the upcoming consumer price index cpi data on october \u003cONE_TEN\u003e will be a key factor in shaping the feds monetary policy in india the focus remains on the upcoming rbi policy decision and september quarter earnings","timestamp":"2024-10-08T17:06:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}