{"url":"https://www.livemint.com/market/stock-market-news/multibagger-stock-sudarshan-chemical-surges-20-hits-52-week-high-on-rs-1-180-crore-acquisition-11728642537926.html","title":"Multibagger stock Sudarshan Chemical surges 20%, hits 52-week high on  ₹1,180 crore acquisition","description":"Sudarshan Chemical Industries' shares surged 20% to a 52-week high after announcing the acquisition of Heubach Group's global pigment business for €127.5 million. The all-cash deal is expected to close in 3-4 months, pending regulatory and shareholder approvals.","content":"Shares of Sudarshan Chemical Industries rallied 20 per cent on Friday, October 11 to their 52-week high after the company announced the acquisition of the global pigment business of Germany’s Heubach Group.The company in an exchange filing today said, “... Sudarshan Chemical Industries Limited has entered into a definitive agreement on 11th October 2024, whereby Sudarshan Europe BV, wholly-owned subsidiary of the company in Netherlands (“SEBV Europe”) shall acquire Global Pigment Business Operations of the Heubach Group of Germany for a total consideration of Euro 127.5 Million (Approx.  ₹1,180 crore).”Heubach is a key player within the speciality chemicals industry. It manufactures organic pigments, inorganic pigments, dyes, dispersions and anti-corrosion pigments.The proposed translation is an all-cash deal for 100 per cent investment in companies of the Heubach Group.The acquisition is expected to close in 3-4 months, subject to the satisfaction of customary closing conditions, including approvals from regulators and the company’s shareholders.Heubach Group has a history that spans over a period of 200 years. In 2022, the company became the second-largest pigment player in the world by acquiring Clariant’s BU Pigments.Heubach reported billion euros in revenue in FY21 and FY22. The company has a strong global footprint, especially in Europe, the Americas, and the Asia Pacific region.Following the announcement, the stock surged 19.99 per cent to  ₹1,216.55 on the BSE. It closed the day on a strong note, up 19.11 per cent at  ₹1,207.50 apiece.From its 52-week low of  ₹440, the stock has rallied 174 per cent. In the past one year, the stock has risen 144 per cent, giving multibagger returns to investors, while it is up 17.5 per cent in the last one month.According to Trendlyne data, the consensus recommendation from nine analysts for Sudarshan Chemical Industries is BUY.","cleaned_content":"shares of sudarshan chemical industries rallied \u003cTWO_TEN_PERCENT\u003e on friday october \u003cONE_TEN\u003e to their \u003cFIVE_TEN\u003e week high after the company announced the acquisition of the global pigment business of germany s heubach group the company in an exchange filing today said sudarshan chemical industries limited has entered into a definitive agreement on \u003cONE_TEN\u003e th october \u003cTWO_THOUSAND\u003e whereby sudarshan europe bv wholly owned subsidiary of the company in netherlands sebv europe shall acquire global pigment business operations of the heubach group of germany for a total consideration of euro \u003cONE_HUNDRED\u003e million approx \u003cONE_THOUSAND\u003e crore heubach is a key player within the speciality chemicals industry it manufactures organic pigments inorganic pigments dyes dispersions and anti corrosion pigments the proposed translation is an all cash deal for \u003cONE_HUNDRED_PERCENT\u003e investment in companies of the heubach group the acquisition is expected to close in \u003cTHREE_\u003e \u003cFOUR_\u003e months subject to the satisfaction of customary closing conditions including approvals from regulators and the company s shareholders heubach group has a history that spans over a period of \u003cTWO_HUNDRED\u003e years in \u003cTWO_THOUSAND\u003e the company became the second largest pigment player in the world by acquiring clariant s bu pigments heubach reported billion euros in revenue in fy21 and fy22 the company has a strong global footprint especially in europe the americas and the asia pacific region following the announcement the stock surged \u003cONE_TEN_PERCENT\u003e to \u003cONE_THOUSAND\u003e on the bse it closed the day on a strong note up \u003cONE_TEN_PERCENT\u003e at \u003cONE_THOUSAND\u003e apiece from its \u003cFIVE_TEN\u003e week low of \u003cFOUR_HUNDRED\u003e the stock has rallied \u003cONE_HUNDRED_PERCENT\u003e in the past one year the stock has risen \u003cONE_HUNDRED_PERCENT\u003e giving multibagger returns to investors while it is up \u003cONE_TEN_PERCENT\u003e in the last one month according to trendlyne data the consensus recommendation from nine analysts for sudarshan chemical industries is buy","timestamp":"2024-10-11T16:05:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}