{"url":"https://www.livemint.com/market/stock-market-news/samvardhana-motherson-rallies-over-100-in-cy24-clocks-biggest-yearly-gain-in-a-decade-11728632995013.html","title":"Samvardhana Motherson rallies over 100% in CY24, clocks biggest yearly gain in a decade","description":"Samvardhana Motherson International has seen a 106% increase in its stock this year, driven by EV shifts and strategic acquisitions. With a goal of $36 billion in revenues by 2025, the company is well-positioned in a growing Indian auto component sector, backed by a strong order book.","content":"Shares of Samvardhana Motherson International (SAMIL), the flagship company of the Samvardhana Motherson Group, have made remarkable strides on Dalal Street this year, setting new records and surpassing significant milestones. This impressive performance has translated into substantial returns for shareholders. So far this year, the company’s shares have surged from  ₹103 to  ₹212.85, delivering an impressive gain of 106%. This is the stock’s strongest annual performance since 2014 when it recorded a 150% gain.Currently, it ranks as the second-best performing stock in the Nifty Next 50 index. After a period of sideways movement from February 2022 to March 2023, during which the stock lost 45% of its value due to global supply-side issues, it rebounded in April 2023. Since then, it has maintained a steady upward trajectory, gaining a remarkable 217% to date.Samvardhana Motherson is one of the world’s specialised engineering and manufacturing firms, providing solutions to OEMs. It has diversified to support customers in non-automotive sectors, including technology and industrial solutions, health and medical, aerospace, and logistics. SAMIL ranks among the top 15 automotive suppliers globally. It recently raised  ₹6,437 crore through a qualified institutional placement.The company is currently executing its sixth five-year plan, Vision 2025, with ambitious objectives aimed at significant growth and diversification. This plan targets gross revenues of $36 billion by the fiscal year ending March 31, 2025, with a 40% return on capital employed on a consolidated basis.A key element of this strategy is the “3CX10” approach, designed to ensure that no single country, customer, or component exceeds 10% of total revenue, promoting a balanced and resilient business model.Additionally, the company aims to diversify its revenue streams so that 75% is derived from the automotive industry and 25% from new divisions. The plan also includes distributing up to 40% of consolidated profits as dividends to shareholders.In 2024, the company acquired AD Industries and Irillic, both focusing on aerospace and health, while also forming a strategic partnership with BIEL Crystal in the consumer electronics sector. These initiatives aim to diversify the business into non-automotive segments. Since September 2022, the company has completed 16 strategic acquisitions, as per its FY24 annual report.Domestic brokerage firm Motilal Oswal expects a revenue growth of 22% year-on-year (YoY) in Q2FY25 for SAMIL, driven by the execution of a healthy order book and contributions from recent acquisitions. However, it forecasts a sequential contraction of 20 basis points in the EBITDA margin, bringing it down to 9.4% due to seasonal impacts.Overall, the brokerage anticipates earnings to witness a 2.1x increase on a YoY basis, primarily attributable to the contributions from these acquisitions. It has a 'buy' call on the stock with a target price of  ₹240 per share.Analysts have been constructive about the company’s prospects, citing its strong management capabilities, strategic acquisitions, pending orders, and increasing content. The order book remains robust at $84 billion as of March 2024, with EVs comprising 23%.According to experts, the Indian domestic auto component industry is well-positioned for sustainable long-term growth as multiple favourable factors converge. The industry is benefiting from global OEMs' supply chain de-risking strategies in response to disruptions over the past few years, which enhances its role as a reliable supplier.Additionally, it continues to outperform the broader auto sector due to rising content from premiumisation and the shift to electric vehicles (EVs). Government policies advocating 'Make In India' further support this growth, along with India’s emergence as a key auto hub for global manufacturers. These tailwinds collectively create a strong growth opportunity for the industry.","cleaned_content":"shares of samvardhana motherson international samil the flagship company of the samvardhana motherson group have made remarkable strides on dalal street this year setting new records and surpassing significant milestones this impressive performance has translated into substantial returns for shareholders so far this year the company s shares have surged from \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e delivering an impressive gain of \u003cONE_HUNDRED_PERCENT\u003e this is the stock s strongest annual performance since \u003cTWO_THOUSAND\u003e when it recorded a \u003cONE_HUNDRED_PERCENT\u003e gain currently it ranks as the second best performing stock in the nifty next \u003cFIVE_TEN\u003e index after a period of sideways movement from february \u003cTWO_THOUSAND\u003e to march \u003cTWO_THOUSAND\u003e during which the stock lost \u003cFOUR_TEN_PERCENT\u003e of its value due to global supply side issues it rebounded in april \u003cTWO_THOUSAND\u003e since then it has maintained a steady upward trajectory gaining a remarkable \u003cTWO_HUNDRED_PERCENT\u003e to date samvardhana motherson is one of the world s specialised engineering and manufacturing firms providing solutions to oems it has diversified to support customers in non automotive sectors including technology and industrial solutions health and medical aerospace and logistics samil ranks among the top \u003cONE_TEN\u003e automotive suppliers globally it recently raised \u003cSIX_THOUSAND\u003e crore through a qualified institutional placement the company is currently executing its sixth five year plan vision \u003cTWO_THOUSAND\u003e with ambitious objectives aimed at significant growth and diversification this plan targets gross revenues of \u003cTHREE_TEN\u003e billion by the fiscal year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e with a \u003cFOUR_TEN_PERCENT\u003e return on capital employed on a consolidated basis a key element of this strategy is the \u003cTHREE_\u003e cx10 approach designed to ensure that no single country customer or component exceeds \u003cONE_TEN_PERCENT\u003e of total revenue promoting a balanced and resilient business model additionally the company aims to diversify its revenue streams so that \u003cSEVEN_TEN_PERCENT\u003e is derived from the automotive industry and \u003cTWO_TEN_PERCENT\u003e from new divisions the plan also includes distributing up to \u003cFOUR_TEN_PERCENT\u003e of consolidated profits as dividends to shareholders in \u003cTWO_THOUSAND\u003e the company acquired ad industries and irillic both focusing on aerospace and health while also forming a strategic partnership with biel crystal in the consumer electronics sector these initiatives aim to diversify the business into non automotive segments since september \u003cTWO_THOUSAND\u003e the company has completed \u003cONE_TEN\u003e strategic acquisitions as per its fy24 annual report domestic brokerage firm motilal oswal expects a revenue growth of \u003cTWO_TEN_PERCENT\u003e year on year yoy in q2fy25 for samil driven by the execution of a healthy order book and contributions from recent acquisitions however it forecasts a sequential contraction of \u003cTWO_TEN\u003e basis points in the ebitda margin bringing it down to \u003cNINE_PERCENT\u003e due to seasonal impacts overall the brokerage anticipates earnings to witness a \u003cTWO_\u003e x increase on a yoy basis primarily attributable to the contributions from these acquisitions it has a buy call on the stock with a target price of \u003cTWO_HUNDRED\u003e per share analysts have been constructive about the company s prospects citing its strong management capabilities strategic acquisitions pending orders and increasing content the order book remains robust at \u003cEIGHT_TEN\u003e billion as of march \u003cTWO_THOUSAND\u003e with evs comprising \u003cTWO_TEN_PERCENT\u003e according to experts the indian domestic auto component industry is well positioned for sustainable long term growth as multiple favourable factors converge the industry is benefiting from global oems supply chain de risking strategies in response to disruptions over the past few years which enhances its role as a reliable supplier additionally it continues to outperform the broader auto sector due to rising content from premiumisation and the shift to electric vehicles evs government policies advocating make in india further support this growth along with india s emergence as a key auto hub for global manufacturers these tailwinds collectively create a strong growth opportunity for the industry","timestamp":"2024-10-11T13:58:00+05:30","market_timestamp":"2024-10-11T13:58:00+05:30","off_market_hours":false}