{"url":"https://www.livemint.com/market/stock-market-news/israel-iran-war-leads-bpcl-hpcl-iocl-share-prices-to-see-further-decline-ongc-share-price-adds-to-gains-11728013241193.html","title":"Israel-Iran war drives BPCL, HPCL, IOCL share price further down; ONGC shares extend gains","description":"Stock Market Today: The ongoing Israel-Iran conflict has pushed Brent crude oil prices higher, leading to a further decline in OMCs' share price. BPCL, HPCL, and IOC share prices declined. Meanwhile, oil producers like ONGC benefitted from the surge in oil prices.","content":"Stock Market Today: The Israel-Iran war has driven Brent crude oil prices higher to $77 a barrel, resulting in a further decline in the stocks of oil marketing companies (OMCs). Bharat Petroleum Corporation Ltd (BPCL), Hindustan Petroleum Corporation Ltd (HPCL), and Indian Oil Corporation Ltd (IOCL) saw their share prices decline further on Friday, 4 October. At the same time, oil producers such as Oil and Natural Gas Corporation (ONGC) share price added to gains, emerging as one of the largest gainers in the Nifty50 pack of stocks. BPCL, however, was among the largest losers.Brent crude prices, which had risen to around $75 a barrel on Thursday from nearly $70 a barrel a day earlier, further climbed to the $77 a barrel mark by Friday.Bharat Petroleum Corporation share price declined further 3% today after falling over 5% on Thursday.Meanwhile, Hindustan Petroleum Corporation share price, which had seen a sharper decline of close to 7% on Thursday, corrected another 5% in morning trades on Friday. Hindustan Petroleum Corporation stock is facing higher pressure than peers as it has a larger proportion of auto fuel retail sales in its portfolio compared to Bharat Petroleum Corporation and Indian Oil Corporation.Indian Oil Corporation share price after correcting over 4% on Thursday further declined another 3% in Friday's morning trade.Rising crude prices raise concerns about the marketing margins of OMCs, leading to a fall in their share prices. Oil \u0026 gas producers like Oil and Natural Gas Corporation, however, generally benefit from higher oil prices.ONGC share price gained over 2% in the morning trades on Friday.(more to come)","cleaned_content":"stock market today the israel iran war has driven brent crude oil prices higher to \u003cSEVEN_TEN\u003e a barrel resulting in a further decline in the stocks of oil marketing companies omcs bharat petroleum corporation ltd bpcl hindustan petroleum corporation ltd hpcl and indian oil corporation ltd iocl saw their share prices decline further on friday \u003cFOUR_\u003e october at the same time oil producers such as oil and natural gas corporation ongc share price added to gains emerging as one of the largest gainers in the nifty50 pack of stocks bpcl however was among the largest losers brent crude prices which had risen to around \u003cSEVEN_TEN\u003e a barrel on thursday from nearly \u003cSEVEN_TEN\u003e a barrel a day earlier further climbed to the \u003cSEVEN_TEN\u003e a barrel mark by friday bharat petroleum corporation share price declined further \u003cTHREE_PERCENT\u003e today after falling over \u003cFIVE_PERCENT\u003e on thursday meanwhile hindustan petroleum corporation share price which had seen a sharper decline of close to \u003cSEVEN_PERCENT\u003e on thursday corrected another \u003cFIVE_PERCENT\u003e in morning trades on friday hindustan petroleum corporation stock is facing higher pressure than peers as it has a larger proportion of auto fuel retail sales in its portfolio compared to bharat petroleum corporation and indian oil corporation indian oil corporation share price after correcting over \u003cFOUR_PERCENT\u003e on thursday further declined another \u003cTHREE_PERCENT\u003e in fridays morning trade rising crude prices raise concerns about the marketing margins of omcs leading to a fall in their share prices oil gas producers like oil and natural gas corporation however generally benefit from higher oil prices ongc share price gained over \u003cTWO_PERCENT\u003e in the morning trades on friday more to come","timestamp":"2024-10-04T09:36:00+05:30","market_timestamp":"2024-10-04T09:36:00+05:30","off_market_hours":false}