{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-nifty-50-sensex-end-with-minor-losses-pharma-metals-surge-11728640132331.html","title":"Stock market today: Nifty 50, Sensex end with minor losses; pharma, metals surge","description":"The Nifty 50 closed the session with a drop of 0.14%, finishing below the 25,000 for the third straight day at 24,964. Similarly, the Sensex ended the day with a 0.28% drop, closing at 81,381.","content":"Stock market today: Indian market ended Friday's session lower, weighed down by auto and banking stocks. Although pharma and metal stocks provided some support, it was insufficient to lift the indices higher. Consequently, the Nifty 50 closed the session with a drop of 0.14%, finishing below the 25,000 for the third straight day at 24,964. Similarly, the Sensex ended the day with a 0.28% drop at 81,381.Among the sectoral indices, the Nifty Pharma index closed the trading session with a gain of 1.19%, followed by the Nifty Metal index, which saw an increase of 0.94%. The Nifty IT index also finished on a positive note, rising 0.60%. In contrast, the Nifty Bank index fell 0.70%, reversing its strong performance from Thursday. Additionally, the Nifty Realty index experienced pressure, ending the session with a decline of 0.69%.In terms of individual stocks, Mahindra \u0026 Mahindra, TCS, ICICI Bank, Cipla, Maruti Suzuki India, Power Grid Corporation, Adani Enterprises, and Axis Bank all ended with over 1% drop. Conversely, shares of Trent, Hindalco Industries, HCL Technologies, Tech Mahindra, and Oil and Natural Gas Corporation all recorded gains of up to 2.4%.Commenting on today's market performance, Vinod Nair, Head of Research, at Geojit Financial Services, said \"The market traded sideways due to a lack of fresh triggers for decisive momentum. The uptick in the US 10-year yield due to the unexpected rise in US core inflation and caution ahead of the result season added layers of sentiment in the market. The ongoing geopolitical challenges influenced FIIs to shift their focus towards the affordable markets, which is impacting the domestic market liquidity.\"For the week, both the Nifty 50 and the Sensex closed in the red, registering losses of 0.20% and 0.40% respectively. Concerns over the Middle East conflict, ongoing foreign portfolio investor (FPI) outflows, worries about a potential moderation in earnings, and elevated valuations collectively impacted investor sentiment.The Nifty 50 has corrected by 3.28% in October, which is the largest monthly drop since December 2022. From its recent peak of 26,277 points, the index has experienced a nearly 5.34% decline. Similarly, the Sensex has also fallen 5% from its recent peak of 85,978 points and is down 3.46% so far this month.Meanwhile, small and mid-cap stocks rebounded after experiencing their worst weekly performance last week since March 2024. The Nifty Midcap 100 index ended this week with a gain of 1.26%, closing at 59,212. Similarly, the Nifty Smallcap 100 index finished the week up 1.13%, reclaiming the 19,000 level and reaching 19,008.The Indian rupee fell below 84 against the US dollar for the first time today, weighed down by concerns over the recent jump in oil prices and the exodus of foreign money from the equity markets.The local currency dropped to a low of 84.0525 to the dollar and was last quoted at 84.05, down from 83.9675 in the previous session. The rupee surpassed the previous lifetime low of 83.9850 hit on September 12.“The Rupee continues to trade within a defined range, with global headwinds keeping the pressure on. Despite these challenges, the rupee’s downside appears limited, supported by the RBI’s sizable reserves. Additionally, the recent rise in metals—known for their negative correlation with the dollar index—is expected to benefit emerging market currencies,” said Amit Pabari, MD, CR Forex Advisors.Fresh data issued on Thursday raised investors’ fears that inflation in the U.S. wasn’t cooling off quickly enough. September’s consumer price index rose 0.2% every month and 2.4% on an annual basis, with both figures being slightly higher than estimated by economists polled by Reuters.The core figure, which excludes volatile food and energy prices, rose 3.3% year-over-year, versus an estimate of 3.2%. Additionally, the U.S. Labor Department reported a surge in jobless claims, which rose by 33,000 to reach 258,000 for the week ended October 3. This marks the highest level since August 5, 2023, and significantly higher than the expected 229,000.The hotter-than-expected inflation and a softening labour market amplified the debate over whether the Federal Reserve will opt for a smaller rate cut next month or even a pause.Atlanta Fed President Raphael Bostic also said on Thursday he would consider holding rates steady at the November meeting depending on economic conditions. Meanwhile, the US economy added 254K jobs in September 2024, much higher than an upwardly revised figure of 159K in August, and well above forecasts of 140K. It is the strongest job growth in six months and higher than the average monthly gain of 203K over the prior 12 months.The Fed started lowering borrowing costs in September with an outsize 50-basis-point reduction given what had been continued inflation progress as well as a string of weak labour-market data. Minutes from the recent meeting highlighted a robust discussion on the magnitude of the cut, with officials expressing a preference for a gradual approach moving forward. Investors now look ahead to producer inflation data on Friday to gain more insights on price trends.","cleaned_content":"stock market today indian market ended fridays session lower weighed down by auto and banking stocks although pharma and metal stocks provided some support it was insufficient to lift the indices higher consequently the nifty \u003cFIVE_TEN\u003e closed the session with a drop of \u003cZERO_PERCENT\u003e finishing below the \u003cTWO_TEN_THOUSAND\u003e for the third straight day at \u003cTWO_TEN_THOUSAND\u003e similarly the sensex ended the day with a \u003cZERO_PERCENT\u003e drop at \u003cEIGHT_TEN_THOUSAND\u003e among the sectoral indices the nifty pharma index closed the trading session with a gain of \u003cONE_PERCENT\u003e followed by the nifty metal index which saw an increase of \u003cZERO_PERCENT\u003e the nifty it index also finished on a positive note rising \u003cZERO_PERCENT\u003e in contrast the nifty bank index fell \u003cZERO_PERCENT\u003e reversing its strong performance from thursday additionally the nifty realty index experienced pressure ending the session with a decline of \u003cZERO_PERCENT\u003e in terms of individual stocks mahindra mahindra tcs icici bank cipla maruti suzuki india power grid corporation adani enterprises and axis bank all ended with over \u003cONE_PERCENT\u003e drop conversely shares of trent hindalco industries hcl technologies tech mahindra and oil and natural gas corporation all recorded gains of up to \u003cTWO_PERCENT\u003e commenting on todays market performance vinod nair head of research at geojit financial services said the market traded sideways due to a lack of fresh triggers for decisive momentum the uptick in the us \u003cONE_TEN\u003e year yield due to the unexpected rise in us core inflation and caution ahead of the result season added layers of sentiment in the market the ongoing geopolitical challenges influenced fiis to shift their focus towards the affordable markets which is impacting the domestic market liquidity for the week both the nifty \u003cFIVE_TEN\u003e and the sensex closed in the red registering losses of \u003cZERO_PERCENT\u003e and \u003cZERO_PERCENT\u003e respectively concerns over the middle east conflict ongoing foreign portfolio investor fpi outflows worries about a potential moderation in earnings and elevated valuations collectively impacted investor sentiment the nifty \u003cFIVE_TEN\u003e has corrected by \u003cTHREE_PERCENT\u003e in october which is the largest monthly drop since december \u003cTWO_THOUSAND\u003e from its recent peak of \u003cTWO_TEN_THOUSAND\u003e points the index has experienced a nearly \u003cFIVE_PERCENT\u003e decline similarly the sensex has also fallen \u003cFIVE_PERCENT\u003e from its recent peak of \u003cEIGHT_TEN_THOUSAND\u003e points and is down \u003cTHREE_PERCENT\u003e so far this month meanwhile small and mid cap stocks rebounded after experiencing their worst weekly performance last week since march \u003cTWO_THOUSAND\u003e the nifty midcap \u003cONE_HUNDRED\u003e index ended this week with a gain of \u003cONE_PERCENT\u003e closing at \u003cFIVE_TEN_THOUSAND\u003e similarly the nifty smallcap \u003cONE_HUNDRED\u003e index finished the week up \u003cONE_PERCENT\u003e reclaiming the \u003cONE_TEN_THOUSAND\u003e level and reaching \u003cONE_TEN_THOUSAND\u003e the indian rupee fell below \u003cEIGHT_TEN\u003e against the us dollar for the first time today weighed down by concerns over the recent jump in oil prices and the exodus of foreign money from the equity markets the local currency dropped to a low of \u003cEIGHT_TEN\u003e to the dollar and was last quoted at \u003cEIGHT_TEN\u003e down from \u003cEIGHT_TEN\u003e in the previous session the rupee surpassed the previous lifetime low of \u003cEIGHT_TEN\u003e hit on september \u003cONE_TEN\u003e the rupee continues to trade within a defined range with global headwinds keeping the pressure on despite these challenges the rupee s downside appears limited supported by the rbi s sizable reserves additionally the recent rise in metals known for their negative correlation with the dollar index is expected to benefit emerging market currencies said amit pabari md cr forex advisors fresh data issued on thursday raised investors fears that inflation in the u s wasn t cooling off quickly enough september s consumer price index rose \u003cZERO_PERCENT\u003e every month and \u003cTWO_PERCENT\u003e on an annual basis with both figures being slightly higher than estimated by economists polled by reuters the core figure which excludes volatile food and energy prices rose \u003cTHREE_PERCENT\u003e year over year versus an estimate of \u003cTHREE_PERCENT\u003e additionally the u s labor department reported a surge in jobless claims which rose by \u003cTHREE_TEN_THOUSAND\u003e to reach \u003cTWO_HUNDRED_THOUSAND\u003e for the week ended october \u003cTHREE_\u003e this marks the highest level since august \u003cFIVE_\u003e \u003cTWO_THOUSAND\u003e and significantly higher than the expected \u003cTWO_HUNDRED_THOUSAND\u003e the hotter than expected inflation and a softening labour market amplified the debate over whether the federal reserve will opt for a smaller rate cut next month or even a pause atlanta fed president raphael bostic also said on thursday he would consider holding rates steady at the november meeting depending on economic conditions meanwhile the us economy added \u003cTWO_HUNDRED\u003e k jobs in september \u003cTWO_THOUSAND\u003e much higher than an upwardly revised figure of \u003cONE_HUNDRED\u003e k in august and well above forecasts of \u003cONE_HUNDRED\u003e k it is the strongest job growth in six months and higher than the average monthly gain of \u003cTWO_HUNDRED\u003e k over the prior \u003cONE_TEN\u003e months the fed started lowering borrowing costs in september with an outsize \u003cFIVE_TEN\u003e basis point reduction given what had been continued inflation progress as well as a string of weak labour market data minutes from the recent meeting highlighted a robust discussion on the magnitude of the cut with officials expressing a preference for a gradual approach moving forward investors now look ahead to producer inflation data on friday to gain more insights on price trends","timestamp":"2024-10-11T15:43:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}