{"url":"https://www.livemint.com/market/stock-market-news/easy-trip-planners-board-to-consider-bonus-issue-on-october-14-stock-rises-over-4-11728467649892.html","title":"Easy Trip Planners board to consider bonus issue on October 14; stock rises over 4%","description":"Easy Trip Planners' shares rose over 4% on October 9 after announcing a board meeting on October 14 to discuss issuing bonus shares. The stock reached the day's high of  ₹34.57 but remains 36% below its record high.","content":"Shares of Easy Trip Planners rose over 4 per cent in intra-day deals on Wednesday, October 9 after the company announced that its board is likely to consider bonus share issue in a meeting on October 14.\"Pursuant to Regulation 29 and other applicable Regulations, if any, of the Securities and Exchange Board of India (Listing Obligations and Disclosure Requirements) Regulations, 2015, we wish to inform that a meeting of Board of Directors of the Company is scheduled to be held on Monday, October 14, 2024 at 01:00 P.M. through video conferencing, inter alia, to consider and approve the issue of bonus shares,\" it said in an exchange filing.Bonus shares are additional shares that a company issues to its existing shareholders at no extra cost, based on the number of shares they already own. These shares are distributed in a specific ratio, such as 1:2, meaning shareholders receive one additional share for every two they hold. Bonus shares are issued from the company’s retained earnings or reserves, helping to boost liquidity without altering ownership structure. While they don’t provide new capital to the company, they increase the total number of shares outstanding, often improving share price affordability and enhancing trading activity.The stock rose as much as 4.85 per cent to the day's high of  ₹34.57. Post today's rise, the stock is now 36 per cent away from its record high of  ₹54, hit in February 2024. Meanwhile, it is up 9 per cent from its 52-week low of  ₹31.71, recorded earlier this week.The scrip has lost over 19 per cent in the last 1 year and over 14 per cent on a year-to-date (YTD) basis. The stock is flat, up half a per cent in October so far after two straight months of losses. It shed over 14 per cent in September and 4 per cent in August.","cleaned_content":"shares of easy trip planners rose over \u003cFOUR_PERCENT\u003e in intra day deals on wednesday october \u003cNINE_\u003e after the company announced that its board is likely to consider bonus share issue in a meeting on october \u003cONE_TEN\u003e pursuant to regulation \u003cTWO_TEN\u003e and other applicable regulations if any of the securities and exchange board of india listing obligations and disclosure requirements regulations \u003cTWO_THOUSAND\u003e we wish to inform that a meeting of board of directors of the company is scheduled to be held on monday october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cONE_\u003e \u003cZERO_\u003e p m through video conferencing inter alia to consider and approve the issue of bonus shares it said in an exchange filing bonus shares are additional shares that a company issues to its existing shareholders at no extra cost based on the number of shares they already own these shares are distributed in a specific ratio such as \u003cONE_\u003e \u003cTWO_\u003e meaning shareholders receive one additional share for every two they hold bonus shares are issued from the company s retained earnings or reserves helping to boost liquidity without altering ownership structure while they don t provide new capital to the company they increase the total number of shares outstanding often improving share price affordability and enhancing trading activity the stock rose as much as \u003cFOUR_PERCENT\u003e to the days high of \u003cTHREE_TEN\u003e post todays rise the stock is now \u003cTHREE_TEN_PERCENT\u003e away from its record high of \u003cFIVE_TEN\u003e hit in february \u003cTWO_THOUSAND\u003e meanwhile it is up \u003cNINE_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cTHREE_TEN\u003e recorded earlier this week the scrip has lost over \u003cONE_TEN_PERCENT\u003e in the last \u003cONE_\u003e year and over \u003cONE_TEN_PERCENT\u003e on a year to date ytd basis the stock is flat up half a per cent in october so far after two straight months of losses it shed over \u003cONE_TEN_PERCENT\u003e in september and \u003cFOUR_PERCENT\u003e in august","timestamp":"2024-10-09T16:02:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}