{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-hcl-tech-tech-mahindra-over-200-stocks-hit-1-year-highs-on-bse-as-sensex-swings-back-to-black-11728554322051.html","title":"Stock market today: Over 200 stocks hit 1-year highs on BSE as Sensex swings back to black","description":"Stock market today: 209 stocks, such as HCL Tech, Tech Mahindra, and Torrent Pharmaceuticals, reached fresh one-year highs during intraday trade on the BSE.","content":"Stock market today: As many as 209 stocks, including HCL Tech, Tech Mahindra, Coforge, Dixon Technologies and Torrent Pharmaceuticals, hit their fresh one-year highs in intraday trade on the BSE on Thursday, October 10.Stocks such as CG Power and Industrial Solutions, Gujarat Fluorochemicals, Ipca Laboratories, Glenmark Pharma, Dr. Lal PathLabs, Metropolis Healthcare, Hitachi Energy India, Page Industries and Polycab India were also among those rising to their 52-week highs.Mixed global cues ahead of the US CPI inflation data, coupled with caution surrounding the start of Q2 earnings for India Inc., kept the market trading within a narrow range.Equity benchmarks, the Sensex and the Nifty 50, managed to close with mild gains, thanks to shares of select banking and automobile heavyweights such as HDFC Bank, Kotak Mahindra Bank, Axis Bank, Mahindra and Mahindra and Maruti Suzuki.However, losses in stocks such as Infosys, Sun Pharma, Larsen \u0026 Toubro and Reliance Industries capped the gains.Sensex closed 144 points, or 0.18 per cent, higher at 81,611.41, while the Nifty 50 settled 17 points, or 0.07 per cent, up at 24,998.45.The BSE Midcap index underperformed as it fell 0.36 per cent. On the other hand, the BSE Smallcap index rose 0.43 per cent.Banking stocks, especially private banks, stole the limelight today. The Nifty Bank index rose 1 per cent, and the Nifty Private Bank index rose as much as 1.6 per cent.On the other hand, the Nifty Pharma index fell 2 per cent, while the Nifty IT index dropped 1.25 per cent.IT bellwether TCS will report its September quarter scorecard today. Apart from the numbers, the market's focus will be on management commentary on the demand outlook in key markets in the West.\"The market traded on a rangebound trend with a negative bias ahead of the start of Q2 result. The Asian market started well but could not hold on to the gains as European markets waved on a negative trend in anticipation of the key US inflation data and rising global bond yields. Domestic broader market momentum was mixed with caution as the initial expectation of Q2FY25 results is subdued due to a subpar momentum in the global and rural demand,\" said Vinod Nair, the head of research at Geojit Financial Services.Read all market-related news here","cleaned_content":"stock market today as many as \u003cTWO_HUNDRED\u003e stocks including hcl tech tech mahindra coforge dixon technologies and torrent pharmaceuticals hit their fresh one year highs in intraday trade on the bse on thursday october \u003cONE_TEN\u003e stocks such as cg power and industrial solutions gujarat fluorochemicals ipca laboratories glenmark pharma dr lal pathlabs metropolis healthcare hitachi energy india page industries and polycab india were also among those rising to their \u003cFIVE_TEN\u003e week highs mixed global cues ahead of the us cpi inflation data coupled with caution surrounding the start of q2 earnings for india inc kept the market trading within a narrow range equity benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e managed to close with mild gains thanks to shares of select banking and automobile heavyweights such as hdfc bank kotak mahindra bank axis bank mahindra and mahindra and maruti suzuki however losses in stocks such as infosys sun pharma larsen toubro and reliance industries capped the gains sensex closed \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e higher at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cONE_TEN\u003e points or \u003cZERO_PERCENT\u003e up at \u003cTWO_TEN_THOUSAND\u003e the bse midcap index underperformed as it fell \u003cZERO_PERCENT\u003e on the other hand the bse smallcap index rose \u003cZERO_PERCENT\u003e banking stocks especially private banks stole the limelight today the nifty bank index rose \u003cONE_PERCENT\u003e and the nifty private bank index rose as much as \u003cONE_PERCENT\u003e on the other hand the nifty pharma index fell \u003cTWO_PERCENT\u003e while the nifty it index dropped \u003cONE_PERCENT\u003e it bellwether tcs will report its september quarter scorecard today apart from the numbers the markets focus will be on management commentary on the demand outlook in key markets in the west the market traded on a rangebound trend with a negative bias ahead of the start of q2 result the asian market started well but could not hold on to the gains as european markets waved on a negative trend in anticipation of the key us inflation data and rising global bond yields domestic broader market momentum was mixed with caution as the initial expectation of q2fy25 results is subdued due to a subpar momentum in the global and rural demand said vinod nair the head of research at geojit financial services read all market related news here","timestamp":"2024-10-10T16:09:00+05:30","market_timestamp":"2024-10-11T09:15:00+05:30","off_market_hours":true}