{"url":"https://www.livemint.com/market/stock-market-news/smallcap-defence-stock-apollo-micro-systems-jumps-after-getting-bel-order-experts-see-more-rally-11728550788579.html","title":"Small-cap defence stock Apollo Micro Systems jumps after receipt of BEL order. Experts see more rally","description":"Stock market today: The small-cap stock opened with an upside gap on Thursday at  ₹101.81 and touched an intraday high of  ₹104.31 apiece on the NSE","content":"Defence stock to buy today: Apollo Micro Systems shares have been on an uptrend since the early morning session. The small-cap stock opened with an upside gap on Thursday at  ₹101.81 and touched an intraday high of  ₹104.31 apiece on the NSE, recording over 3% intraday rise against the previous day's close of  ₹101.11 apiece. However, the small-cap stock failed to sustain an intraday high and retraced after the profit-booking trigger.According to stock market experts, the defence stock has strong fundamentals due to substantial capex expansion and growth in revenue and order book. They said that company management had announced strong guidance. They also added that the small-cap stock has recently surged after receiving the BEL order. They advised a 'buy-on-dips strategy in this small-cap defence stock, expecting a short to mid-term target of  ₹150 apiece.On why Apollo Micro Systems' share price is rising, Seema Srivastava, Senior Equity Research Analyst at SMC Global Securities, said, \"The small-cap defence company has recently received an order from the PSU Bharat Electronics Limited. The company management has delivered strong guidance with 50% revenue growth and 25% order book growth in the next two to three years. They have said that the company's order book will grow from  ₹2,000 crore to  ₹2,500 crore in the next two to three years, whereas they have said to invest  ₹1,000 crore in the company's Capex building. The DRDO has shortlisted the company for the aerospace segment.\"Advising shareholders of the small-cap defence stock, Ganesh Dongre, Senior Manager — Technical Research at Anand Rathi, said, “The stock is currently in the  ₹85 to  ₹110 range. On breaching above  ₹110 on a closing basis, we can expect the stock to touch  ₹125 soon. However, on breaching above  ₹128 to  ₹130 decisively, the small-cap defence stock may touch  ₹150 in the medium term. So, Apollo Micro Systems shareholders are advised to hold the scrip, maintaining stop loss at  ₹85 and continuing to accumulate on a huge dip.”On the suggestion to fresh investors, Ganesh Dongre of Anand Rathi said, “Fresh investors can buy the scrip either in  ₹90 to  ₹95 range or above  ₹110. If the stock retraces without breaching the  ₹110 hurdle, then one can buy this scrip around the  ₹90 to  ₹95 range, maintaining a stop loss at  ₹85. However, if the stock breaches  ₹110 on a closing basis, one can buy the stock above  ₹110, maintaining a stop loss at  ₹100. Once the stock breaks the  ₹130 hurdle, shareholders who want to hold the scrip for the  ₹150 target can upgrade one's stop loss at  ₹120.”The small-cap defence company today informed the Indian stock market exchanges about the receipt of a fresh order from BEL, saying, \"We are pleased to inform you that the company has been declared as the Lowest Bidder (L1) for orders worth Rs. 28.74 crores from Bharat Electronics Limited (BEL) and CNA (OF) Pune, Indian Navy. The order from BEL is proprietary.\"","cleaned_content":"defence stock to buy today apollo micro systems shares have been on an uptrend since the early morning session the small cap stock opened with an upside gap on thursday at \u003cONE_HUNDRED\u003e and touched an intraday high of \u003cONE_HUNDRED\u003e apiece on the nse recording over \u003cTHREE_PERCENT\u003e intraday rise against the previous days close of \u003cONE_HUNDRED\u003e apiece however the small cap stock failed to sustain an intraday high and retraced after the profit booking trigger according to stock market experts the defence stock has strong fundamentals due to substantial capex expansion and growth in revenue and order book they said that company management had announced strong guidance they also added that the small cap stock has recently surged after receiving the bel order they advised a buy on dips strategy in this small cap defence stock expecting a short to mid term target of \u003cONE_HUNDRED\u003e apiece on why apollo micro systems share price is rising seema srivastava senior equity research analyst at smc global securities said the small cap defence company has recently received an order from the psu bharat electronics limited the company management has delivered strong guidance with \u003cFIVE_TEN_PERCENT\u003e revenue growth and \u003cTWO_TEN_PERCENT\u003e order book growth in the next two to three years they have said that the companys order book will grow from \u003cTWO_THOUSAND\u003e crore to \u003cTWO_THOUSAND\u003e crore in the next two to three years whereas they have said to invest \u003cONE_THOUSAND\u003e crore in the companys capex building the drdo has shortlisted the company for the aerospace segment advising shareholders of the small cap defence stock ganesh dongre senior manager technical research at anand rathi said the stock is currently in the \u003cEIGHT_TEN\u003e to \u003cONE_HUNDRED\u003e range on breaching above \u003cONE_HUNDRED\u003e on a closing basis we can expect the stock to touch \u003cONE_HUNDRED\u003e soon however on breaching above \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e decisively the small cap defence stock may touch \u003cONE_HUNDRED\u003e in the medium term so apollo micro systems shareholders are advised to hold the scrip maintaining stop loss at \u003cEIGHT_TEN\u003e and continuing to accumulate on a huge dip on the suggestion to fresh investors ganesh dongre of anand rathi said fresh investors can buy the scrip either in \u003cNINE_TEN\u003e to \u003cNINE_TEN\u003e range or above \u003cONE_HUNDRED\u003e if the stock retraces without breaching the \u003cONE_HUNDRED\u003e hurdle then one can buy this scrip around the \u003cNINE_TEN\u003e to \u003cNINE_TEN\u003e range maintaining a stop loss at \u003cEIGHT_TEN\u003e however if the stock breaches \u003cONE_HUNDRED\u003e on a closing basis one can buy the stock above \u003cONE_HUNDRED\u003e maintaining a stop loss at \u003cONE_HUNDRED\u003e once the stock breaks the \u003cONE_HUNDRED\u003e hurdle shareholders who want to hold the scrip for the \u003cONE_HUNDRED\u003e target can upgrade ones stop loss at \u003cONE_HUNDRED\u003e the small cap defence company today informed the indian stock market exchanges about the receipt of a fresh order from bel saying we are pleased to inform you that the company has been declared as the lowest bidder l1 for orders worth rs \u003cTWO_TEN\u003e crores from bharat electronics limited bel and cna of pune indian navy the order from bel is proprietary","timestamp":"2024-10-10T14:54:00+05:30","market_timestamp":"2024-10-10T14:54:00+05:30","off_market_hours":false}