{"url":"https://www.livemint.com/market/stock-market-news/irfc-rvnl-irctc-other-railway-stocks-in-oversold-zone-time-to-buy-11728633057964.html","title":"IRFC, RVNL, IRCTC, other railway stocks in oversold zone; time to buy?","description":"IRCTC shares are down by over 23% from their peak, while IRCON International has seen a decline of nearly 38%, and RailTel shares have dropped by more than 35% from their respective highs.","content":"Railway stocks including IRFC, IRCTC, RVNL and RailTel Corporation gained up to 2% on Friday amid increased buying momentum. While these multibagger railway stocks have seen a modest recovery from recent lows, they remain significantly below their 52-week highs.Rail Vikas Nigam Ltd (RVNL) shares have surged 161% year-to-date (YTD) and delivered a remarkable return of 1,466% over the past three years. Despite this performance, RVNL is currently down more than 35% from its 52-week high of  ₹618, recorded on July 12, 2024.Similarly, Indian Railway Finance Corporation (IRFC) has posted multibagger returns of over 101% in the last year. However, the stock has fallen more than 34% from its 52-week high of  ₹229.05, reached on July 15.IRCTC shares are down by over 23% from their peak, while IRCON International has seen a decline of nearly 38%, and RailTel shares have dropped by more than 35% from their respective highs.Railway stocks saw a big rally after increased allocations in the 2023-24 budget, and they continued to perform well with further funding in this year's budget. Many railway stocks gained after the Interim Budget, as the sector received more investment. However, despite hopes for even higher funding in the latest budget, the actual allocation was lower than what analysts expected. Thus, railway stocks saw a sharp correction from their peak values.Railway stocks such as IRFC, IRCTC, RVNL, RITES and IRCON International are trading in an oversold zone. Technically, these stocks are poised for an upside breakout. Hence, traders can apply a ‘buy on dips’ strategy for railway stocks, said Ganesh Dongre, Senior Manager — Technical Research at Anand Rathi.IRCTC stock is showing exhaustion and has a strong support level at  ₹800. Investors can buy IRCTC shares on dips, keeping a stop loss at  ₹800 and for a target of  ₹960 - 990 levels, Dongre said.According to Dongre, IRFC shares technically seem ready to bounce back. Investors can accumulate IRFC shares for a target price of  ₹200 to  ₹210 levels. Stop loss should be at  ₹130 - 135 levels, he said.RVNL shares have given decent breakout and buy on dips is suggested, keeping stop loss at  ₹420 level and target price of  ₹530 - 550 levels.RITES stock has formed a bullish reversal pattern, Dongre said. He suggests buy RITES shares at current market price and add on dips for a target price of  ₹350 - 360, keeping stop loss at  ₹270 - 280 levels.IRCON International shares have made a bottom at  ₹200 - 215 levels and are showing a reversal pattern, Dongre said. He recommends buying IRCON shares at CMP for a target price of  ₹260 - 270. Stop loss should be at  ₹205 level.","cleaned_content":"railway stocks including irfc irctc rvnl and railtel corporation gained up to \u003cTWO_PERCENT\u003e on friday amid increased buying momentum while these multibagger railway stocks have seen a modest recovery from recent lows they remain significantly below their \u003cFIVE_TEN\u003e week highs rail vikas nigam ltd rvnl shares have surged \u003cONE_HUNDRED_PERCENT\u003e year to date ytd and delivered a remarkable return of \u003cONE_THOUSAND_PERCENT\u003e over the past three years despite this performance rvnl is currently down more than \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week high of \u003cSIX_HUNDRED\u003e recorded on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e similarly indian railway finance corporation irfc has posted multibagger returns of over \u003cONE_HUNDRED_PERCENT\u003e in the last year however the stock has fallen more than \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week high of \u003cTWO_HUNDRED\u003e reached on july \u003cONE_TEN\u003e irctc shares are down by over \u003cTWO_TEN_PERCENT\u003e from their peak while ircon international has seen a decline of nearly \u003cTHREE_TEN_PERCENT\u003e and railtel shares have dropped by more than \u003cTHREE_TEN_PERCENT\u003e from their respective highs railway stocks saw a big rally after increased allocations in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e budget and they continued to perform well with further funding in this years budget many railway stocks gained after the interim budget as the sector received more investment however despite hopes for even higher funding in the latest budget the actual allocation was lower than what analysts expected thus railway stocks saw a sharp correction from their peak values railway stocks such as irfc irctc rvnl rites and ircon international are trading in an oversold zone technically these stocks are poised for an upside breakout hence traders can apply a buy on dips strategy for railway stocks said ganesh dongre senior manager technical research at anand rathi irctc stock is showing exhaustion and has a strong support level at \u003cEIGHT_HUNDRED\u003e investors can buy irctc shares on dips keeping a stop loss at \u003cEIGHT_HUNDRED\u003e and for a target of \u003cNINE_HUNDRED\u003e \u003cNINE_HUNDRED\u003e levels dongre said according to dongre irfc shares technically seem ready to bounce back investors can accumulate irfc shares for a target price of \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e levels stop loss should be at \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e levels he said rvnl shares have given decent breakout and buy on dips is suggested keeping stop loss at \u003cFOUR_HUNDRED\u003e level and target price of \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e levels rites stock has formed a bullish reversal pattern dongre said he suggests buy rites shares at current market price and add on dips for a target price of \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e keeping stop loss at \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels ircon international shares have made a bottom at \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e levels and are showing a reversal pattern dongre said he recommends buying ircon shares at cmp for a target price of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e stop loss should be at \u003cTWO_HUNDRED\u003e level","timestamp":"2024-10-11T13:29:00+05:30","market_timestamp":"2024-10-11T13:29:00+05:30","off_market_hours":false}