{"url":"https://www.livemint.com/market/stock-market-news/rbi-monetary-policy-mpc-keeps-fy25-inflation-forecast-unchanged-at-45-11728448413785.html","title":"RBI Monetary Policy: MPC keeps FY25 inflation forecast unchanged at 4.5%","description":"RBI Monetary Policy: The RBI maintains its 4.5% inflation projection for 2024-2025, with a focus on balancing risks. Governor Shaktikanta Das noted recent inflation decreases and projected a rise in September due to unfavourable base effects and food prices.","content":"RBI Monetary Policy meeting: The Reserve Bank of India (RBI) maintained its 4.5% inflation projection for 2024–2025 with Q2 at 4.1%, Q3 at 4.8% and Q4 at 4.2%. The consumer price index (CPI) inflation for the first quarter of the next financial year 2025-26 is projected at 4.3%. The risks are evenly balanced, said Governor of the RBI, Shaktikanta Das today.RBI Governor Shaktikanta Das noted that there was a significant decrease in headline inflation to 3.6% and 3.7% in July and August, from 5.1% in June, mainly due to the base effect in July. Retail inflation in September likely to see big jump due to unfavourable base, pick up in food price momentum, highlighted RBI Governor Shaktikanta Das in RBI October monetary policy.The persistent impact of reduced onion, potato, and chana dal (gram) production in 2023-24, along with other factors, is responsible for this. Nevertheless, it is anticipated that headline inflation will gradually decrease in the fourth quarter of this fiscal year, believes RBI Governor Shaktikanta Das.Food inflation showed some correction during last two months, but there were notable differences within the various food subgroups. The fuel group experienced deflation due to lower electricity and LPG prices, while core inflation increased in July and August. It is anticipated that the CPI for September will show a substantial increase because of unfavourable base effects and a rise in fuel prices.“Food inflation, however, is expected to ease by Q4:2024-25 on better kharif arrivals and rising prospects of a good rabi season. Sowing of key kharif crops are higher than last year and the long-period average. Sufficient buffer stocks for cereals are available for ensuring food security. Adequate reservoir levels, the likelihood of a good winter and favourable soil moisture conditions augur well for the ensuing rabi season, though adverse weather events remain a risk,” said the RBI Governor.Shaktikanta Das also mentioned the importance of closely monitoring the recent increase in key commodity prices, particularly metals and crude oil.During the Monetary Policy Committee (MPC) meeting, RBI Governor Shaktikanta Das announced that the central bank has opted to maintain the policy repo rate at 6.5% for the 10th consecutive time, on Wednesday.“Keep the policy repo rate under the liquidity adjustment facility (LAF) unchanged at 6.50%,” the RBI Governor stated.The decision received a majority vote of 5 out of 6 MPC members. The standing deposit facility (SDF) rate remains unchanged at 6.25%, while the marginal standing facility (MSF) rate and the bank rate are both held at 6.75%.Das indicated a change in the RBI's monetary policy stance by transitioning to a neutral approach.\"The MPC also decided to change the monetary policy stance to ‘neutral’ and to remain unambiguously focused on a durable alignment of inflation with the target, while supporting growth.These decisions are in consonance with the objective of achieving the medium term target for CPI inflation of 4% within a band of +/- 2%, while supporting growth,\" said the RBI Governor.The change in stance gives the MPC flexibility and allows it to keep an eye on the still-incomplete disinflation process. Uncertainties about increased global geopolitical risks volatile financial markets, unfavourable weather patterns, and the recent spike in food and metal prices are the main sources of risk. The RBI MPC will consequently continue to monitor the changing inflation forecast.Voting in favour of maintaining the policy repo rate at 6.50% were Shri Saugata Bhattacharya, Professor Ram Singh, Dr. Rajiv Ranjan, Dr. Michael Debabrata Patra, and Shri Shaktikanta Das. In favour of a 25 basis point drop in the policy repo rate, Dr. Nagesh Kumar cast his vote.Dr. Michael Debabrata Patra, Dr. Nagesh Kumar, Professor Ram Singh, Dr. Rajiv Ranjan, Dr. Saugata Bhattacharya, and Dr. Shaktikanta Das voted in favor of shifting from a withdrawal of accommodation to a \"neutral\" stance and staying steadfastly focused on a long-term alignment of inflation with the target while promoting growth.The MPC's upcoming meeting is set to take place from December 4 to 6, 2024.","cleaned_content":"rbi monetary policy meeting the reserve bank of india rbi maintained its \u003cFOUR_PERCENT\u003e inflation projection for \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e with q2 at \u003cFOUR_PERCENT\u003e q3 at \u003cFOUR_PERCENT\u003e and q4 at \u003cFOUR_PERCENT\u003e the consumer price index cpi inflation for the first quarter of the next financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e is projected at \u003cFOUR_PERCENT\u003e the risks are evenly balanced said governor of the rbi shaktikanta das today rbi governor shaktikanta das noted that there was a significant decrease in headline inflation to \u003cTHREE_PERCENT\u003e and \u003cTHREE_PERCENT\u003e in july and august from \u003cFIVE_PERCENT\u003e in june mainly due to the base effect in july retail inflation in september likely to see big jump due to unfavourable base pick up in food price momentum highlighted rbi governor shaktikanta das in rbi october monetary policy the persistent impact of reduced onion potato and chana dal gram production in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e along with other factors is responsible for this nevertheless it is anticipated that headline inflation will gradually decrease in the fourth quarter of this fiscal year believes rbi governor shaktikanta das food inflation showed some correction during last two months but there were notable differences within the various food subgroups the fuel group experienced deflation due to lower electricity and lpg prices while core inflation increased in july and august it is anticipated that the cpi for september will show a substantial increase because of unfavourable base effects and a rise in fuel prices food inflation however is expected to ease by q4 \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e on better kharif arrivals and rising prospects of a good rabi season sowing of key kharif crops are higher than last year and the long period average sufficient buffer stocks for cereals are available for ensuring food security adequate reservoir levels the likelihood of a good winter and favourable soil moisture conditions augur well for the ensuing rabi season though adverse weather events remain a risk said the rbi governor shaktikanta das also mentioned the importance of closely monitoring the recent increase in key commodity prices particularly metals and crude oil during the monetary policy committee mpc meeting rbi governor shaktikanta das announced that the central bank has opted to maintain the policy repo rate at \u003cSIX_PERCENT\u003e for the \u003cONE_TEN\u003e th consecutive time on wednesday keep the policy repo rate under the liquidity adjustment facility laf unchanged at \u003cSIX_PERCENT\u003e the rbi governor stated the decision received a majority vote of \u003cFIVE_\u003e out of \u003cSIX_\u003e mpc members the standing deposit facility sdf rate remains unchanged at \u003cSIX_PERCENT\u003e while the marginal standing facility msf rate and the bank rate are both held at \u003cSIX_PERCENT\u003e das indicated a change in the rbis monetary policy stance by transitioning to a neutral approach the mpc also decided to change the monetary policy stance to neutral and to remain unambiguously focused on a durable alignment of inflation with the target while supporting growth these decisions are in consonance with the objective of achieving the medium term target for cpi inflation of \u003cFOUR_PERCENT\u003e within a band of \u003cTWO_PERCENT\u003e while supporting growth said the rbi governor the change in stance gives the mpc flexibility and allows it to keep an eye on the still incomplete disinflation process uncertainties about increased global geopolitical risks volatile financial markets unfavourable weather patterns and the recent spike in food and metal prices are the main sources of risk the rbi mpc will consequently continue to monitor the changing inflation forecast voting in favour of maintaining the policy repo rate at \u003cSIX_PERCENT\u003e were shri saugata bhattacharya professor ram singh dr rajiv ranjan dr michael debabrata patra and shri shaktikanta das in favour of a \u003cTWO_TEN\u003e basis point drop in the policy repo rate dr nagesh kumar cast his vote dr michael debabrata patra dr nagesh kumar professor ram singh dr rajiv ranjan dr saugata bhattacharya and dr shaktikanta das voted in favor of shifting from a withdrawal of accommodation to a neutral stance and staying steadfastly focused on a long term alignment of inflation with the target while promoting growth the mpcs upcoming meeting is set to take place from december \u003cFOUR_\u003e to \u003cSIX_\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-09T10:18:00+05:30","market_timestamp":"2024-10-09T10:18:00+05:30","off_market_hours":false}