{"url":"https://www.livemint.com/market/stock-market-news/smallcap-stock-under-rs-200-servotech-power-shares-jump-9-from-intraday-low-in-tuesdays-relief-rally-buy-or-sell-11728365950370.html","title":"Small-cap stock under  ₹200: Servotech Power shares jump 9% from intraday low in Tuesday’s relief rally. Buy or sell?","description":"Small-cap stock under  ₹200: Servotech Power share price today opened at  ₹164 and touched an intraday high of  ₹178.95 apiece on the NSE","content":"Stock market today: After lowing for six straight sessions, the Indian stock market witnessed some buying interest at the lower levels. Servotech Power shares witnessed strong buying after trading red in the early morning session in this relief rally. The small-cap stock opened lower at  ₹164 apiece on the NSE, which turned out its intraday low during Tuesday deals. Servotech Power's share price attracted buying interest at the intraday low. It touched an intraday high of  ₹178.95 per share within a few minutes of the Opening Bell, recording around a 7% rise against Tuesday's low. However, experts see more upside in this small-cap stock as the company stock is rising due to the recent receipt of orders by the Nashik Municipal Corporation. They said the small-cap EV stock may touch  ₹200 to  ₹210 apiece soon.ON triggers that helped this small-cap stock bounce back, Anshul Jain, Head of Research at Lakshimishree Investment and Securities, said, \"The immediate reason for the rise in Servotech Power Systems shares is the fresh receipt of an order from the Nashik Municipal Corporation. However, EV buzz is already in the market, and medium—to long-term investors have been busy buying stocks with investments in the EV segment.\"On the technical chart pattern, this small-caps stock has given a fresh breakout at  ₹178, and it is expected to touch  ₹200 to  ₹210 in the near term. Fresh investors can buy this scrip maintaining a stop loss at  ₹165 whereas existing shareholders can also hold the scrip maintaining the same stop loss,\" said Anshul Jain.However, Sumeet Bagadia, Executive Director at Choice Broking, advised buy-on-dips, saying, “Those who have this stock in their portfolio can maintain a buy-on-dips strategy, maintaining a stop loss at  ₹150. Likewise, fresh investors can also buy the small-cap stock, maintaining a stop loss at  ₹150 and adding more on every big dip for the short-term target of  ₹200.”Servotech Power Systems Ltd informed the Indian exchanges on Monday about securing an additional order from the Nashik Municipal Corporation (NMC). Previously, the company had received an order from NMC, which involved Servotech supplying, commissioning, and constructing 20 electric vehicle (EV) charging stations throughout the Nashik Municipal Corporation area. Seeing the timely execution and delivery, NMC has given this additional order to the company, which will now involve Servotech supplying, commissioning, and constructing 29 electric vehicle (EV) charging stations.","cleaned_content":"stock market today after lowing for six straight sessions the indian stock market witnessed some buying interest at the lower levels servotech power shares witnessed strong buying after trading red in the early morning session in this relief rally the small cap stock opened lower at \u003cONE_HUNDRED\u003e apiece on the nse which turned out its intraday low during tuesday deals servotech powers share price attracted buying interest at the intraday low it touched an intraday high of \u003cONE_HUNDRED\u003e per share within a few minutes of the opening bell recording around a \u003cSEVEN_PERCENT\u003e rise against tuesdays low however experts see more upside in this small cap stock as the company stock is rising due to the recent receipt of orders by the nashik municipal corporation they said the small cap ev stock may touch \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e apiece soon on triggers that helped this small cap stock bounce back anshul jain head of research at lakshimishree investment and securities said the immediate reason for the rise in servotech power systems shares is the fresh receipt of an order from the nashik municipal corporation however ev buzz is already in the market and medium to long term investors have been busy buying stocks with investments in the ev segment on the technical chart pattern this small caps stock has given a fresh breakout at \u003cONE_HUNDRED\u003e and it is expected to touch \u003cTWO_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e in the near term fresh investors can buy this scrip maintaining a stop loss at \u003cONE_HUNDRED\u003e whereas existing shareholders can also hold the scrip maintaining the same stop loss said anshul jain however sumeet bagadia executive director at choice broking advised buy on dips saying those who have this stock in their portfolio can maintain a buy on dips strategy maintaining a stop loss at \u003cONE_HUNDRED\u003e likewise fresh investors can also buy the small cap stock maintaining a stop loss at \u003cONE_HUNDRED\u003e and adding more on every big dip for the short term target of \u003cTWO_HUNDRED\u003e servotech power systems ltd informed the indian exchanges on monday about securing an additional order from the nashik municipal corporation nmc previously the company had received an order from nmc which involved servotech supplying commissioning and constructing \u003cTWO_TEN\u003e electric vehicle ev charging stations throughout the nashik municipal corporation area seeing the timely execution and delivery nmc has given this additional order to the company which will now involve servotech supplying commissioning and constructing \u003cTWO_TEN\u003e electric vehicle ev charging stations","timestamp":"2024-10-08T11:24:00+05:30","market_timestamp":"2024-10-08T11:24:00+05:30","off_market_hours":false}