{"url":"https://www.livemint.com/market/fpis-take-u-turn-in-october-offload-rs-27-142-crore-in-indian-equities-heres-what-triggered-the-outflow-11728137300039.html","title":"FPIs take U-turn in October, offload  ₹27,142 crore in Indian equities: Here’s what triggered the sell-off","description":"FPIs offloaded  ₹27,142 crore worth of Indian equities, and the net outflow stood at  ₹23,101 crore as of October 4, taking into account debt, hybrid, debt-VRR, and equities","content":"Foreign portfolio investors (FPIs) took a sharp U-turn in October and snapped their three-month streak, turning net sellers in Indian markets amid the ongoing geopolitical tensions. This comes after an aggressive buying streak recorded in September, when FPI inflows were the highest year-to-date (YTD) and hit a nine-month high, boosted by the supersized 50 basis points (bps) interest rate cut by the US Federal Reserve.FPIs made a remarkable comeback to Indian markets last month, snapping their previous moderation, driven by domestic and global factors. They were consistent buyers in June and July after election-related jitters faded and stability returned to Indian markets. However, FPIs halted their buying streak with the onset of the new fiscal year 2024-25 (FY25).Also Read: FPIs continue buying streak, invest  ₹57,359 crore in Indian equities; Sept logs highest inflows YTD on US Fed pivotFPIs offloaded  ₹27,142 crore worth of Indian equities, and the net outflow stood at  ₹23,101 crore as of October 4, taking into account debt, hybrid, debt-VRR, and equities, according to the National Securities Depository Ltd (NSDL) data. This month, the total investment in debt markets is  ₹190 crore.D-Street experts say geopolitical tensions in the Middle East have become a major worry for global equity markets. But the markets have, so far, shrugged off these tensions. The mother market, the US, is resilient, with 21 per cent returns YTD. Even though crude has risen in recent days, there has been no sharp spike so far. The situation will change if Israel attacks oil installations in Iran.\"In a sudden U-turn in FII strategy, FIIs turned massive sellers in the Indian market in October. During the three trading days in October, FIIs sold equity for  ₹30,718 crore in the cash market, according to provisional data. The outperformance of Chinese stocks has mainly triggered the selling,\" said Dr. V K Vijayakumar, Chief Investment Strategist at Geojit Financial Services.Also Read: Stock Market Crash: Israel-Iran war to FII outflows—5 reasons why Sensex, Nifty plunged amid volatilityA substantial portion of this selling occurred on Thursday alone, amounting to  ₹15,243 crore, marking the largest daily outflow by foreign investors in the last four years. There are growing concerns about FPIs shifting investments back to China, especially as Beijing has implemented policy measures to revive its struggling economy and bolster its capital markets.The Hang Seng index shot up by 26 per cent in the last one month and this bullishness is expected to continue since valuations of Chinese stocks are very low and the Chinese economy is expected to do well in response to the monetary and fiscal stimulus being implemented by the Chinese authorities.Also Read: Hang Seng rallies 33% in 21 days as Nippon India ETF trades at 5% premium: Will China stimulus boost SIP returns?On Friday, Hong Kong’s Hang Seng jumped 2.8 per cent in its latest sharp swerve, with tech firms leading the charge. The index soared nearly 10 per cent over the week. Global hedge funds flocked to Chinese equities because of Beijing's much bigger-than-expected stimulus, leading to the strongest weekly buying on record.China announced its largest stimulus since the pandemic, aiming to move closer to the government's growth target. China's central bank will cut banks' reserve requirement ratio (RRR) by 50 basis points, releasing about one trillion yuan ($142.21 billion) for new lending. The flurry of announcements by Chinese authorities aims to boost the world’s second-largest economy as it struggles to regain momentum after the COVID-19 pandemic.The monetary and fiscal stimulus implemented by the Chinese authorities is expected to stimulate the Chinese economy and the Chinese stocks listed in the Hong Kong market. If the outperformance of Hang Seng continues, more funds may flow to Hong Kong since that market continues to be very cheap.Also Read: Nifty 50 slides 4.4% this week, posts largest weekly drop since June 2022 on growing Iran-Israel war fears, FII outflows“If the momentum in Chinese stocks continues, FIIs may continue to sell in India, where valuations are elevated. It remains to be seen how long the optimism lasts. Massive FII selling in financials, especially frontline banking stocks, has made their valuations attractive. Long-term domestic investors may utilise this opportunity to buy high-quality banking stocks,” added Dr. V K Vijayakumar.Experts remain concerned that the market will overheat and valuations will be stretched. Analysts added that the Indian markets reflected their resilience positively based on the strong fundamentals and robust economic performance at the expected economic growth.","cleaned_content":"foreign portfolio investors fpis took a sharp u turn in october and snapped their three month streak turning net sellers in indian markets amid the ongoing geopolitical tensions this comes after an aggressive buying streak recorded in september when fpi inflows were the highest year to date ytd and hit a nine month high boosted by the supersized \u003cFIVE_TEN\u003e basis points bps interest rate cut by the us federal reserve fpis made a remarkable comeback to indian markets last month snapping their previous moderation driven by domestic and global factors they were consistent buyers in june and july after election related jitters faded and stability returned to indian markets however fpis halted their buying streak with the onset of the new fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fy25 also read fpis continue buying streak invest \u003cFIVE_TEN_THOUSAND\u003e crore in indian equities sept logs highest inflows ytd on us fed pivotfpis offloaded \u003cTWO_TEN_THOUSAND\u003e crore worth of indian equities and the net outflow stood at \u003cTWO_TEN_THOUSAND\u003e crore as of october \u003cFOUR_\u003e taking into account debt hybrid debt vrr and equities according to the national securities depository ltd nsdl data this month the total investment in debt markets is \u003cONE_HUNDRED\u003e crore d street experts say geopolitical tensions in the middle east have become a major worry for global equity markets but the markets have so far shrugged off these tensions the mother market the us is resilient with \u003cTWO_TEN_PERCENT\u003e returns ytd even though crude has risen in recent days there has been no sharp spike so far the situation will change if israel attacks oil installations in iran in a sudden u turn in fii strategy fiis turned massive sellers in the indian market in october during the three trading days in october fiis sold equity for \u003cTHREE_TEN_THOUSAND\u003e crore in the cash market according to provisional data the outperformance of chinese stocks has mainly triggered the selling said dr v k vijayakumar chief investment strategist at geojit financial services also read stock market crash israel iran war to fii outflows \u003cFIVE_\u003e reasons why sensex nifty plunged amid volatilitya substantial portion of this selling occurred on thursday alone amounting to \u003cONE_TEN_THOUSAND\u003e crore marking the largest daily outflow by foreign investors in the last four years there are growing concerns about fpis shifting investments back to china especially as beijing has implemented policy measures to revive its struggling economy and bolster its capital markets the hang seng index shot up by \u003cTWO_TEN_PERCENT\u003e in the last one month and this bullishness is expected to continue since valuations of chinese stocks are very low and the chinese economy is expected to do well in response to the monetary and fiscal stimulus being implemented by the chinese authorities also read hang seng rallies \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_TEN\u003e days as nippon india etf trades at \u003cFIVE_PERCENT\u003e premium will china stimulus boost sip returns on friday hong kong s hang seng jumped \u003cTWO_PERCENT\u003e in its latest sharp swerve with tech firms leading the charge the index soared nearly \u003cONE_TEN_PERCENT\u003e over the week global hedge funds flocked to chinese equities because of beijings much bigger than expected stimulus leading to the strongest weekly buying on record china announced its largest stimulus since the pandemic aiming to move closer to the governments growth target chinas central bank will cut banks reserve requirement ratio rrr by \u003cFIVE_TEN\u003e basis points releasing about one trillion yuan \u003cONE_HUNDRED\u003e billion for new lending the flurry of announcements by chinese authorities aims to boost the world s second largest economy as it struggles to regain momentum after the covid \u003cONE_TEN\u003e pandemic the monetary and fiscal stimulus implemented by the chinese authorities is expected to stimulate the chinese economy and the chinese stocks listed in the hong kong market if the outperformance of hang seng continues more funds may flow to hong kong since that market continues to be very cheap also read nifty \u003cFIVE_TEN\u003e slides \u003cFOUR_PERCENT\u003e this week posts largest weekly drop since june \u003cTWO_THOUSAND\u003e on growing iran israel war fears fii outflows if the momentum in chinese stocks continues fiis may continue to sell in india where valuations are elevated it remains to be seen how long the optimism lasts massive fii selling in financials especially frontline banking stocks has made their valuations attractive long term domestic investors may utilise this opportunity to buy high quality banking stocks added dr v k vijayakumar experts remain concerned that the market will overheat and valuations will be stretched analysts added that the indian markets reflected their resilience positively based on the strong fundamentals and robust economic performance at the expected economic growth","timestamp":"2024-10-05T19:40:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}