{"url":"https://www.livemint.com/market/stock-market-news/vedanta-share-price-remains-in-focus-ahead-of-board-meeting-today-to-consider-4th-interim-dividend-11728442144391.html","title":"Vedanta share price in focus ahead of board meeting today to consider 4th interim dividend","description":"Stock to watch: Vedanta share price remains in focus ahead of a board meeting today to consider the fourth interim dividend. Vedanta has already three interim dividends of  ₹20,  ₹4 and  ₹11 per equity share so far in the ongoing financial year.","content":"Stock to watch: Vedanta share price remains in focus ahead of its board meeting on Wednesday, October 9, to consider the fourth interim dividend.The meeting of the Board of Directors of the company was earlier proposed to be held on Tuesday, October 08, 2024, to consider and approve the fourth interim dividend on equity shares, if any, for the financial year 2024-25 (FY25). However, a release by the company on Tuesday said that due to unforeseen circumstances, the board meeting has been rescheduled to October 09, 2024.So far in the current fiscal year, the mining giant Vedanta has announced three interim dividends of  ₹20,  ₹4, and  ₹11 per equity share. Investors find Vedanta investments attractive due to its robust dividend yield.The third interim dividend of  ₹ 20 per equity share for the financial year 2024–25, amounting to  ₹ 7,821 crore, was considered and approved by Vedanta's Board of Directors during their meeting on September 02, 2024.Vedanta had also announced an interim dividend of  ₹ 4/- per equity share for the financial year 2024-25, amounting to  ₹1,564 crore, in July 2024. This was the second interim dividend announcement by the company in FY25 after having approved the first interim dividend of  ₹11 per share.Vedanta share price also remains in focus due to an expected recovery in metals demand from China, the world's largest consumer of commodities. The prices of aluminium, copper, zinc, lead and other metals have already been rising on the London Metal Exchange.Meanwhile, the proposed demerger of the aluminium, oil and gas, power, steel and ferrous material, and base metals operations into separate companies continues to be another reason for the focus on Vedanta share prices.","cleaned_content":"stock to watch vedanta share price remains in focus ahead of its board meeting on wednesday october \u003cNINE_\u003e to consider the fourth interim dividend the meeting of the board of directors of the company was earlier proposed to be held on tuesday october \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e to consider and approve the fourth interim dividend on equity shares if any for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fy25 however a release by the company on tuesday said that due to unforeseen circumstances the board meeting has been rescheduled to october \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e so far in the current fiscal year the mining giant vedanta has announced three interim dividends of \u003cTWO_TEN\u003e \u003cFOUR_\u003e and \u003cONE_TEN\u003e per equity share investors find vedanta investments attractive due to its robust dividend yield the third interim dividend of \u003cTWO_TEN\u003e per equity share for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e amounting to \u003cSEVEN_THOUSAND\u003e crore was considered and approved by vedantas board of directors during their meeting on september \u003cTWO_\u003e \u003cTWO_THOUSAND\u003e vedanta had also announced an interim dividend of \u003cFOUR_\u003e per equity share for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e amounting to \u003cONE_THOUSAND\u003e crore in july \u003cTWO_THOUSAND\u003e this was the second interim dividend announcement by the company in fy25 after having approved the first interim dividend of \u003cONE_TEN\u003e per share vedanta share price also remains in focus due to an expected recovery in metals demand from china the worlds largest consumer of commodities the prices of aluminium copper zinc lead and other metals have already been rising on the london metal exchange meanwhile the proposed demerger of the aluminium oil and gas power steel and ferrous material and base metals operations into separate companies continues to be another reason for the focus on vedanta share prices","timestamp":"2024-10-09T09:05:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}