{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-outlook-amid-iran-israel-war-five-stocks-to-buy-or-sell-oct-10-11728470790145.html","title":"Stock market today: Trade setup for Nifty 50 to global outlook amid Iran-Israel war; five stocks to buy or sell — Oct 10","description":"Stock Market Today: Nifty-50 index that continued its correction phase may consolidate in coming days and is likely to stay in the 24832-25230 band for the near term and breach in any of the directions can accelerate the movement in that direction, said experts","content":"Stock Market Today: The Nifty 50 index continued its correction phase after a one-day gap on Wednesday, ending the volatile trading session at 24,981.95, down 0.12%. The S\u0026P BSE Sensex settled at 81,467.10, also 0.21% lower. The sectoral indices were a mixed bag, as realty and pharma gained while FMCG and energy sectors saw declines. While the Bank Nifty gained intraday post the RBI MPC outcome, it ended 0.03% lower at 51,007. Broader indices, however, surprised with outperformance, gaining over 1%.Nifty ended lower, wiping all gains during the day as the bulls ran into resistance and profit-taking at 25200+ levels, said Deepak Jasani, Head of Retail Research at HDFC Securities. Nifty could now stay in the 24,832-25,230 band for the near term and a breach of either value could mean acceleration in that direction, added Jasani\"Technically, as long as the Nifty Bank index holds above 50,190, a \"buy on dips\" strategy is advisable. On the upside, the 51,700–51,800 range will act as a short-term hurdle for Bank Nifty,\" said Hrishikesh Yedve, AVP Technical and Derivatives Research at Asit C. Mehta Investment Intermediates Ltd.Most stocks in the Asia-Pacific region were also mixed. Chinese markets fell sharply as stimulus measures seemed inadequate. Investors are watchful on reports that Alphabet Inc., the company that owns Google, may face antitrust charges from US authorities, and indications that the Federal Reserve will gradually reduce interest rates is impacting sentiments.With ongoing tensions in the Middle East affecting oil prices and anticipation surrounding domestic quarterly earnings, market participants are keen to see how these factors will influence performance in the coming days, said Vikram Kasat, Head - Advisory, Prabhudas Lilladher.Sumeet Bagadia, Executive Director at Choice Broking, has recommended two stock picks for Thursday. Ganesh Dongre, Senior Manager of Technical Research at Anand Rathi has suggested three stock ideas for today.These include Prestige Estates Projects,  Marksans Pharma, NMDC,  JSW Steel and Ashok Leyland.1. Prestige Estates Projects Ltd - Bagadia recommends buying Prestige Estates Projects at  ₹1,858.2 with a stop loss at  ₹1,793 for a target price of  ₹1,988.Prestige is currently trading at  ₹1858.2, forming a strong bullish candle on the daily chart, which indicates a potential reversal from key support levels. The stock has rebounded from its support zone, suggesting a reversal pattern, and the increase in trading volumes further confirms a bullish outlook. If Prestige sustains above the crucial level of  ₹1900, it is likely to continue its upward momentum towards the target price of  ₹1988.2. Marksans Pharma Ltd - Bagadia recommends buying Marksans Pharma at  ₹297.05, keeping a stop loss at  ₹287 for a target price of  ₹318.Marksans is currently trading at  ₹297.05, exhibiting a strong bullish trend. The stock has recently broken out from a falling trendline and has shown a significant bullish reversal from a support zone, accompanied by a notable surge in trading volumes. This reflects strong buying interest from investors. In the short term, Marksans is poised to reach a target of  ₹318.3. NMDC Ltd - Dongre recommends buying NMDC at  ₹224, keeping a stop loss of  ₹218 for a target price of  ₹235.In the recent short-term trend analysis of the stock, a notable bullish reversal pattern has emerged. This technical pattern suggests the possibility of a temporary retracement in the stock's price, potentially reaching around  ₹235. At present, the stock is maintaining a crucial support level at  ₹218. Given the current market price of  ₹224, a buying opportunity is emerging. This suggests that investors might consider purchasing the stock at its current price, anticipating a rise towards the identified target of  ₹235.4. JSW Steel Ltd - Dongre recommends buying JSW Steel at  ₹995, keeping a stop loss at  ₹980 for a target price of  ₹1,025.On the daily chart, the stock has support at  ₹985 level, signalling a potential upward trend. Complementing this breakout, the Relative Strength Index (RSI) is still turning up, indicating increased buying momentum. Given these technical indicators, traders can consider buying on dips and entering the stock at a lower price point. To manage risk, a stop loss of  ₹980 is recommended. The target price for this strategy is  ₹1,025 in the upcoming weeks, suggesting a potential gain as the stock continues its upward trajectory.5.  Ashok Leyland Ltd - Dongre recommends buying Ashok Leyland at  ₹222, keeping a stop loss of  ₹216 for a target price of  ₹230.On the short-term chart, this stock is forming a bullish engulfing pattern, which is inherently bullish. Currently priced at  ₹222, this formation signals a potential upward trend. To effectively manage risk, a stop loss of  ₹216 is recommended. The target price for this strategy is  ₹230 in the upcoming weeks. This suggests a potential gain as the stock continues its upward trajectory, backed by the bullish technical signals.","cleaned_content":"stock market today the nifty \u003cFIVE_TEN\u003e index continued its correction phase after a one day gap on wednesday ending the volatile trading session at \u003cTWO_TEN_THOUSAND\u003e down \u003cZERO_PERCENT\u003e the s p bse sensex settled at \u003cEIGHT_TEN_THOUSAND\u003e also \u003cZERO_PERCENT\u003e lower the sectoral indices were a mixed bag as realty and pharma gained while fmcg and energy sectors saw declines while the bank nifty gained intraday post the rbi mpc outcome it ended \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e broader indices however surprised with outperformance gaining over \u003cONE_PERCENT\u003e nifty ended lower wiping all gains during the day as the bulls ran into resistance and profit taking at \u003cTWO_TEN_THOUSAND\u003e levels said deepak jasani head of retail research at hdfc securities nifty could now stay in the \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e band for the near term and a breach of either value could mean acceleration in that direction added jasani technically as long as the nifty bank index holds above \u003cFIVE_TEN_THOUSAND\u003e a buy on dips strategy is advisable on the upside the \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e range will act as a short term hurdle for bank nifty said hrishikesh yedve avp technical and derivatives research at asit c mehta investment intermediates ltd most stocks in the asia pacific region were also mixed chinese markets fell sharply as stimulus measures seemed inadequate investors are watchful on reports that alphabet inc the company that owns google may face antitrust charges from us authorities and indications that the federal reserve will gradually reduce interest rates is impacting sentiments with ongoing tensions in the middle east affecting oil prices and anticipation surrounding domestic quarterly earnings market participants are keen to see how these factors will influence performance in the coming days said vikram kasat head advisory prabhudas lilladher sumeet bagadia executive director at choice broking has recommended two stock picks for thursday ganesh dongre senior manager of technical research at anand rathi has suggested three stock ideas for today these include prestige estates projects marksans pharma nmdc jsw steel and ashok leyland 1 prestige estates projects ltd bagadia recommends buying prestige estates projects at \u003cONE_THOUSAND\u003e with a stop loss at \u003cONE_THOUSAND\u003e for a target price of \u003cONE_THOUSAND\u003e prestige is currently trading at \u003cONE_THOUSAND\u003e forming a strong bullish candle on the daily chart which indicates a potential reversal from key support levels the stock has rebounded from its support zone suggesting a reversal pattern and the increase in trading volumes further confirms a bullish outlook if prestige sustains above the crucial level of \u003cONE_THOUSAND\u003e it is likely to continue its upward momentum towards the target price of \u003cONE_THOUSAND\u003e marksans pharma ltd bagadia recommends buying marksans pharma at \u003cTWO_HUNDRED\u003e keeping a stop loss at \u003cTWO_HUNDRED\u003e for a target price of \u003cTHREE_HUNDRED\u003e marksans is currently trading at \u003cTWO_HUNDRED\u003e exhibiting a strong bullish trend the stock has recently broken out from a falling trendline and has shown a significant bullish reversal from a support zone accompanied by a notable surge in trading volumes this reflects strong buying interest from investors in the short term marksans is poised to reach a target of \u003cTHREE_HUNDRED\u003e nmdc ltd dongre recommends buying nmdc at \u003cTWO_HUNDRED\u003e keeping a stop loss of \u003cTWO_HUNDRED\u003e for a target price of \u003cTWO_HUNDRED\u003e in the recent short term trend analysis of the stock a notable bullish reversal pattern has emerged this technical pattern suggests the possibility of a temporary retracement in the stocks price potentially reaching around \u003cTWO_HUNDRED\u003e at present the stock is maintaining a crucial support level at \u003cTWO_HUNDRED\u003e given the current market price of \u003cTWO_HUNDRED\u003e a buying opportunity is emerging this suggests that investors might consider purchasing the stock at its current price anticipating a rise towards the identified target of \u003cTWO_HUNDRED\u003e jsw steel ltd dongre recommends buying jsw steel at \u003cNINE_HUNDRED\u003e keeping a stop loss at \u003cNINE_HUNDRED\u003e for a target price of \u003cONE_THOUSAND\u003e on the daily chart the stock has support at \u003cNINE_HUNDRED\u003e level signalling a potential upward trend complementing this breakout the relative strength index rsi is still turning up indicating increased buying momentum given these technical indicators traders can consider buying on dips and entering the stock at a lower price point to manage risk a stop loss of \u003cNINE_HUNDRED\u003e is recommended the target price for this strategy is \u003cONE_THOUSAND\u003e in the upcoming weeks suggesting a potential gain as the stock continues its upward trajectory 5 ashok leyland ltd dongre recommends buying ashok leyland at \u003cTWO_HUNDRED\u003e keeping a stop loss of \u003cTWO_HUNDRED\u003e for a target price of \u003cTWO_HUNDRED\u003e on the short term chart this stock is forming a bullish engulfing pattern which is inherently bullish currently priced at \u003cTWO_HUNDRED\u003e this formation signals a potential upward trend to effectively manage risk a stop loss of \u003cTWO_HUNDRED\u003e is recommended the target price for this strategy is \u003cTWO_HUNDRED\u003e in the upcoming weeks this suggests a potential gain as the stock continues its upward trajectory backed by the bullish technical signals","timestamp":"2024-10-10T07:34:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}