{"url":"https://www.livemint.com/market/stock-market-news/stock-in-news-hal-share-price-in-focus-as-defence-psu-stock-joins-elite-group-of-maharatna-companies-in-india-11728872884320.html","title":"Stock in news: HAL share price in focus as defence PSU stock joins elite group of Maharatna companies in India","description":"Stock in news: HAL became 14th Maharatna company in India last week","content":"Stock in news: After getting Maharatna status, Hindustan Aeronautics Limited (HAL) share price is expected to remain under the radar of the Indian stock market investors. The Government of India granted 'Maharatna' status to the defence PSU company on Saturday, making HAL the 14th Maharatha company in India. The move is expected to bring greater autonomy, higher investment capability, and strategic flexibility to HAL, so the market is expected to react to this new development.According to stock market experts, getting Maharatna status and becoming one of the Maharatna companies in India is a significant development for HAL. They said that the GoI move is expected to bring higher investment opportunities and strategic flexibility and predicted that HAL's share price may touch  ₹5,000 apiece in the near term.Speaking on the impact of Maharatna status on HAL shares, Anshul Jain, Head of Research at Lakshmishree Investment and Securities, said, \"This is a big moment for the defence PSU company as Maharatna status would bring ease in doing business. Now, HAL can invest up to  ₹5,000 crore or 15% of its net worth (whichever is applicable in the future) in a single project without government approval. Like any other Maharatna company, HAL will be free to undertake domestic and international mergers, acquisitions, and strategic investments.\"\"The defence PSU company was facing challenges on the delivery front, which is expected to get eased after the grant of Maharatna status,\" Anshul Jain added.Expecting a sharp rally in HAL share price after the grant of Maharatna status, Sumeet Bagadia, Executive Director at Choice Broking, said, “HAL share price is looking bullish on the technical chart pattern. Those who have HAL shares in their portfolio are advised to hold the scrip for the short-term target of  ₹4,700 and  ₹5,000, maintaining a stop loss at  ₹4,300 apiece.”Sumeet Bagadia suggested that fresh investors buy HAL shares for the short-term target of  ₹4,700 and  ₹5,000 apiece, maintaining a stop loss at  ₹4,300 per share.As mentioned above, HAL will be the 14th Maharatna company in India. The first 13 Maharatna companies are as below:1] National Thermal Power Corporation (NTPC) Ltd;2] Oil and Natural Gas Corporation (ONGC) Ltd;3] Steel Authority of India Limited (SAIL);4] Bharat Heavy Electricals Limited (BHEL);5] Indian Oil Corporation Limited (IOCL);6] Hindustan Petroleum Corporation Limited (HPCL);7] Coal India Limited (CIL);8] GAIL India Limited;9] Bharat Petroleum Corporation Limited (BPCL);10] Power Grid Corporation of India Limited;11] Power Finance Corporation (PFC);12] Rural Electrification Corporation (REC) Limited; and13] Oil India Ltd (OIL).","cleaned_content":"stock in news after getting maharatna status hindustan aeronautics limited hal share price is expected to remain under the radar of the indian stock market investors the government of india granted maharatna status to the defence psu company on saturday making hal the \u003cONE_TEN\u003e th maharatha company in india the move is expected to bring greater autonomy higher investment capability and strategic flexibility to hal so the market is expected to react to this new development according to stock market experts getting maharatna status and becoming one of the maharatna companies in india is a significant development for hal they said that the goi move is expected to bring higher investment opportunities and strategic flexibility and predicted that hals share price may touch \u003cFIVE_THOUSAND\u003e apiece in the near term speaking on the impact of maharatna status on hal shares anshul jain head of research at lakshmishree investment and securities said this is a big moment for the defence psu company as maharatna status would bring ease in doing business now hal can invest up to \u003cFIVE_THOUSAND\u003e crore or \u003cONE_TEN_PERCENT\u003e of its net worth whichever is applicable in the future in a single project without government approval like any other maharatna company hal will be free to undertake domestic and international mergers acquisitions and strategic investments the defence psu company was facing challenges on the delivery front which is expected to get eased after the grant of maharatna status anshul jain added expecting a sharp rally in hal share price after the grant of maharatna status sumeet bagadia executive director at choice broking said hal share price is looking bullish on the technical chart pattern those who have hal shares in their portfolio are advised to hold the scrip for the short term target of \u003cFOUR_THOUSAND\u003e and \u003cFIVE_THOUSAND\u003e maintaining a stop loss at \u003cFOUR_THOUSAND\u003e apiece sumeet bagadia suggested that fresh investors buy hal shares for the short term target of \u003cFOUR_THOUSAND\u003e and \u003cFIVE_THOUSAND\u003e apiece maintaining a stop loss at \u003cFOUR_THOUSAND\u003e per share as mentioned above hal will be the \u003cONE_TEN\u003e th maharatna company in india the first \u003cONE_TEN\u003e maharatna companies are as below \u003cONE_\u003e national thermal power corporation ntpc ltd \u003cTWO_\u003e oil and natural gas corporation ongc ltd \u003cTHREE_\u003e steel authority of india limited sail \u003cFOUR_\u003e bharat heavy electricals limited bhel \u003cFIVE_\u003e indian oil corporation limited iocl \u003cSIX_\u003e hindustan petroleum corporation limited hpcl \u003cSEVEN_\u003e coal india limited cil \u003cEIGHT_\u003e gail india limited \u003cNINE_\u003e bharat petroleum corporation limited bpcl \u003cONE_TEN\u003e power grid corporation of india limited \u003cONE_TEN\u003e power finance corporation pfc \u003cONE_TEN\u003e rural electrification corporation rec limited and13 oil india ltd oil","timestamp":"2024-10-14T08:40:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}