{"url":"https://www.livemint.com/market/stock-market-news/ipo-frenzy-a-bubble-or-the-right-strategy-to-enter-a-booming-market-11728302286303.html","title":"IPO Frenzy: A bubble or the right strategy to enter a booming market?","description":"In H1 2023-24, India accounted for 27% of global IPOs, fueled by SMEs. Oversubscriptions have raised concerns over inflated valuations and promoter exits. Regulatory changes, including a lottery-based allotment system, aim to balance market accessibility and sustainability.","content":"The Indian stock market has been on fire recently, with September emerging as one of the busiest months for initial public offerings (IPOs) in the past 14 years. According to the data released by the Reserve Bank of India (RBI) on September 20, IPO activity in the country has reached an all-time high, highlighting a significant resurgence of interest in public listings. This surge is not limited to large companies; it encompasses both the mainboard and the small and medium enterprise (SME) segments, showing a diverse appetite for investment opportunities across different market sectors.The following data shows the bumper listing gains offered by some of the companies in 2024:September alone witnessed over 28 companies making their debut on Dalal Street, split between the mainboard and the SME segments. This number is remarkable, as such an IPO surge has not been seen in over a decade. The sudden resurgence indicates a renewed sense of confidence and eagerness among both companies and investors to participate in the capital markets. It seems that investors are increasingly seeing IPOs as a strategic entry point into a market that is scaling new highs, despite the risks associated with such investments.On the global front, India’s recent IPO activity stands out impressively. The RBI report highlights that India accounted for the highest number of public listings worldwide, capturing a striking 27% share of all IPOs during the first half of the 2023-24 fiscal year.The surge in IPOs has been significantly fueled by the SME segment. The massive oversubscriptions of SME IPOs have attracted considerable attention, turning them into a focal point of the ongoing IPO frenzy. SMEs are increasingly capitalising on investor enthusiasm, with many small businesses using public listings as a way to secure capital for expansion and growth. The enthusiasm seen in the SME space speaks volumes about the expanding scope of opportunities available to retail and institutional investors alike.However, the enthusiasm is not without its risks. The RBI’s report pointed out a potentially concerning trend wherein promoters, particularly in the SME segment, have been using favourable conditions in the primary market to offload their stakes at inflated prices. While this may represent a smart exit strategy for existing shareholders, it raises questions about the long-term value for new investors, especially when the market is already at elevated levels. The risk of overvaluation looms large, with some IPOs potentially being priced higher than what fundamentals would suggest, leading to an overheated market scenario.To ensure that the market remains sustainable and does not spiral into a bubble, the RBI has introduced several regulatory measures. One such change is the limitation of IPO funding through non-banking financial companies (NBFCs). This move is aimed at curbing excessive borrowing to invest in IPOs, which can create artificial demand and inflate prices to unsustainable levels. By limiting such practices, the RBI hopes to maintain a balance between genuine investor demand and speculative activity.Another key regulatory shift has been the transition from a proportionality-based allotment method to a lottery-based allotment system for IPO subscriptions. The previous allotment method often favoured institutional investors, leaving retail investors with minimal chances of securing shares in oversubscribed IPOs. The new lottery-based system aims to create a fairer allocation process, especially for retail investors who have frequently found themselves on the losing end of heavily oversubscribed public issues. This change is likely to make IPOs more accessible to a broader audience and ensure that the benefits of the market’s growth are distributed more equitably.The current IPO frenzy is both an opportunity and a cautionary tale for investors. On one hand, IPOs provide a unique chance to get in on the ground floor of promising companies and participate in the economic growth of the country. On the other hand, the possibility of overvaluation and promoters cashing out at high prices can lead to significant losses for new investors if the broader market experiences a correction.For investors considering entering through IPOs, it is critical to evaluate the fundamentals of the companies going public and not get swept up in the hype. The broader market may be at a high, but a sound strategy—focused on due diligence, risk assessment, and a long-term perspective—can help navigate the opportunities and pitfalls of this burgeoning IPO landscape.The surge in IPO activity in India reflects both the enthusiasm of investors and the vitality of the Indian economy. However, market participants need to stay vigilant and recognise the risks associated with a booming IPO market. Whether this frenzy is a bubble waiting to burst or a calculated opportunity for entering the market depends largely on the approach investors take. With regulatory changes in place and a more balanced allotment system, the stage is set for a more inclusive and robust market environment—provided investors make informed decisions.(The author is CEO of Hedged.in.)","cleaned_content":"the indian stock market has been on fire recently with september emerging as one of the busiest months for initial public offerings ipos in the past \u003cONE_TEN\u003e years according to the data released by the reserve bank of india rbi on september \u003cTWO_TEN\u003e ipo activity in the country has reached an all time high highlighting a significant resurgence of interest in public listings this surge is not limited to large companies it encompasses both the mainboard and the small and medium enterprise sme segments showing a diverse appetite for investment opportunities across different market sectors the following data shows the bumper listing gains offered by some of the companies in \u003cTWO_THOUSAND\u003e september alone witnessed over \u003cTWO_TEN\u003e companies making their debut on dalal street split between the mainboard and the sme segments this number is remarkable as such an ipo surge has not been seen in over a decade the sudden resurgence indicates a renewed sense of confidence and eagerness among both companies and investors to participate in the capital markets it seems that investors are increasingly seeing ipos as a strategic entry point into a market that is scaling new highs despite the risks associated with such investments on the global front india s recent ipo activity stands out impressively the rbi report highlights that india accounted for the highest number of public listings worldwide capturing a striking \u003cTWO_TEN_PERCENT\u003e share of all ipos during the first half of the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal year the surge in ipos has been significantly fueled by the sme segment the massive oversubscriptions of sme ipos have attracted considerable attention turning them into a focal point of the ongoing ipo frenzy smes are increasingly capitalising on investor enthusiasm with many small businesses using public listings as a way to secure capital for expansion and growth the enthusiasm seen in the sme space speaks volumes about the expanding scope of opportunities available to retail and institutional investors alike however the enthusiasm is not without its risks the rbi s report pointed out a potentially concerning trend wherein promoters particularly in the sme segment have been using favourable conditions in the primary market to offload their stakes at inflated prices while this may represent a smart exit strategy for existing shareholders it raises questions about the long term value for new investors especially when the market is already at elevated levels the risk of overvaluation looms large with some ipos potentially being priced higher than what fundamentals would suggest leading to an overheated market scenario to ensure that the market remains sustainable and does not spiral into a bubble the rbi has introduced several regulatory measures one such change is the limitation of ipo funding through non banking financial companies nbfcs this move is aimed at curbing excessive borrowing to invest in ipos which can create artificial demand and inflate prices to unsustainable levels by limiting such practices the rbi hopes to maintain a balance between genuine investor demand and speculative activity another key regulatory shift has been the transition from a proportionality based allotment method to a lottery based allotment system for ipo subscriptions the previous allotment method often favoured institutional investors leaving retail investors with minimal chances of securing shares in oversubscribed ipos the new lottery based system aims to create a fairer allocation process especially for retail investors who have frequently found themselves on the losing end of heavily oversubscribed public issues this change is likely to make ipos more accessible to a broader audience and ensure that the benefits of the market s growth are distributed more equitably the current ipo frenzy is both an opportunity and a cautionary tale for investors on one hand ipos provide a unique chance to get in on the ground floor of promising companies and participate in the economic growth of the country on the other hand the possibility of overvaluation and promoters cashing out at high prices can lead to significant losses for new investors if the broader market experiences a correction for investors considering entering through ipos it is critical to evaluate the fundamentals of the companies going public and not get swept up in the hype the broader market may be at a high but a sound strategy focused on due diligence risk assessment and a long term perspective can help navigate the opportunities and pitfalls of this burgeoning ipo landscape the surge in ipo activity in india reflects both the enthusiasm of investors and the vitality of the indian economy however market participants need to stay vigilant and recognise the risks associated with a booming ipo market whether this frenzy is a bubble waiting to burst or a calculated opportunity for entering the market depends largely on the approach investors take with regulatory changes in place and a more balanced allotment system the stage is set for a more inclusive and robust market environment provided investors make informed decisions the author is ceo of hedged in","timestamp":"2024-10-07T17:40:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}