{"url":"https://www.livemint.com/market/stock-market-news/diffusion-engineers-shares-list-at-rs-193-50-on-nse-a-premium-of-15-2-from-ipo-price-of-rs-168-11728012916228.html","title":"Diffusion Engineers shares list at  ₹193.50 on NSE, a premium of 15.2% from IPO price of  ₹168","description":"Shares of Diffusion Engineers made a decent debut on the bourses on Friday, October 4, as they listed at  ₹193.50 on NSE, a premium of 15.2 percent over the IPO price of  ₹168. Meanwhile, on BSE, the stock listed at  ₹188, up 12 percent over the issue price.","content":"Diffusion Engineers IPO Listing: Shares of Diffusion Engineers made a decent debut on the bourses on Friday, October 4, as they listed at  ₹193.50 on NSE, a premium of 15.2 percent over the IPO price of  ₹168. Meanwhile, on BSE, the stock listed at  ₹188, up 12 percent over the issue price.The initial public offering (IPO), valued at  ₹158 crore, was open for subscription from September 26 to September 30. The IPO was priced in the range of  ₹159-168 per share.Following the three-day bidding process, Diffusion Engineers IPO closed with an overwhelming demand as the issue was subscribed 213.41 times. The IPO received bids for 234.59 crore shares against 1.09 crore shares on offer. The retail investor segment saw a subscription of 96.74 times, while the non-institutional investors (NII) category was booked a massive 430.54 times. Meanwhile, the qualified institutional buyers (QIBs) quota was subscribed 253.04 times.The Diffusion Engineers IPO was entirely a fresh issue of 94 lakh shares. There was no offer-for-sale component in the IPO. The minimum application size for retail investors was set at 88 shares, requiring an investment of  ₹14,784. Investors could bid for a minimum of 88 shares and in multiples thereof. The IPO allotment date was October 1.“Diffusion Engineers Ltd has garnered considerable attention for its IPO, with a subscription rate surpassing 114 times. The company is poised for a strong stock market debut on October 4, 2024, with an anticipated premium of approximately 33% over the upper price band,” said Akriti Mehrotra, Research Analyst, StoxBox.Diffusion Engineers IPO reserved 20% of the issue for QIBs, 15% for NIIs, and 35% for retail investors. The issue includes a reservation of up to 50,000 shares for employees offered at a discount of  ₹8 to the issue price.The company plans to use the net proceeds from the issue to fund several objectives, including capital expenditures for expanding its existing manufacturing facility at Khasra No. 36, 38/1, 38/2, 38/3, Khapri (Uma), Nagpur, Maharashtra. Additionally, it aims to establish a new manufacturing facility in Nagpur, Maharashtra. The funds will also support the company's working capital requirements and be allocated for general corporate purposes.Unistone Capital Pvt Ltd is the book running lead manager of the Diffusion Engineers IPO, while Bigshare Services Pvt Ltd is the registrar for the issue.Established in 1982, Diffusion Engineers Limited specializes in manufacturing welding consumables, wear plates, parts, and heavy machinery for core industries. The company provides repair and reconditioning services for heavy machinery and also trades in wear protection powders, welding, and cutting machines. It operates four manufacturing units, three of which are located in Nagpur's Hingna Industrial Area, while the fourth, at Khapri (Uma), Nagpur, handles product processing and manufacturing.Diffusion Engineers ranks among the top three industry players in terms of CAGR for operating income, profitability, and EBITDA between FY21 and FY24, with a notable revenue growth of 16.6% CAGR from FY22 to FY24. Its profit after tax (PAT) increased significantly from  ₹17 crore in FY22 to  ₹30.80 crore in FY24.","cleaned_content":"diffusion engineers ipo listing shares of diffusion engineers made a decent debut on the bourses on friday october \u003cFOUR_\u003e as they listed at \u003cONE_HUNDRED\u003e on nse a premium of \u003cONE_TEN_PERCENT\u003e over the ipo price of \u003cONE_HUNDRED\u003e meanwhile on bse the stock listed at \u003cONE_HUNDRED\u003e up \u003cONE_TEN_PERCENT\u003e over the issue price the initial public offering ipo valued at \u003cONE_HUNDRED\u003e crore was open for subscription from september \u003cTWO_TEN\u003e to september \u003cTHREE_TEN\u003e the ipo was priced in the range of \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e per share following the three day bidding process diffusion engineers ipo closed with an overwhelming demand as the issue was subscribed \u003cTWO_HUNDRED\u003e times the ipo received bids for \u003cTWO_HUNDRED\u003e crore shares against \u003cONE_\u003e crore shares on offer the retail investor segment saw a subscription of \u003cNINE_TEN\u003e times while the non institutional investors nii category was booked a massive \u003cFOUR_HUNDRED\u003e times meanwhile the qualified institutional buyers qibs quota was subscribed \u003cTWO_HUNDRED\u003e times the diffusion engineers ipo was entirely a fresh issue of \u003cNINE_TEN\u003e lakh shares there was no offer for sale component in the ipo the minimum application size for retail investors was set at \u003cEIGHT_TEN\u003e shares requiring an investment of \u003cONE_TEN_THOUSAND\u003e investors could bid for a minimum of \u003cEIGHT_TEN\u003e shares and in multiples thereof the ipo allotment date was october \u003cONE_\u003e diffusion engineers ltd has garnered considerable attention for its ipo with a subscription rate surpassing \u003cONE_HUNDRED\u003e times the company is poised for a strong stock market debut on october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e with an anticipated premium of approximately \u003cTHREE_TEN_PERCENT\u003e over the upper price band said akriti mehrotra research analyst stoxbox diffusion engineers ipo reserved \u003cTWO_TEN_PERCENT\u003e of the issue for qibs \u003cONE_TEN_PERCENT\u003e for niis and \u003cTHREE_TEN_PERCENT\u003e for retail investors the issue includes a reservation of up to \u003cFIVE_TEN_THOUSAND\u003e shares for employees offered at a discount of \u003cEIGHT_\u003e to the issue price the company plans to use the net proceeds from the issue to fund several objectives including capital expenditures for expanding its existing manufacturing facility at khasra no \u003cTHREE_TEN\u003e \u003cTHREE_TEN\u003e \u003cONE_\u003e \u003cTHREE_TEN\u003e \u003cTWO_\u003e \u003cTHREE_TEN\u003e \u003cTHREE_\u003e khapri uma nagpur maharashtra additionally it aims to establish a new manufacturing facility in nagpur maharashtra the funds will also support the companys working capital requirements and be allocated for general corporate purposes unistone capital pvt ltd is the book running lead manager of the diffusion engineers ipo while bigshare services pvt ltd is the registrar for the issue established in \u003cONE_THOUSAND\u003e diffusion engineers limited specializes in manufacturing welding consumables wear plates parts and heavy machinery for core industries the company provides repair and reconditioning services for heavy machinery and also trades in wear protection powders welding and cutting machines it operates four manufacturing units three of which are located in nagpurs hingna industrial area while the fourth at khapri uma nagpur handles product processing and manufacturing diffusion engineers ranks among the top three industry players in terms of cagr for operating income profitability and ebitda between fy21 and fy24 with a notable revenue growth of \u003cONE_TEN_PERCENT\u003e cagr from fy22 to fy24 its profit after tax pat increased significantly from \u003cONE_TEN\u003e crore in fy22 to \u003cTHREE_TEN\u003e crore in fy24","timestamp":"2024-10-04T10:05:00+05:30","market_timestamp":"2024-10-04T10:05:00+05:30","off_market_hours":false}