{"url":"https://www.livemint.com/market/stock-market-news/rs-6-50-to-rs-680-small-cap-penny-stock-turns-multibagger-in-four-years-turns-rs-1-lakh-to-rs-1-crore-11728114106046.html","title":"₹6.50 to  ₹680: Small-cap penny stock turns multibagger in four years, turns  ₹1 lakh to  ₹1 crore","description":"Multibagger stock: The small-cap stock turned  ₹1 lakh into  ₹4 lakh in one year","content":"Multibagger stock: As Rome was not built in a day, a stock market investor can't become rich overnight. It is often said that money is not in buying and selling stocks but in waiting. One must look at the journey of Transformers and Rectifiers (India) shares to understand how a long-term investor enjoys wealth creation. This small-cap stock has risen from  ₹6.50 apiece to  ₹680 per share mark since 9th April 2020. This means the small-cap penny stock has become one of the multibagger stocks of the Indian stock market in the near four years. It is one of the 100 baggers the Indian stock market has delivered in recent years.This small-cap multibagger penny stock has remained in a base-building mode in one month, losing around 7%. However, in the last six months, the multibagger stock has surged from around  ₹4656 to  ₹680 apiece on the BSE, recording a nearly 45% rally. In YTD time, the multibagger penny stock has risen from almost  ₹238.70 to  ₹680 per share mark, recording a 185% rise in this time horizon. Likewise, this multibagger stock has surged from  ₹172 to  ₹680 per share in one year, logging around 300% rally.On 9th April 2020, this small-cap multibagger penny stock was available at around  ₹6.50 apiece on the BSE. This means this penny stock has surged from  ₹6.50 apiece to  ₹680 per share mark in nearly four years, delivering around 10,350% returns to its positional shareholders.Taking a cue from Transformers and Rectifiers India's share price history, if an investor had invested  ₹1 lakh in this small-cap stock one month ago, its  ₹1 lakh would have turned into  ₹93,000 in this time. If the investor had invested  ₹1 lakh in this small-cap multibagger stock six months ago, its  ₹1 lakh would have turned to  ₹1.45 lakh today. Similarly, if an investor had invested  ₹1 lakh in this multibagger penny stock one year ago, its  ₹1 lakh would have turned to  ₹4 lakh today.However, if an investor had done bottom fishing in this multibagger penny stock during the COVID-19 sell-off in April 2020, investing  ₹1 lakh in this small-cap stock, its  ₹1 lakh would have turned into  ₹1.04 crore. However, this could have become possible only when the investor remained invested throughout the abovementioned periods.Transformers and Rectifiers India shares are available for trade on the BSE and NSE. Its current market cap is  ₹8,958 crore. It ended on Friday with a trade volume of 1,31,520. Its 52-week high on the BSE is  ₹845.70 apiece, whereas its 52-week low is  ₹142.10 per share.","cleaned_content":"multibagger stock as rome was not built in a day a stock market investor cant become rich overnight it is often said that money is not in buying and selling stocks but in waiting one must look at the journey of transformers and rectifiers india shares to understand how a long term investor enjoys wealth creation this small cap stock has risen from \u003cSIX_\u003e apiece to \u003cSIX_HUNDRED\u003e per share mark since \u003cNINE_\u003e th april \u003cTWO_THOUSAND\u003e this means the small cap penny stock has become one of the multibagger stocks of the indian stock market in the near four years it is one of the \u003cONE_HUNDRED\u003e baggers the indian stock market has delivered in recent years this small cap multibagger penny stock has remained in a base building mode in one month losing around \u003cSEVEN_PERCENT\u003e however in the last six months the multibagger stock has surged from around \u003cFOUR_THOUSAND\u003e to \u003cSIX_HUNDRED\u003e apiece on the bse recording a nearly \u003cFOUR_TEN_PERCENT\u003e rally in ytd time the multibagger penny stock has risen from almost \u003cTWO_HUNDRED\u003e to \u003cSIX_HUNDRED\u003e per share mark recording a \u003cONE_HUNDRED_PERCENT\u003e rise in this time horizon likewise this multibagger stock has surged from \u003cONE_HUNDRED\u003e to \u003cSIX_HUNDRED\u003e per share in one year logging around \u003cTHREE_HUNDRED_PERCENT\u003e rally on \u003cNINE_\u003e th april \u003cTWO_THOUSAND\u003e this small cap multibagger penny stock was available at around \u003cSIX_\u003e apiece on the bse this means this penny stock has surged from \u003cSIX_\u003e apiece to \u003cSIX_HUNDRED\u003e per share mark in nearly four years delivering around \u003cONE_TEN_THOUSAND_PERCENT\u003e returns to its positional shareholders taking a cue from transformers and rectifiers indias share price history if an investor had invested \u003cONE_\u003e lakh in this small cap stock one month ago its \u003cONE_\u003e lakh would have turned into \u003cNINE_TEN_THOUSAND\u003e in this time if the investor had invested \u003cONE_\u003e lakh in this small cap multibagger stock six months ago its \u003cONE_\u003e lakh would have turned to \u003cONE_\u003e lakh today similarly if an investor had invested \u003cONE_\u003e lakh in this multibagger penny stock one year ago its \u003cONE_\u003e lakh would have turned to \u003cFOUR_\u003e lakh today however if an investor had done bottom fishing in this multibagger penny stock during the covid \u003cONE_TEN\u003e sell off in april \u003cTWO_THOUSAND\u003e investing \u003cONE_\u003e lakh in this small cap stock its \u003cONE_\u003e lakh would have turned into \u003cONE_\u003e crore however this could have become possible only when the investor remained invested throughout the abovementioned periods transformers and rectifiers india shares are available for trade on the bse and nse its current market cap is \u003cEIGHT_THOUSAND\u003e crore it ended on friday with a trade volume of \u003cONE_HUNDRED_THOUSAND\u003e its \u003cFIVE_TEN\u003e week high on the bse is \u003cEIGHT_HUNDRED\u003e apiece whereas its \u003cFIVE_TEN\u003e week low is \u003cONE_HUNDRED\u003e per share","timestamp":"2024-10-07T08:37:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}