{"url":"https://www.livemint.com/market/stock-market-news/nifty-auto-plunges-7-7-in-just-5-sessions-tvs-motor-bajaj-auto-fall-up-to-113-11728288562186.html","title":"Nifty Auto plunges 7.7% in just 5 sessions; TVS Motor, Bajaj Auto fall up to 11%","description":"The Nifty Auto pack has seen a significant decline of 7.7 per cent over the last five sessions. TVS, with an over 11% fall has emerged as the worst performer. Bajaj Auto, Eicher Motors and Samvardhana Motherson International also experienced notable drops during this period.","content":"Indian auto stocks have emerged as one of the biggest casualties of the recent sell-off in the stock market, triggered by escalating tensions between Iran and Israel. Moreover, a slowdown in automobile sales in September and a weak outlook by major global car manufacturers are other factors exerting pressure on auto stocks.Against this backdrop, the Nifty Auto index extended its losing streak to the fifth consecutive trading session on Monday, declining 1.50% to 25,544. From its peak of 27,696, scaled on September 27, the index has fallen 7.7%.TVS shares have emerged as the biggest index laggards during this period, falling 11.3%. They are closely followed by Bajaj Auto and Eicher Motors, both of which lost 10% each. Hero MotoCorp and Samvardhana Motherson International also experienced notable drops of 8% and 10%, respectively.Maruti Suzuki India stock declined by 9%, while shares of Ashok Leyland and MRF recorded a fall of 10% each. Tata Motors dropped by 8.5%, Bharat Forge by 8%, Mahindra \u0026 Mahindra by 7%, and Bosch by 5% in the last five trading sessions.The latest data released by the Federation of Automobile Dealers Association (FADA) indicated persistent challenges in the automobile sector, with sales declining continuously amid waning consumer demand. Even the festive occasions of Ganesh Chaturthi and Onam failed to stimulate demand.The 2-wheeler retail sales declined by 10% month-on-month (MoM) and 8.5% year-on-year (YoY) due to low consumer sentiment, poor inquiries, and reduced walk-ins. Seasonal factors like the Shraddh period, Pitrapaksha, and heavy rains further played spoilsport, resulting in delayed purchases and a subdued market environment.In the passenger vehicle (PV) category, retail sales plummeted by 10.8% MoM and 18.81% YoY, the FADA data showed.\"Seasonal factors such as Shraddh and Pitrapaksha, coupled with heavy rainfall and a sluggish economy, have exacerbated the situation, leaving dealers with historically high inventory levels of 80-85 days—equivalent to 7.9 lakh vehicles worth  ₹79,000 crore,\" said FADA President, C S Vigneshwar.\"Given the critical festive season around the corner, FADA urges OEMs to take immediate corrective measures to avoid a financial setback. FADA also calls on the Reserve Bank of India to issue an advisory to banks, mandating stricter channel funding policies based only on dealer consent and on actual collateral, to prevent dealers from facing additional financial pressure due to unsold stock. This is the final opportunity for PV OEMs to recalibrate and support market recovery before it's too late,\" Vigneshwar added.Overall, September saw a decline 9.26% YoY decline in retail sales.The PV industry has been facing challenges due to low consumer demand and rising inventory levels. To clear their stock, manufacturers have increased discounts, but these are yet to translate into a significant improvement in sales.This surge in discounts has also raised concerns among investors, as it is likely to have a direct impact on the company's profit margins. After witnessing robust double-digit growth in FY22, FY23, and FY24, primarily fueled by the post-COVID demand recovery, PV sales have significantly slowed down, particularly in the last three months.Analysts have projected a growth of 5% in PV sales in FY25, in contrast to over 8% improvement recorded in FY24.The decline in PV sales is not limited to India; major global automotive giants are also experiencing significant challenges. All three major German automakers—Volkswagen, Mercedes-Benz Group AG, and BMW AG—have adjusted their sales forecasts for 2024 downward.Volkswagen is reportedly considering plant closures in Germany, marking a potential first in the company's history.","cleaned_content":"indian auto stocks have emerged as one of the biggest casualties of the recent sell off in the stock market triggered by escalating tensions between iran and israel moreover a slowdown in automobile sales in september and a weak outlook by major global car manufacturers are other factors exerting pressure on auto stocks against this backdrop the nifty auto index extended its losing streak to the fifth consecutive trading session on monday declining \u003cONE_PERCENT\u003e to \u003cTWO_TEN_THOUSAND\u003e from its peak of \u003cTWO_TEN_THOUSAND\u003e scaled on september \u003cTWO_TEN\u003e the index has fallen \u003cSEVEN_PERCENT\u003e tvs shares have emerged as the biggest index laggards during this period falling \u003cONE_TEN_PERCENT\u003e they are closely followed by bajaj auto and eicher motors both of which lost \u003cONE_TEN_PERCENT\u003e each hero motocorp and samvardhana motherson international also experienced notable drops of \u003cEIGHT_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively maruti suzuki india stock declined by \u003cNINE_PERCENT\u003e while shares of ashok leyland and mrf recorded a fall of \u003cONE_TEN_PERCENT\u003e each tata motors dropped by \u003cEIGHT_PERCENT\u003e bharat forge by \u003cEIGHT_PERCENT\u003e mahindra mahindra by \u003cSEVEN_PERCENT\u003e and bosch by \u003cFIVE_PERCENT\u003e in the last five trading sessions the latest data released by the federation of automobile dealers association fada indicated persistent challenges in the automobile sector with sales declining continuously amid waning consumer demand even the festive occasions of ganesh chaturthi and onam failed to stimulate demand the \u003cTWO_\u003e wheeler retail sales declined by \u003cONE_TEN_PERCENT\u003e month on month mom and \u003cEIGHT_PERCENT\u003e year on year yoy due to low consumer sentiment poor inquiries and reduced walk ins seasonal factors like the shraddh period pitrapaksha and heavy rains further played spoilsport resulting in delayed purchases and a subdued market environment in the passenger vehicle pv category retail sales plummeted by \u003cONE_TEN_PERCENT\u003e mom and \u003cONE_TEN_PERCENT\u003e yoy the fada data showed seasonal factors such as shraddh and pitrapaksha coupled with heavy rainfall and a sluggish economy have exacerbated the situation leaving dealers with historically high inventory levels of \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN\u003e days equivalent to \u003cSEVEN_\u003e lakh vehicles worth \u003cSEVEN_TEN_THOUSAND\u003e crore said fada president c s vigneshwar given the critical festive season around the corner fada urges oems to take immediate corrective measures to avoid a financial setback fada also calls on the reserve bank of india to issue an advisory to banks mandating stricter channel funding policies based only on dealer consent and on actual collateral to prevent dealers from facing additional financial pressure due to unsold stock this is the final opportunity for pv oems to recalibrate and support market recovery before its too late vigneshwar added overall september saw a decline \u003cNINE_PERCENT\u003e yoy decline in retail sales the pv industry has been facing challenges due to low consumer demand and rising inventory levels to clear their stock manufacturers have increased discounts but these are yet to translate into a significant improvement in sales this surge in discounts has also raised concerns among investors as it is likely to have a direct impact on the companys profit margins after witnessing robust double digit growth in fy22 fy23 and fy24 primarily fueled by the post covid demand recovery pv sales have significantly slowed down particularly in the last three months analysts have projected a growth of \u003cFIVE_PERCENT\u003e in pv sales in fy25 in contrast to over \u003cEIGHT_PERCENT\u003e improvement recorded in fy24 the decline in pv sales is not limited to india major global automotive giants are also experiencing significant challenges all three major german automakers volkswagen mercedes benz group ag and bmw ag have adjusted their sales forecasts for \u003cTWO_THOUSAND\u003e downward volkswagen is reportedly considering plant closures in germany marking a potential first in the companys history","timestamp":"2024-10-07T15:16:00+05:30","market_timestamp":"2024-10-07T15:16:00+05:30","off_market_hours":false}