{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-wall-street-rises-to-close-its-latest-record-setting-week-as-banks-jump-11728678489962.html","title":"Stock market today: Wall Street rises to close its latest record-setting week as banks jump","description":"Stock market today: Wall Street rises to close its latest record-setting week as banks jump","content":"NEW YORK — U.S. stocks rose to records Friday as big banks rallied following a run of reassuring profit reports.The S\u0026P 500 climbed 0.6% to top its all-time high set earlier in the week and close out its fifth straight winning week, while the Dow Jones Industrial Average jumped 409 points, or 1%, to set its own record. The Nasdaq composite lagged the market with a gain of 0.3% after a slide for Tesla kept it in check.Wells Fargo rose 5.6% after reporting stronger profit for the latest quarter than analysts expected. It benefited from better results from its venture-capital investments and higher fees for investment-banking services, among other things.Banks and other financial giants traditionally kick off each earnings reporting season, and JPMorgan Chase climbed 4.4% after reporting a milder drop in profit than analysts feared. It was the strongest single force pushing upward on the S\u0026P 500.CEO Jamie Dimon said the nation’s largest bank is also still buying back shares of its stock to send cash to investors, but the pace is modest “given that market levels are at least slightly inflated.”BlackRock, meanwhile, rose 3.6% after likewise delivering better profit for the latest quarter than analysts expected. The investment giant ended September managing a record $11.5 trillion in total assets for its customers.The gains for banks helped make up for the drag of Tesla, which tumbled 8.8% and was the heaviest weight on the market. The electric-vehicle maker unveiled its long-awaited robotaxi on Thursday night, but critics highlighted a lack of details about its planned rollout.Following the unveiling of the “Cybercab,” potential rival Uber Technologies jumped 10.8% and was one of the strongest forces lifting the S\u0026P 500. Lyft rose 9.6%.All told, the S\u0026P 500 rose 34.98 points to 5,815.03. The Dow rallied 409.74 to 42,863.86, and the Nasdaq composite gained 60.89 to 18,342.94.Another automaker, Stellantis, saw its European-traded shares sink 2.8% after it announced some significant leadership changes, including the timing of CEO Carlos Tavares’ retirement. Its chief financial officer is also departing as the company formed by the merger of PSA Peugeot and Fiat Chrysler struggles to revive sales in North America.In the bond market, Treasury yields were mixed following the latest updates on inflation at the wholesale level and on sentiment among U.S. consumers.Prices paid by producers were 1.8% higher in September than a year earlier. That was an improvement from August’s year-over-year inflation level, but not as much as economists expected. Analysts said it likely helped calm worries stirred a day earlier, when a report showed inflation at the consumer level wasn’t cooling as quickly as economists expected.A separate report on Friday suggested sentiment among U.S. consumers is lower than economists expected. But the preliminary reading's decline in sentiment was still within the margin of error, according to Joanne Hsu, director of the University of Michigan's Surveys of Consumers.After Friday’s reports, traders built their bets that the Federal Reserve would cut its main interest rate by a quarter of a percentage point at its next meeting, according to data from CME Group.They've pared back their expectations from earlier this month, when some traders were betting on the possibility for another larger-than-usual cut of half a percentage point in November. A run of stronger-than-expected data on the economy recently has wiped out such calls.Regardless of how much the Fed cuts rates by at its next meeting, the longer-term trend for interest rates remains downward, according to Solita Marcelli, chief investment officer Americas, at UBS Global Wealth Management. That should offer an upward push to stock prices generally.The Fed last month cut its main interest rate from a two-decade high as it widens its focus to include keeping the economy humming instead of just fighting high inflation.The yield on the 10-year Treasury rose to 4.09% from 4.07% late Thursday. The two-year yield, which more closely tracks expectations for the Fed’s upcoming moves, edged down to 3.95% from 3.96%.In markets abroad, stocks fell 2.5% in Shanghai for their latest sharp swing ahead of a briefing scheduled for Saturday by China’s Finance Ministry. Investors hope it will unveil a big stimulus plan for the world's second-largest economy.South Korea's Kospi slipped 0.1% after its central bank cut interest rates for the first time in more than four years in hopes of boosting its economy.Business Writers Matt Ott and Zimo Zhong contributed.This article was generated from an automated news agency feed without modifications to text.","cleaned_content":"new york u s stocks rose to records friday as big banks rallied following a run of reassuring profit reports the s p \u003cFIVE_HUNDRED\u003e climbed \u003cZERO_PERCENT\u003e to top its all time high set earlier in the week and close out its fifth straight winning week while the dow jones industrial average jumped \u003cFOUR_HUNDRED\u003e points or \u003cONE_PERCENT\u003e to set its own record the nasdaq composite lagged the market with a gain of \u003cZERO_PERCENT\u003e after a slide for tesla kept it in check wells fargo rose \u003cFIVE_PERCENT\u003e after reporting stronger profit for the latest quarter than analysts expected it benefited from better results from its venture capital investments and higher fees for investment banking services among other things banks and other financial giants traditionally kick off each earnings reporting season and jpmorgan chase climbed \u003cFOUR_PERCENT\u003e after reporting a milder drop in profit than analysts feared it was the strongest single force pushing upward on the s p \u003cFIVE_HUNDRED\u003e ceo jamie dimon said the nation s largest bank is also still buying back shares of its stock to send cash to investors but the pace is modest given that market levels are at least slightly inflated blackrock meanwhile rose \u003cTHREE_PERCENT\u003e after likewise delivering better profit for the latest quarter than analysts expected the investment giant ended september managing a record \u003cONE_TEN\u003e trillion in total assets for its customers the gains for banks helped make up for the drag of tesla which tumbled \u003cEIGHT_PERCENT\u003e and was the heaviest weight on the market the electric vehicle maker unveiled its long awaited robotaxi on thursday night but critics highlighted a lack of details about its planned rollout following the unveiling of the cybercab potential rival uber technologies jumped \u003cONE_TEN_PERCENT\u003e and was one of the strongest forces lifting the s p \u003cFIVE_HUNDRED\u003e lyft rose \u003cNINE_PERCENT\u003e all told the s p \u003cFIVE_HUNDRED\u003e rose \u003cTHREE_TEN\u003e points to \u003cFIVE_THOUSAND\u003e the dow rallied \u003cFOUR_HUNDRED\u003e to \u003cFOUR_TEN_THOUSAND\u003e and the nasdaq composite gained \u003cSIX_TEN\u003e to \u003cONE_TEN_THOUSAND\u003e another automaker stellantis saw its european traded shares sink \u003cTWO_PERCENT\u003e after it announced some significant leadership changes including the timing of ceo carlos tavares retirement its chief financial officer is also departing as the company formed by the merger of psa peugeot and fiat chrysler struggles to revive sales in north america in the bond market treasury yields were mixed following the latest updates on inflation at the wholesale level and on sentiment among u s consumers prices paid by producers were \u003cONE_PERCENT\u003e higher in september than a year earlier that was an improvement from august s year over year inflation level but not as much as economists expected analysts said it likely helped calm worries stirred a day earlier when a report showed inflation at the consumer level wasn t cooling as quickly as economists expected a separate report on friday suggested sentiment among u s consumers is lower than economists expected but the preliminary readings decline in sentiment was still within the margin of error according to joanne hsu director of the university of michigans surveys of consumers after friday s reports traders built their bets that the federal reserve would cut its main interest rate by a quarter of a percentage point at its next meeting according to data from cme group theyve pared back their expectations from earlier this month when some traders were betting on the possibility for another larger than usual cut of half a percentage point in november a run of stronger than expected data on the economy recently has wiped out such calls regardless of how much the fed cuts rates by at its next meeting the longer term trend for interest rates remains downward according to solita marcelli chief investment officer americas at ubs global wealth management that should offer an upward push to stock prices generally the fed last month cut its main interest rate from a two decade high as it widens its focus to include keeping the economy humming instead of just fighting high inflation the yield on the \u003cONE_TEN\u003e year treasury rose to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e late thursday the two year yield which more closely tracks expectations for the fed s upcoming moves edged down to \u003cTHREE_PERCENT\u003e from \u003cTHREE_PERCENT\u003e in markets abroad stocks fell \u003cTWO_PERCENT\u003e in shanghai for their latest sharp swing ahead of a briefing scheduled for saturday by china s finance ministry investors hope it will unveil a big stimulus plan for the worlds second largest economy south koreas kospi slipped \u003cZERO_PERCENT\u003e after its central bank cut interest rates for the first time in more than four years in hopes of boosting its economy business writers matt ott and zimo zhong contributed this article was generated from an automated news agency feed without modifications to text","timestamp":"2024-10-12T01:58:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}