{"url":"https://www.livemint.com/market/stock-market-news/multibagger-small-cap-stock-eraaya-lifespaces-inks-major-contract-worth-138-crore-with-punjab-national-bank-11728280489101.html","title":"Multibagger small-cap stock: Eraaya Lifespaces inks major contract worth  ₹138 crore with Punjab National Bank","description":"Multibagger small-cap stock: Eraaya Lifespaces, a small-cap company, has secured a major contract for its subsidiary Ebix Cash with Punjab National Bank (PNB).","content":"Multibagger small-cap stock: Eraaya Lifespaces on Monday, October 7 announced that its recently-acquired subsidiary, Ebix Cash Limited, has secured a significant contract from Punjab National Bank (PNB), one of India's top three public sector banks. The contract, valued at approximately  ₹138.75 crore, is for Network Integrating Services and has been awarded for a period of three years.The scope of the agreement includes managing PNB’s extensive network, which covers 10,800 branches, 5,000 ATMs, and 4,000 branches of PNB-sponsored Regional Rural Banks. Ebix Cash will also oversee the bank’s state-of-the-art Data Centre in Delhi, the Advanced Network Operations Centre, and the Disaster Recovery Centre in Mumbai, along with 13 zonal offices and 131 circle offices.Eraaya Lifespaces stock has seen a stellar rise, rallying 7,500 per cent in just one year. This multibagger stock has been consistently hitting the upper circuit, attracting widespread attention from investors.However, Eraaya Lifespaces share prices were trading in the red today, down 5 per cent at  ₹2895.85 around 12:10 pm amid weak market mood and profit taking at higher levels by the company's investors. Eraaya Lifespaces enjoys a market capitalisation of  ₹5,323.83 crore.“Today marks a pivotal moment as we reflect on our achievements while embracing the promising resurgence that lies ahead,” said Vikas Garg, the entrepreneur leading Eraaya and Ebix Cash. He added, “This renewed partnership reinforces our commitment to delivering integrated solutions that empower financial institutions across the nation.”With over 1,100 personnel dedicated to this project, including 600+ Ebix employees, the team will be responsible for maintaining and optimising PNB’s expansive network, addressing technical issues, and ensuring smooth operations at over 20,000 locations nationwide.","cleaned_content":"multibagger small cap stock eraaya lifespaces on monday october \u003cSEVEN_\u003e announced that its recently acquired subsidiary ebix cash limited has secured a significant contract from punjab national bank pnb one of indias top three public sector banks the contract valued at approximately \u003cONE_HUNDRED\u003e crore is for network integrating services and has been awarded for a period of three years the scope of the agreement includes managing pnb s extensive network which covers \u003cONE_TEN_THOUSAND\u003e branches \u003cFIVE_THOUSAND\u003e atms and \u003cFOUR_THOUSAND\u003e branches of pnb sponsored regional rural banks ebix cash will also oversee the bank s state of the art data centre in delhi the advanced network operations centre and the disaster recovery centre in mumbai along with \u003cONE_TEN\u003e zonal offices and \u003cONE_HUNDRED\u003e circle offices eraaya lifespaces stock has seen a stellar rise rallying \u003cSEVEN_THOUSAND_PERCENT\u003e in just one year this multibagger stock has been consistently hitting the upper circuit attracting widespread attention from investors however eraaya lifespaces share prices were trading in the red today down \u003cFIVE_PERCENT\u003e at \u003cTWO_THOUSAND\u003e around \u003cONE_TEN\u003e \u003cONE_TEN\u003e pm amid weak market mood and profit taking at higher levels by the companys investors eraaya lifespaces enjoys a market capitalisation of \u003cFIVE_THOUSAND\u003e crore today marks a pivotal moment as we reflect on our achievements while embracing the promising resurgence that lies ahead said vikas garg the entrepreneur leading eraaya and ebix cash he added this renewed partnership reinforces our commitment to delivering integrated solutions that empower financial institutions across the nation with over \u003cONE_THOUSAND\u003e personnel dedicated to this project including \u003cSIX_HUNDRED\u003e ebix employees the team will be responsible for maintaining and optimising pnb s expansive network addressing technical issues and ensuring smooth operations at over \u003cTWO_TEN_THOUSAND\u003e locations nationwide","timestamp":"2024-10-07T11:54:00+05:30","market_timestamp":"2024-10-07T11:54:00+05:30","off_market_hours":false}