{"url":"https://www.livemint.com/market/stock-market-news/defence-psu-stocks-tank-up-to-45-from-recent-peaks-is-it-a-buying-opportunity-11728357997030.html","title":"Defence PSU stocks tank up to 45% from recent peaks. Is it a buying opportunity?","description":"Defence stocks have seen a significant decline after a two-year surge, with a 36-45% drop from their recent peak levels. Investors should be cautious, as recovery may take years. High valuations have raised concerns, and analysts advise against trying to capitalise on the correction.","content":"Indian PSU stocks, which rallied substantially in the first half of the current year with seemingly no limit to their upside, have failed to escape the recent market sell-off. While some recovery was visible in stocks of these public sector companies in Tuesday's session, they still continue to trade at multi-month lows.Notably, defence PSU stocks are now trading at levels unseen in the past six months, underscoring the extent of the correction in the current market. In contrast to broader market gains that saw indices reaching record highs, defence PSU counters have been under pressure, experiencing a steady decline over recent months. The latest sell-off has further accelerated this downward trend, amplifying the impact on these stocks.Shares of Cochin Shipyard are currently trading at a significant 45% discount from their all-time high of  ₹2,979, reached in July. The stock experienced a sharp decline of 28% in August, followed by a further drop of 7.75% in September. At the current market price of  ₹1,643 apiece, the stock is trading at a 6-month low.Similarly, the stock of Garden Reach Shipbuilders \u0026 Engineers has fallen 41% from its all-time high level. Mazagon Dock Shipbuilders has also experienced a significant sell-off, with its stock reaching a four-month low and declining by 30.36% from its recent peak of  ₹5,860 apiece.Other defence stocks, such as Bharat Dynamics, Bharat Electronics, and Hindustan Aeronautics, BEML are also down by as much as 36% from their recent highs.Analysts have previously cautioned about the elevated valuations of defence stocks. In the first half of the current year, the surge in these stocks was largely fueled by consistent order wins, which highlighted the sector's growth potential. Additionally, the formation of a BJP-led NDA government at the centre reassured investors of policy continuity and political stability, which contributed to the continued rally in the stocks.Following the recent steep decline, analysts are not anticipating a near-term recovery in these stocks. Most recommend caution, advising investors against attempting to capitalise on the correction through bottom fishingAman Soni, Head of Operations at Prudent Equity said, \"The saying \"the bigger they are, the harder they fall\" rings true for the recent downturn in defence stocks, which have seen significant rise over the past 24 months, with some soaring over tenfold. It is essential to recognize that a 25-30% decline from peak levels is not unusual and can largely be attributed to routine profit-taking by other investors.\"Soni further explained that valuations in the defence sector have been elevated for some time, making a correction inevitable as the market seeks to revert to its mean. He advised investors with direct stock allocations in this sector to exercise caution, noting that it may take years for some stocks to regain their previous highs. A more strategic approach, focused on appropriate sector allocation, is advisable in this environment.When asked whether investors should consider entering defence stocks at their current levels, Aman Soni said that in every bull cycle, the leaders of today are often not the leaders of tomorrow. He stated that new investors frequently fall into the trap of recency bias, allocating capital to assets with high valuations, which can be risky.\"Even seasoned fund managers are grappling to justify the current valuations in the defence sector. While the recent decline in defence stocks may prompt some investors to consider entering at these lower levels, caution is warranted,\" he added.","cleaned_content":"indian psu stocks which rallied substantially in the first half of the current year with seemingly no limit to their upside have failed to escape the recent market sell off while some recovery was visible in stocks of these public sector companies in tuesdays session they still continue to trade at multi month lows notably defence psu stocks are now trading at levels unseen in the past six months underscoring the extent of the correction in the current market in contrast to broader market gains that saw indices reaching record highs defence psu counters have been under pressure experiencing a steady decline over recent months the latest sell off has further accelerated this downward trend amplifying the impact on these stocks shares of cochin shipyard are currently trading at a significant \u003cFOUR_TEN_PERCENT\u003e discount from their all time high of \u003cTWO_THOUSAND\u003e reached in july the stock experienced a sharp decline of \u003cTWO_TEN_PERCENT\u003e in august followed by a further drop of \u003cSEVEN_PERCENT\u003e in september at the current market price of \u003cONE_THOUSAND\u003e apiece the stock is trading at a \u003cSIX_\u003e month low similarly the stock of garden reach shipbuilders engineers has fallen \u003cFOUR_TEN_PERCENT\u003e from its all time high level mazagon dock shipbuilders has also experienced a significant sell off with its stock reaching a four month low and declining by \u003cTHREE_TEN_PERCENT\u003e from its recent peak of \u003cFIVE_THOUSAND\u003e apiece other defence stocks such as bharat dynamics bharat electronics and hindustan aeronautics beml are also down by as much as \u003cTHREE_TEN_PERCENT\u003e from their recent highs analysts have previously cautioned about the elevated valuations of defence stocks in the first half of the current year the surge in these stocks was largely fueled by consistent order wins which highlighted the sectors growth potential additionally the formation of a bjp led nda government at the centre reassured investors of policy continuity and political stability which contributed to the continued rally in the stocks following the recent steep decline analysts are not anticipating a near term recovery in these stocks most recommend caution advising investors against attempting to capitalise on the correction through bottom fishingaman soni head of operations at prudent equity said the saying the bigger they are the harder they fall rings true for the recent downturn in defence stocks which have seen significant rise over the past \u003cTWO_TEN\u003e months with some soaring over tenfold it is essential to recognize that a \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e decline from peak levels is not unusual and can largely be attributed to routine profit taking by other investors soni further explained that valuations in the defence sector have been elevated for some time making a correction inevitable as the market seeks to revert to its mean he advised investors with direct stock allocations in this sector to exercise caution noting that it may take years for some stocks to regain their previous highs a more strategic approach focused on appropriate sector allocation is advisable in this environment when asked whether investors should consider entering defence stocks at their current levels aman soni said that in every bull cycle the leaders of today are often not the leaders of tomorrow he stated that new investors frequently fall into the trap of recency bias allocating capital to assets with high valuations which can be risky even seasoned fund managers are grappling to justify the current valuations in the defence sector while the recent decline in defence stocks may prompt some investors to consider entering at these lower levels caution is warranted he added","timestamp":"2024-10-09T10:11:00+05:30","market_timestamp":"2024-10-09T10:11:00+05:30","off_market_hours":false}