{"url":"https://www.livemint.com/market/stock-market-news/bank-of-maharashtra-apollo-tyres-stocks-in-focus-as-lic-raises-stake-in-these-companies-11728268454006.html","title":"Bank of Maharashtra, Apollo Tyres stocks in focus as LIC raises stake in these companies","description":"Stocks in focus today: The Life Insurance Corporation of India (LIC) has increased its stake in both Bank of Maharashtra and Apollo Tyres, signaling growing investor interest in these companies","content":"Stocks in focus today: The Life Insurance Corporation of India (LIC) has increased its stakes in Bank of Maharashtra and Apollo Tyres, which are expected to spark investor interest in both companies on October 7. The announcements were made through regulatory filings, disclosing LIC's growing involvement in these key sectors.Bank of Maharashtra share price closed in red, down 1.40 per cent at  ₹57.66, on October 4, on BSE. The company enjoys a market capitalisation of  ₹40,831.20 crore.Apollo Tyres' share price, too, closed in the red, down 2.81 per cent at  ₹511.00, on October 4, as per NSE. The company enjoys a market capitalisation of  ₹32,453.66 crore. Apollo Tyres stock price last hit its 52-week high at  ₹584.90, on September 26, 2024, as per NSE.Meanwhile, LIC share price closed in green, up 0.27 per cent at  ₹970.00, on October 4, on NSE. The company enjoys a market capitalisation of  ₹6,13,524.78 crore. LIC stock price hit its 52-week high at  ₹1,222.00 on August 1, 2024, as per NSE.LIC disclosed that it has raised its stake in Bank of Maharashtra through a Qualified Institutional Placement (QIP). The insurance giant increased its shareholding from 4.05% to 7.10%. This move follows the allotment of over 25.96 crore equity shares. Bank of Maharashtra, a public sector bank, is valued at  ₹40,859 crore, and its primary business segments include Treasury, Corporate/Wholesale Banking, and Retail Banking.This strategic investment is seen as part of LIC's broader focus on expanding its portfolio in the financial sector, particularly in public sector banks.In another regulatory filing, LIC announced it has slightly increased its holding in Apollo Tyres. Its stake rose from 4.98% to 5.03%, with the acquisition of an additional 3 lakh equity shares. Apollo Tyres, a leading tire manufacturer, operates globally and is known for its strong presence in the automotive sector.","cleaned_content":"stocks in focus today the life insurance corporation of india lic has increased its stakes in bank of maharashtra and apollo tyres which are expected to spark investor interest in both companies on october \u003cSEVEN_\u003e the announcements were made through regulatory filings disclosing lics growing involvement in these key sectors bank of maharashtra share price closed in red down \u003cONE_PERCENT\u003e at \u003cFIVE_TEN\u003e on october \u003cFOUR_\u003e on bse the company enjoys a market capitalisation of \u003cFOUR_TEN_THOUSAND\u003e crore apollo tyres share price too closed in the red down \u003cTWO_PERCENT\u003e at \u003cFIVE_HUNDRED\u003e on october \u003cFOUR_\u003e as per nse the company enjoys a market capitalisation of \u003cTHREE_TEN_THOUSAND\u003e crore apollo tyres stock price last hit its \u003cFIVE_TEN\u003e week high at \u003cFIVE_HUNDRED\u003e on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as per nse meanwhile lic share price closed in green up \u003cZERO_PERCENT\u003e at \u003cNINE_HUNDRED\u003e on october \u003cFOUR_\u003e on nse the company enjoys a market capitalisation of \u003cSIX_HUNDRED_THOUSAND\u003e crore lic stock price hit its \u003cFIVE_TEN\u003e week high at \u003cONE_THOUSAND\u003e on august \u003cONE_\u003e \u003cTWO_THOUSAND\u003e as per nse lic disclosed that it has raised its stake in bank of maharashtra through a qualified institutional placement qip the insurance giant increased its shareholding from \u003cFOUR_PERCENT\u003e to \u003cSEVEN_PERCENT\u003e this move follows the allotment of over \u003cTWO_TEN\u003e crore equity shares bank of maharashtra a public sector bank is valued at \u003cFOUR_TEN_THOUSAND\u003e crore and its primary business segments include treasury corporate wholesale banking and retail banking this strategic investment is seen as part of lics broader focus on expanding its portfolio in the financial sector particularly in public sector banks in another regulatory filing lic announced it has slightly increased its holding in apollo tyres its stake rose from \u003cFOUR_PERCENT\u003e to \u003cFIVE_PERCENT\u003e with the acquisition of an additional \u003cTHREE_\u003e lakh equity shares apollo tyres a leading tire manufacturer operates globally and is known for its strong presence in the automotive sector","timestamp":"2024-10-07T08:29:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}