{"url":"https://www.livemint.com/market/stock-market-news/china-hopes-and-gulf-war-bear-on-markets-even-as-domestic-investors-out-purchase-foreign-buyers-11728315444085.html","title":"China hopes and Gulf war bear on markets even as domestic investors out purchase foreign buyers","description":"India’s stock market losing streak has wiped out  ₹25 trillion of investor wealth since 27 September.","content":"Mumbai: India’s stock market pullback continued for a fifth successive day on Monday even as domestic institutional investors purchased a higher quantum of shares than foreign investors.The reason: foreign institutional investors liquidated their bullish bets on Nifty and Bank Nifty contracts, selling almost  ₹8,000 crore worth of index futures contracts in addition to cash sales, per NSE data.In cash, DIIs purchased a provisional  ₹13,245.12 crore against FII sales of a provisional  ₹8,293.41 crore on Monday, according to BSE data. Still, the Nifty tanked by 0.87% to close below the psychological 25,000 mark at 24,795.75.The key reason behind this fall was FIIs selling futures to close out their long positions. Foreign institutional investors on Monday closed out or liquidated all of their 82,987 long index (Nifty and Bank Nifty) futures contracts that were outstanding as of Friday.“The China hope trade (following the country's stimulus package) has been one of the key reasons for the FII cash selling,” said Andrew Holland, chief executive of Avendus Capital Public Market Alternate Strategies. “Now, there is also a fear that if Israel strikes Iran, oil could shoot through the roof and that could make RBI more hawkish given the rising inflationary expectations.”The China market opens on Tuesday (8 October) after a week-long holiday, The Reserve Bank of India’s Monetary Policy Committee is scheduled to hold its bi-monthly meeting from 7-9 October.“There would be some redeployment from India to China,” added Holland.On Monday, the tension on the Street was palpable, with the fear gauge, India Vix, rising almost 7% to 15.08. HDFC Bank Ltd and Reliance Industries Ltd contributed the most to the Nifty’s fall.India’s six-day stock market losing streak has wiped out  ₹25 trillion of investor wealth over five sessions since 27 September, when the Nifty hit a record high of 26,277.35.Apart from cash selling, FIIs liquidated their index futures’ long positions completely on Monday, and initiated shorts of 34,724 contracts.“They held the second-highest long index futures positions of 359,805 contracts on 23 September, which they reduced to 82,987 contracts on Friday,” said Rohit Srivastava, founder, IndiaCharts. “On Monday they closed out all of their longs, which exacerbated the fall despite absorption of their cash selling by DIIs.”After Monday’s fall, all major indices have pulled back, falling by over 5% from their highs. A pullback is a 5-10% fall from the highs. A fall between 10% and 20% is called a correction, and anything below that is considered a bear market.The Nifty ended Monday’s trading at 24,795.75, 5.64% below its record of 26,277.35 reached on 27 September. The Nifty Midcap 150 is down 5.56% from its high, while the Nifty Smallcap 250 has fallen 6.28% from its peak. The midcap index hit an all-time high of 22,515.4 on 25 September and the smallcap index reached a record 18,688.30 on 24 September.","cleaned_content":"mumbai india s stock market pullback continued for a fifth successive day on monday even as domestic institutional investors purchased a higher quantum of shares than foreign investors the reason foreign institutional investors liquidated their bullish bets on nifty and bank nifty contracts selling almost \u003cEIGHT_THOUSAND\u003e crore worth of index futures contracts in addition to cash sales per nse data in cash diis purchased a provisional \u003cONE_TEN_THOUSAND\u003e crore against fii sales of a provisional \u003cEIGHT_THOUSAND\u003e crore on monday according to bse data still the nifty tanked by \u003cZERO_PERCENT\u003e to close below the psychological \u003cTWO_TEN_THOUSAND\u003e mark at \u003cTWO_TEN_THOUSAND\u003e the key reason behind this fall was fiis selling futures to close out their long positions foreign institutional investors on monday closed out or liquidated all of their \u003cEIGHT_TEN_THOUSAND\u003e long index nifty and bank nifty futures contracts that were outstanding as of friday the china hope trade following the countrys stimulus package has been one of the key reasons for the fii cash selling said andrew holland chief executive of avendus capital public market alternate strategies now there is also a fear that if israel strikes iran oil could shoot through the roof and that could make rbi more hawkish given the rising inflationary expectations the china market opens on tuesday \u003cEIGHT_\u003e october after a week long holiday the reserve bank of india s monetary policy committee is scheduled to hold its bi monthly meeting from \u003cSEVEN_\u003e \u003cNINE_\u003e october there would be some redeployment from india to china added holland on monday the tension on the street was palpable with the fear gauge india vix rising almost \u003cSEVEN_PERCENT\u003e to \u003cONE_TEN\u003e hdfc bank ltd and reliance industries ltd contributed the most to the nifty s fall india s six day stock market losing streak has wiped out \u003cTWO_TEN\u003e trillion of investor wealth over five sessions since \u003cTWO_TEN\u003e september when the nifty hit a record high of \u003cTWO_TEN_THOUSAND\u003e apart from cash selling fiis liquidated their index futures long positions completely on monday and initiated shorts of \u003cTHREE_TEN_THOUSAND\u003e contracts they held the second highest long index futures positions of \u003cTHREE_HUNDRED_THOUSAND\u003e contracts on \u003cTWO_TEN\u003e september which they reduced to \u003cEIGHT_TEN_THOUSAND\u003e contracts on friday said rohit srivastava founder indiacharts on monday they closed out all of their longs which exacerbated the fall despite absorption of their cash selling by diis after monday s fall all major indices have pulled back falling by over \u003cFIVE_PERCENT\u003e from their highs a pullback is a \u003cFIVE_\u003e \u003cONE_TEN_PERCENT\u003e fall from the highs a fall between \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e is called a correction and anything below that is considered a bear market the nifty ended monday s trading at \u003cTWO_TEN_THOUSAND\u003e \u003cFIVE_PERCENT\u003e below its record of \u003cTWO_TEN_THOUSAND\u003e reached on \u003cTWO_TEN\u003e september the nifty midcap \u003cONE_HUNDRED\u003e is down \u003cFIVE_PERCENT\u003e from its high while the nifty smallcap \u003cTWO_HUNDRED\u003e has fallen \u003cSIX_PERCENT\u003e from its peak the midcap index hit an all time high of \u003cTWO_TEN_THOUSAND\u003e on \u003cTWO_TEN\u003e september and the smallcap index reached a record \u003cONE_TEN_THOUSAND\u003e on \u003cTWO_TEN\u003e september","timestamp":"2024-10-07T21:14:00+05:30","market_timestamp":"2024-10-08T09:15:00+05:30","off_market_hours":true}