{"url":"https://www.livemint.com/market/stock-market-news/nbcc-stock-up-overv-4-as-tock-trades-ex-bonus-today-11728274006576.html","title":"NBCC stock gains over 4% as shares trade ex-bonus today","description":"Bonus shares 2024: NBCC shares were trading over 4 per cent higher as the stock turned ex-bonus during the early trading session on October 7.","content":"Bonus shares 2024: NBCC stock gained over 4% on Monday, October 7, as the scrip turned ex-bonus today. The company had approved a bonus share issue in the ratio of 1:2 at its board meeting on August 31, 2024.NBCC's board approved the issuance of one fully paid-up equity share for every two existing shares, subject to shareholder approval at its Annual General Meeting. The record date for determining the eligibility of shareholders for the bonus shares was fixed as Monday, October 7.NBCC share price was trading in the green, up 3.75 per cent at  ₹116.90 around 9:54 am on NSE. The company enjoys a market capitalisation of  ₹31,617 crore. NBCC stock price last hit its 52-week high on August 28, 2024, at  ₹139.83 while its 52-week low stands at  ₹38.33, scaled on October 5, 2024.According to a company statement, the issuance of the bonus shares will utilise  ₹90 crore from NBCC’s free reserves, as reflected in the audited financial statements as of March 31, 2024. The company currently has reserves and a surplus of  ₹1,959 crore available for capitalisation.NBCC plans to issue a total of 90 crore new equity shares with a face value of  ₹1 each, increasing the total share capital from 180 crore shares to 270 crore shares post-bonus. The dispatch of the bonus shares is expected to be completed by October 31, 2024.","cleaned_content":"bonus shares \u003cTWO_THOUSAND\u003e nbcc stock gained over \u003cFOUR_PERCENT\u003e on monday october \u003cSEVEN_\u003e as the scrip turned ex bonus today the company had approved a bonus share issue in the ratio of \u003cONE_\u003e \u003cTWO_\u003e at its board meeting on august \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e nbccs board approved the issuance of one fully paid up equity share for every two existing shares subject to shareholder approval at its annual general meeting the record date for determining the eligibility of shareholders for the bonus shares was fixed as monday october \u003cSEVEN_\u003e nbcc share price was trading in the green up \u003cTHREE_PERCENT\u003e at \u003cONE_HUNDRED\u003e around \u003cNINE_\u003e \u003cFIVE_TEN\u003e am on nse the company enjoys a market capitalisation of \u003cTHREE_TEN_THOUSAND\u003e crore nbcc stock price last hit its \u003cFIVE_TEN\u003e week high on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e at \u003cONE_HUNDRED\u003e while its \u003cFIVE_TEN\u003e week low stands at \u003cTHREE_TEN\u003e scaled on october \u003cFIVE_\u003e \u003cTWO_THOUSAND\u003e according to a company statement the issuance of the bonus shares will utilise \u003cNINE_TEN\u003e crore from nbcc s free reserves as reflected in the audited financial statements as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company currently has reserves and a surplus of \u003cONE_THOUSAND\u003e crore available for capitalisation nbcc plans to issue a total of \u003cNINE_TEN\u003e crore new equity shares with a face value of \u003cONE_\u003e each increasing the total share capital from \u003cONE_HUNDRED\u003e crore shares to \u003cTWO_HUNDRED\u003e crore shares post bonus the dispatch of the bonus shares is expected to be completed by october \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-10-07T09:38:00+05:30","market_timestamp":"2024-10-07T09:38:00+05:30","off_market_hours":false}