{"url":"https://www.livemint.com/market/stock-market-news/warren-buffett-berkshire-hathaway-cuts-bank-of-america-boa-stake-below-10-percent-quarterly-trade-news-investors-markets-11728617300920.html","title":"Warren Buffett cuts stake in Bank of America below 10%, trade updates may slow to quarterly basis","description":"Warren Buffett's Berkshire Hathaway has reduced its stake in Bank of America to 9.99 percent, allowing for less frequent trade disclosures. This reduction could affect investor confidence and the stock's performance, as Buffett has not disclosed reasons for the sell-off.","content":"The Oracle of Omaha, Warren Buffett (94), has cut his stake in Bank of America Corporation to just below 10 per cent throughout the year, Bloomberg reported. Thus, Berkshire Hathaway can reduce disclosures as per regulatory thresholds.The Bloomberg report noted that since Berkshire's stake in BoA has dropped to 9.99 per cent, US rules now allow for quarterly updates instead of the previous timeline of a few days after each trade.In a selling spree that began mid-July, Berkshire Hathaway trimmed BoA stock in 15 rounds to gain $10.5 billion from its long-held investment in the bank. It sold off $382.4 million worth of shares over the last three days, October 10 exchange filings showed, as per the report.For fellow shareholders, however, the slower update requirement means they will not know of any further cuts from Buffett's side for months.While Buffett has not given reasons for the reduced stake despite being known to back BoA for years and the billionaire's long lent imprimatur to BoA CEO Brian Moynihan, the report added. Berkshire infused $5 billion for stocks in 2011 and applying to the Federal Reserve to increase stake above 10 per cent in 2019.Notably, Berkshire remains the bank’s biggest stockholder, with its 9,99 per cent stake worth around $31 billion at closing price on October 10.“At a minimum, we suspect this holder getting below 10 per cent would lift a psychological hurdle and could allow the stock to regain some forward momentum,” Piper Sandler analyst Scott Siefers wrote in a note this month.BoA’s stock has underperformed throughout the liquidations. It had been No. 1 in the 24-company KBW Bank Index this year as of July 16. Since then, it has been the second-worst performer. In the latest round, Berkshire unloaded $382.4 million of shares over three days.(With inputs from Bloomberg)","cleaned_content":"the oracle of omaha warren buffett \u003cNINE_TEN\u003e has cut his stake in bank of america corporation to just below \u003cONE_TEN_PERCENT\u003e throughout the year bloomberg reported thus berkshire hathaway can reduce disclosures as per regulatory thresholds the bloomberg report noted that since berkshires stake in boa has dropped to \u003cNINE_PERCENT\u003e us rules now allow for quarterly updates instead of the previous timeline of a few days after each trade in a selling spree that began mid july berkshire hathaway trimmed boa stock in \u003cONE_TEN\u003e rounds to gain \u003cONE_TEN\u003e billion from its long held investment in the bank it sold off \u003cTHREE_HUNDRED\u003e million worth of shares over the last three days october \u003cONE_TEN\u003e exchange filings showed as per the report for fellow shareholders however the slower update requirement means they will not know of any further cuts from buffetts side for months while buffett has not given reasons for the reduced stake despite being known to back boa for years and the billionaires long lent imprimatur to boa ceo brian moynihan the report added berkshire infused \u003cFIVE_\u003e billion for stocks in \u003cTWO_THOUSAND\u003e and applying to the federal reserve to increase stake above \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e notably berkshire remains the bank s biggest stockholder with its \u003cNINE_HUNDRED_PERCENT\u003e stake worth around \u003cTHREE_TEN\u003e billion at closing price on october \u003cONE_TEN\u003e at a minimum we suspect this holder getting below \u003cONE_TEN_PERCENT\u003e would lift a psychological hurdle and could allow the stock to regain some forward momentum piper sandler analyst scott siefers wrote in a note this month boa s stock has underperformed throughout the liquidations it had been no \u003cONE_\u003e in the \u003cTWO_TEN\u003e company kbw bank index this year as of july \u003cONE_TEN\u003e since then it has been the second worst performer in the latest round berkshire unloaded \u003cTHREE_HUNDRED\u003e million of shares over three days with inputs from bloomberg","timestamp":"2024-10-11T09:51:00+05:30","market_timestamp":"2024-10-11T09:51:00+05:30","off_market_hours":false}