{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-buy-anand-rathi-recommends-tatva-chintan-pharma-chem-tata-elxsi-shares-as-october-emerging-stock-picks-11728548177179.html","title":"Stocks to buy: Anand Rathi recommends these two stocks as its Emerging Picks for October","description":"Stocks to buy: Anand Rathi believes these two emerging stock picks are technically well poised to see a decent upside. It recommends buying these stocks for the timeframe of 30-90 days. Check the stocks to buy here:","content":"Indian stock market began the month of October on a weak note after a sharp rally seen last month. The benchmark indices Sensex and Nifty 50 have fallen nearly 3% this month so far dragged by persistent heavy outflows of foreign institutional funds. The Foreign Portfolio Investors (FPI) have sold Indian equities worth nearly  ₹50,300 crore in six sessions of October.The benchmark Nifty 50 has plunged 4.7% from its record high of 26,277.35 hit on September 27. Amid heightened volatility, brokerage firm Anand Rathi has recommended two stocks to buy as its Emerging Picks for the month of October.The brokerage firm believes these two emerging stock picks are technically well poised to see a decent upside. It recommends buying these stocks for the timeframe of 30-90 days.The two stocks to buy in October are Tatva Chintan Pharma Chem and Tata Elxsi.Here are the two October stock picks:Tatva Chintan Pharma Chem has been in a strong downtrend along with many of the chemical stocks. Recently the stock made lower lows but the weekly RSI failed to do the same. This has resulted in a strong positive divergence, and which indicates a possibility of reversal or bounce, Anand Rathi said.The brokerage recommends traders to buy Tatva Chintan Pharma Chem stock in the range of  ₹1,010 –  ₹990 with a stop loss of  ₹930 for upside target of  ₹1,105 and  ₹1,140.Few months back, the Tata Group stock, Tata Elxsi shares, underwent a massive rally which started from  ₹6,900 towards  ₹9,000 mark. Tata Elxsi stock has now retested that breakout point and that coincides with the placement of 200 DEMA. We are also witnessing a golden crossover of 50 DEMA with 200 DEMA, said the brokerage firm.It advises traders to go long in Tata Elxsi shares in the near  ₹7,540 level with a stop loss of  ₹6,960 for a timeframe of 30 to 90 days.","cleaned_content":"indian stock market began the month of october on a weak note after a sharp rally seen last month the benchmark indices sensex and nifty \u003cFIVE_TEN\u003e have fallen nearly \u003cTHREE_PERCENT\u003e this month so far dragged by persistent heavy outflows of foreign institutional funds the foreign portfolio investors fpi have sold indian equities worth nearly \u003cFIVE_TEN_THOUSAND\u003e crore in six sessions of october the benchmark nifty \u003cFIVE_TEN\u003e has plunged \u003cFOUR_PERCENT\u003e from its record high of \u003cTWO_TEN_THOUSAND\u003e hit on september \u003cTWO_TEN\u003e amid heightened volatility brokerage firm anand rathi has recommended two stocks to buy as its emerging picks for the month of october the brokerage firm believes these two emerging stock picks are technically well poised to see a decent upside it recommends buying these stocks for the timeframe of \u003cTHREE_TEN\u003e \u003cNINE_TEN\u003e days the two stocks to buy in october are tatva chintan pharma chem and tata elxsi here are the two october stock picks tatva chintan pharma chem has been in a strong downtrend along with many of the chemical stocks recently the stock made lower lows but the weekly rsi failed to do the same this has resulted in a strong positive divergence and which indicates a possibility of reversal or bounce anand rathi said the brokerage recommends traders to buy tatva chintan pharma chem stock in the range of \u003cONE_THOUSAND\u003e \u003cNINE_HUNDRED\u003e with a stop loss of \u003cNINE_HUNDRED\u003e for upside target of \u003cONE_THOUSAND\u003e and \u003cONE_THOUSAND\u003e few months back the tata group stock tata elxsi shares underwent a massive rally which started from \u003cSIX_THOUSAND\u003e towards \u003cNINE_THOUSAND\u003e mark tata elxsi stock has now retested that breakout point and that coincides with the placement of \u003cTWO_HUNDRED\u003e dema we are also witnessing a golden crossover of \u003cFIVE_TEN\u003e dema with \u003cTWO_HUNDRED\u003e dema said the brokerage firm it advises traders to go long in tata elxsi shares in the near \u003cSEVEN_THOUSAND\u003e level with a stop loss of \u003cSIX_THOUSAND\u003e for a timeframe of \u003cTHREE_TEN\u003e to \u003cNINE_TEN\u003e days","timestamp":"2024-10-10T14:00:00+05:30","market_timestamp":"2024-10-10T14:00:00+05:30","off_market_hours":false}