{"url":"https://www.livemint.com/market/stock-market-news/nifty-50-sensex-today-what-to-expect-from-indian-stock-market-in-trade-on-october-14-11728869816231.html","title":"Nifty 50, Sensex today: What to expect from Indian stock market in trade on October 14","description":"Nifty 50, Sensex today: The trends on Gift Nifty also indicate a mildly positive start for the Indian benchmark index. The Gift Nifty was trading around 25,085 level, a premium of nearly 35 points from the Nifty futures’ previous close.","content":"Indian stock market indices, Sensex and Nifty 50, are likely to open higher on Monday tracking gains in global markets.The trends on Gift Nifty also indicate a mildly positive start for the Indian benchmark index. The Gift Nifty was trading around 25,085 level, a premium of nearly 35 points from the Nifty futures’ previous close.On Friday, the domestic equity market indices ended lower, with the Nifty 50 closing below 25,000 level.The Sensex dropped 230.05 points to close at 81,381.36, while the Nifty 50 settled 34.20 points, or 0.14%, lower at 24,964.25.Nifty 50 formed a small negative candle on the daily chart with minor upper and lower shadow.“Technically, this pattern indicates continuation of narrow range movement in the market. The high low range for the day was around 108 points. Nifty 50 on the weekly chart formed a small negative candle with upper and lower shadow, which is signaling a formation of high wave type candle pattern. After a sharp weakness of last week, the selling momentum seems to have reduced on follow-through weakness during this week. This could be a sigh of relief for the bulls to make a comeback.” said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.According to Shetti, the underlying trend of Nifty 50 remains choppy and having placed near the crucial support around 24,500 levels, there is a higher possibility of an upside bounce in the market from here or from lower supports.Here’s what to expect from Nifty 50 and Bank Nifty today:Nifty 50 continued with the narrow range movement on October 11 and closed the day lower by 34 points.“On the higher side, call writing at 25,000 and 25,200 strike option will continue to act as strong supply zones for index and move towards 25,200 / 25,320 can be used to book profit in trading long positions. Whereas on the lower side, 24,900 / 24,840 will act as a strong support zone for the index. Overall, we expect the index to consolidate between 24,800 - 25,320 levels for the next few trading sessions before giving a fresh move on either side,” said Aditya Agarwal, Head of Derivatives \u0026 Technical Analysis at Sanctum Wealth.Dr. Praveen Dwarakanath, Vice President at Hedged.in noted that the Nifty 50 broke its previous day’s low and was sold off from the day's high, indicating weakness in the index.“Nifty 50 has formed a doji candle, technically indicating indecisiveness in the index. However, the momentum indicators are showing signs of further fall. Also, the ADX DI- line has created a positive slope, indicating a further fall from the present levels. Options writer's data showed increased call writing at the 25,000 level and a mild short-covering in the 25,100 levels, indicating a sideways to downside bias in the index,” said Dwarakanath.VLA Ambala, Co-Founder of Stock Market Today expects a bearish outlook in the market in the next few days, and recommends a ‘sell on the rise’ strategy, ignoring pullback moves in a downtrend.“Currently, the Nifty RSI level is 41 on a daily, 59 on a weekly, and 74 on a weekly forming a high wave Doji candlestick pattern on the weekly chart. Amid these market situations, Nifty may find support around 24,820 and 24,675 with resistance expected at 25,120 and 25,245,” Ambala said.Bank Nifty index saw profit booking from higher levels on Friday and closed 358.60 points, or 0.70% lower at 51,172.30.“Bank Nifty also broke its previous day’s low and was sold off from its day's high, indicating weakness to continue in the index. The stochastics on the daily chart is closing towards the overbought region, which can also become a reason for a fall in the index. The ADX DI+ line has turned downside, indicating a possible fall in the index,” said Dwarakanath.According to him, immediate support for the index is at the 50,200 level. Options writer’s data showed an increased call writing in weekly expiry above 51,000 levels and increased call writing at 51,500 levels in monthly expiry, indicating a downside potential in the index.Aditya Agarwal said that the short term structure for Bank Nifty remains positive and a correction towards 51,000 / 50,800 can be used as a buying opportunity.“However, upside from current levels will be limited and a move towards 51,000 / 52,200 can be used to book profit in trading longs. A close below 50,400 will negate the bullish view and below that index can gradually correct towards 50,000 / 49,600 levels,” Agarwal said.","cleaned_content":"indian stock market indices sensex and nifty \u003cFIVE_TEN\u003e are likely to open higher on monday tracking gains in global markets the trends on gift nifty also indicate a mildly positive start for the indian benchmark index the gift nifty was trading around \u003cTWO_TEN_THOUSAND\u003e level a premium of nearly \u003cTHREE_TEN\u003e points from the nifty futures previous close on friday the domestic equity market indices ended lower with the nifty \u003cFIVE_TEN\u003e closing below \u003cTWO_TEN_THOUSAND\u003e level the sensex dropped \u003cTWO_HUNDRED\u003e points to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e nifty \u003cFIVE_TEN\u003e formed a small negative candle on the daily chart with minor upper and lower shadow technically this pattern indicates continuation of narrow range movement in the market the high low range for the day was around \u003cONE_HUNDRED\u003e points nifty \u003cFIVE_TEN\u003e on the weekly chart formed a small negative candle with upper and lower shadow which is signaling a formation of high wave type candle pattern after a sharp weakness of last week the selling momentum seems to have reduced on follow through weakness during this week this could be a sigh of relief for the bulls to make a comeback said nagaraj shetti senior technical research analyst at hdfc securities according to shetti the underlying trend of nifty \u003cFIVE_TEN\u003e remains choppy and having placed near the crucial support around \u003cTWO_TEN_THOUSAND\u003e levels there is a higher possibility of an upside bounce in the market from here or from lower supports here s what to expect from nifty \u003cFIVE_TEN\u003e and bank nifty today nifty \u003cFIVE_TEN\u003e continued with the narrow range movement on october \u003cONE_TEN\u003e and closed the day lower by \u003cTHREE_TEN\u003e points on the higher side call writing at \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e strike option will continue to act as strong supply zones for index and move towards \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e can be used to book profit in trading long positions whereas on the lower side \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e will act as a strong support zone for the index overall we expect the index to consolidate between \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e levels for the next few trading sessions before giving a fresh move on either side said aditya agarwal head of derivatives technical analysis at sanctum wealth dr praveen dwarakanath vice president at hedged in noted that the nifty \u003cFIVE_TEN\u003e broke its previous day s low and was sold off from the days high indicating weakness in the index nifty \u003cFIVE_TEN\u003e has formed a doji candle technically indicating indecisiveness in the index however the momentum indicators are showing signs of further fall also the adx di line has created a positive slope indicating a further fall from the present levels options writers data showed increased call writing at the \u003cTWO_TEN_THOUSAND\u003e level and a mild short covering in the \u003cTWO_TEN_THOUSAND\u003e levels indicating a sideways to downside bias in the index said dwarakanath vla ambala co founder of stock market today expects a bearish outlook in the market in the next few days and recommends a sell on the rise strategy ignoring pullback moves in a downtrend currently the nifty rsi level is \u003cFOUR_TEN\u003e on a daily \u003cFIVE_TEN\u003e on a weekly and \u003cSEVEN_TEN\u003e on a weekly forming a high wave doji candlestick pattern on the weekly chart amid these market situations nifty may find support around \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e with resistance expected at \u003cTWO_TEN_THOUSAND\u003e and \u003cTWO_TEN_THOUSAND\u003e ambala said bank nifty index saw profit booking from higher levels on friday and closed \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cFIVE_TEN_THOUSAND\u003e bank nifty also broke its previous day s low and was sold off from its days high indicating weakness to continue in the index the stochastics on the daily chart is closing towards the overbought region which can also become a reason for a fall in the index the adx di line has turned downside indicating a possible fall in the index said dwarakanath according to him immediate support for the index is at the \u003cFIVE_TEN_THOUSAND\u003e level options writer s data showed an increased call writing in weekly expiry above \u003cFIVE_TEN_THOUSAND\u003e levels and increased call writing at \u003cFIVE_TEN_THOUSAND\u003e levels in monthly expiry indicating a downside potential in the index aditya agarwal said that the short term structure for bank nifty remains positive and a correction towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e can be used as a buying opportunity however upside from current levels will be limited and a move towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFIVE_TEN_THOUSAND\u003e can be used to book profit in trading longs a close below \u003cFIVE_TEN_THOUSAND\u003e will negate the bullish view and below that index can gradually correct towards \u003cFIVE_TEN_THOUSAND\u003e \u003cFOUR_TEN_THOUSAND\u003e levels agarwal said","timestamp":"2024-10-14T07:24:00+05:30","market_timestamp":"2024-10-14T09:15:00+05:30","off_market_hours":true}