{"url":"https://www.livemint.com/market/stock-market-news/multibagger-hitachi-energy-share-price-rises-8-to-1-year-high-4-key-reason-leading-to-improved-earnings-prospects-11728550362664.html","title":"Multibagger Hitachi Energy share price rises 8% to 1 year high: 4 Key reason leading to improved earnings prospects","description":"Stock market Today: Hitachi Energy India share price gained 8% to scale 1 year highs during intraday trades on Thursday. Here are 4 key reasons that are leading to improved earnings prospects leading to the gains for the stock","content":"Stock Market Today: Hitachi Energy India Ltd share price gained 8% to 1 year highs on Thursday. The Hitachi Energy share price opened at  ₹15000 on the BSE on Thursday, more than 3% higher than the previous close. Hitachi Energy share price however gained further to scale i year high of  ₹15650 on the BSE. Hitachi Energy share price on the NSE gained to highs of  ₹15670 marking gains of 8% during the Intraday trades.Hitachi Energy share price has rise almost close to 400% in last one year .The recent gains for Hitachi Energy share price is being driven by its expansion plans as well as growth opportunities in Transmission and distribution segment, Metro rail and other railway expansion as well as e mobility and other automation projects.Hitachi Energy in its recent investor presentation said that Electrification in India and globally will be growing like never before. Its Comprehensive digital portfolio provides Leading digitalization solutions from edge to enterpriseHitachi Energy India has invested more than  ₹350 crore since 2020, in Power quality factory in Bangalore, HVDC and PQ factory in Chennai, GIS feeder factory in Savli and Dry-bushing factory in Vadodara. It Plans investing R 2,000 crores over the next four to five years. this will be to add capacities of Large and Small Power Transformers, Dry and Traction Transformers, HVDC \u0026 components and Network control solutions offering2Transmission and Distribution segment investments- With a transmission capex of  ₹9.2 trillion lined up by 2030, core T\u0026D business offers a strong opportunity, said analysts at Antique Stock Broking.While Hitachi has a diverse product portfolio offering in the form of traction transformers, dry type transformers, switchgears, SCADA systems, etc, to drive growth in transportation, data centers, e-mobility, and manufacturing. Antique analysts said that Metro projects, high speed rail, Vande Bharat, DFC will benefit Hitachi Energy as it is a preferred vendor for transportation projects in IndiaHitachi Energy plans to increase its exports from the 15%-20% range to 20%-25% in the medium term highlighted Antique analysts","cleaned_content":"stock market today hitachi energy india ltd share price gained \u003cEIGHT_PERCENT\u003e to \u003cONE_\u003e year highs on thursday the hitachi energy share price opened at \u003cONE_TEN_THOUSAND\u003e on the bse on thursday more than \u003cTHREE_PERCENT\u003e higher than the previous close hitachi energy share price however gained further to scale i year high of \u003cONE_TEN_THOUSAND\u003e on the bse hitachi energy share price on the nse gained to highs of \u003cONE_TEN_THOUSAND\u003e marking gains of \u003cEIGHT_PERCENT\u003e during the intraday trades hitachi energy share price has rise almost close to \u003cFOUR_HUNDRED_PERCENT\u003e in last one year the recent gains for hitachi energy share price is being driven by its expansion plans as well as growth opportunities in transmission and distribution segment metro rail and other railway expansion as well as e mobility and other automation projects hitachi energy in its recent investor presentation said that electrification in india and globally will be growing like never before its comprehensive digital portfolio provides leading digitalization solutions from edge to enterprisehitachi energy india has invested more than \u003cTHREE_HUNDRED\u003e crore since \u003cTWO_THOUSAND\u003e in power quality factory in bangalore hvdc and pq factory in chennai gis feeder factory in savli and dry bushing factory in vadodara it plans investing r \u003cTWO_THOUSAND\u003e crores over the next four to five years this will be to add capacities of large and small power transformers dry and traction transformers hvdc components and network control solutions offering2transmission and distribution segment investments with a transmission capex of \u003cNINE_\u003e trillion lined up by \u003cTWO_THOUSAND\u003e core t d business offers a strong opportunity said analysts at antique stock broking while hitachi has a diverse product portfolio offering in the form of traction transformers dry type transformers switchgears scada systems etc to drive growth in transportation data centers e mobility and manufacturing antique analysts said that metro projects high speed rail vande bharat dfc will benefit hitachi energy as it is a preferred vendor for transportation projects in indiahitachi energy plans to increase its exports from the \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e range to \u003cTWO_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e in the medium term highlighted antique analysts","timestamp":"2024-10-10T15:22:00+05:30","market_timestamp":"2024-10-10T15:22:00+05:30","off_market_hours":false}