{"url":"https://www.livemint.com/market/stock-market-news/sebis-direct-securities-payout-rules-from-october-14-zerodha-s-nithin-kamath-explains-key-changes-for-investors-broke-11728375232005.html","title":"SEBI’s direct securities payout rules from Oct 14; Zerodha’s Nithin Kamath explains key changes for investors, brokers","description":"SEBI's new rules, set to be implemented in two phases starting October 14, 2024, will enable the direct credit of securities to investors’ demat accounts after a trade, reducing the intermediary role of stockbrokers in the settlement process.","content":"In a move aimed at improving transparency and efficiency in the Indian stock market, the Securities and Exchange Board of India (SEBI) has introduced new regulations that will change how securities are credited to investors’ demat accounts.The new rules, set to be implemented in two phases starting October 14, 2024, will enable the direct credit of securities to investors’ demat accounts after a trade, reducing the intermediary role of stockbrokers in the settlement process.Zerodha Founder and CEO, Nithin Kamath, highlighted that this shift to direct credit via net settlement will simplify the depository participant (DP) process.“While SEBI is tightening rules to make the markets safer on the one hand, it is also making things simple on the other. Starting from October 14th, shares bought will be directly credited to the customer's Demat account through net settlement. This significantly simplifies our DP process, which today involves receiving shares for the entire group of clients and then allocating them based on purchases made, i.e., gross settlement,” Kamath wrote in a post on X (formerly Twitter).Kamath further emphasized that the new system will offer greater security by eliminating broker access to client securities during the settlement period.“And this is much safer, too. A broker from now on will never be able to touch client securities ever, which is possible today when you buy stocks and are not yet credited to your Demat,” Kamath said.In a blog post, Kamath explained how the new system will work and how it impacts investors and brokers.Under the current system, after investors purchase securities, the Clearing Corporation (CC) first credits these securities to the broker’s pool account. The broker then transfers the securities to the buyer’s demat account. The broker holds control of these securities until the final transfer is made to clients.In some cases, brokers use a method known as “direct payout for net settlement,” where securities are matched between buyers and sellers, allowing the CC to credit shares directly to some buyers. However, complexities such as short delivery—when sellers fail to deliver shares—require brokers to resolve these situations through market purchases or auctions.SEBI’s new guidelines will transform this process by enabling the CC to credit securities directly to investors’ demat accounts, removing the intermediary role of brokers in most cases. The changes will occur in two phases:During this phase, direct credit of securities will be introduced for equity cash segments and physical settlements. However, in certain situations, such as rejected payouts, inactive accounts, or excess securities from clearing members, securities may still be temporarily credited to the broker’s pool account.The second phase will extend the direct payout system to all security transactions, including Securities Lending and Borrowing (SLB) and Offer for Sale (OFS). At this stage, the broker’s involvement in the settlement process will be minimized, and the CC will directly manage auction settlements in cases of short delivery, eliminating the need for brokers to participate in auction processes, Kamath’s blog post explained.Currently, when investors purchase securities using margin trading facility (MTF) or without full payment, brokers handle the pledging of securities, marking them as pledged until payment is complete.Under SEBI’s new rules, brokers will no longer manage pledges directly. Instead, if full payment is not made, brokers will instruct the Clearing Corporations to mark the pledge in the client’s demat account, ensuring a more direct and secure transaction process.For retail investors, nothing changes. The new changes will largely take place behind the scenes and will not require any action on investors’ part. However, the direct credit of securities aims to make the settlement process more efficient, reducing delays and increasing the safety of clients’ securities.","cleaned_content":"in a move aimed at improving transparency and efficiency in the indian stock market the securities and exchange board of india sebi has introduced new regulations that will change how securities are credited to investors demat accounts the new rules set to be implemented in two phases starting october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e will enable the direct credit of securities to investors demat accounts after a trade reducing the intermediary role of stockbrokers in the settlement process zerodha founder and ceo nithin kamath highlighted that this shift to direct credit via net settlement will simplify the depository participant dp process while sebi is tightening rules to make the markets safer on the one hand it is also making things simple on the other starting from october \u003cONE_TEN\u003e th shares bought will be directly credited to the customers demat account through net settlement this significantly simplifies our dp process which today involves receiving shares for the entire group of clients and then allocating them based on purchases made i e gross settlement kamath wrote in a post on x formerly twitter kamath further emphasized that the new system will offer greater security by eliminating broker access to client securities during the settlement period and this is much safer too a broker from now on will never be able to touch client securities ever which is possible today when you buy stocks and are not yet credited to your demat kamath said in a blog post kamath explained how the new system will work and how it impacts investors and brokers under the current system after investors purchase securities the clearing corporation cc first credits these securities to the broker s pool account the broker then transfers the securities to the buyer s demat account the broker holds control of these securities until the final transfer is made to clients in some cases brokers use a method known as direct payout for net settlement where securities are matched between buyers and sellers allowing the cc to credit shares directly to some buyers however complexities such as short delivery when sellers fail to deliver shares require brokers to resolve these situations through market purchases or auctions sebi s new guidelines will transform this process by enabling the cc to credit securities directly to investors demat accounts removing the intermediary role of brokers in most cases the changes will occur in two phases during this phase direct credit of securities will be introduced for equity cash segments and physical settlements however in certain situations such as rejected payouts inactive accounts or excess securities from clearing members securities may still be temporarily credited to the broker s pool account the second phase will extend the direct payout system to all security transactions including securities lending and borrowing slb and offer for sale ofs at this stage the broker s involvement in the settlement process will be minimized and the cc will directly manage auction settlements in cases of short delivery eliminating the need for brokers to participate in auction processes kamath s blog post explained currently when investors purchase securities using margin trading facility mtf or without full payment brokers handle the pledging of securities marking them as pledged until payment is complete under sebi s new rules brokers will no longer manage pledges directly instead if full payment is not made brokers will instruct the clearing corporations to mark the pledge in the client s demat account ensuring a more direct and secure transaction process for retail investors nothing changes the new changes will largely take place behind the scenes and will not require any action on investors part however the direct credit of securities aims to make the settlement process more efficient reducing delays and increasing the safety of clients securities","timestamp":"2024-10-08T13:58:00+05:30","market_timestamp":"2024-10-08T13:58:00+05:30","off_market_hours":false}