{"url":"https://www.livemint.com/market/stock-market-news/jtl-industries-shares-crack-over-7-as-board-approves-stock-split-but-rejects-bonus-issue-proposal-11728022971910.html","title":"JTL Industries stock split: Board approves stock subdivision in 1:1 ratio. Details here","description":"JTL Industries recorded its highest sales volume in Q2FY25, leading to a positive 'Buy' rating from Nuvama with a target price of  ₹325","content":"Stock split 2024: The board of directors of JTL Industries Ltd. approved a stock split in the 1:1 ratio and denied the proposal for a bonus issue of shares during its meeting on Thursday.The stock split would involve splitting each equity share with a face value of  ₹2 into two equity shares with a face value of Re 1 each. The record date for this split will be communicated to the stock exchanges in due course, the company said in an exchange filing.Interestingly, the board did not approve any matter related to the bonus issue.The stock shed as much as 7.3 per cent to the day's low of  ₹211. It is now 20 per cent away from its peak of  ₹276.60, hit in February but has advanced 32 per cent from its 52-week low of  ₹167.10, recorded in March. The scrip has gained only 9 per cent in the last one year, and 7 per cent on a year-to-date (YTD) basis.The management at JTL Industries emphasised that the division of shares aims to enhance the liquidity of the company's shares in the capital market. Additionally, it will make the shares more affordable and accessible to small investors. The shares are expected to be split within two months following the board's approval.This recent announcement marks the second corporate action of its kind for JTL Industries. Last year, the company conducted a bonus issue in a 1:1 ratio, allowing shareholders to receive one free share for each share held as of the record date. Furthermore, in 2021, the company approved a stock split of its shares with a face value of  ₹10 each into shares of  ₹2 each.A stock split is typically undertaken by companies to increase their number of outstanding shares while improving trading liquidity. This action can make the stock more affordable for existing and potential shareholders. It is a common practice in the corporate world, especially for companies aiming to broaden their investor base.On October 1, JTL Industries shared a business update, indicating it recorded its highest-ever sales volume in the second quarter of the current fiscal year (Q2FY25). The sales volume surged to 1.03 lakh metric tons (MT), representing a remarkable growth of 26.32% compared to 81,686 MT achieved in the same quarter of the previous financial year. This increase was primarily driven by robust demand for heavy structures and included sales from the recently acquired Nabha Steels and Metals.In the first half of FY25, JTL’s sales volume reached 1,99,593 MT, marking a 25.49% growth over the 1,59,028 MT recorded in the same period last year. Its export sales increased in H1FY25, rising from 8,897 MT in the same time last year to 18,219 MT, soaring over 200%.Following the positive business update, JTL Industries received a 'Buy' rating from brokerage firm Nuvama, which highlighted the company's strong export margins. The analysts set a 12-month price target of  ₹325 per share.Nuvama’s report noted, \"We believe EBITDA per ton for JTL would stay above  ₹4,000 per tonne in Q2FY25, given that inventory losses are likely to be offset by better margins in exports.\" The report further detailed that H1FY25 sales volume of 1,99,593 MT reflects a robust growth of 25.5% compared to 1,59,028 MT in H1FY24, showcasing the company’s continued momentum in expanding its market share and operational capacity.The report emphasised the growth in exports, which rose over 200%, particularly benefiting from the recent commissioning of the Maharashtra galvanised unit. This unit's proximity to the port has allowed JTL to capitalise on higher export opportunities.","cleaned_content":"stock split \u003cTWO_THOUSAND\u003e the board of directors of jtl industries ltd approved a stock split in the \u003cONE_\u003e \u003cONE_\u003e ratio and denied the proposal for a bonus issue of shares during its meeting on thursday the stock split would involve splitting each equity share with a face value of \u003cTWO_\u003e into two equity shares with a face value of re \u003cONE_\u003e each the record date for this split will be communicated to the stock exchanges in due course the company said in an exchange filing interestingly the board did not approve any matter related to the bonus issue the stock shed as much as \u003cSEVEN_PERCENT\u003e to the days low of \u003cTWO_HUNDRED\u003e it is now \u003cTWO_TEN_PERCENT\u003e away from its peak of \u003cTWO_HUNDRED\u003e hit in february but has advanced \u003cTHREE_TEN_PERCENT\u003e from its \u003cFIVE_TEN\u003e week low of \u003cONE_HUNDRED\u003e recorded in march the scrip has gained only \u003cNINE_PERCENT\u003e in the last one year and \u003cSEVEN_PERCENT\u003e on a year to date ytd basis the management at jtl industries emphasised that the division of shares aims to enhance the liquidity of the companys shares in the capital market additionally it will make the shares more affordable and accessible to small investors the shares are expected to be split within two months following the boards approval this recent announcement marks the second corporate action of its kind for jtl industries last year the company conducted a bonus issue in a \u003cONE_\u003e \u003cONE_\u003e ratio allowing shareholders to receive one free share for each share held as of the record date furthermore in \u003cTWO_THOUSAND\u003e the company approved a stock split of its shares with a face value of \u003cONE_TEN\u003e each into shares of \u003cTWO_\u003e each a stock split is typically undertaken by companies to increase their number of outstanding shares while improving trading liquidity this action can make the stock more affordable for existing and potential shareholders it is a common practice in the corporate world especially for companies aiming to broaden their investor base on october \u003cONE_\u003e jtl industries shared a business update indicating it recorded its highest ever sales volume in the second quarter of the current fiscal year q2fy25 the sales volume surged to \u003cONE_\u003e lakh metric tons mt representing a remarkable growth of \u003cTWO_TEN_PERCENT\u003e compared to \u003cEIGHT_TEN_THOUSAND\u003e mt achieved in the same quarter of the previous financial year this increase was primarily driven by robust demand for heavy structures and included sales from the recently acquired nabha steels and metals in the first half of fy25 jtl s sales volume reached \u003cONE_HUNDRED_THOUSAND\u003e mt marking a \u003cTWO_TEN_PERCENT\u003e growth over the \u003cONE_HUNDRED_THOUSAND\u003e mt recorded in the same period last year its export sales increased in h1fy25 rising from \u003cEIGHT_THOUSAND\u003e mt in the same time last year to \u003cONE_TEN_THOUSAND\u003e mt soaring over \u003cTWO_HUNDRED_PERCENT\u003e following the positive business update jtl industries received a buy rating from brokerage firm nuvama which highlighted the companys strong export margins the analysts set a \u003cONE_TEN\u003e month price target of \u003cTHREE_HUNDRED\u003e per share nuvama s report noted we believe ebitda per ton for jtl would stay above \u003cFOUR_THOUSAND\u003e per tonne in q2fy25 given that inventory losses are likely to be offset by better margins in exports the report further detailed that h1fy25 sales volume of \u003cONE_HUNDRED_THOUSAND\u003e mt reflects a robust growth of \u003cTWO_TEN_PERCENT\u003e compared to \u003cONE_HUNDRED_THOUSAND\u003e mt in h1fy24 showcasing the company s continued momentum in expanding its market share and operational capacity the report emphasised the growth in exports which rose over \u003cTWO_HUNDRED_PERCENT\u003e particularly benefiting from the recent commissioning of the maharashtra galvanised unit this units proximity to the port has allowed jtl to capitalise on higher export opportunities","timestamp":"2024-10-04T13:09:00+05:30","market_timestamp":"2024-10-04T13:09:00+05:30","off_market_hours":false}