{"url":"https://www.livemint.com/market/stock-market-news/stock-market-today-over-180-stocks-hit-one-year-highs-while-sensex-falls-investors-earn-3-lakh-crore-in-a-day-11728468807530.html","title":"Stock market today: Over 180 stocks hit one-year highs while Sensex falls; investors earn  ₹3 lakh crore in a day","description":"Stock market today: Some 184 stocks, including Infosys and Cipla, reached one-year highs on BSE. However, the Sensex closed lower due to profit booking in major stocks like Reliance Industries and HDFC Bank.","content":"Stock market today: As many as 184 stocks, including Infosys, Divi's Labs, Cipla, Naukri and Trent, hit their fresh one-year highs in intraday trade on BSE on Wednesday, October 9, even as equity benchmark Sensex ended in the red, dragged by profit booking in select heavyweights such as Reliance Industries, ITC and HDFC Bank.Bosch, Coforge, Dixon Technologies, Ipca Laboratories, Page Industries, Polycab India, Torrent Pharma and Torrent Power were also among the stock that hit their 52-week highs during the session.Meanwhile, Indian stock market benchmarks—the Sensex and the Nifty 50—closed in the red, erasing all gains of the session. Both indices rose by almost a per cent each during the session after the Reserve Bank of India maintained the repo rate but changed its policy stance.The central bank held the repo rate steady at 6.50 per cent and changed its policy stance to ‘neutral’ from 'withdrawal of accommodation'.Sensex closed 168 points, or 0.21 per cent, lower at 81,467.10, while the Nifty 50 ended at 24,981.95, down 31 points, or 0.12 per cent.In the 30-share pack Sensex, 15 stocks closed lower, with shares of ITC, Nestle and Hindustan Unilever ending as the top losers.While the benchmark index fell, the mid and smallcap segments ended with solid gains. The BSE Midcap index climbed 1.06 per cent while the Smallcap index rose 1.21 per cent.Due to gains in the mid and small-cap segments, the overall market capitalisation of the firms listed on the BSE rose to nearly  ₹462.2 lakh crore from  ₹459.5 lakh crore in the previous session, making investors richer by about  ₹2.7 lakh crore in a single session.According to Vinod Nair, the head of research at Geojit Financial Services, an upward revision in Q3FY25 inflation reiterates that the sticky inflation remains a concern for the RBI and has led investors to book profits towards the close.\"The change in RBI's stance to neutral was favourable and expected, but the commentary does not point to a rate cut in the near term. Meanwhile, the investor’s sentiment is buoyed on the broad market taking stock-to-stock opportunity to capitalise from the recent correction,\" said Nair.Shrikant Chouhan, the head of equity research at Kotak Securities, believes the current market texture is volatile, so level-based trading would be the ideal strategy for day traders.\"For the bulls now, 50-day SMA (simple moving average) or 25,050/81,700 would be the key level to watch out. Above this, the market could retest the level of 25,200-25,225/82,000-82,300. On the flip side, 24,900/81,200 would be the key support zone for the traders. Below this, the selling pressure is likely to accelerate, and the market could slip to 24,800-24,780/81,000-80,700,\" said Chouhan.Read all market-related news here","cleaned_content":"stock market today as many as \u003cONE_HUNDRED\u003e stocks including infosys divis labs cipla naukri and trent hit their fresh one year highs in intraday trade on bse on wednesday october \u003cNINE_\u003e even as equity benchmark sensex ended in the red dragged by profit booking in select heavyweights such as reliance industries itc and hdfc bank bosch coforge dixon technologies ipca laboratories page industries polycab india torrent pharma and torrent power were also among the stock that hit their \u003cFIVE_TEN\u003e week highs during the session meanwhile indian stock market benchmarks the sensex and the nifty \u003cFIVE_TEN\u003e closed in the red erasing all gains of the session both indices rose by almost a per cent each during the session after the reserve bank of india maintained the repo rate but changed its policy stance the central bank held the repo rate steady at \u003cSIX_PERCENT\u003e and changed its policy stance to neutral from withdrawal of accommodation sensex closed \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e lower at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e ended at \u003cTWO_TEN_THOUSAND\u003e down \u003cTHREE_TEN\u003e points or \u003cZERO_PERCENT\u003e in the \u003cTHREE_TEN\u003e share pack sensex \u003cONE_TEN\u003e stocks closed lower with shares of itc nestle and hindustan unilever ending as the top losers while the benchmark index fell the mid and smallcap segments ended with solid gains the bse midcap index climbed \u003cONE_PERCENT\u003e while the smallcap index rose \u003cONE_PERCENT\u003e due to gains in the mid and small cap segments the overall market capitalisation of the firms listed on the bse rose to nearly \u003cFOUR_HUNDRED\u003e lakh crore from \u003cFOUR_HUNDRED\u003e lakh crore in the previous session making investors richer by about \u003cTWO_\u003e lakh crore in a single session according to vinod nair the head of research at geojit financial services an upward revision in q3fy25 inflation reiterates that the sticky inflation remains a concern for the rbi and has led investors to book profits towards the close the change in rbis stance to neutral was favourable and expected but the commentary does not point to a rate cut in the near term meanwhile the investor s sentiment is buoyed on the broad market taking stock to stock opportunity to capitalise from the recent correction said nair shrikant chouhan the head of equity research at kotak securities believes the current market texture is volatile so level based trading would be the ideal strategy for day traders for the bulls now \u003cFIVE_TEN\u003e day sma simple moving average or \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e would be the key level to watch out above this the market could retest the level of \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e on the flip side \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e would be the key support zone for the traders below this the selling pressure is likely to accelerate and the market could slip to \u003cTWO_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e \u003cEIGHT_TEN_THOUSAND\u003e said chouhan read all market related news here","timestamp":"2024-10-09T16:25:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}