{"url":"https://www.livemint.com/market/stock-market-news/dividend-stocks-jupiter-wagons-k-p-energy-among-others-to-trade-ex-dividend-next-week-full-list-11728138014906.html","title":"Dividend Stocks: Jupiter Wagons, K.P. Energy, among others to trade ex-dividend next week; Full list","description":"Dividend Stocks: Several companies, including Jupiter Wagons Ltd, K.P. Energy Ltd, and Shraddha Prime Projects Ltd among others, are trading ex-dividend in the coming week.","content":"Dividend Stocks: Shares of several major companies, including Jupiter Wagons Ltd, K.P. Energy Ltd, Shraddha Prime Projects Ltd, and Blue Cloud Softech Solutions Ltd, among others, will trade ex-dividend from Monday, October 7, according to data collected from the Bombay Stock Exchange (BSE) website.As per the BSE data, some companies have announced other corporate actions such as bonus issues of shares, stock splits, and other corporate announcements.The ex-dividend date is when the equity share price adjusts itself to reflect the next dividend payout. It is the day the stock becomes ex-dividend, which means it does not carry the value of its next dividend payment from that day forward. Dividends are payable to all the shareholders whose names appear on the company's list by the end of the record date.Jupiter Wagons Ltd: The company declared an interim dividend of  ₹1.K.P. Energy Ltd: The company declared a final dividend of  ₹0.1.Shraddha Prime Projects Ltd: The company declared an interim dividend of  ₹0.2.Blue Cloud Softech Solutions Ltd: The company declared a final dividend of  ₹0.02.NBCC (India) Ltd: declared a bonus issue of shares at a ratio of 1:2. Shares will trade ex-bonus on October 7.Power Mech Projects Ltd: declared a bonus issue of shares at a ratio of 1:1. Shares will trade ex-bonus on October 8.A bonus issue is a corporate action that allows existing shareholders to subscribe for additional shares. Instead of increasing the dividend payout, companies offer to distribute additional shares to the shareholders. For example, the company may give out one bonus share for every ten shares held.Jindal Saw Ltd will undergo a stock split from  ₹2 to  ₹1. Shares will trade ex-split on October 9.New Light Apparels Ltd will undergo a stock split from  ₹10 to  ₹1. Shares will trade ex-split on October 10.Rajnish Retail Ltd will undergo a stock split from  ₹5 to  ₹1. Shares will trade ex-split on October 11.A stock split is a corporate action that occurs when a company issues additional shares to shareholders to boost liquidity. The total number of shares issued is increased by a specified ratio based on previously held shares. However, if the number of shares outstanding increases by a specific multiple, the total value (in rupees) of all shares outstanding remains the same because a split does not change the company's value.The most common split ratios are 2-for-1 or 3-for-1 ( denoted as 2:1 or 3:1). For every share held before the split, each stockholder will have two or three shares, respectively, after the split.Geojit Financial Services Ltd: Right issue of equity shares on October 7.ARC Finance Ltd: Right issue of equity shares on October 10.IDFC Ltd: Amalgamation on October 10.Hercules Hoists Ltd: Spin-off on October 11.Softsol India Ltd: Spin-off on October 11.Virat Industries Ltd: E.G.M on October 11.","cleaned_content":"dividend stocks shares of several major companies including jupiter wagons ltd k p energy ltd shraddha prime projects ltd and blue cloud softech solutions ltd among others will trade ex dividend from monday october \u003cSEVEN_\u003e according to data collected from the bombay stock exchange bse website as per the bse data some companies have announced other corporate actions such as bonus issues of shares stock splits and other corporate announcements the ex dividend date is when the equity share price adjusts itself to reflect the next dividend payout it is the day the stock becomes ex dividend which means it does not carry the value of its next dividend payment from that day forward dividends are payable to all the shareholders whose names appear on the companys list by the end of the record date jupiter wagons ltd the company declared an interim dividend of \u003cONE_\u003e k p energy ltd the company declared a final dividend of \u003cZERO_\u003e shraddha prime projects ltd the company declared an interim dividend of \u003cZERO_\u003e blue cloud softech solutions ltd the company declared a final dividend of \u003cZERO_\u003e nbcc india ltd declared a bonus issue of shares at a ratio of \u003cONE_\u003e \u003cTWO_\u003e shares will trade ex bonus on october \u003cSEVEN_\u003e power mech projects ltd declared a bonus issue of shares at a ratio of \u003cONE_\u003e \u003cONE_\u003e shares will trade ex bonus on october \u003cEIGHT_\u003e a bonus issue is a corporate action that allows existing shareholders to subscribe for additional shares instead of increasing the dividend payout companies offer to distribute additional shares to the shareholders for example the company may give out one bonus share for every ten shares held jindal saw ltd will undergo a stock split from \u003cTWO_\u003e to \u003cONE_\u003e shares will trade ex split on october \u003cNINE_\u003e new light apparels ltd will undergo a stock split from \u003cONE_TEN\u003e to \u003cONE_\u003e shares will trade ex split on october \u003cONE_TEN\u003e rajnish retail ltd will undergo a stock split from \u003cFIVE_\u003e to \u003cONE_\u003e shares will trade ex split on october \u003cONE_TEN\u003e a stock split is a corporate action that occurs when a company issues additional shares to shareholders to boost liquidity the total number of shares issued is increased by a specified ratio based on previously held shares however if the number of shares outstanding increases by a specific multiple the total value in rupees of all shares outstanding remains the same because a split does not change the companys value the most common split ratios are \u003cTWO_\u003e for \u003cONE_\u003e or \u003cTHREE_\u003e for \u003cONE_\u003e denoted as \u003cTWO_\u003e \u003cONE_\u003e or \u003cTHREE_\u003e \u003cONE_\u003e for every share held before the split each stockholder will have two or three shares respectively after the split geojit financial services ltd right issue of equity shares on october \u003cSEVEN_\u003e arc finance ltd right issue of equity shares on october \u003cONE_TEN\u003e idfc ltd amalgamation on october \u003cONE_TEN\u003e hercules hoists ltd spin off on october \u003cONE_TEN\u003e softsol india ltd spin off on october \u003cONE_TEN\u003e virat industries ltd e g m on october \u003cONE_TEN\u003e","timestamp":"2024-10-05T20:33:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}