{"url":"https://www.livemint.com/market/stock-market-news/penny-stock-below-rs-2-shares-of-nbfc-standard-capital-jump-8-heres-why-11728879813805.html","title":"Penny stock below  ₹2: Shares of NBFC Standard Capital jump 8%. Here’s why","description":"Penny Stock: Standard Capital share price witnessed a rise of 8 per cent following the announcement of a new zero-cost EMI scheme for schools to purchase interactive flat panels.","content":"Penny Stock: Shares of Standard Capital Markets, a non-banking financial company (NBFC), surged 8% on Monday, October 14, to trade near  ₹2 on the BSE. The jump followed the company’s announcement of a new zero-cost EMI scheme aimed at supporting digital transformation in education.In a press release, Standard Capital on October 11, revealed that it will provide zero-cost EMI financing for schools to purchase interactive flat panels (IFPs). These digital tools are expected to modernise classrooms and replace traditional chalkboards, creating a healthier learning environment.Standard Capital share price was trading in the green, up 7.14 per cent, at  ₹1.35, on October 14, at 10:00 am, on BSE. The company enjoys a market capitalisation of  ₹233.55 crore.Apart from modernisation, this initiative aims to address health concerns linked to chalk dust, which contributes to respiratory problems in children. According to the Global Asthma Report, around 30 million children in India suffer from asthma, with indoor pollutants exacerbating respiratory issues.India’s edtech sector is witnessing rapid growth, driven by government efforts under the Digital India initiative. Industry reports suggested the market could reach $10.4 billion by 2025, growing at an annual rate of nearly 40 per cent. With over 1.5 million schools and 260 million students in India, the need for digital solutions has never been greater.Standard Capital has committed  ₹100 crore to this venture, which will allow the company to generate a return of 15-16% on its assets under management (AUM). The firm aims to combine financial returns with positive social impact, aligning the initiative with its long-term vision to support education.","cleaned_content":"penny stock shares of standard capital markets a non banking financial company nbfc surged \u003cEIGHT_PERCENT\u003e on monday october \u003cONE_TEN\u003e to trade near \u003cTWO_\u003e on the bse the jump followed the company s announcement of a new zero cost emi scheme aimed at supporting digital transformation in education in a press release standard capital on october \u003cONE_TEN\u003e revealed that it will provide zero cost emi financing for schools to purchase interactive flat panels ifps these digital tools are expected to modernise classrooms and replace traditional chalkboards creating a healthier learning environment standard capital share price was trading in the green up \u003cSEVEN_PERCENT\u003e at \u003cONE_\u003e on october \u003cONE_TEN\u003e at \u003cONE_TEN\u003e \u003cZERO_\u003e am on bse the company enjoys a market capitalisation of \u003cTWO_HUNDRED\u003e crore apart from modernisation this initiative aims to address health concerns linked to chalk dust which contributes to respiratory problems in children according to the global asthma report around \u003cTHREE_TEN\u003e million children in india suffer from asthma with indoor pollutants exacerbating respiratory issues india s edtech sector is witnessing rapid growth driven by government efforts under the digital india initiative industry reports suggested the market could reach \u003cONE_TEN\u003e billion by \u003cTWO_THOUSAND\u003e growing at an annual rate of nearly \u003cFOUR_TEN_PERCENT\u003e with over \u003cONE_\u003e million schools and \u003cTWO_HUNDRED\u003e million students in india the need for digital solutions has never been greater standard capital has committed \u003cONE_HUNDRED\u003e crore to this venture which will allow the company to generate a return of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e on its assets under management aum the firm aims to combine financial returns with positive social impact aligning the initiative with its long term vision to support education","timestamp":"2024-10-14T10:44:00+05:30","market_timestamp":"2024-10-14T10:44:00+05:30","off_market_hours":false}