{"url":"https://www.livemint.com/market/stock-market-news/stock-check-v2-retail-share-price-surges-to-fresh-record-high-as-nuvama-hikes-target-price-by-30-11728025268373.html","title":"Stock Check: V2 Retail share price surges to fresh record high as Nuvama hikes target price by 30%","description":"Stock Check: V2 Retail share price surged 4% to a 52-week high after Nuvama raised its target price by nearly 30%. The company aims to add 60 stores in FY25, sustaining double-digit same-store sales growth and targeting a sales CAGR of 30-40% over the next few years.","content":"Stock Check: V2 Retail share price jumped 4% to reach a new 52-week high following Nuvama brokerage's increase of the stock's target price by almost 30%. Nuvama anticipates further upgrades in the next few quarters due to robust demand momentum. In the last year, V2 Retail share price has increased by 751.33%, surpassing its sector's performance. V2 Retail share price today opened at  ₹1,390 apiece on NSE, the stock touched an intraday high of  ₹1,430, and an intraday low of  ₹1,308.70.“V2 Retail share price is in a consistent uptrend making higher high formations. It is well trading above all the major moving averages. The momentum oscillators suggest that there is still more fuel left in the stock. So one can ride the trend with a stop at  ₹1,230,” said Dr. Ravi Singh, SVP - Retail Research, Religare Broking Ltd.Nuvama pointed out that the retail sector in India is undergoing a notable transformation due to consumers becoming more selective and aspirational. This has led to an increasing need for better shopping experiences (shift from unorganised to organised retail); fashionable products; improved value propositions ; and wider choices in wardrobes.According to the report, V2 Retail expanded by 12 stores in the first half of FY25, and its newly established stores are performing well. The company aims to increase its store count by 60 in FY25 while sustaining double-digit same-store sales growth (SSSG) for the remainder of the year. V2 Retail has finished its store rationalisation program, and its new stores are experiencing good foot traffic, while the SSSG of its established stores remains robust.“We are upgrading our FY25 store addition/SSSG target to 50/20% from 45/15% earlier. The management in its recent interviews has given an aspiration to reach  ₹1,800 crore sales in FY25. We expect 49% revenue CAGR over FY24–26 led by an aggressive push towards store additions and higher throughput,” said the brokerage.V2 Retail is targeting a sales CAGR of 30–40% over the next three to four years, potentially resulting in improved margins and better store performance. The company aims to maintain a RoE of 20%. Expansion into new stores and increasing revenue per square foot are expected to drive significant revenue and EBITDA growth. Due to the company's adjusted store addition goals and better-than-expected SSSG, the brokerage have increased its FY26 revenue estimate by 13%.\"As peers such as V-Mart Retail and Zudio have over ~500 stores each, we believe VREL can achieve healthy growth rates over a longer period. With aggressive and profitable growth, we upgrade our target multiple to 18x FY26 EV/EBITDA (from 15x earlier) and reaffirm ‘BUY’ with a revised target price of  ₹1,754 (from  ₹1,352 earlier).","cleaned_content":"stock check v2 retail share price jumped \u003cFOUR_PERCENT\u003e to reach a new \u003cFIVE_TEN\u003e week high following nuvama brokerages increase of the stocks target price by almost \u003cTHREE_TEN_PERCENT\u003e nuvama anticipates further upgrades in the next few quarters due to robust demand momentum in the last year v2 retail share price has increased by \u003cSEVEN_HUNDRED_PERCENT\u003e surpassing its sectors performance v2 retail share price today opened at \u003cONE_THOUSAND\u003e apiece on nse the stock touched an intraday high of \u003cONE_THOUSAND\u003e and an intraday low of \u003cONE_THOUSAND\u003e v2 retail share price is in a consistent uptrend making higher high formations it is well trading above all the major moving averages the momentum oscillators suggest that there is still more fuel left in the stock so one can ride the trend with a stop at \u003cONE_THOUSAND\u003e said dr ravi singh svp retail research religare broking ltd nuvama pointed out that the retail sector in india is undergoing a notable transformation due to consumers becoming more selective and aspirational this has led to an increasing need for better shopping experiences shift from unorganised to organised retail fashionable products improved value propositions and wider choices in wardrobes according to the report v2 retail expanded by \u003cONE_TEN\u003e stores in the first half of fy25 and its newly established stores are performing well the company aims to increase its store count by \u003cSIX_TEN\u003e in fy25 while sustaining double digit same store sales growth sssg for the remainder of the year v2 retail has finished its store rationalisation program and its new stores are experiencing good foot traffic while the sssg of its established stores remains robust we are upgrading our fy25 store addition sssg target to \u003cFIVE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e from \u003cFOUR_TEN\u003e \u003cONE_TEN_PERCENT\u003e earlier the management in its recent interviews has given an aspiration to reach \u003cONE_THOUSAND\u003e crore sales in fy25 we expect \u003cFOUR_TEN_PERCENT\u003e revenue cagr over fy24 \u003cTWO_TEN\u003e led by an aggressive push towards store additions and higher throughput said the brokerage v2 retail is targeting a sales cagr of \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e over the next three to four years potentially resulting in improved margins and better store performance the company aims to maintain a roe of \u003cTWO_TEN_PERCENT\u003e expansion into new stores and increasing revenue per square foot are expected to drive significant revenue and ebitda growth due to the companys adjusted store addition goals and better than expected sssg the brokerage have increased its fy26 revenue estimate by \u003cONE_TEN_PERCENT\u003e as peers such as v mart retail and zudio have over \u003cFIVE_HUNDRED\u003e stores each we believe vrel can achieve healthy growth rates over a longer period with aggressive and profitable growth we upgrade our target multiple to \u003cONE_TEN\u003e x fy26 ev ebitda from \u003cONE_TEN\u003e x earlier and reaffirm buy with a revised target price of \u003cONE_THOUSAND\u003e from \u003cONE_THOUSAND\u003e earlier","timestamp":"2024-10-04T13:04:00+05:30","market_timestamp":"2024-10-04T13:04:00+05:30","off_market_hours":false}