{"url":"https://www.livemint.com/market/stock-market-news/skipper-shares-jump-10-as-nuvama-initiates-coverage-with-a-buy-call-sees-46-upside-in-multibagger-small-cap-stock-11728365623271.html","title":"Multibagger small-cap stock: Skipper shares jump 10% as Nuvama initiates coverage with ‘Buy’ call; sees 46% upside","description":"Skipper shares have gained over 15% in one month and more than 23% in three months. Year-to-date (YTD), Skipper share price has doubled investors’ money with around 110% returns, while the stock has jumped 116% in one year.","content":"Skipper share price jumped nearly 10% on Tuesday after brokerage firm Nuvama Institutional Equities initiated coverage on the multibagger small-cap stock with a bullish view. Skipper shares rallied as much as 9.62% to  ₹486.75 apiece on the BSE.Nuvama initiated coverage on Skipper shares with a ‘Buy’ rating and a 12-month target price of  ₹650 per share, implying an upside potential of more than 46% from Monday’s closing price. In its bull case, the brokerage firm has a target price of  ₹740 apiece.With its presence across the T\u0026D ecosystem, Nuvama believes Skipper Ltd is poised for a powerful performance driven by proposed NEP with indicative transmission capex of  ₹9.2 lakh crore (over FY22–32E), and a global wave of Renewable Energy (RE) transition driving HV (high-voltage) T\u0026D capex.Skipper, hence, stands to benefit immensely from domestic and export order intake tailwinds, Nuvama said.Skipper is the only company with backward integration of rolling mills, tower pole fasteners’ production and EPC capabilities. It intends to double tower manufacturing capacity to 600,000 MTA from 300,000 MTPA currently at an outlay of  ₹800 crore over the next four–five years.In the key international markets, Skipper faces lower Chinese or Turkish competition, resulting in 64% growth in its international pipeline in FY24 to  ₹108.3 billion.“Skipper is ready to harness several tailwinds: i) power T\u0026D capex of  ₹9.2 trillion over 2022–32; ii) improving product mix with a shift to margin-accretive HV segment; iii) doubling of capacity in four–five years; iv) a well-capitalised balance sheet with FY24 D/E at 0.49x and OPM improving from 9.7% in FY24 to 10.5% by FY27E (guidance of 11% for three years),” Nuvama said.Skipper stock price has shown a stellar rally this year, giving multibagger returns to investors. Skipper shares have gained over 15% in one month and more than 23% in three months. Year-to-date (YTD), Skipper share price has doubled investors’ money with around 110% returns, while the stock has jumped 116% in one year.At 11:10 am, Skipper shares were trading 8.81% higher at  ₹483.10 apiece with a market capitalisation of over  ₹5,500 crore on the BSE.","cleaned_content":"skipper share price jumped nearly \u003cONE_TEN_PERCENT\u003e on tuesday after brokerage firm nuvama institutional equities initiated coverage on the multibagger small cap stock with a bullish view skipper shares rallied as much as \u003cNINE_PERCENT\u003e to \u003cFOUR_HUNDRED\u003e apiece on the bse nuvama initiated coverage on skipper shares with a buy rating and a \u003cONE_TEN\u003e month target price of \u003cSIX_HUNDRED\u003e per share implying an upside potential of more than \u003cFOUR_TEN_PERCENT\u003e from monday s closing price in its bull case the brokerage firm has a target price of \u003cSEVEN_HUNDRED\u003e apiece with its presence across the t d ecosystem nuvama believes skipper ltd is poised for a powerful performance driven by proposed nep with indicative transmission capex of \u003cNINE_\u003e lakh crore over fy22 \u003cTHREE_TEN\u003e e and a global wave of renewable energy re transition driving hv high voltage t d capex skipper hence stands to benefit immensely from domestic and export order intake tailwinds nuvama said skipper is the only company with backward integration of rolling mills tower pole fasteners production and epc capabilities it intends to double tower manufacturing capacity to \u003cSIX_HUNDRED_THOUSAND\u003e mta from \u003cTHREE_HUNDRED_THOUSAND\u003e mtpa currently at an outlay of \u003cEIGHT_HUNDRED\u003e crore over the next four five years in the key international markets skipper faces lower chinese or turkish competition resulting in \u003cSIX_TEN_PERCENT\u003e growth in its international pipeline in fy24 to \u003cONE_HUNDRED\u003e billion skipper is ready to harness several tailwinds i power t d capex of \u003cNINE_\u003e trillion over \u003cTWO_THOUSAND\u003e \u003cTHREE_TEN\u003e ii improving product mix with a shift to margin accretive hv segment iii doubling of capacity in four five years iv a well capitalised balance sheet with fy24 d e at \u003cZERO_\u003e x and opm improving from \u003cNINE_PERCENT\u003e in fy24 to \u003cONE_TEN_PERCENT\u003e by fy27e guidance of \u003cONE_TEN_PERCENT\u003e for three years nuvama said skipper stock price has shown a stellar rally this year giving multibagger returns to investors skipper shares have gained over \u003cONE_TEN_PERCENT\u003e in one month and more than \u003cTWO_TEN_PERCENT\u003e in three months year to date ytd skipper share price has doubled investors money with around \u003cONE_HUNDRED_PERCENT\u003e returns while the stock has jumped \u003cONE_HUNDRED_PERCENT\u003e in one year at \u003cONE_TEN\u003e \u003cONE_TEN\u003e am skipper shares were trading \u003cEIGHT_PERCENT\u003e higher at \u003cFOUR_HUNDRED\u003e apiece with a market capitalisation of over \u003cFIVE_THOUSAND\u003e crore on the bse","timestamp":"2024-10-08T11:12:00+05:30","market_timestamp":"2024-10-08T11:12:00+05:30","off_market_hours":false}