{"url":"https://www.livemint.com/market/stock-market-news/rbi-monetary-policy-with-no-rate-cuts-in-october-is-rbi-falling-behind-the-curve-experts-weigh-in-11728462618779.html","title":"RBI monetary policy: With no rate cuts in October, is RBI falling behind the curve? Experts weigh in","description":"RBI monetary policy: RBI Governor Shaktikanta Das announced that inflation is nearing target but warned against premature rate cuts. The RBI maintained a steady repo rate of 6.50%, shifting to a 'neutral' stance.","content":"RBI monetary policy: Controlling inflation is like taming a wild horse—a task that's never easy and requires constant vigilance. Just ask the RBI Governor Shaktikanta Das.Today, Das announced that the inflation horse has finally been led back to the stable, inching closer to the target range. But he warned that opening the gate too soon could see the horse bolt once more. \"We must keep the horse under a tight leash so that we do not lose control,\" Das exhorted in his monetary policy speech on Wednesday, October 9.When the US Federal Reserve slashed its benchmark rates by 50 basis points in September, it sparked hopes that the RBI might soon follow suit, with a potential rate cut on the horizon in October. Although the RBI's decisions aren't strictly tied to the Fed's moves, history shows emerging market central banks often dance to the Fed's policy beats.However, choosing its own path, the RBI decided not to shadow the Fed fully; instead, it kept its eyes firmly on both domestic and global macro conditions. On Wednesday, the central bank held the repo rate steady at 6.50 per cent. However, in a subtle tone shift, it left the door ajar for future rate cuts by changing its policy stance to ‘neutral’ from 'withdrawal of accommodation'.\"The MPC decided unanimously to change the stance to ‘neutral’ and to remain unambiguously focused on a durable alignment of inflation with the target while supporting growth,\" Das announced.With the RBI opting to keep interest rates steady in October, the question arises—has it fallen behind the curve?Even as the Indian economy remains on a strong footing and inflation has come closer to the RBI's 4 per cent target, the central bank does not want to shift its focus away from the evolving equation of inflation and economic growth.Despite its significant decline from the pandemic highs, Headline inflation has been slow and uneven. RBI observed that food inflation pressures could see some easing later in this financial year, but adverse weather events continue to pose contingent risks.The MPC's concerns appear to be dominated by the uncertainty swirling around adverse weather conditions, geopolitical tensions, and volatile crude oil prices.\"The prevailing and expected inflation-growth balance has created congenial conditions for a change in monetary policy stance to neutral. Even as there is greater confidence in navigating the last mile of disinflation, significant risks – I repeat significant risks – to inflation from adverse weather events, accentuating geopolitical conflicts, and the very recent increase in certain commodity prices continue to stare at us. The adverse impact of these risks cannot be underestimated,\" said Das in his speech on Wednesday.Experts say the RBI Governor is on the right path, and deferring interest rate cuts is justified at this juncture.\"We believe the RBI’s decision to defer entering a rate-easing cycle is justified, given the trade-off between growth and inflation,\" said Sujan Hajra, Chief Economist \u0026 Executive Director, Anand Rathi Shares and Stock Brokers.Hajra underscored that while some indicators suggest that growth is not as strong, the bigger question is whether this is a temporary issue and if growth will pick up in the second half of the current fiscal year.The chief economist of Anand Rathi Shares and Stock Brokers believes that favourable tailwinds, such as improved agricultural output, increased government spending, and moderate crude prices, should prevent the recent slowdown from being sustained.\"The shift to a neutral stance leaves the RBI the option to cut rates in December 2024 if the slowdown persists, but it can also choose to hold off if growth gains momentum. Given the ongoing uncertainty in geopolitics and weather conditions, this is a prudent approach,\" said Hajra.According to Madhavi Arora, Chief Economist at Emkay Global Financial Services, no rate action, in conjunction with stance change to neutral with stress on being 'actively disinflationary' is indeed RBI's best bet to prep ground for the start of a shallow easing cycle, possibly but not necessarily from December.Dharmakirti Joshi, Chief Economist at CRISIL, pointed out that risks and uncertainties persist globally, with escalating tensions in the Middle East, weather uncertainties and the outcome of US elections in focus. This is why the RBI took a cautious approach and kept its powder dry.Deepak Agarwal, CIO-Debt at Kotak Mahindra AMC, underscored with inflation coming closer to its durable target of 4 per cent, the RBI has changed its stance to neutral in the October 24 policy, which opens the door for future rate cuts.Agarwal added that the RBI has kept the liquidity situation relatively easier in recent times, as evidenced by the drop in overnight rates by more than 25 bps over the last few months. Hence, the RBI has been pragmatic and has been taking proactive steps to manage the growth inflation dynamics.Anirudh Garg, Partner and Fund Manager at Invasset PMS, finds the RBI’s latest monetary policy decisions indicative of a prudent, data-driven approach that aligns with market stability and growth.\"The RBI's shift to a neutral stance, while maintaining the repo rate at 6.5 per cent, underscores a flexible approach to inflation management and monetary policy. This decision is well-calibrated, given the ongoing inflationary concerns influenced by rising food and metal prices,\" said Garg.At first glance, the RBI's policy stance change appears to have pleased the market. The benchmark index Sensex jumped 0.80 per cent, while the mid-and small-cap indices on the BSE jumped up to 2 per cent.Experts say the RBI's status quo on policy rates is not negative for market sentiment and reflects the central bank's commitment to balancing growth and inflation dynamics.Moreover, the status quo on the interest rates will allow banks to keep lending rates at elevated levels, boosting their margins. Since banking stocks have significant weight in the Sensex and the Nifty, their better show will augur well for the benchmarks.\"Markets are taking the decision positively, as no rate cuts would be beneficial for the banks since they would be able to maintain the high lending rates, allowing them to maintain their NIMs (net interest margins) in the short term,\" said Divam Sharma, Founder and Fund Manager at Green Portfolio.Going ahead, Q2 earnings of India Inc., US Fed rate cuts, evolving situations in the Middle East, news flow around the US presidential election and macroeconomic prints will continue influencing market movement.Read all market-related news here","cleaned_content":"rbi monetary policy controlling inflation is like taming a wild horse a task thats never easy and requires constant vigilance just ask the rbi governor shaktikanta das today das announced that the inflation horse has finally been led back to the stable inching closer to the target range but he warned that opening the gate too soon could see the horse bolt once more we must keep the horse under a tight leash so that we do not lose control das exhorted in his monetary policy speech on wednesday october \u003cNINE_\u003e when the us federal reserve slashed its benchmark rates by \u003cFIVE_TEN\u003e basis points in september it sparked hopes that the rbi might soon follow suit with a potential rate cut on the horizon in october although the rbis decisions arent strictly tied to the feds moves history shows emerging market central banks often dance to the feds policy beats however choosing its own path the rbi decided not to shadow the fed fully instead it kept its eyes firmly on both domestic and global macro conditions on wednesday the central bank held the repo rate steady at \u003cSIX_PERCENT\u003e however in a subtle tone shift it left the door ajar for future rate cuts by changing its policy stance to neutral from withdrawal of accommodation the mpc decided unanimously to change the stance to neutral and to remain unambiguously focused on a durable alignment of inflation with the target while supporting growth das announced with the rbi opting to keep interest rates steady in october the question arises has it fallen behind the curve even as the indian economy remains on a strong footing and inflation has come closer to the rbis \u003cFOUR_PERCENT\u003e target the central bank does not want to shift its focus away from the evolving equation of inflation and economic growth despite its significant decline from the pandemic highs headline inflation has been slow and uneven rbi observed that food inflation pressures could see some easing later in this financial year but adverse weather events continue to pose contingent risks the mpcs concerns appear to be dominated by the uncertainty swirling around adverse weather conditions geopolitical tensions and volatile crude oil prices the prevailing and expected inflation growth balance has created congenial conditions for a change in monetary policy stance to neutral even as there is greater confidence in navigating the last mile of disinflation significant risks i repeat significant risks to inflation from adverse weather events accentuating geopolitical conflicts and the very recent increase in certain commodity prices continue to stare at us the adverse impact of these risks cannot be underestimated said das in his speech on wednesday experts say the rbi governor is on the right path and deferring interest rate cuts is justified at this juncture we believe the rbi s decision to defer entering a rate easing cycle is justified given the trade off between growth and inflation said sujan hajra chief economist executive director anand rathi shares and stock brokers hajra underscored that while some indicators suggest that growth is not as strong the bigger question is whether this is a temporary issue and if growth will pick up in the second half of the current fiscal year the chief economist of anand rathi shares and stock brokers believes that favourable tailwinds such as improved agricultural output increased government spending and moderate crude prices should prevent the recent slowdown from being sustained the shift to a neutral stance leaves the rbi the option to cut rates in december \u003cTWO_THOUSAND\u003e if the slowdown persists but it can also choose to hold off if growth gains momentum given the ongoing uncertainty in geopolitics and weather conditions this is a prudent approach said hajra according to madhavi arora chief economist at emkay global financial services no rate action in conjunction with stance change to neutral with stress on being actively disinflationary is indeed rbis best bet to prep ground for the start of a shallow easing cycle possibly but not necessarily from december dharmakirti joshi chief economist at crisil pointed out that risks and uncertainties persist globally with escalating tensions in the middle east weather uncertainties and the outcome of us elections in focus this is why the rbi took a cautious approach and kept its powder dry deepak agarwal cio debt at kotak mahindra amc underscored with inflation coming closer to its durable target of \u003cFOUR_PERCENT\u003e the rbi has changed its stance to neutral in the october \u003cTWO_TEN\u003e policy which opens the door for future rate cuts agarwal added that the rbi has kept the liquidity situation relatively easier in recent times as evidenced by the drop in overnight rates by more than \u003cTWO_TEN\u003e bps over the last few months hence the rbi has been pragmatic and has been taking proactive steps to manage the growth inflation dynamics anirudh garg partner and fund manager at invasset pms finds the rbi s latest monetary policy decisions indicative of a prudent data driven approach that aligns with market stability and growth the rbis shift to a neutral stance while maintaining the repo rate at \u003cSIX_PERCENT\u003e underscores a flexible approach to inflation management and monetary policy this decision is well calibrated given the ongoing inflationary concerns influenced by rising food and metal prices said garg at first glance the rbis policy stance change appears to have pleased the market the benchmark index sensex jumped \u003cZERO_PERCENT\u003e while the mid and small cap indices on the bse jumped up to \u003cTWO_PERCENT\u003e experts say the rbis status quo on policy rates is not negative for market sentiment and reflects the central banks commitment to balancing growth and inflation dynamics moreover the status quo on the interest rates will allow banks to keep lending rates at elevated levels boosting their margins since banking stocks have significant weight in the sensex and the nifty their better show will augur well for the benchmarks markets are taking the decision positively as no rate cuts would be beneficial for the banks since they would be able to maintain the high lending rates allowing them to maintain their nims net interest margins in the short term said divam sharma founder and fund manager at green portfolio going ahead q2 earnings of india inc us fed rate cuts evolving situations in the middle east news flow around the us presidential election and macroeconomic prints will continue influencing market movement read all market related news here","timestamp":"2024-10-09T15:29:00+05:30","market_timestamp":"2024-10-09T15:29:00+05:30","off_market_hours":false}