{"url":"https://www.livemint.com/market/stock-market-news/stocks-to-watch-torrent-power-spicejet-ola-electric-paytm-nuvama-wealth-and-more-11728408815826.html","title":"Stocks to Watch: Torrent Power, SpiceJet, Ola Electric, Paytm, Nuvama Wealth, and more","description":"Here’s a quick look at stocks likely to be in focus in today's trade.","content":"Torrent Power: The company has secured a significant contract from the Maharashtra government to supply 2,000 MW of energy storage capacity from its upcoming pumped hydro storage plant. This development represents a major step in Torrent Power’s growth within the energy sector.SpiceJet: Following a successful  ₹3,000 crore fund-raising through qualified institutional placement, SpiceJet plans to invest  ₹400 crore over the next two years to bring 36 grounded planes back into operation. Additionally, the airline is leasing seven planes to bolster its fleet and improve operational efficiency.Ola Electric: The company received a show-cause notice from the Central Consumer Protection Authority, citing nearly 10,000 grievances. Ola Electric, however, stated that the notice would not affect its business activities, and the company remains focused on its operations.Embassy Office Parks REIT: Embassy REIT has raised  ₹2,000 crore in debt at an interest rate of 7.95 percent to repay maturing non-convertible debentures. This refinancing move enables Embassy to optimize its balance sheet amidst current capital market conditions.One97 Communications: Paytm Money, a subsidiary of One97 Communications, has launched BSE Futures \u0026 Options (F\u0026O) trading, allowing users to trade both NSE and BSE contracts. With a trading charge of  ₹20 per order, the initiative is aimed at enhancing user experience, particularly amid a rising number of retail investors facing losses in F\u0026O trading.Nuvama Wealth Management: Nuvama Wealth Management has received an administrative warning from the Securities and Exchange Board of India (SEBI) following an inspection related to its merchant banking operations. The company will be taking corrective actions as per SEBI’s guidelines.IRFC: On Tuesday, the Indian Railway Finance Corporation announced its plans to finance up to  ₹700 crore under a finance lease for 20 BOBR (Bogie Open Bottom Rapid) rakes, procured by NTPC under the Ministry of Railways’ General-Purpose Wagon Investment Scheme (GPWIS).SKF India: The company’s board of directors has approved the demerger of its automotive and industrial businesses via a scheme of agreement. The corporate restructuring committee has been given the authority to prepare a detailed scheme for the proposed demerger, as mentioned in an exchange filing.","cleaned_content":"torrent power the company has secured a significant contract from the maharashtra government to supply \u003cTWO_THOUSAND\u003e mw of energy storage capacity from its upcoming pumped hydro storage plant this development represents a major step in torrent power s growth within the energy sector spicejet following a successful \u003cTHREE_THOUSAND\u003e crore fund raising through qualified institutional placement spicejet plans to invest \u003cFOUR_HUNDRED\u003e crore over the next two years to bring \u003cTHREE_TEN\u003e grounded planes back into operation additionally the airline is leasing seven planes to bolster its fleet and improve operational efficiency ola electric the company received a show cause notice from the central consumer protection authority citing nearly \u003cONE_TEN_THOUSAND\u003e grievances ola electric however stated that the notice would not affect its business activities and the company remains focused on its operations embassy office parks reit embassy reit has raised \u003cTWO_THOUSAND\u003e crore in debt at an interest rate of \u003cSEVEN_PERCENT\u003e to repay maturing non convertible debentures this refinancing move enables embassy to optimize its balance sheet amidst current capital market conditions one97 communications paytm money a subsidiary of one97 communications has launched bse futures options f o trading allowing users to trade both nse and bse contracts with a trading charge of \u003cTWO_TEN\u003e per order the initiative is aimed at enhancing user experience particularly amid a rising number of retail investors facing losses in f o trading nuvama wealth management nuvama wealth management has received an administrative warning from the securities and exchange board of india sebi following an inspection related to its merchant banking operations the company will be taking corrective actions as per sebi s guidelines irfc on tuesday the indian railway finance corporation announced its plans to finance up to \u003cSEVEN_HUNDRED\u003e crore under a finance lease for \u003cTWO_TEN\u003e bobr bogie open bottom rapid rakes procured by ntpc under the ministry of railways general purpose wagon investment scheme gpwis skf india the company s board of directors has approved the demerger of its automotive and industrial businesses via a scheme of agreement the corporate restructuring committee has been given the authority to prepare a detailed scheme for the proposed demerger as mentioned in an exchange filing","timestamp":"2024-10-09T08:27:00+05:30","market_timestamp":"2024-10-09T09:15:00+05:30","off_market_hours":true}