{"url":"https://www.livemint.com/market/stock-market-news/shanghai-composite-index-slumps-7-as-mainland-china-stocks-snap-10-day-winning-streak-on-fading-stimulus-optimism-11728470043676.html","title":"Shanghai Composite logs biggest drop since 2020, Hang Seng extends worst loss since 2008 on fading stimulus optimism","description":"The frontline benchmark Shanghai Composite Index, fell over seven per cent, while the blue-chip CSI300 index also dropped 6.9 per cent after investors were disappointed over the halt of stimulus measures","content":"Mainland China stocks plunged on Wednesday, October 9, snapping a 10-day winning streak after officials failed to inspire confidence in stimulus plans to revive the economy. Following the losses, the frontline benchmark Shanghai Composite index fell over seven per cent, its worst loss since February 2020, when fears were rising about COVID-19 emanating from Wuhan and other cities in China.The blue-chip CSI300 index also dropped 7.1 per cent. In Hong Kong, the Hang Seng index fell 1.4 per cent after dropping more than nine per cent the day before, logging its worst loss since the global financial crisis of 2008. Weak holiday-spending data also hurt sentiment. The Golden Dragon index of US-listed Chinese stocks declined 3.7 per cent.Also Read: China finance ministry calls press briefing, firing up stimulus hopesThe session's moves reversed from those seen the day before after mainland Chinese stocks returned from a week-long holiday. Investors initially enthusiastic about a series of steps to kickstart domestic growth were left deflated on Tuesday when a press conference did not provide any further measures.China’s main planning agency, the National Development and Reform Commission, was unlikely to convey much information about government spending, which is the purview of the Finance Ministry. The ministry is due to hold a briefing on Saturday that could provide further details on planned government outlays, which have fallen short of investors' expectations.Stock investors have sought greater fiscal spending to arrest a slowdown that threatens to put the country’s 2024 target of about five per cent growth out of reach. Banks, including Morgan Stanley and HSBC Holdings Plc, expect 2 trillion yuan ($283 billion) in stimulus, while Citigroup Inc. put the amount at 3 trillion yuan.The A-share market comprised of stocks listed in Shanghai, Shenzhen and Beijing had a roller-coaster ride a day earlier after returning from a week-long holiday break, with turnover hitting a record 3.485 trillion yuan on Tuesday.Also Read: Hong Kong’s Hang Seng Index plunges 9.4%, highest fall since 2008; here’s whyTourism shares were among the top losers on Wednesday, as data showed that spending during the Golden Week holidays had yet to recover to pre-COVID levels. An index tracking the sector's performance lost 7.8 per cent. Separately, property shares were another big draggers on the market. The CSI 300 Real Estate index plunged 9.7 per cent.A growing number of strategists and fund managers say Beijing needs to back up its spending pledges with real money, while others caution that the rally went too far too fast after benchmark indexes surged more than 30 per cent in a matter of days.Hong Kong's stock market soared more than 20 per cent between the first batch of announced measures in late September and the start of this week. The Hang Seng index is one of the best-performing major global markets this year, having seen its steepest rally in a generation over recent weeks.Also Read: Hang Seng rallies 33% in 21 days as Nippon India ETF trades at 5% premium: Will China stimulus boost SIP returns?The Hang Seng index began an upward trend on September 11, 2024, starting at 17,108.71 points and rising to 22,736.87 points by October 4, 2024, marking a 32.9 per cent gain in just three weeks or 21 days. The Shanghai Composite is still up 9.5 per cent for the year so far, while Hong Kong’s index is up 21.1 per cent.The Chinese government has set a target for about five per cent annual growth this year, but the economy expanded at only a 4.7 per cent pace in the last quarter, and economists have been revising their estimates for the full year downward. China's moves in late September fueled a rally that has since fizzled.China's central bank announced its largest stimulus since the pandemic on September 24, aiming to boost the economy and move it closer to the government's growth target. The People's Bank of China (PBoC) will cut banks' reserve requirement ratio (RRR) by 50 basis points, releasing about one trillion yuan ($142.21 billion) for new lending.China plans to spend funds on recapitalizing six big state-owned banks as the world’s second-largest economy as it struggles to regain momentum after the COVID-19 pandemic. The rebound in the Chinese market has sparked a shift in foreign capital away from India and toward China, lured by its cheap and attractive valuations.","cleaned_content":"mainland china stocks plunged on wednesday october \u003cNINE_\u003e snapping a \u003cONE_TEN\u003e day winning streak after officials failed to inspire confidence in stimulus plans to revive the economy following the losses the frontline benchmark shanghai composite index fell over seven per cent its worst loss since february \u003cTWO_THOUSAND\u003e when fears were rising about covid \u003cONE_TEN\u003e emanating from wuhan and other cities in china the blue chip csi300 index also dropped \u003cSEVEN_PERCENT\u003e in hong kong the hang seng index fell \u003cONE_PERCENT\u003e after dropping more than nine per cent the day before logging its worst loss since the global financial crisis of \u003cTWO_THOUSAND\u003e weak holiday spending data also hurt sentiment the golden dragon index of us listed chinese stocks declined \u003cTHREE_PERCENT\u003e also read china finance ministry calls press briefing firing up stimulus hopesthe sessions moves reversed from those seen the day before after mainland chinese stocks returned from a week long holiday investors initially enthusiastic about a series of steps to kickstart domestic growth were left deflated on tuesday when a press conference did not provide any further measures china s main planning agency the national development and reform commission was unlikely to convey much information about government spending which is the purview of the finance ministry the ministry is due to hold a briefing on saturday that could provide further details on planned government outlays which have fallen short of investors expectations stock investors have sought greater fiscal spending to arrest a slowdown that threatens to put the country s \u003cTWO_THOUSAND\u003e target of about five per cent growth out of reach banks including morgan stanley and hsbc holdings plc expect \u003cTWO_\u003e trillion yuan \u003cTWO_HUNDRED\u003e billion in stimulus while citigroup inc put the amount at \u003cTHREE_\u003e trillion yuan the a share market comprised of stocks listed in shanghai shenzhen and beijing had a roller coaster ride a day earlier after returning from a week long holiday break with turnover hitting a record \u003cTHREE_\u003e trillion yuan on tuesday also read hong kong s hang seng index plunges \u003cNINE_PERCENT\u003e highest fall since \u003cTWO_THOUSAND\u003e here s whytourism shares were among the top losers on wednesday as data showed that spending during the golden week holidays had yet to recover to pre covid levels an index tracking the sectors performance lost \u003cSEVEN_PERCENT\u003e separately property shares were another big draggers on the market the csi \u003cTHREE_HUNDRED\u003e real estate index plunged \u003cNINE_PERCENT\u003e a growing number of strategists and fund managers say beijing needs to back up its spending pledges with real money while others caution that the rally went too far too fast after benchmark indexes surged more than \u003cTHREE_TEN_PERCENT\u003e in a matter of days hong kongs stock market soared more than \u003cTWO_TEN_PERCENT\u003e between the first batch of announced measures in late september and the start of this week the hang seng index is one of the best performing major global markets this year having seen its steepest rally in a generation over recent weeks also read hang seng rallies \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_TEN\u003e days as nippon india etf trades at \u003cFIVE_PERCENT\u003e premium will china stimulus boost sip returns the hang seng index began an upward trend on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e starting at \u003cONE_TEN_THOUSAND\u003e points and rising to \u003cTWO_TEN_THOUSAND\u003e points by october \u003cFOUR_\u003e \u003cTWO_THOUSAND\u003e marking a \u003cTHREE_TEN_PERCENT\u003e gain in just three weeks or \u003cTWO_TEN\u003e days the shanghai composite is still up \u003cNINE_PERCENT\u003e for the year so far while hong kong s index is up \u003cTWO_TEN_PERCENT\u003e the chinese government has set a target for about five per cent annual growth this year but the economy expanded at only a \u003cFOUR_PERCENT\u003e pace in the last quarter and economists have been revising their estimates for the full year downward chinas moves in late september fueled a rally that has since fizzled chinas central bank announced its largest stimulus since the pandemic on september \u003cTWO_TEN\u003e aiming to boost the economy and move it closer to the governments growth target the peoples bank of china pboc will cut banks reserve requirement ratio rrr by \u003cFIVE_TEN\u003e basis points releasing about one trillion yuan \u003cONE_HUNDRED\u003e billion for new lending china plans to spend funds on recapitalizing six big state owned banks as the world s second largest economy as it struggles to regain momentum after the covid \u003cONE_TEN\u003e pandemic the rebound in the chinese market has sparked a shift in foreign capital away from india and toward china lured by its cheap and attractive valuations","timestamp":"2024-10-09T22:05:00+05:30","market_timestamp":"2024-10-10T09:15:00+05:30","off_market_hours":true}