{"url":"https://www.livemint.com/market/stock-market-news/israeliran-war-rvnl-railtel-irfc-to-irctc-railway-stocks-drop-up-to-8-11728289193813.html","title":"Israel-Iran war: RVNL, RailTel, IRFC to IRCTC — railway stocks drop up to 8%","description":"Stock market today: Railway stocks faced a sharp decline of up to 8% amid the escalating Israel-Iran conflict. RVNL led the losses with a drop of 7.74%, followed by RailTel, IRFC, and IRCTC","content":"Railway stocks experienced a significant drop of up to 8% on Monday, October 7, with Rail Vikas Nigam Ltd (RVNL) leading the decline. Shares of RailTel, IRFC and IRCTC also experienced significant cuts.\"Railway stocks are overbought, and FIIs are not in the mood to hold them further, especially after the outbreak of the Israel-Iran war. The rest of the damage is being done by the exit polls of the Haryana and Jammu \u0026 Kashmir assembly elections, in which the incumbent BJP government is predicted to lose both states on the final day. So, some reason for the sharp selling in these railway PSU stocks can also be attributed to these exit polls,\" said Anshul Jain, Head of Research at Lakshimishree Investment and Securities, while speaking on the factors contributing to the volatility.RVNL shares plunged 7.74 per cent to  ₹455.20 on October 7 at 2:02 pm, after hovering between  ₹500 and  ₹550 in recent days. The stock has seen a 12 per cent drop over the last five days and a 19 per cent decline in the past month.Additionally, RailTel Corporation of India share price witnessed a decline of 7.52 per cent to  ₹399.40 at 2:01 pm on NSE.The Indian Railway Catering and Tourism Corporation (IRCTC) share price also dropped by 1.92 per cent to  ₹855.95 around the same time.Indian Railway Finance Corporation Ltd (IRFC) shares also saw a decline, falling 4.63 per cent to  ₹145.03 on the NSE. The stock has dropped 7 per cent in the last five days and 14 per cent in the last month.","cleaned_content":"railway stocks experienced a significant drop of up to \u003cEIGHT_PERCENT\u003e on monday october \u003cSEVEN_\u003e with rail vikas nigam ltd rvnl leading the decline shares of railtel irfc and irctc also experienced significant cuts railway stocks are overbought and fiis are not in the mood to hold them further especially after the outbreak of the israel iran war the rest of the damage is being done by the exit polls of the haryana and jammu kashmir assembly elections in which the incumbent bjp government is predicted to lose both states on the final day so some reason for the sharp selling in these railway psu stocks can also be attributed to these exit polls said anshul jain head of research at lakshimishree investment and securities while speaking on the factors contributing to the volatility rvnl shares plunged \u003cSEVEN_PERCENT\u003e to \u003cFOUR_HUNDRED\u003e on october \u003cSEVEN_\u003e at \u003cTWO_\u003e \u003cTWO_\u003e pm after hovering between \u003cFIVE_HUNDRED\u003e and \u003cFIVE_HUNDRED\u003e in recent days the stock has seen a \u003cONE_TEN_PERCENT\u003e drop over the last five days and a \u003cONE_TEN_PERCENT\u003e decline in the past month additionally railtel corporation of india share price witnessed a decline of \u003cSEVEN_PERCENT\u003e to \u003cTHREE_HUNDRED\u003e at \u003cTWO_\u003e \u003cONE_\u003e pm on nse the indian railway catering and tourism corporation irctc share price also dropped by \u003cONE_PERCENT\u003e to \u003cEIGHT_HUNDRED\u003e around the same time indian railway finance corporation ltd irfc shares also saw a decline falling \u003cFOUR_PERCENT\u003e to \u003cONE_HUNDRED\u003e on the nse the stock has dropped \u003cSEVEN_PERCENT\u003e in the last five days and \u003cONE_TEN_PERCENT\u003e in the last month","timestamp":"2024-10-07T14:15:00+05:30","market_timestamp":"2024-10-07T14:15:00+05:30","off_market_hours":false}