{"url":"https://www.livemint.com/market/stock-market-news/sebi-gives-in-principle-nod-to-set-up-jio-financial-backrocks-mutual-fund-business-11728056401467.html","title":"Sebi gives in-principle nod to set up Jio Financial-BlackRock’s mutual fund business","description":"Jio Financial and BlackRock had signed a second joint venture in April to set up a wealth management and broking business in the country.","content":"Jio Financial Services Ltd, the spun-off financial services entity of Mukesh Ambani-led Reliance Industries Ltd, has secured an in-principle approval from the Securities and Exchange Board of India (SEBI) to establish a mutual fund business in partnership with BlackRock Financial Management. BlackRock, the world’s largest asset manager, oversees over $10 trillion in assets.\"Please note that SEBI vide letter dated October 3, 2024 has granted in-principle approval to the Company and BlackRock Financial Management Inc to act as co-sponsors and set up the proposed mutual fund. The final registration approval will be granted by SEBI subject to fulfilment by the Company and BlackRock of the requirements set out in the said letter,\" said Jio Financial Services in a regulatory filing to the stock exchanges.Also Read | Jio Financial Services’ promise of the futureDays after its demerger from Reliance Industries in July 2023, Jio Financial Services announced the formation of a 50:50 joint venture with BlackRock to launch asset management services in India. The companies signed a second joint venture in April to set up a wealth management and broking business in the country.“With our partner Jio Financial Services, we want to contribute to the country’s evolution from a nation of savers to investors. Investing is the way for people to reach their financial goals more quickly, and to accelerate wealth creation,\" said Rachel Lord, head of international for BlackRock.Also Read: Jio Financial Services unveils JioFinance app in beta versionThe potential MF may use a digital-first approach to democratise the  ₹50 lakh crore MF industry. Jio Financial Services' consolidated net profit increased multi-fold, from  ₹31 crore in the previous fiscal year to  ₹1,605 crore in FY24. Its revenue increased marginally, from  ₹414 crore in the December quarter to  ₹418 crore.Jio Financial focuses on four pillars: lending and leasing, payment solutions and payments bank, insurance broking and mutual funds, and wealth management and broking services. The company is also advancing its lending business with secured products such as supply chain financing, loans on mutual funds, and device financing. On Friday, shares of Jio Financial Services settled 1.95 per cent lower at  ₹338.75 apiece on the BSE.Also Read | Jio Platforms listing: A vertical split mirroring Jio Financial, or an IPO?","cleaned_content":"jio financial services ltd the spun off financial services entity of mukesh ambani led reliance industries ltd has secured an in principle approval from the securities and exchange board of india sebi to establish a mutual fund business in partnership with blackrock financial management blackrock the world s largest asset manager oversees over \u003cONE_TEN\u003e trillion in assets please note that sebi vide letter dated october \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e has granted in principle approval to the company and blackrock financial management inc to act as co sponsors and set up the proposed mutual fund the final registration approval will be granted by sebi subject to fulfilment by the company and blackrock of the requirements set out in the said letter said jio financial services in a regulatory filing to the stock exchanges also read jio financial services promise of the futuredays after its demerger from reliance industries in july \u003cTWO_THOUSAND\u003e jio financial services announced the formation of a \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e joint venture with blackrock to launch asset management services in india the companies signed a second joint venture in april to set up a wealth management and broking business in the country with our partner jio financial services we want to contribute to the country s evolution from a nation of savers to investors investing is the way for people to reach their financial goals more quickly and to accelerate wealth creation said rachel lord head of international for blackrock also read jio financial services unveils jiofinance app in beta versionthe potential mf may use a digital first approach to democratise the \u003cFIVE_TEN\u003e lakh crore mf industry jio financial services consolidated net profit increased multi fold from \u003cTHREE_TEN\u003e crore in the previous fiscal year to \u003cONE_THOUSAND\u003e crore in fy24 its revenue increased marginally from \u003cFOUR_HUNDRED\u003e crore in the december quarter to \u003cFOUR_HUNDRED\u003e crore jio financial focuses on four pillars lending and leasing payment solutions and payments bank insurance broking and mutual funds and wealth management and broking services the company is also advancing its lending business with secured products such as supply chain financing loans on mutual funds and device financing on friday shares of jio financial services settled \u003cONE_PERCENT\u003e lower at \u003cTHREE_HUNDRED\u003e apiece on the bse also read jio platforms listing a vertical split mirroring jio financial or an ipo","timestamp":"2024-10-04T21:11:00+05:30","market_timestamp":"2024-10-07T09:15:00+05:30","off_market_hours":true}