{"url":"https://www.livemint.com/market/stock-market-news/hdfc-bank-block-deal-morgan-stanley-citigroup-buy-private-bank-s-stock-worth-rs-755-crore-11728010669699.html","title":"HDFC Bank block deal: Morgan Stanley, Citigroup buy private bank’s stock worth  ₹755 crore","description":"Morgan Stanley and Citigroup bought private sector lender HDFC Bank shares for over  ₹755 crore through open market transactions.","content":"HDFC Bank shares witnessed a major block deal transaction on October 3, a day when the Indian stock market crashed with the benchmark indices, Sensex and Nifty 50 falling over 2% each.On Thursday, Morgan Stanley and Citigroup bought private sector lender HDFC Bank shares for over  ₹755 crore through open market transactions.According to the block deal data on the BSE, Morgan Stanley and Citigroup through their affiliates purchased 43.75 lakh shares of HDFC Bank. The shares were purchased at an average price of  ₹1,726.2 apiece, taking the total transaction value to  ₹755.29 crore.The seller of HDFC Bank shares in the block deal was BNP Paribas’ arm BNP Paribas Financial Markets which divested the same number of shares through two separate block deals at  ₹1,726.2 apiece on the BSE.Last week, Paris-based BNP Paribas offloaded HDFC Bank shares worth  ₹543.27 crore.Bears took charge of Dalal Street on Thursday as the Indian stock market crashed, leaving investors poorer by around  ₹11 lakh crore. Sensex and Nifty 50 plunged more than 2% each, dragged by heavy selling across sectors.Indian stock market fell due to several negative factors, including escalating tensions in Middle Asia amid Israel-Iran war, expensive valuations of domestic equities and heavy outflows of foreign investors amid a sharp bounce back in Chinese stocks following recent fiscal and monetary stimulus measures.The Sensex slumped 1,769.19 points, or 2.10%, to close at 82,497.10, while the Nifty 50 settled 546.80 points, or 2.12%, lower at 25,250.10.HDFC Bank share price has failed to see any significant move this year. The largest private bank’s stock has fallen more than 5% in one week and is down over 1% year-to-date (YTD). In the past one year, HDFC Bank shares have gained 11.5%.On Thursday, HDFC Bank stock price ended 2.55% lower at  ₹1,682.15 apiece on the BSE.","cleaned_content":"hdfc bank shares witnessed a major block deal transaction on october \u003cTHREE_\u003e a day when the indian stock market crashed with the benchmark indices sensex and nifty \u003cFIVE_TEN\u003e falling over \u003cTWO_PERCENT\u003e each on thursday morgan stanley and citigroup bought private sector lender hdfc bank shares for over \u003cSEVEN_HUNDRED\u003e crore through open market transactions according to the block deal data on the bse morgan stanley and citigroup through their affiliates purchased \u003cFOUR_TEN\u003e lakh shares of hdfc bank the shares were purchased at an average price of \u003cONE_THOUSAND\u003e apiece taking the total transaction value to \u003cSEVEN_HUNDRED\u003e crore the seller of hdfc bank shares in the block deal was bnp paribas arm bnp paribas financial markets which divested the same number of shares through two separate block deals at \u003cONE_THOUSAND\u003e apiece on the bse last week paris based bnp paribas offloaded hdfc bank shares worth \u003cFIVE_HUNDRED\u003e crore bears took charge of dalal street on thursday as the indian stock market crashed leaving investors poorer by around \u003cONE_TEN\u003e lakh crore sensex and nifty \u003cFIVE_TEN\u003e plunged more than \u003cTWO_PERCENT\u003e each dragged by heavy selling across sectors indian stock market fell due to several negative factors including escalating tensions in middle asia amid israel iran war expensive valuations of domestic equities and heavy outflows of foreign investors amid a sharp bounce back in chinese stocks following recent fiscal and monetary stimulus measures the sensex slumped \u003cONE_THOUSAND\u003e points or \u003cTWO_PERCENT\u003e to close at \u003cEIGHT_TEN_THOUSAND\u003e while the nifty \u003cFIVE_TEN\u003e settled \u003cFIVE_HUNDRED\u003e points or \u003cTWO_PERCENT\u003e lower at \u003cTWO_TEN_THOUSAND\u003e hdfc bank share price has failed to see any significant move this year the largest private bank s stock has fallen more than \u003cFIVE_PERCENT\u003e in one week and is down over \u003cONE_PERCENT\u003e year to date ytd in the past one year hdfc bank shares have gained \u003cONE_TEN_PERCENT\u003e on thursday hdfc bank stock price ended \u003cTWO_PERCENT\u003e lower at \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-10-04T08:40:00+05:30","market_timestamp":"2024-10-04T09:15:00+05:30","off_market_hours":true}