{"url":"https://www.livemint.com/market/stock-market-news/multibagger-alert-tcpl-packaging-share-price-jumps-over-8-as-incred-initiates-coverage-with-add-rating-11728364451541.html","title":"Multibagger Alert: TCPL Packaging share price jumps over 8% as InCred initiates coverage with ’Add’ rating","description":"Multibagger Alert: TCPL Packaging share price surged over 480% in three years, attracting investor interest. InCred Equities initiated coverage with an ADD rating and a target price of  ₹4,250, citing strong growth prospects despite potential risks in EBITDA margins.","content":"Multibagger Alert: TCPL Packaging share price has seen a remarkable increase of over 480% in the course of three years, resulting in substantial returns for its investors. TCPL Packaging makes folding cartons and flexible packaging for a variety of sectors, including food and beverage (F\u0026B), electronics, pharmaceuticals, liquor, FMCG, and tobacco. It is in the top three when it comes to installed capacity for folding cartons. Additionally, it provides alternatives for flexible packaging.InCred Equities, a brokerage firm, has initiated coverage on TCPL Packaging stock with a a high-conviction ADD rating and set a target price of  ₹4,250, considering it as a substitute investment in the domestic FMCG sector.“We factor in a revenue/EPS CAGR of 12%/20%, respectively, over FY24-FY27F and initiate coverage with a high conviction ADD rating by assigning a 22x multiple on its FY27F estimated EPS of  ₹192.3 to arrive at our target price of  ₹4,250,” the brokerage said.InCred Equities holds a positive outlook on the robust growth prospects of TCPL Packaging and sees it as an interesting reflection of the FMCG industry, which has encountered slow volume expansion recently but is projected to recover gradually from FY25F. The brokerage highlighted that the potential downside for the company is the chance of EBITDA margins declining more than expected due to a gradual shift in the sales mix favouring flexible packaging products.TCPL Packaging share price today opened at an intraday day high of  ₹3,487.40 apiece on the BSE, the stock touched an intraday low of  ₹3,205.60. The stock saw an 8.5% increase in today's trading session. However, TCPL Packaging stock price has dropped, experiencing a decrease of around 5% within a week.Ruchit Jain, Lead Research Analyst at 5paisa said that the stock is into a short term corrective phase, but the long trend remains positive and hence, one should look to buy on declines. The support is seen around  ₹3,000.Further, Rajesh Bhosale, Equity Technical and Derivative Analyst at Angel One, added that after Monday's volatility, the TCPL Packaging share prices are holding on to their key support of 50EMA and are trading in a mildly positive territory. For now we are seeing a range-bound move with  ₹3,200 as key support; any longs should be hold with the same stop loss, whereas  ₹3,400 is a stiff resistance.","cleaned_content":"multibagger alert tcpl packaging share price has seen a remarkable increase of over \u003cFOUR_HUNDRED_PERCENT\u003e in the course of three years resulting in substantial returns for its investors tcpl packaging makes folding cartons and flexible packaging for a variety of sectors including food and beverage f b electronics pharmaceuticals liquor fmcg and tobacco it is in the top three when it comes to installed capacity for folding cartons additionally it provides alternatives for flexible packaging incred equities a brokerage firm has initiated coverage on tcpl packaging stock with a a high conviction add rating and set a target price of \u003cFOUR_THOUSAND\u003e considering it as a substitute investment in the domestic fmcg sector we factor in a revenue eps cagr of \u003cONE_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e respectively over fy24 fy27f and initiate coverage with a high conviction add rating by assigning a \u003cTWO_TEN\u003e x multiple on its fy27f estimated eps of \u003cONE_HUNDRED\u003e to arrive at our target price of \u003cFOUR_THOUSAND\u003e the brokerage said incred equities holds a positive outlook on the robust growth prospects of tcpl packaging and sees it as an interesting reflection of the fmcg industry which has encountered slow volume expansion recently but is projected to recover gradually from fy25f the brokerage highlighted that the potential downside for the company is the chance of ebitda margins declining more than expected due to a gradual shift in the sales mix favouring flexible packaging products tcpl packaging share price today opened at an intraday day high of \u003cTHREE_THOUSAND\u003e apiece on the bse the stock touched an intraday low of \u003cTHREE_THOUSAND\u003e the stock saw an \u003cEIGHT_PERCENT\u003e increase in todays trading session however tcpl packaging stock price has dropped experiencing a decrease of around \u003cFIVE_PERCENT\u003e within a week ruchit jain lead research analyst at \u003cFIVE_\u003e paisa said that the stock is into a short term corrective phase but the long trend remains positive and hence one should look to buy on declines the support is seen around \u003cTHREE_THOUSAND\u003e further rajesh bhosale equity technical and derivative analyst at angel one added that after mondays volatility the tcpl packaging share prices are holding on to their key support of \u003cFIVE_TEN\u003e ema and are trading in a mildly positive territory for now we are seeing a range bound move with \u003cTHREE_THOUSAND\u003e as key support any longs should be hold with the same stop loss whereas \u003cTHREE_THOUSAND\u003e is a stiff resistance","timestamp":"2024-10-08T13:07:00+05:30","market_timestamp":"2024-10-08T13:07:00+05:30","off_market_hours":false}