{"url":"https://www.livemint.com/market/stock-market-news/torrent-power-share-price-rises-7-on-securing-2-000-mw-of-energy-storage-contracts-in-maharashtra-11728446198202.html","title":"Torrent Power share price rises 9% to 1 year high on securing  2,000 MW of energy storage contracts in Maharashtra","description":"Stock Market Today: Torrent Power share price gained 9% in the morning trades on Wednesday to hit 1 year high. The company has secured Two Letters of Award totaling 2,000 MW of Energy Storage Capacity from Pumped Hydro Storage Plants from MSEDC","content":"Stock Market Today: Torrent Power share price gained 9% in the morning trades on Wednesday. The Torrent Power share price also hit 1 year (52 week High) on Wednesday. Torrent power has secured two Letters of Award totaling 2,000 MW of Energy Storage Capacity from Pumped Hydro Storage Plants from MSEDC (Maharashtra State Electricity Distribution Co. Ltd)Torrent Power share price that opened at  ₹1922.95 on the BSE on Wednesday , almost 5.8 higher than the previous close of  ₹1817.15. The Torrent Power share price however gained further to highs of  ₹1983.70 on Wednesday marking gains of 9%, which also happened to be its 1 year high (52-week high).Torrent Power share price having gained almost 110% year to date and 173.5% in a year has given Multibagger returns to the investors.Torrent power in its release on Tuesday post market hours said that it has received Letter of Award from MSEDCL for supply of 2,000 MW Energy Storage Capacity from InSTS Connected Pumped Hydro Storage Plant. Torrent power is to supply storage capacity from its upcoming InSTS Connected pumped hydro storage plant at Maharashtra.Torrent power said that this 2,000 MW capacity is inclusive of 1,500 MW Capacity for which Letter of Intent that was already issued by MSEDCL on September 17, 2024. The Company now has now received allotment of additional 500 MW capacity under the tender taking the total capacity allocated to 2,000 MW.The supply storage capacity agreement is for Long Term for a period of 40 yearUnder the Energy Storage Facility Agreement (ESFA), the Company shall make available to MSEDCL a contracted capacity of 2,000 MW capable of scheduled discharge of 8 hours (with maximum continuous 5 hours) per day. The input energy for charging shall be provided by MSEDCL.As part of its plans, Torrent Power has identified Pumped Storage Project (PSP) sites in multiple states, besides Maharashtra. The Company has already announced its intentions to install about 5 to 8 GW of PSP capacity entailing investment of  ₹ 25,000 to  ₹ 35,000 Crores","cleaned_content":"stock market today torrent power share price gained \u003cNINE_PERCENT\u003e in the morning trades on wednesday the torrent power share price also hit \u003cONE_\u003e year \u003cFIVE_TEN\u003e week high on wednesday torrent power has secured two letters of award totaling \u003cTWO_THOUSAND\u003e mw of energy storage capacity from pumped hydro storage plants from msedc maharashtra state electricity distribution co ltd torrent power share price that opened at \u003cONE_THOUSAND\u003e on the bse on wednesday almost \u003cFIVE_\u003e higher than the previous close of \u003cONE_THOUSAND\u003e the torrent power share price however gained further to highs of \u003cONE_THOUSAND\u003e on wednesday marking gains of \u003cNINE_PERCENT\u003e which also happened to be its \u003cONE_\u003e year high \u003cFIVE_TEN\u003e week high torrent power share price having gained almost \u003cONE_HUNDRED_PERCENT\u003e year to date and \u003cONE_HUNDRED_PERCENT\u003e in a year has given multibagger returns to the investors torrent power in its release on tuesday post market hours said that it has received letter of award from msedcl for supply of \u003cTWO_THOUSAND\u003e mw energy storage capacity from insts connected pumped hydro storage plant torrent power is to supply storage capacity from its upcoming insts connected pumped hydro storage plant at maharashtra torrent power said that this \u003cTWO_THOUSAND\u003e mw capacity is inclusive of \u003cONE_THOUSAND\u003e mw capacity for which letter of intent that was already issued by msedcl on september \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company now has now received allotment of additional \u003cFIVE_HUNDRED\u003e mw capacity under the tender taking the total capacity allocated to \u003cTWO_THOUSAND\u003e mw the supply storage capacity agreement is for long term for a period of \u003cFOUR_TEN\u003e yearunder the energy storage facility agreement esfa the company shall make available to msedcl a contracted capacity of \u003cTWO_THOUSAND\u003e mw capable of scheduled discharge of \u003cEIGHT_\u003e hours with maximum continuous \u003cFIVE_\u003e hours per day the input energy for charging shall be provided by msedcl as part of its plans torrent power has identified pumped storage project psp sites in multiple states besides maharashtra the company has already announced its intentions to install about \u003cFIVE_\u003e to \u003cEIGHT_\u003e gw of psp capacity entailing investment of \u003cTWO_TEN_THOUSAND\u003e to \u003cTHREE_TEN_THOUSAND\u003e crores","timestamp":"2024-10-09T09:52:00+05:30","market_timestamp":"2024-10-09T09:52:00+05:30","off_market_hours":false}