{"url":"https://www.moneycontrol.com/news/business/magenta-mobility-euler-motor-extend-partnership-12223921.html","title":"Magenta Mobility, Euler Motor extend partnership","description":"This comes on the back of deliveries of 500 such vehicles to Magenta, as per a statement.","content":"Electric mobility firm Magenta Mobility and commercial electric vehicles maker Euler Motor on Thursday said they were extending their four-year-old partnership, under which Magenta will procure an an additional 2,000 cargo e-three-wheeler HiLoad of the latter. This comes on the back of deliveries of 500 such vehicles to Magenta, as per a statement. The Electric Vehicles (EVs) for the new order will be manufactured at Euler Motors' Palwal manufacturing hub and are expected to be delivered in the next 18 months, it said. \"The decision to scale up significantly with an additional 2,000 electric vehicles is a testimony to our continued partnership. We anticipate that our alliance will not only positively influence the electric mobility landscape but also set new benchmarks for innovation across the industry,\" Magenta Mobility Managing Director \u0026 CEO Maxson Lewis said. ","cleaned_content":"electric mobility firm magenta mobility and commercial electric vehicles maker euler motor on thursday said they were extending their four year old partnership under which magenta will procure an an additional \u003cTWO_THOUSAND\u003e cargo e three wheeler hiload of the latter this comes on the back of deliveries of \u003cFIVE_HUNDRED\u003e such vehicles to magenta as per a statement the electric vehicles evs for the new order will be manufactured at euler motors palwal manufacturing hub and are expected to be delivered in the next \u003cONE_TEN\u003e months it said the decision to scale up significantly with an additional \u003cTWO_THOUSAND\u003e electric vehicles is a testimony to our continued partnership we anticipate that our alliance will not only positively influence the electric mobility landscape but also set new benchmarks for innovation across the industry magenta mobility managing director ceo maxson lewis said","timestamp":"2024-02-08T14:22:00+05:30","market_timestamp":"2024-02-08T14:22:00+05:30","off_market_hours":false}