{"url":"https://www.moneycontrol.com/news/business/saudi-aramco-in-investment-discussions-with-indian-companies-executive-12210531.html","title":"Saudi Aramco in investment discussions with Indian companies: Executive","description":"\"Hopefully we will see some announcements soon on investment in Indian companies,\" Faisal Faqeer, senior vice-president, liquids to chemicals development, downstream, at Saudi Aramco, told delegates at the India Energy Week in Goa, without specifying its plans.Saudi Aramco in investment discussions with Indian companies: Executive","content":"State oil giant Saudi Aramco is in investment discussions with companies in India, a senior executive said on Wednesday. \"Hopefully we will see some announcements soon on investment in Indian companies,\" Faisal Faqeer, senior vice-president, liquids to chemicals development, downstream, at Saudi Aramco, told delegates at the India Energy Week in Goa, without specifying its plans. The world's largest crude oil exporter and OPEC kingpin has been boosting its investments in refining and petrochemicals across Asia to secure new markets for its crude, as it sees growth in chemicals central to its downstream expansion strategy. Saudi Arabia is pumping around 9 million bpd, well below its roughly 12 million bpd existing capacity after it cut production as part of an agreement with OPEC and its allies last year. Reuters reported last year that India, the world's third largest oil importer and consumer, had wanted Saudi Arabia's Aramco to participate in its planned strategic petroleum reserve(SPR) programme to strengthen ties with its key oil supplier. ","cleaned_content":"state oil giant saudi aramco is in investment discussions with companies in india a senior executive said on wednesday hopefully we will see some announcements soon on investment in indian companies faisal faqeer senior vice president liquids to chemicals development downstream at saudi aramco told delegates at the india energy week in goa without specifying its plans the worlds largest crude oil exporter and opec kingpin has been boosting its investments in refining and petrochemicals across asia to secure new markets for its crude as it sees growth in chemicals central to its downstream expansion strategy saudi arabia is pumping around \u003cNINE_\u003e million bpd well below its roughly \u003cONE_TEN\u003e million bpd existing capacity after it cut production as part of an agreement with opec and its allies last year reuters reported last year that india the worlds third largest oil importer and consumer had wanted saudi arabias aramco to participate in its planned strategic petroleum reserve spr programme to strengthen ties with its key oil supplier","timestamp":"2024-02-07T11:34:00+05:30","market_timestamp":"2024-02-07T11:34:00+05:30","off_market_hours":false}