{"url":"https://www.moneycontrol.com/news/business/oyo-forays-into-sports-hospitality-business-shortlists-100-hotels-in-12-key-cities-12279481.html","title":"OYO forays into sports hospitality business, shortlists 100 hotels in 12 key cities","description":"The sports hospitality business aims to meet the unique needs of large sports events with a focus on providing end-to-end solutions, including providing accommodation to athletes and sports officials participating in various sports events, the company said in a statement.OYO forays into sports hospitality business, shortlists 100 hotels in 12 key citiesRelated stories","content":"Hospitality and travel-tech firm OYO on Thursday announced its foray into sports hospitality business shortlisting 100 hotels across 12 key cities, including Delhi, Chennai, and Bangalore, to cater to large sports events. The sports hospitality business aims to meet the unique needs of large sports events with a focus on providing end-to-end solutions, including providing accommodation to athletes and sports officials participating in various sports events, the company said in a statement. Under the vertical, a wide array of accommodation options, ranging from budget-friendly to premium hotels, will be offered to ensure a comfortable and convenient stay to participants and attendees throughout the event, it added. The company said it has identified 100 hotels in different categories across 12 cities, including Delhi, Chennai, Bangalore, Pune, Lucknow, Jaipur, Chandigarh, and Bhopal for the accommodation of athletes and sports officials. Specialised packages and group booking options will be available to accommodate the unique needs of sports teams and large groups, it added. OYO said it will engage with third-party agencies for catering to a diverse range of food options to suit the preferences and dietary requirements of athletes and attendees, and also transportation-related services. Besides, it will also set up control rooms across all sports event venues to ensure seamless coordination and 24x7 emergency assistance. The company said it has provided these services in more than 10 large-scale sports tournaments in 2023, including Khelo India Youth Games, Khelo India University Games, and 36th National Games, to assess its capabilities before launching the new initiative. \"As part of this initiative, OYO will also offer accommodation, catering, and transportation services for differently-abled sports person to create a more inclusive environment,\" the company said, adding it has recently partnered with Khelo India Para Games, Para Kabaddi Impact Tournament, and Sardar Patel National Divyang Cricket Tournament and provided assistance to all the participants. ","cleaned_content":"hospitality and travel tech firm oyo on thursday announced its foray into sports hospitality business shortlisting \u003cONE_HUNDRED\u003e hotels across \u003cONE_TEN\u003e key cities including delhi chennai and bangalore to cater to large sports events the sports hospitality business aims to meet the unique needs of large sports events with a focus on providing end to end solutions including providing accommodation to athletes and sports officials participating in various sports events the company said in a statement under the vertical a wide array of accommodation options ranging from budget friendly to premium hotels will be offered to ensure a comfortable and convenient stay to participants and attendees throughout the event it added the company said it has identified \u003cONE_HUNDRED\u003e hotels in different categories across \u003cONE_TEN\u003e cities including delhi chennai bangalore pune lucknow jaipur chandigarh and bhopal for the accommodation of athletes and sports officials specialised packages and group booking options will be available to accommodate the unique needs of sports teams and large groups it added oyo said it will engage with third party agencies for catering to a diverse range of food options to suit the preferences and dietary requirements of athletes and attendees and also transportation related services besides it will also set up control rooms across all sports event venues to ensure seamless coordination and \u003cTWO_TEN\u003e x7 emergency assistance the company said it has provided these services in more than \u003cONE_TEN\u003e large scale sports tournaments in \u003cTWO_THOUSAND\u003e including khelo india youth games khelo india university games and \u003cTHREE_TEN\u003e th national games to assess its capabilities before launching the new initiative as part of this initiative oyo will also offer accommodation catering and transportation services for differently abled sports person to create a more inclusive environment the company said adding it has recently partnered with khelo india para games para kabaddi impact tournament and sardar patel national divyang cricket tournament and provided assistance to all the participants","timestamp":"2024-02-15T14:11:00+05:30","market_timestamp":"2024-02-15T14:11:00+05:30","off_market_hours":false}