{"url":"https://www.moneycontrol.com/news/business/mankind-pharma-promoters-to-divest-part-stake-to-meet-sebis-mps-norms-12214781.html","title":"Mankind Pharma promoters to divest part stake to meet Sebi's MPS norms","description":"As per market regulator Sebi's guidelines, all listed firms should maintain a minimum public shareholding of 25 percent. The stake sale will reduce the promoter and promoter group shareholding to 74.88%","content":"Mankind Pharma promoters Sheetal Arora, Arjun Juneja and Puja Juneja have decided to sell a combined stake of 1.62 percent in the firm to comply with the requirements of minimum public shareholding, according to an exchange disclosure by the company. As per market regulator Sebi's guidelines, all listed firms should maintain a minimum public shareholding of 25 per cent. A block deal of around Rs 1,330 crores has been launched for the above divestment at a floor price of Rs 2,050 per share, sources told Moneycontrol on the condition of anonymity. The aggregate promoter and promoter group shareholding as on February 7, 2024, is 76.5 percent of the total paid-up equity share capital of the company. Post completion of the aforesaid sale, the aggregate promoter and promoter group shareholding in the company would be reduced to 74.88 percent, as per the regulatory filing. ","cleaned_content":"mankind pharma promoters sheetal arora arjun juneja and puja juneja have decided to sell a combined stake of \u003cONE_PERCENT\u003e in the firm to comply with the requirements of minimum public shareholding according to an exchange disclosure by the company as per market regulator sebis guidelines all listed firms should maintain a minimum public shareholding of \u003cTWO_TEN_PERCENT\u003e a block deal of around rs \u003cONE_THOUSAND\u003e crores has been launched for the above divestment at a floor price of rs \u003cTWO_THOUSAND\u003e per share sources told moneycontrol on the condition of anonymity the aggregate promoter and promoter group shareholding as on february \u003cSEVEN_\u003e \u003cTWO_THOUSAND\u003e is \u003cSEVEN_TEN_PERCENT\u003e of the total paid up equity share capital of the company post completion of the aforesaid sale the aggregate promoter and promoter group shareholding in the company would be reduced to \u003cSEVEN_TEN_PERCENT\u003e as per the regulatory filing","timestamp":"2024-02-07T17:05:00+05:30","market_timestamp":"2024-02-08T09:15:00+05:30","off_market_hours":true}