{"url":"https://www.moneycontrol.com/news/business/dhanuka-agritech-looking-to-set-up-jv-with-spain-based-biotech-firm-kimitec-12213381.html","title":"Dhanuka Agritech looking to set up JV with Spain-based biotech firm Kimitec","description":"The two companies will also explore setting up a Research \u0026 Development facility in the country, Dhanuka Agritech said in a statement.Dhanuka Agritech looking to set up JV with Spain-based biotech firm KimitecRelated stories","content":"Agrochemical firm Dhanuka Agritech is exploring options to set up a joint venture with Spain-based Kimitec for the development and commercialization of biological products meant to improve crop health. Gurugram-based Dhanuka Agritech has signed a 'Letter of Intent' with Kimitec to \"explore various business opportunities, including setting up a joint venture in India for the development and commercialization of biological products using natural molecules and derived from natural sources.\" The two companies will also explore setting up a Research \u0026 Development facility in the country, Dhanuka Agritech said in a statement. Biological products are derived from natural sources using botany, microbiology, microalgae, and bioinformatics. \"As part of our continuous effort to offer the best products and solutions to the Indian farming community, we have signed a non-binding Letter of Intent with Kimitec to explore various business opportunities, including setting up a joint venture in India and an R\u0026D facility, as well as the commercialization of biological products,\" said Rahul Dhanuka, Joint Managing Director, Dhanuka Agritech. The demand for biological products is increasing globally, he said, and expected an uptrend for these products in India too. Kimitec is a biotech company \u0026 founder of MAAVi Innovation Center, the largest European biotech innovation hub dedicated to natural molecules. \"As part of our mission to change the way food is produced globally, we have identified Dhanuka Agritech Ltd as a perfect partner to bring our natural yet as effective as chemical solutions to farmers in India,\" said Félix García, CEO of Kimitec. Kimitec operates in more than 100 countries around the world and collaborates with MNCs to develop and commercialize biological products for Business-to-business (B2B) and business-to-consumer (B2C) markets. Dhanuka Group already has tie-ups with seven agrochemical companies from the US, Japan, and Europe, to introduce the latest technology and products in India. Dhanuka is focusing on technology advancement and precision farming. It has invested in agri-drone manufacturer IoTechWorld Avigation and farm-to-fork startup KisanKonnect Safe Food. Dhanuka Agricteh has four manufacturing units located in Gujarat, Rajasthan, and Jammu \u0026 Kashmir. ","cleaned_content":"agrochemical firm dhanuka agritech is exploring options to set up a joint venture with spain based kimitec for the development and commercialization of biological products meant to improve crop health gurugram based dhanuka agritech has signed a letter of intent with kimitec to explore various business opportunities including setting up a joint venture in india for the development and commercialization of biological products using natural molecules and derived from natural sources the two companies will also explore setting up a research development facility in the country dhanuka agritech said in a statement biological products are derived from natural sources using botany microbiology microalgae and bioinformatics as part of our continuous effort to offer the best products and solutions to the indian farming community we have signed a non binding letter of intent with kimitec to explore various business opportunities including setting up a joint venture in india and an r d facility as well as the commercialization of biological products said rahul dhanuka joint managing director dhanuka agritech the demand for biological products is increasing globally he said and expected an uptrend for these products in india too kimitec is a biotech company founder of maavi innovation center the largest european biotech innovation hub dedicated to natural molecules as part of our mission to change the way food is produced globally we have identified dhanuka agritech ltd as a perfect partner to bring our natural yet as effective as chemical solutions to farmers in india said f lix garc a ceo of kimitec kimitec operates in more than \u003cONE_HUNDRED\u003e countries around the world and collaborates with mncs to develop and commercialize biological products for business to business b2b and business to consumer b2c markets dhanuka group already has tie ups with seven agrochemical companies from the us japan and europe to introduce the latest technology and products in india dhanuka is focusing on technology advancement and precision farming it has invested in agri drone manufacturer iotechworld avigation and farm to fork startup kisankonnect safe food dhanuka agricteh has four manufacturing units located in gujarat rajasthan and jammu kashmir","timestamp":"2024-02-07T14:22:00+05:30","market_timestamp":"2024-02-07T14:22:00+05:30","off_market_hours":false}