{"url":"https://www.moneycontrol.com/news/business/bat-rises-on-signs-of-offloading-stake-in-indias-itc-12224211.html","title":"BAT rises on signs of offloading stake in India’s ITC","description":"BAT has “been actively working for some time on completing the regulatory process required to give us the flexibility to monetise some of our shareholding,” it said in full-year results, released Thursday.BAT rises on signs of offloading stake in India’s ITCRelated stories","content":"British American Tobacco Plc’s shares rose after it said it was trying to overcome regulatory hurdles to selling at least part of its stake in Indian company ITC, valued at more than £14 billion ($17.7 billion). BAT has “been actively working for some time on completing the regulatory process required to give us the flexibility to monetise some of our shareholding,” it said in full-year results, released Thursday. “This would be a big positive,” said RBC Capital Markets analyst James Edwardes Jones, “accelerating BAT’s deleveraging and bringing the all-important share buyback timeline closer for investors.” Owen Bennett, an analyst at Jefferies, said it was the “strongest signal yet” around the potential stake sale. WritedownBAT also used the results to increase a writedown on the value of its US cigarette brands, due to the number of Americans quitting smoking. BAT now estimates the non-cash impairment charge related to its US brands at more than £27 billion ($34.1 billion), from an original estimate of £25 billion disclosed in December. That pushed the company to an annual operating loss of £15.8 billion last year, it said Thursday. The maker of Lucky Strike cigarettes, Vuse vapes and Velo nicotine pouches said the smoke-free business achieved profitability two years ahead of schedule and accounted for 16.5% of revenue in its 2023 financial results. While continuing to sell billions of cigarettes each year, Big Tobacco companies are shifting to alternative products such as vapes, heated tobacco and nicotine pouches that they say are less harmful. More people are quitting smoking as governments in major markets including the UK and US increasingly crack down on tobacco use. At the same time, politicians and health regulators are also moving to ban disposable or flavored vapes over concerns about use among young people despite their value as smoking cessation aids. BAT reported adjusted operating income of £12.5 billion and revenue of £27.3 billion. Analysts expected adjusted operating income of £12.6 billion and £27.7 billion in sales, according to consensus estimates compiled by Bloomberg. The company changed its CEO in May last year. ","cleaned_content":"british american tobacco plc s shares rose after it said it was trying to overcome regulatory hurdles to selling at least part of its stake in indian company itc valued at more than \u003cONE_TEN\u003e billion \u003cONE_TEN\u003e billion bat has been actively working for some time on completing the regulatory process required to give us the flexibility to monetise some of our shareholding it said in full year results released thursday this would be a big positive said rbc capital markets analyst james edwardes jones accelerating bat s deleveraging and bringing the all important share buyback timeline closer for investors owen bennett an analyst at jefferies said it was the strongest signal yet around the potential stake sale writedownbat also used the results to increase a writedown on the value of its us cigarette brands due to the number of americans quitting smoking bat now estimates the non cash impairment charge related to its us brands at more than \u003cTWO_TEN\u003e billion \u003cTHREE_TEN\u003e billion from an original estimate of \u003cTWO_TEN\u003e billion disclosed in december that pushed the company to an annual operating loss of \u003cONE_TEN\u003e billion last year it said thursday the maker of lucky strike cigarettes vuse vapes and velo nicotine pouches said the smoke free business achieved profitability two years ahead of schedule and accounted for \u003cONE_TEN_PERCENT\u003e of revenue in its \u003cTWO_THOUSAND\u003e financial results while continuing to sell billions of cigarettes each year big tobacco companies are shifting to alternative products such as vapes heated tobacco and nicotine pouches that they say are less harmful more people are quitting smoking as governments in major markets including the uk and us increasingly crack down on tobacco use at the same time politicians and health regulators are also moving to ban disposable or flavored vapes over concerns about use among young people despite their value as smoking cessation aids bat reported adjusted operating income of \u003cONE_TEN\u003e billion and revenue of \u003cTWO_TEN\u003e billion analysts expected adjusted operating income of \u003cONE_TEN\u003e billion and \u003cTWO_TEN\u003e billion in sales according to consensus estimates compiled by bloomberg the company changed its ceo in may last year","timestamp":"2024-02-08T14:28:00+05:30","market_timestamp":"2024-02-08T14:28:00+05:30","off_market_hours":false}