{"url":"https://www.moneycontrol.com/news/business/zf-groups-new-plant-in-tamil-nadu-to-produce-components-for-evs-12280131.html","title":"ZF Group's new plant in Tamil Nadu to produce components for EVs","description":"Berlin-headquartered ZF Group has been expanding its manufacturing base in India. The new facility is its 19th production unit in the country and its 10th in Tamil Nadu.Related stories","content":"Supplier of automotive systems for automobiles ZF on Wednesday inaugurated its manufacturing facility near Chennai to produce auto-components and systems for electric vehicles. Berlin-headquartered ZF Group has been expanding its manufacturing base in India. The new facility is its 19th production unit in the country and its 10th in Tamil Nadu. The factory is spread across 44.08 acre in Oragadam about 45 km from the city. \"It was an honour to inaugurate the ZF Industrial Park at Oragadam today on behalf of our esteemed Chief Minister M K Stalin. Yet another example of the jobs that our Honourable Chief Minister is raking in,\" he said. The factory is expected to expand the state's auto-components industry which already accounts for 35 per cent of India's total production. In addition, the plant will largely have a female workforce and use renewable energy for its operations. \"This export-oriented, advanced manufacturing plant boasts over 80 per cent female workforce and operates entirely on renewable energy. We are optimistic that our skilled workforce will greatly benefit from the high-quality employment opportunities these companies will provide in the years ahead,\" he said in a social media post. The first phase of the project would display the state-of-the-art production technology of ZF Group in line with the company's 'Make in India for India and the World' approach. \"With ZF's existing investment of Rs 3,500 crore and a workforce of over 9,500 people in Tamil Nadu, we are confident that there is much more in store for ZF's longstanding partnership with Tamil Nadu,\" Rajaa said. \"The inauguration of our Oragadam plant reflects ZF's enduring commitment to India. We aim to contribute significantly to India's automotive landscape with innovation and growth,\" ZF Group India President Akash Passey said. \"By combining our 'Make in India for India and the World' approach with a workforce that is mainly women, we are not just manufacturing products, we are creating opportunities and empowering talent aligned to the growth opportunities,\" he said. The plant signifies ZF's unwavering commitment to bringing world-class technologies, products, and solutions to India's growing automotive sector, he added. According to Peter Laier, Member of the ZF Group Board of Management and Head of Commercial Vehicle Solutions, \"India is a strategic market for ZF Group, and we have been increasingly focusing on India for design, engineering, and manufacturing capabilities as well as the growing domestic market.\" \"This state-of-the-art facility aligns with our global strategy and reaffirms ZF's dedication to fostering innovation and growth in this pivotal market. The plant is a testament to ZF's vision for sustainable, inclusive, and globally impactful manufacturing,\" he added. The manufacturing unit would focus on tapping renewable energy and would be equipped with a rainwater harvesting infrastructure. ","cleaned_content":"supplier of automotive systems for automobiles zf on wednesday inaugurated its manufacturing facility near chennai to produce auto components and systems for electric vehicles berlin headquartered zf group has been expanding its manufacturing base in india the new facility is its \u003cONE_TEN\u003e th production unit in the country and its \u003cONE_TEN\u003e th in tamil nadu the factory is spread across \u003cFOUR_TEN\u003e acre in oragadam about \u003cFOUR_TEN\u003e km from the city it was an honour to inaugurate the zf industrial park at oragadam today on behalf of our esteemed chief minister m k stalin yet another example of the jobs that our honourable chief minister is raking in he said the factory is expected to expand the states auto components industry which already accounts for \u003cTHREE_TEN_PERCENT\u003e of indias total production in addition the plant will largely have a female workforce and use renewable energy for its operations this export oriented advanced manufacturing plant boasts over \u003cEIGHT_TEN_PERCENT\u003e female workforce and operates entirely on renewable energy we are optimistic that our skilled workforce will greatly benefit from the high quality employment opportunities these companies will provide in the years ahead he said in a social media post the first phase of the project would display the state of the art production technology of zf group in line with the companys make in india for india and the world approach with zfs existing investment of rs \u003cTHREE_THOUSAND\u003e crore and a workforce of over \u003cNINE_THOUSAND\u003e people in tamil nadu we are confident that there is much more in store for zfs longstanding partnership with tamil nadu rajaa said the inauguration of our oragadam plant reflects zfs enduring commitment to india we aim to contribute significantly to indias automotive landscape with innovation and growth zf group india president akash passey said by combining our make in india for india and the world approach with a workforce that is mainly women we are not just manufacturing products we are creating opportunities and empowering talent aligned to the growth opportunities he said the plant signifies zfs unwavering commitment to bringing world class technologies products and solutions to indias growing automotive sector he added according to peter laier member of the zf group board of management and head of commercial vehicle solutions india is a strategic market for zf group and we have been increasingly focusing on india for design engineering and manufacturing capabilities as well as the growing domestic market this state of the art facility aligns with our global strategy and reaffirms zfs dedication to fostering innovation and growth in this pivotal market the plant is a testament to zfs vision for sustainable inclusive and globally impactful manufacturing he added the manufacturing unit would focus on tapping renewable energy and would be equipped with a rainwater harvesting infrastructure","timestamp":"2024-02-15T14:57:00+05:30","market_timestamp":"2024-02-15T14:57:00+05:30","off_market_hours":false}