{"url":"https://www.moneycontrol.com/news/business/kalyani-group-to-invest-rs-26000-crore-in-odisha-12258071.html","title":"Kalyani Group to invest Rs 26,000 crore in Odisha","description":"The state cabinet on Monday evening approved a special incentive for the unit as it is going to be the first aerospace and defence manufacturing complex in Odisha, Chief Secretary P K Jena said while briefing media persons here.Kalyani Group to invest Rs 26,000 crore in OdishaRelated stories","content":"Kalyani Steel Limited has proposed to invest Rs 26,000 crore to set up a titanium metal and aerospace components manufacturing and integrated advanced specialty steel and automotive components manufacturing complex at Gajamara in Odisha's Dhenkanal district, an official said on Tuesday. The state cabinet on Monday evening approved a special incentive for the unit as it is going to be the first aerospace and defence manufacturing complex in Odisha, Chief Secretary P K Jena said while briefing media persons here. He said the state government is committed to foster a conducive environment for growth and innovation, particularly in the high-potential sectors of aerospace, defence and automotive manufacturing. Further vendor development will lead to significant employment opportunities in the subsequent years. The jobs will primarily be in the high-end high-skill sector and will open up new avenues for the youth of Odisha, he added. The chief secretary said the requirement of high end-high skill jobs will be achieved in collaboration with local ITIs and polytechnics, adding, that these tie-ups for up-skilling in the auto-components, specialty steel and alloys manufacturing sector will boost Odisha's skilling landscape and has the potential to make Odisha the skill capital of India for new-age tech. The project will bring in vendors in the areas of manufacturing and service sectors that will provide a boost to the local MSMEs and start-ups, which will further create additional employment and entrepreneurship in the region, he asserted. The state government is enthusiastic about this collaboration with the Kalyani Group and will provide all necessary support for the fruition of these projects. \"We look forward to witnessing the manifold benefits these initiatives will bring to the people of Odisha, marking a new chapter in the state's journey towards becoming a hub of manufacturing excellence\", he stated. ","cleaned_content":"kalyani steel limited has proposed to invest rs \u003cTWO_TEN_THOUSAND\u003e crore to set up a titanium metal and aerospace components manufacturing and integrated advanced specialty steel and automotive components manufacturing complex at gajamara in odishas dhenkanal district an official said on tuesday the state cabinet on monday evening approved a special incentive for the unit as it is going to be the first aerospace and defence manufacturing complex in odisha chief secretary p k jena said while briefing media persons here he said the state government is committed to foster a conducive environment for growth and innovation particularly in the high potential sectors of aerospace defence and automotive manufacturing further vendor development will lead to significant employment opportunities in the subsequent years the jobs will primarily be in the high end high skill sector and will open up new avenues for the youth of odisha he added the chief secretary said the requirement of high end high skill jobs will be achieved in collaboration with local itis and polytechnics adding that these tie ups for up skilling in the auto components specialty steel and alloys manufacturing sector will boost odishas skilling landscape and has the potential to make odisha the skill capital of india for new age tech the project will bring in vendors in the areas of manufacturing and service sectors that will provide a boost to the local msmes and start ups which will further create additional employment and entrepreneurship in the region he asserted the state government is enthusiastic about this collaboration with the kalyani group and will provide all necessary support for the fruition of these projects we look forward to witnessing the manifold benefits these initiatives will bring to the people of odisha marking a new chapter in the states journey towards becoming a hub of manufacturing excellence he stated","timestamp":"2024-02-13T14:13:00+05:30","market_timestamp":"2024-02-13T14:13:00+05:30","off_market_hours":false}