{"url":"https://www.moneycontrol.com/news/business/billionaire-adani-secures-ore-for-1-2-billion-copper-smelter-12233181.html","title":"Billionaire Adani secures ore for $1.2 billion copper smelter","description":"The first 500,000 tons of capacity at the $1.2 billion facility in Mundra in the western state of Gujarat is set to start operations next month, according to Vinay Prakash, chief executive officer at Adani Natural Resources. Billionaire Adani secures ore for $1.2 billion copper smelter","content":"Indian billionaire Gautam Adani’s conglomerate has signed contracts to buy 1.6 million tons a year of copper concentrate for the world’s largest single-location smelter for the industrial metal. The first 500,000 tons of capacity at the $1.2 billion facility in Mundra in the western state of Gujarat is set to start operations next month, according to Vinay Prakash, chief executive officer at Adani Natural Resources. This will be expanded to 1 million tons by March 2029 to cater for a forecast doubling of Indian copper demand by the end of the decade, he said in an interview. Adani Enterprises Ltd., the port-to-power conglomerate’s flagship company, is seeking resource security in critical minerals and is resuming capital expenditure now that its shares have stabilized after a short-seller attack in January 2023. The smelter is starting up just as the global copper market experiences a collapse in the fees that processors charge miners because there’s not enough ore to go around. The concentrate deals are a mix of short- and long-term arrangements, Prakash said, without disclosing the suppliers. Concentrate supply is likely to increase in the medium- to long-term as more mining projects, including in Africa and Peru, come on stream, he said. ","cleaned_content":"indian billionaire gautam adani s conglomerate has signed contracts to buy \u003cONE_\u003e million tons a year of copper concentrate for the world s largest single location smelter for the industrial metal the first \u003cFIVE_HUNDRED_THOUSAND\u003e tons of capacity at the \u003cONE_\u003e billion facility in mundra in the western state of gujarat is set to start operations next month according to vinay prakash chief executive officer at adani natural resources this will be expanded to \u003cONE_\u003e million tons by march \u003cTWO_THOUSAND\u003e to cater for a forecast doubling of indian copper demand by the end of the decade he said in an interview adani enterprises ltd the port to power conglomerate s flagship company is seeking resource security in critical minerals and is resuming capital expenditure now that its shares have stabilized after a short seller attack in january \u003cTWO_THOUSAND\u003e the smelter is starting up just as the global copper market experiences a collapse in the fees that processors charge miners because there s not enough ore to go around the concentrate deals are a mix of short and long term arrangements prakash said without disclosing the suppliers concentrate supply is likely to increase in the medium to long term as more mining projects including in africa and peru come on stream he said","timestamp":"2024-02-09T14:36:00+05:30","market_timestamp":"2024-02-09T14:36:00+05:30","off_market_hours":false}