{"url":"https://www.moneycontrol.com/news/business/momentum-around-developers-development-in-india-unbelievable-microsoft-ceo-satya-nadella-12221161.html","title":"Momentum around developers, development in India unbelievable: Microsoft CEO Satya Nadella","description":"The Microsoft top boss also spoke about unlocking productivity across business with Microsoft Copilot, building transformation AI solutions with Microsoft Azure, and on AI safety.Momentum around developers, development in India unbelievable: Microsoft CEO Satya Nadella","content":"Microsoft CEO Satya Nadella on Thursday said the momentum around developers and development in India is \"unbelievable\", as he outlined his vision on AI transformation imperatives in areas such as healthcare and education, and spoke of innovation around Copilot artificial intelligence assistant. He also announced expansion of the 'code without barriers' initiative to India which he said would help 75,000 women developers by 2024. \"India is a place where momentum around developers, development is unbelievable,\" he said. Nadella said he is excited to see new, innovative startups in India. India is expected to overtake the US as the largest developer community on GitHub by 2027, he said. \"Today as we speak, India is number two only next to the United States in terms of the total number of developers on GitHub and it's going to cross in 2028, I believe, or 2027... it is going to cross... So it's going to be the place where the most number of developers are going to be in.\" According to him \"it is just awesome to see the human capital of this country really embrace this new platform and effectively lead the new platform shifts.\" ","cleaned_content":"microsoft ceo satya nadella on thursday said the momentum around developers and development in india is unbelievable as he outlined his vision on ai transformation imperatives in areas such as healthcare and education and spoke of innovation around copilot artificial intelligence assistant he also announced expansion of the code without barriers initiative to india which he said would help \u003cSEVEN_TEN_THOUSAND\u003e women developers by \u003cTWO_THOUSAND\u003e india is a place where momentum around developers development is unbelievable he said nadella said he is excited to see new innovative startups in india india is expected to overtake the us as the largest developer community on github by \u003cTWO_THOUSAND\u003e he said today as we speak india is number two only next to the united states in terms of the total number of developers on github and its going to cross in \u003cTWO_THOUSAND\u003e i believe or \u003cTWO_THOUSAND\u003e it is going to cross so its going to be the place where the most number of developers are going to be in according to him it is just awesome to see the human capital of this country really embrace this new platform and effectively lead the new platform shifts","timestamp":"2024-02-08T12:09:00+05:30","market_timestamp":"2024-02-08T12:09:00+05:30","off_market_hours":false}