{"url":"https://www.moneycontrol.com/news/india/sidbi-commits-over-rs-100-crore-for-entrepreneurship-projects-in-nagaland-12265551.html","title":"SIDBI commits over Rs 100 crore for entrepreneurship projects in Nagaland","description":"Small Industries Development Bank of India (SIDBI) is the apex regulatory body for overall licensing and regulation of micro, small and medium enterprise finance companies in India. It is under the jurisdiction of the Ministry of Finance.SIDBI commits over Rs 100 crore for entrepreneurship projects in Nagaland","content":"SIDBI has entered into an agreement with the Nagaland government, committing over Rs 100 crore for entrepreneurship projects in the northeastern state. Small Industries Development Bank of India (SIDBI) is the apex regulatory body for overall licensing and regulation of micro, small and medium enterprise finance companies in India. It is under the jurisdiction of the Ministry of Finance. SIBDI Chief General Manager Subhransu S Acharya, during an event on Tuesday night, said it would fund four projects, including setting up of industrial infrastructure for MSMEs under cluster development fund and Swavalamban Connect Kendras (SCK) for all the 16 districts to boost the spirit of entrepreneurship. It would also provide seed funds to support the entrepreneurs in their startup journey. Nagaland Advisor for Industry and Commerce Hekani Jakhalu Kense and SIDBI Chairman and Managing Director S Ramann were present on the occasion. Kense said, \"Chief Minister Neiphiu Rio has been very clear in stating that if the state's economy has to grow, local entrepreneurs have to grow first.\" Expressing gratitude to SIDBI, she expressed optimism that young entrepreneurs would avail the opportunity. Ramann expressed hope that with the collaborative efforts of the Nagaland government, the state would soon see flourishing startups. ","cleaned_content":"sidbi has entered into an agreement with the nagaland government committing over rs \u003cONE_HUNDRED\u003e crore for entrepreneurship projects in the northeastern state small industries development bank of india sidbi is the apex regulatory body for overall licensing and regulation of micro small and medium enterprise finance companies in india it is under the jurisdiction of the ministry of finance sibdi chief general manager subhransu s acharya during an event on tuesday night said it would fund four projects including setting up of industrial infrastructure for msmes under cluster development fund and swavalamban connect kendras sck for all the \u003cONE_TEN\u003e districts to boost the spirit of entrepreneurship it would also provide seed funds to support the entrepreneurs in their startup journey nagaland advisor for industry and commerce hekani jakhalu kense and sidbi chairman and managing director s ramann were present on the occasion kense said chief minister neiphiu rio has been very clear in stating that if the states economy has to grow local entrepreneurs have to grow first expressing gratitude to sidbi she expressed optimism that young entrepreneurs would avail the opportunity ramann expressed hope that with the collaborative efforts of the nagaland government the state would soon see flourishing startups","timestamp":"2024-02-14T11:29:00+05:30","market_timestamp":"2024-02-14T11:29:00+05:30","off_market_hours":false}