{"url":"https://www.moneycontrol.com/news/business/lg-energy-plans-to-sell-batteries-to-more-ev-car-makers-in-india-12222871.html","title":"LG Energy plans to sell batteries to more EV car makers in India","description":"LG Energy, which globally supplies batteries to car makers like Tesla and Hyundai, said it is \"proactively seeking partnerships\" with domestic EV makers as it looks to grow its business in one of the world's fastest-growing car markets.LG Energy plans to sell batteries to more EV car makers in India","content":"South Korea's LG Energy Solution, the biggest supplier of battery cells to electric scooter makers in India, plans to grow its presence in the country's passenger vehicle market, the company said in a statement on Thursday. LG Energy, which globally supplies batteries to car makers like Tesla and Hyundai, said it is \"proactively seeking partnerships\" with domestic EV makers as it looks to grow its business in one of the world's fastest-growing car markets. The company did not specify the EV firms it is in talks with.LG Energy's India unit dominates the supply of battery cells to domestic e-scooter makers such as Softbank Group-backed Ola Electric and domestic rival TVS. Authorities also want 70% of scooters to be electric over the same time period. India has urged companies to build EVs and batteries locally and is offering incentives under its domestic manufacturing program. ","cleaned_content":"south koreas lg energy solution the biggest supplier of battery cells to electric scooter makers in india plans to grow its presence in the countrys passenger vehicle market the company said in a statement on thursday lg energy which globally supplies batteries to car makers like tesla and hyundai said it is proactively seeking partnerships with domestic ev makers as it looks to grow its business in one of the worlds fastest growing car markets the company did not specify the ev firms it is in talks with lg energys india unit dominates the supply of battery cells to domestic e scooter makers such as softbank group backed ola electric and domestic rival tvs authorities also want \u003cSEVEN_TEN_PERCENT\u003e of scooters to be electric over the same time period india has urged companies to build evs and batteries locally and is offering incentives under its domestic manufacturing program","timestamp":"2024-02-08T13:21:00+05:30","market_timestamp":"2024-02-08T13:21:00+05:30","off_market_hours":false}