{"url":"https://www.moneycontrol.com/news/business/indias-coal-import-rises-27-in-december-12255331.html","title":"India's coal import rises 27% in December","description":"The coal ministry is aiming for zero thermal coal import by FY26. The country's coal import was 18.35 MT in the corresponding month of the previous fiscal, according to data compiled by mjunction services ltd.India's coal import rises 27% in DecemberRelated stories","content":"India's coal import registered a rise of 27.2 per cent to 23.35 Million Tonne (MT) in December, over the corresponding month of the previous fiscal. The coal ministry is aiming for zero thermal coal import by FY26. The country's coal import was 18.35 MT in the corresponding month of the previous fiscal, according to data compiled by mjunction services ltd. mjunction services ltd is a B2B e-commerce platform. Of the total imports in December, non-coking coal imports stood at 15.47 MT, against 10.61 MT imported in December 2022. Coking coal import volume was 4.84 MT, against 4.71 MT imported in the same month of the previous financial year. The coal import in the April-December period of the current fiscal increased to 192.43 MT, over 191.82 MT in the year-ago period. During the April-December period of the current fiscal, non-coking coal import was at 124.37 MT, marginally lower than 126.89 MT imported during the same period in the previous financial year. Coking coal import was at 42.81 MT during April-December 2023-24, slightly up against 41.35 MT recorded for April-December 2022-23. Commenting on the coal import trend, Vinaya Varma, MD \u0026 CEO, mjunction, said, \"There was an increase in thermal coal imports in December, especially by cement and sponge iron sectors, amid a fall in seaborne prices for South African coal. While the current demand for imports remains subdued, actual volumes would depend on how the seaborne prices move in the coming months.\" ","cleaned_content":"indias coal import registered a rise of \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_TEN\u003e million tonne mt in december over the corresponding month of the previous fiscal the coal ministry is aiming for zero thermal coal import by fy26 the countrys coal import was \u003cONE_TEN\u003e mt in the corresponding month of the previous fiscal according to data compiled by mjunction services ltd mjunction services ltd is a b2b e commerce platform of the total imports in december non coking coal imports stood at \u003cONE_TEN\u003e mt against \u003cONE_TEN\u003e mt imported in december \u003cTWO_THOUSAND\u003e coking coal import volume was \u003cFOUR_\u003e mt against \u003cFOUR_\u003e mt imported in the same month of the previous financial year the coal import in the april december period of the current fiscal increased to \u003cONE_HUNDRED\u003e mt over \u003cONE_HUNDRED\u003e mt in the year ago period during the april december period of the current fiscal non coking coal import was at \u003cONE_HUNDRED\u003e mt marginally lower than \u003cONE_HUNDRED\u003e mt imported during the same period in the previous financial year coking coal import was at \u003cFOUR_TEN\u003e mt during april december \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e slightly up against \u003cFOUR_TEN\u003e mt recorded for april december \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e commenting on the coal import trend vinaya varma md ceo mjunction said there was an increase in thermal coal imports in december especially by cement and sponge iron sectors amid a fall in seaborne prices for south african coal while the current demand for imports remains subdued actual volumes would depend on how the seaborne prices move in the coming months","timestamp":"2024-02-13T11:22:00+05:30","market_timestamp":"2024-02-13T11:22:00+05:30","off_market_hours":false}