{"url":"https://www.moneycontrol.com/news/business/to-break-glass-ceiling-tata-steel-invites-applications-from-transgenders-for-various-positions-12254331.html","title":"'To break glass ceiling', Tata Steel invites applications from transgenders for various positions","description":"As a leading global steel company, Tata Steel recognises the importance of \"breaking the glass ceiling and mainstreaming transgender people\" in society, it said.'To break glass ceiling', Tata Steel invites applications from transgenders for various positionsRelated stories","content":"Tata Steel has taken a \"significant step towards promoting inclusivity\" by inviting applications from transgender candidates for various positions across multiple locations, the company said. As a leading global steel company, Tata Steel recognises the importance of \"breaking the glass ceiling and mainstreaming transgender people\" in society, it said. \"Transgender candidates with any of the following qualifications can apply: Matriculation in English or ITI or graduation in any discipline or diploma in engineering in any discipline from any institute recognised by AICTE or UGC or Degree in BE/B Tech in any discipline from any institute, recognised by AICTE or UGC,\" Tata Steel said in a notification. All shortlisted candidates will undergo a selection process, which may include a written test and interview as per the requirement, it said. In February 2022, the steel giant had expanded its transgender employee base by onboarding 12 crane operator trainees from the LGBTQ+ community at its Kalinganagar plant in Odisha. Prior to this, Tata Steel's captive mining division in Jharkhand's West Bokaro had onboarded 14 transgender people as Heavy Earth Moving Machinery (HEMM) operators at its mines. \"The well-thought intervention has not only broached the unorthodox subject of hiring transgender in the blue collar workforce, but also provided a map for other organisations to navigate the difficult path to being inclusive in the truest sense,\" a company official said. It laid the groundwork of hiring minority groups by first improving their gender diversity ratio by inducting more women employees in core operations before moving on to recruiting transgenders in the mining division, he said. Tata Steel, which aims at having 25 per cent diverse workforce by 2025, is spread across five continents with an employee base of over 77,000. ","cleaned_content":"tata steel has taken a significant step towards promoting inclusivity by inviting applications from transgender candidates for various positions across multiple locations the company said as a leading global steel company tata steel recognises the importance of breaking the glass ceiling and mainstreaming transgender people in society it said transgender candidates with any of the following qualifications can apply matriculation in english or iti or graduation in any discipline or diploma in engineering in any discipline from any institute recognised by aicte or ugc or degree in be b tech in any discipline from any institute recognised by aicte or ugc tata steel said in a notification all shortlisted candidates will undergo a selection process which may include a written test and interview as per the requirement it said in february \u003cTWO_THOUSAND\u003e the steel giant had expanded its transgender employee base by onboarding \u003cONE_TEN\u003e crane operator trainees from the lgbtq community at its kalinganagar plant in odisha prior to this tata steels captive mining division in jharkhands west bokaro had onboarded \u003cONE_TEN\u003e transgender people as heavy earth moving machinery hemm operators at its mines the well thought intervention has not only broached the unorthodox subject of hiring transgender in the blue collar workforce but also provided a map for other organisations to navigate the difficult path to being inclusive in the truest sense a company official said it laid the groundwork of hiring minority groups by first improving their gender diversity ratio by inducting more women employees in core operations before moving on to recruiting transgenders in the mining division he said tata steel which aims at having \u003cTWO_TEN_PERCENT\u003e diverse workforce by \u003cTWO_THOUSAND\u003e is spread across five continents with an employee base of over \u003cSEVEN_TEN_THOUSAND\u003e","timestamp":"2024-02-13T09:35:00+05:30","market_timestamp":"2024-02-13T09:35:00+05:30","off_market_hours":false}