{"url":"https://www.moneycontrol.com/news/business/larsen-toubro-bags-multiple-orders-in-india-middle-east-12210541.html","title":"Larsen \u0026 Toubro bags multiple orders in India, Middle East","description":"The multiple orders were bagged by the power transmission and distribution business of Larsen \u0026 Toubro (L\u0026T), the company said in a filing to BSE.Larsen \u0026 Toubro bags multiple orders in India, Middle East","content":"Larsen \u0026 Toubro on Wednesday said it has bagged large orders in the domestic market and Middle East. The multiple orders were bagged by the power transmission and distribution business of Larsen \u0026 Toubro (L\u0026T), the company said in a filing to BSE. As per company's classification, orders ranging between Rs 2,500 crore and Rs 5,000 crore fall in the category of large orders. In Saudi Arabia, the company has bagged an order for turnkey construction of a substation. \"The business has also won substation and voltage conversion orders from hydrocarbon companies in Kuwait and Saudi Arabia. In an ongoing 220 KV Power Supply Project in the UAE, an additional order has been secured,\" it said. Larsen \u0026 Toubro is a USD 23 billion multinational company engaged in engineering, procurement, and construction (EPC) projects, hi-tech manufacturing and services. ","cleaned_content":"larsen toubro on wednesday said it has bagged large orders in the domestic market and middle east the multiple orders were bagged by the power transmission and distribution business of larsen toubro l t the company said in a filing to bse as per companys classification orders ranging between rs \u003cTWO_THOUSAND\u003e crore and rs \u003cFIVE_THOUSAND\u003e crore fall in the category of large orders in saudi arabia the company has bagged an order for turnkey construction of a substation the business has also won substation and voltage conversion orders from hydrocarbon companies in kuwait and saudi arabia in an ongoing \u003cTWO_HUNDRED\u003e kv power supply project in the uae an additional order has been secured it said larsen toubro is a usd \u003cTWO_TEN\u003e billion multinational company engaged in engineering procurement and construction epc projects hi tech manufacturing and services","timestamp":"2024-02-07T11:56:00+05:30","market_timestamp":"2024-02-07T11:56:00+05:30","off_market_hours":false}