{"url":"https://www.moneycontrol.com/news/technology/zee-ent-q3-profit-up-1-4x-to-rs-58-5-crore-revenue-increases-14-8-12258971.html","title":"Zee Ent Q3 profit up 1.4x to Rs 58.5 crore, revenue increases 14.8%","description":"Analysts had expected Zee's market share to be negatively impacted due to the major cricket event in the first half of the quarterOn February 13, ZEEL announced 141% rise in its consolidated net profit at Rs 58.5 for the quarter ending December 31, 2023Related stories","content":"Television broadcaster Zee Entertainment reported a 140 percent increase in profit at Rs 58.5 crore in the December quarter of FY24, up from Rs 24.32 crore during the same period a year ago. The company reported a 15 percent increase in income at Rs 223 crore as against Rs 194 crore in Q3 FY23. Zee which is reeling under the pressure of the terminated merger deal with Sony, saw a 52 percent drop in profits sequentially with the company reporting a profit of Rs 122.96 crore in Q2 FY24. Subscription revenue grew 3 percent year-on-year to Rs 921.3 crore from Rs 894.4 crore. The company said that the soft advertising environment partially offset by pickup in subscription revenue. Advertising revenue was impacted due to macroeconomic headwinds and consumption slowdown. The broadcaster's network share dropped to 17.1 percent from 17.9 percent in Q2. Analysts had expected Zee's market share to be negatively impacted due to the major cricket event in the first half of the quarter. Zee noted that the domestic ad revenue was impacted by Cricket World Cup 2023 during Q3. \"While Q3 saw some seasonal festive uptick, overall pace of ad environment recovery continues to be slow,\" the company said in investor presentation. ","cleaned_content":"television broadcaster zee entertainment reported a \u003cONE_HUNDRED_PERCENT\u003e increase in profit at rs \u003cFIVE_TEN\u003e crore in the december quarter of fy24 up from rs \u003cTWO_TEN\u003e crore during the same period a year ago the company reported a \u003cONE_TEN_PERCENT\u003e increase in income at rs \u003cTWO_HUNDRED\u003e crore as against rs \u003cONE_HUNDRED\u003e crore in q3 fy23 zee which is reeling under the pressure of the terminated merger deal with sony saw a \u003cFIVE_TEN_PERCENT\u003e drop in profits sequentially with the company reporting a profit of rs \u003cONE_HUNDRED\u003e crore in q2 fy24 subscription revenue grew \u003cTHREE_PERCENT\u003e year on year to rs \u003cNINE_HUNDRED\u003e crore from rs \u003cEIGHT_HUNDRED\u003e crore the company said that the soft advertising environment partially offset by pickup in subscription revenue advertising revenue was impacted due to macroeconomic headwinds and consumption slowdown the broadcasters network share dropped to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in q2 analysts had expected zees market share to be negatively impacted due to the major cricket event in the first half of the quarter zee noted that the domestic ad revenue was impacted by cricket world cup \u003cTWO_THOUSAND\u003e during q3 while q3 saw some seasonal festive uptick overall pace of ad environment recovery continues to be slow the company said in investor presentation","timestamp":"2024-02-13T19:20:00+05:30","market_timestamp":"2024-02-14T09:15:00+05:30","off_market_hours":true}