{"url":"https://www.moneycontrol.com/news/business/jsw-steel-jfe-corporation-to-set-up-electrical-steel-facility-in-india-with-rs-5500-crore-investment-12255481.html","title":"JSW Steel, JFE Corporation to set up electrical steel facility in India with Rs 5,500 crore investment","description":"Japan-bases JFE Corporation also holds a 15 per cent share in JSW Steel.JSW Steel, JFE Corporation to set up electrical steel facility in India with Rs 5,500 crore investmentRelated stories","content":"JSW Steel on Tuesday announced plans to set up a grain oriented electrical steel manufacturing facility through a joint venture with JFE Steel Corporation at an estimated investment of Rs 5,500 crore. Japan-bases JFE Corporation also holds a 15 per cent share in JSW Steel. A groundbreaking ceremony marking the initiation of this partnership was held on February 12, JSW Steel said in a statement. \"The new company, JSW Electrical Steel Private Limited, to be renamed JSW JFE Electrical Steel Private Limited will have its manufacturing base in district Bellary, Karnataka and will be set up with a planned investment of Rs 5,500 crores,\" the statement said. The facility is targeting to commence production in the fiscal year 2027 and the company plans to further expand its capacity to meet the growing market demand for grain-oriented electrical steel in India. The JV company aspires to cater to the surging domestic demand for grain oriented electrical steel and contribute significantly to the country's energy infrastructure, it said. Grain-oriented electrical steel plays a pivotal role in the production of energy-efficient transformers. \"Whether in laminated, wound, or punched sheet form, it serves as the essential core material for distribution transformers, power transformers, and small transformers,\" JSW Steel said. JSW Steel Limited is a leading integrated steel producer with a presence in India and international markets. JFE Steel Corporation is a global firm with a strong commitment to technological innovation and sustainable practices. ","cleaned_content":"jsw steel on tuesday announced plans to set up a grain oriented electrical steel manufacturing facility through a joint venture with jfe steel corporation at an estimated investment of rs \u003cFIVE_THOUSAND\u003e crore japan bases jfe corporation also holds a \u003cONE_TEN_PERCENT\u003e share in jsw steel a groundbreaking ceremony marking the initiation of this partnership was held on february \u003cONE_TEN\u003e jsw steel said in a statement the new company jsw electrical steel private limited to be renamed jsw jfe electrical steel private limited will have its manufacturing base in district bellary karnataka and will be set up with a planned investment of rs \u003cFIVE_THOUSAND\u003e crores the statement said the facility is targeting to commence production in the fiscal year \u003cTWO_THOUSAND\u003e and the company plans to further expand its capacity to meet the growing market demand for grain oriented electrical steel in india the jv company aspires to cater to the surging domestic demand for grain oriented electrical steel and contribute significantly to the countrys energy infrastructure it said grain oriented electrical steel plays a pivotal role in the production of energy efficient transformers whether in laminated wound or punched sheet form it serves as the essential core material for distribution transformers power transformers and small transformers jsw steel said jsw steel limited is a leading integrated steel producer with a presence in india and international markets jfe steel corporation is a global firm with a strong commitment to technological innovation and sustainable practices","timestamp":"2024-02-13T11:46:00+05:30","market_timestamp":"2024-02-13T11:46:00+05:30","off_market_hours":false}