{"url":"https://www.moneycontrol.com/news/business/inox-wind-bags-1500-mw-wind-energy-order-from-cesc-12221171.html","title":"Inox Wind bags 1,500 MW wind energy order from CESC","description":"The deal is for Inox Wind's latest DF/3000/145 Wind Turbine Generators (WTGs), each having a minimum capacity of 3.3 MW, as per a statement on Thursday.Inox Wind bags 1,500 MW wind energy order from CESCRelated stories","content":"Wind energy solution provider Inox Wind has bagged an order for the supply of 1,500 MW wind energy from CESC Ltd. The deal is for Inox Wind's latest DF/3000/145 Wind Turbine Generators (WTGs), each having a minimum capacity of 3.3 MW, as per a statement on Thursday. \"Inox Wind announced today (Thursday) that it has entered into a binding framework agreement with CESC Ltd, one of the largest power utilities in India, for the installation/supplies of 1,500 MW of wind capacity over the next 3-4 years,\" it stated. Additionally, Inox Wind subsidiary, Inox Green Energy Services Ltd (IGESL) will provide post-commissioning multi-year Operations \u0026 Maintenance (O\u0026M) services. This is the single-largest order signed for a wind project in India by any wind OEM (Original Equipment Manufacturer), as per the statement. \"This is a pivotal moment in Inox Wind's history as we announce today the signing of India's largest wind project deal for 1,500 MW with CESC,\" Inox Wind CEO Kailash Tarachandani said in the statement. Sandeep Kashyap, CEO, Renewable Business, RPSG Group, said in the statement, \"CESC's green ambitions include substantial investments in renewable energy and we are delighted to partner with Inox Wind for this ambitious project.\" ","cleaned_content":"wind energy solution provider inox wind has bagged an order for the supply of \u003cONE_THOUSAND\u003e mw wind energy from cesc ltd the deal is for inox winds latest df \u003cTHREE_THOUSAND\u003e \u003cONE_HUNDRED\u003e wind turbine generators wtgs each having a minimum capacity of \u003cTHREE_\u003e mw as per a statement on thursday inox wind announced today thursday that it has entered into a binding framework agreement with cesc ltd one of the largest power utilities in india for the installation supplies of \u003cONE_THOUSAND\u003e mw of wind capacity over the next \u003cTHREE_\u003e \u003cFOUR_\u003e years it stated additionally inox wind subsidiary inox green energy services ltd igesl will provide post commissioning multi year operations maintenance o m services this is the single largest order signed for a wind project in india by any wind oem original equipment manufacturer as per the statement this is a pivotal moment in inox winds history as we announce today the signing of indias largest wind project deal for \u003cONE_THOUSAND\u003e mw with cesc inox wind ceo kailash tarachandani said in the statement sandeep kashyap ceo renewable business rpsg group said in the statement cescs green ambitions include substantial investments in renewable energy and we are delighted to partner with inox wind for this ambitious project","timestamp":"2024-02-08T12:11:00+05:30","market_timestamp":"2024-02-08T12:11:00+05:30","off_market_hours":false}