{"url":"https://www.moneycontrol.com/news/business/radisson-hotel-group-adds-21-properties-in-india-under-9-brands-in-2023-12267261.html","title":"Radisson Hotel Group adds 21 properties in India under 9 brands in 2023","description":"These 21 hotels also include the signing and opening of the group's first property at Ayodhya, in Uttar Pradesh -- Park Inn by Radisson Ayodhya, as the destination gained a lot of national and international attention following the consecration of the Ram Temple last month, Radisson group said in a statement.Radisson Hotel Group adds 21 properties in India under 9 brands in 2023Related stories","content":"The Radisson Hotel Group on Wednesday said it has accelerated its growth in India by signing 21 hotels under a portfolio of nine brands in 2023. These 21 hotels also include the signing and opening of the group's first property at Ayodhya, in Uttar Pradesh -- Park Inn by Radisson Ayodhya, as the destination gained a lot of national and international attention following the consecration of the Ram Temple last month, Radisson group said in a statement. In India, the Group continues to enjoy a first-mover advantage in the country's key pilgrim destinations. It will soon introduce branded hotels in Vrindavan in Uttar Pradesh and Ujjain in Madhya Pradesh, the statement added. In the Indian market, Radisson Hotel Group is one of the largest international hotel operators with over 165 hotels in operation and development. It continues to be the largest hotel operator in tier I markets like Delhi NCR (national capital region) and at the same time, more than 50 per cent of its portfolio is in tier II and III markets, where it has benefited by being the first mover. \"We will remain agile and nimble to stay relevant to our business stakeholders. We are committed to deepening our presence in the vibrant and booming Indian market where we currently have over 165 hotels in operation and under development,\" Radisson Hotel Group Executive Vice President and Global Chief Development Officer Elie Younes said. In India, the Radisson Hotel Group operates under brands, including Radisson Blu, Radisson, Radisson RED, Park Inn by Radisson, Park Plaza, Park Inn \u0026 Suites by Radisson, Country Inn \u0026 Suites by Radisson and Radisson Individuals and its extension Radisson Individuals Retreats. \"Our milestones in 2023 have carved a strong growth trajectory for us in 2024. Our strategic focus includes expanding our roots and fortifying our presence in untapped markets,\" K B Kachru, Chairman Emeritus and Principal Advisor, Radisson Hotel Group, South Asia, added. ","cleaned_content":"the radisson hotel group on wednesday said it has accelerated its growth in india by signing \u003cTWO_TEN\u003e hotels under a portfolio of nine brands in \u003cTWO_THOUSAND\u003e these \u003cTWO_TEN\u003e hotels also include the signing and opening of the groups first property at ayodhya in uttar pradesh park inn by radisson ayodhya as the destination gained a lot of national and international attention following the consecration of the ram temple last month radisson group said in a statement in india the group continues to enjoy a first mover advantage in the countrys key pilgrim destinations it will soon introduce branded hotels in vrindavan in uttar pradesh and ujjain in madhya pradesh the statement added in the indian market radisson hotel group is one of the largest international hotel operators with over \u003cONE_HUNDRED\u003e hotels in operation and development it continues to be the largest hotel operator in tier i markets like delhi ncr national capital region and at the same time more than \u003cFIVE_TEN_PERCENT\u003e of its portfolio is in tier ii and iii markets where it has benefited by being the first mover we will remain agile and nimble to stay relevant to our business stakeholders we are committed to deepening our presence in the vibrant and booming indian market where we currently have over \u003cONE_HUNDRED\u003e hotels in operation and under development radisson hotel group executive vice president and global chief development officer elie younes said in india the radisson hotel group operates under brands including radisson blu radisson radisson red park inn by radisson park plaza park inn suites by radisson country inn suites by radisson and radisson individuals and its extension radisson individuals retreats our milestones in \u003cTWO_THOUSAND\u003e have carved a strong growth trajectory for us in \u003cTWO_THOUSAND\u003e our strategic focus includes expanding our roots and fortifying our presence in untapped markets k b kachru chairman emeritus and principal advisor radisson hotel group south asia added","timestamp":"2024-02-14T12:37:00+05:30","market_timestamp":"2024-02-14T12:37:00+05:30","off_market_hours":false}