{"url":"https://www.moneycontrol.com/news/business/blue-ocean-opportunity-for-startups-building-for-rural-indias-top-30-market-accels-anand-daniel-12212801.html","title":"'Blue Ocean' opportunity for startups building for rural India's top 30% market: Accel's Anand Daniel","description":"\"There is a Blue Ocean opportunity for startups building for rural Bharat's top 30 per cent - there is immense potential for growth and innovation in this segment, which has yet to be fully explored,\" Daniel told PTI, citing the massive runway for business models with a \"Bharat\" focus. Blue Ocean means a new, uncontested market.'Blue Ocean' opportunity for startups building for rural India's top 30% market: Accel's Anand DanielRelated stories","content":"The top 30 per cent of rural households in India will show an annual spend of approximately USD 540 billion by 2030, says Anand Daniel, partner at global VC fund Accel, about the increasingly aspirational segment that accounts for 52 per cent of rural consumption. \"There is a Blue Ocean opportunity for startups building for rural Bharat's top 30 per cent - there is immense potential for growth and innovation in this segment, which has yet to be fully explored,\" Daniel told PTI, citing the massive runway for business models with a \"Bharat\" focus. Blue Ocean means a new, uncontested market. Internet penetration in rural India, which is getting modernised in terms of both digital and physical infrastructure, reaches 350 million users and 82 per cent of villages, he noted. Excerpts from the interview: Q: What makes you bullish on the Bharat opportunity? A: While there is talk of a slowdown in rural India as evidenced by slower volume growth in FMCG, increased demand for work under MGNREGA and weak two-wheeler sales, these data points don't show us what's happening with the top 30 per cent of rural households. By 2030, the top 30 per cent of households will show an annual spend of approximately USD 540 billion. We know that rural India overall is a large consumer market with about USD 500 billion of annual consumption expenditure from over 915 million people. This is two-thirds of India's population. Interestingly, this rural spend is highly concentrated, with 52 per cent rural consumption coming from the top 30 per cent households. Till now, we have seen the success stories of the Indian startup ecosystem or category leaders largely built on catering to the needs of the urban Indian consumer. Given the surface area of the rural Bharat opportunity, we are optimistic that the next wave of disruption will come from daring builders catering to the needs of that top 30 per cent which is an increasingly aspirational rural India. Large public companies across sectors such as FMCG, auto, and fintech are already catering to some needs of rural India and capitalising on this opportunity. There are 10 large public companies making nearly 49 per cent (USD 35 billion-plus) revenue from rural, and each of them adopted a rural-first business model to cater to this segment. We are now seeing the emergence of startups with Bharat-focused business models. More than 50 such startups that are building for Bharat had raised USD 6.7 billion in funding by early 2023. Q: Are there specific sectors that are more promising? Where will we see faster growth in the next three-five years? A: Category wise, rural and urban consumers spend on similar things. However, while urban top 30 per cent spend twice as much on non-food segments (69 per cent) as food, the rural top 30 per cent of consumers spend equal amounts across food and non-food segments. This is pretty eye-opening - in the top 30 per cent rural households, 12 categories (five food, seven non-food) have an annual spend of USD 10 billion plus each, showing us many investable opportunities. Currently, we are excited about areas like commerce and healthcare for Bharat. Education and entertainment are the other two that seem very promising. In commerce, we are observing different models emerge -- kirana-led commerce, village-level entrepreneur-led commerce, rural house of brands -- across sub-categories such as fresh fruit and vegetables, grocery, lifestyle products, beauty and personal care and electronics. We have already invested in two grocery business models for T2/T3 cities and towns with Apnamart and Citymall, and are now looking for similar solutions in rural areas as well. In healthcare, we are seeing solutions being built around remote clinics, digitisation of pharmacies, generic medicines and secondary and tertiary care. There are several reasons for this trend playing out now. First, rural India is getting modernised in terms of both digital and physical infrastructure-internet penetration is high, reaching 350 million users, and 82 per cent of villages are now reachable by road. Second, rural consumers are getting exposed to urban brands and products via online content consumption through social media and Over the Top (OTT) platforms, which indicates that e-commerce adoption in rural India is expected to follow the e-commerce boom in tier-3 cities. Q: What are some of the key challenges that founders can face when building for rural India? A: Building for rural consumers can be tricky - consumers are widespread geographically,which means that population density is low, plus the average revenue one can earn per rural customer will be lower than that of an urban customer. So, founders need to solve for aspects like distribution costs and cost-effective customer acquisition. When it comes to distribution costs, supply chain optimisation should be an area of focus for founders while maintaining viable unit economics. With regard to cost-effective customer acquisition, founders need to have a very sharp focus on selecting their customer and high-value economic clusters (a top 30 percentile rural consumer spend similar to an average urban consumer that is nearly USD 1,000 annual per capita expenditure). There also tends to be a lack of in-depth understanding of the rural consumer. This is a high-trust community that is aspirational and time-rich. Founders need to stay customer-obsessed, and learn the nuances of this audience to fully grasp the painpoints of this target group. There is a Blue Ocean opportunity for startups building for rural Bharat's top 30 per cent -- there is immense potential for growth and innovation in this segment, which has yet to be fully explored. Q: What's your investment approach/philosophy? How has it changed over the past decade in India? A: On average, a bulk of our portfolio returns come from just a handful of investments. This is essentially the \"power law\" at work in the venture capital industry. So our investment approach is to find these outlier companies and back them as early in their journey as possible. A few such outlier examples from Accel's portfolio in India would be Flipkart, Freshworks andSwiggy - all of these were our early-stage bets. We believe in Accel's \"prepared mind\" approach to investing- this is a thesis-based method of investing wherein you research a space and know what large problem needs to be solved and then look for the best team building a solution for that problem. ","cleaned_content":"the top \u003cTHREE_TEN_PERCENT\u003e of rural households in india will show an annual spend of approximately usd \u003cFIVE_HUNDRED\u003e billion by \u003cTWO_THOUSAND\u003e says anand daniel partner at global vc fund accel about the increasingly aspirational segment that accounts for \u003cFIVE_TEN_PERCENT\u003e of rural consumption there is a blue ocean opportunity for startups building for rural bharats top \u003cTHREE_TEN_PERCENT\u003e there is immense potential for growth and innovation in this segment which has yet to be fully explored daniel told pti citing the massive runway for business models with a bharat focus blue ocean means a new uncontested market internet penetration in rural india which is getting modernised in terms of both digital and physical infrastructure reaches \u003cTHREE_HUNDRED\u003e million users and \u003cEIGHT_TEN_PERCENT\u003e of villages he noted excerpts from the interview q what makes you bullish on the bharat opportunity a while there is talk of a slowdown in rural india as evidenced by slower volume growth in fmcg increased demand for work under mgnrega and weak two wheeler sales these data points dont show us whats happening with the top \u003cTHREE_TEN_PERCENT\u003e of rural households by \u003cTWO_THOUSAND\u003e the top \u003cTHREE_TEN_PERCENT\u003e of households will show an annual spend of approximately usd \u003cFIVE_HUNDRED\u003e billion we know that rural india overall is a large consumer market with about usd \u003cFIVE_HUNDRED\u003e billion of annual consumption expenditure from over \u003cNINE_HUNDRED\u003e million people this is two thirds of indias population interestingly this rural spend is highly concentrated with \u003cFIVE_TEN_PERCENT\u003e rural consumption coming from the top \u003cTHREE_TEN_PERCENT\u003e households till now we have seen the success stories of the indian startup ecosystem or category leaders largely built on catering to the needs of the urban indian consumer given the surface area of the rural bharat opportunity we are optimistic that the next wave of disruption will come from daring builders catering to the needs of that top \u003cTHREE_TEN_PERCENT\u003e which is an increasingly aspirational rural india large public companies across sectors such as fmcg auto and fintech are already catering to some needs of rural india and capitalising on this opportunity there are \u003cONE_TEN\u003e large public companies making nearly \u003cFOUR_TEN_PERCENT\u003e usd \u003cTHREE_TEN\u003e billion plus revenue from rural and each of them adopted a rural first business model to cater to this segment we are now seeing the emergence of startups with bharat focused business models more than \u003cFIVE_TEN\u003e such startups that are building for bharat had raised usd \u003cSIX_\u003e billion in funding by early \u003cTWO_THOUSAND\u003e q are there specific sectors that are more promising where will we see faster growth in the next three five years a category wise rural and urban consumers spend on similar things however while urban top \u003cTHREE_TEN_PERCENT\u003e spend twice as much on non food segments \u003cSIX_TEN_PERCENT\u003e as food the rural top \u003cTHREE_TEN_PERCENT\u003e of consumers spend equal amounts across food and non food segments this is pretty eye opening in the top \u003cTHREE_TEN_PERCENT\u003e rural households \u003cONE_TEN\u003e categories five food seven non food have an annual spend of usd \u003cONE_TEN\u003e billion plus each showing us many investable opportunities currently we are excited about areas like commerce and healthcare for bharat education and entertainment are the other two that seem very promising in commerce we are observing different models emerge kirana led commerce village level entrepreneur led commerce rural house of brands across sub categories such as fresh fruit and vegetables grocery lifestyle products beauty and personal care and electronics we have already invested in two grocery business models for t2 t3 cities and towns with apnamart and citymall and are now looking for similar solutions in rural areas as well in healthcare we are seeing solutions being built around remote clinics digitisation of pharmacies generic medicines and secondary and tertiary care there are several reasons for this trend playing out now first rural india is getting modernised in terms of both digital and physical infrastructure internet penetration is high reaching \u003cTHREE_HUNDRED\u003e million users and \u003cEIGHT_TEN_PERCENT\u003e of villages are now reachable by road second rural consumers are getting exposed to urban brands and products via online content consumption through social media and over the top ott platforms which indicates that e commerce adoption in rural india is expected to follow the e commerce boom in tier \u003cTHREE_\u003e cities q what are some of the key challenges that founders can face when building for rural india a building for rural consumers can be tricky consumers are widespread geographically which means that population density is low plus the average revenue one can earn per rural customer will be lower than that of an urban customer so founders need to solve for aspects like distribution costs and cost effective customer acquisition when it comes to distribution costs supply chain optimisation should be an area of focus for founders while maintaining viable unit economics with regard to cost effective customer acquisition founders need to have a very sharp focus on selecting their customer and high value economic clusters a top \u003cTHREE_TEN_PERCENT\u003e ile rural consumer spend similar to an average urban consumer that is nearly usd \u003cONE_THOUSAND\u003e annual per capita expenditure there also tends to be a lack of in depth understanding of the rural consumer this is a high trust community that is aspirational and time rich founders need to stay customer obsessed and learn the nuances of this audience to fully grasp the painpoints of this target group there is a blue ocean opportunity for startups building for rural bharats top \u003cTHREE_TEN_PERCENT\u003e there is immense potential for growth and innovation in this segment which has yet to be fully explored q whats your investment approach philosophy how has it changed over the past decade in india a on average a bulk of our portfolio returns come from just a handful of investments this is essentially the power law at work in the venture capital industry so our investment approach is to find these outlier companies and back them as early in their journey as possible a few such outlier examples from accels portfolio in india would be flipkart freshworks andswiggy all of these were our early stage bets we believe in accels prepared mind approach to investing this is a thesis based method of investing wherein you research a space and know what large problem needs to be solved and then look for the best team building a solution for that problem","timestamp":"2024-02-07T14:05:00+05:30","market_timestamp":"2024-02-07T14:05:00+05:30","off_market_hours":false}