{"url":"https://www.moneycontrol.com/news/business/tata-power-renewable-tata-communications-ink-rs-105-crore-pact-to-set-up-captive-solar-project-12268891.html","title":"Tata Power Renewable, Tata Communications ink Rs 105 crore pact to set up captive solar project","description":"Located in Aachegaon, Maharashtra, the plant is projected to generate approximately 40 million units (MUs) of power while offsetting more than 30,000 tonne of CO2 emissions annually, Tata Power said in a statement.Tata Power Renewable, Tata Communications ink Rs 105 crore pact to set up captive solar project","content":"Tata Power Renewable Energy Ltd (TPREL) has signed an agreement worth Rs 105 crore with Tata Communications to set up a 18.75 MW captive solar plant in Maharashtra. Located in Aachegaon, Maharashtra, the plant is projected to generate approximately 40 million units (MUs) of power while offsetting more than 30,000 tonne of CO2 emissions annually, Tata Power said in a statement. TPREL has signed a power delivery agreement with Tata Communications for a 18.75 MW group captive solar power plant, it said. TPREL, an arm of Tata Power, has achieved a milestone by surpassing a capacity of over 1.5 gigawatts (GW) in group captive projects. The Power Purchase Agreements (PPAs) span a diverse range of industries, including steel, polystyrene, mining, iron casting, manufacturing, hospitality, automotive, among others. ","cleaned_content":"tata power renewable energy ltd tprel has signed an agreement worth rs \u003cONE_HUNDRED\u003e crore with tata communications to set up a \u003cONE_TEN\u003e mw captive solar plant in maharashtra located in aachegaon maharashtra the plant is projected to generate approximately \u003cFOUR_TEN\u003e million units mus of power while offsetting more than \u003cTHREE_TEN_THOUSAND\u003e tonne of co2 emissions annually tata power said in a statement tprel has signed a power delivery agreement with tata communications for a \u003cONE_TEN\u003e mw group captive solar power plant it said tprel an arm of tata power has achieved a milestone by surpassing a capacity of over \u003cONE_\u003e gigawatts gw in group captive projects the power purchase agreements ppas span a diverse range of industries including steel polystyrene mining iron casting manufacturing hospitality automotive among others","timestamp":"2024-02-14T14:28:00+05:30","market_timestamp":"2024-02-14T14:28:00+05:30","off_market_hours":false}