{"url":"https://www.moneycontrol.com/news/business/aether-industries-to-commission-15-mw-solar-power-plant-in-gujarats-bharuch-12210781.html","title":"Aether Industries to commission 15 MW solar power plant in Gujarat's Bharuch","description":"Earlier, in July 2023, Aether Industries had commissioned a 16 MW solar power project (Fixed Modules) under the CPP segment and this new solar power plant under CPP will add to its renewable energy sources and further move towards sustainability, the company said in a regulatory filing on Tuesday.Aether Industries to commission 15 MW solar power plant in Gujarat's Bharuch","content":"Aether Industries will commission a 15 MW solar power project (Auto-Tracker Modules) under the Captive Power Producer (CPP) segment in the Bharuch district of Gujarat with an aim to become more sustainable. Earlier, in July 2023, Aether Industries had commissioned a 16 MW solar power project (Fixed Modules) under the CPP segment and this new solar power plant under CPP will add to its renewable energy sources and further move towards sustainability, the company said in a regulatory filing on Tuesday. The solar power farm will be in Gujarat's Bharuch District and spread across 60 acres. The phase-wise commissioning of the solar power plant is set to begin as early as the next financial year starting April, it stated. \"As an enterprise, we are very cognizant of the elements that sustain life. This is why we are also part of UN Global Compact Network India to practice and promote sustainable manufacturing. Therefore, our decision to commission a fairly large solar park is in-line with that guiding philosophy. We will continue to explore ways to make Aether Industries a benchmark in sustainability within the chemicals industry in the country,\" Aether Industries promoter and whole time director Rohan Desai said. ","cleaned_content":"aether industries will commission a \u003cONE_TEN\u003e mw solar power project auto tracker modules under the captive power producer cpp segment in the bharuch district of gujarat with an aim to become more sustainable earlier in july \u003cTWO_THOUSAND\u003e aether industries had commissioned a \u003cONE_TEN\u003e mw solar power project fixed modules under the cpp segment and this new solar power plant under cpp will add to its renewable energy sources and further move towards sustainability the company said in a regulatory filing on tuesday the solar power farm will be in gujarats bharuch district and spread across \u003cSIX_TEN\u003e acres the phase wise commissioning of the solar power plant is set to begin as early as the next financial year starting april it stated as an enterprise we are very cognizant of the elements that sustain life this is why we are also part of un global compact network india to practice and promote sustainable manufacturing therefore our decision to commission a fairly large solar park is in line with that guiding philosophy we will continue to explore ways to make aether industries a benchmark in sustainability within the chemicals industry in the country aether industries promoter and whole time director rohan desai said","timestamp":"2024-02-07T12:19:00+05:30","market_timestamp":"2024-02-07T12:19:00+05:30","off_market_hours":false}