{"url":"https://www.moneycontrol.com/news/technology/zee-cautious-on-slow-ad-spend-recovery-identifies-cost-cuts-to-improve-profitability-12263321.html","title":"Zee cautious on slow ad spend recovery; identifies cost-cuts to improve profitability","description":"The sentiment on ad spend was similar in the previous quarter when the company said the drop in ad expenditure by edtech, fintech, foodtech, and e-commerce companies posed a challenge for broadcasters.Over the past six months, shares of Zee have fallen more than 30 percent in trade. Related stories","content":"Broadcaster Zee Entertainment has turned cautious after the slow pace of recovery in advertising spending and the 3 percent on-year decline in the company’s ad revenue in the December quarter. Ad spends shifted to the Cricket World Cup, which took place in 2023 from October 5 to November 19. The tournament was aired on Disney Star’s sports channels. While there was some seasonal festive uptick in the third quarter of FY24, the overall pace of recovery in ad spends continues to be slow. Zee reported ad revenue of Rs 1,027.4 crore, down from Rs 1,063.4 crore a year earlier. Sequentially, ad revenue grew from Rs 979.2 crore in Q2. Also read: Zee Ent Q3 profit up 1.4x to Rs 58.5 crore, revenue increases 14.8% The sentiment on ad spend was similar in the previous quarter when the company said the drop in ad expenditure by edtech, fintech, foodtech, and e-commerce companies posed a challenge for broadcasters. Gradual recovery Analysts note that while the gradual recovery in ad revenue with improving spends from the FMCG segment appears to be a silver lining, the recovery will remain gradual as certain brands continue to see slower growth due to the rural slowdown. Brokerage firm Motilal Oswal has revised down its operating profit and profit after tax estimates for Zee in FY25 by 8 percent and 11 percent, respectively, on the back of the laggard recovery in ad revenue. \"While our recent performance has been subdued, and a large part of this has been due to temporary and transitory factors, the structure strength and attractiveness of our business is still very strong, giving us confidence on our recovery path,\" Gupta said. Also read: Some layoffs likely at Zee, firm revisits plan as standalone entity after Sony terminates merger Focusing on improving profitability, the company has set a target of 8-10 percent overall revenue CAGR (compound annual growth rate) with the current portfolio and expects digital to grow at a faster pace. Streaming platform Zee5's revenue in Q3 rose 14.9 percent YoY to Rs 223.2 crore, driven by improved subscription. Its operating loss narrowed to Rs 244 crore from Rs 282 crore a year earlier and Rs 253.9 crore in Q2. During Q3, the over the top (OTT) platform launched 19 shows and movies including five originals. The broadcaster will revise its OTT cost structure in Zee5, which is already at its peak. Zee will also revisit the overall cost structure across tech, content, marketing, and people with a view to reset to a lower cost baseline as it enters FY25. The company said that it has identified several cost levers but there will be a one-time cost. \"For the next three to six months, we will likely have some pressure on margins due to increased one-time high costs towards implementing these interventions,\" Gupta said. There may be some layoffs in Zee Entertainment as the company rationalises employee costs to improve profitability, CEO Punit Goenka said during the Q3 earnings call. Sony terminated a merger plan with Zee last month, a deal that was signed over two years ago and was set to build a $10 billion combined entity. Sony said Zee did not satisfy the merger conditions and initiated arbitration proceedings claiming $90 million (Rs 748.5 crore) as a termination fee. Zee has said the claims against the company, including the termination fee, were not tenable. ","cleaned_content":"broadcaster zee entertainment has turned cautious after the slow pace of recovery in advertising spending and the \u003cTHREE_PERCENT\u003e on year decline in the company s ad revenue in the december quarter ad spends shifted to the cricket world cup which took place in \u003cTWO_THOUSAND\u003e from october \u003cFIVE_\u003e to november \u003cONE_TEN\u003e the tournament was aired on disney star s sports channels while there was some seasonal festive uptick in the third quarter of fy24 the overall pace of recovery in ad spends continues to be slow zee reported ad revenue of rs \u003cONE_THOUSAND\u003e crore down from rs \u003cONE_THOUSAND\u003e crore a year earlier sequentially ad revenue grew from rs \u003cNINE_HUNDRED\u003e crore in q2 also read zee ent q3 profit up \u003cONE_\u003e x to rs \u003cFIVE_TEN\u003e crore revenue increases \u003cONE_TEN_PERCENT\u003e the sentiment on ad spend was similar in the previous quarter when the company said the drop in ad expenditure by edtech fintech foodtech and e commerce companies posed a challenge for broadcasters gradual recovery analysts note that while the gradual recovery in ad revenue with improving spends from the fmcg segment appears to be a silver lining the recovery will remain gradual as certain brands continue to see slower growth due to the rural slowdown brokerage firm motilal oswal has revised down its operating profit and profit after tax estimates for zee in fy25 by \u003cEIGHT_PERCENT\u003e and \u003cONE_TEN_PERCENT\u003e respectively on the back of the laggard recovery in ad revenue while our recent performance has been subdued and a large part of this has been due to temporary and transitory factors the structure strength and attractiveness of our business is still very strong giving us confidence on our recovery path gupta said also read some layoffs likely at zee firm revisits plan as standalone entity after sony terminates merger focusing on improving profitability the company has set a target of \u003cEIGHT_\u003e \u003cONE_TEN_PERCENT\u003e overall revenue cagr compound annual growth rate with the current portfolio and expects digital to grow at a faster pace streaming platform zee5s revenue in q3 rose \u003cONE_TEN_PERCENT\u003e yoy to rs \u003cTWO_HUNDRED\u003e crore driven by improved subscription its operating loss narrowed to rs \u003cTWO_HUNDRED\u003e crore from rs \u003cTWO_HUNDRED\u003e crore a year earlier and rs \u003cTWO_HUNDRED\u003e crore in q2 during q3 the over the top ott platform launched \u003cONE_TEN\u003e shows and movies including five originals the broadcaster will revise its ott cost structure in zee5 which is already at its peak zee will also revisit the overall cost structure across tech content marketing and people with a view to reset to a lower cost baseline as it enters fy25 the company said that it has identified several cost levers but there will be a one time cost for the next three to six months we will likely have some pressure on margins due to increased one time high costs towards implementing these interventions gupta said there may be some layoffs in zee entertainment as the company rationalises employee costs to improve profitability ceo punit goenka said during the q3 earnings call sony terminated a merger plan with zee last month a deal that was signed over two years ago and was set to build a \u003cONE_TEN\u003e billion combined entity sony said zee did not satisfy the merger conditions and initiated arbitration proceedings claiming \u003cNINE_TEN\u003e million rs \u003cSEVEN_HUNDRED\u003e crore as a termination fee zee has said the claims against the company including the termination fee were not tenable","timestamp":"2024-02-14T13:40:00+05:30","market_timestamp":"2024-02-14T13:40:00+05:30","off_market_hours":false}