{"url":"https://www.moneycontrol.com/news/business/essar-unveils-blueprint-for-green-economy-at-india-energy-week-12209271.html","title":"Essar unveils blueprint for green economy at India Energy Week","description":"Armed with a substantially lighter balance sheet after it repaid Rs 1,40,000 crore of loans over the last four years, the group now has a strong revenue stream of over Rs 1 lakh crore from existing businesses.Essar unveils blueprint for green economy at India Energy WeekRelated stories","content":"Diversified conglomerate Essar Group will invest billions of dollars in setting up a green hydrogen plant, the world's first green refinery, and building an LNG and electric ecosystem to decarbonise long-haul heavy trucks as it charts a new phase of growth, a top official said. Armed with a substantially lighter balance sheet after it repaid Rs 1,40,000 crore of loans over the last four years, the group now has a strong revenue stream of over Rs 1 lakh crore from existing businesses. \"Essar is charting its path to a resurgence by investing in ecosystems for sustainable growth in India and beyond,\" Prashant Ruia, Director at Essar Capital, said at India Energy Week here. \"As India emerges as the world's fastest-growing and third-largest economy, Essar is dedicated to fulfilling climate commitments and promoting green growth,\" he said. Essar will invest USD 3.6 billion to build one of the world's largest low-carbon (blue hydrogen) plants and the world's first green refinery, he said without giving further details. It is also looking to develop a 1 gigawatt green hydrogen project in Gujarat. In the realm of green mobility solutions, Essar is focused on building an LNG and electric ecosystem to decarbonise long-haul heavy trucks, contributing to a cleaner transportation sector, he said. Besides, the group is also producing gas using coal seams from a block in West Bengal, he said. Its arm, Essar Oil and Gas Exploration and Production Limited (EOGEPL), India's leader in the coal bed methane industry, contributes nearly 65 per cent of the country's total coal bed methane production and aims to increase its contribution to India's total gas production to 5 per cent within the next five years, he said. Ruia did not share the investment details in green mobility and hydrogen plants. \"With these initiatives, Essar is at the forefront of driving the nation's vision of energy transition and sustainable growth,\" he said. Separately, in a post on X, Ruia said: \"Excited to be back at the @IndiaEnergyWeek, where impactful dialogues are shaping a sustainable future. Hon'ble PM @narendramodi ji's vision for India's economic ascent and journey towards becoming the world's third-largest economy is truly inspiring. Privileged to be part of the round table chaired by the PM. His insightful vision is bound to get the global leaders to invest in the massive opportunity in #energytransition that India offers.\" Essar had over the years invested Rs 2 lakh crore in sectors ranging from ports to steel plants, oil refining and fuel retailing, power generation, mining, shipping and telecom. It sold its oil refinery at Vadinar in Gujarat and fuel retailing network to Russia's Rosneft-led consortium in an over Rs 86,000 crore deal (USD 13 billion), which was the largest FDI in the sector. Its steel plant was sold to ArcelorMittal-led group in insolvency proceedings. Essar currently owns businesses in the core sectors of energy, metals and mining, infrastructure, services and technology. In the energy sector, it has commercial interests in oil, gas and coal bed methane exploration and production in India, Vietnam and Nigeria, oil refining and retailing in the UK and power generation in India and Canada. The group's aggregate revenues now stand at about USD 15 billion. Its businesses include a 10 million tonnes per annum oil refinery in the UK, 12 trillion cubic feet reserves (including some producing fields) of unconventional hydrocarbons in India, an iron ore mine and pellet project in the US, and a high-grade thermal coal mine with 72 million tonnes of proven reserves in Indonesia, among others. It is now building the UK's first 1 GW blue hydrogen project and is looking to produce green hydrogen and green ammonia in Salaya in Gujarat. It is also investing in the LNG value chain, including LNG trucking and LNG fuel stations. ","cleaned_content":"diversified conglomerate essar group will invest billions of dollars in setting up a green hydrogen plant the worlds first green refinery and building an lng and electric ecosystem to decarbonise long haul heavy trucks as it charts a new phase of growth a top official said armed with a substantially lighter balance sheet after it repaid rs \u003cONE_HUNDRED_THOUSAND\u003e crore of loans over the last four years the group now has a strong revenue stream of over rs \u003cONE_\u003e lakh crore from existing businesses essar is charting its path to a resurgence by investing in ecosystems for sustainable growth in india and beyond prashant ruia director at essar capital said at india energy week here as india emerges as the worlds fastest growing and third largest economy essar is dedicated to fulfilling climate commitments and promoting green growth he said essar will invest usd \u003cTHREE_\u003e billion to build one of the worlds largest low carbon blue hydrogen plants and the worlds first green refinery he said without giving further details it is also looking to develop a \u003cONE_\u003e gigawatt green hydrogen project in gujarat in the realm of green mobility solutions essar is focused on building an lng and electric ecosystem to decarbonise long haul heavy trucks contributing to a cleaner transportation sector he said besides the group is also producing gas using coal seams from a block in west bengal he said its arm essar oil and gas exploration and production limited eogepl indias leader in the coal bed methane industry contributes nearly \u003cSIX_TEN_PERCENT\u003e of the countrys total coal bed methane production and aims to increase its contribution to indias total gas production to \u003cFIVE_PERCENT\u003e within the next five years he said ruia did not share the investment details in green mobility and hydrogen plants with these initiatives essar is at the forefront of driving the nations vision of energy transition and sustainable growth he said separately in a post on x ruia said excited to be back at the indiaenergyweek where impactful dialogues are shaping a sustainable future honble pm narendramodi jis vision for indias economic ascent and journey towards becoming the worlds third largest economy is truly inspiring privileged to be part of the round table chaired by the pm his insightful vision is bound to get the global leaders to invest in the massive opportunity in energytransition that india offers essar had over the years invested rs \u003cTWO_\u003e lakh crore in sectors ranging from ports to steel plants oil refining and fuel retailing power generation mining shipping and telecom it sold its oil refinery at vadinar in gujarat and fuel retailing network to russias rosneft led consortium in an over rs \u003cEIGHT_TEN_THOUSAND\u003e crore deal usd \u003cONE_TEN\u003e billion which was the largest fdi in the sector its steel plant was sold to arcelormittal led group in insolvency proceedings essar currently owns businesses in the core sectors of energy metals and mining infrastructure services and technology in the energy sector it has commercial interests in oil gas and coal bed methane exploration and production in india vietnam and nigeria oil refining and retailing in the uk and power generation in india and canada the groups aggregate revenues now stand at about usd \u003cONE_TEN\u003e billion its businesses include a \u003cONE_TEN\u003e million tonnes per annum oil refinery in the uk \u003cONE_TEN\u003e trillion cubic feet reserves including some producing fields of unconventional hydrocarbons in india an iron ore mine and pellet project in the us and a high grade thermal coal mine with \u003cSEVEN_TEN\u003e million tonnes of proven reserves in indonesia among others it is now building the uks first \u003cONE_\u003e gw blue hydrogen project and is looking to produce green hydrogen and green ammonia in salaya in gujarat it is also investing in the lng value chain including lng trucking and lng fuel stations","timestamp":"2024-02-07T10:31:00+05:30","market_timestamp":"2024-02-07T10:31:00+05:30","off_market_hours":false}