{"url":"https://www.moneycontrol.com/news/technology/oneverse-to-acquire-13-gaming-firms-in-2024-a-mix-of-esports-and-gst-hit-companies-12209241.html","title":"OneVerse to acquire 13 gaming firms in 2024, a mix of esports and GST-hit companies","description":"The company's founder said that consolidation will help mitigate the impact of the GST pressure along with bringing different types of companies under one roof, benefiting users. The 28 percent GST on player deposits in real money games (RMG) has led to an increase in the tax burdenRelated stories","content":"Metaverse and gaming tech company OneVerse have planned to acquire over a dozen companies in the gaming sector which is currently reeling under the goods and services tax (GST) pressure. The 28 percent GST on player deposits in real money games (RMG) has led to an increase in the tax burden resulting in companies shutting down and other firms slashing employee strength to stay afloat. Some of the companies that are hit by GST pressure are part of the acquisition portfolio of OneVerse which, in total, will acquire 13 gaming firms by the end of this year, said the company's founder, Prashanth Joshua. Joshua added that GST changes have put pressure on the profitability of RMG companies and consolidation will help mitigate the pressure. \"Gaming companies spend 20 percent of their revenue as operational cost which include marketing, salaries, technology cost, among others. By consolidating 7-8 companies we will save at least 15 percent of the companies' expenses. We are able to offset the negative impact of GST and as a larger company we are able to access larger capital pool in terms of investor growth funds. We can grow faster as a portfolio company than an individual firm. There will be a lot of consolidation at an operating level with cost efficiencies that will build in,\" he said. The company has earmarked $120 million for the first phase of acquisitions which include eight firms. \"We are expanding our pool to accommodate rest of the companies. We have founders capital and family offices that are backing us for these acquisitions,\" said Joshua. Consolidation is the way forward in the gaming sector, said Paul Micheal, CEO of OneVerse Gaming. \"We saw a lot of small gaming cos mushrooming both pre and post-pandemic. I realised that for this industry the time has come for consolidation even before the GST change because of too much of competition and companies not knowing the system that would have killed the market. Hence, I pushed the narrative and spoke to these companies that we are acquiring.\" Micheal said that as a larger gaming company, they will be able to offer better technology to users, and higher rewards which will lead to more player retention. \"We will have the scale (after the acquisitions) because of which we will be able to offer higher bonuses and rewards to players which other companies are unable to do so today. We have identified companies with healthy unit economics and the companies we have acquired are profitable,\" Joshua said. The company, which has been building metaverse relations based on virtual reality experiences on the Meta Quest and Apple Vision Pro for sectors including real estate and healthcare, among others, will expand its reach to gaming. \"We will have gamers experiencing gaming on Apple Vision Pro. We have a head start of two years in offering these experiences versus other companies. We will start going live on metaverse and start deploying immersive experience for our customers (in gaming) and we will be able to give to customers better technology,\" said Joshua, adding that OneVerse's gaming business is profitable. \"It looks like gaming could become the largest portfolio (for Oneverse) after the acquisition deals close,\" the founder noted. ","cleaned_content":"metaverse and gaming tech company oneverse have planned to acquire over a dozen companies in the gaming sector which is currently reeling under the goods and services tax gst pressure the \u003cTWO_TEN_PERCENT\u003e gst on player deposits in real money games rmg has led to an increase in the tax burden resulting in companies shutting down and other firms slashing employee strength to stay afloat some of the companies that are hit by gst pressure are part of the acquisition portfolio of oneverse which in total will acquire \u003cONE_TEN\u003e gaming firms by the end of this year said the companys founder prashanth joshua joshua added that gst changes have put pressure on the profitability of rmg companies and consolidation will help mitigate the pressure gaming companies spend \u003cTWO_TEN_PERCENT\u003e of their revenue as operational cost which include marketing salaries technology cost among others by consolidating \u003cSEVEN_\u003e \u003cEIGHT_\u003e companies we will save at least \u003cONE_TEN_PERCENT\u003e of the companies expenses we are able to offset the negative impact of gst and as a larger company we are able to access larger capital pool in terms of investor growth funds we can grow faster as a portfolio company than an individual firm there will be a lot of consolidation at an operating level with cost efficiencies that will build in he said the company has earmarked \u003cONE_HUNDRED\u003e million for the first phase of acquisitions which include eight firms we are expanding our pool to accommodate rest of the companies we have founders capital and family offices that are backing us for these acquisitions said joshua consolidation is the way forward in the gaming sector said paul micheal ceo of oneverse gaming we saw a lot of small gaming cos mushrooming both pre and post pandemic i realised that for this industry the time has come for consolidation even before the gst change because of too much of competition and companies not knowing the system that would have killed the market hence i pushed the narrative and spoke to these companies that we are acquiring micheal said that as a larger gaming company they will be able to offer better technology to users and higher rewards which will lead to more player retention we will have the scale after the acquisitions because of which we will be able to offer higher bonuses and rewards to players which other companies are unable to do so today we have identified companies with healthy unit economics and the companies we have acquired are profitable joshua said the company which has been building metaverse relations based on virtual reality experiences on the meta quest and apple vision pro for sectors including real estate and healthcare among others will expand its reach to gaming we will have gamers experiencing gaming on apple vision pro we have a head start of two years in offering these experiences versus other companies we will start going live on metaverse and start deploying immersive experience for our customers in gaming and we will be able to give to customers better technology said joshua adding that oneverses gaming business is profitable it looks like gaming could become the largest portfolio for oneverse after the acquisition deals close the founder noted","timestamp":"2024-02-07T13:28:00+05:30","market_timestamp":"2024-02-07T13:28:00+05:30","off_market_hours":false}