{"url":"https://www.moneycontrol.com/news/business/igl-looking-to-set-up-19-eyes-compressed-biogas-plants-12219831.html","title":"IGL looking to set up 19 eyes compressed biogas plants","description":"The firm has signed Memorandum of Understanding (MoU) with two technology partners to set up compressed biogas plants in Delhi, Haryana, Rajasthan and Uttar Pradesh, it said.IGL looking to set up 19 eyes compressed biogas plantsRelated stories","content":"Indraprastha Gas Limited (IGL), the nation's biggest city gas operator, is looking to set up as many as 19 compressed biogas plants in four states as part of its efforts to expand business beyond natural gas and embrace cleaner forms of energy. The firm has signed Memorandum of Understanding (MoU) with two technology partners to set up compressed biogas plants in Delhi, Haryana, Rajasthan and Uttar Pradesh, it said. The MoUs were signed during the India Energy Week 2024 here. \"Additionally, IGL has already empanelled two other partners for the same purpose,\" the firm said. \"The biogas produced from these 19 plants shall be fed into IGL's city gas distribution network\". IGL retails CNG and piped natural gas in the national capital and adjoining cities. India, which imports more than 85 per cent of its crude oil requirement, is stepping up efforts to explore new forms of energy to clean up the skies and reduce dependence on imported fuels. The government has mandated 1 per cent blending of Compressed BioGas (CBG) in domestic natural gas and piped natural gas from April 2025, and this will be raised gradually to 5 per cent from 2028-29. The CBG blending obligation is aimed at promoting production and consumption of compressed biogas in the country. It is likely to lead to an establishment of 750 compressed biogas projects across the country by 2028-29. A central repository body will monitor and implement the blending mandate based on operational guidelines. IGL said the MoUs were signed in the presence of K K Chatiwal, Managing Director of IGL, Pawan Kumar, Director (Commercial) of IGL and other officials. \"This partnership aims to produce 0.45 million standard cubic meters per day of biogas from waste, equivalent to approximately 5 per cent of IGL's daily requirements,\" IGL said. The MoUs promise to be a win-win situation for stakeholders like municipal authorities, City Gas Distribution (CGD) entities, farmers and the public at large. While municipal authorities will get rid of municipal waste, farmers will be able to dispose of agricultural waste, CGD entities will get cheaper gas and public shall get clean environment, it said. ","cleaned_content":"indraprastha gas limited igl the nations biggest city gas operator is looking to set up as many as \u003cONE_TEN\u003e compressed biogas plants in four states as part of its efforts to expand business beyond natural gas and embrace cleaner forms of energy the firm has signed memorandum of understanding mou with two technology partners to set up compressed biogas plants in delhi haryana rajasthan and uttar pradesh it said the mous were signed during the india energy week \u003cTWO_THOUSAND\u003e here additionally igl has already empanelled two other partners for the same purpose the firm said the biogas produced from these \u003cONE_TEN\u003e plants shall be fed into igls city gas distribution network igl retails cng and piped natural gas in the national capital and adjoining cities india which imports more than \u003cEIGHT_TEN_PERCENT\u003e of its crude oil requirement is stepping up efforts to explore new forms of energy to clean up the skies and reduce dependence on imported fuels the government has mandated \u003cONE_PERCENT\u003e blending of compressed biogas cbg in domestic natural gas and piped natural gas from april \u003cTWO_THOUSAND\u003e and this will be raised gradually to \u003cFIVE_PERCENT\u003e from \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the cbg blending obligation is aimed at promoting production and consumption of compressed biogas in the country it is likely to lead to an establishment of \u003cSEVEN_HUNDRED\u003e compressed biogas projects across the country by \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e a central repository body will monitor and implement the blending mandate based on operational guidelines igl said the mous were signed in the presence of k k chatiwal managing director of igl pawan kumar director commercial of igl and other officials this partnership aims to produce \u003cZERO_\u003e million standard cubic meters per day of biogas from waste equivalent to approximately \u003cFIVE_PERCENT\u003e of igls daily requirements igl said the mous promise to be a win win situation for stakeholders like municipal authorities city gas distribution cgd entities farmers and the public at large while municipal authorities will get rid of municipal waste farmers will be able to dispose of agricultural waste cgd entities will get cheaper gas and public shall get clean environment it said","timestamp":"2024-02-08T10:47:00+05:30","market_timestamp":"2024-02-08T10:47:00+05:30","off_market_hours":false}