{"url":"https://www.moneycontrol.com/news/business/biocon-biologics-inks-pact-with-sandoz-for-sale-of-2-biosimilar-products-in-australia-12229771.html","title":"Biocon Biologics inks pact with Sandoz for sale of 2 biosimilar products in Australia","description":"The agreement provides Sandoz the exclusive rights to promote, sell and distribute biosimilars Trastuzumab and Bevacizumab in Australia, Biocon Biologics said in a statement.Biocon Biologics inks pact with Sandoz for sale of 2 biosimilar products in Australia","content":"Biocon Biologics on Friday said it has inked a five-year pact with pharmaceutical company Sandoz AG regarding the sale and distribution of two cancer treatment biosimilar products in Australia. The agreement provides Sandoz the exclusive rights to promote, sell and distribute biosimilars Trastuzumab and Bevacizumab in Australia, Biocon Biologics said in a statement. Biocon Biologics is a subsidiary of Biocon Ltd. Trastuzumab is a biosimilar of Herceptin and Bevacizumab is a biosimilar of Avastin and utilised for the treatment of various cancers. \"Following the recent establishment of our strategic partnership with Sandoz in Japan, our agreement with Sandoz in Australia marks another important milestone of our global partnership and growth strategy,\" Matt Erick, Chief Commercial Officer - Advanced Markets at Biocon Biologics, said. This relationship is also a crucial step for patients in Australia, ensuring continued access to high-quality, affordable biosimilar medicines used in oncology, he added. ","cleaned_content":"biocon biologics on friday said it has inked a five year pact with pharmaceutical company sandoz ag regarding the sale and distribution of two cancer treatment biosimilar products in australia the agreement provides sandoz the exclusive rights to promote sell and distribute biosimilars trastuzumab and bevacizumab in australia biocon biologics said in a statement biocon biologics is a subsidiary of biocon ltd trastuzumab is a biosimilar of herceptin and bevacizumab is a biosimilar of avastin and utilised for the treatment of various cancers following the recent establishment of our strategic partnership with sandoz in japan our agreement with sandoz in australia marks another important milestone of our global partnership and growth strategy matt erick chief commercial officer advanced markets at biocon biologics said this relationship is also a crucial step for patients in australia ensuring continued access to high quality affordable biosimilar medicines used in oncology he added","timestamp":"2024-02-09T11:32:00+05:30","market_timestamp":"2024-02-09T11:32:00+05:30","off_market_hours":false}