{"url":"https://www.moneycontrol.com/news/business/govt-says-rs-12900-crore-invested-under-pli-scheme-for-specialty-steel-12280151.html","title":"Govt says Rs 12,900 crore invested under PLI scheme for specialty steel","description":"In March 2023, 57 memorandum of understandings (MoUs) were signed for generating an investment of about Rs 29,500 crore in the sector by FY28.Govt says Rs 12,900 crore invested under PLI scheme for specialty steelRelated stories","content":"About Rs 12,900 crore has already been invested in the domestic steel sector under the PLI scheme for specialty steel, an official statement said on Wednesday. In March 2023, 57 memorandum of understandings (MoUs) were signed for generating an investment of about Rs 29,500 crore in the sector by FY28. Besides, the scheme envisaged addition of 25 MT capacity for producing specialty steel grades and generating about 17,000 employment opportunities, Ministry of Steel said in an statement. As many as 5 units set up as part of the PLI scheme have begun production, and 9 more units are expected to begin production in this quarter, it said. The ministry envisages an investment of Rs 10,000 crore in FY25. It further said that investments in the steel sector have a long gestation period and depend on factors like procurement of various equipment, many of which are sourced from abroad. Delays due to unavoidable circumstances in the projects include supply chain delays due to geopolitical issues, unforeseen events, natural disasters and changed market, among others. The ministry along with other relevant government departments, has been proactively engaging with the PLI beneficiaries to resolve issues faced by companies and facilitate them to meet their commitments. Measures have been taken to expedite clearances for projects, issue standard operating procedures for Indian visa for experts, and to address the concerns of the participating companies by continuous engagement with stakeholders. ","cleaned_content":"about rs \u003cONE_TEN_THOUSAND\u003e crore has already been invested in the domestic steel sector under the pli scheme for specialty steel an official statement said on wednesday in march \u003cTWO_THOUSAND\u003e \u003cFIVE_TEN\u003e memorandum of understandings mous were signed for generating an investment of about rs \u003cTWO_TEN_THOUSAND\u003e crore in the sector by fy28 besides the scheme envisaged addition of \u003cTWO_TEN\u003e mt capacity for producing specialty steel grades and generating about \u003cONE_TEN_THOUSAND\u003e employment opportunities ministry of steel said in an statement as many as \u003cFIVE_\u003e units set up as part of the pli scheme have begun production and \u003cNINE_\u003e more units are expected to begin production in this quarter it said the ministry envisages an investment of rs \u003cONE_TEN_THOUSAND\u003e crore in fy25 it further said that investments in the steel sector have a long gestation period and depend on factors like procurement of various equipment many of which are sourced from abroad delays due to unavoidable circumstances in the projects include supply chain delays due to geopolitical issues unforeseen events natural disasters and changed market among others the ministry along with other relevant government departments has been proactively engaging with the pli beneficiaries to resolve issues faced by companies and facilitate them to meet their commitments measures have been taken to expedite clearances for projects issue standard operating procedures for indian visa for experts and to address the concerns of the participating companies by continuous engagement with stakeholders","timestamp":"2024-02-15T15:08:00+05:30","market_timestamp":"2024-02-15T15:08:00+05:30","off_market_hours":false}