{"url":"https://www.moneycontrol.com/news/business/india-fastest-growing-economy-in-world-tata-steel-ceo-t-v-narendran-12212721.html","title":"India fastest growing economy in world: Tata Steel CEO T V Narendran","description":"China has emerged rapidly during the last 30-40 years and the next 30 years are important for India, which is the fastest growing economy of the world, Narendran said while addressing the members of Singhbhum Chamber of Commerce and Industry (SCCI) here on Tuesday evening.India fastest growing economy in world: Tata Steel CEO T V NarendranRelated stories","content":"Tata Steel CEO and Managing Director T V Narendran claimed India is the fastest growing economy of the world and the next three decades are important for the country on the development front. China has emerged rapidly during the last 30-40 years and the next 30 years are important for India, which is the fastest growing economy of the world, Narendran said while addressing the members of Singhbhum Chamber of Commerce and Industry (SCCI) here on Tuesday evening. \"Currently, China is the largest steel-producing country in the world and we are second. In view of the global challenges being faced by the steel sector, we have to move forward keeping in mind the steel prices\", the Tata Steel MD said. As Tata Steel's Jamshedpur plant is located in a densely populated area, there was no possibility of further expansion of the Jamshedpur plant, Narendran said. He said Tata Steel's relation with SCCI was strengthening continuously and this would help further industrial growth. Hailing the sacrifices made by workers in the growth of the company, Narendran said Tata Steel is a \"multi-generation company\" and the cordial relationship between Tata Steel and Tata Workers Union led the company to march forward even though \"we have to work amidst the different ambience of the prevailing world scenario\". Dwelling on the MSME sector here, he said these units are the backbone of big industries, which rely on the quality products of MSME. Tata Steel is a big company and its backbone is also the MSME units, he admitted. Jamshedpur is an important place as far as MSMEs were concerned, Narendran said. In his welcome address, SCCI president Vijay Anand Moonka lauded the performance of Tata Steel, which was growing continuously under the dynamic leadership of Narendran. Moonka said Tata Steel should come forward for development of an airport in the vicinity of Jamshedpur. ","cleaned_content":"tata steel ceo and managing director t v narendran claimed india is the fastest growing economy of the world and the next three decades are important for the country on the development front china has emerged rapidly during the last \u003cTHREE_TEN\u003e \u003cFOUR_TEN\u003e years and the next \u003cTHREE_TEN\u003e years are important for india which is the fastest growing economy of the world narendran said while addressing the members of singhbhum chamber of commerce and industry scci here on tuesday evening currently china is the largest steel producing country in the world and we are second in view of the global challenges being faced by the steel sector we have to move forward keeping in mind the steel prices the tata steel md said as tata steels jamshedpur plant is located in a densely populated area there was no possibility of further expansion of the jamshedpur plant narendran said he said tata steels relation with scci was strengthening continuously and this would help further industrial growth hailing the sacrifices made by workers in the growth of the company narendran said tata steel is a multi generation company and the cordial relationship between tata steel and tata workers union led the company to march forward even though we have to work amidst the different ambience of the prevailing world scenario dwelling on the msme sector here he said these units are the backbone of big industries which rely on the quality products of msme tata steel is a big company and its backbone is also the msme units he admitted jamshedpur is an important place as far as msmes were concerned narendran said in his welcome address scci president vijay anand moonka lauded the performance of tata steel which was growing continuously under the dynamic leadership of narendran moonka said tata steel should come forward for development of an airport in the vicinity of jamshedpur","timestamp":"2024-02-07T13:58:00+05:30","market_timestamp":"2024-02-07T13:58:00+05:30","off_market_hours":false}