{"url":"https://www.moneycontrol.com/news/technology/sun-tv-q3-profit-up-6-8-posts-7-increase-in-total-income-12271431.html","title":"Sun TV Q3 profit up 6.8%, posts 7% increase in total income","description":"Total income came in about Rs 1,058.6 crore in Q3 as against Rs 984.83 crore, up 7.4 percent YoY from Rs 984.83 crore. Sequentially, total income was down 6.4 percent at Rs 1,160.21 crore in Q2Broadcaster Sun TV posted its Q3 FY24 results on February 14.Related stories","content":"Sun TV Network Limited, one of the largest television broadcasters in India, which operates satellite television channels across six languages reported 6.8 percent increase in profit after tax (PAT) in December quarter of FY24. The company posted PAT of Rs 454 crore versus a PAT of Rs 425 crore during the same period a year ago. PAT at Rs 464 crore in Q2 FY24 was down 2 percent sequentially. Total income came in about Rs 1058.6 crore in Q3 as against Rs 984.83 crore, up 7.4 percent year-on-year (YoY) from Rs 984.83 crore. Sequentially, total income was down 6.4 percent at Rs 1,160.21 crore in Q2. For the quarter and nine months ended December 31, 2023, income from the cricket franchises stood at Rs 8.98 crore and Rs 522.66 crore respectively. They reported a cost of Rs 3.93 crore in the December quarter cost and Rs 232.85 crore for the nine month period. The company also announced that the Board of Directors have approved the re- appointment of Rajaraman Mahesh Kumar as Managing Director of the Company for further period of five years with effect from April 1, 2024 The Board has also approved re- appointment of Krishnaswamy Vijaykumar as Executive Director of the Company, Kaviya Kalanithi Maran for further period of five years with effect from April 1, 2024.  ","cleaned_content":"sun tv network limited one of the largest television broadcasters in india which operates satellite television channels across six languages reported \u003cSIX_PERCENT\u003e increase in profit after tax pat in december quarter of fy24 the company posted pat of rs \u003cFOUR_HUNDRED\u003e crore versus a pat of rs \u003cFOUR_HUNDRED\u003e crore during the same period a year ago pat at rs \u003cFOUR_HUNDRED\u003e crore in q2 fy24 was down \u003cTWO_PERCENT\u003e sequentially total income came in about rs \u003cONE_THOUSAND\u003e crore in q3 as against rs \u003cNINE_HUNDRED\u003e crore up \u003cSEVEN_PERCENT\u003e year on year yoy from rs \u003cNINE_HUNDRED\u003e crore sequentially total income was down \u003cSIX_PERCENT\u003e at rs \u003cONE_THOUSAND\u003e crore in q2 for the quarter and nine months ended december \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e income from the cricket franchises stood at rs \u003cEIGHT_\u003e crore and rs \u003cFIVE_HUNDRED\u003e crore respectively they reported a cost of rs \u003cTHREE_\u003e crore in the december quarter cost and rs \u003cTWO_HUNDRED\u003e crore for the nine month period the company also announced that the board of directors have approved the re appointment of rajaraman mahesh kumar as managing director of the company for further period of five years with effect from april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e the board has also approved re appointment of krishnaswamy vijaykumar as executive director of the company kaviya kalanithi maran for further period of five years with effect from april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-02-14T21:02:00+05:30","market_timestamp":"2024-02-15T09:15:00+05:30","off_market_hours":true}