{"url":"https://www.moneycontrol.com/news/business/xiaomi-says-indias-scrutiny-of-chinese-firms-unnerves-suppliers-12243571.html","title":"Xiaomi says India's scrutiny of Chinese firms unnerves suppliers","description":"Xiaomi, which has the biggest share in India's smartphone market at 18%, also asks in the letter dated Feb. 6 that India consider offering manufacturing incentives and lowering import tariffs for certain smartphone components.Xiaomi says India's scrutiny of Chinese firms unnerves suppliersRelated stories","content":"China's Xiaomi has told New Delhi that smartphone component suppliers are wary about setting up operations in India amid heavy scrutiny of Chinese companies by the government, according to a letter and a source with direct knowledge of the matter. Xiaomi, which has the biggest share in India's smartphone market at 18%, also asks in the letter dated Feb. 6 that India consider offering manufacturing incentives and lowering import tariffs for certain smartphone components. The Chinese company assembles smartphones in India with mostly local components and the rest imported from China and elsewhere. The letter is Xiaomi's response to a query from India's information technology ministry asking how New Delhi can further develop the country's component manufacturing sector. While Chinese companies operating in India are reticent to speak publicly about the scrutiny, Xiaomi's letter shows that they continue to struggle in India, especially in the smartphone space where many critical components come from Chinese suppliers. In the letter, Xiaomi India President Muralikrishnan B. said India needed to work on \"confidence building\" measures to encourage component suppliers to setup operations locally. \"There are apprehensions among component suppliers regarding establishing operations in India, stemming from the challenges faced by companies in India, particularly from Chinese origin,\" Muralikrishnan said, without naming any companies. The letter said the concerns were related to compliance and visa issues that it didn't elaborate on, and other factors. It said \"the government should address these concerns and work to instil confidence among foreign component suppliers, encouraging them to set up manufacturing facilities in India.\" Xiaomi and the IT ministry did not respond to queries for further information and comment. Indian authorities last year accused Chinese smartphone company Vivo Communication Technology of breaching some visa rules and alleged it siphoned $13 billion in funds from India. India has also frozen more than $600 million in Xiaomi assets for alleged illegal remittances to foreign entities by passing them off as royalty payments. Both Chinese companies deny any wrongdoing. Other than regulatory scrutiny of the likes of Xiaomi and Vivo, India has since 2020 also banned more than 300 Chinese apps, including ByteDance's TikTok, and halted planned projects such as those planned by Chinese automakers BYD and Great Wall Motor. The source said many executives of Chinese electronics companies struggle to get visas to enter India, and their companies continue to face slow clearances for investments due to heavy scrutiny by New Delhi. In the letter, Xiaomi's Muralikrishnan also made a case for further lowering India's import tariffs, just after New Delhi's Jan. 31 move to reduce import taxes on battery covers and phone camera lenses. Xiaomi is also asking India to reduce import tariffs on sub-components used in batteries, USB cables and phone covers, according to the letter. Reducing the import tariffs could \"increase India's manufacturing competitiveness ... in terms of costs\", Xiaomi said in the letter, but getting component manufacturers to set up shop in India would require bigger incentives. In January, India's top industrial policy bureaucrat Rajesh Kumar Singh signalled that India could ease its heightened scrutiny of Chinese investments if the two countries' border remains peaceful. ","cleaned_content":"chinas xiaomi has told new delhi that smartphone component suppliers are wary about setting up operations in india amid heavy scrutiny of chinese companies by the government according to a letter and a source with direct knowledge of the matter xiaomi which has the biggest share in indias smartphone market at \u003cONE_TEN_PERCENT\u003e also asks in the letter dated feb \u003cSIX_\u003e that india consider offering manufacturing incentives and lowering import tariffs for certain smartphone components the chinese company assembles smartphones in india with mostly local components and the rest imported from china and elsewhere the letter is xiaomis response to a query from indias information technology ministry asking how new delhi can further develop the countrys component manufacturing sector while chinese companies operating in india are reticent to speak publicly about the scrutiny xiaomis letter shows that they continue to struggle in india especially in the smartphone space where many critical components come from chinese suppliers in the letter xiaomi india president muralikrishnan b said india needed to work on confidence building measures to encourage component suppliers to setup operations locally there are apprehensions among component suppliers regarding establishing operations in india stemming from the challenges faced by companies in india particularly from chinese origin muralikrishnan said without naming any companies the letter said the concerns were related to compliance and visa issues that it didnt elaborate on and other factors it said the government should address these concerns and work to instil confidence among foreign component suppliers encouraging them to set up manufacturing facilities in india xiaomi and the it ministry did not respond to queries for further information and comment indian authorities last year accused chinese smartphone company vivo communication technology of breaching some visa rules and alleged it siphoned \u003cONE_TEN\u003e billion in funds from india india has also frozen more than \u003cSIX_HUNDRED\u003e million in xiaomi assets for alleged illegal remittances to foreign entities by passing them off as royalty payments both chinese companies deny any wrongdoing other than regulatory scrutiny of the likes of xiaomi and vivo india has since \u003cTWO_THOUSAND\u003e also banned more than \u003cTHREE_HUNDRED\u003e chinese apps including bytedances tiktok and halted planned projects such as those planned by chinese automakers byd and great wall motor the source said many executives of chinese electronics companies struggle to get visas to enter india and their companies continue to face slow clearances for investments due to heavy scrutiny by new delhi in the letter xiaomis muralikrishnan also made a case for further lowering indias import tariffs just after new delhis jan \u003cTHREE_TEN\u003e move to reduce import taxes on battery covers and phone camera lenses xiaomi is also asking india to reduce import tariffs on sub components used in batteries usb cables and phone covers according to the letter reducing the import tariffs could increase indias manufacturing competitiveness in terms of costs xiaomi said in the letter but getting component manufacturers to set up shop in india would require bigger incentives in january indias top industrial policy bureaucrat rajesh kumar singh signalled that india could ease its heightened scrutiny of chinese investments if the two countries border remains peaceful","timestamp":"2024-02-12T06:24:00+05:30","market_timestamp":"2024-02-12T09:15:00+05:30","off_market_hours":true}