{"url":"https://www.moneycontrol.com/news/business/oyo-expects-consistent-pat-rise-in-upcoming-quarters-ceo-ritesh-agarwal-tells-employees-12231681.html","title":"OYO expects consistent PAT rise in upcoming quarters, CEO Ritesh Agarwal tells employees","description":"Ritesh Agarwal shared the update about the two-fold increase in the company's profit during an employee town hall on Friday.OYO expects consistent PAT rise in upcoming quarters, CEO Ritesh Agarwal tells employees","content":"Hospitality and travel-tech firm OYO expects a consistent rise in its Profit After Tax (PAT) after doubling it sequentially in Q3 FY24 to Rs 30 crore, according to company Founder \u0026 CEO Ritesh Agarwal. Agarwal shared the update about the two-fold increase in the company's profit during an employee town hall on Friday. Oravel Stays Ltd, which operates travel tech brand OYO, had its maiden profitable quarter in Q2 FY24 with a PAT of Rs 16 crore. He also informed the staff that the company clocked adjusted EBITDA of Rs 750 crore in FY23 and expects to clock adjusted EBITDA of Rs 1,000 crore in FY24, surpassing its earlier projection of Rs 800 crore for FY24. When contacted, OYO spokesperson declined to comment. Last year OYO had prepaid Rs 1,620 crore debt through a buyback process that involved the repurchase of 30 per cent of the company's outstanding Term Loan B (TLB). The IPO-bound firm, in its last public filing, had disclosed that it achieved operational profitability in FY23, clocking an adjusted EBITDA of Rs 277 crore. Earlier, Agarwal had shared with employees that the company had turned cash flow positive in the fourth quarter of FY23. ","cleaned_content":"hospitality and travel tech firm oyo expects a consistent rise in its profit after tax pat after doubling it sequentially in q3 fy24 to rs \u003cTHREE_TEN\u003e crore according to company founder ceo ritesh agarwal agarwal shared the update about the two fold increase in the companys profit during an employee town hall on friday oravel stays ltd which operates travel tech brand oyo had its maiden profitable quarter in q2 fy24 with a pat of rs \u003cONE_TEN\u003e crore he also informed the staff that the company clocked adjusted ebitda of rs \u003cSEVEN_HUNDRED\u003e crore in fy23 and expects to clock adjusted ebitda of rs \u003cONE_THOUSAND\u003e crore in fy24 surpassing its earlier projection of rs \u003cEIGHT_HUNDRED\u003e crore for fy24 when contacted oyo spokesperson declined to comment last year oyo had prepaid rs \u003cONE_THOUSAND\u003e crore debt through a buyback process that involved the repurchase of \u003cTHREE_TEN_PERCENT\u003e of the companys outstanding term loan b tlb the ipo bound firm in its last public filing had disclosed that it achieved operational profitability in fy23 clocking an adjusted ebitda of rs \u003cTWO_HUNDRED\u003e crore earlier agarwal had shared with employees that the company had turned cash flow positive in the fourth quarter of fy23","timestamp":"2024-02-09T13:00:00+05:30","market_timestamp":"2024-02-09T13:00:00+05:30","off_market_hours":false}