{"url":"https://www.moneycontrol.com/news/business/sterlite-power-gets-rs-2400-crore-funding-from-rec-arm-for-beawar-project-12257241.html","title":"Sterlite Power gets Rs 2,400 crore funding from REC arm for Beawar project","description":"In a statement, Sterlite Power said \"it has has successfully achieved financial closure for its Beawar Transmission Limited (BTL) project.\" This accomplishment comes within four months of Sterlite Power acquiring the project.Sterlite Power gets Rs 2,400 crore funding from REC arm for Beawar projectRelated stories","content":"Sterlite Power has secured Rs 2,400 crore funding from state-owned REC Power Development and Consultancy Ltd (RECPDCL) for its Beawar transmission project in Rajasthan. In a statement, Sterlite Power said \"it has has successfully achieved financial closure for its Beawar Transmission Limited (BTL) project.\" This accomplishment comes within four months of Sterlite Power acquiring the project. \"Financial closure is an important milestone in an infrastructure project's lifecycle. Achieving this in a short span will help us in expediting the delivery of this critical project - an integral part of the larger Green Energy Corridor that will help evacuate around 20 GW of renewable energy,\" Pratik Agarwal, Managing Director, Sterlite Power said. The project involves construction of a 350 km, 765kV transmission corridor that will connect the renewable energy zone at Fatehgarh III to a proposed substation at Beawar. The project will also include construction of 3000 MVA 765/400kV substation at Beawar. Sterlite Power has a portfolio of 33 (completed, sold and under construction) transmission projects, covering 15,350 circuit kms of transmission lines, across India and Brazil. ","cleaned_content":"sterlite power has secured rs \u003cTWO_THOUSAND\u003e crore funding from state owned rec power development and consultancy ltd recpdcl for its beawar transmission project in rajasthan in a statement sterlite power said it has has successfully achieved financial closure for its beawar transmission limited btl project this accomplishment comes within four months of sterlite power acquiring the project financial closure is an important milestone in an infrastructure projects lifecycle achieving this in a short span will help us in expediting the delivery of this critical project an integral part of the larger green energy corridor that will help evacuate around \u003cTWO_TEN\u003e gw of renewable energy pratik agarwal managing director sterlite power said the project involves construction of a \u003cTHREE_HUNDRED\u003e km \u003cSEVEN_HUNDRED\u003e kv transmission corridor that will connect the renewable energy zone at fatehgarh iii to a proposed substation at beawar the project will also include construction of \u003cTHREE_THOUSAND\u003e mva \u003cSEVEN_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e kv substation at beawar sterlite power has a portfolio of \u003cTHREE_TEN\u003e completed sold and under construction transmission projects covering \u003cONE_TEN_THOUSAND\u003e circuit kms of transmission lines across india and brazil","timestamp":"2024-02-13T13:19:00+05:30","market_timestamp":"2024-02-13T13:19:00+05:30","off_market_hours":false}