{"url":"https://www.moneycontrol.com/news/business/manufacturing-sector-should-contribute-quarter-to-indias-economic-growth-mm-group-md-anish-shah-12337351.html","title":"Manufacturing sector should contribute quarter to India's economic growth: M\u0026M Group MD Anish Shah","description":"Sharing his perspective on the role industries and enterprises will have to play in accelerating national growth and economic prosperity at the third ABP Network's 'Ideas of India Summit 3.0' here, he also said over the next seven years, Indian GDP is expected to add as much to the global GDP as the entire European Union combined.Manufacturing sector should contribute quarter to India's economic growth: M\u0026M Group MD Anish Shah","content":"The manufacturing sector needs to contribute a quarter to India's economic growth amid its ambition of becoming a USD 30-trillion economy by 2030 and a developed country (Viksit Bharat), M\u0026M group Managing Director and CEO Anish Shah said on Friday. Sharing his perspective on the role industries and enterprises will have to play in accelerating national growth and economic prosperity at the third ABP Network's 'Ideas of India Summit 3.0' here, he also said over the next seven years, Indian GDP is expected to add as much to the global GDP as the entire European Union combined. The two-day event, which began here on Friday, has seen the participation of policymakers, cultural ambassadors, industry experts, celebrities, business leaders, economists, among others. The interim Budget has prioritised economics over politics, adopted fiscal discipline, and invested more in capex, he added. He also said that the Central Bank has done a stellar job in containing inflation, adding that infrastructure is being massively developed to make manufacturing competitive in India. ","cleaned_content":"the manufacturing sector needs to contribute a quarter to indias economic growth amid its ambition of becoming a usd \u003cTHREE_TEN\u003e trillion economy by \u003cTWO_THOUSAND\u003e and a developed country viksit bharat m m group managing director and ceo anish shah said on friday sharing his perspective on the role industries and enterprises will have to play in accelerating national growth and economic prosperity at the third abp networks ideas of india summit \u003cTHREE_\u003e here he also said over the next seven years indian gdp is expected to add as much to the global gdp as the entire european union combined the two day event which began here on friday has seen the participation of policymakers cultural ambassadors industry experts celebrities business leaders economists among others the interim budget has prioritised economics over politics adopted fiscal discipline and invested more in capex he added he also said that the central bank has done a stellar job in containing inflation adding that infrastructure is being massively developed to make manufacturing competitive in india","timestamp":"2024-02-23T13:18:00+05:30","market_timestamp":"2024-02-23T13:18:00+05:30","off_market_hours":false}