{"url":"https://www.moneycontrol.com/news/business/spicejet-raises-additional-rs-316-crore-total-funds-reach-rs-1060-crore-12329361.html","title":"SpiceJet raises additional Rs 316 crore, total funds reach Rs 1,060 crore","description":"The fresh capital infusion in the struggling airline comes amid its recent announcement of slashing its workforce by 10-15 per cent.SpiceJet raises additional Rs 316 crore, total funds reach Rs 1,060 croreRelated stories","content":"SpiceJet on Thursday said it has secured an additional Rs 316 crore, taking its total funds raised to Rs 1,060 crore through a preferential share issue. The fresh capital infusion in the struggling airline comes amid its recent announcement of slashing its workforce by 10-15 per cent. In January SpiceJet had received Rs 744 crore as the first tranche of funds through the allotment of securities on a preferential basis. It added, \"The Preferential Allotment Committee of SpiceJet's Board Directors convened on February 21, 2024, approved the allotment of 4.01 crore equity shares on a preferential basis to two investors, including Aries Opportunities Fund Limited.\" The committee also sanctioned the allotment of 2.31 crore warrants, offering the option to apply for an equivalent number of equity shares, to four investors, including Elara India Opportunities Fund Limited, according to the statement. \"The company has raised a total investment of Rs 1,060 crore. This significant capital infusion reaffirms investor confidence in SpiceJet's growth prospects and strengthens our financial position for the future,\" said Ajay Singh, Chairman and Managing Director at SpiceJet. The additional funding will help SpiceJet to pursue its expansion plans and enhance its operational capabilities, he added. SpiceJet has been facing headwinds for the last couple of quarters for want of funds, leading to the grounding of a number of aircraft and returning some of the leased planes to the lessors. Some of its lessors have dragged the airline even to court for non-payment of lease rentals. As on February 21, the airline had nearly half of its 65 aircraft fleet on the ground with 35 planes in service and remaining parked, as per the aircraft fleet tracking website Planespotter. ","cleaned_content":"spicejet on thursday said it has secured an additional rs \u003cTHREE_HUNDRED\u003e crore taking its total funds raised to rs \u003cONE_THOUSAND\u003e crore through a preferential share issue the fresh capital infusion in the struggling airline comes amid its recent announcement of slashing its workforce by \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e in january spicejet had received rs \u003cSEVEN_HUNDRED\u003e crore as the first tranche of funds through the allotment of securities on a preferential basis it added the preferential allotment committee of spicejets board directors convened on february \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e approved the allotment of \u003cFOUR_\u003e crore equity shares on a preferential basis to two investors including aries opportunities fund limited the committee also sanctioned the allotment of \u003cTWO_\u003e crore warrants offering the option to apply for an equivalent number of equity shares to four investors including elara india opportunities fund limited according to the statement the company has raised a total investment of rs \u003cONE_THOUSAND\u003e crore this significant capital infusion reaffirms investor confidence in spicejets growth prospects and strengthens our financial position for the future said ajay singh chairman and managing director at spicejet the additional funding will help spicejet to pursue its expansion plans and enhance its operational capabilities he added spicejet has been facing headwinds for the last couple of quarters for want of funds leading to the grounding of a number of aircraft and returning some of the leased planes to the lessors some of its lessors have dragged the airline even to court for non payment of lease rentals as on february \u003cTWO_TEN\u003e the airline had nearly half of its \u003cSIX_TEN\u003e aircraft fleet on the ground with \u003cTHREE_TEN\u003e planes in service and remaining parked as per the aircraft fleet tracking website planespotter","timestamp":"2024-02-22T12:56:00+05:30","market_timestamp":"2024-02-22T12:56:00+05:30","off_market_hours":false}