{"url":"https://www.moneycontrol.com/news/business/india-banks-rush-for-clients-set-for-reckoning-after-paytm-12319811.html","title":"India banks’ rush for clients set for reckoning after Paytm","description":"India stunned investors last month by abruptly suspending most activities of the banking affiliate of Paytm, a once high-flying fintech star that had attracted backing from Warren Buffett and SoftBank Group Corp. India banks’ rush for clients set for reckoning after PaytmRelated stories","content":"For Indian regulators seeking to crack down on potential fraud in the financial sector, Paytm may just be the beginning. India stunned investors last month by abruptly suspending most activities of the banking affiliate of Paytm, a once high-flying fintech star that had attracted backing from Warren Buffett and SoftBank Group Corp. While the Paytm case was an extreme example of lapses in customer verification — it allegedly used a single identity document to open thousands of accounts — the crackdown signals growing impatience from authorities. Hardly a day passes when a bank or fintech firm isn’t fined for failing to properly vet its customers, ensnaring top lenders from State Bank of India to Citigroup Inc. Fed up with the persistent shortcomings, the Reserve Bank of India is likely to get even tougher before Governor Shaktikanta Das steps down this year. Regulatory concerns are rising as lenders rush to open more accounts and mop up deposits to meet the soaring demand for loans in the fastest-growing major economy. Most banks typically outsource the last mile of customer verification to third-party firms or so-called runners, and leakages occur at many points in that largely paper process, according to Ashok Hariharan, chief executive officer of IDfy, which provides client vetting services to banks and fintechs firms in India. While big banks can do more, it’s a challenge dealing with firms that don’t have strict fraud and risk teams, he said. RBI Governor Das has repeatedly warned about the need to strengthen risk management in banks and shadow lenders. Even though bad debts are at a more than decade low, these lapses in customer verification have been among major concerns for the central bank. “The interest of depositors and customers is of prime importance,” Das said in a post-monetary policy briefing this month. “Financial stability is of prime importance.” While Indian banks have boosted spending on technology to detect potential money laundering and prevent fraud, the cases are rising. The number of reported frauds of more than 100,000 rupees ($1,205) rose 68% to more than 14,000 from April to September last year, almost triple the rate for the previous six-month period, according to an RBI report. The sharpest increase of fraud cases was in credit cards, online transactions and deposits, the data show. RBI, which can levy a maximum penalty of 50 million rupees for violations, imposed fines of 400 million rupees in the fiscal year that ended in March, down from 650.3 million rupees the prior year. Still, in the current fiscal year, the frequency of such fines has increased sharply, as can be parsed from the central bank’s website. “RBI getting stricter on KYC is the right thing to do, and people are going to get serious about it now,” said IDfy’s Hariharan. “In many instances, there is a frivolous attitude toward KYC.” Customer data in the country has been misused, according to Hariharan. In a typical set-up, fraudsters pay runners who collect so-called Know-Your-Customer documents for bank customers and offer them as little as 500 rupees for the data, he said. This allows fraudsters to operate multiple bank accounts from the identity theft, and they collect money in these accounts by duping customers largely through phishing calls, he added. CrackdownIn addition to its crackdown on banks, RBI ordered Visa Inc. this month to immediately stop a payments service where cards were used to transact with merchants who weren’t allowed to accept such payments. Yet no recent case has drawn as much attention as Paytm, controlled by billionaire Vijay Shekhar Sharma. The firm burst onto India’s equity markets in 2021 with a $2.5 billion initial public offering, the largest ever in the country and attracted a who’s who of global investors. Masayoshi Son’s SoftBank was on board, as was China fintech giant Ant Group Co. and the Canada Pension Plan Investment Board. Its affiliate company, which takes deposits and offers payment services much like PayPal Holdings Inc., has been in the regulator’s crosshairs. On Jan. 31, India’s central bank barred Paytm Payments Bank Ltd. from accepting fresh credits in its customer accounts or mobile wallets after Feb. 29. Bloomberg News has reported that hundreds of thousands of customers didn’t submit their KYC documentation. The RBI move dealt a big blow to Paytm and sent its stock tumbling. Regulators last week extended that deadline to March 15, and Paytm is in talks with other banks to clear merchant payments.  Compliance and accountability are big challenges for the financial system, which now includes a lot of links among banks, fintechs and others, according to K.V. Karthik, who leads the financial services sector for Deloitte in India. “With such a sharp growth in so many small fintech firms in the ecosystem, RBI probably wants to put out a stern and clear message that everyone must follow rules very seriously,” said Gefion Capital’s Agarwal. ","cleaned_content":"for indian regulators seeking to crack down on potential fraud in the financial sector paytm may just be the beginning india stunned investors last month by abruptly suspending most activities of the banking affiliate of paytm a once high flying fintech star that had attracted backing from warren buffett and softbank group corp while the paytm case was an extreme example of lapses in customer verification it allegedly used a single identity document to open thousands of accounts the crackdown signals growing impatience from authorities hardly a day passes when a bank or fintech firm isn t fined for failing to properly vet its customers ensnaring top lenders from state bank of india to citigroup inc fed up with the persistent shortcomings the reserve bank of india is likely to get even tougher before governor shaktikanta das steps down this year regulatory concerns are rising as lenders rush to open more accounts and mop up deposits to meet the soaring demand for loans in the fastest growing major economy most banks typically outsource the last mile of customer verification to third party firms or so called runners and leakages occur at many points in that largely paper process according to ashok hariharan chief executive officer of idfy which provides client vetting services to banks and fintechs firms in india while big banks can do more it s a challenge dealing with firms that don t have strict fraud and risk teams he said rbi governor das has repeatedly warned about the need to strengthen risk management in banks and shadow lenders even though bad debts are at a more than decade low these lapses in customer verification have been among major concerns for the central bank the interest of depositors and customers is of prime importance das said in a post monetary policy briefing this month financial stability is of prime importance while indian banks have boosted spending on technology to detect potential money laundering and prevent fraud the cases are rising the number of reported frauds of more than \u003cONE_HUNDRED_THOUSAND\u003e rupees \u003cONE_THOUSAND\u003e rose \u003cSIX_TEN_PERCENT\u003e to more than \u003cONE_TEN_THOUSAND\u003e from april to september last year almost triple the rate for the previous six month period according to an rbi report the sharpest increase of fraud cases was in credit cards online transactions and deposits the data show rbi which can levy a maximum penalty of \u003cFIVE_TEN\u003e million rupees for violations imposed fines of \u003cFOUR_HUNDRED\u003e million rupees in the fiscal year that ended in march down from \u003cSIX_HUNDRED\u003e million rupees the prior year still in the current fiscal year the frequency of such fines has increased sharply as can be parsed from the central bank s website rbi getting stricter on kyc is the right thing to do and people are going to get serious about it now said idfy s hariharan in many instances there is a frivolous attitude toward kyc customer data in the country has been misused according to hariharan in a typical set up fraudsters pay runners who collect so called know your customer documents for bank customers and offer them as little as \u003cFIVE_HUNDRED\u003e rupees for the data he said this allows fraudsters to operate multiple bank accounts from the identity theft and they collect money in these accounts by duping customers largely through phishing calls he added crackdownin addition to its crackdown on banks rbi ordered visa inc this month to immediately stop a payments service where cards were used to transact with merchants who weren t allowed to accept such payments yet no recent case has drawn as much attention as paytm controlled by billionaire vijay shekhar sharma the firm burst onto india s equity markets in \u003cTWO_THOUSAND\u003e with a \u003cTWO_\u003e billion initial public offering the largest ever in the country and attracted a who s who of global investors masayoshi son s softbank was on board as was china fintech giant ant group co and the canada pension plan investment board its affiliate company which takes deposits and offers payment services much like paypal holdings inc has been in the regulator s crosshairs on jan \u003cTHREE_TEN\u003e india s central bank barred paytm payments bank ltd from accepting fresh credits in its customer accounts or mobile wallets after feb \u003cTWO_TEN\u003e bloomberg news has reported that hundreds of thousands of customers didn t submit their kyc documentation the rbi move dealt a big blow to paytm and sent its stock tumbling regulators last week extended that deadline to march \u003cONE_TEN\u003e and paytm is in talks with other banks to clear merchant payments compliance and accountability are big challenges for the financial system which now includes a lot of links among banks fintechs and others according to k v karthik who leads the financial services sector for deloitte in india with such a sharp growth in so many small fintech firms in the ecosystem rbi probably wants to put out a stern and clear message that everyone must follow rules very seriously said gefion capital s agarwal","timestamp":"2024-02-21T12:01:00+05:30","market_timestamp":"2024-02-21T12:01:00+05:30","off_market_hours":false}