{"url":"https://www.moneycontrol.com/news/business/sbi-in-talks-with-rbi-to-lower-cash-reserve-ratio-requirement-on-green-deposits-12288231.html","title":"SBI in talks with RBI to lower cash reserve ratio requirement on green deposits","description":"Currently, banks have to maintain a CRR of 4.5% on their total deposits, with no distinction provided for green deposits.SBI seeks lower reserve requirement for green deposits, chairman Dinesh Kumar Khara saysRelated stories","content":"State Bank of India chairman Dinesh Khara on Friday said the nation's largest lender is in talks with the Reserve Bank to reduce the cash reserve ratio requirement on green deposits. State Bank of India (SBI) last month announced a green deposit scheme, a first in the domestic banking, to attract long-term retail deposits to be used only to fund green transition projects or climate-friendly projects. The bank said such deposits will be priced 10 basis points lower than normal deposit rates. At present, the CRR is pegged at 4.5 per cent, which means that every one rupee that a bank collects in deposits, 4.5 paise should be parked with the Reserve Bank as a solvency measure. Banks don't earn any interest from the amount reserved with RBI. \"We are engaging with the regulator for a reduction in the CRR for green deposits and secondly, if at all as a policy, it can be incorporated into the regulator policy mechanism. Early beginning has happened from the regulator's side also but maybe it will take two to three years to start having an impact on the pricing too,\" Khara said at an event organised by the Indian Institute of Management Kozhikode here. Calling for better and more practical rating as there is a high possibility of green-shoring in the name of green financing, the chairman also said the bank is engaging with rating entities to see if an accounting standard can be set for green financing. SBI has also started evaluating borrowers on environmental, social and governance rating. Pradip Chaudhary, one of the predecessors of Khara, had a long fight with the regulator after he sought interest payments from the RBI on deposits under CRR. SBI launched a green rupee fixed deposit scheme last month with tenors of 1,111, 1,777 and 2,222 days with interest rates around 10 basis points below the prevailing rates on similar tenors of regular fixed deposits at the bank. The RBI put in place a framework for accepting fixed deposits, which has been applicable since June 2023. As per the framework, financial institutions are supposed to raise green deposits first before they decide to finance green projects. The proceeds can be invested in liquid instruments with up to one year maturity. ","cleaned_content":"state bank of india chairman dinesh khara on friday said the nations largest lender is in talks with the reserve bank to reduce the cash reserve ratio requirement on green deposits state bank of india sbi last month announced a green deposit scheme a first in the domestic banking to attract long term retail deposits to be used only to fund green transition projects or climate friendly projects the bank said such deposits will be priced \u003cONE_TEN\u003e basis points lower than normal deposit rates at present the crr is pegged at \u003cFOUR_PERCENT\u003e which means that every one rupee that a bank collects in deposits \u003cFOUR_\u003e paise should be parked with the reserve bank as a solvency measure banks dont earn any interest from the amount reserved with rbi we are engaging with the regulator for a reduction in the crr for green deposits and secondly if at all as a policy it can be incorporated into the regulator policy mechanism early beginning has happened from the regulators side also but maybe it will take two to three years to start having an impact on the pricing too khara said at an event organised by the indian institute of management kozhikode here calling for better and more practical rating as there is a high possibility of green shoring in the name of green financing the chairman also said the bank is engaging with rating entities to see if an accounting standard can be set for green financing sbi has also started evaluating borrowers on environmental social and governance rating pradip chaudhary one of the predecessors of khara had a long fight with the regulator after he sought interest payments from the rbi on deposits under crr sbi launched a green rupee fixed deposit scheme last month with tenors of \u003cONE_THOUSAND\u003e \u003cONE_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e days with interest rates around \u003cONE_TEN\u003e basis points below the prevailing rates on similar tenors of regular fixed deposits at the bank the rbi put in place a framework for accepting fixed deposits which has been applicable since june \u003cTWO_THOUSAND\u003e as per the framework financial institutions are supposed to raise green deposits first before they decide to finance green projects the proceeds can be invested in liquid instruments with up to one year maturity","timestamp":"2024-02-16T12:38:00+05:30","market_timestamp":"2024-02-16T12:38:00+05:30","off_market_hours":false}