{"url":"https://www.moneycontrol.com/news/business/juniper-green-energy-envision-tie-up-to-develop-300-mw-wind-project-12309021.html","title":"Juniper Green Energy, Envision tie up to develop 300-MW wind project","description":"As per the partnership, Envision will supply 91 units of EN 156-3.3 MW WTGs (wind turbine generators) and oversee the installation, commissioning and maintenance of all WTGs.Juniper Green Energy, Envision tie up to develop 300-MW wind project","content":"Juniper Green Energy and Envision Energy have collaborated for the development of a 300-MW wind energy project in Gujarat. As per the partnership, Envision will supply 91 units of EN 156-3.3 MW WTGs (wind turbine generators) and oversee the installation, commissioning and maintenance of all WTGs. The project is expected to be commissioned in a phased manner by the end of 2025 and will produce 1,000 GWh units of clean energy annually, according to a statement. RPV Prasad, CEO, Envision Wind Power Technologies India, said, \"As part of our commitment to the Atmanirbhar Bharat vision, we would be assembling the nacelle and hubs for the wind turbines at our Pune factory, while towers and blades will be sourced locally.\" Kane Xu, Global Vice President of Envision Energy and Chairman of Envision Energy India, said, \"Together with Juniper, we can develop reliable renewable energy solutions in India.\" ","cleaned_content":"juniper green energy and envision energy have collaborated for the development of a \u003cTHREE_HUNDRED\u003e mw wind energy project in gujarat as per the partnership envision will supply \u003cNINE_TEN\u003e units of en \u003cONE_HUNDRED\u003e \u003cTHREE_\u003e mw wtgs wind turbine generators and oversee the installation commissioning and maintenance of all wtgs the project is expected to be commissioned in a phased manner by the end of \u003cTWO_THOUSAND\u003e and will produce \u003cONE_THOUSAND\u003e gwh units of clean energy annually according to a statement rpv prasad ceo envision wind power technologies india said as part of our commitment to the atmanirbhar bharat vision we would be assembling the nacelle and hubs for the wind turbines at our pune factory while towers and blades will be sourced locally kane xu global vice president of envision energy and chairman of envision energy india said together with juniper we can develop reliable renewable energy solutions in india","timestamp":"2024-02-20T10:45:00+05:30","market_timestamp":"2024-02-20T10:45:00+05:30","off_market_hours":false}