{"url":"https://www.moneycontrol.com/news/business/infosys-ceo-salil-parekh-joins-usispf-board-12335231.html","title":"Infosys CEO Salil Parekh joins USISPF Board","description":"An industry veteran with nearly three decades in the IT services industry, executing business turnarounds and managing successful acquisitions, Parekh in his capacity as Infosys CEO sets the strategic direction of one of India's most notable IT giants, while nurturing a strong leadership team to drive its execution.Infosys CEO Salil Parekh joins USISPF BoardRelated stories","content":"Salil Parekh, CEO and managing director at Infosys, has joined US India Strategic and Partnership Forum as its board of directors. An industry veteran with nearly three decades in the IT services industry, executing business turnarounds and managing successful acquisitions, Parekh in his capacity as Infosys CEO sets the strategic direction of one of India's most notable IT giants, while nurturing a strong leadership team to drive its execution. \"Salil's recent addition to the USISPF Board accentuates the success story of Indian IT giants in the US For years. Infosys has been a household name in India, and IT services are one of India's biggest exports to the United States,\" said USISPF president and CEO Mukesh Aghi. USISPF chairman John Chambers said Salil and Infosys' participation on the USISPF Board will help forge a critical reliance for the two economies by consolidating digital trade, ultimately further establishing India as an innovation partner to the world, which is the organisation's core mission. \"I'm thrilled to have Salil, a leader with a great track record in the IT industry, join the USISPF Board. Infosys' impact in the American tech industry has been extremely important, and the company played a vital part in India's nearly USD 200 billion software exports for 2023,\" Chambers said. ","cleaned_content":"salil parekh ceo and managing director at infosys has joined us india strategic and partnership forum as its board of directors an industry veteran with nearly three decades in the it services industry executing business turnarounds and managing successful acquisitions parekh in his capacity as infosys ceo sets the strategic direction of one of indias most notable it giants while nurturing a strong leadership team to drive its execution salils recent addition to the usispf board accentuates the success story of indian it giants in the us for years infosys has been a household name in india and it services are one of indias biggest exports to the united states said usispf president and ceo mukesh aghi usispf chairman john chambers said salil and infosys participation on the usispf board will help forge a critical reliance for the two economies by consolidating digital trade ultimately further establishing india as an innovation partner to the world which is the organisations core mission im thrilled to have salil a leader with a great track record in the it industry join the usispf board infosys impact in the american tech industry has been extremely important and the company played a vital part in indias nearly usd \u003cTWO_HUNDRED\u003e billion software exports for \u003cTWO_THOUSAND\u003e chambers said","timestamp":"2024-02-23T07:14:00+05:30","market_timestamp":"2024-02-23T09:15:00+05:30","off_market_hours":true}