{"url":"https://www.moneycontrol.com/news/business/airtel-to-offer-under-river-tunnel-5g-connectivity-for-kolkata-metro-commuters-12351921.html","title":"Airtel to offer under-river tunnel 5G connectivity for Kolkata metro commuters","description":"According to a company statement, this will make Airtel the first operator to deliver seamless connectivity through the 4.8km stretch in Kolkata's East-West Metro corridor connecting Howrah Maidan with the Esplanade.Airtel to offer under-river tunnel 5G connectivity for Kolkata metro commuters","content":"Telecom major Bharti Airtel on Monday said it will provide under-river tunnel 5G connectivity to metro commuters in Kolkata by deploying high-capacity nodes 35 metres below river Hooghly. According to a company statement, this will make Airtel the first operator to deliver seamless connectivity through the 4.8km stretch in Kolkata's East-West Metro corridor connecting Howrah Maidan with the Esplanade. High-capacity nodes at each of these stations have been deployed for seamless connectivity allowing commuters to use high-speed internet, voice calls, and data transmission, it said. India's first underwater metro connecting Howrah to Kolkata via a tunnel underneath the Hooghly River is set to start operations in June 2024. ","cleaned_content":"telecom major bharti airtel on monday said it will provide under river tunnel \u003cFIVE_\u003e g connectivity to metro commuters in kolkata by deploying high capacity nodes \u003cTHREE_TEN\u003e metres below river hooghly according to a company statement this will make airtel the first operator to deliver seamless connectivity through the \u003cFOUR_\u003e km stretch in kolkatas east west metro corridor connecting howrah maidan with the esplanade high capacity nodes at each of these stations have been deployed for seamless connectivity allowing commuters to use high speed internet voice calls and data transmission it said indias first underwater metro connecting howrah to kolkata via a tunnel underneath the hooghly river is set to start operations in june \u003cTWO_THOUSAND\u003e","timestamp":"2024-02-26T14:34:00+05:30","market_timestamp":"2024-02-26T14:34:00+05:30","off_market_hours":false}