{"url":"https://www.moneycontrol.com/news/business/gensol-engineering-bags-two-solar-project-orders-worth-rs-337-crore-12349621.html","title":"Gensol Engineering bags two solar project orders worth Rs 337 crore","description":"The contracts cover design, engineering, procurement, construction, and commissioning services, with modules as free-issue items, Gensol Engineering said in an exchange filing.Gensol Engineering bags two solar project orders worth Rs 337 crore","content":"Gensol Engineering Ltd on Monday said it has secured two new solar projects worth Rs 337 crore in Rajasthan and Maharashtra. The contracts cover design, engineering, procurement, construction, and commissioning services, with modules as free-issue items, Gensol Engineering said in an exchange filing. \"The first order is for a 250 MW/350 MW ISTS (Inter State Transmission System) solar power project in Rajasthan, while the second project is of 50 MW/72.5 MW solar power project in Maharashtra,\" the company said. Ali Imran Naqvi, CEO of Gensol Engineering Limited (EPC Business), said, \"Winning these projects is a significant milestone, indicating a major expansion in our operational capabilities and project scale. These EPC contracts in Rajasthan and Maharashtra reflect our increasing capabilities and strategic intent to enter key high growth regions.\" Gensol Engineering Limited is a part of the Gensol group of companies. It has also established an electric vehicle manufacturing facility in Pune for the development and production of electric three-wheelers and four-wheelers. ","cleaned_content":"gensol engineering ltd on monday said it has secured two new solar projects worth rs \u003cTHREE_HUNDRED\u003e crore in rajasthan and maharashtra the contracts cover design engineering procurement construction and commissioning services with modules as free issue items gensol engineering said in an exchange filing the first order is for a \u003cTWO_HUNDRED\u003e mw \u003cTHREE_HUNDRED\u003e mw ists inter state transmission system solar power project in rajasthan while the second project is of \u003cFIVE_TEN\u003e mw \u003cSEVEN_TEN\u003e mw solar power project in maharashtra the company said ali imran naqvi ceo of gensol engineering limited epc business said winning these projects is a significant milestone indicating a major expansion in our operational capabilities and project scale these epc contracts in rajasthan and maharashtra reflect our increasing capabilities and strategic intent to enter key high growth regions gensol engineering limited is a part of the gensol group of companies it has also established an electric vehicle manufacturing facility in pune for the development and production of electric three wheelers and four wheelers","timestamp":"2024-02-26T11:57:00+05:30","market_timestamp":"2024-02-26T11:57:00+05:30","off_market_hours":false}