{"url":"https://www.moneycontrol.com/news/business/amazon-starts-delivery-service-in-uttarakhands-remote-village-at-4500-feet-12309911.html","title":"Amazon starts delivery service in Uttarakhand's remote village at 4,500 feet","description":"According to the company, it has become the first and only e-commerce company to deliver packages to Maharishi Ashram at Gajoli, situated at 4,500 feet in the Himalayan mountain range.Amazon starts delivery service in Uttarakhand's remote village at 4,500 feet","content":"E-commerce company Amazon on Tuesday said it has started delivery service in Gajoli, a remote village in Uttarkashi district of Uttarakhand. According to the company, it has become the first and only e-commerce company to deliver packages to Maharishi Ashram at Gajoli, situated at 4,500 feet in the Himalayan mountain range. There are no shops or delivery options in and around the Ashram area. It is not only difficult but also time-consuming to deliver orders at this place, the company said. \"Over the last few years, we have significantly ramped up our infrastructure and delivery technology across all three miles, building a fast, safe, and resilient network to serve the varied needs of our customers, reaching the remotest corners of the country,\" Karuna Shankar Pande, Director, Amazon Logistics, Amazon India, said. ","cleaned_content":"e commerce company amazon on tuesday said it has started delivery service in gajoli a remote village in uttarkashi district of uttarakhand according to the company it has become the first and only e commerce company to deliver packages to maharishi ashram at gajoli situated at \u003cFOUR_THOUSAND\u003e feet in the himalayan mountain range there are no shops or delivery options in and around the ashram area it is not only difficult but also time consuming to deliver orders at this place the company said over the last few years we have significantly ramped up our infrastructure and delivery technology across all three miles building a fast safe and resilient network to serve the varied needs of our customers reaching the remotest corners of the country karuna shankar pande director amazon logistics amazon india said","timestamp":"2024-02-20T12:16:00+05:30","market_timestamp":"2024-02-20T12:16:00+05:30","off_market_hours":false}