{"url":"https://www.moneycontrol.com/news/business/allcargo-supply-chain-aims-to-add-3-million-sq-ft-of-warehousing-space-in-2-3-years-12351891.html","title":"Allcargo Supply Chain aims to add 3 million sq ft of warehousing space in 2-3 years","description":"Currently operating with 6 million sq ft of space, the company said in the initial phase of expansion, it plans to begin from the north and south regions.Allcargo Supply Chain aims to add 3 million sq ft of warehousing space in 2-3 years","content":"Allcargo Group's logistics arm Allcargo Supply Chain Private Limited (ASPL) on Monday said it aims to add a 3 million square feet of warehousing space in the next two-three years as part of its expansion plan. Currently operating with 6 million sq ft of space, the company said in the initial phase of expansion, it plans to begin from the north and south regions. ASPL has warehouses spread across more than 80 locations in India. These warehouses will cater to all sectors, with ASPL's client distribution comprising 25 per cent from the chemical sector, 30 per cent from e-commerce, 25 per cent from auto engineering, and 15 per cent from other verticals, it said. \"Our expansion plan is not just about increasing square footage; it's about strengthening our capabilities to better serve our clients. \"With modern infrastructure and advanced Warehouse Management Systems (WMS), our warehouses will optimize the process of moving and storing goods while adhering to all required compliances,\" said Sushil Rathi, Director at ASPL. ASPL has more than 27 multi-user chemical warehouses, serving over 70 companies. It has recently set up a Grade A chemical warehousing facility at its facility in Navi Mumbai. ","cleaned_content":"allcargo groups logistics arm allcargo supply chain private limited aspl on monday said it aims to add a \u003cTHREE_\u003e million square feet of warehousing space in the next two three years as part of its expansion plan currently operating with \u003cSIX_\u003e million sq ft of space the company said in the initial phase of expansion it plans to begin from the north and south regions aspl has warehouses spread across more than \u003cEIGHT_TEN\u003e locations in india these warehouses will cater to all sectors with aspls client distribution comprising \u003cTWO_TEN_PERCENT\u003e from the chemical sector \u003cTHREE_TEN_PERCENT\u003e from e commerce \u003cTWO_TEN_PERCENT\u003e from auto engineering and \u003cONE_TEN_PERCENT\u003e from other verticals it said our expansion plan is not just about increasing square footage its about strengthening our capabilities to better serve our clients with modern infrastructure and advanced warehouse management systems wms our warehouses will optimize the process of moving and storing goods while adhering to all required compliances said sushil rathi director at aspl aspl has more than \u003cTWO_TEN\u003e multi user chemical warehouses serving over \u003cSEVEN_TEN\u003e companies it has recently set up a grade a chemical warehousing facility at its facility in navi mumbai","timestamp":"2024-02-26T14:34:00+05:30","market_timestamp":"2024-02-26T14:34:00+05:30","off_market_hours":false}