{"url":"https://www.moneycontrol.com/news/business/economy/indian-hotel-industry-to-report-7-to-9-revenue-growth-in-fy25-icra-12351501.html","title":"Indian hotel industry to report 7 to 9% revenue growth in FY25: ICRA","description":"ICRA said that sustenance of domestic leisure travel, demand for meetings, incentives, conference and exhibitions (MICE) are the factors which will drive demand in the next financial year, despite a temporary lull during the ensuing general elections.Indian hotel industry to report 7 to 9% revenue growth in FY25: ICRA","content":"The Indian hotel industry is expected to register a revenue growth of seven to nine per cent in the next financial year 2024-25, according to a report by credit rating firm ICRA. ICRA said that sustenance of domestic leisure travel, demand for meetings, incentives, conference and exhibitions (MICE) are the factors which will drive demand in the next financial year, despite a temporary lull during the ensuing general elections. The research firm said that spiritual tourism and Tier 2 cities are expected to contribute meaningfully to the overall demand in the next fiscal. Pan-India, average room rates (ARRs) are expected to be around Rs 7,200 to Rs 7,400 in the current fiscal, which is likely to rise further to Rs 7,800 to Rs 8,000 in the next financial year. ICRA holds a positive outlook for the Indian hospitality industry with improvements in credit ratings, the report said. The demand uptick resulted in a pickup in supply announcements and commencement of deferred projects in the last 18 to 24 months, however, adding that supply would lag demand. ","cleaned_content":"the indian hotel industry is expected to register a revenue growth of seven to nine per cent in the next financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e according to a report by credit rating firm icra icra said that sustenance of domestic leisure travel demand for meetings incentives conference and exhibitions mice are the factors which will drive demand in the next financial year despite a temporary lull during the ensuing general elections the research firm said that spiritual tourism and tier \u003cTWO_\u003e cities are expected to contribute meaningfully to the overall demand in the next fiscal pan india average room rates arrs are expected to be around rs \u003cSEVEN_THOUSAND\u003e to rs \u003cSEVEN_THOUSAND\u003e in the current fiscal which is likely to rise further to rs \u003cSEVEN_THOUSAND\u003e to rs \u003cEIGHT_THOUSAND\u003e in the next financial year icra holds a positive outlook for the indian hospitality industry with improvements in credit ratings the report said the demand uptick resulted in a pickup in supply announcements and commencement of deferred projects in the last \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e months however adding that supply would lag demand","timestamp":"2024-02-26T13:37:00+05:30","market_timestamp":"2024-02-26T13:37:00+05:30","off_market_hours":false}