{"url":"https://www.moneycontrol.com/news/business/companies/india-has-great-growth-potential-will-find-another-opportunity-post-zee-merger-collapse-sony-12290891.html","title":"India has great growth potential, will find another opportunity post Zee merger collapse: Sony","description":"In an earnings call, Hiroki Totoki, president, COO \u0026 CFO of Sony said India is a very appealing market where it would continue to invest. Sony Group Corporation (SGC) had said ZEEL did not satisfy the merger conditions Related stories","content":"With the proposed merger of its Indian arm with Zee terminated, Sony will seek various options, including finding another opportunity to replace the plan and organic growth opportunities in India, which has great potential in the long term, according to a top company official. In an earnings call, Hiroki Totoki, president, COO \u0026 CFO of Sony said India is a very appealing market where it would continue to invest. \"India, on a long-term basis, has a great growth potential. It's a very appealing market. Therefore, we will try to seek various opportunities and if we can find another opportunity that would replace this type of plan,\" Totoki said when asked about the company's strategy in India after the termination of the proposed merger. The earnings call was held on February 14. As per the merger conditions, which was agreed upon between Sony and ZEEL, the Japanese giant was also supposed to invest $1.5 billion in the merged entity. The group will also continue to pursue organic growth as per its strategy in India, where it operates through Culver Max Entertainment (earlier known as Sony Pictures Network India), he said in the investors call. Sony had last month terminated an agreement with ZEEL to merge its two Indian entities — Culver Max Entertainment and Bangla Entertainment Private Limited (BEPL) — with ZEEL. Sony Group Corporation (SGC) had said ZEEL did not satisfy the merger conditions and initiated arbitration proceedings before SIAC claiming $90 million (around Rs 748.5 crore) as a termination fee. ZEEL filed a petition before the National Company Law Tribunal (NCLT), seeking a direction to Sony Group to implement the merger scheme. On February 4, the Singapore International Arbitration Center (SIAC) denied Sony Group's interim plea to restrain ZEEL from moving NCLT for enforcing the failed merger. The Mumbai bench of NCLT has already issued notice to Sony over a petition filed in this regard. The NCLT had on August 10, 2023, approved the scheme of merger, which could have created a USD 10 billion media entity. If the merger was completed, the combined entity would have owned over 70 TV channels, two video streaming services — ZEE5 and Sony LIV — and two film studios — Zee Studios and Sony Pictures Films India– making it the largest entertainment network in the country. Sony Pictures Network India (SPNI), which is an indirect wholly-owned subsidiary of Sony Group Corporation, Japan, owns 26 channels that operate in Hindi and several other languages having a viewership of over 700 million. Besides, it has one OTT platform Sony LIV on which it streams live sports, movies, short films and its original and archival content. It has around 33 million viewers. The company recorded a revenue of Rs 6,684 crore for FY23. ","cleaned_content":"with the proposed merger of its indian arm with zee terminated sony will seek various options including finding another opportunity to replace the plan and organic growth opportunities in india which has great potential in the long term according to a top company official in an earnings call hiroki totoki president coo cfo of sony said india is a very appealing market where it would continue to invest india on a long term basis has a great growth potential its a very appealing market therefore we will try to seek various opportunities and if we can find another opportunity that would replace this type of plan totoki said when asked about the companys strategy in india after the termination of the proposed merger the earnings call was held on february \u003cONE_TEN\u003e as per the merger conditions which was agreed upon between sony and zeel the japanese giant was also supposed to invest \u003cONE_\u003e billion in the merged entity the group will also continue to pursue organic growth as per its strategy in india where it operates through culver max entertainment earlier known as sony pictures network india he said in the investors call sony had last month terminated an agreement with zeel to merge its two indian entities culver max entertainment and bangla entertainment private limited bepl with zeel sony group corporation sgc had said zeel did not satisfy the merger conditions and initiated arbitration proceedings before siac claiming \u003cNINE_TEN\u003e million around rs \u003cSEVEN_HUNDRED\u003e crore as a termination fee zeel filed a petition before the national company law tribunal nclt seeking a direction to sony group to implement the merger scheme on february \u003cFOUR_\u003e the singapore international arbitration center siac denied sony groups interim plea to restrain zeel from moving nclt for enforcing the failed merger the mumbai bench of nclt has already issued notice to sony over a petition filed in this regard the nclt had on august \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e approved the scheme of merger which could have created a usd \u003cONE_TEN\u003e billion media entity if the merger was completed the combined entity would have owned over \u003cSEVEN_TEN\u003e tv channels two video streaming services zee5 and sony liv and two film studios zee studios and sony pictures films india making it the largest entertainment network in the country sony pictures network india spni which is an indirect wholly owned subsidiary of sony group corporation japan owns \u003cTWO_TEN\u003e channels that operate in hindi and several other languages having a viewership of over \u003cSEVEN_HUNDRED\u003e million besides it has one ott platform sony liv on which it streams live sports movies short films and its original and archival content it has around \u003cTHREE_TEN\u003e million viewers the company recorded a revenue of rs \u003cSIX_THOUSAND\u003e crore for fy23","timestamp":"2024-02-16T15:44:00+05:30","market_timestamp":"2024-02-19T09:15:00+05:30","off_market_hours":true}