{"url":"https://www.moneycontrol.com/news/business/suzlon-bags-30-mw-wind-power-project-from-edf-renewables-12376111.html","title":"Suzlon bags 30 MW wind power project from EDF Renewables","description":"As part of the order, Suzlon will install 10 Wind Turbine Generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3 MW each in Gujarat, a company statement said.Suzlon bags 30 MW wind power project from EDF Renewables","content":"Renewable energy solutions provider Suzlon on Thursday said it has bagged an order for a 30 MW wind power energy project from EDF Renewables. As part of the order, Suzlon will install 10 Wind Turbine Generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3 MW each in Gujarat, a company statement said. Suzlon will execute the project with a scope of supply, supervision, commissioning, post-commissioning and maintenance services, the statement said. Arne Lorenzen, Chief Executive Officer, EDF Renewables India said, \"We look forward to leveraging Suzlon's extensive experience in the Indian wind market to make this project successful. We want to operate and expand our clean energy portfolio in India in the years to come.\" Electricity generated from the project will be supplied to Gujarat Urja Vikas Nigam Ltd (GUVNL). The project is expected to provide electricity to over 24 thousand households and curb over 97 thousand tonnes of CO2 emissions every year. ","cleaned_content":"renewable energy solutions provider suzlon on thursday said it has bagged an order for a \u003cTHREE_TEN\u003e mw wind power energy project from edf renewables as part of the order suzlon will install \u003cONE_TEN\u003e wind turbine generators wtgs with a hybrid lattice tubular hlt tower and a rated capacity of \u003cTHREE_\u003e mw each in gujarat a company statement said suzlon will execute the project with a scope of supply supervision commissioning post commissioning and maintenance services the statement said arne lorenzen chief executive officer edf renewables india said we look forward to leveraging suzlons extensive experience in the indian wind market to make this project successful we want to operate and expand our clean energy portfolio in india in the years to come electricity generated from the project will be supplied to gujarat urja vikas nigam ltd guvnl the project is expected to provide electricity to over \u003cTWO_TEN\u003e thousand households and curb over \u003cNINE_TEN\u003e thousand tonnes of co2 emissions every year","timestamp":"2024-02-29T12:07:00+05:30","market_timestamp":"2024-02-29T12:07:00+05:30","off_market_hours":false}