{"url":"https://www.moneycontrol.com/news/business/stocks/why-indias-consumption-expenditure-data-is-good-news-for-investors-12352101.html","title":"Why India’s consumption expenditure data should cheer investors","description":"The data is a nascent indicator of India’s long but steady journey towards becoming a wealthier nation with implications for varied consumption categoriesIn 2024 so far, FPIs have been net sellers ($3.5 billion) and DIIs have been net buyers ($5.6 billion) of Indian stocksRelated stories","content":"Latest Household Consumption Expenditure Survey data for 2022-23 clearly elucidates the classic Engel’s Law at play in India, wherein the share of spending on food declines as income rises. Of course, higher income means increased spending on food of superior quality that costs more, but this is unlikely to reverse the overall decline of the share of food in the consumption basket.  Source: Mospi The theory can be extended to a country-wide scale and shows that countries with higher average household income see a lower proportion of income spent on food – which is measured by the Engel coefficient that reflects its economic status. A decreasing Engel coefficient usually indicates economic growth with a rising income level in the country. That should be music to the ears of anyone doing business in India and seems like a no-brainer for the fifth largest economy marching its way for the coveted third spot within a decade. Interestingly, the long-term data from 1999-00 to 2022-23 shows a compounded annual growth of over 9 percent in average monthly per capita expenditure for both rural and urban, highlighting the importance and growth potential of both the markets. Source: Mospi While the first cut data points to India taking baby steps to the path of prosperity, is it more equitable? Although the answer isn’t straightforward from average monthly expenditure data, the gap between the expenditure of top 5 percent and bottom 5 percent shows greater inequality in urban areas than rural, with significant ramification for consumption companies targeting large urban markets.  Source: Mospi Where is India spending and what are people discarding from their shopping baskets? Following copybook Engel’s law both urban and rural consumers are spending less on cereals, pulses, sugar and salt as a percentage of total expenditure. That doesn’t mean all is lost for staples companies. Within the categories, there is a subtle but sure shift towards premium products. For instance, in both rural and urban areas, the categories that are maintaining or improving share are milk and milk products, fruits, proteins (egg, fish \u0026 meat) as well as processed food. Source: Mospi The change in consumption basket spells good news for the organized food companies. There seems to be a common theme on where India wants to put its incremental expenditure. Both rural and urban have strong inclination for spending on addiction items such as pan, tobacco and intoxicants, toilet articles and other consumables, conveyance and durable goods. Overall, discretionary categories are leading from the front in urban areas and are also making their presence felt in rural. In the equity markets, companies focused on discretionary consumption/premiumization have done well and should only do better as the country travels the path of becoming a middle-income nation.  Source: Mospi Which Indian states look promising from a consumption demand viewpoint? Finally, a word on the state-level data shows Chandigarh as the most promising urban market and Sikkim the wealthiest rural market. Chattisgarh is at the bottom, for both. Going strictly by the expenditure data, the size of average urban expenditure is 1.7x that of rural for the country as a whole.  However, the skew of expenditure in favour of urban is more in states like Meghalaya, Chattisgarh, Assam, Odisha, Gujarat and Karnataka. Overall, the data is a nascent indicator of India’s long but steady journey towards becoming a wealthier nation with implications for varied consumption categories, companies that are likely to lead from the front in this journey and how investors should participate in this growth story.  ","cleaned_content":"latest household consumption expenditure survey data for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e clearly elucidates the classic engel s law at play in india wherein the share of spending on food declines as income rises of course higher income means increased spending on food of superior quality that costs more but this is unlikely to reverse the overall decline of the share of food in the consumption basket source mospi the theory can be extended to a country wide scale and shows that countries with higher average household income see a lower proportion of income spent on food which is measured by the engel coefficient that reflects its economic status a decreasing engel coefficient usually indicates economic growth with a rising income level in the country that should be music to the ears of anyone doing business in india and seems like a no brainer for the fifth largest economy marching its way for the coveted third spot within a decade interestingly the long term data from \u003cONE_THOUSAND\u003e \u003cZERO_\u003e to \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e shows a compounded annual growth of over \u003cNINE_PERCENT\u003e in average monthly per capita expenditure for both rural and urban highlighting the importance and growth potential of both the markets source mospi while the first cut data points to india taking baby steps to the path of prosperity is it more equitable although the answer isn t straightforward from average monthly expenditure data the gap between the expenditure of top \u003cFIVE_PERCENT\u003e and bottom \u003cFIVE_PERCENT\u003e shows greater inequality in urban areas than rural with significant ramification for consumption companies targeting large urban markets source mospi where is india spending and what are people discarding from their shopping baskets following copybook engel s law both urban and rural consumers are spending less on cereals pulses sugar and salt as a percentage of total expenditure that doesn t mean all is lost for staples companies within the categories there is a subtle but sure shift towards premium products for instance in both rural and urban areas the categories that are maintaining or improving share are milk and milk products fruits proteins egg fish meat as well as processed food source mospi the change in consumption basket spells good news for the organized food companies there seems to be a common theme on where india wants to put its incremental expenditure both rural and urban have strong inclination for spending on addiction items such as pan tobacco and intoxicants toilet articles and other consumables conveyance and durable goods overall discretionary categories are leading from the front in urban areas and are also making their presence felt in rural in the equity markets companies focused on discretionary consumption premiumization have done well and should only do better as the country travels the path of becoming a middle income nation source mospi which indian states look promising from a consumption demand viewpoint finally a word on the state level data shows chandigarh as the most promising urban market and sikkim the wealthiest rural market chattisgarh is at the bottom for both going strictly by the expenditure data the size of average urban expenditure is \u003cONE_\u003e x that of rural for the country as a whole however the skew of expenditure in favour of urban is more in states like meghalaya chattisgarh assam odisha gujarat and karnataka overall the data is a nascent indicator of india s long but steady journey towards becoming a wealthier nation with implications for varied consumption categories companies that are likely to lead from the front in this journey and how investors should participate in this growth story","timestamp":"2024-02-27T15:05:00+05:30","market_timestamp":"2024-02-27T15:05:00+05:30","off_market_hours":false}