{"url":"https://www.moneycontrol.com/news/business/serum-boosts-supply-of-cervical-cancer-shots-ahead-of-governments-mass-drive-12395231.html","title":"Serum boosts supply of cervical cancer shots ahead of government's mass drive","description":"Adar Poonawalla, the CEO of the world's biggest vaccine maker by the number of doses, told Reuters that he expects the vaccine to be a part of the government's programme by year-end.Serum boosts supply of cervical cancer shots ahead of government's mass driveRelated stories","content":"Serum Institute of India aims to significantly boost supply of its human papillomavirus (HPV) vaccine as it gears up to provide its shots to the government at cheaper rates for an immunisation campaign this year against the cancer-causing virus. Adar Poonawalla, the CEO of the world's biggest vaccine maker by the number of doses, told Reuters that he expects the vaccine to be a part of the government's programme by year-end. The vaccine, currently available in the private market for 2,000 rupees ($24.13), is India's first indigenous shot against HPV that plays a role in causing most cervical cancers in the world. The government is set to administer the HPV vaccine to girls aged between nine and 14 years as part of a campaign to fight cervical cancer, the second-most common type of cancer in women in India. There is no contract yet with the government, Poonawalla said, adding that he expects the authorities to initially procure between 40 to 50 million doses through a tender process in December. Other HPV vaccine makers include Merck \u0026 Co and GSK Plc, who could also bid for government contracts. \"It's still a bit early to say but we're just poised and very committed to this product,\" he said. Poonawalla expects the vaccine to be \"substantially, probably eight times, cheaper\" when supplied to the government. Serum produces AstraZeneca's COVID-19 vaccine under the brand name Covishield in India. The company's HPV facilities, which were used during the pandemic to manufacture Covishield are still not entirely operational, restraining full capacity, according to Serum. The company is in the process of applying for WHO's pre-qualification and Poonawalla expects to begin exporting the HPV shots to other countries in 2026. ","cleaned_content":"serum institute of india aims to significantly boost supply of its human papillomavirus hpv vaccine as it gears up to provide its shots to the government at cheaper rates for an immunisation campaign this year against the cancer causing virus adar poonawalla the ceo of the worlds biggest vaccine maker by the number of doses told reuters that he expects the vaccine to be a part of the governments programme by year end the vaccine currently available in the private market for \u003cTWO_THOUSAND\u003e rupees \u003cTWO_TEN\u003e is indias first indigenous shot against hpv that plays a role in causing most cervical cancers in the world the government is set to administer the hpv vaccine to girls aged between nine and \u003cONE_TEN\u003e years as part of a campaign to fight cervical cancer the second most common type of cancer in women in india there is no contract yet with the government poonawalla said adding that he expects the authorities to initially procure between \u003cFOUR_TEN\u003e to \u003cFIVE_TEN\u003e million doses through a tender process in december other hpv vaccine makers include merck co and gsk plc who could also bid for government contracts its still a bit early to say but were just poised and very committed to this product he said poonawalla expects the vaccine to be substantially probably eight times cheaper when supplied to the government serum produces astrazenecas covid \u003cONE_TEN\u003e vaccine under the brand name covishield in india the companys hpv facilities which were used during the pandemic to manufacture covishield are still not entirely operational restraining full capacity according to serum the company is in the process of applying for whos pre qualification and poonawalla expects to begin exporting the hpv shots to other countries in \u003cTWO_THOUSAND\u003e","timestamp":"2024-03-04T07:47:00+05:30","market_timestamp":"2024-03-04T09:15:00+05:30","off_market_hours":true}