{"url":"https://www.moneycontrol.com/news/business/top-india-airlines-optimistic-on-deliveries-despite-supply-woes-12373961.html","title":"Top India Airlines optimistic on deliveries despite supply woes","description":"IndiGo, which has a backlog of almost 1,000 single-aisle Airbus jets, is predicting it will take one new plane each week and is implementing measures to mitigate disruptions. Top India Airlines optimistic on deliveries despite supply woesRelated stories","content":"India’s top airlines, Air India Ltd. and IndiGo, said their short-term expansion plans remain on track as they sidestep the lingering supply-chain snarls that have rattled the global aviation industry. Both carriers have bet big on a travel boom in India, laying out ambitious fleet expansion plans over the past year. In June, IndiGo placed a record-breaking order with Airbus SE for 500 narrowbody aircraft, to be delivered between 2030 and 2035. And Air India has 470 aircraft on order with Airbus and Boeing Co. But like airlines around the world, they’re now grappling with a series of supply chain headaches that risk further delaying aircraft deliveries, paring back flight schedules and hindering the industry’s post-Covid recovery. Top executives at the Indian carriers say they’re able to plug potential capacity gaps with a raft of measures including taking delivery of aircraft initially destined for other firms and even flying rivals’ jets. Some of the planes it has on order were produced for other carriers that were then unable to take delivery, he said. The airline will continue to add a new aircraft every six days into next year and it’s not until toward the end of 2025 that there may be some “production risk” for aircraft, Wilson said. IndiGo, which has a backlog of almost 1,000 single-aisle Airbus jets, is predicting it will take one new plane each week and is implementing measures to mitigate disruptions. “We have been able to live up to our capacity guidance,” IndiGo Chief Executive Officer Pieter Elbers said in an interview in Singapore. IndiGo is supplementing the supply of new jets with the extension of plane leases and using wet leases — the practice of leasing an aircraft, along with crew to fly the plane and provide service onboard, he said. IndiGo has around 70 aircraft grounded due to the ongoing issues with Pratt \u0026 Whitney GTF engines, Chief Financial Officer Gaurav Negi said earlier this month. The carrier is discussing compensation with the firm’s RTX Corp. unit, Elbers said. ","cleaned_content":"india s top airlines air india ltd and indigo said their short term expansion plans remain on track as they sidestep the lingering supply chain snarls that have rattled the global aviation industry both carriers have bet big on a travel boom in india laying out ambitious fleet expansion plans over the past year in june indigo placed a record breaking order with airbus se for \u003cFIVE_HUNDRED\u003e narrowbody aircraft to be delivered between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e and air india has \u003cFOUR_HUNDRED\u003e aircraft on order with airbus and boeing co but like airlines around the world they re now grappling with a series of supply chain headaches that risk further delaying aircraft deliveries paring back flight schedules and hindering the industry s post covid recovery top executives at the indian carriers say they re able to plug potential capacity gaps with a raft of measures including taking delivery of aircraft initially destined for other firms and even flying rivals jets some of the planes it has on order were produced for other carriers that were then unable to take delivery he said the airline will continue to add a new aircraft every six days into next year and it s not until toward the end of \u003cTWO_THOUSAND\u003e that there may be some production risk for aircraft wilson said indigo which has a backlog of almost \u003cONE_THOUSAND\u003e single aisle airbus jets is predicting it will take one new plane each week and is implementing measures to mitigate disruptions we have been able to live up to our capacity guidance indigo chief executive officer pieter elbers said in an interview in singapore indigo is supplementing the supply of new jets with the extension of plane leases and using wet leases the practice of leasing an aircraft along with crew to fly the plane and provide service onboard he said indigo has around \u003cSEVEN_TEN\u003e aircraft grounded due to the ongoing issues with pratt whitney gtf engines chief financial officer gaurav negi said earlier this month the carrier is discussing compensation with the firm s rtx corp unit elbers said","timestamp":"2024-02-29T07:03:00+05:30","market_timestamp":"2024-02-29T09:15:00+05:30","off_market_hours":true}