{"url":"https://www.moneycontrol.com/news/business/adani-green-energy-gives-initial-guidance-for-18-year-dollar-bonds-bankers-say-12396671.html","title":"Adani Green Energy gives initial guidance for 18-year dollar bonds, bankers say","description":"This will be the Adani group's first dollar-denominated bond issue after a report by U.S. short-seller Hindenburg Research in January 2023 led to a sell-off in stocks and overseas-listed bonds of Adani group companies.Adani Green Energy gives initial guidance for 18-year dollar bonds, bankers say","content":"Adani Green Energy is planning to raise funds through U.S. dollar-denominated 18-year bonds, and has provided initial guidance of raising $409 million for a coupon of around 7.1250%, two bankers said on Monday. This will be the Adani group's first dollar-denominated bond issue after a report by U.S. short-seller Hindenburg Research in January 2023 led to a sell-off in stocks and overseas-listed bonds of Adani group companies. The rout forced the company to retreat from the foreign currency bond market and led to a buyback of $315 million of listed overseas debt securities. The issuer has appointed Barclays, DBS Bank, Deutsche Bank, Emirates NBD Bank, First Abu Dhabi Bank, ING Bank, IMI-Intesa Sanpaolo, MUFG Securities Asia, Mizuho Securities (Singapore), SMBC Nikko Securities, Societe Generale, QNB Capital, Standard Chartered Bank and State Bank of India's London branch as joint bookrunners. The bonds will be rated 'Ba1' by Moody's Investor Service and 'BBB-' by Fitch Ratings. ","cleaned_content":"adani green energy is planning to raise funds through u s dollar denominated \u003cONE_TEN\u003e year bonds and has provided initial guidance of raising \u003cFOUR_HUNDRED\u003e million for a coupon of around \u003cSEVEN_PERCENT\u003e two bankers said on monday this will be the adani groups first dollar denominated bond issue after a report by u s short seller hindenburg research in january \u003cTWO_THOUSAND\u003e led to a sell off in stocks and overseas listed bonds of adani group companies the rout forced the company to retreat from the foreign currency bond market and led to a buyback of \u003cTHREE_HUNDRED\u003e million of listed overseas debt securities the issuer has appointed barclays dbs bank deutsche bank emirates nbd bank first abu dhabi bank ing bank imi intesa sanpaolo mufg securities asia mizuho securities singapore smbc nikko securities societe generale qnb capital standard chartered bank and state bank of indias london branch as joint bookrunners the bonds will be rated ba1 by moodys investor service and bbb by fitch ratings","timestamp":"2024-03-04T10:10:00+05:30","market_timestamp":"2024-03-04T10:10:00+05:30","off_market_hours":false}