{"url":"https://www.moneycontrol.com/news/business/kedaara-close-to-raising-1-7-billion-for-indias-biggest-pe-fund-12369741.html","title":"Kedaara close to raising $1.7 billion for India's biggest PE fund","description":"The latest fund will be Kedaara's fourth and will be 54% larger than its previous one in 2021.Kedaara close to raising $1.7 billion for India's biggest PE fundRelated stories","content":"Kedaara Capital is set to raise $1.7 billion for what would be India's biggest-ever private equity fund, two people with direct knowledge of the matter said, highlighting huge interest in the country's fast-growing economy amid a shift away from China. The latest fund will be Kedaara's fourth and will be 54% larger than its previous one in 2021. The plans come as India's stock markets are trading at record highs. While there have only been a handful of significant India-specific PE funds to date, they are growing in size. Kedaara, founded in 2011 by former Temasek and General Atlantic executives, is one of India's best-known buyout funds. They declined to be identified as the discussions were private. Kedaara declined to comment. Cleveland Clinic and the University of Minnesota did not respond to queries seeking comment. The fund will likely invest in sectors such as banking, healthcare, consumer and software and it will seek both minority stakes and buyout deals, the sources said. Kedaara plans to announce the fund by the end of March and is currently finalising documentation with its investors, they added. According to one of the sources, investors were interested in committing more than $2 billion to the new fund, but Kedaara decided to cap it at around $1.7 billion so as not to strain their ability to deploy. Investors in Kedaara's previous funds include Canada's Ontario Teachers Pension Plan, Singapore state investor Temasek and the International Finance Corporation, Pitchbook data shows. India has been benefiting from increased interest as Western firms look to diversify away from China amid heightened trade and economic tensions between Washington and Beijing. Last year, India's share of Asia-Pacific private equity deals grew to 23% while China's fell to a nine-year low of 31%, consultancy firm Bain said in a report. Kedaara's three previous funds raised a combined $2.4 billion between 2011 and 2021 which was invested in 27 Indian companies including SoftBank-backed eyewear-maker Lenskart and Mahindra Logistics. Kedaara has sold stakes in companies fairly regularly, generating good profits to return money to investors - a key performance metric, one of the sources said. Last year, Kedaara sold its remaining stake in Mahindra Logistics in the stock market for a total return of 3.5 times its investment. ","cleaned_content":"kedaara capital is set to raise \u003cONE_\u003e billion for what would be indias biggest ever private equity fund two people with direct knowledge of the matter said highlighting huge interest in the countrys fast growing economy amid a shift away from china the latest fund will be kedaaras fourth and will be \u003cFIVE_TEN_PERCENT\u003e larger than its previous one in \u003cTWO_THOUSAND\u003e the plans come as indias stock markets are trading at record highs while there have only been a handful of significant india specific pe funds to date they are growing in size kedaara founded in \u003cTWO_THOUSAND\u003e by former temasek and general atlantic executives is one of indias best known buyout funds they declined to be identified as the discussions were private kedaara declined to comment cleveland clinic and the university of minnesota did not respond to queries seeking comment the fund will likely invest in sectors such as banking healthcare consumer and software and it will seek both minority stakes and buyout deals the sources said kedaara plans to announce the fund by the end of march and is currently finalising documentation with its investors they added according to one of the sources investors were interested in committing more than \u003cTWO_\u003e billion to the new fund but kedaara decided to cap it at around \u003cONE_\u003e billion so as not to strain their ability to deploy investors in kedaaras previous funds include canadas ontario teachers pension plan singapore state investor temasek and the international finance corporation pitchbook data shows india has been benefiting from increased interest as western firms look to diversify away from china amid heightened trade and economic tensions between washington and beijing last year indias share of asia pacific private equity deals grew to \u003cTWO_TEN_PERCENT\u003e while chinas fell to a nine year low of \u003cTHREE_TEN_PERCENT\u003e consultancy firm bain said in a report kedaaras three previous funds raised a combined \u003cTWO_\u003e billion between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e which was invested in \u003cTWO_TEN\u003e indian companies including softbank backed eyewear maker lenskart and mahindra logistics kedaara has sold stakes in companies fairly regularly generating good profits to return money to investors a key performance metric one of the sources said last year kedaara sold its remaining stake in mahindra logistics in the stock market for a total return of \u003cTHREE_\u003e times its investment","timestamp":"2024-02-28T12:47:00+05:30","market_timestamp":"2024-02-28T12:47:00+05:30","off_market_hours":false}