{"url":"https://www.moneycontrol.com/news/business/expect-faster-adoption-of-evs-in-luxury-car-segment-volvo-12369981.html","title":"Expect faster adoption of EVs in luxury car segment: Volvo","description":"The company further said EVs may account for one-third of its total car sales in India this year.Expect faster adoption of EVs in luxury car segment: VolvoRelated stories","content":"Swedish premium car maker Volvo on Tuesday said it is expecting a faster adoption of Electric Vehicles (EVs) in the luxury car segment within the overall passenger vehicle division in the country. The company further said EVs may account for one-third of its total car sales in India this year. \"The EV penetration in the overall passenger vehicle segment is nothing, about 2 per cent, while in the luxury segment it is 7 per cent. So, adoption of EVs in the luxury segment will be faster,\" Volvo Car India Managing Director Jyoti Malhotra said. In 2023, Volvo Car India retailed 2,423 cars, while 690 of them were EVs. The company plans to introduce its two fully electric cars -- EX30 and EX90 -- in the domestic market next year. Volvo Car has said it is planning to be an all-electric vehicle company globally by 2030. \"I would say 2023 was a good year for us from an overall volume perspective with a growth of almost 31 per cent, which is good in the sense that we were the fastest within the Asia Pacific,\" Malhotra said. The more heartening thing is the growth that Volvo Car India saw in the adoption of EVs, he said. \"For us, we are selling more EVs and our ICE (Internal Combustion Engine) products are made to order. (As much as) 30-35 per cent of new customers are for electric cars,\" he said. The company is selling its EVs through online direct sales, and plans on selling its ICE and hybrid products also online. With the newly launched C40, the company has witnessed a younger customer profile. He also said the company is selling EVs directly to consumers but added that dealers also play a very important role. \"It is a different structure that we have with them,\" he added. On a recent fire incident in a Volvo electric car, he said though it is \"rare of the rarest\" incidents, an investigation is underway. ","cleaned_content":"swedish premium car maker volvo on tuesday said it is expecting a faster adoption of electric vehicles evs in the luxury car segment within the overall passenger vehicle division in the country the company further said evs may account for one third of its total car sales in india this year the ev penetration in the overall passenger vehicle segment is nothing about \u003cTWO_PERCENT\u003e while in the luxury segment it is \u003cSEVEN_PERCENT\u003e so adoption of evs in the luxury segment will be faster volvo car india managing director jyoti malhotra said in \u003cTWO_THOUSAND\u003e volvo car india retailed \u003cTWO_THOUSAND\u003e cars while \u003cSIX_HUNDRED\u003e of them were evs the company plans to introduce its two fully electric cars ex30 and ex90 in the domestic market next year volvo car has said it is planning to be an all electric vehicle company globally by \u003cTWO_THOUSAND\u003e i would say \u003cTWO_THOUSAND\u003e was a good year for us from an overall volume perspective with a growth of almost \u003cTHREE_TEN_PERCENT\u003e which is good in the sense that we were the fastest within the asia pacific malhotra said the more heartening thing is the growth that volvo car india saw in the adoption of evs he said for us we are selling more evs and our ice internal combustion engine products are made to order as much as \u003cTHREE_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e of new customers are for electric cars he said the company is selling its evs through online direct sales and plans on selling its ice and hybrid products also online with the newly launched c40 the company has witnessed a younger customer profile he also said the company is selling evs directly to consumers but added that dealers also play a very important role it is a different structure that we have with them he added on a recent fire incident in a volvo electric car he said though it is rare of the rarest incidents an investigation is underway","timestamp":"2024-02-28T13:10:00+05:30","market_timestamp":"2024-02-28T13:10:00+05:30","off_market_hours":false}