{"url":"https://www.moneycontrol.com/news/business/google-walmart-gain-india-fintech-users-after-paytm-curbs-12411561.html","title":"Google, Walmart gain India fintech users after paytm curbs","description":"The value of Paytm payments made on India’s state-backed transactions system fell 14% to 1.65 trillion rupees ($19.9 billion) from January, the National Payments Council of India said on its website Wednesday.Google, Walmart gain India fintech users after paytm curbsRelated stories","content":"Google and Walmart Inc. are rapidly gaining customers from India’s Paytm, the fintech pioneer struggling to navigate central bank restrictions and the potential shutdown of a key payments affiliate. The value of Paytm payments made on India’s state-backed transactions system fell 14% to 1.65 trillion rupees ($19.9 billion) from January, the National Payments Council of India said on its website Wednesday. Walmart-owned PhonePe and Google’s GPay, which both process far more payments than No. 3 Paytm, each had an increase in their payments value. Paytm’s decline suggests consumers are moving usage to alternative services even before any disruption to its systems. The new curbs affecting Paytm are kicking in on March 15, and even after that the company expects its digital payments services to keep running as before. Yet the firm’s stock has slumped since the regulator unveiled its action in late January, on concern the restrictions will crimp the fintech pioneer’s prospects. Companies don’t make any money on transactions on the state-backed system, called Unified Payments Interface, but it provides them with a massive catchment of hundreds of millions of consumers to whom they can cross-sell services such as insurance and mutual funds. The Reserve Bank of India on Jan. 31 ordered Paytm Payments Bank — which isn’t controlled by Paytm but which processes much of its payments and financial services — to halt much of its business. Though Paytm has quickly pulled together other bank partnerships to stay in business, the regulator’s move triggered a sharp slide in its stock and hit customer sentiment. Shares in Paytm are dow almost 50% since late January. In his first public comments after the RBI action, Paytm’s billionaire founder Vijay Shekhar Sharma this week voiced confidence that his digital payments company will overcome the regulatory setbacks and stage a comeback as a stronger company. Both Paytm Payments Bank and Paytm, which is traded as One97 Communications Ltd., are part of Sharma’s fintech empire but the bank isn’t listed. Sharma owns 51% of the bank, with One97 holding the remainder. PhonePe and GPay have typically been far ahead of Paytm in UPI transactions by value and volume even before Paytm’s affiliate bank was hit by the curbs. ","cleaned_content":"google and walmart inc are rapidly gaining customers from india s paytm the fintech pioneer struggling to navigate central bank restrictions and the potential shutdown of a key payments affiliate the value of paytm payments made on india s state backed transactions system fell \u003cONE_TEN_PERCENT\u003e to \u003cONE_\u003e trillion rupees \u003cONE_TEN\u003e billion from january the national payments council of india said on its website wednesday walmart owned phonepe and google s gpay which both process far more payments than no \u003cTHREE_\u003e paytm each had an increase in their payments value paytm s decline suggests consumers are moving usage to alternative services even before any disruption to its systems the new curbs affecting paytm are kicking in on march \u003cONE_TEN\u003e and even after that the company expects its digital payments services to keep running as before yet the firm s stock has slumped since the regulator unveiled its action in late january on concern the restrictions will crimp the fintech pioneer s prospects companies don t make any money on transactions on the state backed system called unified payments interface but it provides them with a massive catchment of hundreds of millions of consumers to whom they can cross sell services such as insurance and mutual funds the reserve bank of india on jan \u003cTHREE_TEN\u003e ordered paytm payments bank which isn t controlled by paytm but which processes much of its payments and financial services to halt much of its business though paytm has quickly pulled together other bank partnerships to stay in business the regulator s move triggered a sharp slide in its stock and hit customer sentiment shares in paytm are dow almost \u003cFIVE_TEN_PERCENT\u003e since late january in his first public comments after the rbi action paytm s billionaire founder vijay shekhar sharma this week voiced confidence that his digital payments company will overcome the regulatory setbacks and stage a comeback as a stronger company both paytm payments bank and paytm which is traded as one97 communications ltd are part of sharma s fintech empire but the bank isn t listed sharma owns \u003cFIVE_TEN_PERCENT\u003e of the bank with one97 holding the remainder phonepe and gpay have typically been far ahead of paytm in upi transactions by value and volume even before paytm s affiliate bank was hit by the curbs","timestamp":"2024-03-06T12:57:00+05:30","market_timestamp":"2024-03-06T12:57:00+05:30","off_market_hours":false}