{"url":"https://www.moneycontrol.com/news/business/maharashtra-to-inspect-global-fast-food-chains-after-mcdonalds-cheese-crackdown-12362391.html","title":"Maharashtra to inspect global fast-food chains after McDonald's cheese crackdown","description":"The checks threaten to cause a headache for global brands after recent inflationary pressure hit consumption of burgers and pizzas that are pricey for many Indian consumers, prompting firms to launch of discounted offerings.Maharashtra to inspect global fast-food chains after McDonald's cheese crackdownRelated stories","content":"India's western state of Maharashtra will inspect outlets of global fast-food brands to check if they use cheese alternatives in products wrongly promoted as containing real cheese, widening scrutiny beyond a crackdown on McDonald's, a top official said. The checks threaten to cause a headache for global brands after recent inflationary pressure hit consumption of burgers and pizzas that are pricey for many Indian consumers, prompting firms to launch of discounted offerings. McDonald's biggest India franchisee, Westlife Foodworld, has been defending its use of \"real cheese\" after media reported that state authorities last year found some products made use of so-called cheese analogues of vegetable oil, rather than real cheese. It renamed a \"corn and cheese burger\" as an \"American vegetarian burger\", for example. Inspectors of the state's Food and Drug Administration will now visit all McDonald's outlets, as well as those of other major brands, to check for similar violations of display and labelling rules, its chief, Abhimanyu Kale, told Reuters. \"We are planning to check all outlets of McDonald's,\" he said. \"We will also take action on other well-known and frequently visited global fast-food chain outlets,\" he added, but declined to identify the brands being targeted. Another senior state government official, who sought anonymity, said inspectors would visit Indian franchisee outlets of brands such as Domino's, Pizza Hut, Burger King and KFC. Indian state authorities have the power to suspend the licences of restaurants found to have infringed food and safety regulations in a way that misleads consumers. Westlife, which runs McDonald's in west and south India, will welcome any inspections and maintains the \"highest standards\", its managing director, Saurabh Kalra, said. Domino's franchisee Jubilant FoodWorks, Burger King operator Restaurant Brands Asia, and Devyani International, which operates Yum Brands', Pizza Hut and KFC in India, did not respond to Reuters queries. Another Pizza Hut operator, India's Sapphire Foods, declined comment. India's western state of Maharashtra is its second most populous. Home to the financial capital Mumbai and many urban cities, it is a key market for global fast-food brands. In the McDonald's case, state food inspectors suspended the licence of one outlet east of Mumbai in November for allegedly using analogues in products promoted as containing cheese. The suspension was later revoked on appeal by Westlife, the McDonald's franchisee. The company reassured many consumers online who voiced concerns about its cheese offerings, saying on social network X that it uses \"globally approved gold-standard suppliers\". \"Our cheese is made from real milk only and we do not use any substitutes or cheese analogues,\" it said on Monday. ","cleaned_content":"indias western state of maharashtra will inspect outlets of global fast food brands to check if they use cheese alternatives in products wrongly promoted as containing real cheese widening scrutiny beyond a crackdown on mcdonalds a top official said the checks threaten to cause a headache for global brands after recent inflationary pressure hit consumption of burgers and pizzas that are pricey for many indian consumers prompting firms to launch of discounted offerings mcdonalds biggest india franchisee westlife foodworld has been defending its use of real cheese after media reported that state authorities last year found some products made use of so called cheese analogues of vegetable oil rather than real cheese it renamed a corn and cheese burger as an american vegetarian burger for example inspectors of the states food and drug administration will now visit all mcdonalds outlets as well as those of other major brands to check for similar violations of display and labelling rules its chief abhimanyu kale told reuters we are planning to check all outlets of mcdonalds he said we will also take action on other well known and frequently visited global fast food chain outlets he added but declined to identify the brands being targeted another senior state government official who sought anonymity said inspectors would visit indian franchisee outlets of brands such as dominos pizza hut burger king and kfc indian state authorities have the power to suspend the licences of restaurants found to have infringed food and safety regulations in a way that misleads consumers westlife which runs mcdonalds in west and south india will welcome any inspections and maintains the highest standards its managing director saurabh kalra said dominos franchisee jubilant foodworks burger king operator restaurant brands asia and devyani international which operates yum brands pizza hut and kfc in india did not respond to reuters queries another pizza hut operator indias sapphire foods declined comment indias western state of maharashtra is its second most populous home to the financial capital mumbai and many urban cities it is a key market for global fast food brands in the mcdonalds case state food inspectors suspended the licence of one outlet east of mumbai in november for allegedly using analogues in products promoted as containing cheese the suspension was later revoked on appeal by westlife the mcdonalds franchisee the company reassured many consumers online who voiced concerns about its cheese offerings saying on social network x that it uses globally approved gold standard suppliers our cheese is made from real milk only and we do not use any substitutes or cheese analogues it said on monday","timestamp":"2024-02-27T14:08:00+05:30","market_timestamp":"2024-02-27T14:08:00+05:30","off_market_hours":false}