{"url":"https://www.moneycontrol.com/news/business/nita-ambani-likely-to-be-chair-of-indias-merged-reliance-disney-media-business-reuters-12366611.html","title":"Nita Ambani likely to be chair of India's merged Reliance-Disney media business: Reuters","description":"Reliance, controlled by the Ambani family, and Disney are closing in on signing their India media merger deal which has been in the works for months, and an announcement is likely late Wednesday, the sources said.Nita Ambani likely to be chair of India's merged Reliance-Disney media business: ReutersRelated stories","content":"Nita Ambani, wife of Indian billionaire Mukesh Ambani, is likely to be appointed chair of the board when Reliance Industries and Walt Disney merge their India media assets, two sources familiar with the plans said. Reliance, controlled by the Ambani family, and Disney are closing in on signing their India media merger deal which has been in the works for months, and an announcement is likely late Wednesday, the sources said. The plans could change ahead of an official announcement. Reliance did not respond to a request for comment, while Disney declined to comment. Nita Ambani and her family are often seen with Bollywood stars at parties they organize. She is also the founder of the Nita Mukesh Ambani Cultural Centre in Mumbai which has become a key venue for music and theatre. Reliance and Disney each have a streaming service as well as 120 television channels between them, and the deal will strengthen Reliance's hold over India's $28 billion media and entertainment market. Reuters previously reported that Reliance is likely to have a 51%-54% stake in the merged entity, a deal that will value Disney's Indian operations at just $3.5 billion, sharply lower than the $15-$16 billion estimated in 2019. Bodhi Tree, a joint venture between James Murdoch and former top Disney executive, Uday Shankar, is also set to take a stake of around 9% in the new merged entity. Disney will hold around 40%. Disney's TV and streaming business in India has struggled over the years, with its digital platform facing an exodus of users amid stiff competition with Ambani's platform over cricket streaming. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"nita ambani wife of indian billionaire mukesh ambani is likely to be appointed chair of the board when reliance industries and walt disney merge their india media assets two sources familiar with the plans said reliance controlled by the ambani family and disney are closing in on signing their india media merger deal which has been in the works for months and an announcement is likely late wednesday the sources said the plans could change ahead of an official announcement reliance did not respond to a request for comment while disney declined to comment nita ambani and her family are often seen with bollywood stars at parties they organize she is also the founder of the nita mukesh ambani cultural centre in mumbai which has become a key venue for music and theatre reliance and disney each have a streaming service as well as \u003cONE_HUNDRED\u003e television channels between them and the deal will strengthen reliances hold over indias \u003cTWO_TEN\u003e billion media and entertainment market reuters previously reported that reliance is likely to have a \u003cFIVE_TEN_PERCENT\u003e \u003cFIVE_TEN_PERCENT\u003e stake in the merged entity a deal that will value disneys indian operations at just \u003cTHREE_\u003e billion sharply lower than the \u003cONE_TEN\u003e \u003cONE_TEN\u003e billion estimated in \u003cTWO_THOUSAND\u003e bodhi tree a joint venture between james murdoch and former top disney executive uday shankar is also set to take a stake of around \u003cNINE_PERCENT\u003e in the new merged entity disney will hold around \u003cFOUR_TEN_PERCENT\u003e disneys tv and streaming business in india has struggled over the years with its digital platform facing an exodus of users amid stiff competition with ambanis platform over cricket streaming disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-02-28T08:38:00+05:30","market_timestamp":"2024-02-28T09:15:00+05:30","off_market_hours":true}