{"url":"https://www.moneycontrol.com/news/world/country-garden-faces-liquidation-petition-in-new-blow-to-china-property-sector-12367261.html","title":"Country Garden faces liquidation petition in new blow to China property sector","description":"Country Garden said in a regulatory filing to the Hong Kong Stock Exchange it would \"resolutely\" oppose the petition, which was filed by a creditor, Ever Credit Limited, a unit of Kingboard Holdings. A court hearing had been set for May 17.Country Garden faces liquidation petition in new blow to China property sectorRelated stories","content":"Country Garden Holdings said on Wednesday a liquidation petition has been filed against the embattled developer for non-payment of a loan worth $205 million, adding to the woes for China's liquidity crisis-hit property sector. Country Garden said in a regulatory filing to the Hong Kong Stock Exchange it would \"resolutely\" oppose the petition, which was filed by a creditor, Ever Credit Limited, a unit of Kingboard Holdings. A court hearing had been set for May 17. Country Garden's shares fell more than 12% in early trade, lagging a 0.2% gain for the benchmark Hang Seng Index. It comes a month after China Evergrande Group, the world's most indebted property developer with $300 billion in liabilities, was ordered to be liquidated by a Hong Kong court. It now faces a complicated restructuring process that some investors think could last more than a decade. China's property industry, a pillar of the world's second-largest economy, has lurched from one crisis to another since 2021 after a regulatory crackdown on debt-fuelled construction triggered a liquidity squeeze. A string of developers have defaulted on their repayment obligations since then, and many of them have either launched or are in the process of starting debt restructuring processes to avoid facing bankruptcy or liquidation proceedings. \"RADICAL ACTIONS\"Country Garden said would continue to \"proactively communicate and work with its offshore creditors on its restructuring plan\" as it aimed to announce terms to the market as soon as practicable. Country Garden's debt restructuring process, which gathered momentum in recent weeks, is set to be clouded by the liquidation petition. \"The radical actions of a single creditor will not have a significant impact on our company's guaranteed delivery of buildings, normal operations and the overall restructuring of overseas debts,\" Country Garden said in statement to Reuters. Investment holding company Kingboard in October became one of the first known listed companies to take legal action against Country Garden when its unit Ever Credit, which is owed HK$1.6 billion ($204 million), issued a statutory demand seeking repayment. Country Garden has appointed KPMG and law firm Sidley Austin as advisers to examine its capital structure and liquidity position and formulate what it called a \"holistic\" solution. The company in October missed a $15 million bond coupon repayment and so-called ad hoc bondholder groups were formed consisting of international and fund manager investors. \"Country Garden has taken way too long, messing around with switching advisors and wasting time, so it's no surprise people lose their patience and would rather liquidate them,\" a Country Garden dollar bond investor told Reuters. ","cleaned_content":"country garden holdings said on wednesday a liquidation petition has been filed against the embattled developer for non payment of a loan worth \u003cTWO_HUNDRED\u003e million adding to the woes for chinas liquidity crisis hit property sector country garden said in a regulatory filing to the hong kong stock exchange it would resolutely oppose the petition which was filed by a creditor ever credit limited a unit of kingboard holdings a court hearing had been set for may \u003cONE_TEN\u003e country gardens shares fell more than \u003cONE_TEN_PERCENT\u003e in early trade lagging a \u003cZERO_PERCENT\u003e gain for the benchmark hang seng index it comes a month after china evergrande group the worlds most indebted property developer with \u003cTHREE_HUNDRED\u003e billion in liabilities was ordered to be liquidated by a hong kong court it now faces a complicated restructuring process that some investors think could last more than a decade chinas property industry a pillar of the worlds second largest economy has lurched from one crisis to another since \u003cTWO_THOUSAND\u003e after a regulatory crackdown on debt fuelled construction triggered a liquidity squeeze a string of developers have defaulted on their repayment obligations since then and many of them have either launched or are in the process of starting debt restructuring processes to avoid facing bankruptcy or liquidation proceedings radical actions country garden said would continue to proactively communicate and work with its offshore creditors on its restructuring plan as it aimed to announce terms to the market as soon as practicable country gardens debt restructuring process which gathered momentum in recent weeks is set to be clouded by the liquidation petition the radical actions of a single creditor will not have a significant impact on our companys guaranteed delivery of buildings normal operations and the overall restructuring of overseas debts country garden said in statement to reuters investment holding company kingboard in october became one of the first known listed companies to take legal action against country garden when its unit ever credit which is owed hk \u003cONE_\u003e billion \u003cTWO_HUNDRED\u003e million issued a statutory demand seeking repayment country garden has appointed kpmg and law firm sidley austin as advisers to examine its capital structure and liquidity position and formulate what it called a holistic solution the company in october missed a \u003cONE_TEN\u003e million bond coupon repayment and so called ad hoc bondholder groups were formed consisting of international and fund manager investors country garden has taken way too long messing around with switching advisors and wasting time so its no surprise people lose their patience and would rather liquidate them a country garden dollar bond investor told reuters","timestamp":"2024-02-28T09:48:00+05:30","market_timestamp":"2024-02-28T09:48:00+05:30","off_market_hours":false}