{"url":"https://www.moneycontrol.com/news/business/blackrock-sees-india-indonesia-as-promising-for-investment-opportunities-12403551.html","title":"Blackrock sees India, Indonesia as promising for investment opportunities","description":"Manjesh Verma, BlackRock Head of APAC Credit and Fixed Income Research, at an investment forum in Jakarta said the two emerging market countries were advantageous due to their large populations.Blackrock sees India, Indonesia as promising for investment opportunities","content":"U.S. investment firm BlackRock sees India and Indonesia as two Asia-Pacific countries offering a lot of investment opportunities, its head of research for the region said on Tuesday. Manjesh Verma, BlackRock Head of APAC Credit and Fixed Income Research, at an investment forum in Jakarta said the two emerging market countries were advantageous due to their large populations. \"Because of large population, large markets, thriving democracy, these are two countries which kind of stand out where there is a lot of investor focus and attention going in,\" he said. He added, however, that India and Indonesia need to deepen their financial markets, including equity and currency markets. ","cleaned_content":"u s investment firm blackrock sees india and indonesia as two asia pacific countries offering a lot of investment opportunities its head of research for the region said on tuesday manjesh verma blackrock head of apac credit and fixed income research at an investment forum in jakarta said the two emerging market countries were advantageous due to their large populations because of large population large markets thriving democracy these are two countries which kind of stand out where there is a lot of investor focus and attention going in he said he added however that india and indonesia need to deepen their financial markets including equity and currency markets","timestamp":"2024-03-05T11:34:00+05:30","market_timestamp":"2024-03-05T11:34:00+05:30","off_market_hours":false}