{"url":"https://www.moneycontrol.com/news/business/blackrock-appoints-maheshwar-nataraj-to-lead-private-credit-in-india-12424041.html","title":"BlackRock appoints Maheshwar Nataraj to lead private credit in India","description":"Maheshwar Nataraj has been leading the firm’s sourcing and managing private credit investment in India, which poses “exciting opportunities,” according to a company spokesperson’s statement. BlackRock appoints Maheshwar Nataraj to lead private credit in India","content":"BlackRock Inc. has appointed Maheshwar Nataraj to lead its private credit business in the fast-growing India market. Nataraj has been leading the firm’s sourcing and managing private credit investment in India, which poses “exciting opportunities,” according to a company spokesperson’s statement. BlackRock’s director for private credit in India Dhruva Agarwal, who has been with the firm for four years, is leaving due to family reasons, the spokesperson added. Late last year, HSBC hired Boomish Gopalakrishnan as director of private credit to lead the bank’s private credit business in ASEAN and India. In November, Hillhouse’s private credit business Elham Credit Partners recruited Supriya Kumar as executive director in Mumbai. ","cleaned_content":"blackrock inc has appointed maheshwar nataraj to lead its private credit business in the fast growing india market nataraj has been leading the firm s sourcing and managing private credit investment in india which poses exciting opportunities according to a company spokesperson s statement blackrock s director for private credit in india dhruva agarwal who has been with the firm for four years is leaving due to family reasons the spokesperson added late last year hsbc hired boomish gopalakrishnan as director of private credit to lead the bank s private credit business in asean and india in november hillhouse s private credit business elham credit partners recruited supriya kumar as executive director in mumbai","timestamp":"2024-03-08T12:16:00+05:30","market_timestamp":"2024-03-08T12:16:00+05:30","off_market_hours":false}