{"url":"https://www.moneycontrol.com/news/business/tata-power-solar-systems-union-bank-renew-partnership-to-offer-financing-solutions-12405471.html","title":"Tata Power Solar Systems, Union Bank renew partnership to offer financing solutions","description":"Both the categories will have access to collateral-free financing options, making the transition to solar energy more accessible, Tata Power Solar Systems Ltd (TPSSL) said in a statement.Tata Power Solar Systems, Union Bank renew partnership to offer financing solutionsRelated stories","content":"Tata Power Solar Systems Ltd on Tuesday announced the renewal and expansion of its partnership with Union Bank of India to offer financing solutions for residential and Commercial and Industrial customers. Both the categories will have access to collateral-free financing options, making the transition to solar energy more accessible, Tata Power Solar Systems Ltd (TPSSL) said in a statement. This renewed three-year agreement with Union Bank of India (UBI) includes both residential and Commercial and Industrial (C\u0026I) segments compared to the earlier one which focused only on the C\u0026I segment. The loan tenure has also been extended up to 10 years, allowing households and businesses ample time for repayment, it said. The access to easy financing will mainstream the roof-top solar adoption among the residential segment in the country and replicate the success of the C\u0026I segment, Deepesh Nanda, CEO \u0026 Managing Director of Tata Power Renewable Energy Ltd (TPREL), said. Tata Power Solar Systems Ltd is a subsidiary of TPREL. A wholly-owned subsidiary of Tata Power, TPREL is a developer of renewable energy projects (including solar, wind, hybrid, round-the-clock (RTC), peak, floating solar, and storage systems including battery storage) that it owns, operates, and maintains. ","cleaned_content":"tata power solar systems ltd on tuesday announced the renewal and expansion of its partnership with union bank of india to offer financing solutions for residential and commercial and industrial customers both the categories will have access to collateral free financing options making the transition to solar energy more accessible tata power solar systems ltd tpssl said in a statement this renewed three year agreement with union bank of india ubi includes both residential and commercial and industrial c i segments compared to the earlier one which focused only on the c i segment the loan tenure has also been extended up to \u003cONE_TEN\u003e years allowing households and businesses ample time for repayment it said the access to easy financing will mainstream the roof top solar adoption among the residential segment in the country and replicate the success of the c i segment deepesh nanda ceo managing director of tata power renewable energy ltd tprel said tata power solar systems ltd is a subsidiary of tprel a wholly owned subsidiary of tata power tprel is a developer of renewable energy projects including solar wind hybrid round the clock rtc peak floating solar and storage systems including battery storage that it owns operates and maintains","timestamp":"2024-03-05T14:32:00+05:30","market_timestamp":"2024-03-05T14:32:00+05:30","off_market_hours":false}