{"url":"https://www.moneycontrol.com/news/business/me-industry-to-cross-rs-3-lakh-crore-in-2026-report-12405821.html","title":"M\u0026E industry to cross Rs 3 lakh crore in 2026: Report","description":"While the Indian Media \u0026 Entertainment (M\u0026E) sector grew by 8.1 per cent in 2023, reaching Rs 2.32 lakh crore and is expected to touch Rs 2.55 lakh crore and cross Rs 3 lakh crore mark by 2026, it added.M\u0026E industry to cross Rs 3 lakh crore in 2026: ReportRelated stories","content":"The digital media will potentially overtake television as the leading segment in the media \u0026 entertainment sector in 2024 with an estimated size of Rs 75,100 crore, said a joint report from industry body FICCI (Federation of Indian Chambers of Commerce and Industry) and EY on Tuesday. While the Indian Media \u0026 Entertainment (M\u0026E) sector grew by 8.1 per cent in 2023, reaching Rs 2.32 lakh crore and is expected to touch Rs 2.55 lakh crore and cross Rs 3 lakh crore mark by 2026, it added. \"We expect the M\u0026E sector to grow 10.2 per cent to reach Rs 2.55 trillion by 2024, then grow at a CAGR (Compound Annual Growth Rate) of 10 per cent to reach Rs 3.08 trillion by 2026,\" the report said. The report estimates digital media would be around Rs 95,500 crore in 2026, with a CAGR growth of 13.5 per cent between 2023-26. While TV media would be Rs 76,600 crore, which would be around 20 per cent less than digital media. \"In 2024, digital media is poised for explosive growth, potentially overtaking television to become the leading segment of the M\u0026E sector. This surge in digital media is forecasted to propel the M\u0026E sector's growth to a 10 per cent annual rate, crossing Rs 3 trillion (USD 37.1 billion) by 2026,\" said Kevin Vaz Chairman, FICCI Media and Entertainment Committee. This growth is buoyed by a robust digital infrastructure, widespread adoption of OTT platforms, significant growth in the gaming segment, and the availability of cost-effective options for consumers. The report expects digital advertising to grow at a 13.5 per cent CAGR to reach Rs 84,200 crore, on the back of improved governance. According to the report, the connected TV (smart TV) saw a 50 per cent growth as internet penetration continues to rise. \"The broadband market is growing with subscription numbers recording 904 million. It is inevitable that smartphone users have grown and consequently, the average usage time continues to rise,\" it said. However, it also added despite high app downloads of 26.4 billion, India was behind in monetising this potential, with users spending half their time on social media apps. \"The year also saw the growth of digital ad spending by 15 per cent, predominantly in search and social media. By 2026, the digital segment is expected to grow to Rs 95,000 crore with an increased focus on governance,\" it said. The Media \u0026 Entertainment sector (M\u0026E) sector, which was around Rs 2.14 lakh crore has grown around Rs 17,300 crore in 2023, led by growth from Digital media, Print, Online gaming, and Animation and VFX, the report said. \"While the sector was 21 per cent above its pre-pandemic levels, television, print, and radio still lagged their 2019 levels,\" it said. The share of traditional media, which includes television, print, filmed entertainment, live events, OOH (Out-of-home), music, and radio stood at 57 per cent of M\u0026E sector revenues in 2023, down from 76 per cent in 2019, it added. In 2023, TV advertising fell 6.5 per cent due to a slowdown in spending by gaming and D2C brands, which impacted revenues for premium properties. On the print media, the report said it has buckled the global trend and continued to thrive in India. \"Advertising revenues grew 4 per cent in 2023, with a notable growth in premium ad formats, as print remained a \"go-to\" medium for more affluent and nonmetro audiences. Subscription revenues grew 3 per cent on the back of rising cover prices. Digital revenues were insignificant for most print companies,\" it said. ","cleaned_content":"the digital media will potentially overtake television as the leading segment in the media entertainment sector in \u003cTWO_THOUSAND\u003e with an estimated size of rs \u003cSEVEN_TEN_THOUSAND\u003e crore said a joint report from industry body ficci federation of indian chambers of commerce and industry and ey on tuesday while the indian media entertainment m e sector grew by \u003cEIGHT_PERCENT\u003e in \u003cTWO_THOUSAND\u003e reaching rs \u003cTWO_\u003e lakh crore and is expected to touch rs \u003cTWO_\u003e lakh crore and cross rs \u003cTHREE_\u003e lakh crore mark by \u003cTWO_THOUSAND\u003e it added we expect the m e sector to grow \u003cONE_TEN_PERCENT\u003e to reach rs \u003cTWO_\u003e trillion by \u003cTWO_THOUSAND\u003e then grow at a cagr compound annual growth rate of \u003cONE_TEN_PERCENT\u003e to reach rs \u003cTHREE_\u003e trillion by \u003cTWO_THOUSAND\u003e the report said the report estimates digital media would be around rs \u003cNINE_TEN_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e with a cagr growth of \u003cONE_TEN_PERCENT\u003e between \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e while tv media would be rs \u003cSEVEN_TEN_THOUSAND\u003e crore which would be around \u003cTWO_TEN_PERCENT\u003e less than digital media in \u003cTWO_THOUSAND\u003e digital media is poised for explosive growth potentially overtaking television to become the leading segment of the m e sector this surge in digital media is forecasted to propel the m e sectors growth to a \u003cONE_TEN_PERCENT\u003e annual rate crossing rs \u003cTHREE_\u003e trillion usd \u003cTHREE_TEN\u003e billion by \u003cTWO_THOUSAND\u003e said kevin vaz chairman ficci media and entertainment committee this growth is buoyed by a robust digital infrastructure widespread adoption of ott platforms significant growth in the gaming segment and the availability of cost effective options for consumers the report expects digital advertising to grow at a \u003cONE_TEN_PERCENT\u003e cagr to reach rs \u003cEIGHT_TEN_THOUSAND\u003e crore on the back of improved governance according to the report the connected tv smart tv saw a \u003cFIVE_TEN_PERCENT\u003e growth as internet penetration continues to rise the broadband market is growing with subscription numbers recording \u003cNINE_HUNDRED\u003e million it is inevitable that smartphone users have grown and consequently the average usage time continues to rise it said however it also added despite high app downloads of \u003cTWO_TEN\u003e billion india was behind in monetising this potential with users spending half their time on social media apps the year also saw the growth of digital ad spending by \u003cONE_TEN_PERCENT\u003e predominantly in search and social media by \u003cTWO_THOUSAND\u003e the digital segment is expected to grow to rs \u003cNINE_TEN_THOUSAND\u003e crore with an increased focus on governance it said the media entertainment sector m e sector which was around rs \u003cTWO_\u003e lakh crore has grown around rs \u003cONE_TEN_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e led by growth from digital media print online gaming and animation and vfx the report said while the sector was \u003cTWO_TEN_PERCENT\u003e above its pre pandemic levels television print and radio still lagged their \u003cTWO_THOUSAND\u003e levels it said the share of traditional media which includes television print filmed entertainment live events ooh out of home music and radio stood at \u003cFIVE_TEN_PERCENT\u003e of m e sector revenues in \u003cTWO_THOUSAND\u003e down from \u003cSEVEN_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e it added in \u003cTWO_THOUSAND\u003e tv advertising fell \u003cSIX_PERCENT\u003e due to a slowdown in spending by gaming and d2c brands which impacted revenues for premium properties on the print media the report said it has buckled the global trend and continued to thrive in india advertising revenues grew \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e with a notable growth in premium ad formats as print remained a go to medium for more affluent and nonmetro audiences subscription revenues grew \u003cTHREE_PERCENT\u003e on the back of rising cover prices digital revenues were insignificant for most print companies it said","timestamp":"2024-03-05T14:57:00+05:30","market_timestamp":"2024-03-05T14:57:00+05:30","off_market_hours":false}