{"url":"https://www.moneycontrol.com/news/business/japans-takeda-partners-with-indias-biological-e-to-boost-dengue-vaccine-production-12359841.html","title":"Japan's Takeda partners with India's Biological E. to boost dengue vaccine production","description":"These doses will be available for governments in endemic countries by 2030 as part of their national immunization programmes.Japan's Takeda partners with India's Biological E. to boost dengue vaccine production","content":"Japan's Takeda Pharmaceutical will scale up production of its dengue vaccine Qdenga through a partnership with Indian vaccines maker Biological E., the companies said on Tuesday. These doses will be available for governments in endemic countries by 2030 as part of their national immunization programmes. Biological E. will ramp up to a manufacturing capacity of 50 million doses a year, accelerating Takeda's efforts to produce 100 million doses per year within a decade, the companies said. Brazil has bought 5.2 million doses of Qdenga, with an additional 1.32 million doses provided at no cost, as the country undertakes emergency measures and mass vaccination against the mosquito-borne disease. Since the beginning of 2023, the world has been facing an upsurge of dengue cases and deaths reported in endemic areas, with further spread to areas previously free of dengue, according to the World Health Organization. It estimates more than five million dengue cases and over 5,000 associated deaths have been recorded across all six WHO regions. ","cleaned_content":"japans takeda pharmaceutical will scale up production of its dengue vaccine qdenga through a partnership with indian vaccines maker biological e the companies said on tuesday these doses will be available for governments in endemic countries by \u003cTWO_THOUSAND\u003e as part of their national immunization programmes biological e will ramp up to a manufacturing capacity of \u003cFIVE_TEN\u003e million doses a year accelerating takedas efforts to produce \u003cONE_HUNDRED\u003e million doses per year within a decade the companies said brazil has bought \u003cFIVE_\u003e million doses of qdenga with an additional \u003cONE_\u003e million doses provided at no cost as the country undertakes emergency measures and mass vaccination against the mosquito borne disease since the beginning of \u003cTWO_THOUSAND\u003e the world has been facing an upsurge of dengue cases and deaths reported in endemic areas with further spread to areas previously free of dengue according to the world health organization it estimates more than five million dengue cases and over \u003cFIVE_THOUSAND\u003e associated deaths have been recorded across all six who regions","timestamp":"2024-02-27T11:50:00+05:30","market_timestamp":"2024-02-27T11:50:00+05:30","off_market_hours":false}