{"url":"https://www.moneycontrol.com/news/business/siemens-has-high-hopes-for-india-as-economy-booms-matthias-rebellius-12412441.html","title":"Siemens has high hopes for India as economy booms: Matthias Rebellius","description":"Matthias Rebellius, head of Siemens' Smart Infrastructure business, said India was a priority for future investments as it upgrades its electric grid and invests in renewable energy.Siemens has high hopes for India as economy booms: Matthias RebelliusRelated stories","content":"Siemens is \"very positive\" about its prospects in India, managing board member Matthias Rebellius said, as the country's economy booms and offers the chance to diversify from China. Rebellius, head of Siemens' Smart Infrastructure business, said India was a priority for future investments as it upgrades its electric grid and invests in renewable energy. \"We are very positive on India, and it is one of our main growth markets,\" Rebellius told Reuters in an interview. India's economy is on the up, with Moody's raising its growth forecast on Monday. In contrast, Chinese growth is slowing as the property sector and external demand weigh. In addition to transportation in India, the German engineering group also sees opportunities in grid upgrades and electrification components for solar projects, Rebellius said. Siemens' Indian subsidiary, Siemens Ltd, increased sales by 18% to 179.7 billion Indian rupees ($2.17 billion) last year, according its annual report. The unit, which includes the assets of Siemens Energy but not the Siemens Healthineers business, is now 69% Siemens-owned after it recently increased its stake. Siemens rival ABB last year said it was seeing some customers shift investments from China to India and other parts of Asia due to geopolitical tensions. Although India would not replace China, Siemens's third-biggest market, it would become the focus of more investments, Rebellius said. Globally, the executive said Smart Infrastructure, which produces products to control buildings, was seeing a return to normal ordering patterns since the COVID pandemic. \"The destocking trend seems to be over,\" he said. Siemens this week also launched a sustainability label called \"Siemens EcoTech\", which provides information on the materials used, production, design and lifecycle, a tag Rebellius said customers increasingly wanted. Among the products carrying the label are a new electronic circuit protection device. \"This helps us to increase sales and keep prices stable,\" he said. ","cleaned_content":"siemens is very positive about its prospects in india managing board member matthias rebellius said as the countrys economy booms and offers the chance to diversify from china rebellius head of siemens smart infrastructure business said india was a priority for future investments as it upgrades its electric grid and invests in renewable energy we are very positive on india and it is one of our main growth markets rebellius told reuters in an interview indias economy is on the up with moodys raising its growth forecast on monday in contrast chinese growth is slowing as the property sector and external demand weigh in addition to transportation in india the german engineering group also sees opportunities in grid upgrades and electrification components for solar projects rebellius said siemens indian subsidiary siemens ltd increased sales by \u003cONE_TEN_PERCENT\u003e to \u003cONE_HUNDRED\u003e billion indian rupees \u003cTWO_\u003e billion last year according its annual report the unit which includes the assets of siemens energy but not the siemens healthineers business is now \u003cSIX_TEN_PERCENT\u003e siemens owned after it recently increased its stake siemens rival abb last year said it was seeing some customers shift investments from china to india and other parts of asia due to geopolitical tensions although india would not replace china siemenss third biggest market it would become the focus of more investments rebellius said globally the executive said smart infrastructure which produces products to control buildings was seeing a return to normal ordering patterns since the covid pandemic the destocking trend seems to be over he said siemens this week also launched a sustainability label called siemens ecotech which provides information on the materials used production design and lifecycle a tag rebellius said customers increasingly wanted among the products carrying the label are a new electronic circuit protection device this helps us to increase sales and keep prices stable he said","timestamp":"2024-03-06T14:41:00+05:30","market_timestamp":"2024-03-06T14:41:00+05:30","off_market_hours":false}