{"url":"https://www.moneycontrol.com/news/business/adani-group-considers-offering-1-2-billion-more-bonds-12411831.html","title":"Adani group considers offering $1.2 billion more bonds","description":"The group’s renewable energy unit Adani Green Energy Ltd. and associated firms plan to raise funds to refinance existing loans, one of the people said, asking not to be identified because the details are private.Adani group considers offering $1.2 billion more bondsRelated stories","content":"Billionaire Gautam Adani’s conglomerate is considering offering another $1.2 billion of dollar bonds by June, people familiar with the matter said, fresh off a note issuance this week that was also part of plans to raise at least $2 billion in mostly new debt this year. The group’s renewable energy unit Adani Green Energy Ltd. and associated firms plan to raise funds to refinance existing loans, one of the people said, asking not to be identified because the details are private. The company is discussing the planned transaction with arrangers and bankers. It expects to conclude the issuance in four months, one of the people said. An Adani Group representative didn’t offer an immediate comment. The offering’s success is another sign that the Indian conglomerate has regained the confidence of investors. The investor response further allayed fears it might have to pay dearly to raise overseas capital after Hinderburg’s accusations of fraud and stock manipulation — which the group has repeatedly denied — triggered a rout in the stock and bond prices of group firms. Adani Green has said it plans to raise at least $2 billion in mostly new debt in 2024, including $409 million and other private placement options. ","cleaned_content":"billionaire gautam adani s conglomerate is considering offering another \u003cONE_\u003e billion of dollar bonds by june people familiar with the matter said fresh off a note issuance this week that was also part of plans to raise at least \u003cTWO_\u003e billion in mostly new debt this year the group s renewable energy unit adani green energy ltd and associated firms plan to raise funds to refinance existing loans one of the people said asking not to be identified because the details are private the company is discussing the planned transaction with arrangers and bankers it expects to conclude the issuance in four months one of the people said an adani group representative didn t offer an immediate comment the offering s success is another sign that the indian conglomerate has regained the confidence of investors the investor response further allayed fears it might have to pay dearly to raise overseas capital after hinderburg s accusations of fraud and stock manipulation which the group has repeatedly denied triggered a rout in the stock and bond prices of group firms adani green has said it plans to raise at least \u003cTWO_\u003e billion in mostly new debt in \u003cTWO_THOUSAND\u003e including \u003cFOUR_HUNDRED\u003e million and other private placement options","timestamp":"2024-03-06T13:34:00+05:30","market_timestamp":"2024-03-06T13:34:00+05:30","off_market_hours":false}