{"url":"https://www.moneycontrol.com/news/business/nokia-sterlite-technologies-collaborate-to-enhance-digital-solutions-for-govt-enterprises-12398421.html","title":"Nokia, Sterlite Technologies collaborate to enhance digital solutions for govt, enterprises","description":"The partnership will also focus on government-driven connectivity projects to offer connectivity and networking solutions, Nokia said in a statement.Nokia, Sterlite Technologies collaborate to enhance digital solutions for govt, enterprises","content":"Finnish telecom and IT company Nokia on Monday said it has partnered with Sterlite Technologies (STL), an optical and digital solutions company, to enhance networking and digital solutions for government institutions and enterprises. The partnership will also focus on government-driven connectivity projects to offer connectivity and networking solutions, Nokia said in a statement. \"The collaboration will accelerate the Industry 4.0 revolution. By leveraging these solutions, businesses can gain a competitive edge and drive transformation with disruptive technologies,\" the statement said. \"STL's extensive experience in connectivity solutions, coupled with Nokia's technological strength in 5G and IoT, creates a synergy that has the potential to redefine enterprise connectivity and transform industries. Together, we envision empowering enterprises to reach their full potential,\" said Praveen Cherian, CEO of Global Services Business at STL. Head of Enterprise and Webscale business in India at Nokia Vinish Bawa said the alliance is well-positioned to redefine enterprise connectivity in India. ","cleaned_content":"finnish telecom and it company nokia on monday said it has partnered with sterlite technologies stl an optical and digital solutions company to enhance networking and digital solutions for government institutions and enterprises the partnership will also focus on government driven connectivity projects to offer connectivity and networking solutions nokia said in a statement the collaboration will accelerate the industry \u003cFOUR_\u003e revolution by leveraging these solutions businesses can gain a competitive edge and drive transformation with disruptive technologies the statement said stls extensive experience in connectivity solutions coupled with nokias technological strength in \u003cFIVE_\u003e g and iot creates a synergy that has the potential to redefine enterprise connectivity and transform industries together we envision empowering enterprises to reach their full potential said praveen cherian ceo of global services business at stl head of enterprise and webscale business in india at nokia vinish bawa said the alliance is well positioned to redefine enterprise connectivity in india","timestamp":"2024-03-04T14:13:00+05:30","market_timestamp":"2024-03-04T14:13:00+05:30","off_market_hours":false}