{"url":"https://www.moneycontrol.com/news/business/b2b-platform-udaan-sees-sale-of-2-25-billion-products-in-2023-900-sellers-achieved-sales-worth-rs-1-crore-each-12403881.html","title":"B2B platform udaan sees sale of 2.25 billion products in 2023; 900 sellers achieved sales worth Rs 1 crore each","description":"As many as 31 million electronics products, nearly 30 million products each in lifestyle and general merchandise category, 10 lakh tonnes of essentials, and 2 lakh tonnes of FMCG (fast-moving consumer goods) products were sold through the platform, udaan said in a statement.B2B platform udaan sees sale of 2.25 billion products in 2023; 900 sellers achieved sales worth Rs 1 crore each","content":"Online business-to-business platform udaan on Tuesday said that it shipped over 2.25 billion products across India in 2023, and 900 sellers on the platform achieved sales worth Rs 1 crore each. As many as 31 million electronics products, nearly 30 million products each in lifestyle and general merchandise category, 10 lakh tonnes of essentials, and 2 lakh tonnes of FMCG (fast-moving consumer goods) products were sold through the platform, udaan said in a statement. The company said, \"Over 2.25 billion products catering to over 23 million orders were shipped by the platform in 2023. These orders were shipped across all states of Bharat. During this period, 900 sellers on the platform achieved sales worth Rs 1 crore each, while close to 600 sellers did business worth INR 2 crores on the platform.\" Vaibhav Gupta, co-founder and CEO of udaan, said that the large volume of orders and higher repeat purchase rate highlights the preference udaan enjoys among its retailer partners. \"Encouraged by our solid performance, we will continue to work towards strengthening our market position and capitalise on the huge USD 150 billion opportunity that the Indian electronic B2B market offers,\" Gupta said. ","cleaned_content":"online business to business platform udaan on tuesday said that it shipped over \u003cTWO_\u003e billion products across india in \u003cTWO_THOUSAND\u003e and \u003cNINE_HUNDRED\u003e sellers on the platform achieved sales worth rs \u003cONE_\u003e crore each as many as \u003cTHREE_TEN\u003e million electronics products nearly \u003cTHREE_TEN\u003e million products each in lifestyle and general merchandise category \u003cONE_TEN\u003e lakh tonnes of essentials and \u003cTWO_\u003e lakh tonnes of fmcg fast moving consumer goods products were sold through the platform udaan said in a statement the company said over \u003cTWO_\u003e billion products catering to over \u003cTWO_TEN\u003e million orders were shipped by the platform in \u003cTWO_THOUSAND\u003e these orders were shipped across all states of bharat during this period \u003cNINE_HUNDRED\u003e sellers on the platform achieved sales worth rs \u003cONE_\u003e crore each while close to \u003cSIX_HUNDRED\u003e sellers did business worth inr \u003cTWO_\u003e crores on the platform vaibhav gupta co founder and ceo of udaan said that the large volume of orders and higher repeat purchase rate highlights the preference udaan enjoys among its retailer partners encouraged by our solid performance we will continue to work towards strengthening our market position and capitalise on the huge usd \u003cONE_HUNDRED\u003e billion opportunity that the indian electronic b2b market offers gupta said","timestamp":"2024-03-05T12:07:00+05:30","market_timestamp":"2024-03-05T12:07:00+05:30","off_market_hours":false}