{"url":"https://www.moneycontrol.com/news/business/paramount-in-talks-to-sell-india-tv-stake-to-mukesh-ambanis-reliance-12416631.html","title":"Paramount in talks to sell India TV stake to Mukesh Ambani’s Reliance: Bloomberg","description":"The New York-based media company has been in advanced talks to sell its minority stake in Viacom18 Media Pvt. to Reliance, said the people, who asked to not to be identified as the information is private.Paramount in talks to sell India TV stake to Mukesh Ambani’s RelianceRelated stories","content":"Paramount Global is in discussions to sell its stake in its media joint venture in India to Mukesh Ambani’s Reliance Industries Ltd., according to people familiar with the matter, as Asia’s richest man continues to consolidate his clout in one of the world’s fastest-growing entertainment markets. The New York-based media company has been in advanced talks to sell its minority stake in Viacom18 Media Pvt. to Reliance, said the people, who asked to not to be identified as the information is private. Talks between Paramount and Reliance are still ongoing and may not result in a deal, the people said. Representatives for Paramount, Viacom18 and Reliance all declined to comment. Bloomberg Intelligence estimated a sale of the Viacom18 position could generate as much as $550 million that Paramount could use toward debt reduction. Paramount shares rose 3.4% to $10.56 as of 12:30 p.m. in New York Viacom18 has spearheaded Reliance Group’s media foray in recent years as billionaire Ambani steadily shifted his fossil fuels-led conglomerate toward consumer-facing and technology-led businesses. Viacom18 was also the vehicle through which Reliance outbid Walt Disney Co. in 2022 to win the coveted streaming rights of the Indian Premier League, or IPL, cricket tournament. Disney and Reliance signed a binding agreement last month to merge their Indian media operations, in mounting evidence that global giants were ceding ground to local heavyweights. Reliance and its associates will have a 63% stake in the new $8.5 billion media powerhouse, with Disney holding the rest. Paramount’s stake, via Viacom18, will also shrink with the new deal. Disney’s decision to merge with Reliance followed its struggle to retain subscribers. Ambani’s conglomerate disrupted the sports broadcast segment by streaming IPL cricket games for free in the cricket-crazy nation of over 1.4 billion people. Viacom18 signed a multiyear pact to distribute programming from Warner Bros Discovery Inc., in another recent setback to Disney in India. Sony Group Corp., which has also fought to grow its market share in India, suffered a big blow after its merger with Zee Entertainment Enterprises Ltd. collapsed following long-lasting disagreements with Zee founders. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"paramount global is in discussions to sell its stake in its media joint venture in india to mukesh ambani s reliance industries ltd according to people familiar with the matter as asia s richest man continues to consolidate his clout in one of the world s fastest growing entertainment markets the new york based media company has been in advanced talks to sell its minority stake in viacom18 media pvt to reliance said the people who asked to not to be identified as the information is private talks between paramount and reliance are still ongoing and may not result in a deal the people said representatives for paramount viacom18 and reliance all declined to comment bloomberg intelligence estimated a sale of the viacom18 position could generate as much as \u003cFIVE_HUNDRED\u003e million that paramount could use toward debt reduction paramount shares rose \u003cTHREE_PERCENT\u003e to \u003cONE_TEN\u003e as of \u003cONE_TEN\u003e \u003cTHREE_TEN\u003e p m in new york viacom18 has spearheaded reliance group s media foray in recent years as billionaire ambani steadily shifted his fossil fuels led conglomerate toward consumer facing and technology led businesses viacom18 was also the vehicle through which reliance outbid walt disney co in \u003cTWO_THOUSAND\u003e to win the coveted streaming rights of the indian premier league or ipl cricket tournament disney and reliance signed a binding agreement last month to merge their indian media operations in mounting evidence that global giants were ceding ground to local heavyweights reliance and its associates will have a \u003cSIX_TEN_PERCENT\u003e stake in the new \u003cEIGHT_\u003e billion media powerhouse with disney holding the rest paramount s stake via viacom18 will also shrink with the new deal disney s decision to merge with reliance followed its struggle to retain subscribers ambani s conglomerate disrupted the sports broadcast segment by streaming ipl cricket games for free in the cricket crazy nation of over \u003cONE_\u003e billion people viacom18 signed a multiyear pact to distribute programming from warner bros discovery inc in another recent setback to disney in india sony group corp which has also fought to grow its market share in india suffered a big blow after its merger with zee entertainment enterprises ltd collapsed following long lasting disagreements with zee founders disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-03-07T08:19:00+05:30","market_timestamp":"2024-03-07T09:15:00+05:30","off_market_hours":true}