{"url":"https://www.moneycontrol.com/news/business/adani-green-energy-to-raise-409-million-via-dollar-bonds-12362601.html","title":"Adani Green Energy to raise $409 million via dollar bonds","description":"Reuters had earlier reported that Adani Green Energy was looking to raise around $500 million by issuing dollar bonds in March, making it the first Adani group company to return to the overseas bond market in a year.Adani Green Energy to raise $409 million via dollar bondsRelated stories","content":"Adani Green Energy is looking to raise $409 million via U.S. dollar-denominated bonds with a door-to-door tenor of 18 years, the company said in a regulatory filing on Tuesday. Reuters had earlier reported that Adani Green Energy was looking to raise around $500 million by issuing dollar bonds in March, making it the first Adani group company to return to the overseas bond market in a year. The issue would be subject to market conditions and the weighted average life of the bonds could be around 12.7 years, the company said. The issuers have appointed Barclays, DBS Bank, Deutsche Bank, Emirates NBD Bank, First Abu Dhabi Bank, ING Bank, Intesa Sanpaolo, MUFG Securities Asia, SMBC Nikko Securities, Societe Generale and Standard Chartered Bank as joint bookrunners to arrange a series of fixed income investor meetings in Asia, the Middle East, Europe and the United States starting Feb. 28, it said. Fitch Ratings has assigned Adani Green Energy Limited Restricted Group 1's (AGEL RG1) proposed 18-year fully amortising senior secured notes due 2042 an expected rating of 'BBB-(EXP)' with a stable outlook, the agency said in a separate release. A report by U.S. short seller Hindenburg Research in January last year had led to a sell-off in stocks and overseas listed bonds of Adani group companies, forcing them to retreat from the foreign currency bond market and buyback $315 million of listed overseas debt securities. Since then, most of the group's foreign bonds are back above the levels they traded at before the Hindenburg report, giving the company comfort to look at a fresh issue of dollar bonds. ","cleaned_content":"adani green energy is looking to raise \u003cFOUR_HUNDRED\u003e million via u s dollar denominated bonds with a door to door tenor of \u003cONE_TEN\u003e years the company said in a regulatory filing on tuesday reuters had earlier reported that adani green energy was looking to raise around \u003cFIVE_HUNDRED\u003e million by issuing dollar bonds in march making it the first adani group company to return to the overseas bond market in a year the issue would be subject to market conditions and the weighted average life of the bonds could be around \u003cONE_TEN\u003e years the company said the issuers have appointed barclays dbs bank deutsche bank emirates nbd bank first abu dhabi bank ing bank intesa sanpaolo mufg securities asia smbc nikko securities societe generale and standard chartered bank as joint bookrunners to arrange a series of fixed income investor meetings in asia the middle east europe and the united states starting feb \u003cTWO_TEN\u003e it said fitch ratings has assigned adani green energy limited restricted group \u003cONE_\u003e s agel rg1 proposed \u003cONE_TEN\u003e year fully amortising senior secured notes due \u003cTWO_THOUSAND\u003e an expected rating of bbb exp with a stable outlook the agency said in a separate release a report by u s short seller hindenburg research in january last year had led to a sell off in stocks and overseas listed bonds of adani group companies forcing them to retreat from the foreign currency bond market and buyback \u003cTHREE_HUNDRED\u003e million of listed overseas debt securities since then most of the groups foreign bonds are back above the levels they traded at before the hindenburg report giving the company comfort to look at a fresh issue of dollar bonds","timestamp":"2024-02-27T15:05:00+05:30","market_timestamp":"2024-02-27T15:05:00+05:30","off_market_hours":false}