{"url":"https://www.moneycontrol.com/news/business/eli-lilly-ceo-david-ricks-says-its-obesity-drug-could-enter-india-as-early-as-2025-12369691.html","title":"Eli Lilly could launch obesity drug in India next year, CEO says","description":"Eli Lilly's CEO David Ricks told Reuters on Wednesday that the U.S. drugmaker expects to launch its obesity drug in Indian market as early as next year.Eli Lilly CEO David Ricks says its obesity drug could enter India as early as 2025Related stories","content":"U.S. drugmaker Eli Lilly expects to launch Mounjaro, its blockbuster diabetes drug and wildly popular obesity treatment, in India as early as next year after it clears an ongoing regulatory review, CEO David Ricks told Reuters on Wednesday. The market opportunity is huge in the world's most populous country, which has high obesity rates, especially among women, and the second-highest number of people with type-2 diabetes globally. Indian drugmakers are testing their own versions of weight-loss drugs, while illegal versions are also sold online. \"Our famous Mounjaro – it's under review now. So, perhaps as early as next year to the Indian market,\" Ricks told Reuters on the sidelines of the BioAsia conference in the southern state of Telangana. Mounjaro, chemically known as tirzepatide, is currently sold in the UK and Europe under the same brand name for both conditions. However, it is sold under the brand name Zepbound for weight loss in the U.S. Mounjaro is being reviewed by Indian drug regulators, for which Lilly is using data from its global trials, which included some Indian participants, a company source said, declining to be named as they are not authorized to speak to the media. Lilly's Mounjaro and Zepbound as well as Danish rival Novo Nordisk's in-demand Wegovy and Ozempic are therapies known as GLP-1 receptor agonists, developed to control blood sugar in patients with type 2 diabetes. But they also slow digestion, helping patients feel full longer, which has led to an explosion in their popularity and left Lilly and Novo Nordisk struggling to keep up with demand. The global market for these treatments is expected to reach at least $100 billion by the end of the decade, analysts estimate. Last year, a top Novo Nordisk official told Reuters the Danish company was aiming to bring Wegovy to India in 2026. Indian drugmakers, which are among the world's largest generic drug makers, are already developing their own versions of Wegovy. These companies include Zydus Lifesciences, Sun Pharma, Cipla, Dr Reddy's and Lupin. Of them, Lupin and Cipla are Lilly's Indian distributors, including for some of its older diabetes treatments such as Eglucent, Aplevant, Basaglar and Trulicity. REGULATORY RIGMAROLE India should boost patent protection, get rid of redundant policies and create a social safety net to win more investment from global drugmakers, Ricks said in his keynote address at the BioAsia conference. These steps, he said, would help drive \"broader interests for multinationals and foreign direct investment\" in India's pharmaceutical industry. \"India has many specific policies related to its regulatory environment all set up for good reason. But in hindsight, perhaps we can reflect upon them and find redundant policies that only cause delay and extra cost.\" Ricks said these regulatory challenges had the \"two-way effect\" of making it tough for companies like Lilly to bring new medicines into the market and constraining local biotechs to export their inventions. ","cleaned_content":"u s drugmaker eli lilly expects to launch mounjaro its blockbuster diabetes drug and wildly popular obesity treatment in india as early as next year after it clears an ongoing regulatory review ceo david ricks told reuters on wednesday the market opportunity is huge in the worlds most populous country which has high obesity rates especially among women and the second highest number of people with type \u003cTWO_\u003e diabetes globally indian drugmakers are testing their own versions of weight loss drugs while illegal versions are also sold online our famous mounjaro its under review now so perhaps as early as next year to the indian market ricks told reuters on the sidelines of the bioasia conference in the southern state of telangana mounjaro chemically known as tirzepatide is currently sold in the uk and europe under the same brand name for both conditions however it is sold under the brand name zepbound for weight loss in the u s mounjaro is being reviewed by indian drug regulators for which lilly is using data from its global trials which included some indian participants a company source said declining to be named as they are not authorized to speak to the media lillys mounjaro and zepbound as well as danish rival novo nordisks in demand wegovy and ozempic are therapies known as glp \u003cONE_\u003e receptor agonists developed to control blood sugar in patients with type \u003cTWO_\u003e diabetes but they also slow digestion helping patients feel full longer which has led to an explosion in their popularity and left lilly and novo nordisk struggling to keep up with demand the global market for these treatments is expected to reach at least \u003cONE_HUNDRED\u003e billion by the end of the decade analysts estimate last year a top novo nordisk official told reuters the danish company was aiming to bring wegovy to india in \u003cTWO_THOUSAND\u003e indian drugmakers which are among the worlds largest generic drug makers are already developing their own versions of wegovy these companies include zydus lifesciences sun pharma cipla dr reddys and lupin of them lupin and cipla are lillys indian distributors including for some of its older diabetes treatments such as eglucent aplevant basaglar and trulicity regulatory rigmarole india should boost patent protection get rid of redundant policies and create a social safety net to win more investment from global drugmakers ricks said in his keynote address at the bioasia conference these steps he said would help drive broader interests for multinationals and foreign direct investment in indias pharmaceutical industry india has many specific policies related to its regulatory environment all set up for good reason but in hindsight perhaps we can reflect upon them and find redundant policies that only cause delay and extra cost ricks said these regulatory challenges had the two way effect of making it tough for companies like lilly to bring new medicines into the market and constraining local biotechs to export their inventions","timestamp":"2024-03-01T19:50:00+05:30","market_timestamp":"2024-03-04T09:15:00+05:30","off_market_hours":true}