{"url":"https://www.moneycontrol.com/news/business/did-rameshwaram-cafe-blast-aim-to-undermine-brand-bengaluru-12397531.html","title":"Did Rameshwaram Cafe blast aim to undermine Brand Bengaluru?","description":"As investigations go on, political parties trade charges. The BJP has alleged that the Congress is turning the IT capital into ‘Bomb Bengaluru’, while the Karnataka Deputy CM, D K Shivakumar has accused the opposition of tarnishing the tech capital’s image.The accused used an IED with a one-hour timer and the blast took place in popular Rameshwaram Cafe at 12:55 pm during lunch hoursRelated stories","content":"The location of the Improvised Explosive Device (IED) blast in Bengaluru on March 1 may have well been a carefully chosen target. Kundalahalli in East Bengaluru is one of the tech nerve centres of the IT capital. Tech parks such as Prestige Technostar, Sattva Knowledge Court, Brigade Tech Gardens, Bagmane Solarium City, and RMZ NXT complex, and firms such as SAP Labs, NTT Data, GE Healthcare, Capgemini, Qualcomm, WNS, and IFB Industries Limited have their offices in the vicinity. As many as 10 people were injured in the blast. The accused used an IED with a one-hour timer and the blast took place in Rameshwaram Cafe at 12:55 pm during lunch hour. Weekday lunch customers are largely office goers, particularly IT professionals working in neighbouring tech parks. \"It’s very likely the accused did a recce of the place before the actual operation. It ticked many boxes – primarily it being a high footfall area and IT hub so it was certain to grab the intended eyeballs,\" a senior police official told Moneycontrol. Police are looking into the motive behind the blast – whether it’s a terror act or was caused by business rivalry. “It’s a pre-planned act from the looks of it. The accused would've carried out a recce and if you look at the CCTV footage, he has taken precautions to avoid identification by wearing a cap, glasses, and mask. He travelled by bus (instead of a private vehicle), and paid for Rava idli with cash. A final picture will emerge only once the investigation is completed,\" he said. Also, read: Rameshwaram cafe blast: CCTV footage shows suspect ordering idli before walking away State home minister G Parameshwara told reporters that bolts and nails (splinters/shrapnel) exploded vertically for some reason. It could have been more serious if they had exploded horizontally. Karnataka Deputy CM DK Shivakumar, Home Minister G Parameshwara, and Bengaluru City Police Commissioner B Dayananda are in discussion. Parameshwara said police are analysing footage from 40-50 CCTV cameras as well as 26 buses that passed through the road during that period. Police are also investigating whether the accused took multiple buses and changed attire to evade detection. S T Ramesh, former DGP and IGP of Karnataka police, told Moneycontrol:  \"In this case, the accused seems to have taken a series of safety measures to conceal his identity. But there is no such thing as a perfect crime. Given the tools made available by technology today —CCTV, mobile tower, call analysis, and other forensic tools—it's always possible to trace the accused\". Impact on Brand Bengaluru This incident took place on a day when global names, the likes of Bill Gates, Mark Zuckerberg, and Ivanka Trump, were in India. Union Minister of State for Skill Development and Entrepreneurship Rajeev Chandrasekhar told Moneycontrol: “Bengaluru is an important city and centre for our digital economy.  A lot of our Prime Minister's vision for the country's ambitions around innovation and the digital economy rests in Bengaluru. So, the law and order in Bengaluru and safety of people is certainly a matter of concern.\" Chandrasekhar said: “Bengaluru's reputation as a safe city for investors, expats, and people from around the country who come and work there must not be allowed to be impacted even by a percentage. It must be investigated and the police should be given a free hand to investigate it and bring the people to book\" he said. Karnataka, the hub for major tech firms, contributes  42 percent of India's IT exports. With over 5,500 IT/ITeS companies and around 750 MNCs, it provides direct employment to over 12 lakh professionals and generates over 31 lakh indirect jobs. The state boasts a significant presence in various sectors, including hosting 40 unicorns, 440 GCCs, and 14,000 start-ups, as per state government records. In addition to IT/ITeS, Karnataka holds a substantial position in electronics design (40 percent share), machine tools manufacturing (52 percent), aerospace \u0026 defence manufacturing (65 percent), and biotechnology exports (60 percent). In 2009, Infosys became the first private company in India to get CISF cover for its campus in Electronics City after the 2008 Mumbai attacks.  Later, its Mysuru campus was also covered. In 2010, CISF cover was extended to other companies such as Wipro, Tech Mahindra, Siemens, Hewlett Packard, and Tata Consultancy Services after the Electronics City Industrial Township Authority, which maintains the industrial estate, agreed to bear the expenditure of the CISF deployment. Political slugfest over Brand Bengaluru Taking a swipe at Karnataka Deputy Chief Minister D K Shivakumar's pet 'Brand Bengaluru' campaign aimed at drawing global investors to the city, BJP on Sunday alleged that Congress has turned the tech capital into ‘Bomb Bengaluru’. BJP posted a poster on X (formerly Twitter) which read, \"They said 'Brand Bengaluru'. They made it 'Bomb Bengaluru'.\" Bengaluru South MP Tejasvi Surya was the first among the leaders to state that it was a bomb blast. At 3:35 pm on March 1, he wrote on X : \"Just spoke to Rameshwaram Cafe founder Sri Nagaraj about the blast in his restaurant. He informed me that the blast occurred because of a bag that was left by a customer and not any cylinder explosion”. Responding to BJP’s charges, Shivakumar said: “BJP is exploiting the opportunity to gain political mileage. They are tarnishing the image of Bengaluru and Karnataka in the process. They may have forgotten things that happened during their term. I don't want to engage in politics over it, but they should introspect. At times like these, they should be aware of the nation's unity, integrity, and peace.” Parameshwara said: \"Police are also investigating various strands including whether it is a business rivalry, or an act carried out given the impending Lok Sabha polls as well as to scare off investors. We have a stable government in the state so there might be elements who want Bengaluru to appear unsafe.” Need to step up safety measures Experts and citizens urge the government to step up security, especially on tech corridors. Revathy Ashok, CEO of the Bangalore Political Action Committee (B.PAC),  an NGO said, \"This is a wake-up call for all of us in the city. The government should conduct extensive combing operations to get to the bottom of this. There is enough technology to support this\". She said Intelligence agencies constantly receive a lot of information from multiple sources. \"In many instances, while there might have been some clues that all is not well, the failure to connect the dots and prevent an unfortunate incident is sometimes the key problem. Being a high-profile city with significant global linkages, our Intelligence agencies must be on red alert and act with speed and alacrity. Constant communication with citizens to reassure them of safety measures being taken by the government is also critical.\" R K Misra, co-founder of Yulu Bikes, agrees, \"Safety and security are ongoing concerns and challenges. There is no foolproof method, but constant vigilance and robust Intelligence gathering by various agencies, along with efficient exchange of Intelligence among various state and national agencies, are of utmost importance.\" Ramesh said it's premature to call it an “Intelligence failure”. “It appears, so far, to be a one-man operation, but whether it was a lone wolf operation or if there were other people or group(s) or any organisation behind it, is being looked into.\" Also, read: First-person account: A 43-km Metro ride from Bengaluru's tech hub Whitefield for Rs 60 Some residents said the public should be more vigilant.  Pravir B, a Whitefield resident and frequent commuter to the Rameshwaram Cafe area where the blast happened, said, \"We all must stay vigilant in public spaces. Last Sunday, I alerted a young man who was leaving behind a large bag while alighting from the Metro. If we notice anything suspicious, we should immediately call the police.” Clement Jayakumar, Mahadevapura MLA Task Force member, suggested, \"There should be visible policing. Police officers in uniform should be deployed in crowded areas like markets, commercial areas, Metro, etc. Hoysala patrolling vehicles with flashing lights should be deployed in key areas, especially at night\". He said the government should install more cameras in outer zones as part of the Nirbhaya project. \"CCTV camera feeds from entrances of IT parks, malls, and high-footfall shops should be integrated to the command centre. Police should also create public awareness through frequent announcements by Hoysala vehicles.\" Hotel association to frame SOPs Bruhat Bangalore Hotels Association said they will come up with Standard Operating Procedures (SOPs) to enhance the security system at hotels across the city. The blast also cast a shadow on the state government’s recent budget announcement to allow shops and business establishments in the city and 10 other corporations to operate till 1 am. Association president PC Rao said: \"We will soon call a stakeholder meeting and come up with an SOP to ensure the safety of restaurant owners, employees, and customers\". Also, read:  Rameshwaram Cafe CEO tells govt: 'This incident should not happen anywhere in India' ","cleaned_content":"the location of the improvised explosive device ied blast in bengaluru on march \u003cONE_\u003e may have well been a carefully chosen target kundalahalli in east bengaluru is one of the tech nerve centres of the it capital tech parks such as prestige technostar sattva knowledge court brigade tech gardens bagmane solarium city and rmz nxt complex and firms such as sap labs ntt data ge healthcare capgemini qualcomm wns and ifb industries limited have their offices in the vicinity as many as \u003cONE_TEN\u003e people were injured in the blast the accused used an ied with a one hour timer and the blast took place in rameshwaram cafe at \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e pm during lunch hour weekday lunch customers are largely office goers particularly it professionals working in neighbouring tech parks it s very likely the accused did a recce of the place before the actual operation it ticked many boxes primarily it being a high footfall area and it hub so it was certain to grab the intended eyeballs a senior police official told moneycontrol police are looking into the motive behind the blast whether it s a terror act or was caused by business rivalry it s a pre planned act from the looks of it the accused wouldve carried out a recce and if you look at the cctv footage he has taken precautions to avoid identification by wearing a cap glasses and mask he travelled by bus instead of a private vehicle and paid for rava idli with cash a final picture will emerge only once the investigation is completed he said also read rameshwaram cafe blast cctv footage shows suspect ordering idli before walking away state home minister g parameshwara told reporters that bolts and nails splinters shrapnel exploded vertically for some reason it could have been more serious if they had exploded horizontally karnataka deputy cm dk shivakumar home minister g parameshwara and bengaluru city police commissioner b dayananda are in discussion parameshwara said police are analysing footage from \u003cFOUR_TEN\u003e \u003cFIVE_TEN\u003e cctv cameras as well as \u003cTWO_TEN\u003e buses that passed through the road during that period police are also investigating whether the accused took multiple buses and changed attire to evade detection s t ramesh former dgp and igp of karnataka police told moneycontrol in this case the accused seems to have taken a series of safety measures to conceal his identity but there is no such thing as a perfect crime given the tools made available by technology today cctv mobile tower call analysis and other forensic tools its always possible to trace the accused impact on brand bengaluru this incident took place on a day when global names the likes of bill gates mark zuckerberg and ivanka trump were in india union minister of state for skill development and entrepreneurship rajeev chandrasekhar told moneycontrol bengaluru is an important city and centre for our digital economy a lot of our prime ministers vision for the countrys ambitions around innovation and the digital economy rests in bengaluru so the law and order in bengaluru and safety of people is certainly a matter of concern chandrasekhar said bengalurus reputation as a safe city for investors expats and people from around the country who come and work there must not be allowed to be impacted even by a percentage it must be investigated and the police should be given a free hand to investigate it and bring the people to book he said karnataka the hub for major tech firms contributes \u003cFOUR_TEN_PERCENT\u003e of indias it exports with over \u003cFIVE_THOUSAND\u003e it ites companies and around \u003cSEVEN_HUNDRED\u003e mncs it provides direct employment to over \u003cONE_TEN\u003e lakh professionals and generates over \u003cTHREE_TEN\u003e lakh indirect jobs the state boasts a significant presence in various sectors including hosting \u003cFOUR_TEN\u003e unicorns \u003cFOUR_HUNDRED\u003e gccs and \u003cONE_TEN_THOUSAND\u003e start ups as per state government records in addition to it ites karnataka holds a substantial position in electronics design \u003cFOUR_TEN_PERCENT\u003e share machine tools manufacturing \u003cFIVE_TEN_PERCENT\u003e aerospace defence manufacturing \u003cSIX_TEN_PERCENT\u003e and biotechnology exports \u003cSIX_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e infosys became the first private company in india to get cisf cover for its campus in electronics city after the \u003cTWO_THOUSAND\u003e mumbai attacks later its mysuru campus was also covered in \u003cTWO_THOUSAND\u003e cisf cover was extended to other companies such as wipro tech mahindra siemens hewlett packard and tata consultancy services after the electronics city industrial township authority which maintains the industrial estate agreed to bear the expenditure of the cisf deployment political slugfest over brand bengaluru taking a swipe at karnataka deputy chief minister d k shivakumars pet brand bengaluru campaign aimed at drawing global investors to the city bjp on sunday alleged that congress has turned the tech capital into bomb bengaluru bjp posted a poster on x formerly twitter which read they said brand bengaluru they made it bomb bengaluru bengaluru south mp tejasvi surya was the first among the leaders to state that it was a bomb blast at \u003cTHREE_\u003e \u003cTHREE_TEN\u003e pm on march \u003cONE_\u003e he wrote on x just spoke to rameshwaram cafe founder sri nagaraj about the blast in his restaurant he informed me that the blast occurred because of a bag that was left by a customer and not any cylinder explosion responding to bjp s charges shivakumar said bjp is exploiting the opportunity to gain political mileage they are tarnishing the image of bengaluru and karnataka in the process they may have forgotten things that happened during their term i dont want to engage in politics over it but they should introspect at times like these they should be aware of the nations unity integrity and peace parameshwara said police are also investigating various strands including whether it is a business rivalry or an act carried out given the impending lok sabha polls as well as to scare off investors we have a stable government in the state so there might be elements who want bengaluru to appear unsafe need to step up safety measures experts and citizens urge the government to step up security especially on tech corridors revathy ashok ceo of the bangalore political action committee b pac an ngo said this is a wake up call for all of us in the city the government should conduct extensive combing operations to get to the bottom of this there is enough technology to support this she said intelligence agencies constantly receive a lot of information from multiple sources in many instances while there might have been some clues that all is not well the failure to connect the dots and prevent an unfortunate incident is sometimes the key problem being a high profile city with significant global linkages our intelligence agencies must be on red alert and act with speed and alacrity constant communication with citizens to reassure them of safety measures being taken by the government is also critical r k misra co founder of yulu bikes agrees safety and security are ongoing concerns and challenges there is no foolproof method but constant vigilance and robust intelligence gathering by various agencies along with efficient exchange of intelligence among various state and national agencies are of utmost importance ramesh said its premature to call it an intelligence failure it appears so far to be a one man operation but whether it was a lone wolf operation or if there were other people or group s or any organisation behind it is being looked into also read first person account a \u003cFOUR_TEN\u003e km metro ride from bengalurus tech hub whitefield for rs \u003cSIX_TEN\u003e some residents said the public should be more vigilant pravir b a whitefield resident and frequent commuter to the rameshwaram cafe area where the blast happened said we all must stay vigilant in public spaces last sunday i alerted a young man who was leaving behind a large bag while alighting from the metro if we notice anything suspicious we should immediately call the police clement jayakumar mahadevapura mla task force member suggested there should be visible policing police officers in uniform should be deployed in crowded areas like markets commercial areas metro etc hoysala patrolling vehicles with flashing lights should be deployed in key areas especially at night he said the government should install more cameras in outer zones as part of the nirbhaya project cctv camera feeds from entrances of it parks malls and high footfall shops should be integrated to the command centre police should also create public awareness through frequent announcements by hoysala vehicles hotel association to frame sops bruhat bangalore hotels association said they will come up with standard operating procedures sops to enhance the security system at hotels across the city the blast also cast a shadow on the state government s recent budget announcement to allow shops and business establishments in the city and \u003cONE_TEN\u003e other corporations to operate till \u003cONE_\u003e am association president pc rao said we will soon call a stakeholder meeting and come up with an sop to ensure the safety of restaurant owners employees and customers also read rameshwaram cafe ceo tells govt this incident should not happen anywhere in india","timestamp":"2024-03-04T16:51:00+05:30","market_timestamp":"2024-03-05T09:15:00+05:30","off_market_hours":true}