{"url":"https://www.moneycontrol.com/news/business/jsw-energy-gets-700-mw-solar-project-from-sjvn-12360831.html","title":"JSW Energy gets 700 MW solar project from SJVN","description":"The project has been secured by its subsidiary JSW Neo Energy Ltd (JSW Neo) against a tariff-based competitive bid invited for setting up of 1,500 MW (Interstate Transmission System) ISTS-connected solar power projects, JSW Energy said in an exchange filing.JSW Energy gets 700 MW solar project from SJVN","content":"JSW Energy on Tuesday said it has bagged a 700 Megawatt (MW) solar project from state-owned SJVN. The project has been secured by its subsidiary JSW Neo Energy Ltd (JSW Neo) against a tariff-based competitive bid invited for setting up of 1,500 MW (Interstate Transmission System) ISTS-connected solar power projects, JSW Energy said in an exchange filing. Following the letter of award (LoA) of 700 MW capacity from SJVN Ltd, the company's total locked-in capacity increased to 11.0 Gigawatt (GW) comprising 1.4 GW of solar capacity, it said. Further, JSW Energy said it has a total locked-in generation capacity of 11.0 GW, which includes 7.2 GW in operation, 2.6 GW under construction in wind, thermal, and hydro, and LoAs for 1.2 GW capacity from SECI (Tranche - XVI) and SJVN. In addition, the company has 3.4 GWh of locked-in energy storage capacity by means of a battery energy storage system and hydro-pumped storage project. The company expects to have 9.8 GW of operational generation capacity by CY2024, up from the current operational capacity of 7.2 GW. JSW Energy has set an ambitious target for a 50 per cent reduction in carbon footprint by 2030 and achieving Carbon Neutrality by 2050. ","cleaned_content":"jsw energy on tuesday said it has bagged a \u003cSEVEN_HUNDRED\u003e megawatt mw solar project from state owned sjvn the project has been secured by its subsidiary jsw neo energy ltd jsw neo against a tariff based competitive bid invited for setting up of \u003cONE_THOUSAND\u003e mw interstate transmission system ists connected solar power projects jsw energy said in an exchange filing following the letter of award loa of \u003cSEVEN_HUNDRED\u003e mw capacity from sjvn ltd the companys total locked in capacity increased to \u003cONE_TEN\u003e gigawatt gw comprising \u003cONE_\u003e gw of solar capacity it said further jsw energy said it has a total locked in generation capacity of \u003cONE_TEN\u003e gw which includes \u003cSEVEN_\u003e gw in operation \u003cTWO_\u003e gw under construction in wind thermal and hydro and loas for \u003cONE_\u003e gw capacity from seci tranche xvi and sjvn in addition the company has \u003cTHREE_\u003e gwh of locked in energy storage capacity by means of a battery energy storage system and hydro pumped storage project the company expects to have \u003cNINE_\u003e gw of operational generation capacity by cy2024 up from the current operational capacity of \u003cSEVEN_\u003e gw jsw energy has set an ambitious target for a \u003cFIVE_TEN_PERCENT\u003e reduction in carbon footprint by \u003cTWO_THOUSAND\u003e and achieving carbon neutrality by \u003cTWO_THOUSAND\u003e","timestamp":"2024-02-27T12:51:00+05:30","market_timestamp":"2024-02-27T12:51:00+05:30","off_market_hours":false}