{"url":"https://www.moneycontrol.com/news/business/fmcg-sector-to-see-subdued-growth-till-september-quarter-of-2024-says-kantar-report-12419181.html","title":"FMCG sector to see subdued growth till September quarter of 2024, says Kantar report","description":"The agricultural sector has uncertainty and the upcoming general elections would not surge the consumption of FMCG (fast-moving consumer goods) products, according to Kantar Worldpanel's FMCG pulse report.FMCG sector to see subdued growth till September quarter of 2024, says Kantar reportRelated stories","content":"The fast-moving consumer goods sector will have a \"subdued\" growth till September quarter in 2024 due to factors including an uncertain outlook for the agricultural sector, said a report from data, insights, and consulting firm Kantar. The agricultural sector has uncertainty and the upcoming general elections would not surge the consumption of FMCG (fast-moving consumer goods) products, according to Kantar Worldpanel's FMCG pulse report. But it expects growth to get \"progressively\" better after September, and the year might yet turn good, especially in the second half, helped by good Rabi harvests. \"As a result, we do see FMCG growth to be subdued, at least until Q3 of 2024. Keeping in mind the stronger first half of 2023, we may even end up seeing some stagnation in the early part of the year, with things getting progressively better,\" it said. Over the general election, which is supposed to be in the June quarter of 2024, the report said the past election years did not see any surge in FMCG. \"On the contrary with all the freebies announced there was only stagnation or shrinkage,\" it said. In 2009 the consumption growth was 0.7 per cent, in 2014 it was static and in 2019 it was negative, it added. \"While the voter, and therefore the consumer has evolved from then to now, we really do not see FMCG at the national level being impacted significantly due to the general elections,\" it said. Regarding the agricultural growth of India, the report said it is projected to be at 1.8 per cent in 2023-24, which is a seven-year low. \"As per the first estimates of Kharif crops released, almost all Kharif crops have seen lower yields due to uneven rainfall. This is likely to impact the first half of 2024,\" said the report. However, the Rabi sowing, though mildly disturbed is much better, with record hectarage under the wheat crop, the year might yet turn good, especially in the second half. Over the year 2023, the report said after the pandemic, this is the second straight year where average purchase quantity has failed to grow. Out of the over 90 categories and subcategories, which it tracked, half of them \"either lost consumption or were static\". The biggest such average consumption drop was seen for cooking oils, where 1.4 fewer litres were purchased in 2023, compared to 2022, while the average spend on the category has gone up by Rs 95. \"In reality, if shoppers were purchasing the 2022 quantity with 2023 prices, they would have been spending Rs 286 extra, however, the drop in consumption of the category has reduced this extra spend to the aforementioned Rs 95,\" it said. Atta has continued to grow in double digits, throughout 2023, and as a result though FMCG seemed to have grown at a handsome 6.1 per cent in 2023, it said. \"Removing Atta from the mix brought the growth down to 2.7 per cent. Incidentally, 2.7 per cent is also the population growth in the year, which meant that FMCG volumes have grown purely on the basis of household population growth,\" the report said. ","cleaned_content":"the fast moving consumer goods sector will have a subdued growth till september quarter in \u003cTWO_THOUSAND\u003e due to factors including an uncertain outlook for the agricultural sector said a report from data insights and consulting firm kantar the agricultural sector has uncertainty and the upcoming general elections would not surge the consumption of fmcg fast moving consumer goods products according to kantar worldpanels fmcg pulse report but it expects growth to get progressively better after september and the year might yet turn good especially in the second half helped by good rabi harvests as a result we do see fmcg growth to be subdued at least until q3 of \u003cTWO_THOUSAND\u003e keeping in mind the stronger first half of \u003cTWO_THOUSAND\u003e we may even end up seeing some stagnation in the early part of the year with things getting progressively better it said over the general election which is supposed to be in the june quarter of \u003cTWO_THOUSAND\u003e the report said the past election years did not see any surge in fmcg on the contrary with all the freebies announced there was only stagnation or shrinkage it said in \u003cTWO_THOUSAND\u003e the consumption growth was \u003cZERO_PERCENT\u003e in \u003cTWO_THOUSAND\u003e it was static and in \u003cTWO_THOUSAND\u003e it was negative it added while the voter and therefore the consumer has evolved from then to now we really do not see fmcg at the national level being impacted significantly due to the general elections it said regarding the agricultural growth of india the report said it is projected to be at \u003cONE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e which is a seven year low as per the first estimates of kharif crops released almost all kharif crops have seen lower yields due to uneven rainfall this is likely to impact the first half of \u003cTWO_THOUSAND\u003e said the report however the rabi sowing though mildly disturbed is much better with record hectarage under the wheat crop the year might yet turn good especially in the second half over the year \u003cTWO_THOUSAND\u003e the report said after the pandemic this is the second straight year where average purchase quantity has failed to grow out of the over \u003cNINE_TEN\u003e categories and subcategories which it tracked half of them either lost consumption or were static the biggest such average consumption drop was seen for cooking oils where \u003cONE_\u003e fewer litres were purchased in \u003cTWO_THOUSAND\u003e compared to \u003cTWO_THOUSAND\u003e while the average spend on the category has gone up by rs \u003cNINE_TEN\u003e in reality if shoppers were purchasing the \u003cTWO_THOUSAND\u003e quantity with \u003cTWO_THOUSAND\u003e prices they would have been spending rs \u003cTWO_HUNDRED\u003e extra however the drop in consumption of the category has reduced this extra spend to the aforementioned rs \u003cNINE_TEN\u003e it said atta has continued to grow in double digits throughout \u003cTWO_THOUSAND\u003e and as a result though fmcg seemed to have grown at a handsome \u003cSIX_PERCENT\u003e in \u003cTWO_THOUSAND\u003e it said removing atta from the mix brought the growth down to \u003cTWO_PERCENT\u003e incidentally \u003cTWO_PERCENT\u003e is also the population growth in the year which meant that fmcg volumes have grown purely on the basis of household population growth the report said","timestamp":"2024-03-07T13:51:00+05:30","market_timestamp":"2024-03-07T13:51:00+05:30","off_market_hours":false}