{"url":"https://www.moneycontrol.com/news/technology/sunil-chemmankotil-quits-as-teamlease-digital-ceo-neeti-sharma-appointed-new-chief-12363721.html","title":"Sunil Chemmankotil quits as Teamlease Digital CEO; Neeti Sharma appointed new chief","description":"Sunil would have served two years at the helm, when he exits  the company next month.Neeti Sharma will take over as CEO of Teamlease Digital  with effect from March 26.Related stories","content":"Staffing firm Teamlease Digital's chief executive officer Sunil Chemmankotil resigned from his post on February 27 to pursue \"new challenges\" and \"opportunities\". The staffing firm has appointed Neeti Sharma as the new CEO of the company, with effect from March 26. \"Sunil Chemmankotil will be relieved from the services of the company with effect from end of business hours of March 25, 2024,\" the company said in an exchange filing. TeamLease Digital is a subsidiary of TeamLease Services Limited, which offers technology staffing services in information technology, telecom, engineering, ed-tech, health-tech and gaming industries. The company said Sharma, his successor, has established numerous new business portfolios and managed diverse disciplines and business functions in key strategic roles. At present, Sharma is the president \u0026 co-founder of TeamLease Edtech, according to her LinkedIn profile. \"She brings with her a unique, holistic understanding of all stakeholders that contribute to India’s workforce... she has developed and showcased adept stakeholder management abilities,\" the company said in the release. ","cleaned_content":"staffing firm teamlease digitals chief executive officer sunil chemmankotil resigned from his post on february \u003cTWO_TEN\u003e to pursue new challenges and opportunities the staffing firm has appointed neeti sharma as the new ceo of the company with effect from march \u003cTWO_TEN\u003e sunil chemmankotil will be relieved from the services of the company with effect from end of business hours of march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the company said in an exchange filing teamlease digital is a subsidiary of teamlease services limited which offers technology staffing services in information technology telecom engineering ed tech health tech and gaming industries the company said sharma his successor has established numerous new business portfolios and managed diverse disciplines and business functions in key strategic roles at present sharma is the president co founder of teamlease edtech according to her linkedin profile she brings with her a unique holistic understanding of all stakeholders that contribute to india s workforce she has developed and showcased adept stakeholder management abilities the company said in the release","timestamp":"2024-02-27T16:26:00+05:30","market_timestamp":"2024-02-28T09:15:00+05:30","off_market_hours":true}