{"url":"https://www.moneycontrol.com/news/business/biocon-biologics-settles-patent-issue-paves-way-for-launch-of-biosimilar-product-in-canada-12397251.html","title":"Biocon Biologics settles patent issue; paves way for launch of biosimilar product in Canada","description":"The settlement pact paves the way for the introduction of Yesafili, a proposed biosimilar to Eeylea (aflibercept) injection, in the Canadian market, Biocon Biologics said in a regulatory filing.Biocon Biologics settles patent issue; paves way for launch of biosimilar product in Canada","content":"Biocon Biologics on Monday said it has inked a patent settlement agreement with Bayer Inc and Regeneron Pharmaceuticals Inc, paving the way for it to launch a biosimilar product in Canada. The settlement pact paves the way for the introduction of Yesafili, a proposed biosimilar to Eeylea (aflibercept) injection, in the Canadian market, Biocon Biologics said in a regulatory filing. Under the terms of the agreement, Biocon Biologics has secured a launch date for the product no later than July 1, 2025, it added. In March 2023, Health Canada had granted tentative approval for Yesafili (2 mg vials), subject to the resolution of any patent issues, Biocon Biologics said. The settlement resolves multiple parallel patent infringement proceedings in the Federal Court of Canada involving six patents, and associated judicial review proceedings, under Canada's Patented Medicines (Notice of Compliance) Regulations addressing pre-entry pharmaceutical patent litigation, it noted. ","cleaned_content":"biocon biologics on monday said it has inked a patent settlement agreement with bayer inc and regeneron pharmaceuticals inc paving the way for it to launch a biosimilar product in canada the settlement pact paves the way for the introduction of yesafili a proposed biosimilar to eeylea aflibercept injection in the canadian market biocon biologics said in a regulatory filing under the terms of the agreement biocon biologics has secured a launch date for the product no later than july \u003cONE_\u003e \u003cTWO_THOUSAND\u003e it added in march \u003cTWO_THOUSAND\u003e health canada had granted tentative approval for yesafili \u003cTWO_\u003e mg vials subject to the resolution of any patent issues biocon biologics said the settlement resolves multiple parallel patent infringement proceedings in the federal court of canada involving six patents and associated judicial review proceedings under canadas patented medicines notice of compliance regulations addressing pre entry pharmaceutical patent litigation it noted","timestamp":"2024-03-04T11:33:00+05:30","market_timestamp":"2024-03-04T11:33:00+05:30","off_market_hours":false}