{"url":"https://www.moneycontrol.com/news/business/indias-insourcing-boom-does-not-spell-doom-for-outsourcing-tech-executives-say-12360921.html","title":"India's 'insourcing' boom does not spell doom for outsourcing, tech executives say","description":"Companies opened 118 global capability centers (GCCs) in India over the past two years in a boost to 'insourcing' efforts, taking their total count to over 1,620, February data from the industry body showed.India's 'insourcing' boom does not spell doom for outsourcing, tech executives sayRelated stories","content":"Global companies are setting up more offices in India and expanding in-house teams but that does not mean the end of the road for Indian IT firms, which rely heavily on outsourcing deals, executives said at a Nasscom event last week. Companies opened 118 global capability centers (GCCs) in India over the past two years in a boost to 'insourcing' efforts, taking their total count to over 1,620, February data from the industry body showed. IT firms are helping GCCs scale up, innovate and do much more, said Ananth Chandramouli, the India managing director of French IT firm Capgemini. Other industry insiders agreed. Satish HC, executive vice president and co-head of delivery at India's No.2 software services exporter Infosys, said its strategy was to work with GCCs, no matter which route they took to drive innovation. \"If somebody wants to scale up their captive (offshore unit), we will co-exist and work with them. If somebody wants to create a captive and ask us for a BOT (build-operate-transfer) deal, we will be glad to do a BOT deal,\" he said, adding that it was important to \"be collaborative and not be prescriptive\". The comments come as some industry watchers are cautioning that India's rise as a GCC powerhouse could dent the revenue of IT firms, which have made a fortune by helping address overseas clients' tech needs. \"Overall revenue growth can be impacted for companies with high exposure to heavily insourcing clients,\" Kotak Institutional Equities said in a December note, referring to the banking, financial services and insurance sectors in particular. \"While insourcing has been on the rise, it has not reached alarming levels yet.\" Attendees at the Nasscom event sang a different tune, saying that the two models could co-exist. \"MNCs are not taking outsourced spend and rechanneling it to GCCs, most of the GCC ramp-up is driven by migration of existing insourced spend,\" said Anuj Kadyan, senior partner at consulting firm McKinsey. Some said the pie was big enough for everyone. \"There is enough tech spends to be shared between GCCs and traditional IT players. The usual ratio is 60% is insourced and 40% with outsourced partners,\" said SAP Labs India Managing Director Sindhu Gangadharan. \"We don't see any changes in that.\" ","cleaned_content":"global companies are setting up more offices in india and expanding in house teams but that does not mean the end of the road for indian it firms which rely heavily on outsourcing deals executives said at a nasscom event last week companies opened \u003cONE_HUNDRED\u003e global capability centers gccs in india over the past two years in a boost to insourcing efforts taking their total count to over \u003cONE_THOUSAND\u003e february data from the industry body showed it firms are helping gccs scale up innovate and do much more said ananth chandramouli the india managing director of french it firm capgemini other industry insiders agreed satish hc executive vice president and co head of delivery at indias no 2 software services exporter infosys said its strategy was to work with gccs no matter which route they took to drive innovation if somebody wants to scale up their captive offshore unit we will co exist and work with them if somebody wants to create a captive and ask us for a bot build operate transfer deal we will be glad to do a bot deal he said adding that it was important to be collaborative and not be prescriptive the comments come as some industry watchers are cautioning that indias rise as a gcc powerhouse could dent the revenue of it firms which have made a fortune by helping address overseas clients tech needs overall revenue growth can be impacted for companies with high exposure to heavily insourcing clients kotak institutional equities said in a december note referring to the banking financial services and insurance sectors in particular while insourcing has been on the rise it has not reached alarming levels yet attendees at the nasscom event sang a different tune saying that the two models could co exist mncs are not taking outsourced spend and rechanneling it to gccs most of the gcc ramp up is driven by migration of existing insourced spend said anuj kadyan senior partner at consulting firm mckinsey some said the pie was big enough for everyone there is enough tech spends to be shared between gccs and traditional it players the usual ratio is \u003cSIX_TEN_PERCENT\u003e is insourced and \u003cFOUR_TEN_PERCENT\u003e with outsourced partners said sap labs india managing director sindhu gangadharan we dont see any changes in that","timestamp":"2024-02-27T12:48:00+05:30","market_timestamp":"2024-02-27T12:48:00+05:30","off_market_hours":false}