{"url":"https://www.moneycontrol.com/news/business/mizuho-courting-india-elite-shows-japan-banks-global-ambition-12360401.html","title":"Mizuho courting India elite shows Japan banks’ global ambition","description":"Mizuho’s celebration with its biggest clients also underscores inroads made by Japan megabanks in the world’s most populous country as global banks look for alternatives to China. Mizuho courting India elite shows Japan banks’ global ambitionRelated stories","content":"Mizuho Financial Group Inc.’s showcase of its business ties at Mumbai’s luxury St Regis hotel this month underscored its growing foothold in India, a market that has lately been endorsed by Wall Street giants. An awards ceremony to fete financial professionals drew more than 150 executives from companies, including those backed by the country’s richest men Mukesh Ambani and Gautam Adani, according to people familiar with the matter. The Japanese bank hosted the event that’s now in its second year to build closer ties with the business community. It came as Mizuho announced its biggest-ever acquisition in India. Mizuho’s celebration with its biggest clients also underscores inroads made by Japan megabanks in the world’s most populous country as global banks look for alternatives to China. They’ve vaulted to become the country’s largest arrangers of offshore loans, tapping into the appetite of tycoons to grow their empire. When the Adani Group sought to tout its deep bank ties last year in its rebuttal against short seller Hindenburg Research’s allegations, the Japanese lenders surfaced on the list as major backers in Asia. Mizuho’s bigger Japanese peers Mitsubishi UFJ Financial Group Inc. and Sumitomo Mitsui Financial Group Inc. rank among the top arrangers of Indian offshore loans in the last few years. They were toppled by HSBC Holdings Plc. last year. Notably, the Wall Street banks so far have rarely featured highly in these league tables. Major US banks may be more constrained by concerns over backlash from their shareholders on their lending relationships, especially those that are in the spotlight for negative news, people familiar with the matter said. Mizuho’s loan portfolio has shifted from lending largely to government entities to backing large Indian companies, the people said, asking not to be identified discussing strategic information. The bank hired Piyush Agarwal from HSBC in 2019 where he was previously head of large local corporates in India. It has also tapped several senior client coverage bankers from other rivals to help expand its customer base, the people said, helping it forge lending ties with Reliance, JSW Group and Tata Group companies. “India’s potential is not limited to its population,” a Mizuho spokesman said in response to queries from Bloomberg News. “Multiple factors are behind its potential: English being its official second language, plenty of math and IT talents, geographic advantage being in the middle of Indian Ocean, connecting Asia and Western Europe.” He said the bank plans to further grow in the country, without elaborating.  At Japan’s biggest bank MUFG, Shashank Joshi, deputy chief executive officer in India, is seen as the key driver for its business in the country, helping to form bridges with the most important companies and local lenders. During the throes of Adani’s Hindenburg crisis for example, MUFG was among lenders that facilitated roadshows across the world as the conglomerate sought to win back investor trust. MUFG CEO Hironori Kamezawa told Bloomberg News in an interview last year that India’s appeal is rising in comparison with China, and the bank continues to push growth there. At Sumitomo Mitsui, its new CEO Toru Nakashima said Japan’s second-largest lender is mulling how to become more of a full-fledged financial player in India. The banks didn’t elaborate further on their ambitions. Chief business officer Rakesh Garg who joined Sumitomo Mitsui from Barclays Plc after more than 15 years at the British firm has been working to expand the client base and is also focusing on green financing, the people said. Sandeep Chopra, a veteran banker who was most recently at DBS Group Holdings Ltd., joined the bank in December to head its corporate coverage. “Familiarity and success in the Indian market further incentivize Japanese banks to expand their operations in India,” said Sridharan.  ","cleaned_content":"mizuho financial group inc s showcase of its business ties at mumbai s luxury st regis hotel this month underscored its growing foothold in india a market that has lately been endorsed by wall street giants an awards ceremony to fete financial professionals drew more than \u003cONE_HUNDRED\u003e executives from companies including those backed by the country s richest men mukesh ambani and gautam adani according to people familiar with the matter the japanese bank hosted the event that s now in its second year to build closer ties with the business community it came as mizuho announced its biggest ever acquisition in india mizuho s celebration with its biggest clients also underscores inroads made by japan megabanks in the world s most populous country as global banks look for alternatives to china they ve vaulted to become the country s largest arrangers of offshore loans tapping into the appetite of tycoons to grow their empire when the adani group sought to tout its deep bank ties last year in its rebuttal against short seller hindenburg research s allegations the japanese lenders surfaced on the list as major backers in asia mizuho s bigger japanese peers mitsubishi ufj financial group inc and sumitomo mitsui financial group inc rank among the top arrangers of indian offshore loans in the last few years they were toppled by hsbc holdings plc last year notably the wall street banks so far have rarely featured highly in these league tables major us banks may be more constrained by concerns over backlash from their shareholders on their lending relationships especially those that are in the spotlight for negative news people familiar with the matter said mizuho s loan portfolio has shifted from lending largely to government entities to backing large indian companies the people said asking not to be identified discussing strategic information the bank hired piyush agarwal from hsbc in \u003cTWO_THOUSAND\u003e where he was previously head of large local corporates in india it has also tapped several senior client coverage bankers from other rivals to help expand its customer base the people said helping it forge lending ties with reliance jsw group and tata group companies india s potential is not limited to its population a mizuho spokesman said in response to queries from bloomberg news multiple factors are behind its potential english being its official second language plenty of math and it talents geographic advantage being in the middle of indian ocean connecting asia and western europe he said the bank plans to further grow in the country without elaborating at japan s biggest bank mufg shashank joshi deputy chief executive officer in india is seen as the key driver for its business in the country helping to form bridges with the most important companies and local lenders during the throes of adani s hindenburg crisis for example mufg was among lenders that facilitated roadshows across the world as the conglomerate sought to win back investor trust mufg ceo hironori kamezawa told bloomberg news in an interview last year that india s appeal is rising in comparison with china and the bank continues to push growth there at sumitomo mitsui its new ceo toru nakashima said japan s second largest lender is mulling how to become more of a full fledged financial player in india the banks didn t elaborate further on their ambitions chief business officer rakesh garg who joined sumitomo mitsui from barclays plc after more than \u003cONE_TEN\u003e years at the british firm has been working to expand the client base and is also focusing on green financing the people said sandeep chopra a veteran banker who was most recently at dbs group holdings ltd joined the bank in december to head its corporate coverage familiarity and success in the indian market further incentivize japanese banks to expand their operations in india said sridharan","timestamp":"2024-02-27T12:19:00+05:30","market_timestamp":"2024-02-27T12:19:00+05:30","off_market_hours":false}