{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-minus-zero-partner-to-deploy-autonomous-trucking-solutions-12485231.html","title":"Ashok Leyland, Minus Zero partner to deploy autonomous trucking solutions","description":"Bengaluru-based Minus Zero is an autonomous driving technology startup and this partnership aims to revolutionise commercial trucking through autonomous solutions at scale.Ashok Leyland, Minus Zero partner to deploy autonomous trucking solutionsRelated stories","content":"Hinduja Group flagship company Ashok Leyland on Tuesday said it has signed a strategic alliance with Minus Zero aimed at developing tailored autonomous trucking solutions in the country. Bengaluru-based Minus Zero is an autonomous driving technology startup and this partnership aims to revolutionise commercial trucking through autonomous solutions at scale. The initial focus of this collaboration will be on developing autonomous trucking solutions for ports, factory operations and corporate campuses, the city-based heavy commercial vehicle maker said in a company statement.With global regulations and infrastructure evolving to support autonomous driving, this collaboration can extend to offer joint product offerings to international markets. \"Minus Zero's capabilities and plans impressed us, and we are excited to be working with them to develop India-specific solutions that can be scaled globally,\" he added. The collaboration between the two entities also includes hub-to-hub applications and long-haul trucking, subject to evolving regulatory frameworks surrounding autonomous driving. \"...we are excited to partner with them in this journey of accelerating autonomous driving in India and globally. With our nature-inspired AI, we are bringing a paradigm shift by building Foundational AI models for autonomous driving,\" said Minus Zero CEO and Co-Founder Gagandeep Reehal.\"his partnership marks the beginning of India's autonomous driving story,\" he added. ","cleaned_content":"hinduja group flagship company ashok leyland on tuesday said it has signed a strategic alliance with minus zero aimed at developing tailored autonomous trucking solutions in the country bengaluru based minus zero is an autonomous driving technology startup and this partnership aims to revolutionise commercial trucking through autonomous solutions at scale the initial focus of this collaboration will be on developing autonomous trucking solutions for ports factory operations and corporate campuses the city based heavy commercial vehicle maker said in a company statement with global regulations and infrastructure evolving to support autonomous driving this collaboration can extend to offer joint product offerings to international markets minus zeros capabilities and plans impressed us and we are excited to be working with them to develop india specific solutions that can be scaled globally he added the collaboration between the two entities also includes hub to hub applications and long haul trucking subject to evolving regulatory frameworks surrounding autonomous driving we are excited to partner with them in this journey of accelerating autonomous driving in india and globally with our nature inspired ai we are bringing a paradigm shift by building foundational ai models for autonomous driving said minus zero ceo and co founder gagandeep reehal his partnership marks the beginning of indias autonomous driving story he added","timestamp":"2024-03-19T17:06:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}