{"url":"https://www.moneycontrol.com/news/business/adani-bonds-shares-decline-as-us-expands-probe-into-the-group-12478781.html","title":"Adani bonds, shares decline as US expands probe into the group","description":"A note from unit Adani Ports \u0026 Special Economic Zone Ltd. due in 2041 slid 2.4 cents, the most since August, to 79.1 cents. Another bond from subsidiary Adani Renewable Energy RJ Ltd. due 2039 fell 2.3 cents to 83 cents, the worst drop since February 2023. The development comes a year after short-seller Hindenburg Research accused Adani of fraud and market manipulation, charges denied by the conglomerate. Related stories","content":"Several of Adani Group’s dollar bonds fell the most in more than half a year, after news that US prosecutors have widened their probe of the port-to-power conglomerate to focus on whether it may have engaged in bribery. Most of the group’s shares declined. A note from unit Adani Ports \u0026 Special Economic Zone Ltd. due in 2041 slid 2.4 cents, the most since August, to 79.1 cents. Another bond from subsidiary Adani Renewable Energy RJ Ltd. due 2039 fell 2.3 cents to 83 cents, the worst drop since February 2023. That pares gains in recent months that sent the securities to their highest levels since 2022. Flagship Adani Enterprises Ltd. was among biggest decliners, falling as much as 5%. Shares of other group companies dropped in the range of 3%-8% before paring some of those losses.  US investigators are digging into whether an Adani entity, or people linked to the company including Gautam Adani, were involved in paying officials in India for favorable treatment on an energy project, according to people with direct knowledge of the matter. The probe, which is also looking at Indian renewable energy company Azure Power Global Ltd., is being handled by the US Attorney’s Office for the Eastern District of New York and the Justice Department’s fraud unit in Washington, said people familiar with the matter. “We are not aware of any investigation against our chairman,” Adani Group said in an emailed statement. “As a business group that operates with the highest standards of governance, we are subject to and fully compliant with anti-corruption and anti-bribery laws in India and other countries.” Gautam Adani, his company and Azure haven’t been charged with wrongdoing by the Justice Department, and investigations don’t always lead to prosecutions. Adani’s sprawling empire was rocked early last year by claims from short-seller Hindenburg Research that the conglomerate manipulated its stock price and committed accounting fraud. The group has vigorously denied those allegations and the shares have largely climbed back from their initial plunge. Still, the report prompted the Justice Department, as well as the Securities and Exchange Commission, to look into some of the claims, Bloomberg News reported last year. While the probe from US prosecutors will cast a shadow on the group, investor sentiment toward its firms has continued to improve as it trimmed debt, pared founders’ share pledges and successfully sold a dollar bond earlier this month. The combined market value of Adani Group’s listed firms has more than doubled to about $190 billion from last year’s lows. It is still more than $40 billion short of the level seen prior to Hindenburg’s wide-ranging allegations. ","cleaned_content":"several of adani group s dollar bonds fell the most in more than half a year after news that us prosecutors have widened their probe of the port to power conglomerate to focus on whether it may have engaged in bribery most of the group s shares declined a note from unit adani ports special economic zone ltd due in \u003cTWO_THOUSAND\u003e slid \u003cTWO_\u003e cents the most since august to \u003cSEVEN_TEN\u003e cents another bond from subsidiary adani renewable energy rj ltd due \u003cTWO_THOUSAND\u003e fell \u003cTWO_\u003e cents to \u003cEIGHT_TEN\u003e cents the worst drop since february \u003cTWO_THOUSAND\u003e that pares gains in recent months that sent the securities to their highest levels since \u003cTWO_THOUSAND\u003e flagship adani enterprises ltd was among biggest decliners falling as much as \u003cFIVE_PERCENT\u003e shares of other group companies dropped in the range of \u003cTHREE_PERCENT\u003e \u003cEIGHT_PERCENT\u003e before paring some of those losses us investigators are digging into whether an adani entity or people linked to the company including gautam adani were involved in paying officials in india for favorable treatment on an energy project according to people with direct knowledge of the matter the probe which is also looking at indian renewable energy company azure power global ltd is being handled by the us attorney s office for the eastern district of new york and the justice department s fraud unit in washington said people familiar with the matter we are not aware of any investigation against our chairman adani group said in an emailed statement as a business group that operates with the highest standards of governance we are subject to and fully compliant with anti corruption and anti bribery laws in india and other countries gautam adani his company and azure haven t been charged with wrongdoing by the justice department and investigations don t always lead to prosecutions adani s sprawling empire was rocked early last year by claims from short seller hindenburg research that the conglomerate manipulated its stock price and committed accounting fraud the group has vigorously denied those allegations and the shares have largely climbed back from their initial plunge still the report prompted the justice department as well as the securities and exchange commission to look into some of the claims bloomberg news reported last year while the probe from us prosecutors will cast a shadow on the group investor sentiment toward its firms has continued to improve as it trimmed debt pared founders share pledges and successfully sold a dollar bond earlier this month the combined market value of adani group s listed firms has more than doubled to about \u003cONE_HUNDRED\u003e billion from last year s lows it is still more than \u003cFOUR_TEN\u003e billion short of the level seen prior to hindenburg s wide ranging allegations","timestamp":"2024-03-18T15:12:00+05:30","market_timestamp":"2024-03-18T15:12:00+05:30","off_market_hours":false}