{"url":"https://www.moneycontrol.com/news/business/indianoil-set-to-join-high-table-of-f1-fuel-producers-12435861.html","title":"IndianOil set to join high table of F1 fuel producers","description":"The firm's refinery at Paradip in Odisha will in three months produce the petrol used in F1 car racing, its chairman Shrikant Madhav Vaidya said.IndianOil set to join high table of F1 fuel producersRelated stories","content":"After delivering back-to-back innovations in fuel grades, Indian Oil Corporation (IOC) has now set sight on the Grand Prix and will in next three months start producing fuel used in adrenaline-pumping Formula One or F1, motor racing. The firm's refinery at Paradip in Odisha will in three months produce the petrol used in F1 car racing, its chairman Shrikant Madhav Vaidya said. IOC, the country's largest oil firm controlling roughly 40 per cent of fuel market share, will be the first Indian company and only a handful globally that will produce fuel used in F1 racing. F1 fuel is essentially high-octane petrol and the standards are heavily regulated by global motor sport governing body Federation Internationale de l'Automobile (FIA) on various counts, including permissible additives and blending agents. IOC had in October last year helped India join a select league of nations when it began producing highly specialised 'reference' petrol and diesel that are used for testing automobiles. There are only three suppliers of reference fuels globally including US giant Chevron. IOC's Paradip refinery in Odisha is producing 'reference' grade petrol and its Panipat unit in Haryana produces similar quality diesel. Prior to this, Indian automobile manufacturers had to use imported reference fuel for testing cars and motorcycles. Now, IOC is supplying them the same grade fuel at much cheaper cost. Fuel retailers like IOC sell petrol and diesel of primarily two kinds - regular and premium, through their fuel station network. The biggest difference between the normal and premium fuel lies in the octane number. The regular fuel has an octane number of 87, but premium fuel has an octane number of 91. Reference grade fuel comes with a 97 octane number. The octane number is nothing but a unit to measure the ignition quality of petrol or diesel. Vaidya said his company has three premium fuels - 95-Octane XP95 petrol and 100-Octane XP100 petrol used in high-end luxury cars and bikes. It also has high performance XtraGreen diesel that offers higher fuel economy, reduced noise and emits lesser particulate matter, carbon monoxide and nitrogen oxides. \"XtraGreen diesel is a real game changer fuel. It is catching up fast and now makes up for about 8 per cent of all diesel that IOC sells,\" he said.He said IOC has entered the racing fuels segment with its high-octane 'Storm' petrol for motorcycle racing. The company will be the official fuel partner for the Federation Internationale De Motocyclisme (FIM) Asia Road Racing Championship (ARRC) for three years -- 2024 to 2026, supplying 'Storm' petrol across all ARRC race rounds. IOC will supply fuel for all the motorcyclists from 15 countries that will participate in the FIM Asia Road Racing Championship. \"Our R\u0026D (research and development) in two months will be able to produce Category-1 fuel and in three months Formula 1 fuel,\" he said. \"Unless we go to F1, the journey is not complete.\" He said the 'Storm' fuel is being manufactured at the company's Koyali refinery in Gujarat. IOC makes XP100 at its Mathura refinery in Uttar Pradesh. F1 currently uses E10 fuel containing 10 per cent renewable ethanol. The percentage fuel coming from non-fossil sources, such as alcohol, algae or waste keeping, is to go up to 40 per cent this year and 100 per cent sustainable fuel from 2026. IOC would also start manufacturing similar grade fuel and thereafter pitch to automobile makers racing in F1, he said. Unlike FIM Asia Road Racing Championship where there is one single fuel supplier for all the motorcycles racing, F1 allows teams to select their own fuel supplier. For instance, Shell is the fuel supplier to Ferrari. \"This is just the beginning,\" Vaidya said. 'Storm - Ultimate Racing Fuel' provides faster acceleration, more power, smoother drivability, lower engine deposits and lower exhaust emissions. It is suitable for use in all racing championships (enduro, trial, circuit racing, motocross and supermoto, cross-country, e-bike, and track racing) in all classes of motorbikes requiring FIM Category 2 race fuels. F1 fuel will be a notch higher. It would fall under high octane premium road fuel with octane thresholds of 95 to 102. ","cleaned_content":"after delivering back to back innovations in fuel grades indian oil corporation ioc has now set sight on the grand prix and will in next three months start producing fuel used in adrenaline pumping formula one or f1 motor racing the firms refinery at paradip in odisha will in three months produce the petrol used in f1 car racing its chairman shrikant madhav vaidya said ioc the countrys largest oil firm controlling roughly \u003cFOUR_TEN_PERCENT\u003e of fuel market share will be the first indian company and only a handful globally that will produce fuel used in f1 racing f1 fuel is essentially high octane petrol and the standards are heavily regulated by global motor sport governing body federation internationale de lautomobile fia on various counts including permissible additives and blending agents ioc had in october last year helped india join a select league of nations when it began producing highly specialised reference petrol and diesel that are used for testing automobiles there are only three suppliers of reference fuels globally including us giant chevron iocs paradip refinery in odisha is producing reference grade petrol and its panipat unit in haryana produces similar quality diesel prior to this indian automobile manufacturers had to use imported reference fuel for testing cars and motorcycles now ioc is supplying them the same grade fuel at much cheaper cost fuel retailers like ioc sell petrol and diesel of primarily two kinds regular and premium through their fuel station network the biggest difference between the normal and premium fuel lies in the octane number the regular fuel has an octane number of \u003cEIGHT_TEN\u003e but premium fuel has an octane number of \u003cNINE_TEN\u003e reference grade fuel comes with a \u003cNINE_TEN\u003e octane number the octane number is nothing but a unit to measure the ignition quality of petrol or diesel vaidya said his company has three premium fuels \u003cNINE_TEN\u003e octane xp95 petrol and \u003cONE_HUNDRED\u003e octane xp100 petrol used in high end luxury cars and bikes it also has high performance xtragreen diesel that offers higher fuel economy reduced noise and emits lesser particulate matter carbon monoxide and nitrogen oxides xtragreen diesel is a real game changer fuel it is catching up fast and now makes up for about \u003cEIGHT_PERCENT\u003e of all diesel that ioc sells he said he said ioc has entered the racing fuels segment with its high octane storm petrol for motorcycle racing the company will be the official fuel partner for the federation internationale de motocyclisme fim asia road racing championship arrc for three years \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e supplying storm petrol across all arrc race rounds ioc will supply fuel for all the motorcyclists from \u003cONE_TEN\u003e countries that will participate in the fim asia road racing championship our r d research and development in two months will be able to produce category \u003cONE_\u003e fuel and in three months formula \u003cONE_\u003e fuel he said unless we go to f1 the journey is not complete he said the storm fuel is being manufactured at the companys koyali refinery in gujarat ioc makes xp100 at its mathura refinery in uttar pradesh f1 currently uses e10 fuel containing \u003cONE_TEN_PERCENT\u003e renewable ethanol the percentage fuel coming from non fossil sources such as alcohol algae or waste keeping is to go up to \u003cFOUR_TEN_PERCENT\u003e this year and \u003cONE_HUNDRED_PERCENT\u003e sustainable fuel from \u003cTWO_THOUSAND\u003e ioc would also start manufacturing similar grade fuel and thereafter pitch to automobile makers racing in f1 he said unlike fim asia road racing championship where there is one single fuel supplier for all the motorcycles racing f1 allows teams to select their own fuel supplier for instance shell is the fuel supplier to ferrari this is just the beginning vaidya said storm ultimate racing fuel provides faster acceleration more power smoother drivability lower engine deposits and lower exhaust emissions it is suitable for use in all racing championships enduro trial circuit racing motocross and supermoto cross country e bike and track racing in all classes of motorbikes requiring fim category \u003cTWO_\u003e race fuels f1 fuel will be a notch higher it would fall under high octane premium road fuel with octane thresholds of \u003cNINE_TEN\u003e to \u003cONE_HUNDRED\u003e","timestamp":"2024-03-11T12:48:00+05:30","market_timestamp":"2024-03-11T12:48:00+05:30","off_market_hours":false}