{"url":"https://www.moneycontrol.com/news/technology/zees-tech-and-data-head-resigns-as-company-streamlines-business-12468891.html","title":"Zee's tech and data head resigns as company streamlines business","description":"This comes days after the broadcaster announced strategic changes in the revenue vertical of the broadcast business. Zee said these steps are towards streamlining the organisation, and is expected to help optimise resource allocation and enhance productivity.Related stories","content":"Zee Entertainment, which is streamlining its business after the soured merger with Sony, has made changes in the technology and data vertical. Nitin Mittal, President, Technology and Data at Zee Entertainment, has tendered his resignation which has been accepted by MD and CEO, Punit Goenka. Amrit Thomas, responsible for Data Science, Kishore Krishnamurthy,responsible for Engineering, Bhushan Kolleri, responsible for Product and Vishal Somani, responsible for Enterprise and Content Technology will report into Amit Goenka, President – Digital Businesses \u0026 Platforms on an interim basis, the company said in a press release on March 15. Rahul Johri, who led the the revenue and monetization vertical, resigned from the post earlier this month. The company had said that with immediate effect, Ashish Sehgal, Chief Growth Officer, Advertisement Revenue, will directly report to Goenka. In line with the new lateral structure being implemented, Sehgal will now work closely with the MD \u0026 CEO, in order to maximise value for the advertisers. Zee said these steps are towards streamlining the organisation, and is expected to help optimise resource allocation and enhance productivity. It added that the steps taken by Goenka are aimed towards achieving a cost-effective structure, optimizing the resources and maintaining a sharp focus on quality. ","cleaned_content":"zee entertainment which is streamlining its business after the soured merger with sony has made changes in the technology and data vertical nitin mittal president technology and data at zee entertainment has tendered his resignation which has been accepted by md and ceo punit goenka amrit thomas responsible for data science kishore krishnamurthy responsible for engineering bhushan kolleri responsible for product and vishal somani responsible for enterprise and content technology will report into amit goenka president digital businesses platforms on an interim basis the company said in a press release on march \u003cONE_TEN\u003e rahul johri who led the the revenue and monetization vertical resigned from the post earlier this month the company had said that with immediate effect ashish sehgal chief growth officer advertisement revenue will directly report to goenka in line with the new lateral structure being implemented sehgal will now work closely with the md ceo in order to maximise value for the advertisers zee said these steps are towards streamlining the organisation and is expected to help optimise resource allocation and enhance productivity it added that the steps taken by goenka are aimed towards achieving a cost effective structure optimizing the resources and maintaining a sharp focus on quality","timestamp":"2024-03-15T20:55:00+05:30","market_timestamp":"2024-03-18T09:15:00+05:30","off_market_hours":true}