{"url":"https://www.moneycontrol.com/news/business/kkr-said-to-weigh-1-billion-sale-of-school-chain-eurokids-12464721.html","title":"KKR said to weigh $1 billion sale of school chain EuroKids","description":"The US private equity firm is looking to hire financial advisers to help evaluate a sale, the people said, asking not to be identified as the matter is private. KKR could seek a valuation of about $1 billion for its majority stake, the people said.KKR said to weigh $1 billion sale of school chain EuroKidsRelated stories","content":"KKR \u0026 Co is exploring options for EuroKids International, including selling its controlling stake in the Indian pre-school and early-learning chain, according to people familiar with the matter. The US private equity firm is looking to hire financial advisers to help evaluate a sale, the people said, asking not to be identified as the matter is private. KKR could seek a valuation of about $1 billion for its majority stake, the people said. Considerations are at an early stage and no final decisions have been made, they said, adding that KKR could decide not to pursue a deal. KKR bought a controlling stake in EuroKids for an undisclosed amount in 2019 from a consortium led by Indian private equity firm Gaja Capital. Established in 2001, Mumbai-based EuroKids has a presence in more than 350 cities, according to its website. The company is part of Lighthouse Learning, an early childhood and kindergarten education group. Others have been assessing their investments in education-related assets globally. EQT AB and Canada Pension Plan Investment Board have picked banks to advise them on a potential exit from Nord Anglia, Bloomberg News reported last month. They are considering seeking a valuation of about $15 billion for the international school operator, according to people familiar with the matter. Meanwhile, KKR is also exploring options for India’s JB Chemicals \u0026 Pharmaceuticals Ltd., including selling its majority stake as the company is attracting interest from potential buyers, Bloomberg reported in late February. ","cleaned_content":"kkr co is exploring options for eurokids international including selling its controlling stake in the indian pre school and early learning chain according to people familiar with the matter the us private equity firm is looking to hire financial advisers to help evaluate a sale the people said asking not to be identified as the matter is private kkr could seek a valuation of about \u003cONE_\u003e billion for its majority stake the people said considerations are at an early stage and no final decisions have been made they said adding that kkr could decide not to pursue a deal kkr bought a controlling stake in eurokids for an undisclosed amount in \u003cTWO_THOUSAND\u003e from a consortium led by indian private equity firm gaja capital established in \u003cTWO_THOUSAND\u003e mumbai based eurokids has a presence in more than \u003cTHREE_HUNDRED\u003e cities according to its website the company is part of lighthouse learning an early childhood and kindergarten education group others have been assessing their investments in education related assets globally eqt ab and canada pension plan investment board have picked banks to advise them on a potential exit from nord anglia bloomberg news reported last month they are considering seeking a valuation of about \u003cONE_TEN\u003e billion for the international school operator according to people familiar with the matter meanwhile kkr is also exploring options for india s jb chemicals pharmaceuticals ltd including selling its majority stake as the company is attracting interest from potential buyers bloomberg reported in late february","timestamp":"2024-03-15T11:11:00+05:30","market_timestamp":"2024-03-15T11:11:00+05:30","off_market_hours":false}