{"url":"https://www.moneycontrol.com/news/business/bat-is-said-to-launch-itc-selldown-as-soon-as-this-week-12441701.html","title":"BAT is said to launch ITC selldown as soon as this week","description":"London-listed BAT has been speaking with Bank of America Corp. and Citigroup Inc. about a potential divestment of around $2 billion to $3 billion in ITC stock through block trades, the people said.British American Tobacco logosRelated stories","content":"British American Tobacco Plc, the maker of Lucky Strike cigarettes, is preparing to kick off a sale of part of its stake in Indian partner ITC Ltd. as soon as this week, people with knowledge of the matter said. London-listed BAT has been speaking with Bank of America Corp. and Citigroup Inc. about a potential divestment of around $2 billion to $3 billion in ITC stock through block trades, the people said. Such deals are usually done at a discount to the market price. Details of the transaction could still change, and the launch of the offering may spill into next week depending on market conditions, the people said, asking not to be identified because the information is private. Shares of BAT rose after the Bloomberg News report and were up 1.4% at the close Monday in London. They’re down 23% over the past 12 months. BAT currently owns about 29% of Mumbai-listed ITC, according to data compiled by Bloomberg. ITC, an Indian conglomerate that gets a large portion of its revenue from cigarettes, also runs a variety of other businesses including food products and packaging. It also has a hotel business that it’s in the process of spinning off. Shares of ITC have slipped 11% in 2024 after more than doubling over the preceding two years. The benchmark S\u0026P BSE Sensex Index has risen about 2% this year. Representatives for Bank of America and Citigroup declined to comment. A spokesperson for ITC couldn’t immediately be reached for comment outside regular business hours. ","cleaned_content":"british american tobacco plc the maker of lucky strike cigarettes is preparing to kick off a sale of part of its stake in indian partner itc ltd as soon as this week people with knowledge of the matter said london listed bat has been speaking with bank of america corp and citigroup inc about a potential divestment of around \u003cTWO_\u003e billion to \u003cTHREE_\u003e billion in itc stock through block trades the people said such deals are usually done at a discount to the market price details of the transaction could still change and the launch of the offering may spill into next week depending on market conditions the people said asking not to be identified because the information is private shares of bat rose after the bloomberg news report and were up \u003cONE_PERCENT\u003e at the close monday in london they re down \u003cTWO_TEN_PERCENT\u003e over the past \u003cONE_TEN\u003e months bat currently owns about \u003cTWO_TEN_PERCENT\u003e of mumbai listed itc according to data compiled by bloomberg itc an indian conglomerate that gets a large portion of its revenue from cigarettes also runs a variety of other businesses including food products and packaging it also has a hotel business that it s in the process of spinning off shares of itc have slipped \u003cONE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e after more than doubling over the preceding two years the benchmark s p bse sensex index has risen about \u003cTWO_PERCENT\u003e this year representatives for bank of america and citigroup declined to comment a spokesperson for itc couldn t immediately be reached for comment outside regular business hours","timestamp":"2024-03-12T07:45:00+05:30","market_timestamp":"2024-03-12T09:15:00+05:30","off_market_hours":true}