{"url":"https://www.moneycontrol.com/news/business/gail-to-develop-lng-infrastructure-along-golden-quadrilateralnational-highways-mining-areas-to-invest-rs-650-cr-12459551.html","title":"GAIL to set up LNG infrastructure along national highways, mines; to invest Rs 650 cr","description":"It also aspires to capture 50 percent plus market share in next 5-6 years, as per a regulatory filingThe company also said it plans on reducing its carbon footprint by converting transport fuel from diesel to LNG. Related stories","content":"GAIL is planning to enter the Liquefied Natural Gas (LNG) retail sector by setting up LNG dispensing stations across golden quadrilateral/major national highways and mining areas with an investment plan of Rs 650 crore. The company also aspires to capture 50 percent plus market share in the next 5-6 years, according to a regulatory filing on March 14. The company also plans to reduce its carbon footprint by converting transport fuel from diesel to LNG. \"The proposed investment is strategic in nature which relates to exploring opportunity-based investment for the development of LNG dispensing infrastructure \u0026 last mile connectivity,\" they said. GAIL (India) Limited and its subsidiary GAIL Gas Limited have announced a of Rs. 2.50/kg price reduction in Compressed Natural Gas (CNG) prices across 20 key locations in India where they operate on March 9. The company reported a multi-fold increase in consolidated net profit at Rs 3,193.34 crore in the December quarter. The consolidated net profit of the country’s largest gas distributor was Rs 397.59 crore in the same period last year. ","cleaned_content":"gail is planning to enter the liquefied natural gas lng retail sector by setting up lng dispensing stations across golden quadrilateral major national highways and mining areas with an investment plan of rs \u003cSIX_HUNDRED\u003e crore the company also aspires to capture \u003cFIVE_TEN_PERCENT\u003e plus market share in the next \u003cFIVE_\u003e \u003cSIX_\u003e years according to a regulatory filing on march \u003cONE_TEN\u003e the company also plans to reduce its carbon footprint by converting transport fuel from diesel to lng the proposed investment is strategic in nature which relates to exploring opportunity based investment for the development of lng dispensing infrastructure last mile connectivity they said gail india limited and its subsidiary gail gas limited have announced a of rs \u003cTWO_\u003e kg price reduction in compressed natural gas cng prices across \u003cTWO_TEN\u003e key locations in india where they operate on march \u003cNINE_\u003e the company reported a multi fold increase in consolidated net profit at rs \u003cTHREE_THOUSAND\u003e crore in the december quarter the consolidated net profit of the country s largest gas distributor was rs \u003cTHREE_HUNDRED\u003e crore in the same period last year","timestamp":"2024-03-14T15:37:00+05:30","market_timestamp":"2024-03-15T09:15:00+05:30","off_market_hours":true}