{"url":"https://www.moneycontrol.com/news/business/indias-aviation-boom-could-support-more-hubs-air-india-ceo-campbell-wilson-12493051.html","title":"India’s aviation boom could support more hubs: Air India CEO Campbell Wilson","description":"Air India last year signed one of the largest-ever jet purchases in aviation history, ordering 470 aircraft from Airbus SE and Boeing Co. The world’s most-populous nation is characterized by a booming consumer class and economic growth that could transform it into one of the world’s largest travel markets. India’s aviation boom could support more hubs: Air India CEO Campbell WilsonRelated stories","content":"India’s airline industry is growing so fast that the country could support at least one other international hub beyond Mumbai and Delhi, Campbell Wilson, the chief executive officer of Air India Ltd., said. “India can be home to at least three hubs and plenty of point-to-point services,” Wilson said at an industry event in Gurugram on Wednesday. “There aren’t many other markets like India in the world. Northern India has a good east to west flow, while southern India can offer an Asia to Africa or Australia-Europe flow.” Air India last year signed one of the largest-ever jet purchases in aviation history, ordering 470 aircraft from Airbus SE and Boeing Co. The world’s most-populous nation is characterized by a booming consumer class and economic growth that could transform it into one of the world’s largest travel markets. Air India has taken delivery of one new aircraft every six days over the past six months and will continue to receive the same over the next 12 months. This month, it’s received 11 new Boeing 777s, three Airbus A350s and about 15 Boeing 737 Maxs, Wilson said. He added that the retrofitting of existing widebodies should be complete by the end of 2025 or 2026. “At the time of privatization, Air India had 43 wide-body aircraft for a population of 1.3 billion,” he said. “Singapore had 150 wide-body aircraft, Dubai had 250. That gives you a sense of how grossly underserved the Indian market was by Indian airlines.” As part of parent Tata Group’s plan to transform Air India, low-cost carriers Air India Express and AIX Connect will be merged into one entity, and Air India and Vistara will be combined into another. Earlier this month, the Competition and Consumer Commission of Singapore approved the merger between Air India and Vistara, a joint venture between Singapore Airlines Ltd. and the Tata Group. Singapore Airlines will get a 25.1% share in the enlarged entity, Wilson said on Wednesday. Read more: Air India Expects to Merge With Vistara by Year End, CEO Says “For the full service carrier, we have received all the competition clearances so our team are working together, sharing information and planning on what the combined entity looks like,” Wilson said. Air India’s transformation program, which includes a rebranding campaign to freshen the carrier’s image, has now been underway for the past 18 months. While the first six months was spent mainly on addressing past issues, over the last year, the focus has been on putting in place systems, people, processes and equipment, Wilson said. “We’ve injected nearly 5,000 people in the last 18 months, which has brought down the average age from 54 to 35 years,” Wilson said, adding that the airline’s IT systems had to be rebuilt from scratch when Tata Group took over from the government. ","cleaned_content":"india s airline industry is growing so fast that the country could support at least one other international hub beyond mumbai and delhi campbell wilson the chief executive officer of air india ltd said india can be home to at least three hubs and plenty of point to point services wilson said at an industry event in gurugram on wednesday there aren t many other markets like india in the world northern india has a good east to west flow while southern india can offer an asia to africa or australia europe flow air india last year signed one of the largest ever jet purchases in aviation history ordering \u003cFOUR_HUNDRED\u003e aircraft from airbus se and boeing co the world s most populous nation is characterized by a booming consumer class and economic growth that could transform it into one of the world s largest travel markets air india has taken delivery of one new aircraft every six days over the past six months and will continue to receive the same over the next \u003cONE_TEN\u003e months this month it s received \u003cONE_TEN\u003e new boeing \u003cSEVEN_HUNDRED\u003e s three airbus a350s and about \u003cONE_TEN\u003e boeing \u003cSEVEN_HUNDRED\u003e maxs wilson said he added that the retrofitting of existing widebodies should be complete by the end of \u003cTWO_THOUSAND\u003e or \u003cTWO_THOUSAND\u003e at the time of privatization air india had \u003cFOUR_TEN\u003e wide body aircraft for a population of \u003cONE_\u003e billion he said singapore had \u003cONE_HUNDRED\u003e wide body aircraft dubai had \u003cTWO_HUNDRED\u003e that gives you a sense of how grossly underserved the indian market was by indian airlines as part of parent tata group s plan to transform air india low cost carriers air india express and aix connect will be merged into one entity and air india and vistara will be combined into another earlier this month the competition and consumer commission of singapore approved the merger between air india and vistara a joint venture between singapore airlines ltd and the tata group singapore airlines will get a \u003cTWO_TEN_PERCENT\u003e share in the enlarged entity wilson said on wednesday read more air india expects to merge with vistara by year end ceo says for the full service carrier we have received all the competition clearances so our team are working together sharing information and planning on what the combined entity looks like wilson said air india s transformation program which includes a rebranding campaign to freshen the carrier s image has now been underway for the past \u003cONE_TEN\u003e months while the first six months was spent mainly on addressing past issues over the last year the focus has been on putting in place systems people processes and equipment wilson said we ve injected nearly \u003cFIVE_THOUSAND\u003e people in the last \u003cONE_TEN\u003e months which has brought down the average age from \u003cFIVE_TEN\u003e to \u003cTHREE_TEN\u003e years wilson said adding that the airline s it systems had to be rebuilt from scratch when tata group took over from the government","timestamp":"2024-03-20T14:10:00+05:30","market_timestamp":"2024-03-20T14:10:00+05:30","off_market_hours":false}