{"url":"https://www.moneycontrol.com/news/business/companies/govt-proposes-exempting-certain-ma-deals-from-competition-commission-approval-requirement-12483371.html","title":"Govt proposes exempting certain M\u0026A deals from Competition Commission approval requirement","description":"New Delhi, Mar 18  The government has proposed exempting intra-group transactions and certain other mergers and acquisitions from the requirement of Com..This will reduce the regulatory burden of the CCI Related stories","content":"The government has proposed exempting intra-group transactions and certain other mergers and acquisitions from the requirement of Competition Commission approval, a move that is likely to help in reducing the regulatory burden on the watchdog. Draft rules to exempt certain categories of combinations from the Competition Commission of India (CCI) approval requirement have been issued by the corporate affairs ministry. Vaibhav Choukse, Partner \u0026 Head – Competition Law at JSA Advocates \u0026 Solicitors, said the draft rules enlist certain kinds of M\u0026A (Merger \u0026 Acquisition) transactions which will not require approval from the CCI. According to him, the rules will replace and modify the existing categories of M\u0026A transactions that are exempt. The rules also modify the affiliate test required to map overlaps between the parties to the M\u0026A transaction. \"This will reduce the regulatory burden of the CCI as well as provide a big relief to the parties involved in M\u0026As,\" he added. In September, draft combination regulations were published for public comment but at that time, it did not mention exempted categories of transaction. Meanwhile, the ministry has also issued draft rules in relation to green channel approvals and 'De Minimis' provisions. Regarding the draft norms related to green channel approvals, Avaantika Kakkar, Partner (Head – Competition Law) at Cyril Amarchand Mangaldas, said that following the recent increase in the small target exemption thresholds and jurisdictional thresholds under the Competition Act, the ministry has proposed to constrict exemptions available to minority investors. \"The new rules will make the green channel route more stringent and complicated to assess, going forward,\" she added. ","cleaned_content":"the government has proposed exempting intra group transactions and certain other mergers and acquisitions from the requirement of competition commission approval a move that is likely to help in reducing the regulatory burden on the watchdog draft rules to exempt certain categories of combinations from the competition commission of india cci approval requirement have been issued by the corporate affairs ministry vaibhav choukse partner head competition law at jsa advocates solicitors said the draft rules enlist certain kinds of m a merger acquisition transactions which will not require approval from the cci according to him the rules will replace and modify the existing categories of m a transactions that are exempt the rules also modify the affiliate test required to map overlaps between the parties to the m a transaction this will reduce the regulatory burden of the cci as well as provide a big relief to the parties involved in m as he added in september draft combination regulations were published for public comment but at that time it did not mention exempted categories of transaction meanwhile the ministry has also issued draft rules in relation to green channel approvals and de minimis provisions regarding the draft norms related to green channel approvals avaantika kakkar partner head competition law at cyril amarchand mangaldas said that following the recent increase in the small target exemption thresholds and jurisdictional thresholds under the competition act the ministry has proposed to constrict exemptions available to minority investors the new rules will make the green channel route more stringent and complicated to assess going forward she added","timestamp":"2024-03-18T22:49:00+05:30","market_timestamp":"2024-03-19T09:15:00+05:30","off_market_hours":true}