{"url":"https://www.moneycontrol.com/news/business/jsw-group-mg-motor-venture-aims-to-sell-1-million-evs-in-india-by-2030-12493211.html","title":"JSW Group announces JV with China MG Motor, aims to launch a new product every 3-6 months","description":"The partnership with JSW will help raise MG Motor's annual production capacity from 100,000 to 300,000 units, the companies said in a statement.JSW Group-MG Motor venture aims to sell 1 million EVs in India by 2030Related stories","content":"Conglomerate JSW Group and SAIC-owned MG Motor formed a joint venture to manufacture new electric vehicles (NEVs) in India, with plans to launch a new product, including NEVs, every three to six months beginning September with two new products to be launched this calendar year. The JV, called JSW MG Motor India Pvt Ltd, aims to become a market leader in the NEV category with an extensive product portfolio. The company will operate in Halol, Gujarat with a focus on producing NEVs. This will help ramp up MG's production capacity from 1 lakh to 3 lakh units per year. \"Govt’s EV policy looks attractive for the premium EV segment, once we get some clarity we will decide on the next course of action,\" said Parth Jindal. Talking further about the plans for the wider group formed jointly, Parth Jindal said, \"MG India procure very little steel from the JSW group. Going forward the total steel for MG will come from JSW Steel.\" Parth Jindal added: \"Price point would be a very big disruptor in the market. We will have products in the mainstream, premium. The combination will allow us to launch a new product every three to six months. As economy grows people will upgrade. MG has a slew of products globally in premium portfolio and we plan to bring those into India.\" The JV also unveiled its first premium innovation, the Cyberster, marking a significant stride in the realm of pure electric premium cars. Moreover, sources familiar with the developments also told CNBC-TV18 that Cyberster may be priced at Rs 50 lakh. The JV aims to sell 1 million electric vehicles in India by 2030, as disclosed by a JSW Group executive. The joint venture intends to enter the premium passenger vehicle segment, as outlined in a joint statement by the companies. Also read: JSW Steel, Tata Steel, JSPL to invest billions to meet buoyant local demand MG Motor has two electric models in India: the small Comet EV and the ZS EV, which is an SUV. This announcement coincides with a shift in India's electric vehicle landscape. Recently, India reduced import taxes on specific electric vehicles for carmakers investing at least $500 million and starting domestic manufacturing within three years. This policy change is beneficial for Tesla, facilitating its entry into the Indian market. Despite potential increased competition, analysts suggest that the impact on domestic vehicle sales may be limited to manufacturers of higher-priced vehicles. Electric vehicle sales comprised approximately 2 percent of total car sales in India in 2023, with the government aiming for a 30 percent share by 2030. ","cleaned_content":"conglomerate jsw group and saic owned mg motor formed a joint venture to manufacture new electric vehicles nevs in india with plans to launch a new product including nevs every three to six months beginning september with two new products to be launched this calendar year the jv called jsw mg motor india pvt ltd aims to become a market leader in the nev category with an extensive product portfolio the company will operate in halol gujarat with a focus on producing nevs this will help ramp up mgs production capacity from \u003cONE_\u003e lakh to \u003cTHREE_\u003e lakh units per year govt s ev policy looks attractive for the premium ev segment once we get some clarity we will decide on the next course of action said parth jindal talking further about the plans for the wider group formed jointly parth jindal said mg india procure very little steel from the jsw group going forward the total steel for mg will come from jsw steel parth jindal added price point would be a very big disruptor in the market we will have products in the mainstream premium the combination will allow us to launch a new product every three to six months as economy grows people will upgrade mg has a slew of products globally in premium portfolio and we plan to bring those into india the jv also unveiled its first premium innovation the cyberster marking a significant stride in the realm of pure electric premium cars moreover sources familiar with the developments also told cnbc tv18 that cyberster may be priced at rs \u003cFIVE_TEN\u003e lakh the jv aims to sell \u003cONE_\u003e million electric vehicles in india by \u003cTWO_THOUSAND\u003e as disclosed by a jsw group executive the joint venture intends to enter the premium passenger vehicle segment as outlined in a joint statement by the companies also read jsw steel tata steel jspl to invest billions to meet buoyant local demand mg motor has two electric models in india the small comet ev and the zs ev which is an suv this announcement coincides with a shift in indias electric vehicle landscape recently india reduced import taxes on specific electric vehicles for carmakers investing at least \u003cFIVE_HUNDRED\u003e million and starting domestic manufacturing within three years this policy change is beneficial for tesla facilitating its entry into the indian market despite potential increased competition analysts suggest that the impact on domestic vehicle sales may be limited to manufacturers of higher priced vehicles electric vehicle sales comprised approximately \u003cTWO_PERCENT\u003e of total car sales in india in \u003cTWO_THOUSAND\u003e with the government aiming for a \u003cTHREE_TEN_PERCENT\u003e share by \u003cTWO_THOUSAND\u003e","timestamp":"2024-03-20T15:51:00+05:30","market_timestamp":"2024-03-21T09:15:00+05:30","off_market_hours":true}