{"url":"https://www.moneycontrol.com/news/technology/auto/local-production-of-evs-a-work-in-progress-audi-india-head-12486961.html","title":"Local production of EVs a work in progress: Audi India Head","description":"The automaker currently imports its entire EV range comprising Q8 50 e-tron, Q8 55 e-tron, Q8 Sportback 50 e-tron, Q8 Sportback 55 e-tron, e-tron GT, and RS e-tron GT, into the country.Local production of EVs a work in progress: Audi India HeadRelated stories","content":"Luxury automaker Audi India is looking to commence local assembly of electric vehicles, a move which would help it roll out models at an affordable price helping expand its customer base in the country. The automaker currently imports its entire EV range comprising Q8 50 e-tron, Q8 55 e-tron, Q8 Sportback 50 e-tron, Q8 Sportback 55 e-tron, e-tron GT, and RS e-tron GT, into the country. It, however, assembles petrol models like Q3, Q3 Sportback, Q5, Q7, A4, and A6 at its Aurangabad (Maharashtra) based manufacturing plant. \"We are working with Audi AG very positively and hopefully at some point in time we will be able to announce this (local assembly of EV models),\" he noted. When asked about the expected timeline of commencing the process, Dhillon did not share any specific date but stated that the India unit is discussing the matter with the global headquarters very \"positively\". \"Hopefully we should have some solution at some point in time. That is the time when you can reach even more (set of customers) because then you will get the best advantage in terms of price point,\" he said. He further said, \"I think the next 2-3 years will be very crucial (2024-2026). These years will see many more new electric cars coming at different price points. Then I think our reach to our existing customers or first-time buyers will go up.\" The company's current EV model lineup is priced over Rs 1 crore thus serving a very niche set of customers. Currently, cars imported into India as Completely Built Units (CBUs) attract customs duty ranging from 60 per cent to 100 per cent. The country's customs duty system treats electric cars and hydrocarbon-powered vehicles equally, imposing significant tariffs to encourage domestic manufacturing. Audi, globally, is looking to introduce multiple electric models in the next 2-3 years many of which would also come to India thus helping the Indian operations to choose which ones to localise. In order to rev up sales volume, Audi India would look out for models which sit below the current range in price terms. The company currently gets around 2 per cent of its total sales from EVs. It reported 89 per cent growth in retail sales in India at 7,931 units last year as compared with a total of 4,187 units in 2022. Audi on Monday evening globally premiered the Q6 e-tron, a new EV model which would sit below the Q8 e-tron range. To be manufactured at the company's Ingolstadt plant, the model is expected to roll out in various markets globally this year. It is also expected to make its way to Indian shores early next year. Dhillon said the model would help in widening the company's customer base in India. \"That's the expectation that our penetration in electric mobility should go up with this model (Q6 e-tron),\" he noted. Audi expects 50 per cent of its sales in India to come from electric vehicles by 2030. Globally, Audi has decided to become a fully electric vehicle manufacturer from 2033 onwards. The Q6 e-tron is the first production model on the company's Premium Platform Electric (PPE), marking the next step in the company's transformation into a provider of premium electric mobility. The electric SUV will be available to order from this month with deliveries expected to customers in the third quarter of 2024. The Q6 e-tron comes with a range of up to 625 kms. \"The PPE shows how we are pooling expertise within the Volkswagen Group and thus making electric mobility scalable,\" Audi AG Chairman of the Board of Management Gernot Dollner said. Thanks to the PPE, the company is able to launch high-volume models with high technical standards in different segments, he added. ","cleaned_content":"luxury automaker audi india is looking to commence local assembly of electric vehicles a move which would help it roll out models at an affordable price helping expand its customer base in the country the automaker currently imports its entire ev range comprising q8 \u003cFIVE_TEN\u003e e tron q8 \u003cFIVE_TEN\u003e e tron q8 sportback \u003cFIVE_TEN\u003e e tron q8 sportback \u003cFIVE_TEN\u003e e tron e tron gt and rs e tron gt into the country it however assembles petrol models like q3 q3 sportback q5 q7 a4 and a6 at its aurangabad maharashtra based manufacturing plant we are working with audi ag very positively and hopefully at some point in time we will be able to announce this local assembly of ev models he noted when asked about the expected timeline of commencing the process dhillon did not share any specific date but stated that the india unit is discussing the matter with the global headquarters very positively hopefully we should have some solution at some point in time that is the time when you can reach even more set of customers because then you will get the best advantage in terms of price point he said he further said i think the next \u003cTWO_\u003e \u003cTHREE_\u003e years will be very crucial \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e these years will see many more new electric cars coming at different price points then i think our reach to our existing customers or first time buyers will go up the companys current ev model lineup is priced over rs \u003cONE_\u003e crore thus serving a very niche set of customers currently cars imported into india as completely built units cbus attract customs duty ranging from \u003cSIX_TEN_PERCENT\u003e to \u003cONE_HUNDRED_PERCENT\u003e the countrys customs duty system treats electric cars and hydrocarbon powered vehicles equally imposing significant tariffs to encourage domestic manufacturing audi globally is looking to introduce multiple electric models in the next \u003cTWO_\u003e \u003cTHREE_\u003e years many of which would also come to india thus helping the indian operations to choose which ones to localise in order to rev up sales volume audi india would look out for models which sit below the current range in price terms the company currently gets around \u003cTWO_PERCENT\u003e of its total sales from evs it reported \u003cEIGHT_TEN_PERCENT\u003e growth in retail sales in india at \u003cSEVEN_THOUSAND\u003e units last year as compared with a total of \u003cFOUR_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e audi on monday evening globally premiered the q6 e tron a new ev model which would sit below the q8 e tron range to be manufactured at the companys ingolstadt plant the model is expected to roll out in various markets globally this year it is also expected to make its way to indian shores early next year dhillon said the model would help in widening the companys customer base in india thats the expectation that our penetration in electric mobility should go up with this model q6 e tron he noted audi expects \u003cFIVE_TEN_PERCENT\u003e of its sales in india to come from electric vehicles by \u003cTWO_THOUSAND\u003e globally audi has decided to become a fully electric vehicle manufacturer from \u003cTWO_THOUSAND\u003e onwards the q6 e tron is the first production model on the companys premium platform electric ppe marking the next step in the companys transformation into a provider of premium electric mobility the electric suv will be available to order from this month with deliveries expected to customers in the third quarter of \u003cTWO_THOUSAND\u003e the q6 e tron comes with a range of up to \u003cSIX_HUNDRED\u003e kms the ppe shows how we are pooling expertise within the volkswagen group and thus making electric mobility scalable audi ag chairman of the board of management gernot dollner said thanks to the ppe the company is able to launch high volume models with high technical standards in different segments he added","timestamp":"2024-03-20T02:14:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}