{"url":"https://www.moneycontrol.com/news/business/sun-pharma-gets-regulatory-nod-in-australia-for-acne-treatment-cream-12484641.html","title":"Sun Pharma gets regulatory nod in Australia for acne treatment cream","description":"The approval is for Winlevi (clascoterone cream 1 per cent), which is indicated for the topical treatment of acne vulgaris in patients 12 years of age and older, the company said in a statement.Sun Pharma gets regulatory nod in Australia for acne treatment cream","content":"Sun Pharmaceutical Industries Ltd on Tuesday said the Australian Therapeutic Goods Administration has granted regulatory approval for Winlevi cream indicated for the topical treatment of acne. The approval is for Winlevi (clascoterone cream 1 per cent), which is indicated for the topical treatment of acne vulgaris in patients 12 years of age and older, the company said in a statement. Sun Pharma received the exclusive right to develop and commercialise Winlevi in the US, Japan, Australia, New Zealand, Brazil, Mexico, and Russia from Cosmo, it added. The company said Winlevi will be available in Australia this June. \"This is another achievement in the mission of Cosmo and Sun Pharma to improve the lives of patients affected by skin conditions,\" Cosmo President of the Dermatology Division Diana Harbort said. ","cleaned_content":"sun pharmaceutical industries ltd on tuesday said the australian therapeutic goods administration has granted regulatory approval for winlevi cream indicated for the topical treatment of acne the approval is for winlevi clascoterone cream \u003cONE_PERCENT\u003e which is indicated for the topical treatment of acne vulgaris in patients \u003cONE_TEN\u003e years of age and older the company said in a statement sun pharma received the exclusive right to develop and commercialise winlevi in the us japan australia new zealand brazil mexico and russia from cosmo it added the company said winlevi will be available in australia this june this is another achievement in the mission of cosmo and sun pharma to improve the lives of patients affected by skin conditions cosmo president of the dermatology division diana harbort said","timestamp":"2024-03-19T10:02:00+05:30","market_timestamp":"2024-03-19T10:02:00+05:30","off_market_hours":false}