{"url":"https://www.moneycontrol.com/news/business/companies/it-sector-to-see-3-5-growth-in-fy25-hiring-to-be-muted-icra-12482191.html","title":"IT sector to see 3-5% growth in FY25, hiring to be muted: Icra","description":"Representative imageRelated stories","content":"Indian IT sector's revenue growth is expected to come at a tepid 3-5% in FY25, a domestic rating agency said on Monday. The sector's hiring will \"remain muted\" in the near-term until the growth momentum picks up, Icra Ratings said. However, the companies' profitability is expected to be resilient amid concerns on topline growth, it said, adding the operating profit margins for the $250 billion Indian IT sector will come at a healthy 21-22% in FY25. The agency said in the first nine months of the ongoing 2023-24, the industry has posted a revenue growth of just 2%, as against 3-5% it had estimated for the sector in the past. The topline growth for the first nine months of FY23 had stood at a healthy 9.2%. Persistent macroeconomic headwinds in key markets of the US and Europe, which has led to lower discretionary IT spends by corporate has led to expectations of tepid revenue growth even in FY25, its sector head Deepak Jotwani said. While it expects hiring activity to remain muted, the agency said the attrition levels will stabilise over the near term, inching closer to the long-term average of 12-13%, as overall slowdown in growth momentum and strong hiring in the previous fiscal has corrected the demand-supply mismatch witnessed earlier. The agency maintained its stable outlook on the sector for the new fiscal.  ","cleaned_content":"indian it sectors revenue growth is expected to come at a tepid \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e in fy25 a domestic rating agency said on monday the sectors hiring will remain muted in the near term until the growth momentum picks up icra ratings said however the companies profitability is expected to be resilient amid concerns on topline growth it said adding the operating profit margins for the \u003cTWO_HUNDRED\u003e billion indian it sector will come at a healthy \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e in fy25 the agency said in the first nine months of the ongoing \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the industry has posted a revenue growth of just \u003cTWO_PERCENT\u003e as against \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e it had estimated for the sector in the past the topline growth for the first nine months of fy23 had stood at a healthy \u003cNINE_PERCENT\u003e persistent macroeconomic headwinds in key markets of the us and europe which has led to lower discretionary it spends by corporate has led to expectations of tepid revenue growth even in fy25 its sector head deepak jotwani said while it expects hiring activity to remain muted the agency said the attrition levels will stabilise over the near term inching closer to the long term average of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e as overall slowdown in growth momentum and strong hiring in the previous fiscal has corrected the demand supply mismatch witnessed earlier the agency maintained its stable outlook on the sector for the new fiscal","timestamp":"2024-03-18T18:07:00+05:30","market_timestamp":"2024-03-19T09:15:00+05:30","off_market_hours":true}