{"url":"https://www.moneycontrol.com/news/business/companies/hul-is-evaluating-various-future-options-for-ice-cream-business-in-india-says-spokesperson-12491581.html","title":"HUL evaluating options for ice cream business following Unilever's global separation plan","description":"The ice cream business has a different business model which includes - a cold-chain go-to-market operating model, seasonality, and a different innovation rhythm compared to the rest of Unilever's business, the spokesperson added.HUL operates in the Indian ice cream market with three brands Magnum, Kwality Walls and Cornetto.Related stories","content":"Hindustan Unilever (HUL) announced on March 19 that it is considering various options for the future of its ice cream business, following the announcement of its parent company, Unilever, to globally separate the vertical. The London-based Unilever intends to simplify, focus and enhance its performance by separating the ice cream business, which may result in a loss of 7,500 jobs. When asked about the potential impact of this move on the Indian business, the Indian subsidiary of Unilever (HUL) stated that it is examining different options. \"As far as the Indian ice cream business is concerned, we are evaluating the various options in light of this announcement. We will discuss this with the HUL Board and Unilever management in the coming months. Once the approach is finalised, we will communicate further,\" said a HUL spokesperson. Ice creams contributed 3 percent or Rs 59,144 crore to HUL revenue in FY23. Hindustan Unilever Limited (HUL) operates in the Indian ice cream market with three brands - Magnum, Kwality Walls, and Cornetto. HUL's ice cream business is a part of the Food \u0026 Refreshment segment, which accounts for 25 percent of its revenue. The segment has helped HUL's Foods and Refreshment vertical deliver robust performance in FY23, alongside Foods and Coffee. HUL reported a standalone net profit of Rs 2,519 crore for the December quarter of FY24, an increase of just 0.55 percent from the year-ago period. (With PTI inputs) ","cleaned_content":"hindustan unilever hul announced on march \u003cONE_TEN\u003e that it is considering various options for the future of its ice cream business following the announcement of its parent company unilever to globally separate the vertical the london based unilever intends to simplify focus and enhance its performance by separating the ice cream business which may result in a loss of \u003cSEVEN_THOUSAND\u003e jobs when asked about the potential impact of this move on the indian business the indian subsidiary of unilever hul stated that it is examining different options as far as the indian ice cream business is concerned we are evaluating the various options in light of this announcement we will discuss this with the hul board and unilever management in the coming months once the approach is finalised we will communicate further said a hul spokesperson ice creams contributed \u003cTHREE_PERCENT\u003e or rs \u003cFIVE_TEN_THOUSAND\u003e crore to hul revenue in fy23 hindustan unilever limited hul operates in the indian ice cream market with three brands magnum kwality walls and cornetto huls ice cream business is a part of the food refreshment segment which accounts for \u003cTWO_TEN_PERCENT\u003e of its revenue the segment has helped huls foods and refreshment vertical deliver robust performance in fy23 alongside foods and coffee hul reported a standalone net profit of rs \u003cTWO_THOUSAND\u003e crore for the december quarter of fy24 an increase of just \u003cZERO_PERCENT\u003e from the year ago period with pti inputs","timestamp":"2024-03-20T10:19:00+05:30","market_timestamp":"2024-03-20T10:19:00+05:30","off_market_hours":false}