{"url":"https://www.moneycontrol.com/news/business/venus-remedies-gets-marketing-authorisations-for-three-cancer-drugs-from-ukraine-12479101.html","title":"Venus Remedies gets marketing authorisations for three cancer drugs from Ukraine","description":"Its total volume of exports to Ukraine stands at USD 2.20 million. By strengthening its product portfolio in Ukraine, the company aims to increase this figure by 20 per cent in the next one year, a company statement said.Venus Remedies gets marketing authorisations for three cancer drugs from Ukraine","content":"Pharma major Venus Remedies on Monday said it has expanded the reach of its oncology drugs in the Asia Commonwealth of Independent States (CIS) region with marketing authorisations from Ukraine for three cancer drugs-- paclitaxel, oxaliplatin and irinotecan. Saransh Chaudhary, President, Global Critical Care, Venus Remedies, said, \"These marketing approvals mark a significant milestone in our global expansion strategy. We are looking forward to introducing the entire range of our oncology products in Ukraine in due course, thereby contributing to the advancement of healthcare and making a positive impact on people's lives.\" With over two decades of presence in the Ukrainian market, the company has 57 product registrations in Ukraine. \"This achievement has further strengthened our position in the international pharmaceutical market. It also exemplifies our dedication to advancing healthcare solutions for diverse populations,\" said Aditi K Chaudhary, President, International Business, Venus Remedies. Venus Remedies is awaiting approval from Ukraine on another 10 applications for marketing authorisations. ","cleaned_content":"pharma major venus remedies on monday said it has expanded the reach of its oncology drugs in the asia commonwealth of independent states cis region with marketing authorisations from ukraine for three cancer drugs paclitaxel oxaliplatin and irinotecan saransh chaudhary president global critical care venus remedies said these marketing approvals mark a significant milestone in our global expansion strategy we are looking forward to introducing the entire range of our oncology products in ukraine in due course thereby contributing to the advancement of healthcare and making a positive impact on peoples lives with over two decades of presence in the ukrainian market the company has \u003cFIVE_TEN\u003e product registrations in ukraine this achievement has further strengthened our position in the international pharmaceutical market it also exemplifies our dedication to advancing healthcare solutions for diverse populations said aditi k chaudhary president international business venus remedies venus remedies is awaiting approval from ukraine on another \u003cONE_TEN\u003e applications for marketing authorisations","timestamp":"2024-03-18T15:11:00+05:30","market_timestamp":"2024-03-18T15:11:00+05:30","off_market_hours":false}