{"url":"https://www.moneycontrol.com/news/business/bpcl-signs-4-month-us-oil-purchase-deal-with-bp-report-12491681.html","title":"BPCL signs 4-month US oil purchase deal with BP: Report","description":"BPCL would start taking delivery of the oil from June, they said.BPCL signs 4-month US oil purchase deal with BP: Report","content":"State-run oil refiner Bharat Petroleum Corp BPCL.NS has signed a deal with BP BP.L to buy 1 million barrels per month of U.S. West Texas Intermediate (WTI) crude for four months, trade sources said. BPCL would start taking delivery of the oil from June, they said. The Indian refiner has also separately bought 2 million barrels of WTI crude for loading in April via a spot tender, the sources said. WTI will meet BPCL's low-sulphur crude requirement, one of the sources said, adding the economics and quality of the U.S. crude is better than oil from West Africa and the Mediterranean. BPCL is expected to process more crude in the next fiscal year starting in April compared with the current year, when it had shut its 156,000 bpd Bina refinery in central India for a month for maintenance. It had also shut units at its 120,000 bpd Mumbai refinery for maintenance. BPCL did not respond to an email from Reuters seeking comments. ","cleaned_content":"state run oil refiner bharat petroleum corp bpcl ns has signed a deal with bp bp l to buy \u003cONE_\u003e million barrels per month of u s west texas intermediate wti crude for four months trade sources said bpcl would start taking delivery of the oil from june they said the indian refiner has also separately bought \u003cTWO_\u003e million barrels of wti crude for loading in april via a spot tender the sources said wti will meet bpcls low sulphur crude requirement one of the sources said adding the economics and quality of the u s crude is better than oil from west africa and the mediterranean bpcl is expected to process more crude in the next fiscal year starting in april compared with the current year when it had shut its \u003cONE_HUNDRED_THOUSAND\u003e bpd bina refinery in central india for a month for maintenance it had also shut units at its \u003cONE_HUNDRED_THOUSAND\u003e bpd mumbai refinery for maintenance bpcl did not respond to an email from reuters seeking comments","timestamp":"2024-03-20T12:54:00+05:30","market_timestamp":"2024-03-20T12:54:00+05:30","off_market_hours":false}