{"url":"https://www.moneycontrol.com/news/business/jpmorgans-india-ecm-head-abhinav-bharti-is-said-to-leave-bank-12452081.html","title":"JPMorgan’s India ECM head Abhinav Bharti is said to leave bank","description":"Abhinav Bharti is leaving after working for more than 13 years with JPMorgan, according to his LinkedIn profile. JPMorgan’s India ECM head Abhinav Bharti is said to leave bank","content":"JPMorgan Chase \u0026 Co.’s India head of equity capital markets Abhinav Bharti is leaving the US bank, according to people familiar with the matter. He will be replaced by Arvind Vashistha, former managing director of Citigroup Inc. in India, the people said, asking not to be identified because the matter is private. Bharti is leaving after working for more than 13 years with JPMorgan, according to his LinkedIn profile. He was elevated to managing director in 2022. He joined the firm as an associate from Kotak Mahindra Bank Ltd.’s investment banking arm in 2010. India has become one of the hottest markets for deals including initial public offerings in Asia Pacific as global investors seek to tap on the South Asian nation’s growth potential. Hyundai Motor Co. is considering an initial public offering for its India unit that may raise about $2.5 billion, Bloomberg News has reported, potentially making it one of the biggest listings ever in the country. ","cleaned_content":"jpmorgan chase co s india head of equity capital markets abhinav bharti is leaving the us bank according to people familiar with the matter he will be replaced by arvind vashistha former managing director of citigroup inc in india the people said asking not to be identified because the matter is private bharti is leaving after working for more than \u003cONE_TEN\u003e years with jpmorgan according to his linkedin profile he was elevated to managing director in \u003cTWO_THOUSAND\u003e he joined the firm as an associate from kotak mahindra bank ltd s investment banking arm in \u003cTWO_THOUSAND\u003e india has become one of the hottest markets for deals including initial public offerings in asia pacific as global investors seek to tap on the south asian nation s growth potential hyundai motor co is considering an initial public offering for its india unit that may raise about \u003cTWO_\u003e billion bloomberg news has reported potentially making it one of the biggest listings ever in the country","timestamp":"2024-03-13T16:01:00+05:30","market_timestamp":"2024-03-14T09:15:00+05:30","off_market_hours":true}