{"url":"https://www.moneycontrol.com/news/business/wework-india-enters-chennai-to-open-2000-seater-coworking-centre-in-june-12485701.html","title":"WeWork India enters Chennai to open 2,000-seater coworking centre in June","description":"In a statement, Bengaluru-based WeWork India said, it has taken on lease over 1,30,000 square feet of office space in the commercial building 'Olympia Cyberspace' developed by Olympia Group.WeWork India enters Chennai to open 2,000-seater coworking centre in JuneRelated stories","content":"Coworking major WeWork India on Tuesday said it has entered Chennai market and has taken on lease 1.3 lakh square feet of office space in Chennai to open a new centre with a capacity of 2,000 desks. In a statement, Bengaluru-based WeWork India said, it has taken on lease over 1,30,000 square feet of office space in the commercial building 'Olympia Cyberspace' developed by Olympia Group. The new centre, having a total capacity of more than 2,000 desks, will be operational in June. \"We are witnessing a continued surge in demand for flexible workspaces across India,\" he added. As organisations rapidly return to work from offices, Virwani said there is a growing need for flexible and customisable workspaces that can facilitate hybrid or full-time work models\"With a strong pipeline of deals, we are excited to expand our presence into Chennai, with a focus on creating a range of custom solutions suited for diverse businesses,\" he said. WeWork India now has a presence across eight cities - New Delhi, Gurugram, Noida, Mumbai, Bengaluru, Pune, Chennai and Hyderabad. At present, it has 54 coworking centres with over 90,000 desks across seven cities. In the southern region, the company has 27 locations and over 44,500 desks across Bengaluru and Hyderabad. Chandrakant Kankaria, Joint MD, Olympia Group, said the building is strategically located near the metro station, parks, hotels, and F\u0026B hubs. \"We are delighted to have WeWork India in Olympia Cyberspace, and are confident that they will further elevate and redefine the flexible workspace sector in the city,\" he said. In WeWork India, Bengaluru-based real estate firm Embassy Group has a 73 per cent stake, while WeWork Global has a 27 per cent shareholding. WeWork India has been operational since 2017. Currently, it has an 8 million square feet area in its portfolio. In its recent report, real estate consultant Vestian highlighted that around 8 lakh seats are available with flexible space operators spread across more than 1,000 centres in India. There are 50 major flexible space operators while the top 10 players hold 84 per cent of the total flexible office space portfolio, the report said. Vestian report stated that flexible office spaces broadly include dedicated desks, hot desking, co-working spaces, and serviced and managed office spaces. ","cleaned_content":"coworking major wework india on tuesday said it has entered chennai market and has taken on lease \u003cONE_\u003e lakh square feet of office space in chennai to open a new centre with a capacity of \u003cTWO_THOUSAND\u003e desks in a statement bengaluru based wework india said it has taken on lease over \u003cONE_HUNDRED_THOUSAND\u003e square feet of office space in the commercial building olympia cyberspace developed by olympia group the new centre having a total capacity of more than \u003cTWO_THOUSAND\u003e desks will be operational in june we are witnessing a continued surge in demand for flexible workspaces across india he added as organisations rapidly return to work from offices virwani said there is a growing need for flexible and customisable workspaces that can facilitate hybrid or full time work models with a strong pipeline of deals we are excited to expand our presence into chennai with a focus on creating a range of custom solutions suited for diverse businesses he said wework india now has a presence across eight cities new delhi gurugram noida mumbai bengaluru pune chennai and hyderabad at present it has \u003cFIVE_TEN\u003e coworking centres with over \u003cNINE_TEN_THOUSAND\u003e desks across seven cities in the southern region the company has \u003cTWO_TEN\u003e locations and over \u003cFOUR_TEN_THOUSAND\u003e desks across bengaluru and hyderabad chandrakant kankaria joint md olympia group said the building is strategically located near the metro station parks hotels and f b hubs we are delighted to have wework india in olympia cyberspace and are confident that they will further elevate and redefine the flexible workspace sector in the city he said in wework india bengaluru based real estate firm embassy group has a \u003cSEVEN_TEN_PERCENT\u003e stake while wework global has a \u003cTWO_TEN_PERCENT\u003e shareholding wework india has been operational since \u003cTWO_THOUSAND\u003e currently it has an \u003cEIGHT_\u003e million square feet area in its portfolio in its recent report real estate consultant vestian highlighted that around \u003cEIGHT_\u003e lakh seats are available with flexible space operators spread across more than \u003cONE_THOUSAND\u003e centres in india there are \u003cFIVE_TEN\u003e major flexible space operators while the top \u003cONE_TEN\u003e players hold \u003cEIGHT_TEN_PERCENT\u003e of the total flexible office space portfolio the report said vestian report stated that flexible office spaces broadly include dedicated desks hot desking co working spaces and serviced and managed office spaces","timestamp":"2024-03-19T22:35:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}