{"url":"https://www.moneycontrol.com/news/business/bat-starts-2-billion-buyback-following-its-itc-stake-sale-12480401.html","title":"BAT starts $2 billion buyback following its ITC stake sale","description":"The maker of Lucky Strike cigarettes, Vuse vapes and Velo nicotine pouches said Monday that net proceeds of the ITC stake sale totaled £1.57 billion and that it will buy back as much as £1.6 billion of its own shares this year and next. BAT starts $2 billion buyback following its ITC stake sale","content":"British American Tobacco Plc. started a £1.6 billion ($2 billion) buyback program after selling part of its stake in India’s ITC Ltd. The maker of Lucky Strike cigarettes, Vuse vapes and Velo nicotine pouches said Monday that net proceeds of the ITC stake sale totaled £1.57 billion and that it will buy back as much as £1.6 billion of its own shares this year and next. The London-listed company said it will purchase £700 million of its shares in 2024 and £900 million by the end of 2025. BAT has been under pressure to return more cash to shareholders. It recently took a writedown of more than £27 billion on the value of its US cigarette brands as more smokers give up the habit, with many switching to alternatives like vapes, nicotine pouches and heated tobacco sticks. After calls from an activist shareholder to exit its London listing, the company has ruled out a move to a US listing as it “would create a lot of distraction internally,” Chief Executive Officer Tadeu Marroco said in an interview with the Financial Times over the weekend. ","cleaned_content":"british american tobacco plc started a \u003cONE_\u003e billion \u003cTWO_\u003e billion buyback program after selling part of its stake in india s itc ltd the maker of lucky strike cigarettes vuse vapes and velo nicotine pouches said monday that net proceeds of the itc stake sale totaled \u003cONE_\u003e billion and that it will buy back as much as \u003cONE_\u003e billion of its own shares this year and next the london listed company said it will purchase \u003cSEVEN_HUNDRED\u003e million of its shares in \u003cTWO_THOUSAND\u003e and \u003cNINE_HUNDRED\u003e million by the end of \u003cTWO_THOUSAND\u003e bat has been under pressure to return more cash to shareholders it recently took a writedown of more than \u003cTWO_TEN\u003e billion on the value of its us cigarette brands as more smokers give up the habit with many switching to alternatives like vapes nicotine pouches and heated tobacco sticks after calls from an activist shareholder to exit its london listing the company has ruled out a move to a us listing as it would create a lot of distraction internally chief executive officer tadeu marroco said in an interview with the financial times over the weekend","timestamp":"2024-03-18T15:11:00+05:30","market_timestamp":"2024-03-18T15:11:00+05:30","off_market_hours":false}