{"url":"https://www.moneycontrol.com/news/business/radisson-hotel-group-appoints-nikhil-sharma-as-md-for-south-asia-12493671.html","title":"Radisson Hotel Group appoints Nikhil Sharma as MD for South Asia","description":"In his new role, Sharma will lead Radisson Hotel Group's operations in the dynamic South Asia region, which has over 165 hotels in operation and development.Radisson Hotel Group appoints Nikhil Sharma as MD for South Asia","content":"Radisson Hotel Group on Wednesday announced the appointment of Nikhil Sharma as the Managing Director and Area Senior Vice President for South Asia, effective April 1. In his new role, Sharma will lead Radisson Hotel Group's operations in the dynamic South Asia region, which has over 165 hotels in operation and development. \"Nikhil joins Radisson Hotel Group from Wyndham Hotels \u0026 Resorts (WHR) where he served as Market Managing Director Eurasia, overseeing business development, operations, new openings, and sales \u0026 marketing,\" Radisson Group stated. He was also a founding member of the Lemon Tree Hotel Company and a significant contributor to the growth of India's upscale hotel segment. \"Nikhil's appointment reflects our commitment to strengthening our leadership team and driving strategic growth in South Asia. This region is a key market for us, and with Nikhil's strategic vision and deep understanding of the industry, we are confident in our ability to further elevate our presence and deliver exceptional experiences to our guests,\" Chema Basterrechea, Global President \u0026 Chief Operations Officer at Radisson Hotel Group, said. ","cleaned_content":"radisson hotel group on wednesday announced the appointment of nikhil sharma as the managing director and area senior vice president for south asia effective april \u003cONE_\u003e in his new role sharma will lead radisson hotel groups operations in the dynamic south asia region which has over \u003cONE_HUNDRED\u003e hotels in operation and development nikhil joins radisson hotel group from wyndham hotels resorts whr where he served as market managing director eurasia overseeing business development operations new openings and sales marketing radisson group stated he was also a founding member of the lemon tree hotel company and a significant contributor to the growth of indias upscale hotel segment nikhils appointment reflects our commitment to strengthening our leadership team and driving strategic growth in south asia this region is a key market for us and with nikhils strategic vision and deep understanding of the industry we are confident in our ability to further elevate our presence and deliver exceptional experiences to our guests chema basterrechea global president chief operations officer at radisson hotel group said","timestamp":"2024-03-20T14:03:00+05:30","market_timestamp":"2024-03-20T14:03:00+05:30","off_market_hours":false}