{"url":"https://www.moneycontrol.com/news/business/top-canadian-pension-funds-invest-438-million-in-indian-highways-trust-boost-infra-bets-12492941.html","title":"Top Canadian pension funds invest $438 million in Indian highways trust, boost infra bets","description":"In the trust backed by the Indian government for developing national highways, the Canada Pension Plan Investment Board and the Ontario Teachers' Pension Plan Board invested C$297 million and C$298 million, respectively, the funds said in separate statements on Tuesday and Wednesday.Top Canadian pension funds invest $438 million in Indian highways trust, boost infra bets","content":"Two big Canadian pension funds invested a total of C$595 million ($438.3 million) in India's National Highways Infra Trust (NHIT) this week, dialling up their bets on the poll-bound South Asian country's booming infrastructure sector. In the trust backed by the Indian government for developing national highways, the Canada Pension Plan Investment Board and the Ontario Teachers' Pension Plan Board invested C$297 million and C$298 million, respectively, the funds said in separate statements on Tuesday and Wednesday. The investments come as India, where general elections commence next month, has been seeing continued momentum in pre-poll government spending, benefitting construction companies across sectors such as cement, wiring and realty. Proceeds from the capital raise will be used to acquire seven road concessions across central, eastern and southern India, Ontario Teachers' said, expanding NHIT's portfolio to operations at 15 toll roads. ","cleaned_content":"two big canadian pension funds invested a total of c \u003cFIVE_HUNDRED\u003e million \u003cFOUR_HUNDRED\u003e million in indias national highways infra trust nhit this week dialling up their bets on the poll bound south asian countrys booming infrastructure sector in the trust backed by the indian government for developing national highways the canada pension plan investment board and the ontario teachers pension plan board invested c \u003cTWO_HUNDRED\u003e million and c \u003cTWO_HUNDRED\u003e million respectively the funds said in separate statements on tuesday and wednesday the investments come as india where general elections commence next month has been seeing continued momentum in pre poll government spending benefitting construction companies across sectors such as cement wiring and realty proceeds from the capital raise will be used to acquire seven road concessions across central eastern and southern india ontario teachers said expanding nhits portfolio to operations at \u003cONE_TEN\u003e toll roads","timestamp":"2024-03-20T14:09:00+05:30","market_timestamp":"2024-03-20T14:09:00+05:30","off_market_hours":false}