{"url":"https://www.moneycontrol.com/news/business/hedge-fund-manager-faces-arrest-over-533-million-taken-from-ed-tech-startup-12463371.html","title":"Hedge fund manager faces arrest over $533 million taken from Byju's","description":"Byju's Alpha, a subsidiary controlled by Byju's lenders, filed for U.S. bankruptcy in February after the Bangalore-based startup defaulted on $1.2 billion in debt.Hedge fund manager faces arrest over $533 million taken from ed-tech startupRelated stories","content":"A U.S. bankruptcy judge on Thursday ordered the arrest of William Cameron Morton, a hedge fund manager who allegedly helped Indian education technology startup Byju's hide $533 million from its lenders. Byju's Alpha, a subsidiary controlled by Byju's lenders, filed for U.S. bankruptcy in February after the Bangalore-based startup defaulted on $1.2 billion in debt. While seeking repayment, the lenders discovered that Byju's had sent $533 million to Morton's \"unknown and unproven hedge fund\" Camshaft Capital, Byju's court filings showed. Dorsey had previously ordered Morton to appear in court to explain where the funds were being held. Morton told the court he was unavailable because he was hospitalized in a foreign country, but Dorsey said at a Thursday court hearing in Wilimington, Delaware, that excuse was not credible. \"Given his absolute contempt for this court, I don't believe him,\" Dorsey said. Dorsey issued a warrant for Morton's arrest and said he and Camshaft would be fined $10,000 per day until they complied with court orders to cooperate with the investigation into Byju's missing funds. \"He certainly has the financial ability to pay those fines,\" Dorsey said. \"He knows the location of half a billion in the debtors' funds.\" Morton could not immediately be reached for comment. An attorney for Camshaft declined to comment. In a lawsuit against Morton and Camshaft, Byju's lenders said the startup had never explained why it sent so much money to Morton, who is in his mid-twenties and had \"no apparent qualification to manage a hedge fund.\" Camshaft had no other significant business, and the address it listed in filings as its primary business location turned out an International House of Pancakes in Miami, the lenders said. Byju's former parent company, Think \u0026 Learn Private Ltd, was once valued at $22 billion, they added. ","cleaned_content":"a u s bankruptcy judge on thursday ordered the arrest of william cameron morton a hedge fund manager who allegedly helped indian education technology startup byjus hide \u003cFIVE_HUNDRED\u003e million from its lenders byjus alpha a subsidiary controlled by byjus lenders filed for u s bankruptcy in february after the bangalore based startup defaulted on \u003cONE_\u003e billion in debt while seeking repayment the lenders discovered that byjus had sent \u003cFIVE_HUNDRED\u003e million to mortons unknown and unproven hedge fund camshaft capital byjus court filings showed dorsey had previously ordered morton to appear in court to explain where the funds were being held morton told the court he was unavailable because he was hospitalized in a foreign country but dorsey said at a thursday court hearing in wilimington delaware that excuse was not credible given his absolute contempt for this court i dont believe him dorsey said dorsey issued a warrant for mortons arrest and said he and camshaft would be fined \u003cONE_TEN_THOUSAND\u003e per day until they complied with court orders to cooperate with the investigation into byjus missing funds he certainly has the financial ability to pay those fines dorsey said he knows the location of half a billion in the debtors funds morton could not immediately be reached for comment an attorney for camshaft declined to comment in a lawsuit against morton and camshaft byjus lenders said the startup had never explained why it sent so much money to morton who is in his mid twenties and had no apparent qualification to manage a hedge fund camshaft had no other significant business and the address it listed in filings as its primary business location turned out an international house of pancakes in miami the lenders said byjus former parent company think learn private ltd was once valued at \u003cTWO_TEN\u003e billion they added","timestamp":"2024-03-15T10:48:00+05:30","market_timestamp":"2024-03-15T10:48:00+05:30","off_market_hours":false}