{"url":"https://www.moneycontrol.com/news/business/real-estate/fresh-housing-supply-drops-15-in-january-march-to-69000-units-across-top-8-cities-report-12542051.html","title":"Fresh housing supply drops 15% in January-March to 69,000 units across top 8 cities: Report","description":"Real estate consultant Cushman \u0026 Wakefield on Friday released the data for launches of residential properties in the primary (first sale) of eight major cities.Fresh housing supply drops 15% in January-March to 69,000 units across top 8 cities: ReportRelated stories","content":"New supply of residential properties fell 15 per cent during January-March across eight major cities at 69,143 units despite high demand, according to Cushman \u0026 Wakefield. Real estate consultant Cushman \u0026 Wakefield on Friday released the data for launches of residential properties in the primary (first sale) of eight major cities. New supply has increased in Bengaluru and Mumbai but declined in Delhi-NCR, Chennai, Hyderabad, Pune, Kolkata, and Ahmedabad. Listed, large and regionally reputed developers accounted for over 38 per cent of overall launches in the current quarter. As per the data, the fresh supply of housing properties declined to 69,143 units during January-March 2024 from 81,167 units in the year-ago period. Among cities, the new supply increased in Bengaluru to 8,848 units from 7,777 units. New supply in the Mumbai region increased marginally to 19,461 units from 19,063 units. However, the fresh supply of homes fell in Ahmedabad to 4,529 units from 4,901 units. Chennai witnessed a fall in launches to 5,490 units from 8,144 units. New supply in Delhi-NCR plunged to 3,614 units from 7,813 units. Hyderabad saw a decline to 11,090 units from 14,371 units, while Kolkata witnessed a fall to 4,753 units from 5,292 units. The new supply of residential properties in Pune decreased to 11,358 units during January-March 2024 from 13,806 units in the corresponding period of the previous year. Shalin Raina, Managing Director, Residential Services, Cushman \u0026 Wakefield said, \"Over the past year, a significant rise in demand for high-end and luxury properties has emerged. This shift reflects a change in homebuyers' growing desire to invest in a place not only to live but as a high-quality asset that reflects their lifestyle aspirations.\" Furthermore, he said the demand for larger, more luxurious homes has attracted established developers, who have the wherewithal to deliver premium, customized living spaces. \"This trend has led to a surge in launches by established developers, significantly increasing their year-on-year contribution to the residential market. We expect this momentum to continue,\" Raina said. ","cleaned_content":"new supply of residential properties fell \u003cONE_TEN_PERCENT\u003e during january march across eight major cities at \u003cSIX_TEN_THOUSAND\u003e units despite high demand according to cushman wakefield real estate consultant cushman wakefield on friday released the data for launches of residential properties in the primary first sale of eight major cities new supply has increased in bengaluru and mumbai but declined in delhi ncr chennai hyderabad pune kolkata and ahmedabad listed large and regionally reputed developers accounted for over \u003cTHREE_TEN_PERCENT\u003e of overall launches in the current quarter as per the data the fresh supply of housing properties declined to \u003cSIX_TEN_THOUSAND\u003e units during january march \u003cTWO_THOUSAND\u003e from \u003cEIGHT_TEN_THOUSAND\u003e units in the year ago period among cities the new supply increased in bengaluru to \u003cEIGHT_THOUSAND\u003e units from \u003cSEVEN_THOUSAND\u003e units new supply in the mumbai region increased marginally to \u003cONE_TEN_THOUSAND\u003e units from \u003cONE_TEN_THOUSAND\u003e units however the fresh supply of homes fell in ahmedabad to \u003cFOUR_THOUSAND\u003e units from \u003cFOUR_THOUSAND\u003e units chennai witnessed a fall in launches to \u003cFIVE_THOUSAND\u003e units from \u003cEIGHT_THOUSAND\u003e units new supply in delhi ncr plunged to \u003cTHREE_THOUSAND\u003e units from \u003cSEVEN_THOUSAND\u003e units hyderabad saw a decline to \u003cONE_TEN_THOUSAND\u003e units from \u003cONE_TEN_THOUSAND\u003e units while kolkata witnessed a fall to \u003cFOUR_THOUSAND\u003e units from \u003cFIVE_THOUSAND\u003e units the new supply of residential properties in pune decreased to \u003cONE_TEN_THOUSAND\u003e units during january march \u003cTWO_THOUSAND\u003e from \u003cONE_TEN_THOUSAND\u003e units in the corresponding period of the previous year shalin raina managing director residential services cushman wakefield said over the past year a significant rise in demand for high end and luxury properties has emerged this shift reflects a change in homebuyers growing desire to invest in a place not only to live but as a high quality asset that reflects their lifestyle aspirations furthermore he said the demand for larger more luxurious homes has attracted established developers who have the wherewithal to deliver premium customized living spaces this trend has led to a surge in launches by established developers significantly increasing their year on year contribution to the residential market we expect this momentum to continue raina said","timestamp":"2024-03-29T14:16:00+05:30","market_timestamp":"2024-03-29T14:16:00+05:30","off_market_hours":false}