{"url":"https://www.moneycontrol.com/news/business/shapoorji-group-seeks-up-to-2-4-billion-from-lenders-12499541.html","title":"Shapoorji Pallonji Group seeks to raise up to Rs 20,000 cr from lenders: Report","description":"The group has reached out to Power Finance for up to Rs 15,000 crore, the largest chunk in the planned fundraising, the report saidShapoorji Pallonji Group seeks to raise up to Rs 20,000 crore from lenders, says report","content":"Shapoorji Pallonji Group is in talks with lenders including state-run Power Finance Corp., seeking to raise as much as Rs 20,000 crore ($2.4 billion), according to people familiar with the matter. The group, controlled by Indian billionaire Shapoor Mistry, has reached out to Power Finance for up to Rs 15,000 crore, the largest chunk in the planned fundraising, the people said, asking not be identified because the details are private. Negotiations are ongoing and details of the lending could change, they added. It’s also gauging interest from Davidson Kempner Capital Management and Cerberus Capital Management LP, the people said. Shapoorji Pallonji Group didn’t immediately offer comments when reached by Bloomberg News regarding the fund-raising plan. Davidson Kempner declined to comment. Cerberus and Power Finance didn’t respond to requests for comment. Last year, Goswami Infratech Pvt., another SP Group company, raised 143 billion rupees in India’s biggest low-rated local currency bond. ","cleaned_content":"shapoorji pallonji group is in talks with lenders including state run power finance corp seeking to raise as much as rs \u003cTWO_TEN_THOUSAND\u003e crore \u003cTWO_\u003e billion according to people familiar with the matter the group controlled by indian billionaire shapoor mistry has reached out to power finance for up to rs \u003cONE_TEN_THOUSAND\u003e crore the largest chunk in the planned fundraising the people said asking not be identified because the details are private negotiations are ongoing and details of the lending could change they added it s also gauging interest from davidson kempner capital management and cerberus capital management lp the people said shapoorji pallonji group didn t immediately offer comments when reached by bloomberg news regarding the fund raising plan davidson kempner declined to comment cerberus and power finance didn t respond to requests for comment last year goswami infratech pvt another sp group company raised \u003cONE_HUNDRED\u003e billion rupees in india s biggest low rated local currency bond","timestamp":"2024-03-21T11:22:00+05:30","market_timestamp":"2024-03-21T11:22:00+05:30","off_market_hours":false}