{"url":"https://www.moneycontrol.com/news/business/lic-worlds-strongest-insurance-brand-brand-finance-insurance-report-12527481.html","title":"LIC world's strongest insurance brand: Brand Finance Insurance report","description":"The report said that LIC's brand value remains steady at USD 9.8 billion, accompanied by a brand strength index score of 88.3 and an associated AAA brand strength rating.LIC world's strongest insurance brand: Brand Finance Insurance reportRelated stories","content":"Insurance behemoth Life Insurance Corporation of India (LIC) has emerged as the strongest insurance brand globally, according to a report Brand Finance Insurance 100 2024. The report said that LIC's brand value remains steady at USD 9.8 billion, accompanied by a brand strength index score of 88.3 and an associated AAA brand strength rating. Following LIC, the rankings highlight Cathay Life Insurance as the second strongest brand, experiencing a 9 per cent increase in brand value to USD 4.9 billion, closely followed by NRMA Insurance, which saw an 82 per cent rise in brand value to USD 1.3 billion, according to a statement by Brand Finance Insurance. LIC is humbled by being ranked 1st in the list of Strongest Insurance Brands 2024 by Brand Finance Insurance 100 2024 report which is a reflection of their trust placed in the company, he added. Notably, Chinese insurance brands maintain dominance in the global rankings, with Ping An leading with a 4 per cent increase in brand value to USD 33.6 billion, followed by China Life Insurance and CPIC defending their 3rd and 5th positions, respectively, it said. Allianz from Germany and AXA from France retain their spots in the 2nd and 4th positions to complete the Top 5, it said. Among the brands experiencing significant growth in brand value, NRMA Insurance from Australia stands out with an 82 per cent increase to USD 1.3 billion, along with Denmark's Tryg, which saw a 66 per cent rise to USD 1.6 billion. Additionally, LIC India achieved the highest first-year premium collection of Rs 39,090 crore in FY23, while SBI Life Insurance and HDFC Life Insurance led the private sector with new business premium collections of Rs 15,197 crore and Rs 10,970 crore, respectively. In recent developments, the government approved a 17 per cent wage revision for LIC employees, effective from August 2022, benefiting over 110,000 employees. LIC's shares also reached an all-time high of Rs 1,175, making it India's most valuable PSU company and reclaiming its status as the fifth most valuable Indian listed company, surpassing SBI in market valuation. ","cleaned_content":"insurance behemoth life insurance corporation of india lic has emerged as the strongest insurance brand globally according to a report brand finance insurance \u003cONE_HUNDRED\u003e \u003cTWO_THOUSAND\u003e the report said that lics brand value remains steady at usd \u003cNINE_\u003e billion accompanied by a brand strength index score of \u003cEIGHT_TEN\u003e and an associated aaa brand strength rating following lic the rankings highlight cathay life insurance as the second strongest brand experiencing a \u003cNINE_PERCENT\u003e increase in brand value to usd \u003cFOUR_\u003e billion closely followed by nrma insurance which saw an \u003cEIGHT_TEN_PERCENT\u003e rise in brand value to usd \u003cONE_\u003e billion according to a statement by brand finance insurance lic is humbled by being ranked \u003cONE_\u003e st in the list of strongest insurance brands \u003cTWO_THOUSAND\u003e by brand finance insurance \u003cONE_HUNDRED\u003e \u003cTWO_THOUSAND\u003e report which is a reflection of their trust placed in the company he added notably chinese insurance brands maintain dominance in the global rankings with ping an leading with a \u003cFOUR_PERCENT\u003e increase in brand value to usd \u003cTHREE_TEN\u003e billion followed by china life insurance and cpic defending their \u003cTHREE_\u003e rd and \u003cFIVE_\u003e th positions respectively it said allianz from germany and axa from france retain their spots in the \u003cTWO_\u003e nd and \u003cFOUR_\u003e th positions to complete the top \u003cFIVE_\u003e it said among the brands experiencing significant growth in brand value nrma insurance from australia stands out with an \u003cEIGHT_TEN_PERCENT\u003e increase to usd \u003cONE_\u003e billion along with denmarks tryg which saw a \u003cSIX_TEN_PERCENT\u003e rise to usd \u003cONE_\u003e billion additionally lic india achieved the highest first year premium collection of rs \u003cTHREE_TEN_THOUSAND\u003e crore in fy23 while sbi life insurance and hdfc life insurance led the private sector with new business premium collections of rs \u003cONE_TEN_THOUSAND\u003e crore and rs \u003cONE_TEN_THOUSAND\u003e crore respectively in recent developments the government approved a \u003cONE_TEN_PERCENT\u003e wage revision for lic employees effective from august \u003cTWO_THOUSAND\u003e benefiting over \u003cONE_HUNDRED_THOUSAND\u003e employees lics shares also reached an all time high of rs \u003cONE_THOUSAND\u003e making it indias most valuable psu company and reclaiming its status as the fifth most valuable indian listed company surpassing sbi in market valuation","timestamp":"2024-03-27T14:54:00+05:30","market_timestamp":"2024-03-27T14:54:00+05:30","off_market_hours":false}