{"url":"https://www.moneycontrol.com/news/business/reliance-refusing-sovcomflot-oil-shipments-after-sanctions-reuters-12500781.html","title":"Reliance refusing Sovcomflot oil shipments after sanctions: Reuters","description":"The development adds to oil export problems for Russia as its oil firms may face difficulties finding ships to sell surplus oil after recent Ukrainian drone attacks on the state's refineries. Russian companies are already struggling to collect payments for oil exports due to banking restrictions.Reliance refusing Sovcomflot oil shipments after sanctions: ReutersRelated stories","content":"Reliance Industries, operator of the world's biggest refining complex, will not buy Russian oil loaded on tankers operated by shipper Sovcomflot (SCF) after recent U.S. sanctions, according to two sources familiar with the matter. The development adds to oil export problems for Russia as its oil firms may face difficulties finding ships to sell surplus oil after recent Ukrainian drone attacks on the state's refineries. Russian companies are already struggling to collect payments for oil exports due to banking restrictions. The U.S. has imposed wide-ranging sanctions on Russia since its invasion of Ukraine two years ago. In February, the U.S. imposed sanctions on Sovcomflot and 14 crude oil tankers involved in Russian oil transportation. Sovcomflot and Reliance representatives didn't respond to Reuters' requests for comment. Meanwhile, more Indian refiners plan to shun the use of Sovcomflot vessels, which may weigh on India's import of Russian oil and leave Russia with fewer outlets to place its flagship product, three sources in India's government and refining sector said. Indian refiners, seeking to avoid any backlash from Washington, are being \"extra cautious\" due to tighter scrutiny of Russian oil deals by banks and U.S. authorities. The refiners want to prevent the involvement of entities that are directly or indirectly sanctioned, the sources said. \"Our preference is that refiners should not take oil in sanctioned vessels, because of our political and commercial interests and the U.S. sanctions,\" one of the sources in India's government said. The source added that the government would decide on the entry of the sanctioned vessels or Sovcomflot ships to Indian ports. India oil and shipping ministries did not respond to Reuters request for comments. Since October last year, the United States has imposed a raft of sanctions on entities, shippers, traders, and vessels for violating a price cap on Russian oil. One of the refining sources said that India's crude imports from Russian may decline as the number of vessels would be reduced and that could jack up freight costs. \"SCF actively offer their vessels, but traders are wary of fixing any as buyers and even ports may reject the cargo\", one trader in the Russian oil market said, adding that more Sovcomflot vessels were committed for voyages to China now. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"reliance industries operator of the worlds biggest refining complex will not buy russian oil loaded on tankers operated by shipper sovcomflot scf after recent u s sanctions according to two sources familiar with the matter the development adds to oil export problems for russia as its oil firms may face difficulties finding ships to sell surplus oil after recent ukrainian drone attacks on the states refineries russian companies are already struggling to collect payments for oil exports due to banking restrictions the u s has imposed wide ranging sanctions on russia since its invasion of ukraine two years ago in february the u s imposed sanctions on sovcomflot and \u003cONE_TEN\u003e crude oil tankers involved in russian oil transportation sovcomflot and reliance representatives didnt respond to reuters requests for comment meanwhile more indian refiners plan to shun the use of sovcomflot vessels which may weigh on indias import of russian oil and leave russia with fewer outlets to place its flagship product three sources in indias government and refining sector said indian refiners seeking to avoid any backlash from washington are being extra cautious due to tighter scrutiny of russian oil deals by banks and u s authorities the refiners want to prevent the involvement of entities that are directly or indirectly sanctioned the sources said our preference is that refiners should not take oil in sanctioned vessels because of our political and commercial interests and the u s sanctions one of the sources in indias government said the source added that the government would decide on the entry of the sanctioned vessels or sovcomflot ships to indian ports india oil and shipping ministries did not respond to reuters request for comments since october last year the united states has imposed a raft of sanctions on entities shippers traders and vessels for violating a price cap on russian oil one of the refining sources said that indias crude imports from russian may decline as the number of vessels would be reduced and that could jack up freight costs scf actively offer their vessels but traders are wary of fixing any as buyers and even ports may reject the cargo one trader in the russian oil market said adding that more sovcomflot vessels were committed for voyages to china now disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-03-21T16:57:00+05:30","market_timestamp":"2024-03-22T09:15:00+05:30","off_market_hours":true}