{"url":"https://www.moneycontrol.com/news/business/anz-aims-to-open-operation-at-indias-gift-special-economic-zone-12530831.html","title":"ANZ aims to open operation at India’s GIFT special economic zone","description":"The multinational bank has applied to the International Financial Services Centres Authority for a license, said the people, who asked not to be identified as the information is private. Approval may be granted in the next few months following a due diligence process, they said.ANZ aims to open operation at India’s GIFT Special Economic ZoneRelated stories","content":"ANZ Group Holdings Ltd. is seeking to open an operation in India’s GIFT International Financial Services Centre, according to people familiar with the matter. The multinational bank has applied to the International Financial Services Centres Authority for a license, said the people, who asked not to be identified as the information is private. Approval may be granted in the next few months following a due diligence process, they said. ANZ’s new operation will mainly focus on serving the bank’s global clients to raise dollar funds given it’s located in the GIFT special economic zone, the people said. ANZ declined to comment when contacted by Bloomberg, while the International Financial Services Centres Authority did not reply immediately to an emailed query. ANZ Group aims to expand its presence in India and Vietnam as well as in China, chief executive officer Shayne Elliott said earlier this month. ","cleaned_content":"anz group holdings ltd is seeking to open an operation in india s gift international financial services centre according to people familiar with the matter the multinational bank has applied to the international financial services centres authority for a license said the people who asked not to be identified as the information is private approval may be granted in the next few months following a due diligence process they said anz s new operation will mainly focus on serving the bank s global clients to raise dollar funds given it s located in the gift special economic zone the people said anz declined to comment when contacted by bloomberg while the international financial services centres authority did not reply immediately to an emailed query anz group aims to expand its presence in india and vietnam as well as in china chief executive officer shayne elliott said earlier this month","timestamp":"2024-03-27T16:37:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}