{"url":"https://www.moneycontrol.com/news/business/lic-gets-gst-demand-notice-of-rs-178-crore-12527461.html","title":"LIC gets GST demand notice of Rs 178 crore","description":"The company has received a communication/demand order for interest and penalty from the Additional Commissioner, Central GST \u0026 Central Excise Jamshedpur, LIC said in a regulatory filing.LIC world's strongest insurance brand: Brand Finance Insurance report","content":"Life Insurance Corporation of India (LIC) on Tuesday said tax authorities have slapped a demand notice of about Rs 178 crore on it for short payment of Goods and Services Tax (GST) for two financial years. The company has received a communication/demand order for interest and penalty from the Additional Commissioner, Central GST \u0026 Central Excise Jamshedpur, LIC said in a regulatory filing. The demand notice is for pre-mature availment of Input Tax Credit on reverse charge mechanism, it said. In a separate filing LIC said, tax authorities have slapped a demand notice of about Rs 39.39 lakh on it for short payment of GST for 2017-18. The corporation has filed an appeal against the order demanding GST of Rs 19,64,584 for FY 2017-18 and interest applicable on it along with a penalty of Rs 19,74,584 before the Commissioner (Appeals), Ahmedabad on March 26, 2024, it said. In another filing LIC said, an appeal has been filed before Commissioner (Appeals), Dehradun against the order demanding GST of Rs 3,89,25,914 for 2017-18 and interest applicable on it along with a penalty of Rs 38,92,592. ","cleaned_content":"life insurance corporation of india lic on tuesday said tax authorities have slapped a demand notice of about rs \u003cONE_HUNDRED\u003e crore on it for short payment of goods and services tax gst for two financial years the company has received a communication demand order for interest and penalty from the additional commissioner central gst central excise jamshedpur lic said in a regulatory filing the demand notice is for pre mature availment of input tax credit on reverse charge mechanism it said in a separate filing lic said tax authorities have slapped a demand notice of about rs \u003cTHREE_TEN\u003e lakh on it for short payment of gst for \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e the corporation has filed an appeal against the order demanding gst of rs \u003cONE_MILLION\u003e for fy \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and interest applicable on it along with a penalty of rs \u003cONE_MILLION\u003e before the commissioner appeals ahmedabad on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e it said in another filing lic said an appeal has been filed before commissioner appeals dehradun against the order demanding gst of rs \u003cTHREE_TEN_MILLION\u003e for \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and interest applicable on it along with a penalty of rs \u003cTHREE_MILLION\u003e","timestamp":"2024-03-27T17:39:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}