{"url":"https://www.moneycontrol.com/news/business/lic-to-keep-offices-open-on-march-30-31-12542661.html","title":"LIC to keep offices open on March 30, 31","description":"LIC's measure follows the announcement by banks that their branches will remain open on Saturday and Sunday. LIC to keep offices open on March 30, 31","content":"Life Insurance Corporation will keep its offices open on March 30 and March 31 to facilitate taxpayers to complete tax saving exercise before the closing of the fiscal year. LIC's measure follows the announcement by banks that their branches will remain open on Saturday and Sunday. The RBI had earlier this month directed banks to keep their designated branches open for government transactions up to the normal working hours on March 30 and March 31, 2024. \"It has been decided that the Offices under the jurisdiction of zones and divisions will be kept open for normal operations as per official working hours on 30.3.2024 and 31.3.2024, in order to avoid any hardship to the policyholders,\" LIC said in a statement. ","cleaned_content":"life insurance corporation will keep its offices open on march \u003cTHREE_TEN\u003e and march \u003cTHREE_TEN\u003e to facilitate taxpayers to complete tax saving exercise before the closing of the fiscal year lics measure follows the announcement by banks that their branches will remain open on saturday and sunday the rbi had earlier this month directed banks to keep their designated branches open for government transactions up to the normal working hours on march \u003cTHREE_TEN\u003e and march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e it has been decided that the offices under the jurisdiction of zones and divisions will be kept open for normal operations as per official working hours on \u003cTHREE_TEN\u003e 2024 and \u003cTHREE_TEN\u003e 2024 in order to avoid any hardship to the policyholders lic said in a statement","timestamp":"2024-03-29T14:15:00+05:30","market_timestamp":"2024-03-29T14:15:00+05:30","off_market_hours":false}