{"url":"https://www.moneycontrol.com/news/business/reliance-powers-2-subsidiaries-settle-rs-1023-crore-debt-12528861.html","title":"Reliance Power's 2 subsidiaries settle Rs 1,023 crore debt","description":"Reliance Power Ltd's two subsidiaries -- Kalai Power Pvt Ltd and Reliance Cleangen Ltd, have signed a debt settlement and discharge agreement with Reliance Commercial Finance Ltd (RCFL), a wholly-owned subsidiary of Authum Investment \u0026 Infrastructure Limited, a regulatory filing said.Reliance Power's 2 subsidiaries settle Rs 1,023 crore debtRelated stories","content":"Reliance Power on Wednesday said its two subsidiaries have settled debt worth Rs 1,023 crore with Authum Investment's arm Reliance Commercial Finance. Reliance Power Ltd's two subsidiaries -- Kalai Power Pvt Ltd and Reliance Cleangen Ltd, have signed a debt settlement and discharge agreement with Reliance Commercial Finance Ltd (RCFL), a wholly-owned subsidiary of Authum Investment \u0026 Infrastructure Limited, a regulatory filing said. In a stock exchange disclosure, the company informed that the value of total outstanding debt that has been settled stood at Rs 1,023 crore. In December 2023, Kalai Power had sold the development rights of its proposed 1,200 Megawatt hydro-electric project in Arunachal Pradesh to THDC India Ltd for Rs 128 crore. According to a company official, the funds raised from the sale of these assets were used to retire the debt. Authum Investment, in a banks-led resolution process, had acquired Reliance Commercial Finance and Reliance Home Finance from Reliance Capital Ltd in 2022. Over the past few months, Reliance Power has been actively signing debt settlement agreements with various banks, including DBS Bank, ICICI Bank, and Axis Bank. Reliance Power is aiming to be a debt-free company, on a standalone basis, by the end of March 31, 2024. At the end of fiscal 2023, the company had an outstanding debt of around Rs 700 crore. ","cleaned_content":"reliance power on wednesday said its two subsidiaries have settled debt worth rs \u003cONE_THOUSAND\u003e crore with authum investments arm reliance commercial finance reliance power ltds two subsidiaries kalai power pvt ltd and reliance cleangen ltd have signed a debt settlement and discharge agreement with reliance commercial finance ltd rcfl a wholly owned subsidiary of authum investment infrastructure limited a regulatory filing said in a stock exchange disclosure the company informed that the value of total outstanding debt that has been settled stood at rs \u003cONE_THOUSAND\u003e crore in december \u003cTWO_THOUSAND\u003e kalai power had sold the development rights of its proposed \u003cONE_THOUSAND\u003e megawatt hydro electric project in arunachal pradesh to thdc india ltd for rs \u003cONE_HUNDRED\u003e crore according to a company official the funds raised from the sale of these assets were used to retire the debt authum investment in a banks led resolution process had acquired reliance commercial finance and reliance home finance from reliance capital ltd in \u003cTWO_THOUSAND\u003e over the past few months reliance power has been actively signing debt settlement agreements with various banks including dbs bank icici bank and axis bank reliance power is aiming to be a debt free company on a standalone basis by the end of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e at the end of fiscal \u003cTWO_THOUSAND\u003e the company had an outstanding debt of around rs \u003cSEVEN_HUNDRED\u003e crore","timestamp":"2024-03-27T19:59:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}