{"url":"https://www.moneycontrol.com/news/business/hal-revenue-up-by-11-at-rs-29810-crore-12554731.html","title":"HAL revenue up by 11% at Rs 29,810 crore","description":"The corresponding figure for the previous year was Rs. 26,928 crore, the Bengaluru-headquartered defence PSU said in a statement.HAL revenue up by 11% at Rs 29,810 croreRelated stories","content":"Hindustan Aeronautics Limited on Monday said that it has recorded revenue from operations of over Rs 29,810 crore (provisional and unaudited) for the financial year 2023-24 registering a growth of around 11 per cent as against nine per cent in the previous fiscal. The corresponding figure for the previous year was Rs. 26,928 crore, the Bengaluru-headquartered defence PSU said in a statement. HAL Chairman and Managing Director (Additional Charge), C B Ananthakrishnan said that despite major supply chain challenges arising due to geopolitical issues, the company has met the expected revenue growth with improved performance for the entire year. HAL received fresh manufacturing contracts of over Rs 19,000 crore and Repair and Overhaul (ROH) contracts of over Rs 16,000 crore during 2023-24. An export contract with Guyana Defence Forces for supply of two Hindustan-228 aircraft was signed during 2023-24. A milestone was achieved with the first production series fighter of LCA Mk1A completing its maiden flight on March 28, 2024. During the year, HAL and General Electric, USA signed an MoU for transfer of technology and manufacturing of GE-414 aero-engine in India for LCA MK2 Aircraft.The company would receive 80 per cent technology transfer for this programme which would transform the Indian aero engine manufacturing ecosystem to be self-reliant, the statement claimed. A joint venture 'SAFHAL Helicopter Engines Pvt. Ltd' was formed with Safran Helicopter Engines, France, for indigenous design and development of engines for Indian Multi-Role Helicopter (IMRH) and Deck Based Multi-Role Helicopter (DBMRH). During the financial year, HAL and Airbus signed a contract for establishing maintenance, repair, and operations facilities for the A-320 family of aircrafts in New Delhi. This collaboration will strengthen the 'Make-in-India' mission and also enhance export potential, HAL said. ","cleaned_content":"hindustan aeronautics limited on monday said that it has recorded revenue from operations of over rs \u003cTWO_TEN_THOUSAND\u003e crore provisional and unaudited for the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e registering a growth of around \u003cONE_TEN_PERCENT\u003e as against nine per cent in the previous fiscal the corresponding figure for the previous year was rs \u003cTWO_TEN_THOUSAND\u003e crore the bengaluru headquartered defence psu said in a statement hal chairman and managing director additional charge c b ananthakrishnan said that despite major supply chain challenges arising due to geopolitical issues the company has met the expected revenue growth with improved performance for the entire year hal received fresh manufacturing contracts of over rs \u003cONE_TEN_THOUSAND\u003e crore and repair and overhaul roh contracts of over rs \u003cONE_TEN_THOUSAND\u003e crore during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e an export contract with guyana defence forces for supply of two hindustan \u003cTWO_HUNDRED\u003e aircraft was signed during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e a milestone was achieved with the first production series fighter of lca mk1a completing its maiden flight on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e during the year hal and general electric usa signed an mou for transfer of technology and manufacturing of ge \u003cFOUR_HUNDRED\u003e aero engine in india for lca mk2 aircraft the company would receive \u003cEIGHT_TEN_PERCENT\u003e technology transfer for this programme which would transform the indian aero engine manufacturing ecosystem to be self reliant the statement claimed a joint venture safhal helicopter engines pvt ltd was formed with safran helicopter engines france for indigenous design and development of engines for indian multi role helicopter imrh and deck based multi role helicopter dbmrh during the financial year hal and airbus signed a contract for establishing maintenance repair and operations facilities for the a \u003cTHREE_HUNDRED\u003e family of aircrafts in new delhi this collaboration will strengthen the make in india mission and also enhance export potential hal said","timestamp":"2024-04-01T15:15:00+05:30","market_timestamp":"2024-04-01T15:15:00+05:30","off_market_hours":false}