{"url":"https://www.moneycontrol.com/news/business/carlyle-said-to-weigh-1-billion-ipo-for-india-it-firm-hexaware-12523451.html","title":"Carlyle said to weigh $1 billion IPO for India IT firm Hexaware","description":"The US investment firm is speaking with potential arrangers to help prepare for an IPO in Mumbai this year or next, the people said, asking not to be identified because the matter is private. A share sale might value Hexaware at $4 billion or more, they said. Carlyle said to weigh $1 billion IPO for India IT firm Hexaware","content":"Carlyle Group Inc. is considering options for Indian information technology firm Hexaware Technologies Ltd., including an initial public offering that could raise $1 billion, according to people familiar with the matter. The US investment firm is speaking with potential arrangers to help prepare for an IPO in Mumbai this year or next, the people said, asking not to be identified because the matter is private. A share sale might value Hexaware at $4 billion or more, they said. At about $1 billion, it would be the biggest IPO in the country since Life Insurance Corp. of India’s in 2022, according to data compiled by Bloomberg. That company’s shares slumped initially but have mostly recovered. Considerations are preliminary and no final decisions have been made, the people said. Details on aspects such as size and value may change, they said. Carlyle declined to comment. Hexaware provides IT and business process outsourcing services, according to its website. It also offers cloud, data and artificial intelligence services. Carlyle bought Hexaware in 2021 from Baring Private Equity Asia Ltd., which is now part of Sweden’s EQT AB. ","cleaned_content":"carlyle group inc is considering options for indian information technology firm hexaware technologies ltd including an initial public offering that could raise \u003cONE_\u003e billion according to people familiar with the matter the us investment firm is speaking with potential arrangers to help prepare for an ipo in mumbai this year or next the people said asking not to be identified because the matter is private a share sale might value hexaware at \u003cFOUR_\u003e billion or more they said at about \u003cONE_\u003e billion it would be the biggest ipo in the country since life insurance corp of india s in \u003cTWO_THOUSAND\u003e according to data compiled by bloomberg that company s shares slumped initially but have mostly recovered considerations are preliminary and no final decisions have been made the people said details on aspects such as size and value may change they said carlyle declined to comment hexaware provides it and business process outsourcing services according to its website it also offers cloud data and artificial intelligence services carlyle bought hexaware in \u003cTWO_THOUSAND\u003e from baring private equity asia ltd which is now part of sweden s eqt ab","timestamp":"2024-03-26T15:04:00+05:30","market_timestamp":"2024-03-26T15:04:00+05:30","off_market_hours":false}