{"url":"https://www.moneycontrol.com/news/business/kalpataru-projects-international-arms-bag-orders-worth-rs-2071-crore-12535631.html","title":"Kalpataru Projects International,  arms bag orders worth Rs 2,071 crore","description":"The new orders include orders in the Transmission \u0026 Distribution (T\u0026D) business in overseas markets, the statement said.Kalpataru Projects International,  arms bag orders worth Rs 2,071 croreRelated stories","content":"Kalpataru Projects International and its arms have bagged orders worth Rs 2,071 crore, according to a statement on Thursday. The new orders include orders in the Transmission \u0026 Distribution (T\u0026D) business in overseas markets, the statement said. Besides it has also got an order for design \u0026 construction of an underground metro rail project in India. KPIL's order intake (including LOAs/LOIs) in the current financial year stands at a record high of Rs 30,000 crore including some large and strategic order wins in T\u0026D, B\u0026F, Oil \u0026 Gas, and Urban Infra business, he added. This landmark achievement has been on several counts - intensive efforts that the company has put in over the last several years on improving its geographical footprints in high growth EPC markets, developing strong client relationships and penetrating deeper into the focused businesses on the back of strong technical and execution capabilities, he added. \"Our robust order book position and established execution capabilities give us confidence to deliver good growth going forward,\" he said. KPIL is one of the largest specialised EPC (Engineering Procurement Construction) companies engaged in power transmission \u0026 distribution, buildings \u0026 factories, water supply \u0026 irrigation, railways, oil \u0026 gas pipelines, urban mobility (flyovers \u0026 metro rail), highways, and airports. It is currently executing projects in over 30 countries and has a global footprint in over 70 countries. ","cleaned_content":"kalpataru projects international and its arms have bagged orders worth rs \u003cTWO_THOUSAND\u003e crore according to a statement on thursday the new orders include orders in the transmission distribution t d business in overseas markets the statement said besides it has also got an order for design construction of an underground metro rail project in india kpils order intake including loas lois in the current financial year stands at a record high of rs \u003cTHREE_TEN_THOUSAND\u003e crore including some large and strategic order wins in t d b f oil gas and urban infra business he added this landmark achievement has been on several counts intensive efforts that the company has put in over the last several years on improving its geographical footprints in high growth epc markets developing strong client relationships and penetrating deeper into the focused businesses on the back of strong technical and execution capabilities he added our robust order book position and established execution capabilities give us confidence to deliver good growth going forward he said kpil is one of the largest specialised epc engineering procurement construction companies engaged in power transmission distribution buildings factories water supply irrigation railways oil gas pipelines urban mobility flyovers metro rail highways and airports it is currently executing projects in over \u003cTHREE_TEN\u003e countries and has a global footprint in over \u003cSEVEN_TEN\u003e countries","timestamp":"2024-03-28T10:58:00+05:30","market_timestamp":"2024-03-28T10:58:00+05:30","off_market_hours":false}