{"url":"https://www.moneycontrol.com/news/business/indigo-to-fly-more-international-routes-destinations-aims-doubling-size-by-2030-ceo-pieter-elbers-12528931.html","title":"IndiGo to fly more international routes, destinations; aims doubling size by 2030: CEO Pieter Elbers","description":"The country's largest airline with a domestic market share of little over 60 per cent is also betting big on A321 XLR aircraft that are expected to be part of its fleet \"somewhere in 2025\", to further expand its overseas presence.IndiGo to fly more international routes, destinations; aims doubling size by 2030: CEO Pieter ElbersRelated stories","content":"IndiGo aims to double in size by 2030 with new domestic and international routes as well as destinations, its chief Pieter Elbers said as the airline pursues soaring global ambitions to match India's economic growth potential. The country's largest airline with a domestic market share of little over 60 per cent is also betting big on A321 XLR aircraft that are expected to be part of its fleet \"somewhere in 2025\", to further expand its overseas presence. Seeking to consolidate as well as expand its position on the global scale, Elbers told PTI in an interview that the next big jump for IndiGo will be to double its size by the end of the decade. Amid supply chain as well as Pratt \u0026 Whitney engine woes, Elbers also emphasised that the airline is taking a lot of mitigating measures that are bearing fruits, and that the Aircraft on Ground (AOG) situation is \"stable\". In February, the airline said the number of AOGs was in the mid-70s. Currently, the 17-year-old carrier operates to 88 domestic and 33 international destinations. It has a fleet of more than 360 planes. \"An airline with double of today's size, global reach and footprint by the year 2030. That is the ambitious target...,\" Elbers said and added that more codeshare partnerships can be expected. At present, IndiGo has codeshares with Turkish Airways, British Airways, Qatar Airways, American Airline, KLM-AirFrance, Qantas, Jetstar, and Virgin Atlantic. Codesharing allows an airline to book its passengers on its partner carriers and provide seamless travel to various destinations. \"Clearly, going forward, we will be seeing a number of new international destinations. We will have some domestic but more international... I would say. Especially, the opportunity to have more international routes, not per se destinations only,\" he said and cited the example of services to Singapore that have been increased. About a year ago, he said that IndiGo was flying to Singapore from three destinations and today, it operates to that country from seven destinations in India. \"I think we have a good opportunity to not only add destinations but even more... adding more routes to our network\". A mixture of new domestic and international routes will be a key element in the airline's pursuit to double its size by 2030, for which the \"groundwork\" has been done. In December 2023, IndiGo announced carrying 100 million passengers in a calendar year, becoming the first airline to achieve the milestone. \"We should compare IndiGo to the global aviation landscape. India (set to become the third largest economy in the world), should and will have airlines matching the ambition of the country itself. So, 100 million was our target to be part of the top ten airlines in the world and today, we are the seventh largest in terms of daily departures...,\" Elbers said. According to Elbers, IndiGo is determined to play a very strong role in India having a strong aviation ecosystem. \"If home is the world's most populous nation and home is soon going to be the third largest economy in the world, India should have an aviation ecosystem that is matching the size, potential and ambition of the country. IndiGo is determined to play a very strong role in that,\" he noted. After being hit by the coronavirus pandemic, the carrier has got its financials back on track and has remained profitable in the last five quarters, also turning networth positive in the 2023 December quarter. \"Where do we stand today? We have actually created the groundwork for what may be called the next big mission of IndiGo. That is to double in size towards the end of the decade. You can only have that ambition if your foundations are correct. \"The foundations are important from a financial perspective, customer perspective, network perspective as also the big fleet order which we made in June last year. That gives us long-term visibility well into the next decade,\" the IndiGo chief said. To a query on whether the airline will be going for wide-body planes and also introducing new classes, Elbers said, \"we keep all options open and we evaluate, we take decisions for IndiGo that are matching the needs of the market and IndiGo at the appropriate time\". Further, he highlighted that A321 XLR aircraft, that are expected to come into its fleet \"somewhere in 2025\", will help the airline in further expanding its range. \"XLRs will bring us to parts of Europe, Asia and places like Athens, Seoul, Rome... that will be a wonderful expansion of IndiGo,\" he added. The airline has more than 900 planes on order. At the end of December 2023, the carrier had a fleet of 358 aircraft, including 31 A320 ceos (11 damp lease), 184 A320 neos, 94 A321 neos, 44 ATRs, 3 A321 freighters and 2 B777s. ","cleaned_content":"indigo aims to double in size by \u003cTWO_THOUSAND\u003e with new domestic and international routes as well as destinations its chief pieter elbers said as the airline pursues soaring global ambitions to match indias economic growth potential the countrys largest airline with a domestic market share of little over \u003cSIX_TEN_PERCENT\u003e is also betting big on a321 xlr aircraft that are expected to be part of its fleet somewhere in \u003cTWO_THOUSAND\u003e to further expand its overseas presence seeking to consolidate as well as expand its position on the global scale elbers told pti in an interview that the next big jump for indigo will be to double its size by the end of the decade amid supply chain as well as pratt whitney engine woes elbers also emphasised that the airline is taking a lot of mitigating measures that are bearing fruits and that the aircraft on ground aog situation is stable in february the airline said the number of aogs was in the mid \u003cSEVEN_TEN\u003e s currently the \u003cONE_TEN\u003e year old carrier operates to \u003cEIGHT_TEN\u003e domestic and \u003cTHREE_TEN\u003e international destinations it has a fleet of more than \u003cTHREE_HUNDRED\u003e planes an airline with double of todays size global reach and footprint by the year \u003cTWO_THOUSAND\u003e that is the ambitious target elbers said and added that more codeshare partnerships can be expected at present indigo has codeshares with turkish airways british airways qatar airways american airline klm airfrance qantas jetstar and virgin atlantic codesharing allows an airline to book its passengers on its partner carriers and provide seamless travel to various destinations clearly going forward we will be seeing a number of new international destinations we will have some domestic but more international i would say especially the opportunity to have more international routes not per se destinations only he said and cited the example of services to singapore that have been increased about a year ago he said that indigo was flying to singapore from three destinations and today it operates to that country from seven destinations in india i think we have a good opportunity to not only add destinations but even more adding more routes to our network a mixture of new domestic and international routes will be a key element in the airlines pursuit to double its size by \u003cTWO_THOUSAND\u003e for which the groundwork has been done in december \u003cTWO_THOUSAND\u003e indigo announced carrying \u003cONE_HUNDRED\u003e million passengers in a calendar year becoming the first airline to achieve the milestone we should compare indigo to the global aviation landscape india set to become the third largest economy in the world should and will have airlines matching the ambition of the country itself so \u003cONE_HUNDRED\u003e million was our target to be part of the top ten airlines in the world and today we are the seventh largest in terms of daily departures elbers said according to elbers indigo is determined to play a very strong role in india having a strong aviation ecosystem if home is the worlds most populous nation and home is soon going to be the third largest economy in the world india should have an aviation ecosystem that is matching the size potential and ambition of the country indigo is determined to play a very strong role in that he noted after being hit by the coronavirus pandemic the carrier has got its financials back on track and has remained profitable in the last five quarters also turning networth positive in the \u003cTWO_THOUSAND\u003e december quarter where do we stand today we have actually created the groundwork for what may be called the next big mission of indigo that is to double in size towards the end of the decade you can only have that ambition if your foundations are correct the foundations are important from a financial perspective customer perspective network perspective as also the big fleet order which we made in june last year that gives us long term visibility well into the next decade the indigo chief said to a query on whether the airline will be going for wide body planes and also introducing new classes elbers said we keep all options open and we evaluate we take decisions for indigo that are matching the needs of the market and indigo at the appropriate time further he highlighted that a321 xlr aircraft that are expected to come into its fleet somewhere in \u003cTWO_THOUSAND\u003e will help the airline in further expanding its range xlrs will bring us to parts of europe asia and places like athens seoul rome that will be a wonderful expansion of indigo he added the airline has more than \u003cNINE_HUNDRED\u003e planes on order at the end of december \u003cTWO_THOUSAND\u003e the carrier had a fleet of \u003cTHREE_HUNDRED\u003e aircraft including \u003cTHREE_TEN\u003e a320 ceos \u003cONE_TEN\u003e damp lease \u003cONE_HUNDRED\u003e a320 neos \u003cNINE_TEN\u003e a321 neos \u003cFOUR_TEN\u003e atrs \u003cTHREE_\u003e a321 freighters and \u003cTWO_\u003e b777s","timestamp":"2024-03-27T17:38:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}