{"url":"https://www.moneycontrol.com/news/business/zf-rane-automotive-india-acquires-trw-sun-steering-wheels-12543161.html","title":"ZF Rane Automotive India acquires TRW Sun Steering Wheels","description":"Gurugram-headquartered TRW Sun Steering Wheels (TSSW) is a JV between the Sun Group and ZF Group globally.ZF Rane Automotive India acquires TRW Sun Steering WheelsRelated stories","content":"Auto components maker ZF Rane Automotive India Pvt Ltd, on Friday, announced the acquisition of steering wheels manufacturer TRW Sun Steering Wheels Pvt Ltd for an undisclosed sum. Gurugram-headquartered TRW Sun Steering Wheels (TSSW) is a JV between the Sun Group and ZF Group globally. It manufactures various types of steering wheels for the Indian market and supplies to a diverse set of passenger vehicle customers from its manufacturing plants in Gurugram and Pune, ZF Rane Automotive India said in a statement. ZF Rane Automotive India is a joint venture between ZF Group in India and Rane Group. \"This acquisition will seamlessly integrate and enable ZF Rane Automotive India to deliver exceptional value to existing and new customers with enhanced capabilities. With TSSW's extensive presence in west and north India, this acquisition will strategically strengthen our position to serve the customers,\" Rane Group Vice Chairman and Managing Director, ZF Rane Automotive India Harish Lakshman said. ZF Group India President Akash Passey said the acquisition \"consolidates our leadership in the domestic market, building on the technological competence of the ZF Group with the manufacturing prowess of the Rane Group.\" \"Now with the TSSW acquisition, we will be able to support more customers, across the region with a comprehensive portfolio,\" he added. ","cleaned_content":"auto components maker zf rane automotive india pvt ltd on friday announced the acquisition of steering wheels manufacturer trw sun steering wheels pvt ltd for an undisclosed sum gurugram headquartered trw sun steering wheels tssw is a jv between the sun group and zf group globally it manufactures various types of steering wheels for the indian market and supplies to a diverse set of passenger vehicle customers from its manufacturing plants in gurugram and pune zf rane automotive india said in a statement zf rane automotive india is a joint venture between zf group in india and rane group this acquisition will seamlessly integrate and enable zf rane automotive india to deliver exceptional value to existing and new customers with enhanced capabilities with tssws extensive presence in west and north india this acquisition will strategically strengthen our position to serve the customers rane group vice chairman and managing director zf rane automotive india harish lakshman said zf group india president akash passey said the acquisition consolidates our leadership in the domestic market building on the technological competence of the zf group with the manufacturing prowess of the rane group now with the tssw acquisition we will be able to support more customers across the region with a comprehensive portfolio he added","timestamp":"2024-03-29T18:35:00+05:30","market_timestamp":"2024-04-01T09:15:00+05:30","off_market_hours":true}