{"url":"https://www.moneycontrol.com/news/business/adani-eyes-45-gw-renewable-energy-capacity-by-2030-12522251.html","title":"Adani eyes 45 GW renewable energy capacity by 2030","description":"Speaking at the opening of 'Energy Revolution: The Adani Green Energy Gallery' at the Science Museum in London, Gautam Adani said his group's renewable energy arm, Adani Green Energy, is leading an energy transition that honours the commitment of taking care of the planet not just for this generation and the next but also for generations to come.Adani eyes 45 GW renewable energy capacity by 2030Related stories","content":"Billionaire Gautam Adani's group is building the world's largest renewable energy park in Gujarat, as it eyes a massive 45 GW capacity to generate electricity largely from solar energy. Speaking at the opening of 'Energy Revolution: The Adani Green Energy Gallery' at the Science Museum in London, Gautam Adani said his group's renewable energy arm, Adani Green Energy, is leading an energy transition that honours the commitment of taking care of the planet not just for this generation and the next but also for generations to come. \"As the world's leading solar power developer and India's largest renewable energy company, we are taking very big steps,\" he said. \"This will be like providing clean energy to almost every house in England,\" he said. It currently has an operating renewable portfolio of over 9.5 GW and locked-in projects of up to 21.8 Gigawatt (GW). The Gallery explores how the world can generate and use energy more sustainably to urgently decarbonise and to limit dangerous climate change. \"Through striking displays of contemporary and historic objects from the UK and abroad, interactive digital exhibits, and specially commissioned models, the gallery shows how the past, present and future are shaped by human imagination and innovation and explores how we all have a role to play in deciding our energy future,\" a company statement said. The Gallery, which is open to the public for free, examines this century's defining challenge through the lens of imagination across three sections. In Future Planet, visitors can explore how scientists use complex computer-based models to understand our planet, and what these tell us about the range of climate futures that might lie ahead. In Future Energy, technologies and the people behind them that are reimagining how energy is supplied and used are highlighted alongside historic artefacts which provide a longer view of the transition away from fossil fuels. Adani said museums are very important because they teach and inspire. \"This new gallery is about more than just clean air - or about moving away from oil and gas. It is about the energy transition we need - this world needs - and it is about the revolution that is taking place in the world of energy.\" The gallery, he said, was special because it makes us think, dream and wish for change. At the centre of the gallery is Only Breath, a moving sculpture that signifies the power of nature to inspire technological change. Radiating outward from the centre are plinths which display vital low-carbon renewable energy technologies for the transition, from nuclear, hydrogen and solar to wind and tidal power, alongside remarkable historic innovations that remind us how major change is possible and that many of the technologies needed to make the low-carbon energy transition already exist. Objects in this section include a 7m long tidal turbine blade made by Scottish renewable energy company Orbital Marine Power and the first electric taxi, the Bersey cab, hailed by Londoners in 1897. The challenges of electrification, energy storage, and supply and demand are also explored, with visitors invited to play interactive games and use models that show how energy can be generated and distributed. Possible routes to low-carbon transport are featured, as well the decarbonisation of our buildings and construction industries, and visitors can learn about climate modelling and see instruments used to measure climate.Energy Revolution was designed by award-winning architects, Unknown Works.A key element of sustainable design was the reuse of redundant shelves from the Science Museum's former object store. The gallery's carbon footprint has been monitored, and recyclable aluminium was used where possible.The gallery's Title Funder is Adani Green Energy.Sagar Adani, Executive Director, AGEL, said, \"The Science Museum has put together the world's best curated gallery on energy transition. As one of the world's largest renewable energy companies, we are committed to making progress towards net zero - and there is no greater resource in the fight against climate change than education.\"Through the sponsorship of the gallery, we aim to inspire young minds, scientists and innovators to imagine a future powered by clean energy and build a carbon-free world. It is an initiative to stimulate their interest, curiosity and awareness, and encourage their active participation in creating clean technologies. The gallery brings together the global community to enable the shift towards energy efficiency, clean energy adoption and carbon emissions reduction.\" Sir Ian Blatchford, Director and Chief Executive of the Science Museum Group, said, \"In a week when we're celebrating a record 2.25 million visits by UK residents to the museum, including a million children, this stunning gallery offers even more to ignite curiosity among those who will visit in the year ahead - provoking important conversations about the urgent need for the world to generate and use energy more sustainably.\" ","cleaned_content":"billionaire gautam adanis group is building the worlds largest renewable energy park in gujarat as it eyes a massive \u003cFOUR_TEN\u003e gw capacity to generate electricity largely from solar energy speaking at the opening of energy revolution the adani green energy gallery at the science museum in london gautam adani said his groups renewable energy arm adani green energy is leading an energy transition that honours the commitment of taking care of the planet not just for this generation and the next but also for generations to come as the worlds leading solar power developer and indias largest renewable energy company we are taking very big steps he said this will be like providing clean energy to almost every house in england he said it currently has an operating renewable portfolio of over \u003cNINE_\u003e gw and locked in projects of up to \u003cTWO_TEN\u003e gigawatt gw the gallery explores how the world can generate and use energy more sustainably to urgently decarbonise and to limit dangerous climate change through striking displays of contemporary and historic objects from the uk and abroad interactive digital exhibits and specially commissioned models the gallery shows how the past present and future are shaped by human imagination and innovation and explores how we all have a role to play in deciding our energy future a company statement said the gallery which is open to the public for free examines this centurys defining challenge through the lens of imagination across three sections in future planet visitors can explore how scientists use complex computer based models to understand our planet and what these tell us about the range of climate futures that might lie ahead in future energy technologies and the people behind them that are reimagining how energy is supplied and used are highlighted alongside historic artefacts which provide a longer view of the transition away from fossil fuels adani said museums are very important because they teach and inspire this new gallery is about more than just clean air or about moving away from oil and gas it is about the energy transition we need this world needs and it is about the revolution that is taking place in the world of energy the gallery he said was special because it makes us think dream and wish for change at the centre of the gallery is only breath a moving sculpture that signifies the power of nature to inspire technological change radiating outward from the centre are plinths which display vital low carbon renewable energy technologies for the transition from nuclear hydrogen and solar to wind and tidal power alongside remarkable historic innovations that remind us how major change is possible and that many of the technologies needed to make the low carbon energy transition already exist objects in this section include a \u003cSEVEN_\u003e m long tidal turbine blade made by scottish renewable energy company orbital marine power and the first electric taxi the bersey cab hailed by londoners in \u003cONE_THOUSAND\u003e the challenges of electrification energy storage and supply and demand are also explored with visitors invited to play interactive games and use models that show how energy can be generated and distributed possible routes to low carbon transport are featured as well the decarbonisation of our buildings and construction industries and visitors can learn about climate modelling and see instruments used to measure climate energy revolution was designed by award winning architects unknown works a key element of sustainable design was the reuse of redundant shelves from the science museums former object store the gallerys carbon footprint has been monitored and recyclable aluminium was used where possible the gallerys title funder is adani green energy sagar adani executive director agel said the science museum has put together the worlds best curated gallery on energy transition as one of the worlds largest renewable energy companies we are committed to making progress towards net zero and there is no greater resource in the fight against climate change than education through the sponsorship of the gallery we aim to inspire young minds scientists and innovators to imagine a future powered by clean energy and build a carbon free world it is an initiative to stimulate their interest curiosity and awareness and encourage their active participation in creating clean technologies the gallery brings together the global community to enable the shift towards energy efficiency clean energy adoption and carbon emissions reduction sir ian blatchford director and chief executive of the science museum group said in a week when were celebrating a record \u003cTWO_\u003e million visits by uk residents to the museum including a million children this stunning gallery offers even more to ignite curiosity among those who will visit in the year ahead provoking important conversations about the urgent need for the world to generate and use energy more sustainably","timestamp":"2024-03-26T15:03:00+05:30","market_timestamp":"2024-03-26T15:03:00+05:30","off_market_hours":false}