{"url":"https://www.moneycontrol.com/news/business/share-block-in-india-raise-7-1-billion-as-tata-bat-cash-in-12500181.html","title":"Share block in India raise $7.1 billion as Tata, BAT cash in","description":"Shareholders have raised $7.1 billion selling their holdings in India so far this year, with the quarter on track to have raised the most from block trades since the January to March period in 2010, data compiled by Bloomberg show. Share block in India raise $7.1 billion as Tata, BAT cash inRelated stories","content":"Block trades in India are close to capping their best quarter in 14 years as the country’s booming stock market encourages shareholders to monetize stakes. Shareholders have raised $7.1 billion selling their holdings in India so far this year, with the quarter on track to have raised the most from block trades since the January to March period in 2010, data compiled by Bloomberg show. India’s equity capital markets have been running hot for the past year as its stocks climb to record highs and foreign investors pile in amid a rotation away from China, which has been mired in an economic slowdown. More foreign inflows are likely to come after the nation’s general elections starting next month, with the country’s growth prospects providing a catalyst. “With elections over, there could be another round of block trades or sell-downs. Domestic liquidity and foreign appetite remain very strong for Indian assets,” said Rahul Saraf, Citigroup’s India head of investment banking. The election results will be tallied on June 4. With one of the world’s fastest rates of economic growth and relative political stability, Indian equities have soared, with the benchmark Sensex Index notching eight years of annual gains. The euphoria has prompted companies in India to go public at the fastest pace on record, as well as encouraging a continuous flow of additional share sales by listed firms since the start of the year. The flurry of activity contrasts with a slowdown in other parts of Asia, including Hong Kong and China, where a mix of economic growth woes and lower valuations have kept sellers on the sidelines. There hasn’t been a block larger than $500 million in mainland China or Hong Kong since July, Bloomberg-compiled data show. “We are only in March, but ECM activity in India has been very active with volumes already equaling more than 50 percent of last year, largely dominated by blocks,” said Kailash Soni, executive director responsible for Indian equity capital markets at Goldman Sachs Group Inc. “Despite elections looming on the horizon, markets are not expecting uncertainty during that time,” he added. This week, Tata Sons Ltd. raised the equivalent of $1.1 billion through the sale of shares in the group’s software services unit Tata Consultancy Services Ltd. It’s the largest block involving shares of the software services unit since 2018, data compiled by Bloomberg show. British American Tobacco Plc last week raised almost 175 billion rupees from the sale of a 3.5% stake in its Indian partner ITC Ltd. for Asia’s largest block trade of 2024. That followed an upsized $820 million stake sale in India’s biggest airline IndiGo by its co-founder, who cashed in as the stock neared a record high. US home appliance giant Whirlpool Corp. sold part of its stake in its Indian unit in February, raising $469 million. It joined a number of foreign firms monetizing their Indian businesses to take advantage of the high valuations. Investors have mostly welcomed the stake sales. ITC’s shares surged the most in almost four years after BAT’s disposal and were trading above the offer price last week. IndiGo’s shares have climbed almost 8% above the price at which Rakesh Gangwal sold them in the block trade. ","cleaned_content":"block trades in india are close to capping their best quarter in \u003cONE_TEN\u003e years as the country s booming stock market encourages shareholders to monetize stakes shareholders have raised \u003cSEVEN_\u003e billion selling their holdings in india so far this year with the quarter on track to have raised the most from block trades since the january to march period in \u003cTWO_THOUSAND\u003e data compiled by bloomberg show india s equity capital markets have been running hot for the past year as its stocks climb to record highs and foreign investors pile in amid a rotation away from china which has been mired in an economic slowdown more foreign inflows are likely to come after the nation s general elections starting next month with the country s growth prospects providing a catalyst with elections over there could be another round of block trades or sell downs domestic liquidity and foreign appetite remain very strong for indian assets said rahul saraf citigroup s india head of investment banking the election results will be tallied on june \u003cFOUR_\u003e with one of the world s fastest rates of economic growth and relative political stability indian equities have soared with the benchmark sensex index notching eight years of annual gains the euphoria has prompted companies in india to go public at the fastest pace on record as well as encouraging a continuous flow of additional share sales by listed firms since the start of the year the flurry of activity contrasts with a slowdown in other parts of asia including hong kong and china where a mix of economic growth woes and lower valuations have kept sellers on the sidelines there hasn t been a block larger than \u003cFIVE_HUNDRED\u003e million in mainland china or hong kong since july bloomberg compiled data show we are only in march but ecm activity in india has been very active with volumes already equaling more than \u003cFIVE_TEN_PERCENT\u003e of last year largely dominated by blocks said kailash soni executive director responsible for indian equity capital markets at goldman sachs group inc despite elections looming on the horizon markets are not expecting uncertainty during that time he added this week tata sons ltd raised the equivalent of \u003cONE_\u003e billion through the sale of shares in the group s software services unit tata consultancy services ltd it s the largest block involving shares of the software services unit since \u003cTWO_THOUSAND\u003e data compiled by bloomberg show british american tobacco plc last week raised almost \u003cONE_HUNDRED\u003e billion rupees from the sale of a \u003cTHREE_PERCENT\u003e stake in its indian partner itc ltd for asia s largest block trade of \u003cTWO_THOUSAND\u003e that followed an upsized \u003cEIGHT_HUNDRED\u003e million stake sale in india s biggest airline indigo by its co founder who cashed in as the stock neared a record high us home appliance giant whirlpool corp sold part of its stake in its indian unit in february raising \u003cFOUR_HUNDRED\u003e million it joined a number of foreign firms monetizing their indian businesses to take advantage of the high valuations investors have mostly welcomed the stake sales itc s shares surged the most in almost four years after bat s disposal and were trading above the offer price last week indigo s shares have climbed almost \u003cEIGHT_PERCENT\u003e above the price at which rakesh gangwal sold them in the block trade","timestamp":"2024-03-21T19:43:00+05:30","market_timestamp":"2024-03-22T09:15:00+05:30","off_market_hours":true}