{"url":"https://www.moneycontrol.com/news/business/proptech-firm-aeria-raises-1-8-million-from-investors-to-expand-business-12521831.html","title":"Proptech firm Aeria raises $1.8 million from investors to expand business","description":"In a statement, Aeria said it has closed USD 1.8 million pre-seed funding round led by Kalaari Capital and Foundamental along with AC Ventures and AL Trust. Many angel investors also participated.BRICS development bank aims to make $5 billion in loans in 2024Related stories","content":"Aeria, a tech platform for managing commercial real estate, has raised USD 1.8 million (around Rs 15 crore) from investors including Kalaari Capital to expand its business. In a statement, Aeria said it has closed USD 1.8 million pre-seed funding round led by Kalaari Capital and Foundamental along with AC Ventures and AL Trust. Many angel investors also participated. Aeria will use the capital to expand its presence across Southeast Asia, Middle East and other Asian countries. \"Commercial real estate in Asia Pacific is estimated at 52 billion square feet, expanding at a CAGR of 15 per cent. \"However, most owners currently rely on traditional methods to manage facilities and tenants. We aim to use technology to transform this experience and bring in efficiency to the owner's operations.\" said Priyanka Gera, Founder and CEO of Aeria. To address the problem of fragmented infrastructure, Aeria said it offers a comprehensive solution well-integrated with multiple technologies to create an engaging digital experience in one app to manage operations by digitizing and automating manual tasks. It includes modern access and parking management systems, delivery-to-desk services, fully-integrated and seamless visitor management solution, end-to-end well automated complaint resolution, last-mile commute addition, F\u0026B integration, move-in services, and community management, among others. According to Housing.com data, proptech companies have received more than USD 4 billion in funding since 2009, helped by the rapid growth in the use of technologies in the real estate sector during the last 4-5 years. ","cleaned_content":"aeria a tech platform for managing commercial real estate has raised usd \u003cONE_\u003e million around rs \u003cONE_TEN\u003e crore from investors including kalaari capital to expand its business in a statement aeria said it has closed usd \u003cONE_\u003e million pre seed funding round led by kalaari capital and foundamental along with ac ventures and al trust many angel investors also participated aeria will use the capital to expand its presence across southeast asia middle east and other asian countries commercial real estate in asia pacific is estimated at \u003cFIVE_TEN\u003e billion square feet expanding at a cagr of \u003cONE_TEN_PERCENT\u003e however most owners currently rely on traditional methods to manage facilities and tenants we aim to use technology to transform this experience and bring in efficiency to the owners operations said priyanka gera founder and ceo of aeria to address the problem of fragmented infrastructure aeria said it offers a comprehensive solution well integrated with multiple technologies to create an engaging digital experience in one app to manage operations by digitizing and automating manual tasks it includes modern access and parking management systems delivery to desk services fully integrated and seamless visitor management solution end to end well automated complaint resolution last mile commute addition f b integration move in services and community management among others according to housing com data proptech companies have received more than usd \u003cFOUR_\u003e billion in funding since \u003cTWO_THOUSAND\u003e helped by the rapid growth in the use of technologies in the real estate sector during the last \u003cFOUR_\u003e \u003cFIVE_\u003e years","timestamp":"2024-03-27T02:56:00+05:30","market_timestamp":"2024-03-27T09:15:00+05:30","off_market_hours":true}