{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-mfs-holding-i-sec-shares-play-safe-bears-feast-on-valor-fund-managers-prep-for-nav-exam-liberty-shoes-promoters-smoke-peace-pipe-12533061.html","title":"MC Inside Edge: MFs holding I-Sec shares play safe, bears feast on Valor, fund managers prep for NAV exam, Liberty Shoes promoters smoke peace pipe","description":"Read to know about all the inner goings-on from Dalal Street; major deals, what stocks veteran bulls are eyeing, what the bears are ganging up against Here's what stocks veteran bulls are eyeing, what the bears are ganging up against.Related stories","content":"Always by your side Things have not gone well for Valor Estate (erstwhile D B Realty) since the time it announced its qualified institutional placement (QIP). The deal happened at a 5 percent discount to the floor price, and failed to draw marquee investors. Bears took that as a signal and began hammering the stock. What appears to have given further ammunition to the bears is Pinnacle Investments selling 3 million shares last week. Pinnacle is the family office of Prestige Estate group promoter Irfan Razack and CEO Venkat K Narayana. The Razack Family Trust is a key shareholder in DB with a 15 percent stake. An unusual clarification from Pinnacle followed, in which it reiterated its long term commitment to the company despite selling a part of its holdings. That has fallen on deaf ears for now, as the stock climbed to a high of Rs 207 during the day on Wednesday, March 27,  but slipped to Rs 198 at close. It is now down 30 percent in less than two weeks since hitting a 13-year high. The fact that realty stocks in general are holding ground in a choppy market is making the Street wonder what is giving bears the confidence to go after Valor. Especially considering the buoyancy in the Mumbai real estate market. Retail shareholders of ICICI Securities must be surprised why most institutional investors are not sharing their outrage over the proposal to merge ICICI Securities with ICICI Bank. Mutual funds may have become a dominant force, but they too need to choose their battles carefully. Opposing the merger would mean getting a better value for their ICICI Securities holdings. But then they also need to consider other factors like access to management, ICICI Bank’s distribution might, and the bank’s treasury funds that could flow into their debt schemes. As the saying goes, discretion is the better part of valour. NAV prop desk Among the annual rituals of Dalal Street is the net asset value (NAV) propping game. And thanks to ever rising SIP flows every month, the task appears to have been less  challenging than in some of the previous years. Fund managers wanting to show a shiny NAV at the end of the financial year are known to increase exposure to key holdings with an aim to boost the stock price. This could also include buying blocks at inflated prices from friendly brokers and then transferring it back at nearly the same price a few days later. This time the operations have been spread over 2-3 trading sessions, brokers say. Reason: A regulator who knows the ways of the market, having walked that path before. Change in stance Liberty Shoes has written to the stock exchanges seeking a change in the classification of two of its promoter group entities to public shareholders. Market chatter is that this could be the first step towards a reconciliation between the warring Gupta and Bansal families which are part of the promoter group. In December, rating agency Care Edge had placed Liberty Shoes under rating watch, citing the dispute between the promoters as the reason.  Liberty has exclusive long-term agreements with three group firms Liberty Group Marketing Division (LGMD), Liberty Enterprises (LE), and Liberty Footwear Co. (LFC), for business and intellectual property rights. Following the removal of Adesh Gupta as CEO of the company, the above three entities controlled by the Gupta family, have issued termination notices for the agreement. ","cleaned_content":"always by your side things have not gone well for valor estate erstwhile d b realty since the time it announced its qualified institutional placement qip the deal happened at a \u003cFIVE_PERCENT\u003e discount to the floor price and failed to draw marquee investors bears took that as a signal and began hammering the stock what appears to have given further ammunition to the bears is pinnacle investments selling \u003cTHREE_\u003e million shares last week pinnacle is the family office of prestige estate group promoter irfan razack and ceo venkat k narayana the razack family trust is a key shareholder in db with a \u003cONE_TEN_PERCENT\u003e stake an unusual clarification from pinnacle followed in which it reiterated its long term commitment to the company despite selling a part of its holdings that has fallen on deaf ears for now as the stock climbed to a high of rs \u003cTWO_HUNDRED\u003e during the day on wednesday march \u003cTWO_TEN\u003e but slipped to rs \u003cONE_HUNDRED\u003e at close it is now down \u003cTHREE_TEN_PERCENT\u003e in less than two weeks since hitting a \u003cONE_TEN\u003e year high the fact that realty stocks in general are holding ground in a choppy market is making the street wonder what is giving bears the confidence to go after valor especially considering the buoyancy in the mumbai real estate market retail shareholders of icici securities must be surprised why most institutional investors are not sharing their outrage over the proposal to merge icici securities with icici bank mutual funds may have become a dominant force but they too need to choose their battles carefully opposing the merger would mean getting a better value for their icici securities holdings but then they also need to consider other factors like access to management icici bank s distribution might and the bank s treasury funds that could flow into their debt schemes as the saying goes discretion is the better part of valour nav prop desk among the annual rituals of dalal street is the net asset value nav propping game and thanks to ever rising sip flows every month the task appears to have been less challenging than in some of the previous years fund managers wanting to show a shiny nav at the end of the financial year are known to increase exposure to key holdings with an aim to boost the stock price this could also include buying blocks at inflated prices from friendly brokers and then transferring it back at nearly the same price a few days later this time the operations have been spread over \u003cTWO_\u003e \u003cTHREE_\u003e trading sessions brokers say reason a regulator who knows the ways of the market having walked that path before change in stance liberty shoes has written to the stock exchanges seeking a change in the classification of two of its promoter group entities to public shareholders market chatter is that this could be the first step towards a reconciliation between the warring gupta and bansal families which are part of the promoter group in december rating agency care edge had placed liberty shoes under rating watch citing the dispute between the promoters as the reason liberty has exclusive long term agreements with three group firms liberty group marketing division lgmd liberty enterprises le and liberty footwear co lfc for business and intellectual property rights following the removal of adesh gupta as ceo of the company the above three entities controlled by the gupta family have issued termination notices for the agreement","timestamp":"2024-03-28T08:09:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}