{"url":"https://www.moneycontrol.com/news/business/toyota-records-highest-ever-monthly-sales-at-27180-units-in-march-12553521.html","title":"Toyota records highest-ever monthly sales at 27,180 units in March","description":"The company's total dispatches to dealers increased 25 per cent last month to 22,910 units as compared with 21,783 units in March 2023.Toyota records highest-ever monthly sales at 27,180 units in March","content":"Toyota Kirloskar Motor on Monday reported its highest-ever monthly wholesales at 27,180 units in March. The company's total dispatches to dealers increased 25 per cent last month to 22,910 units as compared with 21,783 units in March 2023. For the 2023-24 fiscal the company reported the highest-ever wholesales of 2,63,512 units, an increase of 48 per cent as against 1,77,683 units in 2022-23. With a customer-oriented approach, the company has always remained ahead in assessing and understanding the diverse needs of varied customers and market trends, serving them the best with our wider range of quality products and services, he added. \"We will continue to do so with an emphasis to meet the rising consumer demands across segments. Further, energising our customer centricity will be our focus to move even more closer to our customers on both product as well as service fronts by enhancing customer touchpoints,\" Manohar said. ","cleaned_content":"toyota kirloskar motor on monday reported its highest ever monthly wholesales at \u003cTWO_TEN_THOUSAND\u003e units in march the companys total dispatches to dealers increased \u003cTWO_TEN_PERCENT\u003e last month to \u003cTWO_TEN_THOUSAND\u003e units as compared with \u003cTWO_TEN_THOUSAND\u003e units in march \u003cTWO_THOUSAND\u003e for the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal the company reported the highest ever wholesales of \u003cTWO_HUNDRED_THOUSAND\u003e units an increase of \u003cFOUR_TEN_PERCENT\u003e as against \u003cONE_HUNDRED_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with a customer oriented approach the company has always remained ahead in assessing and understanding the diverse needs of varied customers and market trends serving them the best with our wider range of quality products and services he added we will continue to do so with an emphasis to meet the rising consumer demands across segments further energising our customer centricity will be our focus to move even more closer to our customers on both product as well as service fronts by enhancing customer touchpoints manohar said","timestamp":"2024-04-01T11:28:00+05:30","market_timestamp":"2024-04-01T11:28:00+05:30","off_market_hours":false}