{"url":"https://www.moneycontrol.com/news/business/axis-bank-introduces-digital-opening-of-us-dollar-fixed-deposit-for-nri-customers-at-gift-city-12522551.html","title":"Axis Bank introduces digital opening of US dollar fixed deposit for NRI customers at GIFT City","description":"With this introduction, Axis Bank becomes the first bank to offer a digital journey for GIFT City Deposits, the bank said in a statement.Axis Bank, Bank of India, Citibank, HDFC Bank and IDFC First Bank levies an interest rate starting from 10.75 percent on personal loans. The EMI on a Rs 1-lakh loan with a four-year repayment period amount to Rs 2,572.","content":"Axis Bank on Tuesday announced the introduction of digital US dollar fixed deposit (FD) for NRI customers at the IFSC Banking Unit (IBU) at GIFT City, Gujarat. With this introduction, Axis Bank becomes the first bank to offer a digital journey for GIFT City Deposits, the bank said in a statement. NRI customers of the bank can now open US dollar fixed deposits at GIFT City through 'Open by Axis Bank'; the mobile banking application of the lender, it said. Besides seamlessly opening an FD account anytime from anywhere, customers can also track and manage their FD digitally, it said. With attractive interest rates, Axis Bank provides NRIs with one of the best investment opportunities, it said. The US Dollar fixed deposit also offers a wide range of investment tenures from seven days up to ten years, it said, adding customers can also request partial or full premature closure of the FD from the Axis Bank mobile application. ","cleaned_content":"axis bank on tuesday announced the introduction of digital us dollar fixed deposit fd for nri customers at the ifsc banking unit ibu at gift city gujarat with this introduction axis bank becomes the first bank to offer a digital journey for gift city deposits the bank said in a statement nri customers of the bank can now open us dollar fixed deposits at gift city through open by axis bank the mobile banking application of the lender it said besides seamlessly opening an fd account anytime from anywhere customers can also track and manage their fd digitally it said with attractive interest rates axis bank provides nris with one of the best investment opportunities it said the us dollar fixed deposit also offers a wide range of investment tenures from seven days up to ten years it said adding customers can also request partial or full premature closure of the fd from the axis bank mobile application","timestamp":"2024-03-26T23:27:00+05:30","market_timestamp":"2024-03-27T09:15:00+05:30","off_market_hours":true}