{"url":"https://www.moneycontrol.com/news/business/best-agrolife-acquires-100-stake-in-sudarshan-farm-chemicals-for-rs-139-crore-12542181.html","title":"Best Agrolife acquires 100% stake in Sudarshan Farm Chemicals for Rs 139 crore","description":"The acquisition will enable BAL to leverage SFCL's proficiency in developing cost-effective and distinctive manufacturing routes for off-patent molecules, it said.Best Agrolife acquires 100% stake in Sudarshan Farm Chemicals for Rs 139 croreRelated stories","content":"Agrochemicals maker Best Agrolife Ltd (BAL) on Friday announced the acquisition of a 100 per cent stake in Sudarshan Farm Chemicals India Pvt Ltd (SFCL) for Rs 139 crores. The acquisition will enable BAL to leverage SFCL's proficiency in developing cost-effective and distinctive manufacturing routes for off-patent molecules, it said. \"This acquisition involves obtaining a 100 per cent stake through cash consideration, with an estimated enterprise value of Rs 139 crores based on the valuation,\" the Delhi-based BAL said in a statement. BAL expects to gain significant synergies with this acquisition in the area of R\u0026D and brand. \"With this strategic move, BAL aims to capitalise on SFCL's robust R\u0026D capabilities, Intellectual Property (IP) portfolio, and backward-integrated technical manufacturing expertise,\" the company added. SFCL with a legacy of 40 years has been known for its innovative process chemistries, having an IP portfolio of 10 patents (applied). With this acquisition, Best Agrolife will gain access to SFCL's IP portfolio and its R\u0026D, it added. With this move, BAL gains access to SFCL's popular brands of \"Sutathion,\" \"Suphos,\" \"Suchlor,\" and \"Sumidon.\" The addition of these brands will bolster BAL's presence in the central and southern regions. Sudarshan's extensive network of over 2,500 dealers will be a catalyst for inorganic growth, in alignment with BAL's proposed capacity expansion plans, the company added. Presently, BAL has three manufacturing plants situated in Gajraula and Greater Noida in Uttar Pradesh, and Jammu and Kashmir. ","cleaned_content":"agrochemicals maker best agrolife ltd bal on friday announced the acquisition of a \u003cONE_HUNDRED_PERCENT\u003e stake in sudarshan farm chemicals india pvt ltd sfcl for rs \u003cONE_HUNDRED\u003e crores the acquisition will enable bal to leverage sfcls proficiency in developing cost effective and distinctive manufacturing routes for off patent molecules it said this acquisition involves obtaining a \u003cONE_HUNDRED_PERCENT\u003e stake through cash consideration with an estimated enterprise value of rs \u003cONE_HUNDRED\u003e crores based on the valuation the delhi based bal said in a statement bal expects to gain significant synergies with this acquisition in the area of r d and brand with this strategic move bal aims to capitalise on sfcls robust r d capabilities intellectual property ip portfolio and backward integrated technical manufacturing expertise the company added sfcl with a legacy of \u003cFOUR_TEN\u003e years has been known for its innovative process chemistries having an ip portfolio of \u003cONE_TEN\u003e patents applied with this acquisition best agrolife will gain access to sfcls ip portfolio and its r d it added with this move bal gains access to sfcls popular brands of sutathion suphos suchlor and sumidon the addition of these brands will bolster bals presence in the central and southern regions sudarshans extensive network of over \u003cTWO_THOUSAND\u003e dealers will be a catalyst for inorganic growth in alignment with bals proposed capacity expansion plans the company added presently bal has three manufacturing plants situated in gajraula and greater noida in uttar pradesh and jammu and kashmir","timestamp":"2024-03-29T14:15:00+05:30","market_timestamp":"2024-03-29T14:15:00+05:30","off_market_hours":false}