{"url":"https://www.moneycontrol.com/news/business/malaysia-airlines-indigo-sign-initial-pact-for-codeshare-partnership-12567201.html","title":"Malaysia Airlines, IndiGo sign initial pact for codeshare partnership","description":"Moreover, a cooperation agreement between the two airlines will enable both carriers to provide customers with more options and flexibility for seamless travel between Malaysia and India, IndiGo said in a statement.Malaysia Airlines, IndiGo sign initial pact for codeshare partnership","content":"Malaysia Airlines has inked an initial pact with domestic no-frills carrier IndiGo for a codeshare partnership to boost connectivity between the two countries. Moreover, a cooperation agreement between the two airlines will enable both carriers to provide customers with more options and flexibility for seamless travel between Malaysia and India, IndiGo said in a statement. Through this cooperation, Malaysia Airlines will be able to strengthen its connectivity with India, as the marketing carrier on IndiGo operated flights, while IndiGo customers will get to explore more Southeast Asia destinations through Malaysia Airlines' extensive network, it said. Malaysia Airlines currently operates 71 weekly flights to nine key hubs in India, including New Delhi, Mumbai, Bengaluru, Chennai, Hyderabad, Kochi, Ahmedabad, Amritsar and Trivandrum. \"With India being our largest international market, we are delighted to enter this MoU with IndiGo to further widen our reach beyond the nine hubs we currently operate within India,\" said Izham Ismail, Group Managing Director of Malaysia Aviation Group. ","cleaned_content":"malaysia airlines has inked an initial pact with domestic no frills carrier indigo for a codeshare partnership to boost connectivity between the two countries moreover a cooperation agreement between the two airlines will enable both carriers to provide customers with more options and flexibility for seamless travel between malaysia and india indigo said in a statement through this cooperation malaysia airlines will be able to strengthen its connectivity with india as the marketing carrier on indigo operated flights while indigo customers will get to explore more southeast asia destinations through malaysia airlines extensive network it said malaysia airlines currently operates \u003cSEVEN_TEN\u003e weekly flights to nine key hubs in india including new delhi mumbai bengaluru chennai hyderabad kochi ahmedabad amritsar and trivandrum with india being our largest international market we are delighted to enter this mou with indigo to further widen our reach beyond the nine hubs we currently operate within india said izham ismail group managing director of malaysia aviation group","timestamp":"2024-04-04T02:01:00+05:30","market_timestamp":"2024-04-04T09:15:00+05:30","off_market_hours":true}