{"url":"https://www.moneycontrol.com/news/business/biocon-leads-india-push-into-weight-loss-drugs-as-patents-lapse-12594431.html","title":"Biocon leads India push into weight loss drugs as patents lapse","description":"The Bengaluru-based firm has scored an early win among its peers with the UK approval for the first generic version of liraglutide injectible, which is losing patent protection in November. Biocon leads India push into weight loss drugs as patents lapseRelated stories","content":"Biocon Ltd. is pivoting to anti-obesity therapies as patents for the blockbuster medications start to expire, unleashing a wave of generic supply for the market that’s expected to touch $100 billion by 2030. The Bengaluru-based firm has scored an early win among its peers with the UK approval for the first generic version of liraglutide injectible, which is losing patent protection in November. The weight loss drug, sold under the brand name Saxenda by patent holder Novo Nordisk A/S, is among the first of the groundbreaking medications in this category to lose patent protection. While Saxenda is far less effective for weight loss than later iterations like Wegovy and Ozempic, its generic version is just the beginning of a jackpot that drugmakers like Biocon are awaiting. “My leadership team and organization is ensuring that we do not give up the lead position we have now,” Chief Executive Officer Siddharth Mittal said in an interview. The company, helmed by Kiran Mazumdar Shaw, is leading the charge among Indian drugmakers — the world’s largest supplier of generic medicines — as they race to grab a slice of the obesity drugs market. The global frenzy around these medicines has already lured sector giants Sun Pharmaceutical Industries Ltd., Dr. Reddy’s Laboratories Ltd., and Cipla Ltd., who are also developing their anti-obesity drugs. Weight loss drugs have already produced record profit for innovative pharmaceutical companies from Novo Nordisk to Eli Lilly \u0026 Co. The gold rush is set to spread to generic makers like India’s biggest players when patents expire in the coming years on Ozempic and Wegovy, allowing cheaper copies of the medication to flood the market and plug supply gaps. Novo Nordisk’s Ozempic and Wegovy are made with the same active ingredient, semaglutide, while Eli Lilly’s tirzepatide drug is sold as Zepbound. These, along with liraglutide, are part of a class of medications called glucagon-like peptide 1, or GLP-1, agonists.  Biocon is building capability “to take advantage of what could be a very, very strategic peptide opportunity with GLPs at the center,” Group Chief Executive Officer Peter Bains told analysts in November. ‘Very Complementary’The loss of exclusivity for GLPs will create a multibillion dollar market over the next 10 years and this opportunity was “very complementary” to Biocon’s current biologics business, according to Bains. In the UK, Mittal said the company will wait for the publicly-funded, National Health Services, to float a tender to launch its liraglutide injectible. Biocon’s UK application was filed through its European partner, Zentiva SA. The total addressable UK market opportunity for GLP-1 in diabetes and weight loss is $425 million, according to a March 27 statement by Biocon. Despite the weight-loss segment being a rage globally, these drugs are yet to make an widescale appearance in India whose 1.4 billion-plus population is rapidly getting more affluent and obese. Read More: Junk Food Giants Find $30 Billion Prize in Under-Regulated India Novo Nordisk, which only sells its semaglutide-based pill Rybelsus in India, is planning to introduce injectibles Wegovy and Ozempic in 2026, Reuters reported in February. Eli Lilly is conducting clinical trials in India for weight-loss pill, orforglipron. Biocon has not yet filed for liraglutide approval in India and it is working with the local drug regulators to see if the requirement of a clinical trials can be waived, Mittal said. The company is also looking for a partner to market its obesity drugs in India after it sold its branded formulations business to Eris Lifesciences Ltd. last month. Over the next 20 years, “this is a very attractive space”, Mittal said. The UK approval shows that Biocon can confidently “capture the opportunity in the coming years.” ","cleaned_content":"biocon ltd is pivoting to anti obesity therapies as patents for the blockbuster medications start to expire unleashing a wave of generic supply for the market that s expected to touch \u003cONE_HUNDRED\u003e billion by \u003cTWO_THOUSAND\u003e the bengaluru based firm has scored an early win among its peers with the uk approval for the first generic version of liraglutide injectible which is losing patent protection in november the weight loss drug sold under the brand name saxenda by patent holder novo nordisk a s is among the first of the groundbreaking medications in this category to lose patent protection while saxenda is far less effective for weight loss than later iterations like wegovy and ozempic its generic version is just the beginning of a jackpot that drugmakers like biocon are awaiting my leadership team and organization is ensuring that we do not give up the lead position we have now chief executive officer siddharth mittal said in an interview the company helmed by kiran mazumdar shaw is leading the charge among indian drugmakers the world s largest supplier of generic medicines as they race to grab a slice of the obesity drugs market the global frenzy around these medicines has already lured sector giants sun pharmaceutical industries ltd dr reddy s laboratories ltd and cipla ltd who are also developing their anti obesity drugs weight loss drugs have already produced record profit for innovative pharmaceutical companies from novo nordisk to eli lilly co the gold rush is set to spread to generic makers like india s biggest players when patents expire in the coming years on ozempic and wegovy allowing cheaper copies of the medication to flood the market and plug supply gaps novo nordisk s ozempic and wegovy are made with the same active ingredient semaglutide while eli lilly s tirzepatide drug is sold as zepbound these along with liraglutide are part of a class of medications called glucagon like peptide \u003cONE_\u003e or glp \u003cONE_\u003e agonists biocon is building capability to take advantage of what could be a very very strategic peptide opportunity with glps at the center group chief executive officer peter bains told analysts in november very complementary the loss of exclusivity for glps will create a multibillion dollar market over the next \u003cONE_TEN\u003e years and this opportunity was very complementary to biocon s current biologics business according to bains in the uk mittal said the company will wait for the publicly funded national health services to float a tender to launch its liraglutide injectible biocon s uk application was filed through its european partner zentiva sa the total addressable uk market opportunity for glp \u003cONE_\u003e in diabetes and weight loss is \u003cFOUR_HUNDRED\u003e million according to a march \u003cTWO_TEN\u003e statement by biocon despite the weight loss segment being a rage globally these drugs are yet to make an widescale appearance in india whose \u003cONE_\u003e billion plus population is rapidly getting more affluent and obese read more junk food giants find \u003cTHREE_TEN\u003e billion prize in under regulated india novo nordisk which only sells its semaglutide based pill rybelsus in india is planning to introduce injectibles wegovy and ozempic in \u003cTWO_THOUSAND\u003e reuters reported in february eli lilly is conducting clinical trials in india for weight loss pill orforglipron biocon has not yet filed for liraglutide approval in india and it is working with the local drug regulators to see if the requirement of a clinical trials can be waived mittal said the company is also looking for a partner to market its obesity drugs in india after it sold its branded formulations business to eris lifesciences ltd last month over the next \u003cTWO_TEN\u003e years this is a very attractive space mittal said the uk approval shows that biocon can confidently capture the opportunity in the coming years","timestamp":"2024-04-08T08:46:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}