{"url":"https://www.moneycontrol.com/news/business/makemytrip-expands-accessibility-to-over-150-countries-12597701.html","title":"MakeMyTrip expands accessibility to over 150 countries","description":"MakeMyTrip has expanded its reach to several countries, including major travel markets like the UK, Germany, Japan, Italy, France, and many others, from previously being operational in India, the US, and the UAE, the company said in a statement.MakeMyTrip expands accessibility to over 150 countriesRelated stories","content":"Online travel firm MakeMyTrip on Monday announced expansion of its global reach with its services becoming accessible in over 150 countries. MakeMyTrip has expanded its reach to several countries, including major travel markets like the UK, Germany, Japan, Italy, France, and many others, from previously being operational in India, the US, and the UAE, the company said in a statement. The company has adhered to multiple international compliances, including General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) to accomplish this feat, it added. The decision to make MakeMyTrip accessible globally is a result of testing its processes against rigorous protocols across the world to enable travellers book or modify their travel purchases on the platform without any roadblocks wherever they are geographically, he added. Magow said the travel platform is focusing on increased in-bound tourism. \"Our global accessibility will help us reach the vast Indian diaspora. Importantly, this expansion will enable us to cater to a broader audience, fostering increased inbound travel to India,\" he said. The company's coverage, offering accommodations in more than 2,000 cities, will assist international tourists in discovering the hidden gems of India, he added. ","cleaned_content":"online travel firm makemytrip on monday announced expansion of its global reach with its services becoming accessible in over \u003cONE_HUNDRED\u003e countries makemytrip has expanded its reach to several countries including major travel markets like the uk germany japan italy france and many others from previously being operational in india the us and the uae the company said in a statement the company has adhered to multiple international compliances including general data protection regulation gdpr and california consumer privacy act ccpa to accomplish this feat it added the decision to make makemytrip accessible globally is a result of testing its processes against rigorous protocols across the world to enable travellers book or modify their travel purchases on the platform without any roadblocks wherever they are geographically he added magow said the travel platform is focusing on increased in bound tourism our global accessibility will help us reach the vast indian diaspora importantly this expansion will enable us to cater to a broader audience fostering increased inbound travel to india he said the companys coverage offering accommodations in more than \u003cTWO_THOUSAND\u003e cities will assist international tourists in discovering the hidden gems of india he added","timestamp":"2024-04-08T12:59:00+05:30","market_timestamp":"2024-04-08T12:59:00+05:30","off_market_hours":false}