{"url":"https://www.moneycontrol.com/news/business/toyota-looks-to-introduce-more-premium-models-in-india-12568001.html","title":"Toyota looks to introduce more premium models in India","description":"The company, which sells models like Innova and Fortuner, on Wednesday expanded its range in the country with the introduction of entry-level SUV Urban Cruiser Taisor.Toyota looks to introduce more premium models in IndiaRelated stories","content":"Toyota Kirloskar Motor is looking to drive in more premium models in the country with customers gradually moving towards bigger-sized vehicles in the market, according to a senior company executive. The company, which sells models like Innova and Fortuner, on Wednesday expanded its range in the country with the introduction of entry-level SUV Urban Cruiser Taisor. In an interaction with PTI, Toyota Kirloskar Motor Deputy Managing Director Tadashi Asazuma (Sales and Marketing) said the company aims to cater to the diverse customer requirements in the market. Asazuma said customers are shifting from small cars to bigger cars gradually and that is one reason the company is even expanding its production capacity with a new manufacturing plant to offer new models. When asked if the company would look at bringing in more premium cars in the market, he noted, \"We think it should be necessary\". He further said: \"Last year, we announced (plans) to build a new plant in Bidadi. That is a preparation for meeting with the customer demand.\" The new plant is expected to commence production in 2026, Asazuma noted. The share of sports utility vehicles has risen to 50 per cent of overall wholesales in FY24 while the share of entry-level and sedans has reduced in the same period. On being asked if the company would focus on hybrid technology or battery electric vehicles in the market, he stated that the company has all kinds of technologies and the strategy is to \"meet customer requirements\". He said, \"As of now, in the case of India, we believe that strong hybrid vehicles are a practical solution. But of course, with more and more customer requirements coming in we will think about it (BEVs).\" On the timeframe for introducing its first BEV in the country, he declined to share details. Asazuma said the Indian market is very important for Toyota globally and that the automaker aims to grow along with the auto market which has now become the third largest globally. On the introduction of Urban Cruiser Taisor, Asazuma said the model would help the company to bring in more customers to its fold. The Urban Cruiser Taisor is TKM's version of Maruti Suzuki's Fronx. The automaker, a joint venture between Toyota Motor Company and Kirloskar Group, has also introduced a new scheme for online sales. \"We are now piloting it in Bangalore. If it is successful, it can be introduced at other locations as well. We do not have a detailed plan yet,\" Asazuma said. TKM currently has around 647 touchpoints across the country. Urban Cruiser Taisor is priced between Rs 7.73 lakh and Rs 13.03 lakh (ex-showroom). TKM Managing Director and Chief Executive Officer Masakazu Yoshimura said the Indian market has always been of paramount importance to the company both in terms of product offerings and the introduction of advanced technologies. \"This emphasis was further underpinned by the recent creation of a new region where the Indian market plays an even more crucial role,\" he added. Looking ahead, the company's business strategy in the market will be to continue to focus on contributing to national priorities of localisation, developing a highly skilled workforce and achieving carbon goals, Yoshimura said. ","cleaned_content":"toyota kirloskar motor is looking to drive in more premium models in the country with customers gradually moving towards bigger sized vehicles in the market according to a senior company executive the company which sells models like innova and fortuner on wednesday expanded its range in the country with the introduction of entry level suv urban cruiser taisor in an interaction with pti toyota kirloskar motor deputy managing director tadashi asazuma sales and marketing said the company aims to cater to the diverse customer requirements in the market asazuma said customers are shifting from small cars to bigger cars gradually and that is one reason the company is even expanding its production capacity with a new manufacturing plant to offer new models when asked if the company would look at bringing in more premium cars in the market he noted we think it should be necessary he further said last year we announced plans to build a new plant in bidadi that is a preparation for meeting with the customer demand the new plant is expected to commence production in \u003cTWO_THOUSAND\u003e asazuma noted the share of sports utility vehicles has risen to \u003cFIVE_TEN_PERCENT\u003e of overall wholesales in fy24 while the share of entry level and sedans has reduced in the same period on being asked if the company would focus on hybrid technology or battery electric vehicles in the market he stated that the company has all kinds of technologies and the strategy is to meet customer requirements he said as of now in the case of india we believe that strong hybrid vehicles are a practical solution but of course with more and more customer requirements coming in we will think about it bevs on the timeframe for introducing its first bev in the country he declined to share details asazuma said the indian market is very important for toyota globally and that the automaker aims to grow along with the auto market which has now become the third largest globally on the introduction of urban cruiser taisor asazuma said the model would help the company to bring in more customers to its fold the urban cruiser taisor is tkms version of maruti suzukis fronx the automaker a joint venture between toyota motor company and kirloskar group has also introduced a new scheme for online sales we are now piloting it in bangalore if it is successful it can be introduced at other locations as well we do not have a detailed plan yet asazuma said tkm currently has around \u003cSIX_HUNDRED\u003e touchpoints across the country urban cruiser taisor is priced between rs \u003cSEVEN_\u003e lakh and rs \u003cONE_TEN\u003e lakh ex showroom tkm managing director and chief executive officer masakazu yoshimura said the indian market has always been of paramount importance to the company both in terms of product offerings and the introduction of advanced technologies this emphasis was further underpinned by the recent creation of a new region where the indian market plays an even more crucial role he added looking ahead the companys business strategy in the market will be to continue to focus on contributing to national priorities of localisation developing a highly skilled workforce and achieving carbon goals yoshimura said","timestamp":"2024-04-04T02:00:00+05:30","market_timestamp":"2024-04-04T09:15:00+05:30","off_market_hours":true}