{"url":"https://www.moneycontrol.com/news/business/tiger-global-vc-fund-closes-63-below-target-with-2-2-billion-12561131.html","title":"Tiger Global VC fund closes 63% below target with $2.2 billion","description":"Last week’s final close of Private Investment Partners 16 fund marks the first time a Tiger venture pool attracted less cash than the vintage that preceded it. Tiger Global VC fund closes 63% below target with $2.2 billionRelated stories","content":"Tiger Global Management gathered about $2.2 billion for its latest venture-capital fund, well short of a $6 billion target and its smallest fundraising haul in roughly a decade, according to people familiar with the matter. Last week’s final close of Private Investment Partners 16 fund marks the first time a Tiger venture pool attracted less cash than the vintage that preceded it. That’s a stark reversal after years of robust investor demand, with Tiger raising successively bigger funds to back hundreds of startups annually. Tiger’s last fund of $12.7 billion was its largest ever. With firms slow to return cash, clients have limited ability to make new investments. Many private equity and venture firms have recently missed or cut their fundraising targets, including Apollo Global Management Inc., Carlyle Group Inc. and Insight Partners. It’s the latest in a series of challenges for Tiger. In November, the firm announced that founder Chase Coleman would take over for venture chief Scott Shleifer, who stepped down to become a senior adviser. Shleifer had led the push to rapidly invest just ahead of an industry downturn, which prompted the firm to mark down its VC portfolio by 33% in 2022 and an additional 6% last year. The giant PIP 15 fund in particular was marked down 18% at the end of September after the firm slashed valuations for multiple portfolio companies. Tiger’s early expectation was to raise $8 billion for PIP 16, but the firm told investors in October 2022 that it was targeting $6 billion. By the following February, it revised that to $5 billion, as higher interest rates squeezed Silicon Valley startups and spooked investors, the Wall Street Journal reported. As of June, PIP 16 had gathered $2.06 billion. A spokesperson for New York-based Tiger, which manages almost $50 billion, declined to comment.  PIP 16 will back startups mostly in enterprise technology with a focus on the US and India, making investments over multiple years. Tiger insiders — traditionally the biggest investors in their funds — are putting more of their own cash in PIP 16, accounting for about 20% of its assets, up from roughly 10% for the most recent funds. PIP 16 has been in the market for about 18 months — longer than what the firm has typically needed to lock down cash. It delayed the final close in part to give investors more time following Shleifer’s transition, one of the people said. Some clients also asked for a longer runway to sort out internal budgeting. ","cleaned_content":"tiger global management gathered about \u003cTWO_\u003e billion for its latest venture capital fund well short of a \u003cSIX_\u003e billion target and its smallest fundraising haul in roughly a decade according to people familiar with the matter last week s final close of private investment partners \u003cONE_TEN\u003e fund marks the first time a tiger venture pool attracted less cash than the vintage that preceded it that s a stark reversal after years of robust investor demand with tiger raising successively bigger funds to back hundreds of startups annually tiger s last fund of \u003cONE_TEN\u003e billion was its largest ever with firms slow to return cash clients have limited ability to make new investments many private equity and venture firms have recently missed or cut their fundraising targets including apollo global management inc carlyle group inc and insight partners it s the latest in a series of challenges for tiger in november the firm announced that founder chase coleman would take over for venture chief scott shleifer who stepped down to become a senior adviser shleifer had led the push to rapidly invest just ahead of an industry downturn which prompted the firm to mark down its vc portfolio by \u003cTHREE_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and an additional \u003cSIX_PERCENT\u003e last year the giant pip \u003cONE_TEN\u003e fund in particular was marked down \u003cONE_TEN_PERCENT\u003e at the end of september after the firm slashed valuations for multiple portfolio companies tiger s early expectation was to raise \u003cEIGHT_\u003e billion for pip \u003cONE_TEN\u003e but the firm told investors in october \u003cTWO_THOUSAND\u003e that it was targeting \u003cSIX_\u003e billion by the following february it revised that to \u003cFIVE_\u003e billion as higher interest rates squeezed silicon valley startups and spooked investors the wall street journal reported as of june pip \u003cONE_TEN\u003e had gathered \u003cTWO_\u003e billion a spokesperson for new york based tiger which manages almost \u003cFIVE_TEN\u003e billion declined to comment pip \u003cONE_TEN\u003e will back startups mostly in enterprise technology with a focus on the us and india making investments over multiple years tiger insiders traditionally the biggest investors in their funds are putting more of their own cash in pip \u003cONE_TEN\u003e accounting for about \u003cTWO_TEN_PERCENT\u003e of its assets up from roughly \u003cONE_TEN_PERCENT\u003e for the most recent funds pip \u003cONE_TEN\u003e has been in the market for about \u003cONE_TEN\u003e months longer than what the firm has typically needed to lock down cash it delayed the final close in part to give investors more time following shleifer s transition one of the people said some clients also asked for a longer runway to sort out internal budgeting","timestamp":"2024-04-02T15:21:00+05:30","market_timestamp":"2024-04-02T15:21:00+05:30","off_market_hours":false}