{"url":"https://www.moneycontrol.com/news/business/sobha-ltd-gets-rs-46-crore-income-tax-demand-notices-company-to-file-appeal-12559411.html","title":"Sobha Ltd gets Rs 46 crore income tax demand notices; company to file appeal","description":"The notices were issued by Deputy Commissioner of Income Tax, Central Circle- 1(4), Bengaluru. The notices are related to Assessment Year ( AY) 2016-17 and 2022-23.Sobha Ltd gets Rs 46 crore income tax demand notices; company to file appeal","content":"Realty firm Sobha Ltd has received demand notices of nearly Rs 46 crore from Income Tax Department. The notices were issued by Deputy Commissioner of Income Tax, Central Circle- 1(4), Bengaluru. The notices are related to Assessment Year ( AY) 2016-17 and 2022-23. In a regulatory filing on Monday, Sobha informed that the \"company has received demand notices under section 156 of the Income Tax Act, 1961 for Rs 13.12 crore and Rs 32.68 crore related to AY 2016-17 and AY 2022-23 respectively, due to disallowances of certain expenses and other additions.\" \"The company has legal and factual grounds to substantiate its case. The company is in the process of evaluating the implications of these orders on the financial statements,\" Sobha said. There is no impact on operations or other activities, it added. Bengaluru-based Sobha Ltd is one of the leading real estate firms in the country. ","cleaned_content":"realty firm sobha ltd has received demand notices of nearly rs \u003cFOUR_TEN\u003e crore from income tax department the notices were issued by deputy commissioner of income tax central circle \u003cONE_\u003e \u003cFOUR_\u003e bengaluru the notices are related to assessment year ay \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e in a regulatory filing on monday sobha informed that the company has received demand notices under section \u003cONE_HUNDRED\u003e of the income tax act \u003cONE_THOUSAND\u003e for rs \u003cONE_TEN\u003e crore and rs \u003cTHREE_TEN\u003e crore related to ay \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and ay \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e respectively due to disallowances of certain expenses and other additions the company has legal and factual grounds to substantiate its case the company is in the process of evaluating the implications of these orders on the financial statements sobha said there is no impact on operations or other activities it added bengaluru based sobha ltd is one of the leading real estate firms in the country","timestamp":"2024-04-03T00:58:00+05:30","market_timestamp":"2024-04-03T09:15:00+05:30","off_market_hours":true}