{"url":"https://www.moneycontrol.com/news/business/pag-backed-nuvama-group-eyes-middle-east-for-400-million-12572671.html","title":"PAG-backed Nuvama Group eyes middle east for $400 million","description":"The Mumbai-based firm is targeting 40 billion rupees ($479 million) for its latest Nuvama Crossover IV fund and expects to raise at least $300 million from family offices and rich individuals in the Middle East, according to Anshu Kapoor, president and head of the business. PAG-backed Nuvama Group eyes middle east for $400 millionRelated stories","content":"The asset management unit at PAG-backed Nuvama Group of India plans to tap the wealthy in the Middle East for the first time. The Mumbai-based firm is targeting 40 billion rupees ($479 million) for its latest Nuvama Crossover IV fund and expects to raise at least $300 million from family offices and rich individuals in the Middle East, according to Anshu Kapoor, president and head of the business. The funds have a term of six years and invest in companies preparing to go public on Indian stock exchanges, he said. Indian money managers are looking to raise capital from international markets like the Mideast, the US and the UK, which have a large Indian diaspora keen to participate in the country’s rising wealth and buoyant stock markets. Firms are particularly drawn to the United Arab Emirates, expected to be the largest beneficiary of private wealth assets as Russian capital seeks new homes amid the war in Ukraine. Nuvama also expects to raise another $100 million from the region for a new public equities long-short product, he said. Both funds have been registered in India’s new financial hub of Gujarat International Finance Tec-City, known as GIFT City. To help raise capital for both funds, Nuvama enlisted Dubai-based placement agent Greenstone Equity Partners. The firm also plans to tap into the distribution networks of banks in the region, he said. After it finishes fundraising in the Middle East, Nuvama will offer the crossover fund to investors in India. In addition, the firm will begin marketing its $360 million commercial real estate fund, a joint venture with Cushman \u0026 Wakefield Plc, to domestic investors with the intention of taking it offshore later, Kapoor said. Strategic MovesThe Middle East and regions like Singapore and Hong Kong have large Indian populations as well as people with an “affinity to India,” with portfolio allocations of about 5% to 6% to the country, Kapoor said. He expects that to rise to about 10% to 12% in the next few years. Nuvama launched its asset management business in 2021 after its split with shadow lender Edelweiss Financial Services. Kapoor expects the firm’s assets under management to grow to 200 billion rupees in the next 12 to 18 months, up from 70 billion rupees. Nuvama also plans to add another 10 to 15 people across various strategies to its team of 75 over the next few months. Besides asset management, the group’s businesses consist of wealth management and capital markets. Nuvama Wealth Management Ltd. is also a portfolio company of PAG, the Asia-focused alternative asset manager that runs more than $55 billion in assets, according to its website. Nuvama Wealth has soared 36% this year, after listing in September. ","cleaned_content":"the asset management unit at pag backed nuvama group of india plans to tap the wealthy in the middle east for the first time the mumbai based firm is targeting \u003cFOUR_TEN\u003e billion rupees \u003cFOUR_HUNDRED\u003e million for its latest nuvama crossover iv fund and expects to raise at least \u003cTHREE_HUNDRED\u003e million from family offices and rich individuals in the middle east according to anshu kapoor president and head of the business the funds have a term of six years and invest in companies preparing to go public on indian stock exchanges he said indian money managers are looking to raise capital from international markets like the mideast the us and the uk which have a large indian diaspora keen to participate in the country s rising wealth and buoyant stock markets firms are particularly drawn to the united arab emirates expected to be the largest beneficiary of private wealth assets as russian capital seeks new homes amid the war in ukraine nuvama also expects to raise another \u003cONE_HUNDRED\u003e million from the region for a new public equities long short product he said both funds have been registered in india s new financial hub of gujarat international finance tec city known as gift city to help raise capital for both funds nuvama enlisted dubai based placement agent greenstone equity partners the firm also plans to tap into the distribution networks of banks in the region he said after it finishes fundraising in the middle east nuvama will offer the crossover fund to investors in india in addition the firm will begin marketing its \u003cTHREE_HUNDRED\u003e million commercial real estate fund a joint venture with cushman wakefield plc to domestic investors with the intention of taking it offshore later kapoor said strategic movesthe middle east and regions like singapore and hong kong have large indian populations as well as people with an affinity to india with portfolio allocations of about \u003cFIVE_PERCENT\u003e to \u003cSIX_PERCENT\u003e to the country kapoor said he expects that to rise to about \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e in the next few years nuvama launched its asset management business in \u003cTWO_THOUSAND\u003e after its split with shadow lender edelweiss financial services kapoor expects the firm s assets under management to grow to \u003cTWO_HUNDRED\u003e billion rupees in the next \u003cONE_TEN\u003e to \u003cONE_TEN\u003e months up from \u003cSEVEN_TEN\u003e billion rupees nuvama also plans to add another \u003cONE_TEN\u003e to \u003cONE_TEN\u003e people across various strategies to its team of \u003cSEVEN_TEN\u003e over the next few months besides asset management the group s businesses consist of wealth management and capital markets nuvama wealth management ltd is also a portfolio company of pag the asia focused alternative asset manager that runs more than \u003cFIVE_TEN\u003e billion in assets according to its website nuvama wealth has soared \u003cTHREE_TEN_PERCENT\u003e this year after listing in september","timestamp":"2024-04-04T10:23:00+05:30","market_timestamp":"2024-04-04T10:23:00+05:30","off_market_hours":false}