{"url":"https://www.moneycontrol.com/news/business/piramal-group-arm-invests-rs-110-crore-in-biodeal-pharma-12597951.html","title":"Piramal Group arm invests Rs 110 crore in Biodeal Pharma","description":"The contract development and manufacturing company will deploy the funds infused by Piramal Alternatives for improving its infrastructure and capacities, technology upgrade and a nutraceuticals manufacturing facility, as per an official statement.Piramal Group arm invests Rs 110 crore in Biodeal Pharma","content":"The Piramal Group on Monday announced a Rs 110-crore investment into Biodeal Pharmaceuticals. The contract development and manufacturing company will deploy the funds infused by Piramal Alternatives for improving its infrastructure and capacities, technology upgrade and a nutraceuticals manufacturing facility, as per an official statement. The infusion is done through convertible instruments from Piramal Alternatives' Performing Credit Fund, it said. Piramal Alternatives' chief executive Kalpesh Kikani said the market potential in the nasal sprays segment is strong, and pointed to Biodeal's leading position in contract manufacturing and adherence to global regulatory standards as aspects which make it into an exciting opportunity. Biodeal's managing director Anurag Kumar said the fundraise will help it boost the production capacity by three times, be ready with a new upcoming facility in compliance with United States Food and Drug Administration (USFDA) accreditations in coming 12-15 months and expand its market reach. ","cleaned_content":"the piramal group on monday announced a rs \u003cONE_HUNDRED\u003e crore investment into biodeal pharmaceuticals the contract development and manufacturing company will deploy the funds infused by piramal alternatives for improving its infrastructure and capacities technology upgrade and a nutraceuticals manufacturing facility as per an official statement the infusion is done through convertible instruments from piramal alternatives performing credit fund it said piramal alternatives chief executive kalpesh kikani said the market potential in the nasal sprays segment is strong and pointed to biodeals leading position in contract manufacturing and adherence to global regulatory standards as aspects which make it into an exciting opportunity biodeals managing director anurag kumar said the fundraise will help it boost the production capacity by three times be ready with a new upcoming facility in compliance with united states food and drug administration usfda accreditations in coming \u003cONE_TEN\u003e \u003cONE_TEN\u003e months and expand its market reach","timestamp":"2024-04-08T13:00:00+05:30","market_timestamp":"2024-04-08T13:00:00+05:30","off_market_hours":false}