{"url":"https://www.moneycontrol.com/news/technology/very-confident-srini-pallia-will-turn-around-wipro-former-wipro-cfo-suresh-senapaty-12593961.html","title":"Very confident Srinivas Pallia will turn around Wipro: Former CFO Suresh Senapaty","description":"Senapaty's ringing endorsement of Pallia comes months after he expressed concerns about losing great talent during Thierry Delaporte's tenure Wipro named Srinivas Pallia as the IT major's next CEORelated stories","content":"Suresh Senapaty, former board member of Wipro and one of founder Azim Premji’s most trusted advisors, welcomed Srinivas Pallia's appointment as CEO, and believes he will turn around the fortunes of the software services firm. His statement comes on the back of an announcement by Wipro on April 6th, Saturday, where it said Pallia would take over from Thierry Delaporte, who is leaving a year ahead of his term, which was supposed to end in mid-2025. \"Srini is an extremely bright leader with very high potential.  I am very confident that he will turn around Wipro within reasonable time because he commands very high respect of the Wipro team and is very strong in strategy including execution excellence. All the best to Srini , Rishad (Premji) and the entire leadership team”, he said in a statement to Moneycontrol. “According to me, Wipro must regain its intolerance toward losing great talent by working more deeper in understanding of its talent repository. That’s critical for regaining its success trajectory of growth which has been subdued compared to industry for quite some time now”, he had said to Moneycontrol then. These comments were significant as it was the first time that a top leader of Wipro spoke out about the company’s senior management attrition and slowing growth, especially in the last few years, since Thierry Delaporte took charge as CEO in mid-2020. It’s also important because Senapaty is one of Wipro’s most senior leaders, having been associated with the firm since 1980 and is a key lieutenant of its promoter Azim Premji. He is still associated with Wipro at multiple levels. He’s been on the board of Wipro Enterprises since 2013, and Wipro GE Healthcare since 1995 and plays an advisory role in Premji Invest, the investment arm. He became the CFO of Wipro Corporation, heading the Finance function across IT, Consumer Care, Infrastructure Engineering, and Healthcare. He was a Member of the Board and CFO of Wipro Limited till his retirement in March 2015. Wipro’s revenue growth in constant currency on a year-on-year basis has fallen steeply since Q4FY22. Even in the previous quarter, the company had reported a fall in profit for the fourth consecutive quarter, falling 12 percent year-on-year (YoY) to Rs 2,694 crore. It also adjusted its revenue growth guidance at both the lower and upper end. It revised its revenue growth guidance to -1.5 percent to 0.5 percent. This came after the company slashed the guidance to -3.5 percent to -1.5 percent in the previous quarter. Margins too have been a pain point for Wipro, which are among the lowest when compared to its peers. It has also seen a massive churn at the top level over the last two years. In 2023 alone, over 10 senior leadership members had quit the company including chief growth officer Stephanie Trautman, chief financial officer Jatin Dalal, chief operations officer Sanjeev Singh, India head Satya Easwaran, iDEAS business head Rajan Kohli, among many others. Industry experts gave a thumbs up to Wipro’s appointment of company veteran Srinivas Pallia as the new CEO instead of hiring an external candidate for the job, as the IT services major struggled to turnaround its business growth over the previous quarters. Prior to this new role, Pallia was the CEO for Wipro’s Americas I business. Analysts unanimously called this a well-thought out move as hiring an external CEO could potentially mean a few months of transition and structural changes. Between Wipro’s last two CEOs, Delaporte and Abidali Neemuchwala, many of the company’s senior leadership members and veterans exited the IT major. ","cleaned_content":"suresh senapaty former board member of wipro and one of founder azim premji s most trusted advisors welcomed srinivas pallias appointment as ceo and believes he will turn around the fortunes of the software services firm his statement comes on the back of an announcement by wipro on april \u003cSIX_\u003e th saturday where it said pallia would take over from thierry delaporte who is leaving a year ahead of his term which was supposed to end in mid \u003cTWO_THOUSAND\u003e srini is an extremely bright leader with very high potential i am very confident that he will turn around wipro within reasonable time because he commands very high respect of the wipro team and is very strong in strategy including execution excellence all the best to srini rishad premji and the entire leadership team he said in a statement to moneycontrol according to me wipro must regain its intolerance toward losing great talent by working more deeper in understanding of its talent repository that s critical for regaining its success trajectory of growth which has been subdued compared to industry for quite some time now he had said to moneycontrol then these comments were significant as it was the first time that a top leader of wipro spoke out about the company s senior management attrition and slowing growth especially in the last few years since thierry delaporte took charge as ceo in mid \u003cTWO_THOUSAND\u003e it s also important because senapaty is one of wipro s most senior leaders having been associated with the firm since \u003cONE_THOUSAND\u003e and is a key lieutenant of its promoter azim premji he is still associated with wipro at multiple levels he s been on the board of wipro enterprises since \u003cTWO_THOUSAND\u003e and wipro ge healthcare since \u003cONE_THOUSAND\u003e and plays an advisory role in premji invest the investment arm he became the cfo of wipro corporation heading the finance function across it consumer care infrastructure engineering and healthcare he was a member of the board and cfo of wipro limited till his retirement in march \u003cTWO_THOUSAND\u003e wipro s revenue growth in constant currency on a year on year basis has fallen steeply since q4fy22 even in the previous quarter the company had reported a fall in profit for the fourth consecutive quarter falling \u003cONE_TEN_PERCENT\u003e year on year yoy to rs \u003cTWO_THOUSAND\u003e crore it also adjusted its revenue growth guidance at both the lower and upper end it revised its revenue growth guidance to \u003cONE_PERCENT\u003e to \u003cZERO_PERCENT\u003e this came after the company slashed the guidance to \u003cTHREE_PERCENT\u003e to \u003cONE_PERCENT\u003e in the previous quarter margins too have been a pain point for wipro which are among the lowest when compared to its peers it has also seen a massive churn at the top level over the last two years in \u003cTWO_THOUSAND\u003e alone over \u003cONE_TEN\u003e senior leadership members had quit the company including chief growth officer stephanie trautman chief financial officer jatin dalal chief operations officer sanjeev singh india head satya easwaran ideas business head rajan kohli among many others industry experts gave a thumbs up to wipro s appointment of company veteran srinivas pallia as the new ceo instead of hiring an external candidate for the job as the it services major struggled to turnaround its business growth over the previous quarters prior to this new role pallia was the ceo for wipro s americas i business analysts unanimously called this a well thought out move as hiring an external ceo could potentially mean a few months of transition and structural changes between wipro s last two ceos delaporte and abidali neemuchwala many of the company s senior leadership members and veterans exited the it major","timestamp":"2024-04-08T10:27:00+05:30","market_timestamp":"2024-04-08T10:27:00+05:30","off_market_hours":false}