{"url":"https://www.moneycontrol.com/news/business/just-5-may-purchase-electric-cars-this-year-survey-12561311.html","title":"Just 5% may purchase electric cars this year: Survey","description":"The survey, based on the response of 40,000 people from across 319 districts, also found that more than half of the \"existing or prospective car owners\" are willing to buy an electric car if it is available in the Rs 8-10 lakh price range.Just 5% may purchase electric cars this year: SurveyRelated stories","content":"Only 5 per cent of those looking to buy a four-wheeler in the country are likely to buy an electric car this year, according to a survey. The survey, based on the response of 40,000 people from across 319 districts, also found that more than half of the \"existing or prospective car owners\" are willing to buy an electric car if it is available in the Rs 8-10 lakh price range. Car sales in India crossed 4 million units last year while 72,321 electric four-wheelers were registered, according to the survey conducted by online consumer pulse aggregator platform, LocalCircles. Of the 40,000 respondents who participated in the survey -- conducted over a period of three months -- 42 per cent are from tier-1 cities, 34 per cent from tier 2 and the remaining 24 per cent from tier-3, 4 and rural areas, it said. About 21 per cent of the respondents flagged \"not enough electric car charging stations in my area/city/ town\", while 12 per cent said they \"don't know enough about these vehicles\", according to the survey, explaining the relatively low interest for e-four-wheelers. About 7 per cent of respondents indicated \"not enough choices of models within budget\", while 21 per cent felt e-cars are \"more expensive as compared to regular cars\", the survey said. The India findings from the \"2023 Global Automotive Consumer Study\" by Deloitte noted that the demand for EVs continues to centre on the consumer perception that fuel costs will be significantly lower than ICE cars, outweighing the concern for climate change, it said. Experts say people want to buy electric cars for the driving experience also as there is no engine sound and very little NVH (noise, vibrations, and harshness), which makes the cabin very quiet and comfortable, the platform stated. Automobile experts point out that while operating costs of an electric car are much less than a petrol version, the time taken to offset the difference in purchase cost would take an average commute of 46km/day, or six years. For an average commuter, according to the platform, the distance travelled daily would be considerably less than 46km, or 16,790 km annually. ","cleaned_content":"only \u003cFIVE_PERCENT\u003e of those looking to buy a four wheeler in the country are likely to buy an electric car this year according to a survey the survey based on the response of \u003cFOUR_TEN_THOUSAND\u003e people from across \u003cTHREE_HUNDRED\u003e districts also found that more than half of the existing or prospective car owners are willing to buy an electric car if it is available in the rs \u003cEIGHT_\u003e \u003cONE_TEN\u003e lakh price range car sales in india crossed \u003cFOUR_\u003e million units last year while \u003cSEVEN_TEN_THOUSAND\u003e electric four wheelers were registered according to the survey conducted by online consumer pulse aggregator platform localcircles of the \u003cFOUR_TEN_THOUSAND\u003e respondents who participated in the survey conducted over a period of three months \u003cFOUR_TEN_PERCENT\u003e are from tier \u003cONE_\u003e cities \u003cTHREE_TEN_PERCENT\u003e from tier \u003cTWO_\u003e and the remaining \u003cTWO_TEN_PERCENT\u003e from tier \u003cTHREE_\u003e \u003cFOUR_\u003e and rural areas it said about \u003cTWO_TEN_PERCENT\u003e of the respondents flagged not enough electric car charging stations in my area city town while \u003cONE_TEN_PERCENT\u003e said they dont know enough about these vehicles according to the survey explaining the relatively low interest for e four wheelers about \u003cSEVEN_PERCENT\u003e of respondents indicated not enough choices of models within budget while \u003cTWO_TEN_PERCENT\u003e felt e cars are more expensive as compared to regular cars the survey said the india findings from the \u003cTWO_THOUSAND\u003e global automotive consumer study by deloitte noted that the demand for evs continues to centre on the consumer perception that fuel costs will be significantly lower than ice cars outweighing the concern for climate change it said experts say people want to buy electric cars for the driving experience also as there is no engine sound and very little nvh noise vibrations and harshness which makes the cabin very quiet and comfortable the platform stated automobile experts point out that while operating costs of an electric car are much less than a petrol version the time taken to offset the difference in purchase cost would take an average commute of \u003cFOUR_TEN\u003e km day or six years for an average commuter according to the platform the distance travelled daily would be considerably less than \u003cFOUR_TEN\u003e km or \u003cONE_TEN_THOUSAND\u003e km annually","timestamp":"2024-04-02T18:21:00+05:30","market_timestamp":"2024-04-03T09:15:00+05:30","off_market_hours":true}