{"url":"https://www.moneycontrol.com/news/business/saics-mg-motor-india-plans-to-bring-in-indian-investors-including-jsw-12594801.html","title":"SAIC's MG Motor India plans to bring in Indian investors including JSW","description":"As part of the deal, JSW Ventures, a unit of JSW International Tradecorp Pte Ltd，will buy an aggregate 35% stake in MG Motor India for a total of 35.77 billion Indian rupee ($429.4 million).SAIC's MG Motor India plans to bring in Indian investors including JSW","content":"China's SAIC Motor Corp Ltd said its unit MG Motor India Pvt Ltd plans to introduce investors including JSW Ventures Singapore Pte Ltd, through an equity transfer and by increasing share capital. As part of the deal, JSW Ventures, a unit of JSW International Tradecorp Pte Ltd，will buy an aggregate 35% stake in MG Motor India for a total of 35.77 billion Indian rupee ($429.4 million). \"As MG Motor India aims to continue to increase MG brand's market share in India and effectively prevent operating risks, the unit plans to introduce local Indian investors to create more favorable conditions for sustainable and healthy development,\" SAIC said in statement late on Sunday. IndoEdge India Fund will buy 8% of MG Motor India for 8.18 billion Indian Rupee, a dealer trust will take a 3% stake for 3.07 billion Indian Rupee, while an employee stock ownership plan will take 5% stake for 5.11 billion Indian Rupee. ","cleaned_content":"chinas saic motor corp ltd said its unit mg motor india pvt ltd plans to introduce investors including jsw ventures singapore pte ltd through an equity transfer and by increasing share capital as part of the deal jsw ventures a unit of jsw international tradecorp pte ltd will buy an aggregate \u003cTHREE_TEN_PERCENT\u003e stake in mg motor india for a total of \u003cTHREE_TEN\u003e billion indian rupee \u003cFOUR_HUNDRED\u003e million as mg motor india aims to continue to increase mg brands market share in india and effectively prevent operating risks the unit plans to introduce local indian investors to create more favorable conditions for sustainable and healthy development saic said in statement late on sunday indoedge india fund will buy \u003cEIGHT_PERCENT\u003e of mg motor india for \u003cEIGHT_\u003e billion indian rupee a dealer trust will take a \u003cTHREE_PERCENT\u003e stake for \u003cTHREE_\u003e billion indian rupee while an employee stock ownership plan will take \u003cFIVE_PERCENT\u003e stake for \u003cFIVE_\u003e billion indian rupee","timestamp":"2024-04-08T10:27:00+05:30","market_timestamp":"2024-04-08T10:27:00+05:30","off_market_hours":false}