{"url":"https://www.moneycontrol.com/news/business/bain-backed-adani-capital-hires-rakesh-das-as-chief-credit-officer-12613761.html","title":"Bain-Backed Adani Capital hires Rakesh Das as chief credit officer","description":"Rakesh Das, who joined last week, will oversee the non-bank financial company’s credit practices, said the people, asking to be unnamed because they aren’t authorized to speak publicly about it. Bain-Backed Adani Capital hires Rakesh Das as chief credit officer","content":"Adani Capital Private Ltd. has hired a chief credit officer in a management change triggered by a regulatory requirement, according to people familiar with the matter. Rakesh Das, who joined last week, will oversee the non-bank financial company’s credit practices, said the people, asking to be unnamed because they aren’t authorized to speak publicly about it. His predecessor, Rajaram Manian, will stay with the company to focus on oversight of risk management, as a central bank rule requires non-bank financial companies to appoint a chief risk officer if they hit 50 billion rupees ($600 million) of assets, they said. Manian had previously overseen both credit and risk at Adani Capital. Adani Capital, which is controlled by Bain Capital, didn’t immediately reply to Bloomberg’s request for comment. Last year, Bain Capital agreed to buy the 90% stake Gautam Adani’s family held in Adani Capital. Gaurav Gupta, Adani Capital’s managing director and chief executive officer, holds the remaining 10%. ","cleaned_content":"adani capital private ltd has hired a chief credit officer in a management change triggered by a regulatory requirement according to people familiar with the matter rakesh das who joined last week will oversee the non bank financial company s credit practices said the people asking to be unnamed because they aren t authorized to speak publicly about it his predecessor rajaram manian will stay with the company to focus on oversight of risk management as a central bank rule requires non bank financial companies to appoint a chief risk officer if they hit \u003cFIVE_TEN\u003e billion rupees \u003cSIX_HUNDRED\u003e million of assets they said manian had previously overseen both credit and risk at adani capital adani capital which is controlled by bain capital didn t immediately reply to bloomberg s request for comment last year bain capital agreed to buy the \u003cNINE_TEN_PERCENT\u003e stake gautam adani s family held in adani capital gaurav gupta adani capital s managing director and chief executive officer holds the remaining \u003cONE_TEN_PERCENT\u003e","timestamp":"2024-04-10T13:45:00+05:30","market_timestamp":"2024-04-10T13:45:00+05:30","off_market_hours":false}