{"url":"https://www.moneycontrol.com/news/business/strides-pharma-gets-usfda-nod-for-antidepressant-medication-12604861.html","title":"Strides Pharma gets USFDA nod for antidepressant medication","description":"The company's Singapore-based step-down wholly-owned subsidiary, Strides Pharma Global Pte Ltd, has received approval for Fluoxetine Tabs (10 and 20 mg) from the US Food \u0026 Drug Administration (USFDA), the drug firm said in a regulatory filing.Strides Pharma gets USFDA nod for antidepressant medication","content":"Strides Pharma Science on Tuesday said its subsidiary has received approval from the US health regulator to market a generic antidepressant medication. The company's Singapore-based step-down wholly-owned subsidiary, Strides Pharma Global Pte Ltd, has received approval for Fluoxetine Tabs (10 and 20 mg) from the US Food \u0026 Drug Administration (USFDA), the drug firm said in a regulatory filing. The company's Singapore-based step-down wholly-owned subsidiary, Strides Pharma Global Pte Ltd, has received approval for Fluoxetine Tabs (10 and 20 mg) from the US Food \u0026 Drug Administration (USFDA), the drug firm said in a regulatory filing. This approval further strengthens the company's presence in the Fluoxetine portfolio, complementing the existing approval of Fluoxetine capsules, which has a market size of USD106 million, the Bengaluru based firm said. Fluoxetine is used for the treatment of major depressive disorder (MDD) and Obsessive Compulsive Disorder (OCD) among others. ","cleaned_content":"strides pharma science on tuesday said its subsidiary has received approval from the us health regulator to market a generic antidepressant medication the companys singapore based step down wholly owned subsidiary strides pharma global pte ltd has received approval for fluoxetine tabs \u003cONE_TEN\u003e and \u003cTWO_TEN\u003e mg from the us food drug administration usfda the drug firm said in a regulatory filing the companys singapore based step down wholly owned subsidiary strides pharma global pte ltd has received approval for fluoxetine tabs \u003cONE_TEN\u003e and \u003cTWO_TEN\u003e mg from the us food drug administration usfda the drug firm said in a regulatory filing this approval further strengthens the companys presence in the fluoxetine portfolio complementing the existing approval of fluoxetine capsules which has a market size of usd106 million the bengaluru based firm said fluoxetine is used for the treatment of major depressive disorder mdd and obsessive compulsive disorder ocd among others","timestamp":"2024-04-09T11:56:00+05:30","market_timestamp":"2024-04-09T11:56:00+05:30","off_market_hours":false}