{"url":"https://www.moneycontrol.com/news/business/lupin-glenmark-recall-drugs-in-us-market-usfda-12613191.html","title":"Lupin, Glenmark recall drugs in US market: USFDA","description":"As per the latest Enforcement Report by the US Food and Drug Administration (USFDA), Lupin is recalling 26,352 bottles of Rifampin Capsules (300 mg), an antibiotic medication in the US market.Lupin, Glenmark recall drugs in US market: USFDARelated stories","content":"Leading generic drug makers Lupin, Glenmark, and Natco Pharma are recalling products in the American market for manufacturing issues, according to the US health regulator. As per the latest Enforcement Report by the US Food and Drug Administration (USFDA), Lupin is recalling 26,352 bottles of Rifampin Capsules (300 mg), an antibiotic medication in the US market. The affected lot has been produced by the drug firm at its Aurangabad-based facility and marketed in the American market by its Baltimore-based unit Lupin Pharmaceuticals, Inc. USFDA stated that Glenmark is recalling 6,528 bottles of Diltiazem Hydrochloride extended-release capsules due to \"Failed Dissolution Specifications''. The drug, used to treat high blood pressure, was marketed in the US market by New Jersey-based Glenmark Pharmaceuticals Inc., USA, a unit of the Mumbai-headquartered drug firm. The firm initiated the Class II recall on March 26, 2024. Hyderabad-based Natco Pharma is recalling 30 bottles of Lansoprazole delayed-release capsules, used to treat heartburn, in the American market, due to \"CGMP Deviations\", USFDA stated. The product is manufactured by the company in its Kothur (Telangana) based formulation plant. The company initiated the Class II recall on March 27 this year. As per the USFDA, a Class II recall is initiated in a situation in which the use of, or exposure to, a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote. India is the largest supplier of generic medicines with around 20 per cent share in the global supply by manufacturing 60,000 different generic brands across 60 therapeutic categories. The products manufactured in the country are shipped to over 200 countries around the globe, with Japan, Australia, West Europe and the US as the main destinations. India has the highest number of USFDA compliant companies with plants outside of the USA. As per the fiscal year, 2022 report on State of Pharmaceutical Quality published by USFDA, India boasts of more than 600 USFDA registered manufacturing sites, constituting nearly 12.5 per cent of all registered manufacturing sites operating outside the US. ","cleaned_content":"leading generic drug makers lupin glenmark and natco pharma are recalling products in the american market for manufacturing issues according to the us health regulator as per the latest enforcement report by the us food and drug administration usfda lupin is recalling \u003cTWO_TEN_THOUSAND\u003e bottles of rifampin capsules \u003cTHREE_HUNDRED\u003e mg an antibiotic medication in the us market the affected lot has been produced by the drug firm at its aurangabad based facility and marketed in the american market by its baltimore based unit lupin pharmaceuticals inc usfda stated that glenmark is recalling \u003cSIX_THOUSAND\u003e bottles of diltiazem hydrochloride extended release capsules due to failed dissolution specifications the drug used to treat high blood pressure was marketed in the us market by new jersey based glenmark pharmaceuticals inc usa a unit of the mumbai headquartered drug firm the firm initiated the class ii recall on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e hyderabad based natco pharma is recalling \u003cTHREE_TEN\u003e bottles of lansoprazole delayed release capsules used to treat heartburn in the american market due to cgmp deviations usfda stated the product is manufactured by the company in its kothur telangana based formulation plant the company initiated the class ii recall on march \u003cTWO_TEN\u003e this year as per the usfda a class ii recall is initiated in a situation in which the use of or exposure to a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote india is the largest supplier of generic medicines with around \u003cTWO_TEN_PERCENT\u003e share in the global supply by manufacturing \u003cSIX_TEN_THOUSAND\u003e different generic brands across \u003cSIX_TEN\u003e therapeutic categories the products manufactured in the country are shipped to over \u003cTWO_HUNDRED\u003e countries around the globe with japan australia west europe and the us as the main destinations india has the highest number of usfda compliant companies with plants outside of the usa as per the fiscal year \u003cTWO_THOUSAND\u003e report on state of pharmaceutical quality published by usfda india boasts of more than \u003cSIX_HUNDRED\u003e usfda registered manufacturing sites constituting nearly \u003cONE_TEN_PERCENT\u003e of all registered manufacturing sites operating outside the us","timestamp":"2024-04-10T18:36:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}