{"url":"https://www.moneycontrol.com/news/business/real-estate/embassy-reit-plans-to-raise-up-to-400-million-hires-banks-report-12560771.html","title":"Embassy REIT plans to raise up to $400 million, hires banks: Report","description":"Embassy, which manages 45 million square feet (4.18 million square meters) of office parks, has clients including Google, Cisco and IBM who are bolstering their presence in the world's fifth biggest economy.Tiger Global VC fund closes 63% below target with $2.2 billionRelated stories","content":"India's largest real estate investment trust, Embassy Office Parks, plans to raise up to $400 million from investors, two sources with direct knowledge said, as it looks to meet demand for office space from global and local giants. Embassy, which manages 45 million square feet (4.18 million square meters) of office parks, has clients including Google, Cisco and IBM who are bolstering their presence in the world's fifth biggest economy. The property group has appointed investment banks Morgan Stanley and India's Kotak to run the deal, which it expects to complete by June, said the sources, who did not want to be named because the talks are private. Commercial real estate is booming in India, with large local and global companies hiring in record numbers after the COVID-19 pandemic. In 2023, companies in India leased 61.6 million square feet of office space, and the year's last quarter saw record quarterly leasing, consultancy firm CBRE said. That's in contrast with markets such as the U.S., UK and Australia, where office occupancies have slumped with people working from home. Although companies in India too have 'hybrid' working models, many still need more office space to fit new hires and for back offices, which employ thousands. Embassy, Asia's biggest office REIT, aims to seek board approval in coming weeks for the deal, which it plans to carry out via a Qualified Institutional Placement (QIP), a tool used by listed Indian companies to raise funds from mutual funds and other large institutions. With the boom in Indian office space, the deal is expected to attract foreign asset managers and mutual funds, said one of the sources with direct knowledge. Embassy and the banks did not respond to queries seeking comment. With properties in four cities - Pune, Mumbai, Bengaluru and the National Capital Region - Embassy has 245 occupants, mainly from the technology and financial services sectors. A large portion of those occupants are Fortune 500 companies. Private equity giant Blackstone, which used to own a controlling stake in Embassy, sold that down in recent years, fully exiting the company last year. Embassy's units have risen 17% the past year, more than India's two other listed REITs, but less than the broader NIFTY Realty index which has more than doubled in the same period. While Embassy focuses on offices, India's broader real estate space, including residential and warehousing is seeing growing interest from investors as demand and prices skyrocket. For the December quarter, Embassy's post-tax profit rose 6% to 2.3 billion rupees ($27.58 million) while its total income grew 5.3% to 9.8 billion rupees. ","cleaned_content":"indias largest real estate investment trust embassy office parks plans to raise up to \u003cFOUR_HUNDRED\u003e million from investors two sources with direct knowledge said as it looks to meet demand for office space from global and local giants embassy which manages \u003cFOUR_TEN\u003e million square feet \u003cFOUR_\u003e million square meters of office parks has clients including google cisco and ibm who are bolstering their presence in the worlds fifth biggest economy the property group has appointed investment banks morgan stanley and indias kotak to run the deal which it expects to complete by june said the sources who did not want to be named because the talks are private commercial real estate is booming in india with large local and global companies hiring in record numbers after the covid \u003cONE_TEN\u003e pandemic in \u003cTWO_THOUSAND\u003e companies in india leased \u003cSIX_TEN\u003e million square feet of office space and the years last quarter saw record quarterly leasing consultancy firm cbre said thats in contrast with markets such as the u s uk and australia where office occupancies have slumped with people working from home although companies in india too have hybrid working models many still need more office space to fit new hires and for back offices which employ thousands embassy asias biggest office reit aims to seek board approval in coming weeks for the deal which it plans to carry out via a qualified institutional placement qip a tool used by listed indian companies to raise funds from mutual funds and other large institutions with the boom in indian office space the deal is expected to attract foreign asset managers and mutual funds said one of the sources with direct knowledge embassy and the banks did not respond to queries seeking comment with properties in four cities pune mumbai bengaluru and the national capital region embassy has \u003cTWO_HUNDRED\u003e occupants mainly from the technology and financial services sectors a large portion of those occupants are fortune \u003cFIVE_HUNDRED\u003e companies private equity giant blackstone which used to own a controlling stake in embassy sold that down in recent years fully exiting the company last year embassys units have risen \u003cONE_TEN_PERCENT\u003e the past year more than indias two other listed reits but less than the broader nifty realty index which has more than doubled in the same period while embassy focuses on offices indias broader real estate space including residential and warehousing is seeing growing interest from investors as demand and prices skyrocket for the december quarter embassys post tax profit rose \u003cSIX_PERCENT\u003e to \u003cTWO_\u003e billion rupees \u003cTWO_TEN\u003e million while its total income grew \u003cFIVE_PERCENT\u003e to \u003cNINE_\u003e billion rupees","timestamp":"2024-04-03T00:58:00+05:30","market_timestamp":"2024-04-03T09:15:00+05:30","off_market_hours":true}