{"url":"https://www.moneycontrol.com/news/business/nalco-posts-record-cast-metal-production-at-4-63-lakh-metric-tonne-in-fy24-12567561.html","title":"NALCO posts record cast metal production at 4.63 lakh metric tonne in FY24","description":"The company has also made its highest-ever metal sales of 4,70,108 metric tonne during the fiscal ended March 31, it said in a statement on Tuesday.NALCO posts record cast metal production at 4.63 lakh metric tonne in FY24","content":"State-owned NALCO has made a record production of cast metal at 4,63,428 metric tonne during the financial year 2023-24. The company has also made its highest-ever metal sales of 4,70,108 metric tonne during the fiscal ended March 31, it said in a statement on Tuesday. The excavation of bauxite reached a record high of 7,600,230 metric tonne during the financial year 2023-24, NALCO said. NALCO CMD Sridhar Patra said, \"Major milestones have been achieved by the company by way of backward integration and securitisation of raw materials and energy in the past four years on account of the dedication and hard work of the employees and cooperation received from various stakeholders.\" The company's alumina refinery has produced 21,24,000 metric tonne of alumina hydrate, while the captive power plant generated a gross 7,193.62 million units of power during the year. In FY 23-24, the entity also developed and operationalised Utkal D coal block and produced 2 million tonne of coal, which is the peak-rated capacity of the mine. Under the Ministry of mines, National Aluminium Company Ltd (NALCO) is the country's leading manufacturer and exporter of alumina and aluminium. ","cleaned_content":"state owned nalco has made a record production of cast metal at \u003cFOUR_HUNDRED_THOUSAND\u003e metric tonne during the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the company has also made its highest ever metal sales of \u003cFOUR_HUNDRED_THOUSAND\u003e metric tonne during the fiscal ended march \u003cTHREE_TEN\u003e it said in a statement on tuesday the excavation of bauxite reached a record high of \u003cSEVEN_MILLION\u003e metric tonne during the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e nalco said nalco cmd sridhar patra said major milestones have been achieved by the company by way of backward integration and securitisation of raw materials and energy in the past four years on account of the dedication and hard work of the employees and cooperation received from various stakeholders the companys alumina refinery has produced \u003cTWO_MILLION\u003e metric tonne of alumina hydrate while the captive power plant generated a gross \u003cSEVEN_THOUSAND\u003e million units of power during the year in fy \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e the entity also developed and operationalised utkal d coal block and produced \u003cTWO_\u003e million tonne of coal which is the peak rated capacity of the mine under the ministry of mines national aluminium company ltd nalco is the countrys leading manufacturer and exporter of alumina and aluminium","timestamp":"2024-04-03T17:10:00+05:30","market_timestamp":"2024-04-04T09:15:00+05:30","off_market_hours":true}