{"url":"https://www.moneycontrol.com/news/business/markets/hyundai-kia-join-hands-with-exide-energy-solutions-for-ev-battery-localisation-in-india-12596651.html","title":"Exide shares zoom 12% after Hyundai, Kia join hands with arm for EV battery localisation","description":"Hyundai Motor and Kia aim to localise their EV battery production, specifically focusing on lithium-iron-phosphate (LFP) cells in line with the expansion of their EV plans for the Indian market.Exide shares zoom 12% after Hyundai, Kia join hands with arm for EV battery localisationRelated stories","content":"South Korean auto majors Hyundai Motor Company (HMC) and Kia Corporation on April 8 announced a partnership with homegrown battery maker Exide Energy Solutions Ltd for electric vehicle battery localisation in India. Shares of Exide Industries reacted positively to the development and surged more than 12 percent to hit a 52-week high of Rs 363.  Volumes in the counter also surged as one crore shares changed hands on the exchanges so far, significantly higher than the one-month daily traded average of 22 lakh shares. \"HMC and group firm Kia Corporation have signed a Memorandum of Understanding (MOU) with Exide Energy Solutions Ltd, a leading Indian battery company, as part of their electric vehicle (EV) expansion plans,\" Hyundai Motor Group said in a statement. Hyundai Motor and Kia aim to localise their EV battery production, specifically focusing on lithium-iron-phosphate (LFP) cells in line with the expansion of their EV plans for the Indian market, the statement added. \"This strategic move will position them as the pioneers in applying domestically produced batteries in their upcoming EV models in the Indian market,\" the statement said. Also Read | Exide Industries invests Rs 100 crore in subsidiary \"India is a key market for vehicle electrification due in part to the government's carbon neutrality goals, which makes securing cost competitiveness through localised battery production crucial,\" said Heui Won Yang, President and Head of Hyundai Motor and Kia's R\u0026D Division. \"Through this global partnership with Exide Energy Solutions Ltd, we will gain a competitive advantage by equipping Hyundai Motor and Kia's future EV models in the Indian market with locally produced batteries,\" Yang added. Hyundai Motor Group said this strategic cooperation with Exide Energy is the beginning of HMC and Kia's efforts to expand their exclusive battery development, production, supply and partnerships in the Indian market. Hyundai Motor India has already announced that it plans to launch its high-volume EV model in 2025. The company currently sells IONIQ5 and Kona in the EV segment. On the other hand Kia India sells the EV6 model. On April 8 at 12.09 pm, Exide Industries was trading at Rs 360.95 apiece on the NSE. With PTI inputs ","cleaned_content":"south korean auto majors hyundai motor company hmc and kia corporation on april \u003cEIGHT_\u003e announced a partnership with homegrown battery maker exide energy solutions ltd for electric vehicle battery localisation in india shares of exide industries reacted positively to the development and surged more than \u003cONE_TEN_PERCENT\u003e to hit a \u003cFIVE_TEN\u003e week high of rs \u003cTHREE_HUNDRED\u003e volumes in the counter also surged as one crore shares changed hands on the exchanges so far significantly higher than the one month daily traded average of \u003cTWO_TEN\u003e lakh shares hmc and group firm kia corporation have signed a memorandum of understanding mou with exide energy solutions ltd a leading indian battery company as part of their electric vehicle ev expansion plans hyundai motor group said in a statement hyundai motor and kia aim to localise their ev battery production specifically focusing on lithium iron phosphate lfp cells in line with the expansion of their ev plans for the indian market the statement added this strategic move will position them as the pioneers in applying domestically produced batteries in their upcoming ev models in the indian market the statement said also read exide industries invests rs \u003cONE_HUNDRED\u003e crore in subsidiary india is a key market for vehicle electrification due in part to the governments carbon neutrality goals which makes securing cost competitiveness through localised battery production crucial said heui won yang president and head of hyundai motor and kias r d division through this global partnership with exide energy solutions ltd we will gain a competitive advantage by equipping hyundai motor and kias future ev models in the indian market with locally produced batteries yang added hyundai motor group said this strategic cooperation with exide energy is the beginning of hmc and kias efforts to expand their exclusive battery development production supply and partnerships in the indian market hyundai motor india has already announced that it plans to launch its high volume ev model in \u003cTWO_THOUSAND\u003e the company currently sells ioniq5 and kona in the ev segment on the other hand kia india sells the ev6 model on april \u003cEIGHT_\u003e at \u003cONE_TEN\u003e pm exide industries was trading at rs \u003cTHREE_HUNDRED\u003e apiece on the nse with pti inputs","timestamp":"2024-04-08T13:01:00+05:30","market_timestamp":"2024-04-08T13:01:00+05:30","off_market_hours":false}