{"url":"https://www.moneycontrol.com/news/business/bajaj-auto-reports-25-rise-in-total-wholesales-in-march-12560231.html","title":"Bajaj Auto reports 25% rise in total wholesales in March","description":"The Pune-based automaker had sold 2,91,567 two-wheelers and commercial vehicles in March 2023, according to a company statement.Bajaj Auto reports 25% rise in total wholesales in March","content":"Bajaj Auto Ltd on Tuesday reported 25 per cent year-on-year growth in its total vehicle wholesales, including exports at 3,65,904 units in March. The Pune-based automaker had sold 2,91,567 two-wheelers and commercial vehicles in March 2023, according to a company statement. Total domestic sales (including commercial vehicles) rose 18 per cent at 2,20,393 units in the last month compared to 1,86,522 units sold in the same month last year. For the fiscal ended March 31, 2024, the company reported wholesales of 4,350,933 units, an 11 per cent increase over 3,927,857 units in the 2022-23 fiscal. Domestic dispatches to dealers rose 29 per cent to 2,714,723 units in FY24 as compared with 2,106,617 units in the 2022-23 fiscal. Exports however declined 10 per cent last fiscal at 1,636,210 units from 1,821,240 units of two-wheelers and commercial vehicles in FY23. ","cleaned_content":"bajaj auto ltd on tuesday reported \u003cTWO_TEN_PERCENT\u003e year on year growth in its total vehicle wholesales including exports at \u003cTHREE_HUNDRED_THOUSAND\u003e units in march the pune based automaker had sold \u003cTWO_HUNDRED_THOUSAND\u003e two wheelers and commercial vehicles in march \u003cTWO_THOUSAND\u003e according to a company statement total domestic sales including commercial vehicles rose \u003cONE_TEN_PERCENT\u003e at \u003cTWO_HUNDRED_THOUSAND\u003e units in the last month compared to \u003cONE_HUNDRED_THOUSAND\u003e units sold in the same month last year for the fiscal ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company reported wholesales of \u003cFOUR_MILLION\u003e units an \u003cONE_TEN_PERCENT\u003e increase over \u003cTHREE_MILLION\u003e units in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal domestic dispatches to dealers rose \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_MILLION\u003e units in fy24 as compared with \u003cTWO_MILLION\u003e units in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal exports however declined \u003cONE_TEN_PERCENT\u003e last fiscal at \u003cONE_MILLION\u003e units from \u003cONE_MILLION\u003e units of two wheelers and commercial vehicles in fy23","timestamp":"2024-04-02T15:17:00+05:30","market_timestamp":"2024-04-02T15:17:00+05:30","off_market_hours":false}