{"url":"https://www.moneycontrol.com/news/business/mg-motor-india-launches-blackstorm-edition-of-mg-hector-at-rs-21-24-lakh-12613991.html","title":"MG Motor India launches Blackstorm edition of Hector SUV at Rs 21.24 lakh","description":"MG Hector's new edition comes with starry-black exterior, and interiors in black theme with gun metal accents.MG Motor India launches BLACKSTORM edition of MG Hector priced at Rs 21.24 lakh","content":"MG Motor India has on April 10 launched the Blackstorm edition of MG Hector SUV at a price tag of Rs 21.24 lakh (ex-showroom) with 5-, 6- and 7-seater configurations. The SUV has a starry-black exterior and interiors in black theme with gun metal accents and is being positioned as India’s first Internet SUV carrying connected features. The new variant of Hector also comes with 35.56 cm (14-inch) HD infotainment system, claiming to be India's largest, and over 75 connected car features. \"The Hector Blackstorm embodies our dedication to delivering unique and quality experiences by seamlessly blending power, luxury, and advanced technology,\" MG Motor India's Chief Commercial Officer Satinder Singh Bajwa said. There are black accents, including R18 Sporty All Black Alloys with Red Calipers, Piano Black Roof Rails, LED Headlamp with Piano Black bezel, and Smoked Connecting Tail lights. Additionally, customers have the option to have the Blackstorm Emblem fitted at the dealership. The new edition offers first-in-segment Digital Bluetooth Key, and Key Sharing capability. ","cleaned_content":"mg motor india has on april \u003cONE_TEN\u003e launched the blackstorm edition of mg hector suv at a price tag of rs \u003cTWO_TEN\u003e lakh ex showroom with \u003cFIVE_\u003e \u003cSIX_\u003e and \u003cSEVEN_\u003e seater configurations the suv has a starry black exterior and interiors in black theme with gun metal accents and is being positioned as india s first internet suv carrying connected features the new variant of hector also comes with \u003cTHREE_TEN\u003e cm \u003cONE_TEN\u003e inch hd infotainment system claiming to be indias largest and over \u003cSEVEN_TEN\u003e connected car features the hector blackstorm embodies our dedication to delivering unique and quality experiences by seamlessly blending power luxury and advanced technology mg motor indias chief commercial officer satinder singh bajwa said there are black accents including r18 sporty all black alloys with red calipers piano black roof rails led headlamp with piano black bezel and smoked connecting tail lights additionally customers have the option to have the blackstorm emblem fitted at the dealership the new edition offers first in segment digital bluetooth key and key sharing capability","timestamp":"2024-04-10T18:18:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}