{"url":"https://www.moneycontrol.com/news/business/signature-global-net-debt-up-6-in-fy24-to-rs-1160-crore-on-land-acquisitions-for-expansion-12613181.html","title":"Signature Global net debt up 6% in FY'24 to Rs 1,160 crore on land acquisitions for expansion","description":"According to the latest operational update, the company's net debt stood at Rs 1,160 crore at the end of 2023-24 fiscal, as compared to Rs 1,090 crore in FY23.Signature Global net debt up 6% in FY'24 to Rs 1,160 crore on land acquisitions for expansionRelated stories","content":"Realty firm Signature Global's net debt increased by 6 per cent last fiscal to Rs 1,160 crore due to land acquisitions for the development of housing projects. According to the latest operational update, the company's net debt stood at Rs 1,160 crore at the end of 2023-24 fiscal, as compared to Rs 1,090 crore in FY23. \"The increase in net debt is due to significant addition to our land portfolio during the current financial year,\" Gurugram-based Signature Global said. In March, the company sold 1,008 luxury homes for around Rs 3,600 crore in its new project at Gurugram, Haryana, helping the company achieve record sales bookings during the last fiscal and beating the target of Rs 4,500 crore for 2023-24. The company sold 4,619 units during the last fiscal, as against 4,512 units in 2022-23. In terms of area, Signature Global sold 6.18 million (61.8 lakh) square feet in 2023-24, up from 4.35 million (43.5 lakh) square feet in the preceding years. Sales realization for the 2023-24 averaged Rs 11,762 per square feet compared to Rs 7,886 per square feet in the previous fiscal. Pradeep Kumar Aggarwal, Chairman of Signature Global, said, \"On both fronts pre-sales and collections, we were able to beat the guidance very comfortably and we are sure FY'25 will also be the year of robust growth for the company as we focus on expanding our footprints in mid-income and premium segment.\" The company, which got listed in September 2023 on stock exchanges, has been acquiring land outright and also partnering with landlords to develop projects in coming years. In February, Signature Global entered into a Joint Development Agreement (JDA) with a landlord for the 20.32 acres of land in Gurugram, Haryana. The total development potential on this land is 28.4 lakh square feet of residential space with a potential revenue of Rs 4,500 crore. During February itself, the company signed three more joint development agreements (JDAs) with landlords to develop housing projects on a total of 21.38 acres of land parcel. The development potential is 32 lakh square feet of residential space and estimated revenue of more than Rs 5000 crore. Till December 2023, Signature Global has delivered 6.7 million square feet area. It is developing 16.9 million square feet area and has a forthcoming pipeline of 28.4 million square feet of saleable area. ","cleaned_content":"realty firm signature globals net debt increased by \u003cSIX_PERCENT\u003e last fiscal to rs \u003cONE_THOUSAND\u003e crore due to land acquisitions for the development of housing projects according to the latest operational update the companys net debt stood at rs \u003cONE_THOUSAND\u003e crore at the end of \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal as compared to rs \u003cONE_THOUSAND\u003e crore in fy23 the increase in net debt is due to significant addition to our land portfolio during the current financial year gurugram based signature global said in march the company sold \u003cONE_THOUSAND\u003e luxury homes for around rs \u003cTHREE_THOUSAND\u003e crore in its new project at gurugram haryana helping the company achieve record sales bookings during the last fiscal and beating the target of rs \u003cFOUR_THOUSAND\u003e crore for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the company sold \u003cFOUR_THOUSAND\u003e units during the last fiscal as against \u003cFOUR_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e in terms of area signature global sold \u003cSIX_\u003e million \u003cSIX_TEN\u003e lakh square feet in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e up from \u003cFOUR_\u003e million \u003cFOUR_TEN\u003e lakh square feet in the preceding years sales realization for the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e averaged rs \u003cONE_TEN_THOUSAND\u003e per square feet compared to rs \u003cSEVEN_THOUSAND\u003e per square feet in the previous fiscal pradeep kumar aggarwal chairman of signature global said on both fronts pre sales and collections we were able to beat the guidance very comfortably and we are sure fy25 will also be the year of robust growth for the company as we focus on expanding our footprints in mid income and premium segment the company which got listed in september \u003cTWO_THOUSAND\u003e on stock exchanges has been acquiring land outright and also partnering with landlords to develop projects in coming years in february signature global entered into a joint development agreement jda with a landlord for the \u003cTWO_TEN\u003e acres of land in gurugram haryana the total development potential on this land is \u003cTWO_TEN\u003e lakh square feet of residential space with a potential revenue of rs \u003cFOUR_THOUSAND\u003e crore during february itself the company signed three more joint development agreements jdas with landlords to develop housing projects on a total of \u003cTWO_TEN\u003e acres of land parcel the development potential is \u003cTHREE_TEN\u003e lakh square feet of residential space and estimated revenue of more than rs \u003cFIVE_THOUSAND\u003e crore till december \u003cTWO_THOUSAND\u003e signature global has delivered \u003cSIX_\u003e million square feet area it is developing \u003cONE_TEN\u003e million square feet area and has a forthcoming pipeline of \u003cTWO_TEN\u003e million square feet of saleable area","timestamp":"2024-04-10T22:50:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}