{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-pfizer-sees-heavy-volumes-bulls-follow-tortoise-into-zee-d-street-veterans-load-up-on-concor-hnis-buy-value-unlocking-story-in-bajaj-finserv-12558161.html","title":"MC Inside Edge: Pfizer sees heavy volumes, bulls follow Tortoise into Zee, D-Street veterans load up on Concor, HNIs buy value unlocking story in Bajaj Finserv","description":"Know what stocks veteran bulls are eyeing, what the bears are ganging up against, major deals and all the inner goings-on from Dalal StreetKnow what stocks veteran bulls in Dalal Street are eyeing.Related stories","content":"Booster shot Pfizer's shares were among the big gainers on Monday. The stock saw unusually high volumes last Wednesday and Thursday. One theory is that there was a fat finger trade on Wednesday, which then had to be squared up the following day. What makes this theory less plausible is that the stock price did not see any unusual volatility on both days despite the heavy volumes. There is chatter that another big block is likely to change hands shortly. Some brokers are said to have begun sounding HNIs for their interest in participating in the deal.  Some of the old hands on Dalal Street are said to be accumulating shares of Container Corporation (Concor). The stock had fallen out of favour with the Street last year when the Adani group got into trouble over the Hindenburg report. That is because the Adani group was widely tipped as the frontrunner for buying a strategic stake in the company through the government’s divestment process. Concor’s financials have not seen any major improvement over the last three quarters, but the Adani group’s fortunes have improved considerably during this period. Contra call? PPFAS Mutual Fund was prompt in clarifying that its purchase of 6.2 million shares in the company was part of a arbitrage deal. Meaning, the fund had sold Zee futures and bought an equivalent quantity of shares, thereby pocketing the spread (the difference between the futures and spot market price). Still, the impression in the market seems to be that PPFAS has taken a contrarian view on the stock. That could possibly explain the 6 percent jump in stock price. Some of the entities holding concentrated positions used the frenzy in the stock to square up their positions. At the end of the trading session on Monday, 10 entities together held around 40 percent of the market wide position limit (MWPL) in Zee. On Thursday, the corresponding figures were 14 entities holding close to 60 percent of the MWPL. Value unlocking story HNIs who already owned shares in Bajaj Finserv are learnt to have increased their exposure over the last few trading sessions. An immediate trigger for the sudden interest could be Bajaj Finserv’s 52 percent arm Bajaj Finance initiating talks to take its wholly-owned subsidiary Bajaj Housing Finance public.  Market chatter is that these HNIs have been given to understand by friendly circles that there could be further ‘value unlocking’ moves in the days ahead, given the stakes that it holds in multiple group companies. Holding companies look more valuable in a bull market, as the value of their listed arms appreciate and market assigns fancy estimates for the unlisted arms. But investors looking for easy gains would do well to remember that the ‘value unlocking’ stories take their own sweet time to fructify. ","cleaned_content":"booster shot pfizers shares were among the big gainers on monday the stock saw unusually high volumes last wednesday and thursday one theory is that there was a fat finger trade on wednesday which then had to be squared up the following day what makes this theory less plausible is that the stock price did not see any unusual volatility on both days despite the heavy volumes there is chatter that another big block is likely to change hands shortly some brokers are said to have begun sounding hnis for their interest in participating in the deal some of the old hands on dalal street are said to be accumulating shares of container corporation concor the stock had fallen out of favour with the street last year when the adani group got into trouble over the hindenburg report that is because the adani group was widely tipped as the frontrunner for buying a strategic stake in the company through the government s divestment process concor s financials have not seen any major improvement over the last three quarters but the adani group s fortunes have improved considerably during this period contra call ppfas mutual fund was prompt in clarifying that its purchase of \u003cSIX_\u003e million shares in the company was part of a arbitrage deal meaning the fund had sold zee futures and bought an equivalent quantity of shares thereby pocketing the spread the difference between the futures and spot market price still the impression in the market seems to be that ppfas has taken a contrarian view on the stock that could possibly explain the \u003cSIX_PERCENT\u003e jump in stock price some of the entities holding concentrated positions used the frenzy in the stock to square up their positions at the end of the trading session on monday \u003cONE_TEN\u003e entities together held around \u003cFOUR_TEN_PERCENT\u003e of the market wide position limit mwpl in zee on thursday the corresponding figures were \u003cONE_TEN\u003e entities holding close to \u003cSIX_TEN_PERCENT\u003e of the mwpl value unlocking story hnis who already owned shares in bajaj finserv are learnt to have increased their exposure over the last few trading sessions an immediate trigger for the sudden interest could be bajaj finserv s \u003cFIVE_TEN_PERCENT\u003e arm bajaj finance initiating talks to take its wholly owned subsidiary bajaj housing finance public market chatter is that these hnis have been given to understand by friendly circles that there could be further value unlocking moves in the days ahead given the stakes that it holds in multiple group companies holding companies look more valuable in a bull market as the value of their listed arms appreciate and market assigns fancy estimates for the unlisted arms but investors looking for easy gains would do well to remember that the value unlocking stories take their own sweet time to fructify","timestamp":"2024-04-02T08:30:00+05:30","market_timestamp":"2024-04-02T09:15:00+05:30","off_market_hours":true}