{"url":"https://www.moneycontrol.com/news/business/air-india-dealt-blow-as-aircraft-technicians-plan-strike-12610441.html","title":"Air India dealt blow as aircraft technicians plan strike","description":"The unrest among aviation workers risks thwarting India’s air travel boom. Pilots and aircraft engineers are crucial to support the country’s rapid fleet expansion after IndiGo, Air India and Akasa placed orders for more than 1,100 aircraft combined.Air India dealt blow as aircraft technicians plan strikeRelated stories","content":"Trouble for Air India Ltd. is mounting with aircraft technicians planning a strike later this month after its pilots voiced concerns last week about being overworked and underpaid. Technicians at AI Engineering Services Ltd. — a state-run maintenance, repair and overhaul firm and an erstwhile Air India unit — will strike on April 23 due to various issues affecting their “well-being” and “professional growth,” All India Aircraft Maintenance Engineering Union wrote in a letter dated April 8 to the chief executive officer. The unrest among aviation workers risks thwarting India’s air travel boom. Pilots and aircraft engineers are crucial to support the country’s rapid fleet expansion after IndiGo, Air India and Akasa placed orders for more than 1,100 aircraft combined. AI Engineering’s biggest client is Air India. Its staff are upset over lack of career advancement opportunities because they haven’t been promoted in the past seven years, according to the letter. The management promised a revised pay structure for technicians who have worked for at least two years with the firm but hasn’t followed through. The contractual employees, who form 75% of the company’s workforce, feel discriminated because they have to serve longer notice periods and aren’t given as many benefits as the permanent staff, the letter said. A representative for AI Engineering said the management has initiated discussions with the union to resolve the issue. AI Engineering has revised salaries of all staff except technicians as a court case is pending, it said. The company is planning to revise the pay of technicians after the union withdraws a court case, wherein it requested equal pay for contractual employees and permanent ones. Meanwhile, Air India pilots have echoed Vistara staff’s concerns, saying the issues of being underpaid and overworked are “systemic” across Tata’s aviation empire. Aircraft technicians have urged the management to resolve issues to avoid potential disruptions from the strike, the letter said. ","cleaned_content":"trouble for air india ltd is mounting with aircraft technicians planning a strike later this month after its pilots voiced concerns last week about being overworked and underpaid technicians at ai engineering services ltd a state run maintenance repair and overhaul firm and an erstwhile air india unit will strike on april \u003cTWO_TEN\u003e due to various issues affecting their well being and professional growth all india aircraft maintenance engineering union wrote in a letter dated april \u003cEIGHT_\u003e to the chief executive officer the unrest among aviation workers risks thwarting india s air travel boom pilots and aircraft engineers are crucial to support the country s rapid fleet expansion after indigo air india and akasa placed orders for more than \u003cONE_THOUSAND\u003e aircraft combined ai engineering s biggest client is air india its staff are upset over lack of career advancement opportunities because they haven t been promoted in the past seven years according to the letter the management promised a revised pay structure for technicians who have worked for at least two years with the firm but hasn t followed through the contractual employees who form \u003cSEVEN_TEN_PERCENT\u003e of the company s workforce feel discriminated because they have to serve longer notice periods and aren t given as many benefits as the permanent staff the letter said a representative for ai engineering said the management has initiated discussions with the union to resolve the issue ai engineering has revised salaries of all staff except technicians as a court case is pending it said the company is planning to revise the pay of technicians after the union withdraws a court case wherein it requested equal pay for contractual employees and permanent ones meanwhile air india pilots have echoed vistara staff s concerns saying the issues of being underpaid and overworked are systemic across tata s aviation empire aircraft technicians have urged the management to resolve issues to avoid potential disruptions from the strike the letter said","timestamp":"2024-04-10T18:18:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}