{"url":"https://www.moneycontrol.com/news/business/maruti-suzuki-applies-for-bharat-ncap-safety-ratings-for-some-vehicles-12613341.html","title":"Maruti Suzuki applies for Bharat-NCAP safety ratings for some vehicles","description":"Last year, Tata Motors' SUVs Safari and Harrier became the first recipients of the safety rating for adult and child occupant protection as per Bharat-NCAP. The SUVs were given 5-star rating.Maruti Suzuki","content":"Maruti Suzuki has applied for Bharat New Car Assessment Programme (Bharat-NCAP) safety ratings for some of its vehicles, a senior government official has said. Last year, Tata Motors' SUVs Safari and Harrier became the first recipients of the safety rating for adult and child occupant protection as per Bharat-NCAP. The SUVs were given 5-star rating. In August last year, the government launched Bharat-NCAP, India's very own and independent safety performance evaluation protocol for automobiles. The official also said the government is considering changing highway construction measurement method to 'lane km' from 'road km' in the current financial year as the government's focus has now shifted to building more expressways that are of at least four lanes. Currently, the linear length method is used for measuring the progress of construction and widening of national highways, he added. ","cleaned_content":"maruti suzuki has applied for bharat new car assessment programme bharat ncap safety ratings for some of its vehicles a senior government official has said last year tata motors suvs safari and harrier became the first recipients of the safety rating for adult and child occupant protection as per bharat ncap the suvs were given \u003cFIVE_\u003e star rating in august last year the government launched bharat ncap indias very own and independent safety performance evaluation protocol for automobiles the official also said the government is considering changing highway construction measurement method to lane km from road km in the current financial year as the governments focus has now shifted to building more expressways that are of at least four lanes currently the linear length method is used for measuring the progress of construction and widening of national highways he added","timestamp":"2024-04-10T13:44:00+05:30","market_timestamp":"2024-04-10T13:44:00+05:30","off_market_hours":false}