{"url":"https://www.moneycontrol.com/news/business/filter-capital-secures-rs-800-crore-for-its-maiden-fund-12597731.html","title":"Filter Capital secures Rs 800 crore for its maiden fund","description":"Indian institutional investors and family offices such as HDFC Fund of Funds, SIDBI, SRI Fund, Oister Global, DSP family office, Akash Prakash, the founder of Amansa Capital, and Harsh Jain, the CEO of Dream11 have committed to the fund, the VC firm said in a statement.Filter Capital secures Rs 800 crore for its maiden fundRelated stories","content":"Technology-focused venture capital firm Filter Capital on Monday said its has secured Rs 800 crore funding for its maiden fund -- Filter Capital India Fund I. Indian institutional investors and family offices such as HDFC Fund of Funds, SIDBI, SRI Fund, Oister Global, DSP family office, Akash Prakash, the founder of Amansa Capital, and Harsh Jain, the CEO of Dream11 have committed to the fund, the VC firm said in a statement. \"Filter Capital announced the successful final close of its first fund - Filter Capital India Fund I. The fund has secured a total corpus of Rs 800 crore,\" the statement said. \"This is the opportunity for Filter Capital. We are privileged to partner with a sophisticated and experienced group of investors who are aligned with our vision to build a leading technology-centric growth investment platform in India,\" Filter Capital, Co-founder and Managing Partner, Nitin Nayar said. The fund has so far invested over 30 per cent of its corpus across four investments in SaaS, consumer technology, and B2B services. The firm's current portfolio companies include Capillary Technologies, an enterprise loyalty SaaS provider, Chalo Mobility, a bus mobility platform, LoadShare Networks, an e-commerce logistics services firm, and THB, an Asia-focused healthcare enterprise SaaS company. \"We seek to partner with capable entrepreneurs whose businesses have reached an inflection point and are poised for rapid growth. We are attracted to business models with clear product-market fit, competitive differentiation, and robust unit economics. \"Through our capital, networks, and expertise, we can help our portfolio companies scale and build enduring businesses,\" Filter Capital, Co-founder and Managing Partner, Sumit Sinha said. ","cleaned_content":"technology focused venture capital firm filter capital on monday said its has secured rs \u003cEIGHT_HUNDRED\u003e crore funding for its maiden fund filter capital india fund i indian institutional investors and family offices such as hdfc fund of funds sidbi sri fund oister global dsp family office akash prakash the founder of amansa capital and harsh jain the ceo of dream11 have committed to the fund the vc firm said in a statement filter capital announced the successful final close of its first fund filter capital india fund i the fund has secured a total corpus of rs \u003cEIGHT_HUNDRED\u003e crore the statement said this is the opportunity for filter capital we are privileged to partner with a sophisticated and experienced group of investors who are aligned with our vision to build a leading technology centric growth investment platform in india filter capital co founder and managing partner nitin nayar said the fund has so far invested over \u003cTHREE_TEN_PERCENT\u003e of its corpus across four investments in saas consumer technology and b2b services the firms current portfolio companies include capillary technologies an enterprise loyalty saas provider chalo mobility a bus mobility platform loadshare networks an e commerce logistics services firm and thb an asia focused healthcare enterprise saas company we seek to partner with capable entrepreneurs whose businesses have reached an inflection point and are poised for rapid growth we are attracted to business models with clear product market fit competitive differentiation and robust unit economics through our capital networks and expertise we can help our portfolio companies scale and build enduring businesses filter capital co founder and managing partner sumit sinha said","timestamp":"2024-04-08T12:32:00+05:30","market_timestamp":"2024-04-08T12:32:00+05:30","off_market_hours":false}