{"url":"https://www.moneycontrol.com/news/business/gensol-engineering-revenue-rises-141-to-rs-960-crore-in-fy24-12565821.html","title":"Gensol Engineering revenue rises 141% to Rs 960 crore in FY24","description":"The corresponding (revenue) figure for the previous year was at Rs 398 crore, a company statement said.Gensol Engineering revenue rises 141% to Rs 960 crore in FY24","content":"Gensol Engineering on Wednesday said it has recorded the highest-ever revenue of Rs 960 crores in FY24 with a growth of 141 per cent Year on Year (YoY). The corresponding (revenue) figure for the previous year was at Rs 398 crore, a company statement said. According to the statement, Gensol Engineering Ltd recorded its highest-ever revenue from operations, surpassing Rs 960 crore (provisional and unaudited) in the financial year ending on March 31, 2024. Anmol Singh Jaggi, Chairman and Managing Director, Gensol Engineering Ltd, said in the statement, \"This financial performance of the company reflects a robust and commendable growth trajectory exceeding the guidance given in our last earnings conference call in January 2024.\" This achievement solidifies our status as a frontrunner in the renewable energy industry, emphasising our unwavering commitment to growth, he said. Established in 2012, Gensol Engineering Ltd is a part of the Gensol group of companies, which offers Engineering, Procurement, and Construction (EPC) services for the development of solar power plants. ","cleaned_content":"gensol engineering on wednesday said it has recorded the highest ever revenue of rs \u003cNINE_HUNDRED\u003e crores in fy24 with a growth of \u003cONE_HUNDRED_PERCENT\u003e year on year yoy the corresponding revenue figure for the previous year was at rs \u003cTHREE_HUNDRED\u003e crore a company statement said according to the statement gensol engineering ltd recorded its highest ever revenue from operations surpassing rs \u003cNINE_HUNDRED\u003e crore provisional and unaudited in the financial year ending on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e anmol singh jaggi chairman and managing director gensol engineering ltd said in the statement this financial performance of the company reflects a robust and commendable growth trajectory exceeding the guidance given in our last earnings conference call in january \u003cTWO_THOUSAND\u003e this achievement solidifies our status as a frontrunner in the renewable energy industry emphasising our unwavering commitment to growth he said established in \u003cTWO_THOUSAND\u003e gensol engineering ltd is a part of the gensol group of companies which offers engineering procurement and construction epc services for the development of solar power plants","timestamp":"2024-04-03T11:41:00+05:30","market_timestamp":"2024-04-03T11:41:00+05:30","off_market_hours":false}