{"url":"https://www.moneycontrol.com/news/business/pepsico-india-to-invest-rs-1266-crore-to-set-up-flavour-manufacturing-facility-in-madhya-pradesh-12560731.html","title":"PepsiCo India to invest Rs 1,266 crore to set up flavour manufacturing facility in Madhya Pradesh","description":"The plant spread over 22 acres, will play a significant role in scaling up PepsiCo's beverage production in India, generating employment and positively impacting the local economy, the company said in a statement.PepsiCo India to invest Rs 1,266 crore to set up flavour manufacturing facility in Madhya PradeshRelated stories","content":"PepsiCo India on Tuesday said it will invest Rs 1,266 crore to set up a flavour manufacturing facility at Ujjain in Madhya Pradesh as part of its expansion plans in the country. The plant spread over 22 acres, will play a significant role in scaling up PepsiCo's beverage production in India, generating employment and positively impacting the local economy, the company said in a statement. The construction of the upcoming plant is slated to start in 2024 and is expected to be operational in the first quarter of 2026, it added. PepsiCo India Senior Vice President, Beverages George Kovoor said the new unit will be the company's second flavour manufacturing facility in India. \"We aim to ramp up the production of our beverages to meet the rising demand in the country. This strategic investment not only strengthens our dedication to providing the highest quality beverages to our consumers but also reinforces our responsibility to drive sustainable practices across our operations,\" Kovoor added. PepsiCo's first flavour manufacturing facility in India is in Channo, Punjab. PepsiCo India said in line with its global sustainability goals, the new manufacturing facility will operate entirely on renewable energy sources leading to a reduction in carbon footprint by an impressive 1.9 metric tonne per day. With zero liquid discharge technology, the plant aims to achieve approximately 90 per cent overall water efficiency, ensuring responsible management of water resources, and replenishing 100 per cent of the water used at the facility, the company said. ","cleaned_content":"pepsico india on tuesday said it will invest rs \u003cONE_THOUSAND\u003e crore to set up a flavour manufacturing facility at ujjain in madhya pradesh as part of its expansion plans in the country the plant spread over \u003cTWO_TEN\u003e acres will play a significant role in scaling up pepsicos beverage production in india generating employment and positively impacting the local economy the company said in a statement the construction of the upcoming plant is slated to start in \u003cTWO_THOUSAND\u003e and is expected to be operational in the first quarter of \u003cTWO_THOUSAND\u003e it added pepsico india senior vice president beverages george kovoor said the new unit will be the companys second flavour manufacturing facility in india we aim to ramp up the production of our beverages to meet the rising demand in the country this strategic investment not only strengthens our dedication to providing the highest quality beverages to our consumers but also reinforces our responsibility to drive sustainable practices across our operations kovoor added pepsicos first flavour manufacturing facility in india is in channo punjab pepsico india said in line with its global sustainability goals the new manufacturing facility will operate entirely on renewable energy sources leading to a reduction in carbon footprint by an impressive \u003cONE_\u003e metric tonne per day with zero liquid discharge technology the plant aims to achieve approximately \u003cNINE_TEN_PERCENT\u003e overall water efficiency ensuring responsible management of water resources and replenishing \u003cONE_HUNDRED_PERCENT\u003e of the water used at the facility the company said","timestamp":"2024-04-03T01:32:00+05:30","market_timestamp":"2024-04-03T09:15:00+05:30","off_market_hours":true}