{"url":"https://www.moneycontrol.com/news/business/india-fastest-growing-market-25-revenue-growth-expected-in-2024-26-bridgestone-12613161.html","title":"India fastest growing market, 25% revenue growth expected in 2024-26: Bridgestone","description":"The company, which on Wednesday launched its 'Turanza 6i' premium range of passenger vehicle tyres developed specifically for the Indian market, will be increasing its tyre production to 40,000 per day in the next four to five years from the current 30,000 per day.India fastest growing market, 25% revenue growth expected in 2024-26: BridgestoneRelated stories","content":"Japanese tyre major Bridgestone expects to clock 25 per cent growth in revenue between 2024 and 2026 in India, which is its fastest-growing market globally, according to senior company officials. The company, which on Wednesday launched its 'Turanza 6i' premium range of passenger vehicle tyres developed specifically for the Indian market, will be increasing its tyre production to 40,000 per day in the next four to five years from the current 30,000 per day. \"The size of the business (in India) out of our total global portfolio today is limited. However, it is the fastest-growing business portfolio in our global business. So that's why huge attention is there and strategic attention is here in India,\" Bridgestone India Managing Director Hiroshi Yoshizane told PTI in an interview. When asked about the growth outlook in India, Bridgestone India Chief Commercial Officer Rajarshi Moitra said,\"Last year (2023) our revenue growth was 9 per cent and over a period between 2024 to 2026 we expect to grow our revenue by 25 per cent overall.\" Bridgestone India does not publicly share its revenue numbers. Moitra said this year the market has declined in the January-March quarter. \"But our estimation is that the market will grow back to the tune of 4.5-5 per cent in the second half of the year. Against this expected growth, if we (Bridgestone) have to gain market share we're looking at a 6-plus percentage growth as an aspiration for the balance of the year,\" he added. On the company's investments and capacity enhancement plans, Yoshizane said as part of the USD 300 million long term investments \"for manufacturing expansion and capability enhancement\" announced for India in 2017, Bridgstone had last year said it would invest Rs 600 crore on capacity expansion. \"At that time (2017) our domestic production capacity was around 15,000 per day. Now as of today, it has become 30,000 per day. So it's already doubled. Then it will go up 40,000 per day within the next four to five years,\" he said. Asked about the company's plans to tap the growing electric vehicle PV segment in India, Yoshizane said Bridgestone's new 'Turanza 6i' is an EV-ready premium product range, although not necessarily specific for electric passenger vehicles only. The product has been developed keeping in mind the Indian conditions. \"An EV when compared to the conventional one is heavier and has motor tractions and is more silent. So the tyre equipped with an EV should help in delivering a longer mileage, battery efficiency, durability to sustain the vehicle and silence. We are covering those key points with our product Turanza 6i,\" he said. On supplies to EV manufacturers in India, Moitra said,\"Currently we are working with the already present players such as Mahindra, Tata, Suzuki in terms of their projects. We have a set of EV developments lined up. As Tesla comes into India, we will reach out. We work with them in the US.\" However, Bridgestone will not supply for the import models of Tesla, he added. When asked about partnership with Vietnamese EV maker VinFast, Yoshizane said, \"Discussion is going on but no specific plans have been made as yet. Our OE sales team is working globally and monitoring OE movements on a global basis.\" Commenting on the company's retail network expansion, Moitra said,\"Today we service the market through 3,500 retail points on the consumer side, which is our car tyre business. This year, we expect to take it up to around 4,000 retail points.\" ","cleaned_content":"japanese tyre major bridgestone expects to clock \u003cTWO_TEN_PERCENT\u003e growth in revenue between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e in india which is its fastest growing market globally according to senior company officials the company which on wednesday launched its turanza \u003cSIX_\u003e i premium range of passenger vehicle tyres developed specifically for the indian market will be increasing its tyre production to \u003cFOUR_TEN_THOUSAND\u003e per day in the next four to five years from the current \u003cTHREE_TEN_THOUSAND\u003e per day the size of the business in india out of our total global portfolio today is limited however it is the fastest growing business portfolio in our global business so thats why huge attention is there and strategic attention is here in india bridgestone india managing director hiroshi yoshizane told pti in an interview when asked about the growth outlook in india bridgestone india chief commercial officer rajarshi moitra said last year \u003cTWO_THOUSAND\u003e our revenue growth was \u003cNINE_PERCENT\u003e and over a period between \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e we expect to grow our revenue by \u003cTWO_TEN_PERCENT\u003e overall bridgestone india does not publicly share its revenue numbers moitra said this year the market has declined in the january march quarter but our estimation is that the market will grow back to the tune of \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e in the second half of the year against this expected growth if we bridgestone have to gain market share were looking at a \u003cSIX_\u003e plus percentage growth as an aspiration for the balance of the year he added on the companys investments and capacity enhancement plans yoshizane said as part of the usd \u003cTHREE_HUNDRED\u003e million long term investments for manufacturing expansion and capability enhancement announced for india in \u003cTWO_THOUSAND\u003e bridgstone had last year said it would invest rs \u003cSIX_HUNDRED\u003e crore on capacity expansion at that time \u003cTWO_THOUSAND\u003e our domestic production capacity was around \u003cONE_TEN_THOUSAND\u003e per day now as of today it has become \u003cTHREE_TEN_THOUSAND\u003e per day so its already doubled then it will go up \u003cFOUR_TEN_THOUSAND\u003e per day within the next four to five years he said asked about the companys plans to tap the growing electric vehicle pv segment in india yoshizane said bridgestones new turanza \u003cSIX_\u003e i is an ev ready premium product range although not necessarily specific for electric passenger vehicles only the product has been developed keeping in mind the indian conditions an ev when compared to the conventional one is heavier and has motor tractions and is more silent so the tyre equipped with an ev should help in delivering a longer mileage battery efficiency durability to sustain the vehicle and silence we are covering those key points with our product turanza \u003cSIX_\u003e i he said on supplies to ev manufacturers in india moitra said currently we are working with the already present players such as mahindra tata suzuki in terms of their projects we have a set of ev developments lined up as tesla comes into india we will reach out we work with them in the us however bridgestone will not supply for the import models of tesla he added when asked about partnership with vietnamese ev maker vinfast yoshizane said discussion is going on but no specific plans have been made as yet our oe sales team is working globally and monitoring oe movements on a global basis commenting on the companys retail network expansion moitra said today we service the market through \u003cTHREE_THOUSAND\u003e retail points on the consumer side which is our car tyre business this year we expect to take it up to around \u003cFOUR_THOUSAND\u003e retail points","timestamp":"2024-04-10T22:49:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}