{"url":"https://www.moneycontrol.com/news/business/realme-aims-top-spot-in-rs-15-25k-segment-with-launch-of-p-series-this-year-12597721.html","title":"Realme India aims to increase overall smartphone market share; launches P series to drive online growth","description":"While sharing the plans on the P series, Realme India business strategy lead, Tarini Prasad Das told reporters that in 2024, the company aims to achieve the 50 million smartphones sales cumulatively under its partnership with Flipkart.Realme aims top spot in Rs 15-25k segment with launch of P series this yearRelated stories","content":"Chinese handset maker Realme aims to increase its overall market share in the country's smartphone market on the back of aggressive smartphone launches this year, a senior executive told Moneycontrol. The company is increasing its focus on the online retail channel with its Flipkart-exclusive P smartphone series launch, which will be priced in the Rs sub-Rs 20,000 price segment. With the latest series, the smartphone maker Realme India aims to garner the highest share in the Rs 15,000-25,000 price segment, the company’s business strategy lead, Tarini Prasad Das, told Moneycontrol. The executive said that offline and online sales currently contribute equally to Realme's overall business. \"We are doing better than last year. We aim to have more market share this year.\" The executive revealed that the P-series is solely available in the Indian market and will not be introduced in other markets. In 2023, Realme held a 12% market share and ranked among the top five smartphone brands in terms of volume market share. According to Counterpoint, it secured the leading position on Flipkart in the Rs 20,000-30,000 price range in February 2024, with a share of 29.2%. In February 2024, Realme was second in the Indian smartphone online market, with a market share of 13%, according to the Counterpoint report. Das said that the latest P smartphone series will focus on performance, design, a better display, and charging facilities in the target segment. The executive said that Realme's main focus will be on the growing smartphone business. \"Our focus will be more on smartphones even as we look to launch products in other categories like tablets and audio.\"  ","cleaned_content":"chinese handset maker realme aims to increase its overall market share in the countrys smartphone market on the back of aggressive smartphone launches this year a senior executive told moneycontrol the company is increasing its focus on the online retail channel with its flipkart exclusive p smartphone series launch which will be priced in the rs sub rs \u003cTWO_TEN_THOUSAND\u003e price segment with the latest series the smartphone maker realme india aims to garner the highest share in the rs \u003cONE_TEN_THOUSAND\u003e \u003cTWO_TEN_THOUSAND\u003e price segment the company s business strategy lead tarini prasad das told moneycontrol the executive said that offline and online sales currently contribute equally to realmes overall business we are doing better than last year we aim to have more market share this year the executive revealed that the p series is solely available in the indian market and will not be introduced in other markets in \u003cTWO_THOUSAND\u003e realme held a \u003cONE_TEN_PERCENT\u003e market share and ranked among the top five smartphone brands in terms of volume market share according to counterpoint it secured the leading position on flipkart in the rs \u003cTWO_TEN_THOUSAND\u003e \u003cTHREE_TEN_THOUSAND\u003e price range in february \u003cTWO_THOUSAND\u003e with a share of \u003cTWO_TEN_PERCENT\u003e in february \u003cTWO_THOUSAND\u003e realme was second in the indian smartphone online market with a market share of \u003cONE_TEN_PERCENT\u003e according to the counterpoint report das said that the latest p smartphone series will focus on performance design a better display and charging facilities in the target segment the executive said that realmes main focus will be on the growing smartphone business our focus will be more on smartphones even as we look to launch products in other categories like tablets and audio","timestamp":"2024-04-08T14:28:00+05:30","market_timestamp":"2024-04-08T14:28:00+05:30","off_market_hours":false}