{"url":"https://www.moneycontrol.com/news/business/haldia-petrochemicals-plans-10-billion-oil-to-chemical-project-in-south-india-12560521.html","title":"Haldia Petrochemicals plans $10 billion oil-to-chemical project in south India","description":"The private equity firm plans to build the oil-to-chemical project, capable of producing 3.5 million metric tons per year (tpy) of ethylene and propylene, at Cuddalore in Tamil Nadu by 2028 to 2029, Haldia CEO Navanit Narayan said on Monday, adding the project is expected to reach financial closure by the end of 2024.Haldia Petrochemicals plans $10 billion oil-to-chemical project in south IndiaRelated stories","content":"The Chatterjee Group (TCG) is in talks with local and global companies to partner with its majority-owned petrochemical firm Haldia Petrochemicals Ltd (HPL) to build a more than $10 billion project in southern India, HPL's chief executive said. The private equity firm plans to build the oil-to-chemical project, capable of producing 3.5 million metric tons per year (tpy) of ethylene and propylene, at Cuddalore in Tamil Nadu by 2028 to 2029, Haldia CEO Navanit Narayan said on Monday, adding the project is expected to reach financial closure by the end of 2024. \"What we are producing as chemicals, we can add more value to it. There is a huge market because most of the chemicals we are looking at are imported into India. So the margins are much better,\" he said. The company wants to boost profits by locally producing specialty chemicals. In 2021, Haldia took over a moribund oil refinery project in Cuddalore from Nagarjuna Oil that was shut down after damage from a cyclone in 2011. The planned project was set to process 120,000 barrels per day of oil. Indian firms are boosting their petrochemical production capacity as the country's expanding economy raises the need for goods ranging from plastics to paints and chemicals such as monoethylene glycol, used for making textile fibre and polyester resins. While India's western part is \"crowded\" with petrochemical projects, the south lacks a large petrochemical project to meet regional demand, Narayan said. \"So, I think that definitely is a place to be and it's also a very economically developed part of the country. We clearly see that as an advantage,\" Narayan said. India's petrochemical consumption is about one-third of the global average and the nation relies heavily on imports for meeting its specialty chemicals needs. \"Our assessment is that India needs a cracker of global scale every 18 months because we are growing at more than 7%-8% annually as an industry,\" he said. ","cleaned_content":"the chatterjee group tcg is in talks with local and global companies to partner with its majority owned petrochemical firm haldia petrochemicals ltd hpl to build a more than \u003cONE_TEN\u003e billion project in southern india hpls chief executive said the private equity firm plans to build the oil to chemical project capable of producing \u003cTHREE_\u003e million metric tons per year tpy of ethylene and propylene at cuddalore in tamil nadu by \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e haldia ceo navanit narayan said on monday adding the project is expected to reach financial closure by the end of \u003cTWO_THOUSAND\u003e what we are producing as chemicals we can add more value to it there is a huge market because most of the chemicals we are looking at are imported into india so the margins are much better he said the company wants to boost profits by locally producing specialty chemicals in \u003cTWO_THOUSAND\u003e haldia took over a moribund oil refinery project in cuddalore from nagarjuna oil that was shut down after damage from a cyclone in \u003cTWO_THOUSAND\u003e the planned project was set to process \u003cONE_HUNDRED_THOUSAND\u003e barrels per day of oil indian firms are boosting their petrochemical production capacity as the countrys expanding economy raises the need for goods ranging from plastics to paints and chemicals such as monoethylene glycol used for making textile fibre and polyester resins while indias western part is crowded with petrochemical projects the south lacks a large petrochemical project to meet regional demand narayan said so i think that definitely is a place to be and its also a very economically developed part of the country we clearly see that as an advantage narayan said indias petrochemical consumption is about one third of the global average and the nation relies heavily on imports for meeting its specialty chemicals needs our assessment is that india needs a cracker of global scale every \u003cONE_TEN\u003e months because we are growing at more than \u003cSEVEN_PERCENT\u003e \u003cEIGHT_PERCENT\u003e annually as an industry he said","timestamp":"2024-04-02T18:23:00+05:30","market_timestamp":"2024-04-03T09:15:00+05:30","off_market_hours":true}