{"url":"https://www.moneycontrol.com/news/business/telangana-govt-in-talks-with-tesla-to-set-up-electric-car-plant-12581911.html","title":"Telangana govt in talks with Tesla to set up electric car plant","description":"In a message on X Sridhar Babu said since December 2023 the state government has been actively focusing on major investment opportunities by global giants, and as part of its focus, Tesla's planned investment initiatives in India are also being tracked.Telangana govt in talks with Tesla to set up electric car plantRelated stories","content":"The Telangana government is holding discussions with Tesla by putting in all efforts to establish their plant in the state, Industries Minister D Sridhar Babu said on Thursday. In a message on X Sridhar Babu said since December 2023 the state government has been actively focusing on major investment opportunities by global giants, and as part of its focus, Tesla's planned investment initiatives in India are also being tracked. \"We have been studying and tracking Tesla's planned investment initiatives in India. We have been making all out efforts to bring Tesla to Telangana for some time... Our team is continuing the dialogue and discussions with Tesla by putting in all efforts for Tesla to establish their plant in Telangana,\" he said. The minister's comments came after BRS leader K T Rama Rao in a post tagged a news report suggesting that Tesla Motors will send a team to India to scout for locations for a proposed electric car plant with a proposed investment of USD 2-3 billion. \"Request Telangana Government to go all out and do your best to bring them to our state. Make sure Tesla team visits Hyderabad and understands the progressive industrial policies of Telangana Government,\" Rama Rao said in the post. ","cleaned_content":"the telangana government is holding discussions with tesla by putting in all efforts to establish their plant in the state industries minister d sridhar babu said on thursday in a message on x sridhar babu said since december \u003cTWO_THOUSAND\u003e the state government has been actively focusing on major investment opportunities by global giants and as part of its focus teslas planned investment initiatives in india are also being tracked we have been studying and tracking teslas planned investment initiatives in india we have been making all out efforts to bring tesla to telangana for some time our team is continuing the dialogue and discussions with tesla by putting in all efforts for tesla to establish their plant in telangana he said the ministers comments came after brs leader k t rama rao in a post tagged a news report suggesting that tesla motors will send a team to india to scout for locations for a proposed electric car plant with a proposed investment of usd \u003cTWO_\u003e \u003cTHREE_\u003e billion request telangana government to go all out and do your best to bring them to our state make sure tesla team visits hyderabad and understands the progressive industrial policies of telangana government rama rao said in the post","timestamp":"2024-04-05T13:27:00+05:30","market_timestamp":"2024-04-05T13:27:00+05:30","off_market_hours":false}