{"url":"https://www.moneycontrol.com/news/business/muthoot-fincorp-to-raise-up-to-rs-360-crore-through-ncds-12613451.html","title":"Muthoot FinCorp to raise up to Rs 360 crore through NCDs","description":"The issue opened on April 10 and will close on April 25.Muthoot FinCorp to raise up to Rs 360 crore through NCDs","content":"Muthoot FinCorp on Wednesday said it will raise up to Rs 360 crore through the public issue of debentures. The issue opened on April 10 and will close on April 25. \"Muthoot FinCorp Limited has announced XVI Tranche IV series of secured, redeemable, non-convertible debentures (NCDs) to raise an amount aggregating to Rs 360 crore which is within the shelf limit of Rs 1,100 crore. The tranche IV issuance amounts to Rs 100 crore with a green shoe option of Rs 260 crore aggregating up to Rs 360 crore (\"Tranche IV Issue\"),\" Muthoot FinCorp said in a statement. \"With the AA-/ Stable rating by CRISIL coupled with attractive interest rates and multiple tenure options we are focused on providing our investors with a suitable avenue to diversify their investment portfolio,\" said Shaji Varghese, CEO, Muthoot FinCorp Ltd. Muthoot FinCorp is the flagship company of the 137-year-old Muthoot Pappachan Group. ","cleaned_content":"muthoot fincorp on wednesday said it will raise up to rs \u003cTHREE_HUNDRED\u003e crore through the public issue of debentures the issue opened on april \u003cONE_TEN\u003e and will close on april \u003cTWO_TEN\u003e muthoot fincorp limited has announced xvi tranche iv series of secured redeemable non convertible debentures ncds to raise an amount aggregating to rs \u003cTHREE_HUNDRED\u003e crore which is within the shelf limit of rs \u003cONE_THOUSAND\u003e crore the tranche iv issuance amounts to rs \u003cONE_HUNDRED\u003e crore with a green shoe option of rs \u003cTWO_HUNDRED\u003e crore aggregating up to rs \u003cTHREE_HUNDRED\u003e crore tranche iv issue muthoot fincorp said in a statement with the aa stable rating by crisil coupled with attractive interest rates and multiple tenure options we are focused on providing our investors with a suitable avenue to diversify their investment portfolio said shaji varghese ceo muthoot fincorp ltd muthoot fincorp is the flagship company of the \u003cONE_HUNDRED\u003e year old muthoot pappachan group","timestamp":"2024-04-10T22:48:00+05:30","market_timestamp":"2024-04-11T09:15:00+05:30","off_market_hours":true}