{"url":"https://www.moneycontrol.com/news/business/zetwerk-earmarks-rs-1000-crore-investments-to-grow-its-electronics-business-12612451.html","title":"Zetwerk earmarks Rs 1,000 crore investments to grow its electronics business","description":"The company aims to be the leading ODM (original design manufacturer) and electronics manufacturing services provider in the mobile phones, hearable and wearable space.Zetwerk earmarks Rs 1,000 crore investments to grow its electronics businessRelated stories","content":"Manufacturing unicorn Zetwerk on Wednesday said it has earmarked Rs 1,000-crore investment for expanding its electronic manufacturing capacity across IT hardware, television, mobile phones, hearable and wearable product segment. The company aims to be the leading ODM (original design manufacturer) and electronics manufacturing services provider in the mobile phones, hearable and wearable space. \"The company is now producing one device a second from its factories. It has earmarked Rs 1,000 crore investments to grow its Electronics business,\" Zetwerk said in a statement. Valued at USD 2.8 billion, about Rs 23,300 crore, Zetwerk posted operating revenue of around Rs 11,450 crore in financial year 2023. The company is building high capacity for computer devices in its Bangalore facility that will focus on manufacturing motherboards, desktop PC power supplies, and other electronic components for major multinational corporations and original equipment manufacturers (OEMs). \"Zetwerk views India's electronics manufacturing sector as experiencing a transformative shift, akin to a Y2K moment, that will propel the nation towards a flourishing 'Viksit Bharat' (developed India). Through this significant capacity expansion, we aim to act as the 'teen powerhouse' of Viksit Bharat,\" Zetwerk Electronics President Josh Foulger said. Zetwerk has also entered the television and display devices business by commissioning one of North India's largest TV manufacturing facilities, with a production capacity of 24 lakh units annually to cater to both domestic and international brands. ","cleaned_content":"manufacturing unicorn zetwerk on wednesday said it has earmarked rs \u003cONE_THOUSAND\u003e crore investment for expanding its electronic manufacturing capacity across it hardware television mobile phones hearable and wearable product segment the company aims to be the leading odm original design manufacturer and electronics manufacturing services provider in the mobile phones hearable and wearable space the company is now producing one device a second from its factories it has earmarked rs \u003cONE_THOUSAND\u003e crore investments to grow its electronics business zetwerk said in a statement valued at usd \u003cTWO_\u003e billion about rs \u003cTWO_TEN_THOUSAND\u003e crore zetwerk posted operating revenue of around rs \u003cONE_TEN_THOUSAND\u003e crore in financial year \u003cTWO_THOUSAND\u003e the company is building high capacity for computer devices in its bangalore facility that will focus on manufacturing motherboards desktop pc power supplies and other electronic components for major multinational corporations and original equipment manufacturers oems zetwerk views indias electronics manufacturing sector as experiencing a transformative shift akin to a y2k moment that will propel the nation towards a flourishing viksit bharat developed india through this significant capacity expansion we aim to act as the teen powerhouse of viksit bharat zetwerk electronics president josh foulger said zetwerk has also entered the television and display devices business by commissioning one of north indias largest tv manufacturing facilities with a production capacity of \u003cTWO_TEN\u003e lakh units annually to cater to both domestic and international brands","timestamp":"2024-04-10T12:02:00+05:30","market_timestamp":"2024-04-10T12:02:00+05:30","off_market_hours":false}