{"url":"https://www.moneycontrol.com/news/business/aditya-birla-capital-aims-to-nearly-double-customers-with-new-digital-platform-in-3-years-12650021.html","title":"Aditya Birla Capital aims to nearly double customers with new digital platform in 3 years","description":"Speaking at the launch of the Aditya Birla Capital Digital here, Aditya Birla Group chairman Kumar Mangalam Birla said the purpose of the platform is to acquire new customers in a seamless manner.Aditya Birla spent Rs 100 cr for app making, says CEO Vishakha Mulye","content":"Aditya Birla Capital is targeting to add 3 crore new customers in the next three years through a digital platform launched on Tuesday, a top official said. Speaking at the launch of the Aditya Birla Capital Digital here, Aditya Birla Group chairman Kumar Mangalam Birla said the purpose of the platform is to acquire new customers in a seamless manner. At present, Aditya Birla Capital serves over 3.5 crore customers across its businesses, including lending, insurance, and asset management. A person can choose from 22 products and services across all the offerings of Aditya Birla Capital. He said the ambition of Aditya Birla Capital is to break into the top three in each of the core businesses. Birla said he sees the insurance, credit, and investment businesses of ABC growing at a compounded annual growth rate of 19-21 per cent over the next 3-5 years. He said the broader financial services sector is expected to grow at two times the annual GDP growth. ","cleaned_content":"aditya birla capital is targeting to add \u003cTHREE_\u003e crore new customers in the next three years through a digital platform launched on tuesday a top official said speaking at the launch of the aditya birla capital digital here aditya birla group chairman kumar mangalam birla said the purpose of the platform is to acquire new customers in a seamless manner at present aditya birla capital serves over \u003cTHREE_\u003e crore customers across its businesses including lending insurance and asset management a person can choose from \u003cTWO_TEN\u003e products and services across all the offerings of aditya birla capital he said the ambition of aditya birla capital is to break into the top three in each of the core businesses birla said he sees the insurance credit and investment businesses of abc growing at a compounded annual growth rate of \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e over the next \u003cTHREE_\u003e \u003cFIVE_\u003e years he said the broader financial services sector is expected to grow at two times the annual gdp growth","timestamp":"2024-04-16T15:41:00+05:30","market_timestamp":"2024-04-17T09:15:00+05:30","off_market_hours":true}