{"url":"https://www.moneycontrol.com/news/business/bharti-airtel-to-merge-sri-lanka-operations-with-dialog-axiata-12665521.html","title":"Bharti Airtel divests Lanka operation in deal with Dialog Axiata","description":"Airtel Lanka's turnover in financial year 2023 was Rs 294 crore and it contributed 0.21 per cent to Bharti Airtel's overall business.Bharti Airtel to merge Sri Lanka operations with Dialog AxiataRelated stories","content":"In a joint statement on Thursday, telecom operator Bharti Airtel said that it will merge its Sri Lanka operations with Dialog Axiata in an equity swap deal. As of 12.30 pm, Bharti Airtel shares were trading at Rs 1,273, up 4.65 percent from the previous day's closing. Airtel Lanka's turnover in financial year 2023 was Rs 294 crore and it contributed 0.21 per cent to Bharti Airtel's overall business. Under the agreement, Sri Lanka-based telecom operator Dialog will acquire 100 per cent of the issued shares in Airtel Lanka, in consideration of which Dialog will issue to Bharti Airtel, ordinary voting shares which will amount to 10.355 per cent of the total issued shares of Dialog by way of a share swap, it said. Airtel Sri Lanka commenced commercial operations in Sri Lanka in 2009. \"The Telecommunications Regulatory Commission of Sri Lanka (TRCSL) has granted its approval for the proposed merger, underscoring its vision to advance the adoption of telecommunications services across Sri Lanka,\" the statement said. Dialog is a public limited liability company incorporated and domiciled in Sri Lanka and is listed on the Colombo Stock Exchange. Dialog was incorporated in Sri Lanka on August 17, 1993. \"The merger between Dialog and Airtel Lanka is aligned to Axiata's strategy of market consolidation and resilience. The merger will create value for shareholders of Dialog Axiata PLC and of Axiata Group through achievable synergies. We have the utmost respect for Airtel Lanka and its employees and look forward to working together as we integrate the two companies,\" Axiata Group Berhad, Group CEO and Managing Director, Vivek Sood said. Dailog Axiata has a subscriber base of over 17 million. Airtel Lanka has over 5 million customers. ","cleaned_content":"in a joint statement on thursday telecom operator bharti airtel said that it will merge its sri lanka operations with dialog axiata in an equity swap deal as of \u003cONE_TEN\u003e pm bharti airtel shares were trading at rs \u003cONE_THOUSAND\u003e up \u003cFOUR_PERCENT\u003e from the previous days closing airtel lankas turnover in financial year \u003cTWO_THOUSAND\u003e was rs \u003cTWO_HUNDRED\u003e crore and it contributed \u003cZERO_PERCENT\u003e to bharti airtels overall business under the agreement sri lanka based telecom operator dialog will acquire \u003cONE_HUNDRED_PERCENT\u003e of the issued shares in airtel lanka in consideration of which dialog will issue to bharti airtel ordinary voting shares which will amount to \u003cONE_TEN_PERCENT\u003e of the total issued shares of dialog by way of a share swap it said airtel sri lanka commenced commercial operations in sri lanka in \u003cTWO_THOUSAND\u003e the telecommunications regulatory commission of sri lanka trcsl has granted its approval for the proposed merger underscoring its vision to advance the adoption of telecommunications services across sri lanka the statement said dialog is a public limited liability company incorporated and domiciled in sri lanka and is listed on the colombo stock exchange dialog was incorporated in sri lanka on august \u003cONE_TEN\u003e \u003cONE_THOUSAND\u003e the merger between dialog and airtel lanka is aligned to axiatas strategy of market consolidation and resilience the merger will create value for shareholders of dialog axiata plc and of axiata group through achievable synergies we have the utmost respect for airtel lanka and its employees and look forward to working together as we integrate the two companies axiata group berhad group ceo and managing director vivek sood said dailog axiata has a subscriber base of over \u003cONE_TEN\u003e million airtel lanka has over \u003cFIVE_\u003e million customers","timestamp":"2024-04-18T13:10:00+05:30","market_timestamp":"2024-04-18T13:10:00+05:30","off_market_hours":false}