{"url":"https://www.moneycontrol.com/news/business/zydus-lifesciences-launches-generic-drug-for-overactive-bladder-in-us-market-12691541.html","title":"Zydus Lifesciences launches generic drug for overactive bladder in US market","description":"The company has launched Mirabegron extended-release tablets in strength of 25 mg in the US market after having received final approval from the US Food and Drug Administration (USFDA), Zydus Lifesciences said in a regulatory filing.Zydus Lifesciences launches generic drug for overactive bladder in US market","content":"Zydus Lifesciences on Monday said it has launched a generic medication to treat overactive bladder in the US market. The company has launched Mirabegron extended-release tablets in strength of 25 mg in the US market after having received final approval from the US Food and Drug Administration (USFDA), Zydus Lifesciences said in a regulatory filing. Zydus is among the first suppliers to launch the generic version of Mirabegron extended-release tablets (USP 25 mg) in the US market. Mirabegron is indicated for the treatment of Overactive Bladder (OAB) with symptoms of urge urinary incontinence, urgency and urinary frequency. The drug will be manufactured at the Zydus group's formulation manufacturing facility in Ahmedabad SEZ, India, the drug maker said. Zydus CEO Americas, Punit Patel said the launch of generic Mirabegron will improve access and availability of the generic product for patients in the US market. \"This is a significant launch for us which will strengthen our growth plans in the US market in the current fiscal,\" he added. As per the IQVIA MAT data, Mirabegron extended-release tablets (USP 25mg and 50mg) had annual sales of USD 2.42 billion in the US. Zydus shares were trading 2.9 per cent up at Rs 948.90 apiece on the BSE. ","cleaned_content":"zydus lifesciences on monday said it has launched a generic medication to treat overactive bladder in the us market the company has launched mirabegron extended release tablets in strength of \u003cTWO_TEN\u003e mg in the us market after having received final approval from the us food and drug administration usfda zydus lifesciences said in a regulatory filing zydus is among the first suppliers to launch the generic version of mirabegron extended release tablets usp \u003cTWO_TEN\u003e mg in the us market mirabegron is indicated for the treatment of overactive bladder oab with symptoms of urge urinary incontinence urgency and urinary frequency the drug will be manufactured at the zydus groups formulation manufacturing facility in ahmedabad sez india the drug maker said zydus ceo americas punit patel said the launch of generic mirabegron will improve access and availability of the generic product for patients in the us market this is a significant launch for us which will strengthen our growth plans in the us market in the current fiscal he added as per the iqvia mat data mirabegron extended release tablets usp \u003cTWO_TEN\u003e mg and \u003cFIVE_TEN\u003e mg had annual sales of usd \u003cTWO_\u003e billion in the us zydus shares were trading \u003cTWO_PERCENT\u003e up at rs \u003cNINE_HUNDRED\u003e apiece on the bse","timestamp":"2024-04-22T11:43:00+05:30","market_timestamp":"2024-04-22T11:43:00+05:30","off_market_hours":false}