{"url":"https://www.moneycontrol.com/news/business/wework-global-in-talks-to-sell-entire-27-stake-in-wework-india-12702231.html","title":"WeWork Global in talks to sell entire 27% stake in WeWork India","description":"Bengaluru-based real estate firm Embassy Group, which holds the remaining 73 per cent stake in WeWork India, might also dilute some shareholdings to raise funds, they added.WeWork Global in talks to sell entire 27% stake in WeWork IndiaRelated stories","content":"Co-working firm WeWork Global, which has filed for bankruptcy in the US, is in talks with potential investors to sell its entire 27 per cent stake in WeWork India to monetise its investments, sources said. Bengaluru-based real estate firm Embassy Group, which holds the remaining 73 per cent stake in WeWork India, might also dilute some shareholdings to raise funds, they added. WeWork India, which started operations in 2017, has over 8 million square feet of assets signed across 54 locations in New Delhi, Bengaluru, Mumbai, Gurugram, Noida, Pune, and Hyderabad. In June 2021, WeWork Global invested USD 100 million in WeWork India to pick a 27 per cent stake. The investments helped Indian business to tide over the financial difficulties during the COVID pandemic, which had severely affected the office market. When contacted, WeWork India CEO Karan Virwani declined to comment. Sources said, WeWork India will continue to use the 'WeWork' brand even if WeWork Global sells its entire stake and exits from the India business. WeWork India will pay some fees to use the brand name. In November last year, WeWork Global filed for bankruptcy in the US and also started a comprehensive reorganization and restructuring process to cut debt and strengthen its balance sheet. NYSE-listed WeWork Inc had said that its centres located outside the US and Canada will not be part of this proceedings. Softbank-backed WeWork Inc, which was founded in 2010 and once valued at USD 47 billion, had reported a net loss of USD 696 million in the first half of 2023. WeWork India has been maintaining that the development in the US business would not impact Indian operations in any manner. \"WeWork India operates independently of WeWork Global, and our operations will not be affected in any manner,\" Virwani had said. \"During this period, we will continue to hold the rights to use the brand name as part of the operating agreement, while serving our members, landlords, and partners as usual,\" he had asserted. ","cleaned_content":"co working firm wework global which has filed for bankruptcy in the us is in talks with potential investors to sell its entire \u003cTWO_TEN_PERCENT\u003e stake in wework india to monetise its investments sources said bengaluru based real estate firm embassy group which holds the remaining \u003cSEVEN_TEN_PERCENT\u003e stake in wework india might also dilute some shareholdings to raise funds they added wework india which started operations in \u003cTWO_THOUSAND\u003e has over \u003cEIGHT_\u003e million square feet of assets signed across \u003cFIVE_TEN\u003e locations in new delhi bengaluru mumbai gurugram noida pune and hyderabad in june \u003cTWO_THOUSAND\u003e wework global invested usd \u003cONE_HUNDRED\u003e million in wework india to pick a \u003cTWO_TEN_PERCENT\u003e stake the investments helped indian business to tide over the financial difficulties during the covid pandemic which had severely affected the office market when contacted wework india ceo karan virwani declined to comment sources said wework india will continue to use the wework brand even if wework global sells its entire stake and exits from the india business wework india will pay some fees to use the brand name in november last year wework global filed for bankruptcy in the us and also started a comprehensive reorganization and restructuring process to cut debt and strengthen its balance sheet nyse listed wework inc had said that its centres located outside the us and canada will not be part of this proceedings softbank backed wework inc which was founded in \u003cTWO_THOUSAND\u003e and once valued at usd \u003cFOUR_TEN\u003e billion had reported a net loss of usd \u003cSIX_HUNDRED\u003e million in the first half of \u003cTWO_THOUSAND\u003e wework india has been maintaining that the development in the us business would not impact indian operations in any manner wework india operates independently of wework global and our operations will not be affected in any manner virwani had said during this period we will continue to hold the rights to use the brand name as part of the operating agreement while serving our members landlords and partners as usual he had asserted","timestamp":"2024-04-23T19:47:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}