{"url":"https://www.moneycontrol.com/news/technology/zee-board-approves-lean-organisation-structure-elevates-key-team-members-12660301.html","title":"Zee Board approves lean organisation structure, elevates key team members","description":"All corporate\tfunctions will continue to report to the MD \u0026 CEO and the new structure is effective immediately, Zee said in a release. Zee Board approves lean organisation structure propsed by MD and CEO Punit Goenka.Related stories","content":"Board of Zee Entertainment on April 17 gave its approval for a lean organisation structure proposed by MD and CEO Punit Goenka. Goenka has maintained a sharp focus on four key business verticals including broadcast, digital, movies and music. He has taken direct charge of domestic broadcast business. \"Through this restructuring exercise, our aim has been to build an independent and enterprising team led by an experienced set of leaders to drive the Company forward. I look forward to working closely with the teams to chart robust growth and achieve our strategic priorities for the Company,” Punit Goenka said. Ashish Sehgal who will be responsible for integrated advertisement sales for the broadcast and digital business will also report to Amit Goenka and for the broadcast business revenue Sehgal will continue to report to the MD and CEO. \"Under the guidance of the Board, the organisation structure has been designed with speed and agility at the forefront, in order to nurture collaboration and leverage synergies amongst the core business segments, which include Broadcast, Digital, Movies and Music,\" the company said in a release. Amit Goenka will continue to lead the digital business for Zee, taking direct charge of original content including movies. He will assume additional charge of the International Broadcast Business, Enterprise Technology and Broadcast Operations \u0026 Engineering. He will continue to report into the MD and CEO. Umesh Bansal will lead the movies business for the company and Anurag Bedi will continue to lead the music business. Both will report to Punit Goenka. The new structure is effective immediately, the company said. “The Board has reviewed and approved the lean organization structure proposed by the MD and CEO, which aims at streamlining the organization and improving efficiencies across the business. The strong and capable set of leaders identified for each core business segment in the lateral structure, are highly reflective of the Company’s deep bench strength and ensure that the Company remains well-positioned for the future. We are confident that a lean team under the leadership of Punit, will enable the Company to achieve its set goals and priorities for the future, further generating higher value for the shareholders,\" R Gopalan, Chairman, ZEE, said. ","cleaned_content":"board of zee entertainment on april \u003cONE_TEN\u003e gave its approval for a lean organisation structure proposed by md and ceo punit goenka goenka has maintained a sharp focus on four key business verticals including broadcast digital movies and music he has taken direct charge of domestic broadcast business through this restructuring exercise our aim has been to build an independent and enterprising team led by an experienced set of leaders to drive the company forward i look forward to working closely with the teams to chart robust growth and achieve our strategic priorities for the company punit goenka said ashish sehgal who will be responsible for integrated advertisement sales for the broadcast and digital business will also report to amit goenka and for the broadcast business revenue sehgal will continue to report to the md and ceo under the guidance of the board the organisation structure has been designed with speed and agility at the forefront in order to nurture collaboration and leverage synergies amongst the core business segments which include broadcast digital movies and music the company said in a release amit goenka will continue to lead the digital business for zee taking direct charge of original content including movies he will assume additional charge of the international broadcast business enterprise technology and broadcast operations engineering he will continue to report into the md and ceo umesh bansal will lead the movies business for the company and anurag bedi will continue to lead the music business both will report to punit goenka the new structure is effective immediately the company said the board has reviewed and approved the lean organization structure proposed by the md and ceo which aims at streamlining the organization and improving efficiencies across the business the strong and capable set of leaders identified for each core business segment in the lateral structure are highly reflective of the company s deep bench strength and ensure that the company remains well positioned for the future we are confident that a lean team under the leadership of punit will enable the company to achieve its set goals and priorities for the future further generating higher value for the shareholders r gopalan chairman zee said","timestamp":"2024-04-17T18:45:00+05:30","market_timestamp":"2024-04-18T09:15:00+05:30","off_market_hours":true}