{"url":"https://www.moneycontrol.com/news/business/ntpc-green-energy-inks-pact-with-indus-towers-to-develop-renewable-energy-projects-12673511.html","title":"NTPC Green Energy inks pact with Indus Towers to develop renewable energy projects","description":"The MoU (Memorandum of Understanding) shall explore joint development of grid-connected renewable energy-based power projects including solar, wind, energy storage etc. and/or solutions thereof, a company statement said.NTPC Green Energy inks pact with Indus Towers to develop renewable energy projectsRelated stories","content":"State-owned power giant NTPC arm NTPC Green Energy Ltd (NGEL) on Friday said it has signed an initial pact with Indus Towers Ltd to address the need for pacing green energy objectives and the GoI's efforts towards carbon neutral economy. The MoU (Memorandum of Understanding) shall explore joint development of grid-connected renewable energy-based power projects including solar, wind, energy storage etc. and/or solutions thereof, a company statement said. Indus Towers Ltd (ITL) aims to expand its renewable energy portfolio in a phased manner to Giga Watt (GW) scale capacity, for its business operations spread across the country, as a part of its net zero commitments. NTPC is India's largest power utility with the core business of power generation having a total installed capacity of 76 GW. It has ambitious plans of 60 GW of RE (Renewable Energy) capacity by the year 2032 and currently, it has 3.5 GW of installed RE capacity and 28+ GW under pipeline. ITL, India's leading passive telecom infrastructure provider, deploys, owns, and manages over 211,775 telecom towers and communication structures. With a presence in all 22 telecom circles, Indus Towers caters to wireless telecommunication service providers in India. ","cleaned_content":"state owned power giant ntpc arm ntpc green energy ltd ngel on friday said it has signed an initial pact with indus towers ltd to address the need for pacing green energy objectives and the gois efforts towards carbon neutral economy the mou memorandum of understanding shall explore joint development of grid connected renewable energy based power projects including solar wind energy storage etc and or solutions thereof a company statement said indus towers ltd itl aims to expand its renewable energy portfolio in a phased manner to giga watt gw scale capacity for its business operations spread across the country as a part of its net zero commitments ntpc is indias largest power utility with the core business of power generation having a total installed capacity of \u003cSEVEN_TEN\u003e gw it has ambitious plans of \u003cSIX_TEN\u003e gw of re renewable energy capacity by the year \u003cTWO_THOUSAND\u003e and currently it has \u003cTHREE_\u003e gw of installed re capacity and \u003cTWO_TEN\u003e gw under pipeline itl indias leading passive telecom infrastructure provider deploys owns and manages over \u003cTWO_HUNDRED_THOUSAND\u003e telecom towers and communication structures with a presence in all \u003cTWO_TEN\u003e telecom circles indus towers caters to wireless telecommunication service providers in india","timestamp":"2024-04-19T10:55:00+05:30","market_timestamp":"2024-04-19T10:55:00+05:30","off_market_hours":false}