{"url":"https://www.moneycontrol.com/news/business/nissan-recalls-magnite-units-to-fix-front-door-handle-sensors-12665501.html","title":"Nissan recalls Magnite units to fix front door handle sensors","description":"This proactive and mandatory preventive action impacts the base XE and mid XL variants only, with no impact to the safety of customers, the automaker said in a statement on its website.Nissan recalls Magnite units to fix front door handle sensors","content":"Nissan Motor India on Thursday said it is voluntarily recalling Magnite units produced between November 2020 and December 2023 for a retrofit of front door handle sensors. The company did not share the number of affected units. This proactive and mandatory preventive action impacts the base XE and mid XL variants only, with no impact to the safety of customers, the automaker said in a statement on its website. The automaker said it will begin notifying the owners of the affected vehicles and assured them that they can continue using their vehicles without interruption. Customers can visit their nearest authorised Nissan service workshop, where a retrofit of the sensor will be performed free of charge, it added. Nissan Magnite is a five seater compact sports utility vehicle. ","cleaned_content":"nissan motor india on thursday said it is voluntarily recalling magnite units produced between november \u003cTWO_THOUSAND\u003e and december \u003cTWO_THOUSAND\u003e for a retrofit of front door handle sensors the company did not share the number of affected units this proactive and mandatory preventive action impacts the base xe and mid xl variants only with no impact to the safety of customers the automaker said in a statement on its website the automaker said it will begin notifying the owners of the affected vehicles and assured them that they can continue using their vehicles without interruption customers can visit their nearest authorised nissan service workshop where a retrofit of the sensor will be performed free of charge it added nissan magnite is a five seater compact sports utility vehicle","timestamp":"2024-04-18T12:02:00+05:30","market_timestamp":"2024-04-18T12:02:00+05:30","off_market_hours":false}