{"url":"https://www.moneycontrol.com/news/technology/auto/mg-motor-india-looks-to-expand-network-in-tier-iii-iv-to-drive-next-phase-of-growth-12658891.html","title":"MG Motor India looks to expand network in tier III, IV to drive next phase of growth","description":"With JSW Group coming in as an investor and becoming a joint venture partner with China's SAIC, last month the company announced plans to invest Rs 5,000 crore and had set a target of selling one million units of passenger electric vehicles in India by 2030 when the total market is expected to be 10 million units annually.MG Motor India looks to expand network in tier III, IV to drive next phase of growthRelated stories","content":"MG Motor India is driving towards tier III and IV cities of the country with plans to establish 100 new touchpoints by the end of the ongoing fiscal year as part of its strategy to fuel the next phase of growth, a senior company official said on Wednesday. With JSW Group coming in as an investor and becoming a joint venture partner with China's SAIC, last month the company announced plans to invest Rs 5,000 crore and had set a target of selling one million units of passenger electric vehicles in India by 2030 when the total market is expected to be 10 million units annually. The company is targeting 520 sales and service touchpoints overall in 270 cities by the end of 2024-25. As part of that, the company has set plans for enhancing production capacity and more model introduction going forward, he added. Bajwa further said to supplement these plans the company also has to improve its footprints in the Indian market to be closer to the consumers for the brand to gain their confidence and trust. \"So keeping that objective in mind, we are now looking at how we can improve our reach and depth in terms of our network as a first step,\" he said. Currently, Bajwa said, \"We have about 380 touchpoints, which cover about 170 odd cities. Now we are very clear that we have to go closer to 300 cities going forward as part of our expansion plan and these 380 touchpoints obviously, will go beyond 500 touchpoints in this financial year.\" Apart from existing dealers, the company will also onboard new partners for the network expansion, he said. In terms of geography, he said, \"While we are fairly well represented, in tier one, metro and super metro towns but beyond that in tier three or four towns, presence is missing. That's the area where we want to really focus on and move forward in those areas and get closer to the customers.\" The company is working towards introducing \"tailored\" showrooms, particularly for rural, Tier III and Tier III cities, he said, adding that these would sell vehicles of different technologies, including electric, hybrid and conventional engines, to cater to the requirements of different customers. As part of MG 2.0, the company is increasing its annual production capacity from the current over 1 lakh units to up to 3 lakh vehicles. It will be setting up a second manufacturing unit at Halol in Gujarat. The company plans to launch one new car every three to six months starting from September this year. ","cleaned_content":"mg motor india is driving towards tier iii and iv cities of the country with plans to establish \u003cONE_HUNDRED\u003e new touchpoints by the end of the ongoing fiscal year as part of its strategy to fuel the next phase of growth a senior company official said on wednesday with jsw group coming in as an investor and becoming a joint venture partner with chinas saic last month the company announced plans to invest rs \u003cFIVE_THOUSAND\u003e crore and had set a target of selling one million units of passenger electric vehicles in india by \u003cTWO_THOUSAND\u003e when the total market is expected to be \u003cONE_TEN\u003e million units annually the company is targeting \u003cFIVE_HUNDRED\u003e sales and service touchpoints overall in \u003cTWO_HUNDRED\u003e cities by the end of \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e as part of that the company has set plans for enhancing production capacity and more model introduction going forward he added bajwa further said to supplement these plans the company also has to improve its footprints in the indian market to be closer to the consumers for the brand to gain their confidence and trust so keeping that objective in mind we are now looking at how we can improve our reach and depth in terms of our network as a first step he said currently bajwa said we have about \u003cTHREE_HUNDRED\u003e touchpoints which cover about \u003cONE_HUNDRED\u003e odd cities now we are very clear that we have to go closer to \u003cTHREE_HUNDRED\u003e cities going forward as part of our expansion plan and these \u003cTHREE_HUNDRED\u003e touchpoints obviously will go beyond \u003cFIVE_HUNDRED\u003e touchpoints in this financial year apart from existing dealers the company will also onboard new partners for the network expansion he said in terms of geography he said while we are fairly well represented in tier one metro and super metro towns but beyond that in tier three or four towns presence is missing thats the area where we want to really focus on and move forward in those areas and get closer to the customers the company is working towards introducing tailored showrooms particularly for rural tier iii and tier iii cities he said adding that these would sell vehicles of different technologies including electric hybrid and conventional engines to cater to the requirements of different customers as part of mg \u003cTWO_\u003e the company is increasing its annual production capacity from the current over \u003cONE_\u003e lakh units to up to \u003cTHREE_\u003e lakh vehicles it will be setting up a second manufacturing unit at halol in gujarat the company plans to launch one new car every three to six months starting from september this year","timestamp":"2024-04-17T18:50:00+05:30","market_timestamp":"2024-04-18T09:15:00+05:30","off_market_hours":true}