{"url":"https://www.moneycontrol.com/news/business/economy/volumes-of-domestic-mining-construction-equipment-industry-may-drop-in-fy25-icra-12666611.html","title":"Volumes of domestic mining, construction equipment industry may drop in FY'25: Icra","description":"\"ICRA expects FY2025 to see a 12-15 per cent year-on-year decline (which translates into volumes of 1.14-1.18 lakh units),\" the rating agency said in a statement.Volumes of domestic mining, construction equipment industry may drop in FY'25: IcraRelated stories","content":"Rating agency ICRA on Thursday said the volumes of domestic mining and the construction equipment (MCE) industry may drop in the current financial year on account of a slowdown in the new project orders amidst Lok Sabha elections and monsoon-related impact on construction activities. \"ICRA expects FY2025 to see a 12-15 per cent year-on-year decline (which translates into volumes of 1.14-1.18 lakh units),\" the rating agency said in a statement. This drop is following two consecutive years of strong growth of 26 per cent in FY'23 and 24 per cent in FY'24. \"Additionally, the aggregate revenues for ICRA's sample set companies are expected to contract by 9-12 per cent and operating margins by 100-150 basis points in FY2025,\" the statement said. The re-election push by the government on project execution led to a strong demand momentum for the domestic mining and construction industry in the last two years. However, with a likely disruption in project award activity for two consecutive quarters -- in the fourth quarter of FY'24 and first quarter of FY'25, amidst the Lok Sabha elections and monsoon-related impact on construction activities in the second quarter, the first half of FY'25 is likely to see a moderation in sales, Ritu Goswami, Sector Head, Corporate Ratings, ICRA said. ","cleaned_content":"rating agency icra on thursday said the volumes of domestic mining and the construction equipment mce industry may drop in the current financial year on account of a slowdown in the new project orders amidst lok sabha elections and monsoon related impact on construction activities icra expects fy2025 to see a \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e year on year decline which translates into volumes of \u003cONE_\u003e \u003cONE_\u003e lakh units the rating agency said in a statement this drop is following two consecutive years of strong growth of \u003cTWO_TEN_PERCENT\u003e in fy23 and \u003cTWO_TEN_PERCENT\u003e in fy24 additionally the aggregate revenues for icras sample set companies are expected to contract by \u003cNINE_\u003e \u003cONE_TEN_PERCENT\u003e and operating margins by \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e basis points in fy2025 the statement said the re election push by the government on project execution led to a strong demand momentum for the domestic mining and construction industry in the last two years however with a likely disruption in project award activity for two consecutive quarters in the fourth quarter of fy24 and first quarter of fy25 amidst the lok sabha elections and monsoon related impact on construction activities in the second quarter the first half of fy25 is likely to see a moderation in sales ritu goswami sector head corporate ratings icra said","timestamp":"2024-04-18T13:36:00+05:30","market_timestamp":"2024-04-18T13:36:00+05:30","off_market_hours":false}