{"url":"https://www.moneycontrol.com/news/business/usfda-issues-form-483-with-five-inspectional-observations-to-marksans-pharmas-goa-unit-12665491.html","title":"USFDA issues Form 483 with five inspectional observations to Marksans Pharma's Goa unit","description":"The US Food and Drug Administration (USFDA) had conducted a routine current Good Manufacturing Practices (cGMP) inspection at the manufacturing facility from April 9-17, 2024, the company said in a regulatory filing.USFDA issues Form 483 with five inspectional observations to Marksans Pharma's Goa unit","content":"Marksans Pharma Ltd on Thursday said the US health regulator has issued a Form 483 with five inspectional observations after inspecting its manufacturing facility at Vema, in Goa. The US Food and Drug Administration (USFDA) had conducted a routine current Good Manufacturing Practices (cGMP) inspection at the manufacturing facility from April 9-17, 2024, the company said in a regulatory filing. \"On conclusion of the inspection, the company has received five inspectional observations in Form 483,\" Marksans Pharma said. There is no data integrity observation, it added. The company will work closely with the USFDA and is committed to address these observations comprehensively within the stipulated time, the filing said. ","cleaned_content":"marksans pharma ltd on thursday said the us health regulator has issued a form \u003cFOUR_HUNDRED\u003e with five inspectional observations after inspecting its manufacturing facility at vema in goa the us food and drug administration usfda had conducted a routine current good manufacturing practices cgmp inspection at the manufacturing facility from april \u003cNINE_\u003e \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company said in a regulatory filing on conclusion of the inspection the company has received five inspectional observations in form \u003cFOUR_HUNDRED\u003e marksans pharma said there is no data integrity observation it added the company will work closely with the usfda and is committed to address these observations comprehensively within the stipulated time the filing said","timestamp":"2024-04-18T12:02:00+05:30","market_timestamp":"2024-04-18T12:02:00+05:30","off_market_hours":false}