{"url":"https://www.moneycontrol.com/news/business/mg-motor-ties-up-with-epsilon-group-for-ev-charging-solutions-battery-recycling-12666031.html","title":"MG Motor partners with Epsilon Group for EV charging solutions, battery recycling","description":"As part of the collaboration, the automaker has signed an MoU with two Epsilon Group subsidiaries - Power EV for charging solutions, and LICO for battery recycling and second-life expertise.The automaker plans to have 1,000 charging points in 1,000 days inside residential communities and apartments across the country, under its MG charge initiative.","content":"MG Motor India and Epsilon Group have signed a partnership agreement for EV charging solutions and battery recycling, according to a statement. The carmaker has inked a memorandum of understanding (MoU) with Power EV for charging solutions and LICO for battery recycling and second life expertise, according to the statement. Power EV and LICO are both subsidiaries of Epsilon Group. Under the deal, Power EV will provide custom charging technology to develop AC and DC charging solutions for the carmaker's electric vehicles. In addition, LICO will provide comprehensive battery recycling and certification services to MG Motor, the statement added. Commenting on the deal, MG Motor India's chief growth officer Gaurav Gupta said, \"Our collaboration with the Epsilon Group signifies a strategic alliance aimed at realising this vision through an efficient charging infrastructure which aids and complements a circular economy by way of second-life and end-of-life solutions for batteries.\" With inputs from PTI ","cleaned_content":"mg motor india and epsilon group have signed a partnership agreement for ev charging solutions and battery recycling according to a statement the carmaker has inked a memorandum of understanding mou with power ev for charging solutions and lico for battery recycling and second life expertise according to the statement power ev and lico are both subsidiaries of epsilon group under the deal power ev will provide custom charging technology to develop ac and dc charging solutions for the carmakers electric vehicles in addition lico will provide comprehensive battery recycling and certification services to mg motor the statement added commenting on the deal mg motor indias chief growth officer gaurav gupta said our collaboration with the epsilon group signifies a strategic alliance aimed at realising this vision through an efficient charging infrastructure which aids and complements a circular economy by way of second life and end of life solutions for batteries with inputs from pti","timestamp":"2024-04-18T13:36:00+05:30","market_timestamp":"2024-04-18T13:36:00+05:30","off_market_hours":false}