{"url":"https://www.moneycontrol.com/news/business/max-healthcare-institute-to-invest-rs-5000-crore-on-doubling-bed-capacity-in-4-5-years-12649981.html","title":"Max Healthcare Institute to invest Rs 5,000 crore on doubling bed capacity in 4-5 years","description":"The company, which had last year acquired Sahara Hospital in Lucknow for an enterprise value of Rs 940 crore has renamed it as Max Super Specialty Hospital, Lucknow.Max Healthcare Institute to invest Rs 5,000 crore on doubling bed capacity in 4-5 yearsRelated stories","content":"Max Healthcare Institute Ltd will invest over Rs 5,000 crore to more than double its bed capacity to over 8,000 beds in the next four to five years with half of the investment to be made in Uttar Pradesh, according to its Chairman and MD Abhay Soi. The company, which had last year acquired Sahara Hospital in Lucknow for an enterprise value of Rs 940 crore has renamed it as Max Super Specialty Hospital, Lucknow. It plans to invest Rs 2,500 crore in Uttar Pradesh (UP) which includes setting up of a new 500 beds hospital on 5.6-acre parcel of land located at Shaheed Path and augmentation of capacity of the acquired facility. \"UP is a state which is marching towards becoming a USD 1 trillion economy by 2027. There is a tremendous amount of development which is happening. \"For the development of any economy it is a prerequisite that healthcare also develops over there... We wanted to participate in the development of the state,\" Soi told PTI. He further said, \"Given the development which is happening (in the state) and the increase in per capita income, it calls for much larger investment in healthcare.\" On the immediate expansion in UP, he said at Max Super Specialty Hospital, Lucknow, which is a 550-bed hospital, the company is \"looking at expanding by another 300-odd beds going forward\". \"Other than this we have acquired land for a greenfield hospital at Shaheed Path for another 500 beds. Between these, we will have over 2,000 beds in the next few years... This would be at an investment of Rs 2,500 crore and we will be employing more than 10,000 people.\" With this, Max Healthcare will be the largest private healthcare network in UP, he asserted. When asked if Max Healthcare Institute will be focussing only on UP for its expansion in the near future, he replied in the negative. \"We would look at other states too for expansion... We will be in multiple places as well,\" Soi said, citing examples of how the company has expanded in Nagpur and Pune, and is also looking at other parts of the country. On investments on overall expansion across India, he said it will be over Rs 5,000 crore in the next four to five years to more than double the bed capacity to over 8,000 beds. At present, the company has 4,000 operational beds and is looking to add another 4,200 beds in the next four to five years. When asked if the company would go for acquisitions only or set up new facilities for the planned expansions, Soi said, \"It will be both. Where we can do acquisitions we would like to do acquisitions... we have seen in Lucknow itself, we have done one acquisition and the other is a greenfield. If we get another, we'd be happy to do it.\" On the funding of the expansion in UP, he said it will be through internal accruals. \"We are a debt-free company and we generate enough internal accruals to fund it,\" Soi said. Max Healthcare said it will introduce state-of-the-art cancer care and robotic surgical systems besides strengthening the organ transplantation program at Max Super Speciality Hospital, Lucknow. It will bring in high-end tertiary and quaternary care to patients in Lucknow and neighbouring areas and the hospital will serve as an important referral centre for patients from Eastern and Central Uttar Pradesh and Bihar. \"With direct flight connectivity to several countries, the company will also explore attracting medical value travel patients from neighbouring countries and the Middle East to Max Super Speciality Hospital, Lucknow,\" the company added. ","cleaned_content":"max healthcare institute ltd will invest over rs \u003cFIVE_THOUSAND\u003e crore to more than double its bed capacity to over \u003cEIGHT_THOUSAND\u003e beds in the next four to five years with half of the investment to be made in uttar pradesh according to its chairman and md abhay soi the company which had last year acquired sahara hospital in lucknow for an enterprise value of rs \u003cNINE_HUNDRED\u003e crore has renamed it as max super specialty hospital lucknow it plans to invest rs \u003cTWO_THOUSAND\u003e crore in uttar pradesh up which includes setting up of a new \u003cFIVE_HUNDRED\u003e beds hospital on \u003cFIVE_\u003e acre parcel of land located at shaheed path and augmentation of capacity of the acquired facility up is a state which is marching towards becoming a usd \u003cONE_\u003e trillion economy by \u003cTWO_THOUSAND\u003e there is a tremendous amount of development which is happening for the development of any economy it is a prerequisite that healthcare also develops over there we wanted to participate in the development of the state soi told pti he further said given the development which is happening in the state and the increase in per capita income it calls for much larger investment in healthcare on the immediate expansion in up he said at max super specialty hospital lucknow which is a \u003cFIVE_HUNDRED\u003e bed hospital the company is looking at expanding by another \u003cTHREE_HUNDRED\u003e odd beds going forward other than this we have acquired land for a greenfield hospital at shaheed path for another \u003cFIVE_HUNDRED\u003e beds between these we will have over \u003cTWO_THOUSAND\u003e beds in the next few years this would be at an investment of rs \u003cTWO_THOUSAND\u003e crore and we will be employing more than \u003cONE_TEN_THOUSAND\u003e people with this max healthcare will be the largest private healthcare network in up he asserted when asked if max healthcare institute will be focussing only on up for its expansion in the near future he replied in the negative we would look at other states too for expansion we will be in multiple places as well soi said citing examples of how the company has expanded in nagpur and pune and is also looking at other parts of the country on investments on overall expansion across india he said it will be over rs \u003cFIVE_THOUSAND\u003e crore in the next four to five years to more than double the bed capacity to over \u003cEIGHT_THOUSAND\u003e beds at present the company has \u003cFOUR_THOUSAND\u003e operational beds and is looking to add another \u003cFOUR_THOUSAND\u003e beds in the next four to five years when asked if the company would go for acquisitions only or set up new facilities for the planned expansions soi said it will be both where we can do acquisitions we would like to do acquisitions we have seen in lucknow itself we have done one acquisition and the other is a greenfield if we get another wed be happy to do it on the funding of the expansion in up he said it will be through internal accruals we are a debt free company and we generate enough internal accruals to fund it soi said max healthcare said it will introduce state of the art cancer care and robotic surgical systems besides strengthening the organ transplantation program at max super speciality hospital lucknow it will bring in high end tertiary and quaternary care to patients in lucknow and neighbouring areas and the hospital will serve as an important referral centre for patients from eastern and central uttar pradesh and bihar with direct flight connectivity to several countries the company will also explore attracting medical value travel patients from neighbouring countries and the middle east to max super speciality hospital lucknow the company added","timestamp":"2024-04-16T15:40:00+05:30","market_timestamp":"2024-04-17T09:15:00+05:30","off_market_hours":true}