{"url":"https://www.moneycontrol.com/news/business/kotak-sees-india-index-inclusion-improving-liquidity-for-banks-12647691.html","title":"Kotak sees India index inclusion improving liquidity for banks","description":"The anticipated entry of overseas funds into India’s $1.2 trillion government debt market presents an opportunity for lenders including Kotak to sell part of their bond investments to these new buyers, according to Joint Managing Director K.V.S Manian. Kotak sees India index inclusion improving Llquidity for banksRelated stories","content":"Kotak Mahindra Bank Ltd. expects the addition of the country’s sovereign bonds to JPMorgan Chase \u0026 Co.’s global indexes from June to boost banks’ liquidity and reduce the need to aggressively pursue deposits in the short term. The anticipated entry of overseas funds into India’s $1.2 trillion government debt market presents an opportunity for lenders including Kotak to sell part of their bond investments to these new buyers, according to Joint Managing Director K.V.S Manian. The move is expected to unlock funds for lending purposes and ease the pressure on banks that have been relying on costly deposits to disburse loans, Manian said in an interview. Kotak holds securities well in excess of the minimum statutory liquidity ratio mandated by the Reserve Bank of India, he said. Banks in India are the largest holders of government bonds. Kotak’s daily average liquidity coverage ratio for the December quarter was 126.85%, higher than the regulatory threshold of 100%, according to its latest financial disclosures.  Indian lenders continue to face challenges in attracting lower-cost deposits, as customers are putting their savings in India’s booming stock market and higher-yielding term deposits instead. With the loan-to-deposit ratio sitting at its peak, there are concerns about the impact on credit growth in the country where deposits typically fund around 70% to 80% of bank assets, Rahul Jain, co-head of Asia Pacific Financials Research at Goldman Sachs Group Inc. said earlier this month. Read more: Goldman Sees Indian Banks’ Profitability Coming Under Pressure As more global capital flows into India, RBI’s intervention to absorb those dollars will inject rupees into the system, further boosting liquidity, Manian said. The liquidity will eventually translate into bank deposits, he said. Foreigners have poured about $9 billion into the nation’s index-eligible bonds since JPMorgan’s inclusion announcement in September. Still, they own just 2% of India’s sovereign debt market, leaving ample scope for new buyers.  ","cleaned_content":"kotak mahindra bank ltd expects the addition of the country s sovereign bonds to jpmorgan chase co s global indexes from june to boost banks liquidity and reduce the need to aggressively pursue deposits in the short term the anticipated entry of overseas funds into india s \u003cONE_\u003e trillion government debt market presents an opportunity for lenders including kotak to sell part of their bond investments to these new buyers according to joint managing director k v s manian the move is expected to unlock funds for lending purposes and ease the pressure on banks that have been relying on costly deposits to disburse loans manian said in an interview kotak holds securities well in excess of the minimum statutory liquidity ratio mandated by the reserve bank of india he said banks in india are the largest holders of government bonds kotak s daily average liquidity coverage ratio for the december quarter was \u003cONE_HUNDRED_PERCENT\u003e higher than the regulatory threshold of \u003cONE_HUNDRED_PERCENT\u003e according to its latest financial disclosures indian lenders continue to face challenges in attracting lower cost deposits as customers are putting their savings in india s booming stock market and higher yielding term deposits instead with the loan to deposit ratio sitting at its peak there are concerns about the impact on credit growth in the country where deposits typically fund around \u003cSEVEN_TEN_PERCENT\u003e to \u003cEIGHT_TEN_PERCENT\u003e of bank assets rahul jain co head of asia pacific financials research at goldman sachs group inc said earlier this month read more goldman sees indian banks profitability coming under pressure as more global capital flows into india rbi s intervention to absorb those dollars will inject rupees into the system further boosting liquidity manian said the liquidity will eventually translate into bank deposits he said foreigners have poured about \u003cNINE_\u003e billion into the nation s index eligible bonds since jpmorgan s inclusion announcement in september still they own just \u003cTWO_PERCENT\u003e of india s sovereign debt market leaving ample scope for new buyers","timestamp":"2024-04-16T10:26:00+05:30","market_timestamp":"2024-04-16T10:26:00+05:30","off_market_hours":false}