{"url":"https://www.moneycontrol.com/news/business/stellantis-india-to-hike-vehicle-prices-by-up-to-rs-17000-from-april-30-12702931.html","title":"Stellantis India to hike vehicle prices by up to Rs 17,000 from April 30","description":"This price increase will result in an increment ranging from Rs 4,000 to Rs 17,000 across the models, the company said in a statement.Stellantis India to hike vehicle prices by up to Rs 17,000 from April 30","content":"Automaker Stellantis India on Tuesday said it will hike prices across all models of the Citroen brand and for the Compass and Meridian models under the Jeep brand by 0.5 per cent from April 30, 2024, citing escalating input costs and operational expenses. This price increase will result in an increment ranging from Rs 4,000 to Rs 17,000 across the models, the company said in a statement. \"The decision to increase prices comes in response to escalating input costs and operational expenses. The modest price adjustment reflects the current economic realities and enables the company to continue delivering innovative vehicles to its valued customers,\" it added. On the other hand, Jeep Compass is priced between Rs 20.69 lakh and Rs 26.19 lakh, while Jeep Meridian is tagged between Rs 33.6 lakh and Rs 36.97 (all-prices ex-showroom). ","cleaned_content":"automaker stellantis india on tuesday said it will hike prices across all models of the citroen brand and for the compass and meridian models under the jeep brand by \u003cZERO_PERCENT\u003e from april \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e citing escalating input costs and operational expenses this price increase will result in an increment ranging from rs \u003cFOUR_THOUSAND\u003e to rs \u003cONE_TEN_THOUSAND\u003e across the models the company said in a statement the decision to increase prices comes in response to escalating input costs and operational expenses the modest price adjustment reflects the current economic realities and enables the company to continue delivering innovative vehicles to its valued customers it added on the other hand jeep compass is priced between rs \u003cTWO_TEN\u003e lakh and rs \u003cTWO_TEN\u003e lakh while jeep meridian is tagged between rs \u003cTHREE_TEN\u003e lakh and rs \u003cTHREE_TEN\u003e all prices ex showroom","timestamp":"2024-04-23T17:08:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}