{"url":"https://www.moneycontrol.com/news/business/bajaj-auto-aims-to-make-10000-triumph-units-a-month-by-september-cfo-says-12675101.html","title":"Bajaj Auto aims to make 10,000 Triumph units a month by September, CFO says","description":"Bajaj Auto ramped up its repertoire of premium brands, which includes KTM and Dominar, partnering with British bike-maker Triumph. It launched two locally made bikes under the partnership in July last year.Triumph Speed 400 was launched last year on JulyRelated stories","content":"Bajaj Auto is aiming to achieve its target of producing 10,000 units of its Triumph motorcycles each month by September, a company executive said on Thursday. \"I would pin that in the first half (of fiscal 2025),\" Dinesh Thapar, Bajaj Auto's financial chief, said in a post-earnings call when asked about the goal's trajectory. \"Consider between now and September,\" he said. Thapar had earlier mentioned the company's 10,000 units-a-month goal in January, without specifying a timeline. It currently makes about 6,500 units a month. Since the launch, Bajaj has sold about 42,000 units to dealerships, the company said in a statement. Of those, 18,800 were sold in the March quarter. Triumph accounted for 2.1% of Bajaj Auto's total two-wheeler sales in the fourth quarter. Its overall two-wheeler sales rose about 26% in the quarter year-on-year. Bajaj Auto's Triumph is still overshadowed by market leader Royal Enfield, whose motorcycles are made by Eicher Motors in India. Both Bajaj's alliance and Hero MotoCorp's partnership with Harley Davidson are anticipated to pose a challenge to the Bullet bike-maker. Bajaj Auto's standalone net profit climbed 35.1%, to 19.36 billion rupees ($231.8 million) for the three months to March 31 from a year earlier, beating analysts' average estimate of 18.26 billion rupees, according to LSEG data. This was aided by strong, improved demand for entry-level models in rural India and steady sales of mid-level motorcycles in cities. A pick-up in exports to some overseas markets such as Latin America along with a low base also helped. Bajaj Auto is the first among its Indian two-wheeler maker peers to report its March-quarter results. ","cleaned_content":"bajaj auto is aiming to achieve its target of producing \u003cONE_TEN_THOUSAND\u003e units of its triumph motorcycles each month by september a company executive said on thursday i would pin that in the first half of fiscal \u003cTWO_THOUSAND\u003e dinesh thapar bajaj autos financial chief said in a post earnings call when asked about the goals trajectory consider between now and september he said thapar had earlier mentioned the companys \u003cONE_TEN_THOUSAND\u003e units a month goal in january without specifying a timeline it currently makes about \u003cSIX_THOUSAND\u003e units a month since the launch bajaj has sold about \u003cFOUR_TEN_THOUSAND\u003e units to dealerships the company said in a statement of those \u003cONE_TEN_THOUSAND\u003e were sold in the march quarter triumph accounted for \u003cTWO_PERCENT\u003e of bajaj autos total two wheeler sales in the fourth quarter its overall two wheeler sales rose about \u003cTWO_TEN_PERCENT\u003e in the quarter year on year bajaj autos triumph is still overshadowed by market leader royal enfield whose motorcycles are made by eicher motors in india both bajajs alliance and hero motocorps partnership with harley davidson are anticipated to pose a challenge to the bullet bike maker bajaj autos standalone net profit climbed \u003cTHREE_TEN_PERCENT\u003e to \u003cONE_TEN\u003e billion rupees \u003cTWO_HUNDRED\u003e million for the three months to march \u003cTHREE_TEN\u003e from a year earlier beating analysts average estimate of \u003cONE_TEN\u003e billion rupees according to lseg data this was aided by strong improved demand for entry level models in rural india and steady sales of mid level motorcycles in cities a pick up in exports to some overseas markets such as latin america along with a low base also helped bajaj auto is the first among its indian two wheeler maker peers to report its march quarter results","timestamp":"2024-04-19T13:34:00+05:30","market_timestamp":"2024-04-19T13:34:00+05:30","off_market_hours":false}