{"url":"https://www.moneycontrol.com/news/technology/no-commercials-just-films-pvr-inox-adopts-ad-free-movies-amid-declining-theatre-footfalls-12707204.html","title":"No commercials, just films: PVR Inox adopts ad-free movies amid declining theatre footfalls","description":"Cutting down the length of the ads slotted before a movie begins on the big screen from 35 minutes to 10 minutes, the company is looking to add extra shows.This new product by PVR Inox has been launched across some of its luxury properties in Delhi, Mumbai, Bengaluru, among others, effective from April 1.Related stories","content":"Top multiplex chain PVR Inox has come up with another product to arrest the decline in footfalls in cinemas. They are offering ad-free movies just like a streaming platform. Weak box office collections of movies have affected the theatre business with big Bollywood films also delivering sub-par performance in the last three months. Cutting down the length of the ads slotted before a movie begins on the big screen from 35 minutes to 10 minutes, the company is looking to add extra shows. Audiences will not see commercials even during intervals. Just trailers of upcoming movies. \"The advertising revenue loss will be compensated with the additional footfalls by having one more show. Admissions generate ticket sales as well as F\u0026B sales,\" Palliere said. Also read: PVR Inox to open nearly half of new screens in South as it looks to improve its performance In Q3, the company reported a 23 percent year-on-year increase in advertising revenue at Rs 140.5 crore. But analysts expect the ad revenue to decline by 15 percent in the March quarter of FY24. However, there will be some brands visible during the reduced break time like Pepsi and Coke. \"In the 10 minutes of content shown before the start of the film, there will be largely movie trailers. This is to focus on our products for which consumers are coming to cinemas. But brands like Pepsi and Coke we are keeping on the screen within the 10 minutes,\" added Palliere. The new product by the company is not for everyone as it has been launched across seven luxury properties of the multiplex chain in Delhi, Mumbai, Bengaluru, among others, effective from April 1. \"In this segment (premium screen) people are time conscious. Also, a lot of these ads were countrywide and were not focused towards that particular audience,\" he added. The initial feedback for ad-movies is showing higher recall value, said Palliere. Ad-free content is available in PVR Inox's premium formats like Director's Cut and Insignia. Also read: Theatres stare at another weak quarter, PVR Inox likely to report loss in Q4 due to dull content \"We will soon be opening (ad free movies) in Pune and very soon it will follow in other premium screens. Within the next few months, we are looking at extending beyond the current batch,\" said Palliere, who is looking to increase the share of premium screens in the total screen portfolio of PVR Inox. Premium screens make up 15 percent of the total 1,741 screens across PVR Inox properties. Palliere expects the share to go up to 20 percent in less than 24 months. He added that the premium formats have not been as affected as regular screens due to weak content performance of films from the beginning of 2024. While the company has launched movies without commercial breaks after  getting feedback from customers, Palliere said that the expectation of increasing frequency of visits to theatres will help in improving footfalls which remains 25-30 percent lower versus pre-Covid levels across India's theatres. \"From a luxury point of view, we are not seeing as much impact of the tepid lineup as the rest of the screens because the experience goes beyond movie watching. Luxury in many ways has shown resilience in terms of occupancy which is not fully impacted by performance of movies. However, this (ad-free movies) will help improve admissions. Occupancy in premium format is in the high 20 percent to low 30 percent but it is not yet back to pre-Covid levels when it was in mid 30s to high 30s (percent). This is because of volatility in content and box office earnings,\" Palliere said. ","cleaned_content":"top multiplex chain pvr inox has come up with another product to arrest the decline in footfalls in cinemas they are offering ad free movies just like a streaming platform weak box office collections of movies have affected the theatre business with big bollywood films also delivering sub par performance in the last three months cutting down the length of the ads slotted before a movie begins on the big screen from \u003cTHREE_TEN\u003e minutes to \u003cONE_TEN\u003e minutes the company is looking to add extra shows audiences will not see commercials even during intervals just trailers of upcoming movies the advertising revenue loss will be compensated with the additional footfalls by having one more show admissions generate ticket sales as well as f b sales palliere said also read pvr inox to open nearly half of new screens in south as it looks to improve its performance in q3 the company reported a \u003cTWO_TEN_PERCENT\u003e year on year increase in advertising revenue at rs \u003cONE_HUNDRED\u003e crore but analysts expect the ad revenue to decline by \u003cONE_TEN_PERCENT\u003e in the march quarter of fy24 however there will be some brands visible during the reduced break time like pepsi and coke in the \u003cONE_TEN\u003e minutes of content shown before the start of the film there will be largely movie trailers this is to focus on our products for which consumers are coming to cinemas but brands like pepsi and coke we are keeping on the screen within the \u003cONE_TEN\u003e minutes added palliere the new product by the company is not for everyone as it has been launched across seven luxury properties of the multiplex chain in delhi mumbai bengaluru among others effective from april \u003cONE_\u003e in this segment premium screen people are time conscious also a lot of these ads were countrywide and were not focused towards that particular audience he added the initial feedback for ad movies is showing higher recall value said palliere ad free content is available in pvr inoxs premium formats like directors cut and insignia also read theatres stare at another weak quarter pvr inox likely to report loss in q4 due to dull content we will soon be opening ad free movies in pune and very soon it will follow in other premium screens within the next few months we are looking at extending beyond the current batch said palliere who is looking to increase the share of premium screens in the total screen portfolio of pvr inox premium screens make up \u003cONE_TEN_PERCENT\u003e of the total \u003cONE_THOUSAND\u003e screens across pvr inox properties palliere expects the share to go up to \u003cTWO_TEN_PERCENT\u003e in less than \u003cTWO_TEN\u003e months he added that the premium formats have not been as affected as regular screens due to weak content performance of films from the beginning of \u003cTWO_THOUSAND\u003e while the company has launched movies without commercial breaks after getting feedback from customers palliere said that the expectation of increasing frequency of visits to theatres will help in improving footfalls which remains \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e lower versus pre covid levels across indias theatres from a luxury point of view we are not seeing as much impact of the tepid lineup as the rest of the screens because the experience goes beyond movie watching luxury in many ways has shown resilience in terms of occupancy which is not fully impacted by performance of movies however this ad free movies will help improve admissions occupancy in premium format is in the high \u003cTWO_TEN_PERCENT\u003e to low \u003cTHREE_TEN_PERCENT\u003e but it is not yet back to pre covid levels when it was in mid \u003cTHREE_TEN\u003e s to high \u003cTHREE_TEN\u003e s percent this is because of volatility in content and box office earnings palliere said","timestamp":"2024-04-24T21:18:00+05:30","market_timestamp":"2024-04-25T09:15:00+05:30","off_market_hours":true}