{"url":"https://www.moneycontrol.com/news/technology/bitter-pill-zee-tech-subsidiary-sugarbox-shuts-shop-employees-say-they-havent-been-paid-12654721.html","title":"Bitter pill: Zee tech subsidiary Sugarbox shuts shop; employees say haven’t been paid","description":"The Sugarbox employees revealed that they had received no formal communication from the company about the closure of operations and allege that there had been miscommunication over their employment contractsZee's tech subsidiary Sugarbox has shut down its operations. Related stories","content":"Zee Entertainment’s tech subsidiary Margo Networks Pvt Ltd, which offers internet connectivity under the brand name Sugarbox, shut its operations on March 22, putting 50-60 of employees out of work. The closure came amid the entertainment and media company’s deepening financial problems. Zee Entertainment, which is currently grappling with the fallout of its terminated merger deal with Sony, is cutting its workforce and has laid off 50 percent of the staff at its Technology \u0026 Innovation Centre (TIC) in Bengaluru. While Zee reported a 140 percent increase in profit to Rs 58.5 crore in the December quarter of FY24, its profit dropped 52 percent sequentially, from Rs 122.96 crore in Q2 FY24. Chief Financial Officer (CFO) Rohit Gupta said that net profit for the third quarter and year (FY24) was impacted by merger expenses and related exceptional items, which came to about Rs 60.3 crore during the quarter. Employees of Sugarbox were informed of the closure decision through a virtual call, with no written communication. It is unclear if the salaries that were pending for February and March will be paid. Moneycontrol has reached out to Zee and Sugarbox with detailed queries and will update this article once they respond. Some of the employees have been handed over letters saying that their resignation had been accepted and that their dues had been cleared. Moneycontrol has seen a screenshot of the letter. “This is to inform you that the resignation request has been accepted and mutually agreed to relieve (the employee) from the services of the company. This is in effect from the closing working hours of 22nd March 2024. There are no dues left and all exit formalities have been completed,” the letter said. “We were working with full force because they told us that they were getting a new contract for some tourist trains and we had to deploy our systems over there,” one employee told Moneycontrol. “Then on March 22, we received a message on Slack to join a virtual call. We had no idea what the call was about. Earlier in the day, Rohit (Paranjpe, co-founder of Sugarbox) told us that he has a meeting with Zee and he will come back with an update. Later, over a virtual call we were informed that they were shutting down the organisation.” Unpaid salaries For many months, Sugarbox assured its employees that it would receive funds from Zee, an assurance that led them to stick around despite the delay in receiving salaries. Zee, however, had been paring its investments in the tech subsidiary. “On March 15, Rohit said that there would be a few more days of delay (in paying salaries) and that he was sorry for the delay. On March 14, he said that the Zee team was working towards getting funds transferred…. and that it would be the last delay,” the employee cited above said. A March 19 message by Paranjpe on Slack read, “Guys, just an update on salary/funding. Things have been running delayed from Zee’s end. I will keep everyone posted as soon as there is an update from Zee, but they are working to get the approvals this week (and get the funds to us within 2-3 days once that is done).” Speaking to Moneycontrol, another employee of Sugarbox said, “Salary delays happened in the past. I had joined in March 2023, and my first salary got disbursed in June. This was the first delay I faced—right after joining the company. But I continued and tried to complete one year as I had trust in the company’s idea.” Another employee Moneycontrol spoke to said that Paranjpe had been assuring them that if Zee didn’t fund the company, there were other investors. In one Slack message on January 22 this year, Paranjpe told employees that the termination of the merger between Zee and Sony would have no impact on Sugarbox. The $10 billion merger deal had been terminated that day. “We have already agreed with the Zee board to demerge and raise money from a set of fresh investors and we’re working with the Zee team to get this done,” the message elaborated. Days of promise In 2017, Zee had bought an 80 percent stake in Margo Networks. In April 2020, it invested Rs 522 crore in the tech startup. Margo offers internet services in areas with poor or no network, allowing users to access its servers over a local wi-fi network at key places of interest (PoI), including public places, public transport, hotels and malls. The company partnered with Hyderabad and Chennai Metro rail to provide free entertainment and WiFi in metro trains. Zee5’s statistics for the Hyderabad Metro in February 2020 showed a 3x increase in data consumption from October 2019, according to a 2020 Sugarbox Business Summary deck on the Zee website. The presentation also mentioned the various tenders awarded to Sugarbox, including one to install its technology across 472 buses and bus 11 terminals in Navi Mumbai. It also mentioned a tender awarded by the Common Services Centre for installation of its tech in 100 Grampanchayats, of which installation in 50 Gram Panchayat was completed. The tide turns However, during the company’s fourth-quarter earnings call for FY21 (January to March 2021), Zee CEO and MD Punit Goenka had said that due to prioritising content investments in digital and television, and because of the prolonged uncertainty due to the Covid pandemic, the company was re-evaluating its investment in Sugarbox and would scale it down. Zee reiterated this in March 2024, when it announced it was institutionalising a ‘Monthly Management Mentorship Program’ under which a special committee would review the management’s business performance. The committee’s first review identified key business verticals that require critical assessment, including tech subsidiary Margo Networks. Not the first time Sugarbox laid off a majority of its employees in September 2023. Out of the total strength of 220-250 people, around 60-70 remained with the company. On April 5, Paranjpe, in a WhatsApp message to employees, said that their employment contracts were terminated on September 30 last year, and this was applicable to everyone, including him. “However, we continued to work till 22/03/24 (March 22, 2024) without an active contract– applies to everyone including me,” the message read. He went on to say that he was sorry to have believed in the investor that had supported them for over seven years. One of the employees questioned Paranjpe on how salaries were being paid if the employees had been terminated last year, to which the co-founder responded saying it was mercy pay. “I asked him if all the employees were terminated in September 2023, then how come the remaining staff got increments? I got a 20 percent hike. I had an offer from some other company but they retained me and offered me the hike in October 2023. However, many employees did not get an appraisal for around two years. Only those who had offers from other firms were retained,” said another Sugarbox employee. The tech company continued hiring until this year despite the lack of funds. An employee who was hired in January has two months’ salary pending. The Zee-Sony merger deal would have brought investments worth $1.5 billion from Sony in the combined entity had it gone through. Zee is now looking to reduce its losses. Analysts note that the company has less than Rs 500 crore in cash equivalents to fund its growth and ward off competitive pressures. ","cleaned_content":"zee entertainment s tech subsidiary margo networks pvt ltd which offers internet connectivity under the brand name sugarbox shut its operations on march \u003cTWO_TEN\u003e putting \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e of employees out of work the closure came amid the entertainment and media company s deepening financial problems zee entertainment which is currently grappling with the fallout of its terminated merger deal with sony is cutting its workforce and has laid off \u003cFIVE_TEN_PERCENT\u003e of the staff at its technology innovation centre tic in bengaluru while zee reported a \u003cONE_HUNDRED_PERCENT\u003e increase in profit to rs \u003cFIVE_TEN\u003e crore in the december quarter of fy24 its profit dropped \u003cFIVE_TEN_PERCENT\u003e sequentially from rs \u003cONE_HUNDRED\u003e crore in q2 fy24 chief financial officer cfo rohit gupta said that net profit for the third quarter and year fy24 was impacted by merger expenses and related exceptional items which came to about rs \u003cSIX_TEN\u003e crore during the quarter employees of sugarbox were informed of the closure decision through a virtual call with no written communication it is unclear if the salaries that were pending for february and march will be paid moneycontrol has reached out to zee and sugarbox with detailed queries and will update this article once they respond some of the employees have been handed over letters saying that their resignation had been accepted and that their dues had been cleared moneycontrol has seen a screenshot of the letter this is to inform you that the resignation request has been accepted and mutually agreed to relieve the employee from the services of the company this is in effect from the closing working hours of \u003cTWO_TEN\u003e nd march \u003cTWO_THOUSAND\u003e there are no dues left and all exit formalities have been completed the letter said we were working with full force because they told us that they were getting a new contract for some tourist trains and we had to deploy our systems over there one employee told moneycontrol then on march \u003cTWO_TEN\u003e we received a message on slack to join a virtual call we had no idea what the call was about earlier in the day rohit paranjpe co founder of sugarbox told us that he has a meeting with zee and he will come back with an update later over a virtual call we were informed that they were shutting down the organisation unpaid salaries for many months sugarbox assured its employees that it would receive funds from zee an assurance that led them to stick around despite the delay in receiving salaries zee however had been paring its investments in the tech subsidiary on march \u003cONE_TEN\u003e rohit said that there would be a few more days of delay in paying salaries and that he was sorry for the delay on march \u003cONE_TEN\u003e he said that the zee team was working towards getting funds transferred and that it would be the last delay the employee cited above said a march \u003cONE_TEN\u003e message by paranjpe on slack read guys just an update on salary funding things have been running delayed from zee s end i will keep everyone posted as soon as there is an update from zee but they are working to get the approvals this week and get the funds to us within \u003cTWO_\u003e \u003cTHREE_\u003e days once that is done speaking to moneycontrol another employee of sugarbox said salary delays happened in the past i had joined in march \u003cTWO_THOUSAND\u003e and my first salary got disbursed in june this was the first delay i faced right after joining the company but i continued and tried to complete one year as i had trust in the company s idea another employee moneycontrol spoke to said that paranjpe had been assuring them that if zee didn t fund the company there were other investors in one slack message on january \u003cTWO_TEN\u003e this year paranjpe told employees that the termination of the merger between zee and sony would have no impact on sugarbox the \u003cONE_TEN\u003e billion merger deal had been terminated that day we have already agreed with the zee board to demerge and raise money from a set of fresh investors and we re working with the zee team to get this done the message elaborated days of promise in \u003cTWO_THOUSAND\u003e zee had bought an \u003cEIGHT_TEN_PERCENT\u003e stake in margo networks in april \u003cTWO_THOUSAND\u003e it invested rs \u003cFIVE_HUNDRED\u003e crore in the tech startup margo offers internet services in areas with poor or no network allowing users to access its servers over a local wi fi network at key places of interest poi including public places public transport hotels and malls the company partnered with hyderabad and chennai metro rail to provide free entertainment and wifi in metro trains zee5 s statistics for the hyderabad metro in february \u003cTWO_THOUSAND\u003e showed a \u003cTHREE_\u003e x increase in data consumption from october \u003cTWO_THOUSAND\u003e according to a \u003cTWO_THOUSAND\u003e sugarbox business summary deck on the zee website the presentation also mentioned the various tenders awarded to sugarbox including one to install its technology across \u003cFOUR_HUNDRED\u003e buses and bus \u003cONE_TEN\u003e terminals in navi mumbai it also mentioned a tender awarded by the common services centre for installation of its tech in \u003cONE_HUNDRED\u003e grampanchayats of which installation in \u003cFIVE_TEN\u003e gram panchayat was completed the tide turns however during the company s fourth quarter earnings call for fy21 january to march \u003cTWO_THOUSAND\u003e zee ceo and md punit goenka had said that due to prioritising content investments in digital and television and because of the prolonged uncertainty due to the covid pandemic the company was re evaluating its investment in sugarbox and would scale it down zee reiterated this in march \u003cTWO_THOUSAND\u003e when it announced it was institutionalising a monthly management mentorship program under which a special committee would review the management s business performance the committee s first review identified key business verticals that require critical assessment including tech subsidiary margo networks not the first time sugarbox laid off a majority of its employees in september \u003cTWO_THOUSAND\u003e out of the total strength of \u003cTWO_HUNDRED\u003e \u003cTWO_HUNDRED\u003e people around \u003cSIX_TEN\u003e \u003cSEVEN_TEN\u003e remained with the company on april \u003cFIVE_\u003e paranjpe in a whatsapp message to employees said that their employment contracts were terminated on september \u003cTHREE_TEN\u003e last year and this was applicable to everyone including him however we continued to work till \u003cTWO_TEN\u003e \u003cTHREE_\u003e \u003cTWO_TEN\u003e march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e without an active contract applies to everyone including me the message read he went on to say that he was sorry to have believed in the investor that had supported them for over seven years one of the employees questioned paranjpe on how salaries were being paid if the employees had been terminated last year to which the co founder responded saying it was mercy pay i asked him if all the employees were terminated in september \u003cTWO_THOUSAND\u003e then how come the remaining staff got increments i got a \u003cTWO_TEN_PERCENT\u003e hike i had an offer from some other company but they retained me and offered me the hike in october \u003cTWO_THOUSAND\u003e however many employees did not get an appraisal for around two years only those who had offers from other firms were retained said another sugarbox employee the tech company continued hiring until this year despite the lack of funds an employee who was hired in january has two months salary pending the zee sony merger deal would have brought investments worth \u003cONE_\u003e billion from sony in the combined entity had it gone through zee is now looking to reduce its losses analysts note that the company has less than rs \u003cFIVE_HUNDRED\u003e crore in cash equivalents to fund its growth and ward off competitive pressures","timestamp":"2024-04-17T18:51:00+05:30","market_timestamp":"2024-04-18T09:15:00+05:30","off_market_hours":true}