{"url":"https://www.moneycontrol.com/news/business/hitachi-energy-eyes-expansion-in-india-amid-rising-power-demand-12707049.html","title":"Hitachi Energy eyes expansion in India amid rising power demand","description":"Zurich-based Hitachi Energy, which makes transformers and large-scale power transmitters, operates a GCC in the country, where high power demand has led to the government ramping up generation, including in renewable energy.Hitachi Energy eyes expansion in India amid rising power demandRelated stories","content":"Hitachi Energy is looking to open more global capability centers in India to expand local operations, amid growing energy demand and a push to scale up renewable energy generation in the country. Zurich-based Hitachi Energy, which makes transformers and large-scale power transmitters, operates a GCC in the country, where high power demand has led to the government ramping up generation, including in renewable energy. \"We are looking at Hyderabad for our GCC.. and also looking at Pune. It might take six months to one year,\" said Venu Nuguri, the managing director and CEO of the company's India unit. The new GCC - a low-cost, offshore facility - will work alongside Hitachi Energy India, but will be part of a separate non-listed Indian entity of Hitachi Energy in Switzerland, Nuguri said. India's government last year rolled out incentives for green energy transition, with an aim to have 500 GW of installed capacity through non-fossil fuel sources by 2030. India's power consumption grew 8% in fiscal year 2023. The International Energy Agency estimates that India will add electricity demand roughly equivalent to the current consumption of the United Kingdom over the next three years. \"To meet the projected demand, market needs to generate at least 3-4 times than what is being done. And accordingly, our order book will also grow two or three times, higher than market growth,\" Nuguri said. The company had an order backlog of 72 billion rupees ($864.7 million) as of fiscal year 2023, according to Nuguri. ","cleaned_content":"hitachi energy is looking to open more global capability centers in india to expand local operations amid growing energy demand and a push to scale up renewable energy generation in the country zurich based hitachi energy which makes transformers and large scale power transmitters operates a gcc in the country where high power demand has led to the government ramping up generation including in renewable energy we are looking at hyderabad for our gcc and also looking at pune it might take six months to one year said venu nuguri the managing director and ceo of the companys india unit the new gcc a low cost offshore facility will work alongside hitachi energy india but will be part of a separate non listed indian entity of hitachi energy in switzerland nuguri said indias government last year rolled out incentives for green energy transition with an aim to have \u003cFIVE_HUNDRED\u003e gw of installed capacity through non fossil fuel sources by \u003cTWO_THOUSAND\u003e indias power consumption grew \u003cEIGHT_PERCENT\u003e in fiscal year \u003cTWO_THOUSAND\u003e the international energy agency estimates that india will add electricity demand roughly equivalent to the current consumption of the united kingdom over the next three years to meet the projected demand market needs to generate at least \u003cTHREE_\u003e \u003cFOUR_\u003e times than what is being done and accordingly our order book will also grow two or three times higher than market growth nuguri said the company had an order backlog of \u003cSEVEN_TEN\u003e billion rupees \u003cEIGHT_HUNDRED\u003e million as of fiscal year \u003cTWO_THOUSAND\u003e according to nuguri","timestamp":"2024-04-24T12:31:00+05:30","market_timestamp":"2024-04-24T12:31:00+05:30","off_market_hours":false}