{"url":"https://www.moneycontrol.com/news/business/juniper-green-energy-tata-power-sign-ppa-for-85-mw-hybrid-project-in-maharashtra-12702241.html","title":"Juniper Green Energy, Tata Power sign PPA for 85 MW hybrid project in Maharashtra","description":"\"The project is the first wind-solar energy project for the company. It will utilize both wind and solar resources by combining 51 MW of wind energy and 34 MW of solar power,\" Juniper Green Energy said in a statement.Juniper Green Energy, Tata Power sign PPA for 85 MW hybrid project in Maharashtra","content":"Juniper Green Energy on Tuesday said it has signed an agreement with Tata Power for the development of an 85 megawatt hybrid power project in Maharashtra. \"The project is the first wind-solar energy project for the company. It will utilize both wind and solar resources by combining 51 MW of wind energy and 34 MW of solar power,\" Juniper Green Energy said in a statement. The power purchase agreement (PPA) with Tata Power is for the development of an 85 MW hybrid power project in Maharashtra, the company said. Juniper Green Energy is an independent renewable energy power producer and operator of solar, wind and hybrid power projects. The company is part of the AT Group, which has an asset portfolio of about USD 2.5 billion with global investments in renewable energy, residential and commercial real estate, hospitality, etc. ","cleaned_content":"juniper green energy on tuesday said it has signed an agreement with tata power for the development of an \u003cEIGHT_TEN\u003e megawatt hybrid power project in maharashtra the project is the first wind solar energy project for the company it will utilize both wind and solar resources by combining \u003cFIVE_TEN\u003e mw of wind energy and \u003cTHREE_TEN\u003e mw of solar power juniper green energy said in a statement the power purchase agreement ppa with tata power is for the development of an \u003cEIGHT_TEN\u003e mw hybrid power project in maharashtra the company said juniper green energy is an independent renewable energy power producer and operator of solar wind and hybrid power projects the company is part of the at group which has an asset portfolio of about usd \u003cTWO_\u003e billion with global investments in renewable energy residential and commercial real estate hospitality etc","timestamp":"2024-04-23T19:47:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}