{"url":"https://www.moneycontrol.com/news/business/razorpay-announces-upi-switch-in-partnership-with-airtel-payments-bank-12703101.html","title":"Razorpay announces 'UPI Switch' in partnership with Airtel Payments Bank","description":"Boosting success rates by 4-5 per cent, the solution is designed to handle up to 10,000 transactions per second (TPS) at any given time, according to a release.Razorpay announces 'UPI Switch' in partnership with Airtel Payments BankRelated stories","content":"Fintech company Razorpay on Tuesday launched its own UPI infrastructure with 'UPI Switch', a cloud-based innovation in partnership with Airtel Payments Bank, and said the solution is geared to ensure smoother and faster transactions. Boosting success rates by 4-5 per cent, the solution is designed to handle up to 10,000 transactions per second (TPS) at any given time, according to a release. The 'UPI Switch' will also enable 5 times faster access to UPI (Unified Payments Interface) innovations for businesses, it added. Khilan Haria, Head of Payments Product at Razorpay, said India has always been at the forefront of innovation in the digital payments ecosystem and its possibilities have compounded in the last few years, with the versatility of UPI. \"This venture into UPI infrastructure marks a strategic move to manage the end-to-end merchant experience and provide the industry's leading stack. \"With latency below 100 milliseconds, a 4-5 per cent increase in success rates, and features customised to suit business needs, our switch is crafted to enrich the payment experience and ensure that businesses can now manage the surge in UPI transactions on any sale or non-sale day,\" Haria said. Ganesh Ananthanarayanan, Chief Operating Officer of Airtel Payments Bank, said the integration with Razorpay's UPI Switch, a cloud-based infrastructure for the most advanced UPI Stack, ensures 99.99 per cent uptime and enables up to 10,000 transactions per second. \"As UPI transactions continue to surge, our collaboration sets a new standard for business payments, aligning perfectly with the vision of a digital India,\" Ananthanarayanan said. ","cleaned_content":"fintech company razorpay on tuesday launched its own upi infrastructure with upi switch a cloud based innovation in partnership with airtel payments bank and said the solution is geared to ensure smoother and faster transactions boosting success rates by \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e the solution is designed to handle up to \u003cONE_TEN_THOUSAND\u003e transactions per second tps at any given time according to a release the upi switch will also enable \u003cFIVE_\u003e times faster access to upi unified payments interface innovations for businesses it added khilan haria head of payments product at razorpay said india has always been at the forefront of innovation in the digital payments ecosystem and its possibilities have compounded in the last few years with the versatility of upi this venture into upi infrastructure marks a strategic move to manage the end to end merchant experience and provide the industrys leading stack with latency below \u003cONE_HUNDRED\u003e milliseconds a \u003cFOUR_\u003e \u003cFIVE_PERCENT\u003e increase in success rates and features customised to suit business needs our switch is crafted to enrich the payment experience and ensure that businesses can now manage the surge in upi transactions on any sale or non sale day haria said ganesh ananthanarayanan chief operating officer of airtel payments bank said the integration with razorpays upi switch a cloud based infrastructure for the most advanced upi stack ensures \u003cNINE_TEN_PERCENT\u003e uptime and enables up to \u003cONE_TEN_THOUSAND\u003e transactions per second as upi transactions continue to surge our collaboration sets a new standard for business payments aligning perfectly with the vision of a digital india ananthanarayanan said","timestamp":"2024-04-23T21:52:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}