{"url":"https://www.moneycontrol.com/news/business/lt-manufactures-hydrotreating-reactor-for-refinery-in-mexico-12703121.html","title":"L\u0026T manufactures hydrotreating reactor for refinery in Mexico","description":"The reactor has been dispatched for Mexico from the company's A M Naik Heavy Engineering Complex at Hazira in Gujarat.L\u0026T manufactures hydrotreating reactor for refinery in Mexico","content":"Engineering and construction conglomerate Larsen \u0026 Toubro (L\u0026T) on Tuesday said it has manufactured a hydrotreating reactor for the Antonio Dovali Jaime Refinery at Salina Cruz, in Mexico. The reactor has been dispatched for Mexico from the company's A M Naik Heavy Engineering Complex at Hazira in Gujarat. \"Equipped with critical Cr-Mo-V metallurgy, the hydrotreating reactor is based on a technology developed by France-headquartered Axens. It has been manufactured at the Hazira Complex in a record 15 months,\" it said in a statement. Larsen \u0026 Toubro is a USD 23 billion Indian multinational engaged in engineering, procurement, and construction projects, hi-tech manufacturing and services. It operates in over 50 countries worldwide. ","cleaned_content":"engineering and construction conglomerate larsen toubro l t on tuesday said it has manufactured a hydrotreating reactor for the antonio dovali jaime refinery at salina cruz in mexico the reactor has been dispatched for mexico from the companys a m naik heavy engineering complex at hazira in gujarat equipped with critical cr mo v metallurgy the hydrotreating reactor is based on a technology developed by france headquartered axens it has been manufactured at the hazira complex in a record \u003cONE_TEN\u003e months it said in a statement larsen toubro is a usd \u003cTWO_TEN\u003e billion indian multinational engaged in engineering procurement and construction projects hi tech manufacturing and services it operates in over \u003cFIVE_TEN\u003e countries worldwide","timestamp":"2024-04-23T18:54:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}