{"url":"https://www.moneycontrol.com/news/business/inox-wind-bags-repeat-order-for-210-mw-wind-project-from-hero-future-energies-12673521.html","title":"Inox Wind bags repeat order for 210 MW wind project from Hero Future Energies","description":"Additionally, Inox Wind will also provide post-commissioning multi-year Operations \u0026 Maintenance (O\u0026M) services, a statement said.Inox Wind bags repeat order for 210 MW wind project from Hero Future Energies","content":"Wind energy solutions provider Inox Wind on Friday said it has secured a repeat order for 210 MW for its 3 MW wind turbine generators from Hero Future Energies (HFE). Additionally, Inox Wind will also provide post-commissioning multi-year Operations \u0026 Maintenance (O\u0026M) services, a statement said. The order is for (IWL) Inox Wind Ltd's state-of-the-art 3 MW Wind Turbine Generators (WTGs), and the scope comprises equipment supply with certain add-on services, according to the statement. Kailash Tarachandani, CEO of Inox Wind, said, \"We are thrilled to announce a large repeat order of 210 MW from Hero Future Energies, a longstanding partner. This order reinforces the confidence in our 3MW WTGs, being one of the most efficient turbines in its class. The addition of this order further re-emphasises our growth outlook.\" ","cleaned_content":"wind energy solutions provider inox wind on friday said it has secured a repeat order for \u003cTWO_HUNDRED\u003e mw for its \u003cTHREE_\u003e mw wind turbine generators from hero future energies hfe additionally inox wind will also provide post commissioning multi year operations maintenance o m services a statement said the order is for iwl inox wind ltds state of the art \u003cTHREE_\u003e mw wind turbine generators wtgs and the scope comprises equipment supply with certain add on services according to the statement kailash tarachandani ceo of inox wind said we are thrilled to announce a large repeat order of \u003cTWO_HUNDRED\u003e mw from hero future energies a longstanding partner this order reinforces the confidence in our \u003cTHREE_\u003e mw wtgs being one of the most efficient turbines in its class the addition of this order further re emphasises our growth outlook","timestamp":"2024-04-19T10:57:00+05:30","market_timestamp":"2024-04-19T10:57:00+05:30","off_market_hours":false}