{"url":"https://www.moneycontrol.com/news/business/sterlite-technologies-raises-rs-1000-crore-through-qip-route-12648591.html","title":"Sterlite Technologies raises Rs 1,000 crore through QIP route","description":"Post the allotment, the paid-up equity share capital of Sterlite Technologies (STL) has increased to Rs 97.5 crore comprising 48.5 crore equity shares.Sterlite Technologies raises Rs 1,000 crore through QIP route","content":"Broadband technology company Sterlite Technologies has raised Rs 1,000 crore by issuing equity to Qualified Institutional Investors (QIP) including HDFC Mutual Fund, Nippon Life India, Goldman Sachs, and Bandhan Mutual Fund, the company said on Tuesday. Post the allotment, the paid-up equity share capital of Sterlite Technologies (STL) has increased to Rs 97.5 crore comprising 48.5 crore equity shares. \"STL has raised INR 1,000 crore through a Qualified Institutional Placement (QIP) route,\" the company said in a regulatory filing. \"We are thankful to our investors for their continued support and for believing in the growth potential of STL. The money raised through QIP will be utilised towards strengthening our balance sheet so that we double down on our purpose of transforming billions of lives by connecting the world,\" STL, managing director Ankit Agarwal said. ","cleaned_content":"broadband technology company sterlite technologies has raised rs \u003cONE_THOUSAND\u003e crore by issuing equity to qualified institutional investors qip including hdfc mutual fund nippon life india goldman sachs and bandhan mutual fund the company said on tuesday post the allotment the paid up equity share capital of sterlite technologies stl has increased to rs \u003cNINE_TEN\u003e crore comprising \u003cFOUR_TEN\u003e crore equity shares stl has raised inr \u003cONE_THOUSAND\u003e crore through a qualified institutional placement qip route the company said in a regulatory filing we are thankful to our investors for their continued support and for believing in the growth potential of stl the money raised through qip will be utilised towards strengthening our balance sheet so that we double down on our purpose of transforming billions of lives by connecting the world stl managing director ankit agarwal said","timestamp":"2024-04-16T13:07:00+05:30","market_timestamp":"2024-04-16T13:07:00+05:30","off_market_hours":false}