{"url":"https://www.moneycontrol.com/news/business/nbcc-to-set-up-shadow-lender-to-help-save-over-100-million-12676081.html","title":"NBCC to set up shadow lender to help save over $100 million","description":"The construction and real estate developer estimates the move will help it save $108 million in interest costs over the next two years, said the sources, who did not want to be named as the discussions are private.NBCC to set up shadow lender to help save over $100 millionRelated stories","content":"NBCC plans to set up its own non-banking finance company (NBFC) later this year to lower its borrowing costs for key infrastructure projects, according to two sources directly involved in the matter. The construction and real estate developer estimates the move will help it save $108 million in interest costs over the next two years, said the sources, who did not want to be named as the discussions are private. The Indian government owns infrastructure financial institutions but no other state-run company has created a unit to help it finance projects. NBCC will seek approval for the shadow bank from the new administration that will be elected in June, at the end of the seven-phase national polls that started on Friday. The company will also need a license from the Reserve Bank of India (RBI), which it has not yet applied for. NBCC did not reply to emails seeking comments. Currently, NBCC pays 12% to 14% to other NBFCs in borrowing costs and that could be lowered by 1-2 percentage points if it sets up the NBFC, the first source said. \"The in-house NBFC will help in getting seed money for redevelopment and monetisation projects of other public sector entities,\" said the first source. NBCC recently got redevelopment projects from Steel Authority of India Ltd and the Indian railways. ","cleaned_content":"nbcc plans to set up its own non banking finance company nbfc later this year to lower its borrowing costs for key infrastructure projects according to two sources directly involved in the matter the construction and real estate developer estimates the move will help it save \u003cONE_HUNDRED\u003e million in interest costs over the next two years said the sources who did not want to be named as the discussions are private the indian government owns infrastructure financial institutions but no other state run company has created a unit to help it finance projects nbcc will seek approval for the shadow bank from the new administration that will be elected in june at the end of the seven phase national polls that started on friday the company will also need a license from the reserve bank of india rbi which it has not yet applied for nbcc did not reply to emails seeking comments currently nbcc pays \u003cONE_TEN_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e to other nbfcs in borrowing costs and that could be lowered by \u003cONE_\u003e \u003cTWO_PERCENT\u003e age points if it sets up the nbfc the first source said the in house nbfc will help in getting seed money for redevelopment and monetisation projects of other public sector entities said the first source nbcc recently got redevelopment projects from steel authority of india ltd and the indian railways","timestamp":"2024-04-19T13:42:00+05:30","market_timestamp":"2024-04-19T13:42:00+05:30","off_market_hours":false}