{"url":"https://www.moneycontrol.com/news/technology/nearly-half-of-pvr-inoxs-new-screens-to-open-in-south-as-it-looks-to-improve-performance-12637521.html","title":"PVR Inox to open nearly half of new screens in South as it looks to improve its performance","description":"The company is looking at spending on new screen launches in markets with strong returns like the South but is also shutting down its non-performing screens and is reducing its capital expenditure by 30-40 percent over the previous year in FY25. A new property launched by PVR Inox in Bengaluru. Related stories","content":"India's top multiplex operator PVR Inox is adding more screens down South as it looks to improve its operational performance at a time when the cinema business is struggling due to a lack of content and lower occupancies. \"The South market is 33 percent of our portfolio which is 588 screens out of 1,741 screens. 40 percent of the screens which are opening now (in FY25) are going to be in the South. We have to go where the consumption is high and we only want to deploy capital in those catchments where we get the highest returns. In the south average occupancy is high,\" Ajay Bijli, Managing Director, PVR INOX Limited, told Moneycontrol. Best performing market \"Bengaluru is one of the best-performing cities for PVR Inox because of the number of languages that get consumed over here. All sorts of movies get consumed here which is the reason why this is our 26th property in Bengaluru. The company's share is 33 percent in the city where the movie-going culture is strong. Going forward, we are keen to open cinemas in those cities where the movie-going consumption is high.\" While PVR is increasing its focus on the South market, it is cutting down capital expenditure and is closing down some of its screens. It plans to reduce its capital expenditure by 30-40 percent in FY25 over the previous year to Rs 400-450 crore. Asset light model \"We are going with the FOCO model which is a franchise-owned company operated model. A lot of retail companies that we are benchmarking against have moved to the FOCO model. We want to go with an asset-light model and we have already deployed a lot of capital. We also want to be careful where we open screens. The South is one focus. Rest of the territories we will be moving towards the FOCO model where we would want the developer to spend money if they want the brand and we will be spending close to 20 percent of the capital,\" Bijli said. In FY25, the company plans to open 100 screens more and may also disinvest in 90 screens. \"We are also closing some of our cinemas around 125 screens in FY25 which have reached the end of lease and also they have become obsolete compared to new malls which are coming up. So, whatever is disruptive we are closing,\" the MD said. Due to quarter-on-quarter (QoQ) volatility in gross box office performance which has increased post-pandemic, deleveraging has become a top priority, the company said. It is looking at liquidating its real estate assets in prime locations of Mumbai, Pune, and Vadodra. \"We have a large land bank of Rs 300-400 crore which we want to sell this year and try to pare down our debt,\" Bijli said. Leaner organisation In the next 12-18 months, PVR Inox said it will shut down non-performing screens, renegotiate rental contracts with landlords, reduce capex intensity, and become free cash flow positive to improve operational performance. \"A much leaner organisational structure has been announced from April 1. With the merger, you need to be aware of the costs because you have a much larger entity. After the merger is done one has to look at ROI (return on investment), ROCE (return on capital employed), and EBITDA (earnings before interest, taxes, depreciation, and amortisation). We felt that both the brands are established so there is an urgency to grow everywhere. The focus is going to be on profitability and to pare down the debt.\" In the nine months of FY24, PVR Inox's gross debt stood at Rs 1,608.1 crore. The company had reduced its gross debt by Rs 184.6 crore over nine months of FY24. The company's proportion of minimum guarantee rental contracts has gone down giving way to revenue-sharing rental agreements. The idea is to reduce the rental cost to pre-Covid levels which was 16-17 percent of revenue from the current 19-20 percent of revenue level. BIjli said that chief executive officer (CEO) Gautam Dutta is looking at revenue and F\u0026B (food and beverage) and his focus will be to get more people in cinemas, increase sales and advertising revenue). The company expects occupancy to increase to 29-30 percent in FY25 from the current level of 25 percent. The company expects advertising revenue to reach pre-Covid level on an absolute basis by FY25 but on a per-screen basis it will take more time. PVR Inox is also piloting a feature in collaboration with food delivery platform Zomato in Gurugram, wherein a customer can order from the multiplex chain's food menu on Zomato to get an in-cinema delivery. This is aimed to allow users to skip long queues formed at food kiosks during breaks. ","cleaned_content":"indias top multiplex operator pvr inox is adding more screens down south as it looks to improve its operational performance at a time when the cinema business is struggling due to a lack of content and lower occupancies the south market is \u003cTHREE_TEN_PERCENT\u003e of our portfolio which is \u003cFIVE_HUNDRED\u003e screens out of \u003cONE_THOUSAND\u003e screens \u003cFOUR_TEN_PERCENT\u003e of the screens which are opening now in fy25 are going to be in the south we have to go where the consumption is high and we only want to deploy capital in those catchments where we get the highest returns in the south average occupancy is high ajay bijli managing director pvr inox limited told moneycontrol best performing market bengaluru is one of the best performing cities for pvr inox because of the number of languages that get consumed over here all sorts of movies get consumed here which is the reason why this is our \u003cTWO_TEN\u003e th property in bengaluru the companys share is \u003cTHREE_TEN_PERCENT\u003e in the city where the movie going culture is strong going forward we are keen to open cinemas in those cities where the movie going consumption is high while pvr is increasing its focus on the south market it is cutting down capital expenditure and is closing down some of its screens it plans to reduce its capital expenditure by \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e in fy25 over the previous year to rs \u003cFOUR_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e crore asset light model we are going with the foco model which is a franchise owned company operated model a lot of retail companies that we are benchmarking against have moved to the foco model we want to go with an asset light model and we have already deployed a lot of capital we also want to be careful where we open screens the south is one focus rest of the territories we will be moving towards the foco model where we would want the developer to spend money if they want the brand and we will be spending close to \u003cTWO_TEN_PERCENT\u003e of the capital bijli said in fy25 the company plans to open \u003cONE_HUNDRED\u003e screens more and may also disinvest in \u003cNINE_TEN\u003e screens we are also closing some of our cinemas around \u003cONE_HUNDRED\u003e screens in fy25 which have reached the end of lease and also they have become obsolete compared to new malls which are coming up so whatever is disruptive we are closing the md said due to quarter on quarter qoq volatility in gross box office performance which has increased post pandemic deleveraging has become a top priority the company said it is looking at liquidating its real estate assets in prime locations of mumbai pune and vadodra we have a large land bank of rs \u003cTHREE_HUNDRED\u003e \u003cFOUR_HUNDRED\u003e crore which we want to sell this year and try to pare down our debt bijli said leaner organisation in the next \u003cONE_TEN\u003e \u003cONE_TEN\u003e months pvr inox said it will shut down non performing screens renegotiate rental contracts with landlords reduce capex intensity and become free cash flow positive to improve operational performance a much leaner organisational structure has been announced from april \u003cONE_\u003e with the merger you need to be aware of the costs because you have a much larger entity after the merger is done one has to look at roi return on investment roce return on capital employed and ebitda earnings before interest taxes depreciation and amortisation we felt that both the brands are established so there is an urgency to grow everywhere the focus is going to be on profitability and to pare down the debt in the nine months of fy24 pvr inoxs gross debt stood at rs \u003cONE_THOUSAND\u003e crore the company had reduced its gross debt by rs \u003cONE_HUNDRED\u003e crore over nine months of fy24 the companys proportion of minimum guarantee rental contracts has gone down giving way to revenue sharing rental agreements the idea is to reduce the rental cost to pre covid levels which was \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e of revenue from the current \u003cONE_TEN\u003e \u003cTWO_TEN_PERCENT\u003e of revenue level bijli said that chief executive officer ceo gautam dutta is looking at revenue and f b food and beverage and his focus will be to get more people in cinemas increase sales and advertising revenue the company expects occupancy to increase to \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e in fy25 from the current level of \u003cTWO_TEN_PERCENT\u003e the company expects advertising revenue to reach pre covid level on an absolute basis by fy25 but on a per screen basis it will take more time pvr inox is also piloting a feature in collaboration with food delivery platform zomato in gurugram wherein a customer can order from the multiplex chains food menu on zomato to get an in cinema delivery this is aimed to allow users to skip long queues formed at food kiosks during breaks","timestamp":"2024-04-15T05:18:00+05:30","market_timestamp":"2024-04-15T09:15:00+05:30","off_market_hours":true}