{"url":"https://www.moneycontrol.com/news/business/nepalese-billionaire-who-made-his-fortune-making-instant-noodles-aims-to-list-india-unit-by-2026-12638831.html","title":"Nepalese billionaire who made his fortune making instant noodles aims to list India unit by 2026","description":"The listing plans for the firm, which has a 28% share in the local instant noodles market and an annual revenue of 8 billion rupees ($96.2 million), are still in the early stages of discussion, he added. It aims to grow its revenue by 15% this year.Binod Chaudhary Photographer: Ore Huiying/BloombergRelated stories","content":"Nepalese billionaire Binod Chaudhary, who made his fortune selling instant noodles, is seeking to list his conglomerate Chaudhary Group’s India food unit by 2026. The Gurgaon-based firm, known for its Wai Wai brand of noodles that rivals market leader Maggi from Nestle Ltd. and ITC Ltd.’s Yippee, “would be ready to go for a sizable listing” in the next two years after rolling out new products and acquiring smaller firms in the noodle-related industry, Manvendra Shukla, global chief executive officer at CG Foods India Pvt., said in an interview. He didn’t share any other details. The listing plans for the firm, which has a 28% share in the local instant noodles market and an annual revenue of 8 billion rupees ($96.2 million), are still in the early stages of discussion, he added. It aims to grow its revenue by 15% this year. Read More: Rich Valuations Power Indian IPOs to Record Start: ECM Watch The noodle maker, however, is not rushing to list and plans to bolster its market share and product portfolio first. The company is also looking to buy smaller companies that make seasonings, dips or ketchups, Shukla said. ‘Not Replicated’Chaudhary Group launched the Wai Wai noodle four decades ago in Nepal’s capital Kathmandu, and has since grown to become India’s third largest brand. Wai Wai is known for its pre-seasoned noodle — it comes with a layer of spice in addition to the seasoning pouches in the packet — which means it can also be munched on as a snack without cooking it. “We have something which is not replicated yet in the market,” Shukla said. CG Foods India currently has seven plants across the country, with Nepal and India contributing over 80% to the group’s food sales. The firm expects to add production lines as volumes continue to grow in India where sales of snacks and soft drinks almost tripled over the past decade in India, exceeding $30 billion. It launched two flavors last month, including a spicier variant called Dynamite, inspired by the Korean cuisine. More products are in the pipeline, including healthier noodle options, according to Shukla. “It is a flavor battle,” he said. ","cleaned_content":"nepalese billionaire binod chaudhary who made his fortune selling instant noodles is seeking to list his conglomerate chaudhary group s india food unit by \u003cTWO_THOUSAND\u003e the gurgaon based firm known for its wai wai brand of noodles that rivals market leader maggi from nestle ltd and itc ltd s yippee would be ready to go for a sizable listing in the next two years after rolling out new products and acquiring smaller firms in the noodle related industry manvendra shukla global chief executive officer at cg foods india pvt said in an interview he didn t share any other details the listing plans for the firm which has a \u003cTWO_TEN_PERCENT\u003e share in the local instant noodles market and an annual revenue of \u003cEIGHT_\u003e billion rupees \u003cNINE_TEN\u003e million are still in the early stages of discussion he added it aims to grow its revenue by \u003cONE_TEN_PERCENT\u003e this year read more rich valuations power indian ipos to record start ecm watch the noodle maker however is not rushing to list and plans to bolster its market share and product portfolio first the company is also looking to buy smaller companies that make seasonings dips or ketchups shukla said not replicated chaudhary group launched the wai wai noodle four decades ago in nepal s capital kathmandu and has since grown to become india s third largest brand wai wai is known for its pre seasoned noodle it comes with a layer of spice in addition to the seasoning pouches in the packet which means it can also be munched on as a snack without cooking it we have something which is not replicated yet in the market shukla said cg foods india currently has seven plants across the country with nepal and india contributing over \u003cEIGHT_TEN_PERCENT\u003e to the group s food sales the firm expects to add production lines as volumes continue to grow in india where sales of snacks and soft drinks almost tripled over the past decade in india exceeding \u003cTHREE_TEN\u003e billion it launched two flavors last month including a spicier variant called dynamite inspired by the korean cuisine more products are in the pipeline including healthier noodle options according to shukla it is a flavor battle he said","timestamp":"2024-04-15T08:23:00+05:30","market_timestamp":"2024-04-15T09:15:00+05:30","off_market_hours":true}