{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-partners-with-south-indian-bank-for-dealer-financing-12666601.html","title":"Ashok Leyland partners with South Indian Bank for dealer financing","description":"The company has signed a Memorandum of Understanding (MoU) to provide financing to dealers under the bank's dealer finance programme, Ashok Leyland said in a statement.Ashok Leyland partners with South Indian Bank for dealer financing","content":"Commercial vehicle maker Ashok Leyland Ltd on Thursday said it has partnered with South Indian Bank for financing dealers. The company has signed a Memorandum of Understanding (MoU) to provide financing to dealers under the bank's dealer finance programme, Ashok Leyland said in a statement. Under this partnership, the bank will provide competitive dealer finance options to the dealers, it added. South Indian Bank Senior General Manager \u0026 Group Business Head, Biji SS said this partnership will meet the business needs of both organisations and create a strong positive impact. \"Through our varied financial solutions, our goal is to offer convenient and complete financing choices to the dealers,\" she added. ","cleaned_content":"commercial vehicle maker ashok leyland ltd on thursday said it has partnered with south indian bank for financing dealers the company has signed a memorandum of understanding mou to provide financing to dealers under the banks dealer finance programme ashok leyland said in a statement under this partnership the bank will provide competitive dealer finance options to the dealers it added south indian bank senior general manager group business head biji ss said this partnership will meet the business needs of both organisations and create a strong positive impact through our varied financial solutions our goal is to offer convenient and complete financing choices to the dealers she added","timestamp":"2024-04-18T13:35:00+05:30","market_timestamp":"2024-04-18T13:35:00+05:30","off_market_hours":false}