{"url":"https://www.moneycontrol.com/news/business/ed-opposes-interim-bail-to-jet-airways-founder-naresh-goyal-hc-to-pass-order-on-may-6-12713938.html","title":"ED opposes interim bail to Jet Airways founder Naresh Goyal; HC to pass order on May 6","description":"Naresh Goyal has sought interim bail on medical and humanitarian grounds, citing that both he and his wife, Anita Goyal, suffered from cancer.ED opposes interim bail to Jet Airways founder Naresh Goyal; HC to pass order on May 6Related stories","content":"The Enforcement Directorate (ED) on Friday opposed the interim medical bail sought by Jet Airways founder Naresh Goyal in a money laundering case and said his stay at a private hospital could be extended for a month. Goyal has sought interim bail on medical and humanitarian grounds, citing that both he and his wife, Anita Goyal, suffered from cancer. On Friday, a single bench of Justice N J Jamadar said it would pass orders on May 6. Goyal had last week moved the high court seeking interim bail on merits and release on medical grounds. While Goyal's counsel, Harish Salve, urged the court to consider the case on humanitarian grounds, the ED's counsel, Hiten Venegaonkar, vehemently opposed the bail and said the probe agency did not have a problem if his hospitalisation was extended. Before closing the matter for orders, Justice Jamadar remarked that taking treatment without restraint would make a difference. \"There is a distinction when a person gets medical treatment without any restraint,\" he said. To which Venegaonkar said there was no restraint even now. \"He is getting treated at a hospital of his choice and by doctors of his own choice. His wife is also in the same hospital, and there is no restraint for them to meet and spend time together,\" Venegaonkar said. The lawyer said the court may extend his hospitalisation for four weeks and then call for a fresh medical report to assess his situation. Salve argued that apart from his deteriorating physical health, Goyal's mental health was also not good. \"His mental health is also a point of concern. Being mentally infirm is worse than physical infirmity,\" Salve said. The senior counsel said section 45 of the Prevention of Money Laundering Act (PMLA) is strict on grant of bail to persons arrested for a financial crime. \"But there is a proviso under the section, which says bail may be considered in cases of old age or infirmity. This proviso makes this section more humane,\" Salve said. The court may grant interim bail to Goyal and impose the strictest conditions on him, he said. \"He (Goyal) has been told his wife has only six months to live as she has terminal cancer. He has also got cancer. His mental state and his wife's mental state need to be considered. At this stage, they both need love and affection,\" Salve said. The ED arrested Goyal in September 2023 on allegations that he had laundered money and siphoned off loans to the tune of Rs 538.62 crore given to Jet Airways by Canara Bank. His wife, Anita Goyal, was arrested in November 2023 when the ED submitted its charge sheet in the case. She was granted bail by the special court on the same day, considering her age and medical condition. ","cleaned_content":"the enforcement directorate ed on friday opposed the interim medical bail sought by jet airways founder naresh goyal in a money laundering case and said his stay at a private hospital could be extended for a month goyal has sought interim bail on medical and humanitarian grounds citing that both he and his wife anita goyal suffered from cancer on friday a single bench of justice n j jamadar said it would pass orders on may \u003cSIX_\u003e goyal had last week moved the high court seeking interim bail on merits and release on medical grounds while goyals counsel harish salve urged the court to consider the case on humanitarian grounds the eds counsel hiten venegaonkar vehemently opposed the bail and said the probe agency did not have a problem if his hospitalisation was extended before closing the matter for orders justice jamadar remarked that taking treatment without restraint would make a difference there is a distinction when a person gets medical treatment without any restraint he said to which venegaonkar said there was no restraint even now he is getting treated at a hospital of his choice and by doctors of his own choice his wife is also in the same hospital and there is no restraint for them to meet and spend time together venegaonkar said the lawyer said the court may extend his hospitalisation for four weeks and then call for a fresh medical report to assess his situation salve argued that apart from his deteriorating physical health goyals mental health was also not good his mental health is also a point of concern being mentally infirm is worse than physical infirmity salve said the senior counsel said section \u003cFOUR_TEN\u003e of the prevention of money laundering act pmla is strict on grant of bail to persons arrested for a financial crime but there is a proviso under the section which says bail may be considered in cases of old age or infirmity this proviso makes this section more humane salve said the court may grant interim bail to goyal and impose the strictest conditions on him he said he goyal has been told his wife has only six months to live as she has terminal cancer he has also got cancer his mental state and his wifes mental state need to be considered at this stage they both need love and affection salve said the ed arrested goyal in september \u003cTWO_THOUSAND\u003e on allegations that he had laundered money and siphoned off loans to the tune of rs \u003cFIVE_HUNDRED\u003e crore given to jet airways by canara bank his wife anita goyal was arrested in november \u003cTWO_THOUSAND\u003e when the ed submitted its charge sheet in the case she was granted bail by the special court on the same day considering her age and medical condition","timestamp":"2024-05-03T13:10:00+05:30","market_timestamp":"2024-05-03T13:10:00+05:30","off_market_hours":false}