{"url":"https://www.moneycontrol.com/news/business/american-express-to-open-one-million-sq-feet-campus-in-gurugram-12713901.html","title":"American Express to open one-million sq feet campus in Gurugram","description":"The company has additional facilities in Gurugram as well as in Delhi, Mumbai, Bengaluru, Chennai, and Pune.American Express to open one-million sq feet campus in Gurugram","content":"Global payments company American Express on Wednesday announced it will open its nearly one-million square feet campus in Gurugram, Haryana. The company has additional facilities in Gurugram as well as in Delhi, Mumbai, Bengaluru, Chennai, and Pune. Its employees will begin moving to the new facility, located in sector 74A Gurugram, in phases, starting from the end of this month, the company said in a statement. \"American Express in India continues to develop in-country capabilities by leveraging our global expertise and local talent, fostering new opportunities and innovation for customers worldwide,\" said Sanjay Khanna, CEO and Country Manager, American Express, India. The new office building provides a modern, energy efficient workspace, Khanna added. \"Our new India campus is the largest office we've built from the ground up globally, and the facility is a fitting reflection of the American Express brand and the kind of workplace where our colleagues can thrive,\" said Gagandeep Singh, Senior Vice President, Global Real Estate and Workplace Experience, American Express. American Express in India provides support for every division of the company, in addition to delivering innovative products and services to customers in India. ","cleaned_content":"global payments company american express on wednesday announced it will open its nearly one million square feet campus in gurugram haryana the company has additional facilities in gurugram as well as in delhi mumbai bengaluru chennai and pune its employees will begin moving to the new facility located in sector \u003cSEVEN_TEN\u003e a gurugram in phases starting from the end of this month the company said in a statement american express in india continues to develop in country capabilities by leveraging our global expertise and local talent fostering new opportunities and innovation for customers worldwide said sanjay khanna ceo and country manager american express india the new office building provides a modern energy efficient workspace khanna added our new india campus is the largest office weve built from the ground up globally and the facility is a fitting reflection of the american express brand and the kind of workplace where our colleagues can thrive said gagandeep singh senior vice president global real estate and workplace experience american express american express in india provides support for every division of the company in addition to delivering innovative products and services to customers in india","timestamp":"2024-05-03T12:26:00+05:30","market_timestamp":"2024-05-03T12:26:00+05:30","off_market_hours":false}