{"url":"https://www.moneycontrol.com/news/business/india-widens-spices-crackdown-with-nationwide-checks-on-all-manufacturers-12712915.html","title":"India widens spices crackdown with nationwide checks on all manufacturers","description":"Hong Kong last month suspended sales of three spice blends made by India's MDH and an Everest spice mix for fish curry. Singapore ordered a recall of the same Everest mix as well, flagging high levels of ethylene oxide, which is unfit for human consumption and a cancer risk with long exposure.India widens spices crackdown with nationwide checks on all manufacturersRelated stories","content":"India's food safety regulator said on Thursday it had ordered nationwide testing and inspections at all companies making spice mixes, widening a crackdown on the sector as global regulators investigate contamination issues with two popular local brands. Hong Kong last month suspended sales of three spice blends made by India's MDH and an Everest spice mix for fish curry. Singapore ordered a recall of the same Everest mix as well, flagging high levels of ethylene oxide, which is unfit for human consumption and a cancer risk with long exposure. MDH and Everest products are hugely popular in India and also sold in Europe, Asia and North America, and the companies have said they are safe. Still, U.S. and Australian food authorities said they are gathering more information on the matter, and India had already ordered testing of the two brands' products. \"Each of the product sampled will be analysed for the compliance with quality and safety parameters,\" the Food Safety and Standards Authority of India said in a statement. The agency added checks would also be made for any presence of ethylene oxide, whose use is banned in India, and \"appropriate actions will be initiated as fit\" after testing was completed. India is the world's biggest exporter, producer and consumer of spices, and its domestic market for the products was valued at $10.44 billion in 2022, according to Zion Market Research. Beyond MDH and Everest, other major manufacturers include Madhusudan Masala, NHC Foods and consumer giants Tata Consumer Products and ITC. ","cleaned_content":"indias food safety regulator said on thursday it had ordered nationwide testing and inspections at all companies making spice mixes widening a crackdown on the sector as global regulators investigate contamination issues with two popular local brands hong kong last month suspended sales of three spice blends made by indias mdh and an everest spice mix for fish curry singapore ordered a recall of the same everest mix as well flagging high levels of ethylene oxide which is unfit for human consumption and a cancer risk with long exposure mdh and everest products are hugely popular in india and also sold in europe asia and north america and the companies have said they are safe still u s and australian food authorities said they are gathering more information on the matter and india had already ordered testing of the two brands products each of the product sampled will be analysed for the compliance with quality and safety parameters the food safety and standards authority of india said in a statement the agency added checks would also be made for any presence of ethylene oxide whose use is banned in india and appropriate actions will be initiated as fit after testing was completed india is the worlds biggest exporter producer and consumer of spices and its domestic market for the products was valued at \u003cONE_TEN\u003e billion in \u003cTWO_THOUSAND\u003e according to zion market research beyond mdh and everest other major manufacturers include madhusudan masala nhc foods and consumer giants tata consumer products and itc","timestamp":"2024-05-02T12:41:00+05:30","market_timestamp":"2024-05-02T12:41:00+05:30","off_market_hours":false}