{"url":"https://www.moneycontrol.com/news/business/kia-india-ties-up-with-map-my-india-12712916.html","title":"Kia India ties up with Map My India","description":"The platform's four-wheeler-specific points of interest search, spanning over 450 categories, enables easy discovery of vital services like dealerships and service centres, fuel stations, hospitals, hotels, restaurants, and more, the automaker said in a statement.Kia India ties up with Map My India","content":"Kia India on Thursday said it has tied up with Map My India to offer navigation solutions to its customers nationwide. The platform's four-wheeler-specific points of interest search, spanning over 450 categories, enables easy discovery of vital services like dealerships and service centres, fuel stations, hospitals, hotels, restaurants, and more, the automaker said in a statement. Moreover, drivers will enjoy speed limit alerts, real-time incident updates and voice-guided navigation support while driving, it added. \"Our collaboration with Map My India strengthens our positioning as a tech-forward brand dedicated to providing disruptive experiences to our new-age customers,\" Kia India Chief Sales Officer Myung-sik Sohn said. ","cleaned_content":"kia india on thursday said it has tied up with map my india to offer navigation solutions to its customers nationwide the platforms four wheeler specific points of interest search spanning over \u003cFOUR_HUNDRED\u003e categories enables easy discovery of vital services like dealerships and service centres fuel stations hospitals hotels restaurants and more the automaker said in a statement moreover drivers will enjoy speed limit alerts real time incident updates and voice guided navigation support while driving it added our collaboration with map my india strengthens our positioning as a tech forward brand dedicated to providing disruptive experiences to our new age customers kia india chief sales officer myung sik sohn said","timestamp":"2024-05-02T12:43:00+05:30","market_timestamp":"2024-05-02T12:43:00+05:30","off_market_hours":false}