{"url":"https://www.moneycontrol.com/news/technology/why-popcorn-is-expensive-pvr-inox-answers-as-it-pulls-out-all-stops-to-draw-in-more-crowd-12710363.html","title":"Why popcorn is expensive? PVR Inox answers as it pulls out all stops to draw in more crowd","description":"PVR Inox is running offers on food and beverages as well as movie tickets in a bid to increase footfalls at a time when admissions and occupancies are decreasing due to a weak content pipeline in theatres.PVR Inox has launched offers to make movie tickets as well as F\u0026B more affordable in their cinemas.  Related stories","content":"India's top multiplex chain PVR Inox is often asked two questions — why popcorn in their cinemas is expensive? And will movie ticket prices get cheaper? The company recently launched its ad-free content for the big screen amid decreasing footfalls which continue to be around 25-30 percent lower than pre-Covid levels. While the offer caught the attention of the cinema going audience, many said that it is the high cost of food and beverage (F\u0026B) as well as expensive movie tickets which is resulting in limited footfalls in their cinemas. One social media user said, \"Ads in movies were annoying, but I think the food cost is the main reason why people have reduced.\" When Moneycontrol raised people's concerns to PVR Inox, the company  listed down four points on what it is doing to change the perception of the expensive F\u0026B and movie tickets in their cinemas. The company last year started running the offer of free refills for popcorn and Pepsi. \"We have never refilled our hero products, which are popcorn and Pepsi. But we went ahead and did that to change the perception of people that F\u0026B is expensive in cinemas. So, there is unlimited refill for popcorn and Pepsi under a large combo available which if one buys they can fill up as many times as they want. People even fill it up on their way out of cinemas. For every one combo sold, we are getting 1.6 times refill on an average,\" Gautam Dutta PVR INOX, Co-CEO, said. Another offer the company is running is four to five items in every PVR Inox cinema available at flat Rs 99 from Monday to Thursday. Also read: PVR Inox to launch movie subscription plan to drive new audience in cinemas On July 12 last year PVR Inox announced a slash in prices of snacks at its counters, after a customer tweeted that the high F\u0026B prices at multiplexes had made movie-going unaffordable. Post-Covid F\u0026B prices have gone up by 30 percent as compared to the pre-Covid period. On the other hand, content quality is going down currently and this is hitting footfalls. Analysts point out that high F\u0026B prices are testing the affordability of the Indian consumer, overall affecting the frequency of cinemagoers. In the nine months of FY24, PVR Inox reported an 11 percent increase in F\u0026B  spend per head up to Rs 133 from Rs 120 during the same period in FY23. Revenue from the sale of food and beverages increased 22 percent in nine months of FY24 to Rs 1,545.2 crore from Rs 1,265.9 crore in FY23. Movie ticket offers: Passport, flash sale But what about movie tickets? They are expensive too. Dutta is betting big on movie passports, a type of subscription plan for the big screen content. It is available in two types — a monthly plan at Rs 349 valid Monday to Thursday allowing four visits to the cinema under which the cost of watching a movie in a theatre comes to about Rs 87 while the other is a quarterly plan at Rs 1,047 allowing 12 visits. \"Out of the five lakh footfalls coming in a month, I know that four lakh are coming because of the passport and the remaining one lakh would in any way have come. The additional 4 lakh admissions will have an impact on F\u0026B revenue and advertising in cinema. Also, this is taking away the pricing friction,\" Dutta said. As many as 1.5 lakh passports in its new version have been sold in three to four weeks. Last year in October the company launched passports for Rs 699 a month plan, offering 10 movies at Rs 70 each for weekdays. \"The first version of the passport we came up with was Rs 699 for 10 visits which was later revised because the consumer said that 10 times is too much. Last time, we sold 21,000 passports. This time, we have opened it for the south region as well. We have also brought in an add-on which lets a consumer upgrade the passport to a recliner for Rs 150 which will give access to formats like IMAX, 4DX, 3XL,\" said the Co-CEO, adding that plans like passports encourage consumers to come more often to cinemas. Also read: PVR Inox looks to drive up business of smaller films with movie passport launch Footfalls in PVR Inox increased 8 percent in the nine months of FY24 at 11.88 crore, up from 11 crore in FY23, according to the company's Q3 and 9M Fy24 investor presentation. Sales of movie tickets in FY24 increased 23 percent at Rs 2,644.6 crore from Rs 2,149.8 crore in FY23. The company is also running a flash sale for cinema tickets. \"We have branded it as a cinema lovers day and it offers a movie at Rs 99 on a Friday. We start advertising it on Thursday. This gives me four times more footfalls on a specific day. On average on a Friday I get about 3-4 lakh people, I can multiply that by 3.5-4 times due to the sale. We get 20 lakh admissions in a year by having about seven weeks of cinema lovers day promotion,\" he said. There has been an increase of around 10-15 percent in movie ticket prices over pre-Covid levels, according to experts tracking the cinema business. High movie ticket prices along with weak content has been a double whammy for the film industry. India most affordable for movies However, Dutta said that movie watching in India is the most affordable when compared to the western counterparts. \"In India for a chain like PVR Inox, the (movie ticket) pricing is $3 and you can go to at least 50 cinemas in various territories and watch a movie under Rs 150. Now, where in this entire world will you be able to watch a movie in an air conditioned environment for less than $2? asked Dutta, adding that international markets like the US and the UK are all operating at $14-18 for a movie ticket. When it comes to F\u0026B, Dutta said that when the core product which is film is kept under check then some items of the cinema business have to take the brunt of the rental, electricity, and employee costs. \"There are 24,000 employees in the company. My electricity cost each day is Rs 1 crore. The kind of repair and maintenance that is required with 10 lakh people coming into a cinema every time over the weekend imagine the wear and tear that happens on the seats, and ACs. The cinemas run 20 hours a day for 365 days. My projector costs more than Rs 2 lakh,\" he said. PVR Inox's rent cost increased 15 percent to Rs 893.5 crore in the nine months of FY24 from Rs 775.2 crore in FY23. Its cost of common area maintenance (CAM) also increased 15 percent to Rs 246.4 crore from Rs 213.6 crore in FY23. Times are tough today for the theatre business with a weak content lineup and product innovations have become the need of the hour. But PVR Inox plans to continue offers on movie tickets and F\u0026B even when the content lineup is good. \"The coming months will not be easy because of the content pipeline. But this is also a phase when we learn to adapt. 2025 will be an eventful year for Bollywood and Hollywood. And we will continue with these products even when the content lineup is good. We are already looking at newer versions of these products like how I can make a family passport. Every time we launch something, we study for 6-8 months to understand how the consumer has accepted it,\" Dutta said. ","cleaned_content":"indias top multiplex chain pvr inox is often asked two questions why popcorn in their cinemas is expensive and will movie ticket prices get cheaper the company recently launched its ad free content for the big screen amid decreasing footfalls which continue to be around \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e lower than pre covid levels while the offer caught the attention of the cinema going audience many said that it is the high cost of food and beverage f b as well as expensive movie tickets which is resulting in limited footfalls in their cinemas one social media user said ads in movies were annoying but i think the food cost is the main reason why people have reduced when moneycontrol raised peoples concerns to pvr inox the company listed down four points on what it is doing to change the perception of the expensive f b and movie tickets in their cinemas the company last year started running the offer of free refills for popcorn and pepsi we have never refilled our hero products which are popcorn and pepsi but we went ahead and did that to change the perception of people that f b is expensive in cinemas so there is unlimited refill for popcorn and pepsi under a large combo available which if one buys they can fill up as many times as they want people even fill it up on their way out of cinemas for every one combo sold we are getting \u003cONE_\u003e times refill on an average gautam dutta pvr inox co ceo said another offer the company is running is four to five items in every pvr inox cinema available at flat rs \u003cNINE_TEN\u003e from monday to thursday also read pvr inox to launch movie subscription plan to drive new audience in cinemas on july \u003cONE_TEN\u003e last year pvr inox announced a slash in prices of snacks at its counters after a customer tweeted that the high f b prices at multiplexes had made movie going unaffordable post covid f b prices have gone up by \u003cTHREE_TEN_PERCENT\u003e as compared to the pre covid period on the other hand content quality is going down currently and this is hitting footfalls analysts point out that high f b prices are testing the affordability of the indian consumer overall affecting the frequency of cinemagoers in the nine months of fy24 pvr inox reported an \u003cONE_TEN_PERCENT\u003e increase in f b spend per head up to rs \u003cONE_HUNDRED\u003e from rs \u003cONE_HUNDRED\u003e during the same period in fy23 revenue from the sale of food and beverages increased \u003cTWO_TEN_PERCENT\u003e in nine months of fy24 to rs \u003cONE_THOUSAND\u003e crore from rs \u003cONE_THOUSAND\u003e crore in fy23 movie ticket offers passport flash sale but what about movie tickets they are expensive too dutta is betting big on movie passports a type of subscription plan for the big screen content it is available in two types a monthly plan at rs \u003cTHREE_HUNDRED\u003e valid monday to thursday allowing four visits to the cinema under which the cost of watching a movie in a theatre comes to about rs \u003cEIGHT_TEN\u003e while the other is a quarterly plan at rs \u003cONE_THOUSAND\u003e allowing \u003cONE_TEN\u003e visits out of the five lakh footfalls coming in a month i know that four lakh are coming because of the passport and the remaining one lakh would in any way have come the additional \u003cFOUR_\u003e lakh admissions will have an impact on f b revenue and advertising in cinema also this is taking away the pricing friction dutta said as many as \u003cONE_\u003e lakh passports in its new version have been sold in three to four weeks last year in october the company launched passports for rs \u003cSIX_HUNDRED\u003e a month plan offering \u003cONE_TEN\u003e movies at rs \u003cSEVEN_TEN\u003e each for weekdays the first version of the passport we came up with was rs \u003cSIX_HUNDRED\u003e for \u003cONE_TEN\u003e visits which was later revised because the consumer said that \u003cONE_TEN\u003e times is too much last time we sold \u003cTWO_TEN_THOUSAND\u003e passports this time we have opened it for the south region as well we have also brought in an add on which lets a consumer upgrade the passport to a recliner for rs \u003cONE_HUNDRED\u003e which will give access to formats like imax \u003cFOUR_\u003e dx \u003cTHREE_\u003e xl said the co ceo adding that plans like passports encourage consumers to come more often to cinemas also read pvr inox looks to drive up business of smaller films with movie passport launch footfalls in pvr inox increased \u003cEIGHT_PERCENT\u003e in the nine months of fy24 at \u003cONE_TEN\u003e crore up from \u003cONE_TEN\u003e crore in fy23 according to the companys q3 and \u003cNINE_\u003e m fy24 investor presentation sales of movie tickets in fy24 increased \u003cTWO_TEN_PERCENT\u003e at rs \u003cTWO_THOUSAND\u003e crore from rs \u003cTWO_THOUSAND\u003e crore in fy23 the company is also running a flash sale for cinema tickets we have branded it as a cinema lovers day and it offers a movie at rs \u003cNINE_TEN\u003e on a friday we start advertising it on thursday this gives me four times more footfalls on a specific day on average on a friday i get about \u003cTHREE_\u003e \u003cFOUR_\u003e lakh people i can multiply that by \u003cTHREE_\u003e \u003cFOUR_\u003e times due to the sale we get \u003cTWO_TEN\u003e lakh admissions in a year by having about seven weeks of cinema lovers day promotion he said there has been an increase of around \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e in movie ticket prices over pre covid levels according to experts tracking the cinema business high movie ticket prices along with weak content has been a double whammy for the film industry india most affordable for movies however dutta said that movie watching in india is the most affordable when compared to the western counterparts in india for a chain like pvr inox the movie ticket pricing is \u003cTHREE_\u003e and you can go to at least \u003cFIVE_TEN\u003e cinemas in various territories and watch a movie under rs \u003cONE_HUNDRED\u003e now where in this entire world will you be able to watch a movie in an air conditioned environment for less than \u003cTWO_\u003e asked dutta adding that international markets like the us and the uk are all operating at \u003cONE_TEN\u003e \u003cONE_TEN\u003e for a movie ticket when it comes to f b dutta said that when the core product which is film is kept under check then some items of the cinema business have to take the brunt of the rental electricity and employee costs there are \u003cTWO_TEN_THOUSAND\u003e employees in the company my electricity cost each day is rs \u003cONE_\u003e crore the kind of repair and maintenance that is required with \u003cONE_TEN\u003e lakh people coming into a cinema every time over the weekend imagine the wear and tear that happens on the seats and acs the cinemas run \u003cTWO_TEN\u003e hours a day for \u003cTHREE_HUNDRED\u003e days my projector costs more than rs \u003cTWO_\u003e lakh he said pvr inoxs rent cost increased \u003cONE_TEN_PERCENT\u003e to rs \u003cEIGHT_HUNDRED\u003e crore in the nine months of fy24 from rs \u003cSEVEN_HUNDRED\u003e crore in fy23 its cost of common area maintenance cam also increased \u003cONE_TEN_PERCENT\u003e to rs \u003cTWO_HUNDRED\u003e crore from rs \u003cTWO_HUNDRED\u003e crore in fy23 times are tough today for the theatre business with a weak content lineup and product innovations have become the need of the hour but pvr inox plans to continue offers on movie tickets and f b even when the content lineup is good the coming months will not be easy because of the content pipeline but this is also a phase when we learn to adapt \u003cTWO_THOUSAND\u003e will be an eventful year for bollywood and hollywood and we will continue with these products even when the content lineup is good we are already looking at newer versions of these products like how i can make a family passport every time we launch something we study for \u003cSIX_\u003e \u003cEIGHT_\u003e months to understand how the consumer has accepted it dutta said","timestamp":"2024-04-29T14:42:00+05:30","market_timestamp":"2024-04-29T14:42:00+05:30","off_market_hours":false}