{"url":"https://www.moneycontrol.com/news/business/fy25-guidance-of-3-5-good-growth-in-current-environment-cloud-migration-genai-gaining-traction-hcltech-ceo-12710297.html","title":"FY25 guidance of 3-5% good growth in current environment; cloud migration, GenAI gaining traction: HCLTech CEO","description":"Vijayakumar told PTI in an interview that HCL Technologies (HCLTech) is keen on acquisitions in areas of semiconductor, automotive, and of platforms that drive strong annuity revenues or geographies such as Japan.FY25 guidance of 3-5% good growth in current environment; cloud migration, GenAI gaining traction: HCLTech CEORelated stories","content":"HCL Technologies' FY25 guidance of 3-5 per cent represents a \"good growth\" in current environment, CEO C Vijayakumar said, adding cloud migration and GenAI projects are gaining traction but financial services vertical could face 'headwinds'. Vijayakumar told PTI in an interview that HCL Technologies (HCLTech) is keen on acquisitions in areas of semiconductor, automotive, and of platforms that drive strong annuity revenues or geographies such as Japan. He asserted that the company is poised to capitalise on generative AI opportunities, and that 50,000 people are expected to be fully trained, leveraging GenAI, this year. The company reported nearly flat year-on-year net profit for March quarter at Rs 3,986 crore amid a global environment marred by weak client spends, geopolitical shocks, high inflation, and macroeconomic uncertainties. On a sequential basis the net profit was down 8.4 per cent. In the fourth quarter of FY24, the revenue from operations stood at Rs 28,499 crore, up 7.11 per cent from a year ago. For the full fiscal year (FY24), the company reported a 5.7 per cent rise in net profit to Rs 15,702 crore. The company posted Rs 1,09,913 crore in revenue in FY24, up 8.3 per cent from the previous fiscal. \"Across the industry there is good mix of revenue, which is coming from discretionary spending patterns of clients in this environment that is subdued, which will be visible in FY25. If things change sometime you will have a much better outcome, if things remain similar to what it was in FY24 then you will have subdued growth in FY25,\" Vijayakumar said. HCLTech's projected revenue growth of 3-5 per cent for FY25 is a \"good growth\" in current environment and probably highest guidance among the tier-one providers, according to Vijayakumar. Areas like cyber security, data, cloud migration to hyperscalers and building private AI stacks, all catalysed by GenAI are showing a good traction. Efficiency-driven programmes are being conduced in a timely-manner both in decision-making and timelines for execution. \"But some of the transformation programmes, I think customers are either taking a slightly slower pace or they're cutting down on some, pausing them for a few quarters or a few months, and then reinitiating it,\" he said. Technology, telecom and media verticals will continue to do well based on the bookings done, Vijayakumar said, but called out financial services as a space that could face some headwinds, after demonstrating a stellar growth for a couple of years. \"Financial services will have some headwinds now, because we've had a stellar growth for two years in financial services, significantly ahead of industry. So there will be some headwinds like some deals will transition to an offshore model. And then some deals like State Street...we have divested the JV...so that will have an impact on the revenue. So financial services will have these dynamics, but all other verticals will grow,\" he said. HCLTech added 2,700-plus employees in March quarter, which the top honcho said should not come as a surprise given the company's overall growth numbers. \"The headcount addition should not come as a surprise, because we had a good growth of 5.4 per cent (for FY24) in the current environment, so that obviously needs good talent to execute, and that's why our headcount is growing. And coming to FY25, of course, a lot will depend on how the year shapes up. At this point, we've planned at least 10,000 freshers to be hired during this year,\" he said. The lateral hiring numbers depend on how the year pans out. The US accounts for 64 per cent of the company's revenue and the company is very positive about outlook for the market. \"We've done very well. We've done 6.8 per cent growth in the US market and it continues to be a very strong geography, with good mindshare, presence in a lot of big clients. And so we are very positive about the outlook for US,\" he said. The company is well-equipped to capitalise on GenAI opportunities, and \"expects things to scale up\". \"In fact, we launched a platform called HCLTech AI Force. The platform helps end-to-end lifecycle of the software development and product engineering. So I think we're very well positioned,\" he said. He went on to add: \"We've got good talent, we have already trained a significant number of people, more than 25,000. This year, we expect at least 50,000 people will be fully trained, leveraging generative AI. We are focused on AI developer community, and already have 2,000-plus people who are focused in this area. And there are many small projects, which are all sub-USD 10 million,\" he said. On acquisitions, Vijayakumar said semiconductors, automotive, or platforms that drive strong annuity revenues with clients and geographies like Japan are areas where the company continues to look for buys. \"Yes, we have certain strategy on acquisitions in certain areas...Like we did a one in automotive a couple of quarters ago. We have some thinking in semiconductor, we have in some vertical capabilities, it will be small acquisitions...These are areas where we continue to look for acquisitions,\" he said. ","cleaned_content":"hcl technologies fy25 guidance of \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e represents a good growth in current environment ceo c vijayakumar said adding cloud migration and genai projects are gaining traction but financial services vertical could face headwinds vijayakumar told pti in an interview that hcl technologies hcltech is keen on acquisitions in areas of semiconductor automotive and of platforms that drive strong annuity revenues or geographies such as japan he asserted that the company is poised to capitalise on generative ai opportunities and that \u003cFIVE_TEN_THOUSAND\u003e people are expected to be fully trained leveraging genai this year the company reported nearly flat year on year net profit for march quarter at rs \u003cTHREE_THOUSAND\u003e crore amid a global environment marred by weak client spends geopolitical shocks high inflation and macroeconomic uncertainties on a sequential basis the net profit was down \u003cEIGHT_PERCENT\u003e in the fourth quarter of fy24 the revenue from operations stood at rs \u003cTWO_TEN_THOUSAND\u003e crore up \u003cSEVEN_PERCENT\u003e from a year ago for the full fiscal year fy24 the company reported a \u003cFIVE_PERCENT\u003e rise in net profit to rs \u003cONE_TEN_THOUSAND\u003e crore the company posted rs \u003cONE_HUNDRED_THOUSAND\u003e crore in revenue in fy24 up \u003cEIGHT_PERCENT\u003e from the previous fiscal across the industry there is good mix of revenue which is coming from discretionary spending patterns of clients in this environment that is subdued which will be visible in fy25 if things change sometime you will have a much better outcome if things remain similar to what it was in fy24 then you will have subdued growth in fy25 vijayakumar said hcltechs projected revenue growth of \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e for fy25 is a good growth in current environment and probably highest guidance among the tier one providers according to vijayakumar areas like cyber security data cloud migration to hyperscalers and building private ai stacks all catalysed by genai are showing a good traction efficiency driven programmes are being conduced in a timely manner both in decision making and timelines for execution but some of the transformation programmes i think customers are either taking a slightly slower pace or theyre cutting down on some pausing them for a few quarters or a few months and then reinitiating it he said technology telecom and media verticals will continue to do well based on the bookings done vijayakumar said but called out financial services as a space that could face some headwinds after demonstrating a stellar growth for a couple of years financial services will have some headwinds now because weve had a stellar growth for two years in financial services significantly ahead of industry so there will be some headwinds like some deals will transition to an offshore model and then some deals like state street we have divested the jv so that will have an impact on the revenue so financial services will have these dynamics but all other verticals will grow he said hcltech added \u003cTWO_THOUSAND\u003e plus employees in march quarter which the top honcho said should not come as a surprise given the companys overall growth numbers the headcount addition should not come as a surprise because we had a good growth of \u003cFIVE_PERCENT\u003e for fy24 in the current environment so that obviously needs good talent to execute and thats why our headcount is growing and coming to fy25 of course a lot will depend on how the year shapes up at this point weve planned at least \u003cONE_TEN_THOUSAND\u003e freshers to be hired during this year he said the lateral hiring numbers depend on how the year pans out the us accounts for \u003cSIX_TEN_PERCENT\u003e of the companys revenue and the company is very positive about outlook for the market weve done very well weve done \u003cSIX_PERCENT\u003e growth in the us market and it continues to be a very strong geography with good mindshare presence in a lot of big clients and so we are very positive about the outlook for us he said the company is well equipped to capitalise on genai opportunities and expects things to scale up in fact we launched a platform called hcltech ai force the platform helps end to end lifecycle of the software development and product engineering so i think were very well positioned he said he went on to add weve got good talent we have already trained a significant number of people more than \u003cTWO_TEN_THOUSAND\u003e this year we expect at least \u003cFIVE_TEN_THOUSAND\u003e people will be fully trained leveraging generative ai we are focused on ai developer community and already have \u003cTWO_THOUSAND\u003e plus people who are focused in this area and there are many small projects which are all sub usd \u003cONE_TEN\u003e million he said on acquisitions vijayakumar said semiconductors automotive or platforms that drive strong annuity revenues with clients and geographies like japan are areas where the company continues to look for buys yes we have certain strategy on acquisitions in certain areas like we did a one in automotive a couple of quarters ago we have some thinking in semiconductor we have in some vertical capabilities it will be small acquisitions these are areas where we continue to look for acquisitions he said","timestamp":"2024-04-29T10:52:00+05:30","market_timestamp":"2024-04-29T10:52:00+05:30","off_market_hours":false}