{"url":"https://www.moneycontrol.com/news/business/adb-open-to-funding-space-sector-in-india-vp-bhargav-dasgupta-12714062.html","title":"ADB open to funding space sector in India: VP Bhargav Dasgupta","description":"ADB has done some projects in satellite in the Asia Pacific region, but has not provided any assistance in the Indian space sector.ADB open to funding space sector in India: VP Bhargav DasguptaRelated stories","content":"The Asian Development Bank is open to funding the space sector in India in addition to focusing on climate finance to mitigate the associated risks, said its Vice President Bhargav Dasgupta on Friday. ADB has done some projects in satellite in the Asia Pacific region, but has not provided any assistance in the Indian space sector. \"We have not done much till now. We are always open to look at new areas...we understand it has been opened up and there is lot of interest on startup side...if we find alignment with our objectives in terms of Sustainable Development Goals (SDGs), we will look at it,\" he said. Talking about initiatives in India, Dasgupta said, \"we are very excited about the work that is happening in the country including recently launched rooftop solar projects, large solar projects, pump hydro, and battery storage. We are talking to many sponsors in these segment and we will be happy to see how many of them we can finance.\" Besides, he said there is a lot of interest in the corporate sector in energy transmission, conversion of older coal-fired power projects into green energy units. Dasgupta, former MD and CEO of ICICI Lombard, was appointed Vice President of ADB in September last year. He is responsible for management of ADB's Private Sector Operations Department and Office of Markets Development and Public Private Partnerships. ADB, established in 1966, is owned by 68 members, 49 from the region. It is committed to achieving a prosperous, inclusive, resilient, and sustainable Asia and the Pacific, while sustaining its efforts to eradicate extreme poverty. India, a founding member of ADB, is now ADB's fourth largest shareholder and its top borrower since 2010. ","cleaned_content":"the asian development bank is open to funding the space sector in india in addition to focusing on climate finance to mitigate the associated risks said its vice president bhargav dasgupta on friday adb has done some projects in satellite in the asia pacific region but has not provided any assistance in the indian space sector we have not done much till now we are always open to look at new areas we understand it has been opened up and there is lot of interest on startup side if we find alignment with our objectives in terms of sustainable development goals sdgs we will look at it he said talking about initiatives in india dasgupta said we are very excited about the work that is happening in the country including recently launched rooftop solar projects large solar projects pump hydro and battery storage we are talking to many sponsors in these segment and we will be happy to see how many of them we can finance besides he said there is a lot of interest in the corporate sector in energy transmission conversion of older coal fired power projects into green energy units dasgupta former md and ceo of icici lombard was appointed vice president of adb in september last year he is responsible for management of adbs private sector operations department and office of markets development and public private partnerships adb established in \u003cONE_THOUSAND\u003e is owned by \u003cSIX_TEN\u003e members \u003cFOUR_TEN\u003e from the region it is committed to achieving a prosperous inclusive resilient and sustainable asia and the pacific while sustaining its efforts to eradicate extreme poverty india a founding member of adb is now adbs fourth largest shareholder and its top borrower since \u003cTWO_THOUSAND\u003e","timestamp":"2024-05-03T14:41:00+05:30","market_timestamp":"2024-05-03T14:41:00+05:30","off_market_hours":false}