{"url":"https://www.moneycontrol.com/news/business/ge-td-india-gets-order-from-powergrid-to-set-up-transmission-asset-management-centre-in-odisha-12712164.html","title":"GE T\u0026D India gets order from Powergrid to set up transmission asset management centre in Odisha","description":"The centre will help Odisha Power Transmission Corporation Limited (OPTCL) to operate the grid through real-time monitoring and control. GE T\u0026D India gets order from Powergrid to set up transmission asset management centre in Odisha","content":"GE T\u0026D India on Wednesday said it has secured an order from Powergrid to set up a state transmission asset management centre (STAMC) in Odisha. The centre will help Odisha Power Transmission Corporation Limited (OPTCL) to operate the grid through real-time monitoring and control. It will help OPTCL to optimize grid operations, integrate renewable energy sources more effectively, GE T\u0026D India said in an exchange filing. \"GE T\u0026D India announces that it has secured orders from Power Grid Corporation of India to build a state transmission asset management centre in Odisha for OPTCL,\" the statement said. With the help of the project, the substations can be remotely controlled with advanced grid software solutions which will be installed at four locations across the state of Odisha. Unifying data from grid assets like substations and transmission lines is expected to enable the STAMC to provide more comprehensive situational awareness to OPTCL to make informed decisions to resolve incidents faster. ","cleaned_content":"ge t d india on wednesday said it has secured an order from powergrid to set up a state transmission asset management centre stamc in odisha the centre will help odisha power transmission corporation limited optcl to operate the grid through real time monitoring and control it will help optcl to optimize grid operations integrate renewable energy sources more effectively ge t d india said in an exchange filing ge t d india announces that it has secured orders from power grid corporation of india to build a state transmission asset management centre in odisha for optcl the statement said with the help of the project the substations can be remotely controlled with advanced grid software solutions which will be installed at four locations across the state of odisha unifying data from grid assets like substations and transmission lines is expected to enable the stamc to provide more comprehensive situational awareness to optcl to make informed decisions to resolve incidents faster","timestamp":"2024-05-01T16:57:00+05:30","market_timestamp":"2024-05-02T09:15:00+05:30","off_market_hours":true}