{"url":"https://www.moneycontrol.com/news/business/icici-securities-names-two-bankers-as-co-heads-of-ecm-business-12713510.html","title":"ICICI Securities names two bankers as co-heads of ECM business","description":"Gaurav Singhvi and Sarun Agarwal were named co-heads of the ECM business as of May 1, said the people, who asked not to be identified because the information is private. They replace Pratik Loonker, who left the firm to join rival Axis Capital Ltd., the people said.ICICI Securities names two bankers as co-heads of ECM businessRelated stories","content":"ICICI Bank Ltd. named two senior bankers to head the equity capital markets division of its investment banking unit, according to people familiar with the matter. Gaurav Singhvi and Sarun Agarwal were named co-heads of the ECM business as of May 1, said the people, who asked not to be identified because the information is private. They replace Pratik Loonker, who left the firm to join rival Axis Capital Ltd., the people said. A representative for ICICI declined to comment. Investment banks in India have seen a lot of hiring and movement of bankers amid a boom for initial public offerings in the country. ICICI plans 15 new hires in its investment banking division this year to beef up its mergers and acquisitions, private equity and fundraising practices, and another 15 in sales, trading and research, Bloomberg reported in January. On Thursday, the bank — India’s second-largest by market capitalization — denied a media report that Managing Director and Chief Executive Officer Sandeep Bakhshi wants to step down from his position. Elsewhere, JPMorgan’s India head of equity capital markets, Abhinav Bharti, has returned to the bank after initially handing in his notice in March with plans to join another lender, Bloomberg reported last month. Bharti, who was on gardening leave, agreed to rejoin JPMorgan after his intended replacement, Arvind Vashistha, decided to stay at Citigroup Inc. Unlike many other places, India’s IPO market has been robust. The country’s stock market value outpaced Hong Kong’s to become the fourth largest in the world in January. ICICI Securities ranked among the top 10 managers of equity and rights offerings in India in the first quarter of 2024, according to data compiled by Bloomberg. ","cleaned_content":"icici bank ltd named two senior bankers to head the equity capital markets division of its investment banking unit according to people familiar with the matter gaurav singhvi and sarun agarwal were named co heads of the ecm business as of may \u003cONE_\u003e said the people who asked not to be identified because the information is private they replace pratik loonker who left the firm to join rival axis capital ltd the people said a representative for icici declined to comment investment banks in india have seen a lot of hiring and movement of bankers amid a boom for initial public offerings in the country icici plans \u003cONE_TEN\u003e new hires in its investment banking division this year to beef up its mergers and acquisitions private equity and fundraising practices and another \u003cONE_TEN\u003e in sales trading and research bloomberg reported in january on thursday the bank india s second largest by market capitalization denied a media report that managing director and chief executive officer sandeep bakhshi wants to step down from his position elsewhere jpmorgan s india head of equity capital markets abhinav bharti has returned to the bank after initially handing in his notice in march with plans to join another lender bloomberg reported last month bharti who was on gardening leave agreed to rejoin jpmorgan after his intended replacement arvind vashistha decided to stay at citigroup inc unlike many other places india s ipo market has been robust the country s stock market value outpaced hong kong s to become the fourth largest in the world in january icici securities ranked among the top \u003cONE_TEN\u003e managers of equity and rights offerings in india in the first quarter of \u003cTWO_THOUSAND\u003e according to data compiled by bloomberg","timestamp":"2024-05-03T06:34:00+05:30","market_timestamp":"2024-05-03T09:15:00+05:30","off_market_hours":true}