{"url":"https://www.moneycontrol.com/news/business/npci-inks-pact-with-bank-of-namibia-for-developing-upi-like-instant-payment-system-12712914.html","title":"NPCI inks pact with Bank of Namibia for developing UPI-like instant payment system","description":"By leveraging technology and experiences from India's UPI, the partnership seeks to help Namibia modernize its financial ecosystem. This includes improving accessibility, affordability and connectivity with both domestic and international payment networks, and interoperability.NPCI inks pact with Bank of Namibia for developing UPI-like instant payment systemRelated stories","content":"NPCI on Thursday said its overseas arm has signed a pact with the Bank of Namibia (BoN) for developing a UPI-like instant payment system for Namibia. By leveraging technology and experiences from India's UPI, the partnership seeks to help Namibia modernize its financial ecosystem. This includes improving accessibility, affordability and connectivity with both domestic and international payment networks, and interoperability. NPCI International Payments Limited (NIPL) has signed an agreement with the Bank of Namibia (BoN) to support them in developing an instant payment system like Unified Payment Interface (UPI) for Namibia, a statement said. Through this collaboration, BoN will gain access to best-in-class technology and insights from NIPL, enabling the creation of a similar platform in Namibia for the digital welfare of its citizens, the statement added. NPCI International CEO Ritesh Shukla said, \"By enabling this technology, the country will gain sovereignty in the digital payments landscape and stand to benefit from enhanced payment interoperability and improved financial access for underserved populations.\" Bank of Namibia Governor Johannes Gawaxab said \"Our objective is to enhance accessibility and affordability for underserved populations, achieve full interoperability of payment instruments by 2025, modernize the financial sector, and ensure a secure and efficient National Payment System.\" Once live, the platform will facilitate digital transactions in Namibia, driving financial inclusion and reducing cash dependency by catering to underserved populations. This collaborative effort seeks to offer essential and affordable financial services to all, with a particular focus on rural and informal sectors. ","cleaned_content":"npci on thursday said its overseas arm has signed a pact with the bank of namibia bon for developing a upi like instant payment system for namibia by leveraging technology and experiences from indias upi the partnership seeks to help namibia modernize its financial ecosystem this includes improving accessibility affordability and connectivity with both domestic and international payment networks and interoperability npci international payments limited nipl has signed an agreement with the bank of namibia bon to support them in developing an instant payment system like unified payment interface upi for namibia a statement said through this collaboration bon will gain access to best in class technology and insights from nipl enabling the creation of a similar platform in namibia for the digital welfare of its citizens the statement added npci international ceo ritesh shukla said by enabling this technology the country will gain sovereignty in the digital payments landscape and stand to benefit from enhanced payment interoperability and improved financial access for underserved populations bank of namibia governor johannes gawaxab said our objective is to enhance accessibility and affordability for underserved populations achieve full interoperability of payment instruments by \u003cTWO_THOUSAND\u003e modernize the financial sector and ensure a secure and efficient national payment system once live the platform will facilitate digital transactions in namibia driving financial inclusion and reducing cash dependency by catering to underserved populations this collaborative effort seeks to offer essential and affordable financial services to all with a particular focus on rural and informal sectors","timestamp":"2024-05-02T12:39:00+05:30","market_timestamp":"2024-05-02T12:39:00+05:30","off_market_hours":false}