{"url":"https://www.moneycontrol.com/news/business/waaree-energies-secures-400-mw-modules-supply-order-in-gujarat-12710540.html","title":"Waaree Energies secures 400 MW modules supply order in Gujarat","description":"The modules are in the Approved List of Models and Manufacturers (ALMM) and range between 540 Wp to 570 Wp (Watt Peak), Waaree Energies said in a statement.Waaree Energies secures 400 MW modules supply order in Gujarat","content":"Waaree Energies on Monday said it has secured an order from Gujarat Industries Power Company for the supply of 400 MW modules. The modules are in the Approved List of Models and Manufacturers (ALMM) and range between 540 Wp to 570 Wp (Watt Peak), Waaree Energies said in a statement. The company has announced that it has received a Letter of Intent (LoI) from Gujarat Industries Power Company Limited (GIPCL) for a 400 MW module supply deal, the statement said. Hitesh Chimanlal Doshi, Chairman \u0026 Managing Director, Waaree Energies Limited, said, \"We are honoured to collaborate with GIPCL on this project. This initiative underscores our commitment to promote domestic manufacturing, generate employment, and support the nation's ambitious renewable energy targets while aiming to uphold the standards of excellence.\" Gujarat-based Waaree Energies is among India's largest manufacturers of solar PV modules with an aggregate installed capacity of 12 GW. ","cleaned_content":"waaree energies on monday said it has secured an order from gujarat industries power company for the supply of \u003cFOUR_HUNDRED\u003e mw modules the modules are in the approved list of models and manufacturers almm and range between \u003cFIVE_HUNDRED\u003e wp to \u003cFIVE_HUNDRED\u003e wp watt peak waaree energies said in a statement the company has announced that it has received a letter of intent loi from gujarat industries power company limited gipcl for a \u003cFOUR_HUNDRED\u003e mw module supply deal the statement said hitesh chimanlal doshi chairman managing director waaree energies limited said we are honoured to collaborate with gipcl on this project this initiative underscores our commitment to promote domestic manufacturing generate employment and support the nations ambitious renewable energy targets while aiming to uphold the standards of excellence gujarat based waaree energies is among indias largest manufacturers of solar pv modules with an aggregate installed capacity of \u003cONE_TEN\u003e gw","timestamp":"2024-04-29T13:22:00+05:30","market_timestamp":"2024-04-29T13:22:00+05:30","off_market_hours":false}