{"url":"https://www.moneycontrol.com/news/business/companies/fractional-ownership-platform-hbits-enters-pune-acquires-cybercity-magarpatta-campus-12708016.html","title":"Fractional ownership platform hBits enters Pune; acquires CyberCity Magarpatta campus","description":"The acquired campus houses a commercial zone, a shopping mall, multiple restaurants, two schools, residential neighbourhoods, a gymkhana and a large 25-acre serene park, the company said without divulging the deal size.The property is part of a 450-acre gated township with Grade A tenants like US-listed multinational giants Amdocs and AirProducts, it added. Representative image","content":"Fractional ownership platform hBits on Wednesday announced its entry in Pune, with the acquisition of the 44,328 square feet campus CyberCity Magarpatta. The acquired campus houses a commercial zone, a shopping mall, multiple restaurants, two schools, residential neighbourhoods, a gymkhana and a large 25-acre serene park, the company said without divulging the deal size. The property is part of a 450-acre gated township with Grade A tenants like US-listed multinational giants Amdocs and AirProducts, it added. Through this asset, hBits aims to create an investment opportunity worth Rs 55 crore, thereby democratizing access to Grade A commercial real estate for investors, it said. hBits also said that with this acquisition, the total assets under management (AUM) of the company now stands at around Rs 365 crore amid its plans to achieve an AUM of Rs 1,000 crore by this fiscal. According to hBits, the rental inflow and purchase price of the asset offers a gross entry yield of 9 per cent and an expected internal rate of return of 15.15 per cent. \"Over the years, Pune has emerged as a thriving hub for IT and IT-enabled services industry, besides being home to manufacturing and education companies. As Pune's commercial landscape flourishes, we are confident that the launch of our new asset will create significant investment opportunities for investors,\" said hBits founder-CEO Shiv Parekh. ","cleaned_content":"fractional ownership platform hbits on wednesday announced its entry in pune with the acquisition of the \u003cFOUR_TEN_THOUSAND\u003e square feet campus cybercity magarpatta the acquired campus houses a commercial zone a shopping mall multiple restaurants two schools residential neighbourhoods a gymkhana and a large \u003cTWO_TEN\u003e acre serene park the company said without divulging the deal size the property is part of a \u003cFOUR_HUNDRED\u003e acre gated township with grade a tenants like us listed multinational giants amdocs and airproducts it added through this asset hbits aims to create an investment opportunity worth rs \u003cFIVE_TEN\u003e crore thereby democratizing access to grade a commercial real estate for investors it said hbits also said that with this acquisition the total assets under management aum of the company now stands at around rs \u003cTHREE_HUNDRED\u003e crore amid its plans to achieve an aum of rs \u003cONE_THOUSAND\u003e crore by this fiscal according to hbits the rental inflow and purchase price of the asset offers a gross entry yield of \u003cNINE_PERCENT\u003e and an expected internal rate of return of \u003cONE_TEN_PERCENT\u003e over the years pune has emerged as a thriving hub for it and it enabled services industry besides being home to manufacturing and education companies as punes commercial landscape flourishes we are confident that the launch of our new asset will create significant investment opportunities for investors said hbits founder ceo shiv parekh","timestamp":"2024-04-25T13:39:00+05:30","market_timestamp":"2024-04-25T13:39:00+05:30","off_market_hours":false}