{"url":"https://www.moneycontrol.com/news/business/avaada-energy-secures-rs-1190-crore-loan-from-sbi-for-solar-project-12712820.html","title":"Avaada Energy secures Rs 1,190 crore loan from SBI for solar project","description":"The financing, sanctioned and disbursed as a 20-year project loan facility, will support the development of a 400 MWp utility-scale solar PV power project in the Surendra Nagar district of Gujarat, a company statement said.Avaada Energy secures Rs 1,190 crore loan from SBI for solar project","content":"Avaada Energy on Thursday said that it has secured Rs 1,190 crore loan for a new solar project in Gujarat from the State Bank of India. The financing, sanctioned and disbursed as a 20-year project loan facility, will support the development of a 400 MWp utility-scale solar PV power project in the Surendra Nagar district of Gujarat, a company statement said. Power generated from the project will be procured by Gujarat Urja Vikas Nigam Limited (GUVNL), an apex body of the government of Gujarat, engaged in the bulk purchase and sale of electricity. Vineet Mittal, Chairman of Avaada Group, said, \"We are delighted to strengthen our relationship with the State Bank of India through our project financing agreement.\" This strategic arrangement will enable the organisation to optimise its capital structure and simplify the ownership structure of its project subsidiaries, demonstrating Avaada's approach to managing and expanding its renewable asset base . ","cleaned_content":"avaada energy on thursday said that it has secured rs \u003cONE_THOUSAND\u003e crore loan for a new solar project in gujarat from the state bank of india the financing sanctioned and disbursed as a \u003cTWO_TEN\u003e year project loan facility will support the development of a \u003cFOUR_HUNDRED\u003e mwp utility scale solar pv power project in the surendra nagar district of gujarat a company statement said power generated from the project will be procured by gujarat urja vikas nigam limited guvnl an apex body of the government of gujarat engaged in the bulk purchase and sale of electricity vineet mittal chairman of avaada group said we are delighted to strengthen our relationship with the state bank of india through our project financing agreement this strategic arrangement will enable the organisation to optimise its capital structure and simplify the ownership structure of its project subsidiaries demonstrating avaadas approach to managing and expanding its renewable asset base","timestamp":"2024-05-02T11:30:00+05:30","market_timestamp":"2024-05-02T11:30:00+05:30","off_market_hours":false}