{"url":"https://www.moneycontrol.com/news/business/sanofi-introduces-diabetes-drug-soliqua-in-india-12711451.html","title":"Sanofi introduces diabetes drug Soliqua in India","description":"The company introduced the medication after receiving the marketing authorisation from the Central Drugs Standard Control Organization (CDSCO) earlier last year.Sanofi introduces diabetes drug Soliqua in India","content":"Sanofi India on Tuesday said it has launched its diabetes drug Soliqua in the country. The company introduced the medication after receiving the marketing authorisation from the Central Drugs Standard Control Organization (CDSCO) earlier last year. Soliqua is a once-daily injectable combination drug containing insulin, glargine 100 units/ml, which is a long-acting basal insulin and lixisenatide, a GLP-1 receptor agonist. \"The inclusion of Soliqua to our comprehensive diabetes portfolio (orals and injectables) eases therapy initiation, which helps those prescribed, keep their blood sugar in control more effectively,\" Sanofi India Head Diabetes Business Unit Cyrus Aibara said in a statement. Soliqua is indicated as a treatment in adults with obesity and type 2 diabetes mellitus, to improve glycemic control as an adjunct to diet and exercise, in those who are insufficiently controlled on oral or injectable therapies. ","cleaned_content":"sanofi india on tuesday said it has launched its diabetes drug soliqua in the country the company introduced the medication after receiving the marketing authorisation from the central drugs standard control organization cdsco earlier last year soliqua is a once daily injectable combination drug containing insulin glargine \u003cONE_HUNDRED\u003e units ml which is a long acting basal insulin and lixisenatide a glp \u003cONE_\u003e receptor agonist the inclusion of soliqua to our comprehensive diabetes portfolio orals and injectables eases therapy initiation which helps those prescribed keep their blood sugar in control more effectively sanofi india head diabetes business unit cyrus aibara said in a statement soliqua is indicated as a treatment in adults with obesity and type \u003cTWO_\u003e diabetes mellitus to improve glycemic control as an adjunct to diet and exercise in those who are insufficiently controlled on oral or injectable therapies","timestamp":"2024-04-30T12:45:00+05:30","market_timestamp":"2024-04-30T12:45:00+05:30","off_market_hours":false}