{"url":"https://www.moneycontrol.com/news/trends/it/lti-mindtree-q4-fy24-disappointing-quarter-improving-outlook-12707650.html","title":"LTI Mindtree Q4 FY24 – disappointing quarter, improving outlook","description":"The company is focusing on growth rather than margin gainsThanks to the stock’s underperformance following tepid result and outlook post Q3, the valuation is now beginning to turn reasonableRelated stories","content":"Highlights  Challenging quarter due to project cancellations Source: Company The company saw two project cancellations in the BFSI (banking, financial service \u0026 insurance) vertical as the client reprioritised spending. The revenue for the quarter at $1069.4 million exhibited a sequential decline of 1.3 percent both in reported currency as well as constant Currency (CC). In terms of industry, besides BFSI, manufacturing showed a sequential decline in Q4 due to higher pass-through revenue in the preceding quarter. All the three geographies of North America, Europe, and the Rest of the World were soft during the quarter.  Source: Company For FY24, revenue at $4.3 billon showed a growth of 4.4 percent in reported currency and 4.2 percent in Constant Currency. Guiding to a better Q1 The nature of the deals has changed from discretionary to long-term efficiency, leading to a divergence in the order wins and revenue growth so far. However, LTIM has seen quite a few large deal ramp-ups and expect revenue to be back on the growth path from Q1. Overall, FY24 was marred by lower discretionary spend and a decline in growth among its top 40 customers. Source: Company For FY24, order bookings at $5.6 billion were up 15 percent. The company alluded to having a good pipeline of cost takeout deals. Project cancellation impacted margin, improvement target pushed out LTIM reported a sequential decline of 70 basis points in operating margin, thanks to the 80 basis points hit coming from project cancellation and another 60 basis points from higher sales \u0026 marketing expenses and depreciation. These were partially offset by a positive impact of 70 basis points from the reversal of furloughs. As revenue picks up, in the absence of one-off, margins should gradually improve. However, the company would like to invest in the business for growth and is, therefore, pushing back achieving the intended margin band of 17-18 percent by a few more quarters. The supply-side challenges are waning with attrition stabilising around 14.4 percent. While the company added freshers in the quarter, net headcount addition declined. Given the elevated utilisation of 85 percent, we expect LTIM to start building up a bench to capture future growth. Thanks to the stock’s underperformance following tepid result and outlook post Q3, the valuation is now beginning to turn reasonable. Despite the big miss in the current quarter, we see limited stock downside and recommend a gradual accumulation. Source: Company, Moneycontrol Research Key risks: Severe macro challenges impacting technology budgets and orders ","cleaned_content":"highlights challenging quarter due to project cancellations source company the company saw two project cancellations in the bfsi banking financial service insurance vertical as the client reprioritised spending the revenue for the quarter at \u003cONE_THOUSAND\u003e million exhibited a sequential decline of \u003cONE_PERCENT\u003e both in reported currency as well as constant currency cc in terms of industry besides bfsi manufacturing showed a sequential decline in q4 due to higher pass through revenue in the preceding quarter all the three geographies of north america europe and the rest of the world were soft during the quarter source company for fy24 revenue at \u003cFOUR_\u003e billon showed a growth of \u003cFOUR_PERCENT\u003e in reported currency and \u003cFOUR_PERCENT\u003e in constant currency guiding to a better q1 the nature of the deals has changed from discretionary to long term efficiency leading to a divergence in the order wins and revenue growth so far however ltim has seen quite a few large deal ramp ups and expect revenue to be back on the growth path from q1 overall fy24 was marred by lower discretionary spend and a decline in growth among its top \u003cFOUR_TEN\u003e customers source company for fy24 order bookings at \u003cFIVE_\u003e billion were up \u003cONE_TEN_PERCENT\u003e the company alluded to having a good pipeline of cost takeout deals project cancellation impacted margin improvement target pushed out ltim reported a sequential decline of \u003cSEVEN_TEN\u003e basis points in operating margin thanks to the \u003cEIGHT_TEN\u003e basis points hit coming from project cancellation and another \u003cSIX_TEN\u003e basis points from higher sales marketing expenses and depreciation these were partially offset by a positive impact of \u003cSEVEN_TEN\u003e basis points from the reversal of furloughs as revenue picks up in the absence of one off margins should gradually improve however the company would like to invest in the business for growth and is therefore pushing back achieving the intended margin band of \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e by a few more quarters the supply side challenges are waning with attrition stabilising around \u003cONE_TEN_PERCENT\u003e while the company added freshers in the quarter net headcount addition declined given the elevated utilisation of \u003cEIGHT_TEN_PERCENT\u003e we expect ltim to start building up a bench to capture future growth thanks to the stock s underperformance following tepid result and outlook post q3 the valuation is now beginning to turn reasonable despite the big miss in the current quarter we see limited stock downside and recommend a gradual accumulation source company moneycontrol research key risks severe macro challenges impacting technology budgets and orders","timestamp":"2024-04-25T10:03:00+05:30","market_timestamp":"2024-04-25T10:03:00+05:30","off_market_hours":false}