{"url":"https://www.moneycontrol.com/news/business/ugro-capital-to-acquire-fintech-firm-myshubhlife-for-rs-45-crore-12713910.html","title":"Ugro Capital to acquire Fintech firm MyShubhLife for Rs 45 crore","description":"The board also approved raising equity capital of Rs 1,322 crore through Compulsory Convertible Debentures (CCD) and warrants. The equity fundraise is subject to shareholder approval.Ugro Capital to acquire Fintech firm MyShubhLife for Rs 45 croreRelated stories","content":"Non-banking company Ugro Capital on Thursday said its board has approved the acquisition of financial services platform MyShubhLife for an enterprise value of Rs 45 crore in a cash and equity deal. The board also approved raising equity capital of Rs 1,322 crore through Compulsory Convertible Debentures (CCD) and warrants. The equity fundraise is subject to shareholder approval. This capital raise received strong commitment from Samena Capital, one of the company's existing private equity investors, which committed Rs 500 crore through warrants, Ugro said. Ugro Capital is a datatech NBFC focused on MSME lending, while MSL specialises in offerings tailored for small shopkeepers and distributors. Distinguished by its unique products featuring daily and weekly installment options, along with an overdraft facility, MSL demonstrates robust underwriting and distribution capabilities, positioning it uniquely to deliver customised credit solutions to last-mile retailers and distributors, the statement added. The platform has already sourced over 15 million merchants through anchor partners involving consumer tech. It has already partnered with Pine Labs, Fino, Airtel Payments Bank, Mobikwik, Spice Money, and EasyPay, among others, for merchant financing. MSL was valued at Rs 240 crore when Gozo invested in Series B round. Its major investors include Gojo, Saama Capital IV Ltd, BEENEXT2 Pte Ltd, among others. ","cleaned_content":"non banking company ugro capital on thursday said its board has approved the acquisition of financial services platform myshubhlife for an enterprise value of rs \u003cFOUR_TEN\u003e crore in a cash and equity deal the board also approved raising equity capital of rs \u003cONE_THOUSAND\u003e crore through compulsory convertible debentures ccd and warrants the equity fundraise is subject to shareholder approval this capital raise received strong commitment from samena capital one of the companys existing private equity investors which committed rs \u003cFIVE_HUNDRED\u003e crore through warrants ugro said ugro capital is a datatech nbfc focused on msme lending while msl specialises in offerings tailored for small shopkeepers and distributors distinguished by its unique products featuring daily and weekly installment options along with an overdraft facility msl demonstrates robust underwriting and distribution capabilities positioning it uniquely to deliver customised credit solutions to last mile retailers and distributors the statement added the platform has already sourced over \u003cONE_TEN\u003e million merchants through anchor partners involving consumer tech it has already partnered with pine labs fino airtel payments bank mobikwik spice money and easypay among others for merchant financing msl was valued at rs \u003cTWO_HUNDRED\u003e crore when gozo invested in series b round its major investors include gojo saama capital iv ltd beenext2 pte ltd among others","timestamp":"2024-05-03T12:31:00+05:30","market_timestamp":"2024-05-03T12:31:00+05:30","off_market_hours":false}