{"url":"https://www.moneycontrol.com/news/business/tata-motors-ties-up-with-south-indian-bank-for-commercial-vehicle-finance-12710519.html","title":"Tata Motors ties up with South Indian Bank for commercial vehicle finance","description":"As part of the Memorandum of Understanding (MoU), South Indian Bank will offer financing solutions across the auto major's entire commercial vehicle portfolio, Tata Motors said in a statement.Tata Motors ties up with South Indian Bank for commercial vehicle finance","content":"Tata Motors on Monday said it has tied up with South Indian Bank to offer financing solutions to its commercial vehicle customers and dealerships. As part of the Memorandum of Understanding (MoU), South Indian Bank will offer financing solutions across the auto major's entire commercial vehicle portfolio, Tata Motors said in a statement. \"For our customers, easy access to financing solutions for their commercial vehicles is one of the key priorities for their operations. Our alliance aims to empower fleet owners and dealerships to achieve their business goals,\" Rajesh Kaul, Tata Motors Commercial Vehicles Vice President \u0026 Business Head Trucks, said. \"Our collaboration with Tata Motors enables us to deliver seamless vehicle financing solutions to commercial vehicle dealers and customers,\" South Indian Bank MD \u0026 CEO P R Seshadri said. ","cleaned_content":"tata motors on monday said it has tied up with south indian bank to offer financing solutions to its commercial vehicle customers and dealerships as part of the memorandum of understanding mou south indian bank will offer financing solutions across the auto majors entire commercial vehicle portfolio tata motors said in a statement for our customers easy access to financing solutions for their commercial vehicles is one of the key priorities for their operations our alliance aims to empower fleet owners and dealerships to achieve their business goals rajesh kaul tata motors commercial vehicles vice president business head trucks said our collaboration with tata motors enables us to deliver seamless vehicle financing solutions to commercial vehicle dealers and customers south indian bank md ceo p r seshadri said","timestamp":"2024-04-29T13:04:00+05:30","market_timestamp":"2024-04-29T13:04:00+05:30","off_market_hours":false}