{"url":"https://www.moneycontrol.com/news/business/apple-clinches-strong-double-digit-growth-in-india-ceo-tim-cook-says-incredibly-exciting-market-12713686.html","title":"Apple clinches strong double-digit growth in India; CEO Tim Cook says incredibly exciting market","description":"Describing India market as a \"major focus\", Cook said Apple is working on the entire ecosystem from developer to the market to operations, and that he is \"very pleased\" with the growth numbers.Apple clinches strong double-digit growth in India; CEO Tim Cook says incredibly exciting marketRelated stories","content":"Apple CEO Tim Cook on Friday said the company grew strong double-digit in India, clinching a new March quarter revenue record amid an \"incredibly exciting market\". Describing India market as a \"major focus\", Cook said Apple is working on the entire ecosystem from developer to the market to operations, and that he is \"very pleased\" with the growth numbers. \"We did grow strong double-digit (in India). And so we were very, very pleased about it. It was a new March quarter revenue record for us. As you know, as I've said before, I see it as an incredibly exciting market and it's a major focus for us,\" he said in India specific call-outs during the tech titan's Q2 earnings. The Cupertino-based iPhone maker has set revenue records in more than a dozen countries and regions. These include, among others, March quarter records in India, Latin America and the Middle East, as well as Canada, Spain, and Turkey. On Apple's India report card, Cook said the company has both operational things going on and go-to-market, alongside various initiatives. \"We just opened a couple of stores as last year, and we see enormous opportunity there,\" he said. Apple continues to expand its channels, and is also working on the developer ecosystem. \"And we've been very pleased that there is a rapidly-growing base of developers there. And so, we're working all of the entire ecosystem from developer to the market to operations, the whole thing. And I just -- I could not be more excited and enthusiastic about it,\" he said. Apple is also investing in new solar and wind power in the US and Europe, both to power its growing operations and users' devices. \"And we're working with partners in India and the US to replenish 100 per cent of the water we use in places that need it most, with the goal of delivering billions of gallons of water benefits over the next two decades,\" Cook said. Announcing its financial results for its fiscal 2024 second quarter ended March, Apple said it posted a quarterly revenue of USD 90.8 billion, down 4 per cent year on year. Luca Maestri, Senior Vice President and Chief Financial Officer of Apple, said the company is particularly pleased with strong momentum in emerging markets, \"as we set first-half revenue records in several countries and regions including Latin America, the Middle East, India, Indonesia, the Philippines, and Turkey\". ","cleaned_content":"apple ceo tim cook on friday said the company grew strong double digit in india clinching a new march quarter revenue record amid an incredibly exciting market describing india market as a major focus cook said apple is working on the entire ecosystem from developer to the market to operations and that he is very pleased with the growth numbers we did grow strong double digit in india and so we were very very pleased about it it was a new march quarter revenue record for us as you know as ive said before i see it as an incredibly exciting market and its a major focus for us he said in india specific call outs during the tech titans q2 earnings the cupertino based iphone maker has set revenue records in more than a dozen countries and regions these include among others march quarter records in india latin america and the middle east as well as canada spain and turkey on apples india report card cook said the company has both operational things going on and go to market alongside various initiatives we just opened a couple of stores as last year and we see enormous opportunity there he said apple continues to expand its channels and is also working on the developer ecosystem and weve been very pleased that there is a rapidly growing base of developers there and so were working all of the entire ecosystem from developer to the market to operations the whole thing and i just i could not be more excited and enthusiastic about it he said apple is also investing in new solar and wind power in the us and europe both to power its growing operations and users devices and were working with partners in india and the us to replenish \u003cONE_HUNDRED_PERCENT\u003e of the water we use in places that need it most with the goal of delivering billions of gallons of water benefits over the next two decades cook said announcing its financial results for its fiscal \u003cTWO_THOUSAND\u003e second quarter ended march apple said it posted a quarterly revenue of usd \u003cNINE_TEN\u003e billion down \u003cFOUR_PERCENT\u003e year on year luca maestri senior vice president and chief financial officer of apple said the company is particularly pleased with strong momentum in emerging markets as we set first half revenue records in several countries and regions including latin america the middle east india indonesia the philippines and turkey","timestamp":"2024-05-03T10:16:00+05:30","market_timestamp":"2024-05-03T10:16:00+05:30","off_market_hours":false}