{"url":"https://www.moneycontrol.com/news/business/new-zealand-looking-into-indian-spice-brands-over-contamination-12722641.html","title":"New Zealand investigating top Indian spice brands over contamination","description":"MDH on April 28, assured consumers that its products are entirely safe and refuted the accusations made by food regulators in Hong Kong and Singapore of pesticide presence in certain items.Regulators in India have inspected MDH and Everest plants and sent samples for testing after the global scrutiny, though the results have not yet been made public.Related stories","content":"New Zealand's food safety regulator on May 15 said it is investigating possible contamination in spice products of top Indian brands MDH and Everest after they faced scrutiny in other countries. The United States and Australia have also been looking into contamination after Hong Kong suspended sales of three spice blends of MDH and one of Everest in April, saying they contained high levels of a cancer-causing pesticide, ethylene oxide. Singapore ordered a recall of the Everest spice mix. MDH on April 28, assured consumers that its products are entirely safe and refuted the accusations made by food regulators in Hong Kong and Singapore of pesticide presence in certain items. \"Ethylene oxide is a chemical known to cause cancer in humans, and its use for food sterilisation has been phased out in New Zealand and other countries. As MDH and Everest spices are also available in New Zealand, we are looking into this issue,\" said Jenny Bishop, the regulator's acting deputy director general. Regulators in India have inspected MDH and Everest plants and sent samples for testing after the global scrutiny, though the results have not yet been made public. The inspections aim to evaluate whether the products sold by these companies adhere to the standards established by FSSAI, sources revealed to CNBC-TV18. Speaking anonymously, a senior Indian official told Reuters that the inspections will specifically target the presence of ethylene oxide, a pesticide deemed unfit for human consumption and associated with long-term cancer risks. Also Read | Explainer: Why are top Indian spices in a pickle abroad? MDH and Everest Group are known for their dominance in Indian cuisine both domestically and internationally, including markets in the US, Europe, the Middle East, and the UK. MDH has since 2021 also seen an average 14.5 percent of its US shipments rejected over the presence of bacteria salmonella, a Reuters analysis of U.S. Food and Drug Administration data has found. With agency inputs ","cleaned_content":"new zealands food safety regulator on may \u003cONE_TEN\u003e said it is investigating possible contamination in spice products of top indian brands mdh and everest after they faced scrutiny in other countries the united states and australia have also been looking into contamination after hong kong suspended sales of three spice blends of mdh and one of everest in april saying they contained high levels of a cancer causing pesticide ethylene oxide singapore ordered a recall of the everest spice mix mdh on april \u003cTWO_TEN\u003e assured consumers that its products are entirely safe and refuted the accusations made by food regulators in hong kong and singapore of pesticide presence in certain items ethylene oxide is a chemical known to cause cancer in humans and its use for food sterilisation has been phased out in new zealand and other countries as mdh and everest spices are also available in new zealand we are looking into this issue said jenny bishop the regulators acting deputy director general regulators in india have inspected mdh and everest plants and sent samples for testing after the global scrutiny though the results have not yet been made public the inspections aim to evaluate whether the products sold by these companies adhere to the standards established by fssai sources revealed to cnbc tv18 speaking anonymously a senior indian official told reuters that the inspections will specifically target the presence of ethylene oxide a pesticide deemed unfit for human consumption and associated with long term cancer risks also read explainer why are top indian spices in a pickle abroad mdh and everest group are known for their dominance in indian cuisine both domestically and internationally including markets in the us europe the middle east and the uk mdh has since \u003cTWO_THOUSAND\u003e also seen an average \u003cONE_TEN_PERCENT\u003e of its us shipments rejected over the presence of bacteria salmonella a reuters analysis of u s food and drug administration data has found with agency inputs","timestamp":"2024-05-15T12:54:00+05:30","market_timestamp":"2024-05-15T12:54:00+05:30","off_market_hours":false}