{"url":"https://www.moneycontrol.com/news/business/piramal-group-arm-invests-rs-600-crore-in-microlender-annapurna-finance-12721556.html","title":"Piramal Group arm invests Rs 600 crore in microlender Annapurna Finance","description":"The investment includes a secondary stake buy from an existing shareholder and also providing it with the non-core tier-II capital, a company statement said.Piramal Group arm invests Rs 600 crore in microlender Annapurna Finance","content":"Piramal Alternatives on Monday announced a Rs 600 crore investment for an undisclosed stake in microfinance company Annapurna Finance. The investment includes a secondary stake buy from an existing shareholder and also providing it with the non-core tier-II capital, a company statement said. It did not specify the stake bought or share a break-up of how the Rs 600 crore investment amount is divided. Odisha-headquartered Annapurna had an AUM of USD 1.25 billion as of March 31, 2024. It has a presence through 1,372 branches in 20 states and also lends to small micro, small and medium businesses. \"Microfinance as a retail asset class has grown at a CAGR (compound annual growth rate) of 32 per cent over the last decade and is expected to continue the high growth trajectory,\" Kalpesh Kikani, the chief executive officer of Piramal Alternatives, said. Annapurna Finance managing director and chief executive officer Gobinda Chandra Pattanaik said the growth capital from Piramal will help in business diversification and consolidating position in key markets. ","cleaned_content":"piramal alternatives on monday announced a rs \u003cSIX_HUNDRED\u003e crore investment for an undisclosed stake in microfinance company annapurna finance the investment includes a secondary stake buy from an existing shareholder and also providing it with the non core tier ii capital a company statement said it did not specify the stake bought or share a break up of how the rs \u003cSIX_HUNDRED\u003e crore investment amount is divided odisha headquartered annapurna had an aum of usd \u003cONE_\u003e billion as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e it has a presence through \u003cONE_THOUSAND\u003e branches in \u003cTWO_TEN\u003e states and also lends to small micro small and medium businesses microfinance as a retail asset class has grown at a cagr compound annual growth rate of \u003cTHREE_TEN_PERCENT\u003e over the last decade and is expected to continue the high growth trajectory kalpesh kikani the chief executive officer of piramal alternatives said annapurna finance managing director and chief executive officer gobinda chandra pattanaik said the growth capital from piramal will help in business diversification and consolidating position in key markets","timestamp":"2024-05-14T10:52:00+05:30","market_timestamp":"2024-05-14T10:52:00+05:30","off_market_hours":false}