{"url":"https://www.moneycontrol.com/news/business/zydus-lifesciences-inks-licensing-supply-pact-with-msn-for-generic-cancer-drug-in-us-market-12724895.html","title":"Zydus Lifesciences inks licensing, supply pact with MSN for generic cancer drug in US market","description":"The company's wholly-owned subsidiary, Zydus Lifesciences Global FZE, has entered into an exclusive licensing and supply agreement with MSN Laboratories for Cabozantinib tablets for the US market, Zydus Lifesciences Ltd said in a regulatory filing.Zydus Lifesciences inks licensing, supply pact with MSN for generic cancer drug in US marketRelated stories","content":"Zydus Lifesciences Ltd on Friday announced an exclusive licensing and supply agreement with MSN Laboratories for generic cancer treatment drug Cabozantinib tablets, for the US market. The company's wholly-owned subsidiary, Zydus Lifesciences Global FZE, has entered into an exclusive licensing and supply agreement with MSN Laboratories for Cabozantinib tablets for the US market, Zydus Lifesciences Ltd said in a regulatory filing. Cabozantinib tablet is the generic version of CABOMETYX of Exelixis. Zydus will exclusively market, distribute, and sell the product in the US market, it added. \"MSN was a first sole ANDA (abbreviated new drug application) applicant for Cabozantinib tablets, to submit a substantially complete ANDA with a paragraph IV certification and therefore may be eligible for 180 days of generic drug exclusivity for the generic version of CABOMETYX, \" Zydus Lifesciences said. Commenting on the partnership, Zydus Lifesciences Managing Director Sharvil Patel said it underscores the company's commitment to provide patients with access to high-quality, affordable medications. \"Cabozantinib tablets are an important treatment option for many cancer patients, and we are pleased to work with MSN to bring the generic version of CABOMETYX to the US market,\" Patel added. MSN Group Chairman \u0026 Founder Managing Director MSN Reddy said, bringing Cabozantinib tablets to market represents another example of MSN's global development, manufacturing, and regulatory expertise. \"We are confident that working with Zydus will allow us to successfully commercialise Cabozantinib, while advancing our mission of enabling access to high quality, affordable medicines,\" Reddy added. Zydus Lifesciences said the total addressable market opportunity of Cabozantinib Tablets in the US is approximately USD 1,464 million as per IQVIA MAT March 2024 data. ","cleaned_content":"zydus lifesciences ltd on friday announced an exclusive licensing and supply agreement with msn laboratories for generic cancer treatment drug cabozantinib tablets for the us market the companys wholly owned subsidiary zydus lifesciences global fze has entered into an exclusive licensing and supply agreement with msn laboratories for cabozantinib tablets for the us market zydus lifesciences ltd said in a regulatory filing cabozantinib tablet is the generic version of cabometyx of exelixis zydus will exclusively market distribute and sell the product in the us market it added msn was a first sole anda abbreviated new drug application applicant for cabozantinib tablets to submit a substantially complete anda with a paragraph iv certification and therefore may be eligible for \u003cONE_HUNDRED\u003e days of generic drug exclusivity for the generic version of cabometyx zydus lifesciences said commenting on the partnership zydus lifesciences managing director sharvil patel said it underscores the companys commitment to provide patients with access to high quality affordable medications cabozantinib tablets are an important treatment option for many cancer patients and we are pleased to work with msn to bring the generic version of cabometyx to the us market patel added msn group chairman founder managing director msn reddy said bringing cabozantinib tablets to market represents another example of msns global development manufacturing and regulatory expertise we are confident that working with zydus will allow us to successfully commercialise cabozantinib while advancing our mission of enabling access to high quality affordable medicines reddy added zydus lifesciences said the total addressable market opportunity of cabozantinib tablets in the us is approximately usd \u003cONE_THOUSAND\u003e million as per iqvia mat march \u003cTWO_THOUSAND\u003e data","timestamp":"2024-05-17T11:33:00+05:30","market_timestamp":"2024-05-17T11:33:00+05:30","off_market_hours":false}