{"url":"https://www.moneycontrol.com/news/business/blackrock-bullish-on-india-seeks-to-grow-government-bond-etf-share-12722474.html","title":"BlackRock bullish on India, seeks to grow government bond ETF share","description":"These bonds, which have been placed under a Fully Accessible Route (FAR) and have no foreign investment limits, will be included in JPMorgan's emerging market debt index starting June and have been drawing interest from foreign money managers.BlackRock bullish on India, seeks to grow government bond ETF shareRelated stories","content":"BlackRock Inc, the world's largest fund manager, is looking to raise its share in India's $500 billion pool of fully investible government bonds via recently launched exchange traded funds (ETFs), a fixed income strategist at the firm said. These bonds, which have been placed under a Fully Accessible Route (FAR) and have no foreign investment limits, will be included in JPMorgan's emerging market debt index starting June and have been drawing interest from foreign money managers. Globally, ETFs hold about 2% of outstanding bonds, said Hui Sien Koay, lead index, fixed income strategist for APAC at BlackRock, in an interview with Reuters on Wednesday. \"If we consider that as a barometer, and the total (India) FAR bond market size, it stands at around $500 billion, which is our opportunity set, and if we consider 2% of that, it would be a realistic commercial goal for us (as an industry),\" she said. BlackRock launched its India bond ETF in February and currently has $26 million of assets under management in this fund. The ETF has the cheapest fee among peers, with a weighted average yield of 7.14%, according to latest disclosures. BlackRock has expertise in \"tricky markets\" like India and helps investors work through issues such as trade execution and minimisation of tax, said Koay. \"I think we do have an edge due to this.\" India's entry into global bond indices was discussed for nearly a decade but issues such restrictions on foreign investors and local taxation delayed it. Over the next eight months, Indian bonds will be included in JPMorgan and Bloomberg's emerging market debt indices, but the FTSE Russell is yet to include domestic bonds. The inclusion comes against a favorable macroeconomic backdrop with the Indian economy seeing high growth, a stable currency and relatively higher yields. India \"stands out\" with yields higher than any other BBB-rated country, Koay said. \"Since the rupee has been relatively stable, we are quite sanguine about it, because it has got a lot of tailwinds, so we are bullish for now (on India),\" she said. BlackRock is drawing investors using marketing campaigns offering investment options across asset classes. \"The marketing campaign is focused on India as one of the main priority themes for this year,\" Koay said. ","cleaned_content":"blackrock inc the worlds largest fund manager is looking to raise its share in indias \u003cFIVE_HUNDRED\u003e billion pool of fully investible government bonds via recently launched exchange traded funds etfs a fixed income strategist at the firm said these bonds which have been placed under a fully accessible route far and have no foreign investment limits will be included in jpmorgans emerging market debt index starting june and have been drawing interest from foreign money managers globally etfs hold about \u003cTWO_PERCENT\u003e of outstanding bonds said hui sien koay lead index fixed income strategist for apac at blackrock in an interview with reuters on wednesday if we consider that as a barometer and the total india far bond market size it stands at around \u003cFIVE_HUNDRED\u003e billion which is our opportunity set and if we consider \u003cTWO_PERCENT\u003e of that it would be a realistic commercial goal for us as an industry she said blackrock launched its india bond etf in february and currently has \u003cTWO_TEN\u003e million of assets under management in this fund the etf has the cheapest fee among peers with a weighted average yield of \u003cSEVEN_PERCENT\u003e according to latest disclosures blackrock has expertise in tricky markets like india and helps investors work through issues such as trade execution and minimisation of tax said koay i think we do have an edge due to this indias entry into global bond indices was discussed for nearly a decade but issues such restrictions on foreign investors and local taxation delayed it over the next eight months indian bonds will be included in jpmorgan and bloombergs emerging market debt indices but the ftse russell is yet to include domestic bonds the inclusion comes against a favorable macroeconomic backdrop with the indian economy seeing high growth a stable currency and relatively higher yields india stands out with yields higher than any other bbb rated country koay said since the rupee has been relatively stable we are quite sanguine about it because it has got a lot of tailwinds so we are bullish for now on india she said blackrock is drawing investors using marketing campaigns offering investment options across asset classes the marketing campaign is focused on india as one of the main priority themes for this year koay said","timestamp":"2024-05-15T11:02:00+05:30","market_timestamp":"2024-05-15T11:02:00+05:30","off_market_hours":false}