{"url":"https://www.moneycontrol.com/news/business/lupin-appoints-jeffrey-kindler-alfonso-chito-zulueta-as-independent-directors-12718260.html","title":"Lupin appoints Jeffrey Kindler, Alfonso 'Chito' Zulueta as Independent directors","description":"Kindler is currently the CEO of Centrexion Therapeutics, a privately-held biotechnology company, Senior Advisor to Blackstone, Operating Partner at ARTIS Ventures and Global Chair of GLG Institute, Lupin said in a regulatory filing.Lupin appoints Jeffrey Kindler, Alfonso 'Chito' Zulueta as Independent directorsRelated stories","content":"Pharma major Lupin Ltd on Thursday announced appointments of ex-Pfizer Chairman and CEO, Jeffrey Kindler and Alfonso 'Chito' Zulueta as independent directors on its board. Kindler is currently the CEO of Centrexion Therapeutics, a privately-held biotechnology company, Senior Advisor to Blackstone, Operating Partner at ARTIS Ventures and Global Chair of GLG Institute, Lupin said in a regulatory filing. He brings over four decades of business experience holding leadership positions at some of the world's most recognised companies, including Pfizer, where he served as Chairman \u0026 Chief Executive Officer, as well as McDonald's Corporation and General Electric Company, the company added. Zulueta currently serves as Non-Executive Chairman of the board of directors of Interpharma Investments Ltd, the holding company of Zuellig Pharma, one of the largest healthcare services groups in Asia, Lupin said. He is also President \u0026 CEO of CZ Ventures, a company focused on start-up investments, and member of the board of directors at Glooko, CTS Corporation, and Bridge PayDay Solutions. He spent over three decades in various roles of increasing responsibility with Eli Lilly and Company, it added. \"Their extensive experience in building healthcare institutions, strategic perspectives of our industry and deep understanding of the evolving global pharmaceutical landscape, will enable us to advance our growth plans in the years to come,\" Lupin CEO, Vinita Gupta said. ","cleaned_content":"pharma major lupin ltd on thursday announced appointments of ex pfizer chairman and ceo jeffrey kindler and alfonso chito zulueta as independent directors on its board kindler is currently the ceo of centrexion therapeutics a privately held biotechnology company senior advisor to blackstone operating partner at artis ventures and global chair of glg institute lupin said in a regulatory filing he brings over four decades of business experience holding leadership positions at some of the worlds most recognised companies including pfizer where he served as chairman chief executive officer as well as mcdonalds corporation and general electric company the company added zulueta currently serves as non executive chairman of the board of directors of interpharma investments ltd the holding company of zuellig pharma one of the largest healthcare services groups in asia lupin said he is also president ceo of cz ventures a company focused on start up investments and member of the board of directors at glooko cts corporation and bridge payday solutions he spent over three decades in various roles of increasing responsibility with eli lilly and company it added their extensive experience in building healthcare institutions strategic perspectives of our industry and deep understanding of the evolving global pharmaceutical landscape will enable us to advance our growth plans in the years to come lupin ceo vinita gupta said","timestamp":"2024-05-09T12:55:00+05:30","market_timestamp":"2024-05-09T12:55:00+05:30","off_market_hours":false}