{"url":"https://www.moneycontrol.com/news/business/norway-wealth-fund-blacklists-adani-ports-citing-ties-to-war-12723699.html","title":"Norway wealth fund blacklists Adani Ports citing ties to war","description":"Norges Bank Investment Management, which manages the fund, announced the decision in a statement late on Wednesday.Norway wealth fund blacklists Adani Ports citing ties to warRelated stories","content":"Norway’s $1.7 trillion sovereign wealth fund has decided to exclude Adani Ports \u0026 Special Economic Zone Ltd. from its portfolio, citing “unacceptable” risks that the company is tied to human rights violations in war and conflict zones. Norges Bank Investment Management, which manages the fund, announced the decision in a statement late on Wednesday. The investor is also excluding US-based L3Harris Technolgies Inc., which develops components for nuclear weapons, and China’s Weichai Power Co., based on concerns it’s contributing to the sale of military equipment to Russia and Belarus. The decision follows recommendations late last year from Norway’s Council on Ethics, which advises the Oslo-based fund. “In a situation in which extremely serious norm violations are taking place, this constitutes an unacceptable risk,” the Council on Ethics said. NBIM responded to a request for comment by referring to the recommendations from the Council on Ethics. The three companies affected by the exclusions didn’t immediately respond to requests for comment. Aerospace and defense firms, as well as suppliers, have traditionally been widely shunned by ESG investors. Russia’s invasion of Ukraine — and the huge gains in the stocks that followed — have more recently led some portfolio managers to reconsider the sector. As of late last year, more than 1,000 ESG funds held stocks in the sector, a roughly 25% increase since Russia’s invasion. To be sure, most ESG fund managers continue to avoid such stocks. At the end of 2023, NBIM owned a 0.79% stake in L3Harris, 0.24% in Adani Ports and 0.13% of Weichai Power. Shares of Adani Ports climbed as much as 2.2% in early trading in Mumbai. ","cleaned_content":"norway s \u003cONE_\u003e trillion sovereign wealth fund has decided to exclude adani ports special economic zone ltd from its portfolio citing unacceptable risks that the company is tied to human rights violations in war and conflict zones norges bank investment management which manages the fund announced the decision in a statement late on wednesday the investor is also excluding us based l3harris technolgies inc which develops components for nuclear weapons and china s weichai power co based on concerns it s contributing to the sale of military equipment to russia and belarus the decision follows recommendations late last year from norway s council on ethics which advises the oslo based fund in a situation in which extremely serious norm violations are taking place this constitutes an unacceptable risk the council on ethics said nbim responded to a request for comment by referring to the recommendations from the council on ethics the three companies affected by the exclusions didn t immediately respond to requests for comment aerospace and defense firms as well as suppliers have traditionally been widely shunned by esg investors russia s invasion of ukraine and the huge gains in the stocks that followed have more recently led some portfolio managers to reconsider the sector as of late last year more than \u003cONE_THOUSAND\u003e esg funds held stocks in the sector a roughly \u003cTWO_TEN_PERCENT\u003e increase since russia s invasion to be sure most esg fund managers continue to avoid such stocks at the end of \u003cTWO_THOUSAND\u003e nbim owned a \u003cZERO_PERCENT\u003e stake in l3harris \u003cZERO_PERCENT\u003e in adani ports and \u003cZERO_PERCENT\u003e of weichai power shares of adani ports climbed as much as \u003cTWO_PERCENT\u003e in early trading in mumbai","timestamp":"2024-05-16T13:11:00+05:30","market_timestamp":"2024-05-16T13:11:00+05:30","off_market_hours":false}