{"url":"https://www.moneycontrol.com/technology/zees-largest-amount-of-rationalization-in-ott-tech-business-said-md-punit-goenka-article-12725748.html","title":"Zee's largest amount of rationalization in OTT tech business, said MD Punit Goenka","description":"In March, the company trimmed its Technology \u0026 Innovation Centre's (TIC) workforce by around 50 percent.After the merger failing with Sony, Zee has been taking steps to rationalize its workforce. Related stories","content":"The largest amount of rationalization has been in Zee's technology part of over the top (OTT) platform business, said company's MD and CEO Punit Goenka. The company saw employee layoffs as well as senior level exits in the last few months in the aftermath of the failed merger with Sony which was terminated by the latter earlier this year. Goenka since then has been focusing on cutting down cost and has been rationalizing workforce across verticals. \"We believe that our (OTT) platform is built to compete in the market with the best form. There can be improvements but we didn't need this level of people. We are confident that the team that remains is capable of taking the growth plans forward, Goenka said during the Q4 FY24 earnings call. \"The last few months have been intense as we took several tough decisions in the interest of the company. We have streamlined a strong team across the business. In line with the lateral structure implemented by the company we have entrusted several of our talented team members with higher levels of responsibilities to encourage more cross functional collaboration, quick decision making and ideation,\" the MD said. In March, the company trimmed its Technology \u0026 Innovation Centre's (TIC) workforce by around 50 percent. A month later, the company said in a regulatory filing that in line with Goenka's overall strategic approach, he has \"initiated the process of rationalization of the workforce by 15 percent, that will prune the staff strength across the company to arrive at a streamlined team that is sharply focused on the set goals for the future.\" Among senior level exits, Rahul Johri, who led the revenue and monetization vertical, resigned from the in March, followed by the exit of Nitin Mittal, President, Technology and Data at Zee Entertainment in the same month. Zee, which went through a termination process of the mega $10 billion merger with Sony Pictures Networks India after around two years of talks, had also announced that its revenue vertical will directly report to Goenka. The board of Zee had institutionalised a structured Monthly Management Mentorship (3M) Program in March. The objective of the 3M Program is to guide and enable the management team to achieve key performance metrics, including the targeted 20 percent EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margin, proposed by the MD \u0026 CEO, said Zee. The company on May 17 reported a profit of Rs 13 crore in the March quarter of FY24, after reporting a loss of Rs 196 crore in the year-ago period. However, sequentially the March quarter of FY24 remained muted. The company had reported a profit of Rs 58.5 crore in Q3 FY24. ","cleaned_content":"the largest amount of rationalization has been in zees technology part of over the top ott platform business said companys md and ceo punit goenka the company saw employee layoffs as well as senior level exits in the last few months in the aftermath of the failed merger with sony which was terminated by the latter earlier this year goenka since then has been focusing on cutting down cost and has been rationalizing workforce across verticals we believe that our ott platform is built to compete in the market with the best form there can be improvements but we didnt need this level of people we are confident that the team that remains is capable of taking the growth plans forward goenka said during the q4 fy24 earnings call the last few months have been intense as we took several tough decisions in the interest of the company we have streamlined a strong team across the business in line with the lateral structure implemented by the company we have entrusted several of our talented team members with higher levels of responsibilities to encourage more cross functional collaboration quick decision making and ideation the md said in march the company trimmed its technology innovation centres tic workforce by around \u003cFIVE_TEN_PERCENT\u003e a month later the company said in a regulatory filing that in line with goenkas overall strategic approach he has initiated the process of rationalization of the workforce by \u003cONE_TEN_PERCENT\u003e that will prune the staff strength across the company to arrive at a streamlined team that is sharply focused on the set goals for the future among senior level exits rahul johri who led the revenue and monetization vertical resigned from the in march followed by the exit of nitin mittal president technology and data at zee entertainment in the same month zee which went through a termination process of the mega \u003cONE_TEN\u003e billion merger with sony pictures networks india after around two years of talks had also announced that its revenue vertical will directly report to goenka the board of zee had institutionalised a structured monthly management mentorship \u003cTHREE_\u003e m program in march the objective of the \u003cTHREE_\u003e m program is to guide and enable the management team to achieve key performance metrics including the targeted \u003cTWO_TEN_PERCENT\u003e ebitda earnings before interest taxes depreciation and amortization margin proposed by the md ceo said zee the company on may \u003cONE_TEN\u003e reported a profit of rs \u003cONE_TEN\u003e crore in the march quarter of fy24 after reporting a loss of rs \u003cONE_HUNDRED\u003e crore in the year ago period however sequentially the march quarter of fy24 remained muted the company had reported a profit of rs \u003cFIVE_TEN\u003e crore in q3 fy24","timestamp":"2024-05-17T22:40:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}