{"url":"https://www.moneycontrol.com/news/business/qantas-to-operate-daily-flights-between-bengaluru-and-sydney-from-december-to-march-next-year-12721807.html","title":"Qantas to operate daily flights between Bengaluru and Sydney from December to March next year","description":"Between mid-December 2024 and late March 2025, the airline will increase flights from five a week to daily, adding over 12,000 seats between the two cities over the four-month period, Qantas said in a statement.Qantas to operate daily flights between Bengaluru and Sydney from December to March next year","content":"Qantas, the national carrier of Australia, on Tuesday announced that it is adding flights from Bengaluru to Sydney to cater to the strong demand over the peak holiday season. Between mid-December 2024 and late March 2025, the airline will increase flights from five a week to daily, adding over 12,000 seats between the two cities over the four-month period, Qantas said in a statement. The flights add to Qantas' existing services from Delhi to Melbourne, which operate three days a week. All Qantas international fares include checked baggage allowance, food and beverages and in-flight entertainment as standard with every booking. Qantas recently announced it would accelerate a programme to introduce \"fast and free\" Wi-Fi across its existing fleet of international aircraft, including A330 aircraft, with enough bandwidth for every passenger to enjoy a fast and consistent connection. The service will be progressively rolled-out on Qantas flights between India and Australia from next year. ","cleaned_content":"qantas the national carrier of australia on tuesday announced that it is adding flights from bengaluru to sydney to cater to the strong demand over the peak holiday season between mid december \u003cTWO_THOUSAND\u003e and late march \u003cTWO_THOUSAND\u003e the airline will increase flights from five a week to daily adding over \u003cONE_TEN_THOUSAND\u003e seats between the two cities over the four month period qantas said in a statement the flights add to qantas existing services from delhi to melbourne which operate three days a week all qantas international fares include checked baggage allowance food and beverages and in flight entertainment as standard with every booking qantas recently announced it would accelerate a programme to introduce fast and free wi fi across its existing fleet of international aircraft including a330 aircraft with enough bandwidth for every passenger to enjoy a fast and consistent connection the service will be progressively rolled out on qantas flights between india and australia from next year","timestamp":"2024-05-14T14:15:00+05:30","market_timestamp":"2024-05-14T14:15:00+05:30","off_market_hours":false}