{"url":"https://www.moneycontrol.com/news/business/mankind-pharma-plans-to-acquire-bharat-serum-vaccines-from-advent-12721789.html","title":"Mankind Pharma plans to acquire Bharat Serum \u0026 Vaccines from Advent","description":"Advent currently owns 100% stake in Bharat Serum \u0026 Vaccines and is now looking for an exit, according to the sources.Mankind Pharma plans to acquire Bharat Serum \u0026 Vaccines from Advent","content":"Mankind Pharma is looking to acquire Bharat Serum \u0026 Vaccines from Private Equity player Advent, sources with knowledge of the matter told CNBC-TV18. Advent currently owns 100% stake in Bharat Serum \u0026 Vaccines and is now looking for an exit, according to the sources. These sources also added that Advent is seeking a valuation of $2 billion for its complete stake. Advent has been looking to exit this stake since February this year, the sources said. Bharat Serum and Vaccine is involved in women's healthcare, assisted reproductive treatment, critical care and emergency medicines. CNBC-TV18 has written to Mankind Pharma with regards to this story and is awaiting a response. Shares of Mankind Pharma had listed in May last year and have doubled from their IPO price of ₹1,080 during these last 12 months. The IPO was a complete Offer for Sale, meaning the company did not get any proceeds from the issue. Shares of Mankind Pharma are trading 3.4% higher at ₹2,252.35.First Published: May 14, 2024 11:45 AM IST ","cleaned_content":"mankind pharma is looking to acquire bharat serum vaccines from private equity player advent sources with knowledge of the matter told cnbc tv18 advent currently owns \u003cONE_HUNDRED_PERCENT\u003e stake in bharat serum vaccines and is now looking for an exit according to the sources these sources also added that advent is seeking a valuation of \u003cTWO_\u003e billion for its complete stake advent has been looking to exit this stake since february this year the sources said bharat serum and vaccine is involved in womens healthcare assisted reproductive treatment critical care and emergency medicines cnbc tv18 has written to mankind pharma with regards to this story and is awaiting a response shares of mankind pharma had listed in may last year and have doubled from their ipo price of \u003cONE_THOUSAND\u003e during these last \u003cONE_TEN\u003e months the ipo was a complete offer for sale meaning the company did not get any proceeds from the issue shares of mankind pharma are trading \u003cTHREE_PERCENT\u003e higher at \u003cTWO_THOUSAND\u003e first published may \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e \u003cFOUR_TEN\u003e am ist","timestamp":"2024-05-14T13:50:00+05:30","market_timestamp":"2024-05-14T13:50:00+05:30","off_market_hours":false}