{"url":"https://www.moneycontrol.com/news/business/economy/india-to-delay-payments-market-cap-helping-walmart-backed-phonepe-google-pay-12718258.html","title":"India to delay payments market cap, helping Walmart-backed PhonePe, Google Pay","description":"The National Payments Corporation of India (NPCI), the quasi-regulator, will extend by as much as two years a year-end deadline to cap at 30% the market share of any company processing payments via the Unified Payment Interface (UPI), the sources with direct knowledge of the matter told Reuters.India to delay payments market cap, helping Walmart-backed PhonePe, Google PayRelated stories","content":"India will again delay caps on market share for a popular digital payments method, two sources told Reuters, benefiting Google Pay and Walmart-backed PhonePe as the authorities prioritise growth over concerns about market concentration. The National Payments Corporation of India (NPCI), the quasi-regulator, will extend by as much as two years a year-end deadline to cap at 30% the market share of any company processing payments via the Unified Payment Interface (UPI), the sources with direct knowledge of the matter told Reuters. PhonePe's share of UPI payments has risen to 48.3% from 37% in April 2020, while Google Pay's share has declined to 37.4% from 44%, according to NPCI data. The two processed a combined 11.5 billion transactions in April, the data showed. India launched UPI in 2016 but barred companies from charging for the instant digital payments service in an effort to promote online transactions and reduce the use of cash in Asia's third-largest economy. Because they cannot charge for it, India's banks and others like Meta-owned WhatsApp and Amazon Pay have not pushed UPI-based payments aggressively, leaving authorities worried about a concentration risk. While their apps do not earn money from the payments, PhonePe and Google Pay have been able to use their UPI customer base to sell services such as loans and insurance. NPCI, which has a regulatory mandate from the central bank, announced the 30% cap in 2020 but later extended the deadline by two years to the end of 2024. The deadline will have to be extended again, said one of the sources, as it is not possible for PhonePe and Google Pay to reduce their market shares without hurting UPI payments growth. A final decision on the extension will be communicated closer to the deadline, said the sources, who asked not to be identified because they are not allowed to speak to the media. NPCI had hoped for more competition when WhatsApp was permitted to offer UPI-based payments in February 2020, but the company had just 0.2% market share as of April. India's Paytm, with the third-highest share, has experienced a decline in payments processed through its platforms after regulators placed curbs on a group entity. Payment firms want the market-share cap removed, asking NPCI to let them charge for UPI payments to encourage competition, said an official at a payment company. The government will decide whether to allow firms to charge for UPI payments, the two sources said, but one said NPCI does not favour removing the share cap. The volume of UPI transactions rose 49.5% in April from a year earlier, less than the 54% rise logged March. The central bank met on Tuesday with industry executives to brainstorm on ways to expand the UPI user base, which was about 300 million users and 50 million merchants late last year, according to the most recent data. ","cleaned_content":"india will again delay caps on market share for a popular digital payments method two sources told reuters benefiting google pay and walmart backed phonepe as the authorities prioritise growth over concerns about market concentration the national payments corporation of india npci the quasi regulator will extend by as much as two years a year end deadline to cap at \u003cTHREE_TEN_PERCENT\u003e the market share of any company processing payments via the unified payment interface upi the sources with direct knowledge of the matter told reuters phonepes share of upi payments has risen to \u003cFOUR_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e in april \u003cTWO_THOUSAND\u003e while google pays share has declined to \u003cTHREE_TEN_PERCENT\u003e from \u003cFOUR_TEN_PERCENT\u003e according to npci data the two processed a combined \u003cONE_TEN\u003e billion transactions in april the data showed india launched upi in \u003cTWO_THOUSAND\u003e but barred companies from charging for the instant digital payments service in an effort to promote online transactions and reduce the use of cash in asias third largest economy because they cannot charge for it indias banks and others like meta owned whatsapp and amazon pay have not pushed upi based payments aggressively leaving authorities worried about a concentration risk while their apps do not earn money from the payments phonepe and google pay have been able to use their upi customer base to sell services such as loans and insurance npci which has a regulatory mandate from the central bank announced the \u003cTHREE_TEN_PERCENT\u003e cap in \u003cTWO_THOUSAND\u003e but later extended the deadline by two years to the end of \u003cTWO_THOUSAND\u003e the deadline will have to be extended again said one of the sources as it is not possible for phonepe and google pay to reduce their market shares without hurting upi payments growth a final decision on the extension will be communicated closer to the deadline said the sources who asked not to be identified because they are not allowed to speak to the media npci had hoped for more competition when whatsapp was permitted to offer upi based payments in february \u003cTWO_THOUSAND\u003e but the company had just \u003cZERO_PERCENT\u003e market share as of april indias paytm with the third highest share has experienced a decline in payments processed through its platforms after regulators placed curbs on a group entity payment firms want the market share cap removed asking npci to let them charge for upi payments to encourage competition said an official at a payment company the government will decide whether to allow firms to charge for upi payments the two sources said but one said npci does not favour removing the share cap the volume of upi transactions rose \u003cFOUR_TEN_PERCENT\u003e in april from a year earlier less than the \u003cFIVE_TEN_PERCENT\u003e rise logged march the central bank met on tuesday with industry executives to brainstorm on ways to expand the upi user base which was about \u003cTHREE_HUNDRED\u003e million users and \u003cFIVE_TEN\u003e million merchants late last year according to the most recent data","timestamp":"2024-05-09T12:53:00+05:30","market_timestamp":"2024-05-09T12:53:00+05:30","off_market_hours":false}