{"url":"https://www.moneycontrol.com/news/business/tvs-holdings-to-acquire-80-74-stake-in-home-credit-india-finance-for-rs-554-06-cr-12719222.html","title":"TVS Holdings to acquire 80.74% stake in Home Credit India Finance for Rs 554.06 cr","description":"Home Credit India Finance is engaged in the business of providing unsecured loans and is one of the leading players in the consumer financing market and the personal loans segment, the filing said.TVS Holdings to acquire 80.74% stake in Home Credit India Finance for Rs 554.06 crRelated stories","content":"TVS Holdings Ltd on Friday said it will acquire 80.74 per cent stake in Home Credit India Finance Pvt Ltd for an aggregate consideration Rs 554.06 crore. The Board of Directors at its meeting held on Friday approved the acquisition of 88,09,45,401 equity shares of Home Credit India Finance Pvt Ltd (HCIFPL), amounting to 80.74 per cent stake, from Home Credit India BV, an entity based in the Netherlands and Home Credit International AS, a Czech Republic-based entity, TVS Holdings said in a regulatory filing. The aggregate consideration for the acquisition is Rs 554.06 crore, it added. It had clocked a turnover of Rs 1,720 crore in 2022-2023. This acquisition aligns with the strategy of TVS Holdings Ltd to expand in the consumer finance sector, further strengthening its portfolio, the company said. \"HCIFPL will operate as a subsidiary of TVS Holdings Ltd, maintaining its brand identity and autonomy,\" it said, adding HCIFPL would benefit from the resources and support of TVS Holdings Ltd. The proposed transaction shall be subject to the approval required by HCIFPL from the Reserve Bank of India, with respect to change in control and board of directors, the filing added. On the other hand, TVS Holdings is required to obtain approval from the Competition Commission of India under the Competition Act, 2002, for the completion of the proposed transaction. ","cleaned_content":"tvs holdings ltd on friday said it will acquire \u003cEIGHT_TEN_PERCENT\u003e stake in home credit india finance pvt ltd for an aggregate consideration rs \u003cFIVE_HUNDRED\u003e crore the board of directors at its meeting held on friday approved the acquisition of \u003cEIGHT_HUNDRED_MILLION\u003e equity shares of home credit india finance pvt ltd hcifpl amounting to \u003cEIGHT_TEN_PERCENT\u003e stake from home credit india bv an entity based in the netherlands and home credit international as a czech republic based entity tvs holdings said in a regulatory filing the aggregate consideration for the acquisition is rs \u003cFIVE_HUNDRED\u003e crore it added it had clocked a turnover of rs \u003cONE_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e this acquisition aligns with the strategy of tvs holdings ltd to expand in the consumer finance sector further strengthening its portfolio the company said hcifpl will operate as a subsidiary of tvs holdings ltd maintaining its brand identity and autonomy it said adding hcifpl would benefit from the resources and support of tvs holdings ltd the proposed transaction shall be subject to the approval required by hcifpl from the reserve bank of india with respect to change in control and board of directors the filing added on the other hand tvs holdings is required to obtain approval from the competition commission of india under the competition act \u003cTWO_THOUSAND\u003e for the completion of the proposed transaction","timestamp":"2024-05-10T14:42:00+05:30","market_timestamp":"2024-05-10T14:42:00+05:30","off_market_hours":false}