{"url":"https://www.moneycontrol.com/news/business/fitch-affirms-ratings-of-axis-bank-icici-bank-on-supporting-operating-environment-12718244.html","title":"Fitch affirms ratings of Axis Bank, ICICI Bank on supporting operating environment","description":"Fitch Ratings has affirmed India-based Axis Bank and ICICI Bank's Long-Term Issuer Default Rating (IDR) at 'BB+', the global agency said in two separate rating commentaries.Fitch affirms ratings of Axis Bank, ICICI Bank on supporting operating environmentRelated stories","content":"Fitch Ratings on Thursday affirmed the ratings of Axis Bank and ICICI Bank with a stable outlook citing supportive operating environment and large domestic franchise. Fitch Ratings has affirmed India-based Axis Bank and ICICI Bank's Long-Term Issuer Default Rating (IDR) at 'BB+', the global agency said in two separate rating commentaries. Fitch has also affirmed the banks' Government Support Rating (GSR) at 'bb+' and Viability Rating (VR) at 'bb'. The agency said its expectation of a supportive operative environment is on account of India's robust medium-term growth potential. Fitch expects GDP growth of 7 per cent in 2024 and 6.5 per cent in 2025, supported by investment prospects. \"The economy has been resilient as healthy business sentiment, steady financial markets and the government's capital spending buffered global economic headwinds and inflation. These factors are conducive for banks to sustain profitable business, provided risks are well-managed,\" Fitch said. With regard to Axis Bank, Fitch said the bank's appetite for growth is likely to remain above the sector average, albeit similar to other large private banks. \"We have revised the outlook on Axis' earnings and profitability score to stable, from positive, as we do not see a significant further upside to the core metric from current levels, despite remaining high relative to the years before FY23,\" it added. On ICICI Bank, Fitch said it maintains a positive outlook on its earnings and profitability score, as it expects profitability to remain elevated relative to prior years. On ICICI Bank's large domestic franchise, Fitch said the bank has a strong retail-focused domestic franchise as India's second-largest private bank. \"This, together with above-average capitalisation, should support sustained generation of revenue and business opportunities as well as market-share expansion through the cycle,\" it added. ","cleaned_content":"fitch ratings on thursday affirmed the ratings of axis bank and icici bank with a stable outlook citing supportive operating environment and large domestic franchise fitch ratings has affirmed india based axis bank and icici banks long term issuer default rating idr at bb the global agency said in two separate rating commentaries fitch has also affirmed the banks government support rating gsr at bb and viability rating vr at bb the agency said its expectation of a supportive operative environment is on account of indias robust medium term growth potential fitch expects gdp growth of \u003cSEVEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and \u003cSIX_PERCENT\u003e in \u003cTWO_THOUSAND\u003e supported by investment prospects the economy has been resilient as healthy business sentiment steady financial markets and the governments capital spending buffered global economic headwinds and inflation these factors are conducive for banks to sustain profitable business provided risks are well managed fitch said with regard to axis bank fitch said the banks appetite for growth is likely to remain above the sector average albeit similar to other large private banks we have revised the outlook on axis earnings and profitability score to stable from positive as we do not see a significant further upside to the core metric from current levels despite remaining high relative to the years before fy23 it added on icici bank fitch said it maintains a positive outlook on its earnings and profitability score as it expects profitability to remain elevated relative to prior years on icici banks large domestic franchise fitch said the bank has a strong retail focused domestic franchise as indias second largest private bank this together with above average capitalisation should support sustained generation of revenue and business opportunities as well as market share expansion through the cycle it added","timestamp":"2024-05-09T12:42:00+05:30","market_timestamp":"2024-05-09T12:42:00+05:30","off_market_hours":false}