{"url":"https://www.moneycontrol.com/news/business/biocon-inks-supply-distribution-pact-with-medix-for-chronic-weight-management-drug-in-mexico-12720620.html","title":"Biocon inks supply, distribution pact with Medix for chronic weight management drug in Mexico","description":"Under the agreement with Medix, a specialty pharmaceutical firm, Biocon will be responsible for obtaining regulatory approval, manufacturing and supply of the drug, the company said in a statement.Biocon inks supply, distribution pact with Medix for chronic weight management drug in MexicoRelated stories","content":"Biocon Ltd on Monday announced the signing of a semi-exclusive distribution and supply agreement with Mexico-based Medix for the commercialization of its drug Liraglutide (gSaxenda), used in the treatment of chronic weight management. Under the agreement with Medix, a specialty pharmaceutical firm, Biocon will be responsible for obtaining regulatory approval, manufacturing and supply of the drug, the company said in a statement. On the other hand, Medix will take the responsibility for its commercialisation in the Mexican market, it added. He further said,\"Our efforts will be focused on working with Medix to enable the commercialisation of this product expeditiously.\" Medix has an experience of more than 70 years in developing solutions to address the overweight and obesity burden in a country where 70 per cent of the population are dealing with the disease, to improve their quality of life, the statement said. Medix CEO Carlos Abelleyra said according to the WHO, Mexico is the second country with the highest prevalence of overweight and obesity worldwide. \"Our partnership with Biocon will bring quality and affordability into the pharmacological options for the physician, which supports our vision,\" Abelleyra added. Citing IQVIA MAT Q4 2023 data, Biocon said the total addressable market opportunity of Liraglutide for obesity indication in Mexico is approximately USD 37 million. ","cleaned_content":"biocon ltd on monday announced the signing of a semi exclusive distribution and supply agreement with mexico based medix for the commercialization of its drug liraglutide gsaxenda used in the treatment of chronic weight management under the agreement with medix a specialty pharmaceutical firm biocon will be responsible for obtaining regulatory approval manufacturing and supply of the drug the company said in a statement on the other hand medix will take the responsibility for its commercialisation in the mexican market it added he further said our efforts will be focused on working with medix to enable the commercialisation of this product expeditiously medix has an experience of more than \u003cSEVEN_TEN\u003e years in developing solutions to address the overweight and obesity burden in a country where \u003cSEVEN_TEN_PERCENT\u003e of the population are dealing with the disease to improve their quality of life the statement said medix ceo carlos abelleyra said according to the who mexico is the second country with the highest prevalence of overweight and obesity worldwide our partnership with biocon will bring quality and affordability into the pharmacological options for the physician which supports our vision abelleyra added citing iqvia mat q4 \u003cTWO_THOUSAND\u003e data biocon said the total addressable market opportunity of liraglutide for obesity indication in mexico is approximately usd \u003cTHREE_TEN\u003e million","timestamp":"2024-05-13T10:24:00+05:30","market_timestamp":"2024-05-13T10:24:00+05:30","off_market_hours":false}