{"url":"https://www.moneycontrol.com/news/business/indias-biggest-junk-bond-faces-creditor-demands-as-delay-sought-12725109.html","title":"India’s biggest junk bond faces creditor demands as delay sought","description":"Some holders of the 143 billion rupee ($1.7 billion) note issued last year by Goswami Infratech Pvt are planning to ask the company for sweeteners in exchange for potentially accepting a company proposal to delay a payment, people familiar with the matter said.India’s biggest junk bond faces creditor demands as delay soughtRelated stories","content":"India’s biggest ever high-yield rupee corporate bond, held by a number of global private credit funds, is casting a spotlight on pockets of stress within the nation’s credit markets. Some holders of the 143 billion rupee ($1.7 billion) note issued last year by Goswami Infratech Pvt are planning to ask the company for sweeteners in exchange for potentially accepting a company proposal to delay a payment, people familiar with the matter said. Goswami Infratech is an investment company within the Shapoorji Pallonji group under billionaire Shapoor Mistry. Its projects include apartments, warehouses, parking spaces and shops. The company has said it may not be able to pay 14 billion rupees that could come due later this month if certain terms aren’t met, and effectively asked to push that back to later this year. The tussle underscores broader risks posed by payment delays as global private credit investors increasingly wade into emerging markets. India has been among hot spots in Asia, and Prime Minister Narendra Modi—whose party is currently contesting parliamentary elections—has fueled interest by pushing for more infrastructure investment. Private credit investors have been among holders of the Goswami Infratech bond including Cerberus Capital Capital Management LP, Varde Partners LP and Davidson Kempner Capital Management LP. Others have included Canyon Capital, Edelweiss, Deutsche Bank and Standard Chartered Bank, according to a report by Praxis Global Alliance in April. When Goswami Infratech offered the debt in June last year, money managers flocked to the deal, which offered a juicy 18.75% yield. Of course, such high yields come with bigger risks. The Shapoorji Pallonji group has suffered from liquidity crunches after it piled on debt before the pandemic. That’s forced the engineering and construction conglomerate to attempt to offload assets. The group sold its stake in a key port on the east coast of India called Gopalpur earlier this year to an Adani group company. But that came only after failure to reach such a deal by the end of last year breached a clause in the Goswami Infratech bond that resulted in the borrower having to raise the yield to 20.75%. Another clause, or so-called covenant, in the note stipulates that the Shapoorji Pallonji group must refinance certain debt of its main investment vehicle Sterling Investment Corp. Goswami Infratech said in a letter to the bond trustee earlier this month that the covenant would likely be breached, forcing it to pay creditors the 14 billion rupees, because Shapoorji Pallonji group hasn’t raised new debt for Sterling Investment. The firm said it would then have three business days from May 26 to make that payment, but may not be able to do so. It is seeking holders’ consent to amend the trigger event date to no later than Sept. 30, or as early as when the covenant criteria are met. The investors are going back to their internal investment committees to reach a final decision next week, the people said. ","cleaned_content":"india s biggest ever high yield rupee corporate bond held by a number of global private credit funds is casting a spotlight on pockets of stress within the nation s credit markets some holders of the \u003cONE_HUNDRED\u003e billion rupee \u003cONE_\u003e billion note issued last year by goswami infratech pvt are planning to ask the company for sweeteners in exchange for potentially accepting a company proposal to delay a payment people familiar with the matter said goswami infratech is an investment company within the shapoorji pallonji group under billionaire shapoor mistry its projects include apartments warehouses parking spaces and shops the company has said it may not be able to pay \u003cONE_TEN\u003e billion rupees that could come due later this month if certain terms aren t met and effectively asked to push that back to later this year the tussle underscores broader risks posed by payment delays as global private credit investors increasingly wade into emerging markets india has been among hot spots in asia and prime minister narendra modi whose party is currently contesting parliamentary elections has fueled interest by pushing for more infrastructure investment private credit investors have been among holders of the goswami infratech bond including cerberus capital capital management lp varde partners lp and davidson kempner capital management lp others have included canyon capital edelweiss deutsche bank and standard chartered bank according to a report by praxis global alliance in april when goswami infratech offered the debt in june last year money managers flocked to the deal which offered a juicy \u003cONE_TEN_PERCENT\u003e yield of course such high yields come with bigger risks the shapoorji pallonji group has suffered from liquidity crunches after it piled on debt before the pandemic that s forced the engineering and construction conglomerate to attempt to offload assets the group sold its stake in a key port on the east coast of india called gopalpur earlier this year to an adani group company but that came only after failure to reach such a deal by the end of last year breached a clause in the goswami infratech bond that resulted in the borrower having to raise the yield to \u003cTWO_TEN_PERCENT\u003e another clause or so called covenant in the note stipulates that the shapoorji pallonji group must refinance certain debt of its main investment vehicle sterling investment corp goswami infratech said in a letter to the bond trustee earlier this month that the covenant would likely be breached forcing it to pay creditors the \u003cONE_TEN\u003e billion rupees because shapoorji pallonji group hasn t raised new debt for sterling investment the firm said it would then have three business days from may \u003cTWO_TEN\u003e to make that payment but may not be able to do so it is seeking holders consent to amend the trigger event date to no later than sept \u003cTHREE_TEN\u003e or as early as when the covenant criteria are met the investors are going back to their internal investment committees to reach a final decision next week the people said","timestamp":"2024-05-17T13:39:00+05:30","market_timestamp":"2024-05-17T13:39:00+05:30","off_market_hours":false}