{"url":"https://www.moneycontrol.com/news/business/hdfc-bank-raises-500-million-from-ifc-for-on-lending-to-women-borrowers-12725251.html","title":"HDFC Bank raises $500 million from IFC for on lending to women borrowers","description":"The country's largest private sector lender will extend finance for income generation, fostering financial inclusion and socio-economic growth, as per an official statement.HDFC Bank raises $500 million from IFC for on lending to women borrowers","content":"HDFC Bank on Friday said it has raised USD 500 million from IFC for onlending to underserved women borrowers. The country's largest private sector lender will extend finance for income generation, fostering financial inclusion and socio-economic growth, as per an official statement. It will extend the microloans to self-help groups and joint liability groups of women enrolled under the Sustainable Livelihoods Initiative (SLI) of the lender. The statement said even though the non-banks have a deeper reach and serve two-thirds of the microfinance market, banks' extensive reach and lower funding costs can be leveraged to extend microloans to women. \"Access to financial services is key to empowering women and strengthening the economy,\" IFC's regional director for South Asia Imad Fakhoury said. Over the last 20 years, IFC (International Finance Corporation) has made 650 microfinance investments totalling USD 6.2 billion, the statement said. ","cleaned_content":"hdfc bank on friday said it has raised usd \u003cFIVE_HUNDRED\u003e million from ifc for onlending to underserved women borrowers the countrys largest private sector lender will extend finance for income generation fostering financial inclusion and socio economic growth as per an official statement it will extend the microloans to self help groups and joint liability groups of women enrolled under the sustainable livelihoods initiative sli of the lender the statement said even though the non banks have a deeper reach and serve two thirds of the microfinance market banks extensive reach and lower funding costs can be leveraged to extend microloans to women access to financial services is key to empowering women and strengthening the economy ifcs regional director for south asia imad fakhoury said over the last \u003cTWO_TEN\u003e years ifc international finance corporation has made \u003cSIX_HUNDRED\u003e microfinance investments totalling usd \u003cSIX_\u003e billion the statement said","timestamp":"2024-05-17T14:49:00+05:30","market_timestamp":"2024-05-17T14:49:00+05:30","off_market_hours":false}