{"url":"https://www.moneycontrol.com/technology/pvr-inox-lowers-fy25-capex-by-25-plans-to-shut-down-70-non-performing-screens-article-12722215.html","title":"PVR Inox lowers FY25 capex by 25%, plans to shut down 70 non-performing screens","description":"In FY24, PVR Inox opened 130 screens and shut down 85 with net additions of 45 screens. The exhibitor will shut down around 70 screens with net additions of 50-60 in FY25PVR Inox is reducing capex and will continue screen closures in FY25. Related stories","content":"Multiplex major PVR Inox has listed down four priority areas with improving profitability topping the list and for this it is cutting down its capital expenditure (capex) on new screens. After spending a total capex of Rs 620 crore in FY24, the company will bring it down by 25 percent to Rs 450 crore in FY25, said Nitin Sood, group chief financial officer of PVR Inox. \"Over the last 12-18 months, we have repositioned a lot of our existing contracts and have got significant developer contributions to fund part of the growth. We have also renegotiated some of our rentals in most of the new locations that have opened up. We eventually want to evolve into a capex-light model and reduce our capex by 30-50 percent,\" he said. \"Bulk of the new additions are already under fit-out from previous year. So, FOCO will gain momentum in the coming year and take about four years to become a dominant model. In the next year you could see 20-25 percent (screens) in the capital light and FOCO model,\" Sood said. Also, out of the new screens many will open down south as it is focusing to expand more in the southern states. He also added that with screen additions slowly moving to asset light models, capex reduction will take some time to reach the 30-50 percent range. \"As we roll out a new screen portfolio, our landlord partners will co-invest for most of the screens. We will end up sharing food business with the landlord so increasingly more and more deals pivot to higher percentage of revenue sharing as compared to investing upfront capital.\" In FY24, PVR Inox opened 130 new screens and shut down 85 screens with net additions of 45 screens. The exhibitor will shut down around 70 screens with net additions of 50-60 screens in FY25. The CFO said that screen closures will be a constant exercise. \"Most of the assets have lived their life. Also, the malls in which the cinemas which are being closed are not performing because of which we are looking at the closures.\" The company is also renegotiating existing contracts for operating sites but Sood expects marginal reduction in rent and CAM (Common Area Maintenance) charges. \"We are in discussion with landlords. Where the lock in period is expiring there we have an opportunity to renegotiate rentals but it will not be a large number. Some of the rental cost will get rationalised as we come out of lock in period,\" Sood said. PVR Inox's expense on rent increased 14 percent to Rs 1,192.8 crore in FY24 from Rs 1,042.6 crore in FY23. CAM expenses were up 15 percent to Rs 329.6 crore in the last financial year from Rs 286.9 crore in FY23. \"We will be transitioning to a capital-light growth model for new screen additions. We will be selective in adding new cinema and prioritise expansion efforts in South India. We will monetise Inox real estate inherited from the merger and plan to use the proceeds to reduce debt. Currently, screen portfolio stands at 1,748 screens,\" said Ajay Bijli, managing director of PVR Inox Ltd, in the Q4 FY24 earnings call. The company's net debt reduced by Rs 136.4 crore in FY24 to Rs 1,294 crore from Rs 1,430.4 crore in FY23. Event alert: Moneycontrol and CNBC TV18 are hosting the ultimate event on artificial intelligence, bringing together entrepreneurs, ecosystem enablers, policymakers, industry leaders, and innovators on May 17 in Gurugram. Click here to register and gain access to the AI Alliance Delhi-NCR Chapter. https://www.moneycontrol.com/msite/global-ai-conclave/gurugram ","cleaned_content":"multiplex major pvr inox has listed down four priority areas with improving profitability topping the list and for this it is cutting down its capital expenditure capex on new screens after spending a total capex of rs \u003cSIX_HUNDRED\u003e crore in fy24 the company will bring it down by \u003cTWO_TEN_PERCENT\u003e to rs \u003cFOUR_HUNDRED\u003e crore in fy25 said nitin sood group chief financial officer of pvr inox over the last \u003cONE_TEN\u003e \u003cONE_TEN\u003e months we have repositioned a lot of our existing contracts and have got significant developer contributions to fund part of the growth we have also renegotiated some of our rentals in most of the new locations that have opened up we eventually want to evolve into a capex light model and reduce our capex by \u003cTHREE_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e he said bulk of the new additions are already under fit out from previous year so foco will gain momentum in the coming year and take about four years to become a dominant model in the next year you could see \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e screens in the capital light and foco model sood said also out of the new screens many will open down south as it is focusing to expand more in the southern states he also added that with screen additions slowly moving to asset light models capex reduction will take some time to reach the \u003cTHREE_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e range as we roll out a new screen portfolio our landlord partners will co invest for most of the screens we will end up sharing food business with the landlord so increasingly more and more deals pivot to higher percentage of revenue sharing as compared to investing upfront capital in fy24 pvr inox opened \u003cONE_HUNDRED\u003e new screens and shut down \u003cEIGHT_TEN\u003e screens with net additions of \u003cFOUR_TEN\u003e screens the exhibitor will shut down around \u003cSEVEN_TEN\u003e screens with net additions of \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e screens in fy25 the cfo said that screen closures will be a constant exercise most of the assets have lived their life also the malls in which the cinemas which are being closed are not performing because of which we are looking at the closures the company is also renegotiating existing contracts for operating sites but sood expects marginal reduction in rent and cam common area maintenance charges we are in discussion with landlords where the lock in period is expiring there we have an opportunity to renegotiate rentals but it will not be a large number some of the rental cost will get rationalised as we come out of lock in period sood said pvr inoxs expense on rent increased \u003cONE_TEN_PERCENT\u003e to rs \u003cONE_THOUSAND\u003e crore in fy24 from rs \u003cONE_THOUSAND\u003e crore in fy23 cam expenses were up \u003cONE_TEN_PERCENT\u003e to rs \u003cTHREE_HUNDRED\u003e crore in the last financial year from rs \u003cTWO_HUNDRED\u003e crore in fy23 we will be transitioning to a capital light growth model for new screen additions we will be selective in adding new cinema and prioritise expansion efforts in south india we will monetise inox real estate inherited from the merger and plan to use the proceeds to reduce debt currently screen portfolio stands at \u003cONE_THOUSAND\u003e screens said ajay bijli managing director of pvr inox ltd in the q4 fy24 earnings call the companys net debt reduced by rs \u003cONE_HUNDRED\u003e crore in fy24 to rs \u003cONE_THOUSAND\u003e crore from rs \u003cONE_THOUSAND\u003e crore in fy23 event alert moneycontrol and cnbc tv18 are hosting the ultimate event on artificial intelligence bringing together entrepreneurs ecosystem enablers policymakers industry leaders and innovators on may \u003cONE_TEN\u003e in gurugram click here to register and gain access to the ai alliance delhi ncr chapter https www moneycontrol com msite global ai conclave gurugram","timestamp":"2024-05-15T07:04:00+05:30","market_timestamp":"2024-05-15T09:15:00+05:30","off_market_hours":true}