{"url":"https://www.moneycontrol.com/news/business/signature-global-aims-to-sell-rs-10000-crore-worth-homes-in-fy25-up-38-annually-12723449.html","title":"Signature Global aims to sell Rs 10,000 crore worth homes in FY25, up 38% annually","description":"In its investors presentation, the company has given a guidance of Rs 10,000 crore for sales bookings in the current fiscal.Signature Global aims to sell Rs 10,000 crore worth homes in FY25, up 38% annuallyRelated stories","content":"Realty firm Signature Global Ltd has set a target to sell housing properties worth Rs 10,000 crore in 2024-25, up 38 per cent from the last fiscal, as it expects demand for residential assets to remain strong. In its investors presentation, the company has given a guidance of Rs 10,000 crore for sales bookings in the current fiscal. The company's sales bookings more than doubled to Rs 7,268 crore in 2023-24 from Rs 3,430 crore in the preceding year. In terms of area, Signature Global sold 6.18 million square feet in 2023-24, up from 4.35 million square feet in the preceding years. Sales realisation for 2023-24 averaged Rs 11,762 per square feet compared to Rs 7,886 per square feet in the previous fiscal. Pradeep Kumar Aggarwal, Chairman of Signature Global, said, \"The financial year 2023-24 marked a significant period for our company, characterised by several achievements, including a successful IPO, expansion into the premium segment, and a notable transition to mid-income housing from affordable housing.\" He said the company has achieved substantial growth in its presence in the National Capital Region (NCR) leading to an increase in its market share. \"As we move into FY25, our focus will be on risk mitigation and the creation of opportunities to ensure sustainable profitability and long-term value for all stakeholders,\" Aggarwal said. On Wednesday, Signature Global reported a more than 5-fold jump in its consolidated net profit to Rs 41.21 crore for the quarter ended March, driven by higher income. Its net profit stood at Rs 7.60 crore in the year-ago period. Total income increased to Rs 722.73 crore in the fourth quarter of the last fiscal year from Rs 709.86 crore in the corresponding period of the preceding year, according to a regulatory filing. During the entire 2023-24 fiscal, the company posted a net profit of Rs 16.18 crore as against a net loss of 63.86 crore in the preceding year. However, total income decreased to Rs 1,324.55 crore in the last fiscal from Rs 1,585.87 crore in the 2022-23 fiscal. Signature Global is one of the leading real estate firms in the Delhi-NCR region. It currently has a portfolio of 48.6 million square feet with 16.4 million square feet ongoing and 29.3 million square feet forthcoming. In September last year, Signature Global successfully launched its IPO (Initial Public Offer) to raise Rs 730 crore. The public issue, comprising a fresh issue of shares worth Rs 603 crore and an Offer for Sale (OFS) of Rs 127 crore, was subscribed 11.88 times. ","cleaned_content":"realty firm signature global ltd has set a target to sell housing properties worth rs \u003cONE_TEN_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e up \u003cTHREE_TEN_PERCENT\u003e from the last fiscal as it expects demand for residential assets to remain strong in its investors presentation the company has given a guidance of rs \u003cONE_TEN_THOUSAND\u003e crore for sales bookings in the current fiscal the companys sales bookings more than doubled to rs \u003cSEVEN_THOUSAND\u003e crore in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e from rs \u003cTHREE_THOUSAND\u003e crore in the preceding year in terms of area signature global sold \u003cSIX_\u003e million square feet in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e up from \u003cFOUR_\u003e million square feet in the preceding years sales realisation for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e averaged rs \u003cONE_TEN_THOUSAND\u003e per square feet compared to rs \u003cSEVEN_THOUSAND\u003e per square feet in the previous fiscal pradeep kumar aggarwal chairman of signature global said the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e marked a significant period for our company characterised by several achievements including a successful ipo expansion into the premium segment and a notable transition to mid income housing from affordable housing he said the company has achieved substantial growth in its presence in the national capital region ncr leading to an increase in its market share as we move into fy25 our focus will be on risk mitigation and the creation of opportunities to ensure sustainable profitability and long term value for all stakeholders aggarwal said on wednesday signature global reported a more than \u003cFIVE_\u003e fold jump in its consolidated net profit to rs \u003cFOUR_TEN\u003e crore for the quarter ended march driven by higher income its net profit stood at rs \u003cSEVEN_\u003e crore in the year ago period total income increased to rs \u003cSEVEN_HUNDRED\u003e crore in the fourth quarter of the last fiscal year from rs \u003cSEVEN_HUNDRED\u003e crore in the corresponding period of the preceding year according to a regulatory filing during the entire \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal the company posted a net profit of rs \u003cONE_TEN\u003e crore as against a net loss of \u003cSIX_TEN\u003e crore in the preceding year however total income decreased to rs \u003cONE_THOUSAND\u003e crore in the last fiscal from rs \u003cONE_THOUSAND\u003e crore in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal signature global is one of the leading real estate firms in the delhi ncr region it currently has a portfolio of \u003cFOUR_TEN\u003e million square feet with \u003cONE_TEN\u003e million square feet ongoing and \u003cTWO_TEN\u003e million square feet forthcoming in september last year signature global successfully launched its ipo initial public offer to raise rs \u003cSEVEN_HUNDRED\u003e crore the public issue comprising a fresh issue of shares worth rs \u003cSIX_HUNDRED\u003e crore and an offer for sale ofs of rs \u003cONE_HUNDRED\u003e crore was subscribed \u003cONE_TEN\u003e times","timestamp":"2024-05-16T10:48:00+05:30","market_timestamp":"2024-05-16T10:48:00+05:30","off_market_hours":false}