{"url":"https://www.moneycontrol.com/news/business/markets/sebi-bars-add-shop-e-retail-white-organice-agro-10-other-entities-from-securities-markets-12716615.html","title":"Sebi bars Add-Shop E-Retail, White Organice Agro, 10 other entities from securities markets","description":"Sebi restrained 12 entities, including Add-Shop E-Retail Ltd and White Organic Agro Ltd, as well as their promoters — Dineshbhai Pandya and Darshak Rupani — from securities markets for flouting regulatory norms.SEBIRelated stories","content":"Sebi on Monday restrained 12 entities, including Add-Shop E-Retail Ltd and White Organic Agro Ltd, as well as their promoters — Dineshbhai Pandya and Darshak Rupani — from securities markets for flouting regulatory norms. The regulator also barred Dineshbhai Pandya, Dev Pandya, Jayshree Pandya, Deviben Pandya, Jigar Pandya, Prashantt Rupani, Darshak Rupani, Jitendra Mehta and Ronak Desai from acting as key managerial personnel of any public company, which intends to raise money from the public, including Dada Organic Ltd, till further orders. Also, Sebi directed Add-Shop E-Retail Ltd (ASERL) and White Organic Agro Ltd (WOAL) to constitute new audit committees with enhanced oversight of related party transactions. \"I find that after the investigation by Sebi, examining various complex sets of information and documents, has made out a prima facie case that the published financial statements of ASERL and WOAL, which are listed companies, were manipulated,\" Sebi's whole time member Ashwani Bhatia said in the interim order. Sebi also found that Dada Organics Ltd (DOL) was prima facie involved in fictitious transactions with ASERL and WOAL, thereby enabling to book fictitious purchase and sale transactions in their books of account. It was observed that in May 2023, DOL had filled its IPO papers with the stock exchange to raise money. However, it was withdrawn later by the company. Hence, the possibility of ASERL, WOAL or DOL raising capital in the future cannot be ruled out, unless stopped, as per the Sebi order. \"What has clearly emerged through the investigation done by Sebi, including the data relating to the change in shareholding pattern of ASERL, is the fact that the promoters of the company did everything to benefit themselves at the cost of small shareholders. \"New retail investors whose number increased to 46,884 in March 23 from a mere 96 as on March 20 were led up the garden path. Promoters of ASERL, while busy making false and misleading announcements, artificially pumped up ASERL's sales to show a healthy top-line and bottom-line,\" Bhatia said. \"The company in reality was not manufacturing or producing any agricultural product, but simply passing fictitious sales transactions between its related parties. \"The promoters gave the impression of a healthy and well-run company and benefitted themselves through the falsehood. This appears to be a classic example of a pump and dump scheme and small investors need to be cautious of such fraudulent activities in their own interest,\" Bhatia added. The order came after Sebi received complaints in September 2023 and December 2021 against ASERL and WOAL alleging irregularities pertaining to related party transactions, fake announcements regarding supply orders etc. Thereafter, Sebi initiated an investigation into the affairs of both the companies for the period April 2020 to March 2023. The focus of the probe was to ascertain possible violations of the provisions of PFUTP (Prohibition of Fraudulent and Unfair Trade Practices) and disclosure rules. ASERL is into the business of manufacturing, marketing and distribution of Ayurveda products. Dineshbhai Pandya is the promoter of ASERL and DOL. WOAL is engaged in the business of organic food items, while Darshak Rupani is the MD of the firm. Meanwhile, Sebi also issued show cause notices to seven other entities for alleged violation of PFUTP and disclosure norms. ","cleaned_content":"sebi on monday restrained \u003cONE_TEN\u003e entities including add shop e retail ltd and white organic agro ltd as well as their promoters dineshbhai pandya and darshak rupani from securities markets for flouting regulatory norms the regulator also barred dineshbhai pandya dev pandya jayshree pandya deviben pandya jigar pandya prashantt rupani darshak rupani jitendra mehta and ronak desai from acting as key managerial personnel of any public company which intends to raise money from the public including dada organic ltd till further orders also sebi directed add shop e retail ltd aserl and white organic agro ltd woal to constitute new audit committees with enhanced oversight of related party transactions i find that after the investigation by sebi examining various complex sets of information and documents has made out a prima facie case that the published financial statements of aserl and woal which are listed companies were manipulated sebis whole time member ashwani bhatia said in the interim order sebi also found that dada organics ltd dol was prima facie involved in fictitious transactions with aserl and woal thereby enabling to book fictitious purchase and sale transactions in their books of account it was observed that in may \u003cTWO_THOUSAND\u003e dol had filled its ipo papers with the stock exchange to raise money however it was withdrawn later by the company hence the possibility of aserl woal or dol raising capital in the future cannot be ruled out unless stopped as per the sebi order what has clearly emerged through the investigation done by sebi including the data relating to the change in shareholding pattern of aserl is the fact that the promoters of the company did everything to benefit themselves at the cost of small shareholders new retail investors whose number increased to \u003cFOUR_TEN_THOUSAND\u003e in march \u003cTWO_TEN\u003e from a mere \u003cNINE_TEN\u003e as on march \u003cTWO_TEN\u003e were led up the garden path promoters of aserl while busy making false and misleading announcements artificially pumped up aserls sales to show a healthy top line and bottom line bhatia said the company in reality was not manufacturing or producing any agricultural product but simply passing fictitious sales transactions between its related parties the promoters gave the impression of a healthy and well run company and benefitted themselves through the falsehood this appears to be a classic example of a pump and dump scheme and small investors need to be cautious of such fraudulent activities in their own interest bhatia added the order came after sebi received complaints in september \u003cTWO_THOUSAND\u003e and december \u003cTWO_THOUSAND\u003e against aserl and woal alleging irregularities pertaining to related party transactions fake announcements regarding supply orders etc thereafter sebi initiated an investigation into the affairs of both the companies for the period april \u003cTWO_THOUSAND\u003e to march \u003cTWO_THOUSAND\u003e the focus of the probe was to ascertain possible violations of the provisions of pfutp prohibition of fraudulent and unfair trade practices and disclosure rules aserl is into the business of manufacturing marketing and distribution of ayurveda products dineshbhai pandya is the promoter of aserl and dol woal is engaged in the business of organic food items while darshak rupani is the md of the firm meanwhile sebi also issued show cause notices to seven other entities for alleged violation of pfutp and disclosure norms","timestamp":"2024-05-07T16:09:00+05:30","market_timestamp":"2024-05-08T09:15:00+05:30","off_market_hours":true}