{"url":"https://www.moneycontrol.com/news/business/coal-india-nmdc-ongc-videsh-to-actively-scout-for-critical-mineral-assets-abroad-govt-12722749.html","title":"Coal India, NMDC, ONGC Videsh to actively scout for critical mineral assets abroad: Govt","description":"ONGC Videsh Ltd (OVL) is the overseas investment arm of state-owned Oil and Natural Gas Corporation.Coal India, NMDC, ONGC Videsh to actively scout for critical mineral assets abroad: Govt","content":"The government on Wednesday said public sector companies -- Coal India, NMDC and ONGC Videsh Ltd (OVL), will start looking diligently for critical mineral assets overseas. ONGC Videsh Ltd (OVL) is the overseas investment arm of state-owned Oil and Natural Gas Corporation. These PSUs already have some kind of presence abroad. State-owned Coal India, he said, is actively pursuing some lithium blocks in Chile. \"So, Coal India is getting active... NMDC is already active in Australia. They have some gold mines in Australia and are also looking at lithium mines in Australia,\" Rao explained. Meanwhile, Khanij Bidesh India Ltd (KABIL) is a joint venture of three PSUs formed to scout for mineral assets overseas. It is owned by three public sector undertakings National Aluminium Company Ltd (Nalco), Hindustan Copper Ltd (HCL) and Mineral Exploration and Consultancy Ltd (MECL). Critical minerals such as copper, lithium, nickel and cobalt are important components in rapidly growing clean energy technologies - from wind turbines and electricity networks to electric vehicles. ","cleaned_content":"the government on wednesday said public sector companies coal india nmdc and ongc videsh ltd ovl will start looking diligently for critical mineral assets overseas ongc videsh ltd ovl is the overseas investment arm of state owned oil and natural gas corporation these psus already have some kind of presence abroad state owned coal india he said is actively pursuing some lithium blocks in chile so coal india is getting active nmdc is already active in australia they have some gold mines in australia and are also looking at lithium mines in australia rao explained meanwhile khanij bidesh india ltd kabil is a joint venture of three psus formed to scout for mineral assets overseas it is owned by three public sector undertakings national aluminium company ltd nalco hindustan copper ltd hcl and mineral exploration and consultancy ltd mecl critical minerals such as copper lithium nickel and cobalt are important components in rapidly growing clean energy technologies from wind turbines and electricity networks to electric vehicles","timestamp":"2024-05-15T14:10:00+05:30","market_timestamp":"2024-05-15T14:10:00+05:30","off_market_hours":false}