{"url":"https://www.moneycontrol.com/news/business/before-global-scrutiny-indian-spice-maker-mdh-faced-many-us-rejections-12720406.html","title":"Before global scrutiny, Indian spice maker MDH faced many US rejections","description":"Hong Kong suspended sales last month of three spice blends made by MDH and one by another Indian company, Everest, for apparently containing high levels of a cancer-causing pesticide. Ethylene oxide is unfit for human consumption and a cancer risk with long exposure.Before global scrutiny, Indian spice maker MDH faced many US rejectionsRelated stories","content":"Popular Indian spice brand MDH, under scrutiny for alleged contamination in some products, has since 2021 seen an average 14.5% of its U.S. shipments rejected due to the presence of bacteria, a Reuters analysis of U.S. regulatory data found. Hong Kong suspended sales last month of three spice blends made by MDH and one by another Indian company, Everest, for apparently containing high levels of a cancer-causing pesticide. Ethylene oxide is unfit for human consumption and a cancer risk with long exposure. The companies have said their products are safe and MDH added it does not use ethylene oxide at any stage of storing, processing, or packing of spices. Authorities in the United States, Australia and India are looking into the matter. Both brands are popular in India and are exported around the world. Before the latest scrutiny, products from MDH, a family-run Indian company more than 100 years old, were rejected for sale in the United States due to the presence of salmonella, a bacteria that can lead to gastrointestinal illness. Around 20%, or 13 of MDH's 65 shipments to the United States were rejected after it failed checks for salmonella between October 2023 - when the current fiscal year started - and May 3, according to the latest available data compiled by Reuters from the U.S. Food and Drug Administration (FDA). The FDA did not state what quantity was contained in each shipment but the 13 shipments rejected included mixed spices and seasonings, as well as fenugreek, according to the data. In fiscal 2022-23, about 15% of 119 MDH shipments were rejected mostly for salmonella contamination, while the rejections stood at 8.19% during 2021-22, the data showed. Everest has had fewer rejections in the United States with just one of 450 shipments in the ongoing 2023-24 year having been rejected so far for salmonella. Around 3.7% of Everest's U.S. shipments were halted in 2022-23 and there were no rejections in the 189 shipments to the U.S. the year before, the data showed. In response to queries on the FDA data, an MDH spokesperson said its products are safe. Everest said it had an 'exceptional' rejection rate of its U.S. shipments of less than 1% in fiscal 2023-2024, adding that their products are safe. The U.S. FDA and the Spices Board did not respond to requests for comment. The Board has been inspecting MDH and Everest facilities for compliance with quality standards, but the results have not yet been made public. For decades, MDH and Everest have been among the biggest spice makers in India, making products widely used in home kitchens and restaurants for flavouring curries and many dishes. In 2019, a few batches of MDH's spice mix were taken off the shelves in the U.S. for salmonella contamination and in 2023, the FDA recalled a few of Everest's products over similar findings and issued a public health alert. ","cleaned_content":"popular indian spice brand mdh under scrutiny for alleged contamination in some products has since \u003cTWO_THOUSAND\u003e seen an average \u003cONE_TEN_PERCENT\u003e of its u s shipments rejected due to the presence of bacteria a reuters analysis of u s regulatory data found hong kong suspended sales last month of three spice blends made by mdh and one by another indian company everest for apparently containing high levels of a cancer causing pesticide ethylene oxide is unfit for human consumption and a cancer risk with long exposure the companies have said their products are safe and mdh added it does not use ethylene oxide at any stage of storing processing or packing of spices authorities in the united states australia and india are looking into the matter both brands are popular in india and are exported around the world before the latest scrutiny products from mdh a family run indian company more than \u003cONE_HUNDRED\u003e years old were rejected for sale in the united states due to the presence of salmonella a bacteria that can lead to gastrointestinal illness around \u003cTWO_TEN_PERCENT\u003e or \u003cONE_TEN\u003e of mdhs \u003cSIX_TEN\u003e shipments to the united states were rejected after it failed checks for salmonella between october \u003cTWO_THOUSAND\u003e when the current fiscal year started and may \u003cTHREE_\u003e according to the latest available data compiled by reuters from the u s food and drug administration fda the fda did not state what quantity was contained in each shipment but the \u003cONE_TEN\u003e shipments rejected included mixed spices and seasonings as well as fenugreek according to the data in fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e about \u003cONE_TEN_PERCENT\u003e of \u003cONE_HUNDRED\u003e mdh shipments were rejected mostly for salmonella contamination while the rejections stood at \u003cEIGHT_PERCENT\u003e during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the data showed everest has had fewer rejections in the united states with just one of \u003cFOUR_HUNDRED\u003e shipments in the ongoing \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e year having been rejected so far for salmonella around \u003cTHREE_PERCENT\u003e of everests u s shipments were halted in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e and there were no rejections in the \u003cONE_HUNDRED\u003e shipments to the u s the year before the data showed in response to queries on the fda data an mdh spokesperson said its products are safe everest said it had an exceptional rejection rate of its u s shipments of less than \u003cONE_PERCENT\u003e in fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e adding that their products are safe the u s fda and the spices board did not respond to requests for comment the board has been inspecting mdh and everest facilities for compliance with quality standards but the results have not yet been made public for decades mdh and everest have been among the biggest spice makers in india making products widely used in home kitchens and restaurants for flavouring curries and many dishes in \u003cTWO_THOUSAND\u003e a few batches of mdhs spice mix were taken off the shelves in the u s for salmonella contamination and in \u003cTWO_THOUSAND\u003e the fda recalled a few of everests products over similar findings and issued a public health alert","timestamp":"2024-05-13T06:08:00+05:30","market_timestamp":"2024-05-13T09:15:00+05:30","off_market_hours":true}