{"url":"https://www.moneycontrol.com/news/business/lg-looks-to-enhance-leadership-in-tv-segment-with-products-tailored-for-india-12722777.html","title":"LG looks to enhance leadership in TV segment with products tailored for India","description":"LG Electronics India, which on Wednesday launched 55 AI-enabled television models, expects to grow 25-30 per cent this year in its home entertainment (HE) vertical.LG looks to enhance leadership in TV segment with products tailored for IndiaRelated stories","content":"Korean consumer electronics major LG will continue to introduce products in the home entertainment segment tailored for India to maintain its leadership position, according to senior company officials. LG Electronics India, which on Wednesday launched 55 AI-enabled television models, expects to grow 25-30 per cent this year in its home entertainment (HE) vertical. India is the most important market globally, a company official said. The company plans to enhance its India-specific product lineups. \"LG Electronics thinking about the Indian market is not one of the important markets, but it is the most important market,\" LG Electronics India Director HE, Brian Jung told PTI. Compared with the European and American TV market where most of the products have moved up to OLED technology, the Indian market is a bit different with LED technology still dominant, he added. \"So, we are trying to deliver our product to the Indian consumer which is a 'picked' product,\" Jung said. He however said the Indian market has witnessed a rapid evolution in terms of screen size and also on technology. \"The Indian market is growing very rapidly and by quantity and by quality,\" he added. LG has market leadership in India in the television segment with 27.1 per cent, he said, adding that the brand is loved by consumers in the country \"especially in the home entertainment category and we will keep to uphold it.\" The Indian television market is estimated to be around Rs 28,000 crore annually. When asked about the growth outlook, LG Electronics India Business Head, Home Entertainment Abhiral Bhansali said, \"Last year was also good for us. This year we are targeting roughly about 25 to 30 per cent growth versus last year.\" In the HE segment, the company clocked revenue of Rs 8,000 crore last year. The company has a TV production capacity of 30 lakh units annually at its Pune plant. ","cleaned_content":"korean consumer electronics major lg will continue to introduce products in the home entertainment segment tailored for india to maintain its leadership position according to senior company officials lg electronics india which on wednesday launched \u003cFIVE_TEN\u003e ai enabled television models expects to grow \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e this year in its home entertainment he vertical india is the most important market globally a company official said the company plans to enhance its india specific product lineups lg electronics thinking about the indian market is not one of the important markets but it is the most important market lg electronics india director he brian jung told pti compared with the european and american tv market where most of the products have moved up to oled technology the indian market is a bit different with led technology still dominant he added so we are trying to deliver our product to the indian consumer which is a picked product jung said he however said the indian market has witnessed a rapid evolution in terms of screen size and also on technology the indian market is growing very rapidly and by quantity and by quality he added lg has market leadership in india in the television segment with \u003cTWO_TEN_PERCENT\u003e he said adding that the brand is loved by consumers in the country especially in the home entertainment category and we will keep to uphold it the indian television market is estimated to be around rs \u003cTWO_TEN_THOUSAND\u003e crore annually when asked about the growth outlook lg electronics india business head home entertainment abhiral bhansali said last year was also good for us this year we are targeting roughly about \u003cTWO_TEN\u003e to \u003cTHREE_TEN_PERCENT\u003e growth versus last year in the he segment the company clocked revenue of rs \u003cEIGHT_THOUSAND\u003e crore last year the company has a tv production capacity of \u003cTHREE_TEN\u003e lakh units annually at its pune plant","timestamp":"2024-05-15T14:25:00+05:30","market_timestamp":"2024-05-15T14:25:00+05:30","off_market_hours":false}