{"url":"https://www.moneycontrol.com/technology/zee-entertainment-earnings-profit-article-12724739.html","title":"Zee Entertainment swings back to black with Rs 13 crore profit in Q4FY24","description":"The company had reported a loss of Rs 196 crore in the year-ago period.Zee Entertainment reported its Q4 FY24 results on May 17. Related stories","content":"Digital and broadcasting media company Zee Entertainment reported a profit of Rs 13 crore in the March quarter of FY24, after reporting a loss of Rs 196 crore in the year-ago period. However, sequentially the March quarter of FY24 remained muted. The company has reported a profit of Rs 58.5 crore in Q3 FY24. It reported total income of Rs 2,185.29 crore, up from Rs 2,126.35 crore during the same period a year ago, the company said on May 17. \"Domestic advertising revenue for the quarter grew by 10.6 percent year-on-year (YoY) driven by the continued recovery in macro advertising environment and spending pickup by FMCG clients,\" the company said. Analysts had expected Zee to report a 3 percent decline in advertising revenue in Q4. In FY24, Zee's ad revenue was marginally down to Rs 4057.7 crore from Rs 4057.9 crore. At 15:59, the stock was trading at Rs 134.95 on National Stock Exchange (NSE), up 1.4 percent from the previous close. For the full year of FY24, the broadcaster's profit stood at Rs 141.43 crore crore versus Rs 47.79 crore in FY23. Its network share went up in the last fiscal year to 17.1 percent from 16.8 percent in FY23. Revenue from its streaming platform Zee5 improved marginally in Q4 FY24 to Rs 237.2 crore from Rs 220 crore during the same period a year ago. In FY24, the over the top (OTT) platform's revenue increased to Rs 919.5 crore from Rs 741.1 crore in FY23. The streaming platform had released 16 shows and movies released in Q4.  ","cleaned_content":"digital and broadcasting media company zee entertainment reported a profit of rs \u003cONE_TEN\u003e crore in the march quarter of fy24 after reporting a loss of rs \u003cONE_HUNDRED\u003e crore in the year ago period however sequentially the march quarter of fy24 remained muted the company has reported a profit of rs \u003cFIVE_TEN\u003e crore in q3 fy24 it reported total income of rs \u003cTWO_THOUSAND\u003e crore up from rs \u003cTWO_THOUSAND\u003e crore during the same period a year ago the company said on may \u003cONE_TEN\u003e domestic advertising revenue for the quarter grew by \u003cONE_TEN_PERCENT\u003e year on year yoy driven by the continued recovery in macro advertising environment and spending pickup by fmcg clients the company said analysts had expected zee to report a \u003cTHREE_PERCENT\u003e decline in advertising revenue in q4 in fy24 zees ad revenue was marginally down to rs \u003cFOUR_THOUSAND\u003e crore from rs \u003cFOUR_THOUSAND\u003e crore at \u003cONE_TEN\u003e \u003cFIVE_TEN\u003e the stock was trading at rs \u003cONE_HUNDRED\u003e on national stock exchange nse up \u003cONE_PERCENT\u003e from the previous close for the full year of fy24 the broadcasters profit stood at rs \u003cONE_HUNDRED\u003e crore crore versus rs \u003cFOUR_TEN\u003e crore in fy23 its network share went up in the last fiscal year to \u003cONE_TEN_PERCENT\u003e from \u003cONE_TEN_PERCENT\u003e in fy23 revenue from its streaming platform zee5 improved marginally in q4 fy24 to rs \u003cTWO_HUNDRED\u003e crore from rs \u003cTWO_HUNDRED\u003e crore during the same period a year ago in fy24 the over the top ott platforms revenue increased to rs \u003cNINE_HUNDRED\u003e crore from rs \u003cSEVEN_HUNDRED\u003e crore in fy23 the streaming platform had released \u003cONE_TEN\u003e shows and movies released in q4","timestamp":"2024-05-17T17:23:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}