{"url":"https://www.moneycontrol.com/news/business/gland-pharma-gets-usfda-nod-for-generic-edaravone-injection-12716439.html","title":"Gland Pharma gets USFDA nod for generic Edaravone injection","description":"The approval by the US Food and Drug Administration (USFDA) is for Edaravone injection of strengths 30 mg/100 ml and 60 mg/100 ml single-dose bags, Gland Pharma said in a regulatory filing.Gland Pharma gets USFDA nod for generic Edaravone injection","content":"Gland Pharma Ltd on Tuesday said it has received approval from the US health regulator for its generic Edaravone injection to treat amyotrophic lateral sclerosis. The approval by the US Food and Drug Administration (USFDA) is for Edaravone injection of strengths 30 mg/100 ml and 60 mg/100 ml single-dose bags, Gland Pharma said in a regulatory filing. The company expects to launch the product through its marketing partner within FY25, it added. Edaravone injection is used to treat amyotrophic lateral sclerosis (ALS), a condition in which the nerves that control muscle movement slowly die, causing the muscles to shrink and weaken. It had sales of approximately USD 19 million in the US for the 12 months ended January 2024, Gland Pharma said citing IQVIA data. ","cleaned_content":"gland pharma ltd on tuesday said it has received approval from the us health regulator for its generic edaravone injection to treat amyotrophic lateral sclerosis the approval by the us food and drug administration usfda is for edaravone injection of strengths \u003cTHREE_TEN\u003e mg \u003cONE_HUNDRED\u003e ml and \u003cSIX_TEN\u003e mg \u003cONE_HUNDRED\u003e ml single dose bags gland pharma said in a regulatory filing the company expects to launch the product through its marketing partner within fy25 it added edaravone injection is used to treat amyotrophic lateral sclerosis als a condition in which the nerves that control muscle movement slowly die causing the muscles to shrink and weaken it had sales of approximately usd \u003cONE_TEN\u003e million in the us for the \u003cONE_TEN\u003e months ended january \u003cTWO_THOUSAND\u003e gland pharma said citing iqvia data","timestamp":"2024-05-07T13:02:00+05:30","market_timestamp":"2024-05-07T13:02:00+05:30","off_market_hours":false}