{"url":"https://www.moneycontrol.com/news/business/tech-mahindra-fuji-tv-ink-pact-to-produce-content-globally-12730357.html","title":"Tech Mahindra, Fuji TV ink pact to produce content globally","description":"The partnership will combine Fuji TV's original content with Tech Mahindra's localisation and animation services, according to a company statement.Tech Mahindra, Fuji TV ink pact to produce content globally","content":"IT company Tech Mahindra on Thursday said it has partnered with Japanese broadcaster Fuji TV to develop and produce content across genres for the global entertainment industry. The partnership will combine Fuji TV's original content with Tech Mahindra's localisation and animation services, according to a company statement. \"We have partnered with Fuji TV to bring their content library in various local languages to Indian audiences...We see great potential in developing IPs catering to the Indian, Japanese, and other major content markets,\" Harshvendra Soin, President, Asia Pacific and Japan Business, Tech Mahindra, said. It will also help Fuji TV in licensing its content to OTT and PayTV platforms in India and Japan. Fuji Television Network executive vice president Toru Ota said the goal is to not only expand business in the Indian market but also to create innovative content that has the potential for global reach. ","cleaned_content":"it company tech mahindra on thursday said it has partnered with japanese broadcaster fuji tv to develop and produce content across genres for the global entertainment industry the partnership will combine fuji tvs original content with tech mahindras localisation and animation services according to a company statement we have partnered with fuji tv to bring their content library in various local languages to indian audiences we see great potential in developing ips catering to the indian japanese and other major content markets harshvendra soin president asia pacific and japan business tech mahindra said it will also help fuji tv in licensing its content to ott and paytv platforms in india and japan fuji television network executive vice president toru ota said the goal is to not only expand business in the indian market but also to create innovative content that has the potential for global reach","timestamp":"2024-05-23T12:48:00+05:30","market_timestamp":"2024-05-23T12:48:00+05:30","off_market_hours":false}