{"url":"https://www.moneycontrol.com/news/business/ups-to-make-some-parcel-tracking-tags-in-india-executive-says-12735419.html","title":"UPS to make some parcel-tracking tags in India, executive says","description":"Semiconductor manufacturing is among Prime Minister Narendra Modi's key business agendas as he pursues an ambition of making the country a chipmaker for the world, even though the Indian government faced setbacks in its initial bid to offer $10 billion in incentives to the industry.UPS to make some parcel-tracking tags in India, executive saysRelated stories","content":"United Parcel Service, the world's biggest parcel delivery firm, is in talks with several Indian state governments to make some of the tags used in tracking packages in the Asian country, a senior executive told Reuters on Wednesday. Semiconductor manufacturing is among Prime Minister Narendra Modi's key business agendas as he pursues an ambition of making the country a chipmaker for the world, even though the Indian government faced setbacks in its initial bid to offer $10 billion in incentives to the industry. \"We are working with potential partners ... What we are trying to do in India is leverage the semiconductor investments the government is making,\" Chief Digital and Technology Officer Bala Subramanian said in an interview. \"For every place across the world we'll be actually building ... the tags in India,\" Subramanian said, without giving details on the investment size or when it would begin manufacturing, adding it is \"too early\" to discuss such details. Reuters could not immediately verify where UPS makes the RFID tags it currently uses. UPS does not currently have any manufacturing capability in India, though it opened in August its first technology centre in Chennai, Tamil Nadu, which complements its existing U.S. and European teams to develop in-house technology. \"We will continue to grow (in Chennai),\" Subramanian, who was previously the digital chief for Best Buy and AT\u0026T, said. ","cleaned_content":"united parcel service the worlds biggest parcel delivery firm is in talks with several indian state governments to make some of the tags used in tracking packages in the asian country a senior executive told reuters on wednesday semiconductor manufacturing is among prime minister narendra modis key business agendas as he pursues an ambition of making the country a chipmaker for the world even though the indian government faced setbacks in its initial bid to offer \u003cONE_TEN\u003e billion in incentives to the industry we are working with potential partners what we are trying to do in india is leverage the semiconductor investments the government is making chief digital and technology officer bala subramanian said in an interview for every place across the world well be actually building the tags in india subramanian said without giving details on the investment size or when it would begin manufacturing adding it is too early to discuss such details reuters could not immediately verify where ups makes the rfid tags it currently uses ups does not currently have any manufacturing capability in india though it opened in august its first technology centre in chennai tamil nadu which complements its existing u s and european teams to develop in house technology we will continue to grow in chennai subramanian who was previously the digital chief for best buy and at t said","timestamp":"2024-05-29T12:46:00+05:30","market_timestamp":"2024-05-29T12:46:00+05:30","off_market_hours":false}