{"url":"https://www.moneycontrol.com/news/business/lt-dispatches-ethylene-oxide-reactors-to-china-12729348.html","title":"L\u0026T dispatches ethylene oxide reactors to China","description":"The reactors were dispatched by the heavy engineering vertical of Larsen \u0026 Toubro (L\u0026T) for a project of chemical giant BASF in China, the company said in a statement.L\u0026T dispatches ethylene oxide reactors to China","content":"Infrastructure major Larsen \u0026 Toubro (L\u0026T) on Wednesday said it has dispatched the world's heaviest ethylene oxide reactors -- a crucial component in petrochemical plants -- to China. The reactors were dispatched by the heavy engineering vertical of Larsen \u0026 Toubro (L\u0026T) for a project of chemical giant BASF in China, the company said in a statement. \"I thank BASF for giving L\u0026T the opportunity to supply the most critical reactors for its prestigious project,\" Anil V Parab, whole-time Director \u0026 Senior Executive Vice President, L\u0026T Heavy Engineering and L\u0026T Valves said. \"This equipment... are the biggest EO Reactors ever built in almost 160 years of BASF history. These are critical supplies to the petrochemical project at Verbund in Zhanjiang to support the growth of the chemical market in China,\" Joachim Thiel, Senior Vice President \u0026 Senior Project Management New Verbund, BASF China said. Larsen \u0026 Toubro is a USD 27 billion dollar domestic multinational company engaged in engineering, procurement and construction (EPC) projects, hi-tech manufacturing and services. ","cleaned_content":"infrastructure major larsen toubro l t on wednesday said it has dispatched the worlds heaviest ethylene oxide reactors a crucial component in petrochemical plants to china the reactors were dispatched by the heavy engineering vertical of larsen toubro l t for a project of chemical giant basf in china the company said in a statement i thank basf for giving l t the opportunity to supply the most critical reactors for its prestigious project anil v parab whole time director senior executive vice president l t heavy engineering and l t valves said this equipment are the biggest eo reactors ever built in almost \u003cONE_HUNDRED\u003e years of basf history these are critical supplies to the petrochemical project at verbund in zhanjiang to support the growth of the chemical market in china joachim thiel senior vice president senior project management new verbund basf china said larsen toubro is a usd \u003cTWO_TEN\u003e billion dollar domestic multinational company engaged in engineering procurement and construction epc projects hi tech manufacturing and services","timestamp":"2024-05-22T13:06:00+05:30","market_timestamp":"2024-05-22T13:06:00+05:30","off_market_hours":false}