{"url":"https://www.moneycontrol.com/news/business/expect-sales-to-grow-faster-than-industry-this-fiscal-jlr-india-12733183.html","title":"Expect sales to grow faster than industry this fiscal: JLR India","description":"The company, which is set to commence local assembly of Range Rover and Range Rover Sport in India, witnessed a sales growth of 81 per cent in 2023-24 fiscal year at 4,436 units, as compared to FY23.Expect sales to grow faster than industry this fiscal: JLR IndiaRelated stories","content":"Tata Motors owned Jaguar Land Rover expects to grow faster than the luxury car segment this fiscal, as it bolsters localisation and expands product range, according to a top company executive. The company, which is set to commence local assembly of Range Rover and Range Rover Sport in India, witnessed a sales growth of 81 per cent in 2023-24 fiscal year at 4,436 units, as compared to FY23. The automaker aims to double its business in India over the next three years. Initiatives like enhanced localisation of products, which would lead to reduction in prices and expansion of sales network in the country would help the company in growing faster than the industry, he added. Citing reports, Amba noted that the number of high net-worth individuals (HNIs) is expected to double between 2023 and 2027 and thus there's so much headroom for the growth of the premium-end car segment, he stated. He noted that in five years time, the domestic luxury car segment should double from the current size of 48,000 units per annum. \"So as we build up and put more and more cars on the road and get more and more visibility for our cars, that will add to the desirability and in the growth of the brand,\" Amba said. It is a sequential process as the automaker continues to create various experiences like the Range Rover House and expands its sales network, he stated. \"And as we grow bigger in size, we also then start to get new allocations (from HQ),\" he said. Amba noted that the company plans to keep introducing both internal combustion engine and battery electric vehicles to cater to the customer demand. \"We are not shying away from bringing everything that is being offered outside into India because you're just finding tremendous consumer support,\" he added. When asked about the sales network, Amba said the company would be undertaking expansion in new regions. \"We will be expanding, we have been largely constant for the last four or five years with 25 showrooms. But now's the time to start looking at expansion,\" he said. He, however, did not elaborate on the number of the outlets the automaker intends to set up going ahead. \"We are not in a hurry to grow the brand. We want to grow it steadily and make sure that our partners are happy and profitable. We are only in 21 cities so there's so much scope,\" Amba said. ","cleaned_content":"tata motors owned jaguar land rover expects to grow faster than the luxury car segment this fiscal as it bolsters localisation and expands product range according to a top company executive the company which is set to commence local assembly of range rover and range rover sport in india witnessed a sales growth of \u003cEIGHT_TEN_PERCENT\u003e in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal year at \u003cFOUR_THOUSAND\u003e units as compared to fy23 the automaker aims to double its business in india over the next three years initiatives like enhanced localisation of products which would lead to reduction in prices and expansion of sales network in the country would help the company in growing faster than the industry he added citing reports amba noted that the number of high net worth individuals hnis is expected to double between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e and thus theres so much headroom for the growth of the premium end car segment he stated he noted that in five years time the domestic luxury car segment should double from the current size of \u003cFOUR_TEN_THOUSAND\u003e units per annum so as we build up and put more and more cars on the road and get more and more visibility for our cars that will add to the desirability and in the growth of the brand amba said it is a sequential process as the automaker continues to create various experiences like the range rover house and expands its sales network he stated and as we grow bigger in size we also then start to get new allocations from hq he said amba noted that the company plans to keep introducing both internal combustion engine and battery electric vehicles to cater to the customer demand we are not shying away from bringing everything that is being offered outside into india because youre just finding tremendous consumer support he added when asked about the sales network amba said the company would be undertaking expansion in new regions we will be expanding we have been largely constant for the last four or five years with \u003cTWO_TEN\u003e showrooms but nows the time to start looking at expansion he said he however did not elaborate on the number of the outlets the automaker intends to set up going ahead we are not in a hurry to grow the brand we want to grow it steadily and make sure that our partners are happy and profitable we are only in \u003cTWO_TEN\u003e cities so theres so much scope amba said","timestamp":"2024-05-27T13:52:00+05:30","market_timestamp":"2024-05-27T13:52:00+05:30","off_market_hours":false}