{"url":"https://www.moneycontrol.com/news/india/deloitte-opens-phygital-innovation-centre-in-bengaluru-to-boost-businesses-12735323.html","title":"Deloitte opens 'phygital' innovation centre in Bengaluru to boost businesses","description":"This phygital (physical+digital) Innovation centre offers domain-specific solutions to help businesses reduce costs and increase efficiency.Deloitte opens 'phygital' innovation centre in Bengaluru to boost businessesRelated stories","content":"The largest professional services network, Deloitte, has opened a first-of-its-kind 'phygital' innovation centre in Bengaluru. This phygital (physical+digital) Innovation centre offers domain-specific solutions to help businesses reduce costs and increase efficiency. The Centre of Innovation and Technology (DCIT) aims to help customers find new and sustainable ways to grow their businesses, and induce a \"culture of innovation\", said Ashvin Vellody, Partner and Strategy, Innovation, and Assets Leader, Deloitte India. It will also provide end-to-end support to businesses via \"advice-implement-operate\", he added. The centre spans across 12,500 square feet and consists of five zones: retail, manufacturing, digital studio, immersive, and advanced connectivity. \"Our centre aims to assist businesses across industries in reimagining their customer interfaces and experiences, supply chains, and product development by creating diverse prototypes. \"The new phygital experience and innovation centre showcase how cutting-edge technology, connected through 5G and the use of AI, can bridge visionary ideas with the delivery of high-quality products and services,\" Vellody said. He stressed the importance of \"co-creation\", stating that Deloitte aims to bring the entire ecosystem together for this endeavour. \"We don't want to do this alone, it is a co-creation journey. Not just clients, but all our ecosystem and alliance partners will be part of this journey,\" he said, adding that DCIT has more than 60 use cases across sectors like retail, manufacturing, and healthcare, among others. Further, Vellody said the use cases will be refreshed every 90 days. He further said DCIT uses mixed reality, immersive reality, and augmented reality to provide hands-on real-time experiences to clients. He noted that knowing the expected results is key for novel business ideas. DCIT will test situations beforehand for proper understanding and articulation, ensuring relevance to the business and sector before deployment, he said. DCIT is also connecting with the academia to provide stimulus to innovation, in the likes of IIT Delhi and IIT Madras, said Vellody. ","cleaned_content":"the largest professional services network deloitte has opened a first of its kind phygital innovation centre in bengaluru this phygital physical digital innovation centre offers domain specific solutions to help businesses reduce costs and increase efficiency the centre of innovation and technology dcit aims to help customers find new and sustainable ways to grow their businesses and induce a culture of innovation said ashvin vellody partner and strategy innovation and assets leader deloitte india it will also provide end to end support to businesses via advice implement operate he added the centre spans across \u003cONE_TEN_THOUSAND\u003e square feet and consists of five zones retail manufacturing digital studio immersive and advanced connectivity our centre aims to assist businesses across industries in reimagining their customer interfaces and experiences supply chains and product development by creating diverse prototypes the new phygital experience and innovation centre showcase how cutting edge technology connected through \u003cFIVE_\u003e g and the use of ai can bridge visionary ideas with the delivery of high quality products and services vellody said he stressed the importance of co creation stating that deloitte aims to bring the entire ecosystem together for this endeavour we dont want to do this alone it is a co creation journey not just clients but all our ecosystem and alliance partners will be part of this journey he said adding that dcit has more than \u003cSIX_TEN\u003e use cases across sectors like retail manufacturing and healthcare among others further vellody said the use cases will be refreshed every \u003cNINE_TEN\u003e days he further said dcit uses mixed reality immersive reality and augmented reality to provide hands on real time experiences to clients he noted that knowing the expected results is key for novel business ideas dcit will test situations beforehand for proper understanding and articulation ensuring relevance to the business and sector before deployment he said dcit is also connecting with the academia to provide stimulus to innovation in the likes of iit delhi and iit madras said vellody","timestamp":"2024-05-29T12:01:00+05:30","market_timestamp":"2024-05-29T12:01:00+05:30","off_market_hours":false}