{"url":"https://www.moneycontrol.com/news/business/waaree-energies-to-supply-445-mw-solar-modules-to-statkraft-india-12730363.html","title":"Waaree Energies to supply 445 MW solar modules to Statkraft India","description":"Waaree Energies is set to illuminate single-location solar projects in Bikaner, Rajasthan, with a supply of 445 MW of its 540/545Wp dual glass bifacial modules, a company statement said.Waaree Energies to supply 445 MW solar modules to Statkraft India","content":"Solar solutions provider Waaree Energies on Thursday said the company will supply 445 MW solar modules to Statkraft India. Waaree Energies is set to illuminate single-location solar projects in Bikaner, Rajasthan, with a supply of 445 MW of its 540/545Wp dual glass bifacial modules, a company statement said. Scheduled for delivery between May and August 2024, this contract highlights Waaree Energies' vision to contribute towards revolutionizing India's renewable energy landscape, meeting its growing power demand, and to support the nation's transition towards its net-zero goals, it stated. The deployment of Waaree's bifacial solar modules is expected to amplify the region's renewable energy capacity, it claimed. ","cleaned_content":"solar solutions provider waaree energies on thursday said the company will supply \u003cFOUR_HUNDRED\u003e mw solar modules to statkraft india waaree energies is set to illuminate single location solar projects in bikaner rajasthan with a supply of \u003cFOUR_HUNDRED\u003e mw of its \u003cFIVE_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e wp dual glass bifacial modules a company statement said scheduled for delivery between may and august \u003cTWO_THOUSAND\u003e this contract highlights waaree energies vision to contribute towards revolutionizing indias renewable energy landscape meeting its growing power demand and to support the nations transition towards its net zero goals it stated the deployment of waarees bifacial solar modules is expected to amplify the regions renewable energy capacity it claimed","timestamp":"2024-05-23T12:51:00+05:30","market_timestamp":"2024-05-23T12:51:00+05:30","off_market_hours":false}