{"url":"https://www.moneycontrol.com/news/business/govt-may-look-at-addressing-inverted-duty-structures-in-washing-machines-solar-glass-air-purifiers-12729410.html","title":"Govt may look at addressing inverted duty structures in washing machines, solar glass, air purifiers","description":"Inverted duty structure refers to taxation on inputs at higher rates than finished products that result in the build-up of credits and cascading costs.Govt may look at addressing inverted duty structures in washing machines, solar glass, air purifiers","content":"The government is likely to consider addressing the issue of inverted duty structure for certain products like paper, furniture, washing machines, solar glass, and air purifiers to promote domestic manufacturing, an official has said. Inverted duty structure refers to taxation on inputs at higher rates than finished products that result in the build-up of credits and cascading costs. The official said the Commerce and Industry Ministry has shared a list of products with the Finance Ministry to look at the inverted duty structure issues. \"We have already sent the list to the Finance Ministry. The list includes products such as paper, furniture, washing machines, solar glass, air purifiers, and some cases in apparel and jewellery also,\" the official said. Inverted duty structure impacts the domestic industry, as manufacturers have to pay a higher price for raw materials in terms of duty, while the finished products land at lower duty and cost. Expensive inputs make products costly and cannot compete in the export market. In the domestic market, such products are prone to cheaper imports. Addressing this duty issue would help the competitiveness of domestic exporters and that, in turn, will help increase shipments and promote manufacturing. ","cleaned_content":"the government is likely to consider addressing the issue of inverted duty structure for certain products like paper furniture washing machines solar glass and air purifiers to promote domestic manufacturing an official has said inverted duty structure refers to taxation on inputs at higher rates than finished products that result in the build up of credits and cascading costs the official said the commerce and industry ministry has shared a list of products with the finance ministry to look at the inverted duty structure issues we have already sent the list to the finance ministry the list includes products such as paper furniture washing machines solar glass air purifiers and some cases in apparel and jewellery also the official said inverted duty structure impacts the domestic industry as manufacturers have to pay a higher price for raw materials in terms of duty while the finished products land at lower duty and cost expensive inputs make products costly and cannot compete in the export market in the domestic market such products are prone to cheaper imports addressing this duty issue would help the competitiveness of domestic exporters and that in turn will help increase shipments and promote manufacturing","timestamp":"2024-05-22T14:11:00+05:30","market_timestamp":"2024-05-22T14:11:00+05:30","off_market_hours":false}