{"url":"https://www.moneycontrol.com/news/business/billionaire-mukesh-ambani-sets-sights-on-africa-with-telecom-venture-12732567.html","title":"Reliance Industries' Mukesh Ambani sets sights on Africa with telecom venture","description":"NGIC, which is planning to begin operations by the end of this year, will provide 5G broadband services to mobile operators and internet services providers in Ghana.Billionaire Mukesh Ambani sets sights on Africa with telecom ventureRelated stories","content":"Asia’s richest man Mukesh Ambani is set to enter Africa with a telecoms venture, seeking to win mobile broadband customers in a high-growth market. Radisys Corp., a unit of Ambani-controlled Reliance Industries Ltd., will provide key network infrastructure, applications and smartphones for Ghana-based Next-Gen InfraCo., according to Harkirit Singh, the executive director of NGIC. He described the plans ahead of NGIC’s launch announcement on Monday in Mumbai, India’s financial hub. NGIC, which is planning to begin operations by the end of this year, will provide 5G broadband services to mobile operators and internet services providers in Ghana. Other strategic partners in NGIC include Nokia Oyj, Indian outsourcer Tech Mahindra Ltd. and Microsoft Corp., which has increasingly sharpened its focus on the telecoms business following an acquisition of two cloud networking firms in 2020. Ghana, a West African country with a population of just over 33 million, has three main operators: MTN Ghana, Vodafone Ghana and state-run AirtelTigo. NGIC’s strategic partners, its technological prowess and the company’s possession of Ghana’s only 5G license will help it build broadband services at scale, a huge expense for individual mobile carriers, Singh said. Two African telecoms firms — Ascend Digital Solutions Ltd. and K-NET — hold a combined stake of 55% in the new company, said Singh. The Ghana government will own just under 10% of NGIC, while local mobile operators and private investors will retain the remaining shares in the firm. Singh is also the chief executive of Ascend. NGIC has the exclusive right to offer 5G services in Ghana for a decade, though its license is valid for 15 years. The company’s capital expenditure for three years is $145 million, according to Singh. The company is looking to emulate the success of Ambani’s Jio Infocomm Ltd. in India. Jio launched telecoms services in India in late 2016 with low-cost data and free voice calling, forcing some rivals to shut down and others to consolidate. It is widely credited for making mobile data affordable to hundreds of million of Indians. Jio is currently India’s biggest mobile operator with 470 million users. NGIC will provide “affordable mobile broadband services and devices to the people of Ghana, replicating the success of India’s low-cost mobile data revolution,” Ghana’s Minister for Communications and Digitalization Ursula Owusu-Ekuful said in a statement. The Reliance-NGIC partnership is also a diplomatic win for India, which has sought to counter China’s surging influence in Africa via measures such as digital inclusion. None of the strategic partners, including Reliance, currently own any equity in NGIC. But the company will give them an option to accept part of their payments as equity in the future, Singh said. “First we have to be successful to show the value that we create before they come in,” Singh said. “That’s the discussion we’re having with them.” Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"asia s richest man mukesh ambani is set to enter africa with a telecoms venture seeking to win mobile broadband customers in a high growth market radisys corp a unit of ambani controlled reliance industries ltd will provide key network infrastructure applications and smartphones for ghana based next gen infraco according to harkirit singh the executive director of ngic he described the plans ahead of ngic s launch announcement on monday in mumbai india s financial hub ngic which is planning to begin operations by the end of this year will provide \u003cFIVE_\u003e g broadband services to mobile operators and internet services providers in ghana other strategic partners in ngic include nokia oyj indian outsourcer tech mahindra ltd and microsoft corp which has increasingly sharpened its focus on the telecoms business following an acquisition of two cloud networking firms in \u003cTWO_THOUSAND\u003e ghana a west african country with a population of just over \u003cTHREE_TEN\u003e million has three main operators mtn ghana vodafone ghana and state run airteltigo ngic s strategic partners its technological prowess and the company s possession of ghana s only \u003cFIVE_\u003e g license will help it build broadband services at scale a huge expense for individual mobile carriers singh said two african telecoms firms ascend digital solutions ltd and k net hold a combined stake of \u003cFIVE_TEN_PERCENT\u003e in the new company said singh the ghana government will own just under \u003cONE_TEN_PERCENT\u003e of ngic while local mobile operators and private investors will retain the remaining shares in the firm singh is also the chief executive of ascend ngic has the exclusive right to offer \u003cFIVE_\u003e g services in ghana for a decade though its license is valid for \u003cONE_TEN\u003e years the company s capital expenditure for three years is \u003cONE_HUNDRED\u003e million according to singh the company is looking to emulate the success of ambani s jio infocomm ltd in india jio launched telecoms services in india in late \u003cTWO_THOUSAND\u003e with low cost data and free voice calling forcing some rivals to shut down and others to consolidate it is widely credited for making mobile data affordable to hundreds of million of indians jio is currently india s biggest mobile operator with \u003cFOUR_HUNDRED\u003e million users ngic will provide affordable mobile broadband services and devices to the people of ghana replicating the success of india s low cost mobile data revolution ghana s minister for communications and digitalization ursula owusu ekuful said in a statement the reliance ngic partnership is also a diplomatic win for india which has sought to counter china s surging influence in africa via measures such as digital inclusion none of the strategic partners including reliance currently own any equity in ngic but the company will give them an option to accept part of their payments as equity in the future singh said first we have to be successful to show the value that we create before they come in singh said that s the discussion we re having with them disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-05-27T08:39:00+05:30","market_timestamp":"2024-05-27T09:15:00+05:30","off_market_hours":true}