{"url":"https://www.moneycontrol.com/technology/auto/mg-motor-india-signs-pact-with-vertelo-to-deliver-3000-evs-article-12730339.html","title":"MG Motor India signs pact with Vertelo to deliver 3,000 EVs","description":"The partnership will focus on providing sustainable mobility solutions to riders and will also work towards establishing a robust EV charging infrastructure in the country, MG Motor India said in a statement.Gaurav Gupta, Chief Growth Officer, MG India \u0026 Sandeep Gambhir, Chief Executive Officer, VerteloRelated stories","content":"MG Motor India on Thursday said it has signed an initial pact to deliver 3,000 EVs to integrated fleet electrification platform Vertelo in a phased manner. Both the entities have signed a memorandum of understanding to this effect. The partnership will focus on providing sustainable mobility solutions to riders and will also work towards establishing a robust EV charging infrastructure in the country, MG Motor India said in a statement. Vertelo is a fleet electrification platform that aims at providing end-to-end solutions to operators and corporates. It has been established by Macquarie Asset Management and has received anchor investment from the Green Climate Fund which has committed to invest up to USD 200 million. \"This partnership with MG Motor India to purchase around 3,000 electric cars, marks the beginning of an exciting journey for both organisations with a common goal of accelerating fleet electrification and achieving Net-zero emissions,\" Vertelo CEO, Sandeep Gambhir said. The range of electric vehicles that MG Motor plans to bring in India over the next few years coupled with Vertelo's integrated electrification solutions for fleet operators and corporates will go a long way in accelerating the shift towards a more sustainable transportation ecosystem, he added. MG Motor India's current EV lineup includes the small electric car 'Comet' and SUV 'ZS EV'. ","cleaned_content":"mg motor india on thursday said it has signed an initial pact to deliver \u003cTHREE_THOUSAND\u003e evs to integrated fleet electrification platform vertelo in a phased manner both the entities have signed a memorandum of understanding to this effect the partnership will focus on providing sustainable mobility solutions to riders and will also work towards establishing a robust ev charging infrastructure in the country mg motor india said in a statement vertelo is a fleet electrification platform that aims at providing end to end solutions to operators and corporates it has been established by macquarie asset management and has received anchor investment from the green climate fund which has committed to invest up to usd \u003cTWO_HUNDRED\u003e million this partnership with mg motor india to purchase around \u003cTHREE_THOUSAND\u003e electric cars marks the beginning of an exciting journey for both organisations with a common goal of accelerating fleet electrification and achieving net zero emissions vertelo ceo sandeep gambhir said the range of electric vehicles that mg motor plans to bring in india over the next few years coupled with vertelos integrated electrification solutions for fleet operators and corporates will go a long way in accelerating the shift towards a more sustainable transportation ecosystem he added mg motor indias current ev lineup includes the small electric car comet and suv zs ev","timestamp":"2024-05-23T12:41:00+05:30","market_timestamp":"2024-05-23T12:41:00+05:30","off_market_hours":false}