{"url":"https://www.moneycontrol.com/news/business/hcltech-infuses-genai-into-mro-solution-to-drive-enterprises-asset-utilisation-12735405.html","title":"HCLTech infuses GenAI into MRO solution to drive enterprises' asset utilisation","description":"The infusion of GenAI into its MRO solution -- iMRO/4 -- would help enterprises raise the performance and efficiency of complex, high-value assets in transportation, technology, energy, aerospace and defense, according to a release.HCLTech infuses GenAI into MRO solution to drive enterprises' asset utilisation","content":"HCL Technologies (HCLTech) has added generative AI or GenAI capabilities to its Maintenance, Repair and Overhaul (MRO) solution, to help optimise enterprises' asset utilisation. The infusion of GenAI into its MRO solution -- iMRO/4 -- would help enterprises raise the performance and efficiency of complex, high-value assets in transportation, technology, energy, aerospace and defense, according to a release. HCLTech will launch a GenAI bot to kickstart the AI integration on iMRO/4. \"In the next phase, the GenAI-infused iMRO/4 will enable a comprehensive natural language inspection and repair findings report based on operative data within SAP S/4HANA,\" the release said. ","cleaned_content":"hcl technologies hcltech has added generative ai or genai capabilities to its maintenance repair and overhaul mro solution to help optimise enterprises asset utilisation the infusion of genai into its mro solution imro \u003cFOUR_\u003e would help enterprises raise the performance and efficiency of complex high value assets in transportation technology energy aerospace and defense according to a release hcltech will launch a genai bot to kickstart the ai integration on imro \u003cFOUR_\u003e in the next phase the genai infused imro \u003cFOUR_\u003e will enable a comprehensive natural language inspection and repair findings report based on operative data within sap s \u003cFOUR_\u003e hana the release said","timestamp":"2024-05-29T12:32:00+05:30","market_timestamp":"2024-05-29T12:32:00+05:30","off_market_hours":false}