{"url":"https://www.moneycontrol.com/technology/zee-may-slowdown-buying-content-a-bit-focus-is-on-frugality-said-ceo-punit-goenka-article-12725758.html","title":"Zee may slow down buying content a bit, focus is on frugality, says CEO Punit Goenka","description":"Along with its streaming business, Zee will not be spending big on content even for the movies business as the company's focus is on frugality. Vikrant Massey in 12th Fail Screen grab. 212th Fail is among successful ventures of Zee in FY24.  Related stories","content":"Media company Zee Entertainment which also runs a streaming platform Zee5 will be cutting down spends on content both for its movie as well as digital business. \"Need of the hour is to pivot to business to achieve balanced cost structure in order to achieve sustained long term growth. With that backdrop we are looking at every element of the business with the lens of improving the overall performance. As a result we expect some short term aberration in digital business financial performance,\" said company's MD and CEO Punit Goenka. Zee's content inventory, advances and deposits declined by Rs 540 crore in FY24 driven by optimised acquisition and movie releases, the company said in its investor presentation. The cost dropped to Rs 7,420 crore in FY24 from Rs 7,960 crore in FY23. Also read: Zee's largest amount of rationalization in OTT tech business, said MD Punit Goenka He added that the company wants to focus on frugality and quality content even for movies business and the company doesn't want to go after big films. \"Most of our previous successes have not been high cost content. They have been reasonable or low cost content. We don't need to buy expensive content, the MD said. In FY24, ZEE5 released 89 shows and movies including 15 originals. \"We will not take foot off content. We will be selective in choices. We don't have to compete count to count, budget to budget with peers. We will do reasonable amount of content but not going to be swayed by big budget which others are doing,\" said chief financial officer (CFO) Rohit Gupta. The streaming business is expected to reduce its losses in the current financial year. Also read: Zee Entertainment swings back to black with Rs 13 crore profit in Q4FY24 \"ZEE5 losses will come down in FY25 versus FY24. But there is no time line for break even,\" the company said. The digital segment's revenue in FY24 was up 24 percent at Rs 919.5 crore from Rs 741.1 crore in FY23. ZEE5's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) loss stood at Rs 1105.2 crore in the last fiscal year from Rs 1105.4 crore in FY23. ","cleaned_content":"media company zee entertainment which also runs a streaming platform zee5 will be cutting down spends on content both for its movie as well as digital business need of the hour is to pivot to business to achieve balanced cost structure in order to achieve sustained long term growth with that backdrop we are looking at every element of the business with the lens of improving the overall performance as a result we expect some short term aberration in digital business financial performance said companys md and ceo punit goenka zees content inventory advances and deposits declined by rs \u003cFIVE_HUNDRED\u003e crore in fy24 driven by optimised acquisition and movie releases the company said in its investor presentation the cost dropped to rs \u003cSEVEN_THOUSAND\u003e crore in fy24 from rs \u003cSEVEN_THOUSAND\u003e crore in fy23 also read zees largest amount of rationalization in ott tech business said md punit goenka he added that the company wants to focus on frugality and quality content even for movies business and the company doesnt want to go after big films most of our previous successes have not been high cost content they have been reasonable or low cost content we dont need to buy expensive content the md said in fy24 zee5 released \u003cEIGHT_TEN\u003e shows and movies including \u003cONE_TEN\u003e originals we will not take foot off content we will be selective in choices we dont have to compete count to count budget to budget with peers we will do reasonable amount of content but not going to be swayed by big budget which others are doing said chief financial officer cfo rohit gupta the streaming business is expected to reduce its losses in the current financial year also read zee entertainment swings back to black with rs \u003cONE_TEN\u003e crore profit in q4fy24 zee5 losses will come down in fy25 versus fy24 but there is no time line for break even the company said the digital segments revenue in fy24 was up \u003cTWO_TEN_PERCENT\u003e at rs \u003cNINE_HUNDRED\u003e crore from rs \u003cSEVEN_HUNDRED\u003e crore in fy23 zee5s ebitda earnings before interest taxes depreciation and amortization loss stood at rs \u003cONE_THOUSAND\u003e crore in the last fiscal year from rs \u003cONE_THOUSAND\u003e crore in fy23","timestamp":"2024-05-18T11:55:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}