{"url":"https://www.moneycontrol.com/news/business/essar-group-venture-pluckk-reports-rs-100-crore-revenue-in-fy24-12735537.html","title":"Essar Group venture Pluckk reports Rs 100 crore ARR in FY24","description":"Founded in 2021, Pluckk operates in Delhi, Mumbai, Bengaluru and Pune through more than eight marketplace platforms and delivers over 2 million products every month, a company statement said.Essar Group venture Pluckk reports Rs 100 crore revenue in FY24","content":"B2C fresh produce food tech platform Pluckk on Wednesday said it logged a revenue of Rs 100 crore in FY24, aided by digital reach through e-commerce platforms. Founded in 2021, Pluckk operates in Delhi, Mumbai, Bengaluru and Pune through more than eight marketplace platforms and delivers over 2 million products every month, a company statement said. Pluckk, an Essar Group venture, concluded FY24 with an Annualised Revenue Runrate (ARR) of Rs 100 crore. The brand's growth trajectory can be attributed to strategic partnerships with leading industry giants such as Amazon, Swiggy, Zepto, and Blinkit, it said. With its listing on ONDC, Pluckk now serves a customer base of 5 lakh. The company is also making significant investments in its own app to further enhance customer experience. Essar Group is into power, ports, oil and gas. ","cleaned_content":"b2c fresh produce food tech platform pluckk on wednesday said it logged a revenue of rs \u003cONE_HUNDRED\u003e crore in fy24 aided by digital reach through e commerce platforms founded in \u003cTWO_THOUSAND\u003e pluckk operates in delhi mumbai bengaluru and pune through more than eight marketplace platforms and delivers over \u003cTWO_\u003e million products every month a company statement said pluckk an essar group venture concluded fy24 with an annualised revenue runrate arr of rs \u003cONE_HUNDRED\u003e crore the brands growth trajectory can be attributed to strategic partnerships with leading industry giants such as amazon swiggy zepto and blinkit it said with its listing on ondc pluckk now serves a customer base of \u003cFIVE_\u003e lakh the company is also making significant investments in its own app to further enhance customer experience essar group is into power ports oil and gas","timestamp":"2024-05-29T18:21:00+05:30","market_timestamp":"2024-05-30T09:15:00+05:30","off_market_hours":true}