{"url":"https://www.moneycontrol.com/news/business/iit-b-partners-with-tcs-to-build-indias-first-quantum-diamond-microchip-imager-12734304.html","title":"TCS collaborates with IIT-B to build India's first quantum diamond microchip imager","description":"TCS experts will collaborate with Kasturi Saha, an associate professor at the top technology institute, to create the PQuest Lab's quantum imaging platform.IIT-B partners with TCS to build India's first quantum diamond microchip imagerRelated stories","content":"TCS and IIT Bombay announced on May 28 that they are working together to develop India's first quantum diamond microchip imager. According to an official statement, a quantum diamond microchip imager is able to image magnetic fields, allowing for a non-invasive and non-destructive mapping of semiconductor chips, similar to an MRI at a hospital. The statement further stated that this technology is essential given the difficulties in detecting anomalies caused by traditional sensing methods due to semiconductors' shrinking size. According to a filing to the stock exchanges, the country's largest IT services and IIT Bombay have formed a strategic agreement to develop an improved sensing tool for semiconductor chip imaging. This sophisticated sensing instrument has the potential to decrease chip failures, increase the energy efficiency of electronic devices, and open up new avenues for precision in the analysis of semiconductor chips. It stated that India will advance in the quantum revolution with the help of an indigenous quantum diamond microchip imager that combines quantum diamond microscopy with software imaging powered by artificial intelligence and machine learning. TCS experts will collaborate with Kasturi Saha, an associate professor at the top technology institute, to create the PQuest Lab's quantum imaging platform. According to Saha, using its experience in quantum sensing to spur innovation, the two companies will collaborate on a quantum imaging platform for the non-destructive inspection of chips. \"By working together, we aim to transform various sectors, including electronics and healthcare, and propel India forward through groundbreaking technologies and products aligned with National Quantum Mission's Quantum Sensing and Metrology vertical,\" he said in a statement. What are semiconductor chips? All contemporary electronic gadgets use semiconductor chips, and the two partners' effort over the next two years is intended to increase the devices' dependability, security, and energy efficiency. According to the statement, the chips serve as the brains of devices in a variety of industries, including communications, computers, healthcare, military systems, transportation, and clean energy. They can interpret data and perform tasks. TCS and IIT-B have been working together on several projects since the 1990s. The imager detects and characterises anomalies in semiconductor chips by utilising hardware and software with Nitrogen-Vacancy (NV) centres, which are structural defects in diamonds. ","cleaned_content":"tcs and iit bombay announced on may \u003cTWO_TEN\u003e that they are working together to develop indias first quantum diamond microchip imager according to an official statement a quantum diamond microchip imager is able to image magnetic fields allowing for a non invasive and non destructive mapping of semiconductor chips similar to an mri at a hospital the statement further stated that this technology is essential given the difficulties in detecting anomalies caused by traditional sensing methods due to semiconductors shrinking size according to a filing to the stock exchanges the countrys largest it services and iit bombay have formed a strategic agreement to develop an improved sensing tool for semiconductor chip imaging this sophisticated sensing instrument has the potential to decrease chip failures increase the energy efficiency of electronic devices and open up new avenues for precision in the analysis of semiconductor chips it stated that india will advance in the quantum revolution with the help of an indigenous quantum diamond microchip imager that combines quantum diamond microscopy with software imaging powered by artificial intelligence and machine learning tcs experts will collaborate with kasturi saha an associate professor at the top technology institute to create the pquest labs quantum imaging platform according to saha using its experience in quantum sensing to spur innovation the two companies will collaborate on a quantum imaging platform for the non destructive inspection of chips by working together we aim to transform various sectors including electronics and healthcare and propel india forward through groundbreaking technologies and products aligned with national quantum missions quantum sensing and metrology vertical he said in a statement what are semiconductor chips all contemporary electronic gadgets use semiconductor chips and the two partners effort over the next two years is intended to increase the devices dependability security and energy efficiency according to the statement the chips serve as the brains of devices in a variety of industries including communications computers healthcare military systems transportation and clean energy they can interpret data and perform tasks tcs and iit b have been working together on several projects since the \u003cONE_THOUSAND\u003e s the imager detects and characterises anomalies in semiconductor chips by utilising hardware and software with nitrogen vacancy nv centres which are structural defects in diamonds","timestamp":"2024-05-28T15:34:00+05:30","market_timestamp":"2024-05-29T09:15:00+05:30","off_market_hours":true}