{"url":"https://www.moneycontrol.com/news/business/suzlon-bags-new-orders-of-402-mw-wind-energy-from-juniper-green-energy-12729200.html","title":"Suzlon bags new orders of 402 MW wind energy from Juniper Green Energy","description":"Suzlon will install a total of 134 wind turbine generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3 MW for both projects at the Suzlon proposed site at Fatehgarh in Rajasthan, a company statement said.Suzlon bags new orders of 402 MW wind energy from Juniper Green EnergyRelated stories","content":"Renewable energy solutions provider Suzlon Group on Wednesday said it has bagged new orders for the development of 402 MW wind energy projects from Juniper Green Energy. Suzlon will install a total of 134 wind turbine generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3 MW for both projects at the Suzlon proposed site at Fatehgarh in Rajasthan, a company statement said. As part of the agreement, Suzlon will supply the wind turbines and execute the project including foundation, erection, and commissioning. \"Juniper Green Energy has been a long-term, repeat customer for us, and we are delighted to partner with them again. This order helps us expand our footprint in Rajasthan,\" Girish Tanti, Vice Chairman, Suzlon Group, said in the statement. The electricity generated from these projects will help realise the vision of the Rajasthan government to serve the people of the state with green energy, he added. The generated power will be provided under FDRE (Firm and Dispatchable Renewable Energy) Hybrid and Merchant projects. Projects of this size can provide electricity to 3.31 lakh households and curb 13.07 lakh tonnes of CO2 emissions per year. \"Suzlon's unmatched technology and comprehensive EPC capabilities help us fulfill our vision of building a sustainable India through cost- effective, Made in India renewable energy solutions,\" said Naresh Mansukhani, Chief Executive Officer, Juniper Green Energy Private Ltd. ","cleaned_content":"renewable energy solutions provider suzlon group on wednesday said it has bagged new orders for the development of \u003cFOUR_HUNDRED\u003e mw wind energy projects from juniper green energy suzlon will install a total of \u003cONE_HUNDRED\u003e wind turbine generators wtgs with a hybrid lattice tubular hlt tower and a rated capacity of \u003cTHREE_\u003e mw for both projects at the suzlon proposed site at fatehgarh in rajasthan a company statement said as part of the agreement suzlon will supply the wind turbines and execute the project including foundation erection and commissioning juniper green energy has been a long term repeat customer for us and we are delighted to partner with them again this order helps us expand our footprint in rajasthan girish tanti vice chairman suzlon group said in the statement the electricity generated from these projects will help realise the vision of the rajasthan government to serve the people of the state with green energy he added the generated power will be provided under fdre firm and dispatchable renewable energy hybrid and merchant projects projects of this size can provide electricity to \u003cTHREE_\u003e lakh households and curb \u003cONE_TEN\u003e lakh tonnes of co2 emissions per year suzlons unmatched technology and comprehensive epc capabilities help us fulfill our vision of building a sustainable india through cost effective made in india renewable energy solutions said naresh mansukhani chief executive officer juniper green energy private ltd","timestamp":"2024-05-22T11:25:00+05:30","market_timestamp":"2024-05-22T11:25:00+05:30","off_market_hours":false}