{"url":"https://www.moneycontrol.com/news/business/inox-wind-energy-raises-rs-900-crore-through-stake-sale-to-trim-debt-12735535.html","title":"Inox Wind Energy raises Rs 900 crore through stake sale to trim debt","description":"It is a significant step towards completely deleveraging external debt in Inox Wind Ltd, according to a regulatory filing.Inox Wind Energy raises Rs 900 crore through stake sale to trim debtRelated stories","content":"Inox Wind Energy has raised Rs 900 crore through equity share sale of Inox Wind Ltd, a subsidiary of the INOXGFL Group. It is a significant step towards completely deleveraging external debt in Inox Wind Ltd, according to a regulatory filing. Inox Wind is India's leading wind energy solutions provider, while Inox Wind Energy Ltd (IWEL) is one of the promoters of Inox Wind Ltd. \"The transaction was executed via block deals on the stock exchanges and witnessed participation by several marquee institutional investors,\" IWEL said in the filing on Tuesday evening. As of March 31, 2024, Inox Wind's net external interest debt stood at Rs 655 crore. On Tuesday, Inox Wind Energy divested a 4.6 per cent stake in its subsidiary company Inox Wind Ltd for Rs 904 crore through open market transactions. INOXGFL Group is operating across two key verticals -- chemicals and renewable energy. It has four listed entities namely Gujarat Flourochemicals Ltd, Inox Wind Ltd, Inox Green Energy Services and Inox Wind Energy Ltd. Earlier in May, Inox Wind Ltd reported a consolidated profit of Rs 36.72 crore for the March quarter, mainly due to increased income. It had posted a net loss of Rs 119.04 crore in the January-March period of the preceding fiscal. During the fourth quarter of FY24, the company's total income surged to Rs 563.07 crore from Rs 193.83 crore a year ago. ","cleaned_content":"inox wind energy has raised rs \u003cNINE_HUNDRED\u003e crore through equity share sale of inox wind ltd a subsidiary of the inoxgfl group it is a significant step towards completely deleveraging external debt in inox wind ltd according to a regulatory filing inox wind is indias leading wind energy solutions provider while inox wind energy ltd iwel is one of the promoters of inox wind ltd the transaction was executed via block deals on the stock exchanges and witnessed participation by several marquee institutional investors iwel said in the filing on tuesday evening as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e inox winds net external interest debt stood at rs \u003cSIX_HUNDRED\u003e crore on tuesday inox wind energy divested a \u003cFOUR_PERCENT\u003e stake in its subsidiary company inox wind ltd for rs \u003cNINE_HUNDRED\u003e crore through open market transactions inoxgfl group is operating across two key verticals chemicals and renewable energy it has four listed entities namely gujarat flourochemicals ltd inox wind ltd inox green energy services and inox wind energy ltd earlier in may inox wind ltd reported a consolidated profit of rs \u003cTHREE_TEN\u003e crore for the march quarter mainly due to increased income it had posted a net loss of rs \u003cONE_HUNDRED\u003e crore in the january march period of the preceding fiscal during the fourth quarter of fy24 the companys total income surged to rs \u003cFIVE_HUNDRED\u003e crore from rs \u003cONE_HUNDRED\u003e crore a year ago","timestamp":"2024-05-29T13:49:00+05:30","market_timestamp":"2024-05-29T13:49:00+05:30","off_market_hours":false}