{"url":"https://www.moneycontrol.com/news/business/radisson-hotel-group-partners-nile-hospitality-to-expand-park-inn-suites-in-rajasthan-gujarat-12729385.html","title":"Radisson Hotel Group partners NILE Hospitality to expand Park Inn \u0026 Suites in Rajasthan, Gujarat","description":"This partnership is part of the global hospitality group's robust expansion strategy, driven by the growing demand for quality hospitality experiences in tier II to V cities across India, Radisson Hotel Group said in a statement.Radisson Hotel Group partners NILE Hospitality to expand Park Inn \u0026 Suites in Rajasthan, GujaratRelated stories","content":"Global hospitality company Radisson Hotel Group on Wednesday said it has signed a strategic partnership with NILE Hospitality to expand its mid-scale brand Park Inn \u0026 Suites by Radisson in Rajasthan and Gujarat. This partnership is part of the global hospitality group's robust expansion strategy, driven by the growing demand for quality hospitality experiences in tier II to V cities across India, Radisson Hotel Group said in a statement. \"We are delighted to continue our collaboration with NILE Hospitality to strengthen our presence in western and northwestern India. This partnership is in tandem with our five-year expansion plan for South Asia to fuel our growth in tier II to V markets of India.\" Radisson Hotel Group Managing Director and Area Senior Vice President (ASVP), South Asia, Nikhil Sharma said. \"Building on our existing portfolio of hotels with Radisson Hotel Group, this partnership comes at a time when demand for a strong, mid-scale brand that is newly built, brownfield, and conversion-friendly is stronger than ever. With Radisson's global presence and NILE's expertise as a third-party operator, this beginning will provide an exciting developing pipeline,\" said NILE Hospitality Founder and CEO Vikram Singh Chauhan. Radisson Hotel Group is a leading international hotel operator with over 165 hotels in operation and development. It is among the largest hotel operators in a tier I market like Delhi NCR and at the same time, more than 50 per cent of its portfolio is in tier II and III markets. The brands operating under Radisson Hotel Group in India include Radisson Collection, Radisson Blu, Radisson, Radisson RED, Park Inn by Radisson, Park Plaza, Park Inn \u0026 Suites by Radisson, Country Inn \u0026 Suites by Radisson and Radisson Individuals and its extension Radisson Individuals Retreats. ","cleaned_content":"global hospitality company radisson hotel group on wednesday said it has signed a strategic partnership with nile hospitality to expand its mid scale brand park inn suites by radisson in rajasthan and gujarat this partnership is part of the global hospitality groups robust expansion strategy driven by the growing demand for quality hospitality experiences in tier ii to v cities across india radisson hotel group said in a statement we are delighted to continue our collaboration with nile hospitality to strengthen our presence in western and northwestern india this partnership is in tandem with our five year expansion plan for south asia to fuel our growth in tier ii to v markets of india radisson hotel group managing director and area senior vice president asvp south asia nikhil sharma said building on our existing portfolio of hotels with radisson hotel group this partnership comes at a time when demand for a strong mid scale brand that is newly built brownfield and conversion friendly is stronger than ever with radissons global presence and niles expertise as a third party operator this beginning will provide an exciting developing pipeline said nile hospitality founder and ceo vikram singh chauhan radisson hotel group is a leading international hotel operator with over \u003cONE_HUNDRED\u003e hotels in operation and development it is among the largest hotel operators in a tier i market like delhi ncr and at the same time more than \u003cFIVE_TEN_PERCENT\u003e of its portfolio is in tier ii and iii markets the brands operating under radisson hotel group in india include radisson collection radisson blu radisson radisson red park inn by radisson park plaza park inn suites by radisson country inn suites by radisson and radisson individuals and its extension radisson individuals retreats","timestamp":"2024-05-22T13:37:00+05:30","market_timestamp":"2024-05-22T13:37:00+05:30","off_market_hours":false}