{"url":"https://www.moneycontrol.com/news/business/sbi-asks-employees-to-take-approval-before-opening-demat-accounts-outside-the-group-12735138.html","title":"SBI asks employees to take approval before opening demat accounts outside the group","description":"A breach of these instructions will be treated as gross misconduct and punished, the bank has said in an internal circular.SBI asks employees to take approval before opening demat accounts outside State Bank groupRelated stories","content":"The country’s largest lender, the State Bank of India (SBI), has asked its employees to seek permission before opening demat or trading accounts with service providers outside the group. A breach of the instruction would be treated as gross misconduct and punishable, an internal circular, dated May 27, has said. Moneycontrol has reviewed a copy of the circular. “No officer/award staff shall open their or their wholly dependent family member’s demat account and or trading account outside the State Bank Group without prior permission of his / her controller not below rank of Chief General Manager,” the circular says. “Breach of these instructions shall be treated as a misconduct punishable amongst others under Rule No. 50(1), 50(4), 50 (11) read with Rule 66 of SBIOSR for officers,” the circular says. A demat is an online portfolio that makes the process of holding investments such as shares, bonds, mutual funds and ETFs easier, doing away with the physical handling and trading paper shares and other documents. SBI is yet to respond to Moneycontrol’s emailed queries. The bank has also asked the employees to submit their details and those of their “dependent” family members’ demat account statements to their controllers for verification. The staff must also obtain de facto permission from their controllers within six months from the date of issue of the instructions or close such accounts during the period. And legal experts highlighted that a company cannot impose on its employees to use the services of the employer group. \"Banks and companies may issue caution to employees for trading as it is done during the normal working hours. Since they also have policies under which employees have to make declaration about their investments, they cannot prohibit using services outside their company or group,\" said Mukesh Chand, Senior Legal Counsel · Economic Laws Practice (ELP). Demat account boom India had 151 million demat accounts at the end of the financial year 2023-24, data analysed by brokerage Motilal Oswal shows. As many as 3.1 million new accounts were added in March alone. “This trend seems to be continuing throughout the year, with an average of 3.1 million new accounts opened each month in the financial year 2024 (FY24),” Motilal Oswal said. Groww emerged as the largest broker, with a market share of 23.4 percent, handling an active client base of 9.5 million in FY24, Motilal Oswal said in another report, citing National Stock Exchange (NSE) data. The broker recorded a 77.5 percent jump in the active client base in FY24 and a 42 percent overall jump in the market share. Next in line is Zerodha, which recorded a 14 percent jump in the number of active clients touching 7.3 million. The Bengaluru-based brokerage firm’s market share, however, slipped to 17.9 percent at the end of FY24 from 19.6 percent in the previous year. ","cleaned_content":"the country s largest lender the state bank of india sbi has asked its employees to seek permission before opening demat or trading accounts with service providers outside the group a breach of the instruction would be treated as gross misconduct and punishable an internal circular dated may \u003cTWO_TEN\u003e has said moneycontrol has reviewed a copy of the circular no officer award staff shall open their or their wholly dependent family member s demat account and or trading account outside the state bank group without prior permission of his her controller not below rank of chief general manager the circular says breach of these instructions shall be treated as a misconduct punishable amongst others under rule no \u003cFIVE_TEN\u003e \u003cONE_\u003e \u003cFIVE_TEN\u003e \u003cFOUR_\u003e \u003cFIVE_TEN\u003e \u003cONE_TEN\u003e read with rule \u003cSIX_TEN\u003e of sbiosr for officers the circular says a demat is an online portfolio that makes the process of holding investments such as shares bonds mutual funds and etfs easier doing away with the physical handling and trading paper shares and other documents sbi is yet to respond to moneycontrol s emailed queries the bank has also asked the employees to submit their details and those of their dependent family members demat account statements to their controllers for verification the staff must also obtain de facto permission from their controllers within six months from the date of issue of the instructions or close such accounts during the period and legal experts highlighted that a company cannot impose on its employees to use the services of the employer group banks and companies may issue caution to employees for trading as it is done during the normal working hours since they also have policies under which employees have to make declaration about their investments they cannot prohibit using services outside their company or group said mukesh chand senior legal counsel economic laws practice elp demat account boom india had \u003cONE_HUNDRED\u003e million demat accounts at the end of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e data analysed by brokerage motilal oswal shows as many as \u003cTHREE_\u003e million new accounts were added in march alone this trend seems to be continuing throughout the year with an average of \u003cTHREE_\u003e million new accounts opened each month in the financial year \u003cTWO_THOUSAND\u003e fy24 motilal oswal said groww emerged as the largest broker with a market share of \u003cTWO_TEN_PERCENT\u003e handling an active client base of \u003cNINE_\u003e million in fy24 motilal oswal said in another report citing national stock exchange nse data the broker recorded a \u003cSEVEN_TEN_PERCENT\u003e jump in the active client base in fy24 and a \u003cFOUR_TEN_PERCENT\u003e overall jump in the market share next in line is zerodha which recorded a \u003cONE_TEN_PERCENT\u003e jump in the number of active clients touching \u003cSEVEN_\u003e million the bengaluru based brokerage firm s market share however slipped to \u003cONE_TEN_PERCENT\u003e at the end of fy24 from \u003cONE_TEN_PERCENT\u003e in the previous year","timestamp":"2024-05-29T12:24:00+05:30","market_timestamp":"2024-05-29T12:24:00+05:30","off_market_hours":false}