{"url":"https://www.moneycontrol.com/news/business/tata-motors-arms-partner-with-bajaj-finance-to-provide-financing-to-passenger-ev-dealers-12727321.html","title":"Tata Motors' arms partner with Bajaj Finance to provide financing to passenger, EV dealers","description":"Tata Motors Passenger Vehicles (TMPV) and Tata Passenger Electric Mobility (TPEM), subsidiaries of Tata Motors, have joined hands with Bajaj Finance to extend supply chain finance solutions to its passenger and electric vehicle dealers, the company said in a statement.(L-R) Dhiman Gupta, CFO, Tata Passenger Electric Mobility and Director, Tata Motors Passenger Vehicles Ltd. and Siddhartha Bhatt, Chief Business Officer, Bajaj Finance at the MoU signing in MumbaiRelated stories","content":"Tata Motors on Monday said its passenger vehicles and passenger electric mobility subsidiaries have tied up with Bajaj Finance for providing supply chain finance solutions to their respective dealers. Tata Motors Passenger Vehicles (TMPV) and Tata Passenger Electric Mobility (TPEM), subsidiaries of Tata Motors, have joined hands with Bajaj Finance to extend supply chain finance solutions to its passenger and electric vehicle dealers, the company said in a statement. Under a Memorandum of Understanding (MoU), the participating companies will come together to leverage Bajaj Finance's wide reach to help dealers of TMPV and TPEM access funding with minimal collateral, it added. \"Through this financing programme, we will arm TMPV and TPEM's authorised passenger and electric vehicle dealers with financial capital, which will enable them to seize the opportunities offered by a growing passenger vehicles market,\" Bajaj Finance Deputy Managing Director, Anup Saha said. This collaboration will not only benefit dealers but also contribute to and enhance the growth of the automotive industry in India, Saha added. ","cleaned_content":"tata motors on monday said its passenger vehicles and passenger electric mobility subsidiaries have tied up with bajaj finance for providing supply chain finance solutions to their respective dealers tata motors passenger vehicles tmpv and tata passenger electric mobility tpem subsidiaries of tata motors have joined hands with bajaj finance to extend supply chain finance solutions to its passenger and electric vehicle dealers the company said in a statement under a memorandum of understanding mou the participating companies will come together to leverage bajaj finances wide reach to help dealers of tmpv and tpem access funding with minimal collateral it added through this financing programme we will arm tmpv and tpems authorised passenger and electric vehicle dealers with financial capital which will enable them to seize the opportunities offered by a growing passenger vehicles market bajaj finance deputy managing director anup saha said this collaboration will not only benefit dealers but also contribute to and enhance the growth of the automotive industry in india saha added","timestamp":"2024-05-20T14:25:00+05:30","market_timestamp":"2024-05-20T14:25:00+05:30","off_market_hours":false}