{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-to-launch-a-vehicle-in-each-fuel-type-in-2-years-but-evs-will-lead-the-way-chairman-dheeraj-hinduja-12733014.html","title":"Ashok Leyland to launch a vehicle in each fuel-type in 2 years but EVs will lead the way: Chairman Dheeraj Hinduja","description":"In an exclusive chat with CNBC-TV18, Hinduja stated that challenges such as the availability of facilities to produce hydrogen-powered vehicles could impede the pace of their deployment.Ashok Leyland to launch a vehicle in each fuel-type in 2 years but EVs will lead the way: Chairman Dheeraj HindujaRelated stories","content":"Commercial vehicle major Ashok Leyland has an \"internal target\" of launching a product in each fuel type within the next 18 to 24 months, even if there is no guarantee of widespread deployment, said chairman Dheeraj Hinduja. In an exclusive chat with CNBC-TV18, Hinduja stated that challenges such as the availability of facilities to produce hydrogen-powered vehicles could impede the pace of their deployment. \"We have an internal target of launching vehicles powered by all alternate fuels within 18 to 24 months, but I cannot comment on how many alternate-fuel vehicles we will deploy,\" said Hinduja, adding that several customers have shown keen interest in vehicles across fuel types. Hinduja's comments come as Leyland has been doubling its investments in its EV subsidiary, Switch Mobility. In December 2023, the company invested Rs 662 crore in Switch, followed by an additional Rs 537 crore earlier this year. The company will continue investing in its EV arm and is not in a hurry to find an external investor. This contrasts starkly with Leyland's approach in 2021, when the CV manufacturer was hunting for investors at the height of the EV boom. However, despite substantial offers via the SPAC (Special Purpose Acquisition Company) route, Leyland surprised the market and observers alike by turning them down. \"We didn't see the right opportunity,\" says Hinduja today. \"Switch was valued at billions of dollars, but we didn't think it was justified.\" Today, Ashok Leyland is committed to investing in the EV firm, thanks to its fiscal health: \"Our balance sheet is strong, we remain largely debt-free, and funding Switch Mobility is not a challenge.\" Hinduja added: \"We are open to external funding for Switch in the long run, with the right opportunity, but at present, there are no plans to bring in an external investor.\" Objectively, Switch Mobility remains a solid asset. Leyland has optimised costs at its subsidiary by manufacturing EVs within its facilities. All investments towards Switch Mobility have been deployed purely towards product development, and a healthy product pipeline has resulted from such measures. \"We have invested heavily in Switch's recent 12-metre electric bus and the electric LCV launches,\" said Hinduja. \"We will be launching the low-floor 12-metre electric bus and the 9-metre electric bus, and will be launching our first European electric bus, the e1, for the Spanish market this summer.\" To further boost cost optimisation, the management is not looking to open a dedicated Switch Mobility plant anytime soon: \"When volumes ramp up to necessitate a separate facility, we will build one, but we can continue building Switch Mobility products from Ashok Leyland's facilities for the next 12 to 18 months.\" These plans indicate that Leyland is not considering a demerger of the EV business: \"It makes sense to keep the companies together,\" Hinduja said. \"Energy transition is happening slower than estimated, and we have time to think of ideas and strategies for the EV business.\" Hinduja also ruled out the possibility of Leyland acquiring EV companies in the near term: \"The priority is to keep building our product pipeline; there are no talks to acquire any company at present.\" In line with building product pipelines, twin investments in Tamil Nadu and Uttar Pradesh are expected to hold Leyland in good stead. In January, the company announced an investment commitment of Rs 1,200 crore at the Tamil Nadu Global Investor Meet. A month later, it unveiled plans to build a plant in Lucknow. \"The UP plant will be predominantly focused on building electric buses,\" said Hinduja. \"We are looking at a timeline of 12 to 13 months to begin operations with a production of 2,500 electric buses, with the ability to ramp up to 5,000 electric buses.\" He added: \"In Tamil Nadu, we are investing in capacity optimisation and our alternate-fuel products.\" On the ICE (internal combustion engine) front, Ashok Leyland recently displaced Tata Motors to occupy the #2 spot in the pick-up truck segment, with a market share of 20%. During this time, its overall LCV sales have bucked market trends to grow at a healthy rate. \"The LCV segment still has plenty of room to grow — we are covering merely 50% of it,\" said Hinduja. \"We will launch six new LCV models in this fiscal year and will continue investing in the segment.\" Despite concerns over falling factory output and mining at a 19-month low, Hinduja said that the general growth in infrastructure and all-round buoyancy will keep markets alive. While observers claim the ongoing general election could impact the markets, the Ashok Leyland chairman believes \"businesses will adjust to whatever the outcome of the election is.\" Hinduja said FAME III incentives must incentivise the purchase of electric trucks to accelerate the energy transition, adding that India would do well to learn from the China story before deciding whether to withdraw EV incentives. \"We must note how Chinese EV sales slowed down when incentives were withdrawn; I think the Indian government must continue incentivising both the manufacturing and purchase of EVs.\" A few months ago, Ashok Leyland celebrated the completion of 75 years in its journey. The company outlined plans to be among the top 10 global CV manufacturers. \"We have a clear blueprint on how we want to get there,\" said Hinduja. \"A 75-year-old company like ours will need to reinvent itself to compete with the best in the world. We have developed new purpose, culture, innovation, and trust to be among the global top 10.\" He added that the company's network in the GCC, Africa, and Indonesia will help it reach its goals soon. On the earnings front, the company's FY-24 net profits have risen by 90%, from Rs 1,380 crore at the end of FY-23 to Rs 2,618 crore last fiscal. Revenue from operations also grew by 6%, with the company reporting that all its business verticals outperformed. \"The last few quarters demonstrate that we can deliver our promises to our investors,\" he said. \"We will continue to grow our market share and keep improving financial performance.\" ","cleaned_content":"commercial vehicle major ashok leyland has an internal target of launching a product in each fuel type within the next \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e months even if there is no guarantee of widespread deployment said chairman dheeraj hinduja in an exclusive chat with cnbc tv18 hinduja stated that challenges such as the availability of facilities to produce hydrogen powered vehicles could impede the pace of their deployment we have an internal target of launching vehicles powered by all alternate fuels within \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e months but i cannot comment on how many alternate fuel vehicles we will deploy said hinduja adding that several customers have shown keen interest in vehicles across fuel types hindujas comments come as leyland has been doubling its investments in its ev subsidiary switch mobility in december \u003cTWO_THOUSAND\u003e the company invested rs \u003cSIX_HUNDRED\u003e crore in switch followed by an additional rs \u003cFIVE_HUNDRED\u003e crore earlier this year the company will continue investing in its ev arm and is not in a hurry to find an external investor this contrasts starkly with leylands approach in \u003cTWO_THOUSAND\u003e when the cv manufacturer was hunting for investors at the height of the ev boom however despite substantial offers via the spac special purpose acquisition company route leyland surprised the market and observers alike by turning them down we didnt see the right opportunity says hinduja today switch was valued at billions of dollars but we didnt think it was justified today ashok leyland is committed to investing in the ev firm thanks to its fiscal health our balance sheet is strong we remain largely debt free and funding switch mobility is not a challenge hinduja added we are open to external funding for switch in the long run with the right opportunity but at present there are no plans to bring in an external investor objectively switch mobility remains a solid asset leyland has optimised costs at its subsidiary by manufacturing evs within its facilities all investments towards switch mobility have been deployed purely towards product development and a healthy product pipeline has resulted from such measures we have invested heavily in switchs recent \u003cONE_TEN\u003e metre electric bus and the electric lcv launches said hinduja we will be launching the low floor \u003cONE_TEN\u003e metre electric bus and the \u003cNINE_\u003e metre electric bus and will be launching our first european electric bus the e1 for the spanish market this summer to further boost cost optimisation the management is not looking to open a dedicated switch mobility plant anytime soon when volumes ramp up to necessitate a separate facility we will build one but we can continue building switch mobility products from ashok leylands facilities for the next \u003cONE_TEN\u003e to \u003cONE_TEN\u003e months these plans indicate that leyland is not considering a demerger of the ev business it makes sense to keep the companies together hinduja said energy transition is happening slower than estimated and we have time to think of ideas and strategies for the ev business hinduja also ruled out the possibility of leyland acquiring ev companies in the near term the priority is to keep building our product pipeline there are no talks to acquire any company at present in line with building product pipelines twin investments in tamil nadu and uttar pradesh are expected to hold leyland in good stead in january the company announced an investment commitment of rs \u003cONE_THOUSAND\u003e crore at the tamil nadu global investor meet a month later it unveiled plans to build a plant in lucknow the up plant will be predominantly focused on building electric buses said hinduja we are looking at a timeline of \u003cONE_TEN\u003e to \u003cONE_TEN\u003e months to begin operations with a production of \u003cTWO_THOUSAND\u003e electric buses with the ability to ramp up to \u003cFIVE_THOUSAND\u003e electric buses he added in tamil nadu we are investing in capacity optimisation and our alternate fuel products on the ice internal combustion engine front ashok leyland recently displaced tata motors to occupy the \u003cTWO_\u003e spot in the pick up truck segment with a market share of \u003cTWO_TEN_PERCENT\u003e during this time its overall lcv sales have bucked market trends to grow at a healthy rate the lcv segment still has plenty of room to grow we are covering merely \u003cFIVE_TEN_PERCENT\u003e of it said hinduja we will launch six new lcv models in this fiscal year and will continue investing in the segment despite concerns over falling factory output and mining at a \u003cONE_TEN\u003e month low hinduja said that the general growth in infrastructure and all round buoyancy will keep markets alive while observers claim the ongoing general election could impact the markets the ashok leyland chairman believes businesses will adjust to whatever the outcome of the election is hinduja said fame iii incentives must incentivise the purchase of electric trucks to accelerate the energy transition adding that india would do well to learn from the china story before deciding whether to withdraw ev incentives we must note how chinese ev sales slowed down when incentives were withdrawn i think the indian government must continue incentivising both the manufacturing and purchase of evs a few months ago ashok leyland celebrated the completion of \u003cSEVEN_TEN\u003e years in its journey the company outlined plans to be among the top \u003cONE_TEN\u003e global cv manufacturers we have a clear blueprint on how we want to get there said hinduja a \u003cSEVEN_TEN\u003e year old company like ours will need to reinvent itself to compete with the best in the world we have developed new purpose culture innovation and trust to be among the global top \u003cONE_TEN\u003e he added that the companys network in the gcc africa and indonesia will help it reach its goals soon on the earnings front the companys fy \u003cTWO_TEN\u003e net profits have risen by \u003cNINE_TEN_PERCENT\u003e from rs \u003cONE_THOUSAND\u003e crore at the end of fy \u003cTWO_TEN\u003e to rs \u003cTWO_THOUSAND\u003e crore last fiscal revenue from operations also grew by \u003cSIX_PERCENT\u003e with the company reporting that all its business verticals outperformed the last few quarters demonstrate that we can deliver our promises to our investors he said we will continue to grow our market share and keep improving financial performance","timestamp":"2024-05-27T12:32:00+05:30","market_timestamp":"2024-05-27T12:32:00+05:30","off_market_hours":false}