{"url":"https://www.moneycontrol.com/news/business/may-enter-into-health-insurance-can-explore-inorganic-options-lic-chairman-siddhartha-mohanty-12734599.html","title":"May enter into health insurance; can explore inorganic options: LIC Chairman Siddhartha Mohanty","description":"There are expectations that composite licences may be permitted by amending the Insurance Act. As per the Insurance Act, 1938, and the regulations of the Insurance Regulatory Development Authority of India (IRDAI), composite licensing for an insurer to undertake life, general, or health insurance under one entity is not allowed.May enter into health insurance; can explore inorganic options: LIC Chairman Siddhartha MohantyRelated stories","content":"LIC chairman Siddhartha Mohanty has said that the insurer would enter into the health insurance segment and can explore inorganic options if such an opportunity arises. There are expectations that composite licences may be permitted by amending the Insurance Act. As per the Insurance Act, 1938, and the regulations of the Insurance Regulatory Development Authority of India (IRDAI), composite licensing for an insurer to undertake life, general, or health insurance under one entity is not allowed. LIC is not an expert in general insurance like fire and engineering but it can do health insurance, he said while sharing financial numbers for FY24. In February, a parliamentary panel suggested the introduction of a composite licence for an insurer to undertake life, general, or health insurance under one entity to increase the penetration of insurance in the country. The panel headed by BJP leader Jayant Sinha had suggested the government to introduce a provision of composite licensing for insurance companies and make the related amendment in legislation at the earliest. Observing that allowing composite licensing could provide further impetus to the insurance sector, owing to its various benefits, the report had said it can cut costs and compliance hassles for insurers, as they can run different insurance lines under one roof. It can also offer customers more choice and value, such as a single policy that covers life, health, and savings, the report tabled in Parliament had said. It can boost insurance reach and awareness in India, as customers can get one insurance from one provider, with lower premiums and easier claims. The committee are aware that to enable composite licensing in India, the government and the IRDAI are planning to bring amendments to the existing insurance legislation, it had said. Meanwhile, insurance behemoth LIC on Monday posted a marginal 2 per cent increase in net profit at Rs 13,763 crore in the fourth quarter ended March 2024 as the corporation made provisions for wage hikes. The insurer had earned a profit of Rs 13,428 crore in the corresponding quarter a year earlier. The total income of the insurer during the reporting quarter rose to Rs 2,50,923 crore from Rs 2,00,185 crore in the same period of the preceding fiscal. LIC's income from first-year premium also improved to Rs 13,810 crore in the latest January-March quarter against Rs 12,811 crore in the same period of the preceding fiscal. The income from renewal premiums in the reporting period rose to Rs 77,368 crore compared to Rs 76,009 crore a year ago. During the entire financial year ended March 2024, the insurer earned a profit of Rs 40,676 crore as compared to Rs 36,397 crore in the previous fiscal. The total premium income for the year ended March 2024 was Rs 4,75,070 crore as compared to Rs 4,74,005 crore in the year ended March 2023. A total of 2,03,92,973 policies were sold in the individual segment in FY24 as compared to 2,04,28,937 policies sold previous fiscal. The board recommended a final dividend of Rs 6 per share for 2023-24 subject to approval of shareholders, Mohanty said. Earlier, during the year an interim dividend of Rs 4 was declared and paid to shareholders of the corporation. Therefore, he said, the total interim and recommended final dividend aggregates to Rs 10 per share. ","cleaned_content":"lic chairman siddhartha mohanty has said that the insurer would enter into the health insurance segment and can explore inorganic options if such an opportunity arises there are expectations that composite licences may be permitted by amending the insurance act as per the insurance act \u003cONE_THOUSAND\u003e and the regulations of the insurance regulatory development authority of india irdai composite licensing for an insurer to undertake life general or health insurance under one entity is not allowed lic is not an expert in general insurance like fire and engineering but it can do health insurance he said while sharing financial numbers for fy24 in february a parliamentary panel suggested the introduction of a composite licence for an insurer to undertake life general or health insurance under one entity to increase the penetration of insurance in the country the panel headed by bjp leader jayant sinha had suggested the government to introduce a provision of composite licensing for insurance companies and make the related amendment in legislation at the earliest observing that allowing composite licensing could provide further impetus to the insurance sector owing to its various benefits the report had said it can cut costs and compliance hassles for insurers as they can run different insurance lines under one roof it can also offer customers more choice and value such as a single policy that covers life health and savings the report tabled in parliament had said it can boost insurance reach and awareness in india as customers can get one insurance from one provider with lower premiums and easier claims the committee are aware that to enable composite licensing in india the government and the irdai are planning to bring amendments to the existing insurance legislation it had said meanwhile insurance behemoth lic on monday posted a marginal \u003cTWO_PERCENT\u003e increase in net profit at rs \u003cONE_TEN_THOUSAND\u003e crore in the fourth quarter ended march \u003cTWO_THOUSAND\u003e as the corporation made provisions for wage hikes the insurer had earned a profit of rs \u003cONE_TEN_THOUSAND\u003e crore in the corresponding quarter a year earlier the total income of the insurer during the reporting quarter rose to rs \u003cTWO_HUNDRED_THOUSAND\u003e crore from rs \u003cTWO_HUNDRED_THOUSAND\u003e crore in the same period of the preceding fiscal lics income from first year premium also improved to rs \u003cONE_TEN_THOUSAND\u003e crore in the latest january march quarter against rs \u003cONE_TEN_THOUSAND\u003e crore in the same period of the preceding fiscal the income from renewal premiums in the reporting period rose to rs \u003cSEVEN_TEN_THOUSAND\u003e crore compared to rs \u003cSEVEN_TEN_THOUSAND\u003e crore a year ago during the entire financial year ended march \u003cTWO_THOUSAND\u003e the insurer earned a profit of rs \u003cFOUR_TEN_THOUSAND\u003e crore as compared to rs \u003cTHREE_TEN_THOUSAND\u003e crore in the previous fiscal the total premium income for the year ended march \u003cTWO_THOUSAND\u003e was rs \u003cFOUR_HUNDRED_THOUSAND\u003e crore as compared to rs \u003cFOUR_HUNDRED_THOUSAND\u003e crore in the year ended march \u003cTWO_THOUSAND\u003e a total of \u003cTWO_TEN_MILLION\u003e policies were sold in the individual segment in fy24 as compared to \u003cTWO_TEN_MILLION\u003e policies sold previous fiscal the board recommended a final dividend of rs \u003cSIX_\u003e per share for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e subject to approval of shareholders mohanty said earlier during the year an interim dividend of rs \u003cFOUR_\u003e was declared and paid to shareholders of the corporation therefore he said the total interim and recommended final dividend aggregates to rs \u003cONE_TEN\u003e per share","timestamp":"2024-05-28T14:22:00+05:30","market_timestamp":"2024-05-28T14:22:00+05:30","off_market_hours":false}