{"url":"https://www.moneycontrol.com/news/business/jackson-green-secures-rs-60-crore-funding-from-hsbc-india-12735590.html","title":"Jakson Green secures Rs 60 crore funding from HSBC India","description":"This funding will support the company's working capital requirements for its renewable energy business, both in India and internationally, a company statement said.Jackson Green secures Rs 60 crore funding from HSBC India","content":"Jakson Green, a new energy transition platform backed by Jakson Group, on Wednesday said it has secured Rs 60 crore funding from HSBC India. This funding will support the company's working capital requirements for its renewable energy business, both in India and internationally, a company statement said. The Jakson Green is actively expanding its global reach in Middle East, Africa, (Commonwealth of Independent States) CIS countries and Europe, it added. Chandan Goswami, Chief Financial Officer of Jakson Green Pvt Ltd said, \"It not only bolsters our renewable energy initiatives within India but also supports our global expansion.\" Ajay Sharma, Head of Commercial Banking, HSBC India said in the statement, \"We are committed to supporting and financing the Clean Energy Transition in India. We are pleased to support Jakson Green in their journey to scale up their clean energy business, aligned with our strategic focus on working with our clients to support their sustainability goals.\" ","cleaned_content":"jakson green a new energy transition platform backed by jakson group on wednesday said it has secured rs \u003cSIX_TEN\u003e crore funding from hsbc india this funding will support the companys working capital requirements for its renewable energy business both in india and internationally a company statement said the jakson green is actively expanding its global reach in middle east africa commonwealth of independent states cis countries and europe it added chandan goswami chief financial officer of jakson green pvt ltd said it not only bolsters our renewable energy initiatives within india but also supports our global expansion ajay sharma head of commercial banking hsbc india said in the statement we are committed to supporting and financing the clean energy transition in india we are pleased to support jakson green in their journey to scale up their clean energy business aligned with our strategic focus on working with our clients to support their sustainability goals","timestamp":"2024-05-29T15:17:00+05:30","market_timestamp":"2024-05-29T15:17:00+05:30","off_market_hours":false}