{"url":"https://www.moneycontrol.com/news/business/fsib-defers-interview-for-sbi-chairmans-position-12728915.html","title":"FSIB defers interview for SBI chairman's position","description":"The last-minute postponement comes hours before the scheduled interview, sources said.FSIB defers interview for SBI chairman's positionRelated stories","content":"FSIB -- the headhunter for directors of state-owned banks and financial institutions -- in an unexpected move has deferred the scheduled interview to select a suitable candidate for the post of SBI chairman. The last-minute postponement comes hours before the scheduled interview, sources said. The exact reasons for postponement could not be ascertained immediately. The Financial Services Institutions Bureau (FSIB) will schedule the interview well in advance to select a replacement for Dinesh Khara, who will be superannuating on August 28, when he turns 63, the upper age limit for the position of SBI Chairman. As per the convention, the chairman is appointed from a pool of serving managing directors of SBI. FSIB will recommend the name and the final decision would be taken by the Appointments Committee of the Cabinet headed by Prime Minister Narendra Modi. FSIB is headed by Bhanu Pratap Sharma, former secretary of Department of Personnel and Training (DoPT). The members of the government-appointed selection panel are Financial Services Secretary, Department of Public Enterprises Secretary and an RBI Deputy Governor. Other members of the headhunter are Animesh Chauhan, former chairman and MD of erstwhile Oriental Bank of Commerce, RBI's ex-executive director Deepak Singhal, and Shailendra Bhandari, former MD of erstwhile ING Vysya Bank. ","cleaned_content":"fsib the headhunter for directors of state owned banks and financial institutions in an unexpected move has deferred the scheduled interview to select a suitable candidate for the post of sbi chairman the last minute postponement comes hours before the scheduled interview sources said the exact reasons for postponement could not be ascertained immediately the financial services institutions bureau fsib will schedule the interview well in advance to select a replacement for dinesh khara who will be superannuating on august \u003cTWO_TEN\u003e when he turns \u003cSIX_TEN\u003e the upper age limit for the position of sbi chairman as per the convention the chairman is appointed from a pool of serving managing directors of sbi fsib will recommend the name and the final decision would be taken by the appointments committee of the cabinet headed by prime minister narendra modi fsib is headed by bhanu pratap sharma former secretary of department of personnel and training dopt the members of the government appointed selection panel are financial services secretary department of public enterprises secretary and an rbi deputy governor other members of the headhunter are animesh chauhan former chairman and md of erstwhile oriental bank of commerce rbis ex executive director deepak singhal and shailendra bhandari former md of erstwhile ing vysya bank","timestamp":"2024-05-22T09:02:00+05:30","market_timestamp":"2024-05-22T09:15:00+05:30","off_market_hours":true}