{"url":"https://www.moneycontrol.com/news/business/suzlon-group-gets-551-mw-wind-energy-project-from-aditya-birla-group-12735453.html","title":"Suzlon Group gets 551 MW wind energy project from Aditya Birla Group","description":"The order is to be executed across two sites in Rajasthan and Gujarat, Suzlon Group said in a statement.Suzlon Group gets 551 MW wind energy project from Aditya Birla GroupRelated stories","content":"Suzlon Group on Wednesday said it has secured an order for a 551.25 MW wind power project from Aditya Birla Group. The order is to be executed across two sites in Rajasthan and Gujarat, Suzlon Group said in a statement. While 368.55 MW will be developed by Suzlon in the Barmer district of Rajasthan, another 182.70 MW will be developed at the site by the client in the Bhuj district of Gujarat, the company said. Suzlon will install a total of 175 Wind Turbine Generators (WTGs), each having a rated capacity of 3.15 MW, at sites in the Barmer district of Rajasthan and the Bhuj district of Gujarat. Suzlon will also undertake operations and maintenance services post-commissioning at both sites. Girish Tanti, Vice Chairman, Suzlon Group, said, \"We are delighted to partner once again with the Aditya Birla Group for this order. Suzlon admires and shares the value of nation-building with the Aditya Birla Group and welcomes this opportunity to power them with sustainable energy.\" Jayant Dua, Business Head and Director, Aditya Birla Renewables Limited, said, \"Suzlon's technological expertise, manufacturing capabilities, and comprehensive project development skills will help accelerate our energy transition journey and support our net-zero commitments.\" Pune-based Suzlon Group is one of the leading renewable energy solutions providers in the world with 20.7 GW of wind energy capacity installed across 17 countries. ","cleaned_content":"suzlon group on wednesday said it has secured an order for a \u003cFIVE_HUNDRED\u003e mw wind power project from aditya birla group the order is to be executed across two sites in rajasthan and gujarat suzlon group said in a statement while \u003cTHREE_HUNDRED\u003e mw will be developed by suzlon in the barmer district of rajasthan another \u003cONE_HUNDRED\u003e mw will be developed at the site by the client in the bhuj district of gujarat the company said suzlon will install a total of \u003cONE_HUNDRED\u003e wind turbine generators wtgs each having a rated capacity of \u003cTHREE_\u003e mw at sites in the barmer district of rajasthan and the bhuj district of gujarat suzlon will also undertake operations and maintenance services post commissioning at both sites girish tanti vice chairman suzlon group said we are delighted to partner once again with the aditya birla group for this order suzlon admires and shares the value of nation building with the aditya birla group and welcomes this opportunity to power them with sustainable energy jayant dua business head and director aditya birla renewables limited said suzlons technological expertise manufacturing capabilities and comprehensive project development skills will help accelerate our energy transition journey and support our net zero commitments pune based suzlon group is one of the leading renewable energy solutions providers in the world with \u003cTWO_TEN\u003e gw of wind energy capacity installed across \u003cONE_TEN\u003e countries","timestamp":"2024-05-29T13:02:00+05:30","market_timestamp":"2024-05-29T13:02:00+05:30","off_market_hours":false}