{"url":"https://www.moneycontrol.com/news/business/jsw-groups-paint-business-turns-profitable-aims-rs-5000-crore-sales-by-fy26-12730427.html","title":"JSW Group's paint business turns profitable; aims Rs 5,000 crore sales by FY26","description":"The JSW Group firm, which aims for Rs 5,000 crore revenue in the next two years, is expanding its retail presence in the home decorative business and adding more products in the industrial coating business, company's Joint Managing Director \u0026 CEO Sundaresan AS said.JSW Group's paint business turns profitable; aims Rs 5,000 crore sales by FY26Related stories","content":"JSW Paints crossed Rs 2,000 crore in revenue from operation in FY24 and logged its first operating profit in five years of inception, a top company official said on Thursday. The JSW Group firm, which aims for Rs 5,000 crore revenue in the next two years, is expanding its retail presence in the home decorative business and adding more products in the industrial coating business, company's Joint Managing Director \u0026 CEO Sundaresan AS said. \"We have been able to achieve operating breakeven this year (FY24),\" Sundaresan told PTI. \"We aim to keep growing anywhere from 5 to 10 times the market growth. In the current year (FY24), We have grown 10 times the rest of the industry,\" he said adding that JSW Paints is bringing new products into the market, expanding its reach and network and continuing to invest in building the brands. Asked about JSW Paints' target to have Rs 5,000 crore revenue within the next two years, Sundaresan said: \"We believe it is possible.\" \"Of course, it has to be aided by a buoyant market and if you keep doing the right things which we have been doing. We have always believed in taking the aspirational goals and working towards them systematically. So we believe it is possible,\" he added. Currently, JSW Paints has a network of 6,000 retailers across the country and will continue to expand it further. \"So we keep adding anywhere from 2,000 to 2,500 retailers annually, which we will continue to do,\" he said. JSW Paints has so far invested Rs 900 crore for its decorative and industrial coating business. Regarding the paints market, Sundaresan said, the industry has been growing at double-digit in the last few decades and is expected to do so going forward. It is a growing market and has a place for newcomers in the segment. In the Indian paints market, in the last 4-5 years, several new players including Aditya Birla Group, Pidilite and some others have entered into the segment. \"This is going to add more value to the industry, quality competition and new offerings,\" Sundaresan said. JSW Paints is trying to make a \"significant difference\" in terms of its offerings and has achieved this milestone in a short span of time despite two years being lost in COVID, he added. \"We have already faced the existing competition actively over the last five years. We believe JSW Paints will be able to face both the existing as well as new competition which is coming into the industry well with our approach and difference we can make in industry,\" he said. Launched in May 2019, JSW Paints is a part of the USD 24 billion JSW Group, whose business interests span sectors such as steel, energy, maritime infrastructure, defence, B2B e-commerce, realty, cement, sports and venture capital. ","cleaned_content":"jsw paints crossed rs \u003cTWO_THOUSAND\u003e crore in revenue from operation in fy24 and logged its first operating profit in five years of inception a top company official said on thursday the jsw group firm which aims for rs \u003cFIVE_THOUSAND\u003e crore revenue in the next two years is expanding its retail presence in the home decorative business and adding more products in the industrial coating business companys joint managing director ceo sundaresan as said we have been able to achieve operating breakeven this year fy24 sundaresan told pti we aim to keep growing anywhere from \u003cFIVE_\u003e to \u003cONE_TEN\u003e times the market growth in the current year fy24 we have grown \u003cONE_TEN\u003e times the rest of the industry he said adding that jsw paints is bringing new products into the market expanding its reach and network and continuing to invest in building the brands asked about jsw paints target to have rs \u003cFIVE_THOUSAND\u003e crore revenue within the next two years sundaresan said we believe it is possible of course it has to be aided by a buoyant market and if you keep doing the right things which we have been doing we have always believed in taking the aspirational goals and working towards them systematically so we believe it is possible he added currently jsw paints has a network of \u003cSIX_THOUSAND\u003e retailers across the country and will continue to expand it further so we keep adding anywhere from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e retailers annually which we will continue to do he said jsw paints has so far invested rs \u003cNINE_HUNDRED\u003e crore for its decorative and industrial coating business regarding the paints market sundaresan said the industry has been growing at double digit in the last few decades and is expected to do so going forward it is a growing market and has a place for newcomers in the segment in the indian paints market in the last \u003cFOUR_\u003e \u003cFIVE_\u003e years several new players including aditya birla group pidilite and some others have entered into the segment this is going to add more value to the industry quality competition and new offerings sundaresan said jsw paints is trying to make a significant difference in terms of its offerings and has achieved this milestone in a short span of time despite two years being lost in covid he added we have already faced the existing competition actively over the last five years we believe jsw paints will be able to face both the existing as well as new competition which is coming into the industry well with our approach and difference we can make in industry he said launched in may \u003cTWO_THOUSAND\u003e jsw paints is a part of the usd \u003cTWO_TEN\u003e billion jsw group whose business interests span sectors such as steel energy maritime infrastructure defence b2b e commerce realty cement sports and venture capital","timestamp":"2024-05-23T13:49:00+05:30","market_timestamp":"2024-05-23T13:49:00+05:30","off_market_hours":false}