{"url":"https://www.moneycontrol.com/news/business/hyundai-sets-up-ev-charging-station-in-chennai-plans-100-facilities-across-tamil-nadu-12733177.html","title":"Hyundai sets up EV charging station in Chennai, plans 100 facilities across Tamil Nadu","description":"The 180 kW DC fast charging station, comprising of 150 kW and 30 kW connectors, has been set at Spencer Plaza here, and would cater to compatible four-wheelers irrespective of brand and model, a company release said.Hyundai Motor India Installs Chennai's First 180 kW DC Fast Charging Station","content":"Automaker Hyundai Motor India Limited (HMIL) on Monday announced the inauguration of its fast electric-powered vehicles (EV) charging station here, and said this was first of the company's target of installing 100 such facilities across Tamil Nadu. The 180 kW DC fast charging station, comprising of 150 kW and 30 kW connectors, has been set at Spencer Plaza here, and would cater to compatible four-wheelers irrespective of brand and model, a company release said. \"As we celebrate 28 years of HMIL in India, we are delighted to inaugurate our first ever 180 kW fast public charging station in Chennai. In line with Hyundai's vision of 'Progress for Humanity', we aim to enhance convenience of all EV users, and hence our charging stations can be utilised by any four-wheeler EV user. HMIL envisages to install 100 charging stations across Tamil Nadu, to enhance the EV ecosystem and motivate more customers towards EV adoption across the state,\" Jae Wan Ryu, Executive Director - Corporate Planning, HMIL, was quoted as saying in the release. In addition to the fast public charging station, more than 170 of the charging points currently available in Tamil Nadu are mapped in the \"EV Charge\" section of myHyundai app for customer convenience. This app is open and accessible to all Hyundai as well as non-Hyundai EV users, the release added. ","cleaned_content":"automaker hyundai motor india limited hmil on monday announced the inauguration of its fast electric powered vehicles ev charging station here and said this was first of the companys target of installing \u003cONE_HUNDRED\u003e such facilities across tamil nadu the \u003cONE_HUNDRED\u003e kw dc fast charging station comprising of \u003cONE_HUNDRED\u003e kw and \u003cTHREE_TEN\u003e kw connectors has been set at spencer plaza here and would cater to compatible four wheelers irrespective of brand and model a company release said as we celebrate \u003cTWO_TEN\u003e years of hmil in india we are delighted to inaugurate our first ever \u003cONE_HUNDRED\u003e kw fast public charging station in chennai in line with hyundais vision of progress for humanity we aim to enhance convenience of all ev users and hence our charging stations can be utilised by any four wheeler ev user hmil envisages to install \u003cONE_HUNDRED\u003e charging stations across tamil nadu to enhance the ev ecosystem and motivate more customers towards ev adoption across the state jae wan ryu executive director corporate planning hmil was quoted as saying in the release in addition to the fast public charging station more than \u003cONE_HUNDRED\u003e of the charging points currently available in tamil nadu are mapped in the ev charge section of myhyundai app for customer convenience this app is open and accessible to all hyundai as well as non hyundai ev users the release added","timestamp":"2024-05-27T14:33:00+05:30","market_timestamp":"2024-05-27T14:33:00+05:30","off_market_hours":false}