{"url":"https://www.moneycontrol.com/news/business/euler-motors-raises-additional-rs-200-crore-in-series-c-funding-round-12735394.html","title":"Euler Motors raises additional Rs 200 crore in series C funding round","description":"Existing investors like British International Investment, Blume Venture and new investor Piramal Alternatives India Access Fund led this round's fresh infusion of funds, the company said in a statement.Euler Motors raises additional Rs 200 crore in series C funding round","content":"Electric vehicle maker Euler Motors on Wednesday said it has raised an additional Rs 200 crore in the series C funding round. Existing investors like British International Investment, Blume Venture and new investor Piramal Alternatives India Access Fund led this round's fresh infusion of funds, the company said in a statement. The company has raised Rs 570 crore in total from investors in series C funding round, it added. Euler Motors said it will utilise the fresh infusion of capital to further scale its pan-India presence and servicing infrastructure and establish a presence in over 40 cities by FY25. Till now, Euler Motors said it has till date raised an amount of Rs 770 crore. ","cleaned_content":"electric vehicle maker euler motors on wednesday said it has raised an additional rs \u003cTWO_HUNDRED\u003e crore in the series c funding round existing investors like british international investment blume venture and new investor piramal alternatives india access fund led this rounds fresh infusion of funds the company said in a statement the company has raised rs \u003cFIVE_HUNDRED\u003e crore in total from investors in series c funding round it added euler motors said it will utilise the fresh infusion of capital to further scale its pan india presence and servicing infrastructure and establish a presence in over \u003cFOUR_TEN\u003e cities by fy25 till now euler motors said it has till date raised an amount of rs \u003cSEVEN_HUNDRED\u003e crore","timestamp":"2024-05-29T12:26:00+05:30","market_timestamp":"2024-05-29T12:26:00+05:30","off_market_hours":false}