{"url":"https://www.moneycontrol.com/news/business/air-india-in-good-position-to-retrofit-over-100-planes-ceo-campbell-wilson-12741469.html","title":"Air India plans to retrofit 100 aircrafts, CEO says aspiring to be a hub carrier","description":"Looking ahead, Wilson outlined plans to deploy new aircraft exclusively on international routes, including destinations such as New York, San Francisco, and Dubai. Related stories","content":"Air India is set to undergo a significant transformation with plans to retrofit more than 100 aircraft, including 40 wide-body planes by 2025, as revealed by its Chief, Campbell Wilson, on June 5. This revamp also entails the procurement of around 25,000 aircraft seats. Expressing frustration over the pace of fleet upgrades, Wilson underscored the airline's commitment to enhancing customer experience with new products. \"Air India's fleet will be fitted with new seats by mid-2026,\" he added while speaking at the CAPA India Aviation Summit. Wilson emphasised that various initiatives are underway as part of Air India's transformation, with a focus on integration, growth, optimisation, and customer-centricity. He highlighted the flexibility within the Tata Group's aviation business, including both full and low-cost services, positioning Air India advantageously in the market. On the cost front, Wilson noted that airfares have been lagging behind overall inflation, reflecting ongoing challenges in the airline industry. Looking ahead, Wilson outlined plans to deploy new aircraft exclusively on international routes, including destinations such as New York, San Francisco, and Dubai. Additionally, Air India aims to establish itself as a hub carrier, with forthcoming operations centered around hubs in Delhi, Mumbai, and Bengaluru. Notably, the airline is set to launch a London-Bengaluru flight in the near future. Meanwhile, Kapil Kaul, CEO \u0026 MD of CAPA, provided insights into the broader aviation landscape. He highlighted the Airports Authority of India's significant investment of $4 billion in expanding airport infrastructure in non-metro cities, with plans to privatize 25 more airports in the next financial year. Additionally, Kaul projected growth trends for the Indian aviation sector, forecasting a 6-8% increase in domestic passenger traffic and a 9-11% rise in international passenger traffic in FY25. He also anticipated a fleet expansion, with the number of aircraft operated by Indian airlines expected to reach 812 by the end of FY25, up from 728 currently. Speaking about delays on international flight, Campbell said that the airline could have better handled this ‘unusual combination of events\". He added that delays in Air India flight happened due to a combination of technical glitches and rostering issues. On May 31, the Directorate General of Civil Aviation (DGCA) issued a show-cause notice to Air India for inordinate delays of at least two international flights – AI 183 from Delhi to San Francisco on 30 May and AI 179 from Mumbai to San Francisco on 24 May – and its failure to take care of passengers. Then on June 2, an Air India flight from Delhi to Vancouver took off after a nearly 22-hour delay. More than 50 passengers of this flight protested against the airline inside the terminal. Wilson also said that there are plenty of changes planned for Air India, and its merger with Vistara is well on its track. Wilson said that “plenty of changes” will take place to make Air India bigger and better. He said new IT systems have been brought in. He also said that more than 100 aircraft will be retrofitted including 40 wide body aircraft. Wilson said the airline ordered about 25,000 new seats to be replaced in the aircraft, and $400 million has been spent on replacing the seats. They are focusing on integration, growth, optimisation and customer experience. The Air India CEO, however, said that increase in inflation has impacted the aviation sector, and that supply chain constraints are proving to be a challenge in improving the aircraft. Campbell also said that Air India new A 350 aircraft will be utilised for exclusive markets like Singapore, Dubai, and Frankfurt. ","cleaned_content":"air india is set to undergo a significant transformation with plans to retrofit more than \u003cONE_HUNDRED\u003e aircraft including \u003cFOUR_TEN\u003e wide body planes by \u003cTWO_THOUSAND\u003e as revealed by its chief campbell wilson on june \u003cFIVE_\u003e this revamp also entails the procurement of around \u003cTWO_TEN_THOUSAND\u003e aircraft seats expressing frustration over the pace of fleet upgrades wilson underscored the airlines commitment to enhancing customer experience with new products air indias fleet will be fitted with new seats by mid \u003cTWO_THOUSAND\u003e he added while speaking at the capa india aviation summit wilson emphasised that various initiatives are underway as part of air indias transformation with a focus on integration growth optimisation and customer centricity he highlighted the flexibility within the tata groups aviation business including both full and low cost services positioning air india advantageously in the market on the cost front wilson noted that airfares have been lagging behind overall inflation reflecting ongoing challenges in the airline industry looking ahead wilson outlined plans to deploy new aircraft exclusively on international routes including destinations such as new york san francisco and dubai additionally air india aims to establish itself as a hub carrier with forthcoming operations centered around hubs in delhi mumbai and bengaluru notably the airline is set to launch a london bengaluru flight in the near future meanwhile kapil kaul ceo md of capa provided insights into the broader aviation landscape he highlighted the airports authority of indias significant investment of \u003cFOUR_\u003e billion in expanding airport infrastructure in non metro cities with plans to privatize \u003cTWO_TEN\u003e more airports in the next financial year additionally kaul projected growth trends for the indian aviation sector forecasting a \u003cSIX_\u003e \u003cEIGHT_PERCENT\u003e increase in domestic passenger traffic and a \u003cNINE_\u003e \u003cONE_TEN_PERCENT\u003e rise in international passenger traffic in fy25 he also anticipated a fleet expansion with the number of aircraft operated by indian airlines expected to reach \u003cEIGHT_HUNDRED\u003e by the end of fy25 up from \u003cSEVEN_HUNDRED\u003e currently speaking about delays on international flight campbell said that the airline could have better handled this unusual combination of events he added that delays in air india flight happened due to a combination of technical glitches and rostering issues on may \u003cTHREE_TEN\u003e the directorate general of civil aviation dgca issued a show cause notice to air india for inordinate delays of at least two international flights ai \u003cONE_HUNDRED\u003e from delhi to san francisco on \u003cTHREE_TEN\u003e may and ai \u003cONE_HUNDRED\u003e from mumbai to san francisco on \u003cTWO_TEN\u003e may and its failure to take care of passengers then on june \u003cTWO_\u003e an air india flight from delhi to vancouver took off after a nearly \u003cTWO_TEN\u003e hour delay more than \u003cFIVE_TEN\u003e passengers of this flight protested against the airline inside the terminal wilson also said that there are plenty of changes planned for air india and its merger with vistara is well on its track wilson said that plenty of changes will take place to make air india bigger and better he said new it systems have been brought in he also said that more than \u003cONE_HUNDRED\u003e aircraft will be retrofitted including \u003cFOUR_TEN\u003e wide body aircraft wilson said the airline ordered about \u003cTWO_TEN_THOUSAND\u003e new seats to be replaced in the aircraft and \u003cFOUR_HUNDRED\u003e million has been spent on replacing the seats they are focusing on integration growth optimisation and customer experience the air india ceo however said that increase in inflation has impacted the aviation sector and that supply chain constraints are proving to be a challenge in improving the aircraft campbell also said that air india new a \u003cTHREE_HUNDRED\u003e aircraft will be utilised for exclusive markets like singapore dubai and frankfurt","timestamp":"2024-06-05T17:06:00+05:30","market_timestamp":"2024-06-06T09:15:00+05:30","off_market_hours":true}