{"url":"https://www.moneycontrol.com/news/business/japan-airlines-inks-codeshare-pact-with-indigo-12739393.html","title":"Japan Airlines inks codeshare pact with IndiGo","description":"At present, Japan Airlines operates its services to Delhi and Bengaluru from Tokyo. It offers daily flight services to the national capital from Haneda Airport, while its thrice-a-week services to Bengaluru are operated from Narita Airport.Japan Airlines inks codeshare pact with IndiGoRelated stories","content":"Japan Airlines on Monday said it has entered into a codeshare arrangement with IndiGo, which would help the Japanese carrier expand services to 14 destinations of the domestic carrier's network. At present, Japan Airlines operates its services to Delhi and Bengaluru from Tokyo. It offers daily flight services to the national capital from Haneda Airport, while its thrice-a-week services to Bengaluru are operated from Narita Airport. \"Japan Airlines (JAL) and IndiGo have agreed on codeshare partnership which will benefit the customers by providing more travel options between Japan and India,\" a statement said. The partnership will enable codeshare on India routes that connect to JAL-operated flights from/to Delhi and Bengaluru, as per the statement. Through this partnership, Japan Airlines said it will be able to establish an extensive network pan-India, including major cities such as Mumbai, Chennai, Hyderabad, Kolkata, Ahmedabad, Amritsar, Kochi, Coimbatore, Thiruvananthapuram, Tiruchirappalli, Pune, Lucknow, Varanasi, and Goa, which connects to JAL-operated flights. Later, the two carriers will seek to further expand the cooperation with IndiGo codesharing on JAL-operated flights, it added. \"IndiGo is expanding its portfolio of codeshare partnerships with this agreement with Japan Airlines. This phase of the partnership expands the choices available to Japan Airlines customers for journeys to/from Japan, using IndiGo's extensive network in India,\" said Abhijit DasGupta, Senior Vice President for network planning and revenue management at IndiGo. The partnership will provide seamless connectivity to support trade, commerce, and tourism between the two countries, he said. \"Over time, we intend to expand the scope of geographic and reciprocal coverage of this relationship to further grow travel opportunities for customers of both airlines,\" DasGupta added. \"With the extensive network, travellers to and from India and Japan will be able to book their flight on one ticket. In recent years, India has achieved remarkable economic growth, and the air travel demand between Japan and India is increasing more than ever before,\" said Ross Leggett, Managing Executive Officer, Senior Vice President Route Marketing at Japan Airlines. ","cleaned_content":"japan airlines on monday said it has entered into a codeshare arrangement with indigo which would help the japanese carrier expand services to \u003cONE_TEN\u003e destinations of the domestic carriers network at present japan airlines operates its services to delhi and bengaluru from tokyo it offers daily flight services to the national capital from haneda airport while its thrice a week services to bengaluru are operated from narita airport japan airlines jal and indigo have agreed on codeshare partnership which will benefit the customers by providing more travel options between japan and india a statement said the partnership will enable codeshare on india routes that connect to jal operated flights from to delhi and bengaluru as per the statement through this partnership japan airlines said it will be able to establish an extensive network pan india including major cities such as mumbai chennai hyderabad kolkata ahmedabad amritsar kochi coimbatore thiruvananthapuram tiruchirappalli pune lucknow varanasi and goa which connects to jal operated flights later the two carriers will seek to further expand the cooperation with indigo codesharing on jal operated flights it added indigo is expanding its portfolio of codeshare partnerships with this agreement with japan airlines this phase of the partnership expands the choices available to japan airlines customers for journeys to from japan using indigos extensive network in india said abhijit dasgupta senior vice president for network planning and revenue management at indigo the partnership will provide seamless connectivity to support trade commerce and tourism between the two countries he said over time we intend to expand the scope of geographic and reciprocal coverage of this relationship to further grow travel opportunities for customers of both airlines dasgupta added with the extensive network travellers to and from india and japan will be able to book their flight on one ticket in recent years india has achieved remarkable economic growth and the air travel demand between japan and india is increasing more than ever before said ross leggett managing executive officer senior vice president route marketing at japan airlines","timestamp":"2024-06-03T13:39:00+05:30","market_timestamp":"2024-06-03T13:39:00+05:30","off_market_hours":false}