{"url":"https://www.moneycontrol.com/technology/auto/domestic-pv-sales-set-to-exceed-5-million-mark-tata-motors-geared-up-to-tap-into-growth-opportunity-article-12737749.html","title":"Domestic PV sales set to exceed 5 million-mark; Tata Motors geared up to tap into growth opportunity","description":"In a message to the company's shareholders in Annual Report for 2023-24, he noted that the company will focus on revenue growth and strong free cash flows across its businesses going ahead.Tata Group Chairman N ChandrasekaranRelated stories","content":"Domestic passenger vehicle segment is expected to cross the 50 lakh-mark of annual sales over the next few years and Tata Motors is geared up to tap into this growth opportunity, according to Tata Group Chairman N Chandrasekaran. In a message to the company's shareholders in Annual Report for 2023-24, he noted that the company will focus on revenue growth and strong free cash flows across its businesses going ahead. \"India is well on track to exceed the 5 million vehicle sales mark in passenger vehicles over the next few years from the 4.1 million volumes clocked last year,\" Chandrasekaran said. \"Tata Motors is well placed to further strengthen its market position and tap into this growth opportunity,\" Chandrasekaran stated. Elaborating on the passenger vehicle segment, he stated that in the next phase the business will focus on driving revenue growth, improving EBITDA, strong free cash flows, technology and brand leadership. Apart from vehicular sales, the business will also focus on vehicle parc linked businesses like spares, digital and smart mobility solutions which will help reduce the volatility of the vehicle sales business, he added. This should help drive consistent value accretive growth in the coming years, Chandrasekaran said. The competitive intensity in this portfolio will remain high and the business will continue to invest in products, platforms, electrical \u0026 electronic architectures, and vehicle software to remain competitive, he stated. The EV business will focus on driving up penetration through multiple product launches, focus on market development, charging network enhancements and continuing to introduce aspirational product features, Chandrasekaran said. The company's PV business recorded its highest-ever turnover in FY24 with an annual revenue of Rs 52,353 crore, growing by 9.4 per cent over FY23. Chandrasekaran said the commercial vehicle vertical will also focus on vehicle parc linked businesses to reduce the volatility of the vehicle sales business. On JLR, he stated that the brand will continue to double down on its journey to become a premium luxury OEM, deliver strong revenue growth, improve profitability further, drive positive free cash flows and continue to invest in products and technologies. \"There is an exciting range of products lined up to be launched over the next three years that needs to be delivered successfully. The first electric Range Rover launches later this year, and there are further EVs lined up in the coming years including the all-electric Jaguar,\" he said. Chandrasekaran said that to enable execution of these well differentiated strategies and to further empower each business to pursue it purposefully, the Tata Motors' board has proposed the demerger of the company into two separate listed companies. The commercial vehicle business and its related investments in one entity and the passenger vehicle businesses including PV, EV, JLR and its related investments in another entity, he informed shareholders. \"This will also help secure the considerable synergies across PV, EV and JLR particularly in the areas of EVs, autonomous vehicles, and vehicle software,\" Chandrasekaran said. This will lead each company to deliver a superior experience for customers, better growth prospects for employees and, enhanced value for shareholders, he added. Chandrasekaran said the global geo-political scenario continues to be tense with continuing military conflicts. These have created immense hardships for the affected people and also resulted in supply chain disruptions, he stated. As the year draws to a close, the economic scenario is stabilising with global growth estimated to be around 3 per cent during the next couple of years, he said. ","cleaned_content":"domestic passenger vehicle segment is expected to cross the \u003cFIVE_TEN\u003e lakh mark of annual sales over the next few years and tata motors is geared up to tap into this growth opportunity according to tata group chairman n chandrasekaran in a message to the companys shareholders in annual report for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e he noted that the company will focus on revenue growth and strong free cash flows across its businesses going ahead india is well on track to exceed the \u003cFIVE_\u003e million vehicle sales mark in passenger vehicles over the next few years from the \u003cFOUR_\u003e million volumes clocked last year chandrasekaran said tata motors is well placed to further strengthen its market position and tap into this growth opportunity chandrasekaran stated elaborating on the passenger vehicle segment he stated that in the next phase the business will focus on driving revenue growth improving ebitda strong free cash flows technology and brand leadership apart from vehicular sales the business will also focus on vehicle parc linked businesses like spares digital and smart mobility solutions which will help reduce the volatility of the vehicle sales business he added this should help drive consistent value accretive growth in the coming years chandrasekaran said the competitive intensity in this portfolio will remain high and the business will continue to invest in products platforms electrical electronic architectures and vehicle software to remain competitive he stated the ev business will focus on driving up penetration through multiple product launches focus on market development charging network enhancements and continuing to introduce aspirational product features chandrasekaran said the companys pv business recorded its highest ever turnover in fy24 with an annual revenue of rs \u003cFIVE_TEN_THOUSAND\u003e crore growing by \u003cNINE_PERCENT\u003e over fy23 chandrasekaran said the commercial vehicle vertical will also focus on vehicle parc linked businesses to reduce the volatility of the vehicle sales business on jlr he stated that the brand will continue to double down on its journey to become a premium luxury oem deliver strong revenue growth improve profitability further drive positive free cash flows and continue to invest in products and technologies there is an exciting range of products lined up to be launched over the next three years that needs to be delivered successfully the first electric range rover launches later this year and there are further evs lined up in the coming years including the all electric jaguar he said chandrasekaran said that to enable execution of these well differentiated strategies and to further empower each business to pursue it purposefully the tata motors board has proposed the demerger of the company into two separate listed companies the commercial vehicle business and its related investments in one entity and the passenger vehicle businesses including pv ev jlr and its related investments in another entity he informed shareholders this will also help secure the considerable synergies across pv ev and jlr particularly in the areas of evs autonomous vehicles and vehicle software chandrasekaran said this will lead each company to deliver a superior experience for customers better growth prospects for employees and enhanced value for shareholders he added chandrasekaran said the global geo political scenario continues to be tense with continuing military conflicts these have created immense hardships for the affected people and also resulted in supply chain disruptions he stated as the year draws to a close the economic scenario is stabilising with global growth estimated to be around \u003cTHREE_PERCENT\u003e during the next couple of years he said","timestamp":"2024-05-31T13:14:00+05:30","market_timestamp":"2024-05-31T13:14:00+05:30","off_market_hours":false}