{"url":"https://www.moneycontrol.com/news/business/suzlon-group-gets-82-mw-wind-energy-project-from-oyster-green-12737777.html","title":"Suzlon Group gets 82 MW wind energy project from Oyster Green","description":"As part of the agreement, Suzlon will supply the wind turbines and execute the project, including erection and commissioning. The company will also undertake comprehensive operations and maintenance services post commissioning.Suzlon Group gets 82 MW wind energy project from Oyster Green","content":"Suzlon Group on Friday said it has secured a wind energy project of about 82 megawatt (MW) from Oyster Green Hybrid One Pvt Ltd. It will install 26 wind turbine generators (WTGs), each having a rated capacity of 3.15 MW at Oyster Green's site at Agar in Madhya Pradesh, the company said in a statement. \"Suzlon secures a new order of 81.9 MW for the 3 MW series from Oyster Green Hybrid One Private Limited,\" it said. \"The electricity generated from this project will target the C\u0026I customer segment, creating a deeper penetration of renewable energy in India. We are committed to powering the industry with sustainable green energy to power their progress while meeting their net-zero ambitions,\" Vivek Srivastava, Chief Executive Officer, India Business, Suzlon Group, said. Pune-based Suzlon Group is one of the leading renewable energy solutions providers in the world with 20.7 GW of wind energy capacity installed across 17 countries. ","cleaned_content":"suzlon group on friday said it has secured a wind energy project of about \u003cEIGHT_TEN\u003e megawatt mw from oyster green hybrid one pvt ltd it will install \u003cTWO_TEN\u003e wind turbine generators wtgs each having a rated capacity of \u003cTHREE_\u003e mw at oyster greens site at agar in madhya pradesh the company said in a statement suzlon secures a new order of \u003cEIGHT_TEN\u003e mw for the \u003cTHREE_\u003e mw series from oyster green hybrid one private limited it said the electricity generated from this project will target the c i customer segment creating a deeper penetration of renewable energy in india we are committed to powering the industry with sustainable green energy to power their progress while meeting their net zero ambitions vivek srivastava chief executive officer india business suzlon group said pune based suzlon group is one of the leading renewable energy solutions providers in the world with \u003cTWO_TEN\u003e gw of wind energy capacity installed across \u003cONE_TEN\u003e countries","timestamp":"2024-05-31T13:22:00+05:30","market_timestamp":"2024-05-31T13:22:00+05:30","off_market_hours":false}