{"url":"https://www.moneycontrol.com/news/business/adani-portfolio-delivers-record-45-ebitda-growth-in-fy24-12738853.html","title":"Adani portfolio delivers record 45% EBITDA growth in FY24","description":"Emerging from a damning report of a US short seller, which hit the market value of its listed companies, Adani Group in 2023-24 focused on containing debt, reducing founder share pledge and consolidating the business in core competencies. The five-year CAGR (compound annual growth rate) for profit growth was 54 per cent.Adani portfolio delivers record 45% EBITDA growth in FY24Related stories","content":"Adani Group companies posted a record 45 per cent rise in pre-tax profit (EBITDA) to Rs 82,917 crore (about USD 10 billion) in FY24 as the apples-to-airport conglomerate made a massive comeback, the group said on Sunday. Emerging from a damning report of a US short seller, which hit the market value of its listed companies, Adani Group in 2023-24 focused on containing debt, reducing founder share pledge and consolidating the business in core competencies. The five-year CAGR (compound annual growth rate) for profit growth was 54 per cent. As much as 84 per cent of EBITDA is from 'core infrastructure' businesses, providing highly predictable cash flows. Strong Asset Base built over three decades supporting resilient critical infrastructure stands at Rs 4,78,137 crore (USD 57 billion) - this asset base serves a consumer base of 350 million users. \"The performances for FY24 (2023-24 fiscal) and the past five years signify the strength and stability of Adani portfolio and the robustness of its businesses that despite all the external volatilities and headwinds continue to deliver strong and consistent growth year after year. It also highlights its superior capital allocation strategy that maximises returns and minimises risks,\" the statement said. From FY19 to FY24, Adani portfolio's gross assets increased at a 25 per cent CAGR, while EBITDA grew at 27 per cent CAGR. In comparison, the net debt increased at only 14 per cent. \"This exhibits the group's exceptional capability in efficiently deploying the capital,\" it said. \"In FY24, the Adani portfolio of companies rose to their best, delivering record EBITDA growth of 45 per cent. With surging cash flows and enhanced credit profiles, Adani portfolio of companies are in a 'Stronger than Ever' position to accelerate growth investments,\" it added. The consumer user base of the platform has increased to 350 million, with fast-growing consumer franchises across airports, electricity distribution, smart metering, gas distribution and direct-to-consumer digital platform. \"Rising cash flows from rapidly growing profits have lowered the net leverage significantly,\" it said. \"The portfolio is now very conservatively leveraged with net debt to EBITDA as low as 2.2x; down from 3.3x - this demonstrates a disciplined growth profile providing stable, predictable and resilient performance year-on-year,\" it said. The assured cash flows with multi-decadal visibility give Adani portfolio companies an advantage over the industry. It enables them to optimise leveraging i.e. operate at higher net debt to EBITDA than industry benchmark, yet with lower risks. This leads to faster asset addition, higher growth and maximising returns for shareholders. At 2.2x, Adani portfolio has a balance sheet capacity for even higher growth. \"Total Gross Assets increased by Rs 65,901 crore (USD 8 billion) and now stand at Rs 4,78,220 crore (USD 57.4 billion),\" it said. \"Adani Enterprises Ltd housing green hydrogen, airports business and Adani Green Energy Ltd implementing renewable power generation capacity witnessed the highest gross asset additions or 61 per cent of the total gross asset added. The gains from these will reflect in FY25 earnings.\" Adani group said high liquidity is maintained with a cash balance at 24.8 per cent of gross debt. A cash balance of Rs 59,791 crore (USD 7.2 billion) provides benchmark liquidity cover. In FY24, the group's flagship Adani Enterprises commissioned an ingot wafer unit as part of solar module manufacturing, wind turbine facility and copper smelter. Adani Cement completed the Sanghi Cement acquisition while promoters infused more funds into the company. Adani Ports acquired Gopalpur port, Adani Power commissioned a 1.6 GW Godda power plant, Adani Green added 2.8 GW renewable energy capacity and commenced operations of a solar power project in Khavda, Gujarat, and Adani Energy Solutions put up 1,244 circuit kilometres of transmission lines. ","cleaned_content":"adani group companies posted a record \u003cFOUR_TEN_PERCENT\u003e rise in pre tax profit ebitda to rs \u003cEIGHT_TEN_THOUSAND\u003e crore about usd \u003cONE_TEN\u003e billion in fy24 as the apples to airport conglomerate made a massive comeback the group said on sunday emerging from a damning report of a us short seller which hit the market value of its listed companies adani group in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e focused on containing debt reducing founder share pledge and consolidating the business in core competencies the five year cagr compound annual growth rate for profit growth was \u003cFIVE_TEN_PERCENT\u003e as much as \u003cEIGHT_TEN_PERCENT\u003e of ebitda is from core infrastructure businesses providing highly predictable cash flows strong asset base built over three decades supporting resilient critical infrastructure stands at rs \u003cFOUR_HUNDRED_THOUSAND\u003e crore usd \u003cFIVE_TEN\u003e billion this asset base serves a consumer base of \u003cTHREE_HUNDRED\u003e million users the performances for fy24 \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal and the past five years signify the strength and stability of adani portfolio and the robustness of its businesses that despite all the external volatilities and headwinds continue to deliver strong and consistent growth year after year it also highlights its superior capital allocation strategy that maximises returns and minimises risks the statement said from fy19 to fy24 adani portfolios gross assets increased at a \u003cTWO_TEN_PERCENT\u003e cagr while ebitda grew at \u003cTWO_TEN_PERCENT\u003e cagr in comparison the net debt increased at only \u003cONE_TEN_PERCENT\u003e this exhibits the groups exceptional capability in efficiently deploying the capital it said in fy24 the adani portfolio of companies rose to their best delivering record ebitda growth of \u003cFOUR_TEN_PERCENT\u003e with surging cash flows and enhanced credit profiles adani portfolio of companies are in a stronger than ever position to accelerate growth investments it added the consumer user base of the platform has increased to \u003cTHREE_HUNDRED\u003e million with fast growing consumer franchises across airports electricity distribution smart metering gas distribution and direct to consumer digital platform rising cash flows from rapidly growing profits have lowered the net leverage significantly it said the portfolio is now very conservatively leveraged with net debt to ebitda as low as \u003cTWO_\u003e x down from \u003cTHREE_\u003e x this demonstrates a disciplined growth profile providing stable predictable and resilient performance year on year it said the assured cash flows with multi decadal visibility give adani portfolio companies an advantage over the industry it enables them to optimise leveraging i e operate at higher net debt to ebitda than industry benchmark yet with lower risks this leads to faster asset addition higher growth and maximising returns for shareholders at \u003cTWO_\u003e x adani portfolio has a balance sheet capacity for even higher growth total gross assets increased by rs \u003cSIX_TEN_THOUSAND\u003e crore usd \u003cEIGHT_\u003e billion and now stand at rs \u003cFOUR_HUNDRED_THOUSAND\u003e crore usd \u003cFIVE_TEN\u003e billion it said adani enterprises ltd housing green hydrogen airports business and adani green energy ltd implementing renewable power generation capacity witnessed the highest gross asset additions or \u003cSIX_TEN_PERCENT\u003e of the total gross asset added the gains from these will reflect in fy25 earnings adani group said high liquidity is maintained with a cash balance at \u003cTWO_TEN_PERCENT\u003e of gross debt a cash balance of rs \u003cFIVE_TEN_THOUSAND\u003e crore usd \u003cSEVEN_\u003e billion provides benchmark liquidity cover in fy24 the groups flagship adani enterprises commissioned an ingot wafer unit as part of solar module manufacturing wind turbine facility and copper smelter adani cement completed the sanghi cement acquisition while promoters infused more funds into the company adani ports acquired gopalpur port adani power commissioned a \u003cONE_\u003e gw godda power plant adani green added \u003cTWO_\u003e gw renewable energy capacity and commenced operations of a solar power project in khavda gujarat and adani energy solutions put up \u003cONE_THOUSAND\u003e circuit kilometres of transmission lines","timestamp":"2024-06-03T07:55:00+05:30","market_timestamp":"2024-06-03T09:15:00+05:30","off_market_hours":true}