{"url":"https://www.moneycontrol.com/news/business/mother-dairy-hikes-milk-prices-by-rs-2-per-litre-in-ncr-12739233.html","title":"Mother Dairy hikes milk prices by Rs 2 per litre in NCR","description":"The increase in prices of all variants of milk is effective from Monday (June 3) in Delhi-NCR as well as other markets where it has a presence.Mother Dairy hikes milk prices by Rs 2 per litre in NCRRelated stories","content":"Mother Dairy on Monday announced Rs 2 per litre hike in milk prices in the Delhi-NCR market due to a rise in input cost over the last 15 months. The increase in prices of all variants of milk is effective from Monday (June 3) in Delhi-NCR as well as other markets where it has a presence. On Sunday, Amul announced an increase in rates. In a statement, Mother Dairy said it is \"increasing its liquid milk prices by Rs 2 per litre across all operating markets from June 03, 2024 onwards.\" The increase in consumer price is mainly to compensate the producers for increased production costs, which have been on the rise for over one year, it said. In Delhi-NCR, Mother Dairy full cream milk will be available now at Rs 68 per litre, while toned and double-toned milk at Rs 56 and Rs 50 per litre, respectively. Buffalo and cow milk prices have been increased to Rs 72 and Rs 58 per litre respectively. Token milk (bulk vended milk) will be sold at Rs 54 per litre. Mother Dairy, which currently sells 35 lakh litre per day of fresh milk in Delhi-NCR, said it had last revised its liquid milk prices in February 2023. \"Despite paying higher prices towards milk procurement in the last few months, the consumer prices were kept intact. Moreover, the heat stress across the country has been unprecedented and it is likely to further impact milk production,\" Mother Dairy said. The company highlighted that it passes an average of around 75- 80 per cent of the sales realisation from milk towards its procurement. This helps in ensuring the sustenance of dairy farming and the availability of quality milk. \"The surge in farm prices is only being partially passed on to the consumers, with an effective revision of 3-4 per cent, thereby securing the interests of both the milk producers and the consumers,\" Mother Dairy said. On late Sunday, the Gujarat Cooperative Milk Marketing Federation (GCMMF), which markets dairy products under the Amul brand, increased milk prices by about Rs 2 per litre from Monday across the country. The increase of Rs 2 per litre translates to 3-4 per cent increase in MRP which is much lower than average food inflation, GCMMF said in a late night statement. GCMMF said that since February 2023, it has not made any increase in prices of fresh pouch milk in major markets. \"This price hike is being done due to an increase in the overall cost of operation and production of milk. Our member unions have also increased farmer's price approximately by 6-8 per cent over the last one year,\" GCMMF said. Amul as a policy passes on almost 80 paise of every rupee paid by consumers for milk and milk products to the milk producers. \"The price revision shall help in sustaining remunerative milk prices to our milk producers and to encourage them for higher milk production,\" the statement had said. ","cleaned_content":"mother dairy on monday announced rs \u003cTWO_\u003e per litre hike in milk prices in the delhi ncr market due to a rise in input cost over the last \u003cONE_TEN\u003e months the increase in prices of all variants of milk is effective from monday june \u003cTHREE_\u003e in delhi ncr as well as other markets where it has a presence on sunday amul announced an increase in rates in a statement mother dairy said it is increasing its liquid milk prices by rs \u003cTWO_\u003e per litre across all operating markets from june \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e onwards the increase in consumer price is mainly to compensate the producers for increased production costs which have been on the rise for over one year it said in delhi ncr mother dairy full cream milk will be available now at rs \u003cSIX_TEN\u003e per litre while toned and double toned milk at rs \u003cFIVE_TEN\u003e and rs \u003cFIVE_TEN\u003e per litre respectively buffalo and cow milk prices have been increased to rs \u003cSEVEN_TEN\u003e and rs \u003cFIVE_TEN\u003e per litre respectively token milk bulk vended milk will be sold at rs \u003cFIVE_TEN\u003e per litre mother dairy which currently sells \u003cTHREE_TEN\u003e lakh litre per day of fresh milk in delhi ncr said it had last revised its liquid milk prices in february \u003cTWO_THOUSAND\u003e despite paying higher prices towards milk procurement in the last few months the consumer prices were kept intact moreover the heat stress across the country has been unprecedented and it is likely to further impact milk production mother dairy said the company highlighted that it passes an average of around \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN_PERCENT\u003e of the sales realisation from milk towards its procurement this helps in ensuring the sustenance of dairy farming and the availability of quality milk the surge in farm prices is only being partially passed on to the consumers with an effective revision of \u003cTHREE_\u003e \u003cFOUR_PERCENT\u003e thereby securing the interests of both the milk producers and the consumers mother dairy said on late sunday the gujarat cooperative milk marketing federation gcmmf which markets dairy products under the amul brand increased milk prices by about rs \u003cTWO_\u003e per litre from monday across the country the increase of rs \u003cTWO_\u003e per litre translates to \u003cTHREE_\u003e \u003cFOUR_PERCENT\u003e increase in mrp which is much lower than average food inflation gcmmf said in a late night statement gcmmf said that since february \u003cTWO_THOUSAND\u003e it has not made any increase in prices of fresh pouch milk in major markets this price hike is being done due to an increase in the overall cost of operation and production of milk our member unions have also increased farmers price approximately by \u003cSIX_\u003e \u003cEIGHT_PERCENT\u003e over the last one year gcmmf said amul as a policy passes on almost \u003cEIGHT_TEN\u003e paise of every rupee paid by consumers for milk and milk products to the milk producers the price revision shall help in sustaining remunerative milk prices to our milk producers and to encourage them for higher milk production the statement had said","timestamp":"2024-06-03T11:07:00+05:30","market_timestamp":"2024-06-03T11:07:00+05:30","off_market_hours":false}