{"url":"https://www.moneycontrol.com/news/business/airtel-tycoon-sunil-mittal-lauds-pm-modi-as-solid-leader-running-a-solid-stable-economy-12736722.html","title":"Airtel tycoon Sunil Mittal lauds PM Modi as solid leader running a solid, stable economy","description":"Mittal said he met Modi in September 2018 when the prime minister told him that his government will play by the book, not side with anyone and will do what is good for the country.Airtel tycoon Sunil Mittal lauds PM Modi as solid leader running a solid, stable economyRelated stories","content":"The massive valuations of Indian corporates, including the USD 100 billion of his own company, are the result of a stable and solid economy under \"a very solid leader,\" Airtel founder Sunil Mittal has said. In an interview to Economic Times published Thursday, Mittal said Prime Minister Narendra Modi's unequivocal message of his government not siding with any corporate during an 'inspiring' meeting in 2018 marked a pivotal moment for Bharti Airtel, helping it grow in midst of intense competition from new entrant Reliance Jio. Mittal said he met Modi in September 2018 when the prime minister told him that his government will play by the book, not side with anyone and will do what is good for the country. \"And to my mind, a lot of statements that this government is only favouring a few are all absolutely misplaced,\" Mittal said. \"Money is pouring into this country, a lot of capital is coming in, the stock market is rising. These massive valuations are a function of a stable, solid, functional economy under a very solid leader,\" he said. Mittals rival bil'ionaire Mukesh Ambani's Jio disrupted the telecom market in 2016 with free voice and data services that helped it topple Airtel to become the nation's No.1 telecom firm. Reeling under the heat of market onslaught, Airtel at that time had felt that some decisions of the telecom regulator had adverse impact on the incumbent market leader. In September 2018, he sought a meeting with the PM when Mittal was still the chairman of GSMA, a lobby group representing the interests of mobile network operators, and had just completed his chairmanship of the International Chambers of Commerce. In that capacity too he used to brief Modi occasionally on WTO, G20 and other issues. \"So I took the liberty and took his permission to talk about the Indian telecom industry. I told him that things were going very badly and the situation was getting very alarming,\" Mittal said, referring to the free voice and data services offered by Jio and a slew of regulations that he felt favoured one side. Recalling his meeting with Modi where both spoke in Hindi, Mittal said he told the PM: \"I will fight in the marketplace, but I can't fight the government.\" \"He (PM) told me that his government will not tilt towards either side. Whatever is good for the country will be done. You fight in the marketplace. I don't have a view on that. But from the side of the government you can be assured that the government will not take sides,\" he said recalling Modi's words. And that, he said, \"was enough\" for him. \"I got up and thanked him... this was the turning point (for Airtel),\" he said. Mittal said he derived an inexplicable energy and inspiration from the meeting. \"Sometimes you need inspiration. I do that to my troops. I needed that from someone. There was a very strong special message (from the PM). Fight in the market. Here was a man telling me - who has himself fought against a lot of odds - that you do your work and be very assured that this government is going to only do things that are good for the nation.\" He said he started looking at the regulations - that he believed were not good for Airtel - in a larger perspective. \"Maybe lower tariffs were better ... lower tariffs were better to democratise the data services. You start to see things in a different context, because you are reassured that there is no agenda here,\" he said. Jio's entry completely changed the scenario of Internet in India as affordable data tariffs led to mass penetration of smartphones. This helped accelerate adoption of things like digital payments. ","cleaned_content":"the massive valuations of indian corporates including the usd \u003cONE_HUNDRED\u003e billion of his own company are the result of a stable and solid economy under a very solid leader airtel founder sunil mittal has said in an interview to economic times published thursday mittal said prime minister narendra modis unequivocal message of his government not siding with any corporate during an inspiring meeting in \u003cTWO_THOUSAND\u003e marked a pivotal moment for bharti airtel helping it grow in midst of intense competition from new entrant reliance jio mittal said he met modi in september \u003cTWO_THOUSAND\u003e when the prime minister told him that his government will play by the book not side with anyone and will do what is good for the country and to my mind a lot of statements that this government is only favouring a few are all absolutely misplaced mittal said money is pouring into this country a lot of capital is coming in the stock market is rising these massive valuations are a function of a stable solid functional economy under a very solid leader he said mittals rival bilionaire mukesh ambanis jio disrupted the telecom market in \u003cTWO_THOUSAND\u003e with free voice and data services that helped it topple airtel to become the nations no 1 telecom firm reeling under the heat of market onslaught airtel at that time had felt that some decisions of the telecom regulator had adverse impact on the incumbent market leader in september \u003cTWO_THOUSAND\u003e he sought a meeting with the pm when mittal was still the chairman of gsma a lobby group representing the interests of mobile network operators and had just completed his chairmanship of the international chambers of commerce in that capacity too he used to brief modi occasionally on wto g20 and other issues so i took the liberty and took his permission to talk about the indian telecom industry i told him that things were going very badly and the situation was getting very alarming mittal said referring to the free voice and data services offered by jio and a slew of regulations that he felt favoured one side recalling his meeting with modi where both spoke in hindi mittal said he told the pm i will fight in the marketplace but i cant fight the government he pm told me that his government will not tilt towards either side whatever is good for the country will be done you fight in the marketplace i dont have a view on that but from the side of the government you can be assured that the government will not take sides he said recalling modis words and that he said was enough for him i got up and thanked him this was the turning point for airtel he said mittal said he derived an inexplicable energy and inspiration from the meeting sometimes you need inspiration i do that to my troops i needed that from someone there was a very strong special message from the pm fight in the market here was a man telling me who has himself fought against a lot of odds that you do your work and be very assured that this government is going to only do things that are good for the nation he said he started looking at the regulations that he believed were not good for airtel in a larger perspective maybe lower tariffs were better lower tariffs were better to democratise the data services you start to see things in a different context because you are reassured that there is no agenda here he said jios entry completely changed the scenario of internet in india as affordable data tariffs led to mass penetration of smartphones this helped accelerate adoption of things like digital payments","timestamp":"2024-05-30T13:33:00+05:30","market_timestamp":"2024-05-30T13:33:00+05:30","off_market_hours":false}