{"url":"https://www.moneycontrol.com/news/business/maruti-suzuki-to-invest-rs-450-crore-in-renewable-energy-initiative-12741632.html","title":"Maruti Suzuki to invest Rs 450 crore in renewable energy initiative","description":"The company will increase this investment around four-fold to Rs 450 crore spread over three years starting FY25, it said in a statement.Just as the company is bringing multiple technologies in products, it would also focus on multiple renewable energy sources to make the operations greener, Maruti Suzuki Managing Director \u0026 CEO Hisashi Takeuchi said.Related stories","content":"Maruti Suzuki India on Wednesday said it will invest Rs 450 crore over a span of three years towards commissioning renewable energy projects linked to solar power and biogas. In FY24, the company invested Rs 120.8 crore in the vertical. The company will increase this investment around four-fold to Rs 450 crore spread over three years starting FY25, it said in a statement. Just as the company is bringing multiple technologies in products, it would also focus on multiple renewable energy sources to make the operations greener, he added. The company said it has commenced a pilot biogas plant at its Manesar facility in FY25, harnessing the untapped potential of in-house food waste. The plant is designed to produce 0.2 tonne of biogas daily. The anticipated output is about 1 lakh standard cubic meters of biogas in FY25. It will offset around 190 tonne of CO2 per annum. The company also expanded its solar capacity to 43.2 MW in FY24. It is on track to add 15 MW solar capacity to its Manesar plant and 20 MW to the upcoming Kharkhoda plant over the next two years, it stated. This will boost the total solar capacity to 78.2 MW by FY26. ","cleaned_content":"maruti suzuki india on wednesday said it will invest rs \u003cFOUR_HUNDRED\u003e crore over a span of three years towards commissioning renewable energy projects linked to solar power and biogas in fy24 the company invested rs \u003cONE_HUNDRED\u003e crore in the vertical the company will increase this investment around four fold to rs \u003cFOUR_HUNDRED\u003e crore spread over three years starting fy25 it said in a statement just as the company is bringing multiple technologies in products it would also focus on multiple renewable energy sources to make the operations greener he added the company said it has commenced a pilot biogas plant at its manesar facility in fy25 harnessing the untapped potential of in house food waste the plant is designed to produce \u003cZERO_\u003e tonne of biogas daily the anticipated output is about \u003cONE_\u003e lakh standard cubic meters of biogas in fy25 it will offset around \u003cONE_HUNDRED\u003e tonne of co2 per annum the company also expanded its solar capacity to \u003cFOUR_TEN\u003e mw in fy24 it is on track to add \u003cONE_TEN\u003e mw solar capacity to its manesar plant and \u003cTWO_TEN\u003e mw to the upcoming kharkhoda plant over the next two years it stated this will boost the total solar capacity to \u003cSEVEN_TEN\u003e mw by fy26","timestamp":"2024-06-05T18:01:00+05:30","market_timestamp":"2024-06-06T09:15:00+05:30","off_market_hours":true}