{"url":"https://www.moneycontrol.com/news/business/kec-international-gets-new-orders-worth-over-rs-1000-crore-12741607.html","title":"KEC International gets new orders worth over Rs 1,000 crore","description":"The orders include residential projects in northern and southern India from renowned real estate developers. It also includes construction of official residences and associated facilities for defence officials, the company said.KEC International gets new orders worth over Rs 1,000 crore","content":"Infrastructure company KEC International on Wednesday said it has secured new orders worth over Rs 1,000 crore in the domestic market. The orders include residential projects in northern and southern India from renowned real estate developers. It also includes construction of official residences and associated facilities for defence officials, the company said. Its civil business has secured orders worth Rs 1,002 crore, it said. KEC International is a global infrastructure engineering, procurement and construction (EPC) company. It has a presence in the verticals of power transmission and distribution, railways, civil, and urban infrastructure, solar, oil \u0026 gas pipelines, and cables. ","cleaned_content":"infrastructure company kec international on wednesday said it has secured new orders worth over rs \u003cONE_THOUSAND\u003e crore in the domestic market the orders include residential projects in northern and southern india from renowned real estate developers it also includes construction of official residences and associated facilities for defence officials the company said its civil business has secured orders worth rs \u003cONE_THOUSAND\u003e crore it said kec international is a global infrastructure engineering procurement and construction epc company it has a presence in the verticals of power transmission and distribution railways civil and urban infrastructure solar oil gas pipelines and cables","timestamp":"2024-06-05T13:31:00+05:30","market_timestamp":"2024-06-05T13:31:00+05:30","off_market_hours":false}