{"url":"https://www.moneycontrol.com/news/business/adani-airports-holdings-pitches-for-open-source-passenger-processing-systems-at-airports-12743365.html","title":"Adani Airports Holdings pitches for open-source passenger processing systems at airports","description":"Adani Airport Holdings Ltd (AAHL) manages seven airports and is also developing the Navi Mumbai airport.Adani Airports Holdings pitches for open-source passenger processing systems at airportsRelated stories","content":"Adani Group's airport business chief Arun Bansal on Friday called for open source and interoperable passenger processing systems at airports, saying that at present, there is a monopoly of vendors offering the systems. Adani Airport Holdings Ltd (AAHL) manages seven airports and is also developing the Navi Mumbai airport. AAHL CEO Bansal said the passenger processing systems are not interoperable today. AAHL is also collaborating with Indian software companies to develop an indigenous software stack for passenger processing systems. When asked whether the group is planning to develop an open-source system, Bansal replied in the negative. \"We are not planning to develop. There are a lot of Indian software companies that are best in class. We are collaborating with them to develop an indigenous software stack,\" he said. Speaking on the sidelines of the CAPA India Aviation Summit 2024, Bansal also said there is no policy change required with respect to having an open-source system. \"There is no policy change required. The existing software players have made it a close loop where you can't mix and match whereas the whole world is going to the open source,\" he noted. Currently, AAHL manages seven airports at Mumbai, Ahmedabad, Lucknow, Mangaluru, Jaipur, Guwahati and Thiruvananthapuram. India is one of the world's fastest-growing civil aviation markets, and both domestic and international traffic are on the rise. India's domestic air traffic is expected to rise 6-8 per cent to 161 to 164 million in the current financial year, while international air traffic is projected to jump 9-11 per cent to 75 to 78 million in the current fiscal, aviation advisory firm CAPA India said on Wednesday. ","cleaned_content":"adani groups airport business chief arun bansal on friday called for open source and interoperable passenger processing systems at airports saying that at present there is a monopoly of vendors offering the systems adani airport holdings ltd aahl manages seven airports and is also developing the navi mumbai airport aahl ceo bansal said the passenger processing systems are not interoperable today aahl is also collaborating with indian software companies to develop an indigenous software stack for passenger processing systems when asked whether the group is planning to develop an open source system bansal replied in the negative we are not planning to develop there are a lot of indian software companies that are best in class we are collaborating with them to develop an indigenous software stack he said speaking on the sidelines of the capa india aviation summit \u003cTWO_THOUSAND\u003e bansal also said there is no policy change required with respect to having an open source system there is no policy change required the existing software players have made it a close loop where you cant mix and match whereas the whole world is going to the open source he noted currently aahl manages seven airports at mumbai ahmedabad lucknow mangaluru jaipur guwahati and thiruvananthapuram india is one of the worlds fastest growing civil aviation markets and both domestic and international traffic are on the rise indias domestic air traffic is expected to rise \u003cSIX_\u003e \u003cEIGHT_PERCENT\u003e to \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e million in the current financial year while international air traffic is projected to jump \u003cNINE_\u003e \u003cONE_TEN_PERCENT\u003e to \u003cSEVEN_TEN\u003e to \u003cSEVEN_TEN\u003e million in the current fiscal aviation advisory firm capa india said on wednesday","timestamp":"2024-06-07T13:34:00+05:30","market_timestamp":"2024-06-07T13:34:00+05:30","off_market_hours":false}