{"url":"https://www.moneycontrol.com/news/business/cholamandalam-investments-vellayan-subbiah-bullish-on-private-capex-cycle-bets-big-on-e-mobility-12742367.html","title":"Cholamandalam Investment's Vellayan Subbiah bullish on private capex cycle, bets big on e-mobility","description":"Speaking in an exclusive interview with CNBC-TV18, on Wednesday, June 5, Subbiah said, \"Very bullish about the private capex cycle.\"Cholamandalam Investment's Vellayan Subbiah bullish on private capex cycle, bets big on e-mobilityRelated stories","content":"Vellayan Subbiah, Chairman of Cholamandalam Investment, has expressed strong optimism about the private capital expenditure (capex) cycle while also highlighting the numerous opportunities available for deploying capital. Speaking in an exclusive interview with CNBC-TV18, on Wednesday, June 5, Subbiah said, \"Very bullish about the private capex cycle.\" He emphasised the positive outlook for various sectors and the potential for significant returns, given the right investments. \"We are betting big on e-Mobility,\" he stated, announcing a commitment of ₹3,000 crore towards this venture. The investment will be channeled into launching electric three-wheelers, electric trucks, and electric tractors. \"India is going to shift to electric at a higher pace,\" Subbiah predicted, reflecting his confidence in the fast-expanding sector and hoping the new government to stay supportive with policies to accelerate this transition. \"We believe we will get support from the government with new policies,\" he added. Subbiah also expressed optimism about India's semiconductor industry. The company, in a joint venture with Renesas and Stars Microelectronics, plans to invest ₹7,600 crore in an OSAT facility in Gujarat, operational by 2026. ","cleaned_content":"vellayan subbiah chairman of cholamandalam investment has expressed strong optimism about the private capital expenditure capex cycle while also highlighting the numerous opportunities available for deploying capital speaking in an exclusive interview with cnbc tv18 on wednesday june \u003cFIVE_\u003e subbiah said very bullish about the private capex cycle he emphasised the positive outlook for various sectors and the potential for significant returns given the right investments we are betting big on e mobility he stated announcing a commitment of \u003cTHREE_THOUSAND\u003e crore towards this venture the investment will be channeled into launching electric three wheelers electric trucks and electric tractors india is going to shift to electric at a higher pace subbiah predicted reflecting his confidence in the fast expanding sector and hoping the new government to stay supportive with policies to accelerate this transition we believe we will get support from the government with new policies he added subbiah also expressed optimism about indias semiconductor industry the company in a joint venture with renesas and stars microelectronics plans to invest \u003cSEVEN_THOUSAND\u003e crore in an osat facility in gujarat operational by \u003cTWO_THOUSAND\u003e","timestamp":"2024-06-06T12:14:00+05:30","market_timestamp":"2024-06-06T12:14:00+05:30","off_market_hours":false}