{"url":"https://www.moneycontrol.com/news/business/indigo-airline-evaluating-in-flight-safety-announcements-exploring-software-12737831.html","title":"IndiGo airline evaluating in-flight safety announcements, exploring software","description":"It did not say what aspect of safety or comfort the software would aid with.IndiGo airline evaluating in-flight safety announcements, exploring software","content":"Interglobe Aviation, which operates IndiGo airlines, has run trials on a new software related to passengers' safety and comfort, and is evaluating its in-flight safety announcements, the airline said on Friday. The airline is planning to launch another trial in the next two to three weeks for the safety and comfort-related software it tested, for its Airbus fleet, it added. A week back, an IndiGo flight headed to Jammu was forced to land in Amritsar -- roughly 210 kilometres away by road -- after turbulence and adverse weather conditions in Jammu. Internationally, flight crews have been urging passengers to have their seatbelts fastened at all times to protect themselves. IndiGo said it developed situational in-flight announcements for situations such as turbulence and inclement weather. \"These include mist in the cabin, prohibition of mobile-use during strong weather conditions, delay in take-off, interrupted service and operational diversions,\" the carrier said in a statement. It did not specify what aspect of safety or comfort the software would aid with. ","cleaned_content":"interglobe aviation which operates indigo airlines has run trials on a new software related to passengers safety and comfort and is evaluating its in flight safety announcements the airline said on friday the airline is planning to launch another trial in the next two to three weeks for the safety and comfort related software it tested for its airbus fleet it added a week back an indigo flight headed to jammu was forced to land in amritsar roughly \u003cTWO_HUNDRED\u003e kilometres away by road after turbulence and adverse weather conditions in jammu internationally flight crews have been urging passengers to have their seatbelts fastened at all times to protect themselves indigo said it developed situational in flight announcements for situations such as turbulence and inclement weather these include mist in the cabin prohibition of mobile use during strong weather conditions delay in take off interrupted service and operational diversions the carrier said in a statement it did not specify what aspect of safety or comfort the software would aid with","timestamp":"2024-05-31T15:11:00+05:30","market_timestamp":"2024-05-31T15:11:00+05:30","off_market_hours":false}