{"url":"https://www.moneycontrol.com/news/business/libas-looking-at-rs-1000-revenue-by-fy26-secures-rs-150-crore-funding-12736757.html","title":"Libas looking at Rs 1,000 crore revenue by FY26, secures Rs 150 crore funding","description":"Zivore Apparel, the company which owns the brand Libas, on Thursday, announced the closing of its first external funding round, with an investment of Rs 150 crore by IAF Series 5, a fund managed by ICICI Venture.In this massive equity fund flow, the 'predictable' portion is about half, wrote the analysts.Related stories","content":"Women clothing brand Libas, which on Thursday announced securing Rs 150 crore funding, aims to double its sales in the next two years to Rs 1,000 crore, said its Founder and CEO Siddhant Keshwani. Zivore Apparel, the company which owns the brand Libas, on Thursday, announced the closing of its first external funding round, with an investment of Rs 150 crore by IAF Series 5, a fund managed by ICICI Venture. Infusion of this fresh capital is expected to help build an omnichannel presence for Libas with strengthening of its current digital presence and accelerate offline expansion. The fast fashion ethnic wear brand, which started its journey as a D2C brand in 2014, has adopted an omnichannel strategy and is targeting to have a network of 150 physical stores in the next 3-5 years. Though Libas's immediate focus is on metros for expansion in the brick-mortar format, it recognizes the potential for growth in tier II and III cities and is leveraging data-driven insights to strategically target these areas in the future. The company is adopting the company-owned, company-operated (COCO) model for its stores, focusing initially on metro cities and select smaller towns with a strong online presence and customer base, he added. Besides the domestic market, Libas is also planning for the international market, targeting the Indian diaspora, especially in markets such as the UK, USA, UAE, and Australia, where it is serving through its online platform. When asked about the growth, Keshwani told PTI: \"We are targeting internally that we should close FY26 at about Rs 1,000 crore net revenue -- majorly being driven through our offline channels and, and of course online as well.\" The company has crossed a milestone of Rs 500 crore revenue in the financial year ended March 2024. Currently, online sales account for approximately 80-85 per cent of our business, with offline sales contributing around 10 to 15 per cent, he said. \"However, we aim to achieve a more balanced distribution, targeting 50-60 per cent online and 30-40 per cent offline sales in the next two to three years,\" Keshwani added. Currently, around 50 to 55 per cent of Libas business is contributed by the metro markets, and the rest comes from tier II, III and below towns. When asked about the current market condition and demand for apparel, which had faced a slowdown in demand as customers have put their discretionary spending on hold tightening their purses, Keshwani said there are \"signs of recovery\". \"Despite recent economic challenges, we are starting to see signs of recovery and an upward trend in consumer spending, particularly as we approach the festive season. We remain cautiously optimistic about the future growth prospects of the industry,\" he said. ","cleaned_content":"women clothing brand libas which on thursday announced securing rs \u003cONE_HUNDRED\u003e crore funding aims to double its sales in the next two years to rs \u003cONE_THOUSAND\u003e crore said its founder and ceo siddhant keshwani zivore apparel the company which owns the brand libas on thursday announced the closing of its first external funding round with an investment of rs \u003cONE_HUNDRED\u003e crore by iaf series \u003cFIVE_\u003e a fund managed by icici venture infusion of this fresh capital is expected to help build an omnichannel presence for libas with strengthening of its current digital presence and accelerate offline expansion the fast fashion ethnic wear brand which started its journey as a d2c brand in \u003cTWO_THOUSAND\u003e has adopted an omnichannel strategy and is targeting to have a network of \u003cONE_HUNDRED\u003e physical stores in the next \u003cTHREE_\u003e \u003cFIVE_\u003e years though libass immediate focus is on metros for expansion in the brick mortar format it recognizes the potential for growth in tier ii and iii cities and is leveraging data driven insights to strategically target these areas in the future the company is adopting the company owned company operated coco model for its stores focusing initially on metro cities and select smaller towns with a strong online presence and customer base he added besides the domestic market libas is also planning for the international market targeting the indian diaspora especially in markets such as the uk usa uae and australia where it is serving through its online platform when asked about the growth keshwani told pti we are targeting internally that we should close fy26 at about rs \u003cONE_THOUSAND\u003e crore net revenue majorly being driven through our offline channels and and of course online as well the company has crossed a milestone of rs \u003cFIVE_HUNDRED\u003e crore revenue in the financial year ended march \u003cTWO_THOUSAND\u003e currently online sales account for approximately \u003cEIGHT_TEN\u003e \u003cEIGHT_TEN_PERCENT\u003e of our business with offline sales contributing around \u003cONE_TEN\u003e to \u003cONE_TEN_PERCENT\u003e he said however we aim to achieve a more balanced distribution targeting \u003cFIVE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e online and \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e offline sales in the next two to three years keshwani added currently around \u003cFIVE_TEN\u003e to \u003cFIVE_TEN_PERCENT\u003e of libas business is contributed by the metro markets and the rest comes from tier ii iii and below towns when asked about the current market condition and demand for apparel which had faced a slowdown in demand as customers have put their discretionary spending on hold tightening their purses keshwani said there are signs of recovery despite recent economic challenges we are starting to see signs of recovery and an upward trend in consumer spending particularly as we approach the festive season we remain cautiously optimistic about the future growth prospects of the industry he said","timestamp":"2024-05-30T14:06:00+05:30","market_timestamp":"2024-05-30T14:06:00+05:30","off_market_hours":false}