{"url":"https://www.moneycontrol.com/news/business/shriram-finance-raises-468-million-multi-currency-social-loan-12739313.html","title":"Shriram Finance raises $468-million multi-currency social loan","description":"In line with its focus on increasing the accessibility of financial services to the unbanked and underbanked sectors, the funds raised through this social loan will be used to empower small entrepreneurs and vulnerable groups across India, it said.Shriram Finance raises $468-million multi-currency social loanRelated stories","content":"Shriram Finance Limited (SFL) on Monday said it has raised USD 468-million (about Rs 3.880 crore) in multi-currency to fund business growth. The three-year (External Commercial Borrowing) ECB facility was structured as a social loan anchored by BNP Paribas, DBS Bank, Hongkong \u0026 Shanghai Banking Corporation (HSBC) and Sumitomo Mitsui Banking Corporation, who were the joint mandated lead arrangers and book runners and social loan coordinators for this facility, SFL said in a statement. The fundraise comprises USD 425 million and EUR 40 million through a syndicated term loan transaction, it said. This marks the largest syndicated multi-currency transaction by a private sector Non-Banking Finance Company, said Umesh Revankar, executive vice chairman of Shriram Finance. \"This facility is labelled as a social loan, reflecting our commitment to social impact similar to our priority sector initiatives, with certain strict exclusions. The strong interest from the international investor community underscores the global confidence in our mission,\" he said. SFL has a wide range of offerings ranging from credit solutions for commercial vehicles, two-wheeler loans, car loans, home loans, gold loans, personal and small business loans. As one of the country's largest retail NBFCs, Shriram Finance has Assets under Management (AUM) of Rs 2,24,862 crore. ","cleaned_content":"shriram finance limited sfl on monday said it has raised usd \u003cFOUR_HUNDRED\u003e million about rs \u003cTHREE_\u003e crore in multi currency to fund business growth the three year external commercial borrowing ecb facility was structured as a social loan anchored by bnp paribas dbs bank hongkong shanghai banking corporation hsbc and sumitomo mitsui banking corporation who were the joint mandated lead arrangers and book runners and social loan coordinators for this facility sfl said in a statement the fundraise comprises usd \u003cFOUR_HUNDRED\u003e million and eur \u003cFOUR_TEN\u003e million through a syndicated term loan transaction it said this marks the largest syndicated multi currency transaction by a private sector non banking finance company said umesh revankar executive vice chairman of shriram finance this facility is labelled as a social loan reflecting our commitment to social impact similar to our priority sector initiatives with certain strict exclusions the strong interest from the international investor community underscores the global confidence in our mission he said sfl has a wide range of offerings ranging from credit solutions for commercial vehicles two wheeler loans car loans home loans gold loans personal and small business loans as one of the countrys largest retail nbfcs shriram finance has assets under management aum of rs \u003cTWO_HUNDRED_THOUSAND\u003e crore","timestamp":"2024-06-03T12:38:00+05:30","market_timestamp":"2024-06-03T12:38:00+05:30","off_market_hours":false}