{"url":"https://www.moneycontrol.com/news/business/renew-energy-global-plc-net-profit-jumps-seven-fold-to-7-million-in-march-quarter-12742409.html","title":"ReNew Energy Global Plc net profit jumps seven-fold to $7 million in March quarter","description":"The total revenue for the latest fourth quarter decreased by 4.4 per cent to USD 297 million, down from USD 311 million in the same period in the preceding fiscal, according to a company statement.ReNew Energy Global Plc net profit jumps seven-fold to $7 million in March quarterRelated stories","content":"ReNew Energy Global Plc on Thursday said its net profit jumped seven-fold to USD 7 million in the January-March quarter of FY24 due to higher income and reduced expenses. The total revenue for the latest fourth quarter decreased by 4.4 per cent to USD 297 million, down from USD 311 million in the same period in the preceding fiscal, according to a company statement. The company attributed the fall in revenue to lower earnings from its transmission projects. The clean energy major registered an 8.1 per cent jump in its total revenue to USD 1,158 million in FY24 from USD 1,072 million in FY23. The company said that the record profits were registered despite a marginal fall in the weighted average Plant Load Factor (PLF) for the reporting quarter as well as the financial year due to lower radiation and wind speeds. While the PLF for FY24 was 26.4 per cent for wind assets, compared to 25.5 per cent for FY23, the PLF for solar assets for FY24 was 24.6 per cent compared to 24.8 per cent for FY23. With a committed portfolio of 21 GW, the company said it expects to add a capacity of 1,900-2,400 MWs by the end of FY25 and around 16 GW by the end of FY27 after capital recycling. \"These positive earnings will further fuel our ambitious growth plans of doubling our capacity to over 20 GW in the next five years with a continued focus on execution, and will allow us to lead the trebling of India's renewable energy capacity,\" ReNew's Chairman and CEO Sumant Sinha said. ","cleaned_content":"renew energy global plc on thursday said its net profit jumped seven fold to usd \u003cSEVEN_\u003e million in the january march quarter of fy24 due to higher income and reduced expenses the total revenue for the latest fourth quarter decreased by \u003cFOUR_PERCENT\u003e to usd \u003cTWO_HUNDRED\u003e million down from usd \u003cTHREE_HUNDRED\u003e million in the same period in the preceding fiscal according to a company statement the company attributed the fall in revenue to lower earnings from its transmission projects the clean energy major registered an \u003cEIGHT_PERCENT\u003e jump in its total revenue to usd \u003cONE_THOUSAND\u003e million in fy24 from usd \u003cONE_THOUSAND\u003e million in fy23 the company said that the record profits were registered despite a marginal fall in the weighted average plant load factor plf for the reporting quarter as well as the financial year due to lower radiation and wind speeds while the plf for fy24 was \u003cTWO_TEN_PERCENT\u003e for wind assets compared to \u003cTWO_TEN_PERCENT\u003e for fy23 the plf for solar assets for fy24 was \u003cTWO_TEN_PERCENT\u003e compared to \u003cTWO_TEN_PERCENT\u003e for fy23 with a committed portfolio of \u003cTWO_TEN\u003e gw the company said it expects to add a capacity of \u003cONE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e mws by the end of fy25 and around \u003cONE_TEN\u003e gw by the end of fy27 after capital recycling these positive earnings will further fuel our ambitious growth plans of doubling our capacity to over \u003cTWO_TEN\u003e gw in the next five years with a continued focus on execution and will allow us to lead the trebling of indias renewable energy capacity renews chairman and ceo sumant sinha said","timestamp":"2024-06-06T13:07:00+05:30","market_timestamp":"2024-06-06T13:07:00+05:30","off_market_hours":false}