{"url":"https://www.moneycontrol.com/news/business/funding-in-proptech-firms-down-4-in-fy24-to-657-million-housing-com-12742434.html","title":"Funding in proptech firms down 4% in FY24 to $657 million: Housing.com","description":"In its report, Housing.com, one of the leading real estate listing platforms, highlighted that proptech firms have garnered a total of USD 4.6 billion between 2010-11 and 2023-24 financial years, growing at a Compound Annual Growth Rate (CAGR) of 40 per cent.Funding in proptech firms down 4% in FY24 to $657 million: Housing.comRelated stories","content":"Funding in proptech firms declined marginally 4 per cent last fiscal to USD 657 million, reflecting resilience despite global economic uncertainties, according to Housing.com. In its report, Housing.com, one of the leading real estate listing platforms, highlighted that proptech firms have garnered a total of USD 4.6 billion between 2010-11 and 2023-24 financial years, growing at a Compound Annual Growth Rate (CAGR) of 40 per cent. Dhruv Agarwala, Group CEO of Housing.com and PropTiger.com, said, \"In the face of global uncertainties and a general downturn in fundraising across sectors during the last couple of years, the Proptech sector has shown remarkable resilience.\" Since 2010-11, he noted that the investment in proptech firms has sustained an impressive CAGR of 40 per cent. Despite global economic uncertainties, Housing.com said that funding in Proptech firms experienced only a slight dip in 2023-24 with investments totalling USD 657 million, down from USD 683 million in 2022-23. This figure represents 90 per cent of the record high of USD 730 million investment received by the proptech sector in 2021-22. The shared economy (coworking and and coliving segments), construction technology segments have emerged as leaders in the proptech space, capturing 55 per cent and 23 per cent of the overall private investments in 2023-24, respectively. These segments continue to attract substantial interest and investment, reflecting their pivotal role in shaping the future of real estate, Housing.com said. HDFC Capital-backed proptech firm Reloy founder and CEO Akhil Saraf said the use of technologies has increased significantly over the past few years, generating investors' interest in putting money in real estate startups. Abhishek Tripathi, Co-founder of coliving firm Settl, said, \"The real estate sector in India is experiencing a remarkable phase, with demand for quality living spaces increasing significantly. This surge is expected to continue, fueled by technological disruptions and digital transformations.\" Proptech startups make up for less than 5 per cent of the total recognised startups in the country while the real estate sector contributes approximately 7-8 per cent to the country's GDP, he said. \"We believe the sector will attract substantial investment, including in the startup segment,\" Tripathi said. Housing.com data includes investments including private equity, venture capital, debt, PIPE (Private Investment in Public Entity), private equity investments in Special Purpose Vehicle (SPV), project-level investments, and buyouts. ","cleaned_content":"funding in proptech firms declined marginally \u003cFOUR_PERCENT\u003e last fiscal to usd \u003cSIX_HUNDRED\u003e million reflecting resilience despite global economic uncertainties according to housing com in its report housing com one of the leading real estate listing platforms highlighted that proptech firms have garnered a total of usd \u003cFOUR_\u003e billion between \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e and \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial years growing at a compound annual growth rate cagr of \u003cFOUR_TEN_PERCENT\u003e dhruv agarwala group ceo of housing com and proptiger com said in the face of global uncertainties and a general downturn in fundraising across sectors during the last couple of years the proptech sector has shown remarkable resilience since \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e he noted that the investment in proptech firms has sustained an impressive cagr of \u003cFOUR_TEN_PERCENT\u003e despite global economic uncertainties housing com said that funding in proptech firms experienced only a slight dip in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with investments totalling usd \u003cSIX_HUNDRED\u003e million down from usd \u003cSIX_HUNDRED\u003e million in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e this figure represents \u003cNINE_TEN_PERCENT\u003e of the record high of usd \u003cSEVEN_HUNDRED\u003e million investment received by the proptech sector in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the shared economy coworking and and coliving segments construction technology segments have emerged as leaders in the proptech space capturing \u003cFIVE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e of the overall private investments in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e respectively these segments continue to attract substantial interest and investment reflecting their pivotal role in shaping the future of real estate housing com said hdfc capital backed proptech firm reloy founder and ceo akhil saraf said the use of technologies has increased significantly over the past few years generating investors interest in putting money in real estate startups abhishek tripathi co founder of coliving firm settl said the real estate sector in india is experiencing a remarkable phase with demand for quality living spaces increasing significantly this surge is expected to continue fueled by technological disruptions and digital transformations proptech startups make up for less than \u003cFIVE_PERCENT\u003e of the total recognised startups in the country while the real estate sector contributes approximately \u003cSEVEN_\u003e \u003cEIGHT_PERCENT\u003e to the countrys gdp he said we believe the sector will attract substantial investment including in the startup segment tripathi said housing com data includes investments including private equity venture capital debt pipe private investment in public entity private equity investments in special purpose vehicle spv project level investments and buyouts","timestamp":"2024-06-06T13:36:00+05:30","market_timestamp":"2024-06-06T13:36:00+05:30","off_market_hours":false}