{"url":"https://www.moneycontrol.com/news/business/sterlite-power-secures-rs-1373-crore-funding-for-neemrana-ii-kotputli-transmission-project-12736756.html","title":"Sterlite Power secures Rs 1,373 crore funding for Neemrana II Kotputli transmission project","description":"Sterlite Power acquired the Neemrana II Kotputli Transmission Limited SPV in November 2023 to execute the green energy corridor on a Build, Own, Operate, and Transfer (BOOT) basis for a period of 35 years.Sterlite Power secures Rs 1,373 crore funding for Neemrana II Kotputli transmission project","content":"Sterlite Power on Thursday said it has secured Rs 1,373 crore funding for its Neemrana II Kotputli Transmission Limited (NKTL) project from the state-owned Power Finance Corporation. Sterlite Power acquired the Neemrana II Kotputli Transmission Limited SPV in November 2023 to execute the green energy corridor on a Build, Own, Operate, and Transfer (BOOT) basis for a period of 35 years. In a statement, the company said it \"has achieved financial closure for its Neemrana II Kotputli Transmission Limited (NKTL) project. The project has secured funds totalling Rs 1,373 crore from Power Finance Corporation (PFC).\" Sterlite Power is a leading private sector power transmission infrastructure developer and Global Products and Services (GPS) provider. ","cleaned_content":"sterlite power on thursday said it has secured rs \u003cONE_THOUSAND\u003e crore funding for its neemrana ii kotputli transmission limited nktl project from the state owned power finance corporation sterlite power acquired the neemrana ii kotputli transmission limited spv in november \u003cTWO_THOUSAND\u003e to execute the green energy corridor on a build own operate and transfer boot basis for a period of \u003cTHREE_TEN\u003e years in a statement the company said it has achieved financial closure for its neemrana ii kotputli transmission limited nktl project the project has secured funds totalling rs \u003cONE_THOUSAND\u003e crore from power finance corporation pfc sterlite power is a leading private sector power transmission infrastructure developer and global products and services gps provider","timestamp":"2024-05-30T13:56:00+05:30","market_timestamp":"2024-05-30T13:56:00+05:30","off_market_hours":false}