{"url":"https://www.moneycontrol.com/news/business/lupin-arm-completes-acquisition-of-two-brands-from-sanofi-12741545.html","title":"Lupin arm completes acquisition of two brands from Sanofi","description":"Lupin Atlantis Holdings SA has completed the acquisition of Aarane in Germany and Nalcrom in Canada and the Netherlands, along with the associated trademark rights, from Sanofi, the Mumbai-based drug maker said in a statement.Lupin arm completes acquisition of two brands from Sanofi","content":"Drug maker Lupin on Wednesday said its European arm has completed the acquisition of two brands from Sanofi. Lupin Atlantis Holdings SA has completed the acquisition of Aarane in Germany and Nalcrom in Canada and the Netherlands, along with the associated trademark rights, from Sanofi, the Mumbai-based drug maker said in a statement. The transaction aligns with the company's strategy to grow its global presence in speciality areas, it added. \"This acquisition will strengthen our global position in treating patients suffering from diverse respiratory diseases and conditions, and it adds accretive assets in gastro-intestinal care that broaden our portfolio of branded products,\" Lupin President Corporate Development Fabrice Egros said. Aarane (sodium cromoglicate/reproterol hydrochloride pressurised inhalation) is a chromone complex indicated in the symptomatic acute treatment of sudden asthma attacks. Nalcrom (sodium cromoglicate oral) is used to treat food allergies after adequate testing for sensitivity to specific allergens in conjunction with restricting the main allergens. Shares of Lupin were trading 3.21 per cent higher at Rs 1,613.45 apiece on the BSE. ","cleaned_content":"drug maker lupin on wednesday said its european arm has completed the acquisition of two brands from sanofi lupin atlantis holdings sa has completed the acquisition of aarane in germany and nalcrom in canada and the netherlands along with the associated trademark rights from sanofi the mumbai based drug maker said in a statement the transaction aligns with the companys strategy to grow its global presence in speciality areas it added this acquisition will strengthen our global position in treating patients suffering from diverse respiratory diseases and conditions and it adds accretive assets in gastro intestinal care that broaden our portfolio of branded products lupin president corporate development fabrice egros said aarane sodium cromoglicate reproterol hydrochloride pressurised inhalation is a chromone complex indicated in the symptomatic acute treatment of sudden asthma attacks nalcrom sodium cromoglicate oral is used to treat food allergies after adequate testing for sensitivity to specific allergens in conjunction with restricting the main allergens shares of lupin were trading \u003cTHREE_PERCENT\u003e higher at rs \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-06-05T13:13:00+05:30","market_timestamp":"2024-06-05T13:13:00+05:30","off_market_hours":false}