{"url":"https://www.moneycontrol.com/news/business/india-airline-industry-to-report-wider-loss-in-fy25-consultancy-says-12741381.html","title":"India airline industry to report wider loss in FY25, consultancy says","description":"CAPA India estimated losses for fiscal 2024 at $300 million to $400 million and said it sees yields - the average amount paid by a passenger to fly one for kilometre for the current year rising around 1%.India airline industry to report wider loss in FY25, consultancy says","content":"Losses for India's airline industry are expected to widen to $400 million to $600 million in fiscal 2025 as higher costs outweigh a rise in passenger demand, a top aviation consultancy said on Wednesday. CAPA India estimated losses for fiscal 2024 at $300 million to $400 million and said it sees yields - the average amount paid by a passenger to fly one for kilometre for the current year rising around 1%. Overall airline costs are expected to rise 3.8% in the fiscal year 2025, the consultancy added. India's skies are dominated by low-cost carrier IndiGo, which holds a 60% market share. The Air India group, which houses two budget carriers and two full-service carriers in Air India and Vistara, have a roughly 30% share. Newer low-cost carrier Akasa Air, and SpiceJet are the other major airlines. CAPA India estimated domestic passenger traffic to grow to 161 million to 164 million from about 154 million. The consultancy sees international traffic growing to 75 million to 78 million. ","cleaned_content":"losses for indias airline industry are expected to widen to \u003cFOUR_HUNDRED\u003e million to \u003cSIX_HUNDRED\u003e million in fiscal \u003cTWO_THOUSAND\u003e as higher costs outweigh a rise in passenger demand a top aviation consultancy said on wednesday capa india estimated losses for fiscal \u003cTWO_THOUSAND\u003e at \u003cTHREE_HUNDRED\u003e million to \u003cFOUR_HUNDRED\u003e million and said it sees yields the average amount paid by a passenger to fly one for kilometre for the current year rising around \u003cONE_PERCENT\u003e overall airline costs are expected to rise \u003cTHREE_PERCENT\u003e in the fiscal year \u003cTWO_THOUSAND\u003e the consultancy added indias skies are dominated by low cost carrier indigo which holds a \u003cSIX_TEN_PERCENT\u003e market share the air india group which houses two budget carriers and two full service carriers in air india and vistara have a roughly \u003cTHREE_TEN_PERCENT\u003e share newer low cost carrier akasa air and spicejet are the other major airlines capa india estimated domestic passenger traffic to grow to \u003cONE_HUNDRED\u003e million to \u003cONE_HUNDRED\u003e million from about \u003cONE_HUNDRED\u003e million the consultancy sees international traffic growing to \u003cSEVEN_TEN\u003e million to \u003cSEVEN_TEN\u003e million","timestamp":"2024-06-05T11:58:00+05:30","market_timestamp":"2024-06-05T11:58:00+05:30","off_market_hours":false}