{"url":"https://www.moneycontrol.com/news/business/airport-industry-to-see-profit-before-tax-of-1-3-billion-this-fiscal-12743169.html","title":"Airport industry to see profit before tax of $1.3 billion this fiscal","description":"The profit is anticipated to be Rs 256.1 (USD 3.1) per passenger in the fiscal ending March 2025, aviation advisory firm CAPA India said while giving projections at its aviation summit in the national capital on Friday.Airport industry to see profit before tax of $1.3 billion this fiscal","content":"The country's airport industry is projected to report a profit before tax of USD 1.3 billion in the current financial year. The profit is anticipated to be Rs 256.1 (USD 3.1) per passenger in the fiscal ending March 2025, aviation advisory firm CAPA India said while giving projections at its aviation summit in the national capital on Friday. In the current fiscal, passenger throughput at Indian airports is estimated to rise to 404.9 million. Out of the total, 81.1 per cent will be domestic and 18.9 per cent will be international traffic, it said. The industry's profit before tax is expected to be USD 1.3 billion in this fiscal. \"India's airport operators are forecast to register Rs 359.8 billion (USD 4.3 billion) in revenue for FY2025, representing a growth of 14.8 per cent y-o-y from FY2024,\" CAPA India said. Noting that airport infrastructure at metros and non-metros is ahead of demand, it said there is an ongoing USD 11 billion pipeline of investment, including in Tier 2 and Tier 3 airports. ","cleaned_content":"the countrys airport industry is projected to report a profit before tax of usd \u003cONE_\u003e billion in the current financial year the profit is anticipated to be rs \u003cTWO_HUNDRED\u003e usd \u003cTHREE_\u003e per passenger in the fiscal ending march \u003cTWO_THOUSAND\u003e aviation advisory firm capa india said while giving projections at its aviation summit in the national capital on friday in the current fiscal passenger throughput at indian airports is estimated to rise to \u003cFOUR_HUNDRED\u003e million out of the total \u003cEIGHT_TEN_PERCENT\u003e will be domestic and \u003cONE_TEN_PERCENT\u003e will be international traffic it said the industrys profit before tax is expected to be usd \u003cONE_\u003e billion in this fiscal indias airport operators are forecast to register rs \u003cTHREE_HUNDRED\u003e billion usd \u003cFOUR_\u003e billion in revenue for fy2025 representing a growth of \u003cONE_TEN_PERCENT\u003e y o y from fy2024 capa india said noting that airport infrastructure at metros and non metros is ahead of demand it said there is an ongoing usd \u003cONE_TEN\u003e billion pipeline of investment including in tier \u003cTWO_\u003e and tier \u003cTHREE_\u003e airports","timestamp":"2024-06-07T11:33:00+05:30","market_timestamp":"2024-06-07T11:33:00+05:30","off_market_hours":false}