{"url":"https://www.moneycontrol.com/news/business/jsw-mg-motor-india-partners-with-ecofy-for-ev-financing-12752732.html","title":"JSW MG Motor India partners with Ecofy for EV financing","description":"The two companies have signed a Memorandum of Understanding (MoU) under which Ecofy will provide financing and leasing solutions for up to 10,000 JSW MG EVs over the next three years, it said in a statement.JSW MG Motor India partners with Ecofy for EV financing","content":"JSW MG Motor India on Thursday said it has partnered with Eversource Capital-backed NBFC Ecofy to provide financing and leasing solutions for its electric vehicles. The two companies have signed a Memorandum of Understanding (MoU) under which Ecofy will provide financing and leasing solutions for up to 10,000 JSW MG EVs over the next three years, it said in a statement. This will include loan options and leasing arrangements across retail customers and B2B operators for the existing and forthcoming electric vehicles of JSW MG Motor India, the company added. By offering innovative financing solutions in collaboration with industry specialists, the company is making EV ownership more accessible and affordable to a broader audience, he added. \"By combining our expertise in finance and JSW MG's cutting-edge electric vehicle technology, we aim to make EVs accessible to a wider audience, empowering individuals and businesses to embrace a greener future without compromising on convenience or affordability,\" Ecofy Co-founder, MD \u0026 CEO Rajashree Nambiar said. ","cleaned_content":"jsw mg motor india on thursday said it has partnered with eversource capital backed nbfc ecofy to provide financing and leasing solutions for its electric vehicles the two companies have signed a memorandum of understanding mou under which ecofy will provide financing and leasing solutions for up to \u003cONE_TEN_THOUSAND\u003e jsw mg evs over the next three years it said in a statement this will include loan options and leasing arrangements across retail customers and b2b operators for the existing and forthcoming electric vehicles of jsw mg motor india the company added by offering innovative financing solutions in collaboration with industry specialists the company is making ev ownership more accessible and affordable to a broader audience he added by combining our expertise in finance and jsw mgs cutting edge electric vehicle technology we aim to make evs accessible to a wider audience empowering individuals and businesses to embrace a greener future without compromising on convenience or affordability ecofy co founder md ceo rajashree nambiar said","timestamp":"2024-06-20T12:57:00+05:30","market_timestamp":"2024-06-20T12:57:00+05:30","off_market_hours":false}