{"url":"https://www.moneycontrol.com/news/business/julius-baer-targets-rich-indians-in-dubai-with-ubs-jpmorgan-hires-12744948.html","title":"Julius Baer targets rich Indians in Dubai with UBS, JPMorgan hires","description":"Sanjay Advani has joined from UBS as a managing director and team head of Julius Baer’s global non-resident Indians business in the emirate, according to a statement. Nisar Sindhi, previously at JPMorgan, has been named managing director and senior adviser. Julius Baer targets rich Indians in Dubai with UBS, JPMorgan hiresRelated stories","content":"Swiss wealth manager Julius Baer Group Ltd. hired senior bankers from UBS Group AG and JPMorgan Chase \u0026 Co. to beef up its business catering to rich Indians in Dubai. Sanjay Advani has joined from UBS as a managing director and team head of Julius Baer’s global non-resident Indians business in the emirate, according to a statement. Nisar Sindhi, previously at JPMorgan, has been named managing director and senior adviser. Both will report to Tarun Jalali, who heads the unit in Dubai. In addition, two relationship managers will make the move to Julius Baer from UBS. The new Julius Baer recruits will focus on non-resident Indians, a lucrative segment of the bank’s wealth management offering that’s been bolstered by the growing number of wealthy Indians living overseas. “These strategic hires signal our growth ambitions for the Global NRI Business as we set to expand our positioning in this fast-paced market environment,” said Kunal Sumaya, Head of Global NRI at Julius Baer. “The UAE as a location is of great importance to us.” Advani previously worked at Credit Suisse, Societe Generale SA and Citigroup Inc. Sindhi spent 13 years at JPMorgan’s private bank in Dubai — where he covered ultra-high net worth individuals in the UAE, Bahrain and Oman — and previously worked at Citi and ABN Amro. ","cleaned_content":"swiss wealth manager julius baer group ltd hired senior bankers from ubs group ag and jpmorgan chase co to beef up its business catering to rich indians in dubai sanjay advani has joined from ubs as a managing director and team head of julius baer s global non resident indians business in the emirate according to a statement nisar sindhi previously at jpmorgan has been named managing director and senior adviser both will report to tarun jalali who heads the unit in dubai in addition two relationship managers will make the move to julius baer from ubs the new julius baer recruits will focus on non resident indians a lucrative segment of the bank s wealth management offering that s been bolstered by the growing number of wealthy indians living overseas these strategic hires signal our growth ambitions for the global nri business as we set to expand our positioning in this fast paced market environment said kunal sumaya head of global nri at julius baer the uae as a location is of great importance to us advani previously worked at credit suisse societe generale sa and citigroup inc sindhi spent \u003cONE_TEN\u003e years at jpmorgan s private bank in dubai where he covered ultra high net worth individuals in the uae bahrain and oman and previously worked at citi and abn amro","timestamp":"2024-06-10T14:00:00+05:30","market_timestamp":"2024-06-10T14:00:00+05:30","off_market_hours":false}