{"url":"https://www.moneycontrol.com/news/business/fitch-raises-indias-growth-estimates-for-fy25-to-7-2-12750637.html","title":"Fitch raises India's growth estimates for FY25 to 7.2%","description":"For the fiscal years 2025-26 and 2026-27, Fitch projected growth rates of 6.5 per cent and 6.2 per cent, respectively.Fitch raises India's growth estimates for FY25 to 7.2%Related stories","content":"Fitch Ratings on Tuesday raised India's growth forecast for current fiscal to 7.2 per cent, from 7 per cent projected in March, citing a recovery in consumer spending and increased investment. For the fiscal years 2025-26 and 2026-27, Fitch projected growth rates of 6.5 per cent and 6.2 per cent, respectively. \"We expect the Indian economy to expand by a strong 7.2 per cent in FY24/25 (an upward revision of 0.2 pp from the March GEO),\" Fitch said in its global economic outlook report. Investment will continue to rise but more slowly than in recent quarters, while consumer spending will recover with elevated consumer confidence, it said. Fitch said purchasing managers survey data point to continued growth at the start of the current financial year. It said signs of the coming monsoon season being more normal should support growth and make inflation less volatile, though a recent heatwave poses a risk. \"We expect growth in later years to slow and approach our medium-term trend estimate,\" it said, adding growth will be driven by consumer spending and investment. The Indian economy grew 8.2 per cent in the last fiscal (2023-24), with a 7.8 per cent expansion in March quarter. Inflation, Fitch expects, will decline to 4.5 per cent by end 2024 and average 4.3 per cent in 2025 and 2026. Fitch said it expects the RBI to cut policy interest rates by 25 basis points this year to 6.25 per cent. ","cleaned_content":"fitch ratings on tuesday raised indias growth forecast for current fiscal to \u003cSEVEN_PERCENT\u003e from \u003cSEVEN_PERCENT\u003e projected in march citing a recovery in consumer spending and increased investment for the fiscal years \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e and \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fitch projected growth rates of \u003cSIX_PERCENT\u003e and \u003cSIX_PERCENT\u003e respectively we expect the indian economy to expand by a strong \u003cSEVEN_PERCENT\u003e in fy24 \u003cTWO_TEN\u003e an upward revision of \u003cZERO_\u003e pp from the march geo fitch said in its global economic outlook report investment will continue to rise but more slowly than in recent quarters while consumer spending will recover with elevated consumer confidence it said fitch said purchasing managers survey data point to continued growth at the start of the current financial year it said signs of the coming monsoon season being more normal should support growth and make inflation less volatile though a recent heatwave poses a risk we expect growth in later years to slow and approach our medium term trend estimate it said adding growth will be driven by consumer spending and investment the indian economy grew \u003cEIGHT_PERCENT\u003e in the last fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with a \u003cSEVEN_PERCENT\u003e expansion in march quarter inflation fitch expects will decline to \u003cFOUR_PERCENT\u003e by end \u003cTWO_THOUSAND\u003e and average \u003cFOUR_PERCENT\u003e in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e fitch said it expects the rbi to cut policy interest rates by \u003cTWO_TEN\u003e basis points this year to \u003cSIX_PERCENT\u003e","timestamp":"2024-06-18T09:47:00+05:30","market_timestamp":"2024-06-18T09:47:00+05:30","off_market_hours":false}