{"url":"https://www.moneycontrol.com/news/business/jaypee-infratech-appoints-devang-pravin-patel-as-cfo-to-delist-company-shares-from-bourses-12747573.html","title":"Jaypee Infratech appoints Devang Pravin Patel as CFO; to delist company shares from bourses","description":"The appointment has been made with effect from June 8, 2024, according to a recent regulatory filing.Jaypee Infratech appoints Devang Pravin Patel as CFO; to delist company shares from boursesRelated stories","content":"Jaypee Infratech Ltd, which is now being controlled by Mumbai-based Suraksha Group, has appointed Devang Pravin Patel as its Chief Financial Officer (CFO) and will also delist its shares from stock exchanges. The appointment has been made with effect from June 8, 2024, according to a recent regulatory filing. Suraksha Group, which has taken control of Jaypee Infratech ltd (JIL) after approval from the appellate tribunal NCLAT last month, will delist JIL from stock exchanges. However, the shares issued to Suraksha Group (Successful Resolution Applicant) in terms of the approved resolution plan will not be extinguished. Suraksha Group has infused Rs 125 crore equity fund in JIL, as part of its resolution plan to settle banks' dues and complete 20,000 unfinished flats across various projects in Delhi-NCR. Earlier this month, Mumbai-based Suraksha Group took control of JIL by constituting a three-member board. The takeover followed the National Company Law Appellate Tribunal (NCLAT) decision on May 24, upholding Suraksha Group's bid to acquire JIL. The NCLAT had directed Suraksha Group to pay an additional Rs 1,334 crore to Yamuna Expressway Industrial Development Authority (YEIDA) as farmers' compensation. Sudhir V Valia, promoter of Suraksha Group, has been appointed as a Non Executive Director on the JIL board. Aalok Champak Dave has been appointed as Executive Director and Usha Anil Kadam as independent director. Upholding the National Company Law Tribunal's (NCLT) decision of March 2023, the NCLAT on May 24 had said the decision was made to avoid any further delay in the implementation of the resolution plan and also to take care of the interests of all stakeholders, including home buyers and claim of YEIDA for additional compensation of the farmers. The corporate Insolvency Resolution Process (CIRP) against JIL was started in August 2017, over an application by the IDBI Bank-led consortium. On March 7 last year, the NCLT approved the bid of the Suraksha groupto buy JIL. However, many parties, including YEIDA, filed petitions in the NCLAT to challenge the NCLT order. In its final resolution plan, the Suraksha group offered to bankers more than 2,500 acres of land and nearly Rs 1,300 crore by way of issuing non-convertible debentures. It also proposed to complete all stalled projects over the next four years. Lenders of Jaypee Infratech had submitted a claim of Rs 9,783 crore. In the fourth round of the bidding process to find a buyer for the JIL in 2021, the Suraksha group won the bid with 98.66 per cent votes. As many as 12 banks and more than 20,000 homebuyers had voting rights in the Committee of Creditors (CoC). The company had got 0.12 per cent more votes than state-owned NBCC, which was also in the fray. In the first round of insolvency proceedings in 2018, the Rs 7,350 crore bid of Lakshadweep, part of the Suraksha group, was rejected by the lenders. The CoC had rejected the bids of Suraksha and NBCC in the second round held in May-June 2019. In November 2019, the Supreme Court directed that the revised bids be invited only from NBCC and Suraksha. Then, in December 2019, the CoC approved the resolution plan of NBCC during the third round of the bidding process. In March 2020, NBCC got approval from the NCLT to acquire JIL. However, the order was challenged before the NCLAT and later in the Supreme Court. On March 21, 2021, the apex court ordered a fresh round of bidding between NBCC and Suraksha Group only. In this fourth round, Suraksha Group won the bid. ","cleaned_content":"jaypee infratech ltd which is now being controlled by mumbai based suraksha group has appointed devang pravin patel as its chief financial officer cfo and will also delist its shares from stock exchanges the appointment has been made with effect from june \u003cEIGHT_\u003e \u003cTWO_THOUSAND\u003e according to a recent regulatory filing suraksha group which has taken control of jaypee infratech ltd jil after approval from the appellate tribunal nclat last month will delist jil from stock exchanges however the shares issued to suraksha group successful resolution applicant in terms of the approved resolution plan will not be extinguished suraksha group has infused rs \u003cONE_HUNDRED\u003e crore equity fund in jil as part of its resolution plan to settle banks dues and complete \u003cTWO_TEN_THOUSAND\u003e unfinished flats across various projects in delhi ncr earlier this month mumbai based suraksha group took control of jil by constituting a three member board the takeover followed the national company law appellate tribunal nclat decision on may \u003cTWO_TEN\u003e upholding suraksha groups bid to acquire jil the nclat had directed suraksha group to pay an additional rs \u003cONE_THOUSAND\u003e crore to yamuna expressway industrial development authority yeida as farmers compensation sudhir v valia promoter of suraksha group has been appointed as a non executive director on the jil board aalok champak dave has been appointed as executive director and usha anil kadam as independent director upholding the national company law tribunals nclt decision of march \u003cTWO_THOUSAND\u003e the nclat on may \u003cTWO_TEN\u003e had said the decision was made to avoid any further delay in the implementation of the resolution plan and also to take care of the interests of all stakeholders including home buyers and claim of yeida for additional compensation of the farmers the corporate insolvency resolution process cirp against jil was started in august \u003cTWO_THOUSAND\u003e over an application by the idbi bank led consortium on march \u003cSEVEN_\u003e last year the nclt approved the bid of the suraksha groupto buy jil however many parties including yeida filed petitions in the nclat to challenge the nclt order in its final resolution plan the suraksha group offered to bankers more than \u003cTWO_THOUSAND\u003e acres of land and nearly rs \u003cONE_THOUSAND\u003e crore by way of issuing non convertible debentures it also proposed to complete all stalled projects over the next four years lenders of jaypee infratech had submitted a claim of rs \u003cNINE_THOUSAND\u003e crore in the fourth round of the bidding process to find a buyer for the jil in \u003cTWO_THOUSAND\u003e the suraksha group won the bid with \u003cNINE_TEN_PERCENT\u003e votes as many as \u003cONE_TEN\u003e banks and more than \u003cTWO_TEN_THOUSAND\u003e homebuyers had voting rights in the committee of creditors coc the company had got \u003cZERO_PERCENT\u003e more votes than state owned nbcc which was also in the fray in the first round of insolvency proceedings in \u003cTWO_THOUSAND\u003e the rs \u003cSEVEN_THOUSAND\u003e crore bid of lakshadweep part of the suraksha group was rejected by the lenders the coc had rejected the bids of suraksha and nbcc in the second round held in may june \u003cTWO_THOUSAND\u003e in november \u003cTWO_THOUSAND\u003e the supreme court directed that the revised bids be invited only from nbcc and suraksha then in december \u003cTWO_THOUSAND\u003e the coc approved the resolution plan of nbcc during the third round of the bidding process in march \u003cTWO_THOUSAND\u003e nbcc got approval from the nclt to acquire jil however the order was challenged before the nclat and later in the supreme court on march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the apex court ordered a fresh round of bidding between nbcc and suraksha group only in this fourth round suraksha group won the bid","timestamp":"2024-06-13T10:55:00+05:30","market_timestamp":"2024-06-13T10:55:00+05:30","off_market_hours":false}