{"url":"https://www.moneycontrol.com/news/business/embraer-sees-india-saudi-arabia-eu-us-as-strategic-defense-markets-12751513.html","title":"Embraer sees India, Saudi Arabia, EU, US as strategic defense markets","description":"India has an open tender to buy military planes while Saudi Arabia, looking to replace an aging fleet of Lockheed Martin's C-130 Hercules, is currently in \"early engagement\" with Embraer, Bosco da Costa Junior told reporters at an event.Embraer sees India, Saudi Arabia, EU, US as strategic defense marketsRelated stories","content":"Brazilian planemaker Embraer sees India, Saudi Arabia, the European Union and the United States as strategic markets for its defense unit as it looks to expand sales of the C-390 Millennium, the head of Embraer Defense said on Tuesday. India has an open tender to buy military planes while Saudi Arabia, looking to replace an aging fleet of Lockheed Martin's C-130 Hercules, is currently in \"early engagement\" with Embraer, Bosco da Costa Junior told reporters at an event. \"They don't have an open tender, but they need to replace their old C-130s. We did a lot of studies and concluded that the (Embraer) C-390 could deliver additional capability in this replacement process,\" Costa Junior said. In addition to Embraer's home country Brazil, nations such as Portugal, Hungary, the Netherlands, Austria, the Czech Republic and South Korea have selected the planemaker's military transportation aircraft. Expanding its presence abroad with more C-390 sales has been a key goal of Embraer's defense division, which also sees Sweden as a potential customer. It has partnerships with Mahindra in India and Saab in Sweden to introduce the plane. Embraer has also been \"aggressive on several fronts\" in the United States, Costa Junior said, including exploring opportunities for mergers or acquisitions as well as pitching the C-390 to the U.S. Marines, Air Force and special forces. \"We do believe that the C-390 could add additional value to those entities in the U.S.,\" the executive said. \"One thing is clear to us: We would like to become a partner of the U.S. government.\" Asked if any potential relationship with China could compromise connections with the U.S., Costa Junior stressed that Embraer's defense business had no relationship or any kind of discussions with the Asian superpower. \"We are 100% U.S.- and NATO-oriented,\" he said. ","cleaned_content":"brazilian planemaker embraer sees india saudi arabia the european union and the united states as strategic markets for its defense unit as it looks to expand sales of the c \u003cTHREE_HUNDRED\u003e millennium the head of embraer defense said on tuesday india has an open tender to buy military planes while saudi arabia looking to replace an aging fleet of lockheed martins c \u003cONE_HUNDRED\u003e hercules is currently in early engagement with embraer bosco da costa junior told reporters at an event they dont have an open tender but they need to replace their old c \u003cONE_HUNDRED\u003e s we did a lot of studies and concluded that the embraer c \u003cTHREE_HUNDRED\u003e could deliver additional capability in this replacement process costa junior said in addition to embraers home country brazil nations such as portugal hungary the netherlands austria the czech republic and south korea have selected the planemakers military transportation aircraft expanding its presence abroad with more c \u003cTHREE_HUNDRED\u003e sales has been a key goal of embraers defense division which also sees sweden as a potential customer it has partnerships with mahindra in india and saab in sweden to introduce the plane embraer has also been aggressive on several fronts in the united states costa junior said including exploring opportunities for mergers or acquisitions as well as pitching the c \u003cTHREE_HUNDRED\u003e to the u s marines air force and special forces we do believe that the c \u003cTHREE_HUNDRED\u003e could add additional value to those entities in the u s the executive said one thing is clear to us we would like to become a partner of the u s government asked if any potential relationship with china could compromise connections with the u s costa junior stressed that embraers defense business had no relationship or any kind of discussions with the asian superpower we are \u003cONE_HUNDRED_PERCENT\u003e u s and nato oriented he said","timestamp":"2024-06-19T07:11:00+05:30","market_timestamp":"2024-06-19T09:15:00+05:30","off_market_hours":true}