{"url":"https://www.moneycontrol.com/news/business/sbi-expects-14-15-credit-growth-in-current-fiscal-chairman-dinesh-kumar-khara-12750534.html","title":"SBI expects 14-15% credit growth in current fiscal: Chairman Dinesh Kumar Khara","description":"\"Normally the way we look at it is that the GDP growth rate plus inflation and 2-3 per cent over that. That gives us the number around 14 per cent or so,\" Khara told PTI in an interview.SBI expects 14-15% credit growth in current fiscal: Chairman Dinesh Kumar KharaRelated stories","content":"Given the current economic growth rate, SBI is expecting 14-15 per cent loan growth during the fiscal year 2024-25, the bank's chairman Dinesh Kumar Khara said. \"Normally the way we look at it is that the GDP growth rate plus inflation and 2-3 per cent over that. That gives us the number around 14 per cent or so,\" Khara told PTI in an interview. \"Hence, 14-15 per cent credit growth depends upon the opportunities available for lending, and it meets our risk appetite. We will be happy to grow at this pace,\" he said. \"And we have some elbow room available in terms of excess SLR and which ensures that we don't have any pressure on us to raise the deposit rates for supporting our loan-to-deposit ratio,\" he said. The bank has an excess Statutory Liquidity Ratio (SLR) between Rs 3.5 lakh crore and Rs 4 lakh crore. \"Incidentally, I may add here that our loan-to-deposit ratio is around 68-69 per cent only. That leaves enough room for us to lend without having pressure on the deposit interest rates. Nevertheless, he said, \"We always give importance to deposits. That is the reason why we increased the interest rate for the short-term deposits recently because we felt that there's room for improvement...we should improve our deposit growth rate to some extent during this year. And our effort would be that we should at least grow around 12-13 per cent this year.\" Last month, SBI hiked the fixed deposit rate on select short-term maturity up to 75 basis points. For retail term deposits of 46-179 days, the rate increased by 75 basis points to 5.50 per cent against the earlier 4.75 per cent. Asked about the Net Interest Margin (NIM) outlook for the current financial year, Khara expressed hope and said it would be around the same level recorded in FY24 or could be 2-3 basis points movement here or there. The domestic NIM of the bank stood at 3.43 per cent for FY24 down by 15 basis points (bps) while the whole bank NIM stood at 3.28 per cent lower by 9 bps year-on-year basis. The rise in both rupee liquidity and dollar liquidity cost due to tight monetary policy pursued by central banks across the globe was a major factor affecting NIM during FY24. As far as Non-Performing Assets (NPAs) are concerned, Khara said, \"We should have a downward trajectory both for net and gross. However, it is very difficult to make any projections as it is also a function of the macroeconomy.\" The bank is trying to insulate its book for macro stress nevertheless it's difficult to give any kind of guidance on NPAs. \"Our guidance as far as our credit cost is concerned, we have kept it at 0.50 per cent but our effort is to keep it at the level of 0.29 per cent,\" he added. Gross NPA of SBI declined to 2.24 per cent, an improvement of 54 bps compared to previous FY23 while the net NPA stood at 0.57 per cent, an improvement of 10 bps YoY. The credit cost also fell by 3 bps to 0.29 per cent at the end of FY24. ","cleaned_content":"given the current economic growth rate sbi is expecting \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e loan growth during the fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the banks chairman dinesh kumar khara said normally the way we look at it is that the gdp growth rate plus inflation and \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e over that that gives us the number around \u003cONE_TEN_PERCENT\u003e or so khara told pti in an interview hence \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e credit growth depends upon the opportunities available for lending and it meets our risk appetite we will be happy to grow at this pace he said and we have some elbow room available in terms of excess slr and which ensures that we dont have any pressure on us to raise the deposit rates for supporting our loan to deposit ratio he said the bank has an excess statutory liquidity ratio slr between rs \u003cTHREE_\u003e lakh crore and rs \u003cFOUR_\u003e lakh crore incidentally i may add here that our loan to deposit ratio is around \u003cSIX_TEN\u003e \u003cSIX_TEN_PERCENT\u003e only that leaves enough room for us to lend without having pressure on the deposit interest rates nevertheless he said we always give importance to deposits that is the reason why we increased the interest rate for the short term deposits recently because we felt that theres room for improvement we should improve our deposit growth rate to some extent during this year and our effort would be that we should at least grow around \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e this year last month sbi hiked the fixed deposit rate on select short term maturity up to \u003cSEVEN_TEN\u003e basis points for retail term deposits of \u003cFOUR_TEN\u003e \u003cONE_HUNDRED\u003e days the rate increased by \u003cSEVEN_TEN\u003e basis points to \u003cFIVE_PERCENT\u003e against the earlier \u003cFOUR_PERCENT\u003e asked about the net interest margin nim outlook for the current financial year khara expressed hope and said it would be around the same level recorded in fy24 or could be \u003cTWO_\u003e \u003cTHREE_\u003e basis points movement here or there the domestic nim of the bank stood at \u003cTHREE_PERCENT\u003e for fy24 down by \u003cONE_TEN\u003e basis points bps while the whole bank nim stood at \u003cTHREE_PERCENT\u003e lower by \u003cNINE_\u003e bps year on year basis the rise in both rupee liquidity and dollar liquidity cost due to tight monetary policy pursued by central banks across the globe was a major factor affecting nim during fy24 as far as non performing assets npas are concerned khara said we should have a downward trajectory both for net and gross however it is very difficult to make any projections as it is also a function of the macroeconomy the bank is trying to insulate its book for macro stress nevertheless its difficult to give any kind of guidance on npas our guidance as far as our credit cost is concerned we have kept it at \u003cZERO_PERCENT\u003e but our effort is to keep it at the level of \u003cZERO_PERCENT\u003e he added gross npa of sbi declined to \u003cTWO_PERCENT\u003e an improvement of \u003cFIVE_TEN\u003e bps compared to previous fy23 while the net npa stood at \u003cZERO_PERCENT\u003e an improvement of \u003cONE_TEN\u003e bps yoy the credit cost also fell by \u003cTHREE_\u003e bps to \u003cZERO_PERCENT\u003e at the end of fy24","timestamp":"2024-06-18T06:52:00+05:30","market_timestamp":"2024-06-18T09:15:00+05:30","off_market_hours":true}