{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-desi-soros-tunes-into-sun-tv-royal-investor-takes-a-bit-of-tcns-india-shelter-bulk-deal-hnis-fancy-poonawala-defence-it-12748609.html","title":"MC Inside Edge: Desi Soros tunes into Sun TV, Royal investor takes a bite of TCNS, India Shelter bulk deal, HNIs fancy Poonawala, defence \u0026 IT","description":"Know all the major deals and all the inner goings-on from Dalal Street. Also, here's what stocks veteran bulls are eyeing, what the bears are ganging up againstKnow all the major deals and all the inner goings-on from Dalal Street. Related stories","content":"Lone ranger Desi Soros (DS) is known for boldly venturing into stocks that most fund managers would think twice before buying. Probably it has to do with DS’s philosophy that maximum money can be made in unloved stocks. Sun TV is the latest among such stocks that DS has taken a fancy to. His schemes picked up around 6.4 million shares of the South-based broadcaster last month when arbitrage funds were reversing their trades in that stock. Domestic mutual fund holdings in the stock have risen in the last couple of quarters, but opinion is divided on whether the stock will get rerated considering the promoters' roughshod treatment of institutional investors in the past. But then, it is usually the case that when prices rise beyond a certain point, fund managers have shown themselves to be willing to forgive the sins of the past. DS too may be betting on that.  TCNS Clothing's shares have seen a spike in trading volumes over the last couple of trading sessions. Mauritius-based TA FDI Investors has been trimming its exposure to the stock and a good chunk of those shares have been picked up the HNI from the royal state who has built a reputation for himself over the years as a skilled special situations investor. This is causing players to wonder if there might be a special situation brewing in TCNS. The company has been making losses for the last four years now. Earlier this year, the royal investor had a stroke of luck when he managed to exit the TFCI stock in the nick of time. Investors who bought TFCI shares from the royal investor, however, were not as lucky. Silent buyers Madison India Opportunities Trust Fund sold 11.35 lakh shares of India Shelter Finance Corp on Thursday. The BSE bulk deal window does not mention any of the buyers. Considering that domestic mutual funds have sizeable exposure to the stock, it is likely that the block may have been picked up a clutch of other mutual funds. India Shelter had hit a record high in February this year but fell as sharply during the midcap meltdown in March. It now appears to be making a comeback. Poonawala Fincorp MD’s Ajay Bhutada’s sale of 76 lakh shares is learnt to have been picked up by a clutch of HNIs. The stock is quoting around 4 times book, and despite the action in the stock over the last year, domestic funds have not shown any interest so far. If the latest buyers are counting on a rerating, it will have to driven by another set of equally optimistic HNIs, it seems. Uncomfortable similarities Defence stocks are as much a rage on the bourses right now as IT stocks were back during the heydays of the dotcom boom in 2000. But there is another unsavoury similarity between the two sectors, especially when it comes to the lesser-known companies, is the chatter on the Street. Like some of the IT companies back then were actually money-laundering machines, export orders being claimed by some of the so-called ‘defence’ companies exist only on the bills of lading. ","cleaned_content":"lone ranger desi soros ds is known for boldly venturing into stocks that most fund managers would think twice before buying probably it has to do with ds s philosophy that maximum money can be made in unloved stocks sun tv is the latest among such stocks that ds has taken a fancy to his schemes picked up around \u003cSIX_\u003e million shares of the south based broadcaster last month when arbitrage funds were reversing their trades in that stock domestic mutual fund holdings in the stock have risen in the last couple of quarters but opinion is divided on whether the stock will get rerated considering the promoters roughshod treatment of institutional investors in the past but then it is usually the case that when prices rise beyond a certain point fund managers have shown themselves to be willing to forgive the sins of the past ds too may be betting on that tcns clothings shares have seen a spike in trading volumes over the last couple of trading sessions mauritius based ta fdi investors has been trimming its exposure to the stock and a good chunk of those shares have been picked up the hni from the royal state who has built a reputation for himself over the years as a skilled special situations investor this is causing players to wonder if there might be a special situation brewing in tcns the company has been making losses for the last four years now earlier this year the royal investor had a stroke of luck when he managed to exit the tfci stock in the nick of time investors who bought tfci shares from the royal investor however were not as lucky silent buyers madison india opportunities trust fund sold \u003cONE_TEN\u003e lakh shares of india shelter finance corp on thursday the bse bulk deal window does not mention any of the buyers considering that domestic mutual funds have sizeable exposure to the stock it is likely that the block may have been picked up a clutch of other mutual funds india shelter had hit a record high in february this year but fell as sharply during the midcap meltdown in march it now appears to be making a comeback poonawala fincorp md s ajay bhutada s sale of \u003cSEVEN_TEN\u003e lakh shares is learnt to have been picked up by a clutch of hnis the stock is quoting around \u003cFOUR_\u003e times book and despite the action in the stock over the last year domestic funds have not shown any interest so far if the latest buyers are counting on a rerating it will have to driven by another set of equally optimistic hnis it seems uncomfortable similarities defence stocks are as much a rage on the bourses right now as it stocks were back during the heydays of the dotcom boom in \u003cTWO_THOUSAND\u003e but there is another unsavoury similarity between the two sectors especially when it comes to the lesser known companies is the chatter on the street like some of the it companies back then were actually money laundering machines export orders being claimed by some of the so called defence companies exist only on the bills of lading","timestamp":"2024-06-14T12:38:00+05:30","market_timestamp":"2024-06-14T12:38:00+05:30","off_market_hours":false}