{"url":"https://www.moneycontrol.com/news/business/german-auto-component-supplier-zf-group-sells-7-5-stake-in-its-indian-subsidiary-12751961.html","title":"German auto component supplier ZF Group sells 7.5% stake in its Indian subsidiary","description":"The sale of shares has no effect on ZF's control over ZF CVCS India, the company said in a statement.German auto component supplier ZF Group sells 7.5% stake in its Indian subsidiaryRelated stories","content":"German auto component supplier ZF Group on Wednesday said it has sold a 7.5 per cent stake in its Indian subsidiary ZF Commercial Vehicles Control System (CVCS) India to increase liquidity and financial flexibility for growth. The sale of shares has no effect on ZF's control over ZF CVCS India, the company said in a statement. \"ZF Group has sold 1,425,000 shares, equalling 7.5 per cent stake, in its listed Indian subsidiary ZF CVCS India to increase liquidity and financial flexibility for its growth plans. The transaction will strengthen the financial flexibility of ZF, allowing it to invest in its further growth, and in the dynamically developing Indian market,\" it said. ZF CVCS India is the market leader in the Indian CV supplier industry and remains an important pillar in ZF's global growth strategy, the company said, adding that the Indian business has shown a strong operating and financial performance on the back of a supportive market environment. \"The sale of shares has no effect on ZF's control of ZF CVCS India, as it is the long-term strategy of ZF to maintain a solid majority shareholding in the entity,\" it stated. The transaction will strengthen the financial flexibility of ZF, allowing it to invest in its further growth, and in the dynamically developing Indian market, ZF Group said. ","cleaned_content":"german auto component supplier zf group on wednesday said it has sold a \u003cSEVEN_PERCENT\u003e stake in its indian subsidiary zf commercial vehicles control system cvcs india to increase liquidity and financial flexibility for growth the sale of shares has no effect on zfs control over zf cvcs india the company said in a statement zf group has sold \u003cONE_MILLION\u003e shares equalling \u003cSEVEN_PERCENT\u003e stake in its listed indian subsidiary zf cvcs india to increase liquidity and financial flexibility for its growth plans the transaction will strengthen the financial flexibility of zf allowing it to invest in its further growth and in the dynamically developing indian market it said zf cvcs india is the market leader in the indian cv supplier industry and remains an important pillar in zfs global growth strategy the company said adding that the indian business has shown a strong operating and financial performance on the back of a supportive market environment the sale of shares has no effect on zfs control of zf cvcs india as it is the long term strategy of zf to maintain a solid majority shareholding in the entity it stated the transaction will strengthen the financial flexibility of zf allowing it to invest in its further growth and in the dynamically developing indian market zf group said","timestamp":"2024-06-19T14:43:00+05:30","market_timestamp":"2024-06-19T14:43:00+05:30","off_market_hours":false}