{"url":"https://www.moneycontrol.com/news/business/omega-seiki-partners-with-orbitsys-to-enhance-ev-dealership-operations-12747594.html","title":"Omega Seiki partners with Orbitsys to enhance EV dealership operations","description":"Under the partnership, Orbitsys Technologies will support Omega Seiki Mobility's pre- and post-sales touchpoints across all electric passenger and commercial vehicle categories with its fully integrated cloud-based Dealer Management System (DMS), OSM said in a statement.Uday Narang, Founder and Chairman, Omega Seiki Mobility and Gurbinder Dhillon, Founder, Orbitsys Technologies","content":"Electric vehicle maker Omega Seiki Mobility (OSM) on Thursday said it has partnered with management firm Orbitsys Technologies to boost efficiency in its day-to-day EV dealership operations. Under the partnership, Orbitsys Technologies will support Omega Seiki Mobility's pre- and post-sales touchpoints across all electric passenger and commercial vehicle categories with its fully integrated cloud-based Dealer Management System (DMS), OSM said in a statement. The DMS supports both electric passenger and commercial vehicles and is key in managing capacity and spare parts while serving as a unified platform for customer feedback, OSM said. \"This partnership marks a significant milestone in our efforts to boost performance for EV industry dealerships, distributors, and manufacturers,\" said Harvinder Pal Singh, Chief Business Officer, Orbitsys. ","cleaned_content":"electric vehicle maker omega seiki mobility osm on thursday said it has partnered with management firm orbitsys technologies to boost efficiency in its day to day ev dealership operations under the partnership orbitsys technologies will support omega seiki mobilitys pre and post sales touchpoints across all electric passenger and commercial vehicle categories with its fully integrated cloud based dealer management system dms osm said in a statement the dms supports both electric passenger and commercial vehicles and is key in managing capacity and spare parts while serving as a unified platform for customer feedback osm said this partnership marks a significant milestone in our efforts to boost performance for ev industry dealerships distributors and manufacturers said harvinder pal singh chief business officer orbitsys","timestamp":"2024-06-13T13:41:00+05:30","market_timestamp":"2024-06-13T13:41:00+05:30","off_market_hours":false}