{"url":"https://www.moneycontrol.com/news/business/companies/puravankara-board-approves-raising-funds-up-to-rs-1000-crore-via-qip-12748084.html","title":"Puravankara board approves raising funds up to Rs 1,000 crore via QIP","description":"On June 13, the firm's shares closed 0.3 percent lower at Rs 437 apiece.Representative image","content":"Bengaluru-headquartered real estate firm Puravankara Ltd on June 13 said its board approved raising of funds up to Rs 1,000 crore through Qualified Institutional Placement (QIP). On June 13, the firm's shares closed 0.3 percent lower at Rs 437 apiece. Early this month, the company had announced the acquisition of 12.75 acres of land in Patlipada on Ghodbunder Road in Thane. The purchase was done by its wholly-owned subsidiary company Purva Oak Private Limited, the company had announced. For its March quarter, the real estate developer posted a 33 percent year-on-year (YoY) dip in net profit at Rs 42 crore, while it clocked a revenue of Rs 947 crore in the fourth quarter, up by 112 percent YoY. In April 2024, the company emerged as the preferred developer for the redevelopment of a residential housing society in Mumbai's Pali Hill locality. ","cleaned_content":"bengaluru headquartered real estate firm puravankara ltd on june \u003cONE_TEN\u003e said its board approved raising of funds up to rs \u003cONE_THOUSAND\u003e crore through qualified institutional placement qip on june \u003cONE_TEN\u003e the firms shares closed \u003cZERO_PERCENT\u003e lower at rs \u003cFOUR_HUNDRED\u003e apiece early this month the company had announced the acquisition of \u003cONE_TEN\u003e acres of land in patlipada on ghodbunder road in thane the purchase was done by its wholly owned subsidiary company purva oak private limited the company had announced for its march quarter the real estate developer posted a \u003cTHREE_TEN_PERCENT\u003e year on year yoy dip in net profit at rs \u003cFOUR_TEN\u003e crore while it clocked a revenue of rs \u003cNINE_HUNDRED\u003e crore in the fourth quarter up by \u003cONE_HUNDRED_PERCENT\u003e yoy in april \u003cTWO_THOUSAND\u003e the company emerged as the preferred developer for the redevelopment of a residential housing society in mumbais pali hill locality","timestamp":"2024-06-13T17:14:00+05:30","market_timestamp":"2024-06-14T09:15:00+05:30","off_market_hours":true}