{"url":"https://www.moneycontrol.com/news/business/air-india-to-launch-premium-economy-class-on-select-domestic-routes-from-july-12751780.html","title":"Air India to launch premium economy class on select domestic routes from July","description":"As of now, Vistara is the only Indian carrier which offers premium economy-class travel category on its domestic routes.Air India to launch premium economy class on select domestic routes from July","content":"Air India on Wednesday said it will launch premium economy class on select domestic routes from next month. As of now, Vistara is the only Indian carrier which offers premium economy-class travel category on its domestic routes. The Tata Group-owned airline said it has refitted two new A320neo aircraft in a three-class configuration, featuring eight seats in business, 24 seats with extra legroom in premium economy, and 132 in the economy category, offering a wider choice to its guests. \"The introduction of a three-class cabin to Air India's narrow-body fleet and commencement of interior refits are important steps in the journey of enhancing the flying experience,\" said Campbell Wilson, Chief Executive Officer and Managing Director at Air India. The latest upgrade of the narrow-body fleet, which operates on domestic and short-haul international networks, complements the upgraded wide-body experience available on A350 fleet and new B777s, and on all other wide-body planes as they are refitted over the next two years, he said. Air India has plans to introduce the three-class configuration to its entire full-service narrow-body fleet over the next year. Existing aircraft are now being progressively inducted for refit, while new aircraft joining the fleet will be delivered with the new Air India experience, it said. ","cleaned_content":"air india on wednesday said it will launch premium economy class on select domestic routes from next month as of now vistara is the only indian carrier which offers premium economy class travel category on its domestic routes the tata group owned airline said it has refitted two new a320neo aircraft in a three class configuration featuring eight seats in business \u003cTWO_TEN\u003e seats with extra legroom in premium economy and \u003cONE_HUNDRED\u003e in the economy category offering a wider choice to its guests the introduction of a three class cabin to air indias narrow body fleet and commencement of interior refits are important steps in the journey of enhancing the flying experience said campbell wilson chief executive officer and managing director at air india the latest upgrade of the narrow body fleet which operates on domestic and short haul international networks complements the upgraded wide body experience available on a350 fleet and new b777s and on all other wide body planes as they are refitted over the next two years he said air india has plans to introduce the three class configuration to its entire full service narrow body fleet over the next year existing aircraft are now being progressively inducted for refit while new aircraft joining the fleet will be delivered with the new air india experience it said","timestamp":"2024-06-19T12:26:00+05:30","market_timestamp":"2024-06-19T12:26:00+05:30","off_market_hours":false}