{"url":"https://www.moneycontrol.com/news/business/axiscades-technologies-to-supply-drone-systems-to-indian-army-under-rs-100-crore-order-12744827.html","title":"Axiscades Technologies to supply drone systems to Indian Army under Rs 100 crore order","description":"The Man Portable Counter Drone System (MPCDS) has been developed by Axiscades, a company statement said.Axiscades Technologies to supply drone systems to Indian Army under Rs 100 crore order","content":"Engineering solutions provider Axiscades Technologies on Monday said it will deliver drone systems to the Indian army as part of a Rs 100 crore order. The Man Portable Counter Drone System (MPCDS) has been developed by Axiscades, a company statement said. \"Axiscades Technologies has begun the delivery of advanced counter-drone systems under an order of Rs 100 crore from the Indian Army,\" it said. MPCDS has the capability to operate on both battery and main power supply. It can cover multiple frequency spectrums, including command, control and navigation. MPCDS can also detect and jam a wide variety of drones within a range of up to 5 kilometres. Arun Krishnamurthi, the CEO and Managing Director of Axiscades said, \"This is the first Counter Drone System being inducted into the Indian Defence forces in the man portable category, and the system is being deployed at multiple locations across various commands in the Indian Army. We aim to continue to innovate and provide advanced security solutions to meet the evolving needs of our armed forces.\" Bengaluru-based Axiscades is a leading end-to-end engineering and technology solutions provider catering to sectors like aerospace, defence, heavy engineering, automotive, and energy among others. ","cleaned_content":"engineering solutions provider axiscades technologies on monday said it will deliver drone systems to the indian army as part of a rs \u003cONE_HUNDRED\u003e crore order the man portable counter drone system mpcds has been developed by axiscades a company statement said axiscades technologies has begun the delivery of advanced counter drone systems under an order of rs \u003cONE_HUNDRED\u003e crore from the indian army it said mpcds has the capability to operate on both battery and main power supply it can cover multiple frequency spectrums including command control and navigation mpcds can also detect and jam a wide variety of drones within a range of up to \u003cFIVE_\u003e kilometres arun krishnamurthi the ceo and managing director of axiscades said this is the first counter drone system being inducted into the indian defence forces in the man portable category and the system is being deployed at multiple locations across various commands in the indian army we aim to continue to innovate and provide advanced security solutions to meet the evolving needs of our armed forces bengaluru based axiscades is a leading end to end engineering and technology solutions provider catering to sectors like aerospace defence heavy engineering automotive and energy among others","timestamp":"2024-06-10T12:16:00+05:30","market_timestamp":"2024-06-10T12:16:00+05:30","off_market_hours":false}