{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-indigo-not-so-6e-fastest-finger-strikes-in-irb-til-rights-shares-orianas-social-media-power-wizardry-of-promoters-12746504.html","title":"MC Inside Edge: Indigo not so 6E, Fastest Finger strikes in IRB, TIL rights shares, Oriana's social media power, Wizardry of promoters","description":"Know what stocks veteran bulls are eyeing, what the bears are ganging up against. Here's all the major deals and inner goings-on from Dalal StreetHere's all the major deals and inner goings-on from Dalal Street.Related stories","content":"Twin engine supply Interglobe Aviation’s ex-promoter Rakesh Gangwal periodically selling part of his stake has been a source of edginess for bulls in the stock. But when the current promoter also joins the spree, bulls now have more reason to look over their shoulder. The outlook for the sector may be rosy, but technical factors also have a role to play in stock price moves. Some big guns of Dalal Street had loaded up on the stock over the last few months. Having taken the stock to cruising altitude, they trimmed their positions just before the latest block deal.  Foreign high trading frequency (HFT) firms may boast of cutting edge technology, but on most days they are no match for the Fastest Finger First (FFF) proprietary broker which manages to squeeze itself into most block deals ahead of buyers who had negotiated the deal. FFF, along with its sister firm is said to have made a killing in the IRB block deal on Tuesday, making a spread of as much as Rs 2 on a huge of volume of shares. Foreign firms may have the technology, but on Dalal Street, ‘native intelligence’ is much more effective A rich harvest Shares of TIL (erstwhile Tractors India Limited) have been on a tear over the last month. One reason for this, players tracking the stock say, is that the rights issue's shares have not yet been credited to shareholders demat accounts, despite the issue having closed on May 10. That once again raises the question that many on Dalal Street have been asking: if there is a defined timeline for the IPO process, why is there not a similar standard timeline for allotment of shares in rights issues. Is Sebi listening? One-way street Oriana Power ranks among the rare instances of IPO where the promoter made a generous gift to investors. The IPO priced at Rs 118 has appreciated 23 times (yes, that’s right) in just 10 months. Maybe the market knows the worth of the company better than the promoter. It helps that anything to do with solar is enjoying the same status in this market that IT firms enjoyed during the 2000 tech boom, and infra companies during the 2008 boom. Exchange filings do not show any major order wins. But social media handles and Telegram channels are all singing the same tune: that Oriana is a mutibagger in the making because of the boom in solar energy. A little too synchronized for comfort, one could say. Disappearing act The Street simply can’t get enough of Wardwizard Innovations \u0026 Mobility ever since the company announced a $1.29 billion order win (or MoU, it is still not clear) a few days back. And it now also looks like promoters are being kind to investors by offering up their (the promoters that is) shares. In the last three trading sessions of May, some promoter group entities had sold 1.5 million shares. They stepped up the selling on Monday and Tuesday, dumping another 8.1 million shares. Clearly, they are not as kicked up about the order as the Street is.  ","cleaned_content":"twin engine supply interglobe aviation s ex promoter rakesh gangwal periodically selling part of his stake has been a source of edginess for bulls in the stock but when the current promoter also joins the spree bulls now have more reason to look over their shoulder the outlook for the sector may be rosy but technical factors also have a role to play in stock price moves some big guns of dalal street had loaded up on the stock over the last few months having taken the stock to cruising altitude they trimmed their positions just before the latest block deal foreign high trading frequency hft firms may boast of cutting edge technology but on most days they are no match for the fastest finger first fff proprietary broker which manages to squeeze itself into most block deals ahead of buyers who had negotiated the deal fff along with its sister firm is said to have made a killing in the irb block deal on tuesday making a spread of as much as rs \u003cTWO_\u003e on a huge of volume of shares foreign firms may have the technology but on dalal street native intelligence is much more effective a rich harvest shares of til erstwhile tractors india limited have been on a tear over the last month one reason for this players tracking the stock say is that the rights issues shares have not yet been credited to shareholders demat accounts despite the issue having closed on may \u003cONE_TEN\u003e that once again raises the question that many on dalal street have been asking if there is a defined timeline for the ipo process why is there not a similar standard timeline for allotment of shares in rights issues is sebi listening one way street oriana power ranks among the rare instances of ipo where the promoter made a generous gift to investors the ipo priced at rs \u003cONE_HUNDRED\u003e has appreciated \u003cTWO_TEN\u003e times yes that s right in just \u003cONE_TEN\u003e months maybe the market knows the worth of the company better than the promoter it helps that anything to do with solar is enjoying the same status in this market that it firms enjoyed during the \u003cTWO_THOUSAND\u003e tech boom and infra companies during the \u003cTWO_THOUSAND\u003e boom exchange filings do not show any major order wins but social media handles and telegram channels are all singing the same tune that oriana is a mutibagger in the making because of the boom in solar energy a little too synchronized for comfort one could say disappearing act the street simply can t get enough of wardwizard innovations mobility ever since the company announced a \u003cONE_\u003e billion order win or mou it is still not clear a few days back and it now also looks like promoters are being kind to investors by offering up their the promoters that is shares in the last three trading sessions of may some promoter group entities had sold \u003cONE_\u003e million shares they stepped up the selling on monday and tuesday dumping another \u003cEIGHT_\u003e million shares clearly they are not as kicked up about the order as the street is","timestamp":"2024-06-12T11:15:00+05:30","market_timestamp":"2024-06-12T11:15:00+05:30","off_market_hours":false}