{"url":"https://www.moneycontrol.com/news/business/hsbc-sees-250-million-of-india-swap-deals-before-jpm-inclusion-12750968.html","title":"HSBC sees $250 million of India swap deals before JPM inclusion","description":"The British bank, via its unit in the International Financial Services Centres Authority, carried out the so-called total return swap deals worth more than $250 million with foreign investors who want onshore bond exposure, its head of India markets said. That compares with a total volume of about $510 million. HSBC sees $250 million of India swap deals before JPM inclusionRelated stories","content":"HSBC Holdings Plc has executed nearly half the volume of bond-derivative trades in India’s international finance hub over the last month, ahead of the sovereign bonds’ inclusion in a key global index. The British bank, via its unit in the International Financial Services Centres Authority, carried out the so-called total return swap deals worth more than $250 million with foreign investors who want onshore bond exposure, its head of India markets said. That compares with a total volume of about $510 million. The total-return swaps have emerged as one of the key products for foreigners to get India exposure without necessarily having to get a license to buy the bonds onshore and deal with local regulations. Foreign investors have been piling into Indian sovereign bonds ahead of their inclusion into JPMorgan Chase \u0026 Co.’s emerging-market index from June 28. Standard Chartered Plc offers a similar derivative product. About three to four foreign banks have written the offshore derivatives so far, K. Rajaraman, chairman of the International Financial Services Centres Authority, said. “This year we are seeing a lot of traction, especially after the inclusion of India in the bond indices,” he said. About $10 billion of inflows have come into India’s index-eligible bonds since JPMorgan announced in September that it will include the nation’s bonds in its flagship index. Some funds are using other alternatives like investing in rupee-denominated supranational bonds or in an India bond exchange-traded fund like those offered by BlackRock Inc. or Legal \u0026 General Investment Management to get India exposure. ","cleaned_content":"hsbc holdings plc has executed nearly half the volume of bond derivative trades in india s international finance hub over the last month ahead of the sovereign bonds inclusion in a key global index the british bank via its unit in the international financial services centres authority carried out the so called total return swap deals worth more than \u003cTWO_HUNDRED\u003e million with foreign investors who want onshore bond exposure its head of india markets said that compares with a total volume of about \u003cFIVE_HUNDRED\u003e million the total return swaps have emerged as one of the key products for foreigners to get india exposure without necessarily having to get a license to buy the bonds onshore and deal with local regulations foreign investors have been piling into indian sovereign bonds ahead of their inclusion into jpmorgan chase co s emerging market index from june \u003cTWO_TEN\u003e standard chartered plc offers a similar derivative product about three to four foreign banks have written the offshore derivatives so far k rajaraman chairman of the international financial services centres authority said this year we are seeing a lot of traction especially after the inclusion of india in the bond indices he said about \u003cONE_TEN\u003e billion of inflows have come into india s index eligible bonds since jpmorgan announced in september that it will include the nation s bonds in its flagship index some funds are using other alternatives like investing in rupee denominated supranational bonds or in an india bond exchange traded fund like those offered by blackrock inc or legal general investment management to get india exposure","timestamp":"2024-06-18T13:15:00+05:30","market_timestamp":"2024-06-18T13:15:00+05:30","off_market_hours":false}