{"url":"https://www.moneycontrol.com/news/business/hudco-raises-200-million-from-overseas-lenders-12750884.html","title":"HUDCO raises $200 million from overseas lenders","description":"The state-run body has raised the five-year money as part of its inaugural \"social loan\", Japan's Sumitomo Mitsui Banking Corporation (SMBC) said.HUDCO raises $200 million from overseas lendersRelated stories","content":"Housing and Urban Development Corporation (HUDCO) has raised USD 200 million (JPY 30 billion) in its maiden foray into the syndicated loan market, its arranger said on Tuesday. The state-run body has raised the five-year money as part of its inaugural \"social loan\", Japan's Sumitomo Mitsui Banking Corporation (SMBC) said. The deal, led by SMBC's Singapore branch, saw an oversubscription with a total of nine lenders, and was upsized from its original launch size of JPY 15 billion to JPY 30 billion after exercising the greenshoe option, an official statement said. SMBC acted as the sole mandated lead arranger, book runner and social loan coordinator. \"We look forward to expanding our reach to the underserved communities and strengthening the local community's access to resources,\" Hiroyuki Mesaki, country head of SMBC India, said. SMBC India's chief business officer Rakesh Garg said the financing sets new benchmarks and paves the way for more Indian companies to tap into the Japanese Yen loan markets. HUDCO's chairman and managing director Sanjay Kulshreshta said the body anticipates a surge in demand for its services given the government's focus on infrastructure-led growth. \"The substantial increase in infrastructure outlay signals significant growth prospects,\" he said, adding that the deal helps diversify the resource base and optimise costs. ","cleaned_content":"housing and urban development corporation hudco has raised usd \u003cTWO_HUNDRED\u003e million jpy \u003cTHREE_TEN\u003e billion in its maiden foray into the syndicated loan market its arranger said on tuesday the state run body has raised the five year money as part of its inaugural social loan japans sumitomo mitsui banking corporation smbc said the deal led by smbcs singapore branch saw an oversubscription with a total of nine lenders and was upsized from its original launch size of jpy \u003cONE_TEN\u003e billion to jpy \u003cTHREE_TEN\u003e billion after exercising the greenshoe option an official statement said smbc acted as the sole mandated lead arranger book runner and social loan coordinator we look forward to expanding our reach to the underserved communities and strengthening the local communitys access to resources hiroyuki mesaki country head of smbc india said smbc indias chief business officer rakesh garg said the financing sets new benchmarks and paves the way for more indian companies to tap into the japanese yen loan markets hudcos chairman and managing director sanjay kulshreshta said the body anticipates a surge in demand for its services given the governments focus on infrastructure led growth the substantial increase in infrastructure outlay signals significant growth prospects he said adding that the deal helps diversify the resource base and optimise costs","timestamp":"2024-06-18T12:48:00+05:30","market_timestamp":"2024-06-18T12:48:00+05:30","off_market_hours":false}