{"url":"https://www.moneycontrol.com/news/business/jsw-mg-motor-india-partners-with-tata-capital-to-offer-financing-solutions-to-dealers-12751030.html","title":"JSW MG Motor India partners with Tata Capital to offer financing solutions to dealers","description":"The collaboration aims to support JSW MG Motor India dealers with working capital, term loans, demo car loans, leasing solutions and off-balance sheet structured solutions, catering to their growing business needs, the company said in a statement.Narendra Kamath, COO, SME Finance from Tata Capital and Satinder Singh Bajwa, Chief Commercial Officer at JSW MG Motor India","content":"JSW MG Motor India on Tuesday said it has partnered with Tata Capital to provide financing solutions to its dealers. The collaboration aims to support JSW MG Motor India dealers with working capital, term loans, demo car loans, leasing solutions and off-balance sheet structured solutions, catering to their growing business needs, the company said in a statement. The partnership with Tata Capital expands the company's channel financing options, JSW MG Motor India Chief Commercial Officer, Satinder Singh Bajwa said. Commenting on the partnership, Tata Capital COO, SME Finance, Narendra Kamath said, \"Our tailor-made products will cater and enable the distribution network of JSW MG Motor India with the apt resources to leverage emerging prospects seamlessly.\" ","cleaned_content":"jsw mg motor india on tuesday said it has partnered with tata capital to provide financing solutions to its dealers the collaboration aims to support jsw mg motor india dealers with working capital term loans demo car loans leasing solutions and off balance sheet structured solutions catering to their growing business needs the company said in a statement the partnership with tata capital expands the companys channel financing options jsw mg motor india chief commercial officer satinder singh bajwa said commenting on the partnership tata capital coo sme finance narendra kamath said our tailor made products will cater and enable the distribution network of jsw mg motor india with the apt resources to leverage emerging prospects seamlessly","timestamp":"2024-06-18T14:15:00+05:30","market_timestamp":"2024-06-18T14:15:00+05:30","off_market_hours":false}