{"url":"https://www.moneycontrol.com/news/business/westbridge-capital-sells-1-7-stake-in-au-small-finance-bank-for-rs-845-crore-12752372.html","title":"WestBridge Capital sells 1.7% stake in AU Small Finance Bank for Rs 845 crore","description":"WestBridge Capital, through its affiliate Westbridge AIF I, sold shares of the Jaipur-based AU Small Finance Bank through a bulk deal on the National Stock Exchange (NSE).WestBridge Capital sells 1.7% stake in AU Small Finance Bank for Rs 845 crore","content":"Private equity firm WestBridge Capital divested on Wednesday a 1.7 per cent stake in the AU Small Finance Bank for Rs 845 crore through an open market transaction. WestBridge Capital, through its affiliate Westbridge AIF I, sold shares of the Jaipur-based AU Small Finance Bank through a bulk deal on the National Stock Exchange (NSE). As per data available, Westbridge AIF I offloaded 1.30 crore shares, amounting to a 1.75 per cent stake in AU Small Finance Bank. After the stake sale, the shareholding of WestBridge Capital in the AU Small Finance Bank has declined to 2.07 per cent from 3.82 per cent. Meanwhile, Goldman Sachs Investments Mauritius I picked up 43.34 lakh shares of the AU Small Finance Bank at an average price of Rs 650 per piece. This took the deal value to Rs 281.71 crore. Details of other buyers of the AU Small Finance Bank shares could not be ascertained. ","cleaned_content":"private equity firm westbridge capital divested on wednesday a \u003cONE_PERCENT\u003e stake in the au small finance bank for rs \u003cEIGHT_HUNDRED\u003e crore through an open market transaction westbridge capital through its affiliate westbridge aif i sold shares of the jaipur based au small finance bank through a bulk deal on the national stock exchange nse as per data available westbridge aif i offloaded \u003cONE_\u003e crore shares amounting to a \u003cONE_PERCENT\u003e stake in au small finance bank after the stake sale the shareholding of westbridge capital in the au small finance bank has declined to \u003cTWO_PERCENT\u003e from \u003cTHREE_PERCENT\u003e meanwhile goldman sachs investments mauritius i picked up \u003cFOUR_TEN\u003e lakh shares of the au small finance bank at an average price of rs \u003cSIX_HUNDRED\u003e per piece this took the deal value to rs \u003cTWO_HUNDRED\u003e crore details of other buyers of the au small finance bank shares could not be ascertained","timestamp":"2024-06-20T06:23:00+05:30","market_timestamp":"2024-06-20T09:15:00+05:30","off_market_hours":true}