{"url":"https://www.moneycontrol.com/news/business/hcltech-partners-with-tecnotree-to-develop-5g-led-genai-solutions-for-telcos-12751747.html","title":"HCLTech partners with Tecnotree to develop 5G-led GenAI solutions for telcos","description":"The two entities will help telcos and CSPs (communication service providers) unlock new opportunities, accelerate innovation and drive sustainable growth with personalised next-generation solutions, a company statement said.HCLTech partners with Tecnotree to develop 5G-led GenAI solutions for telcos","content":"IT services company HCLTech on Wednesday said it has collaborated with Tecnotree, a Finnish software company catering to telcos, to co-develop advanced 5G-led generative AI (GenAI) solutions for the global telecom industry. The two entities will help telcos and CSPs (communication service providers) unlock new opportunities, accelerate innovation and drive sustainable growth with personalised next-generation solutions, a company statement said. \"The partnership will bring together HCLTech's deep expertise in driving AI-led digital transformation for telcos and CSPs and Tecnotree's proven 5G and AI-led BSS platform capabilities,\" it said. \"Together, we aim to solve real-world challenges for telcos by using GenAI and create meaningful business impacts,\" said Pawan Vadapalli, Corporate Vice President and Global Head, Digital Business Services, HCLTech. ","cleaned_content":"it services company hcltech on wednesday said it has collaborated with tecnotree a finnish software company catering to telcos to co develop advanced \u003cFIVE_\u003e g led generative ai genai solutions for the global telecom industry the two entities will help telcos and csps communication service providers unlock new opportunities accelerate innovation and drive sustainable growth with personalised next generation solutions a company statement said the partnership will bring together hcltechs deep expertise in driving ai led digital transformation for telcos and csps and tecnotrees proven \u003cFIVE_\u003e g and ai led bss platform capabilities it said together we aim to solve real world challenges for telcos by using genai and create meaningful business impacts said pawan vadapalli corporate vice president and global head digital business services hcltech","timestamp":"2024-06-19T12:00:00+05:30","market_timestamp":"2024-06-19T12:00:00+05:30","off_market_hours":false}