{"url":"https://www.moneycontrol.com/news/business/hinduja-scion-in-swiss-human-trafficking-trial-says-nanny-was-like-a-second-mum-to-family-12746349.html","title":"Hinduja scion in Swiss human-trafficking trial says Nanny was like a ‘Second Mum’ to family","description":"Ajay Hinduja was testifying on the first day of the Geneva trial of a branch of one of India’s most prominent families, which stands accused of human trafficking and overworking household staff. Hinduja scion in Swiss human-trafficking trial says Nanny was like a ‘Second Mum’ to familyRelated stories","content":"The scion of the billionaire Hinduja family rejected allegations he overworked an Indian nanny at his Swiss villa, saying it would’ve been idiotic to do so when she was like a “second mum” to his kids. Ajay Hinduja was testifying on the first day of the Geneva trial of a branch of one of India’s most prominent families, which stands accused of human trafficking and overworking household staff. Ajay Hinduja, his wife Namrata and parents Prakash and Kamal were all indicted last year by Geneva prosecutors for allegedly making their staff work up to 18-hour days without a day off at their villa overlooking Lake Geneva. “I am shocked that someone who we considered to be a second mum for our children, could accuse us of something as demeaning as human trafficking,” he said later in the hearing, testifying mainly in French. He said he wanted to thank the woman for her work for the family, adding that she’s still in touch with his kids and sends them Diwali greetings by phone. The family confiscated their staff’s passports and put to them work on short-term tourist visas repeatedly obtained on false pretenses, prosecutors say. Ajay Hinduja rejected that accusation and said the employees had contracts endorsed by the Swiss embassy in India and their visas were regularly renewed by Geneva cantonal authorities. Judge Sabina Mascotto immediately rebutted that characterization of events, saying checks showed the staff lacked the correct Swiss paperwork. Instead they only ever had French-issued, Schengen-zone visas, referring to the European travel area, which allows people to move without passport checks. Ajay Hinduja said his staff were allowed to come and go from the house as they pleased provided at least one of them was home at all times for security reasons. Asked about their salaries, which prosecutors say never amounted to more than a few hundred Swiss francs a month — a fraction of local wages — he said it was the Hinduja Group’s HR department that did all hiring and contracts, not him. On Monday evening, he said his lawyers and those for the three plaintiffs were “close” to reaching a deal that would see the staff withdraw their complaints. But even if an accord is reached, it should still mean the criminal trial will proceed. That all the staff recruitment was done from India was a consistent refrain from the 56-year-old, who sits on the board of the Hinduja Group, one of India’s largest conglomerates. ‘Regret’His one regret, he testified, was that he didn’t get more involved in the running of the household after his parents were convicted of minor infractions, after being denounced at an employment tribunal in 2006. “I regret not having analyzed the situation more closely,” he said, in part because he was so busy with his own work. “I had confidence” in our legal advisers, he said. The trial only got underway Monday after the Hindujas secured a postponement, citing the inability of the parents to travel because of poor health. The lawyers then sought to have the judge recused, citing alleged bias, and to have the case sent back for re-examination. Both requests were rejected. ","cleaned_content":"the scion of the billionaire hinduja family rejected allegations he overworked an indian nanny at his swiss villa saying it would ve been idiotic to do so when she was like a second mum to his kids ajay hinduja was testifying on the first day of the geneva trial of a branch of one of india s most prominent families which stands accused of human trafficking and overworking household staff ajay hinduja his wife namrata and parents prakash and kamal were all indicted last year by geneva prosecutors for allegedly making their staff work up to \u003cONE_TEN\u003e hour days without a day off at their villa overlooking lake geneva i am shocked that someone who we considered to be a second mum for our children could accuse us of something as demeaning as human trafficking he said later in the hearing testifying mainly in french he said he wanted to thank the woman for her work for the family adding that she s still in touch with his kids and sends them diwali greetings by phone the family confiscated their staff s passports and put to them work on short term tourist visas repeatedly obtained on false pretenses prosecutors say ajay hinduja rejected that accusation and said the employees had contracts endorsed by the swiss embassy in india and their visas were regularly renewed by geneva cantonal authorities judge sabina mascotto immediately rebutted that characterization of events saying checks showed the staff lacked the correct swiss paperwork instead they only ever had french issued schengen zone visas referring to the european travel area which allows people to move without passport checks ajay hinduja said his staff were allowed to come and go from the house as they pleased provided at least one of them was home at all times for security reasons asked about their salaries which prosecutors say never amounted to more than a few hundred swiss francs a month a fraction of local wages he said it was the hinduja group s hr department that did all hiring and contracts not him on monday evening he said his lawyers and those for the three plaintiffs were close to reaching a deal that would see the staff withdraw their complaints but even if an accord is reached it should still mean the criminal trial will proceed that all the staff recruitment was done from india was a consistent refrain from the \u003cFIVE_TEN\u003e year old who sits on the board of the hinduja group one of india s largest conglomerates regret his one regret he testified was that he didn t get more involved in the running of the household after his parents were convicted of minor infractions after being denounced at an employment tribunal in \u003cTWO_THOUSAND\u003e i regret not having analyzed the situation more closely he said in part because he was so busy with his own work i had confidence in our legal advisers he said the trial only got underway monday after the hindujas secured a postponement citing the inability of the parents to travel because of poor health the lawyers then sought to have the judge recused citing alleged bias and to have the case sent back for re examination both requests were rejected","timestamp":"2024-06-12T06:45:00+05:30","market_timestamp":"2024-06-12T09:15:00+05:30","off_market_hours":true}