{"url":"https://www.moneycontrol.com/news/business/india-set-for-decade-high-2-billion-bond-inflows-around-jpmorgan-index-inclusion-day-12751967.html","title":"India set for decade-high $2 billion bond inflows around JPMorgan index inclusion day","description":"The $2 billion, single-day inflow estimate by four bankers trails only the record-high $2.7 billion poured into Indian bonds on Aug. 20, 2014, as prospects of a credit rating upgrade gained traction.India set for decade-high $2 billion bond inflows around JPMorgan index inclusion dayRelated stories","content":"Foreign inflows into Indian bonds will hit a decade-high of $2 billion around June 28, when they will be included in a widely-tracked JPMorgan index, although the central bank will lap up most of the dollars to avoid a knee-jerk rise in the rupee, bankers said. The $2 billion, single-day inflow estimate by four bankers trails only the record-high $2.7 billion poured into Indian bonds on Aug. 20, 2014, as prospects of a credit rating upgrade gained traction. More than $200 billion in assets track the JPMorgan Emerging Market Index in which India will eventually have a weight of 10% by March 2025, suggesting total passive inflows of at least $20 billion over the 10-month period. \"It's just a case of inflows, this time in debt instead of equities,\" the source said. \"It might be positive for the rupee and might be positive for FX reserves as well.\" The source and the bankers requested anonymity as they are not authorised to speak to the media. The RBI did not immediately respond to an email seeking comment. Since the rupee's real effective exchange rate -- a gauge of its relative value against a basket of currencies -- is signaling it is moderately over-valued, the RBI is wary of any significant appreciation, the source said. So, while front-running in anticipation of the inflows may boost the rupee, a large rally is unlikely given the central bank's grip on the currency, the bankers said. The RBI has said it will continue to boost its forex reserves opportunistically, which, in turn, helps avoid a sudden surge in the rupee. Since there is no precedent for these debt index-related inflows, bankers' estimates of the timing of flows are based on similar index adjustments in the equity markets. \"Obviously, all this is a first and you can't be sure how things will be,\" the head of trading at a large foreign bank cautioned. \"However, based on how portfolio flows related to (equity) rebalancing happen, the money will come in on (June) 27 or 28.\" In anticipation, large foreign banks could look at building short dollar/rupee positions to help manage inflows when they happen, an FX trader at a foreign bank said. Still, despite the best-laid plans, concerns persist. As a senior banker at a large foreign bank said: \"all the pipes that have been put in place might not work.\" ","cleaned_content":"foreign inflows into indian bonds will hit a decade high of \u003cTWO_\u003e billion around june \u003cTWO_TEN\u003e when they will be included in a widely tracked jpmorgan index although the central bank will lap up most of the dollars to avoid a knee jerk rise in the rupee bankers said the \u003cTWO_\u003e billion single day inflow estimate by four bankers trails only the record high \u003cTWO_\u003e billion poured into indian bonds on aug \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e as prospects of a credit rating upgrade gained traction more than \u003cTWO_HUNDRED\u003e billion in assets track the jpmorgan emerging market index in which india will eventually have a weight of \u003cONE_TEN_PERCENT\u003e by march \u003cTWO_THOUSAND\u003e suggesting total passive inflows of at least \u003cTWO_TEN\u003e billion over the \u003cONE_TEN\u003e month period its just a case of inflows this time in debt instead of equities the source said it might be positive for the rupee and might be positive for fx reserves as well the source and the bankers requested anonymity as they are not authorised to speak to the media the rbi did not immediately respond to an email seeking comment since the rupees real effective exchange rate a gauge of its relative value against a basket of currencies is signaling it is moderately over valued the rbi is wary of any significant appreciation the source said so while front running in anticipation of the inflows may boost the rupee a large rally is unlikely given the central banks grip on the currency the bankers said the rbi has said it will continue to boost its forex reserves opportunistically which in turn helps avoid a sudden surge in the rupee since there is no precedent for these debt index related inflows bankers estimates of the timing of flows are based on similar index adjustments in the equity markets obviously all this is a first and you cant be sure how things will be the head of trading at a large foreign bank cautioned however based on how portfolio flows related to equity rebalancing happen the money will come in on june \u003cTWO_TEN\u003e or \u003cTWO_TEN\u003e in anticipation large foreign banks could look at building short dollar rupee positions to help manage inflows when they happen an fx trader at a foreign bank said still despite the best laid plans concerns persist as a senior banker at a large foreign bank said all the pipes that have been put in place might not work","timestamp":"2024-06-19T14:51:00+05:30","market_timestamp":"2024-06-19T14:51:00+05:30","off_market_hours":false}