{"url":"https://www.moneycontrol.com/news/business/zomato-says-talks-on-with-paytm-over-movie-ticketing-business-but-no-binding-deal-yet-12750044.html","title":"Zomato says talks on with Paytm over movie ticketing business, but no binding deal yet","description":"A clarification from Zomato came after media reports said talks over the Rs 1,500-crore deal with One97 Communications were in advanced stages ZomatoRelated stories","content":"Food delivery giant Zomato on June 16 clarified through a communication to the exchanges that it is in discussion to acquire Paytm's movie ticketing and events business. The clarification came after media reports said negotiations over a Rs 1,500-crore deal between One97 Communications Ltd, the parent company of Paytm, and Zomato were in advanced stages. \"We acknowledge that we are in discussions with Paytm for the transaction, however, no binding decision has been taken at this stage that would warrant a Board approval and subsequent disclosure in accordance with applicable law,\" Zomato said in the statement. Zomato's interest in Paytm’s events and movie ticketing business is a strategic fit, complementing its broader aim to capture consumer demand across various categories, including food, grocery, and entertainment. A successful sale would enable Paytm to concentrate on travel, deals, and cashback—sectors crucial for expanding its merchant base and boosting overall sales. Also Read | Blinkit to receive Rs 300 crore from parent company Zomato ","cleaned_content":"food delivery giant zomato on june \u003cONE_TEN\u003e clarified through a communication to the exchanges that it is in discussion to acquire paytms movie ticketing and events business the clarification came after media reports said negotiations over a rs \u003cONE_THOUSAND\u003e crore deal between one97 communications ltd the parent company of paytm and zomato were in advanced stages we acknowledge that we are in discussions with paytm for the transaction however no binding decision has been taken at this stage that would warrant a board approval and subsequent disclosure in accordance with applicable law zomato said in the statement zomatos interest in paytm s events and movie ticketing business is a strategic fit complementing its broader aim to capture consumer demand across various categories including food grocery and entertainment a successful sale would enable paytm to concentrate on travel deals and cashback sectors crucial for expanding its merchant base and boosting overall sales also read blinkit to receive rs \u003cTHREE_HUNDRED\u003e crore from parent company zomato","timestamp":"2024-06-17T08:10:00+05:30","market_timestamp":"2024-06-17T09:15:00+05:30","off_market_hours":true}