{"url":"https://www.moneycontrol.com/news/business/salesforce-launches-public-sector-division-in-india-unveils-made-for-india-digital-lending-solution-12751862.html","title":"Salesforce launches public sector division in India; unveils Made-for-India digital lending solution","description":"The company also highlighted insights from an (International Data Corporation) IDC study, which indicated that the Salesforce economy is expanding, with AI accelerating its growth trajectory.Salesforce launches public sector division in India; unveils Made-for-India digital lending solutionRelated stories","content":"Salesforce on Wednesday announced the launch of its public sector division in India to tap into the booming market and unveiled its digital lending offering tailored to Indian needs, as the enterprise software giant underlined its firm commitment to the market here. The company also highlighted insights from an (International Data Corporation) IDC study, which indicated that the Salesforce economy is expanding, with AI accelerating its growth trajectory. The IDC study forecasts that Salesforce and its ecosystem of customers and partners in India are expected to create a net gain of 1.8 million new jobs and generate USD 88.6 billion in new revenues from 2022 to 2028. \"India has talent and capability and now we are seeing far quicker adoption,\" she said at a media briefing. India is an \"outlier\" in digital adoption, and while digital transformation has been on the agenda of companies there is now a sense of \"urgency\" due to the advent of generative AI. The movement now is to get the right technology tools to scale business faster, she said. Salesforce has announced the launch of its Public Sector division in India which aims to enable government agencies and public sector organisations to transform citizen experiences with Salesforce technology. Salesforce also announced the upcoming availability of a digital lending solution for India that will provide banks and lenders with a platform to digitally approach consumer lending, while potentially reducing the cost and burden of maintaining disconnected, outdated platforms. \"Digital Lending for India will exclusively serve customers within the country,\" the company said elaborating on Salesforce's Made-for-India product. The platform may be integrated with banking and financial data with customer data from Salesforce. \"Built on Salesforce's Financial Services Cloud platform, this integration provides a single view of the customer information for loan application processing and helps lead to faster processing and approvals,\" the release said. ","cleaned_content":"salesforce on wednesday announced the launch of its public sector division in india to tap into the booming market and unveiled its digital lending offering tailored to indian needs as the enterprise software giant underlined its firm commitment to the market here the company also highlighted insights from an international data corporation idc study which indicated that the salesforce economy is expanding with ai accelerating its growth trajectory the idc study forecasts that salesforce and its ecosystem of customers and partners in india are expected to create a net gain of \u003cONE_\u003e million new jobs and generate usd \u003cEIGHT_TEN\u003e billion in new revenues from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e india has talent and capability and now we are seeing far quicker adoption she said at a media briefing india is an outlier in digital adoption and while digital transformation has been on the agenda of companies there is now a sense of urgency due to the advent of generative ai the movement now is to get the right technology tools to scale business faster she said salesforce has announced the launch of its public sector division in india which aims to enable government agencies and public sector organisations to transform citizen experiences with salesforce technology salesforce also announced the upcoming availability of a digital lending solution for india that will provide banks and lenders with a platform to digitally approach consumer lending while potentially reducing the cost and burden of maintaining disconnected outdated platforms digital lending for india will exclusively serve customers within the country the company said elaborating on salesforces made for india product the platform may be integrated with banking and financial data with customer data from salesforce built on salesforces financial services cloud platform this integration provides a single view of the customer information for loan application processing and helps lead to faster processing and approvals the release said","timestamp":"2024-06-19T13:41:00+05:30","market_timestamp":"2024-06-19T13:41:00+05:30","off_market_hours":false}