{"url":"https://www.moneycontrol.com/news/business/more-than-50-indian-households-downing-soft-drinks-to-increase-with-intensifying-heat-report-12753503.html","title":"More than 50% Indian households downing soft drinks; to increase with intensifying heat: Report","description":"According to the latest Kantar FMCG pulse report, this trend is expected to rise further with intensifying summer.More than 50% Indian households downing soft drinks; to increase with intensifying heat: ReportRelated stories","content":"The average Indian household's consumption of bottled soft drinks has increased in the last two years, breaching annual penetration of 50 per cent in FY24, a report said. According to the latest Kantar FMCG pulse report, this trend is expected to rise further with intensifying summer. It said the average household has expanded its consumption of bottled soft drinks by 250 ml in the last two years. Besides, washing liquids, another premium laundry product introduced by leading FMCG majors, breached the 100,000-tonne mark in FY24. All these trends are \"record breakers\", the report noted. The bottled soft drink category had a \"massive 41 per cent household growth in MAT (moving annual total) March 2023\" and continued to add more households and expanded 19 per cent in MAT March 2024. \"With the intensifying summer, the category is likely to continue its growth this year too,\" it said. On the consumption, the report said now consumers shop FMCG products 156 times a year, or every 56 hours from online or offline channels. However, it also added that the average basket value has gone down as shoppers are no longer buying more packs as they were purchasing earlier. \"The frequency and the pack trends indicate that shoppers are no longer reducing their pack sizes, but holding on to the ones they are buying. In other words, we are very likely at the juncture where we see shoppers buying slightly bigger packs from now on,\" it said. Now discretionary premium-end categories like washing liquids and indulgent products such as bottled soft drinks have performed exceedingly well. Still, groceries are the biggest household expense, accounting for over 24 per cent of all quarterly expenses in a household, it added. The report also highlighted that though inflation might have slowed to acceptable levels, its effects are not lost on the consumer. \"The worst of inflation is behind us, however, there are pockets of the market that are still under some stress...the shopper is looking at the future with great optimism, even those who are under stress, and this optimism has been the flag bearer of the Indian consumption story for long now,\" it said. ","cleaned_content":"the average indian households consumption of bottled soft drinks has increased in the last two years breaching annual penetration of \u003cFIVE_TEN_PERCENT\u003e in fy24 a report said according to the latest kantar fmcg pulse report this trend is expected to rise further with intensifying summer it said the average household has expanded its consumption of bottled soft drinks by \u003cTWO_HUNDRED\u003e ml in the last two years besides washing liquids another premium laundry product introduced by leading fmcg majors breached the \u003cONE_HUNDRED_THOUSAND\u003e tonne mark in fy24 all these trends are record breakers the report noted the bottled soft drink category had a massive \u003cFOUR_TEN_PERCENT\u003e household growth in mat moving annual total march \u003cTWO_THOUSAND\u003e and continued to add more households and expanded \u003cONE_TEN_PERCENT\u003e in mat march \u003cTWO_THOUSAND\u003e with the intensifying summer the category is likely to continue its growth this year too it said on the consumption the report said now consumers shop fmcg products \u003cONE_HUNDRED\u003e times a year or every \u003cFIVE_TEN\u003e hours from online or offline channels however it also added that the average basket value has gone down as shoppers are no longer buying more packs as they were purchasing earlier the frequency and the pack trends indicate that shoppers are no longer reducing their pack sizes but holding on to the ones they are buying in other words we are very likely at the juncture where we see shoppers buying slightly bigger packs from now on it said now discretionary premium end categories like washing liquids and indulgent products such as bottled soft drinks have performed exceedingly well still groceries are the biggest household expense accounting for over \u003cTWO_TEN_PERCENT\u003e of all quarterly expenses in a household it added the report also highlighted that though inflation might have slowed to acceptable levels its effects are not lost on the consumer the worst of inflation is behind us however there are pockets of the market that are still under some stress the shopper is looking at the future with great optimism even those who are under stress and this optimism has been the flag bearer of the indian consumption story for long now it said","timestamp":"2024-06-21T12:01:00+05:30","market_timestamp":"2024-06-21T12:01:00+05:30","off_market_hours":false}