{"url":"https://www.moneycontrol.com/news/business/reliances-jio-platforms-clears-hurdle-in-bid-to-launch-satellite-internet-in-india-12747834.html","title":"Reliance's Jio Platforms clears hurdle in bid to launch satellite internet in India","description":"The three approvals issued to Orbit Connect India - which aims to provide satellite-based high-speed internet access - come as companies from Amazon.com to Elon Musk's Starlink have been vying for the go-ahead to launch satellite communication services in the world's most populous nation.Reliance's Jio Platforms clears hurdle in bid to launch satellite internet in IndiaRelated stories","content":"A joint venture between Reliance Industries' Jio Platforms and Luxembourg-based SES to provide gigabit fibre internet has won approval from the Indian space regulator to operate satellites there, a government executive said. The three approvals issued to Orbit Connect India - which aims to provide satellite-based high-speed internet access - come as companies from Amazon.com to Elon Musk's Starlink have been vying for the go-ahead to launch satellite communication services in the world's most populous nation. The authorisations have not been previously reported. They were granted in April and June from the Indian National Space Promotion and Authorisation Centre, known as IN-SPACe. These allow Orbit Connect to operate satellites above India, but further approvals are needed by the country's department of telecoms to begin operations. Inmarsat, another company hoping to provide high-speed satellite-based internet, has also gotten approval to operate satellites over India, IN-SPACe chairman Pawan Goenka told Reuters. Two other companies, Elon Musk's Starlink and Amazon.com's Kuiper, have applied. Eutelsat's Bharti Enterprises-backed OneWeb was given all of its approvals late last year. India's satellite broadband service market is expected to grow 36% per year over the next five years and reach $1.9 billion by 2030, according to the consultancy Deloitte. Globally, the race to connect rural areas of the world via space-based internet is accelerating. Amazon plans to invest $10 billion in Kuiper, which was announced in 2019, the year SpaceX began deploying its first operational Starlink satellites. Last week, Sri Lanka gave Starlink preliminary approval to provide internet services there. Goenka said the more companies were involved in the sector in India, the better off consumers would be. \"Comparatively low pricing of communication services in India will compel global players to drive innovation to reduce their pricing,\" said Goenka, the former managing director of automaker Mahindra \u0026 Mahindra. \"This is already being done in many industries like automotive, where multinational OEMs had to innovate to meet the expectations of Indian consumers of high performance and low cost.\" IN-SPACe will also soon authorise private companies to operate ground stations, he said, which would enable satellite operators to download data as they pass over India. Prime Minister Modi's government, which just won a rare third term, has been pushing the development of India's space industry. This year, it opened the gates for foreign direct investment in the sector, saying outside companies could invest in the manufacture of components and systems or sub-systems for satellites up to 100% without approval. As a result, investors' interest has \"significantly increased\", Goenka said. \"Last year investments into private companies were $2 million-$7 million. This year they are talking $20 million-$30 million,\" he said. \"The proof of concept has happened.\" Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"a joint venture between reliance industries jio platforms and luxembourg based ses to provide gigabit fibre internet has won approval from the indian space regulator to operate satellites there a government executive said the three approvals issued to orbit connect india which aims to provide satellite based high speed internet access come as companies from amazon com to elon musks starlink have been vying for the go ahead to launch satellite communication services in the worlds most populous nation the authorisations have not been previously reported they were granted in april and june from the indian national space promotion and authorisation centre known as in space these allow orbit connect to operate satellites above india but further approvals are needed by the countrys department of telecoms to begin operations inmarsat another company hoping to provide high speed satellite based internet has also gotten approval to operate satellites over india in space chairman pawan goenka told reuters two other companies elon musks starlink and amazon coms kuiper have applied eutelsats bharti enterprises backed oneweb was given all of its approvals late last year indias satellite broadband service market is expected to grow \u003cTHREE_TEN_PERCENT\u003e per year over the next five years and reach \u003cONE_\u003e billion by \u003cTWO_THOUSAND\u003e according to the consultancy deloitte globally the race to connect rural areas of the world via space based internet is accelerating amazon plans to invest \u003cONE_TEN\u003e billion in kuiper which was announced in \u003cTWO_THOUSAND\u003e the year spacex began deploying its first operational starlink satellites last week sri lanka gave starlink preliminary approval to provide internet services there goenka said the more companies were involved in the sector in india the better off consumers would be comparatively low pricing of communication services in india will compel global players to drive innovation to reduce their pricing said goenka the former managing director of automaker mahindra mahindra this is already being done in many industries like automotive where multinational oems had to innovate to meet the expectations of indian consumers of high performance and low cost in space will also soon authorise private companies to operate ground stations he said which would enable satellite operators to download data as they pass over india prime minister modis government which just won a rare third term has been pushing the development of indias space industry this year it opened the gates for foreign direct investment in the sector saying outside companies could invest in the manufacture of components and systems or sub systems for satellites up to \u003cONE_HUNDRED_PERCENT\u003e without approval as a result investors interest has significantly increased goenka said last year investments into private companies were \u003cTWO_\u003e million \u003cSEVEN_\u003e million this year they are talking \u003cTWO_TEN\u003e million \u003cTHREE_TEN\u003e million he said the proof of concept has happened disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-06-13T13:52:00+05:30","market_timestamp":"2024-06-13T13:52:00+05:30","off_market_hours":false}