{"url":"https://www.moneycontrol.com/news/business/steelmaker-arcelor-nippon-says-indias-plan-for-raw-material-curbs-ignores-red-sea-crisis-12753566.html","title":"Steelmaker Arcelor-Nippon says India's plan for raw material curbs ignores Red Sea crisis","description":"The curbs planned by the world's second-biggest producer of crude steel could hit output, as they cap imports of a steelmaking fuel, low ash metallurgical coke, also known as met coke, at 2.85 million metric tons for a year.Steelmaker Arcelor-Nippon says India's plan for raw material curbs ignores Red Sea crisisRelated stories","content":"ArcelorMittal's India joint venture has privately warned trade officials in New Delhi that a plan to curb imports of a key raw material for steelmaking overlooks the implications of the Red Sea crisis, a letter showed. The curbs planned by the world's second-biggest producer of crude steel could hit output, as they cap imports of a steelmaking fuel, low ash metallurgical coke, also known as met coke, at 2.85 million metric tons for a year. The April proposal, which came after growing shipments caused \"serious injury\" to domestic producers, also recommended setting quotas on met coke for exporting nations. Quotas envisioned for European countries under the plan \"will very seriously affect\" imports from the region, it added. The company, India's commerce ministry and the trade remedies body did not respond to requests for comment. No date has yet been set for the proposal, now being reviewed by the commerce ministry, to take effect. India's plan to allot about 40% import quota to European nations will affect ArcelorMittal Nippon Steel India (AM/NS India) as the Red Sea crisis has already forced rerouting of vessels, and boosted ocean shipping rates, the company said. The company does not use domestic met coke. India's imports oMost Usedf the fuel have more than doubled over the past four years, and its top suppliers include Poland and Switzerland, as well as China and Indonesia. Attacks on ships in the Red Sea by Yemen's Iran-aligned Houthi militants are disrupting trade, with freight firms switching to routes around the Cape of Good Hope to avoid the Suez Canal. India must reconsider the proposal as it could hit the steel industry, the company, which has not commented on the matter publicly, urged in its letter. This month, Reuters reported that India's steel ministry also did not favour limits on imports of met coke, citing risks to domestic output. In its letter, AM/NS India said authorities proposing the curbs did not factor in the prospect of increased demand for met coke as steelmakers plan to add capacity. \"The quantiative restraint on imports will reduce the ability for the steel industry to raise its capacity and growth levels,\" it added. One of India's leading steelmakers, with annual capacity of about 9 million metric tons, AM/NS India competes with JSW Steel Ltd and Tata Steel Ltd. ","cleaned_content":"arcelormittals india joint venture has privately warned trade officials in new delhi that a plan to curb imports of a key raw material for steelmaking overlooks the implications of the red sea crisis a letter showed the curbs planned by the worlds second biggest producer of crude steel could hit output as they cap imports of a steelmaking fuel low ash metallurgical coke also known as met coke at \u003cTWO_\u003e million metric tons for a year the april proposal which came after growing shipments caused serious injury to domestic producers also recommended setting quotas on met coke for exporting nations quotas envisioned for european countries under the plan will very seriously affect imports from the region it added the company indias commerce ministry and the trade remedies body did not respond to requests for comment no date has yet been set for the proposal now being reviewed by the commerce ministry to take effect indias plan to allot about \u003cFOUR_TEN_PERCENT\u003e import quota to european nations will affect arcelormittal nippon steel india am ns india as the red sea crisis has already forced rerouting of vessels and boosted ocean shipping rates the company said the company does not use domestic met coke indias imports omost usedf the fuel have more than doubled over the past four years and its top suppliers include poland and switzerland as well as china and indonesia attacks on ships in the red sea by yemens iran aligned houthi militants are disrupting trade with freight firms switching to routes around the cape of good hope to avoid the suez canal india must reconsider the proposal as it could hit the steel industry the company which has not commented on the matter publicly urged in its letter this month reuters reported that indias steel ministry also did not favour limits on imports of met coke citing risks to domestic output in its letter am ns india said authorities proposing the curbs did not factor in the prospect of increased demand for met coke as steelmakers plan to add capacity the quantiative restraint on imports will reduce the ability for the steel industry to raise its capacity and growth levels it added one of indias leading steelmakers with annual capacity of about \u003cNINE_\u003e million metric tons am ns india competes with jsw steel ltd and tata steel ltd","timestamp":"2024-06-21T12:40:00+05:30","market_timestamp":"2024-06-21T12:40:00+05:30","off_market_hours":false}