{"url":"https://www.moneycontrol.com/news/business/embassy-group-hospitality-firm-olive-clocks-76-revenue-growth-in-fy24-to-rs-51-cr-12744929.html","title":"Embassy Group hospitality firm Olive clocks 76% revenue growth in FY24 to Rs 51 cr","description":"At present, Olive has 55 co-living centres and hotel properties, signed and operational, in Bengaluru, Mumbai and Goa. There are 2,688 keys in these properties.Embassy Group hospitality firm Olive clocks 76% revenue growth in FY24 to Rs 51 crRelated stories","content":"Olive, a hospitality management startup promoted by realty firm Embassy Group, clocked 76 per cent increase in revenue to Rs 51 crore during the last fiscal year on growing demand for both short-term and long-term accommodation facilities. At present, Olive has 55 co-living centres and hotel properties, signed and operational, in Bengaluru, Mumbai and Goa. There are 2,688 keys in these properties. The company runs four brands Olive Life, Olive Zip, Olive Hotel, and Villa Olive ranging from co-living and budget stays to luxury resorts, hotels, and villas. \"For financial year 2022-23 we had achieved a portfolio revenue of Rs 29 crore. In 2023-24, we had a 75.86 per cent jump in revenue to Rs 51 crore,\" Olive co-founder and CEO Kahraman Yigit said. He attributed the growth in revenue to expansion of portfolio as well as price realisation per room. \"Our vision is to organize \u0026 institutionalize the accommodation market in India and beyond,\" Yigit said. He said the demand for premium living space is rising, both for short-term and long-term stays. Yigit noted that the co-living as well as hospitality businesses have bounced back post COVID pandemic. The company has 25 operational properties and 1,402 keys under Olive Hotels brand which cater to affluent travellers with a wide range of rooms and amenities. Under brand Olive Life, which targets students and young professionals in Tier 1, 2, and 3 cities with stays of three months or more, the company has 9 properties with 431 keys. The company has 20 properties and 839 keys under brand Olive Zip that provides budget-friendly daily stays for budget-conscious travellers in similar locations. Under brand Villa by Olive, which offers luxurious experiences in leisure destinations, the company has 1 property and 16 keys. \"We are looking to expand in new markets across all our four brands. We are also considering raising funds for expansion,\" Yigit said. In April, Olive, formed in 2019, appointed Dhruv Kalro as its co-founder. Embassy Group owns 70 per cent stake in Olive while the other two co-founders hold the remaining stake. The group was a sponsor of India's first publicly listed Real Estate Investment Trust (REIT). It also runs co-working firm WeWork India. ","cleaned_content":"olive a hospitality management startup promoted by realty firm embassy group clocked \u003cSEVEN_TEN_PERCENT\u003e increase in revenue to rs \u003cFIVE_TEN\u003e crore during the last fiscal year on growing demand for both short term and long term accommodation facilities at present olive has \u003cFIVE_TEN\u003e co living centres and hotel properties signed and operational in bengaluru mumbai and goa there are \u003cTWO_THOUSAND\u003e keys in these properties the company runs four brands olive life olive zip olive hotel and villa olive ranging from co living and budget stays to luxury resorts hotels and villas for financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e we had achieved a portfolio revenue of rs \u003cTWO_TEN\u003e crore in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e we had a \u003cSEVEN_TEN_PERCENT\u003e jump in revenue to rs \u003cFIVE_TEN\u003e crore olive co founder and ceo kahraman yigit said he attributed the growth in revenue to expansion of portfolio as well as price realisation per room our vision is to organize institutionalize the accommodation market in india and beyond yigit said he said the demand for premium living space is rising both for short term and long term stays yigit noted that the co living as well as hospitality businesses have bounced back post covid pandemic the company has \u003cTWO_TEN\u003e operational properties and \u003cONE_THOUSAND\u003e keys under olive hotels brand which cater to affluent travellers with a wide range of rooms and amenities under brand olive life which targets students and young professionals in tier \u003cONE_\u003e \u003cTWO_\u003e and \u003cTHREE_\u003e cities with stays of three months or more the company has \u003cNINE_\u003e properties with \u003cFOUR_HUNDRED\u003e keys the company has \u003cTWO_TEN\u003e properties and \u003cEIGHT_HUNDRED\u003e keys under brand olive zip that provides budget friendly daily stays for budget conscious travellers in similar locations under brand villa by olive which offers luxurious experiences in leisure destinations the company has \u003cONE_\u003e property and \u003cONE_TEN\u003e keys we are looking to expand in new markets across all our four brands we are also considering raising funds for expansion yigit said in april olive formed in \u003cTWO_THOUSAND\u003e appointed dhruv kalro as its co founder embassy group owns \u003cSEVEN_TEN_PERCENT\u003e stake in olive while the other two co founders hold the remaining stake the group was a sponsor of indias first publicly listed real estate investment trust reit it also runs co working firm wework india","timestamp":"2024-06-10T13:51:00+05:30","market_timestamp":"2024-06-10T13:51:00+05:30","off_market_hours":false}