{"url":"https://www.moneycontrol.com/news/business/byjus-hedge-fund-ally-can-avoid-arrest-if-he-answers-questions-12746350.html","title":"Byju’s hedge fund ally can avoid arrest if he answers questions","description":"US Bankruptcy Judge John Dorsey, during a court hearing Tuesday in Wilmington, Delaware, agreed to drop an arrest order for William C. Morton, the founder of Camshaft Fund. Byju’s invested $533 million of loan proceeds with the fund last year, according to court records.Byju’s hedge fund ally can avoid arrest if he answers questionsRelated stories","content":"A federal judge moved to untangle the complex bankruptcy case of a Byju’s unit by offering to rule out the arrest of a Florida hedge fund manager if he helps locate $533 million that the Indian tech company allegedly tried to hide. US Bankruptcy Judge John Dorsey, during a court hearing Tuesday in Wilmington, Delaware, agreed to drop an arrest order for William C. Morton, the founder of Camshaft Fund. Byju’s invested $533 million of loan proceeds with the fund last year, according to court records. The money was later moved to a UK lender and then to an unnamed, non-US entity affiliated with Byju’s. Lenders are trying to use the bankruptcy case of a Byju’s unit based in the US to recover the cash. “We need to move this case forward somehow,” Dorsey said. The missing money is at the heart of a dispute between lenders owed $1.2 billion and the startup founded by entrepreneur Byju Raveendran. The education-tech company’s official name is Think \u0026 Learn Pvt. The cash belongs to a bankrupt shell company, Byju’s Alpha Inc., which is affiliated with Think \u0026 Learn and was taken over by the lenders after their loan defaulted. Morton’s attorney, Pieter Van Tol, told Dorsey on Tuesday that the money manager, who is in his 20s, is willing to answer questions under oath and cooperate with lenders. Morton had previously refused to speak with lenders in Miami, where his hedge fund is based, “because of fear of arrest,” Van Tol said in court. Van Tol declined to comment further after the hearing. Read More: Byju’s Hedge Fund Ally Faces Jail Time Over Missing $533 Million The US bankruptcy case is BYJU’s Alpha Inc., 24-10140, US Bankruptcy Court District of Delaware (Wilmington). ","cleaned_content":"a federal judge moved to untangle the complex bankruptcy case of a byju s unit by offering to rule out the arrest of a florida hedge fund manager if he helps locate \u003cFIVE_HUNDRED\u003e million that the indian tech company allegedly tried to hide us bankruptcy judge john dorsey during a court hearing tuesday in wilmington delaware agreed to drop an arrest order for william c morton the founder of camshaft fund byju s invested \u003cFIVE_HUNDRED\u003e million of loan proceeds with the fund last year according to court records the money was later moved to a uk lender and then to an unnamed non us entity affiliated with byju s lenders are trying to use the bankruptcy case of a byju s unit based in the us to recover the cash we need to move this case forward somehow dorsey said the missing money is at the heart of a dispute between lenders owed \u003cONE_\u003e billion and the startup founded by entrepreneur byju raveendran the education tech company s official name is think learn pvt the cash belongs to a bankrupt shell company byju s alpha inc which is affiliated with think learn and was taken over by the lenders after their loan defaulted morton s attorney pieter van tol told dorsey on tuesday that the money manager who is in his \u003cTWO_TEN\u003e s is willing to answer questions under oath and cooperate with lenders morton had previously refused to speak with lenders in miami where his hedge fund is based because of fear of arrest van tol said in court van tol declined to comment further after the hearing read more byju s hedge fund ally faces jail time over missing \u003cFIVE_HUNDRED\u003e million the us bankruptcy case is byju s alpha inc \u003cTWO_TEN\u003e \u003cONE_TEN_THOUSAND\u003e us bankruptcy court district of delaware wilmington","timestamp":"2024-06-12T06:50:00+05:30","market_timestamp":"2024-06-12T09:15:00+05:30","off_market_hours":true}