{"url":"https://www.moneycontrol.com/news/business/aditya-birla-group-to-invest-50-million-in-manufacturing-rd-center-in-texas-12756507.html","title":"Aditya Birla Group to invest $50 million in manufacturing, R\u0026D center in Texas","description":"Aditya Birla Group's Vice President of Sales and Marketing Scott Bastion said the company will be making a USD 50-million investment outside of Houston in the city of Beaumont, Texas, where it will produce epoxy resins -- that are used in a variety of consumer and industrial products.Aditya Birla Group to invest $50 million in manufacturing, R\u0026D center in TexasRelated stories","content":"Aditya Birla Group has announced an investment of USD 50 million in a manufacturing and research and development (R\u0026D) center in Texas. Aditya Birla Group's Vice President of Sales and Marketing Scott Bastion said the company will be making a USD 50-million investment outside of Houston in the city of Beaumont, Texas, where it will produce epoxy resins -- that are used in a variety of consumer and industrial products. \"In that site, we will have an application development center and will house an R\u0026D team. We look forward to commissioning that site in the next 15 to 20 months. Aditya Birla Group already has a foundation in India, Thailand, as well as Europe. \"This will be the fourth expansion on behalf of the epoxy business into the USA. This is the first phase of our expansion of a 35-acre site, which we hope to have additional phases in coming years,\" he said. Arun Venkataraman, the assistant secretary of Commerce for Global Markets and director general of the US and Foreign Commercial Service said Aditya Birla Group's plans to establish a state-of-the-art manufacturing and R\u0026D center in Texas is a \"testament to America's commitment to attracting the most innovative businesses.\" \"Aditya Birla Group's foresight in ensuring that their manufacturing facility brings greener, more sustainable and performance-oriented solutions underscore exactly what corporate environmental responsibility is. \"Consumers continue to seek out ecofriendly options and we look forward to seeing Aditya Birla Group become a local leader in the greenification of the epoxy industry,\" Venkataraman said on the sidelines of the Select USA Summit which is being attended by more than 250 businesses from India. ","cleaned_content":"aditya birla group has announced an investment of usd \u003cFIVE_TEN\u003e million in a manufacturing and research and development r d center in texas aditya birla groups vice president of sales and marketing scott bastion said the company will be making a usd \u003cFIVE_TEN\u003e million investment outside of houston in the city of beaumont texas where it will produce epoxy resins that are used in a variety of consumer and industrial products in that site we will have an application development center and will house an r d team we look forward to commissioning that site in the next \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e months aditya birla group already has a foundation in india thailand as well as europe this will be the fourth expansion on behalf of the epoxy business into the usa this is the first phase of our expansion of a \u003cTHREE_TEN\u003e acre site which we hope to have additional phases in coming years he said arun venkataraman the assistant secretary of commerce for global markets and director general of the us and foreign commercial service said aditya birla groups plans to establish a state of the art manufacturing and r d center in texas is a testament to americas commitment to attracting the most innovative businesses aditya birla groups foresight in ensuring that their manufacturing facility brings greener more sustainable and performance oriented solutions underscore exactly what corporate environmental responsibility is consumers continue to seek out ecofriendly options and we look forward to seeing aditya birla group become a local leader in the greenification of the epoxy industry venkataraman said on the sidelines of the select usa summit which is being attended by more than \u003cTWO_HUNDRED\u003e businesses from india","timestamp":"2024-06-26T12:18:00+05:30","market_timestamp":"2024-06-26T12:18:00+05:30","off_market_hours":false}