{"url":"https://www.moneycontrol.com/news/business/25-of-new-hires-are-married-women-nearly-70-of-workforce-are-women-foxconn-12757281.html","title":"25% of new hires at Tamil Nadu plant are married women, clarifies iPhone maker Foxconn","description":"In an informal note shared with the government after reports suggested it is not hiring married women, Foxconn stated that such stipulations are not part of its policy and these claims may have been made by those individuals who were not hired, sources said.25% of new hires are married women; nearly 70% of workforce are women: FoxconnRelated stories","content":"Apple'S iPhone maker Foxconn on June 27 informed the Central government that around 25 percent its new employees are married women and its safety protocol, which requires everyone to avoid wearing metal irrespective of gender or religion, is not discriminatory, sources familiar with the matter said. The Taiwanese company shared an informal note with the government after reports suggested it is not hiring married women. The company said that such stipulations are not part of its policy and these claims may have been made by those disgruntled individuals who were not hired, sources said. They added that such media reports malign the fast-growing Indian manufacturing sector. \"Foxconn had clarified that 25 percent of the latest hires are married women. This would mean nearly one-third of the total women are married. This ratio compares favourably to any factory in this sector currently operating in India,\" one of the sources said. The Foxconn factory currently has about 70 percent women and 30 percent men and the Tamil Nadu plant is the largest factory for women employment in the country with the total employment having touched 45,000 workers during peak periods, they said. The company has also informed that the discussion around Hindu married women being discriminated against for wearing metals (ornaments and jewelry) is \"entirely slanted\" and wearing metal in such factories is a safety issue, a fact well recognised by both the industry and the government. \"Any person wearing metals - man or woman - regardless of their status (single or married) and their religion (Hindu, Muslim, Christian, Sikh etc.) are required to remove metals while working in the factory,\" the source said quoting the company's informal note. For safety reasons, no one wearing metal is allowed to work on the shop floor and this is a prevalent practice in several industries. According to sources, the company has stated that the media report is based on anecdotal comments by 5-10 people or potential job seekers. These comments likely came from candidates who did not get the job or no longer work at Foxconn. No immediate comments were received from Foxconn in response to an email query sent to the company on the matter. (With agency inputs) ","cleaned_content":"apples iphone maker foxconn on june \u003cTWO_TEN\u003e informed the central government that around \u003cTWO_TEN_PERCENT\u003e its new employees are married women and its safety protocol which requires everyone to avoid wearing metal irrespective of gender or religion is not discriminatory sources familiar with the matter said the taiwanese company shared an informal note with the government after reports suggested it is not hiring married women the company said that such stipulations are not part of its policy and these claims may have been made by those disgruntled individuals who were not hired sources said they added that such media reports malign the fast growing indian manufacturing sector foxconn had clarified that \u003cTWO_TEN_PERCENT\u003e of the latest hires are married women this would mean nearly one third of the total women are married this ratio compares favourably to any factory in this sector currently operating in india one of the sources said the foxconn factory currently has about \u003cSEVEN_TEN_PERCENT\u003e women and \u003cTHREE_TEN_PERCENT\u003e men and the tamil nadu plant is the largest factory for women employment in the country with the total employment having touched \u003cFOUR_TEN_THOUSAND\u003e workers during peak periods they said the company has also informed that the discussion around hindu married women being discriminated against for wearing metals ornaments and jewelry is entirely slanted and wearing metal in such factories is a safety issue a fact well recognised by both the industry and the government any person wearing metals man or woman regardless of their status single or married and their religion hindu muslim christian sikh etc are required to remove metals while working in the factory the source said quoting the companys informal note for safety reasons no one wearing metal is allowed to work on the shop floor and this is a prevalent practice in several industries according to sources the company has stated that the media report is based on anecdotal comments by \u003cFIVE_\u003e \u003cONE_TEN\u003e people or potential job seekers these comments likely came from candidates who did not get the job or no longer work at foxconn no immediate comments were received from foxconn in response to an email query sent to the company on the matter with agency inputs","timestamp":"2024-06-27T14:46:00+05:30","market_timestamp":"2024-06-27T14:46:00+05:30","off_market_hours":false}