{"url":"https://www.moneycontrol.com/news/business/bajaj-auto-manufacturing-plant-at-manaus-in-brazil-becomes-operational-12756471.html","title":"Bajaj Auto manufacturing plant at Manaus, in Brazil becomes operational","description":"Set up in the Northeastern city of Manaus in 9,600 sq meters of space and equipped with engine and vehicle assembly as well as testing facilities, the plant has a production capacity of 20,000 units per year on a single shift, Bajaj Auto Ltd said in a statement.Related stories","content":"Bajaj Auto on Wednesday announced the inauguration of a new production facility in Brazil, which will initially focus on the sourcing, assembly, and testing of Dominar models, with plans to expand to additional product lines. Set up in the Northeastern city of Manaus in 9,600 sq meters of space and equipped with engine and vehicle assembly as well as testing facilities, the plant has a production capacity of 20,000 units per year on a single shift, Bajaj Auto Ltd said in a statement. Bajaj Auto commenced work on the new manufacturing plant in June last year and the facility became production-ready within a year, it said. \"With the establishment of our own plant in Brazil, we have achieved a quantum shift in our local capability to fulfil demand. Our Dominar brand has received an outstanding reception since its launch 18 months ago. \"The new manufacturing capabilities will enable us to build a wider distribution network, introduce new products and meet growing expectations of our customers,' said Rakesh Sharma, Executive Director at Bajaj Auto Ltd. The Manaus plant has been designed with advanced, automated production lines and integrated quality control systems with multiple conveyor and transfer systems seamlessly connecting to various stages of manufacturing, Bajaj Auto said. \"Bajaj do Brasil has provided for plans to expand the facility further in due course to accommodate additional production capacity to up to 50,000 units per year. It has also integrated local suppliers and begun sourcing key motorcycle parts and components from within Manaus,\" the company said. ","cleaned_content":"bajaj auto on wednesday announced the inauguration of a new production facility in brazil which will initially focus on the sourcing assembly and testing of dominar models with plans to expand to additional product lines set up in the northeastern city of manaus in \u003cNINE_THOUSAND\u003e sq meters of space and equipped with engine and vehicle assembly as well as testing facilities the plant has a production capacity of \u003cTWO_TEN_THOUSAND\u003e units per year on a single shift bajaj auto ltd said in a statement bajaj auto commenced work on the new manufacturing plant in june last year and the facility became production ready within a year it said with the establishment of our own plant in brazil we have achieved a quantum shift in our local capability to fulfil demand our dominar brand has received an outstanding reception since its launch \u003cONE_TEN\u003e months ago the new manufacturing capabilities will enable us to build a wider distribution network introduce new products and meet growing expectations of our customers said rakesh sharma executive director at bajaj auto ltd the manaus plant has been designed with advanced automated production lines and integrated quality control systems with multiple conveyor and transfer systems seamlessly connecting to various stages of manufacturing bajaj auto said bajaj do brasil has provided for plans to expand the facility further in due course to accommodate additional production capacity to up to \u003cFIVE_TEN_THOUSAND\u003e units per year it has also integrated local suppliers and begun sourcing key motorcycle parts and components from within manaus the company said","timestamp":"2024-06-26T13:07:00+05:30","market_timestamp":"2024-06-26T13:07:00+05:30","off_market_hours":false}