{"url":"https://www.moneycontrol.com/news/business/kotak-mahindra-bank-to-add-up-to-200-branches-in-fy25-official-says-12754883.html","title":"Kotak Mahindra Bank to add up to 200 branches in FY25, official says","description":"In April, the Reserve Bank of India (RBI) stopped Kotak from adding new customers via its online and mobile banking channels, and from issuing new credit cards, due to information technology-related deficiencies.Kotak Mahindra Bank to add up to 200 branches in FY25, official saysRelated stories","content":"Kotak Mahindra Bank will increase its pace of opening new branches and add about 175 to 200 branches in the financial year 2024-25, a senior official at the bank said, months after the central bank barred the private lender from sourcing new customers digitally. In April, the Reserve Bank of India (RBI) stopped Kotak from adding new customers via its online and mobile banking channels, and from issuing new credit cards, due to information technology-related deficiencies. \"We have been adding roughly 150 odd branches for several years now. This year too, the momentum is going to continue,\" Virat Diwanji, group president and head - consumer bank, told Reuters in an email interview on Monday. Before the RBI's order, Kotak was heavily reliant on digital channels to source new clients. About 95% of its new personal loans by volume were disbursed digitally in the October-December quarter, while it issued 99% of new credit cards through digital channels. A similar breakup for the January-March quarter is not yet available. Kotak's branch addition plans may not immediately help source new customers, but the strategy may play out in the medium-to-longer term as it will increase its presence and reach, said Kranthi Baithini, director of equity strategy at WealthMills Securities. However, that will come with high overhead costs, he said. Meanwhile, the bank is working \"steadfastly\" to fulfill the RBI's requirements and return to business as usual, Diwanji said. The private lender has stepped up investments to fortify its IT systems, including steps to strengthen its digital payment security controls and meet regulatory data cybersecurity standards, he added. Kotak has hired over 530 employees in the last 12-15 months, a majority of them from tech backgrounds, he said. The bank's focus on personal loans and business loans will continue, Diwanji said. ","cleaned_content":"kotak mahindra bank will increase its pace of opening new branches and add about \u003cONE_HUNDRED\u003e to \u003cTWO_HUNDRED\u003e branches in the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e a senior official at the bank said months after the central bank barred the private lender from sourcing new customers digitally in april the reserve bank of india rbi stopped kotak from adding new customers via its online and mobile banking channels and from issuing new credit cards due to information technology related deficiencies we have been adding roughly \u003cONE_HUNDRED\u003e odd branches for several years now this year too the momentum is going to continue virat diwanji group president and head consumer bank told reuters in an email interview on monday before the rbis order kotak was heavily reliant on digital channels to source new clients about \u003cNINE_TEN_PERCENT\u003e of its new personal loans by volume were disbursed digitally in the october december quarter while it issued \u003cNINE_TEN_PERCENT\u003e of new credit cards through digital channels a similar breakup for the january march quarter is not yet available kotaks branch addition plans may not immediately help source new customers but the strategy may play out in the medium to longer term as it will increase its presence and reach said kranthi baithini director of equity strategy at wealthmills securities however that will come with high overhead costs he said meanwhile the bank is working steadfastly to fulfill the rbis requirements and return to business as usual diwanji said the private lender has stepped up investments to fortify its it systems including steps to strengthen its digital payment security controls and meet regulatory data cybersecurity standards he added kotak has hired over \u003cFIVE_HUNDRED\u003e employees in the last \u003cONE_TEN\u003e \u003cONE_TEN\u003e months a majority of them from tech backgrounds he said the banks focus on personal loans and business loans will continue diwanji said","timestamp":"2024-06-24T11:45:00+05:30","market_timestamp":"2024-06-24T11:45:00+05:30","off_market_hours":false}