{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-partners-with-bajaj-finance-for-vehicle-finance-12758055.html","title":"Ashok Leyland partners with Bajaj Finance for vehicle finance","description":"The company has signed a Memorandum of Understanding (MoU) with Bajaj Finance, a part of Bajaj Finserv, for the purpose, Ashok Leyland said in a statement.","content":"Commercial vehicle maker Ashok Leyland Ltd on Friday said it has partnered with Bajaj Finance for financial of vehicles across India. The company has signed a Memorandum of Understanding (MoU) with Bajaj Finance, a part of Bajaj Finserv, for the purpose, Ashok Leyland said in a statement. The partnership will enable both Ashok Leyland and Bajaj Finance to offer customised and seamless financial solutions to their customers, it added. Bajaj Finance Deputy Managing Director, Anup Saha said, \"We are confident that with Bajaj Finance's best-in-class India stack processes more vehicle owners will gain from this partnership and scale their operations.\" The sales and marketing teams of the two companies will work together to develop joint marketing and financing programs, mutually enhancing business volumes under the partnership, the statement said. ","cleaned_content":"commercial vehicle maker ashok leyland ltd on friday said it has partnered with bajaj finance for financial of vehicles across india the company has signed a memorandum of understanding mou with bajaj finance a part of bajaj finserv for the purpose ashok leyland said in a statement the partnership will enable both ashok leyland and bajaj finance to offer customised and seamless financial solutions to their customers it added bajaj finance deputy managing director anup saha said we are confident that with bajaj finances best in class india stack processes more vehicle owners will gain from this partnership and scale their operations the sales and marketing teams of the two companies will work together to develop joint marketing and financing programs mutually enhancing business volumes under the partnership the statement said","timestamp":"2024-06-28T13:26:00+05:30","market_timestamp":"2024-06-28T13:26:00+05:30","off_market_hours":false}