{"url":"https://www.moneycontrol.com/news/business/gender-minorities-marginalised-groups-to-comprise-25-of-tata-steel-workforce-official-12756513.html","title":"Gender minorities, marginalised groups to comprise 25% of Tata Steel workforce: Official","description":"It is one of the first companies in the country to roll out a special recruitment drive for transgender talent, having recruited over 100 members from the community for various roles across different locations, the official claimed.Gender minorities, marginalised groups to comprise 25% of Tata Steel workforce: OfficialRelated stories","content":"Tata Steel aims at having a minimum of 25 per cent of its workforce made up of diverse groups, including gender minorities, marginalised communities, persons with disabilities and LGBTQIA+ individuals, within the next few years, a company official said. It is one of the first companies in the country to roll out a special recruitment drive for transgender talent, having recruited over 100 members from the community for various roles across different locations, the official claimed. \"Continuing this drive, we aim to have 25 per cent of our workforce from diverse groups in the next couple of years,\" the official said. Some of these employees work all three shifts and operate Heavy Earth Moving Machinery (HEMM) at the Noamundi iron ore mine in Jharkhand's West Singhbhum and West Bokaro coal mine in Ramgarh district. \"Tata Steel appreciates the potential of diversity, equity and inclusion (DE\u0026I) and has a tremendous organisational focus on it,\" the official said. \"In line with this, we renewed our commitment and refocused our approach to DE\u0026I in 2015 by setting up MOSAIC - a platform for pioneering initiatives, diversity targets, and employee-friendly policies conceptualised and executed from the apex level,\" he added. The official admitted that the initial planning stage was challenging due to inadequate knowledge about the transgender community. \"However, we made a detailed plan and implemented it without any difficulty. To date, we have not received any complaint from either side of the employees since the first batch of transgender individuals was inducted following proper training in 2019,\" the official said. On the productivity of these employees compared to the general workforce, he said transgender individuals perform better in some areas. Jaya Singh Panda, Chief Diversity Officer at Tata Steel, said, \"We believe in nurturing a workplace where every person, regardless of their sexual orientation or gender identity, feels valued, respected, and empowered. Diversity is one of our greatest strengths, and continuing this practice is key to long-term success and innovation.\" Speaking on condition of anonymity, a transgender employee at the company's Jamshedpur plant said, \"We feel very safe inside the company as coworkers are friendly, supportive, and cooperative. The company has also developed infrastructure, including separate toilets for us.\" Another trans-female employee from Noamundi lamented that her parents never used to care about whether she ate or came home on time. \"When my father learned about my job at Tata Steel, he did not believe me. He came and stayed with me until I joined. Since then, he calls me every day to check on me,\" the worker said. A trans-male employee in Jamshedpur said his job at the company enabled him to support his family and help with his sister's marriage, something he never imagined possible. Another trans-female employee in Jamshedpur expressed gratitude for the accommodation provided by the company. \"I'm happy that my society has accepted me as an individual,\" another member of the group added. ","cleaned_content":"tata steel aims at having a minimum of \u003cTWO_TEN_PERCENT\u003e of its workforce made up of diverse groups including gender minorities marginalised communities persons with disabilities and lgbtqia individuals within the next few years a company official said it is one of the first companies in the country to roll out a special recruitment drive for transgender talent having recruited over \u003cONE_HUNDRED\u003e members from the community for various roles across different locations the official claimed continuing this drive we aim to have \u003cTWO_TEN_PERCENT\u003e of our workforce from diverse groups in the next couple of years the official said some of these employees work all three shifts and operate heavy earth moving machinery hemm at the noamundi iron ore mine in jharkhands west singhbhum and west bokaro coal mine in ramgarh district tata steel appreciates the potential of diversity equity and inclusion de i and has a tremendous organisational focus on it the official said in line with this we renewed our commitment and refocused our approach to de i in \u003cTWO_THOUSAND\u003e by setting up mosaic a platform for pioneering initiatives diversity targets and employee friendly policies conceptualised and executed from the apex level he added the official admitted that the initial planning stage was challenging due to inadequate knowledge about the transgender community however we made a detailed plan and implemented it without any difficulty to date we have not received any complaint from either side of the employees since the first batch of transgender individuals was inducted following proper training in \u003cTWO_THOUSAND\u003e the official said on the productivity of these employees compared to the general workforce he said transgender individuals perform better in some areas jaya singh panda chief diversity officer at tata steel said we believe in nurturing a workplace where every person regardless of their sexual orientation or gender identity feels valued respected and empowered diversity is one of our greatest strengths and continuing this practice is key to long term success and innovation speaking on condition of anonymity a transgender employee at the companys jamshedpur plant said we feel very safe inside the company as coworkers are friendly supportive and cooperative the company has also developed infrastructure including separate toilets for us another trans female employee from noamundi lamented that her parents never used to care about whether she ate or came home on time when my father learned about my job at tata steel he did not believe me he came and stayed with me until i joined since then he calls me every day to check on me the worker said a trans male employee in jamshedpur said his job at the company enabled him to support his family and help with his sisters marriage something he never imagined possible another trans female employee in jamshedpur expressed gratitude for the accommodation provided by the company im happy that my society has accepted me as an individual another member of the group added","timestamp":"2024-06-26T12:25:00+05:30","market_timestamp":"2024-06-26T12:25:00+05:30","off_market_hours":false}