{"url":"https://www.moneycontrol.com/news/business/india-probe-finds-byjus-didnt-commit-fraud-but-had-compliance-lapses-12756426.html","title":"India probe finds Byju’s didn’t commit fraud but had compliance lapses","description":"The yearlong probe by the Ministry of Corporate Affairs found no evidence of wrongdoing such as siphoning of funds or manipulation of financial accounts, people familiar with the matter said.India probe finds Byju’s didn’t commit fraud but had compliance lapsesRelated stories","content":"An India government investigation found lapses in the corporate governance of Byju’s, but cleared the struggling online-education startup of financial fraud. The yearlong probe by the Ministry of Corporate Affairs found no evidence of wrongdoing such as siphoning of funds or manipulation of financial accounts, people familiar with the matter said. Still, it discovered governance shortcomings that contributed to the startup’s mounting losses, the people said, asking not to be named as the investigators’ report isn’t public yet. Representatives of the corporate affairs ministry, Byju’s, Peak XV and Prosus didn’t respond to requests for comment. The report doesn’t directly address whether Raveendran personally is at fault for the governance lapses or whether he is qualified to run the company. The disgruntled investors have sought his removal, citing management and compliance failures. The report also does little to stave off the company’s broader problems. The unprofitable startup’s quick expansion led to a cash crunch and a plunge in its valuation, and it’s now fighting multiple lawsuits in India and the US. The probe found that weak corporate governance and compliance practices, along with a change in the funding environment, contributed to its ballooning losses, the people said. Investigators also concluded that that startup failed to bring in professionals to oversee finances and compliance, which led to the losses, the people said. The report establishes that Byju’s didn’t disclose full details of acquisitions with all directors and that meetings to approve such deals were called at short notice. But it acknowledges the founders’ rationale that some directors were also investors at rival companies, according to the people. The ed-tech company was valued at $22 billion at its peak. Business surged during the two years of the Covid-19 pandemic but as infections subsided and classrooms resumed, its cash pile shrinked. It’s now battling several bankruptcy cases in India and overseas. Though Byju’s has managed to raise more than $100 million from existing investors through a fresh issuance of shares, an Indian court has barred it from using that money. ","cleaned_content":"an india government investigation found lapses in the corporate governance of byju s but cleared the struggling online education startup of financial fraud the yearlong probe by the ministry of corporate affairs found no evidence of wrongdoing such as siphoning of funds or manipulation of financial accounts people familiar with the matter said still it discovered governance shortcomings that contributed to the startup s mounting losses the people said asking not to be named as the investigators report isn t public yet representatives of the corporate affairs ministry byju s peak xv and prosus didn t respond to requests for comment the report doesn t directly address whether raveendran personally is at fault for the governance lapses or whether he is qualified to run the company the disgruntled investors have sought his removal citing management and compliance failures the report also does little to stave off the company s broader problems the unprofitable startup s quick expansion led to a cash crunch and a plunge in its valuation and it s now fighting multiple lawsuits in india and the us the probe found that weak corporate governance and compliance practices along with a change in the funding environment contributed to its ballooning losses the people said investigators also concluded that that startup failed to bring in professionals to oversee finances and compliance which led to the losses the people said the report establishes that byju s didn t disclose full details of acquisitions with all directors and that meetings to approve such deals were called at short notice but it acknowledges the founders rationale that some directors were also investors at rival companies according to the people the ed tech company was valued at \u003cTWO_TEN\u003e billion at its peak business surged during the two years of the covid \u003cONE_TEN\u003e pandemic but as infections subsided and classrooms resumed its cash pile shrinked it s now battling several bankruptcy cases in india and overseas though byju s has managed to raise more than \u003cONE_HUNDRED\u003e million from existing investors through a fresh issuance of shares an indian court has barred it from using that money","timestamp":"2024-06-26T12:13:00+05:30","market_timestamp":"2024-06-26T12:13:00+05:30","off_market_hours":false}