{"url":"https://www.moneycontrol.com/technology/auto/hyundai-discontinues-kona-electric-vehicle-in-india-heres-why-article-12756441.html","title":"Hyundai discontinues Kona electric vehicle in India, Here's why","description":"The pricing was eventually lowered, and the electric vehicle (EV) was available until now for Rs 23.84 lakhs (ex-showroom).Hyundai discontinues Kona electric vehicle in India, Here's whyRelated stories","content":"Hyundai Motors introduced the Kona electric in India in 2019, with a starting price of Rs 25.30 lakhs (ex-showroom). The pricing was eventually lowered, and the electric vehicle (EV) was available until now for Rs 23.84 lakhs (ex-showroom). While Hyundai did drop costs by over Rs 2 lakh at the end, the introduction of smaller and cheaper e-SUVs, ranging from the Tata Nexon EV and MG ZS EV to the Mahindra XUV400, meant that the EV was positioned higher and had even less market traction. The age of the vehicle —which has been on the market for the past five years without any modifications—may be one of the factors contributing to its discontinuation, as per reports. Another explanation would be to provide room in the EV lineup for the Hyundai Creta Electric, which is presently in development and should be on display in showrooms by January 2025, reports add. Hyundai Kona EV: About The Vehicle The Hyundai Kona is powered by a permanent magnet synchronous motor with 136 horsepower and 395 Nm of torque. It comes equipped with a 39.2 kWh lithium-ion battery. The claimed acceleration time from 0 to 100 km/h is 9.7 seconds. There are three driving modes available: eco, comfort, and sport. The vehicle offers adjustable regenerative braking with paddle shifters. A 50 kW DC fast charger can charge the battery to 80 per cent capacity in around 57 minutes, while a regular AC charger takes 6 hours and 10 minutes. When fully charged, it claimed to have a driving range of 452 km. Some of the features were a 7.0-inch dashboard screen, an 8.0-inch touchscreen entertainment system, a head-up display, automated climate control, a sunroof, heated ORVMs, leather upholstery, heated and ventilated electrically adjustable front seats, and a reverse camera with parking sensors. Meanwhile, the next Hyundai Creta electric will be significantly localised in India and is projected to have a range of up to 500 kilometres on a full charge. ","cleaned_content":"hyundai motors introduced the kona electric in india in \u003cTWO_THOUSAND\u003e with a starting price of rs \u003cTWO_TEN\u003e lakhs ex showroom the pricing was eventually lowered and the electric vehicle ev was available until now for rs \u003cTWO_TEN\u003e lakhs ex showroom while hyundai did drop costs by over rs \u003cTWO_\u003e lakh at the end the introduction of smaller and cheaper e suvs ranging from the tata nexon ev and mg zs ev to the mahindra xuv400 meant that the ev was positioned higher and had even less market traction the age of the vehicle which has been on the market for the past five years without any modifications may be one of the factors contributing to its discontinuation as per reports another explanation would be to provide room in the ev lineup for the hyundai creta electric which is presently in development and should be on display in showrooms by january \u003cTWO_THOUSAND\u003e reports add hyundai kona ev about the vehicle the hyundai kona is powered by a permanent magnet synchronous motor with \u003cONE_HUNDRED\u003e horsepower and \u003cTHREE_HUNDRED\u003e nm of torque it comes equipped with a \u003cTHREE_TEN\u003e kwh lithium ion battery the claimed acceleration time from \u003cZERO_\u003e to \u003cONE_HUNDRED\u003e km h is \u003cNINE_\u003e seconds there are three driving modes available eco comfort and sport the vehicle offers adjustable regenerative braking with paddle shifters a \u003cFIVE_TEN\u003e kw dc fast charger can charge the battery to \u003cEIGHT_TEN_PERCENT\u003e capacity in around \u003cFIVE_TEN\u003e minutes while a regular ac charger takes \u003cSIX_\u003e hours and \u003cONE_TEN\u003e minutes when fully charged it claimed to have a driving range of \u003cFOUR_HUNDRED\u003e km some of the features were a \u003cSEVEN_\u003e inch dashboard screen an \u003cEIGHT_\u003e inch touchscreen entertainment system a head up display automated climate control a sunroof heated orvms leather upholstery heated and ventilated electrically adjustable front seats and a reverse camera with parking sensors meanwhile the next hyundai creta electric will be significantly localised in india and is projected to have a range of up to \u003cFIVE_HUNDRED\u003e kilometres on a full charge","timestamp":"2024-06-26T11:12:00+05:30","market_timestamp":"2024-06-26T11:12:00+05:30","off_market_hours":false}