{"url":"https://www.moneycontrol.com/news/business/ultratechs-stake-buy-in-india-cements-is-a-takeover-now-on-the-cards-12757968.html","title":"UltraTech’s stake buy in India Cements — Is a takeover now on the cards?","description":"The deal will help the Birla cement company strengthen its presence in the southern marketUltratech enjoys a market share of ~23 percent on a pan-India basisRelated stories","content":"Highlights  With an aggregate capacity of 152.7 MTPA, Ultratech enjoys a market share of ~23 percent on a pan-India basis. However, its market share in the south is just about 10-11 percent. The management had earlier indicated that it was looking to consolidate its presence in the south, which remains very fragmented because of many small and mid-sized players. In our view, UltraTech will be looking to further increase its stake in the company and may launch an open offer in the coming months to gain control over the operations.  Birla and Adani fighting for leadership  The stake sale comes at a point when the Indian cement industry is undergoing a wave of consolidation. The sector has already witnessed four strategic acquisitions in the last 20 months. The Adani group-owned Ambuja Cements, the second-largest cement player in the domestic market, has been on an aggressive capacity expansion spree and has readied a substantial cash war chest (~$3 billion) to target M\u0026A opportunities. Ambuja recently announced the acquisition of south-based cement company Penna Cement (14 MT capacity) at an enterprise value of Rs 10,422 crore. The group has reiterated its ambition to reach 140MT cement capacity by 2028. The fight for market leadership between the Birlas and the Adanis is intensifying as UltraTech is looking to achieve a production capacity of 200 MT in the next 3-4 years. ","cleaned_content":"highlights with an aggregate capacity of \u003cONE_HUNDRED\u003e mtpa ultratech enjoys a market share of \u003cTWO_TEN_PERCENT\u003e on a pan india basis however its market share in the south is just about \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e the management had earlier indicated that it was looking to consolidate its presence in the south which remains very fragmented because of many small and mid sized players in our view ultratech will be looking to further increase its stake in the company and may launch an open offer in the coming months to gain control over the operations birla and adani fighting for leadership the stake sale comes at a point when the indian cement industry is undergoing a wave of consolidation the sector has already witnessed four strategic acquisitions in the last \u003cTWO_TEN\u003e months the adani group owned ambuja cements the second largest cement player in the domestic market has been on an aggressive capacity expansion spree and has readied a substantial cash war chest \u003cTHREE_\u003e billion to target m a opportunities ambuja recently announced the acquisition of south based cement company penna cement \u003cONE_TEN\u003e mt capacity at an enterprise value of rs \u003cONE_TEN_THOUSAND\u003e crore the group has reiterated its ambition to reach \u003cONE_HUNDRED\u003e mt cement capacity by \u003cTWO_THOUSAND\u003e the fight for market leadership between the birlas and the adanis is intensifying as ultratech is looking to achieve a production capacity of \u003cTWO_HUNDRED\u003e mt in the next \u003cTHREE_\u003e \u003cFOUR_\u003e years","timestamp":"2024-06-28T10:53:00+05:30","market_timestamp":"2024-06-28T10:53:00+05:30","off_market_hours":false}