{"url":"https://www.moneycontrol.com/news/business/jsw-steel-usa-to-invest-110-million-to-modernise-plate-mill-in-baytown-texas-12755828.html","title":"JSW Steel USA to invest $110 million to modernise plate mill in Baytown, Texas","description":"These investments will enable the production of high-quality monopile steel plates to support the US administration's new actions to expand offshore wind energy by deploying 30 gigawatts (GW) of offshore wind by 2030, enough to power 10 million homes with clean energy, the company said.JSW Steel USA to invest $110 million to modernise plate mill in Baytown, Texas","content":"JSW Steel on Tuesday said its subsidiary JSW Steel USA plans to invest USD 110 million to modernise its steel plate mill in Baytown, Texas with new equipment and sustainable technology. These investments will enable the production of high-quality monopile steel plates to support the US administration's new actions to expand offshore wind energy by deploying 30 gigawatts (GW) of offshore wind by 2030, enough to power 10 million homes with clean energy, the company said. \"JSW Steel USA, Inc plans to invest USD 110 million in steel plate mill modernization projects with sustainable technology and state of the art equipment within its manufacturing facilities in Baytown, Texas,\" JSW Steel said in a statement. Parth Jindal, Director of JSW Steel USA, said, \"The new upgrades at our Plate Mill support the long-term Environmental, social, and governance (ESG) initiative of JSW USA and support decarbonisation of the Energy Spectrum in the USA. These investments have the potential to significantly reduce US import reliance in the infrastructure and renewable energy sectors.\" ","cleaned_content":"jsw steel on tuesday said its subsidiary jsw steel usa plans to invest usd \u003cONE_HUNDRED\u003e million to modernise its steel plate mill in baytown texas with new equipment and sustainable technology these investments will enable the production of high quality monopile steel plates to support the us administrations new actions to expand offshore wind energy by deploying \u003cTHREE_TEN\u003e gigawatts gw of offshore wind by \u003cTWO_THOUSAND\u003e enough to power \u003cONE_TEN\u003e million homes with clean energy the company said jsw steel usa inc plans to invest usd \u003cONE_HUNDRED\u003e million in steel plate mill modernization projects with sustainable technology and state of the art equipment within its manufacturing facilities in baytown texas jsw steel said in a statement parth jindal director of jsw steel usa said the new upgrades at our plate mill support the long term environmental social and governance esg initiative of jsw usa and support decarbonisation of the energy spectrum in the usa these investments have the potential to significantly reduce us import reliance in the infrastructure and renewable energy sectors","timestamp":"2024-06-25T13:58:00+05:30","market_timestamp":"2024-06-25T13:58:00+05:30","off_market_hours":false}