{"url":"https://www.moneycontrol.com/news/business/kalpataru-projects-international-bags-orders-worth-rs-2333-crore-12755675.html","title":"Kalpataru Projects International bags orders worth Rs 2,333 crore","description":"The company said its new orders include Transmission \u0026 Distribution (T\u0026D) business in India and overseas markets, an EPC (Engineering Procurement Construction) order for an industrial plant in the metal industry and a residential building order in India.Kalpataru Projects International bags orders worth Rs 2,333 crore","content":"Kalpataru Projects International on Tuesday said it has secured orders worth Rs 2,333 crore. The company said its new orders include Transmission \u0026 Distribution (T\u0026D) business in India and overseas markets, an EPC (Engineering Procurement Construction) order for an industrial plant in the metal industry and a residential building order in India. Kalpataru Projects International Limited (KPIL) and its Joint Ventures (JVs) and international subsidiaries have secured new orders worth Rs 2,333 crore, according to a company statement. \"These orders reaffirm our confidence that the T\u0026D and B\u0026F business will continue to contribute significantly to our growth going forward,\" he added. ","cleaned_content":"kalpataru projects international on tuesday said it has secured orders worth rs \u003cTWO_THOUSAND\u003e crore the company said its new orders include transmission distribution t d business in india and overseas markets an epc engineering procurement construction order for an industrial plant in the metal industry and a residential building order in india kalpataru projects international limited kpil and its joint ventures jvs and international subsidiaries have secured new orders worth rs \u003cTWO_THOUSAND\u003e crore according to a company statement these orders reaffirm our confidence that the t d and b f business will continue to contribute significantly to our growth going forward he added","timestamp":"2024-06-25T11:33:00+05:30","market_timestamp":"2024-06-25T11:33:00+05:30","off_market_hours":false}