{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-sets-up-new-lcv-dealership-in-madhya-pradesh-12756517.html","title":"Ashok Leyland sets up new LCV dealership in Madhya Pradesh","description":"The new light commercial vehicle dealership -- Sunil MotoCorp -- is the 8th 3S (sales, service and spares) facility in Chhindwara, Madhya Pradesh and offers a range of LCV products including BADA DOST, DOST, PARTNER AND MiTR.Ashok Leyland sets up new LCV dealership in Madhya Pradesh","content":"Hinduja Group flagship company Ashok Leyland has inaugurated a new dealership for its light commercial vehicles division in Madhya Pradesh under its expansion drive, the city-headquartered company said on Wednesday. The new light commercial vehicle dealership -- Sunil MotoCorp -- is the 8th 3S (sales, service and spares) facility in Chhindwara, Madhya Pradesh and offers a range of LCV products including BADA DOST, DOST, PARTNER AND MiTR. \"One of the key reasons for the runaway success of our DOST range and now the BADA DOST has been the robustness of the product and our network. All our products have been receiving great response from our customers..We are extremely proud that our track record of service retention levels is exemplary with close to 70 per cent of our customers returning to our dealer workshops even after the warranty period\" said company President - IO,LCV, Defence and PSB, Amandeep Singh in a company statement. \"This new dealership is being opened to further strengthen our reach, in line with our commitment,\" he said The LCV dealership is equipped with advanced tools, five quick service bays, sophisticated infrastructure among others and adds to the distribution network with more than 750 touch points. ","cleaned_content":"hinduja group flagship company ashok leyland has inaugurated a new dealership for its light commercial vehicles division in madhya pradesh under its expansion drive the city headquartered company said on wednesday the new light commercial vehicle dealership sunil motocorp is the \u003cEIGHT_\u003e th \u003cTHREE_\u003e s sales service and spares facility in chhindwara madhya pradesh and offers a range of lcv products including bada dost dost partner and mitr one of the key reasons for the runaway success of our dost range and now the bada dost has been the robustness of the product and our network all our products have been receiving great response from our customers we are extremely proud that our track record of service retention levels is exemplary with close to \u003cSEVEN_TEN_PERCENT\u003e of our customers returning to our dealer workshops even after the warranty period said company president io lcv defence and psb amandeep singh in a company statement this new dealership is being opened to further strengthen our reach in line with our commitment he said the lcv dealership is equipped with advanced tools five quick service bays sophisticated infrastructure among others and adds to the distribution network with more than \u003cSEVEN_HUNDRED\u003e touch points","timestamp":"2024-06-26T12:30:00+05:30","market_timestamp":"2024-06-26T12:30:00+05:30","off_market_hours":false}