{"url":"https://www.moneycontrol.com/news/business/infosys-ceo-parekh-pays-rs-25-lakh-to-sebi-for-failing-to-have-adequate-controls-to-prevent-insider-trading-12757190.html","title":"Infosys CEO Parekh pays Rs 25 lakh to SEBI for failing to have adequate controls to prevent insider trading","description":"The case relates to a 2020 partnership between Infosys and Vanguard, wherein the IT company would provide a cloud-based record-keeping platform to Vanguard.InfosysRelated stories","content":"India's No.2 Information Technology (IT) services exporter Infosys' Chief Executive Officer Salil Parekh has settled charges of violating provisions of insider trading, the country's markets regulator said on June 27. Parekh agreed to pay Rs 25 lakh for failing to have adequate controls to prevent insider trading. \"The said application was filed in terms of the SEBI (Settlement Proceedings) Regulations, 2018... wherein the Applicant (S) proposed to SEBI to settle the instant proceedings, without admitting or denying the findings of fact and conclusions of law, through a settlement order,\" the Securities and Exchange Board of India said in a release. Parekh was the CEO and MD of Infosys at the time of the announcement of the partnership. The investigation by SEBI referred to Infosys’ analysis that the partnership would result in an expansion of business for Infosys. The SEBI order further says that the CEO and MD or such other analogous person of a listed company is responsible for putting in place an adequate and effective system of internal control to ensure compliance for preventing insider trading. \"The investigation concluded that the Applicant (Salil Parekh) violated provisions of Regulations 9A(1) and 9A(2) of PIT Regulations 2015,\" the order by SEBI read. The above-mentioned rule broadly refers to unpublished price-sensitive information that should be identified and its confidentiality maintained. Further, a show cause notice was issued to Parekh on August 3, 2023, calling upon him to show cause as to why \"suitable direction(s)\" should not be issued against him for the alleged violation. To this, a payment of Rs 25 lakh was made to SEBI to settle the instant proceedings, without admitting or denying the findings of fact and conclusions of law, through a settlement order. \"In view of the acceptance of the settlement terms and receipt of settlementamount by SEBI, the specified proceedings initiated against the Applicant (Parekh)... are disposed of... on the basis of aforesaid settlement terms,\" the order read. ","cleaned_content":"indias no 2 information technology it services exporter infosys chief executive officer salil parekh has settled charges of violating provisions of insider trading the countrys markets regulator said on june \u003cTWO_TEN\u003e parekh agreed to pay rs \u003cTWO_TEN\u003e lakh for failing to have adequate controls to prevent insider trading the said application was filed in terms of the sebi settlement proceedings regulations \u003cTWO_THOUSAND\u003e wherein the applicant s proposed to sebi to settle the instant proceedings without admitting or denying the findings of fact and conclusions of law through a settlement order the securities and exchange board of india said in a release parekh was the ceo and md of infosys at the time of the announcement of the partnership the investigation by sebi referred to infosys analysis that the partnership would result in an expansion of business for infosys the sebi order further says that the ceo and md or such other analogous person of a listed company is responsible for putting in place an adequate and effective system of internal control to ensure compliance for preventing insider trading the investigation concluded that the applicant salil parekh violated provisions of regulations \u003cNINE_\u003e a \u003cONE_\u003e and \u003cNINE_\u003e a \u003cTWO_\u003e of pit regulations \u003cTWO_THOUSAND\u003e the order by sebi read the above mentioned rule broadly refers to unpublished price sensitive information that should be identified and its confidentiality maintained further a show cause notice was issued to parekh on august \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e calling upon him to show cause as to why suitable direction s should not be issued against him for the alleged violation to this a payment of rs \u003cTWO_TEN\u003e lakh was made to sebi to settle the instant proceedings without admitting or denying the findings of fact and conclusions of law through a settlement order in view of the acceptance of the settlement terms and receipt of settlementamount by sebi the specified proceedings initiated against the applicant parekh are disposed of on the basis of aforesaid settlement terms the order read","timestamp":"2024-06-27T18:33:00+05:30","market_timestamp":"2024-06-28T09:15:00+05:30","off_market_hours":true}