{"url":"https://www.moneycontrol.com/news/business/jet-airways-founder-naresh-goyal-moves-hc-seeking-extension-of-interim-medical-bail-12755865.html","title":"Jet Airways founder Naresh Goyal moves HC seeking extension of interim medical bail","description":"On May 6, the high court had granted interim bail for two months on medical grounds to Goyal, arrested in a money laundering case by the Enforcement Directorate (ED).Jet Airways founder Naresh Goyal moves HC seeking extension of interim medical bailRelated stories","content":"Jet Airways founder Naresh Goyal has moved the Bombay High Court seeking extension of the two-month interim medical bail granted to him earlier. On May 6, the high court had granted interim bail for two months on medical grounds to Goyal, arrested in a money laundering case by the Enforcement Directorate (ED). Goyal, 75, has now filed an application seeking extension of the same. The application came up for hearing on Tuesday before a single bench of Justice Manish Pitale. The court referred to a circular issued by the high court in February, stating that the applications where earlier pleas were considered and decided by a particular judge shall be placed before the same bench. Justice Pitale directed the high court's registry department to place Goyal's application before the single bench of Justice N J Jamadar, who had granted him interim bail in May for two months. Goyal's counsels Aabad Ponda and Ameet Naik said they would mention the plea before Justice Jamadar on Wednesday. Goyal was arrested by the Enforcement Directorate (ED) in September 2023 on the allegations that he had laundered money and siphoned off loans to the tune of Rs 538.62 crore given to Jet Airways by Canara Bank. His wife, Anita Goyal was arrested in November 2023 when the ED submitted its chargesheet in the case. She was granted bail by the special court the same day considering her age and medical condition. She died on May 16. ","cleaned_content":"jet airways founder naresh goyal has moved the bombay high court seeking extension of the two month interim medical bail granted to him earlier on may \u003cSIX_\u003e the high court had granted interim bail for two months on medical grounds to goyal arrested in a money laundering case by the enforcement directorate ed goyal \u003cSEVEN_TEN\u003e has now filed an application seeking extension of the same the application came up for hearing on tuesday before a single bench of justice manish pitale the court referred to a circular issued by the high court in february stating that the applications where earlier pleas were considered and decided by a particular judge shall be placed before the same bench justice pitale directed the high courts registry department to place goyals application before the single bench of justice n j jamadar who had granted him interim bail in may for two months goyals counsels aabad ponda and ameet naik said they would mention the plea before justice jamadar on wednesday goyal was arrested by the enforcement directorate ed in september \u003cTWO_THOUSAND\u003e on the allegations that he had laundered money and siphoned off loans to the tune of rs \u003cFIVE_HUNDRED\u003e crore given to jet airways by canara bank his wife anita goyal was arrested in november \u003cTWO_THOUSAND\u003e when the ed submitted its chargesheet in the case she was granted bail by the special court the same day considering her age and medical condition she died on may \u003cONE_TEN\u003e","timestamp":"2024-06-25T14:38:00+05:30","market_timestamp":"2024-06-25T14:38:00+05:30","off_market_hours":false}