{"url":"https://www.moneycontrol.com/news/business/air-india-to-deploy-a350-planes-on-delhi-london-route-from-september-1-12757334.html","title":"Air India to deploy A350 planes on Delhi-London route from September 1","description":"The flights will mark the introduction of the plane on the international long-haul route, as Air India revamps and expands its operations to strengthen presence in international and domestic segments.Air India to deploy A350 planes on Delhi-London route from September 1Related stories","content":"Air India will start operating its wide-body A350-900 aircraft on the Delhi-London route with two daily flights from September 1. The flights will mark the introduction of the plane on the international long-haul route, as Air India revamps and expands its operations to strengthen presence in international and domestic segments. \"The A350-900 will replace the currently deployed Boeing 777-300 ER and Boeing 787-8 Dreamliner on 14 of 17 weekly flights. As a result, an additional 336 seats will be available on the Delhi-London Heathrow route each week,\" the airline said in a release on Thursday. Air India will operate two daily flights between the national capital and London Heathrow with the A350-900 aircraft starting from September 1. The airline started operating the A350-900 plane on the international route from May 1 with services between Delhi and Dubai. The Tata Group-owned airline operates 31 weekly flights to London Heathrow -- 17 from Delhi and 14 from Mumbai. It also flies from Ahmedabad, Amritsar, Bengaluru, Goa and Kochi to London Gatwick. There are 17 weekly flights on this route. Besides, the carrier operates 6 weekly flights to Birmingham from Delhi and Amritsar. Air India started inducting the A350 planes this year and are being used for domestic flights as well. The airline has placed an order for 40 A350 planes and 6 of them are in its fleet. \"The deployment of our flagship A350s and the B777s with upgraded cabin interiors to London Heathrow marks a significant milestone for Air India,\" Air India CEO and MD Campbell Wilson said. (With PTI inputs) ","cleaned_content":"air india will start operating its wide body a350 \u003cNINE_HUNDRED\u003e aircraft on the delhi london route with two daily flights from september \u003cONE_\u003e the flights will mark the introduction of the plane on the international long haul route as air india revamps and expands its operations to strengthen presence in international and domestic segments the a350 \u003cNINE_HUNDRED\u003e will replace the currently deployed boeing \u003cSEVEN_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e er and boeing \u003cSEVEN_HUNDRED\u003e \u003cEIGHT_\u003e dreamliner on \u003cONE_TEN\u003e of \u003cONE_TEN\u003e weekly flights as a result an additional \u003cTHREE_HUNDRED\u003e seats will be available on the delhi london heathrow route each week the airline said in a release on thursday air india will operate two daily flights between the national capital and london heathrow with the a350 \u003cNINE_HUNDRED\u003e aircraft starting from september \u003cONE_\u003e the airline started operating the a350 \u003cNINE_HUNDRED\u003e plane on the international route from may \u003cONE_\u003e with services between delhi and dubai the tata group owned airline operates \u003cTHREE_TEN\u003e weekly flights to london heathrow \u003cONE_TEN\u003e from delhi and \u003cONE_TEN\u003e from mumbai it also flies from ahmedabad amritsar bengaluru goa and kochi to london gatwick there are \u003cONE_TEN\u003e weekly flights on this route besides the carrier operates \u003cSIX_\u003e weekly flights to birmingham from delhi and amritsar air india started inducting the a350 planes this year and are being used for domestic flights as well the airline has placed an order for \u003cFOUR_TEN\u003e a350 planes and \u003cSIX_\u003e of them are in its fleet the deployment of our flagship a350s and the b777s with upgraded cabin interiors to london heathrow marks a significant milestone for air india air india ceo and md campbell wilson said with pti inputs","timestamp":"2024-06-27T12:29:00+05:30","market_timestamp":"2024-06-27T12:29:00+05:30","off_market_hours":false}