{"url":"https://www.moneycontrol.com/news/business/tata-motors-partners-bajaj-finance-for-commercial-vehicle-finance-12755827.html","title":"Tata Motors partners Bajaj Finance for commercial vehicle finance","description":"The company has signed a memorandum of understanding (MoU) with Bajaj Finance Ltd, part of Bajaj Finserv Ltd, for the same and customers will benefit from the latter's wide reach, competitive interest rates, flexi loan and digitally-enabled loan processing, Tata Motors said in a statement.Girish Wagh, Executive Director, Tata Motors, Mr. Rajesh Kaul, Vice President \u0026 Business Head – Trucks, Tata Motors and Mr. Harjeet Toor, President – Bharat Lending \u0026 Strategic Partnership, Bajaj Finance among other dignitaries from Tata Motors and Bajaj Finance at the MoU signing ceremony in MumbaiRelated stories","content":"Tata Motors on Tuesday said it has partnered with Bajaj Finance Ltd for offering financing solutions across its entire commercial vehicle portfolio. The company has signed a memorandum of understanding (MoU) with Bajaj Finance Ltd, part of Bajaj Finserv Ltd, for the same and customers will benefit from the latter's wide reach, competitive interest rates, flexi loan and digitally-enabled loan processing, Tata Motors said in a statement. \"We are confident that their (Bajaj Finance) inaugural venture into commercial vehicle financing will allow them to tap the immense potential that the transportation sector brings in, and this partnership will benefit entrepreneurs across the country,\" Tata Motors Commercial Vehicles Vice President \u0026 Business Head - Trucks, Rajesh Kaul said. Bajaj Finance Deputy Managing Director Anup Saha said, \"... We aim to make the process of purchasing a commercial vehicle accessible and hassle-free. We are confident that the partnership will empower more commercial vehicle owners with financing solutions.\" Tata Motors offers a range of sub 1-tonne to 55-tonne cargo vehicles and 10-seater to 51-seater mass mobility solutions, ranging in small commercial vehicles and pickups, trucks and buses segments. On the other hand, Bajaj Finance is a diversified Non-Banking Financial Company (NBFC) in India with presence across lending, deposits and payments, serving over 8.36 crore customers. As of March 31, 2024, its assets under management stood at Rs 3,30,615 crore, the statement said. ","cleaned_content":"tata motors on tuesday said it has partnered with bajaj finance ltd for offering financing solutions across its entire commercial vehicle portfolio the company has signed a memorandum of understanding mou with bajaj finance ltd part of bajaj finserv ltd for the same and customers will benefit from the latters wide reach competitive interest rates flexi loan and digitally enabled loan processing tata motors said in a statement we are confident that their bajaj finance inaugural venture into commercial vehicle financing will allow them to tap the immense potential that the transportation sector brings in and this partnership will benefit entrepreneurs across the country tata motors commercial vehicles vice president business head trucks rajesh kaul said bajaj finance deputy managing director anup saha said we aim to make the process of purchasing a commercial vehicle accessible and hassle free we are confident that the partnership will empower more commercial vehicle owners with financing solutions tata motors offers a range of sub \u003cONE_\u003e tonne to \u003cFIVE_TEN\u003e tonne cargo vehicles and \u003cONE_TEN\u003e seater to \u003cFIVE_TEN\u003e seater mass mobility solutions ranging in small commercial vehicles and pickups trucks and buses segments on the other hand bajaj finance is a diversified non banking financial company nbfc in india with presence across lending deposits and payments serving over \u003cEIGHT_\u003e crore customers as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e its assets under management stood at rs \u003cTHREE_HUNDRED_THOUSAND\u003e crore the statement said","timestamp":"2024-06-25T13:55:00+05:30","market_timestamp":"2024-06-25T13:55:00+05:30","off_market_hours":false}