{"url":"https://www.moneycontrol.com/news/business/passenger-vehicle-sales-to-see-3-5-growth-this-fiscal-report-12755014.html","title":"Passenger vehicle sales to see 3-5% growth this fiscal: Report","description":"According to the report by credit ratings agency CareEdge, following robust growth of 90 per cent with volumes at 90,432 units in FY24, with an improving penetration rate, electric car sales in the passenger vehicle (PV) segment is likely to clock volume of around 1.30-1.50 lakh units in FY25.Passenger vehicle sales to see 3-5% growth this fiscal: ReportRelated stories","content":"Passenger vehicle sales is projected to grow at a moderate 3-5 per cent this financial year on account of a high-base effect of FY24, shrinking order book and subdued demand for entry-level variants, a report said on Monday. According to the report by credit ratings agency CareEdge, following robust growth of 90 per cent with volumes at 90,432 units in FY24, with an improving penetration rate, electric car sales in the passenger vehicle (PV) segment is likely to clock volume of around 1.30-1.50 lakh units in FY25. In FY22 and FY23, the PV industry experienced substantial year-on-year volume growth due to pent-up demand post-Covid recovery and new product introductions, it said. According to CareEdge, utility vehicles contributed 10-15 per cent of total passenger vehicle sales until FY12. It grew at a compound annual growth rate (CAGR) of 15.51 per cent between FY13 and FY24, as consumer preference shifted towards utility vehicles that offered better and innovative designs, new models, technological, functional and safety features. For the past decade, the utility vehicles segment has consistently outperformed the passenger vehicle industry growth rate. In FY24, for the first time utility vehicles sales volume stood higher than passenger cars and vans, it said. Currently, utility vehicles account for over 55 per cent of all new PV sales and its share in overall passenger vehicle (PV) sales is expected to further rise over the medium-term, CareEdge said. \"The PV industry is expected to exhibit moderate volume growth of around 3-5 per cent in FY25 on account of a high-base effect of FY24, shrinking orderbook and expectation of persistently subdued demand for entry-level variants in FY25,\" said Arti Roy, Associate Director at CareEdge Ratings. Strong demand for new model launches and SUVs coupled with the expectation of interest rate cuts in the second half of FY25 is expected to keep the sales momentum rolling, she added. However, in line with CareEdge Ratings' expectation of volume growth of around 7-9 per cent in FY24, the PV industry volumes grew by 7.4 per cent in FY24, the ratings said. This moderation in year-on-year volume growth in FY24 was due to the levelling off of pent-up demand amid a hike in vehicle prices, high base effect of FY23 and the high-interest rate environment, it said. Strong order book in FY24, robust demand for new model launches and increasing demand in the sports utility vehicle (SUV) segment kept the sales momentum rolling, as per the report. \"While the market for premium vehicles is predicted to thrive, driven by a surge in demand for luxury and high-end models, entry-level variants are likely to see continued diminished demand due to a downturn in both rural and urban markets,\" said Hardik Shah, Director at CareEdge Ratings. The rural sector is feeling the pinch as entry-level vehicles are becoming more expensive, whereas urban consumers are increasingly opting for SUVs, reflecting a shift in market preferences, Shah added. ","cleaned_content":"passenger vehicle sales is projected to grow at a moderate \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e this financial year on account of a high base effect of fy24 shrinking order book and subdued demand for entry level variants a report said on monday according to the report by credit ratings agency careedge following robust growth of \u003cNINE_TEN_PERCENT\u003e with volumes at \u003cNINE_TEN_THOUSAND\u003e units in fy24 with an improving penetration rate electric car sales in the passenger vehicle pv segment is likely to clock volume of around \u003cONE_\u003e \u003cONE_\u003e lakh units in fy25 in fy22 and fy23 the pv industry experienced substantial year on year volume growth due to pent up demand post covid recovery and new product introductions it said according to careedge utility vehicles contributed \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e of total passenger vehicle sales until fy12 it grew at a compound annual growth rate cagr of \u003cONE_TEN_PERCENT\u003e between fy13 and fy24 as consumer preference shifted towards utility vehicles that offered better and innovative designs new models technological functional and safety features for the past decade the utility vehicles segment has consistently outperformed the passenger vehicle industry growth rate in fy24 for the first time utility vehicles sales volume stood higher than passenger cars and vans it said currently utility vehicles account for over \u003cFIVE_TEN_PERCENT\u003e of all new pv sales and its share in overall passenger vehicle pv sales is expected to further rise over the medium term careedge said the pv industry is expected to exhibit moderate volume growth of around \u003cTHREE_\u003e \u003cFIVE_PERCENT\u003e in fy25 on account of a high base effect of fy24 shrinking orderbook and expectation of persistently subdued demand for entry level variants in fy25 said arti roy associate director at careedge ratings strong demand for new model launches and suvs coupled with the expectation of interest rate cuts in the second half of fy25 is expected to keep the sales momentum rolling she added however in line with careedge ratings expectation of volume growth of around \u003cSEVEN_\u003e \u003cNINE_PERCENT\u003e in fy24 the pv industry volumes grew by \u003cSEVEN_PERCENT\u003e in fy24 the ratings said this moderation in year on year volume growth in fy24 was due to the levelling off of pent up demand amid a hike in vehicle prices high base effect of fy23 and the high interest rate environment it said strong order book in fy24 robust demand for new model launches and increasing demand in the sports utility vehicle suv segment kept the sales momentum rolling as per the report while the market for premium vehicles is predicted to thrive driven by a surge in demand for luxury and high end models entry level variants are likely to see continued diminished demand due to a downturn in both rural and urban markets said hardik shah director at careedge ratings the rural sector is feeling the pinch as entry level vehicles are becoming more expensive whereas urban consumers are increasingly opting for suvs reflecting a shift in market preferences shah added","timestamp":"2024-06-24T13:48:00+05:30","market_timestamp":"2024-06-24T13:48:00+05:30","off_market_hours":false}