{"url":"https://www.moneycontrol.com/news/business/hyundai-under-pressure-from-tata-mahindra-as-3-5-billion-india-ipo-looms-12765050.html","title":"Hyundai under pressure from Tata, Mahindra as $3.5 billion India IPO looms","description":"While Hyundai has long wrestled with Tata Motors for the second spot, Mahindra — famed for its big, brash sport utility vehicles — has been steadily climbing up the charts as Indian consumers embrace ever larger passenger vehicles.Hyundai under pressure from Tata, Mahindra as $3.5 billion India IPO loomsRelated stories","content":"Tata Motors Ltd. and Mahindra \u0026 Mahindra Ltd. are closing in on Hyundai Motor Co.’s No. 2 position in India, putting pressure on the South Korean automaker just as it prepares for a record $3.5 billion listing of its local unit. While Hyundai has long wrestled with Tata Motors for the second spot, Mahindra — famed for its big, brash sport utility vehicles — has been steadily climbing up the charts as Indian consumers embrace ever larger passenger vehicles. Hyundai sold 13.5% of all passenger cars in India last month, while Jaguar Land Rover-owner Tata Motors sold 13.2% versus Mahindra’s 12.4%, data from the Federation of Automobile Dealers Associations show. Maruti Suzuki Ltd. is by far and away India’s top carmaker, with a 40% share. The tussle for sales in India, one of the world’s fastest-growing automobile markets, comes just as Hyundai Motor India Ltd. plans to start gauging investor interest ahead of an expected initial public offering in September or October. An IPO of that size would also be one of Asia’s biggest in recent years. Hyundai is a “true leader compared to competitors, holding first and second rank in many categories,” Hyundai India CEO Unsoo Kim said during an investor presentation last week. But Chief Operating Officer Tarun Garg acknowledged that considering the many foreign automakers that have exited the country, “India is not an easy market to crack.” Hyundai is spending around 200 billion rupees ($2.4 billion) in India to develop electric vehicles — still a nascent sector in a country whose road transport industry is characterized by older, gas guzzling trucks and cars — and 70 billion rupees to get its second plant there operational by the back end of 2025. To woo consumers more interested in environmentally friendlier cars, it plans to launch an electric version of its bestselling mid-sized SUV, Creta, in the first quarter of 2025, according to the investor presentation. Tata Motors meanwhile is expanding its EV portfolio by adding 10 models by fiscal 2026. Mahindra plans to invest 270 billion rupees over the next three years to add capacity for making SUVs, as well as EVs. It hopes to launch nine diesel and gas-powered SUVs and seven EVs by 2030. Maruti Suzuki, although it leads India’s car market, currently doesn’t sell any battery-powered cars. “If some market share is lost by Hyundai, that can largely be attributed to product range,” said Deven Choksey, managing director at KR Choksey Shares \u0026 Securities Pvt. Tata Motors and Mahindra, with their appealing designs and competitive pricing, are “extremely challenging brands for all carmakers in India today,” Choksey said. ","cleaned_content":"tata motors ltd and mahindra mahindra ltd are closing in on hyundai motor co s no \u003cTWO_\u003e position in india putting pressure on the south korean automaker just as it prepares for a record \u003cTHREE_\u003e billion listing of its local unit while hyundai has long wrestled with tata motors for the second spot mahindra famed for its big brash sport utility vehicles has been steadily climbing up the charts as indian consumers embrace ever larger passenger vehicles hyundai sold \u003cONE_TEN_PERCENT\u003e of all passenger cars in india last month while jaguar land rover owner tata motors sold \u003cONE_TEN_PERCENT\u003e versus mahindra s \u003cONE_TEN_PERCENT\u003e data from the federation of automobile dealers associations show maruti suzuki ltd is by far and away india s top carmaker with a \u003cFOUR_TEN_PERCENT\u003e share the tussle for sales in india one of the world s fastest growing automobile markets comes just as hyundai motor india ltd plans to start gauging investor interest ahead of an expected initial public offering in september or october an ipo of that size would also be one of asia s biggest in recent years hyundai is a true leader compared to competitors holding first and second rank in many categories hyundai india ceo unsoo kim said during an investor presentation last week but chief operating officer tarun garg acknowledged that considering the many foreign automakers that have exited the country india is not an easy market to crack hyundai is spending around \u003cTWO_HUNDRED\u003e billion rupees \u003cTWO_\u003e billion in india to develop electric vehicles still a nascent sector in a country whose road transport industry is characterized by older gas guzzling trucks and cars and \u003cSEVEN_TEN\u003e billion rupees to get its second plant there operational by the back end of \u003cTWO_THOUSAND\u003e to woo consumers more interested in environmentally friendlier cars it plans to launch an electric version of its bestselling mid sized suv creta in the first quarter of \u003cTWO_THOUSAND\u003e according to the investor presentation tata motors meanwhile is expanding its ev portfolio by adding \u003cONE_TEN\u003e models by fiscal \u003cTWO_THOUSAND\u003e mahindra plans to invest \u003cTWO_HUNDRED\u003e billion rupees over the next three years to add capacity for making suvs as well as evs it hopes to launch nine diesel and gas powered suvs and seven evs by \u003cTWO_THOUSAND\u003e maruti suzuki although it leads india s car market currently doesn t sell any battery powered cars if some market share is lost by hyundai that can largely be attributed to product range said deven choksey managing director at kr choksey shares securities pvt tata motors and mahindra with their appealing designs and competitive pricing are extremely challenging brands for all carmakers in india today choksey said","timestamp":"2024-07-09T11:31:00+05:30","market_timestamp":"2024-07-09T11:31:00+05:30","off_market_hours":false}