{"url":"https://www.moneycontrol.com/news/business/man-industries-gets-rs-1850-crore-order-from-international-firm-for-lng-project-12764440.html","title":"MAN Industries gets Rs 1,850 crore order from international firm for LNG project","description":"This order entails supplying API 5L grade line pipes for an offshore LNG project through competitive international bidding, MAN Industries said in a statement.MAN Industries gets Rs 1,850 crore order from international firm for LNG project","content":"MAN Industries on Monday said it has secured a pipe supply order worth Rs 1,850 crore from an international oil and gas player. This order entails supplying API 5L grade line pipes for an offshore LNG project through competitive international bidding, MAN Industries said in a statement. \"MAN Industries demonstrates robust strength and market credibility through its latest achievement of securing the Rs 1,850 crore order from a top-tier international oil \u0026 gas company, marking one of the largest orders of its kind in the company's history,\" it said. With this, the company's order book will surpass Rs 4,000 crore. MAN Industries (India) is the flagship company of the Man Group. The company's manufacturing facilities have a combined capacity of 1 million metric tonne per annum for L-SAW (longitudinal-seam submerged arc welding) and H-SAW (helical submerged arc welding) pipes. ","cleaned_content":"man industries on monday said it has secured a pipe supply order worth rs \u003cONE_THOUSAND\u003e crore from an international oil and gas player this order entails supplying api \u003cFIVE_\u003e l grade line pipes for an offshore lng project through competitive international bidding man industries said in a statement man industries demonstrates robust strength and market credibility through its latest achievement of securing the rs \u003cONE_THOUSAND\u003e crore order from a top tier international oil gas company marking one of the largest orders of its kind in the companys history it said with this the companys order book will surpass rs \u003cFOUR_THOUSAND\u003e crore man industries india is the flagship company of the man group the companys manufacturing facilities have a combined capacity of \u003cONE_\u003e million metric tonne per annum for l saw longitudinal seam submerged arc welding and h saw helical submerged arc welding pipes","timestamp":"2024-07-08T14:14:00+05:30","market_timestamp":"2024-07-08T14:14:00+05:30","off_market_hours":false}