{"url":"https://www.moneycontrol.com/news/business/mercedes-benz-india-posts-record-half-yearly-sales-at-9262-units-12764441.html","title":"Mercedes-Benz India posts record half-yearly sales at 9,262 units","description":"The company had posted sales of 8,528 units in the January-June period of 2023, which was its previous highest half-yearly sales, Mercedes-Benz India said in a statement.Mercedes-Benz India posts record half-yearly sales at 9,262 unitsRelated stories","content":"German luxury carmaker Mercedes-Benz on Monday reported a 9 per cent growth in sales at 9,262 units in India in the first half of 2024, its highest ever half-yearly sales in the country, riding on strong demand across categories and availability of volume models. The company had posted sales of 8,528 units in the January-June period of 2023, which was its previous highest half-yearly sales, Mercedes-Benz India said in a statement. It plans to launch six new products in the second half (H2) of 2024. The SUV segment saw robust performance from the GLA, GLC, GLE and GLS models, while the sedan portfolio comprising the A-Class, C-Class, outgoing LWB E-Class and S-Class topped customer preference for luxury sedans, it added. The BEV (battery electric vehicle) portfolio grew by 60 per cent in H1 24, comprising 5 per cent of total sales volumes, Mercedes-Benz India said. \"New and updated products, elevated customer experience at retail and ease of ownership, combined with positive customer sentiments boosted our best-ever H1 sales performance,\" Mercedes-Benz India Managing Director \u0026 CEO Santosh Iyer said. The company further said availability of volume models also played a part in delivering record sales in the first half of this year. On the outlook for the rest of the year, Iyer said, \"We have new products coming up for the upcoming festive season. So we feel we should be able to close the year with a double-digit growth as projected earlier.\" ","cleaned_content":"german luxury carmaker mercedes benz on monday reported a \u003cNINE_PERCENT\u003e growth in sales at \u003cNINE_THOUSAND\u003e units in india in the first half of \u003cTWO_THOUSAND\u003e its highest ever half yearly sales in the country riding on strong demand across categories and availability of volume models the company had posted sales of \u003cEIGHT_THOUSAND\u003e units in the january june period of \u003cTWO_THOUSAND\u003e which was its previous highest half yearly sales mercedes benz india said in a statement it plans to launch six new products in the second half h2 of \u003cTWO_THOUSAND\u003e the suv segment saw robust performance from the gla glc gle and gls models while the sedan portfolio comprising the a class c class outgoing lwb e class and s class topped customer preference for luxury sedans it added the bev battery electric vehicle portfolio grew by \u003cSIX_TEN_PERCENT\u003e in h1 \u003cTWO_TEN\u003e comprising \u003cFIVE_PERCENT\u003e of total sales volumes mercedes benz india said new and updated products elevated customer experience at retail and ease of ownership combined with positive customer sentiments boosted our best ever h1 sales performance mercedes benz india managing director ceo santosh iyer said the company further said availability of volume models also played a part in delivering record sales in the first half of this year on the outlook for the rest of the year iyer said we have new products coming up for the upcoming festive season so we feel we should be able to close the year with a double digit growth as projected earlier","timestamp":"2024-07-08T14:20:00+05:30","market_timestamp":"2024-07-08T14:20:00+05:30","off_market_hours":false}