{"url":"https://www.moneycontrol.com/news/business/tata-motors-mahindra-cut-suv-prices-to-boost-demand-12766067.html","title":"Tata Motors, Mahindra cut SUV prices to boost demand","description":"Tata Motors has revised the starting prices of its flagship SUVs, the Harrier (Rs 14.99 lakh) and the Safari (Rs 15.49 lakh) and extended benefits of up to Rs 1.4 lakh on other popular SUV variants.Tata Motors, Mahindra cut SUV prices to boost demand","content":"Tata Motors and Mahindra \u0026 Mahindra have cut the prices of their SUV models to boost demand. Tata Motors has revised the starting prices of its flagship SUVs, the Harrier (Rs 14.99 lakh) and the Safari (Rs 15.49 lakh) and extended benefits of up to Rs 1.4 lakh on other popular SUV variants. \"With regards to electric vehicles, never before seen benefits on the Nexon.ev (up to Rs 1.3 lakh), have made it the most accessible it has ever been,\" Tata Passenger Electric Mobility Chief Commercial Officer Vivek Srivatsa said in a statement. Mahindra \u0026 Mahindra said its XUV700's fully-loaded AX7 range now starts at Rs 19.49 lakh, a price cut of over Rs 2 lakh. The price cut will enable more people to experience the range, it added. ","cleaned_content":"tata motors and mahindra mahindra have cut the prices of their suv models to boost demand tata motors has revised the starting prices of its flagship suvs the harrier rs \u003cONE_TEN\u003e lakh and the safari rs \u003cONE_TEN\u003e lakh and extended benefits of up to rs \u003cONE_\u003e lakh on other popular suv variants with regards to electric vehicles never before seen benefits on the nexon ev up to rs \u003cONE_\u003e lakh have made it the most accessible it has ever been tata passenger electric mobility chief commercial officer vivek srivatsa said in a statement mahindra mahindra said its xuv700s fully loaded ax7 range now starts at rs \u003cONE_TEN\u003e lakh a price cut of over rs \u003cTWO_\u003e lakh the price cut will enable more people to experience the range it added","timestamp":"2024-07-10T14:09:00+05:30","market_timestamp":"2024-07-10T14:09:00+05:30","off_market_hours":false}