{"url":"https://www.moneycontrol.com/news/business/ongc-seeks-us-waiver-to-lift-venezuela-oil-industry-source-says-12766830.html","title":"ONGC higher on hopes of getting US waiver to lift Venezuelan oil","description":"The Reuters report said ONGC is optimistic of winning an exemption from US sanctions on Venezuela.ONGC seeks US waiver to lift Venezuela oil, industry source says","content":"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India's largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela. The report said ONGC is optimistic of winning an approval, according to a source who declining to be named. Earlier this year, US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections. The Reuters report added that ONGC has been hopeful of recovering $500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend, however there has not been much progress on that front so far. Crude oil has rallied this year helped by supply cuts by OPEC+, though a volatility has declined to multi-year lows in June. ","cleaned_content":"shares of oil and natural gas corp are trading higher after reuters reported citing industry source that indias largest oil and gas exploration company has sought a waiver from the u s office of foreign assets control to lift crude oil from venezuela the report said ongc is optimistic of winning an approval according to a source who declining to be named earlier this year us had reimposed sanctions on venezuela citing that the country had broken an accord to hold free and fair elections the reuters report added that ongc has been hopeful of recovering \u003cFIVE_HUNDRED\u003e million worth of dividends pending since \u003cTWO_THOUSAND\u003e for the stake it holds in venezuelan projects ongc has instead sought oil instead of the pending dividend however there has not been much progress on that front so far crude oil has rallied this year helped by supply cuts by opec though a volatility has declined to multi year lows in june","timestamp":"2024-07-11T14:59:00+05:30","market_timestamp":"2024-07-11T14:59:00+05:30","off_market_hours":false}