{"url":"https://www.moneycontrol.com/news/business/welspun-one-raises-rs-2275-crore-for-second-fund-to-build-warehousing-assets-12764275.html","title":"Welspun One raises Rs 2,275 crore for second fund to build warehousing assets","description":"Welspun One, an integrated fund and development management platform, on Monday announced the successful closure of its second fund totalling Rs 2,275 crores, inclusive of co-investment commitments.Welspun One raises Rs 2,275 crore for second fund to build warehousing assetsRelated stories","content":"Welspun One has raised Rs 2,275 crore from investors for its second fund and would use the capital to develop warehousing properties. Welspun One, an integrated fund and development management platform, on Monday announced the successful closure of its second fund totalling Rs 2,275 crores, inclusive of co-investment commitments. This marks the largest domestic fundraise in this space, the company claimed. Welspun One's second fund has already committed nearly 40 per cent of its investible capital across four investments. It expects to commit the remaining capital over the next 3-4 quarters. This will add 8 million square feet to Welspun One's existing portfolio of 10 million square feet, taking their aggregate portfolio to around 18 million square feet, entailing a total project outlay of around USD 1 billion. Welspun One's focus for fund 2 is on new-age warehousing assets, such as urban distribution centres, cold chain, agro logistics, and port and airport-based logistics, the statement said. Balkrishan Goenka, Chairman of Welspun World, said, \"Our commitment to advancing critical logistics infrastructure is in perfect alignment with India's strategic objective of reducing logistics costs from 14 per cent to 8 per cent, thereby enhancing the global competitiveness of our industries.\" By making investments in essential infrastructure, he said the fund aims to streamline logistics operations and stimulate industrial growth. Anshul Singhal, Managing Director, Welspun One, said, \"Embarking on the exploration of new-age warehousing assets represents an exciting journey for us at Welspun One. Our progress has been remarkable, having successfully established a well-capitalized platform poised to achieve an AUM of over USD 1 billion.\" Welspun One had raised Rs 500 crore in its first fund. Till date, Welspun One's first fund is fully committed with six investments, aggregating to a development potential of 7.2 million square feet across 300 acres of land in five cities. Currently, about 50 per cent of this is already delivered, with the remaining 50 per cent scheduled for delivery over the next 4-6 quarters. The portfolio includes clients such as Tata Croma, Delhivery, FM Logistics, Asian Paints, and Ecom Express, amongst others. Welspun One is the warehousing platform of the USD 5 billion global conglomerate Welspun World, which is one of India's fastest-growing multinationals with a leadership position in line pipes, home textiles, infrastructure, advanced textiles, and flooring solutions. ","cleaned_content":"welspun one has raised rs \u003cTWO_THOUSAND\u003e crore from investors for its second fund and would use the capital to develop warehousing properties welspun one an integrated fund and development management platform on monday announced the successful closure of its second fund totalling rs \u003cTWO_THOUSAND\u003e crores inclusive of co investment commitments this marks the largest domestic fundraise in this space the company claimed welspun ones second fund has already committed nearly \u003cFOUR_TEN_PERCENT\u003e of its investible capital across four investments it expects to commit the remaining capital over the next \u003cTHREE_\u003e \u003cFOUR_\u003e quarters this will add \u003cEIGHT_\u003e million square feet to welspun ones existing portfolio of \u003cONE_TEN\u003e million square feet taking their aggregate portfolio to around \u003cONE_TEN\u003e million square feet entailing a total project outlay of around usd \u003cONE_\u003e billion welspun ones focus for fund \u003cTWO_\u003e is on new age warehousing assets such as urban distribution centres cold chain agro logistics and port and airport based logistics the statement said balkrishan goenka chairman of welspun world said our commitment to advancing critical logistics infrastructure is in perfect alignment with indias strategic objective of reducing logistics costs from \u003cONE_TEN_PERCENT\u003e to \u003cEIGHT_PERCENT\u003e thereby enhancing the global competitiveness of our industries by making investments in essential infrastructure he said the fund aims to streamline logistics operations and stimulate industrial growth anshul singhal managing director welspun one said embarking on the exploration of new age warehousing assets represents an exciting journey for us at welspun one our progress has been remarkable having successfully established a well capitalized platform poised to achieve an aum of over usd \u003cONE_\u003e billion welspun one had raised rs \u003cFIVE_HUNDRED\u003e crore in its first fund till date welspun ones first fund is fully committed with six investments aggregating to a development potential of \u003cSEVEN_\u003e million square feet across \u003cTHREE_HUNDRED\u003e acres of land in five cities currently about \u003cFIVE_TEN_PERCENT\u003e of this is already delivered with the remaining \u003cFIVE_TEN_PERCENT\u003e scheduled for delivery over the next \u003cFOUR_\u003e \u003cSIX_\u003e quarters the portfolio includes clients such as tata croma delhivery fm logistics asian paints and ecom express amongst others welspun one is the warehousing platform of the usd \u003cFIVE_\u003e billion global conglomerate welspun world which is one of indias fastest growing multinationals with a leadership position in line pipes home textiles infrastructure advanced textiles and flooring solutions","timestamp":"2024-07-08T19:07:00+05:30","market_timestamp":"2024-07-09T09:15:00+05:30","off_market_hours":true}