{"url":"https://www.moneycontrol.com/news/business/want-continuity-of-policy-supporting-evs-for-next-8-10-years-mercedes-benz-india-md-ceo-12762194.html","title":"Want continuity of policy supporting EVs for next 8-10 years: Mercedes-Benz India MD \u0026 CEO","description":"Besides, the company feels that providing the incentives given to electric vehicles to hybrid vehicles will extend the timeline for transition to emission free mobility.Want continuity of policy supporting EVs for next 8-10 years: Mercedes-Benz India MD \u0026 CEORelated stories","content":"Mercedes-Benz India wants the government to commit to continuity in policies that support electric mobility for the next eight to ten years, for stable and better planning towards zero emission mobility, its Managing Director and CEO Santosh Iyer said on Tuesday. Besides, the company feels that providing the incentives given to electric vehicles to hybrid vehicles will extend the timeline for transition to emission free mobility. The company, which had increased EV penetration to 6 per cent in the first quarter of 2024, from 2.5 per cent earlier, expects the momentum to carry going forward with three new EV models slated for launch this year, starting with the EQA next week. \"We understand that the Budget may not address the GST topic, but at least if you are able to get a commitment that for the next eight to ten years, this kind of taxation benefit will continue, this will really help brands like us to plan long term and have more commitments when it comes to investments for the EVs,\" he said. For electric vehicles the government has already given 5 per cent GST compared to 48-50 per cent on internal combustion engines, Iyer added. Highlighting investment on infrastructure as another key aspect, he said, \"One of the biggest drivers for our growth has been the growing road infrastructure and intercity road infrastructure that has come up in the last couple of years.\" He further said, \"one big line item that we will see in the Budget is the capital expenditure on infrastructure. We expect (it) to go up if possible, so that not only it helps demand but also the indirect benefits of it for the country also is great.\" When asked about the discussions on extending the GST benefits given to EVs on hybrid vehicles, Iyer said, \"Currently we can see electric as the only option when it comes to zero emission driving. Now on that road, if we add newer technologies, it will delay the transition, for sure.\" Iyer further said, \"It is up to the government and the stakeholders to see how soon they want to accelerate the transformation to carbon free mobility and emission free mobility.\" On the company's roadmap for electric mobility, he said it is committed to zero emission mobility but \"the EV transition is a marathon and not a sprint\". \"We have already three (EV) products in the market with which we achieved 5-6 per cent penetration and we will continue with the EQA (to be launched next week) to further penetrate,\" Iyer said. Two more EV models will be launched later this year, he added. In the first quarter of 2024, the company had posted total sales of 5,412 units, growth of 15 per cent from the year-ago period. On local assembly of EVs in India, Iyer said Mercedes-Benz India will consider other models too depending on demand. It currently assembles EQS at its Chakan plant. ","cleaned_content":"mercedes benz india wants the government to commit to continuity in policies that support electric mobility for the next eight to ten years for stable and better planning towards zero emission mobility its managing director and ceo santosh iyer said on tuesday besides the company feels that providing the incentives given to electric vehicles to hybrid vehicles will extend the timeline for transition to emission free mobility the company which had increased ev penetration to \u003cSIX_PERCENT\u003e in the first quarter of \u003cTWO_THOUSAND\u003e from \u003cTWO_PERCENT\u003e earlier expects the momentum to carry going forward with three new ev models slated for launch this year starting with the eqa next week we understand that the budget may not address the gst topic but at least if you are able to get a commitment that for the next eight to ten years this kind of taxation benefit will continue this will really help brands like us to plan long term and have more commitments when it comes to investments for the evs he said for electric vehicles the government has already given \u003cFIVE_PERCENT\u003e gst compared to \u003cFOUR_TEN\u003e \u003cFIVE_TEN_PERCENT\u003e on internal combustion engines iyer added highlighting investment on infrastructure as another key aspect he said one of the biggest drivers for our growth has been the growing road infrastructure and intercity road infrastructure that has come up in the last couple of years he further said one big line item that we will see in the budget is the capital expenditure on infrastructure we expect it to go up if possible so that not only it helps demand but also the indirect benefits of it for the country also is great when asked about the discussions on extending the gst benefits given to evs on hybrid vehicles iyer said currently we can see electric as the only option when it comes to zero emission driving now on that road if we add newer technologies it will delay the transition for sure iyer further said it is up to the government and the stakeholders to see how soon they want to accelerate the transformation to carbon free mobility and emission free mobility on the companys roadmap for electric mobility he said it is committed to zero emission mobility but the ev transition is a marathon and not a sprint we have already three ev products in the market with which we achieved \u003cFIVE_\u003e \u003cSIX_PERCENT\u003e penetration and we will continue with the eqa to be launched next week to further penetrate iyer said two more ev models will be launched later this year he added in the first quarter of \u003cTWO_THOUSAND\u003e the company had posted total sales of \u003cFIVE_THOUSAND\u003e units growth of \u003cONE_TEN_PERCENT\u003e from the year ago period on local assembly of evs in india iyer said mercedes benz india will consider other models too depending on demand it currently assembles eqs at its chakan plant","timestamp":"2024-07-04T13:36:00+05:30","market_timestamp":"2024-07-04T13:36:00+05:30","off_market_hours":false}