{"url":"https://www.moneycontrol.com/news/business/jsw-mg-motor-joins-hands-with-shell-for-ev-charging-infra-12765966.html","title":"JSW MG Motor joins hands with Shell for EV charging infra","description":"As per the partnership, JSW MG Motor India customers will be able to leverage Shell's wide fuel station network across the country for vehicle charging.Moneycontrol has exclusively reported that JSW MG Motor India, has lined up a slew of products, including Plug-in Hybrid Electric Vehicles and also Battey Electric Vehicles.Related stories","content":"JSW MG Motor India, known as MG Motor India Pvt Ltd until early this year, has joined hands with Shell India to enhance public charging infrastructure for Electric Vehicles (EVs) across the country. As per the partnership, JSW MG Motor India customers will be able to leverage on Shell's fuel station network across the country for vehicle charging. As per the Memorandum of Understanding (MoU) inked, Shell India will deploy CCS 50kW and 60kW DC fast chargers at various locations throughout India, bolstering the EV charging network and facilitating long-distance travel for EV users, the carmaker said in a statement. \"The expansion of infrastructure will make EV fast charging more convenient, accessible and enable EV customers to plan hassle-free long-distance journeys,\" stated JSW MG Motor India Chief Growth Officer Gaurav Gupta. Shell India claimed that its charging stations provide \"reliable\" and \"ultra-fast charging\", with a 98-99 percent charger uptime. \"Our strategic partnership with JSW MG Motor India aims to promote the widespread adoption of electric vehicles in the country by leveraging digital integration and customer-centric initiatives,\" said Shell India Markets Director Sanjay Varkey. ","cleaned_content":"jsw mg motor india known as mg motor india pvt ltd until early this year has joined hands with shell india to enhance public charging infrastructure for electric vehicles evs across the country as per the partnership jsw mg motor india customers will be able to leverage on shells fuel station network across the country for vehicle charging as per the memorandum of understanding mou inked shell india will deploy ccs \u003cFIVE_TEN\u003e kw and \u003cSIX_TEN\u003e kw dc fast chargers at various locations throughout india bolstering the ev charging network and facilitating long distance travel for ev users the carmaker said in a statement the expansion of infrastructure will make ev fast charging more convenient accessible and enable ev customers to plan hassle free long distance journeys stated jsw mg motor india chief growth officer gaurav gupta shell india claimed that its charging stations provide reliable and ultra fast charging with a \u003cNINE_TEN\u003e \u003cNINE_TEN_PERCENT\u003e charger uptime our strategic partnership with jsw mg motor india aims to promote the widespread adoption of electric vehicles in the country by leveraging digital integration and customer centric initiatives said shell india markets director sanjay varkey","timestamp":"2024-07-10T15:08:00+05:30","market_timestamp":"2024-07-10T15:08:00+05:30","off_market_hours":false}