{"url":"https://www.moneycontrol.com/news/business/jlr-india-retail-sales-rise-31-at-1371-units-in-q1-12766030.html","title":"JLR India retail sales rise 31% at 1,371 units in Q1","description":"The automaker had retailed 1,048 units in the April-June quarter of last fiscal.JLR India retail sales rise 31% at 1,371 units in Q1","content":"Jaguar Land Rover India on Wednesday said its retail sales increased 31 per cent year-on-year to 1,371 units for the first quarter ended June 30, 2024. The automaker had retailed 1,048 units in the April-June quarter of last fiscal. Sales of both Defender and Range Rover Evoque grew by more than 50 per cent with Defender being the highest-selling model in the portfolio, the company part of Tata Motors said in a statement. \"Our performance is tracking favourably as per our expectations. Alongside our robust sales, our order bank also grew by 10 per cent compared to the beginning of the fiscal year showing continuous growth in demand while we continue to enhance our supplies into the market,\" JLR India MD Rajan Amba said. The Defender remains the most sought-after model, and with the extraordinary response to the locally manufactured Range Rover and Range Rover Sport, the company remains confident of sustaining this momentum and delivering another successful year, he added. The Indian market is responding well to our exciting product lineup, Amba stated. ","cleaned_content":"jaguar land rover india on wednesday said its retail sales increased \u003cTHREE_TEN_PERCENT\u003e year on year to \u003cONE_THOUSAND\u003e units for the first quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the automaker had retailed \u003cONE_THOUSAND\u003e units in the april june quarter of last fiscal sales of both defender and range rover evoque grew by more than \u003cFIVE_TEN_PERCENT\u003e with defender being the highest selling model in the portfolio the company part of tata motors said in a statement our performance is tracking favourably as per our expectations alongside our robust sales our order bank also grew by \u003cONE_TEN_PERCENT\u003e compared to the beginning of the fiscal year showing continuous growth in demand while we continue to enhance our supplies into the market jlr india md rajan amba said the defender remains the most sought after model and with the extraordinary response to the locally manufactured range rover and range rover sport the company remains confident of sustaining this momentum and delivering another successful year he added the indian market is responding well to our exciting product lineup amba stated","timestamp":"2024-07-10T13:38:00+05:30","market_timestamp":"2024-07-10T13:38:00+05:30","off_market_hours":false}