{"url":"https://www.moneycontrol.com/news/business/alembic-pharma-gets-usfda-nod-for-generic-bromfenac-ophthalmic-solution-12765230.html","title":"Alembic Pharma gets USFDA nod for generic Bromfenac ophthalmic solution","description":"The approval by the US Food \u0026 Drug Administration (USFDA) is for the abbreviated new drug application (ANDA) for Bromfenac Ophthalmic Solution, 0.07 per cent, Alembic Pharmaceuticals said in a regulatory filing.Alembic Pharma gets USFDA nod for generic Bromfenac ophthalmic solution","content":"Alembic Pharmaceuticals Ltd on Tuesday said it has received final approval from the US health regulator for its generic Bromfenac ophthalmic solution, which is indicated for the treatment of postoperative inflammation and pain in patients who have undergone cataract surgery. The approval by the US Food \u0026 Drug Administration (USFDA) is for the abbreviated new drug application (ANDA) for Bromfenac Ophthalmic Solution, 0.07 per cent, Alembic Pharmaceuticals said in a regulatory filing. The approved ANDA is therapeutically equivalent to the Reference Listed Drug (RLD) product, Prolensa Ophthalmic Solution, 0.07 per cent of Bausch \u0026 Lomb Incorporated (Bausch), it added. It has an estimated market size of USD 168 million for 12 months ended March 2024, Alembic said citing IQVIA data. ","cleaned_content":"alembic pharmaceuticals ltd on tuesday said it has received final approval from the us health regulator for its generic bromfenac ophthalmic solution which is indicated for the treatment of postoperative inflammation and pain in patients who have undergone cataract surgery the approval by the us food drug administration usfda is for the abbreviated new drug application anda for bromfenac ophthalmic solution \u003cZERO_PERCENT\u003e alembic pharmaceuticals said in a regulatory filing the approved anda is therapeutically equivalent to the reference listed drug rld product prolensa ophthalmic solution \u003cZERO_PERCENT\u003e of bausch lomb incorporated bausch it added it has an estimated market size of usd \u003cONE_HUNDRED\u003e million for \u003cONE_TEN\u003e months ended march \u003cTWO_THOUSAND\u003e alembic said citing iqvia data","timestamp":"2024-07-09T14:25:00+05:30","market_timestamp":"2024-07-09T14:25:00+05:30","off_market_hours":false}