{"url":"https://www.moneycontrol.com/news/business/boeing-warns-customers-of-further-delays-on-737-max-12767365.html","title":"Boeing warns customers of further delays on 737 Max","description":"Reuters reported last month citing two industry sources that Boeing informed its suppliers it was delaying a key production milestone for its 737 jet family by three months as Boeing's jet production has slowed sharply in the face of increased scrutiny from regulators, airlines and lawmakers.Boeing warns customers of further delays on 737 Max","content":"Boeing has notified some 737 Max customers in recent weeks that aircraft due for delivery in 2025 and 2026 might face additional delays of three to six months, Bloomberg News reported on Thursday, citing people familiar with the matter. Boeing did not immediately respond to a Reuters request for comment. Reuters reported last month citing two industry sources that Boeing informed its suppliers it was delaying a key production milestone for its 737 jet family by three months as Boeing's jet production has slowed sharply in the face of increased scrutiny from regulators, airlines and lawmakers. The planemaker in May had said that deliveries will not increase in the second quarter as originally expected. ","cleaned_content":"boeing has notified some \u003cSEVEN_HUNDRED\u003e max customers in recent weeks that aircraft due for delivery in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e might face additional delays of three to six months bloomberg news reported on thursday citing people familiar with the matter boeing did not immediately respond to a reuters request for comment reuters reported last month citing two industry sources that boeing informed its suppliers it was delaying a key production milestone for its \u003cSEVEN_HUNDRED\u003e jet family by three months as boeings jet production has slowed sharply in the face of increased scrutiny from regulators airlines and lawmakers the planemaker in may had said that deliveries will not increase in the second quarter as originally expected","timestamp":"2024-07-12T08:45:00+05:30","market_timestamp":"2024-07-12T09:15:00+05:30","off_market_hours":true}