{"url":"https://www.moneycontrol.com/news/business/maruti-suzuki-plans-to-dispatch-35-of-total-vehicle-production-via-railways-in-7-8-years-12764439.html","title":"Maruti Suzuki plans to dispatch 35% of total vehicle production via railways in 7-8 years","description":"The share of vehicle dispatches through railways scaled to 21.5 per cent in the 2023-24 fiscal from 5 per cent in 2014-15.Maruti Suzuki plans to dispatch 35% of total vehicle production via railways in 7-8 yearsRelated stories","content":"Maruti Suzuki India plans to utilise Indian Railways to transport 35 per cent of the vehicles produced across its factories over the next 7-8 years, according to MD and CEO Hisashi Takeuchi. The share of vehicle dispatches through railways scaled to 21.5 per cent in the 2023-24 fiscal from 5 per cent in 2014-15. The country's largest carmaker's vehicle dispatches through railways increased from 65,700 units in 2014-15 to 4,47,750 units in 2023-24. Maruti Suzuki has so far dispatched over 20 lakh units through Indian Railways. The automaker ferries vehicles to 20 destinations, serving over 450 cities using Indian railways. Takeuchi said the company pioneered the use of railways for vehicle dispatches over a decade ago by becoming the first company in India to obtain the Automobile-Freight-Train-Operator license. Since then, the company has systematically increased its share of vehicle dispatches using railways, he added. \"Through our sustained efforts in green logistics, we have achieved outstanding results including cumulative reduction of 10,000 metric tonne of CO2 emissions and 270 million litre of cumulative fuel savings,\" Takeuchi noted. The company stands committed to the country's net zero emissions target by 2070, he added. Earlier this year, under the PM Gati Shakti programme, Prime Minister Narendra Modi inaugurated the country's first automobile in-plant railway siding at Maruti Suzuki's Gujarat facility. This facility has a capacity to dispatch 3 lakh vehicles per annum. The next in-plant railway siding is in progress at the company's Manesar facility and will be operational soon, the automaker stated. ","cleaned_content":"maruti suzuki india plans to utilise indian railways to transport \u003cTHREE_TEN_PERCENT\u003e of the vehicles produced across its factories over the next \u003cSEVEN_\u003e \u003cEIGHT_\u003e years according to md and ceo hisashi takeuchi the share of vehicle dispatches through railways scaled to \u003cTWO_TEN_PERCENT\u003e in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal from \u003cFIVE_PERCENT\u003e in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e the countrys largest carmakers vehicle dispatches through railways increased from \u003cSIX_TEN_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e \u003cONE_TEN\u003e to \u003cFOUR_HUNDRED_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e maruti suzuki has so far dispatched over \u003cTWO_TEN\u003e lakh units through indian railways the automaker ferries vehicles to \u003cTWO_TEN\u003e destinations serving over \u003cFOUR_HUNDRED\u003e cities using indian railways takeuchi said the company pioneered the use of railways for vehicle dispatches over a decade ago by becoming the first company in india to obtain the automobile freight train operator license since then the company has systematically increased its share of vehicle dispatches using railways he added through our sustained efforts in green logistics we have achieved outstanding results including cumulative reduction of \u003cONE_TEN_THOUSAND\u003e metric tonne of co2 emissions and \u003cTWO_HUNDRED\u003e million litre of cumulative fuel savings takeuchi noted the company stands committed to the countrys net zero emissions target by \u003cTWO_THOUSAND\u003e he added earlier this year under the pm gati shakti programme prime minister narendra modi inaugurated the countrys first automobile in plant railway siding at maruti suzukis gujarat facility this facility has a capacity to dispatch \u003cTHREE_\u003e lakh vehicles per annum the next in plant railway siding is in progress at the companys manesar facility and will be operational soon the automaker stated","timestamp":"2024-07-08T14:10:00+05:30","market_timestamp":"2024-07-08T14:10:00+05:30","off_market_hours":false}