{"url":"https://www.moneycontrol.com/news/business/juniper-green-inks-pacts-to-supply-480-mw-from-solar-wind-hybrid-projects-12766032.html","title":"Juniper Green inks pacts to supply 480 MW from solar-wind hybrid projects","description":"According to a company statement, GUVNL Hybrid Phase 1 project has 190 MW of hybrid capacity (140 MW solar and 50 MW wind). It is set to generate 412 million units of electricity annually, offsetting 3,84,067 tonne of CO2 and supplying clean energy to 82,016 households.Juniper Green inks pacts to supply 480 MW from solar-wind hybrid projects","content":"Juniper Green Energy on Wednesday said it has inked two pacts for supply of 480 MW electricity from its solar-wind hybrid capacity to Gujarat Urja Vikas Nigam (GUVNL) and NTPC. According to a company statement, GUVNL Hybrid Phase 1 project has 190 MW of hybrid capacity (140 MW solar and 50 MW wind). It is set to generate 412 million units of electricity annually, offsetting 3,84,067 tonne of CO2 and supplying clean energy to 82,016 households. NTPC Hybrid Tranche -1 comprises 290 MW of hybrid capacity (210 MW solar and 80 MW wind) across Gujarat and Rajasthan. This project will produce 633 MU of electricity per year, reducing carbon emissions by 5,90,810 tonne and powering 1,26,165 households. \"These strategic partnerships with GUVNL and NTPC signify more than just contracts; they represent our collaborative efforts towards pioneering hybrid energy solutions,\" said Naresh Mansukhani, CEO of Juniper Green Energy. ","cleaned_content":"juniper green energy on wednesday said it has inked two pacts for supply of \u003cFOUR_HUNDRED\u003e mw electricity from its solar wind hybrid capacity to gujarat urja vikas nigam guvnl and ntpc according to a company statement guvnl hybrid phase \u003cONE_\u003e project has \u003cONE_HUNDRED\u003e mw of hybrid capacity \u003cONE_HUNDRED\u003e mw solar and \u003cFIVE_TEN\u003e mw wind it is set to generate \u003cFOUR_HUNDRED\u003e million units of electricity annually offsetting \u003cTHREE_HUNDRED_THOUSAND\u003e tonne of co2 and supplying clean energy to \u003cEIGHT_TEN_THOUSAND\u003e households ntpc hybrid tranche \u003cONE_\u003e comprises \u003cTWO_HUNDRED\u003e mw of hybrid capacity \u003cTWO_HUNDRED\u003e mw solar and \u003cEIGHT_TEN\u003e mw wind across gujarat and rajasthan this project will produce \u003cSIX_HUNDRED\u003e mu of electricity per year reducing carbon emissions by \u003cFIVE_HUNDRED_THOUSAND\u003e tonne and powering \u003cONE_HUNDRED_THOUSAND\u003e households these strategic partnerships with guvnl and ntpc signify more than just contracts they represent our collaborative efforts towards pioneering hybrid energy solutions said naresh mansukhani ceo of juniper green energy","timestamp":"2024-07-10T13:43:00+05:30","market_timestamp":"2024-07-10T13:43:00+05:30","off_market_hours":false}