{"url":"https://www.moneycontrol.com/news/business/ubs-loses-another-senior-india-banker-with-strategy-yet-unclear-12762254.html","title":"UBS loses another senior India banker with strategy yet unclear","description":"Aditya Goenka, a Mumbai-based managing director in structured lending, is leaving to join HSBC Holdings Plc in its commercial banking business, the people said, asking not to be named as the information is private. UBS loses another senior India banker with strategy yet unclearRelated stories","content":"UBS Group AG’s India operation is losing another senior executive to competitors, at a time when the firm is still charting its strategy to manage wealth in the country, according to people familiar with the matter. Aditya Goenka, a Mumbai-based managing director in structured lending, is leaving to join HSBC Holdings Plc in its commercial banking business, the people said, asking not to be named as the information is private. UBS, which exited India’s onshore wealth business about a decade ago, is seeking to lean on the Credit Suisse team it acquired to make a comeback there. While margins in India are slimmer than other markets, the firm sees there is opportunity in managing both the business and personal assets of clients benefiting from the boom in the stock market and economy. Goenka has been at Credit Suisse for more than 11 years, according to his LinkedIn profile. He was previously with Bank of America Corp. for nearly eight years, according to the profile. Spokespeople from UBS and HSBC declined to comment. Goenka didn’t respond to messages seeking comment. At HSBC, Goenka will join his ex-Credit Suisse colleague Rajat Sabharwal who led its equities business in the country until the end of last year, according to his LinkedIn profile. Sabharwal is now in a similar role at HSBC, the profile states. Other Credit Suisse departees are Sudipto Sinha, an executive director, who is now a business head at Angel One Wealth, as well as Sandipan Roy, the head of product development, who is now the chief investment officer at Motilal Oswal Wealth Management Ltd. Liechtenstein royal family-backed LGT Wealth India hired veteran relationship manager Ajay Punjabi as well as Chirag Doshi to lead its fixed income business. Vijay Shah, the head of advisory and sales in wealth management, also left the bank to start his own business, according to his LinkedIn profile. Credit Suisse had just over 40 wealth management employees in India, and around 7,000 people overall in the country, a spokesperson at the bank told Bloomberg News in April last year. About a month ago, UBS’ co-head for Asia-Pacific wealth management Jin Yee Young visited India, which she called a key strategic market. The firm is rebuilding in markets such as India, according to its Asia Pacific president Edmund Koh. “It’s a good market for us, but still early days in India, still a lot of heavy lifting to do,” Koh had said. ","cleaned_content":"ubs group ag s india operation is losing another senior executive to competitors at a time when the firm is still charting its strategy to manage wealth in the country according to people familiar with the matter aditya goenka a mumbai based managing director in structured lending is leaving to join hsbc holdings plc in its commercial banking business the people said asking not to be named as the information is private ubs which exited india s onshore wealth business about a decade ago is seeking to lean on the credit suisse team it acquired to make a comeback there while margins in india are slimmer than other markets the firm sees there is opportunity in managing both the business and personal assets of clients benefiting from the boom in the stock market and economy goenka has been at credit suisse for more than \u003cONE_TEN\u003e years according to his linkedin profile he was previously with bank of america corp for nearly eight years according to the profile spokespeople from ubs and hsbc declined to comment goenka didn t respond to messages seeking comment at hsbc goenka will join his ex credit suisse colleague rajat sabharwal who led its equities business in the country until the end of last year according to his linkedin profile sabharwal is now in a similar role at hsbc the profile states other credit suisse departees are sudipto sinha an executive director who is now a business head at angel one wealth as well as sandipan roy the head of product development who is now the chief investment officer at motilal oswal wealth management ltd liechtenstein royal family backed lgt wealth india hired veteran relationship manager ajay punjabi as well as chirag doshi to lead its fixed income business vijay shah the head of advisory and sales in wealth management also left the bank to start his own business according to his linkedin profile credit suisse had just over \u003cFOUR_TEN\u003e wealth management employees in india and around \u003cSEVEN_THOUSAND\u003e people overall in the country a spokesperson at the bank told bloomberg news in april last year about a month ago ubs co head for asia pacific wealth management jin yee young visited india which she called a key strategic market the firm is rebuilding in markets such as india according to its asia pacific president edmund koh it s a good market for us but still early days in india still a lot of heavy lifting to do koh had said","timestamp":"2024-07-04T14:34:00+05:30","market_timestamp":"2024-07-04T14:34:00+05:30","off_market_hours":false}