{"url":"https://www.moneycontrol.com/news/business/vedanta-to-raise-up-to-rs-1000-crore-via-debentures-12766869.html","title":"Vedanta to raise up to Rs 1,000 crore via debentures","description":"In a regulatory filing the company said, its directors have approved the allotment of 1,00,000 non-convertible debentures aggregating to Rs 1,000 crore on a private placement basis.Vedanta to raise up to Rs 1,000 crore via debentures","content":"Mining conglomerate Vedanta Ltd on Thursday said it plans to raise up to Rs 1,000 crore through the issuance of debentures. In a regulatory filing the company said, its directors have approved the allotment of 1,00,000 non-convertible debentures aggregating to Rs 1,000 crore on a private placement basis. \"The duly constituted committee of directors of the company has approved the allotment of 1,00,000 secured, rated, listed, redeemable, non-convertible debentures (NCDs) of face value Rs 1,00,000 each aggregating to Rs 1,000 crore on a private placement basis,\" the filing said. Spanning across India, South Africa, Namibia, Liberia, UAE, Korea, Taiwan and Japan with significant operations in oil and gas, zinc, lead, silver, copper, iron ore, steel, nickel, aluminium, power and glass substrate and foraying into semiconductors and display glass. ","cleaned_content":"mining conglomerate vedanta ltd on thursday said it plans to raise up to rs \u003cONE_THOUSAND\u003e crore through the issuance of debentures in a regulatory filing the company said its directors have approved the allotment of \u003cONE_HUNDRED_THOUSAND\u003e non convertible debentures aggregating to rs \u003cONE_THOUSAND\u003e crore on a private placement basis the duly constituted committee of directors of the company has approved the allotment of \u003cONE_HUNDRED_THOUSAND\u003e secured rated listed redeemable non convertible debentures ncds of face value rs \u003cONE_HUNDRED_THOUSAND\u003e each aggregating to rs \u003cONE_THOUSAND\u003e crore on a private placement basis the filing said spanning across india south africa namibia liberia uae korea taiwan and japan with significant operations in oil and gas zinc lead silver copper iron ore steel nickel aluminium power and glass substrate and foraying into semiconductors and display glass","timestamp":"2024-07-11T14:03:00+05:30","market_timestamp":"2024-07-11T14:03:00+05:30","off_market_hours":false}