{"url":"https://www.moneycontrol.com/news/business/signature-global-to-invest-rs-2500-crore-on-construction-of-current-housing-projects-in-fy25-cmd-12766094.html","title":"Signature Global to invest Rs 2,500 crore on construction of current housing projects in FY25: CMD","description":"According to a regulatory filing, Signature Global sold 968 units in the first quarter of this fiscal against 894 units in the corresponding period of the previous year.Signature Global to invest Rs 2,500 crore on construction of current housing projects in FY25: CMDRelated stories","content":"Realty firm Signature Global will invest around Rs 2,500 crore this fiscal on the construction of its various housing projects, its Chairman Pradeep Kumar Aggarwal said on Wednesday. He expressed confidence that the company would meet the sales bookings guidance of Rs 10,000 crore for the current 2024-25 financial year, a significant growth from Rs 7,270 crore in the preceding year. \"We have speeded up the construction work across all our projects. We will be investing around Rs 2,500 crore during this financial year on pure construction activities,\" Aggarwal said on the sidelines of the Assocham real estate conference. The company would also utilise the surplus internal cash flow to acquire land and reduce debt, he added. \"We are looking for land in Noida and Delhi markets for the development of housing projects,\" he said, adding that the company intends to launch projects in these two new cities during 2025-26. On Sunday, Signature Global reported a 3.5 times jump in sales bookings to Rs 3,120 crore for the April-June quarter on high demand for its housing projects. The company's sales bookings stood at Rs 820 crore in the year-ago period. According to a regulatory filing, Signature Global sold 968 units in the first quarter of this fiscal against 894 units in the corresponding period of the previous year. In terms of volume, its sales bookings more than doubled to 2.03 million square feet from 0.91 million square feet a year earlier. Signature Global said the company continues to ride on a high growth trajectory, achieving robust pre-sales and collection figures for the third consecutive quarter. Signature Global, which got listed on the stock exchanges, has so far delivered 10.4 million square feet of housing area. It has a robust pipeline of about 32.2 million square feet of saleable area in its forthcoming projects and 16.4 million square feet in its ongoing projects. Founded in 2014, Signature Global, one of the leading real estate developers in India focused only on affordable housing projects in its initial years of establishment. The company has expanded its presence into mid-income, premium and luxury housing segments. ","cleaned_content":"realty firm signature global will invest around rs \u003cTWO_THOUSAND\u003e crore this fiscal on the construction of its various housing projects its chairman pradeep kumar aggarwal said on wednesday he expressed confidence that the company would meet the sales bookings guidance of rs \u003cONE_TEN_THOUSAND\u003e crore for the current \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year a significant growth from rs \u003cSEVEN_THOUSAND\u003e crore in the preceding year we have speeded up the construction work across all our projects we will be investing around rs \u003cTWO_THOUSAND\u003e crore during this financial year on pure construction activities aggarwal said on the sidelines of the assocham real estate conference the company would also utilise the surplus internal cash flow to acquire land and reduce debt he added we are looking for land in noida and delhi markets for the development of housing projects he said adding that the company intends to launch projects in these two new cities during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e on sunday signature global reported a \u003cTHREE_\u003e times jump in sales bookings to rs \u003cTHREE_THOUSAND\u003e crore for the april june quarter on high demand for its housing projects the companys sales bookings stood at rs \u003cEIGHT_HUNDRED\u003e crore in the year ago period according to a regulatory filing signature global sold \u003cNINE_HUNDRED\u003e units in the first quarter of this fiscal against \u003cEIGHT_HUNDRED\u003e units in the corresponding period of the previous year in terms of volume its sales bookings more than doubled to \u003cTWO_\u003e million square feet from \u003cZERO_\u003e million square feet a year earlier signature global said the company continues to ride on a high growth trajectory achieving robust pre sales and collection figures for the third consecutive quarter signature global which got listed on the stock exchanges has so far delivered \u003cONE_TEN\u003e million square feet of housing area it has a robust pipeline of about \u003cTHREE_TEN\u003e million square feet of saleable area in its forthcoming projects and \u003cONE_TEN\u003e million square feet in its ongoing projects founded in \u003cTWO_THOUSAND\u003e signature global one of the leading real estate developers in india focused only on affordable housing projects in its initial years of establishment the company has expanded its presence into mid income premium and luxury housing segments","timestamp":"2024-07-10T14:33:00+05:30","market_timestamp":"2024-07-10T14:33:00+05:30","off_market_hours":false}