{"url":"https://www.moneycontrol.com/news/business/electric-mobility-startup-vidyut-launches-offline-pre-owned-ev-sales-financing-platform-12766751.html","title":"Electric mobility startup Vidyut launches offline pre-owned EV sales, financing platform","description":"The latest offline services have been made available in Delhi-NCR, Hyderabad and Bengaluru to begin with, while the plans are to expand them into six more markets including Mumbai, Chennai, Pune, Lucknow, Agra and Kanpur by the end of this fiscal, Vidyut said.Electric mobility startup Vidyut launches offline pre-owned EV sales, financing platformRelated stories","content":"Bengaluru-based electric mobility startup Vidyut on Thursday announced the launch of its offline pre-owned EV sales and financing platform. The latest offline services have been made available in Delhi-NCR, Hyderabad and Bengaluru to begin with, while the plans are to expand them into six more markets including Mumbai, Chennai, Pune, Lucknow, Agra and Kanpur by the end of this fiscal, Vidyut said. The company said it plans to launch an online marketplace as well in the next six months. Currently, the platform offers resale of electric commercial three-wheelers from brands such as Mahindra, Piaggio, Euler Motors, Greaves and Altigreen, among others, it said. \"Absence of a robust resale market is one of the biggest roadblocks in the acceleration of EV adoption. With the launch of our EV resale platform, we will be focusing on accurate and transparent vehicle and battery valuation. \"Coupled with our battery subscription model and EV financing services, this approach mitigates the risk of the remaining battery life, uncertain resale value, EV loans, thereby accelerating EV adoption,\" said Xitij Kothi, Co-Founder, Vidyut. Vidyut started in November 2021 as a commercial EV financing platform. One of the major hurdles in EV adoption is the lack of accessibility to resale market and resale price discovery of EVs and, therefore, over the last two years, the company has built capabilities to inspect, value, sell and finance pre-owned EVs through its own demand generation platform for used EVs, the company said. ","cleaned_content":"bengaluru based electric mobility startup vidyut on thursday announced the launch of its offline pre owned ev sales and financing platform the latest offline services have been made available in delhi ncr hyderabad and bengaluru to begin with while the plans are to expand them into six more markets including mumbai chennai pune lucknow agra and kanpur by the end of this fiscal vidyut said the company said it plans to launch an online marketplace as well in the next six months currently the platform offers resale of electric commercial three wheelers from brands such as mahindra piaggio euler motors greaves and altigreen among others it said absence of a robust resale market is one of the biggest roadblocks in the acceleration of ev adoption with the launch of our ev resale platform we will be focusing on accurate and transparent vehicle and battery valuation coupled with our battery subscription model and ev financing services this approach mitigates the risk of the remaining battery life uncertain resale value ev loans thereby accelerating ev adoption said xitij kothi co founder vidyut vidyut started in november \u003cTWO_THOUSAND\u003e as a commercial ev financing platform one of the major hurdles in ev adoption is the lack of accessibility to resale market and resale price discovery of evs and therefore over the last two years the company has built capabilities to inspect value sell and finance pre owned evs through its own demand generation platform for used evs the company said","timestamp":"2024-07-11T12:17:00+05:30","market_timestamp":"2024-07-11T12:17:00+05:30","off_market_hours":false}