{"url":"https://www.moneycontrol.com/news/business/kalyan-jewellers-reports-27-revenue-growth-in-q1-fy25-plans-expansion-12762884.html","title":"Kalyan Jewellers reports 27% revenue growth in Q1 FY'25, plans expansion","description":"The company had reported a consolidated net revenue of Rs 4,376 crore in the first quarter (April-June) of the 2023-24 fiscal year.Kalyan Jewellers reports 27% revenue growth in Q1 FY'25, plans expansionRelated stories","content":"Kalyan Jewellers on Friday reported a 27 per cent year-on-year increase in consolidated revenue for the first quarter of the financial year 2024-25, driven by strong performance in both Indian and Middle Eastern markets. The company had reported a consolidated net revenue of Rs 4,376 crore in the first quarter (April-June) of the 2023-24 fiscal year. India operations saw a 29 per cent revenue growth during the first quarter of this fiscal, compared to the corresponding quarter of the previous fiscal year, with a 12 per cent same-store-sales growth, the company said in a regulatory filing. The company said 13 new franchisee-owned-company-operated (FOCO) showrooms were opened during the April-June period this year in India, while the digital platform Candere recorded a 13 per cent revenue growth. The company said it plans to convert its Candere business into a wholly-owned subsidiary after increasing its stake. \"The recently concluded quarter has been a very satisfying one, having witnessed robust operating performance across all our markets in India and Middle East despite extreme volatility in gold prices and a strong base quarter,\" Kalyan Jewellers said. Kalyan Jewellers aims to launch over 130 new showrooms in FY2025, including about 40 Kalyan showrooms in India, approximately 30 Candere showrooms and the first US showroom by Diwali. The jeweller remains optimistic about the upcoming festive and wedding season, starting with Onam celebrations. As of June 30, 2024, the company operated 277 showrooms across its brands. ","cleaned_content":"kalyan jewellers on friday reported a \u003cTWO_TEN_PERCENT\u003e year on year increase in consolidated revenue for the first quarter of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e driven by strong performance in both indian and middle eastern markets the company had reported a consolidated net revenue of rs \u003cFOUR_THOUSAND\u003e crore in the first quarter april june of the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal year india operations saw a \u003cTWO_TEN_PERCENT\u003e revenue growth during the first quarter of this fiscal compared to the corresponding quarter of the previous fiscal year with a \u003cONE_TEN_PERCENT\u003e same store sales growth the company said in a regulatory filing the company said \u003cONE_TEN\u003e new franchisee owned company operated foco showrooms were opened during the april june period this year in india while the digital platform candere recorded a \u003cONE_TEN_PERCENT\u003e revenue growth the company said it plans to convert its candere business into a wholly owned subsidiary after increasing its stake the recently concluded quarter has been a very satisfying one having witnessed robust operating performance across all our markets in india and middle east despite extreme volatility in gold prices and a strong base quarter kalyan jewellers said kalyan jewellers aims to launch over \u003cONE_HUNDRED\u003e new showrooms in fy2025 including about \u003cFOUR_TEN\u003e kalyan showrooms in india approximately \u003cTHREE_TEN\u003e candere showrooms and the first us showroom by diwali the jeweller remains optimistic about the upcoming festive and wedding season starting with onam celebrations as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e the company operated \u003cTWO_HUNDRED\u003e showrooms across its brands","timestamp":"2024-07-05T11:50:00+05:30","market_timestamp":"2024-07-05T11:50:00+05:30","off_market_hours":false}