{"url":"https://www.moneycontrol.com/news/business/suzuki-motor-launches-rs-340-crore-fund-next-bharat-to-support-social-impact-startups-12762094.html","title":"Suzuki Motor launches Rs 340 crore fund 'Next Bharat' to support social impact startups","description":"This Suzuki initiative aims to support social impact startups in the domains of agriculture, financial inclusion, rural supply chains, and rural mobility, through a residency programme.Suzuki Motor launches Rs 340 crore fund 'Next Bharat' to support social impact startupsRelated stories","content":"Japanese automobile firm Suzuki Motor on Thursday launched its first investment fund in India--Next Bharat Ventures--a Rs 340 crore fund dedicated to fostering impact entrepreneurs who create value in Tier-II and below geographies. This Suzuki initiative aims to support social impact startups in the domains of agriculture, financial inclusion, rural supply chains, and rural mobility, through a residency programme. \"Next Bharat will invest in growth-stage impact firms and early-stage impact entrepreneurs through its flagship residency programme. In order to improve synergy among our early-stage portfolio, We do Fund of Fund operations, investing in Indian Early Stage Venture Capital firms, this investment will also help in establishing strong strategic synergies for the Next Bharat Impact Fund,\" Next Bharat CEO and MD Vipul Nath Jindal told PTI. Post completion of the programme, the selected startups will receive equity Investments worth Rs 1-5 crore. \"The core value of Next Bharat lies in nurturing and empowering Impact entrepreneurs who are driven by Cause, Contribution, and Community. It places a strong emphasis on supporting businesses from Tier-II and 3 cities. \"We aim to empower underrepresented regions, drive economic development, and foster a culture of innovation that addresses the unique challenges faced by these communities,\" Jindal said. Next Bharat Ventures aims to empower 'India's next billion' by supporting these impact entrepreneurs, an official statement said. \"Bharat has about 1.4 billion people, but we have only reached about 0.4 billion with our mobility business. Our goal is to connect with the \"Next Billion\" people of India, extending beyond mobility and becoming a part of India's future story,\" Toshihiro Suzuki, President and CEO of Suzuki Motor Corporation said. ","cleaned_content":"japanese automobile firm suzuki motor on thursday launched its first investment fund in india next bharat ventures a rs \u003cTHREE_HUNDRED\u003e crore fund dedicated to fostering impact entrepreneurs who create value in tier ii and below geographies this suzuki initiative aims to support social impact startups in the domains of agriculture financial inclusion rural supply chains and rural mobility through a residency programme next bharat will invest in growth stage impact firms and early stage impact entrepreneurs through its flagship residency programme in order to improve synergy among our early stage portfolio we do fund of fund operations investing in indian early stage venture capital firms this investment will also help in establishing strong strategic synergies for the next bharat impact fund next bharat ceo and md vipul nath jindal told pti post completion of the programme the selected startups will receive equity investments worth rs \u003cONE_\u003e \u003cFIVE_\u003e crore the core value of next bharat lies in nurturing and empowering impact entrepreneurs who are driven by cause contribution and community it places a strong emphasis on supporting businesses from tier ii and \u003cTHREE_\u003e cities we aim to empower underrepresented regions drive economic development and foster a culture of innovation that addresses the unique challenges faced by these communities jindal said next bharat ventures aims to empower indias next billion by supporting these impact entrepreneurs an official statement said bharat has about \u003cONE_\u003e billion people but we have only reached about \u003cZERO_\u003e billion with our mobility business our goal is to connect with the next billion people of india extending beyond mobility and becoming a part of indias future story toshihiro suzuki president and ceo of suzuki motor corporation said","timestamp":"2024-07-04T12:12:00+05:30","market_timestamp":"2024-07-04T12:12:00+05:30","off_market_hours":false}