{"url":"https://www.moneycontrol.com/news/business/hindalco-to-sell-land-parcel-in-maharashtra-to-birla-estates-subsidiary-ekamaya-properties-for-rs-595-crore-12769414.html","title":"Hindalco to sell land parcel in Maharashtra to Birla Estates' unit for Rs 595 cr","description":"On July 12, 2023, the company had said that the Board of Directors had approved a proposal for sale of a land parcel situated at Kalwa, Maharashtra, to Birla Estates Private Ltd.The transaction is subject to signing of definitive documents, completion of customary closing conditions and receipt of regulatory approvals, the filing said.","content":"Hindalco Industries agreed to sell its land parcel in Maharashtra's Kalwa to Ekamaya Properties Pvt Ltd, which is a wholly-owned subsidiary of Birla Estates Pvt Ltd for Rs 595 crore, the former said in a statement on July 15. Last year in July, the company had announced that the board of directors had given its approval for the proposed sale of a land parcel situated in Kalwa to Birla Estates Private Ltd. \"... The aforesaid transaction shall now be entered into with Ekamaya Properties Pvt Ltd, a wholly-owned subsidiary of Birla Estates Pvt Ltd (instead of Birla Estates Pvt Ltd),\" Hindalco Industries said in a regulatory filing. Hindalco Industries operates across the value chain, from bauxite mining, alumina refining, coal mining, captive power plants and aluminium smelting to downstream rolling, extrusions, and foils. Along with its subsidiary Novelis, Hindalco Industries is the global leader in flat-rolled products and the world's largest recycler of aluminium. With inputs from PTI ","cleaned_content":"hindalco industries agreed to sell its land parcel in maharashtras kalwa to ekamaya properties pvt ltd which is a wholly owned subsidiary of birla estates pvt ltd for rs \u003cFIVE_HUNDRED\u003e crore the former said in a statement on july \u003cONE_TEN\u003e last year in july the company had announced that the board of directors had given its approval for the proposed sale of a land parcel situated in kalwa to birla estates private ltd the aforesaid transaction shall now be entered into with ekamaya properties pvt ltd a wholly owned subsidiary of birla estates pvt ltd instead of birla estates pvt ltd hindalco industries said in a regulatory filing hindalco industries operates across the value chain from bauxite mining alumina refining coal mining captive power plants and aluminium smelting to downstream rolling extrusions and foils along with its subsidiary novelis hindalco industries is the global leader in flat rolled products and the worlds largest recycler of aluminium with inputs from pti","timestamp":"2024-07-15T18:24:00+05:30","market_timestamp":"2024-07-16T09:15:00+05:30","off_market_hours":true}