{"url":"https://www.moneycontrol.com/news/business/usfda-approves-sun-pharmas-drug-to-treat-alopecia-areata-12779065.html","title":"USFDA approves Sun Pharma's drug to treat alopecia areata","description":"The approval by the US Food and Drug Administration (USFDA) is for LEQSELVI (deuruxolitinib) 8 mg tablets, Sun Pharma said in a regulatory filing.USFDA approves Sun Pharma's drug to treat alopecia areata","content":"Sun Pharmaceutical Industries Ltd on Friday said the US health regulatory has approved its LEQSELVI (deuruxolitinib) drug for the treatment of adults with severe alopecia areata. The approval by the US Food and Drug Administration (USFDA) is for LEQSELVI (deuruxolitinib) 8 mg tablets, Sun Pharma said in a regulatory filing. Alopecia areata is an autoimmune disorder that can lead to unpredictable hair loss. It occurs when the immune system mistakenly targets hair follicles on the scalp, face, and sometimes other parts of the body, due to a breakdown in immune privilege. The approval is based on data from two multicenter, randomised, double-blind, placebo-controlled Phase 3 clinical trials which enrolled a total of 1,220 patients with alopecia areata who had at least 50 per cent scalp hair loss as measured by Severity of Alopecia Tool (SALT) for more than six months, the company said. ","cleaned_content":"sun pharmaceutical industries ltd on friday said the us health regulatory has approved its leqselvi deuruxolitinib drug for the treatment of adults with severe alopecia areata the approval by the us food and drug administration usfda is for leqselvi deuruxolitinib \u003cEIGHT_\u003e mg tablets sun pharma said in a regulatory filing alopecia areata is an autoimmune disorder that can lead to unpredictable hair loss it occurs when the immune system mistakenly targets hair follicles on the scalp face and sometimes other parts of the body due to a breakdown in immune privilege the approval is based on data from two multicenter randomised double blind placebo controlled phase \u003cTHREE_\u003e clinical trials which enrolled a total of \u003cONE_THOUSAND\u003e patients with alopecia areata who had at least \u003cFIVE_TEN_PERCENT\u003e scalp hair loss as measured by severity of alopecia tool salt for more than six months the company said","timestamp":"2024-07-26T11:10:00+05:30","market_timestamp":"2024-07-26T11:10:00+05:30","off_market_hours":false}