{"url":"https://www.moneycontrol.com/news/business/zydus-lifesciences-gets-usfda-nod-for-diabetes-drug-12772807.html","title":"Zydus Lifesciences gets USFDA nod for diabetes drug","description":"The company has received final approval for its new drug application (NDA) from the US Food and Drug Administration (USFDA) to market Zituvimet XR (sitagliptin and metformin hydrochloride) extended-release tablets, the drug firm said in a statement.Zydus Lifesciences gets USFDA nod for diabetes drug","content":"Zydus Lifesciences on Friday said it has received approval from the US health regulator for its new drug application for a diabetes medication. The company has received final approval for its new drug application (NDA) from the US Food and Drug Administration (USFDA) to market Zituvimet XR (sitagliptin and metformin hydrochloride) extended-release tablets, the drug firm said in a statement. With this, Zydus has all three NDAs of Sitagliptin (base) and combination franchise approved, it added. Zituvimet XR (sitagliptin and metformin hydrochloride) extended-release tablets are indicated as an adjunct to diet and exercise to improve glycemic control in adults with type 2 diabetes mellitus. The product will be manufactured at the group's formulation manufacturing facility in Ahmedabad SEZ, Zydus Lifesciences said. According to IQVIA (MAT May 2024), the US market for DPP-IV inhibitors (oral diabetes medications) and its combinations stood at USD 9.5 billion. Shares of Zydus Lifesciences were trading 2.04 per cent down at Rs 1,161.10 apiece on the BSE. ","cleaned_content":"zydus lifesciences on friday said it has received approval from the us health regulator for its new drug application for a diabetes medication the company has received final approval for its new drug application nda from the us food and drug administration usfda to market zituvimet xr sitagliptin and metformin hydrochloride extended release tablets the drug firm said in a statement with this zydus has all three ndas of sitagliptin base and combination franchise approved it added zituvimet xr sitagliptin and metformin hydrochloride extended release tablets are indicated as an adjunct to diet and exercise to improve glycemic control in adults with type \u003cTWO_\u003e diabetes mellitus the product will be manufactured at the groups formulation manufacturing facility in ahmedabad sez zydus lifesciences said according to iqvia mat may \u003cTWO_THOUSAND\u003e the us market for dpp iv inhibitors oral diabetes medications and its combinations stood at usd \u003cNINE_\u003e billion shares of zydus lifesciences were trading \u003cTWO_PERCENT\u003e down at rs \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-07-19T12:26:00+05:30","market_timestamp":"2024-07-19T12:26:00+05:30","off_market_hours":false}