{"url":"https://www.moneycontrol.com/news/business/spicejet-board-to-consider-raising-fresh-capital-via-qip-on-july-23-12772632.html","title":"SpiceJet board to consider raising fresh capital via QIP on July 23","description":"In January this year, SpiceJet received in-principle approval from the BSE for a fund infusion of Rs 2,242-crore and raised Rs 1,060 crore under preferential issue in two tranches.SpiceJet board to consider raising fresh capital via QIP on July 23Related stories","content":"No-frills carrier SpiceJet on Friday said the company will hold a board meeting on July 23 to consider raising fresh capital through qualified institutional placement (QIP) basis. \"... a meeting of the Board of Directors of SpiceJet Ltd will be held on July 23, 2024 (Tuesday), inter-alia, to consider and approve raising fresh capital through issue of eligible securities to qualified institutional buyers by way of qualified institutional placement...,\" the airline said in a regulatory filing. In January this year, SpiceJet received in-principle approval from the BSE for a fund infusion of Rs 2,242-crore and raised Rs 1,060 crore under preferential issue in two tranches. For the full fiscal year 2023-24, the airline posted a loss of Rs 409.43 crore. It had reported a loss of Rs 1,503 crore in FY23. For the December quarter, SpiceJet reported a loss at Rs 301.45 crore. SpiceJet had posted a profit of Rs 106.82 crore in FY23. The airline has been struggling to keep afloat for many quarters now and has reportedly not deposited the Employee Provident Fund Contributions to its 11,581 staff since January. As on July 19, as many as 33 aircraft -- 15 Boeing 737 and 18 regional jets Q400 -- were on ground, owing to multiple reasons, as per the aircraft fleet tracking website planespotter.net. SpiceJet has a total of 60 planes, which include 32 Boeing 737 and 24 Q400. Besides, it also has two Airbus 340 and two Airbus A320, which are on wet-lease. ","cleaned_content":"no frills carrier spicejet on friday said the company will hold a board meeting on july \u003cTWO_TEN\u003e to consider raising fresh capital through qualified institutional placement qip basis a meeting of the board of directors of spicejet ltd will be held on july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e tuesday inter alia to consider and approve raising fresh capital through issue of eligible securities to qualified institutional buyers by way of qualified institutional placement the airline said in a regulatory filing in january this year spicejet received in principle approval from the bse for a fund infusion of rs \u003cTWO_THOUSAND\u003e crore and raised rs \u003cONE_THOUSAND\u003e crore under preferential issue in two tranches for the full fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the airline posted a loss of rs \u003cFOUR_HUNDRED\u003e crore it had reported a loss of rs \u003cONE_THOUSAND\u003e crore in fy23 for the december quarter spicejet reported a loss at rs \u003cTHREE_HUNDRED\u003e crore spicejet had posted a profit of rs \u003cONE_HUNDRED\u003e crore in fy23 the airline has been struggling to keep afloat for many quarters now and has reportedly not deposited the employee provident fund contributions to its \u003cONE_TEN_THOUSAND\u003e staff since january as on july \u003cONE_TEN\u003e as many as \u003cTHREE_TEN\u003e aircraft \u003cONE_TEN\u003e boeing \u003cSEVEN_HUNDRED\u003e and \u003cONE_TEN\u003e regional jets q400 were on ground owing to multiple reasons as per the aircraft fleet tracking website planespotter net spicejet has a total of \u003cSIX_TEN\u003e planes which include \u003cTHREE_TEN\u003e boeing \u003cSEVEN_HUNDRED\u003e and \u003cTWO_TEN\u003e q400 besides it also has two airbus \u003cTHREE_HUNDRED\u003e and two airbus a320 which are on wet lease","timestamp":"2024-07-19T10:51:00+05:30","market_timestamp":"2024-07-19T10:51:00+05:30","off_market_hours":false}