{"url":"https://www.moneycontrol.com/news/business/mrpl-issues-expression-of-interest-to-sell-jet-fuel-term-supplies-12779153.html","title":"MRPL issues expression of interest to sell jet fuel term supplies","description":"The state-owned refiner is looking to sell at least one 40,000-60,000 ton cargo per month from September to February, the sources said, adding that the buyer would have to offload the cargo between the 1st and 28th of each month.MRPL issues expression of interest to sell jet fuel term supplies","content":"India's Mangalore Refinery and Petrochemicals Ltd (MRPL) has issued an expression of interest to sell around 240,000 metric tons (1.89 million barrels) of jet fuel term supplies starting September, three sources said on Friday. The state-owned refiner is looking to sell at least one 40,000-60,000 ton cargo per month from September to February, the sources said, adding that the buyer would have to offload the cargo between the 1st and 28th of each month. Interested buyers would have to submit their proposals by July 31. This could be purely an exploratory move since it is not an official sale tender, there is no validity date and buyer obligations are limited, two of the sources said. Furthermore, the refiner does not typically offer term supplies, the third source said. MRPL typically can sell around 2 cargoes of around 60,000 tons of jet fuel on a monthly spot basis, but has not offered any term cargoes in the past two years, Reuters tenders records showed. ","cleaned_content":"indias mangalore refinery and petrochemicals ltd mrpl has issued an expression of interest to sell around \u003cTWO_HUNDRED_THOUSAND\u003e metric tons \u003cONE_\u003e million barrels of jet fuel term supplies starting september three sources said on friday the state owned refiner is looking to sell at least one \u003cFOUR_TEN_THOUSAND\u003e \u003cSIX_TEN_THOUSAND\u003e ton cargo per month from september to february the sources said adding that the buyer would have to offload the cargo between the \u003cONE_\u003e st and \u003cTWO_TEN\u003e th of each month interested buyers would have to submit their proposals by july \u003cTHREE_TEN\u003e this could be purely an exploratory move since it is not an official sale tender there is no validity date and buyer obligations are limited two of the sources said furthermore the refiner does not typically offer term supplies the third source said mrpl typically can sell around \u003cTWO_\u003e cargoes of around \u003cSIX_TEN_THOUSAND\u003e tons of jet fuel on a monthly spot basis but has not offered any term cargoes in the past two years reuters tenders records showed","timestamp":"2024-07-26T12:09:00+05:30","market_timestamp":"2024-07-26T12:09:00+05:30","off_market_hours":false}