{"url":"https://www.moneycontrol.com/news/business/zydus-lifesciences-gets-mexican-regulatory-nod-for-cancer-treatment-biosimilar-12774393.html","title":"Zydus Lifesciences gets Mexican regulatory nod for cancer treatment biosimilar","description":"Mexican regulatory authority COFEPRIS (Federal Commission for the Protection Against Sanitary Risk), has granted marketing approval for Bhava, a Bevacizumab biosimilar and it will be marketed in different strengths of 100 mg/4 ml and 400 mg/16 ml, Zydus Lifesciences said in a regulatory filing.Zydus Lifesciences gets Mexican regulatory nod for cancer treatment biosimilarRelated stories","content":"Zydus Lifesciences Ltd on Monday said it has received marketing approval from the Mexican regulatory authority for its biosimilar product -- Bhava, used in the treatment of certain types of cancers. Mexican regulatory authority COFEPRIS (Federal Commission for the Protection Against Sanitary Risk), has granted marketing approval for Bhava, a Bevacizumab biosimilar and it will be marketed in different strengths of 100 mg/4 ml and 400 mg/16 ml, Zydus Lifesciences said in a regulatory filing. Bhava is used in the treatment of metastatic colorectal cancer (mCRC), non-squamous non-small cell lung cancer, metastatic breast cancer, glioblastoma, advanced and/or metastatic renal cell carcinoma and ovarian cancer patients, it added. \"To bring in greater access and affordability to patients battling critical ailments, we have been developing a pipeline of biosimilars, specifically in oncology. Precision diagnostics and access to affordable therapies are empowering millions of patients in their fight against cancer in India,\" he said, adding with Bhava, the company would begin a new journey of supporting patients with need-based therapies in Latin America. Citing a WHO report of 2020, the company said out of the total cancer cases reported in Mexico, breast, prostate, colorectal and thyroid were amongst the common cancer cases registered. Zydus said it had developed and launched the Bevacizumab biosimilar developed in-house by the research team at the Zydus Research Centre (ZRC) in 2015 in India under the brand name 'Bryxta'. Since then, an estimated 50,000 patients have been treated with the therapy, Zydus said, adding with 12 lifesaving biosimilars already launched in the market, it has been bridging the unmet need for affordable therapies in the fight against cancer in India. ","cleaned_content":"zydus lifesciences ltd on monday said it has received marketing approval from the mexican regulatory authority for its biosimilar product bhava used in the treatment of certain types of cancers mexican regulatory authority cofepris federal commission for the protection against sanitary risk has granted marketing approval for bhava a bevacizumab biosimilar and it will be marketed in different strengths of \u003cONE_HUNDRED\u003e mg \u003cFOUR_\u003e ml and \u003cFOUR_HUNDRED\u003e mg \u003cONE_TEN\u003e ml zydus lifesciences said in a regulatory filing bhava is used in the treatment of metastatic colorectal cancer mcrc non squamous non small cell lung cancer metastatic breast cancer glioblastoma advanced and or metastatic renal cell carcinoma and ovarian cancer patients it added to bring in greater access and affordability to patients battling critical ailments we have been developing a pipeline of biosimilars specifically in oncology precision diagnostics and access to affordable therapies are empowering millions of patients in their fight against cancer in india he said adding with bhava the company would begin a new journey of supporting patients with need based therapies in latin america citing a who report of \u003cTWO_THOUSAND\u003e the company said out of the total cancer cases reported in mexico breast prostate colorectal and thyroid were amongst the common cancer cases registered zydus said it had developed and launched the bevacizumab biosimilar developed in house by the research team at the zydus research centre zrc in \u003cTWO_THOUSAND\u003e in india under the brand name bryxta since then an estimated \u003cFIVE_TEN_THOUSAND\u003e patients have been treated with the therapy zydus said adding with \u003cONE_TEN\u003e lifesaving biosimilars already launched in the market it has been bridging the unmet need for affordable therapies in the fight against cancer in india","timestamp":"2024-07-22T11:47:00+05:30","market_timestamp":"2024-07-22T11:47:00+05:30","off_market_hours":false}