{"url":"https://www.moneycontrol.com/news/business/airbus-shortlists-8-sites-for-h125-helicopter-final-assembly-line-in-india-2-12774766.html","title":"Airbus shortlists 8 sites for H125 helicopter final assembly line in India","description":"The facility, which will be the fourth Final Assembly Line (FAL) for the single engine H125, will initially produce up to 10 helicopters annually and the capacity will be ramped up depending on the market demand, Airbus officials said.Airbus shortlists 8 sites for H125 helicopter final assembly line in IndiaRelated stories","content":"European major Airbus has shortlisted eight sites in India for setting up its final assembly line for H125 helicopters and the ground-breaking ceremony for the facility is expected later this year. The facility, which will be the fourth Final Assembly Line (FAL) for the single engine H125, will initially produce up to 10 helicopters annually and the capacity will be ramped up depending on the market demand, Airbus officials said. \"India is the market of the future for helicopters... at present, the market is extremely embryonic, it is very small compared to what the potential could be,\" Olivier Michalon, Executive Vice President, Global Business of Airbus Helicopters, said. \"We have identified eight sites which we are currently assessing. We are still in the final assessment stage. We should be in a position to announce it shortly. \"We want to be attractive and in an ecosystem that is best suited for industrial activities, logistics, employees and of course, regulations,\" Michalon said at a briefing at Marignane last week. Marignane is the headquarters of Airbus Helicopters. For Airbus, H125 is the most-sold helicopter in India as well as the South Asia region. Airbus has projected the demand for H125 helicopters in India and neighbouring countries at 500 over the next 20 years. \"We are targeting 10 helicopters per year and as the demand picks up we can ramp up,\" Head of Airbus Helicopters in India and South Asia Sunny Guglani said at the briefing. Michalon stressed that 10 might not sound like a lot and it could be 20, 30, or 50 in some years, depending on the market demand. \"We manufacture, sell and support helicopters. Also, we manufacture, sell and support solutions. This is what we can provide. Make In India solutions,\" he said. Highlighting the success story of its narrow-body A320 aircraft, Michalon said, \"H125 is our A320\". H125 can carry up to six people. Airbus is also setting up the FAL for the C295 aircraft in Vadodara, Gujarat. There are around 350 civil and parapublic helicopters in India and South Asia (India, Nepal, Bhutan, Bangladesh, Sri Lanka and Maldives). Out of them, less than 250 helicopters are in service in India, as per Airbus. In India, there are about 100 Airbus helicopters, with the majority of them being H125 and 130s. There are more than 4,300 H125 helicopters flying around the world. \"The FAL in India will not only make us competitive in terms of lead time, delivery time, it will also help us address the growth of the Indian market and possibly the demand from neighbouring nations. \"This is an important, strategic decision and it will have an impact on our global footprint,\" Michalon said. A basic model of a H125 helicopter could cost around 3.2 million euros, according to a company official. In India, helicopters are used for tourism, pilgrimage, and medical services as well as by the energy sector and private entities. Once set up in India, the FAL for H125 helicopters will undertake the integration of the major component assemblies, avionics and mission systems, installation of electrical harnesses, hydraulic circuits, flight controls, dynamic components, fuel system and the engine. Besides, the FAL will do testing, qualification, and delivery of the H125 to customers in India and the region. About the Indian market, Michalon said the regulations are a bit restrictive but the company is working as if those regulations are going to lighten up a bit and the skies become more open. \"Either we wait for the skies to be fully open and then it is a big rush by all helicopter manufacturers or we demonstrate our trust and recognition potential of India and be ready to invest,\" he said. In January, Airbus and Tata Group announced a partnership to set up India's first helicopter FAL in the private sector. The facility will be set up by Tata Advanced Systems Limited (TASL), along with Airbus Helicopters. ","cleaned_content":"european major airbus has shortlisted eight sites in india for setting up its final assembly line for h125 helicopters and the ground breaking ceremony for the facility is expected later this year the facility which will be the fourth final assembly line fal for the single engine h125 will initially produce up to \u003cONE_TEN\u003e helicopters annually and the capacity will be ramped up depending on the market demand airbus officials said india is the market of the future for helicopters at present the market is extremely embryonic it is very small compared to what the potential could be olivier michalon executive vice president global business of airbus helicopters said we have identified eight sites which we are currently assessing we are still in the final assessment stage we should be in a position to announce it shortly we want to be attractive and in an ecosystem that is best suited for industrial activities logistics employees and of course regulations michalon said at a briefing at marignane last week marignane is the headquarters of airbus helicopters for airbus h125 is the most sold helicopter in india as well as the south asia region airbus has projected the demand for h125 helicopters in india and neighbouring countries at \u003cFIVE_HUNDRED\u003e over the next \u003cTWO_TEN\u003e years we are targeting \u003cONE_TEN\u003e helicopters per year and as the demand picks up we can ramp up head of airbus helicopters in india and south asia sunny guglani said at the briefing michalon stressed that \u003cONE_TEN\u003e might not sound like a lot and it could be \u003cTWO_TEN\u003e \u003cTHREE_TEN\u003e or \u003cFIVE_TEN\u003e in some years depending on the market demand we manufacture sell and support helicopters also we manufacture sell and support solutions this is what we can provide make in india solutions he said highlighting the success story of its narrow body a320 aircraft michalon said h125 is our a320 h125 can carry up to six people airbus is also setting up the fal for the c295 aircraft in vadodara gujarat there are around \u003cTHREE_HUNDRED\u003e civil and parapublic helicopters in india and south asia india nepal bhutan bangladesh sri lanka and maldives out of them less than \u003cTWO_HUNDRED\u003e helicopters are in service in india as per airbus in india there are about \u003cONE_HUNDRED\u003e airbus helicopters with the majority of them being h125 and \u003cONE_HUNDRED\u003e s there are more than \u003cFOUR_THOUSAND\u003e h125 helicopters flying around the world the fal in india will not only make us competitive in terms of lead time delivery time it will also help us address the growth of the indian market and possibly the demand from neighbouring nations this is an important strategic decision and it will have an impact on our global footprint michalon said a basic model of a h125 helicopter could cost around \u003cTHREE_\u003e million euros according to a company official in india helicopters are used for tourism pilgrimage and medical services as well as by the energy sector and private entities once set up in india the fal for h125 helicopters will undertake the integration of the major component assemblies avionics and mission systems installation of electrical harnesses hydraulic circuits flight controls dynamic components fuel system and the engine besides the fal will do testing qualification and delivery of the h125 to customers in india and the region about the indian market michalon said the regulations are a bit restrictive but the company is working as if those regulations are going to lighten up a bit and the skies become more open either we wait for the skies to be fully open and then it is a big rush by all helicopter manufacturers or we demonstrate our trust and recognition potential of india and be ready to invest he said in january airbus and tata group announced a partnership to set up indias first helicopter fal in the private sector the facility will be set up by tata advanced systems limited tasl along with airbus helicopters","timestamp":"2024-07-22T14:49:00+05:30","market_timestamp":"2024-07-22T14:49:00+05:30","off_market_hours":false}