{"url":"https://www.moneycontrol.com/news/business/dlf-plans-to-launch-rs-1-04-lakh-crore-worth-real-estate-projects-in-medium-term-12779263.html","title":"DLF plans to launch Rs 1.04 lakh crore worth real estate projects in medium term","description":"In its latest investor presentation for the April-June quarter, DLF informed about the \"planned launches of Rs 1+ lakh crore (36 million square feet) of new products over the medium term\".DLF plans to launch Rs 1.04 lakh crore worth real estate projects in medium termRelated stories","content":"Realty major DLF plans to launch nearly 37 million square feet area for sale in the medium term across various cities with revenue potential of Rs 1.04 lakh crore as part of its strategy to encash strong demand for luxury homes. In its latest investor presentation for the April-June quarter, DLF informed about the \"planned launches of Rs 1+ lakh crore (36 million square feet) of new products over the medium term\". Giving the break-up, the company said a 12.8 million square feet area will be launched for sales this fiscal with a revenue potential of Rs 42,000 crore. Out of the total Rs 1,04,500 crore worth projects that it intends to launch in medium term, only Rs 1,000 crore worth is planed from commercial properties and the remaining from the housing segment. These projects, largely residential, will be launched primarily in Delhi, Gurugram, Chandigarh Tri-city, Mumbai and Goa. DLF said in the presentation that it continues to scale up its product offerings and is developing margin-accretive products. The company is tapping multiple geographies but the core market remains Delhi NCR. It intends to enter the Mumbai market this fiscal. On strong housing demand, DLF's sales bookings jumped over three-fold to Rs 6,404 crore during the first quarter of this fiscal as against Rs 2,040 crore in the year-ago period. DLF has given guidance to achieve Rs 17,000 crore worth of sales bookings for the entire 2024-25 financial year as against nearly Rs 15,000 crore in the preceding year. The company's sales bookings in the April-June quarter were driven by its luxury project 'DLF Privana West' at Sector 76/77, Gurugram that saw sales of Rs 5,600 crore. In its super-luxury housing project 'The Camellias' at DLF 5, Gurugram, the company sold 4 units for Rs 251 crore. On Thursday, DLF reported a 23 per cent increase in its consolidated profit to Rs 645.61 crore in the first quarter of this fiscal from Rs 527 crore in the year-ago period. Total income rose to Rs 1,729.82 crore during the April-June period of this fiscal from Rs 1,521.71 crore in the corresponding period of the previous year. In a statement on Thursday, DLF said, \"We believe that the residential segment is witnessing a structural upcycle and hence we continue to strengthen our new product pipeline.\" \"We stay committed towards leveraging this positive momentum and have planned a strong launch pipeline of an additional 9 million square feet of new products during the fiscal, across various segments and geographies including Gurugram, Mumbai, Goa and Chandigarh Tri-city,\" the company added. The company said it continues to witness healthy sales momentum and strong growth in collections leading to further improvement in its net cash position. DLF is India's leading real estate developer and has more than seven decades of track record. It has developed more than 178 real estate projects and developed an area in excess of 349 million square feet. DLF Group has 220 million square feet of development potential across residential and commercial segments. The group has an annuity portfolio (office and retail real estate spaces) of over 44 million square feet. DLF is primarily engaged in the business of developing and selling residential properties (Development Business) and developing and leasing commercial and retail properties (Annuity Business). ","cleaned_content":"realty major dlf plans to launch nearly \u003cTHREE_TEN\u003e million square feet area for sale in the medium term across various cities with revenue potential of rs \u003cONE_\u003e lakh crore as part of its strategy to encash strong demand for luxury homes in its latest investor presentation for the april june quarter dlf informed about the planned launches of rs \u003cONE_\u003e lakh crore \u003cTHREE_TEN\u003e million square feet of new products over the medium term giving the break up the company said a \u003cONE_TEN\u003e million square feet area will be launched for sales this fiscal with a revenue potential of rs \u003cFOUR_TEN_THOUSAND\u003e crore out of the total rs \u003cONE_HUNDRED_THOUSAND\u003e crore worth projects that it intends to launch in medium term only rs \u003cONE_THOUSAND\u003e crore worth is planed from commercial properties and the remaining from the housing segment these projects largely residential will be launched primarily in delhi gurugram chandigarh tri city mumbai and goa dlf said in the presentation that it continues to scale up its product offerings and is developing margin accretive products the company is tapping multiple geographies but the core market remains delhi ncr it intends to enter the mumbai market this fiscal on strong housing demand dlfs sales bookings jumped over three fold to rs \u003cSIX_THOUSAND\u003e crore during the first quarter of this fiscal as against rs \u003cTWO_THOUSAND\u003e crore in the year ago period dlf has given guidance to achieve rs \u003cONE_TEN_THOUSAND\u003e crore worth of sales bookings for the entire \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year as against nearly rs \u003cONE_TEN_THOUSAND\u003e crore in the preceding year the companys sales bookings in the april june quarter were driven by its luxury project dlf privana west at sector \u003cSEVEN_TEN\u003e \u003cSEVEN_TEN\u003e gurugram that saw sales of rs \u003cFIVE_THOUSAND\u003e crore in its super luxury housing project the camellias at dlf \u003cFIVE_\u003e gurugram the company sold \u003cFOUR_\u003e units for rs \u003cTWO_HUNDRED\u003e crore on thursday dlf reported a \u003cTWO_TEN_PERCENT\u003e increase in its consolidated profit to rs \u003cSIX_HUNDRED\u003e crore in the first quarter of this fiscal from rs \u003cFIVE_HUNDRED\u003e crore in the year ago period total income rose to rs \u003cONE_THOUSAND\u003e crore during the april june period of this fiscal from rs \u003cONE_THOUSAND\u003e crore in the corresponding period of the previous year in a statement on thursday dlf said we believe that the residential segment is witnessing a structural upcycle and hence we continue to strengthen our new product pipeline we stay committed towards leveraging this positive momentum and have planned a strong launch pipeline of an additional \u003cNINE_\u003e million square feet of new products during the fiscal across various segments and geographies including gurugram mumbai goa and chandigarh tri city the company added the company said it continues to witness healthy sales momentum and strong growth in collections leading to further improvement in its net cash position dlf is indias leading real estate developer and has more than seven decades of track record it has developed more than \u003cONE_HUNDRED\u003e real estate projects and developed an area in excess of \u003cTHREE_HUNDRED\u003e million square feet dlf group has \u003cTWO_HUNDRED\u003e million square feet of development potential across residential and commercial segments the group has an annuity portfolio office and retail real estate spaces of over \u003cFOUR_TEN\u003e million square feet dlf is primarily engaged in the business of developing and selling residential properties development business and developing and leasing commercial and retail properties annuity business","timestamp":"2024-07-26T13:06:00+05:30","market_timestamp":"2024-07-26T13:06:00+05:30","off_market_hours":false}