{"url":"https://www.moneycontrol.com/news/business/jsw-steel-ceo-jayant-acharya-says-mills-in-talks-with-govt-on-trade-measures-against-imports-12775766.html","title":"JSW Steel CEO Jayant Acharya says mills in talks with govt on trade measures against imports","description":"India turned net steel importer in the fiscal year that ended in March and the trend continues with its finished steel imports scaling a five-year high in April and May, according to provisional government data.JSW Steel CEO Jayant Acharya says mills in talks with govt on trade measures against importsRelated stories","content":"The Indian steel industry is in talks with the federal government for trade measures to combat rising imports particularly from China and Vietnam, JSW Steel Chief Executive Jayant Acharya told Reuters on Tuesday. India turned net steel importer in the fiscal year that ended in March and the trend continues with its finished steel imports scaling a five-year high in April and May, according to provisional government data. \"Indian steel industry is in discussion with the government. I think there are measures which we would be requesting the government to take up,\" Acharya said, without elaborating on the possible measures being discussed. EXPORTS, COKING COAL This year, JSW Steel expects its exports to be 10-15% of total sales, Acharya said, adding that international markets were \"muted\" as of now, while demand in India was \"extremely strong\". Separately, Acharya denied the company was in talks with Australian miner Whitehaven Coal for a stake in its Blackwater metallurgical coal mine. Whitehaven in January said it was exploring a potential sell-down of about 20% of Blackwater to global steel producers as strategic joint venture partners. However, JSW Steel continues to look for coking coal assets overseas, including Australia, and Canada, Acharya said. Acharya also said the company was open to importing coking coal from Mongolia but as of now there was \"nothing on the radar\". He also opposed a proposal from the trade remedies body against capping imports of low ash metallurgical coke, a steelmaking fuel. \"Putting any kind of duties on materials which we don't internally have, doesn't make strategic sense,\" Acharya said. Last month, Reuters reported that India's steel ministry also did not favour limits on imports of met coke, citing risks to domestic output. ","cleaned_content":"the indian steel industry is in talks with the federal government for trade measures to combat rising imports particularly from china and vietnam jsw steel chief executive jayant acharya told reuters on tuesday india turned net steel importer in the fiscal year that ended in march and the trend continues with its finished steel imports scaling a five year high in april and may according to provisional government data indian steel industry is in discussion with the government i think there are measures which we would be requesting the government to take up acharya said without elaborating on the possible measures being discussed exports coking coal this year jsw steel expects its exports to be \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e of total sales acharya said adding that international markets were muted as of now while demand in india was extremely strong separately acharya denied the company was in talks with australian miner whitehaven coal for a stake in its blackwater metallurgical coal mine whitehaven in january said it was exploring a potential sell down of about \u003cTWO_TEN_PERCENT\u003e of blackwater to global steel producers as strategic joint venture partners however jsw steel continues to look for coking coal assets overseas including australia and canada acharya said acharya also said the company was open to importing coking coal from mongolia but as of now there was nothing on the radar he also opposed a proposal from the trade remedies body against capping imports of low ash metallurgical coke a steelmaking fuel putting any kind of duties on materials which we dont internally have doesnt make strategic sense acharya said last month reuters reported that indias steel ministry also did not favour limits on imports of met coke citing risks to domestic output","timestamp":"2024-07-23T12:12:00+05:30","market_timestamp":"2024-07-23T12:12:00+05:30","off_market_hours":false}