{"url":"https://www.moneycontrol.com/news/business/india-emerges-as-inspiring-lighthouse-of-growth-amid-global-turbulence-itc-cmd-puri-12779203.html","title":"India emerges as 'inspiring lighthouse of growth' amid global turbulence: ITC CMD Puri","description":"It has a \"standout performance\" as the world's fastest-growing major economy, which has not only evoked global respect but also points to its future promise, said Puri while addressing the annual general meeting of the company.India emerges as 'inspiring lighthouse of growth' amid global turbulence: ITC CMD PuriRelated stories","content":"With a consistent GDP growth rate of over 7 per cent, India has emerged as an \"inspiring lighthouse of growth\" amid a turbulent world grappling with geopolitical tensions and climate emergencies, ITC Chairman and Managing Director Sanjiv Puri said on Friday. It has a \"standout performance\" as the world's fastest-growing major economy, which has not only evoked global respect but also points to its future promise, said Puri while addressing the annual general meeting of the company. He further said analysts project India's per capita GDP is likely to touch the \"inflexion point\" of USD 4,000 by 2030, fuelling larger domestic consumption and driving higher growth. Experts predict that India is likely to contribute 18 per cent to the world's GDP growth in the next 5 years and could even touch 30 per cent between 2035 and 2040, he said. The synergy of India's large market, favourable demographics, rising disposable incomes, technological prowess and vibrant entrepreneurship will continue to power growth in the foreseeable future, he said. According to Puri, a sustained public expenditure in physical, digital, agri and rural infrastructure, combined with sharp execution, is fuelling a virtuous cycle of consumption, investment and employment. \"The rise of aspirational India will also spur consumption-led growth,\" said Puri. Over the role of Indian Enterprise in country's growth, Puri said he deeply believes that companies rooted in India, as economic organs of society, can play a \"vital role\" in partnering with the nation in the promising journey ahead. Over the global economy, Puri said the global economy is passing through a storm of geopolitical tensions, climate emergencies, cost-of-living crises, food and nutrition security concerns, and insufficient livelihood opportunities. \"This is also evident in the decline of global merchandise trade by about 1.2 per cent last year,\" he said. Amidst these adversities, rapid technological advancements, including AI are redefining the future. Puri further said India’s favourable demographics constitute one of its greatest strengths as more than a billion people, comprising nearly 70 per cent of the population, will be of working age by 2030. \"Over the next decade, almost a quarter of the incremental global workforce will be from India,\" he said adding \"This powerhouse of productive human capital is unquestionably a source of unique competitive advantage as well as a formidable driver of consumption.\" The Budget 2024 has also announced multi-dimensional programmes to boost skilling and employment, strengthen MSMEs as well as provide impetus to labour-intensive sectors. \"The ONDC platform set up recently can also lend new wings to micro and small enterprises akin to the UPI’s remarkable impact on financial transactions,\" he said. The agri and rural sector, which engages nearly half of the country’s workforce, can contribute further to livelihood generation through larger value addition, digital acceleration and diversification of on-farm, off-farm and non-farm employment. \"It is indeed encouraging that the recent Budget has sharply addressed several of these areas,\" said Puri. ","cleaned_content":"with a consistent gdp growth rate of over \u003cSEVEN_PERCENT\u003e india has emerged as an inspiring lighthouse of growth amid a turbulent world grappling with geopolitical tensions and climate emergencies itc chairman and managing director sanjiv puri said on friday it has a standout performance as the worlds fastest growing major economy which has not only evoked global respect but also points to its future promise said puri while addressing the annual general meeting of the company he further said analysts project indias per capita gdp is likely to touch the inflexion point of usd \u003cFOUR_THOUSAND\u003e by \u003cTWO_THOUSAND\u003e fuelling larger domestic consumption and driving higher growth experts predict that india is likely to contribute \u003cONE_TEN_PERCENT\u003e to the worlds gdp growth in the next \u003cFIVE_\u003e years and could even touch \u003cTHREE_TEN_PERCENT\u003e between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e he said the synergy of indias large market favourable demographics rising disposable incomes technological prowess and vibrant entrepreneurship will continue to power growth in the foreseeable future he said according to puri a sustained public expenditure in physical digital agri and rural infrastructure combined with sharp execution is fuelling a virtuous cycle of consumption investment and employment the rise of aspirational india will also spur consumption led growth said puri over the role of indian enterprise in countrys growth puri said he deeply believes that companies rooted in india as economic organs of society can play a vital role in partnering with the nation in the promising journey ahead over the global economy puri said the global economy is passing through a storm of geopolitical tensions climate emergencies cost of living crises food and nutrition security concerns and insufficient livelihood opportunities this is also evident in the decline of global merchandise trade by about \u003cONE_PERCENT\u003e last year he said amidst these adversities rapid technological advancements including ai are redefining the future puri further said india s favourable demographics constitute one of its greatest strengths as more than a billion people comprising nearly \u003cSEVEN_TEN_PERCENT\u003e of the population will be of working age by \u003cTWO_THOUSAND\u003e over the next decade almost a quarter of the incremental global workforce will be from india he said adding this powerhouse of productive human capital is unquestionably a source of unique competitive advantage as well as a formidable driver of consumption the budget \u003cTWO_THOUSAND\u003e has also announced multi dimensional programmes to boost skilling and employment strengthen msmes as well as provide impetus to labour intensive sectors the ondc platform set up recently can also lend new wings to micro and small enterprises akin to the upi s remarkable impact on financial transactions he said the agri and rural sector which engages nearly half of the country s workforce can contribute further to livelihood generation through larger value addition digital acceleration and diversification of on farm off farm and non farm employment it is indeed encouraging that the recent budget has sharply addressed several of these areas said puri","timestamp":"2024-07-26T12:32:00+05:30","market_timestamp":"2024-07-26T12:32:00+05:30","off_market_hours":false}