{"url":"https://www.moneycontrol.com/news/business/allocation-under-pmay-will-boost-affordable-housing-sundaram-home-finance-12776008.html","title":"Allocation under PMAY will boost affordable housing: Sundaram Home Finance","description":"Lower stamp duty for women purchasing property is likely to drive the growth of more first-time home buyers, he said, reacting to the Union Budget presented by Union Finance Minister Nirmala Sitharaman in the Lok Sabha.Allocation under PMAY will boost affordable housing: Sundaram Home Finance","content":"The huge allocation in both rural and urban locations under the Pradhan Mantri Awas Yojana credit-linked subsidy scheme is a big boost for the affordable housing segment, D Lakshminarayanan, MD, Sundaram Home Finance said on Tuesday. Lower stamp duty for women purchasing property is likely to drive the growth of more first-time home buyers, he said, reacting to the Union Budget presented by Union Finance Minister Nirmala Sitharaman in the Lok Sabha. \"Digitisation of land records will improve transparency, boost revenue compliance, and improve overall credit flow,\" he said. In a statement here he said, \"the huge allocation in both rural and urban locations under the PM Awas Yojna credit-linked subsidy scheme is a big boost for the affordable housing segment.\" ","cleaned_content":"the huge allocation in both rural and urban locations under the pradhan mantri awas yojana credit linked subsidy scheme is a big boost for the affordable housing segment d lakshminarayanan md sundaram home finance said on tuesday lower stamp duty for women purchasing property is likely to drive the growth of more first time home buyers he said reacting to the union budget presented by union finance minister nirmala sitharaman in the lok sabha digitisation of land records will improve transparency boost revenue compliance and improve overall credit flow he said in a statement here he said the huge allocation in both rural and urban locations under the pm awas yojna credit linked subsidy scheme is a big boost for the affordable housing segment","timestamp":"2024-07-23T14:27:00+05:30","market_timestamp":"2024-07-23T14:27:00+05:30","off_market_hours":false}