{"url":"https://www.moneycontrol.com/news/business/alembic-pharmaceuticals-gets-tentative-nod-from-usfda-for-generic-selexipag-injection-12769451.html","title":"Alembic Pharmaceuticals gets tentative nod from USFDA for generic Selexipag injection","description":"The approval by the US Food \u0026 Drug Administration (USFDA) is for the abbreviated new drug application (ANDA) Selexipag for injection of strength 1,800 mcg/vial, Alembic Pharmaceuticals said in a statement.Alembic Pharmaceuticals gets tentative nod from USFDA for generic Selexipag injectionRelated stories","content":"Alembic Pharmaceuticals Ltd on Monday said it has received tentative approval from the US health regulator for its generic version of Selexipag injection used in the treatment of pulmonary arterial hypertension. The approval by the US Food \u0026 Drug Administration (USFDA) is for the abbreviated new drug application (ANDA) Selexipag for injection of strength 1,800 mcg/vial, Alembic Pharmaceuticals said in a statement. The approved ANDA is therapeutically equivalent to the reference-listed drug product Uptravi for Injection, 1,800 mcg/vial, of Actelion Pharmaceuticals US, Inc, it added. As per the USFDA, under the Paragraph IV certification, a company can seek approval to market a generic drug before the expiration of patents related to the brand-name drug that the generic seeks to copy. \"Upon final approval of this ANDA by the USFDA, Alembic may be eligible for 180 days of generic marketing exclusivity in the US,\" it added. Selexipag is indicated for the treatment of pulmonary arterial hypertension (PAH) to delay disease progression and reduce the risk of hospitalisation. PAH is a rare, progressive disorder characterised by high blood pressure in the arteries of the lungs. ","cleaned_content":"alembic pharmaceuticals ltd on monday said it has received tentative approval from the us health regulator for its generic version of selexipag injection used in the treatment of pulmonary arterial hypertension the approval by the us food drug administration usfda is for the abbreviated new drug application anda selexipag for injection of strength \u003cONE_THOUSAND\u003e mcg vial alembic pharmaceuticals said in a statement the approved anda is therapeutically equivalent to the reference listed drug product uptravi for injection \u003cONE_THOUSAND\u003e mcg vial of actelion pharmaceuticals us inc it added as per the usfda under the paragraph iv certification a company can seek approval to market a generic drug before the expiration of patents related to the brand name drug that the generic seeks to copy upon final approval of this anda by the usfda alembic may be eligible for \u003cONE_HUNDRED\u003e days of generic marketing exclusivity in the us it added selexipag is indicated for the treatment of pulmonary arterial hypertension pah to delay disease progression and reduce the risk of hospitalisation pah is a rare progressive disorder characterised by high blood pressure in the arteries of the lungs","timestamp":"2024-07-15T13:52:00+05:30","market_timestamp":"2024-07-15T13:52:00+05:30","off_market_hours":false}