{"url":"https://www.moneycontrol.com/news/business/tata-power-solar-systems-partners-with-bank-of-india-for-solar-ev-charging-station-financing-12779175.html","title":"Tata Power Solar Systems partners with Bank of India for solar, EV charging station financing","description":"The partnership is a significant milestone with Tata Power Solar becoming the first solar company to collaborate with BOI for both solar and EV Charging Station financing and strengthening its leadership as a green energy solutions provider, a statement said.Tata Power Solar Systems partners with Bank of India for solar, EV charging station financingRelated stories","content":"Tata Power Solar Systems Ltd (TPSSL) on Friday said it has partnered with Bank of India (BOI) to facilitate easy financing for rooftop solar installations and establishment of electric vehicle (EV) charging stations. The partnership is a significant milestone with Tata Power Solar becoming the first solar company to collaborate with BOI for both solar and EV Charging Station financing and strengthening its leadership as a green energy solutions provider, a statement said. This collaboration supports the government's initiatives to promote rooftop solar installations, targeting a wide spectrum of customers, including residential users under the PM Surya Ghar Yojana, housing societies, and Micro, Small, and Medium Enterprises (MSMEs). These loans are offered at an attractive interest rate of 7.10 per cent per annum, are collateral-free, and have a tenure of up to 10 years. For installations above 3 KW and up to 10 KW, loans can be availed up to Rs 6 lakh with a 5 per cent margin money requirement. The interest rates for these loans range from 8.3 per cent to 10.25 per cent per annum, and these are also collateral-free with a tenure of up to 10 years. Registered housing societies and residential welfare associations can benefit from loans up to Rs 1 crore with a 10 per cent margin money requirement. All UDYAM-registered MSME customers looking to set up rooftop solar systems or EV charging stations can avail a loan of up to Rs 30 crore. These loans will have low interest rates starting from 9.35 per cent per annum with a margin requirement of 15 per cent and offer collateral-free options. Borrowers can avail higher repayment tenure of up to 120 months. Benefits of MSE-GIFT (Green Investment \u0026 Financing for Transformation) interest subvention can also be obtained under the loan offering. ","cleaned_content":"tata power solar systems ltd tpssl on friday said it has partnered with bank of india boi to facilitate easy financing for rooftop solar installations and establishment of electric vehicle ev charging stations the partnership is a significant milestone with tata power solar becoming the first solar company to collaborate with boi for both solar and ev charging station financing and strengthening its leadership as a green energy solutions provider a statement said this collaboration supports the governments initiatives to promote rooftop solar installations targeting a wide spectrum of customers including residential users under the pm surya ghar yojana housing societies and micro small and medium enterprises msmes these loans are offered at an attractive interest rate of \u003cSEVEN_PERCENT\u003e per annum are collateral free and have a tenure of up to \u003cONE_TEN\u003e years for installations above \u003cTHREE_\u003e kw and up to \u003cONE_TEN\u003e kw loans can be availed up to rs \u003cSIX_\u003e lakh with a \u003cFIVE_PERCENT\u003e margin money requirement the interest rates for these loans range from \u003cEIGHT_PERCENT\u003e to \u003cONE_TEN_PERCENT\u003e per annum and these are also collateral free with a tenure of up to \u003cONE_TEN\u003e years registered housing societies and residential welfare associations can benefit from loans up to rs \u003cONE_\u003e crore with a \u003cONE_TEN_PERCENT\u003e margin money requirement all udyam registered msme customers looking to set up rooftop solar systems or ev charging stations can avail a loan of up to rs \u003cTHREE_TEN\u003e crore these loans will have low interest rates starting from \u003cNINE_PERCENT\u003e per annum with a margin requirement of \u003cONE_TEN_PERCENT\u003e and offer collateral free options borrowers can avail higher repayment tenure of up to \u003cONE_HUNDRED\u003e months benefits of mse gift green investment financing for transformation interest subvention can also be obtained under the loan offering","timestamp":"2024-07-26T12:24:00+05:30","market_timestamp":"2024-07-26T12:24:00+05:30","off_market_hours":false}