{"url":"https://www.moneycontrol.com/news/business/ilfs-to-recover-rs-250-crore-from-employee-welfare-trust-beneficiaries-report-12772449.html","title":"IL\u0026FS to recover Rs 250 crore from employee welfare trust beneficiaries: Report","description":"The recovery has been ordered by the corporate affairs ministry after the Serious Fraud Investigation Office (SFIO) said the trust was used to park excess funds or profits and subsequently used to facilitate payoffs to select employeesGetting a refund may be difficult as some of the beneficiaries are dead, while others might have used the money for other purposes, the report added.Related stories","content":"Infrastructure Leasing \u0026 Financial Services (IL\u0026FS) has sought to recover Rs 250 crore from its employee welfare trust beneficiaries in a likely first of its kind move on the orders of the ministry of corporate affairs (MCA), The Times of India has reported. The MCA order followed a report by the Serious Fraud Investigation Office (SFIO), which concluded that the entity was allegedly used to park excess funds or profits and was subsequently used to facilitate payoffs and provide incentives to select employees, the report said. Some of the alleged “unjust payments” during 2006-07 to a select group of employees by the erstwhile management headed by Ravi Parthasarthy, using the trust route, have been shared by SFIO with the ministry, the report said. The ministry identified 200 beneficiaries of the IL\u0026FS Employee Welfare Trust (IEWT) and sought a refund. These alleged beneficiaries have 90 days to provide the refund, the report said. IL\u0026FS confirmed the development. “Basis directions from the MCA, the new IL\u0026FS board has approved seeking refund of amounts paid to IEWT members that have been tagged ‘unjust’ by SFIO in their report. Necessary communication has been issued to these members requesting refund of the amounts to IEWT,” an IL\u0026FS Group spokesperson said. Also Read | IL\u0026FS to finally close its road InvIT; draft papers to be filed with Sebi this week Getting a refund may be difficult as some of the beneficiaries are dead, while others might have used the money for other purposes, the report added. ","cleaned_content":"infrastructure leasing financial services il fs has sought to recover rs \u003cTWO_HUNDRED\u003e crore from its employee welfare trust beneficiaries in a likely first of its kind move on the orders of the ministry of corporate affairs mca the times of india has reported the mca order followed a report by the serious fraud investigation office sfio which concluded that the entity was allegedly used to park excess funds or profits and was subsequently used to facilitate payoffs and provide incentives to select employees the report said some of the alleged unjust payments during \u003cTWO_THOUSAND\u003e \u003cSEVEN_\u003e to a select group of employees by the erstwhile management headed by ravi parthasarthy using the trust route have been shared by sfio with the ministry the report said the ministry identified \u003cTWO_HUNDRED\u003e beneficiaries of the il fs employee welfare trust iewt and sought a refund these alleged beneficiaries have \u003cNINE_TEN\u003e days to provide the refund the report said il fs confirmed the development basis directions from the mca the new il fs board has approved seeking refund of amounts paid to iewt members that have been tagged unjust by sfio in their report necessary communication has been issued to these members requesting refund of the amounts to iewt an il fs group spokesperson said also read il fs to finally close its road invit draft papers to be filed with sebi this week getting a refund may be difficult as some of the beneficiaries are dead while others might have used the money for other purposes the report added","timestamp":"2024-07-19T09:07:00+05:30","market_timestamp":"2024-07-19T09:15:00+05:30","off_market_hours":true}