{"url":"https://www.moneycontrol.com/technology/auto/suzuki-sees-indias-automobile-market-growing-fivefold-by-2047-article-12774147.html","title":"Suzuki sees India’s automobile market growing fivefold by 2047","description":"First, the goal is for Maruti Suzuki India Ltd., the Japanese carmaker’s subsidiary, to grab 50% market share by 2030, from around 40% for the fiscal year through March. “We’re confident that the Indian market will expand in the mid to long term,” Ayukawa said in an interview.Suzuki sees India’s automobile market growing fivefold by 2047Related stories","content":"India’s car market is on track to reach 20 million units by 2047, helped by promising growth in battery electric vehicles, Suzuki Motor Corp. Executive Vice President Kenichi Ayukawa said. First, the goal is for Maruti Suzuki India Ltd., the Japanese carmaker’s subsidiary, to grab 50% market share by 2030, from around 40% for the fiscal year through March. “We’re confident that the Indian market will expand in the mid to long term,” Ayukawa said in an interview. The emergence of India as an economic powerhouse and its expanding middle class present a clear opportunity for the Hamamatsu-based manufacturer, which has been active in the South Asian nation since 1983 and has found success as the top-selling automaker with models such as Swift and Brezza. In order to keep its lead, Suzuki plans to introduce its first-ever EV in India, as well as in Europe, next year after exhibiting its mass production model at the upcoming auto expo in India in January, according to Ayukawa. A total of 4.2 million passenger vehicles were sold in India in the fiscal year ended in March, according to the Society of Indian Automobile Manufacturers. To put that number — and Ayukawa’s prediction — in perspective, 3.1 million passenger cars were sold in the US last year, while Europe saw 15 million in unit sales. China is the world’s largest automobile market with 26 million passenger vehicle sales, according to the International Organization of Motor Vehicle Manufacturers. Although Suzuki’s planned eVX is a premium electric vehicle, the carmaker will also roll out more affordable and compact models with lighter batteries, according to Ayukawa. Suzuki is targeting 15% of its sales in India to be EVs by 2030, he added. “India faces environmental issues so I think EVs will grow to an extent,” Ayukawa said. Although people are paying more for cars more than they used to, “India remains a price-conscious market,” he added. Even so, car buyers are starting to show greater appetite for crossovers and sport-utility vehicles, according to Ayukawa. Competition is tougher in that segment because it’s a “strong area for Tata and Mahindra,” he said. Tata Motors Ltd., India’s third-biggest carmaker, has already taken the lead in with fully-electric variants of its popular Tiago and Nexon models, and expects its EV business to reach profitability by early 2026. Suzuki will focus on models that can be used for everyday needs, which will require development of new types of batteries, according to Ayukawa. In the future, Suzuki may embark on domestic production of cells in the next 5 to 10 years, he added. As for collaboration in India with Toyota Motor Corp., which forged a strategic partnership with Suzuki in 2019 through a stake of about 5%, Suzuki will likely focus on smaller cars while Toyota will take the lead on bigger models, Ayukawa said. Toyota’s EV technology will also bolster Suzuki’s product development, he added. “We will learn basic know-how from Toyota and gradually make it our own,” Ayukawa said. Suzuki also sees potential in cars powered by compressed natural gas, which is cheaper than gasoline in India, according to Ayukawa. Maruti Suzuki sold 483,000 CNG cars in the latest fiscal period, up 47% from a year earlier. Although Suzuki plans to start operating four plants that convert methane from cow manure into fuel for cars that currently run on CNG, there are challenges ahead, such as monetizing the organic fertilizer that remains after manufacturing the fuel at a large scale, Ayukawa said. ","cleaned_content":"india s car market is on track to reach \u003cTWO_TEN\u003e million units by \u003cTWO_THOUSAND\u003e helped by promising growth in battery electric vehicles suzuki motor corp executive vice president kenichi ayukawa said first the goal is for maruti suzuki india ltd the japanese carmaker s subsidiary to grab \u003cFIVE_TEN_PERCENT\u003e market share by \u003cTWO_THOUSAND\u003e from around \u003cFOUR_TEN_PERCENT\u003e for the fiscal year through march we re confident that the indian market will expand in the mid to long term ayukawa said in an interview the emergence of india as an economic powerhouse and its expanding middle class present a clear opportunity for the hamamatsu based manufacturer which has been active in the south asian nation since \u003cONE_THOUSAND\u003e and has found success as the top selling automaker with models such as swift and brezza in order to keep its lead suzuki plans to introduce its first ever ev in india as well as in europe next year after exhibiting its mass production model at the upcoming auto expo in india in january according to ayukawa a total of \u003cFOUR_\u003e million passenger vehicles were sold in india in the fiscal year ended in march according to the society of indian automobile manufacturers to put that number and ayukawa s prediction in perspective \u003cTHREE_\u003e million passenger cars were sold in the us last year while europe saw \u003cONE_TEN\u003e million in unit sales china is the world s largest automobile market with \u003cTWO_TEN\u003e million passenger vehicle sales according to the international organization of motor vehicle manufacturers although suzuki s planned evx is a premium electric vehicle the carmaker will also roll out more affordable and compact models with lighter batteries according to ayukawa suzuki is targeting \u003cONE_TEN_PERCENT\u003e of its sales in india to be evs by \u003cTWO_THOUSAND\u003e he added india faces environmental issues so i think evs will grow to an extent ayukawa said although people are paying more for cars more than they used to india remains a price conscious market he added even so car buyers are starting to show greater appetite for crossovers and sport utility vehicles according to ayukawa competition is tougher in that segment because it s a strong area for tata and mahindra he said tata motors ltd india s third biggest carmaker has already taken the lead in with fully electric variants of its popular tiago and nexon models and expects its ev business to reach profitability by early \u003cTWO_THOUSAND\u003e suzuki will focus on models that can be used for everyday needs which will require development of new types of batteries according to ayukawa in the future suzuki may embark on domestic production of cells in the next \u003cFIVE_\u003e to \u003cONE_TEN\u003e years he added as for collaboration in india with toyota motor corp which forged a strategic partnership with suzuki in \u003cTWO_THOUSAND\u003e through a stake of about \u003cFIVE_PERCENT\u003e suzuki will likely focus on smaller cars while toyota will take the lead on bigger models ayukawa said toyota s ev technology will also bolster suzuki s product development he added we will learn basic know how from toyota and gradually make it our own ayukawa said suzuki also sees potential in cars powered by compressed natural gas which is cheaper than gasoline in india according to ayukawa maruti suzuki sold \u003cFOUR_HUNDRED_THOUSAND\u003e cng cars in the latest fiscal period up \u003cFOUR_TEN_PERCENT\u003e from a year earlier although suzuki plans to start operating four plants that convert methane from cow manure into fuel for cars that currently run on cng there are challenges ahead such as monetizing the organic fertilizer that remains after manufacturing the fuel at a large scale ayukawa said","timestamp":"2024-07-22T07:29:00+05:30","market_timestamp":"2024-07-22T09:15:00+05:30","off_market_hours":true}