{"url":"https://www.moneycontrol.com/news/business/dlf-to-expand-housing-commercial-property-business-entering-mumbai-goa-chairman-rajiv-singh-12771513.html","title":"DLF to expand housing, commercial property business; entering Mumbai, Goa: Chairman Rajiv Singh","description":"In his message to shareholders in the annual report, Singh said the company will continue to focus on corporate governance, operational excellence and upholding the value of the company's founders.DLF to expand housing, commercial property business; entering Mumbai, Goa: Chairman Rajiv SinghRelated stories","content":"Realty major DLF will focus on expanding its business to develop residential and commercial projects and is entering new markets Mumbai and Goa to tap into growth opportunities, its Chairman Rajiv Singh said. In his message to shareholders in the annual report, Singh said the company will continue to focus on corporate governance, operational excellence and upholding the value of the company's founders. \"Our focus is to expand both our businesses, residential and commercial. The residential business continued its growth momentum, we witnessed an uptick in new sales bookings, coupled with record sales collections. While the company continues to launch new projects in Delhi-NCR, Singh said the company's strategy is to introduce a diverse range of offerings to meet the aspirational needs of the market. DLF has achieved strong sales bookings during the last two financial years, driven by significant surge in demand for its luxury homes. In the 2022-23 fiscal, it clocked a record sales of Rs 15,058 crore, while the company reported a sales of Rs 14,778 crore in the 2023-24 financial year. For the current fiscal (2024-25), DLF has set a 15 per cent growth target in sales bookings at Rs 17,000 crore as it plans to launch many luxury housing projects across Gurugram, Goa, and Mumbai. DLF's Chairman said the commercial business (development of office buildings, shopping centres) continues to perform well and the occupancy levels across the portfolio have increased substantially. \"The company continues to invest in the capex of our new build-outs in Gurugram, Chennai, Delhi and Goa,\" he said. \"This is a long gestation business and the arduous work we have put over the last decade has helped us to be in the strong position we are in, today,\" Singh noted. The chairman also told shareholders that the company continues to invest in talent acquisition and strengthen its internal policies to ensure a robust mechanism to support this growth. \"While we strive for greater heights, I assure you that we will maintain our focus on operational excellence, corporate governance and uphold the values established by our founders, which remain our foundation and guiding principle. Our aim is to achieve long-term sustainable growth for all our stakeholders,\" Singh said. On the overall economic situation of the country, the DLF Chairman said the Indian economy has staged a broad-based recovery across sectors and surpassed its pre-pandemic growth trajectory. \"Over the last decade, wide ranging structural and governance reforms have strengthened the economy's fundamentals which has made India the shining star in the global economy. The sustained growth momentum reaffirms the ability of the Indian economy to grow faster than ever.\" He said he strongly believes that the next decade will belong to India. On the new government, Singh said, \"The third term of the government under the leadership of Prime Minister Shri Narendra Modi ji marks a milestone in good governance. This continuity will result in faster rollout of policies with renewed vigour for growth.\" He said the pace of progress and improvements will accelerate growth in years to come. \"The government is investing heavily in infrastructure, highways, railways, electrification and other sectors. All progress in the new build-out cycle paves the way to achieve the Prime Minister's vision for 'Viksit Bharat 2047', which coincides with the Nation's 100th year of independence,\" Singh said. DLF's Chairman believes that the real estate sector will be a major contributor to India's economic progress, resulting in employment subsequently leading to macroeconomic and social growth. DLF is the country's largest real estate firm in terms of market capitalisation. It has developed more than 158 real estate projects and an area in excess of 340 million sq ft. DLF Group has 215 million sq ft of future development potential across residential and commercial segments. It has an annuity portfolio of over 44 mn sq ft with an annual rental income of more than Rs 4,000 crore. ","cleaned_content":"realty major dlf will focus on expanding its business to develop residential and commercial projects and is entering new markets mumbai and goa to tap into growth opportunities its chairman rajiv singh said in his message to shareholders in the annual report singh said the company will continue to focus on corporate governance operational excellence and upholding the value of the companys founders our focus is to expand both our businesses residential and commercial the residential business continued its growth momentum we witnessed an uptick in new sales bookings coupled with record sales collections while the company continues to launch new projects in delhi ncr singh said the companys strategy is to introduce a diverse range of offerings to meet the aspirational needs of the market dlf has achieved strong sales bookings during the last two financial years driven by significant surge in demand for its luxury homes in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal it clocked a record sales of rs \u003cONE_TEN_THOUSAND\u003e crore while the company reported a sales of rs \u003cONE_TEN_THOUSAND\u003e crore in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year for the current fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e dlf has set a \u003cONE_TEN_PERCENT\u003e growth target in sales bookings at rs \u003cONE_TEN_THOUSAND\u003e crore as it plans to launch many luxury housing projects across gurugram goa and mumbai dlfs chairman said the commercial business development of office buildings shopping centres continues to perform well and the occupancy levels across the portfolio have increased substantially the company continues to invest in the capex of our new build outs in gurugram chennai delhi and goa he said this is a long gestation business and the arduous work we have put over the last decade has helped us to be in the strong position we are in today singh noted the chairman also told shareholders that the company continues to invest in talent acquisition and strengthen its internal policies to ensure a robust mechanism to support this growth while we strive for greater heights i assure you that we will maintain our focus on operational excellence corporate governance and uphold the values established by our founders which remain our foundation and guiding principle our aim is to achieve long term sustainable growth for all our stakeholders singh said on the overall economic situation of the country the dlf chairman said the indian economy has staged a broad based recovery across sectors and surpassed its pre pandemic growth trajectory over the last decade wide ranging structural and governance reforms have strengthened the economys fundamentals which has made india the shining star in the global economy the sustained growth momentum reaffirms the ability of the indian economy to grow faster than ever he said he strongly believes that the next decade will belong to india on the new government singh said the third term of the government under the leadership of prime minister shri narendra modi ji marks a milestone in good governance this continuity will result in faster rollout of policies with renewed vigour for growth he said the pace of progress and improvements will accelerate growth in years to come the government is investing heavily in infrastructure highways railways electrification and other sectors all progress in the new build out cycle paves the way to achieve the prime ministers vision for viksit bharat \u003cTWO_THOUSAND\u003e which coincides with the nations \u003cONE_HUNDRED\u003e th year of independence singh said dlfs chairman believes that the real estate sector will be a major contributor to indias economic progress resulting in employment subsequently leading to macroeconomic and social growth dlf is the countrys largest real estate firm in terms of market capitalisation it has developed more than \u003cONE_HUNDRED\u003e real estate projects and an area in excess of \u003cTHREE_HUNDRED\u003e million sq ft dlf group has \u003cTWO_HUNDRED\u003e million sq ft of future development potential across residential and commercial segments it has an annuity portfolio of over \u003cFOUR_TEN\u003e mn sq ft with an annual rental income of more than rs \u003cFOUR_THOUSAND\u003e crore","timestamp":"2024-07-18T07:21:00+05:30","market_timestamp":"2024-07-18T09:15:00+05:30","off_market_hours":true}