{"url":"https://www.moneycontrol.com/news/business/australias-mayne-pharma-sues-indian-drugmaker-sun-pharma-over-patent-infringement-12777679.html","title":"Australia's Mayne Pharma sues Indian drugmaker Sun Pharma over patent infringement","description":"In the lawsuit filed at the United States District Court for New Jersey, Mayne Pharma accused its rival of violating all 20 Orange Book-listed patents linked to IMVEXXY - a vaginal insert aimed at reducing pain during sexual intercourse after menopause.Australia's Mayne Pharma sues Indian drugmaker Sun Pharma over patent infringementRelated stories","content":"Mayne Pharma has filed a lawsuit against India's Sun Pharma over infringements of patents related to a certain product used for menopause-related vaginal pain, the Australian drugmaker said on Thursday. In the lawsuit filed at the United States District Court for New Jersey, Mayne Pharma accused its rival of violating all 20 Orange Book-listed patents linked to IMVEXXY - a vaginal insert aimed at reducing pain during sexual intercourse after menopause. Orange Book-listed patents are those approved by the U.S. Food and Drug Administration (FDA) and deemed safe to use. The ANDA is a request filed to the health regulator for approval of an already licensed drug to manufacture the medication in the United States. These application processes do not warrant the applicant to go through a clinical trial. Sun Pharma did not immediately respond to a Reuters' request for comment. Mayne Pharma's complaint also indicated that Sun Pharma filed a Paragraph IV certification, suggesting the latter challenged the patent's (IMVEXXY) listing in the Orange Book as invalid or inapplicable. This \"formally initiates the litigation process under the Hatch-Waxman Act and triggers a 30-month stay of any potential FDA approval for Sun Pharma's ANDA,\" Mayne Pharma said in a statement. ","cleaned_content":"mayne pharma has filed a lawsuit against indias sun pharma over infringements of patents related to a certain product used for menopause related vaginal pain the australian drugmaker said on thursday in the lawsuit filed at the united states district court for new jersey mayne pharma accused its rival of violating all \u003cTWO_TEN\u003e orange book listed patents linked to imvexxy a vaginal insert aimed at reducing pain during sexual intercourse after menopause orange book listed patents are those approved by the u s food and drug administration fda and deemed safe to use the anda is a request filed to the health regulator for approval of an already licensed drug to manufacture the medication in the united states these application processes do not warrant the applicant to go through a clinical trial sun pharma did not immediately respond to a reuters request for comment mayne pharmas complaint also indicated that sun pharma filed a paragraph iv certification suggesting the latter challenged the patents imvexxy listing in the orange book as invalid or inapplicable this formally initiates the litigation process under the hatch waxman act and triggers a \u003cTHREE_TEN\u003e month stay of any potential fda approval for sun pharmas anda mayne pharma said in a statement","timestamp":"2024-07-25T09:00:00+05:30","market_timestamp":"2024-07-25T09:15:00+05:30","off_market_hours":true}