{"url":"https://www.moneycontrol.com/news/business/reliance-gets-us-approval-to-resume-crude-imports-from-venezuela-12776715.html","title":"Reliance gets US approval to resume crude imports from Venezuela","description":"India’s largest privately owned refiner plans to start purchasing Venezuelan crude soon, said the people, who asked not to be named as the information is not public.Reliance gets US approval to resume crude imports from VenezuelaRelated stories","content":"Reliance Industries Ltd. has secured US approval to resume importing oil from Venezuela despite White House sanctions on the country, according to people familiar with the development. India’s largest privately owned refiner plans to start purchasing Venezuelan crude soon, said the people, who asked not to be named as the information is not public. Reliance accounted for around 90% of India’s crude imports from Venezuela after the sanctions were lifted last year, according to data intelligence firm Kpler.  Washington temporarily removed restrictions on the South American nation’s gold and oil sectors last year, when President Nicolas Maduro and the opposition signed a deal to guarantee free and fair elections. The sanctions were then reinstated in April after Venezuela failed to honor the agreement, and oil companies have been applying for permits from the US Treasury Department to keep doing business there. Venezuela’s crude exports climbed to 654,000 barrels a day in June, the highest since April 2020, according to shipping reports and data from Kpler, after the US granted a specific license for companies to continue to drill in the country despite the sanctions being in place. Apart from Reliance, India’s state-owned Oil and Natural Gas Corp.’s overseas investment arm ONGC Videsh Ltd. has also applied for waivers to import crude from Venezuela. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"reliance industries ltd has secured us approval to resume importing oil from venezuela despite white house sanctions on the country according to people familiar with the development india s largest privately owned refiner plans to start purchasing venezuelan crude soon said the people who asked not to be named as the information is not public reliance accounted for around \u003cNINE_TEN_PERCENT\u003e of india s crude imports from venezuela after the sanctions were lifted last year according to data intelligence firm kpler washington temporarily removed restrictions on the south american nation s gold and oil sectors last year when president nicolas maduro and the opposition signed a deal to guarantee free and fair elections the sanctions were then reinstated in april after venezuela failed to honor the agreement and oil companies have been applying for permits from the us treasury department to keep doing business there venezuela s crude exports climbed to \u003cSIX_HUNDRED_THOUSAND\u003e barrels a day in june the highest since april \u003cTWO_THOUSAND\u003e according to shipping reports and data from kpler after the us granted a specific license for companies to continue to drill in the country despite the sanctions being in place apart from reliance india s state owned oil and natural gas corp s overseas investment arm ongc videsh ltd has also applied for waivers to import crude from venezuela disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-07-24T10:43:00+05:30","market_timestamp":"2024-07-24T10:43:00+05:30","off_market_hours":false}