{"url":"https://www.moneycontrol.com/news/business/adani-green-energy-operationalises-250-mw-wind-capacity-at-khavda-gujarat-12777018.html","title":"Adani Green Energy operationalises 250 MW wind capacity at Khavda, Gujarat","description":"With this milestone, 2,250 MW of cumulative capacity has been made operational at the Khavda plant, Adani Green Energy Ltd (AGEL) said in a statement.Adani Green Energy operationalises 250 MW wind capacity at Khavda, Gujarat","content":"Adani Green Energy on Wednesday said it has operationalised a 250MW wind power generation at the world's largest 30,000 MW renewable energy plant at Khavda, Gujarat. With this milestone, 2,250 MW of cumulative capacity has been made operational at the Khavda plant, Adani Green Energy Ltd (AGEL) said in a statement. The operationalisation of 250 MW wind capacity at Khavda further strengthens AGEL's leadership in India with the largest operational portfolio of 11,184 MW, the statement added. The Khavda Renewable Energy plant is equipped with one of the world's largest and most powerful onshore wind turbine generators (WTG) of 5.2 MW capacity each. The WTGs with high rated capacity enable optimal land use to harness higher energy yield from the same location and bring down the levelized cost of energy (LCOE). The 5.2 MW WTGs installed at Khavda are built with superior German technology and manufactured at Adani New Industries Ltd's (ANIL) integrated manufacturing ecosystem strategically located near the Mundra port. AGEL has transformed the Khavda barren wasteland into a hub of clean and affordable energy. The energy from the Khavda RE plant can power 16.1 million homes each year. ","cleaned_content":"adani green energy on wednesday said it has operationalised a \u003cTWO_HUNDRED\u003e mw wind power generation at the worlds largest \u003cTHREE_TEN_THOUSAND\u003e mw renewable energy plant at khavda gujarat with this milestone \u003cTWO_THOUSAND\u003e mw of cumulative capacity has been made operational at the khavda plant adani green energy ltd agel said in a statement the operationalisation of \u003cTWO_HUNDRED\u003e mw wind capacity at khavda further strengthens agels leadership in india with the largest operational portfolio of \u003cONE_TEN_THOUSAND\u003e mw the statement added the khavda renewable energy plant is equipped with one of the worlds largest and most powerful onshore wind turbine generators wtg of \u003cFIVE_\u003e mw capacity each the wtgs with high rated capacity enable optimal land use to harness higher energy yield from the same location and bring down the levelized cost of energy lcoe the \u003cFIVE_\u003e mw wtgs installed at khavda are built with superior german technology and manufactured at adani new industries ltds anil integrated manufacturing ecosystem strategically located near the mundra port agel has transformed the khavda barren wasteland into a hub of clean and affordable energy the energy from the khavda re plant can power \u003cONE_TEN\u003e million homes each year","timestamp":"2024-07-24T13:43:00+05:30","market_timestamp":"2024-07-24T13:43:00+05:30","off_market_hours":false}