{"url":"https://www.moneycontrol.com/news/business/byjus-lawyers-blame-client-in-bid-to-quit-us-bankruptcy-case-12775347.html","title":"Byju’s lawyers blame client in bid to quit US bankruptcy case","description":"In an unusual move, two law firms representing Riju Ravindran, brother of Byju’s founder, filed papers Friday in federal court in Wilmington, Delaware, claiming their clients have failed to cooperate in their own defense.Byju’s lawyers blame client in bid to quit US bankruptcy case","content":"US lawyers for units of the troubled Indian tech firm Byju’s want to quit defending their clients in a bankruptcy dispute, blaming “an irreparable breakdown” with the companies and a board member accused of lying in court to help hide $533 million from disgruntled lenders. In an unusual move, two law firms representing Riju Ravindran, brother of Byju’s founder, filed papers Friday in federal court in Wilmington, Delaware, claiming their clients have failed to cooperate in their own defense. Lawyers representing Byju’s ally William C. Morton, the founder of a small Florida hedge fund, also sought court permission to quit. Representatives for Byju’s and Morton didn’t immediately respond to a request for comment. The missing money is at the heart of a dispute between lenders owed $1.2 billion and the startup founded by entrepreneur Byju Raveendran. The education-tech company’s official name is Think \u0026 Learn Pvt. The cash belongs to a bankrupt shell company, Byju’s Alpha Inc., which is affiliated with Think \u0026 Learn and was taken over by the lenders after their loan defaulted. ","cleaned_content":"us lawyers for units of the troubled indian tech firm byju s want to quit defending their clients in a bankruptcy dispute blaming an irreparable breakdown with the companies and a board member accused of lying in court to help hide \u003cFIVE_HUNDRED\u003e million from disgruntled lenders in an unusual move two law firms representing riju ravindran brother of byju s founder filed papers friday in federal court in wilmington delaware claiming their clients have failed to cooperate in their own defense lawyers representing byju s ally william c morton the founder of a small florida hedge fund also sought court permission to quit representatives for byju s and morton didn t immediately respond to a request for comment the missing money is at the heart of a dispute between lenders owed \u003cONE_\u003e billion and the startup founded by entrepreneur byju raveendran the education tech company s official name is think learn pvt the cash belongs to a bankrupt shell company byju s alpha inc which is affiliated with think learn and was taken over by the lenders after their loan defaulted","timestamp":"2024-07-23T06:32:00+05:30","market_timestamp":"2024-07-23T09:15:00+05:30","off_market_hours":true}