{"url":"https://www.moneycontrol.com/news/business/pratt-whitney-opens-new-customer-service-centre-in-bengaluru-12771020.html","title":"Pratt \u0026 Whitney opens new customer service centre in Bengaluru","description":"As part of the company's India Capability Centre, the new facility will drive customer service and operations support for Pratt \u0026 Whitney Canada's 68,000 engines in service globally, the company said.Pratt \u0026 Whitney opens new customer service centre in BengaluruRelated stories","content":"US aerospace major Pratt \u0026 Whitney on Wednesday announced the establishment of a new Customer Service Centre (CSS) in Bengaluru. As part of the company's India Capability Centre, the new facility will drive customer service and operations support for Pratt \u0026 Whitney Canada's 68,000 engines in service globally, the company said. Co-located with Pratt \u0026 Whitney's supply chain operations, engineering, and digital transformation centres of excellence in India, CSS will deliver a range of services such as MRO support, spare part management, engine leasing, engine reliability analysis and contract administration. The centre is expected to cater to clients, including domestic and global airlines, original equipment manufacturers, MROs, regulatory bodies and small operators, Pratt \u0026 Whitney said. \"With the new Customer Service Centre, we are leveraging our existing investments in India and using regional talent to augment our product and service dependability and customer experience service level,\" said Nivine Kallab, Vice President, Customer Programs, Pratt \u0026 Whitney Canada. Pratt \u0026 Whitney Canada's turboprop engine families power the majority of India's regional jet fleet comprising ATRs and DHC-8-400 planes. \"We have invested over USD 40 million in India across our centres and expanded our talent pool to over 600 employees within the last three years,\" said Sandeep Sharma, Director of Capability Center, Pratt \u0026 Whitney (UTCIPL). The CSS will aim to enhance the company's worldwide service transformation and deliver operational excellence, he added. ","cleaned_content":"us aerospace major pratt whitney on wednesday announced the establishment of a new customer service centre css in bengaluru as part of the companys india capability centre the new facility will drive customer service and operations support for pratt whitney canadas \u003cSIX_TEN_THOUSAND\u003e engines in service globally the company said co located with pratt whitneys supply chain operations engineering and digital transformation centres of excellence in india css will deliver a range of services such as mro support spare part management engine leasing engine reliability analysis and contract administration the centre is expected to cater to clients including domestic and global airlines original equipment manufacturers mros regulatory bodies and small operators pratt whitney said with the new customer service centre we are leveraging our existing investments in india and using regional talent to augment our product and service dependability and customer experience service level said nivine kallab vice president customer programs pratt whitney canada pratt whitney canadas turboprop engine families power the majority of indias regional jet fleet comprising atrs and dhc \u003cEIGHT_\u003e \u003cFOUR_HUNDRED\u003e planes we have invested over usd \u003cFOUR_TEN\u003e million in india across our centres and expanded our talent pool to over \u003cSIX_HUNDRED\u003e employees within the last three years said sandeep sharma director of capability center pratt whitney utcipl the css will aim to enhance the companys worldwide service transformation and deliver operational excellence he added","timestamp":"2024-07-17T12:22:00+05:30","market_timestamp":"2024-07-17T12:22:00+05:30","off_market_hours":false}