{"url":"https://www.moneycontrol.com/news/business/sanofi-to-invest-euro-400-million-in-its-hyderabad-gcc-by-2030-12771178.html","title":"Sanofi to invest Euro 400 million in its  Hyderabad GCC by 2030","description":"Madeliene Roach, Executive Vice President, Business Operations, Sanofi said in a press conference that over the next two years, this GCC will expand to host up to approximately 2,600 employees, making it the largest of Sanofi's four global hubs.Sanofi to invest Euro 400 million in its  Hyderabad GCC by 2030","content":"Sanofi Healthcare India Pvt Ltd on Wednesday announced the expansion of its Global Capacity Centre (GCC) here with plans to invest Euro 400 million over the next six years, out of which Euro 100 million will be pumped in by next year. Madeliene Roach, Executive Vice President, Business Operations, Sanofi said in a press conference that over the next two years, this GCC will expand to host up to approximately 2,600 employees, making it the largest of Sanofi's four global hubs. Established in 2019, the Hyderabad hub has grown exponentially from being a medical hub to now providing several best-in-class services for Sanofi's global functions and affiliates across the world, she said. ","cleaned_content":"sanofi healthcare india pvt ltd on wednesday announced the expansion of its global capacity centre gcc here with plans to invest euro \u003cFOUR_HUNDRED\u003e million over the next six years out of which euro \u003cONE_HUNDRED\u003e million will be pumped in by next year madeliene roach executive vice president business operations sanofi said in a press conference that over the next two years this gcc will expand to host up to approximately \u003cTWO_THOUSAND\u003e employees making it the largest of sanofis four global hubs established in \u003cTWO_THOUSAND\u003e the hyderabad hub has grown exponentially from being a medical hub to now providing several best in class services for sanofis global functions and affiliates across the world she said","timestamp":"2024-07-17T14:45:00+05:30","market_timestamp":"2024-07-17T14:45:00+05:30","off_market_hours":false}