{"url":"https://www.moneycontrol.com/news/business/citigroup-sees-india-luring-100-billion-in-foreign-investment-12772399.html","title":"Citigroup sees India luring $100 billion in foreign investment","description":"Companies working to help India meet its net-zero goals will be among the beneficiaries of the foreign capital flows, according to K Balasubramanian, head of corporate banking for Southeast Asia and the Indian subcontinent.Citigroup sees India luring $100 billion in foreign investmentRelated stories","content":"Foreign investors will likely deploy as much as $100 billion in India this fiscal year, drawn to high-tech manufacturing, infrastructure and climate-change projects in the world’s most-populous country, according to a Citigroup Inc. banker. Companies working to help India meet its net-zero goals will be among the beneficiaries of the foreign capital flows, according to K Balasubramanian, head of corporate banking for Southeast Asia and the Indian subcontinent. “Climate transition is playing out in a big way, likely triggering a bout of foreign fund inflows,” Balasubramanian, known as Bala, said in an interview in Mumbai. Bala said capital is flowing into sustainable energy creation strategies like solar, hydrogen and ammonia. On the energy consumption side, electric vehicles are the “real big story,” he said. “Every formidable company is nurturing plans to enter the next generation iteration on electric mobility,” Bala said.  Prime Minister Narendra Modi has cast himself as a climate champion, and India has made significant investments in clean energy, adding more than 100 gigawatts of capacity in the last 10 years. The country has pledged to install 500 GW of non-fossil fuel energy by the end of the decade, and aims to secure $1 trillion in investments in solar power to meet its 2070 net-zero pledge. India has a 181 billion rupees ($2.2 billion) incentive program to manufacture electric-vehicle batteries in the country. Reliance Industries Ltd., JSW Neo Energy Ltd., and Ola Electric Mobility Pvt. are among the companies selected to produce battery capacity and avail incentives under the program. Apart from climate transition, India’s forays into electronics and infrastructure-related manufacturing are gaining prominence with investors abroad, Bala said. “Capital will come to wherever there are pockets of opportunity in terms of production cost advantage,” Bala said. “Then skill and value addition will be the key drivers for such investments.” India is attracting new groups of investors, according to Bala. Middle-eastern sovereign wealth funds are big backers of energy creation projects, while US investors are drawn to technology and consumption-focused companies. European firms invest in high-end tech, and capital from North Asian countries is making its way to India, Bala said. “In Japan itself, 1,600 companies have identified plans of getting into India, as distributors or suppliers to large companies,” Bala said. The New York-based bank has been ramping up its relationships to become the “first port of call,” for foreign investment, Bala said. These include the US-India corridor, where it gets a majority of the business, he said. The bank is also strong in Germany, France and in the Nordic region, and is spending a lot of time in Taiwan, Bala said. ","cleaned_content":"foreign investors will likely deploy as much as \u003cONE_HUNDRED\u003e billion in india this fiscal year drawn to high tech manufacturing infrastructure and climate change projects in the world s most populous country according to a citigroup inc banker companies working to help india meet its net zero goals will be among the beneficiaries of the foreign capital flows according to k balasubramanian head of corporate banking for southeast asia and the indian subcontinent climate transition is playing out in a big way likely triggering a bout of foreign fund inflows balasubramanian known as bala said in an interview in mumbai bala said capital is flowing into sustainable energy creation strategies like solar hydrogen and ammonia on the energy consumption side electric vehicles are the real big story he said every formidable company is nurturing plans to enter the next generation iteration on electric mobility bala said prime minister narendra modi has cast himself as a climate champion and india has made significant investments in clean energy adding more than \u003cONE_HUNDRED\u003e gigawatts of capacity in the last \u003cONE_TEN\u003e years the country has pledged to install \u003cFIVE_HUNDRED\u003e gw of non fossil fuel energy by the end of the decade and aims to secure \u003cONE_\u003e trillion in investments in solar power to meet its \u003cTWO_THOUSAND\u003e net zero pledge india has a \u003cONE_HUNDRED\u003e billion rupees \u003cTWO_\u003e billion incentive program to manufacture electric vehicle batteries in the country reliance industries ltd jsw neo energy ltd and ola electric mobility pvt are among the companies selected to produce battery capacity and avail incentives under the program apart from climate transition india s forays into electronics and infrastructure related manufacturing are gaining prominence with investors abroad bala said capital will come to wherever there are pockets of opportunity in terms of production cost advantage bala said then skill and value addition will be the key drivers for such investments india is attracting new groups of investors according to bala middle eastern sovereign wealth funds are big backers of energy creation projects while us investors are drawn to technology and consumption focused companies european firms invest in high end tech and capital from north asian countries is making its way to india bala said in japan itself \u003cONE_THOUSAND\u003e companies have identified plans of getting into india as distributors or suppliers to large companies bala said the new york based bank has been ramping up its relationships to become the first port of call for foreign investment bala said these include the us india corridor where it gets a majority of the business he said the bank is also strong in germany france and in the nordic region and is spending a lot of time in taiwan bala said","timestamp":"2024-07-19T06:34:00+05:30","market_timestamp":"2024-07-19T09:15:00+05:30","off_market_hours":true}