{"url":"https://www.moneycontrol.com/news/business/ramkrishna-titagarh-rail-nearing-financial-closure-for-rs-2180-crore-forged-wheels-project-12772777.html","title":"Ramkrishna Titagarh Rail nearing financial closure for Rs 2,180 crore forged wheels project","description":"Financial closure for a project financing is the stage where all conditions of a financing agreement are met, and the availability of funds becomes imminent.Ramkrishna Titagarh Rail nearing financial closure for Rs 2,180 crore forged wheels projectRelated stories","content":"Ramkrishna Titagarh Rail Wheels Ltd (RTRWL), a joint venture between city-based Ramkrishna Forgings Ltd and Titagarh Rail Systems Ltd, is nearing financial closure for its Rs 2,180-crore forged wheels project, a top company official said. Financial closure for a project financing is the stage where all conditions of a financing agreement are met, and the availability of funds becomes imminent. \"The project is progressing well. The company has secured statutory clearances and is in the final stages of achieving financial closure,\" RTRWL board member and Titagarh Rail's Deputy Managing Director Prithish Chowdhary told PTI. \"The project will be executed in two phases - Phase I, costing Rs 1,810 crore and Phase II (Rs 370 crore). Funding will come from a combination of debt and equity in a 70:30 ratio,\" Chaitanya Jalan, whole-time director of Ramkrishna Forgings, said. RTRWL, a 51:49 JV, plans to secure around Rs 1,530 crore in debt, having received a stable rating from Ind Ra for its term loan. Equity capital totaling Rs 650 crore will be infused progressively based on the shareholding of the parent companies as construction advances, company officials said. Phase I operations are scheduled to commence from April 2026 with an installed capacity of 114,000 wheels per annum. Phase II will add another 114,000 wheels per annum and begin operations by 2028-29. \"The company will initially prioritise fulfilling the requirements of Indian Railways as per the wheel supply agreement programme, with the remainder addressing demand from private players in both domestic and export markets,\" Jalan said. Under an agreement with the Ministry of Railways, RTRWL will supply forged rail wheels - up to 80,000 wheels per annum (35 per cent of installed capacity) - over 20 years as part of the 'Atmanirbhar Bharat' initiative. ","cleaned_content":"ramkrishna titagarh rail wheels ltd rtrwl a joint venture between city based ramkrishna forgings ltd and titagarh rail systems ltd is nearing financial closure for its rs \u003cTWO_THOUSAND\u003e crore forged wheels project a top company official said financial closure for a project financing is the stage where all conditions of a financing agreement are met and the availability of funds becomes imminent the project is progressing well the company has secured statutory clearances and is in the final stages of achieving financial closure rtrwl board member and titagarh rails deputy managing director prithish chowdhary told pti the project will be executed in two phases phase i costing rs \u003cONE_THOUSAND\u003e crore and phase ii rs \u003cTHREE_HUNDRED\u003e crore funding will come from a combination of debt and equity in a \u003cSEVEN_TEN\u003e \u003cTHREE_TEN\u003e ratio chaitanya jalan whole time director of ramkrishna forgings said rtrwl a \u003cFIVE_TEN\u003e \u003cFOUR_TEN\u003e jv plans to secure around rs \u003cONE_THOUSAND\u003e crore in debt having received a stable rating from ind ra for its term loan equity capital totaling rs \u003cSIX_HUNDRED\u003e crore will be infused progressively based on the shareholding of the parent companies as construction advances company officials said phase i operations are scheduled to commence from april \u003cTWO_THOUSAND\u003e with an installed capacity of \u003cONE_HUNDRED_THOUSAND\u003e wheels per annum phase ii will add another \u003cONE_HUNDRED_THOUSAND\u003e wheels per annum and begin operations by \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the company will initially prioritise fulfilling the requirements of indian railways as per the wheel supply agreement programme with the remainder addressing demand from private players in both domestic and export markets jalan said under an agreement with the ministry of railways rtrwl will supply forged rail wheels up to \u003cEIGHT_TEN_THOUSAND\u003e wheels per annum \u003cTHREE_TEN_PERCENT\u003e of installed capacity over \u003cTWO_TEN\u003e years as part of the atmanirbhar bharat initiative","timestamp":"2024-07-19T12:03:00+05:30","market_timestamp":"2024-07-19T12:03:00+05:30","off_market_hours":false}