{"url":"https://www.moneycontrol.com/news/business/strongest-incentives-from-the-state-should-be-for-evs-bmw-12778025.html","title":"Strongest incentives from the state should be for EVs: BMW","description":"The company, which on Wednesday introduced the all-electric MINI Countryman and electric scooter CE04 in the country, said the market here is still evolving and efforts should continue to smoothen and accelerate this transition.BMW i5 M60 xDrive Related stories","content":"German luxury carmaker BMW on Wednesday said incentives are necessary to support the growth of the electric vehicle segment. The company, which on Wednesday introduced the all-electric MINI Countryman and electric scooter CE04 in the country, said the market here is still evolving and efforts should continue to smoothen and accelerate this transition. In a press conference here, BMW Group Senior Vice President, Region Asia Pacific, Eastern Europe, Middle East and Africa Jean-Philippe Parain stated that the \"strongest incentives from the state should be for EVs\". Parain noted that in some countries, where customers drive longer distances, plug-in hybrid vehicles (PHEVs) can be a bridge. \"But if I were to speak for India, I would focus on the full transition to full electric vehicles\", he added. In India the total tax incidence on hybrid vehicles in the country is 43 per cent, which is inclusive of GST, while battery electric vehicles attract a tax of about 5 per cent. Parain stated that there is potential for EVs in India and the company is looking to drive in more products into the country. He noted that besides battery electric vehicles, the automaker is also investing in internal combustion engine models, plug-in hybrids and also thinking about hydrogen vehicles. The company plans to remain flexible when it comes to technologies, Parain stated. Globally, he said that BMW is among the top sellers of EVs along with Tesla and BYD. He noted that the company's sales were impacted in China. \"India is an exception and there is a need to sustain this growth going forward,\" Parain stated. BMW Group India President and Chief Executive Officer Vikram Pawah stated that EVs were suitable for India. Penetration of electric vehicles in India is encouraging and once products are available across all price points, the segment will grow very fast, he noted. Pahwa also noted that the automaker, besides introducing new models, is also investing in establishing charging infrastructure to aid the growth of the segment. BMW on Wednesday introduced the all-new 5 Series Long Wheelbase in the country with price starting at Rs 72.9 lakh. The company also introduced the new Mini Cooper S and the new all-electric MINI Countryman priced at Rs 44.9 lakh and Rs 54.9 lakh respectively. BMW Motorrad introduced premium electric scooter CE 04 at Rs 14.9 lakh. ","cleaned_content":"german luxury carmaker bmw on wednesday said incentives are necessary to support the growth of the electric vehicle segment the company which on wednesday introduced the all electric mini countryman and electric scooter ce04 in the country said the market here is still evolving and efforts should continue to smoothen and accelerate this transition in a press conference here bmw group senior vice president region asia pacific eastern europe middle east and africa jean philippe parain stated that the strongest incentives from the state should be for evs parain noted that in some countries where customers drive longer distances plug in hybrid vehicles phevs can be a bridge but if i were to speak for india i would focus on the full transition to full electric vehicles he added in india the total tax incidence on hybrid vehicles in the country is \u003cFOUR_TEN_PERCENT\u003e which is inclusive of gst while battery electric vehicles attract a tax of about \u003cFIVE_PERCENT\u003e parain stated that there is potential for evs in india and the company is looking to drive in more products into the country he noted that besides battery electric vehicles the automaker is also investing in internal combustion engine models plug in hybrids and also thinking about hydrogen vehicles the company plans to remain flexible when it comes to technologies parain stated globally he said that bmw is among the top sellers of evs along with tesla and byd he noted that the companys sales were impacted in china india is an exception and there is a need to sustain this growth going forward parain stated bmw group india president and chief executive officer vikram pawah stated that evs were suitable for india penetration of electric vehicles in india is encouraging and once products are available across all price points the segment will grow very fast he noted pahwa also noted that the automaker besides introducing new models is also investing in establishing charging infrastructure to aid the growth of the segment bmw on wednesday introduced the all new \u003cFIVE_\u003e series long wheelbase in the country with price starting at rs \u003cSEVEN_TEN\u003e lakh the company also introduced the new mini cooper s and the new all electric mini countryman priced at rs \u003cFOUR_TEN\u003e lakh and rs \u003cFIVE_TEN\u003e lakh respectively bmw motorrad introduced premium electric scooter ce \u003cFOUR_\u003e at rs \u003cONE_TEN\u003e lakh","timestamp":"2024-07-25T12:06:00+05:30","market_timestamp":"2024-07-25T12:06:00+05:30","off_market_hours":false}