{"url":"https://www.moneycontrol.com/news/business/glenmark-pharma-gets-usfda-nod-for-seizure-treatment-drug-2-12770924.html","title":"Glenmark Pharma gets USFDA nod for seizure treatment drug","description":"The approval by the US Food \u0026 Drug Administration (USFDA) is for Topiramate capsules of strengths 15 mg and 25 mg, Glenmark Pharmaceuticals said in a statement.Glenmark Pharma gets USFDA nod for seizure treatment drug","content":"Glenmark Pharmaceuticals Ltd on Wednesday said it has received final approval from the US health regulator for its generic Topiramate capsules used to treat certain types of seizure. The approval by the US Food \u0026 Drug Administration (USFDA) is for Topiramate capsules of strengths 15 mg and 25 mg, Glenmark Pharmaceuticals said in a statement. Glenmark's Topiramate capsules USP, 15 mg and 25 mg have been determined by the FDA to be bioequivalent and therapeutically equivalent to Topamax capsules, 15 mg and 25 mg of Janssen Pharmaceuticals, Inc., and will be distributed in the US by Glenmark Pharmaceuticals Inc., USA, it added. The company said its current portfolio consists of 198 products authorised for distribution in the US marketplace and 50 ANDAs (Abbreviated New Drug Applications) pending approval with the USFDA. The company said it continues to identify and explore external development partnerships to supplement and accelerate the growth of its existing pipeline and portfolio. ","cleaned_content":"glenmark pharmaceuticals ltd on wednesday said it has received final approval from the us health regulator for its generic topiramate capsules used to treat certain types of seizure the approval by the us food drug administration usfda is for topiramate capsules of strengths \u003cONE_TEN\u003e mg and \u003cTWO_TEN\u003e mg glenmark pharmaceuticals said in a statement glenmarks topiramate capsules usp \u003cONE_TEN\u003e mg and \u003cTWO_TEN\u003e mg have been determined by the fda to be bioequivalent and therapeutically equivalent to topamax capsules \u003cONE_TEN\u003e mg and \u003cTWO_TEN\u003e mg of janssen pharmaceuticals inc and will be distributed in the us by glenmark pharmaceuticals inc usa it added the company said its current portfolio consists of \u003cONE_HUNDRED\u003e products authorised for distribution in the us marketplace and \u003cFIVE_TEN\u003e andas abbreviated new drug applications pending approval with the usfda the company said it continues to identify and explore external development partnerships to supplement and accelerate the growth of its existing pipeline and portfolio","timestamp":"2024-07-17T10:40:00+05:30","market_timestamp":"2024-07-17T10:40:00+05:30","off_market_hours":false}