{"url":"https://www.moneycontrol.com/news/business/private-sector-needs-to-step-up-match-govts-efforts-towards-job-creation-anand-mahindra-12776859.html","title":"Private sector needs to step up, match govt's efforts towards job creation: Anand Mahindra","description":"New Delhi, Jul 24  India's private sector needs to step up and match the government's efforts towards job creation and making young people employable, a..Private sector needs to step up, match govt's efforts towards job creation: Anand MahindraRelated stories","content":"India's private sector needs to step up and match the government's efforts towards job creation and making young people employable, as in the absence of a collective effort, the country's demographic dividend could become a demographic disaster, Mahindra Group Chairman Anand Mahindra said on Wednesday. In his reaction to the Union Budget for 2024-25, he said it shows evidence that the government recognises the importance of growth accompanied by job-creation. \"We are the envy of the world in terms of our growth in GDP. We are the preferred destination of the world for investment because of the belief in our future,\" Mahindra said in a post on social media platform X. Mahindra said the schemes announced by Finance Minister Nirmala Sitharaman are promising. \"But they need to be tracked closely to ensure that the incentives are working and if any tweaks/modifications are required,\" he added. Asking the private sector to also play their part, Mahindra said it \"needs to step up to the crease and do its part by investing in both employment \u0026 employability\". He cautioned that, \"If we don't all pull together for this task, the demographic dividend will go back to being a demographic disaster.\" ","cleaned_content":"indias private sector needs to step up and match the governments efforts towards job creation and making young people employable as in the absence of a collective effort the countrys demographic dividend could become a demographic disaster mahindra group chairman anand mahindra said on wednesday in his reaction to the union budget for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e he said it shows evidence that the government recognises the importance of growth accompanied by job creation we are the envy of the world in terms of our growth in gdp we are the preferred destination of the world for investment because of the belief in our future mahindra said in a post on social media platform x mahindra said the schemes announced by finance minister nirmala sitharaman are promising but they need to be tracked closely to ensure that the incentives are working and if any tweaks modifications are required he added asking the private sector to also play their part mahindra said it needs to step up to the crease and do its part by investing in both employment employability he cautioned that if we dont all pull together for this task the demographic dividend will go back to being a demographic disaster","timestamp":"2024-07-24T12:19:00+05:30","market_timestamp":"2024-07-24T12:19:00+05:30","off_market_hours":false}