{"url":"https://www.moneycontrol.com/news/business/diageo-indias-ceo-hina-nagarajan-summoned-by-delhi-police-in-liquor-payments-case-12779070.html","title":"Diageo India issues clarification after reports say CEO Nagarajan summoned by Delhi Police","description":"The company said the Delhi Police has sought information about operations from a company representative and not CEO Hina Nagarajan specificallyHina Nagarajan, the CEO of United Spirits, has been asked to appear before police on July 26Related stories","content":"Diageo India said on July 26 it received a notice to submit information about is operations, which can be done by a company representative and not specifically by the chief executive officer (CEO). The company was reacting to a report by news agency Reuters that Hina Nagarajan, the CEO of United Spirits, which is majority owned by Diageo, has been asked to appear before Delhi Police on July 26 and provide documents related to company sales. \"Such notices from regulatory authorities requesting information are usually addressed to the company head-this is a routine process. This notice requires information to be submitted by a representative for the company, pertaining to its operations between the period of 2017 and 2020, and not specifically from the Chief Executive Officer. We are cooperating with the authorities as we have always done,\" the company told exchanges. It believed other manufacturers might have gotten the notice as well, the company said. \"You are hereby directed to appear in person or through a company representative ... for joining (the) investigation,\" the Reuters report of July 25 quoted the notice as saying. Nagarajan did not respond to requests for comment, Reuters said. \"We are in the process of sending in an authorised representative, as sought in the notice,\" a company spokesperson told the company. A liquor industry source with direct knowledge of the matter said the Delhi investigation concerned how companies like Diageo India supplied liquor to government agencies, which ran retail shops, and how those agencies sometimes offered early payments to suppliers who offered discounts, the report said. The police is investigating whether there was any wrongdoing in this process and has called the CEO as a witness, the source told Reuters. The police notice asked Nagarajan to explain \"whether the discount given to the corporations (government agencies) was in accordance with excise policy\", Reuters reported said. Euromonitor estimates Diageo, the world's biggest spirits maker which sells the Johnnie Walker scotch whisky, is also India's largest with a 19 percent market share by volume in the $35 billion market. The July 4 police notice also sought invoice details from United Spirits in respect of sales and payments received from Delhi city agencies during April 2017 and March 2020, and the name of the company employee who collected payments, it said. (With agency inputs) ","cleaned_content":"diageo india said on july \u003cTWO_TEN\u003e it received a notice to submit information about is operations which can be done by a company representative and not specifically by the chief executive officer ceo the company was reacting to a report by news agency reuters that hina nagarajan the ceo of united spirits which is majority owned by diageo has been asked to appear before delhi police on july \u003cTWO_TEN\u003e and provide documents related to company sales such notices from regulatory authorities requesting information are usually addressed to the company head this is a routine process this notice requires information to be submitted by a representative for the company pertaining to its operations between the period of \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e and not specifically from the chief executive officer we are cooperating with the authorities as we have always done the company told exchanges it believed other manufacturers might have gotten the notice as well the company said you are hereby directed to appear in person or through a company representative for joining the investigation the reuters report of july \u003cTWO_TEN\u003e quoted the notice as saying nagarajan did not respond to requests for comment reuters said we are in the process of sending in an authorised representative as sought in the notice a company spokesperson told the company a liquor industry source with direct knowledge of the matter said the delhi investigation concerned how companies like diageo india supplied liquor to government agencies which ran retail shops and how those agencies sometimes offered early payments to suppliers who offered discounts the report said the police is investigating whether there was any wrongdoing in this process and has called the ceo as a witness the source told reuters the police notice asked nagarajan to explain whether the discount given to the corporations government agencies was in accordance with excise policy reuters reported said euromonitor estimates diageo the worlds biggest spirits maker which sells the johnnie walker scotch whisky is also indias largest with a \u003cONE_TEN_PERCENT\u003e market share by volume in the \u003cTHREE_TEN\u003e billion market the july \u003cFOUR_\u003e police notice also sought invoice details from united spirits in respect of sales and payments received from delhi city agencies during april \u003cTWO_THOUSAND\u003e and march \u003cTWO_THOUSAND\u003e and the name of the company employee who collected payments it said with agency inputs","timestamp":"2024-07-26T12:56:00+05:30","market_timestamp":"2024-07-26T12:56:00+05:30","off_market_hours":false}