{"url":"https://www.moneycontrol.com/news/business/adani-plans-to-build-port-in-vietnam-to-tap-trade-opportunities-12768966.html","title":"Adani plans to build port in Vietnam to tap trade opportunities","description":"Adani Ports and Special Economic Zone Ltd. has secured an “in-principle approval from the Vietnamese government” for a greenfield development in Da Nang, Karan Adani, managing director of the company, said in an interview.Adani plans to build port in Vietnam to tap trade opportunitiesRelated stories","content":"Billionaire Gautam Adani plans to build a port in Vietnam as the Indian conglomerate seeks to develop infrastructure overseas to tap opportunities from increasing trade. Adani Ports and Special Economic Zone Ltd. has secured an “in-principle approval from the Vietnamese government” for a greenfield development in Da Nang, Karan Adani, managing director of the company, said in an interview. The project, which will have container terminals and multipurpose berths to handle various types of cargo, is at an early stage of planning and the total investment required hasn’t been finalized yet, he said. “The idea is to make India a maritime hub,” Karan, the elder son of Gautam Adani, said. “We are targeting countries that are high on manufacturing or high on population, which will lead to high consumption. We are focusing on export volumes in these countries.” Adani Ports is the largest port operator in India. It gets about 5% of its total volume from international operations and wants to increase the ratio to 10% by 2030, Karan Adani said. The company is looking at opportunities in the Middle East, Southeast Asia, East Africa, Bangladesh, Sri Lanka, Maldives, Vietnam and Cambodia as these are regions where trade is coming to India, he said. ","cleaned_content":"billionaire gautam adani plans to build a port in vietnam as the indian conglomerate seeks to develop infrastructure overseas to tap opportunities from increasing trade adani ports and special economic zone ltd has secured an in principle approval from the vietnamese government for a greenfield development in da nang karan adani managing director of the company said in an interview the project which will have container terminals and multipurpose berths to handle various types of cargo is at an early stage of planning and the total investment required hasn t been finalized yet he said the idea is to make india a maritime hub karan the elder son of gautam adani said we are targeting countries that are high on manufacturing or high on population which will lead to high consumption we are focusing on export volumes in these countries adani ports is the largest port operator in india it gets about \u003cFIVE_PERCENT\u003e of its total volume from international operations and wants to increase the ratio to \u003cONE_TEN_PERCENT\u003e by \u003cTWO_THOUSAND\u003e karan adani said the company is looking at opportunities in the middle east southeast asia east africa bangladesh sri lanka maldives vietnam and cambodia as these are regions where trade is coming to india he said","timestamp":"2024-07-15T06:35:00+05:30","market_timestamp":"2024-07-15T09:15:00+05:30","off_market_hours":true}