{"url":"https://www.moneycontrol.com/news/business/phonepe-google-pay-cede-online-payment-share-to-new-entrants-12775348.html","title":"PhonePe, Google Pay cede online payment share to new entrants","description":"PhonePe’s share in total UPI transactions dropped to 48.37% from 48.67% in May. Google Pay’s portion shrunk to 36.76% from 37.18% in the previous month, according to data released by the National Payments Corporation of India. PhonePe, Google Pay cede online payment share to new entrantsRelated stories","content":"Walmart Inc.-owned PhonePe and Alphabet Inc.’s Google Pay saw a marginal decline in their share of total transactions processed through India’s unified payments interface in June as smaller players gained traction. PhonePe’s share in total UPI transactions dropped to 48.37% from 48.67% in May. Google Pay’s portion shrunk to 36.76% from 37.18% in the previous month, according to data released by the National Payments Corporation of India. Overall, the UPI network processed 13.88 billion transactions in June, a 1% drop over the prior month. Operated by state-backed NPCI, UPI is a system that allows users to make instant money transfers by linking banks with fintech apps such as Paytm, PhonePe and Google Pay. For instance, UPI transactions on Axis Bank Ltd.’s apps grew 17% to 75 million in June, while the Navi app saw a 20% increase to 35.7 million transactions. Additionally, Flipkart, the Indian e-commerce giant and PhonePe’s sister company, launched a separate UPI payments service called super.money. Mukesh Ambani’s Jio Financial Services also entered the fray with its JioFinance app to tap into India’s burgeoning fintech ecosystem.  Reeling under regulatory setback, Paytm retained its 8% share from last month, signaling a halt in market erosion from 13% at the start of the year. Paytm’s net loss for the fiscal first quarter through June more than doubled to 8.39 billion rupees ($100 million) after the Reserve Bank of India earlier this year ordered a near-shutdown of its banking affiliate. ","cleaned_content":"walmart inc owned phonepe and alphabet inc s google pay saw a marginal decline in their share of total transactions processed through india s unified payments interface in june as smaller players gained traction phonepe s share in total upi transactions dropped to \u003cFOUR_TEN_PERCENT\u003e from \u003cFOUR_TEN_PERCENT\u003e in may google pay s portion shrunk to \u003cTHREE_TEN_PERCENT\u003e from \u003cTHREE_TEN_PERCENT\u003e in the previous month according to data released by the national payments corporation of india overall the upi network processed \u003cONE_TEN\u003e billion transactions in june a \u003cONE_PERCENT\u003e drop over the prior month operated by state backed npci upi is a system that allows users to make instant money transfers by linking banks with fintech apps such as paytm phonepe and google pay for instance upi transactions on axis bank ltd s apps grew \u003cONE_TEN_PERCENT\u003e to \u003cSEVEN_TEN\u003e million in june while the navi app saw a \u003cTWO_TEN_PERCENT\u003e increase to \u003cTHREE_TEN\u003e million transactions additionally flipkart the indian e commerce giant and phonepe s sister company launched a separate upi payments service called super money mukesh ambani s jio financial services also entered the fray with its jiofinance app to tap into india s burgeoning fintech ecosystem reeling under regulatory setback paytm retained its \u003cEIGHT_PERCENT\u003e share from last month signaling a halt in market erosion from \u003cONE_TEN_PERCENT\u003e at the start of the year paytm s net loss for the fiscal first quarter through june more than doubled to \u003cEIGHT_\u003e billion rupees \u003cONE_HUNDRED\u003e million after the reserve bank of india earlier this year ordered a near shutdown of its banking affiliate","timestamp":"2024-07-23T06:35:00+05:30","market_timestamp":"2024-07-23T09:15:00+05:30","off_market_hours":true}