{"url":"https://www.moneycontrol.com/news/business/simple-energy-raises-20-million-from-investors-12780840.html","title":"Simple Energy raises $20 million from investors","description":"The funding round saw participation from the company's current and new investors, the company said in a statement.Simple Energy raises $20 million from investors","content":"Electric two-wheeler startup Simple Energy on Monday said it has raised USD 20 million in a Series A funding round. The funding round saw participation from the company's current and new investors, the company said in a statement. The newly raised funds will be used to scale up the production capacity, support the company's entry into new markets and facilitate new product development, it added. The capital raised will be tactically deployed to bolster production capacity and expand the dealership network nationwide, he added. Simple Energy sells two products -- Simple One and Simple Dot One. Currently in a pilot phase in Bengaluru, Simple Energy has begun deliveries in the city and is preparing to open dealership stores in Bengaluru, Mysore, Chennai, Vijayawada, Goa, Vizag, Kochi, Mumbai, Pune, Ahmedabad, Surat, Delhi, and Hyderabad in the coming weeks, the statement said. ","cleaned_content":"electric two wheeler startup simple energy on monday said it has raised usd \u003cTWO_TEN\u003e million in a series a funding round the funding round saw participation from the companys current and new investors the company said in a statement the newly raised funds will be used to scale up the production capacity support the companys entry into new markets and facilitate new product development it added the capital raised will be tactically deployed to bolster production capacity and expand the dealership network nationwide he added simple energy sells two products simple one and simple dot one currently in a pilot phase in bengaluru simple energy has begun deliveries in the city and is preparing to open dealership stores in bengaluru mysore chennai vijayawada goa vizag kochi mumbai pune ahmedabad surat delhi and hyderabad in the coming weeks the statement said","timestamp":"2024-07-29T11:10:00+05:30","market_timestamp":"2024-07-29T11:10:00+05:30","off_market_hours":false}