{"url":"https://www.moneycontrol.com/news/business/akasa-air-eyes-flights-to-asias-tourist-hotspots-12782724.html","title":"Akasa Air eyes flights to Asia’s tourist hotspots","description":"The Mumbai-based budget carrier is gearing up to start flights to Kathmandu in Nepal and Bangladesh’s capital Dhaka, Praveen Iyer, chief commercial officer at Akasa’s parent SNV Aviation Pvt, said in an interview. Other travel hotspots such as Thailand, Vietnam, Malaysia and Indonesia are also on the airline’s radar, he said. Akasa Air eyes flights to Asia’s tourist hotspotsRelated stories","content":"India’s Akasa Air plans to add destinations across Southeast Asia and the Indian subcontinent to tap the booming demand for overseas air travel in the world’s most-populous nation. The Mumbai-based budget carrier is gearing up to start flights to Kathmandu in Nepal and Bangladesh’s capital Dhaka, Praveen Iyer, chief commercial officer at Akasa’s parent SNV Aviation Pvt, said in an interview. Other travel hotspots such as Thailand, Vietnam, Malaysia and Indonesia are also on the airline’s radar, he said. “Indians in general love traveling. That prompts us to look at the next set of expansion,” Iyer said. Outbound traffic from India starting October is “very strong” with Southeast Asian destinations emerging as big contributors, he said. Akasa is also preparing for intensifying competition as its local rivals bulk up: Tata Group-owned Air India and Vistara are merging while market leader IndiGo plans to fly long-haul international routes. Meanwhile, at least a half-dozen overseas carriers such as Etihad Airways and Malaysia Airlines have added or introduced flights to Indian cities. The carrier ordered 150 Boeing 737 Max jets in January, pushing its total order book to 226 jets, due to be delivered over the next eight years. Akasa aims to expand its short-haul international network using its narrowbody fleet that is capable of flying routes of up to six hours. It began overseas operations in March with services to Doha from Mumbai and has added more Gulf destinations including Abu Dhabi and Jeddah. Pets on BoardClosely held Akasa has already eked out a 4.7% share so far this year in the highly competitive Indian market, which has seen multiple carriers go bust in recent years. IndiGo controls 61% of the market while Air India had 14.2%, according to data from India’s aviation regulator. With a fleet of 24 jets flying 49 routes, Akasa has narrowed in on niche offerings such as allowing pets on board. It has carried 3,700 pets since implementing the policy in Nov. 2022.  Akasa does not plan to raise funds and is “well capitalized,” Iyer said, declining to provide additional details or the carrier’s path to profitability. Akasa Air’s expansion comes as India’s aviation industry becomes increasingly consolidated, and its larger rivals try to introduce new products to entice customers. Under Tata’s ownership, erstwhile state-owned Air India will fold in Vistara, while low-cost unit Air India Express will combine with AIX Connect. IndiGo is expected to unveil a new premium cabin soon. Both IndiGo and Air India have placed record aircraft orders with aircraft manufacturers. “We will always be around two 800-pound gorillas, right? One is the Tata group and the other is IndiGo. That’s the reality,” said Iyer. “How we build our network is what matters to us.” ","cleaned_content":"india s akasa air plans to add destinations across southeast asia and the indian subcontinent to tap the booming demand for overseas air travel in the world s most populous nation the mumbai based budget carrier is gearing up to start flights to kathmandu in nepal and bangladesh s capital dhaka praveen iyer chief commercial officer at akasa s parent snv aviation pvt said in an interview other travel hotspots such as thailand vietnam malaysia and indonesia are also on the airline s radar he said indians in general love traveling that prompts us to look at the next set of expansion iyer said outbound traffic from india starting october is very strong with southeast asian destinations emerging as big contributors he said akasa is also preparing for intensifying competition as its local rivals bulk up tata group owned air india and vistara are merging while market leader indigo plans to fly long haul international routes meanwhile at least a half dozen overseas carriers such as etihad airways and malaysia airlines have added or introduced flights to indian cities the carrier ordered \u003cONE_HUNDRED\u003e boeing \u003cSEVEN_HUNDRED\u003e max jets in january pushing its total order book to \u003cTWO_HUNDRED\u003e jets due to be delivered over the next eight years akasa aims to expand its short haul international network using its narrowbody fleet that is capable of flying routes of up to six hours it began overseas operations in march with services to doha from mumbai and has added more gulf destinations including abu dhabi and jeddah pets on boardclosely held akasa has already eked out a \u003cFOUR_PERCENT\u003e share so far this year in the highly competitive indian market which has seen multiple carriers go bust in recent years indigo controls \u003cSIX_TEN_PERCENT\u003e of the market while air india had \u003cONE_TEN_PERCENT\u003e according to data from india s aviation regulator with a fleet of \u003cTWO_TEN\u003e jets flying \u003cFOUR_TEN\u003e routes akasa has narrowed in on niche offerings such as allowing pets on board it has carried \u003cTHREE_THOUSAND\u003e pets since implementing the policy in nov \u003cTWO_THOUSAND\u003e akasa does not plan to raise funds and is well capitalized iyer said declining to provide additional details or the carrier s path to profitability akasa air s expansion comes as india s aviation industry becomes increasingly consolidated and its larger rivals try to introduce new products to entice customers under tata s ownership erstwhile state owned air india will fold in vistara while low cost unit air india express will combine with aix connect indigo is expected to unveil a new premium cabin soon both indigo and air india have placed record aircraft orders with aircraft manufacturers we will always be around two \u003cEIGHT_HUNDRED\u003e pound gorillas right one is the tata group and the other is indigo that s the reality said iyer how we build our network is what matters to us","timestamp":"2024-07-31T07:06:00+05:30","market_timestamp":"2024-07-31T09:15:00+05:30","off_market_hours":true}