{"url":"https://www.moneycontrol.com/news/business/hdfc-bank-advises-customers-to-be-cautious-of-fake-trading-platforms-12784490.html","title":"HDFC Bank advises customers to be cautious of fake trading platforms","description":"Most of the lucrative offers come through social media platforms and the aim of this advisory is to increase awareness about potential investment frauds to safeguard customers, HDFC Bank said in a statement.HDFC Bank advises customers to be cautious of fake trading platformsRelated stories","content":"Faced with a growing number of cases of investment fraud, HDFC Bank on Thursday advised its customers to be cautious against fraudulent trading platforms that offer investment opportunities. Most of the lucrative offers come through social media platforms and the aim of this advisory is to increase awareness about potential investment frauds to safeguard customers, HDFC Bank said in a statement. In cases of investment fraud, fraudsters are seen to typically promise unusually high returns on investments in stocks, IPOs, cryptocurrency, Bitcoin, etc, it said. Cautioning on this fraud, HDFC Bank, executive vice president (Credit Intelligence and Control) Manish Agrawal, said, \"We are seeing an increase in the number of cases of investment frauds and want to help create a wider awareness and knowledge about the issue, so that the consumers can avoid falling prey to these deceptive schemes.\" While the government, banks and regulatory bodies are taking steps to curb these frauds, individual vigilance and awareness play a very important role in avoiding falling prey to illegitimate schemes, he said. The statement further said platforms are also seen promoted on social media inviting persons to join these high return investment schemes, which are in fact bogus. Fraudsters typically exploit people through social engineering tactics, however being cautious and transacting only after due diligence, will help safeguard against fraudsters, it added. In the event that a person becomes a victim of any online fraud, it said, they should immediately report the unauthorised transactions to the bank in order to get the payment channel blocked. Customers should also file a complaint by calling 1930 helpline number started by the Ministry of Home Affairs (MHA) as well as submit a complaint on the National Cybercrime Reporting Portal. ","cleaned_content":"faced with a growing number of cases of investment fraud hdfc bank on thursday advised its customers to be cautious against fraudulent trading platforms that offer investment opportunities most of the lucrative offers come through social media platforms and the aim of this advisory is to increase awareness about potential investment frauds to safeguard customers hdfc bank said in a statement in cases of investment fraud fraudsters are seen to typically promise unusually high returns on investments in stocks ipos cryptocurrency bitcoin etc it said cautioning on this fraud hdfc bank executive vice president credit intelligence and control manish agrawal said we are seeing an increase in the number of cases of investment frauds and want to help create a wider awareness and knowledge about the issue so that the consumers can avoid falling prey to these deceptive schemes while the government banks and regulatory bodies are taking steps to curb these frauds individual vigilance and awareness play a very important role in avoiding falling prey to illegitimate schemes he said the statement further said platforms are also seen promoted on social media inviting persons to join these high return investment schemes which are in fact bogus fraudsters typically exploit people through social engineering tactics however being cautious and transacting only after due diligence will help safeguard against fraudsters it added in the event that a person becomes a victim of any online fraud it said they should immediately report the unauthorised transactions to the bank in order to get the payment channel blocked customers should also file a complaint by calling \u003cONE_THOUSAND\u003e helpline number started by the ministry of home affairs mha as well as submit a complaint on the national cybercrime reporting portal","timestamp":"2024-08-01T14:41:00+05:30","market_timestamp":"2024-08-01T14:41:00+05:30","off_market_hours":false}