{"url":"https://www.moneycontrol.com/news/business/essars-it-firm-black-box-to-raise-rs-410-crore-via-preferential-issue-12785625.html","title":"Essar's IT firm Black Box to raise Rs 410 crore via preferential issue","description":"The fundraising plan includes Rs 200 crore from existing promoters of the company, Rs 200 crore from marquee investors, including foreign institutional investors and Rs 10 crore from the company's key management personnel, according to a statement.Essar's IT firm Black Box to raise Rs 410 crore via preferential issueRelated stories","content":"Conglomerate Essar Group's IT firm Black Box on Friday said its board has approved plans to raise up to Rs 410 crore through preferential issue. The fundraising plan includes Rs 200 crore from existing promoters of the company, Rs 200 crore from marquee investors, including foreign institutional investors and Rs 10 crore from the company's key management personnel, according to a statement. \"Black Box Limited...has received commitment for raising of funds aggregating to Rs 410 crore via preferential issue aimed at accelerating growth and expansion in the digital infrastructure sector,\" the company said in a statement. \"After the conversion of warrants into equity, promoter shareholding will be marginally lower from existing 71.1 per cent to 69.8 per cent. Black Box continues to be Essar's key investment in the technology space,\" the statement said. The fresh capital will be invested across several key areas spanning data centres, network infrastructure, research and development, and market expansion, it added. \"The investment will support the company's strategic expansion and growth initiatives into key Industry Verticals with relevant technology solutions with key leadership hiring and expanding its sales and business development efforts significantly both in North America and emerging markets,\" it said. Black Box, listed on the Indian stock exchanges, has operations spread across 35 countries, but its major business comes from the US. Black Box CEO Sanjeev Verma said the raised funds will “enable us to embark on an ambitious growth trajectory and enhance our digital infrastructure offerings and drive innovation in a rapidly evolving market.\" The IT firm reported a multi-fold rise to Rs 138 crore in its profits for FY24, while its revenue remained almost flat at Rs 6,282 crore. Black Box, listed on the Indian stock exchanges, has operations spread across 35 countries, but its major business comes from the US. Shares of Black Box were trading 4.99 per cent higher at Rs 557.35 apiece on the BSE on Friday. ","cleaned_content":"conglomerate essar groups it firm black box on friday said its board has approved plans to raise up to rs \u003cFOUR_HUNDRED\u003e crore through preferential issue the fundraising plan includes rs \u003cTWO_HUNDRED\u003e crore from existing promoters of the company rs \u003cTWO_HUNDRED\u003e crore from marquee investors including foreign institutional investors and rs \u003cONE_TEN\u003e crore from the companys key management personnel according to a statement black box limited has received commitment for raising of funds aggregating to rs \u003cFOUR_HUNDRED\u003e crore via preferential issue aimed at accelerating growth and expansion in the digital infrastructure sector the company said in a statement after the conversion of warrants into equity promoter shareholding will be marginally lower from existing \u003cSEVEN_TEN_PERCENT\u003e to \u003cSIX_TEN_PERCENT\u003e black box continues to be essars key investment in the technology space the statement said the fresh capital will be invested across several key areas spanning data centres network infrastructure research and development and market expansion it added the investment will support the companys strategic expansion and growth initiatives into key industry verticals with relevant technology solutions with key leadership hiring and expanding its sales and business development efforts significantly both in north america and emerging markets it said black box listed on the indian stock exchanges has operations spread across \u003cTHREE_TEN\u003e countries but its major business comes from the us black box ceo sanjeev verma said the raised funds will enable us to embark on an ambitious growth trajectory and enhance our digital infrastructure offerings and drive innovation in a rapidly evolving market the it firm reported a multi fold rise to rs \u003cONE_HUNDRED\u003e crore in its profits for fy24 while its revenue remained almost flat at rs \u003cSIX_THOUSAND\u003e crore black box listed on the indian stock exchanges has operations spread across \u003cTHREE_TEN\u003e countries but its major business comes from the us shares of black box were trading \u003cFOUR_PERCENT\u003e higher at rs \u003cFIVE_HUNDRED\u003e apiece on the bse on friday","timestamp":"2024-08-02T14:52:00+05:30","market_timestamp":"2024-08-02T14:52:00+05:30","off_market_hours":false}