{"url":"https://www.moneycontrol.com/news/business/meesho-onboards-hari-bhartia-kalpana-morparia-rohit-bhagat-as-independent-directors-12785372.html","title":"Meesho onboards Hari Bhartia, Kalpana Morparia, Rohit Bhagat as independent directors","description":"Along with Bhartia, Meesho has onboarded former JP Morgan Chairman Kalpana Morparia for South and South East Asia, PhonePe non-executive Chairman of the board Rohit Bhagat, and San Francisco-based AI company Ema's CEO Surojit Chatterjee.Meesho onboards Hari Bhartia, Kalpana Morparia, Rohit Bhagat as independent directorsRelated stories","content":"Softbank-backed e-commerce firm Meesho on Friday said it has appointed Jubilant Bhartia Group founder Hari S Bhartia along with three other seasoned business leaders as independent directors. Along with Bhartia, Meesho has onboarded former JP Morgan Chairman Kalpana Morparia for South and South East Asia, PhonePe non-executive Chairman of the board Rohit Bhagat, and San Francisco-based AI company Ema's CEO Surojit Chatterjee. ALSO READ: Meesho expands board, inducts former Flipkart SVP Surojit Chatterjee as independent director Bhartia is the Founder and Co-Chairman of Jubilant Bhartia Group. The Jubilant Bhartia Group has four flagship companies listed on Indian stock exchanges, with a combined market capitalisation of approximately USD 7.65 billion, it added. Bhartia is also the Co-Chairman and Managing Director of Jubilant Pharmova Ltd as well as Co-Chairman of Jubilant Ingrevia Ltd and Jubilant FoodWorks Ltd, the master franchisee of Domino's Pizza and Dunkin' Donuts restaurants in India. Before serving JP Morgan, Morparia was at ICICI Bank where she was instrumental in the group's capital raising exercise as well as the merger of ICICI Ltd with ICICI Bank in 2002. Bhagat is currently the non-executive Chairman of the board at PhonePe, an independent director at AssetMark and the Lead Independent Trustee of the Franklin Templeton ETF Trust. His previous board and advisory roles span companies like Axis Bank, Flipkart, and FreeCharge. Chatterjee had guided Coinbase through a successful IPO as its Chief Product Officer in 2021. Previously at Google, Surojit scaled Google Mobile Ads and Google Shopping into multi-billion-dollar businesses as the VP and Head of Product. \"We are confident that their collective wisdom and diverse perspectives will play a pivotal role in steering the company towards new milestones and sustained success in revolutionizing the e-commerce landscape in India,\" Aatrey said. Meesho's board also includes co-founders Vidit Aatrey and Sanjeev Barnwal; Ashutosh Sharma, Head of Investments and Mergers and Acquisitions at Prosus Ventures; Mohit Bhatnagar, Managing Director at Peak XV Partners; Mukul Arora, Co-Managing Partner at Elevation Capital; and Sarthak Misra, Partner at SoftBank Investment Advisers. ","cleaned_content":"softbank backed e commerce firm meesho on friday said it has appointed jubilant bhartia group founder hari s bhartia along with three other seasoned business leaders as independent directors along with bhartia meesho has onboarded former jp morgan chairman kalpana morparia for south and south east asia phonepe non executive chairman of the board rohit bhagat and san francisco based ai company emas ceo surojit chatterjee also read meesho expands board inducts former flipkart svp surojit chatterjee as independent director bhartia is the founder and co chairman of jubilant bhartia group the jubilant bhartia group has four flagship companies listed on indian stock exchanges with a combined market capitalisation of approximately usd \u003cSEVEN_\u003e billion it added bhartia is also the co chairman and managing director of jubilant pharmova ltd as well as co chairman of jubilant ingrevia ltd and jubilant foodworks ltd the master franchisee of dominos pizza and dunkin donuts restaurants in india before serving jp morgan morparia was at icici bank where she was instrumental in the groups capital raising exercise as well as the merger of icici ltd with icici bank in \u003cTWO_THOUSAND\u003e bhagat is currently the non executive chairman of the board at phonepe an independent director at assetmark and the lead independent trustee of the franklin templeton etf trust his previous board and advisory roles span companies like axis bank flipkart and freecharge chatterjee had guided coinbase through a successful ipo as its chief product officer in \u003cTWO_THOUSAND\u003e previously at google surojit scaled google mobile ads and google shopping into multi billion dollar businesses as the vp and head of product we are confident that their collective wisdom and diverse perspectives will play a pivotal role in steering the company towards new milestones and sustained success in revolutionizing the e commerce landscape in india aatrey said meeshos board also includes co founders vidit aatrey and sanjeev barnwal ashutosh sharma head of investments and mergers and acquisitions at prosus ventures mohit bhatnagar managing director at peak xv partners mukul arora co managing partner at elevation capital and sarthak misra partner at softbank investment advisers","timestamp":"2024-08-02T12:20:00+05:30","market_timestamp":"2024-08-02T12:20:00+05:30","off_market_hours":false}