{"url":"https://www.moneycontrol.com/news/business/hero-motocorp-commences-operations-in-philippines-12784288.html","title":"Hero MotoCorp commences operations in Philippines","description":"The strategic expansion marks a significant milestone in the company's efforts to strengthen its global presence, it said in a statement.Hero MotoCorp commences operations in PhilippinesRelated stories","content":"Hero MotoCorp on Thursday said it has commenced operations in the Philippines. The strategic expansion marks a significant milestone in the company's efforts to strengthen its global presence, it said in a statement. Terrafirma Motors Corporation (TMC), a part of the Columbian Group of Companies, one of the leading automotive groups in the Philippines, will serve as the exclusive assembler and distributor of the company's products and services, it added. An assembly unit and parts warehouse has been set up at Terrafirma Motors Corporation in Laguna, Philippines. Spanning over 6,000 square metre, the facility boasts an annual capacity of over 150,000 units. This new assembly facility will produce Xpulse 200 4V, Hunk 160R 4V, and the Xoom 110 scooter. \"Combining Hero MotoCorp's global expertise with our local knowledge, we intend to make a significant impact in the market,\" TMC Chairman Bienvenido Sanvictores Santos stated. Hero MotoCorp is currently present in 48 countries with tech centres in India and Germany, and manufacturing facilities in India, Colombia, and Bangladesh. ","cleaned_content":"hero motocorp on thursday said it has commenced operations in the philippines the strategic expansion marks a significant milestone in the companys efforts to strengthen its global presence it said in a statement terrafirma motors corporation tmc a part of the columbian group of companies one of the leading automotive groups in the philippines will serve as the exclusive assembler and distributor of the companys products and services it added an assembly unit and parts warehouse has been set up at terrafirma motors corporation in laguna philippines spanning over \u003cSIX_THOUSAND\u003e square metre the facility boasts an annual capacity of over \u003cONE_HUNDRED_THOUSAND\u003e units this new assembly facility will produce xpulse \u003cTWO_HUNDRED\u003e \u003cFOUR_\u003e v hunk \u003cONE_HUNDRED\u003e r \u003cFOUR_\u003e v and the xoom \u003cONE_HUNDRED\u003e scooter combining hero motocorps global expertise with our local knowledge we intend to make a significant impact in the market tmc chairman bienvenido sanvictores santos stated hero motocorp is currently present in \u003cFOUR_TEN\u003e countries with tech centres in india and germany and manufacturing facilities in india colombia and bangladesh","timestamp":"2024-08-01T12:52:00+05:30","market_timestamp":"2024-08-01T12:52:00+05:30","off_market_hours":false}