{"url":"https://www.moneycontrol.com/news/business/ongc-to-increase-gas-production-in-tripura-to-feed-power-plants-official-12787125.html","title":"ONGC to increase gas production in Tripura to feed power plants: Official","description":"The decision comes amid reports of a reduction in gas supply to various gas-based power generation plants in the state.ONGC to increase gas production in Tripura to feed power plants: OfficialRelated stories","content":"Oil and Natural Gas Corporation (ONGC) has intensified operations to increase gas production in Tripura to feed power generation plants in the northeastern state, an official said on Monday. The decision comes amid reports of a reduction in gas supply to various gas-based power generation plants in the state. ONGC produced 1,527 million standard cubic metres (MMSCM) of gas in Tripura in the 2023-24 fiscal, while it has set a target of extracting 1,675 MMSCM gas in the current fiscal. He said that ONGC will dig as many as 20 new wells for gas exploration in the financial year 2024-25 and one more rig will be added shortly to boost the exploration drive. At present, six rigs are being used by ONGC to explore natural gas in the northeastern state. Besides new exploration, ONGC has also initiated the process of cluster drilling to extract gas using old well sites as existing wells already have facilities and approval for exploration. \"Due to rapid urbanisation in Tripura, ONGC is focusing on cluster drilling to extract gas by using old wells because facilities are already available there. Also, we don't need to get fresh approval from the state for gas exploration or extraction in those sites. There is also no need to acquire land which has become a costly affair,\" he said. Emphasising the issue of proper utilisation of gas, Kumar said if one of the units of the Palatana power plant in the state shuts down for any reason, the gas supply becomes surplus, causing loss to ONGC. \"If gas becomes surplus due to the shutdown of any plant, it becomes a problem because other plants operating in the state do not have the capacity to receive the surplus gas. It causes loss to the ONGC,\" he said. Various state-run agencies operate the gas-based power plants in Tripura. ","cleaned_content":"oil and natural gas corporation ongc has intensified operations to increase gas production in tripura to feed power generation plants in the northeastern state an official said on monday the decision comes amid reports of a reduction in gas supply to various gas based power generation plants in the state ongc produced \u003cONE_THOUSAND\u003e million standard cubic metres mmscm of gas in tripura in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal while it has set a target of extracting \u003cONE_THOUSAND\u003e mmscm gas in the current fiscal he said that ongc will dig as many as \u003cTWO_TEN\u003e new wells for gas exploration in the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e and one more rig will be added shortly to boost the exploration drive at present six rigs are being used by ongc to explore natural gas in the northeastern state besides new exploration ongc has also initiated the process of cluster drilling to extract gas using old well sites as existing wells already have facilities and approval for exploration due to rapid urbanisation in tripura ongc is focusing on cluster drilling to extract gas by using old wells because facilities are already available there also we dont need to get fresh approval from the state for gas exploration or extraction in those sites there is also no need to acquire land which has become a costly affair he said emphasising the issue of proper utilisation of gas kumar said if one of the units of the palatana power plant in the state shuts down for any reason the gas supply becomes surplus causing loss to ongc if gas becomes surplus due to the shutdown of any plant it becomes a problem because other plants operating in the state do not have the capacity to receive the surplus gas it causes loss to the ongc he said various state run agencies operate the gas based power plants in tripura","timestamp":"2024-08-05T12:39:00+05:30","market_timestamp":"2024-08-05T12:39:00+05:30","off_market_hours":false}