{"url":"https://www.moneycontrol.com/technology/karnataka-animation-gaming-policy-3-0-govt-unveils-operational-guidelines-for-companies-article-12783655.html","title":"Karnataka animation \u0026 gaming policy 3.0: Govt unveils operational guidelines for companies","description":"The Department of Electronics, Information Technology, Biotechnology, and Science \u0026 Technology signed a Memorandum of Agreement (MoA) with ABAI to establish the AVGC Centre of Excellence (CoE) 2.0 on July 31.The IT-BT department also signed a Memorandum of Agreement (MoA) with ABAI to establish the AVGC Centre of Excellence (CoE) 2.0. This three-year partnership aims to advance the AVGC sector with enhanced technology and facilities.Related stories","content":"The Karnataka government on July 31 unveiled operational guidelines for the Animation, Visual Effects, Gaming, Comics, and Extended Reality (AVGC-XR) Policy 3.0 (2024-2029). Per the guidelines, companies will have to register with the State Department of Information Technology and Biotechnology (registration.k-tech.org) as a Karnataka AVGC (KAVGC) company to gain access to incentives under the policy. Also, read: Rs 150 crore allocated towards new animation \u0026 gaming policy The AVGC-XR Policy 3.0 offers a Rs 150 crore budget over five years and includes incentives such as 50 percent reimbursement for skill development (up to Rs 7.5 lakh), Rs 3,000 per employee per month for Provident Fund/ESI (up to Rs 12 lakh), and up to 40 percent reimbursement for early-stage start-up costs. The policy also offers 20 percent reimbursement for IT infrastructure (up to Rs 20 lakh) and rental costs (up to Rs 5 lakh), up to 50 percent coverage for IP filing and legal costs (Rs 20 lakh for international, Rs 5 lakh for domestic), and up to 30 percent for quality assurance (capped at Rs 5 lakh). Also, read: Karnataka targets 30,000 jobs through new AVGC-XR policy by 2028 Additionally, it offers 40 percent reimbursement of international market access expenses (up to Rs 5 lakh) and provides production grants covering up to 20 percent of various production costs. The initiatives include establishing virtual and hybrid incubation spaces to support start-ups in Bengaluru and six other locations in Karnataka, offering subsidised plug-and-play facilities to promote self-sufficiency and industry participation, and imparting skills to the workforce using Bengaluru's facilities, including a mini data centre with cloud connectivity. High-end servers and storages with graphic capabilities are expected to enhance the efficiency and cost-effectiveness of start-ups, SMEs, and studios, while the data storage centre and render farm with cloud access is expected to support start-ups in Mysuru and Mangaluru. Karnataka’s IT-BT Minister Priyank Kharge said the department is committed to creating up to 30,000 jobs and advancing skill development under the AVGC Policy 3.0. He said the AVGC CoE will offer crucial support to start-ups through incubation, mentoring, networking, and fundraising, reinforcing Karnataka’s position as a leading AVGC hub. Ekroop Caur, State IT-BT secretary, said the AVGC policy aims to enhance infrastructure, talent development, funding, and regulatory frameworks to build a robust creative ecosystem. Biren Ghose, ABAI president and Technicolor country head, recognised Karnataka as a key hub for animation, VFX, and game development. He attributed this growth to the Karnataka government’s strategic initiatives in collaboration, infrastructure, and talent development. Also, read: Karnataka aims to be global animation \u0026 gaming leader with 30,000 jobs by 2028: Siddaramaiah ","cleaned_content":"the karnataka government on july \u003cTHREE_TEN\u003e unveiled operational guidelines for the animation visual effects gaming comics and extended reality avgc xr policy \u003cTHREE_\u003e \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e per the guidelines companies will have to register with the state department of information technology and biotechnology registration k tech org as a karnataka avgc kavgc company to gain access to incentives under the policy also read rs \u003cONE_HUNDRED\u003e crore allocated towards new animation gaming policy the avgc xr policy \u003cTHREE_\u003e offers a rs \u003cONE_HUNDRED\u003e crore budget over five years and includes incentives such as \u003cFIVE_TEN_PERCENT\u003e reimbursement for skill development up to rs \u003cSEVEN_\u003e lakh rs \u003cTHREE_THOUSAND\u003e per employee per month for provident fund esi up to rs \u003cONE_TEN\u003e lakh and up to \u003cFOUR_TEN_PERCENT\u003e reimbursement for early stage start up costs the policy also offers \u003cTWO_TEN_PERCENT\u003e reimbursement for it infrastructure up to rs \u003cTWO_TEN\u003e lakh and rental costs up to rs \u003cFIVE_\u003e lakh up to \u003cFIVE_TEN_PERCENT\u003e coverage for ip filing and legal costs rs \u003cTWO_TEN\u003e lakh for international rs \u003cFIVE_\u003e lakh for domestic and up to \u003cTHREE_TEN_PERCENT\u003e for quality assurance capped at rs \u003cFIVE_\u003e lakh also read karnataka targets \u003cTHREE_TEN_THOUSAND\u003e jobs through new avgc xr policy by \u003cTWO_THOUSAND\u003e additionally it offers \u003cFOUR_TEN_PERCENT\u003e reimbursement of international market access expenses up to rs \u003cFIVE_\u003e lakh and provides production grants covering up to \u003cTWO_TEN_PERCENT\u003e of various production costs the initiatives include establishing virtual and hybrid incubation spaces to support start ups in bengaluru and six other locations in karnataka offering subsidised plug and play facilities to promote self sufficiency and industry participation and imparting skills to the workforce using bengalurus facilities including a mini data centre with cloud connectivity high end servers and storages with graphic capabilities are expected to enhance the efficiency and cost effectiveness of start ups smes and studios while the data storage centre and render farm with cloud access is expected to support start ups in mysuru and mangaluru karnataka s it bt minister priyank kharge said the department is committed to creating up to \u003cTHREE_TEN_THOUSAND\u003e jobs and advancing skill development under the avgc policy \u003cTHREE_\u003e he said the avgc coe will offer crucial support to start ups through incubation mentoring networking and fundraising reinforcing karnataka s position as a leading avgc hub ekroop caur state it bt secretary said the avgc policy aims to enhance infrastructure talent development funding and regulatory frameworks to build a robust creative ecosystem biren ghose abai president and technicolor country head recognised karnataka as a key hub for animation vfx and game development he attributed this growth to the karnataka government s strategic initiatives in collaboration infrastructure and talent development also read karnataka aims to be global animation gaming leader with \u003cTHREE_TEN_THOUSAND\u003e jobs by \u003cTWO_THOUSAND\u003e siddaramaiah","timestamp":"2024-07-31T20:47:00+05:30","market_timestamp":"2024-08-01T09:15:00+05:30","off_market_hours":true}