{"url":"https://www.moneycontrol.com/news/business/gensol-engineering-secures-rs-463-crore-solar-plant-project-in-gujarat-12780828.html","title":"Gensol Engineering secures Rs 463 crore solar plant project in Gujarat","description":"The project will be a state-of-the-art solar facility, featuring a fixed tilt module mounting structure and other system components, according to a company statement.Gensol Engineering secures Rs 463 crore solar plant project in Gujarat","content":"Gensol Engineering on Monday said it has secured an order worth Rs 463 crore to set up a solar plant at Gujarat’s Khavda RE Power Park. The project will be a state-of-the-art solar facility, featuring a fixed tilt module mounting structure and other system components, according to a company statement. Gensol Engineering has received an order for the engineering, design, procurement, erection, testing, and commissioning of a Rs 463 crore solar plant at Khavda RE Power Park in the Rann of Kutch, Gujarat, the statement said. Established in 2012, Gensol Engineering Ltd, is a leading player in the renewable energy sector specialising in solar power engineering, procurement, and construction (EPC) services, along with electric mobility solutions. ","cleaned_content":"gensol engineering on monday said it has secured an order worth rs \u003cFOUR_HUNDRED\u003e crore to set up a solar plant at gujarat s khavda re power park the project will be a state of the art solar facility featuring a fixed tilt module mounting structure and other system components according to a company statement gensol engineering has received an order for the engineering design procurement erection testing and commissioning of a rs \u003cFOUR_HUNDRED\u003e crore solar plant at khavda re power park in the rann of kutch gujarat the statement said established in \u003cTWO_THOUSAND\u003e gensol engineering ltd is a leading player in the renewable energy sector specialising in solar power engineering procurement and construction epc services along with electric mobility solutions","timestamp":"2024-07-29T10:59:00+05:30","market_timestamp":"2024-07-29T10:59:00+05:30","off_market_hours":false}