{"url":"https://www.moneycontrol.com/news/business/lt-bags-new-projects-in-india-overseas-for-setting-up-substations-transmission-lines-12780839.html","title":"L\u0026T bags new projects in India, overseas for setting up substations, transmission lines","description":"The large orders have been bagged by the power transmission and distribution 9(PT\u0026D) vertical of Larsen \u0026 Toubro, the company said in a filing to the BSE.L\u0026T bags new projects in India, overseas for setting up substations, transmission linesRelated stories","content":"Infrastructure major Larsen and Toubro (L\u0026T) on Monday said it has bagged new projects in the country and abroad for setting up substations and transmission lines. The large orders have been bagged by the power transmission and distribution 9(PT\u0026D) vertical of Larsen \u0026 Toubro, the company said in a filing to the BSE. L\u0026T has classified the orders as 'large', which means the order size ranges between Rs 2,500 crore and Rs 5,000 crore based on the company's internal classifications. In India, the company has bagged orders to execute two double circuit transmission line packages that are associated with evacuation of power from Jaisalmer/Barmer Renewable Energy Zone in Rajasthan to substations in Madhya Pradesh for further interconnections.\"In its pursuit of providing sustainable and efficient power supply, Saudi Arabia is strengthening the 380kV network in the central region. PT\u0026D has secured orders to build a 380kV Substation and 380kV overhead line segments,\" the filing said. In the United Arab Emirates, the company bagged projects to construct a substation and three substations, it added. Larsen \u0026 Toubro is a USD 27-billion Indian multinational engaged in engineering, procurement, and construction (EPC) projects, hi-tech manufacturing and services, operating across multiple geographies. ","cleaned_content":"infrastructure major larsen and toubro l t on monday said it has bagged new projects in the country and abroad for setting up substations and transmission lines the large orders have been bagged by the power transmission and distribution \u003cNINE_\u003e pt d vertical of larsen toubro the company said in a filing to the bse l t has classified the orders as large which means the order size ranges between rs \u003cTWO_THOUSAND\u003e crore and rs \u003cFIVE_THOUSAND\u003e crore based on the companys internal classifications in india the company has bagged orders to execute two double circuit transmission line packages that are associated with evacuation of power from jaisalmer barmer renewable energy zone in rajasthan to substations in madhya pradesh for further interconnections in its pursuit of providing sustainable and efficient power supply saudi arabia is strengthening the \u003cTHREE_HUNDRED\u003e kv network in the central region pt d has secured orders to build a \u003cTHREE_HUNDRED\u003e kv substation and \u003cTHREE_HUNDRED\u003e kv overhead line segments the filing said in the united arab emirates the company bagged projects to construct a substation and three substations it added larsen toubro is a usd \u003cTWO_TEN\u003e billion indian multinational engaged in engineering procurement and construction epc projects hi tech manufacturing and services operating across multiple geographies","timestamp":"2024-07-29T11:07:00+05:30","market_timestamp":"2024-07-29T11:07:00+05:30","off_market_hours":false}