{"url":"https://www.moneycontrol.com/news/business/sanofi-gets-cdsco-nod-for-beyfortus-india-12784392.html","title":"Sanofi gets CDSCO  nod for Beyfortus India","description":"Beyfortus is used for the prevention of Respiratory Syncytial Virus (RSV) and Lower Respiratory Tract Disease (LRTD) in newborns and infants.Sanofi gets CDSCO  nod for Beyfortus India","content":"Sanofi India on Thursday said it has received marketing authorisation approval from the Central Drugs Standard Control Organisation (CDSCO) for Beyfortus in India. Beyfortus is used for the prevention of Respiratory Syncytial Virus (RSV) and Lower Respiratory Tract Disease (LRTD) in newborns and infants. It is also administered to children up to 24 months of age, who remain vulnerable to severe RSV disease through their second RSV season. \"Prevention of RSV in India is still an unmet medical need. This makes the approval of Beyfortus a landmark moment for Sanofi in India,\" Sanofi Vaccines (India) General Manager Preeti Futnani stated. In March 2017, Sanofi and AstraZeneca announced an agreement to develop and commercialise Beyfortus. Under the terms of the agreement, AstraZeneca leads development and manufacturing activities, and Sanofi leads commercialisation activities and records revenues. ","cleaned_content":"sanofi india on thursday said it has received marketing authorisation approval from the central drugs standard control organisation cdsco for beyfortus in india beyfortus is used for the prevention of respiratory syncytial virus rsv and lower respiratory tract disease lrtd in newborns and infants it is also administered to children up to \u003cTWO_TEN\u003e months of age who remain vulnerable to severe rsv disease through their second rsv season prevention of rsv in india is still an unmet medical need this makes the approval of beyfortus a landmark moment for sanofi in india sanofi vaccines india general manager preeti futnani stated in march \u003cTWO_THOUSAND\u003e sanofi and astrazeneca announced an agreement to develop and commercialise beyfortus under the terms of the agreement astrazeneca leads development and manufacturing activities and sanofi leads commercialisation activities and records revenues","timestamp":"2024-08-01T13:43:00+05:30","market_timestamp":"2024-08-01T13:43:00+05:30","off_market_hours":false}