{"url":"https://www.moneycontrol.com/news/business/godrej-properties-acquires-46-acre-land-in-indore-for-plotted-development-12782843.html","title":"Godrej Properties acquires 46-acre land in Indore for plotted development","description":"The development on this land will primarily comprise plotted residential units and will offer an estimated saleable area of around 1.16 million square feet, the company said in a regulatory filing.Godrej Properties acquires 46-acre land in Indore for plotted development","content":"Godrej Properties Ltd on Wednesday said it has acquired around 46-acre land in Indore for plotted development. The development on this land will primarily comprise plotted residential units and will offer an estimated saleable area of around 1.16 million square feet, the company said in a regulatory filing. Godrej Properties did not mention whether it has purchased land outright or tied up with landlords for joint development. The financial details have also not been disclosed. \"Residential plotted development has gained significant traction in recent years and the Indore-Ujjain Road is a promising micro-market to expand our presence in this space. This aligns well with our ongoing growth strategy of entering fast-growing cities from a plotted development perspective,\" he said. Godrej Properties is one of the leading real estate developers in the country. It has a major presence in the Delhi-NCR (National Capital Region), Mumbai Metropolitan Region (MMR), Pune and Bengaluru markets. In the last financial year, Godrej Properties emerged as the largest listed real estate firm in terms of sales bookings by selling properties worth over Rs 22,000 crore. ","cleaned_content":"godrej properties ltd on wednesday said it has acquired around \u003cFOUR_TEN\u003e acre land in indore for plotted development the development on this land will primarily comprise plotted residential units and will offer an estimated saleable area of around \u003cONE_\u003e million square feet the company said in a regulatory filing godrej properties did not mention whether it has purchased land outright or tied up with landlords for joint development the financial details have also not been disclosed residential plotted development has gained significant traction in recent years and the indore ujjain road is a promising micro market to expand our presence in this space this aligns well with our ongoing growth strategy of entering fast growing cities from a plotted development perspective he said godrej properties is one of the leading real estate developers in the country it has a major presence in the delhi ncr national capital region mumbai metropolitan region mmr pune and bengaluru markets in the last financial year godrej properties emerged as the largest listed real estate firm in terms of sales bookings by selling properties worth over rs \u003cTWO_TEN_THOUSAND\u003e crore","timestamp":"2024-07-31T09:29:00+05:30","market_timestamp":"2024-07-31T09:29:00+05:30","off_market_hours":false}