{"url":"https://www.moneycontrol.com/news/business/ipo/fidelity-nomura-line-up-bids-for-ola-electrics-india-ipo-12780582.html","title":"Fidelity, Nomura line up bids for Ola Electric's India IPO","description":"Ola Electric's roughly $740 million IPO will open this week and will be the first by an Indian electric vehicle maker. The company is the biggest player in the e-scooter market in a country where adoption of clean vehicles is still low but rising rapidly.Fidelity, Nomura line up bids for Ola Electric's India IPORelated stories","content":"SoftBank-backed Indian e-scooter maker Ola Electric's IPO is set to draw investor bids from Fidelity, Nomura and Norway's Norges Bank, as well as several Indian mutual funds, two sources with direct knowledge told Reuters. Ola Electric's roughly $740 million IPO will open this week and will be the first by an Indian electric vehicle maker. The company is the biggest player in the e-scooter market in a country where adoption of clean vehicles is still low but rising rapidly. Fidelity will place bids of around $75 million while Nomura and Norges will bid $100 million each in Ola's so-called IPO anchor book, where high-profile institutional investors are allotted shares before the subscription opens for other investors, said the first source with direct knowledge of the bid amounts. Ola Electric did not respond to a request for comment. None of the investors named above immediately responded on Sunday outside regular business hours. Ola's IPO, one of biggest in India this year, will see the company issue new shares to raise $660 million and also see its existing investors, including founder Bhavish Aggarwal, offload their stake of about $80 million to IPO investors. Quota for anchor investors in the IPO is about $330 million, the first source said. Sources had earlier said the IPO is expected to value the company at around $4.2-4.4 billion, but the sources on Sunday said the final valuation is lower at around $4 billion to $4.2 billion. That valuation is about 22% to 26% lower than in Ola's last funding round in September, which was led by Singapore's investment firm Temasek and valued the country's largest e-scooter maker at $5.4 billion. The lower valuation for the IPO is because of a correction in valuation of global tech companies globally and as Ola wants to ensure high participation in the stock offering, sources have said. The IPO comes amid heightened capital markets activity in India, where stock markets are trading near a record high. ","cleaned_content":"softbank backed indian e scooter maker ola electrics ipo is set to draw investor bids from fidelity nomura and norways norges bank as well as several indian mutual funds two sources with direct knowledge told reuters ola electrics roughly \u003cSEVEN_HUNDRED\u003e million ipo will open this week and will be the first by an indian electric vehicle maker the company is the biggest player in the e scooter market in a country where adoption of clean vehicles is still low but rising rapidly fidelity will place bids of around \u003cSEVEN_TEN\u003e million while nomura and norges will bid \u003cONE_HUNDRED\u003e million each in olas so called ipo anchor book where high profile institutional investors are allotted shares before the subscription opens for other investors said the first source with direct knowledge of the bid amounts ola electric did not respond to a request for comment none of the investors named above immediately responded on sunday outside regular business hours olas ipo one of biggest in india this year will see the company issue new shares to raise \u003cSIX_HUNDRED\u003e million and also see its existing investors including founder bhavish aggarwal offload their stake of about \u003cEIGHT_TEN\u003e million to ipo investors quota for anchor investors in the ipo is about \u003cTHREE_HUNDRED\u003e million the first source said sources had earlier said the ipo is expected to value the company at around \u003cFOUR_\u003e \u003cFOUR_\u003e billion but the sources on sunday said the final valuation is lower at around \u003cFOUR_\u003e billion to \u003cFOUR_\u003e billion that valuation is about \u003cTWO_TEN_PERCENT\u003e to \u003cTWO_TEN_PERCENT\u003e lower than in olas last funding round in september which was led by singapores investment firm temasek and valued the countrys largest e scooter maker at \u003cFIVE_\u003e billion the lower valuation for the ipo is because of a correction in valuation of global tech companies globally and as ola wants to ensure high participation in the stock offering sources have said the ipo comes amid heightened capital markets activity in india where stock markets are trading near a record high","timestamp":"2024-07-29T06:47:00+05:30","market_timestamp":"2024-07-29T09:15:00+05:30","off_market_hours":true}