{"url":"https://www.moneycontrol.com/news/business/indigo-to-launch-flights-to-7-new-international-destinations-this-fiscal-12787122.html","title":"IndiGo to launch flights to 7 new international destinations this fiscal","description":"Currently, IndiGo operates more than 2,000 flights daily and flies to around 120 destinations, including 33 overseas cities.IndiGo to launch flights to 7 new international destinations this fiscal","content":"The country's largest airline IndiGo will launch flights to seven more international destinations in the current financial year, its CEO Pieter Elbers said on Monday. Currently, IndiGo operates more than 2,000 flights daily and flies to around 120 destinations, including 33 overseas cities. Earlier this month, indiGo announced that it will launch flights to Jaffna. He also said that IndiGo will launch flights to seven new international destinations before the end of this financial year. The fiscal ends on March 31, 2025. With the new launches, the airline will be flying to over 40 international destinations, he added. IndiGo has a domestic market share of nearly 61 per cent and around 975 planes on order. At the end of June, the airline had 382 planes, including 18 aircraft on wet lease. The carrier will be getting A321 XLR planes in 2025 and wide-body A350 aircraft in 2027. ","cleaned_content":"the countrys largest airline indigo will launch flights to seven more international destinations in the current financial year its ceo pieter elbers said on monday currently indigo operates more than \u003cTWO_THOUSAND\u003e flights daily and flies to around \u003cONE_HUNDRED\u003e destinations including \u003cTHREE_TEN\u003e overseas cities earlier this month indigo announced that it will launch flights to jaffna he also said that indigo will launch flights to seven new international destinations before the end of this financial year the fiscal ends on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e with the new launches the airline will be flying to over \u003cFOUR_TEN\u003e international destinations he added indigo has a domestic market share of nearly \u003cSIX_TEN_PERCENT\u003e and around \u003cNINE_HUNDRED\u003e planes on order at the end of june the airline had \u003cTHREE_HUNDRED\u003e planes including \u003cONE_TEN\u003e aircraft on wet lease the carrier will be getting a321 xlr planes in \u003cTWO_THOUSAND\u003e and wide body a350 aircraft in \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-05T12:36:00+05:30","market_timestamp":"2024-08-05T12:36:00+05:30","off_market_hours":false}