{"url":"https://www.moneycontrol.com/news/business/bharti-airtel-starts-re-farming-of-mid-band-spectrum-to-accommodate-growing-demand-on-5g-network-12781226.html","title":"Bharti Airtel starts re-farming of mid-band spectrum to accommodate growing demand on 5G network","description":"As data demand grows, Airtel is re-farming its existing spectrum at a faster pace to provide its customers with a brilliant 5G experience, it said.Bharti Airtel starts re-farming of mid-band spectrum to accommodate growing demand on 5G network","content":"Telecom major Bharti Airtel on Monday said it has started reallocating its existent mid-band spectrum to accommodate the exponential growth in 5G traffic. As data demand grows, Airtel is re-farming its existing spectrum at a faster pace to provide its customers with a brilliant 5G experience, it said. \"With more customers moving to the 5G network, Airtel is re-farming its mid-band spectrum to expand 5G services on its 1800, 2100, 2300 MHz bands across the country,\" it said in a statement. This capability on the 5G network will enable Airtel to introduce new innovative applications, services and solutions through open APIs, differentiated connectivity and service-based architecture, it said. \"As more customers pivot to our 5G services, we have re-farmed our mid-band spectrum which was being used for 4G services. With this, we are also ready to launch stand-alone technology. \"This will mean that the Airtel network will be the first network in India to run on both standalone and non-standalone modes, allowing us to deliver the best experience in the market,\" Bharti Airtel CTO Randeep Sekhon said. ","cleaned_content":"telecom major bharti airtel on monday said it has started reallocating its existent mid band spectrum to accommodate the exponential growth in \u003cFIVE_\u003e g traffic as data demand grows airtel is re farming its existing spectrum at a faster pace to provide its customers with a brilliant \u003cFIVE_\u003e g experience it said with more customers moving to the \u003cFIVE_\u003e g network airtel is re farming its mid band spectrum to expand \u003cFIVE_\u003e g services on its \u003cONE_THOUSAND\u003e \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e mhz bands across the country it said in a statement this capability on the \u003cFIVE_\u003e g network will enable airtel to introduce new innovative applications services and solutions through open apis differentiated connectivity and service based architecture it said as more customers pivot to our \u003cFIVE_\u003e g services we have re farmed our mid band spectrum which was being used for \u003cFOUR_\u003e g services with this we are also ready to launch stand alone technology this will mean that the airtel network will be the first network in india to run on both standalone and non standalone modes allowing us to deliver the best experience in the market bharti airtel cto randeep sekhon said","timestamp":"2024-07-29T13:58:00+05:30","market_timestamp":"2024-07-29T13:58:00+05:30","off_market_hours":false}