{"url":"https://www.moneycontrol.com/news/business/tata-power-gets-loi-from-pfc-consulting-to-acquire-spv-in-odisha-12787228.html","title":"Tata Power gets LoI from PFC Consulting to acquire SPV in Odisha","description":"In an exchange filing, Tata Power said it \"has received a Letter of Intent (LoI) from PFC Consulting to acquire Paradeep Transmission Ltd, a project special purpose vehicle (SPV).\"Tata Power gets LoI from PFC Consulting to acquire SPV in Odisha","content":"Tata Power on Monday said it has received a letter of intent from PFC Consulting to acquire a project-specific special purpose vehicle. PFC Consulting is a wholly-owned subsidiary of Power Finance Corporation. In an exchange filing, Tata Power said it \"has received a Letter of Intent (LoI) from PFC Consulting to acquire Paradeep Transmission Ltd, a project special purpose vehicle (SPV).\" The SPV would be developed on build, own, operate and transfer basis, to provide transmission service for 35 years from the schedule date of commercial operation, it said. The scope of project involves constructing 2 x 1,500 MVA (megavolt ampere), 190 km of 765 kV (kilovolt) double circuit transmission line from existing Angul substation to the proposed substation at Paradeep, Odisha among other project related work. ","cleaned_content":"tata power on monday said it has received a letter of intent from pfc consulting to acquire a project specific special purpose vehicle pfc consulting is a wholly owned subsidiary of power finance corporation in an exchange filing tata power said it has received a letter of intent loi from pfc consulting to acquire paradeep transmission ltd a project special purpose vehicle spv the spv would be developed on build own operate and transfer basis to provide transmission service for \u003cTHREE_TEN\u003e years from the schedule date of commercial operation it said the scope of project involves constructing \u003cTWO_\u003e x \u003cONE_THOUSAND\u003e mva megavolt ampere \u003cONE_HUNDRED\u003e km of \u003cSEVEN_HUNDRED\u003e kv kilovolt double circuit transmission line from existing angul substation to the proposed substation at paradeep odisha among other project related work","timestamp":"2024-08-05T13:29:00+05:30","market_timestamp":"2024-08-05T13:29:00+05:30","off_market_hours":false}