{"url":"https://www.moneycontrol.com/news/business/companies/zee-says-rs-2000-crore-fund-raise-will-help-face-emerging-competitive-dynamics-12784466.html","title":"Zee says Rs 2,000 crore fund raise will help face emerging competitive dynamics","description":"The proceeds from the FCCBs will be used in a phased manner ensuring steady cash flow and the cash infusion can also be used to acquire potential digital assets or over the top (OTT) platforms, an analyst pointed out. Zee raised funds to be ready for changing dynamics in media and entertainment. Related stories","content":"Media company Zee Entertainment has raised Rs 2,000 crore in order to have a ready pool of capital to keep pace with the changing dynamics in the broadcast and streaming industries that could result  from the upcoming joint venture between Reliance and Walt Disney. In June 2024, Zee Entertainment's board of directors approved a plan to raise up to Rs 2,000 crore through the issuance of shares or other securities. This approval came after Sony scrapped its $10 billion merger with Zee in January 2024. \"The team is working on the plans to use the funds raised. Those plans will be ready with deployment. The idea was to ensure a pool of capital at this stage so that we are ready not only for the shifting dynamics of the sector but also the competitive dynamics which (we) are undergoing right now,\" said Vikas Somany, head of strategy, M\u0026A, and business development, Zee, during the Q1 FY25 earnings call. \"In its meeting, held on July 16, 2024, the Board, subject to necessary regulatory approvals, approved issuance of 5 percent coupon unsecured, unlisted, foreign currency convertible bonds (FCCBs) of $239 million equivalent to Rs 1,997 crore, maturing in 10 years on a private placement basis to three proposed investors The FCCBs if converted, shall result into issue of approximately 1,247 lakh equity shares of Rs 1 each at a price of Rs 160.20. The Company has received approval from RBI and in-principle approval from BSE, NSE in this regard,\" Zee said. Somany said that the company opted for the FCCB route due to the flexibility it offered. \"We went for this (FCCB) because we wanted flexibility of drawing funds over a longer period of time. The whole idea was to fortify our balance sheet and be ready with enough resources at disposal. We want to be prudent in deploying these funds,\" he added. The proceeds from the FCCBs will be used in a phased manner ensuring steady cash flow. The cash infusion can also be used to acquire potential digital assets or over the top (OTT) platforms, said Karan Taurani, Senior Vice-President, Elara Capital. The company pointed out that its liquidity position has improved with a decline in content inventory cost and generation of higher free cash flow. It also added that a major part of the reduction in employee expenses from layoffs has already been attained and no further reduction is expected. There will be a focus on maintaining an optimal employee structure, Zee said. \"There has been emphasis on keeping the morale of employees high following the layoffs by Zee. Most of the key talent is still with Zee,\" the company said. A lot has happened in the last 6 to 8 months but we are working towards maintaining upbeat morale in the company, said Punit Goenka, MD \u0026 CEO, ZEE Entertainment Enterprises Ltd. \"We had some churn but a large part of it was on the tech side. These people had become redundant so it (layoffs) happened.\" Goenka added that despite some green shoots in the last quarter of the previous fiscal,  ad revenue growth still remains subdued with the rural economy yet to pick up entirely. \"This quarter was sports heavy coupled with general elections which took the share away from general entertainment. Our conversations with large FMCG clients indicate the pickup in ad spends with the onset of the festive season,\" he said. On the digital front, the company said that for Zee5 the focus is to attain a balanced cost structure. \"Zee5 losses will keep declining going forward, in the medium-to-long term. The focus will remain on growing revenue while keeping a close watch on the costs. The company will be ready to make significant investments to capitalise on emerging opportunities,\" Zee management said. The streaming platform's revenue declined sequentially to Rs 223.7 crore in Q1 from Rs 237.2 crore in Q4 FY24 which was largely led by sports events and elections in the first quarter of FY25, the company's management said adding that the OTT platform is led more by the GEC genre. The company added that the reduction in losses has been led by lower manpower and marketing expenses without lowering the expenditure on content in Zee5. It added that most subscribers of Zee5 are enrolled in the annual plan. ","cleaned_content":"media company zee entertainment has raised rs \u003cTWO_THOUSAND\u003e crore in order to have a ready pool of capital to keep pace with the changing dynamics in the broadcast and streaming industries that could result from the upcoming joint venture between reliance and walt disney in june \u003cTWO_THOUSAND\u003e zee entertainments board of directors approved a plan to raise up to rs \u003cTWO_THOUSAND\u003e crore through the issuance of shares or other securities this approval came after sony scrapped its \u003cONE_TEN\u003e billion merger with zee in january \u003cTWO_THOUSAND\u003e the team is working on the plans to use the funds raised those plans will be ready with deployment the idea was to ensure a pool of capital at this stage so that we are ready not only for the shifting dynamics of the sector but also the competitive dynamics which we are undergoing right now said vikas somany head of strategy m a and business development zee during the q1 fy25 earnings call in its meeting held on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the board subject to necessary regulatory approvals approved issuance of \u003cFIVE_PERCENT\u003e coupon unsecured unlisted foreign currency convertible bonds fccbs of \u003cTWO_HUNDRED\u003e million equivalent to rs \u003cONE_THOUSAND\u003e crore maturing in \u003cONE_TEN\u003e years on a private placement basis to three proposed investors the fccbs if converted shall result into issue of approximately \u003cONE_THOUSAND\u003e lakh equity shares of rs \u003cONE_\u003e each at a price of rs \u003cONE_HUNDRED\u003e the company has received approval from rbi and in principle approval from bse nse in this regard zee said somany said that the company opted for the fccb route due to the flexibility it offered we went for this fccb because we wanted flexibility of drawing funds over a longer period of time the whole idea was to fortify our balance sheet and be ready with enough resources at disposal we want to be prudent in deploying these funds he added the proceeds from the fccbs will be used in a phased manner ensuring steady cash flow the cash infusion can also be used to acquire potential digital assets or over the top ott platforms said karan taurani senior vice president elara capital the company pointed out that its liquidity position has improved with a decline in content inventory cost and generation of higher free cash flow it also added that a major part of the reduction in employee expenses from layoffs has already been attained and no further reduction is expected there will be a focus on maintaining an optimal employee structure zee said there has been emphasis on keeping the morale of employees high following the layoffs by zee most of the key talent is still with zee the company said a lot has happened in the last \u003cSIX_\u003e to \u003cEIGHT_\u003e months but we are working towards maintaining upbeat morale in the company said punit goenka md ceo zee entertainment enterprises ltd we had some churn but a large part of it was on the tech side these people had become redundant so it layoffs happened goenka added that despite some green shoots in the last quarter of the previous fiscal ad revenue growth still remains subdued with the rural economy yet to pick up entirely this quarter was sports heavy coupled with general elections which took the share away from general entertainment our conversations with large fmcg clients indicate the pickup in ad spends with the onset of the festive season he said on the digital front the company said that for zee5 the focus is to attain a balanced cost structure zee5 losses will keep declining going forward in the medium to long term the focus will remain on growing revenue while keeping a close watch on the costs the company will be ready to make significant investments to capitalise on emerging opportunities zee management said the streaming platforms revenue declined sequentially to rs \u003cTWO_HUNDRED\u003e crore in q1 from rs \u003cTWO_HUNDRED\u003e crore in q4 fy24 which was largely led by sports events and elections in the first quarter of fy25 the companys management said adding that the ott platform is led more by the gec genre the company added that the reduction in losses has been led by lower manpower and marketing expenses without lowering the expenditure on content in zee5 it added that most subscribers of zee5 are enrolled in the annual plan","timestamp":"2024-08-01T16:47:00+05:30","market_timestamp":"2024-08-02T09:15:00+05:30","off_market_hours":true}