{"url":"https://www.moneycontrol.com/news/business/earnings/so-far-global-earnings-are-just-good-enough-to-feel-disappointing-12782589.html","title":"So far, global earnings are just good enough to feel disappointing","description":"A number of high-profile companies have underwhelmed investors, including McDonald's, automakers Nissan and Tesla, and consumer giants Nestle and Diageo.Global companies have zeroed in on two issues hitting their bottom lines: higher interest rates that are pinching consumer spending, and underperformance in China's economy, the second-largest in the world.Related stories","content":"Companies worldwide are lowering full-year sales and profit guidance as higher interest rates and weakness in China's economy hurt global consumer sentiment, taking the shine off earnings growth in the latest quarter. A number of high-profile companies have underwhelmed investors, including McDonald's, automakers Nissan and Tesla, and consumer giants Nestle and Diageo. With roughly 40 percent of US and European companies reporting results, earnings have come in about as expected - but after the strong run by world equity markets, 'about as expected' seems like a disappointment. \"A very mixed season so far in terms of results,\" said Brian Mulberry, client portfolio manager at Zacks Investment Management. \"We're starting to see the pressure that the higher-for-longer interest rate environment is putting on companies and their ability to continue to drive earnings and revenue growth.\" Global companies have zeroed in on two issues hitting their bottom lines: higher interest rates that are pinching consumer spending, and underperformance in China's economy, the second-largest in the world.McDonald's reported its first drop in sales worldwide in 13 quarters, citing weakness in China's economy. Companies including Unilever, Visa and Aston Martin also noted weakness in China, and analysts have warned that demand in the Asian giant is unlikely to reverse while a protracted property downturn and job insecurity weigh on consumers. \"The Chinese... are not willing to spend because they are afraid about the future,\" said Stefan-Guenter Bauknecht, portfolio manager at DWS. Until growth improves in China, the country will be \"the weakest of the big regions, or at least the most far behind expectation,\" he said.Earnings per share have so far risen by nearly 12% in the United States from a year ago, the strongest quarter out of the last 10, according to LSEG data. Earnings are up 4% in Europe, according to Bank of America Securities, slightly ahead of market expectations and for Europe the first positive growth rate since 2022. Consumer weakness is being flagged across industry sectors and guidance cuts have picked up, the brokerage said. US companies have reduced third-quarter forecasts to 7.3% year-over-year growth as of Friday from 8.6% at the beginning of July, according to LSEG data. \"While Q2 results overall have been decent, the season has nonetheless spooked the market on signs of consumer stress,\" Bank of America analysts said in an research note. Nestle, opens new tab and Unilever, opens new tab both reported first-half sales growth below expectations. Companies in the euro zone's two largest economies are growing more pessimistic, raising concerns over the bloc's sluggish recovery. \"There is value-seeking behavior among consumers. There is pressure, especially at the low-income range,\" Nestle CEO Mark Schneider said on a call with journalists. Auto companies are facing difficulties in the United States, where high inventories and logistical issues hurt profits of Ford Motor, Stellantis, and Nissan, EV leader Tesla, disappointed investors with its results, and many still see the company as far overvalued with EV sales slowing. EV battery firm LG Energy Solution, which supplies Tesla and Hyundai Motor, forecast revenue would fall more than 20% this year due to a sharper-than-expected slowdown in global EV demand. Its bigger rival, China's, reported a 13% drop in second-quarter revenue. CASHING IN CHIPS The earnings news has hardly been all bad. Google parent Alphabet's growth in cloud computing revenue augurs well for other tech bellwethers later this week. Industrial conglomerate 3M's results sent its shares to near a two-year high, while automaker General Motors and pharmaceutical giant Johnson \u0026 Johnson posted strong earnings, and banking giant JP Morgan said its profit hit a record. Asian chipmakers have turned more bullish about demand outlook as they benefit from the global AI boom that has helped it weather the tapering off of pandemic-led electronics demand. \"AI is so hot; right now everybody, all my customers, want to put AI functionality into their devices,” TSMC Chairman and CEO C.C. Wei said at an earnings conference, adding AI demand now is more real than two or three years ago. Shares of TSMC have gained 56% so far in 2024. Despite upbeat forecasts, shares of major Asian chipmakers are under pressure to keep up with rising expectations. That's evident as well in the performance of AI leader Nvidia, whose value surged past $3 trillion earlier this year before pulling back in the summer. “Investor expectations are so high they may be hard to meet, and in the short term, the stock price may not rise as much,\" said analyst Lee Min-hee at BNK Investment \u0026 Securities. The broad-market MSCI International index has gained 11% so far this year, peaking earlier this month before selling off, in part due to hopes that the US Federal Reserve will begin cutting interest rates after similar moves from other central banks. \"To the extent that lower rates ahead remains the popular view, analysts are unlikely to be lowering overall earnings projections for next year,\" Rick Meckler, partner at Cherry Lane Investments. ","cleaned_content":"companies worldwide are lowering full year sales and profit guidance as higher interest rates and weakness in chinas economy hurt global consumer sentiment taking the shine off earnings growth in the latest quarter a number of high profile companies have underwhelmed investors including mcdonalds automakers nissan and tesla and consumer giants nestle and diageo with roughly \u003cFOUR_TEN_PERCENT\u003e of us and european companies reporting results earnings have come in about as expected but after the strong run by world equity markets about as expected seems like a disappointment a very mixed season so far in terms of results said brian mulberry client portfolio manager at zacks investment management were starting to see the pressure that the higher for longer interest rate environment is putting on companies and their ability to continue to drive earnings and revenue growth global companies have zeroed in on two issues hitting their bottom lines higher interest rates that are pinching consumer spending and underperformance in chinas economy the second largest in the world mcdonalds reported its first drop in sales worldwide in \u003cONE_TEN\u003e quarters citing weakness in chinas economy companies including unilever visa and aston martin also noted weakness in china and analysts have warned that demand in the asian giant is unlikely to reverse while a protracted property downturn and job insecurity weigh on consumers the chinese are not willing to spend because they are afraid about the future said stefan guenter bauknecht portfolio manager at dws until growth improves in china the country will be the weakest of the big regions or at least the most far behind expectation he said earnings per share have so far risen by nearly \u003cONE_TEN_PERCENT\u003e in the united states from a year ago the strongest quarter out of the last \u003cONE_TEN\u003e according to lseg data earnings are up \u003cFOUR_PERCENT\u003e in europe according to bank of america securities slightly ahead of market expectations and for europe the first positive growth rate since \u003cTWO_THOUSAND\u003e consumer weakness is being flagged across industry sectors and guidance cuts have picked up the brokerage said us companies have reduced third quarter forecasts to \u003cSEVEN_PERCENT\u003e year over year growth as of friday from \u003cEIGHT_PERCENT\u003e at the beginning of july according to lseg data while q2 results overall have been decent the season has nonetheless spooked the market on signs of consumer stress bank of america analysts said in an research note nestle opens new tab and unilever opens new tab both reported first half sales growth below expectations companies in the euro zones two largest economies are growing more pessimistic raising concerns over the blocs sluggish recovery there is value seeking behavior among consumers there is pressure especially at the low income range nestle ceo mark schneider said on a call with journalists auto companies are facing difficulties in the united states where high inventories and logistical issues hurt profits of ford motor stellantis and nissan ev leader tesla disappointed investors with its results and many still see the company as far overvalued with ev sales slowing ev battery firm lg energy solution which supplies tesla and hyundai motor forecast revenue would fall more than \u003cTWO_TEN_PERCENT\u003e this year due to a sharper than expected slowdown in global ev demand its bigger rival chinas reported a \u003cONE_TEN_PERCENT\u003e drop in second quarter revenue cashing in chips the earnings news has hardly been all bad google parent alphabets growth in cloud computing revenue augurs well for other tech bellwethers later this week industrial conglomerate \u003cTHREE_\u003e ms results sent its shares to near a two year high while automaker general motors and pharmaceutical giant johnson johnson posted strong earnings and banking giant jp morgan said its profit hit a record asian chipmakers have turned more bullish about demand outlook as they benefit from the global ai boom that has helped it weather the tapering off of pandemic led electronics demand ai is so hot right now everybody all my customers want to put ai functionality into their devices tsmc chairman and ceo c c wei said at an earnings conference adding ai demand now is more real than two or three years ago shares of tsmc have gained \u003cFIVE_TEN_PERCENT\u003e so far in \u003cTWO_THOUSAND\u003e despite upbeat forecasts shares of major asian chipmakers are under pressure to keep up with rising expectations thats evident as well in the performance of ai leader nvidia whose value surged past \u003cTHREE_\u003e trillion earlier this year before pulling back in the summer investor expectations are so high they may be hard to meet and in the short term the stock price may not rise as much said analyst lee min hee at bnk investment securities the broad market msci international index has gained \u003cONE_TEN_PERCENT\u003e so far this year peaking earlier this month before selling off in part due to hopes that the us federal reserve will begin cutting interest rates after similar moves from other central banks to the extent that lower rates ahead remains the popular view analysts are unlikely to be lowering overall earnings projections for next year rick meckler partner at cherry lane investments","timestamp":"2024-07-30T19:25:00+05:30","market_timestamp":"2024-07-31T09:15:00+05:30","off_market_hours":true}