{"url":"https://www.moneycontrol.com/news/business/state-bank-of-india-deploys-2000-bankers-to-woo-the-wealthy-12787918.html","title":"State Bank of India deploys 2,000 bankers to woo the wealthy","description":"The bank’s wealth management unit is “old” and it wants to change its approach to how it tackles this business, according to Chairman Dinesh Khara. State Bank of India deploys 2,000 bankers to woo the wealthyRelated stories","content":"State Bank of India, the country’s largest lender, is making a renewed push into wealth management as the number of people getting richer surges. The bank’s wealth management unit is “old” and it wants to change its approach to how it tackles this business, according to Chairman Dinesh Khara. To that end, SBI is deploying about 2,000 executives as relationship managers and focusing on ties with smaller companies across the country, Khara said at the bank’s earnings briefing. “We manufacture all the products in the financial sector and have the largest distribution network,” Khara said, in response to a question about whether SBI will consider teaming up with other wealth managers. “We should be in a position to reach out the product to the customers.” He declined to comment on the bank’s current assets under management. SBI, which has more than 22,500 branches in India, is joining global and domestic players flocking to grab a share of managing India’s growing pile of wealth. The country generated about $590 billion in new financial wealth in 2023, its largest increase in history, according to a recent report from the Boston Consulting Group. SBI will face competition from global players like HSBC Holdings Plc and Barclays Plc, and local veterans like 360 One WAM Ltd. who are expanding their services and teams to service India’s rich. Private lenders like ICICI Bank Ltd. and Axis Bank Ltd. have also made inroads into the country’s wealth management sector. ","cleaned_content":"state bank of india the country s largest lender is making a renewed push into wealth management as the number of people getting richer surges the bank s wealth management unit is old and it wants to change its approach to how it tackles this business according to chairman dinesh khara to that end sbi is deploying about \u003cTWO_THOUSAND\u003e executives as relationship managers and focusing on ties with smaller companies across the country khara said at the bank s earnings briefing we manufacture all the products in the financial sector and have the largest distribution network khara said in response to a question about whether sbi will consider teaming up with other wealth managers we should be in a position to reach out the product to the customers he declined to comment on the bank s current assets under management sbi which has more than \u003cTWO_TEN_THOUSAND\u003e branches in india is joining global and domestic players flocking to grab a share of managing india s growing pile of wealth the country generated about \u003cFIVE_HUNDRED\u003e billion in new financial wealth in \u003cTWO_THOUSAND\u003e its largest increase in history according to a recent report from the boston consulting group sbi will face competition from global players like hsbc holdings plc and barclays plc and local veterans like \u003cTHREE_HUNDRED\u003e one wam ltd who are expanding their services and teams to service india s rich private lenders like icici bank ltd and axis bank ltd have also made inroads into the country s wealth management sector","timestamp":"2024-08-06T08:01:00+05:30","market_timestamp":"2024-08-06T09:15:00+05:30","off_market_hours":true}