{"url":"https://www.moneycontrol.com/news/business/zydus-gets-mexican-regulatory-approval-to-market-cancer-treatment-product-12783189.html","title":"Zydus gets Mexican regulatory approval to market cancer treatment product","description":"Following the approval by Mexican regulatory authority COFEPRIS (Federal Commission for the Protection Against Sanitary Risk), for Mamitra, the drug will be marketed in different strengths of 150 mg and 440 mg, Zydus Lifesciences said in a regulatory filing.Zydus gets Mexican regulatory approval to market cancer treatment product","content":"Zydus Lifesciences Ltd on Wednesday said the Mexican regulatory authority has granted marketing approval for Mamitra, a Trastuzumab biosimilar used to treat various types of cancer. Following the approval by Mexican regulatory authority COFEPRIS (Federal Commission for the Protection Against Sanitary Risk), for Mamitra, the drug will be marketed in different strengths of 150 mg and 440 mg, Zydus Lifesciences said in a regulatory filing. The product is used in the treatment of breast cancer and advanced gastric cancer. Breast cancer has become the most diagnosed cancer in Mexico, overtaking prostate and colorectal cancers, the company added. Developed in-house by the research team at the Zydus Research Centre (ZRC), the Trastuzumab biosimilar was launched in 2016 in India under the brand name Vivitra. Since then, an estimated 1 lakh patients have been treated with the therapy, the company added. ","cleaned_content":"zydus lifesciences ltd on wednesday said the mexican regulatory authority has granted marketing approval for mamitra a trastuzumab biosimilar used to treat various types of cancer following the approval by mexican regulatory authority cofepris federal commission for the protection against sanitary risk for mamitra the drug will be marketed in different strengths of \u003cONE_HUNDRED\u003e mg and \u003cFOUR_HUNDRED\u003e mg zydus lifesciences said in a regulatory filing the product is used in the treatment of breast cancer and advanced gastric cancer breast cancer has become the most diagnosed cancer in mexico overtaking prostate and colorectal cancers the company added developed in house by the research team at the zydus research centre zrc the trastuzumab biosimilar was launched in \u003cTWO_THOUSAND\u003e in india under the brand name vivitra since then an estimated \u003cONE_\u003e lakh patients have been treated with the therapy the company added","timestamp":"2024-07-31T12:45:00+05:30","market_timestamp":"2024-07-31T12:45:00+05:30","off_market_hours":false}