{"url":"https://www.moneycontrol.com/news/business/ashok-leyland-total-sales-down-8-at-13928-units-in-july-12784360.html","title":"Ashok Leyland total sales down 8% at 13,928 units in July","description":"Domestic sales were down 9 per cent at 12,926 units as against 14,207 units in July 2023, Ashok Leyland said in a statement.Ashok Leyland total sales down 8% at 13,928 units in July","content":"Commercial vehicle maker Ashok Leyland on Thursday reported an 8 per cent decline in total sales at 13,928 units in July 2024 as compared to 15,068 units in the same month last year. Domestic sales were down 9 per cent at 12,926 units as against 14,207 units in July 2023, Ashok Leyland said in a statement. Sales of medium and heavy commercial vehicles in the domestic market were at 7,685 units as against 8,974 units in the year-ago period, down 14 per cent, it added. Light commercial vehicle sales in the domestic market last month were flat at 5,241 units as against 5,233 units in the year-ago period, the company said. ","cleaned_content":"commercial vehicle maker ashok leyland on thursday reported an \u003cEIGHT_PERCENT\u003e decline in total sales at \u003cONE_TEN_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e as compared to \u003cONE_TEN_THOUSAND\u003e units in the same month last year domestic sales were down \u003cNINE_PERCENT\u003e at \u003cONE_TEN_THOUSAND\u003e units as against \u003cONE_TEN_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e ashok leyland said in a statement sales of medium and heavy commercial vehicles in the domestic market were at \u003cSEVEN_THOUSAND\u003e units as against \u003cEIGHT_THOUSAND\u003e units in the year ago period down \u003cONE_TEN_PERCENT\u003e it added light commercial vehicle sales in the domestic market last month were flat at \u003cFIVE_THOUSAND\u003e units as against \u003cFIVE_THOUSAND\u003e units in the year ago period the company said","timestamp":"2024-08-01T13:23:00+05:30","market_timestamp":"2024-08-01T13:23:00+05:30","off_market_hours":false}