{"url":"https://www.moneycontrol.com/news/business/mahindra-looks-to-add-five-door-thar-production-capacity-by-4000-units-per-month-12783938.html","title":"Mahindra looks to add five-door Thar production capacity by 4,000 units per month","description":"Named Thar Roxx, the lifestyle SUV will be rolled out on August 15 and is estimated to be priced from Rs 15 lakh onwardsMahindra looks to add five-door Thar production capacity by 4,000 units per monthRelated stories","content":"Mahindra \u0026 Mahindra (M\u0026M) announced plans to build additional capacity for producing upto 4,000 units per month of the five-door version of the Thar SUV. Named Thar Roxx, the lifestyle SUV will be rolled out on August 15 and is estimated to be priced from Rs 15 lakh onwards.  Upon its launch, it will compete with the Force Gurkha and the Maruti Suzuki Jimny. \"We are creating an additional 3,000-4,000 capacity per month for the five-door Thar over and above the total capacity that we have planned,\" Rajesh Jejurikar, Executive Director \u0026 CEO (Auto and Farm Sector), M\u0026M Ltd. He revealed that the company still has an order backlog of 40,000 units of the 3-door version of three-door Thar. Dealer sources have revealed that the Thar Roxx will be offered with the same engine options as its three-door avatar, which include a 2.2-litre diesel and 2.0-litre petrol variants. Both engines are likely to be offered with 6-speed manual and 6-speed automatic transmissions. The five-door Thar will also be rolled off the same production line at Nashik, Maharashtra. At a broader level, the company is planning a total exit capacity of 64,000 units per month for the current fiscal, including for XUV 3XO/400 as well as electric vehicles. Jejurikar revealed that the FY25 exit capacity includes an increase of 5,000 units in SUV capacity (THAR 5D, XUV3XO/4OO) and 10,000 units per month capacity for electric vehicles. For the next financial year, M\u0026M stated that it has planned a total manufacturing 72,000 units per month, which includes an additional 8,000 units capacity per month for EVs in the next fiscal. Meanwhile, M\u0026M revealed that its total open bookings as on July 1 stood at 1.78 lakh, units including 55,000 for XUV3XO, 42,000 for Thar (including rear wheel drive or RWD), 13,000 for XUV700, 8,000 for Bolero and 58,000 for Scorpio-N. “We have seen 10 per cent cancellation per month in the bookings as well. On an average, the (existing) Thar along with XUV300 have a waiting period of about 8-10 weeks,” noted Jejurikar.  He also stated that the price cut undertaken by the company would not significantly impact its financial going forward, adding, \"We expect volumes to grow, which will get us operating leverage.\" During the April-June quarter, the total volume stood at 2.12 lakh, of which UV (utility vehicle) portfolio accounted for 1.24 lakh units. M\u0026M on July 31 reported a 20 percent year-on-year jump in net profit at Rs 3,283 crore in three months to June, with the automotive segment's consolidated PAT (profit after tax) climbing 35 per cent year-on-year to Rs 1,330 crore (excluding previous year's gains on KG Mobility) and consolidated revenue growing 16 per cent to Rs 19,776 crore. (With inputs from PTI)  ","cleaned_content":"mahindra mahindra m m announced plans to build additional capacity for producing upto \u003cFOUR_THOUSAND\u003e units per month of the five door version of the thar suv named thar roxx the lifestyle suv will be rolled out on august \u003cONE_TEN\u003e and is estimated to be priced from rs \u003cONE_TEN\u003e lakh onwards upon its launch it will compete with the force gurkha and the maruti suzuki jimny we are creating an additional \u003cTHREE_THOUSAND\u003e \u003cFOUR_THOUSAND\u003e capacity per month for the five door thar over and above the total capacity that we have planned rajesh jejurikar executive director ceo auto and farm sector m m ltd he revealed that the company still has an order backlog of \u003cFOUR_TEN_THOUSAND\u003e units of the \u003cTHREE_\u003e door version of three door thar dealer sources have revealed that the thar roxx will be offered with the same engine options as its three door avatar which include a \u003cTWO_\u003e litre diesel and \u003cTWO_\u003e litre petrol variants both engines are likely to be offered with \u003cSIX_\u003e speed manual and \u003cSIX_\u003e speed automatic transmissions the five door thar will also be rolled off the same production line at nashik maharashtra at a broader level the company is planning a total exit capacity of \u003cSIX_TEN_THOUSAND\u003e units per month for the current fiscal including for xuv \u003cTHREE_\u003e xo \u003cFOUR_HUNDRED\u003e as well as electric vehicles jejurikar revealed that the fy25 exit capacity includes an increase of \u003cFIVE_THOUSAND\u003e units in suv capacity thar \u003cFIVE_\u003e d xuv3xo \u003cFOUR_\u003e oo and \u003cONE_TEN_THOUSAND\u003e units per month capacity for electric vehicles for the next financial year m m stated that it has planned a total manufacturing \u003cSEVEN_TEN_THOUSAND\u003e units per month which includes an additional \u003cEIGHT_THOUSAND\u003e units capacity per month for evs in the next fiscal meanwhile m m revealed that its total open bookings as on july \u003cONE_\u003e stood at \u003cONE_\u003e lakh units including \u003cFIVE_TEN_THOUSAND\u003e for xuv3xo \u003cFOUR_TEN_THOUSAND\u003e for thar including rear wheel drive or rwd \u003cONE_TEN_THOUSAND\u003e for xuv700 \u003cEIGHT_THOUSAND\u003e for bolero and \u003cFIVE_TEN_THOUSAND\u003e for scorpio n we have seen \u003cONE_TEN_PERCENT\u003e cancellation per month in the bookings as well on an average the existing thar along with xuv300 have a waiting period of about \u003cEIGHT_\u003e \u003cONE_TEN\u003e weeks noted jejurikar he also stated that the price cut undertaken by the company would not significantly impact its financial going forward adding we expect volumes to grow which will get us operating leverage during the april june quarter the total volume stood at \u003cTWO_\u003e lakh of which uv utility vehicle portfolio accounted for \u003cONE_\u003e lakh units m m on july \u003cTHREE_TEN\u003e reported a \u003cTWO_TEN_PERCENT\u003e year on year jump in net profit at rs \u003cTHREE_THOUSAND\u003e crore in three months to june with the automotive segments consolidated pat profit after tax climbing \u003cTHREE_TEN_PERCENT\u003e year on year to rs \u003cONE_THOUSAND\u003e crore excluding previous years gains on kg mobility and consolidated revenue growing \u003cONE_TEN_PERCENT\u003e to rs \u003cONE_TEN_THOUSAND\u003e crore with inputs from pti","timestamp":"2024-08-01T14:50:00+05:30","market_timestamp":"2024-08-01T14:50:00+05:30","off_market_hours":false}