{"url":"https://www.moneycontrol.com/news/business/hyundai-sales-dip-3-in-july-at-64513-units-12784339.html","title":"Hyundai sales dip 3.2% in July at 64,563 units","description":"The automaker had sold a total of 66,701 units in July 2023Hyundai sales dip 3.2% in July at 64,563 units","content":"Hyundai Motor India on Thursday said its wholesales dipped 3.2 percent year-on-year to 64,563 units in July. The automaker had sold a total of 66,701 units in July 2023, Hyundai Motor India said in a statement. Domestic dispatch of vehicles to dealers saw a dip of 3.3 percent to 49,013 units last month from 50,701 units in the year-ago period, according to the statement. Commenting on HMIL sales, Tarun Garg, Whole-time Director and Chief Operating Officer, HMIL said, “We have posted an overall sales growth of 4.31 percent Year-on-Year in the period of January to July 2024. SUVs continue to demonstrate a robust contribution, accounting for 66.6 percent of total HMIL domestic sales. The new Hyundai CRETA achieved key milestones of 1 Lakh unit sales till July 2024, while also achieving highest ever monthly domestic sales of 17,350 units in July 2024.” ","cleaned_content":"hyundai motor india on thursday said its wholesales dipped \u003cTHREE_PERCENT\u003e year on year to \u003cSIX_TEN_THOUSAND\u003e units in july the automaker had sold a total of \u003cSIX_TEN_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e hyundai motor india said in a statement domestic dispatch of vehicles to dealers saw a dip of \u003cTHREE_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e units last month from \u003cFIVE_TEN_THOUSAND\u003e units in the year ago period according to the statement commenting on hmil sales tarun garg whole time director and chief operating officer hmil said we have posted an overall sales growth of \u003cFOUR_PERCENT\u003e year on year in the period of january to july \u003cTWO_THOUSAND\u003e suvs continue to demonstrate a robust contribution accounting for \u003cSIX_TEN_PERCENT\u003e of total hmil domestic sales the new hyundai creta achieved key milestones of \u003cONE_\u003e lakh unit sales till july \u003cTWO_THOUSAND\u003e while also achieving highest ever monthly domestic sales of \u003cONE_TEN_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e","timestamp":"2024-08-01T19:28:00+05:30","market_timestamp":"2024-08-02T09:15:00+05:30","off_market_hours":true}