{"url":"https://www.moneycontrol.com/news/business/pirojsha-godrej-aims-higher-sees-individual-businesses-lead-india-inc-report-12791711.html","title":"Pirojsha Godrej aims higher, sees individual businesses lead India Inc: Report","description":"Godrej thinks that the Godrej brand is a tremendous asset that's been built up over 127 years. He further said that the brand gives them the immediate credibility and ability to play in a variety of sectors.Speaking on the Godrej Group's restructuring process, he said that family relationships remain very strong.Related stories","content":"Pirojsha Godrej, executive chairman of Godrej Properties - the real estate arm of Godrej Group, said the next chapter will involve the company aiming higher and making big strides to become a leader in India's business landscape. \"I think the next chapter will involve us upping our ambition and recognising that there's nothing stopping us from making these individual businesses become some of the leading businesses in the country,\" Godrej said in an interview with The Economic Times. Godrej thinks that the Godrej brand is a tremendous asset that's been built up over 127 years. He said it gives them the immediate credibility and ability to play in a variety of sectors. \"But if I was to be a little self-critical of the group's performance over the years, I'd say that given the kind of brand we have, the kind of opportunities there are in India today, and the kind of talent we're able to attract to the group, have we done full justice to, you know, building some of India's individual, largest businesses. You know, where is the TCS kind of company in the Godrej group?\" He said that brand sharing took the most time during the talks. \"Because it's quite complicated in a large group that's been around for as long as we have to determine how exactly the brand sharing would happen,\" he said.  Properties, chemicals, agrovet, new financial services business and real estate businesses were always being managed by Godrej and that continues. Land was always being managed by Godrej and Boyce and will always be owned by them, he added. Speaking about disagreements over brand usage, Godrej said  there's freedom for each side to operate the brand in their categories. \"There is a high degree of trust and confidence the family has in each other, that both sides are looking out for the good of the brand and for the long-term value creation of the businesses.\" He then said there will be opportunities for discussion if there are situations where one side feels that something better could be done or that something's negatively impacting the brand. \"I think there's a high degree of confidence that everyone's reasonable and has the same end-goal in mind on this, which is maximising the value of the brand,\" he added. ","cleaned_content":"pirojsha godrej executive chairman of godrej properties the real estate arm of godrej group said the next chapter will involve the company aiming higher and making big strides to become a leader in indias business landscape i think the next chapter will involve us upping our ambition and recognising that theres nothing stopping us from making these individual businesses become some of the leading businesses in the country godrej said in an interview with the economic times godrej thinks that the godrej brand is a tremendous asset thats been built up over \u003cONE_HUNDRED\u003e years he said it gives them the immediate credibility and ability to play in a variety of sectors but if i was to be a little self critical of the groups performance over the years id say that given the kind of brand we have the kind of opportunities there are in india today and the kind of talent were able to attract to the group have we done full justice to you know building some of indias individual largest businesses you know where is the tcs kind of company in the godrej group he said that brand sharing took the most time during the talks because its quite complicated in a large group thats been around for as long as we have to determine how exactly the brand sharing would happen he said properties chemicals agrovet new financial services business and real estate businesses were always being managed by godrej and that continues land was always being managed by godrej and boyce and will always be owned by them he added speaking about disagreements over brand usage godrej said theres freedom for each side to operate the brand in their categories there is a high degree of trust and confidence the family has in each other that both sides are looking out for the good of the brand and for the long term value creation of the businesses he then said there will be opportunities for discussion if there are situations where one side feels that something better could be done or that somethings negatively impacting the brand i think theres a high degree of confidence that everyones reasonable and has the same end goal in mind on this which is maximising the value of the brand he added","timestamp":"2024-08-09T09:13:00+05:30","market_timestamp":"2024-08-09T09:15:00+05:30","off_market_hours":true}