{"url":"https://www.moneycontrol.com/news/business/amazon-partners-with-45-govt-emporiums-ngos-trade-bodies-to-empower-local-artisans-12789470.html","title":"Amazon partners with 45 govt emporiums, NGOs, trade bodies to empower local artisans","description":"More than 2,500 master weavers, co-operatives, artisans and government organisations under various ministries like Textiles, Cottage Industries, and Tribal Welfare, among others have been on-boarded on Amazon.in to sell online, according to the statement.Amazon partners with 45 govt emporiums, NGOs, trade bodies to empower local artisans","content":"E-commerce major Amazon India on Wednesday said that it has partnered with over 45 government emporiums, NGOs, and trade bodies in India to bridge the gap between artisans and customers, providing economic opportunities for marginalized weaving communities. \"Customers can shop for over 1.5 lakh products featured from 25 states depicting regional various crafts of India. Amazon will also launch a showcase of selection from over 35 State emporiums including Biswa Bangla, Panthoibi, Garvi Gurjari, House of Himalayas and more,\" said a company statement. More than 2,500 master weavers, co-operatives, artisans and government organisations under various ministries like Textiles, Cottage Industries, and Tribal Welfare, among others have been on-boarded on Amazon.in to sell online, according to the statement. Further, Amazon said its annual Amazon Karigar programme enables the revival of indigenous arts and crafts while providing local sellers with a platform to list and sell their merchandise online to a larger consumer base. ","cleaned_content":"e commerce major amazon india on wednesday said that it has partnered with over \u003cFOUR_TEN\u003e government emporiums ngos and trade bodies in india to bridge the gap between artisans and customers providing economic opportunities for marginalized weaving communities customers can shop for over \u003cONE_\u003e lakh products featured from \u003cTWO_TEN\u003e states depicting regional various crafts of india amazon will also launch a showcase of selection from over \u003cTHREE_TEN\u003e state emporiums including biswa bangla panthoibi garvi gurjari house of himalayas and more said a company statement more than \u003cTWO_THOUSAND\u003e master weavers co operatives artisans and government organisations under various ministries like textiles cottage industries and tribal welfare among others have been on boarded on amazon in to sell online according to the statement further amazon said its annual amazon karigar programme enables the revival of indigenous arts and crafts while providing local sellers with a platform to list and sell their merchandise online to a larger consumer base","timestamp":"2024-08-07T11:05:00+05:30","market_timestamp":"2024-08-07T11:05:00+05:30","off_market_hours":false}