{"url":"https://www.moneycontrol.com/news/india/karnataka-govt-to-woo-ev-companies-to-set-up-manufacturing-plants-12795084.html","title":"Karnataka govt to woo EV companies to set up manufacturing plants","description":"Karnataka plans industrial townships around Bengaluru and a new clean energy policy to ensure that EV companies establish manufacturing plants in the state.Karnataka is coming up with a clean energy policy in which the automotive sector will play a major roleRelated stories","content":"After losing the manufacturing plants of Bengaluru-based EV firms Ola and Ather to neighbouring Tamil Nadu, Karnataka is now charting plans to woo companies to set up operations in the state. Speaking at the Moneycontrol Startup Conclave in Bengaluru last week, IT-BT Minister Priyank Kharge said, “The government is engaging more with companies, corporates, and industries. We learn from them and see how we can make our policies sharper than the rest. We provide them with land, subsidised power tariffs, water, etc. We are creating an entire ecosystem in terms of education, research and development, innovation, policy, and skills.” Responding to a query on how Karnataka is losing EV manufacturing plants to neighbouring states, IT-BT Secretary Ekroop Caur said, “I'm confident that with the new policies and the government's focus on creating industrial townships around Bengaluru, which are in high demand by tech-oriented industries requiring high-end skills, we will be able to attract these companies back to Karnataka.” The state government has been planning industrial townships in Ramanagara, Tumakuru, Mandya, Kolar, Chikkaballapur and Chitradurga districts. “Under the revised Electronics System Design and Manufacturing (ESDM) policy, we are supporting certain aspects of automotive technology. We are also coming up with a new clean energy policy, in which the automotive sector will play a major role. I believe it will be so attractive that no one will be able to overlook Karnataka. Another major advantage is that, with all the R\u0026D happening in Karnataka, there is enormous potential.” Caur said. Also, read: Bengaluru-based Ather Energy's Rs 2,000-cr investment in Maharashtra: Priyank Kharge, Mohandas Pai react Kharge said that Karnataka did not become an innovation ecosystem overnight. “It took us more than three decades of hard work, planning, persistence, and consistent policymaking to reach where we are today. We started by focusing on our education system. If you look at our education landscape, we have around 234 engineering colleges, close to 70 medical colleges, and 44 universities. We have around 1,770 public and private industrial training institutions. We also have prestigious institutions like the Indian Institute of Science (IISc). Karnataka produces the highest number of graduates for the workforce\". \"We did not become the world's fourth-largest technology cluster overnight. We transitioned from being primarily a back-office operations hub to providing IT-enabled services, and now we are extremely strong in research and development, which has led to innovations and inventions. Karnataka is ranked number one in the India Innovation Index and has consistently held this position, making us the leading state in innovation in the country.” said Kharge. Also, read: 'Shocking that Karnataka lost out to Tamil Nadu in landing investments from Ather, Ola' ","cleaned_content":"after losing the manufacturing plants of bengaluru based ev firms ola and ather to neighbouring tamil nadu karnataka is now charting plans to woo companies to set up operations in the state speaking at the moneycontrol startup conclave in bengaluru last week it bt minister priyank kharge said the government is engaging more with companies corporates and industries we learn from them and see how we can make our policies sharper than the rest we provide them with land subsidised power tariffs water etc we are creating an entire ecosystem in terms of education research and development innovation policy and skills responding to a query on how karnataka is losing ev manufacturing plants to neighbouring states it bt secretary ekroop caur said im confident that with the new policies and the governments focus on creating industrial townships around bengaluru which are in high demand by tech oriented industries requiring high end skills we will be able to attract these companies back to karnataka the state government has been planning industrial townships in ramanagara tumakuru mandya kolar chikkaballapur and chitradurga districts under the revised electronics system design and manufacturing esdm policy we are supporting certain aspects of automotive technology we are also coming up with a new clean energy policy in which the automotive sector will play a major role i believe it will be so attractive that no one will be able to overlook karnataka another major advantage is that with all the r d happening in karnataka there is enormous potential caur said also read bengaluru based ather energys rs \u003cTWO_THOUSAND\u003e cr investment in maharashtra priyank kharge mohandas pai react kharge said that karnataka did not become an innovation ecosystem overnight it took us more than three decades of hard work planning persistence and consistent policymaking to reach where we are today we started by focusing on our education system if you look at our education landscape we have around \u003cTWO_HUNDRED\u003e engineering colleges close to \u003cSEVEN_TEN\u003e medical colleges and \u003cFOUR_TEN\u003e universities we have around \u003cONE_THOUSAND\u003e public and private industrial training institutions we also have prestigious institutions like the indian institute of science iisc karnataka produces the highest number of graduates for the workforce we did not become the worlds fourth largest technology cluster overnight we transitioned from being primarily a back office operations hub to providing it enabled services and now we are extremely strong in research and development which has led to innovations and inventions karnataka is ranked number one in the india innovation index and has consistently held this position making us the leading state in innovation in the country said kharge also read shocking that karnataka lost out to tamil nadu in landing investments from ather ola","timestamp":"2024-08-13T12:26:00+05:30","market_timestamp":"2024-08-13T12:26:00+05:30","off_market_hours":false}