{"url":"https://www.moneycontrol.com/news/companies-2/infosys-2022-batch-onboarding-delays-dates-changed-but-everyone-with-offer-will-join-says-ceo-12807141.html","title":"Infosys 2022-batch onboarding delays: Dates changed but everyone with offer will join, says CEO","description":"On August 20, Moneycontrol reported that nearly 2,000 freshers who were offered positions by Infosys in 2022 but have yet to be onboarded, according to individuals affected by the delayInfosys CEO \u0026 MD Salil ParekhRelated stories","content":"Infosys CEO Salil Parekh has indicated that offers given to freshers will be honoured by the company and followed with joining, although there has been some change in dates. The comments of Infosys top honcho assumes significance amid reports that the company has delayed onboarding of 2,000 fresh engineering graduates from 2022-batch. \"Every offer that we have given, that offer will be someone who will join the company. We changed some dates but beyond that everyone will join Infosys and there is no change in that approach,\" Parekh told PTI in response to a question on reported delays in onboarding of 2,000 fresh engineering graduates for two years. The said roles are for System Engineers and Digital Specialist Engineers. Moneycontrol learns that these software engineers were asked to take two pre-training sessions, with the last one being as recent as August 19. The Bengaluru-headquartered IT company has an overall employee base of 315,332 as on June 2024. Recently, IT and ITES union Nascent Information Technology Employees Senate (NITES) had filed a complaint with the Ministry of Labour and Employment against Infosys for delaying the onboarding of 2,000 engineering graduates selected for system engineer and digital specialist engineer roles during the 2022-23 recruitment drive. \"These graduates, after being issued offer letters as early as April 2022, have been subjected to continuous delays in the onboarding process, unpaid pre-training programmes, and unexpected additional assessments. Despite fulfilling all requirements on their part, these professionals have been kept in limbo for more than two years…,\" NITES had said. (With PTI inputs) ","cleaned_content":"infosys ceo salil parekh has indicated that offers given to freshers will be honoured by the company and followed with joining although there has been some change in dates the comments of infosys top honcho assumes significance amid reports that the company has delayed onboarding of \u003cTWO_THOUSAND\u003e fresh engineering graduates from \u003cTWO_THOUSAND\u003e batch every offer that we have given that offer will be someone who will join the company we changed some dates but beyond that everyone will join infosys and there is no change in that approach parekh told pti in response to a question on reported delays in onboarding of \u003cTWO_THOUSAND\u003e fresh engineering graduates for two years the said roles are for system engineers and digital specialist engineers moneycontrol learns that these software engineers were asked to take two pre training sessions with the last one being as recent as august \u003cONE_TEN\u003e the bengaluru headquartered it company has an overall employee base of \u003cTHREE_HUNDRED_THOUSAND\u003e as on june \u003cTWO_THOUSAND\u003e recently it and ites union nascent information technology employees senate nites had filed a complaint with the ministry of labour and employment against infosys for delaying the onboarding of \u003cTWO_THOUSAND\u003e engineering graduates selected for system engineer and digital specialist engineer roles during the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e recruitment drive these graduates after being issued offer letters as early as april \u003cTWO_THOUSAND\u003e have been subjected to continuous delays in the onboarding process unpaid pre training programmes and unexpected additional assessments despite fulfilling all requirements on their part these professionals have been kept in limbo for more than two years nites had said with pti inputs","timestamp":"2024-08-26T16:15:00+05:30","market_timestamp":"2024-08-27T09:15:00+05:30","off_market_hours":true}