{"url":"https://www.moneycontrol.com/news/business/companies/zomato-completes-acquisition-of-paytms-entertainment-ticketing-business-12808696.html","title":"Zomato completes acquisition of Paytm's entertainment ticketing business","description":"The combined entertainment ticketing business of Paytm has a scale of Rs 297 crore in revenue and Rs 29 crore in adjusted EBITDA in FY24.Zomato CEO Deepinder Goyal (left) and Paytm CEO Vijay Shekhar Sharma. Illustration: Suneesh KalarickalRelated stories","content":"Online food delivery platform Zomato has completed the acquisition of Paytm's entertainment ticketing business for Rs 2,048 crore to strengthen its \"going-out\" segment, the two companies informed the exchanges. Paytm's entertainment ticketing business covers movies, sports, and events (live performances). Under the deal, Zomato has fully acquired Orbgen Technologies Pvt Ltd (OTPL), which is into movie ticketing, for Rs 1,264.6 crore and buy Wasteland Entertainment Pvt Ltd, which is into events ticketing for Rs 783.8 crore. Subsequently, Zomato will spin off the new business into a new app called 'District'. \"The transfer will also include around 280 existing employees from the entertainment ticketing business,\" Paytm said in a statement earlier, adding that the transaction generates significant profits for Paytm and cash proceeds will further strengthen the balance sheet. Announcing the deal, Paytm said it allows the fintech to strengthen its focus on core payments and financial services distribution. Paytm said with its strong focus on long-term value creation, the company remains confident in substituting revenue from its entertainment ticketing business by expanding core business areas of payments and financial service distribution. On the other hand, Zomato managing director and CEO Deepinder Goyal in a letter to shareholders said, \"The proposed acquisition helps us add more scale and offer newer use-cases (like movie and sports ticketing) to our customers in this segment\". Zomato believes the deal makes it more relevant to its customers and gives an opportunity to spin off the business into a new app. ","cleaned_content":"online food delivery platform zomato has completed the acquisition of paytms entertainment ticketing business for rs \u003cTWO_THOUSAND\u003e crore to strengthen its going out segment the two companies informed the exchanges paytms entertainment ticketing business covers movies sports and events live performances under the deal zomato has fully acquired orbgen technologies pvt ltd otpl which is into movie ticketing for rs \u003cONE_THOUSAND\u003e crore and buy wasteland entertainment pvt ltd which is into events ticketing for rs \u003cSEVEN_HUNDRED\u003e crore subsequently zomato will spin off the new business into a new app called district the transfer will also include around \u003cTWO_HUNDRED\u003e existing employees from the entertainment ticketing business paytm said in a statement earlier adding that the transaction generates significant profits for paytm and cash proceeds will further strengthen the balance sheet announcing the deal paytm said it allows the fintech to strengthen its focus on core payments and financial services distribution paytm said with its strong focus on long term value creation the company remains confident in substituting revenue from its entertainment ticketing business by expanding core business areas of payments and financial service distribution on the other hand zomato managing director and ceo deepinder goyal in a letter to shareholders said the proposed acquisition helps us add more scale and offer newer use cases like movie and sports ticketing to our customers in this segment zomato believes the deal makes it more relevant to its customers and gives an opportunity to spin off the business into a new app","timestamp":"2024-08-28T13:19:00+05:30","market_timestamp":"2024-08-28T13:19:00+05:30","off_market_hours":false}