{"url":"https://www.moneycontrol.com/news/business/shapoorji-pallonji-group-sets-up-real-estate-holding-firm-plans-go-to-take-it-public-report-12801446.html","title":"Shapoorji Pallonji Group sets up real estate holding firm, plans go to take it public: Report","description":"Shapoorji Pallonji Real Estate plans to raise around $800-900 million in the first phase through an initial public offering SPRE encompasses the group’s entire real estate portfolio, covering 45 land parcels and projects. Related stories","content":"The Shapoorji Pallonji Group has set up a new holding company, Shapoorji Pallonji Real Estate (SPRE), to consolidate its real estate holdings spread across India and plans to monetise the assets by taking the firm public soon, The Economic Times has reported. The company aims to unlock value, streamline operations and pave the way for monetisation of a portfolio that includes land parcels spread over 2,000 acres. The assets are worth around $6 billion, the report said. “Creating a unified holding company and consolidating assets under this entity is in line with our strategic vision to streamline operations and enhance value creation,” the report quoted Venkatesh Gopalakrishnan, managing director and chief executive officer of the new entity, as saying. “To drive operational efficiencies and foster greater growth opportunities, we are positioning SPRE to leverage its scale by bringing our diverse real estate portfolio together.” Also Read | Afcons drops loan repayment plan to Shapoorji firm after Sebi questions use of IPO proceeds SPRE encompasses the group’s entire real estate portfolio of 45 land parcels and projects. The assets are primarily in five major cities — Mumbai, Pune, Bengaluru, Gurugram and Kolkata. It also holds large land parcels in Mysuru and Nagpur. The portfolio has a revenue potential of up to Rs 200,000 crore after development and the consolidation builds up the company’s ability to execute big projects and thus provides confidence to its investors by ensuring transparency and maximum returns, Gopalakrishnan said. According to the report, the company plans to raise around $800-900 million in the first phase through an initial public offering of about 10-12 percent stake. Further dilutions could follow, taking the total fundraising to around $2 billion. ","cleaned_content":"the shapoorji pallonji group has set up a new holding company shapoorji pallonji real estate spre to consolidate its real estate holdings spread across india and plans to monetise the assets by taking the firm public soon the economic times has reported the company aims to unlock value streamline operations and pave the way for monetisation of a portfolio that includes land parcels spread over \u003cTWO_THOUSAND\u003e acres the assets are worth around \u003cSIX_\u003e billion the report said creating a unified holding company and consolidating assets under this entity is in line with our strategic vision to streamline operations and enhance value creation the report quoted venkatesh gopalakrishnan managing director and chief executive officer of the new entity as saying to drive operational efficiencies and foster greater growth opportunities we are positioning spre to leverage its scale by bringing our diverse real estate portfolio together also read afcons drops loan repayment plan to shapoorji firm after sebi questions use of ipo proceeds spre encompasses the group s entire real estate portfolio of \u003cFOUR_TEN\u003e land parcels and projects the assets are primarily in five major cities mumbai pune bengaluru gurugram and kolkata it also holds large land parcels in mysuru and nagpur the portfolio has a revenue potential of up to rs \u003cTWO_HUNDRED_THOUSAND\u003e crore after development and the consolidation builds up the company s ability to execute big projects and thus provides confidence to its investors by ensuring transparency and maximum returns gopalakrishnan said according to the report the company plans to raise around \u003cEIGHT_HUNDRED\u003e \u003cNINE_HUNDRED\u003e million in the first phase through an initial public offering of about \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e stake further dilutions could follow taking the total fundraising to around \u003cTWO_\u003e billion","timestamp":"2024-08-20T08:17:00+05:30","market_timestamp":"2024-08-20T09:15:00+05:30","off_market_hours":true}