{"url":"https://www.moneycontrol.com/news/business/tata-sons-board-to-soon-appoint-new-members-report-12812836.html","title":"Tata Sons board to soon appoint new members: Report","description":"Top management positions will also need to be filled as Harish Bhat, S Padmanabhan, and Banmali Agrawala have either retired or exited from their executive roles. TV Narendran, CEO of Tata Steel is one of the names which is likely to be considered as group representatives on the board, the report stated.Related stories","content":"Tata Sons may soon appoint new group nominees to its board as some of their current members will soon retire or quit, The Economic Times has reported. Bhaskar Bhat will sign off today after his last scheduled meeting of the committee and Jaguar Land Rover (JLR) director Ralf Speth is likely to step down soon from the post soon, the report added. Moneycontrol couldn't independently verify the report. Top management positions will also need to be filled as Harish Bhat, S Padmanabhan, and Banmali Agrawala have either retired or exited from their executive roles. Bhat has retired, while Agrawala is in an advisory role in Tata Sons. TV Narendran, CEO of Tata Steel, is one of the names which is likely to be considered as group representatives on the board, the report stated. It further said that Noel Tata, chairman of Trent, is another top candidate but his nomination may need Tata Trust approvals. Also Read | Tata Sons clears over Rs 20,000-cr debt to avoid mandatory listing: Report ","cleaned_content":"tata sons may soon appoint new group nominees to its board as some of their current members will soon retire or quit the economic times has reported bhaskar bhat will sign off today after his last scheduled meeting of the committee and jaguar land rover jlr director ralf speth is likely to step down soon from the post soon the report added moneycontrol couldnt independently verify the report top management positions will also need to be filled as harish bhat s padmanabhan and banmali agrawala have either retired or exited from their executive roles bhat has retired while agrawala is in an advisory role in tata sons tv narendran ceo of tata steel is one of the names which is likely to be considered as group representatives on the board the report stated it further said that noel tata chairman of trent is another top candidate but his nomination may need tata trust approvals also read tata sons clears over rs \u003cTWO_TEN_THOUSAND\u003e cr debt to avoid mandatory listing report","timestamp":"2024-09-03T08:54:00+05:30","market_timestamp":"2024-09-03T09:15:00+05:30","off_market_hours":true}