{"url":"https://www.moneycontrol.com/news/business/lt-carves-out-separate-vertical-for-renewable-epc-out-of-transmission-distribution-business-12812085.html","title":"L\u0026T carves out separate vertical for Renewable EPC out of transmission \u0026 distribution business","description":"A. Ravindran, Senior Vice President – Larsen \u0026 Toubro, has been appointed as the Head of Renewable Business.Larsen and ToubroRelated stories","content":"Larsen \u0026 Toubro has carved out a separate business vertical for renewable EPC out of its power transmission and distribution business within its infrastructure projects segment with effect from September 1. Senior Vice-President A Ravindran will lead the renewable business. L\u0026T Chairman and Managing Director SN Subrahmanyan said that the growth of renewable EPC business has accelerated in recent years. \"Thanks to our early start and investments, we have built an organisation that is uniquely placed in the value chain of creating sustainable energy infrastructure. This space is promising. Multiple opportunities are visible. We want to capitalise on our success and wish to remain a preferred partner of choice for our customers. Creation of this vertical will give increased autonomy, customer proximity and leadership oversight to the business and enable us to excel in this space.\" Also Read | L\u0026T eyes green energy, plans to leverage technology and sustainability to create new opportunities L\u0026T's iconic renewable energy projects in India include the 90MW Omkareshwar Floating Solar project commissioned recently, first grid scale solar-cum-storage project, implementation of decentralised distributed generation packages for remote villages and more. L\u0026T green power projects in Middle East L\u0026T is associated with some of the world’s  single-site renewable energy parks. InSaudi Arabia, L\u0026T is a key player involved in major projects, including the 700 MW Ar RassSolar PV IPP, the 2,000 MW Ar Rass-2 Solar PV IPP, and the 1.6 GW Sudair solar plant. On July 8, it announced orders for two more plants with an aggregate capacity of 3.5GWac. Additionally, L\u0026T is advancing renewable infrastructure with a 250 MWp solar PVplant in the Amaala Project and has completed a large-scale solar installation in Jeddah. L\u0026T posted a 12 percent surge in net profit in the first quarter of FY25, slightly below estimates, as the company's revenue from operations rose 15 percent in the April-June quarter. After the announcement, shares of L\u0026T were trading marginally down 0.40 percent at Rs 3689.95 apiece on September 2 at 12:13pm. ","cleaned_content":"larsen toubro has carved out a separate business vertical for renewable epc out of its power transmission and distribution business within its infrastructure projects segment with effect from september \u003cONE_\u003e senior vice president a ravindran will lead the renewable business l t chairman and managing director sn subrahmanyan said that the growth of renewable epc business has accelerated in recent years thanks to our early start and investments we have built an organisation that is uniquely placed in the value chain of creating sustainable energy infrastructure this space is promising multiple opportunities are visible we want to capitalise on our success and wish to remain a preferred partner of choice for our customers creation of this vertical will give increased autonomy customer proximity and leadership oversight to the business and enable us to excel in this space also read l t eyes green energy plans to leverage technology and sustainability to create new opportunities l ts iconic renewable energy projects in india include the \u003cNINE_TEN\u003e mw omkareshwar floating solar project commissioned recently first grid scale solar cum storage project implementation of decentralised distributed generation packages for remote villages and more l t green power projects in middle east l t is associated with some of the world s single site renewable energy parks insaudi arabia l t is a key player involved in major projects including the \u003cSEVEN_HUNDRED\u003e mw ar rasssolar pv ipp the \u003cTWO_THOUSAND\u003e mw ar rass \u003cTWO_\u003e solar pv ipp and the \u003cONE_\u003e gw sudair solar plant on july \u003cEIGHT_\u003e it announced orders for two more plants with an aggregate capacity of \u003cTHREE_\u003e gwac additionally l t is advancing renewable infrastructure with a \u003cTWO_HUNDRED\u003e mwp solar pvplant in the amaala project and has completed a large scale solar installation in jeddah l t posted a \u003cONE_TEN_PERCENT\u003e surge in net profit in the first quarter of fy25 slightly below estimates as the companys revenue from operations rose \u003cONE_TEN_PERCENT\u003e in the april june quarter after the announcement shares of l t were trading marginally down \u003cZERO_PERCENT\u003e at rs \u003cTHREE_THOUSAND\u003e apiece on september \u003cTWO_\u003e at \u003cONE_TEN\u003e \u003cONE_TEN\u003e pm","timestamp":"2024-09-02T12:28:00+05:30","market_timestamp":"2024-09-02T12:28:00+05:30","off_market_hours":false}